[{"_id": "SJLd3smqtretrs8TP", "postedAt": "2022-11-15T21:21:08.316Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>\"Ben Delo's involvement with EA just quietly stopped being talked about without any kind of public reflection on what could be done better moving forwards.\"</p><p>\"Failing to share information because you suspect it will make me less supportive or more critical of your views, decisions, or actions smells of overconfidence and makes you difficult to trust, and this has regularly happened to me in my engagement with EA.\"</p><p>Yes, exactly. Thank you! EA Berkeley had to remove their <i>leader</i> just two years ago, for reasons that <i>none</i> of the membership there is willing to even mention - which makes it sound particularly bad, which means that 'the fact that EA is keeping that bad stuff hidden' is even worse.</p><p>Similarly, EA Berkeley members were targeted by a higher-up for blacklisting, and mentioned such in emails to me, only to go silent on the matter until I brought-up the blacklisting as an issue on their slack. At that point, they mentioned that \"we've been in private talks with the Blacklister, asking them to stop their behavior\" - <i>nothing</i> &nbsp;public until absolutely necessary.</p><p>The EA houses in Berkeley, who are a magnet for EA Berkeley campus members to move-into (most residents are post-grads who were EA Berkeley prior to graduation and moving into the EA house), had repeatedly splurged unnecessarily, and when I pointed this out, the near-universal response on the EA Berkeley slack was 'well, that's them, not us. We're not responsible for anyone else in our org if they're committing petty fraud.' The slack poster Charles He even suggested that I be banned from their slack, for 'disrupting' things by bringing-up their bad behavior!</p><p>EA definitely has a brand they're protecting, and other posters seem to be bumping into other icky spots under the surface, too! (https://forum.effectivealtruism.org/posts/eoLwR3y2gcZ8wgECc/hubris-and-coldness-within-ea-my-experience) &amp; \"Power dynamics: What procedures exist for protecting parties in asymmetric power relationships? Are there adequate opportunities for anonymous complaints or concerns to be raised? How are high-status individuals held accountable in the event of wrongdoing?\" from (https://forum.effectivealtruism.org/posts/sEpWkCvvJfoEbhnsd/the-ftx-crisis-highlights-a-deeper-cultural-problem-within)</p><p>Further: when I have posted new ideas on this forum, I was repeatedly strawmanned by EA members until other members eventually pointed-out that I was being strawmanned, and those who did so never admitted and apologized; they just downvoted every comment I made, as a team. EA protects the trolls who downvote-mafia and misrepresent, while looking for reasons to exclude 'non-aligned views'.</p><p>I also wonder about the hiring for AI Safety, here in the Bay: after talking to people who struggled to get hired as a PA in AI Safety, despite a background in CS and an interest in AI and safety for 5 years... while a pretty girl with a psych background got hired as PA immediately, multiple offers? It sounds like the nerds at Berkeley are hoping to hire-in a Bankman-sized polycule as PAs.</p>", "parentCommentId": null, "user": {"username": "Anthony Repetto"}}, {"_id": "wH6A3Z2kxNgiRyAEW", "postedAt": "2022-11-15T21:34:12.419Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<blockquote><p>I also wonder about the hiring for AI Safety, here in the Bay: after talking to people who struggled to get hired as a PA in AI Safety, despite a background in CS and an interest in AI and safety for 5 years... while a pretty girl with a psych background got hired as PA immediately, multiple offers? It sounds like the nerds at Berkeley are hoping to hire-in a Bankman-sized polycule as PAs.</p></blockquote><p>Please don't assume a woman only got a job as a PA because she is pretty rather than anything to do with her skills. A CS background vs a psych background is a very weak case for making this assumption and I think you should err against this type of reasoning in any case given how insulting it is.</p><p>Especially given your final sentence (I don't think I even need to explain how that one is extremely rude and unnecessary).</p>", "parentCommentId": "SJLd3smqtretrs8TP", "user": null}, {"_id": "im72BP6fFFmqBDuJi", "postedAt": "2022-11-15T21:59:56.546Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Really interesting post! Thanks for sharing, I was wondering what the university pitches were like. And I had no clue about Ben Delo.&nbsp;</p>", "parentCommentId": null, "user": {"username": "skerple"}}, {"_id": "y4pwMnDq7SGrJ3Lms", "postedAt": "2022-11-15T22:15:22.820Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I agree with the central thrust of this post, and I'm really grateful that you made it. This might be the single biggest thing I want to change about EA leaders' behavior. And relatedly, I think \"be more candid, and less nervous about PR risks\" is probably the biggest thing I want to change about rank-and-file EAs' behavior. Not because the risks are nonexistent, but because trying hard to avoid the risks via not-super-honest tactics tends to cause more harm than benefit. It's the wrong general policy and mindset.</p><blockquote><p>Q: Is your approach utilitarian? A: It's utilitarian flavoured.</p></blockquote><p>This seems like an unusually good answer to me! I'm impressed, and this updates me positively about Ben Todd's honesty and precision in answering questions like these.</p><p>I think a good description of EA is \"the approach that behaves sort of like utilitarianism, when decisions are sufficiently high-stakes and there aren't ethical injunctions in play\". I don't think utilitarianism is <i>true</i>, and it's obvious that many EAs aren't utilitarians, and obvious that utilitarianism isn't required for working on EA cause areas, or for being quantitative, systematic, and rigorous in your moral reasoning, etc. Yet it's remarkable how often our prescriptions look like the prescriptions of utilitarianism anyway.</p><p>I don't know of any better compact way of describing EA's moral perspective than \"we endorse role-playing utilitarianism (at least when the stakes are high and there aren't relevant deontology-ish prohibitions)\". And I think it's good and wholesome when EAs don't try to distance themselves from utilitarianism (given how useful it is as a way of summarizing a ton of different moral views we tend to endorse), but also don't oversimplify our relationship to utilitarianism.</p><blockquote><p>it raises questions about Will's unadvertised relationship with a controversial public figure, and one who founded a wildly successful AI Capabilities Research Lab.</p></blockquote><p>I agree that it was a terrible idea to found OpenAI, and reflects very poorly on Musk (especially given the stated reasoning at the time).</p><p>I think it's an awful idea to require every EA who's ever sent text messages to someone in Musk's reference class (or talked to him at a party, etc.) to publicly disclose the fact that they chatted. I don't see the point -- is the idea that talking to Elon Musk somehow taints you as a person?</p><p>Various MIRI staff have had conversations with Elon Musk in the past, and the idea that this fact is scandalous just sounds silly to me. I'd be more scandalized if EAs <i>didn't </i>talk to people like Musk, given the opportunity. (Or Bill Gates, or Demis Hassabis, or Barack Obama, etc.)</p><p>On some level I just think your whole framing here -- 'oh no, an EA talked to a Controversial Public Figure!' -- is misguided. \"Controversial\" is a statement about what's popular, not about what's true or good. I think that the impulse to avoid interacting in any way with people who seem Controversial <i>is the same impulse that's behind the misguided behavior the rest of your post is talking about</i>. It's the mindset of cancel culture, of guilt-by-association, of 'there's something unwholesome about talking to the Other Side at all, even to try to convince them to come around to doing the right thing'.</p><p>If we think that someone is doing the Wrong Thing, then by default we should <i>talk to them</i> and try to convince them to do things differently. EAs should primarily just be advocating for what they think is true and good, in a clear and honest voice, not playing the Six Degrees of PR Contagion game.</p><blockquote><p>Furthermore, Will's tweet here about WWOTF implied to me that he didn't know Elon personally: <a href=\"https://twitter.com/willmacaskill/status/1554378994765574144.\">https://twitter.com/willmacaskill/status/1554378994765574144.</a></p></blockquote><p>Which part implied that to you? I don't see Will lying about this, and I don't see how it matters for the thread whether Will and Elon ever send each other text messages, or whether Will tries to get Elon's buy-in on a project.</p><p>AFAIK lots of EAs have tried to get Elon to help with (or ditch!) various projects over the years, though I'm unimpressed with the results.</p><blockquote><p>I was pretty alarmed by this thread from Kerry Vaughan which touches on Ben Delo, a major EA donor prior to SBF with a fraud conviction: <a href=\"https://twitter.com/KerryLVaughan/status/1591508697372663810\">https://twitter.com/KerryLVaughan/status/1591508697372663810</a>. The implication here is that Ben Delo's involvement with EA just quietly stopped being talked about without any kind of public reflection on what could be done better moving forwards.&nbsp;</p></blockquote><p>I'd still like more detail about <a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx?commentId=sqoejL8DAytSEqp7n\">what actually happened there</a>, before I assume Kerry's account is correct. Various other recent Kerry-claims have turned out to be false or exaggerated, though I can't say I'm <i>surprised</i> if EAs responded super weirdly to the Ben Delo thing.</p>", "parentCommentId": null, "user": {"username": "RobBensinger"}}, {"_id": "xgEyGf8MQLanbbbAY", "postedAt": "2022-11-15T22:41:10.453Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I was really confused by all your downvotes. Until I read your last paragraph</p>\n", "parentCommentId": "SJLd3smqtretrs8TP", "user": {"username": "Pseudaemonia"}}, {"_id": "kFkprifPeCF2gnhSF", "postedAt": "2022-11-15T22:58:37.175Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Well, there's a simple empirical measure, rather than relying on whether an argument is approved-of or not: Do any of them date? Are they hoping to keep that fact hidden?</p>", "parentCommentId": "wH6A3Z2kxNgiRyAEW", "user": {"username": "Anthony Repetto"}}, {"_id": "nB9bGSa3kkkGcMsF7", "postedAt": "2022-11-15T23:07:30.015Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I'd also like to ask clarification about your last sentence: I said 'nerds', and that may be what you found particularly offensive, there; or, that I hypothesize that men in those organizations are hiring hoping for a date? I am not attempting to 'blame a woman' for getting a job, by the way - I am pointing to the people who are doing the <i>hiring</i> for potentially selfish reasons.</p>", "parentCommentId": "wH6A3Z2kxNgiRyAEW", "user": {"username": "Anthony Repetto"}}, {"_id": "sC39MBdiX3LdANBW5", "postedAt": "2022-11-15T23:10:26.745Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Does that absolve EA of the other points? Finding a flaw with the speaker or one of their points, to ignore the rest of the argument, seems to be a pattern amongst forum-commenters &nbsp;here - followed by mass downvotes.</p>", "parentCommentId": "xgEyGf8MQLanbbbAY", "user": {"username": "Anthony Repetto"}}, {"_id": "KBkQEETbZKtc2A9ie", "postedAt": "2022-11-15T23:17:52.243Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>It's our way of saying, \"Come back and talk to us when you're ready to behave decently.\"</p>", "parentCommentId": "sC39MBdiX3LdANBW5", "user": null}, {"_id": "5fBRcxGqXDkHwGXDq", "postedAt": "2022-11-15T23:27:05.357Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Behaving decently is nice; that doesn't remove the point I was asking about: ignoring the other arguments I brought-up. It seems, repeatedly, that the call of appropriateness is used to ignore the substance of the other arguments; which continues to be the case, in this thread.</p>", "parentCommentId": "KBkQEETbZKtc2A9ie", "user": {"username": "Anthony Repetto"}}, {"_id": "HyXWFa5uAS7WnrxXN", "postedAt": "2022-11-15T23:30:05.973Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>In other threads, my arguments were repeatedly misrepresented or unaddressed, while comments consisted of 'we shouldn't fund this, it's not appropriate' when I specified at the outset that I was not seeking funding; 'this should be posted somewhere else', etc. And only in a few instances, out of dozens of responses, have EA commenters addressed the <i>substance </i>of what I wrote.</p>", "parentCommentId": "5fBRcxGqXDkHwGXDq", "user": {"username": "Anthony Repetto"}}, {"_id": "ndgDF54XAXFtSEbcG", "postedAt": "2022-11-15T23:34:20.358Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<blockquote><p>Furthermore, Will's tweet here about WWOTF implied to me that he didn't know Elon personally: <a href=\"https://twitter.com/willmacaskill/status/1554378994765574144.\">https://twitter.com/willmacaskill/status/1554378994765574144</a></p><p>--</p><p>Which part implied that to you?</p></blockquote><p>Presumably the part where Will says \"So, er, it seems that Elon Musk just tweeted about What We Owe The Future. Crazy times!\" I agree that this is not something you'd say about someone you knew to the extent that Will knew Elon to the extent shown by the Signal messages, unless you were trying to obscure this fact. &nbsp;</p><p>Elon was keynote speaker at EA Global 2015, so would have known Will since then.</p>", "parentCommentId": "y4pwMnDq7SGrJ3Lms", "user": {"username": "wock"}}, {"_id": "sDsqPK9cHjEKvx58k", "postedAt": "2022-11-15T23:37:54.905Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Okay I'll address the rest of the argument. You're also not giving a lot of context. It's hard to understand but based on your whole comment I can also see it being possible that you bumped into situations where people were trying to sort out interpersonal issues privately, and you got wind of it and tried to make it public.&nbsp;</p><p>There is a world of difference between those situations and situations where people are not <i>intellectually</i> honest, which is most of the situations OP describes and discusses.</p><p>And it makes the last part of your comment even more uncalled for.</p>", "parentCommentId": "sC39MBdiX3LdANBW5", "user": {"username": "nongiga"}}, {"_id": "wn6xpweE8LsKnFr9t", "postedAt": "2022-11-15T23:44:11.035Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I just re-read your comment and I can understand your frustration more now. Maybe I was too harsh and blunt, my apologies. I think it's totally fair for people to not want to engage with someone until they stop being so rude. But if this happens nearly every time you say the slightest thing wrong, that seems like a problem. (For my part, I often just comment on one part of a comment/post when I don't feel I have much to add regarding the other parts. I didn't mean to imply that the other parts aren't worth people engaging with simply because you were rude in one part. But as I said, I do understand why they might not want to.)</p>", "parentCommentId": "5fBRcxGqXDkHwGXDq", "user": null}, {"_id": "R4aiuxSapk5M27Kuf", "postedAt": "2022-11-15T23:46:10.555Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>\"I can also see it being possible that you bumped into situations where people were trying to sort out interpersonal issues privately, and you got wind of it and tried to make it public.\"</p><p>Thank you for responding! And, no, that is not accurate. The leader of EA Berkeley was ousted; that's not an 'interpersonal issue, privately'. That's the organization wanting to protect a brand by leaving their problems unmentioned, which is exactly the dishonesty part. I believe I've rebutted your argument - unless you have more to add?</p><p>Additionally, I understand if you took offense that I said 'nerd' - I'm happy to apologize to anyone in the Berkeley group who was offended or hurt, in person, with anyone else present they wish. Unfortunately, with Bankman's incestuous corporate structure updating my assumptions, I do believe it is right to ask: are they dating their PAs? That's a question for internal review, privacy, yet the statistical results should be public.</p><p>Thank you again for engaging with a rebuttal!</p>", "parentCommentId": "sDsqPK9cHjEKvx58k", "user": {"username": "Anthony Repetto"}}, {"_id": "BZ4g8NcrwafHLSbAL", "postedAt": "2022-11-15T23:54:47.365Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Thank you! You are welcome to check - the dismissals had begun, in multiple threads, before a peep from me; they were the initial replies. I became hot in response, only then, which your forum abhors - and I understand that I am downvoted for it! I don't expect you to give me a soap-box in your living room, when I keep offending you.</p><p>I can also drop my guise, which I understand if you find doubly offensive: a troll-trap.</p><p>After being misrepresented repeatedly, this time I intentionally included the word 'nerd', to see if that would be enough to ignore the other points - YET! I didn't expect that you would take my critique of hiring as a strike against the woman, who is a thoughtful and diligent member of your community, and would definitely do an excellent job assisting! I'm glad to speak in her favor - the question was why, with her quick hire, others languished in comparison? And I pointed to the risk of men in power pulling a 1950's-style 'I get $90k as researcher, and I date my $50k secretary'. THAT is where my heart-strings leapt to shout!</p>", "parentCommentId": "wn6xpweE8LsKnFr9t", "user": {"username": "Anthony Repetto"}}, {"_id": "N7sekpmf3knJjY2FB", "postedAt": "2022-11-15T23:57:05.889Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<blockquote><p>Unfortunately, with Bankman's incestuous corporate structure updating my assumptions, I do believe it is right to ask: are they dating their PAs?</p></blockquote><p>So are you saying that because people at a company that donated a lot of money to EA causes seem to have dated each other in ways that caused conflicts of interest, it's right for you to ask on a public forum: Did this woman only get a PA job working for EAs in Berkeley because she's dating the person who hired her?</p>", "parentCommentId": "R4aiuxSapk5M27Kuf", "user": null}, {"_id": "T44LFeu7aTe4sX8tv", "postedAt": "2022-11-16T00:46:06.346Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Oh, no - not 'because-dating-already', nor as a favor, nor her aspiring to use beauty, or being unqualified. Rather, if people <i>doing</i> the hiring are selecting among excellent candidates, yet their selection favors people who those same authorities hope to try dating. It's the hirer, not the one hired, who I call into question; as I said originally \"hoping to hire-in\" which places agency and blame with those being biased in their hiring.</p><p>Also, I don't expect a flat 'gender disparity' to be indicative of this sort of hiring - rather, internal measure of co-worker and boss relationships would show if the social graph is incestuous. And, though it isn't reasonable to say \"the funder of a charity was hiring inappropriately, so the charity must also be doing so,\" - and, at the same time, \"a bunch of young college kids with money who all live and hang out together, dating each other,\" is the shared characteristic that I argue warrants inclusion of that risk.</p>", "parentCommentId": "N7sekpmf3knJjY2FB", "user": {"username": "Anthony Repetto"}}, {"_id": "DDB5qu6ENJpiaapym", "postedAt": "2022-11-16T00:54:32.029Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Respectfully, I have to disagree that most of these examples are any reason to distrust communications from EA. Someone has already addressed Ben Todd's answer on whether EA is utilitarian (saying it's utilitarian-ish is the most accurate answer, it's not deceptive), so I'll comment on the career advice you saw:</p><blockquote><p>Philosophy, but also not Philosophy?</p><p>I took a look at global priorities research. It was one of five top-recommended career paths on 80K's website and required researchers in philosophy. 80K website at time of writing:</p></blockquote><blockquote><p>&gt; In general, for foundational global priorities research the best graduate subject is an economics PhD. The next most useful subject is philosophy</p></blockquote><blockquote><p>This article contrasts sharply with the 80K page on philosophy:</p><p>&gt; the academic job market for philosophy is extremely challenging. Moreover, the career capital you acquire working toward a career in philosophy isn’t particularly transferable. For these reasons we currently believe that, for the large majority of people who are considering it, pursuing philosophy professionally is unlikely to be the best choice.</p><p>It seems like there are significant risks to pursuing further study in philosophy that 80K are well aware of, and it does not look great that they mention them in the context of general philosophical research (that they presumably don't care about their readers pursuing) but omit them when discussing a career path they are eager for their readers to pursue. Spending 7 years getting a philosophy PhD because you want to research global priorities and then failing to find a position (the overwhelmingly likely outcome) does not sound like much fun.</p><p>This is a particularly clear example of a more general experience I've had with 80K material, namely being encouraged to make major life choices without an adequate treatment of the risks involved. I think readers deserve this information upfront.</p></blockquote><p>They aren't being dishonest here, they're answering two different questions. The first page says that the best background for global priorities research, one of their most-recommended career options, is economics followed by philosophy. The second page, on philosophy as a career path, correctly points out that the job market for philosophy is very challenging. They're not telling lots of people they should go into philosophy in the hopes that some of them will then do global priorities research. They're saying you should <i>not</i> do philosophy, but if you did, then global priorities research is a highly valuable thing your background would be suitable for, which I'd say are good recommendations all around.</p>", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "YpeToCWgNRdZEwmgC", "postedAt": "2022-11-16T01:00:55.217Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Ah, I guess you're saying that the \"Crazy times!\" part sounds starstruck and &nbsp;has a vibe of \"this just occurred out of the blue\", and it would be weird to sound starstruck and astounded if Elon's someone you talk to all the time and are good friends with?</p><p>I agree that would be a bit weird, though the Will-text-messages I saw didn't cause me to think Will and Elon are <i>that</i> close, just that they've exchanged words and contact info at all. (Maybe I missed some text messages that do suggest a closer relationship?)</p>", "parentCommentId": "ndgDF54XAXFtSEbcG", "user": {"username": "RobBensinger"}}, {"_id": "FKqxhbbWDXxCcZMkq", "postedAt": "2022-11-16T01:32:45.036Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>We <a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx?commentId=sqoejL8DAytSEqp7n\">still don't have a clue about Ben Delo</a>, afaik.</p>", "parentCommentId": "im72BP6fFFmqBDuJi", "user": {"username": "EliezerYudkowsky"}}, {"_id": "EAonJ67t4ogzauXxj", "postedAt": "2022-11-16T03:27:49.282Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Here are the less contentious parts, I hope?</p><p>\"Ben Delo's involvement with EA just quietly stopped being talked about without any kind of public reflection on what could be done better moving forwards.\"</p><p>\"Failing to share information because you suspect it will make me less supportive or more critical of your views, decisions, or actions smells of overconfidence and makes you difficult to trust, and this has regularly happened to me in my engagement with EA.\"</p><p>Yes, exactly. Thank you! EA Berkeley had to remove their <i>leader</i> just two years ago, for reasons that <i>none</i> of the membership there is willing to even mention - which makes it sound particularly bad, which means that 'the fact that EA is keeping that bad stuff hidden' is even worse.</p><p>Similarly, EA Berkeley members were targeted by a higher-up for blacklisting, and mentioned such in emails to me, only to go silent on the matter until I brought-up the blacklisting as an issue on their slack. At that point, they mentioned that \"we've been in private talks with the Blacklister, asking them to stop their behavior\" - <i>nothing</i> &nbsp;public until absolutely necessary.</p><p>The EA houses in Berkeley, who are a magnet for EA Berkeley campus members to move-into (most residents are post-grads who were EA Berkeley prior to graduation and moving into the EA house), had repeatedly splurged unnecessarily, and when I pointed this out, the near-universal response on the EA Berkeley slack was 'well, that's them, not us. We're not responsible for anyone else in our org if they're committing petty fraud.' The slack poster Charles He even suggested that I be banned from their slack, for 'disrupting' things by bringing-up their bad behavior!</p><p>EA definitely has a brand they're protecting, and other posters seem to be bumping into other icky spots under the surface, too! (https://forum.effectivealtruism.org/posts/eoLwR3y2gcZ8wgECc/hubris-and-coldness-within-ea-my-experience) &amp; \"Power dynamics: What procedures exist for protecting parties in asymmetric power relationships? Are there adequate opportunities for anonymous complaints or concerns to be raised? How are high-status individuals held accountable in the event of wrongdoing?\" from (https://forum.effectivealtruism.org/posts/sEpWkCvvJfoEbhnsd/the-ftx-crisis-highlights-a-deeper-cultural-problem-within)</p><p>Further: when I have posted new ideas on this forum, I was repeatedly strawmanned by EA members until other members eventually pointed-out that I was being strawmanned, and those who did so never admitted and apologized; they just downvoted every comment I made, as a team. EA protects the trolls who downvote-mafia and misrepresent, while looking for reasons to exclude 'non-aligned views'.</p>", "parentCommentId": null, "user": {"username": "Anthony Repetto"}}, {"_id": "6jy79EgwSygKcmfmu", "postedAt": "2022-11-16T03:30:49.678Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Upvoted. I think these are all fair points.&nbsp;</p><p>I agree that 'utilitarian-flavoured' isn't an inherently bad answer from Ben. My internal reaction at the time, perhaps due to how the night had been marketed, was something like 'ah he doesn't want to scare me off if I'm a Kantian or something', and this probably wasn't a charitable interpretation.</p><p>On the Elon stuff, I agree that talking to Elon is not something that should require reporting. I think the shock for me was that I saw Will's tweet in August, which as wock agreed implied to me they didn't know each other, so when I saw the signal conversation I felt misled and started wondering how close they actually were. That said I had no idea Elon was an EAG keynote speaker, which is obviously public knowledge and makes the whole thing a lot less suspicious. I would also remove the word 'controversial' if I was to write this again, and that I think Elon's done harm re: AI, as I agree it's not relevant to the point I'm trying to make.</p>", "parentCommentId": "YpeToCWgNRdZEwmgC", "user": {"username": "tcelferact"}}, {"_id": "iZRAwharMR5nkb6oj", "postedAt": "2022-11-16T03:53:51.433Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I think you're correct that they aren't being dishonest, but I disagree that the discrepancy is because 'they're answering two different questions'.&nbsp;</p><p>If 80K's opinion is that a Philosophy PhD is probably a bad idea for most people, I would still expect that to show up in the Global Priorities information. For example, I don't see any reason they couldn't write something like this:</p><blockquote><p>In general, for foundational global priorities research the best graduate subject is an economics PhD. The next most useful subject is philosophy ... but the academic job market for philosophy is extremely challenging, and the career capital you acquire working toward a career in philosophy isn’t particularly transferable. For these reasons, we strongly recommend approaching GPR via economics instead of philosophy unless you are a particularly gifted philosopher and comfortable with a high risk of failure...</p></blockquote><p>Maybe I'm nitpicking, as you say it is mentioned on the 'philosophy academia' page. I was trying to draw attention to a general discomfort I have with the site that it seems to underemphasise risk of failure, but perhaps I need to find a better example!</p>", "parentCommentId": "DDB5qu6ENJpiaapym", "user": {"username": "tcelferact"}}, {"_id": "TQkNSK98puFtn9Gik", "postedAt": "2022-11-16T04:27:50.636Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>A trick: You can say things like \"I'm going to tell you an oversimplified story, but we can dig into the details later if you want\" or even \"Here's one perspective of what EA is which I hope will provide a good entry point. My perspective is different, but I can tell you about it later\".</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "5kucKoX6jEAhMyuGb", "postedAt": "2022-11-16T04:34:36.409Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>The BitMEX indictment is here: <a href=\"https://www.justice.gov/usao-sdny/pr/founders-and-executives-shore-cryptocurrency-derivatives-exchange-charged-violation#_ftn1\">https://www.justice.gov/usao-sdny/pr/founders-and-executives-shore-cryptocurrency-derivatives-exchange-charged-violation#_ftn1</a></p><p>The government's indictment shouldn't be treated as the \"truth,\" of course, but the facts are damning and extremely shady - these guys were claiming they were operating a foreign entity for non-US citizens (to trade crummy crypto derivatives), but they were actually doing it from an office in Manhattan and selling to people in the US and helping them conceal it. They also made sure that BitMEX skirted the rules to prevent money laundering, which is, of course, a huge portion of crypto transactions.</p><p>So yeah. Hard to argue it's just some minor compliance issue. At the sentencing the defense lawyers argued that it \"wasn't as bad as Silk Road\" - which, big whoop. The defendants pleaded guilty, the company was fined hundreds of millions of dollars, and Delo had to pay a $10 million fine, which is substantial.&nbsp;</p><p>IS it the worst thing ever? No, but this guy clearly plays fast and loose with ethics and does a super shady kind of business.</p>", "parentCommentId": "FKqxhbbWDXxCcZMkq", "user": {"username": "skerple"}}, {"_id": "bsJ5txoEKK9RakqZw", "postedAt": "2022-11-16T04:49:04.777Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I am broadly glad more concerns are coming out and more information is being shared. But I think that the following attitude makes things worse rather than better:</p><blockquote><p>with rumours of secret Google docs and WhatsApp groups in which the leaders of the movement discuss how to position themselves and how to hide their more controversial views or make them seem palatable</p></blockquote><p>Every organization and movement has private docs and group chats. That's normal and good for the same reason it is normal and good for people to have private thoughts. Banning organizations from having private discussions makes everyone dumber and less competent.</p><p>This description could be anything from \"muahaha, how do we trick the rubes into funding our math contest\" to \"what among our interests is most relevant to this group?\" We might make guesses from their public actions, but we could make those anyway. The fact that an org doesn't publish every single document isn't nefarious.</p>", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "P3jHXcKpB7tDBN5Gm", "postedAt": "2022-11-16T04:49:21.048Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I wish I lived in a society where this question was not necessary, but: &nbsp;Was this a \"victimless crime\"; else, who were the victims and what did they lose?</p>", "parentCommentId": "5kucKoX6jEAhMyuGb", "user": {"username": "EliezerYudkowsky"}}, {"_id": "KRK2JA8LB7qvHgX5Y", "postedAt": "2022-11-16T05:06:24.920Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>EAs and Musk have lots of connections/interactions -- e.g., Musk is thanked in the acknowledgments of Bostrom's 2014 book <i>Superintelligence</i> for providing feedback on the draft of the book. Musk attended FLI's Jan 2015 Puerto Rico conference. Tegmark apparently argues with Musk about AI a bunch at parties. Various Open Phil staff were on the board of OpenAI at the same time as Musk, before Musk's departure. Etc.</p>", "parentCommentId": "6jy79EgwSygKcmfmu", "user": {"username": "RobBensinger"}}, {"_id": "WmBbNSSL7cH3Hds4y", "postedAt": "2022-11-16T05:08:27.718Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I don't think itwas a victimless crime. I guess you may have different ideas about white collar crime and money laundering. But you'll have to read the indictment to form your own opinion. You can also read the civil suit filed by investors who allege they were screwed out of millions: <a href=\"https://t.co/SKI7JXPVFM\">https://t.co/SKI7JXPVFM</a>&nbsp;</p><p>When they tried get their money back, Delo taunted them with a meme about being incorporated in the Seychelles (despite, again, actually being based in the US doing business with US customers). Really does not seem like an upstanding guy.</p><p>But check them out for yourself.</p>", "parentCommentId": "P3jHXcKpB7tDBN5Gm", "user": {"username": "skerple"}}, {"_id": "FtGsxA9dG5TZNvMj2", "postedAt": "2022-11-16T05:14:35.764Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>(the plaintiffs in that suit ended up getting $44 million, by the way)</p>", "parentCommentId": "WmBbNSSL7cH3Hds4y", "user": {"username": "skerple"}}, {"_id": "9vMNdawGiBECHetrX", "postedAt": "2022-11-16T05:16:55.507Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I argue that EA orgs should self-censor / do PR spin less, but I agree that private docs and chats are good.</p><p>I want to argue my case to EA orgs and then have them feel free to debate the pros and cons of candor in private! I don't want them to feel pressured to hide or distort their thought process even in within-org conversations; it has to be OK to float impolitic ideas, so they can be genuinely evaluated. Heck, it has to be OK to defend both \"be less honest\" and \"be more honest\" positions, so that both positions can get a fair hearing.</p>", "parentCommentId": "bsJ5txoEKK9RakqZw", "user": {"username": "RobBensinger"}}, {"_id": "sJ6oaTLvkgJkPcSa7", "postedAt": "2022-11-16T05:26:36.168Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>If it's as the plaintiffs represent, I agree that's pretty damning. &nbsp;Is it known, aside from the complaint itself, that the plaintiffs are telling the truth and the whole truth? &nbsp;Don't suppose you have a link to the meme taunt?</p>", "parentCommentId": "WmBbNSSL7cH3Hds4y", "user": {"username": "EliezerYudkowsky"}}, {"_id": "GA9GZaFiu2tjXbGdd", "postedAt": "2022-11-16T05:38:36.867Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Yes, it's in the complaint, here's a screenshot (where the CEO also talks about it being easier to bribe officials in the Seychelles with \"a coconut\": <a href=\"https://i.imgur.com/qd6X4LC.png\">https://i.imgur.com/qd6X4LC.png</a></p><p>I don't know anything about the plaintiffs, but I assume BitMEX's lawyers certainly thought a jury would find them credible, and that's why they decided to settle for $44M.</p>", "parentCommentId": "sJ6oaTLvkgJkPcSa7", "user": {"username": "skerple"}}, {"_id": "iTcxSGHyDeH7rHX43", "postedAt": "2022-11-16T05:47:41.193Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Okay; I agree then that it's reasonable to say of Ben Delo that Hayes and cofounders were accused of trying to defraud two early investors, that Ben Delo is accused of taunting them with a meme, and that they settled out of court.</p><p>I do note that this is pretty different from what Vaughan was previously accusing Delo of, which sounded pretty plausibly like a \"victimless crime\".</p>", "parentCommentId": "GA9GZaFiu2tjXbGdd", "user": {"username": "EliezerYudkowsky"}}, {"_id": "Xx2c7od9BNdpYhnhR", "postedAt": "2022-11-16T06:09:03.719Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Again, that's just one of the civil suits. They settled that civil suit, were found liable in another, and Delo also pleaded guilty to federal charges after BitMEX was used to launder stolen crypto.</p><p>Not good! And if that's the person you've been publicly celebrating for contributing to your org, it's not permissible to sweep it under the rug afterwards just because it's not as high profile as something like, say, SBF's fraud.</p>", "parentCommentId": "iTcxSGHyDeH7rHX43", "user": {"username": "skerple"}}, {"_id": "5gKrJmwougnSmG7Bm", "postedAt": "2022-11-16T06:16:01.445Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I don't, in fact, take federal charges like that seriously - I view it as a case of living in a world with bad laws and processes - but I do take seriously the notion of betraying an investor's investment and trust.</p>", "parentCommentId": "Xx2c7od9BNdpYhnhR", "user": {"username": "EliezerYudkowsky"}}, {"_id": "rLJKTvEdtJonbXWyv", "postedAt": "2022-11-16T08:03:42.107Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Yeah that's a good distinction- even if a decision should very clearly be public, it doesn't automatically follow that the decision making process should be.</p>", "parentCommentId": "9vMNdawGiBECHetrX", "user": {"username": "Elizabeth"}}, {"_id": "wHKogf9Kn6dnqsN74", "postedAt": "2022-11-16T12:19:35.952Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Hey, Arden from 80k here -</p>\n<p>It'd take more looking into stuff/thinking to talk about the other points, but I wanted to comment on something quickly: thank you for pointing out that the philosophy phd career profile and the competitiveness of the field wasn’t sufficiently highlighted on the GPR problem profile . We’ve now added a note about it in the \"How to enter\" section.</p>\n<p>I wrote the career review when I'd first started at 80k, and for me it was just an oversight not to link to it and its points more prominently on the GPR problem profile.</p>\n", "parentCommentId": null, "user": {"username": "Ardenlk"}}, {"_id": "Krcyrn5khRDLJMfzi", "postedAt": "2022-11-16T16:55:51.183Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Thanks Arden! I should probably have said it explicitly in the post, but I have benefited a huge amount from the work you folks do, and although I obviously have criticisms, I think 80K's impact is highly net-positive.</p>", "parentCommentId": "wHKogf9Kn6dnqsN74", "user": {"username": "tcelferact"}}, {"_id": "Zo7uxyNGEnbDv4Yzo", "postedAt": "2022-11-16T16:57:23.900Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I agree that private docs and group chats are totally fine and normal. The bit that concerns me is 'discuss how to position themselves and how to hide their more controversial views or make them seem palatable', which seems a problematic thing for leaders to be doing in private. (Just to reiterate I have zero evidence for or against this happening though.)</p>", "parentCommentId": "rLJKTvEdtJonbXWyv", "user": {"username": "tcelferact"}}, {"_id": "k5WNKrasYRkL7tPzy", "postedAt": "2022-11-16T19:32:15.233Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Nice! I should have mentioned somewhere: the 80K website is <i>huge</i> and has tons of articles on partly-overlapping topics, written over many years by a bunch of different people. If there's an inconsistency, my first guess would have been that one of the articles is out-of-date or they're just different perspectives at 80K that no one noticed need to be brought into contact to hash out who's right.</p>", "parentCommentId": "wHKogf9Kn6dnqsN74", "user": {"username": "RobBensinger"}}, {"_id": "NEQjBEFG4Xxie6naD", "postedAt": "2022-11-16T19:35:13.280Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>I think it's good to discuss those topics internally at all, though I agree with you that EAs should generally stop hiding their controversial views (at least insofar as these are important for making decisions about EA-related topics), and I think we should be more cautious about optimizing for palatability (exactly because it can be hard to do this much without misleading people).</p>", "parentCommentId": "Zo7uxyNGEnbDv4Yzo", "user": {"username": "RobBensinger"}}, {"_id": "aHfMbNueHAZhfXMif", "postedAt": "2022-11-16T23:13:10.317Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>That's kind of you to say : )</p>\n", "parentCommentId": "Krcyrn5khRDLJMfzi", "user": {"username": "Ardenlk"}}, {"_id": "CvsfNWerXcGtCRdpL", "postedAt": "2022-11-21T08:10:01.938Z", "postId": "23ACb9MjQn7tizKY7", "htmlBody": "<p>Strongly upvoted because I don't think this post deserves the downvotes.</p>\n", "parentCommentId": "EAonJ67t4ogzauXxj", "user": {"username": "Dragon God"}}]