[{"_id": "zDgjavnpLZvZZLXks", "postedAt": "2023-05-04T03:13:25.657Z", "postId": "23P6XCcGdrGGFrN6Z", "htmlBody": "<p>Strongly agree. I think that the narrative around choosing work/job/career tends to focus on sector/industry a bit too much,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref857dq97vdlw\"><sup><a href=\"#fn857dq97vdlw\">[1]</a></sup></span>&nbsp;whereas the tasks that people tend to do on a regular basis have a much larger impact. A marketing manager working for a event organizing company and a marketing manager working for a alternative protein company likely have more similar work than two people working in different functions for the same organization.</p><p>In fact, I vaguely recall reading something within the past year or two about how people who choose a particular field (such as teaching) often choose it because of 'broad' reasons (such as love of education, and wanting to share knowledge), but most of the time is spent on tasks that aren't as enjoyable (such as grading papers, lesson planning, classroom discipline, etc.). Trying to generalize that to an EA context, I'd encourage young people to develop a specific <i>skill</i> (project management, research, public relations, etc.) more than I would encourage them to learn about a specific <i>area </i>(alternative protein, anti-malaria bednets, wild animal suffering, etc.). This isn't a well-thought out thesis, but it is an idea that I've been bouncing around for few months. But if any readers have thoughts, I'd love to read your comments.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn857dq97vdlw\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref857dq97vdlw\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Not just within EA but also within American society. I can't really speak confidently regarding to other countries.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "HRHCLb6xiEFvLRouB", "postedAt": "2023-05-04T03:33:50.796Z", "postId": "23P6XCcGdrGGFrN6Z", "htmlBody": "<p>Very strongly agree, based on watching the career trajectory of lots of EAs over the past 10 years. I think focusing on what broad kinds of activities you are good at and enjoy, and what skills you have or are well-positioned to obtain (within limits: e.g. \"being a really clear and fast writer\" is probably helpful in most cause areas, \"being a great salsa dancer\" maybe less so), then thinking about how to apply them in the cause area you think is most important, is generally much more productive than trying to entangle that exploration with personal cause prio exercises.</p>", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "uBi5z2zuzLfBJpgrR", "postedAt": "2023-05-04T19:19:49.038Z", "postId": "23P6XCcGdrGGFrN6Z", "htmlBody": "<p>I very often encourage people to do exactly that - find out what their unique personal strengths and talents are optimize for a job that uses their strengths. It's better to find a job that uses your talents in a cause area that you only like than to find a job that doesn't utilize your skills in a cause area that you love. The latter tends to lead to burnout, failure and frustration, while the former helps you be happy, productive, successful and impactful. I personally use the <a href=\"https://store.gallup.com/p/en-us/10108/top-5-cliftonstrengths\">Gallup Strengthsfinder </a>to assess talent.</p>", "parentCommentId": null, "user": {"username": "Deena Englander"}}, {"_id": "t9aiAsF3A2SH37zWc", "postedAt": "2023-05-05T10:02:09.678Z", "postId": "23P6XCcGdrGGFrN6Z", "htmlBody": "<p>This is a great post.&nbsp;<br><br>The ideal job is the one where you're doing things you love to do anyway, and getting paid for it. But it's hard to know in advance what that will be. So I would encourage people to test the waters a bit too.&nbsp;<br><br>For example, lab-research is exciting, but for each 3 hour experiment you might spend a week preparing, doing risk-analyses, ordering materials, running QA checks, requesting budget, booking lab-space. And you may end up in a lab where you need to spend 15 minutes every time you enter or exit the lab just putting on and taking off protective clothing. Some people thrive in this environment, they love the details and the precision and the perfectionism of getting everything just right.&nbsp;<br><br>Likewise, doing literature research and learning about the leading edge of the field is fascinating. But are you sure you're the kind of person who will look forward to having a 40-page technical document in highly concise, technical language to read every morning and every afternoon?&nbsp;<br><br>Being involved in policy-setting feels like an incredibly important role - and it is. But it also requires keeping your own ego and opinions very much in check, being able to push enthusiastically for incremental gains, being able to compromise strategically, being willing to accept things that you don't like, listening respectfully to opinions you find repulsive and so on. (for example: imagine you're negotiating with China about cutting methane emissions and they say \"we can agree to your proposal, but in return, we want you to endorse our one-China policy on Taiwan\" ).<br>The people who are good at this will talk about the times they succeeded, but you need to be aware of how much effort and how many failed efforts they have to deal with. It requires huge degrees of resilience and grit. It is not for everyone.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}, {"_id": "gryyq8d7CDrJFo4gT", "postedAt": "2023-05-05T12:18:17.718Z", "postId": "23P6XCcGdrGGFrN6Z", "htmlBody": "<p>I agree to an extent, especially at the very high level that you're talking about -- if someone hates programing or wet lab research I think it is unlikely to matter what the program or lab is. However, within more social science type research / work I'm familiar with I don't view testing your fit with different types of research as mutually exclusive with testing your fit for researching within a cause area. In fact I think they're often linked since the cause area influences the type of research and work generally you'll be doing. To take an area I know well, law: it seems reasonable to me that someone who is interested in testing their fit in legal research or working as a lawyer <i>generally </i>would also benefit from trying working on different cause areas since the legal issues and types of research will be significantly different. Someone who enjoys trying to draft an international agreement to ban certain types of AI models may not be interested in doing domestic litigation focused on animal welfare. Though at a high level they could be called \"legal research\" or just lawyering, the day to day is going to be quite different.&nbsp;</p>", "parentCommentId": null, "user": {"username": "BenSchifman"}}]