[{"_id": "y5MXsiGoprm2b6wgZ", "postedAt": "2022-11-13T02:09:20.055Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>Some quick thoughts:<br>1. Rich country politics are not very neglected. Lots of resources are spent on them, and it's not clear EA would make too much difference. Maybe now that EA is bigger it's more plausible?<br>2. I think there are a number of groups pursuing this kind of vision; &nbsp;the DSA in the USA sounds rather similar to what you envision, from what I know of them. What would remain distinctive about EA if it became another left-wing political group?<br>3. IMO within-country inequality is a much less serious problem than between-country inequality (because rich countries are ~100x richer per capita than poor countries). You seem to equate \"poverty\" in Zimbabwe and the UK, but they are not equivalent - practically no one in rich countries is in extreme poverty (under $1.90/day); the poverty lines in rich countries are for a much higher standard of living.<br>4. Improving political institutions in poor countries would probably be very valuable, but it seems really unclear how to do it. I'm skeptical that making the US less unequal or more democratic would help much.<br>5. EA does invest quite a bit in community building, and AFAIK there are quite a few local groups similar to your (2)<br>6. I personally have some doubts that goals like \"decrease inequality in rich countries\" are actually desirable. There's a reason these questions are live political debates! Most EAs are left of center, so perhaps you could get pretty good consensus on some things like this, but I'm not sure the cost of alienating people who disagree is worth it - I'd actually like to see more right-of-center EAs.<br>7. EA does do some political work already. Here's immigration: <a href=\"https://www.openphilanthropy.org/focus/immigration-policy/.\">https://www.openphilanthropy.org/focus/immigration-policy/.</a> Here's reducing US incarceration: <a href=\"https://www.openphilanthropy.org/focus/criminal-justice-reform/.\">https://www.openphilanthropy.org/focus/criminal-justice-reform/.</a> Here's YIMBYism: <a href=\"https://www.openphilanthropy.org/focus/land-use-reform/.\">https://www.openphilanthropy.org/focus/land-use-reform/.</a> Here's monetary policy: <a href=\"https://www.openphilanthropy.org/focus/macroeconomic-stabilization-policy/.\">https://www.openphilanthropy.org/focus/macroeconomic-stabilization-policy/.</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jonathan Paulson"}}, {"_id": "aZo3Xci2vyAC35roK", "postedAt": "2022-11-13T02:56:38.017Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>Thanks for posting this! I don't really know what EA is in an \"ontological\" sense, but it seems partly about branding and networking. I don't know what the best scope for these things is, but I appreciate a post like this raises these issues.</p><p>Maybe there could be multiple brands or submovements within EA (perhaps there are already) or numerous \"sister\" movements/communities with somewhat different values/priorities. Maybe it's good to have some solidarity between the more stereotypical radical EA-types and folks with more traditional views who want to make a difference in their community and stuff. The desire to make a difference in the world is, far from being peculiar to EA, basically a universal human trait, and I think it may be good to leverage and celebrate that.&nbsp;Or maybe it's better to stay smaller and more focused. Idk, but again, appreciate the post.&nbsp;<br>&nbsp;</p><p>I like the general idea of local stuff.&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "esc12a"}}, {"_id": "QZTocZA5wmKc9LRt4", "postedAt": "2022-11-13T03:57:42.454Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>Thanks for posting this. I thought it was well-considered with lots of good brainstroming of options for valuable policy/system change, so am happy you're joining the community! I think 3 is a particularly interesting idea. I think the EA community is far too large and independent to get to 80% agreement of EAs endorsing something, but there may be some way of surveying EAs in relevant fields for each of your policy proposals. It seems <i>probably</i> valuable to me to get politically-interested EAs to have in-depth knowledge on certain areas, although I think this could be broader than your suggestion of specific policies, and could be more like 'lean into <strong>this</strong> area because it seems possible to have extra-large positive impact to others' rather than going in with the aim of advocating for a specific policy. In my opinion, I'd probably endorse the main areas being those listed by 80k <a href=\"https://80000hours.org/problem-profiles/\">here</a> - but seems like there's room for these to be challenged by new particularly policy-relevant areas.</p><p>I recommend <a href=\"https://forum.effectivealtruism.org/posts/z9hzAB9mfgcpXmcze/takeaways-on-us-policy-careers-part-1-paths-to-impact-and\">this </a>post about US policy careers and <a href=\"https://forum.effectivealtruism.org/posts/bsE5t6qhGC65fEpzN/growth-and-the-case-against-randomista-development\">this </a>post about longterm sustainability and growth in developing countries which argue some similar things and some different things to you!<br><br>I would probably add animal welfare too to your list of issues most commonly championed in EA &nbsp;(but note there are plenty more causes that various people within EA are passionate about).<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "PatrickL"}}, {"_id": "CNeLRxQLz5SM8NdEX", "postedAt": "2022-11-13T04:55:51.289Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>Parting a billionaire from his money when he doesn't want to give it to you is extremely difficult. It also doesn't always give you the results you were hoping for. Consider the track records of countries now and in the past that have sought to use government power to markedly reduce inequality. Which ones seem like examples of outcomes you'd be happy with?</p><p>EA has had quite a bit of fast success (FTX notwithstanding) in inducing billionaires to part with their money <i>willingly</i>.</p>", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "gA79HFk7XpEjYfXS8", "postedAt": "2022-11-13T15:47:47.339Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>Summoning AI Jesus is the ultimate system change?</p>\n<p>I think people who want really big meta changes get drawn to AI issues - where I do think that your perspective gets at something really important is that summoning an AI god who doesn't kill is all immediately does not mean that everyone will have access to good things and control over their lives automatically.</p>\n<p>I think a really underemphasized cause area is creating policies and institutions to ensure that success in ai alignment creates an utopia for everyone, rather than allowing a tiny group of people to control everything forever.</p>\n", "parentCommentId": null, "user": {"username": "timunderwood"}}, {"_id": "dDLZ9DDzpmshHwhAC", "postedAt": "2022-11-13T18:28:37.160Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>Thank you for your response! I wasn't aware of those EA political action funds or the fact that some EA groups do local work.&nbsp;</p><p>1. I agree wholeheartedly that rich country politics are a saturated field and EA should avoid conventional engagement with them. On its grandest scale, I believe EA should always be about more nonpartisan direct giving and existential risk prevention, because these things are very quantifiably good, and that's extremely important.&nbsp;</p><p>My argument is more that building local EA groups through engagement with local issues could expand the movement and induce greater investment from those already on board, by giving your average EA with a job not directly related to the highest-impact fields another way to engage with the gospel of effective doing that unites EAs. This average EA might currently spend 20 money-units &nbsp;on a cocktail of GiveWell and existential risk donations and 20 time-units on deciding what to donate to and engaging with the local group. My hypothesis is that if local EA groups pursued a dual strategy of local and international work, discussing the highest-impact opportunities in each separately with an understanding that international work provides more bang-for-buck but there's still effective ways to spend time on local issues, that average EA would still spend 20 money-units on Givewell and existential risk, but they might add 1 money-unit on seed money for a local political campaign and double their time-unit investment because there is now a local project that the group decided to work on. &nbsp;Plus EA's fame grows as a movement that is most dedicated to the highest international good, but is nonetheless willing to put in some local effort. I think it Feels Good to do something local and outsiders will Feel Good about EA if it accomplishes some useful local thing.</p><p>2. I want to steer super clear of DSA-like stuff. I am joining EA and not the DSA for a reason--the quality of meta-debate, introspection, and ideological diversity of EA make it far more likely to have a long-term positive impact on the world, in my opinion. I think EA's reverence for quantification and transparency is also pretty unmatched. Plus I think EAs are correct, from a moral-calculus perspective, to spend their energies building a movement with more expansive goals than political groups and more focus on things like direct aid. I think local projects would have to target non-incendiary policies, if they targeted policies at all. YIMBYism or improving voting accessibility or advocating for public parks are the kind of policies that seem to be in the sweet spot of impactful, maybe a bit neglected, and not likely to alienate anyone (maybe some YIMBY policies are too dangerous in this regard though). On the individual or really small group level EAs might do little things like getting permission from the city to build a small bridge over a neighborhood creek or making one of <a href=\"https://www.etsy.com/listing/1155850103/instant-little-free-library-random-lot?gpla=1&amp;gao=1&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=shopping_us_b-books_movies_and_music-books-literature_and_fiction-other&amp;utm_custom1=_k_Cj0KCQiAyMKbBhD1ARIsANs7rEH5EyPzQTA6s0cLjrUcaWizAZCdezU2vwMXGuQ3L-s7EXtOnSbSPeMaAhcbEALw_wcB_k_&amp;utm_content=go_12570712032_122439251951_507343201674_pla-314262775867_c__1155850103_545730686&amp;utm_custom2=12570712032&amp;gclid=Cj0KCQiAyMKbBhD1ARIsANs7rEH5EyPzQTA6s0cLjrUcaWizAZCdezU2vwMXGuQ3L-s7EXtOnSbSPeMaAhcbEALw_wcB\">those little book libraries</a> from scratch. I think what I'm envisioning is just a bimodal culture of care where you put like 95% of your philanthropic money into international efforts but much of your philanthropic time goes towards bonding with EAs on local projects. Maybe what I'm describing isn't actually that far off from some local EA groups. As far as I can tell, it's pretty different from the one where I live, though.</p><p>I think even with regard to local policy-related issues, EA would do it better than a group like DSA, by identifying the policies that are most universally-desirable, and having the ability to ignore the political sphere if no impactful opportunities arise.</p><p>3. I have to agree that poverty in the UK is a different and altogether less pressing issue than poverty in Zimbabwe. I think that was probably the weakest segment of my argument. I do, however, think that the general compression of the middle classes of these countries have enough negative psychological and social impacts as to be concerned for the wellbeing of both the inhabitants of these countries and those countries' institutions. If things aren't going well in rich countries, how can we fix the world by making poor countries into rich countries? (Obviously it's more efficient to focus on poor countries, but I think we should at least make symbolic or local efforts in rich countries).</p><p>4. I'm not sure how to improve the institutions of developing countries either, to be honest, but given how impactful it seems likely to be, I think EA should look into how it might be done. I suspect that at least some high-impact opportunities would be revealed by the search. To your other point, I think making the US less unequal and more democratic would actually have extremely dramatic impacts on future world history. From pure GDP and military numbers, it seems crucial that it perfects its institutions and is a global steward for good governance, especially in a world with reasonably strong autocracies that would like to see liberalism rot from the inside out. Good governance is a subject for debate, but assuming one's assessment is accurate, if money <i>could </i>effectively be spent on improving US governance, it would probably be one of the most impactful causes in the world to focus on. Alas, it is also the most crowded market on earth and it is probably only worthwhile to spend money on extremely specific overlooked efforts to improve governance. For example, if there was a really promising, really transparent movement &nbsp;run by EA-aligned people to give everyone Election Day off, I might give it a bit of seed money.</p><p>5. That sounds great. Will have to investigate further.</p><p>6. I agree that \"reducing inequality\" is not an end that inherently justifies itself, and certainly wouldn't make a good prospective tenet of EA. On the other hand, although this obviously is still up for debate, I think there's pretty good evidence for the long-term economic and social benefits of a larger public sector and social safety net than the US and the UK currently have. Those are the kinds of policies I could see EA advocating for, at least from my relatively uninformed perspective about what EAs consider too political for the scope of the movement. I agree that ideological diversity is inherently good for a movement. I think if there was some apparatus for community endorsement of a policy, requiring 80% consensus would be a pretty good protection against alienation, but I could be wrong about this.</p><p>7. &nbsp;Really cool stuff, this is the kind of thing I was envisioning for selective engagement with the political system. I think it's good to have this stuff on the side as long as it doesn't come to dominate too much, especially not the \"international\" side of the local/international focuses. I'm currently using a 75/75/75 rule for my own donation where 75% goes to immediately-impactful GiveWell aid, 75% of the remaining 25% goes to existential risk, 75% of the remaining 6.25% goes to improving governance, and the remaining 1.56% goes to pet/local projects. I think I will be donating to these funds as part of my governance donation, particularly the YIMBY one as it seems underfunded to me.</p><p>Again, thanks for the reply!</p>", "parentCommentId": "y5MXsiGoprm2b6wgZ", "user": {"username": "Sam Battis"}}, {"_id": "hCr9jRt8aGhWTcHgF", "postedAt": "2022-11-13T18:49:09.549Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>I think that countries for whom reducing inequality was almost a religious conviction, such as the USSR, had terrible governments which should never be replicated. However, I think that countries that invest in their public sector and social safety net more so than the US or the UK have very good track records today. There's always the classic Scandinavia example and I think the UK's rocky economic performance over the past twenty years has a lot to do with its push to privatize and reduce provision of public services. Germany does fairly well although they do tend to try to undercut the rest of the EU with their (more permissive) labor regulation. Impossible to tell for sure, but I think Japan would have had an even rougher go of it if it engaged in as little public investment as the Anglophone countries. The biggest issue for many of these countries is birth rate, although it's worth noting that Scandinavia outperforms the rest of the EU on this except France and way outperforms East Asia, and their generous maternity/paternity leave is likely part of that.</p><p>Providing these public goods does indeed require persuading billionaires to give you money, and there is always the issue of capital flight. Thankfully, countries like the US and the UK are often the recipients of that capital flight because they have a large population, speak English, and have lots of fun things for rich people to do, plus lower taxes. &nbsp;So I'm sure that <i>some</i> amount of capital flight or attempts at tax evasion would result from these countries raising obligations on their richest citizens, but I think if anything it is likely to be less dramatic than what most of Europe has suffered for their welfare states, and I think the decision was still a net positive for those countries. In my reckoning, combining Northern European institutions with America's birth rate and dynamic multiculturalism would probably result in even greater economic growth than America currently enjoys.</p><p>It's all definitely up for debate though. Thanks for the response!</p>", "parentCommentId": "CNeLRxQLz5SM8NdEX", "user": {"username": "Sam Battis"}}, {"_id": "syZ6fku5gwDhdii7s", "postedAt": "2022-11-13T18:54:12.903Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>I agree, and I think shoring up democracy and creating strong public guarantees of human wellbeing/opportunity like the social safety net and public goods including parks and education are great ways to do that.</p><p>AIs will still have to work with governments, so we want to be in a place of strong social cohesion and international cooperation when singularity is reached.</p>", "parentCommentId": "gA79HFk7XpEjYfXS8", "user": {"username": "Sam Battis"}}, {"_id": "HKZ53HciKYTq6qpqg", "postedAt": "2022-11-13T19:42:26.713Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>As you know, the question of how a government ought to provision for welfare and the morality and economics of inequality is a multifaceted debate that's raged not for decades, but <i>centuries</i>. Let me give a personal example of why I think it's best to avoid getting wrapped up in those debates in most cases.</p><p>One of my interests is the question of whether we ought to compensate people for selling a kidney. I've read dozens of news articles, many scholarly papers, and talked with doctors and economists. I'm a biomedical engineering grad student, have a philosophy/humanities background, and a decent familiarity with economics. Furthermore, I have a lot of experience with \"diplomatic dialog,\" facilitating friendly conversations in the context of sales, interviews, and teaching. So I think I'm unusually well-positioned to navigate this debate.&nbsp;</p><p>I literally just got off a two-hour phone call with a doctor who used to screen kidney donors to get his thoughts. He's against legalization. A very wise and experienced person. Yet it took me two hours just to understand his chain of reasoning. Some of his views were internally inconsistent. I'd patiently talk through a line of thought with him, and we'd find that the reasoning was circular. Fortunately, he's very patient, and our conversation was non-defensive, so that did not result in an ego conflict. What happened instead is that he'd import an entirely different argument that now became his true fundamental objection. And then there would be another one after that. And another one after that.</p><p>After two hours, I <i>do</i> think I understand his reasoning, more or less. Regardless of the practical health/economic aspects of the problem, and regardless of how the seller feels about their decision to engage in this transaction, he feels that it's undignified for society to allow organs to be sold. Selling a kidney is not admirable, so it degrades the spirit of altruism that pervades kidney donation. It's not the kind of society we should want to live in - an invasion of the sanctity of the body.</p><p>He's willing to admit that this might not be the right way to think about dignity and altruism, but nobody on the pro-legalization side is taking this dimension of the problem seriously. And even if they did, there's no cut-and-dry way to make the case that permitting kidney sales enhances human dignity, or sanctifies the body, or betters the moral worth of our society.</p><p>He doesn't see the question as urgent. These matters transcend the practical urgency of a long and growing waitlist for kidney transplant, or the $28 billion the USA spends on dialysis annually. He's perfectly willing to wait patiently for somebody to him personally to change his perspective on the dignity and symbolism of kidney sales. Until they do, he's happy to stay with his present perspective, which as an added benefit is compatible with the law.</p><p>Now, I personally think that we <i>should</i> permit kidney sales in the short run, but that implantable dialysis will more or less completely eliminate demand for living kidneys within a few decades. I could make it my life's work to construct a moral argument for kidney sales that might be persuasive to people like the doctor I spoke with today. But the debate's been raging for decades, the Catholic church is on the other side, Federal law would have to be changed, there's no clear argumentative strategy to change people's minds about \"dignity,\" and the problem itself is temporary on long enough time scales.</p><p>Since I'm a biomedical engineer, I have the opportunity to work on the bioartificial kidney technology that I think will eventually replace living kidney transplant. I can also work on a lot of other technological solutions for human health problems, or policy issues that might be uncontroversial and make a big difference in human health. Why select a political issue where we've had decades of evidence of the inability to make progress, for reasons that are easy to understand once you start seeing what motivates people on each side of the debate?</p><p>When I shift from considering kidney sales, where the practical arguments are cut-and-dry in favor of permitting them, to measures to increase taxes to fund social services, where even the practical economic arguments are <i>much</i> more controversial, and where you're not trying to permit a voluntary transaction but force a large confiscation of money from some of the most powerful individuals in the world, it seems to me that you're not only at serious risk of doing harm, you're at an even greater risk of failing to do good -- just as many generations of our ancestors have.</p><p>This isn't to say you're wrong. It's to say that this is what you'd have to persuade me of if you wanted to convince me, personally, that EA should be doing more progressive activism on taxation and welfare. But my warning is that this would probably have to start with the equivalent of the two-hour phone call I had earlier with the doctor, and it might turn out that I'd convince <i>you</i>, rather than the other way 'round. And either way, it would only be zero or one person who was convinced. It's easy to get sucked into, but tough to scale or accomplish things with. That's an important reason why I have chosen to pursue a career in technology rather than in politics, and have affiliated myself with a movement that focuses on philanthropic provision of goods and services rather than on trying to use government as the primary vehicle for its agenda.</p><p>If you think you can make a compelling case (i.e. a case that would convince <i>me</i>) that I'm wrong in my thinking, and that the best way to do good in the world might be for me to focus on politics in some way, let me know!</p>", "parentCommentId": "hCr9jRt8aGhWTcHgF", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "8DJmQLvQHWzGTGkcp", "postedAt": "2022-11-13T22:33:37.050Z", "postId": "24Cjdn4S7uvbwYhaD", "htmlBody": "<p>Thank you for the reply, it was very thought provoking. It seems to me you have successfully found a niche that provides higher altruistic ROI with regard to career than a large portion of political-adjacent careers. As far as I can tell, many STEM-inclined people can make their greatest impact by focusing on innovation and to a lesser extent earning-to-give. &nbsp;</p><p>I wrote a paper on kidney sales for an undergrad philosophy course, &nbsp;and with my small sliver of knowledge on the debate, I agree that it is likely not the best time sink for changing the world efficiently. I think the conclusion I came to is that if there was a strong social safety net (to reduce the incentive for impoverished people who may not be healthy enough to donate to attempt to do so anyways, as occurs when people try to donate blood more often than permitted in order to obtain the cash rewards), the kidneys were added to the waiting list rather than sold to the highest bidder, and participants were well informed of the risks, it would be a net positive to legalize a regulated market. But as you said, this is a debate where it is extremely difficult to be confident that one's position would actually produce a net positive outcome in practice.</p><p>I feel very differently with regard to lack of public services--I think there is enough evidence to suggest that there is probably a pretty significant economic boost to be expected from investment in high-speed railways and single-payer healthcare, to say nothing of the moral impact of the latter. Plus,<i> </i>in contrast to allowing kidney sales, there seems to be far less emotional intuition warning me against such reforms. My conviction is strongly reinforced by the fact that most developed countries in the world provide these services, which are considered indispensable by most of the inhabitants of those countries. On the other hand, kidney sales have not been legalized anywhere in the world, as far as I'm aware.&nbsp;</p><p>As you point out, it may take a prohibitive amount of time for one of us to convince the other of our economic stances, but I will try to summarize my opposition to your points succinctly for the sake of it.</p><p>Efforts of ancestors in vain - I believe that the majority of policies that provide opportunities to working people in developed countries have had lasting and significant net positive impacts, and that when almost any of these policies are repealed (as many have been in the US and the UK over the last few decades), there is a marked negative impact on both natl GDP growth and natl wellbeing. In essence, it is not an all-or-nothing debate, but rather a struggle worth fighting every generation anew. I believe the American middle class as we knew it was largely created by policies from the 1930s-1970s, for example, and that its decline has been caused more by a shift rightward economically than by shipping jobs overseas, technological disruption, or any of the other explanations provided by some economists. Such arguments, in my view, fail to explain the totality of the change, or the fact that it has been so much more pronounced in countries that gutted their public sector.</p><p>Not good to act in opposition to billionaire interests - I think this defers unnecessarily to individuals who are citizens of developed nations, after all, and whose power similarly rests in the vehicles of corporations which also can be effectively regulated by national or international law. During the Gilded Age we had powerful, unprecedently rich men, and corporations wielded intolerable power over the lives of many of their workers. Then in the early 1900s Progressives came in and guaranteed shorter workdays, did some trust-busting, and passed a bunch of worker protections generally. FDR and LBJ continued that legacy. Now, we've gotten rid of the protections and the taxes on the hyper-wealthy that enabled them, and we're in the same place again. The US experienced the most economic and social vitality as a nation in the interim between these two periods. Obviously, there is no way to test models of different historical economic and political decisions to see what changed what. But I feel at least 90% confident that it is better for the US to be farther left economically than it is currently, perhaps by going in some unorthodox direction, like embracing <a href=\"https://en.wikipedia.org/wiki/Georgism\">Georgism</a>. I also think the butterfly impacts of such reforms often are far more relevant than they initially appear.</p><p>If you think it would be optimal for us to debate further, DM me, although I suspect the depth of our knowledge of economics is similar, so neither of us will be able to convert the other by pulling overwhelming data or expertise out of a hat.</p>", "parentCommentId": "HKZ53HciKYTq6qpqg", "user": {"username": "Sam Battis"}}]