[{"_id": "HcN2g9YCzcJuu8yxq", "postedAt": "2023-09-17T11:41:04.349Z", "postId": "28iXeSY75aLsqAagg", "htmlBody": "<p>What a fantastic resource, thanks all! Also may be worth adding, the new National Security Commission on Emerging Biotechnology, which will be delivering a 2024 report based on “a thorough review of how advances in emerging biotechnology and related technologies will shape current and future activities of the Department of Defense“ - delivering it to the DoD, White House, and Congress.</p>\n", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "kxtyZmyAq5RmCCrNp", "postedAt": "2023-09-17T12:09:10.928Z", "postId": "28iXeSY75aLsqAagg", "htmlBody": "<p>Some UK additions.</p>\n<h2>Government</h2>\n<ul>\n<li>UK Health Security Agency (for England mostly but some UK-wide), Public Health Wales, Public Health Scotland, Public Health Agency (Northern Ireland) are the public health agencies, at least for infectious diseases, for England (~CDC).</li>\n<li>Department for Health and Social Care for public health and other policy.</li>\n<li>Department for Science, Innovation, and Technology for emerging biotech.</li>\n<li>Cabinet Office for cross-departmental work, including the <a href=\"https://www.gov.uk/government/publications/national-risk-register-2023\">National Rush Risk Register</a> which had pandemics as the biggest civil threat even pre-COVID.</li>\n<li>Various other government departments are involved in different ways, the recent National Biosecurity Strategy is the best place to look for everything that is going on.</li>\n<li>MHRA regulates pharmaceuticals and other healthcare products (~FDA but only medical).</li>\n<li><a href=\"https://www.gov.uk/government/news/first-meeting-of-uk-science-champions-to-cement-uk-leadership-in-safe-responsible-biology-breakthroughs\">UK Biosecurity Leadership Council</a> launched this week. A way of bringing external experts into the policy making process.</li>\n</ul>\n<h2>Academic</h2>\n<p>There's lots of labs across various institutions depending on what (sub)-field your after. Pretty much everyone relevant in the sciences (including behavioural sciences and some engineering) were included in the <a href=\"https://www.gov.uk/government/publications/scientific-advisory-group-for-emergencies-sage-coronavirus-covid-19-response-membership/list-of-participants-of-sage-and-related-sub-groups\">SAGE Advisory Groups</a>. UKRI is the parent body for governmental funding is academia and the various sub-bodies (\"research councils\") do funding of all kinds of pandemic-relevant work (including social sciences, mathematics, engineering, biology).</p>\n<h2>Other</h2>\n<p>The Institute for Government is an independent think tank focused on masking government work better. They've done some work (including in collaboration with CLTR) looking at how the COVID response went and emergency preparedness more broadly.</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "aN7CbugAGRa7KB22r", "postedAt": "2023-09-18T07:53:34.434Z", "postId": "28iXeSY75aLsqAagg", "htmlBody": "<p>This is a very welcome contribution to a professional field (ie., the GCBR-focused parts of the pandemic preparedness and biosecurity space) that can often feel opaque and poorly coordinated — sincere thanks to Max and everyone else who helped make it!</p>\n", "parentCommentId": null, "user": {"username": "jtm"}}, {"_id": "syCXEmYqhf6BioLJi", "postedAt": "2023-09-18T08:38:12.179Z", "postId": "28iXeSY75aLsqAagg", "htmlBody": "<p>Thanks for putting this together, Max!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Anemone "}}, {"_id": "iBcFA2jzcfyCDLdQu", "postedAt": "2023-09-18T09:49:04.114Z", "postId": "28iXeSY75aLsqAagg", "htmlBody": "<p>Great resource! Some Dutch suggestions:&nbsp;<br><br><a href=\"https://www.bureaubiosecurity.nl/en\">The Biosecurity Office</a>: \"The Biosecurity Office is a national information centre for the government and for organisations that work with high-risk biological material.</p><p>The Biosecurity Office shares knowledge and information about biosecurity and increases awareness about biosecurity, in order to minimise the risk of misuse of high risk pathogens, knowledge and technologies. The Biosecurity Office increases biosecurity awareness in the Netherlands by organizing a Biosecurity Knowledge Day in the Netherlands annually, by giving lectures and workshops, by developing knowledge products and web applications, and by joining international biosecurity initiatives.\"<br><br><a href=\"https://convergence.nl/pandemic-disaster-preparedness/\">The Pandemic and Disaster Preparedness Centre</a>: \"Erasmus MC, TU Delft and Erasmus University Rotterdam have joined forces in the Pandemic and Disaster Preparedness Center (PDPC).</p><p>PDPC aims to prepare society for future pandemics and disasters. We will reduce vulnerabilities and risks and build resilience through effective disaster prevention, preparedness and recovery measures. Convergence of the technical, medical and social sciences is essential for developing the next generation of approaches to disasters and pandemics.’\"</p>", "parentCommentId": null, "user": {"username": "James Herbert"}}, {"_id": "oByHywPhRTigCwBDX", "postedAt": "2023-09-18T13:30:43.653Z", "postId": "28iXeSY75aLsqAagg", "htmlBody": "<p>Thanks for this. I'd be keen to see a longer list of the interesting for-profits in this space.</p><p><a href=\"https://biobot.io/about/\">Biobot Analytics</a> (wastewater monitoring) are the only for-profit on the <a href=\"https://jobs.80000hours.org/organisations?refinementList%5Bproblem_areas%5D%5B0%5D=Biosecurity%20%26%20pandemic%20preparedness\">80,000 Hours job board list</a>.</p>", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "AmfH4GqaC8y6mopov", "postedAt": "2023-09-19T16:10:23.806Z", "postId": "28iXeSY75aLsqAagg", "htmlBody": "<p>This is a pretty good overview: <a href=\"https://www.decodingbio.com/p/decoding-biosecurity-and-biodefense\">https://www.decodingbio.com/p/decoding-biosecurity-and-biodefense</a></p>\n<p>I know the space reasonably well, happy to connect and discuss with anyone interested!</p>\n", "parentCommentId": "oByHywPhRTigCwBDX", "user": {"username": "Alex D"}}]