[{"_id": "vrGZFqv9j4rj9zx6S", "postedAt": "2022-12-15T17:52:43.484Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Fwiw I think it would have been good to explain technical terminology to a greater extent - e.g. &nbsp;TAI (transformative artificial intelligence), LLM (large language model), <a href=\"https://en.wikipedia.org/wiki/Transformer_(machine_learning_model)\">transformers</a>, etc.</p><p>It says in the introduction:</p><blockquote><p>I expect some readers to think that the post sounds wild and crazy but that doesn’t mean its content couldn’t be true.</p></blockquote><p>Thus, the article seems in part directed to readers who are not familiar with the latest discussions about AI - and those readers presumably would benefit from technical concepts being explained when introduced.</p>", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "E5L8KMH5XMgsP9qhN", "postedAt": "2022-12-15T18:03:52.816Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Fair. I'll go over it and explain some of the technical concepts in more detail.&nbsp;<br><br>Also, I also expect many people who are familiar with the latest discussions in AI to have longer timelines than this. So the intended audience is not just people who aren't familiar with the field.&nbsp;</p>", "parentCommentId": "vrGZFqv9j4rj9zx6S", "user": {"username": "mariushobbhahn"}}, {"_id": "PHWDQCpFWuKKfF26f", "postedAt": "2022-12-15T18:43:18.328Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Hi Marius,</p><p>Thanks for writing this!</p><p>Just one note, I think it would maybe have been helpful to have some subsections.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "D86jt2vHQWn6Z3PDH", "postedAt": "2022-12-15T18:57:53.859Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Yeah. I thought about it. I wasn't quite sure how to structure it. I guess I'm not used to writing \"story-like\" texts. Most of my other writing is just a glorified bullet-point list ;)&nbsp;</p>", "parentCommentId": "PHWDQCpFWuKKfF26f", "user": {"username": "mariushobbhahn"}}, {"_id": "NojqhJx8cs9yHrdHu", "postedAt": "2022-12-15T19:18:24.136Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>I really liked this... the post made me think, and will continue to do that for some time. It doesn't seem all that unrealistic to me 🤯</p>\n<p>One little nit: you seem to write \"century\" when you mean \"decade\".</p>\n", "parentCommentId": null, "user": {"username": "Sjlver"}}, {"_id": "f9mW8DfF8pHDBuYwd", "postedAt": "2022-12-15T21:21:07.148Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>This was a really interesting read. I think a lot of this is plausible and it is similar to my own expectations in many ways. Thank you for writing this.</p>\n<p>That said, I think your vision is too conservative. AI the field that will change the world massively this century where transformative changes are already certain. But there are other candidates as well. Space development, self replicating macro and nano machines, human enhancement and new physics are options I consider likely in descending order. The interactions between those fields are the truly scary thing.  You acknowledge that your predictions are very likely to be false, but I think the biggest error people make when trying to predict the future is that they look at only a single dimension and ignore the interactions. For example, a power seeking AI could reasonably prioritise gambling on an interstellar land grab in the forties.</p>\n<p>Another point where I disagree with you is that AI's will cause more damage with spreadsheets, medical procedures and legal procedures. The human standard is already pretty dismal here, but we are wired to trust people in those positions. I think that while it is certain that AI will fail in some cases, it is far from certain that it will perform worse than the human baseline.</p>\n", "parentCommentId": null, "user": {"username": "Jens Brandt"}}, {"_id": "gajgYgWWiPhn2Ngjd", "postedAt": "2022-12-15T21:32:39.830Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Thanks for pointing out the mistake. I fixed the \"century\" occurrences.&nbsp;</p>", "parentCommentId": "NojqhJx8cs9yHrdHu", "user": {"username": "mariushobbhahn"}}, {"_id": "TkHSvttyoqy2nnusv", "postedAt": "2022-12-15T21:34:55.068Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Yeah. I kept the post mostly to AI but I also think that other technological breakthroughs are a possibility. Didn't want to make it even longer ;)<br><br>I think you could write more of these stories for other kinds of disruptions and I'd be interested in reading them.</p>", "parentCommentId": "f9mW8DfF8pHDBuYwd", "user": {"username": "mariushobbhahn"}}, {"_id": "usmhByytAT3BLGBaj", "postedAt": "2022-12-15T23:25:58.945Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Interesting !&nbsp;</p><p>I'm curious: do you have any thoughts about the impact that the decline of fossil fuels may have during these decades?</p><p>For instance, the recent claims by the International Energy Agency that <a href=\"https://www.carbonbrief.org/in-depth-russias-war-means-fossil-fuels-will-peak-within-five-years-iea-says/\">fossil fuels should peak within 5 years</a> ? (i have<a href=\"https://forum.effectivealtruism.org/posts/wXzc75txE5hbHqYug/the-great-energy-descent-short-version-an-important-thing-ea\"> my own thoughts</a> on the topic but I'd like to know how you see things going)</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}, {"_id": "xqHJbZhnLYgQder8A", "postedAt": "2022-12-16T03:36:39.658Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>You mention AI taking over many jobs and people having trouble specializing in useful ways, but you don't include any discussion AFAICT of why this won't cause massive unemployment.<br><br>On a related note, I'd like to see some ideas about how AI will change our education system. What kind of homework will high school students have in 2026? What will a typical day look like for undergraduate and graduate students?</p>", "parentCommentId": null, "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "8wMbMQnmbKwcvFMBq", "postedAt": "2022-12-16T05:24:30.548Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Technology causing unemployment is a concern as old as the Industrial Revolution and yet has never been born out.</p>\n<p>It creates so many new jobs you cannot fathom. Imagine explaining the job of an SEO consultant to someone in 1990.</p>\n<p>Makes me think of Wal Mart. They went to mostly self-checkout (which is awesome). Did they lay off a bunch of cashiers? Heck no. They just launched curbside (also awesome). Joe Schmos like me now have personal shoppers! Thanks to technology.</p>\n<p>I think AI would have to be delivering an era of radical abundance before jobs somehow began disappearing, and then, by definition, you wouldn't need a job anymore.</p>\n", "parentCommentId": "xqHJbZhnLYgQder8A", "user": {"username": "Brian E Adams"}}, {"_id": "YpmcThQgNE2wsuCrW", "postedAt": "2022-12-16T08:35:52.575Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>I think narrow AIs won't cause massive unemployment but the more general they get, the harder it will be to justify using humans instead of ChatGPT++<br><br>I think education will have to change a lot because students could literally let their homework be done entirely by ChatGPT and get straight A's all the time.&nbsp;<br><br>I guess it's something like \"until class X you're not allowed to use a calculator, and then after that you can\" but for AI. So it will be normal that you can just print an essay in 5 seconds similar to how you can do complicated math that would usually take hours on paper in 5 seconds on a calculator.&nbsp;</p>", "parentCommentId": "xqHJbZhnLYgQder8A", "user": {"username": "mariushobbhahn"}}, {"_id": "Gnj4mNzBmdzu2Gxk2", "postedAt": "2022-12-16T08:37:38.354Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>I'm bullish on Solar+storage. But I think that it will take a while to adapt the grid, so I think it will take at least a decade before we can even think about phasing out fossils.&nbsp;</p>", "parentCommentId": "usmhByytAT3BLGBaj", "user": {"username": "mariushobbhahn"}}, {"_id": "yYrJ4Qfbg8xArcdi3", "postedAt": "2022-12-16T08:40:26.078Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>I think narrow AIs won't cause mass unemployment but more general AIs will. I also think that objectively that isn't a problem at this point anymore because AIs can do all the work but I think it will take at least another decade that humans can accept that.&nbsp;<br><br>The narrative that work is good because you contribute something to society and so on is pretty deeply engrained, so I guess lots of people won't be happy after being automated away.&nbsp;</p>", "parentCommentId": "8wMbMQnmbKwcvFMBq", "user": {"username": "mariushobbhahn"}}, {"_id": "cjT723rCnQJkAsHiA", "postedAt": "2022-12-16T09:04:46.797Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Ok - so there would be a phase where fossil fuels are declining, but renewables can't compensate yet, if I am to understand correctly.</p><p>What consequences do you think this gap should have?&nbsp;</p><p>I'm interested by the effect this might have on the economy, since there appears to be a very strong link between energy and GDP, at the global level (see for instance this <a href=\"https://tupa.gtk.fi/raportti/arkisto/70_2019.pdf\"><u>report</u></a>, p.11 to 16).</p>", "parentCommentId": "Gnj4mNzBmdzu2Gxk2", "user": {"username": "Corentin Fressoz"}}, {"_id": "dJeg7PNGeshfLSP86", "postedAt": "2022-12-16T12:17:30.826Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>No, I think there is a phase where everyone wished they had renewables but they can't yet get them so they still use fossil fuels. I think energy production will stay roughly constant or increase but the way we produce it will change slower than we would have hoped.&nbsp;<br><br>I don't think we will have a serious decline in energy production.&nbsp;</p>", "parentCommentId": "cjT723rCnQJkAsHiA", "user": {"username": "mariushobbhahn"}}, {"_id": "iSDpE2arRd33QZ9JZ", "postedAt": "2022-12-16T12:44:21.132Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>I made my comment too early, sorry, I have now fully read it, and actually think the structure is good. I strongly upvoted the post, and plan to share it with some people!</p>", "parentCommentId": "D86jt2vHQWn6Z3PDH", "user": {"username": "vascoamaralgrilo"}}, {"_id": "SxncikrgBWwTq3kRN", "postedAt": "2022-12-16T16:51:42.244Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Here are some thoughts on why AI might be different than previous technologies.</p><ol><li>Faster pace of change. E.g. it took less than 3 years to go from GPT-3 to Chat-GPT, and Chat-GPT might already be changing the nature of knowledge work (see <a href=\"https://twitter.com/AdamNeumannsCoS/status/1603203940010455040\">this story on Twitter</a>), whereas GPT-3 mostly has not. I think it's plausible that code-writing AI will cause similar disruptions for software engineering within the next 5 years. In contrast, people had several decades to respond to changes from the industrial revolutions.</li><li>Automation and autonomy. AI breakthroughs are especially useful for automating tasks compared to previous technologies (although previous technologies certainly enabled some automation), and automated tasks require less human labor.</li><li>Higher time costs to transition between jobs. Some of the new jobs that AI creates may be more technical in nature and require coding skills that take years to develop. Truck drivers can't retrain as AI researchers. A counterpoint is that there will be new manual labor jobs as well. I like your example of self-checkout enabling curbside pickup.</li><li>Performance improvements at many new tasks with a single AI breakthrough. E.g. language models demonstrate <a href=\"https://ai.stanford.edu/blog/in-context-learning/\">in-context learning</a>, and fine-tuning them produces <a href=\"https://en.wikipedia.org/wiki/OpenAI_Codex\">coding </a>and <a href=\"https://ai.googleblog.com/2022/06/minerva-solving-quantitative-reasoning.html\">math</a> models. A counterpoint is that there have been other general purpose technologies like electricity and the digital computer.</li></ol><p>I do think it's plausible that we'll see a period of radical abundance before any serious unemployment difficulties, but I'm not sure that this abundance will reach everyone equally. I could imagine low-income countries missing out on many of the benefits for years, which might cause dangerous political unrest.</p>", "parentCommentId": "8wMbMQnmbKwcvFMBq", "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "i7NsHHDd2ep6EgmnQ", "postedAt": "2022-12-16T19:14:53.075Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>文章很长，我通篇看完了，准确地说是通篇地听完了。<br>虽然有点浪费时间，但还是坚持看完了，这是对作者一个最起码的尊重。<br>下面，我将通过我自己的思维历程来进行表达，以说明我的相对观点。<br>首先，我要表达的是，作者的思路给我提供了一个很大的启发性。最近我也在构建未来人工智能的发展与“威胁”，旨在通过结构化且多态化的形式对人工智能进行一个整体的构建，准确地说是建模。<br>一开始，我在构件的时候陷入了迷茫。因为我发现，在构件的时候总感觉有些事物在阻碍着我们的思维瓶颈。尽管我们人类的大脑神经元远远超过当今的超级计算机，但是由于所处的时空环境的不同而不同，也常常受制于传统的思维模式及其所处的社会环境的时空限制中。正是由于这些种种的桎梏，阻碍了我们的思维开创性或者平稳性发展。<br>于是，我创建了{第三视角}的理论思维方式，以主观、客观、中观（旁观）的三维思维模型为基础，并以中观的思维视角为主导，以跳出固有的思维藩篱。从而对事物的本质事实进行正确的评估、分析、引导及其结论。关于{第三视角}理论，我会在后续的发文中继续阐述。本篇的主题不在于此，仅仅是表达一种与作者相同思维环境下的思维过程，故不作多余赘述。<br>接着，通过第三视角的方法，我继续了构建的畅想模型中，几乎与作者的行为是相似的。但是，后来我又发现，其实我一直在原地打转，并没有跳出这个思维的藩篱。在一次偶然的思考中，我突然灵光一现，发现了问题的所在：虚无。<br>没错，正是因为沉沦于虚无的世界中，所以才导致了我的思维一直没有跳出这个藩篱。也正是因为虚无，所以才导致我们一直没有一种开创性的角度去思考、建模未来的人工智能的模型。（在这里我要提一点，虽然现在的机器智能很厉害，但终究还是比不上人类大脑的生物神经网络。所以，我相信，我的建模一定会比当前的机器智能更佳。举例来说，我们很多“天马行空”的想法，机器智能无法解决：脑机接口、脑成像、全息助手、元宇宙、心灵感应，以及我新定义的一个“平行宇宙”概念等。所有的诸如此类，我们的大脑能够想象得出它的样子，甚至可以在大脑中模拟出来，但是却无法实现它。这正是我们人类大脑的生物神经元的优势之处。<br>）<br>于是，我又着手重温关于虚无主义的知识及其相应的著作、论文。说实话，能解决我问题的很少，不过也或多或少地得到了一定的启发。比如，上述的建模过程，正是由于沉沦于虚无的世界之中，导致未能跳出思维的藩篱而不能自拔。简言之，就是缺乏问题的建设性方案。就是虽然想法是对的，可以作为一定的安全协议建设的前提基础，但是并不能起到相对的建设性方案。提问题固然很重要，但是问题的本身在构建事物之初就是一个安全协议的前提，当然也是开创事物的前提。所以，问题出来之后，再继续后一步的发展与延伸，就是建设性方案。这就回到了作者里面提到的内容：“人类的长期命运基本上取决于研究人员是否能够建立一个足够强大的人工智能，以始终如一地为人类的利益行事。”<br>最后，关于上述两点，我又重新思考了一遍。视角、思维、虚无藩篱，这三者之间的联系是什么？为什么它们会存在？与我所构建的模型有什么对应关系？<br>答案是，我们无法设想的太远，但是我们有办法解决当下亟待解决的问题。简言之，过多的思绪而缺乏一定的行动，只会再度陷入另一个虚无的世界中。即便是构建模型，仅仅需要初步的就行，后面根据这个模型逐步地完善修改。前提是，我们得根据这个模型去逐步实现。<br>总结：人工智能，其未来的发展必然是进步的。但是在发展的同时，我们不能过渡的依赖于它。我们要相信，它只是一个类人类的辅助工具，而不是人类文明的全部。我们当然可以设定一定的安全协议来控制和预防，但是也应当正确地看待及其利用它。过分地依赖就会导致人类的依存度降低，此消彼长之后带来的必然是人类的沉沦，这不是我们想要得到的结果。我们渴望知识，但是也渴望生活。绝不能因为人工智能的崛起与发展，导致了人类本身身心思维的沉沦与堕落。这不是《西部世界》的悲观主义，也不是《奥创纪元》的自大主义，更不是《星际迷航》的迷茫主义（虚无主义）。更多的时候，我们需要的是这里面的有利部分，而不是被我们自己所创造的自我感觉“超人类”的机器而感到悲观与自卑，甚至的霍金的恐惧预言。<br>前面提到的浪费时间，是看到了作者的思维与我的思维有相似之处，同时作者的思维及其设想还沉沦于当今的社会基础之中。看过近年来电影的人都知道，作者所设想的都是与其相似的，重点是把那些设想用文字的方式进行了归总阐述。所以，作者所提的“威胁”，可以作为一定的参考，但建设性不大。<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "BrianLee"}}, {"_id": "foQvpoDANGx58f2yp", "postedAt": "2022-12-17T04:14:09.771Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<ol>\n<li>\n<p>Yes. Though I have a higher opinion of how adaptable humans can be.</p>\n</li>\n<li>\n<p>Using my own work as a benchmark (residential real estate pricing), AI automation would be a huge benefit to enable me to spend my time on higher level analysis. There's a lot of AI that my role can absorb while my job still being safe.</p>\n</li>\n</ol>\n<p>That's especially true in my industry in which adverse selection is prominent. AI making me more effective will be necessary merely to keep up with our competition. It won't replace us because that will be the default starting position from which we as humans need to then compete at another level relative the competition.</p>\n<ol start=\"3\">\n<li>\n<p>I'm not convinced that the AI revolution benefits the high tech roles relative blue collar roles. AI is a lot closer to writing code from a language prompt than it is massaging someone's back or even truck driving, for that matter.</p>\n</li>\n<li>\n<p>I hope this is right. Would love the kinds of breakthroughs AI will provide and whatever we can do to get closer to radical abundance, which I think is the holy grail.</p>\n</li>\n</ol>\n<p>I also don't see a systemic reason thst AI benefits won't A) be broadly shared, and B) shy of radical abundance, that economic principles won't continue to reward non-automated work. Automated activities will become cheap because they're abundant, while activity that can't be automated will rise in demand/price and be rewarded as a consequence.</p>\n", "parentCommentId": "SxncikrgBWwTq3kRN", "user": {"username": "Brian E Adams"}}, {"_id": "ZRBzJ75H6WDQNmZMj", "postedAt": "2022-12-17T04:16:49.187Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>General AI isn't the same as radical abundance, but to the extent they're the same, I see that as making the unemployment concern moot.</p>\n<p>I also have faith that humans will continue with the \"purpose driven life\" under such circumstances.</p>\n", "parentCommentId": "yYrJ4Qfbg8xArcdi3", "user": {"username": "Brian E Adams"}}, {"_id": "4aM3sg5TRhnjYh8nv", "postedAt": "2022-12-17T13:54:36.461Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Ok, this is interesting. Your take is that energy production will stay constant or increase.</p><p>In that case, what makes you think that the International Energy Agency is wrong in saying that fossil fuels production will peak within 5 years, and then probably decline ?</p><p>For instance, where would the additional oil come from to compensate for the decline of, say, Russia (announced their peak in 2019) or Saudi Arabia (announced their peak for 2027) ?</p><p>&nbsp;</p><p>(for the record, my personal take is that it's likely that this would lead to a decline in global energy production since fossil fuels represent 85% of energy production - unless there is a massive increase in renewables that you do not see happening soon)</p>", "parentCommentId": "dJeg7PNGeshfLSP86", "user": {"username": "Corentin Fressoz"}}, {"_id": "4Ndv5SoqDeJ3jKktg", "postedAt": "2022-12-17T13:57:10.013Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>I don't have any strong opinions on that. There is a good chance I'm just uninformed and the IEA is right. My intuition is just that countries don't like it if their energy gets more expensive, so they'll keep digging for coal, oil or gas as long as renewables aren't cheaper.</p>", "parentCommentId": "4aM3sg5TRhnjYh8nv", "user": {"username": "mariushobbhahn"}}, {"_id": "MamCGute7eYGc64Fy", "postedAt": "2022-12-17T14:08:26.079Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Oh, yes, they'll try.</p><p>I was more wondering about the fact that coal, oil and gas are finite, and getting harder and harder to extract, so it won't be exactly a choice. The IEA mentioned that fossil fuels would peak <i>even if climate policies are not followed</i>. But yeah if we could extract an inifinite amount of fossil fuels we'd probably do that - and use cheap solar on top of it for more electricity.</p><p>If you're curious about energy depletion, I tried to adress that in <a href=\"https://forum.effectivealtruism.org/posts/wXzc75txE5hbHqYug/the-great-energy-descent-short-version-an-important-thing-ea\">this post</a>.&nbsp;</p>", "parentCommentId": "4Ndv5SoqDeJ3jKktg", "user": {"username": "Corentin Fressoz"}}, {"_id": "FjY2A7iaKdd4Gxz7h", "postedAt": "2022-12-18T08:05:35.515Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Interesting. Let's hope they are right and we are able to replace fossils with renewables fast enough.&nbsp;</p>", "parentCommentId": "MamCGute7eYGc64Fy", "user": {"username": "mariushobbhahn"}}, {"_id": "cFQqa4SXQ3sEifYqt", "postedAt": "2022-12-18T11:21:53.971Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>I personally don't think we can replace fossils with renewables <i>at scale</i>, for reasons explained in the post (renewables have worse properties than storable, dense liquid oil, and there's not enough metals to build everything).</p><p>Anyway, I think we'll have more news on that front seeing how we fare in the next winters with the current energy crisis.</p>", "parentCommentId": "FjY2A7iaKdd4Gxz7h", "user": {"username": "Corentin Fressoz"}}, {"_id": "j7rNqHkgicSxZh4mt", "postedAt": "2022-12-18T12:32:47.935Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>It's worth pointing out that the IEA is actually most famous for almost always &nbsp;<a href=\"https://www.vox.com/2015/10/12/9510879/iea-underestimate-renewables\"><i>underestimating</i></a> renewable energy uptake. &nbsp;So if even they think fossil fuels are on the way out, I'm inclined to think they're right.&nbsp;</p>", "parentCommentId": "cFQqa4SXQ3sEifYqt", "user": {"username": "titotal"}}, {"_id": "NCZipeWnpFAxkMvXm", "postedAt": "2022-12-21T12:49:47.499Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Fantastic post overall, but I have a nitpick about what I think may be an important issue.&nbsp;</p><blockquote><p>Additionally, automated coding becomes pretty good, i.e. it reliably more than doubles the output of an unassisted coder. This has the effect that much more code is generated by ML models and that more people who don’t have a coding background are able to generate decent code. An effect of this is that the overall amount of code explodes and the quality degrades because it just becomes impossible for humans to properly check and verify the code.</p></blockquote><p>I strongly doubt this part, and my expectation is the opposite - human-written code is pretty mediocre, and most production systems rely on millions of lines of code, much of which is unnecessary. The reason code isn't better is because programmer time is more expensive than the short-term benefits of improving the code. &nbsp;Automated tools are likely to reduce this gap, and write far tighter and simpler code. In addition, maintainability becomes far easier when automated rewrites are possible. And checking code generated by narrow AI isn't actually as hard as checking human code for correctness when there are NAI systems which are far better than humans at writing well documented unit tests. Similarly, it can excel at generating computationally verifiably correct &nbsp;code - something humans can do, slowly and painfully.</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "BfDqBqhkR3eEoZhJi", "postedAt": "2022-12-21T15:27:52.668Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Interesting perspective. Hadn't thought about it this way but seems like a plausible scenario to me.&nbsp;</p>", "parentCommentId": "NCZipeWnpFAxkMvXm", "user": {"username": "mariushobbhahn"}}, {"_id": "4syZP25eqmxqMzsyS", "postedAt": "2022-12-22T17:38:17.316Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>Thanks for your reply. I think the biggest <a href=\"https://forum.effectivealtruism.org/topics/crux\">cruxes</a> are about how quickly humans can adapt to change and how quickly AI capabilities can grow.</p><p>To my original point in (2), I'd also add something like \"crossing the finish line\" or \"reaching the end\": within the next few decades, I expect AI to be capable of automating nearly <i>all </i>knowledge work. By \"all knowledge work,\" I mean all thinking-related tasks, includes both 2022 jobs and post-2022 jobs. I worry that this capability level (or a level reasonably close to it) might arrive quickly, before we're prepared to deal with the ensuing unemployment spike.</p>", "parentCommentId": "foQvpoDANGx58f2yp", "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "CXvHDouKwyoEKn3Zi", "postedAt": "2022-12-23T06:43:55.771Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": "<p>My half baked theory is that there will always be jobs shy of radical abundance in which case jobs won't be necessary.</p>\n<p>If AI automated all knowledge work WITHOUT delivering radical abundance, then there would still be jobs delivering goods/services that AI is, by definition, not delivering.</p>\n<p>And if so, we have nothing to fear.</p>\n", "parentCommentId": "4syZP25eqmxqMzsyS", "user": {"username": "Brian E Adams"}}, {"_id": "bQvDx2QW4CMTzqLfM", "postedAt": "2022-12-16T19:12:39.729Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": null, "parentCommentId": null, "user": null}, {"_id": "eCMksvmCDWrt5iNtd", "postedAt": "2022-12-16T19:13:04.116Z", "postId": "2AiuvYoozXeHBGnhd", "htmlBody": null, "parentCommentId": null, "user": null}]