[{"_id": "DPNv5qGdeqvAChbAs", "postedAt": "2023-01-09T07:59:33.208Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>Nope. I do not expect my children to live for 1000s of years, nor am I in the slightest bit worried about AI-induced disemployment, nor Skynet coming alive and killing everyone. There are all kinds of far more likely disaster scenarios I could worry about and don't, not least because I am deeply aware of how hard these things are to accurately forecast (unlike the median EA, who seemingly just takes a random 10-year-horizon Metaculus output as gospel) and because I have deep faith in the ability of the human race to adopt to novel risks posed by new technologies (as we have done in recent decades with threats as diverse as nuclear war, climate change, and covid). Fear is no way to life your life! Have some faith!  Rather I shall say with Haggai that \"the glory of this latter house shall be greater than of the former\".</p>\n", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "i9SGdqytAiKKEWPv5", "postedAt": "2023-01-09T10:41:49.199Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>I've recently started feeling more and more concerned as well. While in the past my worries were more intellectual, with the recent breakthroughs I start to actually <em>feel</em> scared.</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "Q7uRmLfortNc2CWnT", "postedAt": "2023-01-09T11:18:51.039Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>Dear @JonCefalu, thanks for this very honest, insightful and thought-provoking article!&nbsp;<br>You do seem very anxious and you do touch on quite a number of topics. I would like to engage with you on the topic of joblessness, which I find really interesting and neglected (i think) by at least the EA literature that I have seen.&nbsp;<br><br>To me, a future where most people no longer have to work (because AI and general robots or whatever take care of food-production, production of entertainment programs, work in the technoscientific sector) could go both ways, in the sense that: a) it can indeed be an s-risk dystopia where we spend our time consuming questionable culture at home or at malls (and generally suffer from ill-health and associated risks) (though with no job to give us money, I don't know how these transactions would be made, and I'd like to hear some thoughts about this) or b) it can be a utopia and a virtuous circle where we produce new ways of entertaining ourselves or producing quality time (family, new forms of art or philosphy, etc.) or keeping ourselves busy, the AI-AGI saturates the market, we react (in a virtuous way, nothing sinister), the AGI catches up, and so on.&nbsp;<br><br>So to sum up, the substance of the above all-too likely thought-experiment would be, in the event of AGI taking off, what will happen to (free) time, and what would happen to money? Regarding the latter, given that the most advanced technology lies with companies whose motive is money-making, I would be a bit pessimistic.&nbsp;<br><br>As for the other thoughts about nuclear weapons and Skynet, I'd really love to learn more as it sounds fascinating and like stuff which mere mortals rarely get to know about :)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Haris Shekeris"}}, {"_id": "nqEnDmmSwjyBun9Yg", "postedAt": "2023-01-09T11:21:43.678Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>Yes. Many of us are freaking out about this. The situation has gotten increasingly scary.</p>", "parentCommentId": null, "user": {"username": "deluks917"}}, {"_id": "iCc5J2QhuXebAh4Fa", "postedAt": "2023-01-09T11:58:49.152Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>On mass unemployment: at least until we reach AI that can replace every human worker (which needs big advances in robotics, not just machine learning), I don't see why A.I. should be different from other labour-saving devices that perform work that humans used to do &nbsp;manually. And those haven't caused mass unemployment in the past, they've just made us richer. Maybe A.I. will be different, even before it can replace any human worker on any job (and again to know how far away that is, you need to be watching robotics, not just machine learning). But I think the burden of proof is on people saying it will.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dr. David Mathers"}}, {"_id": "LHJHnBWwDXBDqWhPu", "postedAt": "2023-01-09T13:08:35.234Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>The speed at which AI will progress the next decades will be faster than technological changes in the past. In the longterm, if the road to AGI goes well, job loss might not be an issue because of the vast richness the world will have. But in the short-to-medium term, if there's not some sort of UBI, we'll see massive job losses that won't easily (or fast enough) be replaced by other jobs I'm afraid.</p>\n", "parentCommentId": "iCc5J2QhuXebAh4Fa", "user": {"username": "Jeroen_W"}}, {"_id": "XKEQMXzBMnDkvjnNn", "postedAt": "2023-01-09T13:30:56.398Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>also, I swear, is there some conspiracy to talk up everything OpenAI does? Do people realize that every time an EA says \"I'm scared about AGI takeoff\", Sam Altman rubs his hands together and adds another hundred million to the sale price for Microsoft to buy the company? Is the idea that we can swap billionnaire Sams around and make up the loss of SBF's money through everyone with a lot of stock &amp; options in OpenAi getting filthy rich??? IS THIS ALL PART OF WILL MACASKILL'S MASTERPLAN???<br><br>stay tuned!</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "EWLtDvZn7uvb5b6Ly", "postedAt": "2023-01-10T00:23:05.008Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>I believe marginal utility simply means that automation will reduce the cost of many things to negligible, meaning our resources will be free to spend on other domains that are by definition not automated and still labor intensive.</p>\n<p>At the point there is no such job, we'll have, also by definition, achieved radical abundance at which point being jobless doesn't matter.</p>\n<p>Wouldn't a UBI then artificially prop up the current economy to the detriment of achieving radical abundance? Because it would be paid for via a tax of some kind on these \"so abundant it's free\" goods and keep them from becoming....so abundant they're free, no?</p>\n<p>Of all the things AGI concerns me about, losing my job is by far the least of my worries.</p>\n", "parentCommentId": "LHJHnBWwDXBDqWhPu", "user": {"username": "Brian E Adams"}}, {"_id": "8sNnTJbzbhmr4Wsnm", "postedAt": "2023-01-10T06:01:42.766Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>Dear friends, you talk about AI generating a lot of riches, and I get the feeling that you mean 'generate a lot of riches for everybody' - however, I fail to understand this. How will AI generate income for a person with no job, even if the prices of goods drop? Won't the riches be generated only for those who run the AIs? Can somebody please clarify for me? I hope I haven't missed something totally obvious</p>", "parentCommentId": "iCc5J2QhuXebAh4Fa", "user": {"username": "Haris Shekeris"}}, {"_id": "Zb3ETfSMCDTYB9NvJ", "postedAt": "2023-01-10T07:11:06.335Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>You’re absolutely right.  Unless tax policy catches up <em>fast</em>, stuff like the robots that replace fast food chefs is taking money out of the little guy’s wallet and right into the hands of the wealthiest business moguls who no longer have to pay human wages.</p>\n<p>This fundamental issue is addressed very well in an excellent book you might love to check out, called Taxing Robots, by Prof. Xavier Oberson, a Swiss economist.   Here’s the book on Amazon: <a href=\"https://a.co/d/eWjvuWE\">https://a.co/d/eWjvuWE</a> and here’s a summary:  <a href=\"https://en.empowerment.foundation/amp/taxing-robots-by-xavier-oberson-professor-at-geneva-university-attorney-at-law-1\">https://en.empowerment.foundation/amp/taxing-robots-by-xavier-oberson-professor-at-geneva-university-attorney-at-law-1</a></p>\n<p>After getting even a page in, the core premise of the book seemed so obvious in retrospect, but hasn’t caught on as a possible solution:  we need to fix the fact that algorithms and robots don’t pay income tax!  Income tax <em>disincentivizes</em> human labor, thus effectively subsidizing robots!  This needs to be fixed!</p>\n<p>There are two possible solutions:</p>\n<p>Left-wing approach:  tax algorithmic labor at a similar or higher rate as human labor</p>\n<p>Right-wing approach:  repeal income tax!  Make entitlement cuts to help fix the budget but also add back lost tax revenue by making so-called “Pigouvian” taxes on harmful activities like pollution.</p>\n<p>Though my politics lean a bit more left, I think this is an area where republicans have the ideological advantage, as getting rid of income tax and standing up a new carbon tax is doable,   Whereas in the dem’s solution, you need to somehow define what is labor-saving automation in the tax code, which seems really hard to define fairly due to the influence of special interests.</p>\n<p>Though I voted for Obama and Biden, I would happily vote for DeSantis if he ran on repealing income tax and fixing the budget gap in other ways that don’t penalize human workers!</p>\n", "parentCommentId": "8sNnTJbzbhmr4Wsnm", "user": {"username": "JonCefalu"}}, {"_id": "vgZ4rQzeMWJgJHkSP", "postedAt": "2023-01-10T08:10:04.674Z", "postId": "2bQrhgkK2DxLtNGbj", "htmlBody": "<p>Dear Jon,&nbsp;<br><br>Many thanks for this, for your kindness in answering so thoghtfully and giving me food for thought too! I'm quite a lazy reader but I may actually spend money to buy the book you suggest (ok, let's take the babystep of reading the summary as soon as possible first). If you still don't want to give up on your left leanings, you may be interested in an older classic (if you haven't already read it): <a href=\"https://en.wikipedia.org/wiki/The_Great_Transformation_(book)\">https://en.wikipedia.org/wiki/The_Great_Transformation_(book)</a><br><br>The great takeaway for me from this book was that the 'modern' (from a historical perspective) perception of labor is a relatively recent development, plus that it's an inherently political development (born out of legislation rather than as a product of the free market). My own politics (or scientopolitics let's call them) are that politics and legislation should be above all, so I wouldn't feel squeamish about political solutions (i know this positions has its own obvious pitfalls though).&nbsp;</p>", "parentCommentId": "Zb3ETfSMCDTYB9NvJ", "user": {"username": "Haris Shekeris"}}]