[{"_id": "qNyToKC9ydcepPFBp", "postedAt": "2023-12-18T13:36:49.142Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p>Great comprehensive post, Max!</p><blockquote><p>Most AI companies have themselves published some sort of non-binding mission statement setting out their commitment to ensuring that AI is a net-positive for humanity, such as the&nbsp;<a href=\"https://openai.com/charter\"><u>OpenAI Charter</u></a> and Anthropic’s&nbsp;<a href=\"https://www.anthropic.com/index/claudes-constitution\"><u>in-house constitution</u></a> (which includes principles based on the Universal Declaration of Human Rights and various other sources)<a href=\"https://forum.effectivealtruism.org/posts/2cZAzvaQefh5JxWdb/bringing-about-animal-inclusive-ai#fnb3ljbj2flo\"><sup>[4]</sup></a>. &nbsp;Again, animals are notably absent from these mission statements and again, while we should be very wary of corporate lip service, their inclusion seems like a necessary first step to ensuring that the AI systems they develop respect animals’ interests.</p></blockquote><p>As a side note, there is also no mention of \"digital minds\", \"digital sentience\", \"artificial minds\" nor \"artificial sentience\" in <a href=\"https://openai.com/charter\">OpenAI's Charter</a>, <a href=\"https://www.anthropic.com/index/claudes-constitution\">Claude's Constitution</a> or <a href=\"https://deepmind.google/about/\">Google DeepMind's mission</a>. I guess quite some people working on these labs think digital minds will become a reality in the next few decades, and some even say they would work on it if timelines were not so short, so it is a little surprising the labs are not more vocal about it.</p><blockquote><p>Moves in this direction by the more ethically oriented developers like Anthropic and OpenAI</p></blockquote><p>Nitpick. I thought Anthropic and Google Deepmind were the 2 most ethical developers among them and OpenAI.</p><blockquote><p>Promisingly, the&nbsp;<a href=\"https://reliefweb.int/sites/reliefweb.int/files/resources/24797GSDR_report_2019.pdf\"><u>2019 UN Global Sustainable Development Report</u></a> did identify animal welfare as a key missing issue in the 2030 Agenda for Sustainable Development and the SDGs, and various advocacy groups are campaigning for an&nbsp;<a href=\"https://sdg18.org/\"><u>additional SDG focussed on eliminating animal exploitation</u></a>.</p></blockquote><p><a href=\"https://sdg18.org/\">SDG 18</a> (zero animal exploitation) looks like a great initiative. I had no idea it existed; thanks for sharing!</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "kuycys2vtf6QrtBaX", "postedAt": "2023-12-18T14:43:00.895Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p><strong>Executive summary</strong>: Bringing about animal-inclusive AI will require concerted efforts across government, academia, industry, and civil society to represent animals' interests, conduct research, raise awareness, and build partnerships.</p><p><strong>Key points:</strong></p><ol><li>Governments should include animals explicitly in AI commitments and regulations to assess risks and represent animals' interests.</li><li>Companies should include animals in mission statements, governance, risk assessments, and address biases in models.</li><li>More research is needed on AI's impacts on animals and bridging AI safety and animal advocacy fields.</li><li>Advocacy groups should expand scope to AI risks, build partnerships, and increase public understanding.</li><li>A thriving community is needed across sectors to ensure AI benefits rather than harms animals.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "3BkPrZGYW6AqHx6zL", "postedAt": "2023-12-20T22:43:06.827Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p>Thanks for this post, Max!</p><p>&nbsp;</p><p><strong>tl;dr: Lemme know if you have ideas for approaches to animal-inclusive AI that would also rank among the most promising ways to reduce human extinction risk from AI.</strong> I think they probably don't be exist, but it'd be wicked cool if they did.</p><p>&nbsp;</p><p>Most EAs working on AI safety are primarily interested in reducing the risk of human extinction. I agree that this is of astronomical importance, especially when you consider all the wild animal suffering that would continue in our absence.</p><p>Many things that would move us toward animal-inclusive AI would also help move us away from extinction risks. But I suspect the majority of those things, while helpful, would not be among the <i>most</i> helpful ways to reduce extinction risk. In other words, we should be wary <a href=\"https://forum.effectivealtruism.org/posts/omoZDu8ScNbot6kXS/beware-surprising-and-suspicious-convergence\">suspicious convergence</a>; \"what is best for one thing is usually not the best for something else.\"</p><p>I'm working on plans to do more to support a rigorous search for approaches to animal-inclusive AI (or approaches to advancing wild animal welfare science broadly) that would also rank among the most promising ways to reduce human extinction risk from AI. In the meantime, I'd encourage anyone interested in the broader subject to consider this narrower subset, and to reach out to me if they're excited to work on it more (cameronms@wildanimalinitiative.org).</p><p>To be clear, I also think animal-inclusive AI is worth pursuing for its own sake (i.e., working on animal-inclusive AI seems likely to be among the most impactful things you can do to make the world a better place in the set of scenarios where humans don't go extinct), and I'd be excited to see work on most of the approaches discussed above. In those cases -- especially when building coalitions with people who might have different priorities -- I think it's useful to be transparent about the fact that what we're doing is important, but we don't think it's one of the most promising ways to avoid human extinction.</p>", "parentCommentId": null, "user": {"username": "Cameron_Meyer_Shorb"}}, {"_id": "b2ML7Yf5DgsDSgAWK", "postedAt": "2023-12-21T18:28:15.090Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<blockquote><p>I'm working on plans to do more to support a rigorous search for approaches to animal-inclusive AI (or approaches to advancing wild animal welfare science broadly) that would also rank among the most promising ways to reduce human extinction risk from AI.</p></blockquote><p>Interesting! I am interesting in discussing this idea further with you.</p><p>Could it be the case that another way to think about it is to search within the best approaches to reduce human x-risk, for a subset that is aslo animal inclusive? For example, if working on AI alignment is one of the best ways to reduce human x-risk, then we try to look for the subset within these alignment strategies that are also animal friendly?</p>", "parentCommentId": "3BkPrZGYW6AqHx6zL", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "Dr8aLmZkfddpT8AiK", "postedAt": "2023-12-29T10:13:46.387Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p>I’m curating this post. It is an impressively detailed resource for considering the impact of present and future AI systems on animals, and the steps governments and corporations could take to lessen that impact. It’s full of good ideas, expressed with the right amount of epistemic modesty.&nbsp;<br><br>The effect of AI on animals, today and in the future, is an important and neglected topic. I’m glad that this post was written, and I hope more people seriously consider these risks, and whether they can do something about them.&nbsp;<br><br>If you’d like to find out more, I’d recommend&nbsp;<a href=\"https://link.springer.com/article/10.1007/s43681-022-00187-z\"><u>this paper</u></a> by Peter Singer and Yip Fai Tse.</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "mMfXhwj8BKPXhYh5L", "postedAt": "2023-12-31T11:27:19.570Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p>Cheers Vasco! Glad you found it helpful and thanks for the useful points :-)</p>", "parentCommentId": "qNyToKC9ydcepPFBp", "user": {"username": "max_blakemore"}}, {"_id": "MGgkNB7zKnFFvRir7", "postedAt": "2023-12-31T11:33:43.272Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p>Thanks Cameron! That's a helpful point that I didn't really touch on in this post. Great that you're doing work in that space - I'm really interested to hear more about it so will get in touch.</p>", "parentCommentId": "3BkPrZGYW6AqHx6zL", "user": {"username": "max_blakemore"}}, {"_id": "vqRYWCyukWkEiZdRm", "postedAt": "2024-01-01T15:22:41.522Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p>Your second section outlines the importance of not putting political principles like democracy above moral ones like the inherent value of sentient life / negative utility of suffering. Democracy is a means to an end (that being a fair society where living beings can flourish). It shouldn't be an end in and of itself. Where democracy and animal rights/welfare conflict, I will always choose animal rights/welfare. The same applies to human rights as well.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Hayven Jackson"}}, {"_id": "AiQmbzz9k84APq5gK", "postedAt": "2024-01-03T19:11:11.387Z", "postId": "2cZAzvaQefh5JxWdb", "htmlBody": "<p>Thanks for highlighting that point Hayven - I agree, and also hope we get to the point where animals are sufficiently well represented in democratic decision-making that those kinds of conflicts are massively reduced.</p>\n", "parentCommentId": "vqRYWCyukWkEiZdRm", "user": {"username": "max_blakemore"}}]