[{"_id": "3tpMBZtApFxz7GFGT", "postedAt": "2022-09-01T16:48:50.573Z", "postId": "2dHk3zBmmnNTefjWB", "htmlBody": "<p>I liked both this episode and the one on social justice last winter and would love to hear more semi-adversarial ones of this sort.</p>\n", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "LpvbdPMwzQPWDNSSt", "postedAt": "2022-09-02T12:44:48.968Z", "postId": "2dHk3zBmmnNTefjWB", "htmlBody": "<p>Thanks! :) I’m glad you enjoyed the episodes, and yes, we’d like to do more episodes where we bring on people that disagree (and find out why they disagree).</p>", "parentCommentId": "3tpMBZtApFxz7GFGT", "user": {"username": "spencerg"}}, {"_id": "Xm6CGnLojfhmcmi6s", "postedAt": "2022-09-02T12:46:31.757Z", "postId": "2dHk3zBmmnNTefjWB", "htmlBody": "<p>A quote on centralization in EA (in which Ajeya was steelmanning an argument Michael had made):&nbsp;</p><blockquote><p>My understanding of your position is that it's difficult to figure out what the most important causes are — to simplify a little bit and say there's one most important cause as opposed to the most important or optimal portfolio. EA has a pretty small set of intellectual leaders that are trying to think about this and then disseminating their conclusions. And because this is a really difficult project, they're going to get it wrong a lot. But they're also going to influence a pretty large number of people to work on whatever they say is the current best thing that they believe. Even if that's completely in good faith, you're like, “Well, people should just have a policy of listening less to such intellectual leaders and doing their own thing more.\" And that could have led to a faster convergence on the optimal cause or optimal portfolio or whatever it is.</p></blockquote>", "parentCommentId": null, "user": {"username": "spencerg"}}, {"_id": "eJBHcoD9NnjnSNaFE", "postedAt": "2022-09-02T12:47:54.851Z", "postId": "2dHk3zBmmnNTefjWB", "htmlBody": "<p>Michael on expected value calculations and legibility:</p><blockquote><p>I think if you've been an effective altruist in the 1660s trying to decide whether or not to fund Isaac Newton — the theologian, astrologer, and alchemist — he had no legible project at all. That would have looked just very strange. You would have had no way of making any sense of what he was doing in terms of an EV point of view. He was laying the foundations for a worldview that would enable the Industrial Revolution and a complete transformation in what humanity was about. That's true for a lot of the things that have been the most impactful.</p></blockquote>", "parentCommentId": null, "user": {"username": "spencerg"}}]