[{"_id": "iajnMKnKxMw2tjbuM", "postedAt": "2023-11-19T15:35:17.324Z", "postId": "2DKhv5iAQbbeRLMGo", "htmlBody": "<p>I find pieces like this frustrating because I don't think EA ever \"used to be\" one thing. Ten people who previously felt more at home in EA than they currently do will describe ten different things EA \"used to be\" that it no longer is, often in direct conflict with the other nine's narratives. I'd much prefer people to say, \"Here's a pattern I'm noticing, I think it is likely bad for these reasons, and I think it wasn't the case x years ago. I would like to see x treated as a norm.\"</p>", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "qdtFDkSSy8Qm3G9xk", "postedAt": "2023-11-19T17:10:57.282Z", "postId": "2DKhv5iAQbbeRLMGo", "htmlBody": "<blockquote>\n<p>It is inevitable that the EA brand will now be associated with irrational feminized college students rather than interesting quantitative thinkers willing to bite socially undesirable bullets. In many ways this association will be correct in practice, because we are outnumbered.</p>\n</blockquote>\n<p>I dislike this part, especially the phrase \"irrational feminized college students\".</p>\n", "parentCommentId": null, "user": {"username": "harfe"}}, {"_id": "eLe25yqKMzRpdcP6d", "postedAt": "2023-11-19T19:01:50.584Z", "postId": "2DKhv5iAQbbeRLMGo", "htmlBody": "<p>Not only is this passage crude and offensive, it's also wrong. If you look at the negative stereotypes of EA, it's primarily about EA being too emotionless and utilitarian, or being too weird (think the ftx trial coverage). Or more recently, about EA being too scared of AI and blocking progress.&nbsp;</p>", "parentCommentId": "qdtFDkSSy8Qm3G9xk", "user": {"username": "titotal"}}, {"_id": "voNqoFawADnu5HYsi", "postedAt": "2023-11-19T21:41:09.206Z", "postId": "2DKhv5iAQbbeRLMGo", "htmlBody": "<p>This phrase is highly sexist and doesn't mean anything, especially since the demographics have barely changed (from 26% to 29% of women...wouldn't call it a shift in demographics), and what does that mean that women cannot use strong quantitative evidence? I don't need to say how ridiculous.</p><p>I don't see the point of this text. It doesn't touch upon anything specific, remaining very vague as to what are the 'old values'. The thing about charities is also surprising giving OpenPhil's switch to GCR, funding less and less neartermist charities (human at least, animal-based charities might get more funding given the current call for that now).</p>", "parentCommentId": "qdtFDkSSy8Qm3G9xk", "user": {"username": "Vaipan"}}, {"_id": "FL4t5meud5JnBQmkP", "postedAt": "2023-11-19T22:40:08.591Z", "postId": "2DKhv5iAQbbeRLMGo", "htmlBody": "<p>In a nutshell: “EA has gone woke and I don’t like it!” Poorly written, poorly argued, vague, unoriginal, offensive, and wrong.</p>\n", "parentCommentId": null, "user": {"username": "Yarrow Bouchard"}}, {"_id": "BntBCK5QJPJSHtDz3", "postedAt": "2023-11-20T00:07:57.708Z", "postId": "2DKhv5iAQbbeRLMGo", "htmlBody": "<p>There'svery little actual substance in this blog. Mainly allusions and shorthand for things in the author's brain, combined with a disdain for government intervention.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "iKfd7i6SngKdjaH9L", "postedAt": "2023-11-24T13:50:00.958Z", "postId": "2DKhv5iAQbbeRLMGo", "htmlBody": "<p>I find articles like this somewhat vexing because I don't believe EA was ever consistently one thing in the past. Ten individuals who once felt more connected to EA will likely describe ten different aspects of what EA \"used to be,\" often conflicting with one another. I'd prefer individuals to express observations like, <a href=\"https://sassastatuscheck.org.za/\">\"</a>Here's a pattern I've noticed, and I believe it may have negative implications for these reasons. Additionally, I think this pattern wasn't as prevalent x years ago. It would be preferable for x to be treated as the norm.\" This way, discussions can be more nuanced and focused on specific patterns and their potential impact.</p>", "parentCommentId": null, "user": {"username": "exad3545"}}]