[{"_id": "R3R2BwJ62LXK8zxTz", "postedAt": "2023-07-17T23:41:34.686Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>How was the list of universities determined?</p>\n", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "xdw3a6QhZxAAAi74B", "postedAt": "2023-07-18T00:37:04.860Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>Will you push (or help) students to apply to \"Harvard, MIT, Princeton, Yale, Amherst, Dartmouth, and Bowdoin\" and other top universities that offer enough financial assistance? Getting them into one of those seems far cheaper than paying for their tuition at an expensive university without enough financial assistance.</p>\n<p>Are there enough excellent universities or programs with enough financial assistance globally that you should just focus on helping students get into those instead of funding them to attend the top universities without enough financial assistance?</p>\n<p>(EDIT: To be clear, by \"enough financial assistance\", I mean that the cost for the student after any needs-based aid, scholarships and help from their parents will be low enough to not be a significant deterrent to attending.)</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "ho2vpxcntDnBgXueE", "postedAt": "2023-07-18T09:56:41.661Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>In the US at least, I believe there are relatively few schools that offer significant need-based financial aid to international students. But to the extent there are, spending a few thousand dollars on helping international students get into very-good-but-not-Harvard schools would seem to have a higher ROI than paying for four years at a very top school.</p>", "parentCommentId": "xdw3a6QhZxAAAi74B", "user": {"username": "Jason"}}, {"_id": "iuojGqHHrWyipJgHq", "postedAt": "2023-07-18T12:38:26.713Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>Does there exist an equivalent for Master's degrees?</p>", "parentCommentId": null, "user": {"username": "Santeri Koivula"}}, {"_id": "w76N7npHE85mgHWyB", "postedAt": "2023-07-19T21:36:49.990Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>This is a good programme but I think and strongly feel that the number of people that could be helped would be much higher if the programme was more global than just focused on the US and UK. Additionally, the value for money is higher in LMICs and hence impact is greater. For context the cost of tuition plus other fees for one person to attend Harvard for 4 years is roughly more than $300,000. This amount of money for example could fully pay for 50 undergraduate students for 4 years at top universities in Africa. So, if 10 awardees are selected for US/UK, the cost would be equivalent to 500 students in Africa for example being fully sponsored.</p><p>I am not implying that students in US and UK shouldn't receive scholarships but rather that a global eligibility could introduce a balance that would increase the ROI for each dollar spent.</p>", "parentCommentId": null, "user": {"username": "Zacharia Kafuko"}}, {"_id": "4o5kQJvFoFy82dd8Y", "postedAt": "2023-07-28T00:02:34.023Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>We produced our own ranking of US universities based on factors like school selectivity, academic quality of the student body, and revealed preference data (such as cross-admit yields), plus some other \"soft\" factors. We sanity-checked this against existing school rankings and anecdotal impressions of people who have a lot of context on the US admissions process. We primarily used national rankings to determine the UK universities in our list, along with some anecdotal evidence about Imperial being the next-best choice (after Oxbridge) for a lot of STEM students.</p>", "parentCommentId": "R3R2BwJ62LXK8zxTz", "user": {"username": "KaseyShibayama"}}, {"_id": "vkgXgumE4yFospa4K", "postedAt": "2023-07-28T00:03:51.715Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>We leave it up to our scholars to decide where to apply, but in our experience they're generally aware that applying to Harvard, MIT, etc. is a good idea.</p><p>We're open to offering support for admissions counseling to some applicants who don't quite meet the bar for a tuition-and-fees scholarship. (All applicants who do meet the bar are offered counseling.)</p>", "parentCommentId": "xdw3a6QhZxAAAi74B", "user": {"username": "KaseyShibayama"}}, {"_id": "cewQ4CCC3E5f73xuA", "postedAt": "2023-07-28T00:04:17.675Z", "postId": "2dntTcMEkDTzMta2D", "htmlBody": "<p>We offer scholarship support to master's students via our&nbsp;<a href=\"https://www.openphilanthropy.org/early-career-funding-for-individuals-interested-in-improving-the-long-term-future/\"><u>early-career funding program</u></a>.</p>", "parentCommentId": "iuojGqHHrWyipJgHq", "user": {"username": "KaseyShibayama"}}]