[{"_id": "9nSJZLAXW6kesfFFk", "postedAt": "2015-04-17T23:46:08.305Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Very good ! I share the intuition that influencing friends directly is one of the most effective ways we have of spreading important issues (EA).</p>\n<p>For friends that I expect will continue to be part of my life for a while, I introduce them to some of the important issues (effective charity, veganism, wild-animal suffering, existential risk) piece by piece, making sure that they like me as much as possible before I introduce an issue. I have a set amount of weirdness points, and I must spend them wisely. Making long-term associates/friends dislike me has a huge cost, since I can't influence anyone that dislikes me, and if someone dislikes me, that'll affect others' opinions of me as well, which makes it harder to influence them. I admit that I have only been doing this for a year, so I don't have much experience.</p>\n<p>Also, bravely done with the letters. : )</p>\n", "parentCommentId": null, "user": null}, {"_id": "kopudva8uXW4f337S", "postedAt": "2015-04-18T00:56:48.282Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Cool! It sounds like you've done this quite a bit, so I'd love to hear how it went for you:</p>\n<ul>\n<li>How many people have you tried hard-selling this way?</li>\n<li>How did the responses break down (positive vs. negative vs. none)?</li>\n<li>Of the positive responses, what ended up coming of it (donations, other actions)?</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "DS9iseLSNw88jQPX8", "postedAt": "2015-04-18T16:14:56.577Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Ah, I actually only started experimenting with hard-selling when I sent the emails above for my current Experience Poverty fundraiser, the last of which I sent just before posting. I'll report back later here and in the <a href=\"https://docs.google.com/spreadsheets/d/1LS9Jc1RP4vxJ5yrkhw_h3DX_XFyOXxBYANKp-BRUT0c/edit#gid=0\">spreadsheet</a>! (Though it'll be hard to tell the results, especially via emails to people I won't see in person - I have come up with a few ideas for how to tell, not replicable by others.)</p>\n<p>I sent 66 of these emails, and may send a few dozen more. I've had a trickle of replies already, all positive and around half strongly so (saying &quot;Yes it is a strong sell but it worked on me!&quot;, or that they'd share the info with their friends - the only significant action that I heard of).</p>\n<p>Before this I've mainly done weak sells, and a handful of mid-strength ones. I've recorded some of these in the spreadsheet and may add some more. Broadly my experience has been that some people are receptive and others aren't, and that going up to a mid-strength sell doesn't affect this (except in one case, where I convinced someone to pledge 5% from being quite sceptical).</p>\n", "parentCommentId": "kopudva8uXW4f337S", "user": {"username": "Tom_Ash"}}, {"_id": "WEw9s3LN668XasyRs", "postedAt": "2015-04-18T16:15:36.779Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Which of those issues do you find them most receptive to?</p>\n", "parentCommentId": "9nSJZLAXW6kesfFFk", "user": {"username": "Tom_Ash"}}, {"_id": "bcXv9swnJcw2YazkS", "postedAt": "2015-04-18T18:21:12.332Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Looking forward to the results!  Definitely would be interested in seeing this replicated for other people -- maybe I'll get the courage to try it myself.  Could also try randomly varying the magnitude of the sell.</p>\n", "parentCommentId": "DS9iseLSNw88jQPX8", "user": {"username": "Peter_Hurford"}}, {"_id": "T4z8RukA7zJppaEKq", "postedAt": "2015-04-18T18:21:40.226Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<blockquote>\n<p>Of the positive responses, what ended up coming of it (donations, other actions)?</p>\n</blockquote>\n<p>I'm curious how easy it would be to detect these actions conditional on them happening.</p>\n", "parentCommentId": "kopudva8uXW4f337S", "user": {"username": "Peter_Hurford"}}, {"_id": "D2kENnMzBnRYXRu2A", "postedAt": "2015-04-19T05:13:49.768Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Cool. For what it's worth, I tried doing similar things in college for a while without very much lasting effect--people would come to a couple events or otherwise be initially positive but not really sustain interest or motivation. After a while I noticed and stopped being so vocal and only mentioned EA when it came up naturally (events, HCEA-related stuff, etc.). A couple years later, a bunch of the people I tried to sell on it earlier got interested of their own accord.</p>\n<p>Our samples of people probably differ a lot, and obviously the long game isn't practical for people you don't see frequently--just mentioning this as another anecdotal datapoint.</p>\n", "parentCommentId": "DS9iseLSNw88jQPX8", "user": {"username": "Ben_Kuhn"}}, {"_id": "hA4LxnG7xw5Ee6tFL", "postedAt": "2015-04-19T21:33:50.660Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>I'd be interested to get WIll Crouch or Toby Ord's views on this - they both persuaded me to go from a floundering altruist concerned about making a difference to someone that thinks broadly and comparatively about how to make the most difference. They both did it pretty quickly - i.e. 10 minutes of conversation. They did it without reference to the work they were doing but with reference to the decisions and issues I was bringing up myself. They didn't ever once use the words 'effective altruism'. </p>\n<p>The success of this approach ties in well with sales theory: question first talk later. Tailor your message etc. etc.</p>\n<p>And from what I've seen of evangelism in christianity, you always start with someone's problems / where they're at. Then you demonstrate how they could be solved. Let it stew for a bit, then, for some ofthe less sublte forms, create some amazing social / emotional experience.</p>\n<p>Having said all this, I've been useless at persuading people. I think I get too excited and fail to listen deeply enough. People close to me have been receptive over a long period of time. I think you need to have some solid background altruism to start with if you're going to be convinced? </p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "SJtkjmZJ2BvBQZdBv", "postedAt": "2015-04-19T23:59:25.652Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>This is really interesting. I have a lot of thoughts about this (most of which I might elaborate in a separate post) but I'll post a quick summary here.</p>\n<p>I think one of the biggest challenges to spreading EA right now is perhaps that we rely too much on word-of-mouth. It would be better to have some sort of centralized social media or infrastructure that we can use to share EA more broadly. EA.com is a very good one, but even that requires a large amount of reading, and people might be put off by the large amount of learning/background info needed to get involved.</p>\n<p>In Kahneman's &quot;Thinking Fast &amp; Slow&quot;, he repeatedly points out that the main way in which most people decide to donate to charities is by intensity matching--they look at a charity (e.g., saving dolphins), quickly assess how much they feel about a certain cause (&quot;yeah, I care a bit about saving dolphins&quot;) and then match a net value to that amount (&quot;sure, I'll donate $50 to that&quot;). Most charities draw on a person's System 1.</p>\n<p>EA, of course, does not do this. EA's core tenet is basically to draw upon someone's System 2, and as a result, it almost excludes people who donate to charities based on S1. Perhaps one could argue that since we want EA to teach people to <em>actively use</em> their S2 to evaluate charities, not catering to S1-centric charity evaluators might be desirable. However, I think the net utility gained from:</p>\n<p>a) widely promoting S1-type ad campaigns, </p>\n<p>b) still allowing people to access S2-type information</p>\n<p>would generate a lot more money and involvement than just making an S2 hard-sell. This is not too different from EAs who say &quot;Yes, I'll donate to GiveWell's top charities [even though I don't want to spend the time to actually learn why these charities are effective myself]&quot;.</p>\n<p>tl;dr: To actively promote EA and reach wider audiences, we should be doing more to produce the heartwrenching sob-story ad campaigns (youtube videos, etc.) that other big name charities do, and only really promote the analysis to people who have interest in hearing it. </p>\n", "parentCommentId": null, "user": {"username": "Anj"}}, {"_id": "j5XmczrxJrAxkbaMj", "postedAt": "2015-04-20T14:34:58.244Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Thanks for this Tom.</p>\n<p>When you talk about the negatives of selling, you focus on the personal negatives. I think there may also be substantial negatives in the longer term for the amount of good people do in the world. The basic mechanism is that people only get first impressions of a set of ideas (such as effective altruism) once, and if you give them a negative impression this could colour their future reactions and turn them off the ideas, when if their first experience was more positive they might end up supportive. </p>\n<p>I think it's important to be aware of and steer clear of these dangers. In a forthcoming report I look into how we can estimate the true counterfactual impact of different activities which impact movement growth. Right now my impression of your email is that it is probably net positive if we can gather useful information and learn from it, but might well be net negative to scale up.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "Xk56RFeAN8AdrWf5F", "postedAt": "2015-04-20T21:13:54.108Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>The people I emailed are very unlikely to hear about effective charity or effective altruism (through some medium that they seriously register) in any other way.</p>\n", "parentCommentId": "j5XmczrxJrAxkbaMj", "user": {"username": "Tom_Ash"}}, {"_id": "HryyExQ96hGqzfc43", "postedAt": "2015-04-20T22:50:50.141Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>This could be true in the short term. In the longer term I think we should hope that the concept takes off, as environmentalism has, and that most people will hear about it, so &quot;very unlikely&quot; seems unduly pessimistic. </p>\n", "parentCommentId": "Xk56RFeAN8AdrWf5F", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "HeYcicvHsnbQuggXN", "postedAt": "2015-04-20T23:48:41.566Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p><a href=\"https://play.google.com/store/books/details?id=9U1K5LjUOwEC&amp;source=productsearch&amp;utm_source=HA_Desktop_US&amp;utm_medium=SEM&amp;utm_campaign=PLA&amp;pcampaignid=MKTAD0930BO1&amp;gl=US&amp;gclid=CjwKEAjwx9KpBRCAiZ_tgYKWvhQSJABQjGW-c2zSpZlbDdDZOXUu8Tf5cFVTW3weuRs7Mn3o3DPCMBoCtXrw_wcB&amp;gclsrc=aw.ds\">Diffusion of Innovations</a> is a book that shows that only the most innovative few percent of people adopt innovations from mass media - everyone else generally adopts because of word of mouth.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "7WwA7D6s3Tvoudp2R", "postedAt": "2015-04-21T14:02:40.197Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>I think it's appropriately pessimistic, or, as I'd prefer to put it, realistic ;)</p>\n", "parentCommentId": "HryyExQ96hGqzfc43", "user": {"username": "Tom_Ash"}}, {"_id": "2LFksbCsdfhuqonsM", "postedAt": "2015-04-21T16:08:02.700Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>This topic is of much interest to me as someone new to EA, who (as a lawyer) has a lot of friends with a lot of money. I'm holding off on the hard sell until I'm sure I know what I'm doing. Giving What We Can's calculator gave me this idea for a REALLY HARD sell, which plays on the role of default-based biases. The numbers assume a U.S. lawyer about six years out of law school who is paid market rate and gives away 75% of his income:</p>\n<p>Yesterday the managing partner at my firm visited me and said, Michael, you've been working very hard for a long time, and the executive committee has taken notice. Indeed, because of your hard work you've been rewarded with an annual salary that puts you among the top 0.4% wealthiest people in the world. But we think you can do better. We are willing to increase your salary to put you among the top 0.1% wealthiest people in the world, and all it will cost is the lives of 65 people/year -- but don't worry, those people live thousands of miles away. What do you say?</p>\n", "parentCommentId": null, "user": {"username": "mhpage"}}, {"_id": "AY4B8kemPqN4DWKD7", "postedAt": "2015-04-22T07:38:58.442Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>I'd love to hear your view on the 10th percentile / median / 90th percentile sizes the group reaches before stagnating. </p>\n", "parentCommentId": "7WwA7D6s3Tvoudp2R", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "HGGsXhyvJmDwBsJeQ", "postedAt": "2015-06-11T17:05:58.958Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>I had essentially the exact same experience.</p>\n", "parentCommentId": "D2kENnMzBnRYXRu2A", "user": {"username": "Jonas Vollmer"}}, {"_id": "9zjDCfN7tPs6wRisq", "postedAt": "2015-07-29T16:27:15.210Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>(Update on how this went to come - it's been on my to do list for months, but with too much else above it, so I figured that at this stage I should flag that it's to come.)</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "33Xuy7BfhksvKyFij", "postedAt": "2015-12-07T01:38:15.343Z", "postId": "2DyWySGtWGNTCiAqr", "htmlBody": "<p>Good article!</p>\n", "parentCommentId": null, "user": {"username": "josephkijewski1"}}]