[{"_id": "4etnnePDPBeRGgorA", "postedAt": "2023-02-18T05:50:02.800Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I am at best 1/1000th as \"famous\" as the OP, but the first ten paragraphs ring ABSOLUTELY TRUE from my own personal experience, and generic credulousness on the part of people who are willing to entertain ludicrous falsehoods without any sort of skepticism has done me a lot of damage.</p>", "parentCommentId": null, "user": {"username": "Duncan Sabien"}}, {"_id": "DvQbBZyJFb2MvRQd8", "postedAt": "2023-02-18T08:22:38.316Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I'm confused by your apparent belief that it's somehow difficult or costly to doubt claims of sexual assault. Sceptism of sexual assault claims isn't some brave and unusual stance, it's the cultural default. It's what \"believe women\" was an attempt to respond to. Because usually, people don't.</p>\n", "parentCommentId": null, "user": {"username": "britomart"}}, {"_id": "p9CjEWGDAeTHcpks9", "postedAt": "2023-02-18T11:13:00.544Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Thanks for writing this, I appreciate it a lot, especially that you wrote it on the forum. I recall you once said EAs wasn't edgy enough for you. How are we doing now?</p>\n<p>Regarding the time article my feelings are that several of the men in the article are no longer EA's, one having been banned from events for years. That said, discussion of the article has lead me to think there is a reasonable amount of undiscussed sexual harassment (notably J_J saying she gets far more reports about EA than comparable communities, Julia Wise treating J_J as a reasonable source and our community having a lot of men who struggle with social norms (myself included) and young women. so I buy the conclusion that there are harms here)</p>\n<p>So what, am I gonna tweet at Time and say that they were wrong, even though I think there is a problem roughly of the size they describe? I mean if you want to defend EA go for it, but I find that us doing it on Twitter is just a mess.</p>\n<p>And so if there is actually a discussion around sexual culture, it seems better to try and have that discussion then endlessly push back against Time. It's not that I'm skeptical or not - they are largely anonymous accusers and anonymous accused. My question is what happens (if anything) going forward.</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "pgKFoLNcotBpeFxmx", "postedAt": "2023-02-18T12:41:31.529Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Thank you for writing this, even after hearing your perspective I still can’t let go of the same feeling you initially described, that surely people wouldn’t just make up arbitrary lies to hate someone.</p>\n<p>I wonder to what extent untruths are exacerbated by telephone games. The whole Elon musk emerald mine nonsense, for example, seems to be uttered mostly by people who don’t know any better rather than by people intentionally trying to distort the truth.</p>\n", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "k6HYxjP9oFMwQvR5e", "postedAt": "2023-02-18T12:49:33.464Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Hey Aella, I appreciate you telling your story. I’m really sorry that you’ve experienced people lying about you, and making harmful assumptions about your intent . That really really sucks.&nbsp;</p><p><br>I’ve put more information about most (not all) of the Community Health team’s understanding of the TIME cases in this comment:<br><a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=jKJ4kLq8e6RZtTe2P\"><u>https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=jKJ4kLq8e6RZtTe2P</u></a>&nbsp;<br>It might clarify some of your questions about individual cases.&nbsp;</p>", "parentCommentId": null, "user": {"username": "cafelow"}}, {"_id": "26z7pBRtqrMsX3vzz", "postedAt": "2023-02-18T14:17:05.013Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Hey everyone, as usual, the moderators want to point out that this topic is heated for several reasons:</p><ul><li>Lots of relevant information comes from people's personal experiences, which will vary a lot.</li><li>These situations can be very serious and disturbing, and readers may have experienced appalling episodes.</li><li>Harassment and power dynamics are often emotionally loaded and can be difficult to discuss objectively.</li></ul><p>Some recent threads on similar topics devolved into fights, sometimes on things very tangential to EA, so we want to ask everyone to be especially thoughtful when discussing subjects this sensitive.</p><p>And as a reminder, harassment is unacceptable.</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "JXeGPFjeMzpihNNBo", "postedAt": "2023-02-18T15:03:19.891Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I think your general point is a good one—EA has been criticized for a lot of things, many critiques of EA are unfair, and journalists score points by writing salacious stories. I also agree that it's really hard to interpret some of the anecdotes in the TIME article without more context. But I don't agree with this:</p><blockquote><p>I’m&nbsp;<i>not</i> saying that EA is perfect or that nothing in the article is true, but rather that reading it, my gut instinct was that roughly 80% was entirely misleading</p></blockquote><p>I think we have good reason to believe the article is broadly right, even if some of the specific anecdotes don't do a good job of proving this. Here's a rough summary of the main (non-anecdote) points of the article:</p><ol><li>EA involves many \"complex professional relationships\" (true)</li><li>\"Most of the access to funding and opportunities within the movement [is] controlled by men\" (true)</li><li>\"Effective altruism’s overwhelming maleness, its professional incestuousness, its subculture of polyamory and its overlap with tech-bro dominated 'rationalist' groups have combined to create an environment in which sexual misconduct can be tolerated, excused, or rationalized away.\" This language is inflammatory (\"overwhelming\", \"incestuous\"), but we can boil this down to a more sterile sounding claim: \"EA is very male and there is a complex mixing of professional and personal relationships, partly because there are many polyamorous people in the EA/rationalist communities; this creates an environment in which sexual misconduct may be addressed suboptimally.\" This strikes me as totally plausible.</li><li>\"Several women say that the way their allegations were received by the broader EA community was as upsetting as the original misconduct itself. 'The playbook of these EAs is to discourage victims to seek any form of objective, third-party justice possible.'\" This is an ambiguous one: the Community Health Team <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in\">explicitly says otherwise</a> (\"if a crime happened, we think the victim should consider going to the police\"), but <a href=\"https://forum.effectivealtruism.org/posts/2zr2WbwfexBJSBunN/poorly-considered-throwaway-statements-harm-the-reputation\">boy</a><a href=\"https://forum.effectivealtruism.org/posts/xrmM6zWco9QEMxG6j/ways-in-which-ea-could-fail#Reputation_failures\"> is</a> <a href=\"https://forum.effectivealtruism.org/posts/KfqFLDkoccf8NQsQe/potential-downsides-of-using-explicit-probabilities\">there</a> <a href=\"https://forum.effectivealtruism.org/posts/maWneZjzQpigAFKPZ/ea-should-spend-its-funding-overhang-on-curing-infectious\">a </a><a href=\"https://forum.effectivealtruism.org/posts/av7MiEhi983SjoXTe/some-core-assumptions-of-effective-altruism-according-to-me\">lot</a> of discussion within EA about the importance of protecting EA's reputation, so someone might understandably feel pressure not to go to the police, even if no one ever told them not to.</li><li>\"The movement’s high-minded goals can create a moral shield, they say, allowing members to present themselves as altruists committed to saving humanity regardless of how they treat the people around them.\" (seems fair)</li><li>\"The hard question for the Effective Altruism community is whether the case of the EA house in San Francisco is an isolated incident, with failures specific to the area and those involved, or whether it is an exemplar of a larger problem for the movement.\" (I think people agree with this)</li><li>\"That balancing of interests is a starkly different approach than the one espoused by the #MeToo\" (true)</li><li>\"#MeToo urged society to 'believe women;' EAs tend to be a bit more skeptical.\" (also seems true)</li><li>\"EA’s polyamorous subculture was a key reason why the community had become a hostile environment for women.\" To be clear, I think this article is bigoted about polyamory, and I agree with <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/?commentId=cDnhvShDFhPfFBEpJ\">this</a>. But it's plausible that the polyamorous subculture contributes a hostile environment for women, <i>if only </i>because it is combined with a 2:1 male:female ratio and high tolerance for people hitting on each other in EA spaces. In general, the fact that a lot of people are polyamorous would seem to have two important implications: 1) more people are open to dating other people and 2) casually mentioning that you're in a relationship is less likely to signal to someone that they shouldn't hit on you. &nbsp;As a result of all of these things (not just the polyamorous subculture), women who don't want to be hit on at EA events may have a set of relatively suboptimal options—being hit on, or saying \"please stop hitting on me\". There are also upsides to the polyamorous subculture, including for women, but if there are more women in the \"I don't want to be hit on at this event\" camp than not, &nbsp;it's conceivable that the net effect is bad for women.</li></ol><p>Importantly, these kinds of claims are hard to substantiate with stories: I mean, how do you prove that the combination of gender imbalance in EA, men having disproportionate power in EA, mixture of professional and personal relationships, and polyamorous subculture have created an environment in which sexual misconduct is not addressed optimally? You suggest:</p><blockquote><p>The default orientation to this should be \"Let's carefully evaluate each claim by the evidence we have for it, and assess the context of those claims\", instead of an automatic \"believe and support every claim in this article, both the facts and the narrative the writer is trying to use those facts for.\"</p></blockquote><p>And sure; we should evaluate evidence critically. My impression was that people did basically adopt this orientation, at least as was evidenced in the comments section <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse\">here</a>.</p><p>But it's just hard to present evidence that conclusively proves the very reasonable—if possibly incorrect—hypothesis put forward by both the reporter and interviewees. In addition, &nbsp;this is <a href=\"https://nonprofitchronicles.com/2019/04/02/the-peculiar-metoo-story-of-animal-activist-jacy-reese/\">not the first time</a> these kinds of allegations have been made, <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/?commentId=gFi5roZeJBp9xu2PY\">other women</a> have since said they've grappled with gender issues, and the article includes unambiguously bad anecdotes (\"an influential figure in EA whose role included picking out promising students and funneling them towards highly coveted jobs... arranged for her to be flown to the U.K. for a job interview. [She was] surprised to discover that she was expected to stay in his home, not a hotel. When she arrived, she says, 'he told me he needed to masturbate before seeing me').</p><p>In sum, I think we have good reason to think that the article is broadly true, even if some of the specific stories leave a lot of questions unanswered. And I'm glad the Community Health Team is trying to <a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\">answer those questions</a>.</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "a3w4kr2bphbikZChX", "postedAt": "2023-02-18T15:50:05.611Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>As an initial matter, there any evidence that Ms. Joseph \"[went] to TIME to use this guy as evidence that EA has a sexual assault problem\"? Even if she did, it's OK for people to share their stories in whatever medium they feel comfortable with. They should not feel the need to censor themselves because their story might make EA look bad.&nbsp;</p><p>There is no evidence Ms. Joseph told the TIME reporter anything that was untrue or unfair. The described conduct was wildly inappropriate, and I don't think it is our place to criticize her reaction to it. Based on the presumptive identification of the other person, there seems to be a general consensus that he engaged in misconduct justifying a ban from EA and rationalist spaces.</p><p>The original poster, being \"mini-famous\", has a relatively effective platform to present whatever information she would like to present. Most of us do not, and can only bring significant public attention to our concerns through the media or other intermediaries. The reality is that the intermediary controls a lot of the message that actually gets published, but I don't think it is generally appropriate to attribute any problem with the intermediary's spin on the source.</p><p>To those who would prefer individuals who have experienced harassment and abuse not go to the media with their stories, I would suggest working on a more effective internal mechanism to listen to these individuals. To the extent one thinks media reporting presents an inaccurate picture, I would suggest better data collection to illuminate the actual scope of the problem.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "4pYHoFddTgkFeF4Fh", "postedAt": "2023-02-18T15:52:12.153Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I feel pretty unsure about this. I think the backlash towards believing women has been somewhat successful in at least leftist spaces in at least getting people to say that treating unverified accusations as credible is good and desirable and important.</p>\n<p>In EA, not all of it is a leftist space, and some parts of it have their own backlash against leftist influence. Moreover, in any group, including leftist groups that should in principle be on board with \"believe women\", the principle and practice don't necessarily line up. I think it's easy to fall into a trap of being outraged at the stories you've been told about women not being believed, but to fail to apply those lessons to cases closer to home where you don't know the truth and you do know the inconvenient details and you have some investment in protecting the status quo.</p>\n<p>So, does EA systematically \"believe women\"? Do we doubt claims of sexual assault with impunity? I think probably anyone who posted doubt on the Forum would get a bunch of pushback. However, that doesn't tell us much about how these claims are handled in private, or what the practical consequences are.</p>\n", "parentCommentId": "DvQbBZyJFb2MvRQd8", "user": {"username": "BenMillwood"}}, {"_id": "7m7mBToaNEHTQ2Ka9", "postedAt": "2023-02-18T17:09:53.087Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>This language is inflammatory (\"overwhelming\", \"incestuous\"), but we can boil this down to a more sterile sounding claim</p></blockquote><p>A major part of the premise of the OP is something like \"the inflammatory nature is a feature, not a bug; sure, you <i>can </i>boil it down to a more sterile sounding claim, but most of the audience will not; they will instead follow the connotation and thus people will essentially 'get away' with the stronger claim that they merely implied.\"</p><blockquote><p>The accuser doesn’t offer concrete behaviors, but rather leaves the badness as general associations. They don’t make explicit accusations, but rather implicit ones. The true darkness is hinted at, not named. They speculate about my bad traits without taking the risk of making a claim. They frame things in a way that increases my perceived culpability.</p></blockquote><p>I think it is a mistake to steelman things like the TIME piece, for precisely this reason, and it's also a mistake to think that most people are steelmanning as they consume it.</p><p>So pointing out that it <i>could</i> imply something reasonable is sort of beside the point—it <i>doesn't,</i> in practice.</p>", "parentCommentId": "JXeGPFjeMzpihNNBo", "user": {"username": "Duncan Sabien"}}, {"_id": "uvgMu7ayJnhzPsnNC", "postedAt": "2023-02-18T17:20:17.715Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I took Aella's post to be making a point about how <i>EAs</i> should read the article (\"I’m mostly posting this because to me, it feels like there’s an imbalance in the models people are using to make sense of this. I don’t want EA to overcorrect, but I want it to reach a reasonable equilibrium\").</p><p>I agree that \"most of the audience,\" i.e., readers of TIME who largely aren't familiar with EA, may well walk away from this article with an impression that's inaccurate. But why shouldn't EAs steelman it, especially when we have independent reasons to think many of the major claims in the article are true?</p>", "parentCommentId": "7m7mBToaNEHTQ2Ka9", "user": {"username": "hobbes"}}, {"_id": "NRpuKSSzygQ8Gjn5u", "postedAt": "2023-02-18T17:31:59.579Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>I think we have good reason to believe the article is broadly right, even if some of the specific anecdotes don't do a good job of proving this.&nbsp;</p></blockquote><p>If someone invests a lot of effort into searching for good evidence and comes up empty that's a signal for the availability of good evidence.&nbsp;</p><blockquote><p>But it's just hard to present evidence that conclusively proves&nbsp;</p></blockquote><p>That leaves the question of why it's hard. In plenty of communities, it's easy to find a lot of women who were sexually touched without their consent.&nbsp;</p><p>The fact that the article suggests that this is very hard to find that in the EA community, suggests that something goes right.&nbsp;</p><blockquote><p>\"#MeToo urged society to 'believe women;' EAs tend to be a bit more skeptical.\" (also seems true)</p></blockquote><p>This seems to make it sound like society on average updated due to #MeToo to 'believe women;' and EAs didn't. In reality, most of society didn't update. I would expect that on average EA might even lean more toward &nbsp;'believe women;' than the average person.</p><blockquote><p>partly because there are many polyamorous people in the EA/rationalist communities; this creates an environment in which sexual misconduct may be addressed suboptimally.\" This strikes me as totally plausible.</p></blockquote><p>One thing that distinguishes polyamorous people is that they are more willing to talk about sexual conduct of other people than most other groups. That results in some people feeling bad because they hear about sexual conduct, but it also helps to police bad conduct.</p>", "parentCommentId": "JXeGPFjeMzpihNNBo", "user": {"username": "ChristianKleineidam"}}, {"_id": "ociyZsWcryHdhGgsa", "postedAt": "2023-02-18T17:38:13.718Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Trying to \"steelman\" the work of an experienced adversary who relies on, and is exploiting, your tendency to undercompensate and not realize how distorted these things actually are - which is the practical, hard-earned knowledge that Aella is trying to propagate - seems like a mistake.</p><p>(Actually, trying to \"steelman\" is a mistake in general and you should focus on passing Ideological Turing Tests instead, but that's a much longer conversation.)</p>", "parentCommentId": "uvgMu7ayJnhzPsnNC", "user": {"username": "EliezerYudkowsky"}}, {"_id": "fGhK5n7dJMWyWLFvB", "postedAt": "2023-02-18T17:43:15.317Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I also attest that Aella is, if anything, severely underconveying the extent to which this central thesis is true. &nbsp; It's really really hard to convey until you've lived that experience yourself. &nbsp;I also don't know how to convey this to people who haven't lived through it. &nbsp;My experience was also of having been warned about it, but not having integrated the warnings or really actually understood how bad the misrepresentation actually was in practice, until I lived through it.&nbsp;</p>", "parentCommentId": "4etnnePDPBeRGgorA", "user": {"username": "EliezerYudkowsky"}}, {"_id": "u6vi2QJuepSGDfZjz", "postedAt": "2023-02-18T17:45:42.863Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>The essay itself is the argument for why EAs shouldn't steelman things like the TIME piece.</p><p>(I understand you're <i>disagreeing</i> with the essay and that's :thumbsup: but, like.)</p><p>If you set out to steelman things that were generated by a process antithetical to truth, what you end up with is something like [justifications for Christianity]; privileging-the-hypothesis is an unwise move.</p><p>If one has independent reasons to think that many of the major claims in the article are true, then I think the course most likely to not-mislead one is to follow <i>those</i> <i>independent reasons,</i> and not spend a lot of time anchored on words coming from a source that's pretty clearly not putting truth first on the priority list.</p>", "parentCommentId": "uvgMu7ayJnhzPsnNC", "user": {"username": "Duncan Sabien"}}, {"_id": "k4beFfkLAiyaiGzEh", "postedAt": "2023-02-18T18:01:37.095Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I admit that my desire to steelman this article stems from my personal experiences in EA, and my general sense—as a woman in EA, who is friends with other women in EA, and has heard stories from still other women in EA—that this article<i> does</i> get at something important about the Bay Area EA community, even if it makes some important mistakes, many of which Aella helpfully identifies.</p><p>To steelman your comment, I assume by \"your\" you mean the EA community's (not my) \"tendency to undercompensate and not realize how distorted these things actually are\" (although I'm still not sure quite what this means), but as I said before, I have seen very little evidence that the community's response to the TIME article has been uncritical or unreasonable. I'd be eager to hear specific examples of the mistakes you think the community has made since the article came out.</p>", "parentCommentId": "ociyZsWcryHdhGgsa", "user": {"username": "hobbes"}}, {"_id": "J3fjSf4RvSzonuKyi", "postedAt": "2023-02-18T18:15:40.625Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I mean the human tendency, not the EA tendency. &nbsp;TIME does it because it's effective on their usual audience. &nbsp;EAs, evidently, have not risen above that.</p><p>If you think there's an actual problem, I think the correct avenue is doing a real investigation and a real writeup. &nbsp;Trying to \"steelman\" a media version of it, that is going to be incredibly and deliberately warped, adversarially targeted at exploiting the audience's underestimate of its warping by experienced adversaries, strikes me as a very wrong move. &nbsp;And it's just legit hard to convey how very wrong of a move it is, if you've never been the subject of that kind of media misrepresentation in your personal direct experience, because <i>you really do</i> underestimate how bad it is until then. &nbsp;Aella did. &nbsp;I did.</p>", "parentCommentId": "k4beFfkLAiyaiGzEh", "user": {"username": "EliezerYudkowsky"}}, {"_id": "Jau5WTEjpPcPkko4x", "postedAt": "2023-02-18T18:17:33.793Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Let's be clear: the article in question was written by an internationally-renowned journalist in a major international publication. It went through all of the usual processes of careful research, writing, editing and fact-checking at the highest international standard. This article was written as a way to convey the experiences of women within the effective altruist community and to drive positive change in the way that women are treated within the movement.</p><p>This article is not the work of an \"adversary\" intent on taking someone down. They are not \"exploiting\" anyone, and the insinuation that readers of a major international publication fail to \"realize how distorted these things actually are\" and have a \"tendency to undercompensate\" from this distortedness lacks a credible basis in fact or reason.</p>", "parentCommentId": "ociyZsWcryHdhGgsa", "user": {"username": "David Thorstad"}}, {"_id": "g6oNKwqckiLHfZYBG", "postedAt": "2023-02-18T19:03:15.876Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>\"Most can only bring significant public attention to our concerns through the media or other intermediaries.\"</p>\n<p>This is a very disempowering and false narrative.  Anyone can write their accounts up in perfect detail on the forum, to the community health team, on Twitter (and tag relevant parties), over DM to organizers of the event where they experienced the problem, over DM to mutual friends or employers of the problematic person, over a message to broad community organizers, on any of dozens of EA FB groups or Slacks, and/or in a police report.</p>\n<p>To me, your comment reads as though normal people would have little option but to go to the press and shrug when their stories are inevitably  misrepresented or shared only in piecemeal in service of the narrative the journalist cares about rather than the single narrative aim of the victim. But that isn't true. People can go to the press if they want I suppose, I wouldn't suppress anyone, but I want to push back against your  disempowered narrative for doing so.</p>\n<p>Also a separate point:  If I'm honest, your comment about OP just rubs me the wrong way. You say \"The original poster, being 'mini-famous', has a relatively effective platform to present whatever information she would like to present.\" Relatively effective at what, I wonder?</p>\n<p>To rehash the lessons from within her post: Despite her massive platform, she has not been meaningfully able to handle false rumors about her. Her fame is a bug when it comes to truthseeking  about her and her experiences, not a feature. Additionally, she deals with death threats and stalkers and surely must speak carefully. I think it is kind of gross to imply her situation has the upper hand compared to other women when she is also a huge victim of mistreatment by men and doubtless has to be aware of risks every day. Her platform is also not \"relatively-effective\" at keeping her safe.</p>\n<p>Like your sentence reads like \"well that's easy for you to say Aella\" but it isn't easy for her to say. That's the thing.</p>\n", "parentCommentId": "a3w4kr2bphbikZChX", "user": {"username": "Ivy_Mazzola"}}, {"_id": "88Ga3FqT3t3q9fqkR", "postedAt": "2023-02-18T19:08:44.078Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>EAs, evidently, have not risen above that.</p></blockquote><p>Again, I would love for you to provide an example of something unreasonable the community has done in response to the TIME article. As far as I can tell, the community is trying to<a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\"> figure out </a>what is going on, but people's responses have generally been compassionate, open-minded, and reasonable.</p><blockquote><p>If you think there's an actual problem, I think the correct avenue is doing a real investigation and a real writeup.</p></blockquote><p>This would not be a good use of my time, in part because others are much better positioned than I am to do this (and are). I also don't think the bar for making the point in an EA Forum comment that \"these kinds of claims are hard to substantiate with stories\" should be that I myself have to go substantiate these claims with stories.</p><p>Notably: I think what happened to Aella is really bad. I don't think we should steelman the claims made about Aella, which I have no reason to doubt are lies, and are cruel. I'm really sorry this happened; it shouldn't have.</p><p>But I think steelmanning the TIME article is importantly different: among other things, this article is based on interviews with dozens of EAs who level critiques against a community of tens of thousands of people backed by billions of dollars in funding; this isn't about a single individual being harassed and doxxed. &nbsp;And the article could be much more inflammatory than it is, I think. Many of the central claims in the article are true, and people don't really seem to be contesting this; what seems to be under dispute is whether <i>features of EA culture that are bad for women </i>(uncontested) have led to <i>higher rates of sexual misconduct against women </i>(contested). This is a question the reporter gestures at herself (\"The hard question for the Effective Altruism community is whether the case of the EA house in San Francisco is an isolated incident, with failures specific to the area and those involved, or whether it is an exemplar of a larger problem for the movement\"). I hope the Community Health Team will get to the bottom of this.</p>", "parentCommentId": "J3fjSf4RvSzonuKyi", "user": {"username": "hobbes"}}, {"_id": "xL5A3mMRhEFzCvSLv", "postedAt": "2023-02-18T19:35:39.357Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I would like to push back on the idea that we should not trust people based on someone claiming they are “mentally unstable”. I’m not even sure what this means? Do they have a mental illness that you are aware of? Regardless, having a mental illness does not mean you cannot experience or testify to having been sexually assaulted.  It would be helpful if you could elaborate on exactly what you meant by including that comment.</p>\n<p>Anecdotally, I have someone very close to me who has a mental illness. They do have a tendency to make up lies about people who are around them when they are unmedicated, but this doesn’t mean everything they say is a lie, and I would never just simply discredit something they say based on knowing they have a mental illness or that they have lied about things when they are unwell.</p>\n<p>For reference from the OP:</p>\n<p>“ (As an data point: I’m aware of one person who talked to the TIME reporter who, before any of this happened, I concluded might be mentally unstable and had decided to stop interacting with them.)”</p>\n", "parentCommentId": null, "user": {"username": "Lauren Maria"}}, {"_id": "JzYBsyx7YQmKQd62t", "postedAt": "2023-02-18T19:41:57.728Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I said \"significant <i>public </i>attention.\" None of the methods you described would likely generate public attention anywhere near what could be generated through talking to a major media publication or through a statement by someone who has over 100,000 Twitter followers. Steps like talking to Community Health might bring someone a degree of private redress, but if they feel that\"significant public attention\" should be drawn to the problem they experienced, they will have to go elsewhere. (Also, much harassment is not a criminal offense, so a police report isn't going anywhere.)</p><p>I recognize that people are criminally harassing the original poster and strongly condemn that. Bringing public attention to bad behavior does not guarantee that it will stop, especially when the harassers are cloaked behind the veil of anonymity or are otherwise immune from pressure. But she can get her story out to tens to hundreds of thousands of people pretty easily in a way that most people can't.</p>", "parentCommentId": "g6oNKwqckiLHfZYBG", "user": {"username": "Jason"}}, {"_id": "RNDN9kP58GuYGwScq", "postedAt": "2023-02-18T20:57:30.590Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Thanks for your comment, which has been helpful in clarifying my own thinking. Particularly this:</p><blockquote><p>If someone invests a lot of effort into searching for good evidence and comes up empty that's a signal for the availability of good evidence.</p></blockquote><p>I take the article's thesis to be:</p><p>(1) The culture of EA is characterized by a skewed gender ratio, gendered power imbalances, mixing of professional/personal relationships, etc; (2) this <strong>(Increases the risk of? Leads to more of? Undermines reporting of?)</strong> sexual misconduct</p><p>I think the article does a pretty good job of proving (1), which is what I meant when I said the article is \"broadly right.\" Perhaps the crux of our disagreement is that it's not exactly clear what claim (2) is.&nbsp;</p><p>I think it's pretty intuitive that (1) would increase the risk of a weak version of (2): i.e., the cultural dynamics in EA lead to women having encounters of a sexual nature that they don't want to be having (e.g., getting hit on at professional events, feeling like they'll suffer professional repercussions for rejecting people, etc). I also think this kind of claim is hard to prove—it's just difficult to establish causation between one amorphous cultural phenomenon and another. Given that, I think the article does a good job of showing that women EAs in the Bay Area were repeatedly made uncomfortable by men's behavior towards them. Without more context, it's hard to know how much to condemn the men here (e.g., were people making innocent mistakes, or was this more malicious?), but clearly a lot of women felt bad about the encounters they had. I don't think we have reason to doubt this, and I think this is something the EA community should reflect on and investigate further.&nbsp;</p><p>There's also a separate, stronger claim that the article seems to be gesturing at, which is maybe closer to: &nbsp;\"rates of sexual harassment and assault are higher in the EA community than elsewhere, at least in the Bay Area.\" And I agree with you that the article hasn't really provided much evidence for this (beyond that one extremely troubling anecdote), although I think we have some independent reasons to worry about this. I'll be curious to see what conclusions the Community Health Team reaches on this point.</p>", "parentCommentId": "NRpuKSSzygQ8Gjn5u", "user": {"username": "hobbes"}}, {"_id": "DqznL7Z5WRWsyEjAz", "postedAt": "2023-02-18T21:33:04.297Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I wanted to correct a small mistake. The \"groomer\" that was mentioned was apparently (according to the TIME article) the same man who allegedly attempted to put his penis in a former girlfriend's mouth while she was sleeping, so maybe that's a point in favor of using that person as an example. It's written very subtly: \"Another woman, who <strong>dated the same man</strong> several years earlier...\". Although, I agree that it's odd that the article used the \"grooming\" framing when both parties were <i>adults</i>.</p><p>Aside from that, thanks for writing this. I'm glad that there are people who are brave enough to write about topics like these. I was skeptical about many of the claims expressed in the TIME piece, and I had problems with its portrayal of various types of people the journalist probably just didn't like, but voicing skepticism publicly is a challenge. Someone has to do it for a community to be healthy.</p><p>I wish we didn't give that much power to magic words like \"offensive\" or \"uncomfortable\". It trivializes serious issues and equates them with \"someone said something once that I don't like\". It's also a troubling dynamic to expect people to punish others severely for small harms.</p><p>In addition to outright lies by bad actors, there are also (rarer) forms of falsehood where someone is insanely confident that things played out the way they believe it did (and may not admit to being wrong even when faced with concrete, contradicting evidence). Those situations might be slightly more common in social environments (like EA) where everybody's busy, all the time, and the person in question is just one out of many an accuser interacted with, but had gripes with.</p><p>There's always a risk of another wave of intolerance in the future (from the left, or the right, or something else). If one's own tribe comes into a position of ideological power at some point, the right thing to do is to guard against one's own tendencies to suppress the other tribe, and be brave enough to speak up against peers who do.</p>", "parentCommentId": null, "user": {"username": "Timothy Chan"}}, {"_id": "pxJJEHAzGp7dcoaky", "postedAt": "2023-02-18T22:45:53.122Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I mean it as a data point, not as an argument on its own. In general, I've found that people who commit to strong lies about me online are more likely to have what I perceive to be symptoms of mental illness. For example, in one case I had mutual friends report to me that the person seemed to have a \"mental break\" and was acting quite unpredictably.</p><p>Unfortunately, when people seem to be acting in ways I have grown to associate with some subtypes of mental illness (seeming detached from reality in various ways, often accompanied with paranoia, <i>usually</i> as a shift, where they hadn't acted like this before), I become more skeptical of claims they make, particularly when those claims are about other people being bad.&nbsp;<br><br>I don't believe that all people with mental illnesses should never be trusted, or that we should discredit what they say simply because they have mental illness! I mean to say - if someone seems to have started behaving in an unstable, erratic manner, and then goes to an organization to make accusations, I feel more skeptical in that case compared to a reality in which the person were very stable, measured, and reasonable.&nbsp;</p>", "parentCommentId": "xL5A3mMRhEFzCvSLv", "user": {"username": "aella"}}, {"_id": "Mnccq8Xy39pNHdNzo", "postedAt": "2023-02-18T22:53:00.811Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>\"Grooming\" was a direct quote from the person who experienced the incident: “I had a sense that he was grooming me.” Quoting what your interviewee said is perfectly appropriate. The article discloses that the person was a 22-year-old college student at the time; there is no attempt to hide that at all. &nbsp;While \"grooming\" is used outside of its common meaning, it seems clear enough what the interviewee was trying to communicate here.</p>", "parentCommentId": "DqznL7Z5WRWsyEjAz", "user": {"username": "Jason"}}, {"_id": "aPmHFmmpW7xqAu5Tb", "postedAt": "2023-02-18T23:07:45.262Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I wonder how people here would react if this article were about another social movement that had some enemies. For instance, I'm guessing there are lots of people in the press who despise the Latter Day Saint movement (LDS or Mormonism), for instance for its political stances against same-sex marriage. Would people going to bring this sort of skepticism to an article about sexual abuse within the LDS movement? Or any other controversial social movement?</p><p>Also, many of the alleged wrongdoers referenced in this article are somewhat to quite identifiable with some degree of effort (please don't post names though!). They are likely private figures who could sue under ordinary libel standards if the statements were libelous, so it is reasonable to assume Time did its due dilligence on this one.</p><p>[Note: I am not a LDS person, pro-LDS, or anywhere adjacent to being LDS. That was just the first example that popped into my head of a group much of the media would dislike.]</p>", "parentCommentId": "Jau5WTEjpPcPkko4x", "user": {"username": "Jason"}}, {"_id": "syqFoqk4EKjTsa2NS", "postedAt": "2023-02-18T23:16:06.036Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Yes, I was aware of that. Nonetheless, the article chose to use the \"grooming\" framing to describe the scenario, as well as put special emphasis on the \"groomer\" being \"nearly twice her age\". It's clear that the TIME journalist is trying to communicate personal opinions and/or appeal to crowds that stigmatize relationships between adults who have large age differences:</p><p>\"<i>One recalled being “groomed” by a powerful man <strong>nearly twice her age</strong>... Another told TIME <strong>a much older EA </strong>recruited her to join his polyamorous relationship <strong>while she was still in college</strong>.</i>\"</p><p>\"<i><strong>Joseph was 22 and still in college; he was nearly twice her age.</strong></i>\"&nbsp;</p><p>(emphasis mine)</p>", "parentCommentId": "Mnccq8Xy39pNHdNzo", "user": {"username": "Timothy Chan"}}, {"_id": "iKmTqwce7P4aLBeJA", "postedAt": "2023-02-18T23:47:42.057Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Thanks for clarifying. Do you have evidence that this behaviour wasn't caused by the very complaint they were making?</p><p><br>I understand that when you've been on the receiving end of someone, or people, such as you have, telling lies about you, it can be difficult to separate between instances of when someone who is showing signs of mental instability is actually lying, or when they are telling the truth (speaking from experience because I have lived with someone with bipolar disorder for most of my life and having to navigate what is truth and what is not can be really difficult).&nbsp;</p><p>&nbsp;</p><p>It is important though that we don't conflate the two here, especially when I don't think, from what you have said, that this person's perceived mental instability bears any weight on the claims they have made. I understand you were just using it as a data point, but it is directly below where you say that you think 80% of what is said in the article isn’t true, so it seems to hold some weight?&nbsp;</p>", "parentCommentId": "pxJJEHAzGp7dcoaky", "user": {"username": "Lauren Maria"}}, {"_id": "SzFYS4JwmWAjEdfEW", "postedAt": "2023-02-19T00:26:36.447Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>As a sexual abuse survivor, I want to thank you for what this courageous post means to people like me. I also want to make the broader point that epistemic integrity is beneficial in so many unpredictable ways that it should be highly valued even in emotionally sensitive topics.&nbsp;</p><p>First I want to say that I think the dynamics of isolated incidents of rape, sexual assault and harassment are different from being &nbsp;a victim of all these things constantly over many years, and I don't claim to speak for victims of the former. Also, even though I think my experience gives me a good understanding of dynamics of sexual abuse that apply to many people who don't feel as comfortable speaking about it as me, I recognize that different victims and people at different stages of recovery from me probably feel differently .</p><p>I read the Time article much the way you did; It was generally too vague to give a good idea of how common sexual misconduct is in EA. It often referred to incidents that could have been terrible, or could have been fine. It just didn't give us enough data to decide for ourselves. Instead it expected us to assume the most terrible version of the story was true. It means that we need to look carefully at our community to figure out whether we are doing worse than other communities, but it is not by itself proof of that.</p><p>When you are a victim of long term sexual abuse, you initially have a very poor understanding of appropriate gender relations. I've worked hard to develop normal expectations, and the doctor I've been seeing for the PTSD believes I would be successful in future relationships because my expectations are essentially those of a person who has not been a victim of sexual abuse. I feel the public response of EA has previously usually been to assume the worst possible scenarios in the Time article's examples happened. This has made me worry that I'm practically the only one with this response to the article, which would likely mean my doctor is wrong and my understanding of appropriate gender relations is still too poor to resume dating. If you hadn't posted this and the post hadn't gotten so much support, I would still be doubting myself inappropriately and putting off dating for this reason.</p><p>The world is a complicated place that our models are often wrong about. People have been critical of this kind of take because they believe it harms sexual abuse survivors, but my experience has been different. There are likely all sorts of examples like this in every situation where epistemic integrity must be balanced against being sensitive to the needs of people who have experienced terrible things. I hope sharing my experience has updated people a little in favor of pursuing epistemic integrity even when it makes them feel uncomfortable. &nbsp;</p>", "parentCommentId": null, "user": {"username": "SoniaAlbrecht"}}, {"_id": "rHNke7tKs9CeQhvW7", "postedAt": "2023-02-19T00:35:16.575Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I've had worse experiences with coverage from professional journalists than I have from random bloggers. &nbsp;My standard reply to a journalist who contacts me by email is \"If you have something you actually want to know or understand, I will answer off-the-record; I am not providing any on-the-record quotes after past bad experiences.\" &nbsp;Few ever follow up with actual questions.</p><p>A sincere-seeming online person with a blog can, any time they choose to, quote you accurately and in context, talk about the nuance, and just generally be truthful. &nbsp;Professional journalists exist in a much stranger context that would require much longer than this comment to describe.</p>", "parentCommentId": "Jau5WTEjpPcPkko4x", "user": {"username": "EliezerYudkowsky"}}, {"_id": "j7ij6dRdnTAJyq9dk", "postedAt": "2023-02-19T00:36:52.130Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Selfish piggyback plug for the concept of <a href=\"https://www.lesswrong.com/posts/k9dsbn8LZ6tTesDS3/sazen\">sazen</a>.</p>", "parentCommentId": "fGhK5n7dJMWyWLFvB", "user": {"username": "Duncan Sabien"}}, {"_id": "opAy9vQaKA5P3bcqs", "postedAt": "2023-02-19T00:41:15.183Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I'd absolutely bring the same kind of skepticism. &nbsp;I would refuse to read a TIME expose of supposed abuses within LDS, because I would expect it to take way too much work to figure out what kind of remote reality would lie behind the epstemic abuses that I'd expect TIME (or the New York Times or whoever) would devise. &nbsp;If I thought I needed to know about it, I would poke around online until I found an essay written by somebody who sounded careful and evenhanded and didn't use language like journalists use, and there would then be a possibility that I was reading something with a near enough relation to reality that I could end up closer to the truth after having tried to do my own mental corrections.</p><p>I want to be very clear that this is not my condescending advice to Other People who I think are stupider than I am. &nbsp;I think that <i>I</i> am not able to read coverage in the New York Times and successfully update in a more truthward direction, after compensating for what I think their biasing procedures are. &nbsp;I think I just can't figure out the truth from that. &nbsp;I don't think I'm that smart. &nbsp;I avoid clicking through, and if it's an important matter I try to find a writeup elsewhere instead.</p>", "parentCommentId": "aPmHFmmpW7xqAu5Tb", "user": {"username": "EliezerYudkowsky"}}, {"_id": "Yf2o49KeuDesk8GZR", "postedAt": "2023-02-19T00:53:18.456Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>If you want to insinuate that a major international publication is likely to be less reliable than a blog on issues of sexual harassment and abuse within the movement, it would be appropriate for you to write up the much longer description that you mention. This is a striking claim that is at odds with established views of what constitutes a trustworthy source. Most educated readers think that a publication such as TIME is among the most reliable sources that can be found on such a subject.</p><p>I don't deny that journalists sometimes have trouble understanding academic research. Blogs written by professional academics are often in a much better position to understand academic research, because their authors have more relevant expertise. I would be highly skeptical of the claim that, in all but the most exceptional circumstances, blogs are better equipped than major media companies to conduct serious investigative journalism on sensitive issues. Publications such as TIME have been doing that kind of work successfully for many years.</p><p>If you do write this up, please be careful to respect the anonymity of those whose names were redacted in the TIME article.&nbsp;</p>", "parentCommentId": "rHNke7tKs9CeQhvW7", "user": {"username": "David Thorstad"}}, {"_id": "x7xzewgoXmbLE5qhQ", "postedAt": "2023-02-19T01:05:09.778Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>The usual argument, which I think is entirely valid, and has been delivered by famouser and more famously reputable people if you don't want to trust me about it, was named the \"Gell-Mann Amnesia Effect\" by Richard Feynman. &nbsp;Find something that you are really, truly an expert on. &nbsp;Find an article in TIME Magazine about it. &nbsp;Really take note of everything they get wrong. &nbsp;Try finding somebody who <i>isn't</i> an expert and see what their takeaways from the article were - what picture of reality they derive without your own expertise to guide them in interpretation.</p><p>Then go find what you think is a pretty average blog post by an Internet expert on the same topic.</p><p>It is, alas, not something you can condense into a single webpage, because everybody has their own area of really solid expertise, even if it's something like \"the history of Star Trek TOS\" because their day job doesn't lead them into the same level of enthusiasm. &nbsp;Maybe somebody should put together a set of three comparisons like that, from three different fields - but then the skeptics could worry it was all cherry-picked unusual bad examples, even if it hadn't been.</p><p>I will note that I do think that the great scientists of recent past generations have earned more of our respect than internationally famous journalistic publications, and those scientists did not speak kindly of their coverage of science - and that was <i>before </i>the era of clickbait, back when the likes of the New York Times kept to notably higher editorial standards.</p><p>I think you can talk to any famous respectable person in private, and ask them if there should be a great burden of skepticism about insinuating that a \"major international publication\" like TIME Magazine might be skewing the truth the way that Aella describes, and the famous respectable person (if they are willing to answer you at all) will tell you that you should not hold that much trust towards TIME Magazine.</p>", "parentCommentId": "Yf2o49KeuDesk8GZR", "user": {"username": "EliezerYudkowsky"}}, {"_id": "xEYDxkeN5Q6TpoywN", "postedAt": "2023-02-19T01:22:22.923Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>To be clear, at the risk of repetition, the question is not whether journalists should be considered reliable in their explanations of academic research. Although some journalists explain academic research quite well, others lack the training to do this as well as professional researchers. &nbsp;I would much rather turn to a colleague's blog than to a TIME magazine article to understand issues in academic philosophy, and I suspect that academics in most other fields would say the same.</p><p>The question is whether a major international publication should be considered a reliable source of investigative journalism into issues of sexual harassment and abuse. Most educated readers would consider such a publication to be among the most reliable sources on such a topic. Most readers would express some skepticism about the ability of a typical blogger to conduct serious investigative journalism of the same calibre. These readers would cite the relatively stronger training that journalists have in the practice of investigative journalism, as well as the relatively stronger track record of successful investigative journalism at major international news outlets, when compared to blogs. They might also cite specific institutional features of news outlets, such as more time devoted to research, more people devoted to fact-checking, and a higher reputational and legal stake in getting things right.</p><p>Is there a reason why we should distrust TIME's discussion of sexual harassment and abuse within effective altruism?</p>", "parentCommentId": "x7xzewgoXmbLE5qhQ", "user": {"username": "David Thorstad"}}, {"_id": "wzC3iadPnJ7zn9k5y", "postedAt": "2023-02-19T01:29:58.060Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>In my view, the other person's age is fair commentary here. \"Powerful\" is rather vague and indefinite -- the other person's age provides support for the conclusion that the other person was indeed in a position of power/influence such that there was a serious power imbalance here. And that imbalance is what makes what the man said particularly inappropriate in what was supposed to be a professional-related context.</p>\n", "parentCommentId": "syqFoqk4EKjTsa2NS", "user": {"username": "Jason"}}, {"_id": "ZfpqERGsktLWsfuTk", "postedAt": "2023-02-19T01:45:08.164Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Uhhh no, I don't trust them, and consider trusting them to be a pretty intense mistake. I'm friends with some very well-known people, where respected journal institutions (New York Times, Wall Street Journal, etc.) report about their lives. So I get to know them up close, and I get to directly see how the reporting misconstrues them. I've come away from this with intense distrust, to the degree that, similarly to Eliezer, I just don't bother reading stuff they write about people anymore (unless it's simply to track what news outlets are saying about people).&nbsp;<br><br>I'll grant that fancy news outlets are more careful about being technically correct about facts (I've been interviewed by both high and low profile news outlets, and have in fact found the high profile ones are more dutiful in doublechecking concrete facts I tell them), but they are <i>not</i> trustworthy in terms of trying to present an accurate picture. It's trivially easy to say only technically true things in a manner that leads people to a misleading conclusion.<br><br>One example is how the New York Times decided that they wouldn't cover tech positively: <a href=\"https://twitter.com/KelseyTuoc/status/1588231892792328192\">https://twitter.com/KelseyTuoc/status/1588231892792328192</a><br>(Matt's original tweet thread is saved here: <a href=\"https://web.archive.org/web/20221104004538/https://twitter.com/mattyglesias/status/1588190763413868553\">https://web.archive.org/web/20221104004538/https://twitter.com/mattyglesias/status/1588190763413868553</a> )</p>", "parentCommentId": "xEYDxkeN5Q6TpoywN", "user": {"username": "aella"}}, {"_id": "MmyXmEieZRLsJrBk7", "postedAt": "2023-02-19T01:59:42.437Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>One example is how the New York Times decided that they wouldn't cover tech positively: <a href=\"https://twitter.com/KelseyTuoc/status/1588231892792328192\">https://twitter.com/KelseyTuoc/status/1588231892792328192</a></p></blockquote><p>My understanding from those links is that NYT's actions here is a significant outlier in journalistic/editorial ethics, enough that both Kelsey and Matt thought it was relevant to comment on in those terms.<br><br>Kelsey:</p><blockquote><p>I'd never heard anything like it[...]<br><br>For the record, Vox has never told me that my coverage of something must be 'hard-hitting' or must be critical or must be positive, and if they did, I would quit. Internal culture can happen in more subtle ways but the thing the NYT did is not normal.</p></blockquote><p>Matt:</p><blockquote><p>But what happened is that a few years ago the New York Times made a weird editorial decision with its tech coverage.</p></blockquote>", "parentCommentId": "ZfpqERGsktLWsfuTk", "user": {"username": "Linch"}}, {"_id": "FPmRvJ89Y8mz37gup", "postedAt": "2023-02-19T02:36:48.199Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Would you trust a report from (say) the LDS church about the prevalence or non-prevalence of abuse in its ranks? [Continuing with example, not trying to say anything about the LDS church here.]&nbsp;</p><p>Organizations and movements certainly have an incentive to spin, minimize, and distort in their favor. And it's arguably <i>easier </i>to distort on the defensive side.</p><p>The epistemic challenge is that, unless abuse allegations result in judicial proceedings or some other public airing of evidence, we cannot realistically evaluate the underlying evidence directly. So if journalists aren't reliable on these matters, and organizations/movements aren't reliable, where does that leave us? If one is being highly skeptical, there are few if any individuals who would have the resources and inclination to accurately probe into a question like this without some sort of stake in the question. If you're deep inside the movement/organization, you may be able to figure out the answer for yourself -- but if you're that deep in, outsiders could reasonably conclude that you weren't an unbiased reporter and discount your conclusions on that basis.</p>", "parentCommentId": "opAy9vQaKA5P3bcqs", "user": {"username": "Jason"}}, {"_id": "WoMrpsfsRgwS6rBEF", "postedAt": "2023-02-19T02:59:35.521Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Aella -- thanks for writing this.</p><p>I strongly endorse your central point that in modern social media culture, our normal intuitions and heuristics about how to assess people's moral traits get completely derailed by the power of bad actors such as stalkers, grudge-holders, mentally ill people, and unscrupulous journalists.</p><p>From an biological perspective, there's probably some deep '<a href=\"https://en.wikipedia.org/wiki/Evolutionary_mismatch\">evolutionary mismatch</a>' at work here . We evolved for many millennia in small-scale tribal societies including a few dozen to a few hundred people. In such societies, if some person X is subject to serious accusations of unethical misconduct by several independent people, it's prudent to update one's view of X in the direction of X being a bad person, psychopath, liar, harasser, or whatever. The reputational heuristic 'where there's smoke, there's fire' can be reasonable in small-scale contexts. If 5 people out of 50 in one's clan report seriously negative interactions with person X, that's a pretty high hit rate of grievances.</p><p>However, in modern partisan social media culture, where someone can have many thousands or millions of followers, including hundreds to thousands of ideologically motivated hostile critics, this heuristic breaks down. Anybody who is sufficiently famous, notorious, or influential, and who is even marginally controversial, will attract a virtually limitless quantity of negativity. It becomes easy to find not just 5 people who hate person X, but 50, or 500 -- and our Pleistocene social brains interpret that as dispositive evidence that the person X must be worthy of hatred.</p><p>Then it becomes easy for journalists, bloggers, or random social media obsessives to compile all this negativity into a carefully curated grievance-bundle &nbsp;that makes someone -- or some group, organization, subculture, or movement-- sound very bad indeed.&nbsp;</p><p>Naive readers exposed to such grievance-bundles will see several examples of smoke, and conclude that there must have been some underlying fire.&nbsp;</p><p>My hypothesis -- which is speculative, and untested, but, I hope, plausible -- is that our evolved social-judgment heuristics are just not very scope-sensitive about social information when we're judging the reputations or moral virtues/vices of people and groups. At least, not scope-sensitive enough to be very accurate when we're judging reputations in the modern world of social media, which includes literally millions of very unhappy, hateful, resentful, and/or delusional trolls who spend a LOT of time, energy, and dark creativity trying to bring others down.</p><p>A secondary effect of this 'social-reputation scope-insensitivity' is that when the trolls see other trolls complaining about a particular person or group, their own social judgments get confirmed, through a combination of social proof, confirmation bias, and motivated reasoning. If they were alone with their negativity, they might doubt their judgment. But it is always easy, on social media, among millions of others, to find dozens to hundreds of others who share their negative views -- which validates their initial judgment, and makes their grievance seem righteous and worth sharing even more widely. &nbsp;This can lead to a runaway effect, where once a critical mass of negative judgment coalesces around a person or group, more and more people dogpile onto the target.&nbsp;</p><p>This seems to have been happening a lot to Aella as an individual. It's also been happening a lot to EA as a movement in the last few months. It is the social-psychological heart of cancel culture. And we should be very wary of it, just as we should be very wary of all scope-insensitive judgments.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "ptZNzbYSN8hntGGA4", "postedAt": "2023-02-19T04:11:42.744Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>named the \"Gell-Mann Amnesia Effect\" by Richard Feynman</p></blockquote><p>Aside, but that was Michael Crichton.</p>", "parentCommentId": "x7xzewgoXmbLE5qhQ", "user": {"username": "Muireall"}}, {"_id": "saBZnjHtojzGDaLZs", "postedAt": "2023-02-19T05:02:41.828Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Hey Aella, just wanted to say I found this a very well-written post and this particular quote struck me:</p>\n<p>“I think in large part because of those experiences I've had. We're dealing with something high visibility (EA), where the most popular political coalition in journalism (people on the left side of the political aisle) can score points by hating you (insufficiently woke), and that is politically controversial (polyamory, weird nerds, SBF). It seems obvious to me that the odds of having some people with personal experience in the community who also regularly uncharitably misinterpret interactions, and uncharitably speak to a journalist (with both political and financial incentives to be uncharitable), are very high.”</p>\n<p>The TIME article definitely sparked something in me, and I did agree or relate with some of it. Maybe part of me had some skepticism about the caliber of journalism it had, but this quote of yours impresses the need to be just a bit more cautious when we read future stuff about us… we need to take it in, but also, understand that people can just hate.</p>\n<p>In honesty, I’ve had some discomfort with some tweets of yours before but I’ve appreciated that they’ve challenged a lot of me and got me to think deeply. I’m sad about this strong dislike and hate others have said about you.</p>\n<p>I’m not in any way famous, but I’ve experienced some hate from people the more I got connected to others or the more others knew me (despite me never interacting with them), and also have had false rumors spread about me, and it’s sadly happened in this community.</p>\n<p>I just wanted to comment to appreciate you posting something like this and telling a part of your story!</p>\n", "parentCommentId": null, "user": {"username": "kirstenangeles"}}, {"_id": "4j7h5ziTX5huNLsc7", "postedAt": "2023-02-19T05:15:19.896Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I do gotta say I believe the TIME article a bit more than the skepticism raised in this post</p>\n", "parentCommentId": "saBZnjHtojzGDaLZs", "user": {"username": "kirstenangeles"}}, {"_id": "6cEFz2dStqPCxy7Wp", "postedAt": "2023-02-19T05:29:49.266Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>It probably varies widely depending on one’s community. I was one of the people who gave your comment a disagreement vote. I did so because I feel that in my community (college educated, California ) and the online spaces we inhabit, it is very costly and brave to doubt claims of sexual assault. I also had no trouble being believed when I was a victim of sexual abuse, even in far more conservative environments. However, I definitely don’t want you to feel like we are dismissing your experiences! I’m sure many communities behave as you described.</p>\n", "parentCommentId": "DvQbBZyJFb2MvRQd8", "user": {"username": "SoniaAlbrecht"}}, {"_id": "riYyEbndxkXssmqzS", "postedAt": "2023-02-19T06:16:25.920Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>(in the interest of being hyper explicit, also wanna note that I support people believing the claims in the TIME article, think it's good for people to genuinely state their beliefs about things, that it's totally fine for people to come to different conclusions about it than I did.)<br><br>edit: Also, thank you!&nbsp;</p>", "parentCommentId": "4j7h5ziTX5huNLsc7", "user": {"username": "aella"}}, {"_id": "7s9ZwQT6jhTLAGmtY", "postedAt": "2023-02-19T13:00:02.436Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>You don't actually have to be famous in order to experience this; it's sufficient to be the kind of person who is easy to tell lies about. For instance, when I was in high school, other kids spread some really wild rumours about me, including that I had gotten in a fistfight with my English teacher and got away with it (without even getting detention), or that I cheated on all my tests. I did judo outside of school, and other kids apparently found that implausible enough that the majority of my school peers believed I was making it up and couldn't possibly <em>actually</em> do judo. I think this rumour got started just because I was pretty bad at the sports we played in school, like netball and hockey, so people told each other I was clearly lying about being good at judo.</p>\n<p>When I was like twelve I identified as asexual, and I remember a group telling me that they'd heard I just <em>pretended</em> to be asexual in order to cover up being a sex addict. As far as I can tell, this just happened because other kids didn't think twelve was old enough to know my identity was asexual (and apparently they found the sex addict thing more plausible somehow). I assure you I was not famous, neither was that rumour true (I was <em>twelve</em>).</p>\n<p>I really don't have a good model of why that happens. Being famous will definitely increase the amount that false things are said about someone, but being autistic seems to cause lots of this too. Being unusual or weird in many ways makes it easy to misrepresent you, since the truth can feel less plausible than the fiction. This happens a <em>lot</em> to me in social contexts where I'm very weird, and a lot less in social contexts where I fit in better.</p>\n<p>But also, we have to be very careful about how we extrapolate these anecdotes to sexual ethics. As an adult, someone tried to spread the rumour that I was deeply in debt and lost my job for financial crimes (I've never taken out a substantial loan in my life, let alone not paid it back, and I've certainly never committed any major financial crimes). I know why they did it (I refused to sell them something that they wanted after a long and frustrating negotiation) and I also know that nothing bad happened to them due to spreading this untrue rumour, and there was no cost to doing so. It makes sense as to why they'd lie. Similarly, when people lied about me fistfighting my English teacher, there was basically no drawbacks; at worst somebody might decide that they're an unreliable source of juicy gossip. There's no reason <em>not</em> to repeat a funny or exciting rumour if you just want to be a popular kid. I think that's a very very different thing from when a woman comes forward with a personal firsthand allegation of sexual misconduct against a man in a position of power, since often she faces massive harassment and professional consequences for doing so. I think that means that those kinds of allegations are much less likely to be lies, and definitely much less likely to be passed around as the \"fun\" kind of gossip.</p>\n", "parentCommentId": "fGhK5n7dJMWyWLFvB", "user": {"username": "firinn"}}, {"_id": "RoD3PziPHkSd4Q8ey", "postedAt": "2023-02-19T15:47:19.361Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>I also don’t want to turn this into “and now Aella hijacks this issue to talk about personal social drama where she picks through the details of every rumor in order to convince you she’s not a terrible person”. But still, it's hard to convey exactly how this works without examples, and specific instances of this happening to me are what have so strongly updated my views, so I’m going to pick just a few. &nbsp;</p></blockquote><p>I appreciate your taking care here, and concreteness is valuable in conversations like this. Even so, I'm not sure what I can take away with respect to EA from this middle half of your post. I don't know you apart from your two prior comments on this forum. It's hard to distinguish your account here from what I'd expect to read from a verbally skilled actor who's fluent in the strategic use of bright lines to avoid getting pinned down. Narrative may be the best remaining means to warn against such an actor, and by construction that narrative can just as well be framed as mere insinuation or hostile framing. So it's hard to treat statements like yours as evidence without a foundation of trust in involved individuals or even just familiarity with their community. Separately, the specifics of your analysis of statements about you seem to me at best tenuously related to coverage of EA, even in your transition back to discussing it.</p><p>I'm left feeling that this wasn't an appropriate forum for that section of your post. (I don't object to your defending yourself—I doubt I'd have commented if you'd left this section at the link to your original response to your friend's statements. Similarly, I'm happy to encourage critical reading.) I seem to be in the minority—you do say you're \"mini-famous\", so maybe more in-the-loop readers have more to go on—but I do wonder if others have thoughts along or outright against these lines.</p>", "parentCommentId": null, "user": {"username": "Muireall"}}, {"_id": "EaSmvhpepmLsPmYZ5", "postedAt": "2023-02-20T00:13:35.528Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>It's highly unlikely anyone could sue for libel in the United States. The Time doing even a little bit of fact checking would allow them to say they were not negligent and avoid liability. Which leaves you suing the individuals who spoke to the Time. Which will likely require getting the Time to reveal their sources which would be quite hard.</p><p>In addition, the vast majority of the claims in the article are not \"factual\" in a legal sense. People are reporting their impressions, opinions, etc... For instance, if you had dinner with someone and you say that they were \"grooming\" you, that's protected opinion even if it's an absurd description of what happened.</p><p>Then you would have to show that you suffered harm from the libel. Which will be pretty hard given the anonymity in the article.</p><p>Finally, the people you're suing probably don't have a lot of assets. After paying for their court fees and representation, you'll be lucky if you get anything. You probably won't even get enough to cover your own legal expenses. But you will draw attention to yourself and the statements in question so your reputation will likely suffer.</p>", "parentCommentId": "aPmHFmmpW7xqAu5Tb", "user": {"username": "AlexandreZani"}}, {"_id": "EbHzfQvZJhNqXcbeo", "postedAt": "2023-02-20T03:40:44.735Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Aella is a leader in the rationalist community. As such, she’s interacted with us frequently  outside the forum and a lot of EAs have developed a lot of trust in her over a long period of time. I can see how this post wouldn’t be as persuasive for someone who didn’t know of her through that.</p>\n", "parentCommentId": "RoD3PziPHkSd4Q8ey", "user": {"username": "SoniaAlbrecht"}}, {"_id": "pzhTu4Fs5dQpNuSdy", "postedAt": "2023-02-20T07:52:12.302Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>But didn't some reports against EA men go viral before the Time piece? Doesn't that disprove your thesis?</p>\n<p>I guess it also feels a bit like moving the goalposts to speak about seeking \"public attention\" like that in itself is a good thing. I remember watching a video from \"Ms. Joseph\" and she just wanted the problems handled, I thought so anyway. She didn't seem to care about\"public attention\". So it seems very important to clarify that if you or anyone else just wants a problem handled, that going to the press may be one of the worst ways to get that done. After all, a journalist can't even answer  questions and ever help you understand what went wrong. And after all, it sounds to me from what you and others say that she did end up reporting someone on a national scale who was already banned from EA events, which was then reported as proof that EA presently has a problem. Soooo something went wrong there. You say it isn't our place to criticize her reaction and like, yeah, maybe I'll give you that, it's a shitty situation. And sometimes the press may be the right choice (as I say I'm trying not to discourage or reduce freedom to speak to the press).</p>\n<p>But avoiding criticizing here doesn't mean We should shrug about going to the press and act like it's the natural next step here. We can certainly offer better alternatives, try to inform... After all, the press actually did a <em>bad job</em> here and, as an intermediary,  <em>tend to do a bad job</em> around any delicate personal issues and experiences one may have. Like, most people don't want significant public attention. They want issues handled. Journalists can help with that of needed but damn is there ever a long list of cons, and nobody needs to feel like it's their only option.</p>\n", "parentCommentId": "JzYBsyx7YQmKQd62t", "user": {"username": "Ivy_Mazzola"}}, {"_id": "LswbtfcFJ3aFqj8mv", "postedAt": "2023-02-20T09:16:29.396Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>What do you mean by \"leader in the rationalist community\"? I neither know aella well nor the rationalist community well and am unsure where the \"EAs have developed a lot of trust in her over a long period of time\" comes from. Obviously not saying she's untrustworthy!</p>", "parentCommentId": "EbHzfQvZJhNqXcbeo", "user": {"username": "pseudonym"}}, {"_id": "jRhcDnQXZns6uGHpP", "postedAt": "2023-02-20T11:24:25.017Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I mean, sometimes we just dont have very good information about a topic we'd like to know about.</p>\n<p>Perhaps we need to accept that a garbage information source can be worse than nothing, even though it is the only source we have - I suspect there is not really any way for me to know if there is a serious sex abuse problem in the LDS.</p>\n<p>Maybe adversarial attacks are useful though: if there was a really bad issue in the bay area EA scene, the TIME article ought to have found juicier stories than what I've seen.</p>\n", "parentCommentId": "FPmRvJ89Y8mz37gup", "user": {"username": "timunderwood"}}, {"_id": "xderziFGimMBzhNEr", "postedAt": "2023-02-20T11:30:06.541Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>\"Given that, I think the article does a good job of showing that women EAs in the Bay Area were repeatedly made uncomfortable by men's behavior towards them.\"</p>\n<p>Even this isn't really established in an interesting way. If out of thousands of women in a group dozens feel this way, it is probably actually a really safe place, while if half of them feel that way there is an issue that probably should be addressed.</p>\n<p>And I seriously don't know which is going on (and sampling women who stay in the EA community about how they feel creates a survivorship bias, because they are the ones who aren't offended enough to leave).</p>\n<p>But the TIME article is weak evidence in either direction, because the reporter is simply not trying to establish base rates.</p>\n", "parentCommentId": "RNDN9kP58GuYGwScq", "user": {"username": "timunderwood"}}, {"_id": "eZkChmhPdhm6JKpqk", "postedAt": "2023-02-20T13:07:57.632Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Making one's content go viral is extremely difficult and finicky, with an extremely low chance that any particular content will do that.</p><p>I don't think I'm moving the goalposts given that Aella wrote unfavorably about \"going to TIME . . . .\" And this lines up with a broader pattern: Rochelle Shen is quoted in the article about pressure to \"keep it all in the family.\" So I think it's important to be <i>very </i>clear that we are not criticizing people's personal choice to go to the media before we start talking about the downsides of doing so. I don't think the original post did that, and my concern goes double with the post author is a mini-famous figure. (I do agree with you that the downsides of talking to the media are often significant, and appreciate your contributions to the conversation on that point.)&nbsp;</p><p>Each of the women whose experienced were included in the article chose to speak to TIME. I'm pretty sure each of them knew that TIME reporters do not have subpoena power and that talking to a reporter is likely to lead to one's story receiving significant public attention. Thus, I conclude that each of them decided that talking to the TIME reporter and bringing significant public attention to what happened to them was a good idea.</p><p>I suspect that talking to the media was the first choice of exactly <i>zero </i>of the sources. Few people would prefer having stories of them being harassed or abused in the pages of a major media outlet. And I suspect most of the women understood, at least to some extent, that talking to a reporter meant surrendering most control over how their story was portrayed. <i>Yet each made a decision to talk.&nbsp;</i></p><p>From all that, I infer from the women's decision to talk to TIME that they felt either that their own situation had not been appropriately dealt with, or that sexual harassment/abuse in EA was still a big enough problem to justifythe downsides of going to the media. That's why I suggested \"working on a more effective internal mechanism to listen to these individuals\" so they wouldn't feel like talking to a reporter was their best option. (And yes, I recognize the challenges in designing and implementing such a mechanism.)</p><p>I think we both agree that EA should aim toward a world in which no one who experiences harassment or abuse within the community feels that going to the media is necessary.&nbsp;</p>", "parentCommentId": "pzhTu4Fs5dQpNuSdy", "user": {"username": "Jason"}}, {"_id": "Fg6GZvcirvCBNnF3a", "postedAt": "2023-02-20T13:27:53.714Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Thanks, Tim. Your second paragraph is basically what I was trying to get at with my response -- often, we are faced with the choice of using potentially biased information sources and de-biasing them as best we can, or just throwing our hands up in the air and admitting we can't obtain any reliable information.&nbsp;</p><p>I'd suggest the latter approach is actually bad for EA: if saw some sources claim that EA is a dangerous place for people like me, saw some sources claim it isn't, and concluded I couldn't obtain reliable information because all the information was infected by bias -- I would stay far away from EA. Ditto in the LDS hypothetical -- I would not let my child attend an LDS camp if I didn't feel confident it was safe. (I wouldn't allow my child to attend such a camp in any event because my beliefs do not line up with LDS theology, but you get the point.)</p><p>To your second point: I think that kind of reasoning often has validity, but there are several reasons to exercise caution in deploying it here. First, finding survivors is not easy; most survivors don't exactly talk about their experience in a way that is easy for a reporter to find. Second, many survivors do not want to talk to the media (which is fine). Finally, media organizations have seen their budgets eviscerated in the Internet age, so the depth of investigative reporting they can afford for an article like this has gone down significantly.</p><p>My overall impression is generally consistent with what the article says: \"The hard question for the Effective Altruism community is whether the case of the EA house in San Francisco is an isolated incident, with failures specific to the area and those involved, or whether it is an exemplar of a larger problem for the movement.\" I think the article tells us at least that we need surveys, better reporting mechanisms, and the like to develop a more accurate picture of the scope of the problem.</p>", "parentCommentId": "jRhcDnQXZns6uGHpP", "user": {"username": "Jason"}}, {"_id": "y3duRvetvG9mLTPkk", "postedAt": "2023-02-20T14:15:32.565Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Given you aren't commenting on the truth value of the claims, just thought I'd nitpick that I don't think establishing base rates is required for updating (or perhaps more accurately, some stories are sufficiently bad that even 1 credible case in the EA movement may be seen as bad enough). For example, what do you think is the acceptable base rate of <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=d8AjvmSaXSdm6d6hs\">this allegation</a>? Can you think of stories that \"if true\", would be sufficiently bad that it would make you think EA wasn't a safe space for women, even without interviewing thousands of women? How do you feel about reading a report about sexual abuse of young children by Catholic priests which were not taken seriously by the Catholic Church - do you also suggest that this is \"weak evidence in either direction, because the reporter is simply not trying to establish base rates?\"</p>", "parentCommentId": "xderziFGimMBzhNEr", "user": {"username": "pseudonym"}}, {"_id": "wSojtvshBzz73qKgN", "postedAt": "2023-02-20T17:37:23.512Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>In many areas, the EA community and rationalist community overlap a lot (for example, in the San Francisco Bay Area where I socialize , and in the AI alignment cause area where I have some experience). I realize this isn’t true in a lot of parts of EA.</p>\n<p>The part of the post this comment is objecting to relies on that prior trust and familiarity with the rationalist community. If you’re not its’ target audience, I wasn’t objecting to you not getting anything useful out if it. I was just trying to provide some helpful context for why so many people have upvoted this post despite Aella’s sparse and recent presence on the forum.</p>\n", "parentCommentId": "LswbtfcFJ3aFqj8mv", "user": {"username": "SoniaAlbrecht"}}, {"_id": "idiaN4eYimjXE2YdJ", "postedAt": "2023-02-20T18:09:13.705Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Can someone who downvoted my replies  explain why they chose to? I didn’t think I was saying anything controversial, so I’m confused.</p>\n", "parentCommentId": "wSojtvshBzz73qKgN", "user": {"username": "SoniaAlbrecht"}}, {"_id": "zuQ6bJcKhmb6fy4NA", "postedAt": "2023-02-20T18:32:23.108Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>The pressing question for EA is not whether or not EA has a base rate of harassment that is worse than average. The question is \"is there reasonable room for improvement?\". I think the answer is yes, and I think the time article provides helpful evidence of that. It's not <i>impossible</i> that the answer is no and EA is already perfect on this issue, but from I've read it seems unlikely.&nbsp;</p>", "parentCommentId": "xderziFGimMBzhNEr", "user": {"username": "titotal"}}, {"_id": "QN5anFrNPn6LeT5ur", "postedAt": "2023-02-20T18:52:53.778Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p><strong>An attempt to help more EAs \"get it\":</strong> Almost every old-school vegan or vegetarian should instantly \"get\" that people will just lie about you. I think that most of us have experienced growing resentment toward us, built on false claims that we are rude about animal products, insulting, hate humans, etc. Or if we haven't experienced this ourselves, surely we have seen fellow veg*ns share stories like \"I tried to be so polite at Thanksgiving.. I brought my own meal and didn't request anyone else make modifications, but now my family is saying I made a big fuss and was rude, and I should apologize?\" The meat-eaters who say such things may genuinely believe their claims, IDK, but it certainly looks like (years ago anyway, before veganism entered the overton window more) some people <i>would</i> just lie so they'd have a dramatic story to tell about vegans and cement their own ingroup status or so they'd have a seeming-reason to dismiss animal welfare asks and play the victim themselves and cement their control for future interactions. There are many reasons, some conscious and some unconscious, why people lie, but they do lie and<strong> those lies even become big cultural narratives about who to stay away from (vegans, EAs, Aella).&nbsp;</strong><br><br>I have better examples of lies from my own life, like rumors going around my highschool and merciless bullying that I was a slut (but the truth was I had actually been raped), but<strong> I bring up the vegan thing as an attempt to help most EAs \"get it\".</strong> &nbsp;I know that the hate and alienation I experienced for being vegan got bad enough for me that I left my entire ingroup (DC Burning Man folks, who themselves constantly talked about SJ causes which were more in the overton window), and I began to avoid meat-eaters entirely (and then I <i>actually</i> became a radical vegan lmao, but that's another story).&nbsp;<br><br>I think there are 2 groups: (1) the people who lie first: I think most of these are raised in a world where linguistics are so divorced from the truth that they are used to stating feelings and perceptions as fact, even if they have the inkling they are being dramatic or jumping to conclusions. And it does not even occur to them that they are supposed to say stuff with precision, and that curtailing your tongue's impulses in favor of speaking truthfully is even an option anyone else is taking seriously. They think getting things roughly right is enough and think that is what everyone else is doing. And the other side of the coin is (2) people who wouldn't lie themselves, but are thirsty for a salacious story about their outgroup, and will spread the lie. I think this basically serves as proving of outgroup vs ingroup, and ties into what <a href=\"https://forum.effectivealtruism.org/users/firinn?mention=user\">@firinn</a> notes that&nbsp;weirdos are easier to lie about. &nbsp;&nbsp;<br><br>Let EAs not forget that most people still fall into one of these two groups, and very few people fall into a \"proactive fact-checking group\" or \"use nuance in favor of truth\" group. So it shouldn't surprise anyone that lies happen and even become big well-known cultural \"truths\" all the flipping time.</p>", "parentCommentId": "fGhK5n7dJMWyWLFvB", "user": {"username": "Ivy_Mazzola"}}, {"_id": "4sGj4AbdgZH46mvCf", "postedAt": "2023-02-20T19:15:27.591Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>[Edit: now I have more agreement with <a href=\"https://forum.effectivealtruism.org/users/jason-1?mention=user\">@Jason</a> that the internal systems need work. I'm personally still impressed by the CH team's work and don't want people to believe official EA avenues are fundamentally broken or anything, but yes there is greater need for internal improvement than I thought. &nbsp;See <a href=\"https://forum.effectivealtruism.org/users/lauren-maria?mention=user\">@Lauren Maria</a> 's response to me below]</p><p>Fair points. Well, &nbsp;I don't necessarily agree that the \"internal mechanisms to listen to these individuals\" needs work, as I think that there are current avenues to know that SA in EA was being handled or plans were being made for things to be handled, and/or ways to find out that one's case was not the fault of EA or even performed by an EA man (before reporting it to Time with claim of such). But the proof is in the pudding that these were not publicized or promoted enough.&nbsp;<br><br>So I do agree (and have written elsewhere) that EA dropped the ball on announcing intention to make changes (and changes made) in response to SA complaints back in November. It is understandable that some women felt they needed another step. We don't know that any complainants would have been paying enough attention to notice announcements, but I bet at least some would have, and the Time journalist could have noticed at least.&nbsp;<br><br>And FWIW I strong-agreed with another comment you wrote elsewhere that we need a solid list of criteria for who is and is not an EA, because we also need to be able to clearly name cases that are within EA jurisdiction and which EAs have the ability to handle vs those which are not. So that resentment doesn't build toward EA in cases where it is not warranted.</p>", "parentCommentId": "eZkChmhPdhm6JKpqk", "user": {"username": "Ivy_Mazzola"}}, {"_id": "uzH2NpQFAwxGxjGGJ", "postedAt": "2023-02-20T21:14:05.613Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>Well, &nbsp;I don't necessarily agree that the \"internal mechanisms to listen to these individuals\" needs work, as I think that there are current avenues to know that SA in EA was being handled or plans were being made for things to be handled, and/or ways to find out that one's case was not the fault of EA or even performed by an EA man (before reporting it to Time with claim of such)</p></blockquote><p>&nbsp;</p><p>I think we can say that it does need work, based on these recent <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation\">posts</a>, and &nbsp;the CEA team seems to be acknowledging this (which is great!).&nbsp;<br><br>In reference to your previous conversation with Jason, It also seems that these people going to the press may have actually encouraged the CEA to have an external investigation and for Owen Cotton-Barratt to step down.&nbsp;</p>", "parentCommentId": "4sGj4AbdgZH46mvCf", "user": {"username": "Lauren Maria"}}, {"_id": "4tKttGiDTnk2zF3d5", "postedAt": "2023-02-20T22:00:47.047Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>(I’m also confused about it and the disagreement votes in your „ Aella is a leader in…“ comment.)</p>\n", "parentCommentId": "idiaN4eYimjXE2YdJ", "user": {"username": "MaxRa"}}, {"_id": "oCNSwXzEtAry5rSwY", "postedAt": "2023-02-20T22:16:47.085Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Thanks, that's interesting - in my experience there is more often a general willingness in theory to believe sexual assault victims, which dissipates in the face of actual allegations about actual men.</p>\n", "parentCommentId": "6cEFz2dStqPCxy7Wp", "user": {"username": "britomart"}}, {"_id": "Dq5AysL2qsShZ7nkQ", "postedAt": "2023-02-20T22:33:07.495Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Yeah I def think you and Jason are more right now than I did even a few hours ago. Edited.</p>\n", "parentCommentId": "uzH2NpQFAwxGxjGGJ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "Y6uH7KPspxGgPuKB8", "postedAt": "2023-02-21T00:58:53.584Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I didn't downvote/disagreevote either comment, but clearly if one disagrees that Aella is a leader then they may disagreevote. similarly, if they think the merits of this post stands independently of who Aella is as a leader and is based on the idea that she is famous, then they might also disagree with the last sentence.</p>", "parentCommentId": "4tKttGiDTnk2zF3d5", "user": {"username": "pseudonym"}}, {"_id": "jEsSneodTFHCFJkJA", "postedAt": "2023-02-21T06:35:30.940Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Thanks for explaining!</p>", "parentCommentId": "Y6uH7KPspxGgPuKB8", "user": {"username": "SoniaAlbrecht"}}, {"_id": "MfFxoDKwd92dohGLR", "postedAt": "2023-02-21T18:01:01.681Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>So first, the story in time is stripped of context - it is impossible to judge from that story being told by a journalist how serious it is, because I know the journalist stripped out any information that would make it seem less bad.</p>\n<p>Second, that one individual in a group of thousands did something is never, ever, ever enough to judge the whole group - though the official reaction to that individual of course might be. I think that you are referring to Owen not being banned from all community positions immediately after this was reported to the community team by the anonymous woman. If you judge that as a reason to say the whole movement yas a problem, and I see it as totally reasonable, we disagree.</p>\n<p>But yes: That some priests sexually abuse children is irrelevant. There are tens of thousands. That a reporter claims that covering this up is a systematic issue is something that I will only believe if the reporter does the work to prove it. My extremely uninformed impression was that this had been proven in that case, but you correctly have pointed out to me that I should lower my confidence in the view that the catholic church pre 2010 or so had a real problem with sexual abuse.</p>\n<p>Thank you</p>\n", "parentCommentId": "y3duRvetvG9mLTPkk", "user": {"username": "timunderwood"}}, {"_id": "usxh3m2migKsBHCmS", "postedAt": "2023-02-21T18:03:26.156Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Sure, I think we agree, with the caveat that if the media says anything whatsoever is dangerous, without showing the statistics to establish that it is scarier than driving to work every day, I automatically disbelieve them.</p>\n", "parentCommentId": "Fg6GZvcirvCBNnF3a", "user": {"username": "timunderwood"}}, {"_id": "oNrxNifjBaDHdekYf", "postedAt": "2023-02-21T18:48:20.238Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I disagreed but didn't downvote. I mostly just found the word \"leader\" to be extremely strong. It might be the case that this is true in the SF scene &nbsp;(but I wouldn't know given I have no exposure to that) but I had never heard of aella prior to this post and would guess this is likely true for many people who live outside of SF. Also, leader usually implies some level of giving directions, having power, commanding, etc which I found pretty unlikely given what I know of EA organizational structure and helped the fact I had never heard of this person.</p>", "parentCommentId": "idiaN4eYimjXE2YdJ", "user": {"username": "Corm"}}, {"_id": "BQnRHycHjFpLcHZYs", "postedAt": "2023-02-22T00:39:45.098Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>It's highly unlikely anyone could sue for libel in the United States.</p></blockquote><p>This is incorrect. Firstly, you probably meant \"successfully sue for libel\" - anyone can sue for libel, in principle. Secondly, in the United States, people who are considered \"public figures\" have to prove actual malice, which means that establishing negligence had occurred would be insufficient to establish libel had occurred; however, this is not the case for people who are not public figures. In most cases, they only have to show negligence had occurred.</p><blockquote><p>Then you would have to show that you suffered harm from the libel.</p></blockquote><p>From what I have seen on social media from time to time, the world is suffering from an epidemic of entire political and social movements, such as Effective Altruism, being libelled periodically, with no real consequences. I am not saying this particular article is an example of that, I don't know, but it could be in principle. If that sort of behaviour (again, I'm not speaking about the Time article) isn't considered libel by the law, amounting to billions of dollars in damages from libelling thousands of individuals simultaneously, it ought to be, because it's greviously immoral and sociopathic. Just my opinion, but fiercely-held.</p>", "parentCommentId": "EaSmvhpepmLsPmYZ5", "user": {"username": "Robin_Green"}}, {"_id": "2hhuBnvuts7zBbxxv", "postedAt": "2023-02-22T00:56:39.239Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I disagree. This section of the post would presumably be useful to people who lack awareness of the extent of the problem, either because they have not famous and have not ever been the main character on social media, because they are extremely young, or because they are autistic. I am not such a person, but I do think it exposes the nature of the problem vividly and persuasively, in a way that helps you empathise with the victims of such defamation - or \"quasi-defamation\", as we might call defamation through innuendo and ethereal claims lacking all specificity or falsifiability. If you are not such a person either, it's something you could have just skipped over when reading the post.</p>", "parentCommentId": "RoD3PziPHkSd4Q8ey", "user": {"username": "Robin_Green"}}, {"_id": "aRZqpYYGuaZH4Tytr", "postedAt": "2023-02-22T01:19:50.158Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Large group libel isn't a thing. You can sometimes sue if the group is small enough -- lying about someone with characteristic X could lead to a libel suit if the description would only match like a dozen identifiable people (e.g., someone who lives in that house).</p>\n", "parentCommentId": "BQnRHycHjFpLcHZYs", "user": {"username": "Jason"}}, {"_id": "MbounMqAWfSGuYSyR", "postedAt": "2023-02-22T01:36:34.121Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>(US perspective here)</p>\n<p>There are definite statements of fact, and identifiable people, in that article.  Three have been identified already.</p>\n<p>Opinion isn't quite as clear cut as you imply-- opinions that imply knowledge of undisclosed false facts can be defamatory. Here, the reason for the opinion was stated (a particular advocacy for age-gap relationships) so I agree \"grooming\" is likely protected opinion here.</p>\n<p>Most of those figures are private, so the standard is mere negligence (but for Owen, likely actual malice).</p>\n<p>I don't see how Time could protect source identity from disclosure in a libel suit by a private individual. Without putting in evidence about their contacts with the person, they'd be hard pressed not to lose on negligence.</p>\n<p>Some courts have allowed anonymity in cased like this, at least early on. Opinions differ, but if I were the judge, I'd allow it at early stages in the litigation here.</p>\n<p>An opponent's lack of money can go both ways -- it can make litigation unattractive, but plaintiffs can often use the financial ruin that even \"winning\" would cause a poor defendant to get concessions.</p>\n", "parentCommentId": "EaSmvhpepmLsPmYZ5", "user": {"username": "Jason"}}, {"_id": "nrNqfipkpbkTMpBdp", "postedAt": "2023-02-22T07:31:51.457Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<blockquote><p>Second, that one individual in a group of thousands did something is never, ever, ever enough to judge the whole group - though the official reaction to that individual of course might be.</p></blockquote><p>Never, ever, ever? Are you saying you'd put a 0% chance that applying any kind of judgement on the group based on the actions of one individual is appropriate? This just seems clearly misguided.&nbsp;</p><p>In any case, I never made the claim that \"Owen not being banned from all community positions immediately after this was reported to the community team by the anonymous woman\" means that the EA movement as a whole has a problem, that's a strawman. I just expressed skepticism around your view that base rates are a necessary condition for you to consider something good evidence, by asking you whether there was anything at all that was qualitatively bad enough such that even 1 case would make you think it would be reasonable for a woman to conclude that EA in the Bay area, or even EA more broadly, isn't a safe space for them. but sounds like you think the answer is a firm and absolute no, which is pretty surprising to me.</p>", "parentCommentId": "MfFxoDKwd92dohGLR", "user": {"username": "pseudonym"}}, {"_id": "NNcme96dMyhJb4P3Z", "postedAt": "2023-02-22T19:57:22.590Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>The NYT may be an outlier among papers, but this instance is not an outlier of the <a href=\"https://deadline.com/2016/11/shocked-by-trump-new-york-times-finds-time-for-soul-searching-1201852490/\">NYT approach</a>.</p>", "parentCommentId": "MmyXmEieZRLsJrBk7", "user": {"username": "Douglas Knight"}}, {"_id": "gS2inqCZHc96MsL7j", "postedAt": "2023-02-22T20:07:01.818Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>Yeah I've heard elsewhere that NYT is pretty unusual here, would trust them less than other media.</p>", "parentCommentId": "NNcme96dMyhJb4P3Z", "user": {"username": "Linch"}}, {"_id": "pfx48su32k2rKn2TN", "postedAt": "2023-02-22T21:25:24.193Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>[strong upvoted because this thread is currently condensed for a new reader, and this thread is the most noteworthy place to see OP's further thoughts. I'm tryna make it expands so her comment is visible]</p>", "parentCommentId": "Yf2o49KeuDesk8GZR", "user": {"username": "Ivy_Mazzola"}}, {"_id": "oAcuLheRAwCtZMdRp", "postedAt": "2023-02-22T21:26:38.242Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I think we might be attaching different concepts to the same words here.</p>\n<p>When you say that one incident could indicate there is a problem, are you including the way the surrounding community reacts in what you mean by the 'incident', or does the 'incident' only include the fact that  one individual who was part of the community acted that way?</p>\n", "parentCommentId": "nrNqfipkpbkTMpBdp", "user": {"username": "timunderwood"}}, {"_id": "HL9NKnEGuHxodaQxd", "postedAt": "2023-02-23T10:02:16.233Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>I also disagreevoted for similar reasons. I'm familiar with Aella, but I would call her well known rather than a leader, such that similar to the top level comment here I don't really know how much to update on her description of events.</p>", "parentCommentId": "oNrxNifjBaDHdekYf", "user": {"username": "Arepo"}}, {"_id": "yJTEhRfMjvbJTxvuu", "postedAt": "2023-02-23T15:05:27.033Z", "postId": "2eotFCxvFjXH7zNNw", "htmlBody": "<p>&gt;Almost every old-school vegan or vegetarian should instantly \"get\" that people will just lie about you.&nbsp;</p><p>I was sure you were going to talk about other vegans attacking you for not being \"pure\" enough. &nbsp;</p>", "parentCommentId": "QN5anFrNPn6LeT5ur", "user": {"username": "MattBall"}}]