[{"_id": "6cYJywfrBft66McTW", "postedAt": "2024-02-08T06:47:23.137Z", "postId": "2gB8mTyyKJw8PczYQ", "htmlBody": "<p>Great overview! I'm Eddie, long-time EA and co-creator of the mental health app Clarity <a href=\"https://apps.apple.com/us/app/clarity-cbt-thought-diary/id1010391170\">https://apps.apple.com/us/app/clarity-cbt-thought-diary/id1010391170</a>&nbsp;</p><p>I pretty much agree with your broad points. Some quick thoughts on each section from an \"insider\" point of view:</p><p><strong>Short-term impacts of treatment</strong>: The problem with these studies is that they study \"apps\" as a category, but apps are 1. extremely different from one another and vary drastically in quality and 2. are constantly improving. The best apps are probably 10-100x better than the worst mental health apps. Also, functionality of the best apps today are very different than the best apps from a few years ago when these studies were run. In the future, they'll probably be even more different. I don't think we're close to peak mental health app effectiveness.</p><p><strong>Self-guided app adherence</strong>: Apple actually has made benchmarks available! I can grab them for you. For health and fitness apps which rely on a subscription business model, here are the 25th / 50th / 75th percentiles.</p><p>Day 1: ~16% / ~25% / ~34%<br>Day 7: ~3% / ~7% / ~13%<br>Day 28: ~0.75% / ~2.5% / ~6%</p><p>Note: The exact percentages vary by a little bit depending on which week is selected.&nbsp;</p><p><strong>User acquisition costs</strong>: I can confirm there are huge differences in cost per install between US iOS (in the range of $1-2 per install) vs low-income country Android ($0.02 - $0.10). Although of course, ads aren't the only way to get app downloads. Organic app downloads are $0.00!</p><p><strong>Development costs</strong>: If you were to put us on your comparison, we'd be at 2 employees (my wife and I) @ ~8,000,000 downloads across all of our apps. I can confirm that service and hosting costs are basically negligible.&nbsp;</p><p><strong>How to improve</strong>: I agree that marketing to low-CPI regions could be a great impact opportunity. I'm most excited about improving drop-off rates / effect sizes (two sides of the same coin). I can absolutely imagine a world where a self-guided mental health app is 10x more effective than the best one available now.&nbsp;</p><p>Again, great overview! Let me know if I can be helpful!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Eddie Liu"}}, {"_id": "s7efJc4oHAxjwrDD6", "postedAt": "2024-02-08T10:36:20.181Z", "postId": "2gB8mTyyKJw8PczYQ", "htmlBody": "<p>Welcome to the forum! Thanks so much for taking the time to dig into this question and sharing your findings. The treatment gap in global mental health is enormous and apps are an essential tool for addressing this challenge.&nbsp;</p><p>I didn't have time to review your calculations in detail, but I have a few general reflections that may be useful.<br><br>1) There is a brand new meta-analysis on the efficacy of mental health apps which includes 176 RCTS (<a href=\"https://onlinelibrary.wiley.com/doi/10.1002/wps.21183\">Linardon et al, 2024</a>). They conclude that \"<i>apps have overall small but significant effects on symptoms of depression and generalized anxiety, and that specific features of apps – such as CBT or mood monitoring features and chatbot technology – are associated with larger effect sizes.</i>\"<br><br>2) There is a substantial difference in efficacy between self-help and guided self-help apps. <a href=\"https://www.kayaguides.com/\">Kaya Guides</a> (incubated by Charity Entrepreneurship) is using WhatsApp to pilot the WHO's guided self-help intervention in India. Their founder wrote an excellent summary of their work <a href=\"https://forum.effectivealtruism.org/posts/CdELxtHgQjzCYPhtm/kaya-guides-marginal-funding-for-tech-enabled-mental-health\">here</a>.<br><br>3) Be careful with using a single WELLBY number for AMF. The wellbeing effects of life-extending interventions vary widely depending on philosophical choices, so it is better to use the range of possible outcomes rather than a single figure (see <a href=\"https://forum.effectivealtruism.org/posts/JgqEqsa6iAtqGLYmw/the-elephant-in-the-bednet-the-importance-of-philosophy-when-1\">The Elephant in the Bednet</a>).<br><br>4) John Torous is a leading researcher and thought leader in digital mental health. If you'd like to spend more time learning about this topic, I recommend looking at his <a href=\"https://scholar.google.com/citations?hl=en&amp;user=hNsmH54AAAAJ&amp;view_op=list_works&amp;sortby=pubdate\">recent publications</a>.</p><p>5) The current market for mental health apps is completely unregulated and there are major concerns about privacy and data protection. Wellcome recently <a href=\"https://www.gov.uk/government/news/mental-health-funding-of-18m-welcomed-by-mhra-and-nice-to-explore-regulation-of-digital-mental-health-tools\">awarded £1.8m</a> to MHRA and NICE to explore how the market could be regulated more effectively to protect patient safety.</p>", "parentCommentId": null, "user": {"username": "BarryGrimes"}}, {"_id": "snsAW7MJxjGQBEkSW", "postedAt": "2024-02-08T16:05:21.924Z", "postId": "2gB8mTyyKJw8PczYQ", "htmlBody": "<p><strong>Executive summary</strong>: Self-guided mental health apps like Headspace provide significant wellbeing improvements, but remain much less cost-effective than cash transfers due to high operating costs. Reducing these costs could make them competitive.</p><p><strong>Key points</strong>:</p><ol><li>Self-guided apps have a small effect size on depression/anxiety symptoms (0.15-0.31 SD).</li><li>This translates to ~0.21 WELLBYs per user at post-test, but few users continue long-term.</li><li>User acquisition and development costs are high, making them 1.5-12.7σ less cost-effective than cash transfers.</li><li>Reducing hiring needs and marketing to low-CPI regions could significantly improve cost-effectiveness.</li><li>Increasing retention rates and effect sizes would also help close the gap with cash transfers.</li><li>More research is needed, but there is potential for self-guided apps to become highly cost-effective.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "X3YCDu99iWzYfHeFP", "postedAt": "2024-02-08T23:17:08.211Z", "postId": "2gB8mTyyKJw8PczYQ", "htmlBody": "<p>Eddie, thank you (I’m a long time fan!)</p>\n<p><strong>Short-term impacts:</strong> Mmm, this has made me realise I wasn’t explicit about the assumptions I made there—I should either make that effect size bound a bit wider or model it as an exponential (or possibly a beta). I think this CEA is best interpreted as ‘if you built an evidence-based product, what would its cost-effectiveness be?’ but even that should probably have a wider bound. And there’s the new update in Linardon et al. (2024) that will be worth incorporating.</p>\n<p><strong>Adherence</strong>: Thank you! That roughly tracks with the decay curves from SimilarWeb, which is good validation. Although you raise a good point—decay probably depends a lot on whether you’re feature-gating after a trial period or not. Do you have a ballpark for the ratio of installs to DAU?</p>\n<p><strong>CPI</strong>: Those are lower CPIs than the estimates I had—good to know! Are those on Facebook, Tik Tok, elsewhere? I was also assuming organic traffic is negligible after the first hundred thousand or so, but do you still see an effect there?</p>\n<p><strong>Dev costs</strong>: Lovely! Having worked in industry, I definitely have the sense that there are good incentive reasons why headcounts might be unnecessarily bloated 🙃</p>\n<p><strong>Opportunities</strong>: I won’t ask what your roadmap looks like, but it’s very promising that you have this hunch. In my own experience as a user, I can definitely concur.</p>\n<p>I’ll mull for a bit and update the OP with some adjustments. I might also shoot you a DM with some curiosity questions later. Thank you again! 😍</p>\n", "parentCommentId": "6cYJywfrBft66McTW", "user": {"username": "huw"}}, {"_id": "azzHQnZscimAfjuMN", "postedAt": "2024-02-08T23:31:19.745Z", "postId": "2gB8mTyyKJw8PczYQ", "htmlBody": "<p>Cheers Barry!</p>\n<ul>\n<li>Thank you for finding that update to Linardon, that looks very useful &amp; I can pretty easily incorporate it. Will do ASAP and update the OP.</li>\n<li>Guided self-help is interesting, of course, as a related flavour. I am much less familiar with the mechanics and cost structures. I suppose I also have general moral qualms about interventions that rely on low-cost labour to reach cost-effectiveness, but that’s a post for another day.</li>\n<li>Yep, aware of Elephant in the Bednet. I deliberately chose the highest estimate of cost-effectiveness I could find for steelpersoning purposes, but for just evaluating cost-effectiveness head-to-head it would be inappropriate.</li>\n<li>Will go through Torous’ work—thank you for the recommendation!</li>\n<li>Yeah, I am very concerned about that aspect of the current market and a few other papers I reviewed suggested numbers in the range of 30% of users made download decisions based on privacy. I think there’s a lot here!</li>\n</ul>\n<p>Thank you again, particularly for the extra research directions. Will analyse further :)</p>\n", "parentCommentId": "s7efJc4oHAxjwrDD6", "user": {"username": "huw"}}, {"_id": "AaxKiXDK2hEYpZqQA", "postedAt": "2024-02-09T01:51:16.177Z", "postId": "2gB8mTyyKJw8PczYQ", "htmlBody": "<p><strong>Ratio of Installs to DAU</strong>: Hmm, that's an interesting metric...the way I think about retention is like a layered cake, kind of like the baumkuchen I just ate for breakfast, but linear instead of round. Anyways, there's time on the X axis and users on the Y axis. For any given day, there's a sizeable layer of cream at the top which are the Day 0 users. And then right below that, a smaller layer of Day 1 users, etc. etc. Ultimately there are hundreds of layers of users from older daily cohorts. You can track each daily cohort through time and it'll start big and then shrink rapidly, following the retention curves, until eventually it flatlines at some point (ideally above 0).&nbsp;</p><p>So you could look at overall installs to DAU, but that gives an advantage to new apps because they don't have a lot of old installs from years-old cohorts that have left. Or you could compare daily installs to DAU, but that gives an advantage to old apps because they'll have a lot of users from old cohorts.</p><p>A better metric could be DAU / MAU ratio, which measures like out of all of your active users, how many of them use the app every day. Here ~25% would be exceptional with an average of probably around 10%. But that's also biased based on how many new users you're bringing in each day.&nbsp;</p><p>By the way, the only peer group benchmarks that apple provides are Conversion Rate, Proceeds per Paying User, Crash Rate, Day 1/7/28 Retention. <a href=\"https://developer.apple.com/app-store/peer-group-benchmarks/\">https://developer.apple.com/app-store/peer-group-benchmarks/</a> . But they might be announcing more in March thanks to the EU's DMA. <a href=\"https://developer.apple.com/support/dma-and-apps-in-the-eu/#app-analytics\">https://developer.apple.com/support/dma-and-apps-in-the-eu/#app-analytics</a> &nbsp;</p><p>&nbsp;</p><p><strong>CPI: </strong>Yes, those numbers are from Facebook / Instagram / TikTok ads.&nbsp;</p><p>In terms of organic traffic, it's also a measure of time. Say for example you're bringing in 1000 organic users a day. After a year, that's 365k users. After 5 years that's 1.8M users. Of course, the app still has to remain good to continue getting organic downloads. Since the definition of good is always improving, the app would need to be consistently updated.&nbsp;</p><p>I'd say estimate around 2/3 of our lifetime installs are organic, but it really depends on the app. I speculate that Daylio might be closer to 100% organic while Breeze is probably closer to 0%.&nbsp;</p>", "parentCommentId": "X3YCDu99iWzYfHeFP", "user": {"username": "Eddie Liu"}}, {"_id": "ZzxqHsFLj6ENFLhJY", "postedAt": "2024-02-09T05:22:42.039Z", "postId": "2gB8mTyyKJw8PczYQ", "htmlBody": "<p>Hmm—good points. Getting Installs/DAU wrong could meaningfully affect the numbers, I guess longer-term retention per install is probably a better way of accounting for it. It was unclear to me whether to model retention as having a zero or nonzero limiting value, which would change some of the calculations.</p><p>Improving organic install rate would be promising if you could get it above 50%, I think (your apps sound very effective!). I suspect a lot of that is, as you say, about consistently building a good user experience and continuing to add value. (I see a lot of Daylio users complaining about the lack of updates &amp; the increased ad load.)</p>", "parentCommentId": "AaxKiXDK2hEYpZqQA", "user": {"username": "huw"}}]