[{"_id": "fp3muxsPTXqgJAxMt", "postedAt": "2022-09-28T19:48:58.432Z", "postId": "2h2E448uqCY6uGbAg", "htmlBody": "<p>Yuri, the prize submission criteria &nbsp;state:</p><ul><li>\"Past works that would have qualified for this prize include:&nbsp;<a href=\"https://intelligence.org/files/AIPosNegFactor.pdf\"><u>Yudkowsky 2008</u></a>,&nbsp;<a href=\"https://www.amazon.com/Superintelligence-Dangers-Strategies-Nick-Bostrom/dp/1501227742\"><i><u>Superintelligence</u></i></a>,&nbsp;<a href=\"https://www.alignmentforum.org/posts/KrJfoZzpSDpnrv9va/draft-report-on-ai-timelines\"><u>Cotra 2020</u></a>,&nbsp;<a href=\"https://arxiv.org/abs/2206.13353\"><u>Carlsmith 2021</u></a>, and Karnofsky's&nbsp;<a href=\"https://www.cold-takes.com/most-important-century/\"><u>Most Important Century</u></a> series. (While the above sources are lengthy, we'd prefer to offer a prize for a brief but persuasive argument.)\"</li><li>\"Only original work published after our prize is announced is eligible to win.\"</li></ul><p>Your book does not qualify for the prize, per se, but you should check with FTX whether a work you submit based on that book's research might be suitable as a submission. I would have let someone else inform you, but a lot of posts to this forum don't get any attention, apparently, particularly as the number of submissions (and comments) goes up.</p>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "BX4SsuGqqDJr6XT6K", "postedAt": "2022-09-28T23:28:14.125Z", "postId": "2h2E448uqCY6uGbAg", "htmlBody": "<p>Sorry, but downvoted because of what Noah Scales said. This work could be prize worthy, but as it stands it isn't good.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "TQMuEaLka2nxuvrtz", "postedAt": "2022-09-29T14:15:30.184Z", "postId": "2h2E448uqCY6uGbAg", "htmlBody": "<p>Thank you very much for your feedback. I value you advise</p>", "parentCommentId": "fp3muxsPTXqgJAxMt", "user": {"username": "Yuri Barzov"}}, {"_id": "mffZKr5e55gmgjjP4", "postedAt": "2022-10-06T23:45:57.456Z", "postId": "2h2E448uqCY6uGbAg", "htmlBody": "<p>Interesting post Yuri, but I am very confused about your claim that Pavlov's ideas were ignored: \"this mechanism has been neglected by the mainstream of psychologists\". My understanding is that the ideas inspired the U.S. school of Behaviorism where Watson and then Skinner pretty much ruled American psychology from 1920 to the mid 50s.&nbsp;<br>The Cognitive Revolution spearheaded by for example Chomsky, showed that simple rules of learning were not sufficient to explain adult competence. The debate has been revived in a modern form by deep learning, of course,</p>", "parentCommentId": null, "user": {"username": "cveres"}}, {"_id": "NGKRsokKnv7KTotEG", "postedAt": "2022-10-12T10:54:47.029Z", "postId": "2h2E448uqCY6uGbAg", "htmlBody": "<p>You are right. Early Pavlov's ideas &nbsp;of stimulus-response learning and conditioning were not ignored. I had to be more specific that the latest idea of Pavlov about stimulus-stimulus learning was ignored. I'm working on a short paper that will summarise the book's findings and will try to be more clear in it</p>", "parentCommentId": "mffZKr5e55gmgjjP4", "user": {"username": "Yuri Barzov"}}, {"_id": "3zDKbaFc4GRzohhdG", "postedAt": "2022-10-21T10:52:20.739Z", "postId": "2h2E448uqCY6uGbAg", "htmlBody": "<p>Noah, I've made a very short original submission paper following your advise. Thank's once again <a href=\"https://forum.effectivealtruism.org/posts/Js4uiJEahHhQBKE3h/agi-will-arrive-by-the-end-of-this-decade-either-as-a\">https://forum.effectivealtruism.org/posts/Js4uiJEahHhQBKE3h/agi-will-arrive-by-the-end-of-this-decade-either-as-a</a>&nbsp;</p>", "parentCommentId": "fp3muxsPTXqgJAxMt", "user": {"username": "Yuri Barzov"}}, {"_id": "JDKfuFy8auwmZ9tsw", "postedAt": "2022-10-21T17:49:18.688Z", "postId": "2h2E448uqCY6uGbAg", "htmlBody": "<p>Hmm, ok, well, under the tag \"Future Fund Worldview Prize\" there are several entries from you. When I wanted to remove some old entries under a certain tag (another different contest tag), I had to move my posts under that tag to drafts. I could not just remove the tag. It &nbsp;might have been a database updating issue, and could have resolved itself, but I did not want to wait and find out. Just an FYI if you are not wanting all your old cveres entries to be submitted.</p><p>OTOH, Nick Beckstead did say a person can submit multiple entries to address different questions.</p>", "parentCommentId": "3zDKbaFc4GRzohhdG", "user": {"username": "Noah Scales"}}]