[{"_id": "s2wQvHBfi8iaAHAaH", "postedAt": "2022-10-30T08:58:34.198Z", "postId": "2hTDF62hfHAPpJDvk", "htmlBody": "<p>This is an interesting post! I've been working on a lightweight respiratory transmission model as part of a recently started biosec project (<a href=\"https://forum.effectivealtruism.org/posts/D6oKe6kjHeBeiCtWn/developing-next-gen-ppe-to-reduce-biorisks\">https://forum.effectivealtruism.org/posts/D6oKe6kjHeBeiCtWn/developing-next-gen-ppe-to-reduce-biorisks</a>), focused on the effects of PPE, and am very much seeing the limitations of published models - would love to  chat about this, I'll pop you a message :)</p>\n", "parentCommentId": null, "user": {"username": "AndyGraham"}}, {"_id": "nrhHhpYm6ffNHmmBD", "postedAt": "2022-11-01T18:46:48.029Z", "postId": "2hTDF62hfHAPpJDvk", "htmlBody": "<p>(I'd potentially be willing to give advice on that sort of model as well.)</p>", "parentCommentId": "s2wQvHBfi8iaAHAaH", "user": {"username": "Davidmanheim"}}, {"_id": "vrkthotfvkGZfu4hW", "postedAt": "2022-11-10T16:25:20.983Z", "postId": "2hTDF62hfHAPpJDvk", "htmlBody": "<p>&gt; How might such multi-domain models have helped during the pandemic? If we had had such models we might have been able to better predict some of the second order impacts of lockdown policies, which seemed to take a lot of people by surprise. This includes the shock to supply chains, the labour market and the health care system.<br><br>Is this argument perhaps a little circular: in order to predict problems in certain areas, you first have to model those, but why model them unless you already predict problems in those areas?</p>", "parentCommentId": null, "user": {"username": "David Mears"}}, {"_id": "y3zra4a5YyeDQ9CMa", "postedAt": "2023-03-05T19:51:03.675Z", "postId": "2hTDF62hfHAPpJDvk", "htmlBody": "<p>Hi David,</p><p>I think the thought is that, although we can model simple (1st order) interactions directly, we cannot accurately model complex (higher order) systems directly. So multi-domain models integrating all the simple models can be useful, as long as we have some insight into how the domains interact.</p>", "parentCommentId": "vrkthotfvkGZfu4hW", "user": {"username": "vascoamaralgrilo"}}]