[{"_id": "imfpR7TfCfDFSRKmN", "postedAt": "2013-10-28T07:38:00.000Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>Fantastic post. Thanks Scott.</p>\n", "parentCommentId": null, "user": null}, {"_id": "q9bGx542DS4mrXpcC", "postedAt": "2013-12-16T19:01:00.000Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>Note that this essay was written several years ago, and the cost to e.g. save a life from malaria has changed.</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise2"}}, {"_id": "ALufzfSYDHqeJhQLv", "postedAt": "2016-03-10T03:40:54.312Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>The cost, or our understanding of the cost? I don't think diminishing marginal utility has been achieved in such a drastic way; I think that the old Peter Singer quote from which that number originated has been taken out of context for decades. I could be wrong, though!</p>\n", "parentCommentId": "q9bGx542DS4mrXpcC", "user": {"username": "aarongertler"}}, {"_id": "6ATRkQWp7oi4hW6WG", "postedAt": "2016-09-29T14:35:48.540Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>It says that's the GiveWell figure for bednets to save a life, presumably as of 2010. I'm not sure how much of the change is due to more bednets out there (which has been <a href=\"https://www.givingwhatwecan.org/post/2015/12/bednets-have-prevented-450-million-cases-of-malaria/\">significant</a>) and how much is GW feeling less confident about everything than they did in 2010. &quot;Famine, Affluence, and Morality&quot; doesn't mention a specific number to save a life.</p>\n", "parentCommentId": "ALufzfSYDHqeJhQLv", "user": {"username": "Julia_Wise"}}, {"_id": "F4piyFcPQwaiF8jTk", "postedAt": "2016-10-22T20:56:06.298Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>The Current figure estimated by GiveWell is $3,500 per life saved:</p>\n<p><a href=\"http://www.givewell.org/charities/against-malaria-foundation#Cost_per_life_saved\">http://www.givewell.org/charities/against-malaria-foundation#Cost_per_life_saved</a></p>\n", "parentCommentId": "6ATRkQWp7oi4hW6WG", "user": {"username": "Ofir"}}, {"_id": "SLYRr7ZdTJhQvSHob", "postedAt": "2017-03-14T22:14:37.704Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>While it makes sense to point out that a prospective donor needs to evaluate what they value most before they choose where to donate, it seems hasty to assume that one obviously has to value &quot;number of lives&quot; saved more that improving the quality of life or well-being of people in your own community or neighborhood. </p>\n", "parentCommentId": null, "user": {"username": "abhiadastra"}}, {"_id": "zPwoyAAZJr8iYoHqP", "postedAt": "2022-01-09T09:58:06.701Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>[I'm doing a bunch of low-effort reviews of posts I read a while ago and think are important. Unfortunately, I don't have time to re-read them or say very nuanced things about them.]</p><p>I think this is one of the best introductions to the overall EA mindset.</p>", "parentCommentId": null, "user": {"username": "Maxdalton"}}, {"_id": "KSwFFhHgCtykYqxC4", "postedAt": "2023-01-16T01:54:40.166Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>Key takeaway: \"He preferred to be good, rather than to seem so.\"</p>", "parentCommentId": null, "user": {"username": "madhav-malhotra"}}, {"_id": "witixCtRKuoAawsiD", "postedAt": "2023-01-24T01:51:32.037Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>Is the nonprofit lawyer really making a lower impact per hour worked compared to the earning-to-give corporate lawyer? &nbsp;This could be a good case study of system change efforts vs direct donation.</p><p>Let's say the lawyer is donating $200,000/year less than they would have if they stayed at a for-profit firm (donating $200,000 requires an extremely high percentile conviction in the efficacy of effective donation and something like top 1-5% earnings for a lawyer, but I'll use this to be conservative), but now is working on enforcing environmental legislation.&nbsp;</p><p>$4500 to save a life with AMF in Guinea according to<a href=\"https://www.givewell.org/cost-to-save-a-life\"> Givewell</a>: $200,000/$4500 = 45 lives saved per year from malaria. So in a twenty-year career at the nonprofit, say, the lawyer would have to accomplish good equivalent to saving 900 lives.&nbsp;</p><p>The easiest way to convert impact to lives is probably estimating the lives lost for a given amount of carbon emitted. Thankfully, this has been <a href=\"https://www.nytimes.com/2021/07/29/climate/carbon-emissions-death.html\">done</a>. <a href=\"https://www.nature.com/articles/s41467-021-24487-w#:~:text=Our%20central%20estimate%202020%20MCC,globally%20between%202020%20and%202100.\">They found that</a> 4434 metric tons of carbon saved is a life saved. So the lawyer needs to save 3,990,600 tons of carbon to hit equivalence.&nbsp;</p><p>Looking through the \"recent wins\" page of Earthjustice, the largest environmental justice employer, is a case that is <a href=\"https://earthjustice.org/news/press/2022/u-s-department-of-energy-must-implement-delayed-efficiency-standards\">estimated to have saved</a> 970,000,000-1,800,000,000 tons of carbon by 2050. Earthjustice can't take full credit for this--they were just part of a team suing, along with many city and state governments. Let's say their expertise was responsible for 1% of the win. Taking the midpoint of the carbon estimate, 1,385,000,000 was saved, of which Earthjustice was responsible for 13,850,000.&nbsp;</p><p>This means that if every lawyer at Earthjustice (there are 200+, so we'll estimate 299 to be super safe and account for other workers who are supporting them) had a win that big just once over their twenty-year career, they would each be outperforming $200,000/yr donated by a factor of 4.&nbsp;</p><p>If this singular recent win was the whole impact of Earthjustice for 2022, how would that stack up, divided among 299 lawyers/personnel?</p><p>Well, that's 46,321 tons of carbon, per lawyer, per year. Over 20 years that's 926,421 tons. So, rather poor. That's about a fourth of the impact of the $200,000/year. Equivalently, Earthjustice needs to put out 4 wins of that magnitude a year to justify its existence through proactive action alone (though a decent percentage of their actual impact is in deterrence, I'd imagine). <a href=\"https://earthjustice.org/our_work/all-victories\">Here's</a> the recent victories page if you want to judge for yourself how large the impact of various wins are. (EDIT: I found at least one other 2022 win with comparable carbon impact, see comments below).</p><p>Overall, I'd say it's quite plausible--even probable, after further consideration (see the comments below)--that the environmental lawyer would have equivalent or greater impact. To be fair, OP was written when the cost estimate of saving a life with GiveWell was much lower.</p>", "parentCommentId": null, "user": {"username": "Sam Battis"}}, {"_id": "ddJB9ZN2Fqa3Dryq6", "postedAt": "2023-01-24T02:14:45.826Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>Bonus evaluation of another <a href=\"https://earthjustice.org/news/press/2022/message-delivered-usps-charts-a-course-for-an-electric-mail-truck-fleet\">2022 win</a>: 66,160 electric &nbsp;mail trucks replacing 8mpg gasoline trucks over the next few years, directly as a result of suing over a plan that would have purchased 106,000 entirely gasoline trucks over that time. They also got them to guarantee all electric from 2026 onwards.</p><p>If a mail truck does a 30-mile route, and idling and driving back account for 3/4 of total fuel usage, then 120miles/8mph = 15 gallons of gas would have been burned. Every gallon is <a href=\"https://www.epa.gov/greenvehicles/greenhouse-gas-emissions-typical-passenger-vehicle#:~:text=Every%20gallon%20of%20gasoline%20burned%20creates%20about%208%2C887%20grams%20of%20CO2.\">8.887kg of carbon</a>. So over a year, assuming the vehicle is driven 320 days, that's 42,658kg or 42.7 metric tons. Let's say the electricity still pollutes 2/3 of the amount as gasoline, because a lot of it is fossil fuels. That's 14.2 metric tons saved, per vehicle, per year. Let's say the vehicles are in use for 15 years each. 66,160 vehicles &nbsp;* 15 years * 14.2 tons/vehicle/year = 14,092,080 metric tons saved. And that's not even to mention the guarantee of only electric after 2026, or the fact that the electricity will probably start to come from cleaner sources.</p><p>So actually, this case is even bigger than the other I examined. It's exceeded the impact by 2041, nine years earlier, plus it has even more impact, potentially twice the impact, after the guarantee is added in. So there were at least two major wins for Earthjustice in 2022, and if all the rest of its victories and deterrence added up to four major wins, then working as an Earthjustice lawyer was at least as good as donating $200,000 to GiveWell.</p><p>And this isn't even to consider the fact that some of the bigshot corporate law cases might have moral negatives, e.g. a citizen or government body righteously sues a company, and you're helping the company get away with it.</p>", "parentCommentId": "witixCtRKuoAawsiD", "user": {"username": "Sam Battis"}}, {"_id": "5kY7KDw2xNidS5paQ", "postedAt": "2023-01-24T02:25:12.765Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>Of course, only a portion of Earthjustice's work is measured in reducing carbon. You'd want to use the number of Earthjustice attorney FTEs that can be fairly classified as devoted to carbon reduction (which I don't know), rather than total attorney headcount.</p>", "parentCommentId": "witixCtRKuoAawsiD", "user": {"username": "Jason"}}, {"_id": "QFmSTzEwCNcCTimHw", "postedAt": "2023-01-24T16:06:42.761Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<p>True, their role in defending the endangered species act, conserved land, and water/air quality regulations is also extremely valuable, just harder to quantify in terms of lives saved. If those types of victories account for, say, 3/4 of Earthjustice's impact, then  the numbers start to suggest that each of the lawyers make a <em>much</em> bigger impact (3x+ perhaps) than $200,000 in donations per year, as I was able to find another large  strictly-carbon win for 2022 (electrifying mail trucks).</p>\n<p>Adding in the value of deterrence and the diffuse cultural impact of the group, it could conceivably be an order of magnitude better.</p>\n", "parentCommentId": "5kY7KDw2xNidS5paQ", "user": {"username": "Sam Battis"}}, {"_id": "pxfZTKixhqpa6WJjk", "postedAt": "2023-04-07T19:12:40.122Z", "postId": "2iAwiBQm535ZSYSmo", "htmlBody": "<blockquote>\n<p>Most donors say they want to \"help people\". If that's true, they should try to distribute their resources to help people as much as possible.</p>\n</blockquote>\n<p>This is not a valid argument. The conclusion doesn't follow from the premise unless you assume that \"help people\" means \"help people as much as possible\". But it doesn't.</p>\n<p>Nothwithstanding, let's say \"I want to help people as much as possible.\" I still need a theory of change - help people in what way?</p>\n<p>You could try \"help as many of them avoid unnecessary death as possible\". Then we are in the scenario you describe, but we have already excluded investing in the arts based on how we have defined our goal.</p>\n<blockquote>\n<p>There is only one best charity: the one that helps the most people the greatest amount per dollar.</p>\n</blockquote>\n<p>If everyone gave to the \"best charity\" you would pass the point of diminishing returns and likely hit the point of negative returns.</p>\n<p>Therefore, everyone seeking the \"best charity\" to give to is not the best approach to capital allocation.</p>\n<p>Therefore, some people should not be following this strategy.</p>\n<blockquote>\n<p>If a high-powered lawyer who makes $1,000 an hour chooses to take an hour off to help clean up litter on the beach, he's wasted the opportunity to work overtime that day, make $1,000, donate to a charity that will hire a hundred poor people for $10/hour to clean up litter, and end up with a hundred times more litter removed.</p>\n</blockquote>\n<p>This assumes it is ethically responsible to perpetuate a system where a person can earn $1000 per hour and others make $10 per hour, and that being a high-powered lawyer is otherwise morally neutral.</p>\n", "parentCommentId": null, "user": {"username": "Simon Stewart"}}]