[{"_id": "E2unpPaJHqiDfy5zk", "postedAt": "2023-09-15T11:23:19.869Z", "postId": "2iFfx99CbHC45oC4R", "htmlBody": "<p>Thank you for sharing these! I'm probably going to try the first three as a result of this post.</p>\n", "parentCommentId": null, "user": {"username": "Isaac_Dunn"}}, {"_id": "4b49zLToHNqRe5a57", "postedAt": "2023-09-15T15:46:26.918Z", "postId": "2iFfx99CbHC45oC4R", "htmlBody": "<p>Great post; I enjoyed it.<br><br>I've got two things to say, the first one being that GPT is a very nice brainstorming tool as it generates many more ideas than you could yourself that you can then prune from, which is nice.<br><br>Secondly, I've been doing \"peer coaching\" with some EA people using reclaim.ai (not sponsored) to automatically book meetings each week where we take turns being the mentor and mentee answering the five following questions:<br><br>- What's on your mind?<br>&nbsp;- When would today's setting be a success?<br>&nbsp;- Where are you right now?<br>&nbsp;- How do you get where you want to go?<br>&nbsp;- What are the actions/first steps to get there?<br>&nbsp;- Ask for feedback</p><p>I really like the framing of meetings with yourself, I'll definitely try that out. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Jonas Hallgren"}}, {"_id": "oicS2BJeZmhmdEojS", "postedAt": "2023-09-15T19:50:10.200Z", "postId": "2iFfx99CbHC45oC4R", "htmlBody": "<p>(huge missed opportunity not using the <a href=\"https://www.memesportal.com/wp-content/uploads/2021/04/28this.jpg\">lonely Pablo meme</a> as the splash image for this post imo)<br><br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Kaleem"}}, {"_id": "8CAmGX4MarZJehXKM", "postedAt": "2023-09-15T20:51:17.813Z", "postId": "2iFfx99CbHC45oC4R", "htmlBody": "<p>I did consider calling it \"four coping mechanisms if you're lonely at work\" 🙃</p>", "parentCommentId": "oicS2BJeZmhmdEojS", "user": {"username": "eirine"}}, {"_id": "j4W6r8KwAosqq82oM", "postedAt": "2023-09-15T21:28:08.602Z", "postId": "2iFfx99CbHC45oC4R", "htmlBody": "<p>Thanks for writing this! I love the walking meeting with yourself idea.</p>\n", "parentCommentId": null, "user": {"username": "Tori"}}, {"_id": "JctnzXQGr58HMgPyu", "postedAt": "2023-09-16T02:03:08.874Z", "postId": "2iFfx99CbHC45oC4R", "htmlBody": "<p>This is stellar advice! What's wild is, I have accidentally stumbled on each of these techniques at various points and just never really consciously identified the technique, which meant it wasn't repeatable at will. This post really crystallizes important options for me; definitely feeling some sheepish \"shoulda figured that one out\" combined with relief that you did it for me. THANK YOU.</p>", "parentCommentId": null, "user": {"username": "Gavriel Kleinwaks"}}, {"_id": "D5D73hdv3koTjzCwC", "postedAt": "2023-09-19T14:55:55.908Z", "postId": "2iFfx99CbHC45oC4R", "htmlBody": "<p>Thanks for taking the time to write this, Eirin! I love the \"if you say things twice, write it down\" rule from your other post. I'll think about setting something like this up for myself.<br>And I like the idea of having a productivity check in.</p>", "parentCommentId": null, "user": {"username": "Sara Elsholz"}}]