[{"_id": "Ed6qgzwgfPeYPQhR4", "postedAt": "2022-09-21T14:10:45.880Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<figure class=\"image\"><img src=\"https://pbs.twimg.com/media/DZj8pB8VMAAxPNR.jpg:large\"></figure>", "parentCommentId": null, "user": {"username": "technicalities"}}, {"_id": "QGGBK3Fsaikp4prwv", "postedAt": "2022-09-21T14:12:19.654Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>It's a pretty big deal though.</p><p><a href=\"https://forum.effectivealtruism.org/posts/8ekqxkowckzEKu3uG/off-road-support-for-eas-struggling-at-uni\">https://forum.effectivealtruism.org/posts/8ekqxkowckzEKu3uG/off-road-support-for-eas-struggling-at-uni</a></p><p>https://forum.effectivealtruism.org/posts/jrLMZKQPcTbFnWajy/off-road-interviews-with-ea-college-dropouts</p>", "parentCommentId": "Ed6qgzwgfPeYPQhR4", "user": {"username": "technicalities"}}, {"_id": "syLzqyGyGGucpRuyz", "postedAt": "2022-09-21T15:23:46.833Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I sometimes wonder if I should have dropped out of my Philosophy BA when I realised that roughly 3 students in my year had a serious interest in philosophy.</p>\n<p>If I had done that I wouldn't have ended up going on study exchange to Iceland and writing on Nietzsche and Schopenhauer in a farmhouse in the middle of nowhere.</p>\n<p>I had a great time with all that. But it was 2010 and arguably I should have been on LessWrong <a href=\"https://www.lesswrong.com/posts/MajyZJrsf8fAywWgY/a-lesswrong-crypto-autopsy\">waiting for Gwern to post about Bitcoin</a>. And applying to Oxbridge, and/or Y Combinator.</p>\n<p>I studied Philosophy at a second-tier university (neither Oxbridge, nor the best London options). I had a great time but in hindsight I should have taken an \"Oxbridge, LSE or bust\" strategy. That's the advice I'd give my younger self.</p>\n<p>In fact my 17 year old self applied for neither Oxbridge nor LSE because I didn't like the <em>vibes</em> of Oxbridge and I didn't want to live in London. Not crazy, but if I'd had concepts like social capital, selection effects and signalling on my radar, I would have surely made a different call. I see this as one of the biggest mistakes I've ever made. I'm very happy with how things are working out, and I rarely think about this. But if I do stop and reflect, I wonder what might have been.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "zFBKEafJmjZ6hYpRH", "postedAt": "2022-09-21T15:32:12.932Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I have a cousin who completed 1 year at one American university, but found the academic standards unacceptably low. They dropped out and switched to another course at another university. They just completed the first year of that. The decision to switch looked good <em>ex ante</em> and looks excellent, <em>ex post</em>.</p>\n<p>It was a difficult decision partly because (if I understand correctly—I still can't really believe this) the original terms of their study grant included a clause about <em>not</em> dropping out of the first university, on pain of a major financial penalty.</p>\n", "parentCommentId": "syLzqyGyGGucpRuyz", "user": {"username": "Peter_Hartree"}}, {"_id": "wsNaWLAY57mfHMjev", "postedAt": "2022-09-21T15:51:12.368Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I humbly submit my application, having just formally dropped out of a PhD I was doing for 6 years (it was one of those long American ones). I de-facto dropped out/stopped working on it about a year ago. I feel very good about this decision - continuing would have meant wasting another miserable year or so just to get a credential. I'm doing EA writing stuff now which seems like a better use of my time.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "hjg8tMCGaMP3FkbsZ", "postedAt": "2022-09-21T15:54:59.705Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I think a lot of the value of university is providing a peer group for social and intellectual development. To the extent you hasn't found a great group of friends at university, I think you should actively try very hard to find a group that you enjoy spending time with then lean into this. To the extent you can fill this need outside of university, it seems very reasonable to drop out.</p><p>This is the advice I'd give to my younger self: I didn't make many great friends in college and should have tried much harder to find my niche. But I don't think I was ready to just drop out and start working, since I hadn't found my niche outside of university yet either. That being said, it might be a better idea for people who are more emotionally mature than me on some dimensions to \"drop out and start working\" even if they haven't quite found their niche.</p><p>I'd also link to <a href=\"https://www.goodreads.com/en/book/show/36319077\">The Case Against Education</a>. It's probably a bit hyperbolic but I think it's pointing at a real dynamic: a large portion of the purpose of college is signaling rather than building human capital.</p>", "parentCommentId": null, "user": {"username": "elifland"}}, {"_id": "8MkEDoMywBR4JhAKQ", "postedAt": "2022-09-21T16:40:41.046Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Huge congrats, welcome to the team</p>", "parentCommentId": "wsNaWLAY57mfHMjev", "user": {"username": "technicalities"}}, {"_id": "p8zFCwcEswwm95F8D", "postedAt": "2022-09-21T17:41:50.603Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<h3>My application</h3><p>I dropped out of my undergrad about halfway through and think I made some learnable mistakes in the process.</p><p>Originally I was studying law, on the grounds that:</p><ol><li>My teachers and parents said I'd make a good lawyer;</li><li>They similar pressured me to do a subject perceived as \"highly academic\";</li><li>I was quite a good public speaker at school;</li><li>I thought it represented the best chance I had of getting in to Oxbridge.</li></ol><p>None of these reasons are particularly good ones for choosing a degree, but nobody ever sat me down and gave me a better framing for of the problem, so I just went along with it. &nbsp;Point #4 was potentially true given that I did get an offer from Cambridge, and at one point my academic career seemed to be on a solid trajectory - I would go to Cambridge, become a barrister afterwards, be financially secure and successful and ride off into the sunset. Unfortunately I suffered from various executive dysfunction and mental health issues both at school and uni but didn't legitimise them and therefor didn't devote the necessary resources to resolve them. This led to me declining my Cambridge offer as I knew there was no way I was going to get the required grades, and subsequently also led to me dropping out of Lancaster University about halfway through my second year, at which point I went from having a solid life plan to no plan whatsoever as well as some potent mental health struggles.</p><p>Fast forward a few years and I'm a software engineer at a big tech company, which seems to be a significantly better fit for me than being a barrister. It's a great time to be a programmer - it's well paid and relatively low stress, building things is rewarding, it suits me as someone who has a quantitative worldview combined with a decent chunk of social anxiety. Being in big tech also appears to give me a reasonably clear pathway towards career success, by building career capital I can later parlay into impact, founding a start up or similar.</p><p>In general it's hard to evaluate the counterfactual of dropping out/remaining at uni, however one of the posts Gavin linked mentioned shame around dropping out that strongly resonates with me. At various points in the last 6 years I have considered if I ought to try to find a way to get a degree, and often find myself thinking that had I actually acquired a degree from Cambridge, my career might be significantly more advanced than it is now. It's also worth noting that not having an undergrad can make it harder to immigrate, for example it is very difficult for me to get a H1-B visa for the US.</p><p>I also think Eli is completely correct that much of the value of university is in the people rather than the education. The sense of belonging I felt as part of a sports team at university was one I've been wholly unable to replicate since, despite various attempts to do so. I suspect the majority of the value of an Oxbridge or similar degree is in the networking opportunities, particularly in the long term.&nbsp;</p><h3>Advice to my 17 year old self</h3><ol><li>Think about what you want out of your life, even if it seems hard to imagine a life outside of school. Talk to people you find interesting, ask them difficult questions, try to imagine if being in their shoes would make you happy. Your parents want you to make the most stable possible option, which might not be the best.</li><li>Take a year out to work on your mental health. Your career will be long, and a year spent wisely will more than pay for itself. Do anything you can to make those around you see that this is valuable. This is potentially also good advice for my 27 year old self.</li><li>The opportunity to go to university is likely once-in-a-lifetime, and thus you should make sure that you go to the right one and study the right subject. I think I would've enjoyed, maths, economics and computer science <i>significantly</i> more than law.</li><li>Equally, it is not the be-all and end-all. If you're smart, curious and hard-working then you'll land on your feet. You have a big safety net so you shouldn't be scared of falling.</li></ol><h3>Takeaways</h3><ol><li>I think at least trying to do an undergrad is worth it, for the people more than the education.&nbsp;</li><li>Degrees are pretty clearly more valuable to some people than others, and this depends on how credentialist your field is and whether you have traits that would be sufficient to overcome your lack of degree when looking for opportunities.</li><li>Most 17 year olds I know and have known do not seem well equipped to deal with big decisions like this.</li></ol>", "parentCommentId": null, "user": {"username": "Jonny Spicer"}}, {"_id": "29CtF7HCBzFaJdX4z", "postedAt": "2022-09-21T19:16:27.491Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I agree that self study without a peer group is really problematic.</p><p>And yet so many people work from home alone.</p><p>This is surely solvable, and, I think, worth someone's attention in solving.</p>", "parentCommentId": "hjg8tMCGaMP3FkbsZ", "user": {"username": "hibukki"}}, {"_id": "YoiegNqMuCFRu9YPJ", "postedAt": "2022-09-22T06:09:53.740Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>This was amazing. As a professional dropout, I would like to join your organization so that I can immediately quit it.</p>\n<p>I have dropped out of college 3 1/2 times now, the 1/2 time was during Covid when I didn’t quite start the school year before dropping out and deciding to become a homeless vagabond.</p>\n<p>I always wanted to become an Ivy League dropout, USC isn’t Ivy League but close enough, it’s way more expensive than most Ivy League schools at least, and now I feel much more confident in whatever I do next. Lots of great entrepreneurs were dropouts from fancy pants schools. I think accomplishment is very closely correlated to dropping out,  so just imagine how promising I must be having dropped out such an  unusually high number of times.</p>\n<p>In all seriousness, I am extremely proud of having dropped out so many times. Each time it was the right decision, and I believe dropping out of things in general when there is a higher expected value option available shows a willingness to kick the sunk-cost fallacy in the pants and follow your dreams. Especially if those dreams include being a homeless Covid vagabond living in a tent in your friend’s backyard.</p>\n", "parentCommentId": null, "user": {"username": "Jordan Arel"}}, {"_id": "DEQuEB2zEejiW4Be2", "postedAt": "2022-09-22T14:40:04.889Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I wanted to write a long comment but decided I didn't have the energy. So here's the gist of it. I also apologise for the lack of humor.</p>\n<ol>\n<li>Dropping out is sometimes the right thing to do. Degrees are hard and may not fit every person at every particular time in their life. I do not mean this judgementally - sometimes the harms to yourself will outweigh the good, and it's good to have the support to quit. Taking a semester off is also an option (which I used).</li>\n</ol>\n<p>But...</p>\n<ol start=\"2\">\n<li>A university degree is neither for prestige nor for learning \"the basics\". The basics of any specific thing are what you'll learn in your first months on the job, and you don't need a degree for that. What a degree does is give you a <strong>much broader</strong> basis in some area. This should allow you, later in life, to pursue a wider variety of projects, to understand context, to have better judgement, and to be more versatile. In other words, a degree may not be a prerequisite for any specific job, but it gives you a much larger space of possibilities over the longer term.</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "R7eQL3GwX6vTrCg7H", "postedAt": "2022-09-23T02:49:56.931Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I would love to learn the art of dropping out from you.</p><p>(Just, if possible, could you give me a certificate when I finish learning from you?)</p><p>You're officially a member</p>", "parentCommentId": "YoiegNqMuCFRu9YPJ", "user": {"username": "hibukki"}}, {"_id": "HfqcGNZ9XDMBatpcs", "postedAt": "2022-09-23T13:00:01.760Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Cheers! I left community college before finishing my 2-year degree. Worked out great for me.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "uxtmCW4eDRZ2cPBgz", "postedAt": "2022-09-23T13:53:54.539Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Nice! Let me know if you'd like to be a co-author</p>", "parentCommentId": "HfqcGNZ9XDMBatpcs", "user": {"username": "hibukki"}}, {"_id": "YcWg6JPdGHDKcXeyy", "postedAt": "2022-09-23T13:54:11.068Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>(Let me know if you'd like to be a co-author!)</p>", "parentCommentId": "R7eQL3GwX6vTrCg7H", "user": {"username": "hibukki"}}, {"_id": "GGjdBjfBuCdLyukBJ", "postedAt": "2022-09-23T14:08:37.545Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<h3>Dropout Application</h3>\n<p>I dropped out of a BSc degree in Electrical &amp; Computer Engineering after 3 years.\nThis was a pivotal moment in my career, this move also pushed me into leaving Apple, and taking the tech lead role of a startup where I upskilled myself in more areas than I care to count.</p>\n<p>Knowing what I know today, I might have taken different paths and dropped out even earlier, but hindsight is 20/20.</p>\n<p>That being said, I do not have regrets over most of the courses I have taken, what I learned there is still beneficial in my professional life today.</p>\n<p>Now I'm offering my engineering skills to EA aligned orgs, and looking into AI Safety.</p>\n", "parentCommentId": null, "user": {"username": "Soof Golan"}}, {"_id": "wpssTZEn8yfw8dfSK", "postedAt": "2022-09-23T14:35:31.146Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Soof mentioned this post is running Q&amp;A on the EA Forum, checking how many co-authors a post can possibly have.</p><p>I reassured him that if there's a bug and some co-authors drop out, that will be in line with the org's values</p>", "parentCommentId": "GGjdBjfBuCdLyukBJ", "user": {"username": "hibukki"}}, {"_id": "tjwimr5u6m7aeKvpr", "postedAt": "2022-09-23T17:25:35.795Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>The reason I would not like to be a coauthor because the post fails to discuss global inequality / birth lotteries / visas. I think that fundamentally, the best reason to complete college is immigration paperwork, and I am not comfortable discussing my dropout life with people who don't have high-valued citizenship by birth.&nbsp;</p><p>I also have skin-in-the-game / standpoint epistemology reasons that I'd like to avoid much discussion of this with people who completed degrees. They don't know what it's like for a hiring manager at a large institution to say \"the team is crazy about you, but you're not allowed to access benefits, I just barely talked them into an hourly contract\", so I don't think they're well suited to this kind of writing.</p>", "parentCommentId": "uxtmCW4eDRZ2cPBgz", "user": {"username": "quinn"}}, {"_id": "uf6bufzFa6QTb3qv5", "postedAt": "2022-09-23T19:16:21.516Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Good pushback, which you may add to the post if you'd like</p>\n<p>For now, strong upvote</p>\n", "parentCommentId": "tjwimr5u6m7aeKvpr", "user": {"username": "hibukki"}}, {"_id": "jASkDJ76mPnHxctxS", "postedAt": "2022-09-27T22:50:18.314Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I just came across this non-EA org on Reddit, for non-college-grads with skillz. May be of interest to this crowd:  <a href=\"https://opportunityatwork.org/our-mission/\">https://opportunityatwork.org/our-mission/</a></p>\n", "parentCommentId": null, "user": {"username": "A_lark"}}, {"_id": "imzs67RLhujav2PJf", "postedAt": "2022-10-09T02:11:00.848Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>\"Don't let schooling interfere with your education.\" - Mark Twain</p>", "parentCommentId": null, "user": {"username": "Marc Wong"}}, {"_id": "s2Rvmivi8dKLFuk4v", "postedAt": "2023-04-28T02:02:31.135Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Sign me up too. <a href=\"https://forum.effectivealtruism.org/posts/ef4Cm7W5CjXibygCv/story-of-a-career-mental-health-failure\">https://forum.effectivealtruism.org/posts/ef4Cm7W5CjXibygCv/story-of-a-career-mental-health-failure</a></p>", "parentCommentId": null, "user": {"username": "zekesherman"}}, {"_id": "tH8EbELFKQkn8HSmY", "postedAt": "2023-04-30T16:50:11.533Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Hey! I don't think that \"signing up\" aligns with our values here at Effective Dropouts (<i>the values of Effective Altruism plus the inverse of the values of universities</i>), so I fast-tracked you to graduation (and co-founder) level, which I assume a university would never do, not that I'm such an expert in universities myself</p>", "parentCommentId": "s2Rvmivi8dKLFuk4v", "user": {"username": "hibukki"}}, {"_id": "CZc3aDcxdXhG2kSDz", "postedAt": "2023-04-30T21:33:29.506Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>I agree that any sense of shame about dropping out should be removed and that university may not be the best route for everyone. However, the post seems to mainly make the argument for dropping out for people who have a firm idea of what they want to do, and I don't think most early-stage university students would have much idea (or even if they believe they do, that their ideas would be a good).</p>\n<p>Similar to Guy Raveh, I think university may be most valuable for getting exposure to a broader set of ideas (though specialised courses like those that are common in the UK are less good for this). Also, for getting time to consider future directions that one may not have if working full time.</p>\n<p>PS As an academic, I may be biased - though I don't feel like I'm very inhibited from talking about the downsides of the academic route!</p>\n", "parentCommentId": null, "user": {"username": "Pagw"}}, {"_id": "9aSW4xthq5HqSoPBX", "postedAt": "2023-05-01T12:47:48.692Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Scottish degrees let you pick 3 very different subjects in first year and drop 1 or 2 in second year. This seems better to me than American forced generalism and English narrowness.</p>", "parentCommentId": "CZc3aDcxdXhG2kSDz", "user": {"username": "technicalities"}}, {"_id": "tFvs6oxrjEXpK6rcJ", "postedAt": "2023-05-01T19:34:26.790Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>Maybe one day a university will let students study any topic they want from the internet, that would be rad</p>", "parentCommentId": "9aSW4xthq5HqSoPBX", "user": {"username": "hibukki"}}, {"_id": "ojKDCcJCesCaDTHg7", "postedAt": "2023-05-01T19:45:11.637Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<blockquote><p>getting exposure to a broader set of ideas</p></blockquote><p>Effective Dropouts believes in viewing this as an \"exploration exploitation\" problem, and considering that there are many ways to approach the problem (where university is just one approach), and many things that the exploration-exploitation-tradeoff might be trying to optimize.&nbsp;</p><p>As a naive example (not from the official ED curriculum), if I'd suggest you read 100 random articles from Wikipedia, would that count as \"getting exposure to a broader set of ideas\"? If not, why not? (what's the thing you're implicitly trying to optimize for?) Would \"read the top 10 posts from [some blogs]\" count? Would \"do 3 months of work in various different jobs\" count? University might be the ideal way for some people to explore options, but I do think most people would benefit from considering at least one other option</p>", "parentCommentId": "CZc3aDcxdXhG2kSDz", "user": {"username": "hibukki"}}, {"_id": "muz9wpSAvkiLCyfbk", "postedAt": "2023-05-02T17:30:49.692Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": "<p>&nbsp;Fair questions to ask. I'd hope the quality of information obtained through uni courses is much better than random selection of reading material, as profs who have spent many years studying a subject should know which are the key texts to read, the most important facts to understand and the key arguments on each side of controversial issues. I think a random selection approach would generally yield information low in importance. (Perhaps articles from certain blogs wouldn't do too badly, but how would you know which blogs to choose and avoid getting sucked into ones that sound plausible but are terrible?) Edit to add: But doing some reading around the internet before deciding whether to embark on a course of further study could perhaps be a good thing to do.<br><br>I don't really see working in different jobs for a few months doing much to broaden thinking in the ways a uni education would - people I know in regular jobs seem to mostly be focussed on getting narrowly defined tasks done and not much on reflective thinking. Though it may be quite complementary as it could highlight things that an academic education wouldn't (George Orwell's writings of working in various jobs come to mind - but it seems rare for workers to take on this journalistic mindset). Edit to add: I also think workplaces will tend to have people with more correlated mindsets (e.g. work in an AI lab and most people around you will probably think developing AI is great), which isn't very good for developing an accurate worldview, whereas at a university I think you'd be more likely to be exposed to a greater variety of views. Though I don't have a measure for how well this works in practice (and I think people probably do cluster into groups with similar views to a fair extent). Of course, uni profs and students will tend to be correlated in thinking that uni is good ;-)<br><br>Of course that's not to say there aren't plenty of profs who focus on unimportant info, are poor at explaining, are biased etc. And as I said I think narrow uni courses are less good for getting a broader perspective. Honestly, I'm not sure how good an average uni education is by this measure (including at \"top\" unis). But finding a good one could be very valuable.<br><br>It would be interesting to have a way to test this, but I can't think of a good objective test of having broad knowledge.</p>", "parentCommentId": "ojKDCcJCesCaDTHg7", "user": {"username": "Pagw"}}, {"_id": "Xa4iwYmbangRAL9ti", "postedAt": "2022-09-21T19:17:29.187Z", "postId": "2jWLvBH8abzscDbPs", "htmlBody": null, "parentCommentId": "wsNaWLAY57mfHMjev", "user": null}]