[{"_id": "7XP5XsZSRrJ9J5hwN", "postedAt": "2023-03-08T18:06:54.320Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Strongly agree with the premise but not a fan of your writing style here. If you could define “smart” and “wise” better, and maybe rely less on personal anecdotes, I think this post might be more persuasive overall.</p>\n", "parentCommentId": null, "user": {"username": "Wil Perkins"}}, {"_id": "2RbnYRuinL4XzxMHA", "postedAt": "2023-03-08T18:16:37.476Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Would you agree with the statement:<br>\"EA made an attempt to attract as many students and young people as possible, and therefore neglected older groups. As a result, the movement to a huge extent:<br>a) has a too small proportion of emotionally mature people, which makes it more turbulent, and, as a result, less effective;<br>b) makes it not very attractive to mid-career and mature people, who - even if impressed by young prodigies, don't regard them as their thought partners (due to lack of life experience);<br>c) puts too much pressure on young people, as they are sometimes put into leadership positions which they are emotionally not ready for\"<br>.&nbsp;</p><p>For the record, I don't know if I agree with this statement. But I'm curious what do you guys think.</p>", "parentCommentId": null, "user": {"username": "Liv"}}, {"_id": "s9HERynhi6oPpH7fQ", "postedAt": "2023-03-08T18:17:53.787Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Yes, I also usually prefer texts with more pronounced structure. It's just a kind note, so maybe you can take it into consideration in the future :)&nbsp;</p>", "parentCommentId": "7XP5XsZSRrJ9J5hwN", "user": {"username": "Liv"}}, {"_id": "PddQcCjuTNFjjmWPv", "postedAt": "2023-03-08T18:34:04.739Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I propose, on the contrary, that we celebrate having more diverse writing styles on the forum, as one small way to facilitate more diversity in people who come into the movement and stay in it :)</p>\n", "parentCommentId": "7XP5XsZSRrJ9J5hwN", "user": {"username": "Guy Raveh"}}, {"_id": "GphBbRqj5bQSx233q", "postedAt": "2023-03-08T18:47:05.196Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>As a mid-career EA, I strongly agree with this.</p>", "parentCommentId": "2RbnYRuinL4XzxMHA", "user": {"username": "EmersonSpartz"}}, {"_id": "sJWScDa3BPeBHmhwb", "postedAt": "2023-03-08T19:44:56.351Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I agree with this, and want to share a concrete proposal that might help that I recently wrote a shortform about. Here's the content of the shortform:</p><p>\"On Socioeconomic Diversity:</p><p>I want to explain how the discourse on sexual misconduct may be reducing the specific type of socioeconomic diversity I am personally familiar with.&nbsp;</p><p>I’m a white female American who worked as an HVAC technician with co-workers mostly from racial minorities before going to college. Most of the sexual misconduct incidents discussed in the <a href=\"https://time.com/6252617/effective-altruism-sexual-harassment/\">Time article</a> have likely differed from standard workplace discussions in my former career only in that the higher status person expressed romantic/sexual attraction, making their statement much more vulnerable than the trash-talk I’m familiar with. In the places most of my workplace experience comes from, people of all genders and statuses make sexual jokes about coworkers of all genders and statuses not only in their field, but while on the clock. I had tremendous fun participating in these conversations. It didn’t feel sexist to me because I gave as good as I got. My experience generalizes well; Even when Donald Trump made a joke about sexual assault that many upper-class Americans believed disqualified him, immediately before the election he won,&nbsp;<a href=\"https://www.vox.com/2016/10/9/13217158/polls-donald-trump-assault-tape\"><u>Republican women</u></a> were no more likely to think he should drop out of the race than Republican voters in general. Donald Trump has been able to maintain much of his popularity despite denying the legitimacy of a legitimate election in part because he identified the gatekeeping elements of upper-class American norms as<a href=\"https://astralcodexten.substack.com/p/a-modest-proposal-for-republicans\"><u> classist</u></a>. I am strongly against Trump, but believe we should note that many female Americans from poorer backgrounds enjoy these conversations, and many more oppose the kind of punishments popular in upper class American communities. This means strongly disliking these conversations is not an intrinsic virtue, but a decision EA culture has made that is about more than simple morality.&nbsp;</p><p>When I post about EA on social media, many of my co-workers from my blue-collar days think it sounds really cool. If any of them decided to engage further and made clumsy comments while getting used to EA culture, I would want them to be treated with empathy. Much of the conversation around the&nbsp;Time article (especially the response to Owen Cotton-Barratt’s&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology\"><u>mistake</u></a>) has given me the impression that they would not be. We are a left-leaning movement. We need to include more conservative political perspectives to improve our data and get politicians to take our views on the worst catastrophes the world faces seriously. I feel my experience with much more poverty than the average EA has contributed unique insights that have improved our philosophical perspectives.&nbsp;<a href=\"https://opportunityinsights.org/wp-content/uploads/2018/04/mobility_trends.pdf\"><u>The probability</u></a> of an American raised in the poorest 20% (where my personal pre-college career experience comes from) reaching the richest 20% by age 26 is roughly a 3rd that of an American raised in the richest 20%. This likely means we miss out on some important professional talent by being intolerant towards lower class American norms. I am not advocating a switch to lower class American gender norms, just seeing the humanity more in the many people who have chosen them and therefore the people that accidentally violate upper-class American ones&nbsp; in good faith.\"</p>", "parentCommentId": null, "user": {"username": "SoniaAlbrecht"}}, {"_id": "3J47yfCavEw77a54L", "postedAt": "2023-03-08T20:11:31.665Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Having gotten into an EA leadership position in my late 40s last year these statements ring true. I’m very grateful to be able to work with young and smart people but I see the same risks and downsides I faced when running my first startup in my early twenties. I learned a lot when it failed and hope to be able to use this experience in building a more resilient EA organization.</p>\n", "parentCommentId": "2RbnYRuinL4XzxMHA", "user": {"username": "gruban"}}, {"_id": "bYSKRhvyhdxzdwvYH", "postedAt": "2023-03-08T20:29:16.269Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Yes Wil, I totally understand what you're saying, I write essays in my own style...writers spend years developing their own styles, so that's what it is...that's out of sync with the more intellectual/scientific style of EA, no intro here explaining epistemic confidence levels...but I prefer to just represent a different style...Guy, in the comment above seems to think this approach encourages more diversity in the movement, and I agree. Also if you read me more in the future, as promised in this post, I will write on the need for more Artists in EA and that is my community, and so writing in this more personal artistic essay style is I think part of what EA so desperately needs...process and goal in love and making out, planning their happy future together :)</p>", "parentCommentId": "7XP5XsZSRrJ9J5hwN", "user": {"username": "JeffreyK"}}, {"_id": "yuyLSCwfAGekKkAEd", "postedAt": "2023-03-08T20:48:22.279Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Hi Liv. &nbsp;I think there's a lot of truth in these statements, but I think there's another side balancing it that is kind of hard to avoid -- movements just start and grow, the grow from where they started, they attract people that were where they started -- same dynamic happened in my past movement which I mention...EA started with young academics on campuses, that's who populated it, it could have been much smaller and not controversial, but fate happened and big money came in and that's what put it on it's course toward all that's happening now...You kind of just can't help where you came from. &nbsp;So the question isn't how can I change where I came from, but now that I'm here in my current reality, what can I do going forward to improve things? I have no real criticisms of how EA has done things, I love it, think it's amazing, so grateful for it...I applaud the amazing young people who created it...but now with success it's found itself in a new kind of crazy place...so maybe it's time for some new energies within the group, I think diversity of all kinds and governance which empowers the new diversity is the path.&nbsp;<br><br>The problem with some criticisms is they imagine you could go back and change where you came from...the statements you gathered here that you're asking for comment on kind of have that feeling for me...but I think some of it is very true now in the current reality...and it would be good to change some things, but it wasn't planned or some huge mistake, it's just how things developed from where it started.</p>", "parentCommentId": "2RbnYRuinL4XzxMHA", "user": {"username": "JeffreyK"}}, {"_id": "hv7obaEqBgFTe6Fbu", "postedAt": "2023-03-08T20:53:18.770Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Yup. Not to mention that EA community is based also in the countries other than the US, which, I feel, is often forgotten about.</p>\n", "parentCommentId": "sJWScDa3BPeBHmhwb", "user": {"username": "Liv"}}, {"_id": "ZdrvXcGo92ZoXhu5b", "postedAt": "2023-03-08T21:08:43.417Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Yes! And a note on that: I've heard of some low and middle income country cultures with sex/dating norms similar to lower class American ones, and some with sex/dating norms even more reserved than upper class American ones. This means I have no idea what alterations would produce more socioeconomic diversity on net, and encourage people from other countries to speak up about their cultural norms.</p>", "parentCommentId": "hv7obaEqBgFTe6Fbu", "user": {"username": "SoniaAlbrecht"}}, {"_id": "kPeyvrCJgzjTX3mob", "postedAt": "2023-03-08T21:34:48.724Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Sorry, it will be not a very kind comment and a bit of a rant - upper American class on this forum keeps saying \"if you are in a position of power you should be very considerate of others and their boundaries, and give them space, because sometimes they may feel pressured to agree with you and find it hard to speak up\". Yeah, <i>exactly</i>.&nbsp;</p>", "parentCommentId": "ZdrvXcGo92ZoXhu5b", "user": {"username": "Liv"}}, {"_id": "G9Khyz3TjGxjwpeq9", "postedAt": "2023-03-08T23:06:04.999Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Hey man, I respect that. Clearly people like your post so keep it up, just my personal preference.</p>\n<p>Like I said I absolutely agree with your points here.</p>\n", "parentCommentId": "bYSKRhvyhdxzdwvYH", "user": {"username": "Wil Perkins"}}, {"_id": "TLckgkteaqgDAWrFR", "postedAt": "2023-03-08T23:27:43.070Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I’m actually a bit confused about what you mean. Can you elaborate? Also, are you criticizing me or other people?</p>\n", "parentCommentId": "kPeyvrCJgzjTX3mob", "user": {"username": "SoniaAlbrecht"}}, {"_id": "rBsxTbLYSPnpiokDe", "postedAt": "2023-03-08T23:53:16.660Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<blockquote>\n<p>I’ve been in a movement that changed the world in a positive way and eventually fell apart, it was very very similar to EA in many ways — a bunch of talented young people trying to do good in the world. We had all the same criticisms people throw at EA</p>\n</blockquote>\n<p>I'm really curious, what movement was it?</p>\n", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "ynKKdPFopcmA672Fj", "postedAt": "2023-03-09T00:33:15.713Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Not American, but I'm from Hong Kong and the higher acceptability of \"saying things in a blunt way\" in the socioeconomic circles I grew up in rings true to me. A caveat that traditional Chinese culture makes it more uncommon for discussions to center around <i>sexual things.</i> That said, it seems that <i>if sexual things do come up</i>, people aren't super averse to it in the way that people in elite Western circles are. (Except in and around church. I grew up Protestant.)</p><p>The main (economic) factor might be that my parents and relatives all grew up poor (a common background for many people in HK) and that I have a sort-of-working class background (parents still broke but relatives became better off - got a great education with help from relatives but lived relatively worse off with my parents -it's complicated). My sense is that my priorities are very different from Western EAs with more money, or actually, even other people in my home city with more money.</p><p>I'm guessing that for the generation before me, growing up in a small flat with 6 other siblings, it just doesn't really matter if someone's kind of \"vulgar\" or speaks kind of bluntly. And if people deliberately offend you with a comment, sure enough, you might get angry at that person - but it's unlikely that you'll find what they said <i>paralyzing</i>.</p><p>I myself grew up in better conditions, but maybe the cultural memory of severe material hardship persists, at least for a while. I didn't really care that much when friends from school used explicit language. <i>Because it frequently happened on a daily basis.</i> &nbsp;Some of my (~middle class) friends and I often said \"offensive things\" to each other in the past for fun, and sometimes I kind of miss the opportunity to do that (sometimes not though) since now my social circles mostly consist of people from the upper/upper middle classes.</p>", "parentCommentId": "sJWScDa3BPeBHmhwb", "user": {"username": "Timothy Chan"}}, {"_id": "k4KzEjbMhijLbw8r5", "postedAt": "2023-03-09T04:16:46.576Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Hi Robi. Yes it was a movement of young religious leaders who wanted to move forward and try new things and be less restrictive called The Emerging Church Movement...it was pretty big and had a profound effect on religion in the USA, moving many toward more freedoms. In the past USA Christians weren't as connected to the conservative Republican party, but in the 80's the two came together and won elections and it created a new thing, by the 90's a huge section of the church realized how they'd been co-opted into supporting a conservative agenda and we basically rose up and revolted...it was also a revolt internally against controls on how services are done and seeking a freedom there to do new more creative things...it's possible to say we had an impact on getting Obama in and legalizing gay marriage, but then sadly it created a huge backlash both in religion and in society, more traditional people were scared by it...I'm not saying we were the only thing of course causing all this but we were right in there. The institutional backlash was brutal many of us lost our jobs or were even excommunicated, but tons of great new things were created that are still going today. &nbsp;I was the leader of the team organizing local gatherings nationally, kind of like CEA in EA. So it was quite a ride.&nbsp;<br><br>&nbsp;I'm no longer religious and so it's sometimes a little awkward to bring it up, but thanks for asking...I do believe EA could learn a lot from what we experienced. In the end because of a lack of diversity, that we tried so hard to fix, but it just wasn't fixable, we literally dissolved ourselves and invited in a whole new completely diverse collection of people to take over...they met and began with a lot of hope, but they just didn't coalesce and it fizzled out. It turns out that we had painstakingly built something over time, and you can't just replace it magically, so we gambled to become more diverse but it killed the movement. It was very painful but we did it for the right reasons. How often do you see white male leaders step aside and give their roles to women and people of color? It rarely happens, and almost never en masse as we did. So I'm proud of that, even though sad it ended. &nbsp;<br><br>Also I'm in no way bitter against religion, I love religion and I'm now a Universalist who appreciates all religion, as well as no religion. I like to say I'm a theist M, W &amp; F and an atheist T, Th &amp; Sat and neutral on Sunday. &nbsp;Somedays I feel faith, other days it seems impossible. &nbsp;There are others like me, this is a possible way to live...I don't suggest it to others, but for me it allows me to be in solidarity with all humans and to not exclude any while being faithful to my own belief and non-belief. &nbsp;In the altruistic world it gives a great ability to understand and connect with people of faith, and since charities must contend with local faith communities and their leaders that is a really facilitating thing.&nbsp;</p>", "parentCommentId": "rBsxTbLYSPnpiokDe", "user": {"username": "JeffreyK"}}, {"_id": "6o4bqoWma2ckWDqsH", "postedAt": "2023-03-09T04:26:11.475Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Liv - I agree. I've complained about EA's ageism a few times on EA Forum -- an ageism that seems fairly common, but that is also perhaps only mild to moderate in its strength.</p><p>There seems to be a lot more EA effort invested in recruiting young people into EA (e.g. through 80k Hours) than to recruiting mid-career and late-career professionals who could offer a little wisdom, perspective, life experience, mentorship, professional contacts, etc.&nbsp;</p><p>I've sometimes seen this pro-youth bias justified in terms of expected future decades of useful contributions, e.g. 'If we recruit a 20-year-old into EA, they can contribute for at least 50 years (assuming retirement at 70), whereas a 60-year-old might only contribute for another 10 years, so the 20-year-old has 5x the ROI on recruitment effort.'&nbsp;</p><p>That might be a misleading calculation, insofar as a 20-year-old might get enthused about EA for a couple of years, but then drift off into other passions; whereas a 60-year-old who pivots into EA late in their career, despite the barriers to entry and the professional disincentives to do so, might be more likely to stick around.&nbsp;</p><p>And the 60-year-old might have a lot more to offer right from the start, in terms of professional expertise, connections, money, leadership experience, etc.</p><p>(Epistemic status: I'm 57, so I'm probably biased about this issue. On the other hand, young people are generally pretty oblivious to their ageism, so they might not recognize it when it's being expressed.).</p>", "parentCommentId": "2RbnYRuinL4XzxMHA", "user": {"username": "geoffreymiller"}}, {"_id": "qdhS9T6WBYhyC4iBy", "postedAt": "2023-03-09T04:31:17.256Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Sonia -- excellent points. Strongly agree.&nbsp;</p><p>EA needs to be genuinely inclusive not just in terms of sex, race, nationality, etc., but in terms of social class and political values. And many of the recent discussions in EA Forum community posts might look quite odd and alienating to people who have experienced and enjoyed the kind of blunt, unpretentious, thick-skinned, working class culture that you mentioned.&nbsp;</p>", "parentCommentId": "sJWScDa3BPeBHmhwb", "user": {"username": "geoffreymiller"}}, {"_id": "8zbRZD2npJXD7Pyeo", "postedAt": "2023-03-09T04:32:12.804Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I finally signed up for the forum just to upvote this contribution, I appreciate it so much.</p>\n", "parentCommentId": "sJWScDa3BPeBHmhwb", "user": {"username": "starparts"}}, {"_id": "yMAGwQsfZc4iQEEna", "postedAt": "2023-03-09T07:37:06.404Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Other people. I feel that certain perspectives on the forum are expressed very strongly, and with little consideration towards other points of view. One of them is \"if you are in a position of power you should be considerate  towards those who are not as they may feel pressured by you\" which I agree with. But  the same person sometimes also very strongly expresses some other view, regarding, i.e. dating, full of \"shoulds\" and often strongly rooted in  the US norms and culture (in my perspective). I simply find it ironic.</p>\n", "parentCommentId": "TLckgkteaqgDAWrFR", "user": {"username": "Liv"}}, {"_id": "DYGNg8KrhAwBdKzv8", "postedAt": "2023-03-09T14:49:18.926Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>+1 to Geoffrey here.</p>\n<p>I still think of EA as a youth movement, though this label is gradually fading as the \"founding cohort\" matures.</p>\n<p>It a trope that the youth are sometimes too quick to dismiss the wiser counsel of their elders.</p>\n<p>I've witnessed many cases where, to my mind, people were (admirably) looking for good explicit arguments that they can easily understand, but (regrettably) forgetting that things like <a href=\"https://www.lesswrong.com/tag/inferential-distance\">inferential distance</a> sometimes make it hard to understand the views of people who are wiser or more expert than you are.</p>\n<p>I'm sure I've made this mistake too. That said: my intellectual style is fairly slow and conservative compared to many of my peers, and I'm often happy to trust inarticulate holistic judgements over apparently solid explicit arguments. These traits insulate somewhat me from this youthful failure mode, though they expose me to similarly grave errors in other directions :/</p>\n", "parentCommentId": "6o4bqoWma2ckWDqsH", "user": {"username": "Peter_Hartree"}}, {"_id": "Eooqfo8rGrqv946su", "postedAt": "2023-03-09T17:00:04.196Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Peter -- nice point about inferential distance. This can lead to misunderstandings from both directions:</p><p>Youth can hear elders make an argument that sounds overly opaque, technical, and unfamiliar to them, given the big inferential distance involved (although it would sound utterly clear &amp; persuasive to the elder's professional colleagues), and dismiss it as incoherent.</p><p>Elders can see youth ignoring their arguments (which seem utterly clear &amp; persuasive to them), get exasperated that they've invested decades learning about something only to be dismissed by people who don't know nearly as much, and who can't be bothered to do the work to overcome the inferential distance, and then the elders go into 'trust my authority' mode, which sounds domineering &amp; irrational to the youth.</p><p>It's worth being careful about both of these failure modes (which I've been guilty of, plenty of times, from both sides, at different ages).</p>", "parentCommentId": "DYGNg8KrhAwBdKzv8", "user": {"username": "geoffreymiller"}}, {"_id": "9QAkraXn6Lqzp6Dbu", "postedAt": "2023-03-09T19:07:22.639Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Do you think the EA community comparative \"smartness\" is real, or is it an example of the <a href=\"https://en.wikipedia.org/wiki/Lake_Wobegon\">Lake Wobegon Effect</a> compared to other youthful social-do-gooder movements?</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "r9kg8BAHuq9oPd32G", "postedAt": "2023-03-09T20:14:02.625Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>To Peter and Geoffrey, I agree but I don't think the dynamics of old and young working together are really an issue <u>until</u> you have young and old working together! &nbsp;<br><br>I don't think there's been a problematic effort to avoid hiring the more experienced, I just think a youthful movement will naturally do as EA has done...but when it reaches a crossroads as it has now, then it's time for some new thinking. &nbsp;As a practical consideration, some &nbsp;organizations might not be able to afford hiring more senior people, but EA surely can.&nbsp;</p>", "parentCommentId": "Eooqfo8rGrqv946su", "user": {"username": "JeffreyK"}}, {"_id": "z9hA7nbDBhkoSNoGe", "postedAt": "2023-03-10T00:13:02.027Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>As stated on the other post: &nbsp;<br>\"As someone from a poor family, I find the implicature of this piece, that I cannot control myself from harassing and bullying people, ridiculously offensive to the point of absurdity. The fact it hasn't got more pushback is the perfect example of \"Tell me you live in a bubble without telling me you live in a bubble.\" I did have a good chuckle at the idea of Owen trying this anywhere near my very blue-collar father though so thanks for that. \"</p>", "parentCommentId": "sJWScDa3BPeBHmhwb", "user": {"username": "GoodEAGoneBad"}}, {"_id": "WtTe4Ekzg295RqEgL", "postedAt": "2023-03-10T01:22:32.212Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Yes, poor people are not a monolith! Some people from our background (especially the people who chose to stick around EA long enough to be on the forum) will prefer current EA norms and feel grateful for them. I don't mean to dismiss your experiences at all. And like I said earlier, there are many different socioeconomic cultures that are underrepresented in EA, so I don't know what direction we should shift our norms in overall. Maybe there is that much diversity even within the US. I was speaking about my personal experience as someone from this background and the experiences of all the people I know well enough to know their perspectives from this background. I'm sorry I gave &nbsp;the impression I was trying to speak for you. I also wasn't accusing us at all of having lack of control, &nbsp;just having the right to prefer different norms if we want to. Thanks so much for sharing your perspective! I do wish you had done so more politely though.</p><p>I'm curious: Do you feel like your wider lower class culture was very different from mine, or is it more that your family held different views that were a minority? Also, where were you raised and what role did religion play? My experience comes from Sacramento, California and religion was rarely discussed. I hope you don't mind me asking these questions; There are so few of us around that EA needs all the data on us it can get!</p>", "parentCommentId": "z9hA7nbDBhkoSNoGe", "user": {"username": "SoniaAlbrecht"}}, {"_id": "vhAS7L8r4DRvWnXmh", "postedAt": "2023-03-10T02:37:39.279Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I really think we are speaking past one another. Back to brass tacks:<br>1. I do not see Owen's behavior as being okay in any context.&nbsp;<br>2. I understand and know well the banter culture you are referring to but what he did is way outside the pale and classifying it as banter is muddying the waters and clouding how serious his behavior actually was.&nbsp;<br>3. I resent the presentation of taking a strong stance against harassment and verbal abuse as a detriment to socioeconomic diversity.&nbsp;<br>4. \"So I don't know what direction we should shift our norms in overall.\" I reject the norm framing but it seems pretty obvious to me that there can be no place for harassment in EA and if you think my message was impolite and you wish I had been kinder it seems you have that preference too.&nbsp;</p>", "parentCommentId": "WtTe4Ekzg295RqEgL", "user": {"username": "GoodEAGoneBad"}}, {"_id": "dz8QvFZ8kbaSafgCC", "postedAt": "2023-03-10T02:49:47.572Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I agree that Owen's behavior was not ok in any context. I agree he should be punished for it. I am only disagreeing with the extent of the punishment demanded in the comments on that post and similar comments regarding some other incidents in the Time article.&nbsp;</p>", "parentCommentId": "vhAS7L8r4DRvWnXmh", "user": {"username": "SoniaAlbrecht"}}, {"_id": "sx7JrKSjPELvm8iDh", "postedAt": "2023-03-10T03:13:02.471Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p><i>\"If any of them decided to engage further and made clumsy comments while getting used to EA culture, I would want them to be treated with empathy. Much of the conversation around the&nbsp;Time article (especially the response to Owen Cotton-Barratt’s&nbsp;</i><a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology\"><i><u>mistake</u></i></a><i>) has given me the impression that they would not be.\"</i>&nbsp;<br><br>1. That does not give the impression of thinking his behavior was serious (you reference clumsy comments and refer to his behavior as a \"mistake\") and when you combine it with referencing banter culture it comes across like you are saying he was just bantering which he clearly was not. &nbsp; &nbsp;<br>2. &nbsp;I haven't expressed an opinion on punishment here.&nbsp; My core issue here is that I object to painting a strong stance on harassment as detrimental to socio-economic diversity and the implicature that carries with it.</p>", "parentCommentId": "dz8QvFZ8kbaSafgCC", "user": {"username": "GoodEAGoneBad"}}, {"_id": "J3roZWF7mq89Mtw3B", "postedAt": "2023-03-10T03:22:57.830Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I'm sorry my comment gave the wrong impression!&nbsp;</p><p>I did find your comments on that post and believe we have very different perspectives on how serious the punishment should be. I thought the likelihood of &nbsp;someone familiar with lower class banter culture having such different opinions from me about the punishment was low, so I really appreciate you speaking up!</p>", "parentCommentId": "sx7JrKSjPELvm8iDh", "user": {"username": "SoniaAlbrecht"}}, {"_id": "yo8N6Y8prDBMuunfu", "postedAt": "2023-03-10T03:37:14.059Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p><i>\"It didn't occur to me that someone familiar with lower-class banter culture would have such different opinions from me about the punishment, so I appreciate you speaking up!\"&nbsp;</i><br>1. It's not banter, it's sexual harassment. We know banter, it's playful and consensual. It's not this.&nbsp;<br>2. Being poor made me vulnerable, I don't want anyone to go through what I did, and to the extent I have jurisdiction, I'm staking my flag and dying on the hill that people who harass get kicked out. &nbsp;<br>We disagree and I'm pretty crabby about your post but I appreciate your stated openness to engaging with me on this issue. &nbsp;</p>", "parentCommentId": "J3roZWF7mq89Mtw3B", "user": {"username": "GoodEAGoneBad"}}, {"_id": "qyfwoMrsT7XD57cEp", "postedAt": "2023-03-10T03:49:56.377Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I'm actually &nbsp;more open than I appear, and feel bad about not engaging more with you about the details. I want to, but going through all that again like we did in the comments on Owen's post would be too distracting from school for me right now.</p>", "parentCommentId": "yo8N6Y8prDBMuunfu", "user": {"username": "SoniaAlbrecht"}}, {"_id": "ktNynQDMKu78CgC6K", "postedAt": "2023-03-10T04:02:46.697Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>Please don't feel bad. Good luck with school :) &nbsp;</p>", "parentCommentId": "qyfwoMrsT7XD57cEp", "user": {"username": "GoodEAGoneBad"}}, {"_id": "q3EfbC4uubjisEmmS", "postedAt": "2023-03-11T02:39:08.836Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I would say it's very real because the whole movement is predicated on scientific process and philosophical thinking coming into altruism to make it more effective, &nbsp;with a strong founding culture from one of the premier academic cultures on the plantet - Oxford...so it draws people who can discuss things in intellectual language, and I don't think more average people are attracted to that kind of community. I would love to see that changed somewhat. For sure someone like Will MacAskill does a great job of communicating more to the common person in his books and talks, which I love. I would like to see much more of that. In the meantime in no way am I wanting to dumb down anything, but it's just we need both...for more altruism to happen, for more energy from more people to come into longtermism and AI safety, we need more and more people. To get more and more people I think we need more spaces with welcoming levels of language, and I think we need way more art...films, videos, graphics, stories...there's a great saying I often share when surveying past positive revolutions in our human history...\"Every revolution has it's music\". And it's true, the people sing heartily the famous songs of their movements-that is art bringing people together, coralling their emotional movement together forward.&nbsp;<br><br>EA has not yet found it's music.&nbsp;</p>", "parentCommentId": "9QAkraXn6Lqzp6Dbu", "user": {"username": "JeffreyK"}}, {"_id": "yCEa2uYmM4jqENKNh", "postedAt": "2023-03-12T22:49:14.711Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I think the essence of EA's smartness comes down to our ability to change our minds when presented with good information that challenges our worldview. I've been part of all sorts of communities, including many other youthful social-do-gooder movements, and never seen anything like it. People's models of the world are usually wrong in important ways, so I think this is probably the most important form of intelligence. So yes, I agree with Jeffrey Kursonis that we are probably typically smarter than average in the ways most applicable to what we work on.</p>", "parentCommentId": "9QAkraXn6Lqzp6Dbu", "user": {"username": "SoniaAlbrecht"}}, {"_id": "ZEsXyYYE6SAL7HGSu", "postedAt": "2023-03-15T05:49:32.724Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I love this aspect of EA and rationalists. There's a humility and a passion for finding the best most effective way. I sure hope the lessons of recent times will be strong enough to produce the needed changes, and this is one specific aspect I see the need for - more average people, more experienced elders and more artists...if we had the smartest people available, and we made all these big mistakes, maybe just having the smartest people is not the best mix.&nbsp;</p>", "parentCommentId": "yCEa2uYmM4jqENKNh", "user": {"username": "JeffreyK"}}, {"_id": "k5Qk3EJrzGdmiwbpK", "postedAt": "2023-12-05T22:39:27.644Z", "postId": "2JXLxKbSsbicnt9N9", "htmlBody": "<p>I've been thinking about your perspective lately, and wondered if there is a variable I hadn't considered enough. I was raised middle class American and my dad was raised upper middle class American. For this post, I drew on my decade of experience as a lower class American after a disability left me unable to earn a good living for a long time. My field was heavily male dominated (construction). Since in my experience lower class American norms seem more gendered to me, I would expect the experience of someone who hasn't worked in a male-dominated lower class American field to be pretty different from mine. My friends were ones I made from work, so they already considered me one of the guys. Do you think your experience was different from mine because you didn't work in a male-dominated field?&nbsp;</p><p>I also suspect I gave off a one-of-the-guys vibe (because that's the environment I prefer) that you don't that altered how people treated me. I found this Slate Star Codex post helpful in thinking about this: https://slatestarcodex.com/2017/10/02/different-worlds/</p>", "parentCommentId": "z9hA7nbDBhkoSNoGe", "user": {"username": "SoniaAlbrecht"}}]