[{"_id": "oK4FBn8RsgoEKBgTz", "postedAt": "2022-09-10T16:35:24.743Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>What does PB/CM mean?</p>", "parentCommentId": null, "user": {"username": "Evie Cottrell"}}, {"_id": "kPSPbu78DoDu4jDjk", "postedAt": "2022-09-10T16:39:35.075Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Argh! I shouldn't assume people would understand insider terminology. It means \"plant-based/cultivated meat\". I changed the title.</p>", "parentCommentId": "oK4FBn8RsgoEKBgTz", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "yEqwNR48pYbWpjipa", "postedAt": "2022-09-10T17:03:05.925Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Where have you been all my life? We are thinking similarly, and I’m glad you are raising these topics and added nuance/wisdom/data to them. I wrote a related piece for Fast Company a while back: <a href=\"https://www.fastcompany.com/90599561/once-we-have-lab-grown-meat-will-we-still-need-animal-advocacy\">https://www.fastcompany.com/90599561/once-we-have-lab-grown-meat-will-we-still-need-animal-advocacy</a>.</p>\n", "parentCommentId": null, "user": {"username": "BrianK"}}, {"_id": "JGSkR8eLpvyLocfz2", "postedAt": "2022-09-10T17:33:06.484Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Wow! This is amazing to know! I am glad that you also thought and wrote about the topic. I think this kind of deep self-evaluation should happen more! People should also read your article! Our arguments and conclusions are slightly different so it's worth reading both. (I could have not written this post if I have seen yours)</p>", "parentCommentId": "yEqwNR48pYbWpjipa", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "JNnHBsDKzB7eHuueF", "postedAt": "2022-09-10T20:09:15.288Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I wouldn't be too sure about the direction of the conclusion. In particular, premature banning, rather than phasing out seems like it would increase the probability of successful pushback and more organized opposition.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "59KsbsQgPAmbZHYrE", "postedAt": "2022-09-10T21:08:31.793Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks for writing this up! It's great to see more people think about the relationship between <a href=\"https://centerforreducingsuffering.org/longtermism-and-animal-advocacy/\">animal advocacy and longtermism</a>.&nbsp;</p><p>It seems important to distinguish between a) the abolition of factory farming and b) a long-term change in human attitudes towards animals (i.e. establishing antispeciesism). b) is arguably more important from a long-term perspective, and it is a legitimate concern cultivated meat (and similar technologies) would only achieve a).&nbsp;</p><p>However, proponents of the \"technology-based strategy\" usually argue that a) also indirectly helps achieve b), as it allows people to endorse animal rights without cognitive dissonance. I am not entirely sure about this, but it's at least a plausible counterconsideration.</p><p>Even without this effect, I don't really understand why you seem to think that abolishing factory farming through non-moral means would cause lock-in. Why can't attitude change / moral progress still happen later?</p>", "parentCommentId": null, "user": {"username": "Tobias_Baumann"}}, {"_id": "rR6TJF3hGiSvmGcbM", "postedAt": "2022-09-10T21:19:08.813Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Seems like a possible s-risk factor, too, by contributing to polarization and conflict.</p>\n", "parentCommentId": "JNnHBsDKzB7eHuueF", "user": {"username": "MichaelStJules"}}, {"_id": "3weWGWEjRyrwKmroq", "postedAt": "2022-09-10T22:02:40.779Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>\"Why can't attitude change / moral progress still happen later?\" E.g. when we're advocating for concern for wild animal suffering?</p>\n", "parentCommentId": "59KsbsQgPAmbZHYrE", "user": {"username": "Holly"}}, {"_id": "q3tetrGq6g8meHSpe", "postedAt": "2022-09-10T22:08:49.671Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks for writing! I'm skeptical that a non-morally-motivated ban would create bad value lock-in.  Most of this post's arguments for that premise seem to be just the author's speculative intuitions, given with no evidence or argument (e.g. \" I also worry that using laws to capture our abolition of moral catastrophes after they become economically inviable, can create a false sense of progress [...] Always waiting for technological changes might mislead us to think that we have less obligation to improve our moral values or actions when the technological/economic incentives are lower.\") But I don't think ungrounded intuitions about how society might work are good ways to make predictions; there's too many complications and alternatives that approach might miss.</p>\n<ul>\n<li>As a reason why this kind of argument isn't reliable, we could just as easily come up with intuitive stories that point to the opposite conclusion, e.g. \"economic changes that drive moral progress will inspire and inform future advocates to take pragmatic approaches that actually work well rather than engaging in endless but ineffective moral grandstanding; always waiting for moral progress might mislead us to think we have less obligation to improve economic incentives when the tractability of moral advocacy is lower.\"</li>\n<li>Also, I think the historical importance of economic and military motives for the abolition of slavery <a href=\"https://forum.effectivealtruism.org/posts/o4HX48yMGjCrcRqwC/what-helped-the-voiceless-historical-case-studies\">are understated</a>.</li>\n</ul>\n<p><em>(Edited within a few mins to delete a weaker argument.)</em></p>\n", "parentCommentId": null, "user": {"username": "Mauricio"}}, {"_id": "WcBy9cgYz8tFsNedP", "postedAt": "2022-09-10T22:31:13.103Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks for writing this up! I disagree for a few reasons:</p><ul><li>This feels more like a problem at the point between “alternative proteins have scaled up and we’ve replaced a bunch of meat” and “this results in a meat ban.” It seems possible to me that moral advocacy efforts can happen after alternative proteins have scaled up, but before there are laws to stop factory farming for food entirely. I don’t think alternative proteins replacing, say, 80% of meat will result in people thinking non-meat uses of animals is morally okay in a lock-in kind of way.&nbsp;</li><li>I think a lot of people’s moral reasoning about animals is posthoc/based on cognitive dissonance. That is, people like eating meat, or it’s a valuable part of their culture, and their moral intuitions around animal exploitation are built around that. So it seems plausible to me that moral advocacy efforts become substantially more effective if we’re able to quickly replace one of the biggest uses of animals.&nbsp;</li><li>I’m not sure I’m compelled by the mechanism for lock-in. One mechanism appears to be overconfidence/complacency as a society, which reduces the drive toward moral progress. This seems somewhat plausible, but it feels like this is possible to solve (for instance, animal advocacy organizations pivot toward other uses of animals, and are more able to dedicate resources focused on animal advocacy). Another mechanism seems to be that “letting automobiles replace horses as practical transport instead of listening to the horse advocates and becoming better humans, humanity has lost a great opportunity to do something for the animals for moral reasons, and do so by accepting an economic loss.” But I guess I’m not sure why – in either the horse case or the factory farming case – this is a unique opportunity. I don’t think the existence of factory farming necessarily strengthens the argument, to an average person, about the urgency of animal advocacy, because if people don’t buy the moral reasoning for caring about animals, I’m not sure the scale of suffering that exists currently affects whether they buy the moral reasoning. So in the case of horses, for example, I don’t think it was easier to convince people that horses matter before they were replaced as practical transport.&nbsp;</li><li>I feel like this is just intractable. Meat has the advantage of being embedded in culture and identity for generations. Without proposing <i>any </i>alternative, and going entirely through the moral route, means going up against this generational idea that eating meat is okay. Success seems hard. I’m wary of taking such a risk, when there’s also the possibility of factory farming for food persisting into the future (and I’d guess, in business-as-usual scenarios, it remains a bigger problem than other kinds of factory farming). I will also say I’m not convinced that expanding our moral circle to animals helps expand our moral circle to things like digital minds in the far future, though that’s a conversation for another day.&nbsp;</li><li>I’m uncomfortable about this argument for nonconsequentialist reasons. If factory farming is a grave injustice that ought be abolished (even if you’re a consequentialist who buys moral uncertainty), it seems like letting it stay for much longer and taking a huge risk that it stays forever because you want to do it for the right reasons could be a massive negligent injustice in itself. It feels like, in a moral way, saying “it’s bad to hire more beat cops to deter crime, because deterring crime through fear doesn’t convince anyone that their crime is wrong.” One reason a lot of people would find that intuitively bad is because it feels like it’s instrumentalizing the victims of crime for a dubious future consequence.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Tejas Subramaniam"}}, {"_id": "DyShJrTYjzRPmaHGd", "postedAt": "2022-09-10T22:34:34.041Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Hi Fai, I agree with whoever encouraged you to post more. &nbsp;I always enjoy and appreciate your stuff even when we don't 100% agree.&nbsp;</p><p>The below sentence is difficult to parse, what do you actually mean? &nbsp;That it <i>was</i> economic reasons, or that it <i>was not</i> economic reasons, or something else entirely?</p><p>&gt;Well, I personally did not have much hope in humanity's moral progress, until I recently got moderately convinced that it’s less likely than not that we abolished slavery mainly for economic reasons. And in case you think that it is impossible to have moral progress without economic reasons. I tend to disagree, and Will Macaskill also. He wrote in What We Owe The Future that the view that it was economic incentives caused by new technologies that cause slavery to be abolished, is now out of fashion in academia. He thinks that it was pretty much the triumph of the abolitionists. So there's a reason to think that moral progress is a genuine alternative to technologically forced social progress.</p><p>Cheers</p>", "parentCommentId": null, "user": {"username": "Tyner"}}, {"_id": "oZh4LHPuhCAdkpkTP", "postedAt": "2022-09-10T22:48:39.382Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Upvoting this interesting post, but strongly disagree that it's positive-EV to hold off on eliminating factory farming. There's a chance that holding off could result in larger long-term gains for sentient-being-welfare by forcing us to more explicitly codify moral reasons for getting rid of factory farming. But I think this is almost certainly outweighed by the much lower chance of actually getting it abolished for moral reasons alone.</p><p>Also, re: how future generations are likely to view factory farming elimination - I think the strong tendency is for most humans to ascribe a moral dimension to historical events that actually had more complex economic/political/geographic causes.</p>", "parentCommentId": null, "user": {"username": "TerracottaKleinBottle"}}, {"_id": "X3xuG2gTt5zKAM7Aq", "postedAt": "2022-09-11T05:15:19.424Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks a lot for writing this up! This post contains many good thoughts; for example, I was intrigued by the thought that how we treat animals today might matter to how AI treats us in the future.</p>\n<p>This post reminded me strongly of <a href=\"https://veganstrategist.org/veganworld/\">\"How to create a vegan world\"</a> by Tobias Leenaert. In that book, Tobias argues that all progress toward veganism matters, be it people who reduce their meat consumption, the availability of good meat alternatives, moral progress, etc. Tobias compares the road to a vegan world with a long, stony, uphill path to a mountaintop. He says that it's hard to get to the top directly or using just one motivation (e.g., an exclusively moral motivation). Instead, we need every small step on the way and all sources of support that we can get.</p>\n<p>One reason that Tobias provides is that motivation often follows action<sup class=\"footnote-ref\"><a href=\"#fn-hH3KqXLkanvEjkCjh-1\" id=\"fnref-hH3KqXLkanvEjkCjh-1\">[1]</a></sup>. It's a lot easier to think kindly of animals <em>after</em> you treat them kindly. I believe that this has been true for me personally -- I feel more morally responsible toward animals (and more critical of the other forms of exploitation that you mention in the post) after having changed my diet, even though that change was partially motivated by ecological reasons.</p>\n<p>\"How to create a vegan world\" changed my thinking toward a more consequentialist approach. I'm putting more emphasis on the direct consequences that an action has on animals, and less on the motivation behind this action. In fact, the book made me a bit wary of people who think that moral reasons are the <em>only valid way</em> of helping animals.</p>\n<p>Overall, I think that the intuitions expressed in this post, if true, should cause us to rethink our approach to meat alternatives. However, I'm currently leaning to think that meat alternatives support rather than hinder the moral case for stopping animal exploitation.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-hH3KqXLkanvEjkCjh-1\" class=\"footnote-item\"><p>The book backs this claim with several sources; I just don't have the book at hand at the moment and have to write this from memory. <a href=\"#fnref-hH3KqXLkanvEjkCjh-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": null, "user": {"username": "Sjlver"}}, {"_id": "7WHNY8SZFREHibdwe", "postedAt": "2022-09-11T07:16:29.704Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thank you, Tobias, for your comment!</p><blockquote><p>It seems important to distinguish between a) the abolition of factory farming and b) a long-term change in human attitudes towards animals (i.e. establishing antispeciesism).</p></blockquote><p>I agree. I think all too often when longtermists hear about animals and longtermism, they reject the idea by pointing to their speculation that factory farming will soon be eliminated, while forgetting other animals, or speciesism at large.</p><blockquote><p>b) is arguably more important from a long-term perspective, and it is a legitimate concern cultivated meat (and similar technologies) would only achieve a).&nbsp;</p></blockquote><p>I agree, and if I understand you correctly that's part of my point. In the post, I wrote about other types of factory farming that are not for the purpose of food. So I think we might be making a similar point here.</p><blockquote><p>I don't really understand why you seem to think that abolishing factory farming through non-moral means would cause lock-in.&nbsp;</p></blockquote><p>The lock-in I am pointing at is missing the opportunity to eliminate FFFF for moral reasons. In other words, we cancelled our option to do it for moral reasons. My arguments about why this lock-in is bad can easily be wrong, but I think this being a lock-in seems uncontroversial.</p><blockquote><p>Why can't attitude change / moral progress still happen later?</p></blockquote><p>It can, my worries are that:</p><ul><li>It might not happen in the same probability (i.e. advocates might be relieved to have solved a problem and moved onto other problems)</li><li>It might not happen with the same quality (very speculative here, just my intuitive worry that changes due to economic pressure just won't produce the same social changes.)</li></ul>", "parentCommentId": "59KsbsQgPAmbZHYrE", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "2eRNvsWFphDfjwhY2", "postedAt": "2022-09-11T07:42:36.697Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Hi Holly, I believe that's possible. &nbsp;Note that I am not suggesting that we might over advocate for wild animals welfare, in fact, we are likely under advocating, and likely will continue so. My point here is that after FFFF is replaced, we might be complacent and go off guard about the general idea of raising animals for human use. Of course, if they will keep on fighting for other types of msitreatment of animals, my post will be much weaker or even useless!</p>", "parentCommentId": "3weWGWEjRyrwKmroq", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "CHGoKyoLYDd7AA5Gc", "postedAt": "2022-09-11T07:47:35.388Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks for the comment! It's a strong argument. And my last point in the post seems to be making the same point and suggest that my post might actually be useless. What do you think, though, if we also think about the possibilities of other types of factory farming (not for food)? Particularly, if it is possible for them to be orders or magnitude larger in scale than current FFFF?</p><p>Yes, there's a tendency. But there were case we pretty much ascribe it to pure economics. I think the consensus is that the horse advocates didn't even play a tiny bit in replacing horses being transport, and that it was the invention and mass production of automobiles.</p>", "parentCommentId": "oZh4LHPuhCAdkpkTP", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "6DqGrG4McRELyArhN", "postedAt": "2022-09-11T07:58:12.595Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<blockquote><p>It seems possible to me that moral advocacy efforts can happen after alternative proteins have scaled up, but before there are laws to stop factory farming for food entirely.</p></blockquote><p>I find this very interesting! And I tend to agree.Inspired by you, it looks to me that a solution to my worry, if there is a justified worry at all, is to start advocating for a ban on FFFF, when it's nearly (i.e. 80%), but not yet, obsolete. <strong>And this view means that we should still try to speed up alt-pro!</strong></p><blockquote><p>&nbsp;I don’t think alternative proteins replacing, say, 80% of meat will result in people thinking non-meat uses of animals is morally okay in a lock-in kind of way.&nbsp;</p></blockquote><p>Just to be clear, the lock-in I am referring to is losing the only opportunity to use moral reasons to eliminate FFFF. I still hold the view that if alt-pro just suddenly replace FFFF, we will miss on a golden opportunity to replace what might turn out to be the easiest kind of factory farming to replace and therefore use it to change humanity's value (it might be hard to believe now, but I am afraid the other uses could have huge economic potentials). But since we now agree that we can use alt-pro to replace 80% of FFFF, and then do moral/legal advocacy from there, maybe we still have a realistic chance to &nbsp;make the elimination of FFFF a moral change.</p>", "parentCommentId": "WcBy9cgYz8tFsNedP", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "MHKN5xqJcCTEjnZuc", "postedAt": "2022-09-11T08:11:53.355Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<blockquote><p>I think a lot of people’s moral reasoning about animals is posthoc/based on cognitive dissonance. That is, people like eating meat, or it’s a valuable part of their culture, and their moral intuitions around animal exploitation are built around that. So it seems plausible to me that moral advocacy efforts become substantially more effective if we’re able to quickly replace one of the biggest uses of animals.&nbsp;</p></blockquote><p>Tobias also mentioned this. I am adding this to the counterargument. I wasn't convinced enough when Tobias mentioned it. But your mention of the 80% (or other points that can count as near success) point is relevant here. It seems hopeful that we can replace 80% of FFFF, and reduce people's cognitive dissonance from there.</p><blockquote><p>I feel like this is just intractable. Meat has the advantage of being embedded in culture and identity for generations. Without proposing <i>any </i>alternative, and going entirely through the moral route, means going up against this generational idea that eating meat is okay. Success seems hard. I’m wary of taking such a risk, when there’s also the possibility of factory farming for food persisting into the future (and I’d guess, in business-as-usual scenarios, it remains a bigger problem than other kinds of factory farming). I will also say I’m not convinced that expanding our moral circle to animals helps expand our moral circle to things like digital minds in the far future, though that’s a conversation for another day.</p></blockquote><p>I agree that without any alternatives the change is hard even for hardcore moral changers, that's a great point and a great reminder.&nbsp;</p><blockquote><p>I’m not sure I’m compelled by the mechanism for lock-in.</p></blockquote><p>Me neither, I am literally throwing my intuitions to be critiqued, hopefully bringing out, or rejecting, a potential crucial consideration.</p><blockquote><p>So in the case of horses, for example, I don’t think it was easier to convince people that horses matter before they were replaced as practical transport.&nbsp;</p></blockquote><p>I agree with this. But my point in the post was that by losing the opportunity to slowly do the horse advocacy, it was kind of a lock-in. And I intuitively think that it is plausible that if automobiles were invented later, and horse advocacy was given time to succeed, maybe factory farming won't be born.&nbsp;</p><p>And it's relevant to the 80% point. There was virtually no such point for the horses. It happened so quick that the horse advocates have no time to do \"posthoc advocacy\".</p><p>&nbsp;</p><blockquote><p>I’m uncomfortable about this argument for nonconsequentialist reasons. If factory farming is a grave injustice that ought be abolished (even if you’re a consequentialist who buys moral uncertainty), it seems like letting it stay for much longer and taking a huge risk that it stays forever because you want to do it for the right reasons could be a massive negligent injustice in itself. It feels like, in a moral way, saying “it’s bad to hire more beat cops to deter crime, because deterring crime through fear doesn’t convince anyone that their crime is wrong.” One reason a lot of people would find that intuitively bad is because it feels like it’s instrumentalizing the victims of crime for a dubious future consequence.&nbsp;</p></blockquote><p>Interesting. I think I am nudged a bit by your point. (I endorse moral uncertainty).</p>", "parentCommentId": "WcBy9cgYz8tFsNedP", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "ReLgqe9u5kvbYsPLj", "postedAt": "2022-09-11T08:43:23.901Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<blockquote><p>Most of this post's arguments for that premise seem to be just the author's speculative intuitions, given with no evidence or argument</p></blockquote><p>Yes, not doing research, and instead throwing my ideas out and make it a crowdsourcing of ideas and argumentation, is how I am doing \"research\" on this topic, I guess.</p><blockquote><p>I also worry that using laws to capture our abolition of moral catastrophes after they become economically inviable, can create a false sense of progress</p></blockquote><p>I am still pretty convinced by this particular point I raised though. This is not my intuition only. For example, some political thinkers and philosophers, such as Hobbes, the Legal School in China, and many more, believe that humans pretty much agreed to not kill each others all the time because of laws or authority. But people, not just now but also in the past, seemed to be very confident that not murdering other humans is a moral intuition or moral progress we had collectively.</p><blockquote><p>But I don't think ungrounded intuitions about how society might work are good ways to make predictions; there's too many complications and alternatives that approach might miss.</p></blockquote><p>I tend to agree. And to a certain extent throwing these intuitions out feels bad. But I do have a push back. If there are too many complications I might miss in my worries (and btw I am more express doubts over the standard predictions farmed animal and alt-pro advocates are making, than making predictions myself), then the same doubt can be casted against farmed animal welfare and alt-pro advocates for not thinking about these messy complications. So yes, naively taking my worries to make predictions is unreliable, but not considering the worries I threw out &nbsp;just because they are messy seems so too.</p><blockquote><p>As a reason why this kind of argument isn't reliable, we could just as easily come up with intuitive stories that point to the opposite conclusion, e.g. \"economic changes that drive moral progress will inspire and inform future advocates to take pragmatic approaches that actually work well rather than engaging in endless but ineffective moral grandstanding; always waiting for moral progress might mislead us to think we have less obligation to improve economic incentives when the tractability of moral advocacy is lower.\"</p></blockquote><p>I actually think this paragraph you created is worth presenting and considering. The thing is, it's pretty much been presented already. This is, for example, roughly the story of &nbsp;Bruce Friedrich (founder and CEO of GFI), and maybe pretty much GFI too. And that was my story too, and might be the story of a lot of EA animal/alt-pro advocates. So if this argument is presented, why not also consider its counterpart? (what I did)</p><blockquote><p>Also, I think the historical importance of economic and military motives for the abolition of slavery <a href=\"https://forum.effectivealtruism.org/posts/o4HX48yMGjCrcRqwC/what-helped-the-voiceless-historical-case-studies\">are understated</a>.</p></blockquote><p>Great to know! Thanks. Might update my views on the topic again.</p>", "parentCommentId": "q3tetrGq6g8meHSpe", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "wfE9LvWdevGFtD2oD", "postedAt": "2022-09-11T09:28:43.668Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I feel like the reductio ad abusurdum of your argument then is \"Never encourage (maybe even discourage) anything that helps someone unless that thing is moral reasoning.\"</p>\n", "parentCommentId": "2eRNvsWFphDfjwhY2", "user": {"username": "Holly"}}, {"_id": "PuuMopCXYi5hmTBaC", "postedAt": "2022-09-11T09:33:50.460Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<blockquote><p>I feel like the reductio ad abusurdum of your argument then is \"Never encourage (maybe even discourage) anything that helps someone unless that thing is moral reasoning.\"</p></blockquote><p>But that's actually not my view. First, I &nbsp;wasn't discussing about \"helping someone\", but eliminating a moral catastrophe, particularly FFFF. Also, I didn't claim that non-moral motivations are always not helpful, I was particularly discussing the scenario where 100% of FFFF is eliminated by non-moral reasons.</p>", "parentCommentId": "wfE9LvWdevGFtD2oD", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "v7Z2bBDhFmtepdmcb", "postedAt": "2022-09-11T09:36:59.270Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<blockquote><p>One reason that Tobias provides is that motivation often follows action<a href=\"https://forum.effectivealtruism.org/posts/2KbLLyxj5gYJniHp2/could-it-be-a-bad-lock-in-to-replace-factory-farming-with?commentId=wfE9LvWdevGFtD2oD#fn-hH3KqXLkanvEjkCjh-1\"><sup>[1]</sup></a>. It's a lot easier to think kindly of animals <i>after</i> you treat them kindly. I believe that this has been true for me personally -- I feel more morally responsible toward animals (and more critical of the other forms of exploitation that you mention in the post) after having changed my diet, even though that change was partially motivated by ecological reasons.</p></blockquote><p>A third comment on this point! (I added this to my post's counterargument section)</p><blockquote><p>In fact, the book made me a bit wary of people who think that moral reasons are the <i>only valid way</i> of helping animals.</p></blockquote><p>Not reading this particular book. But I have always been wary of this group of people. My post is motivated partly from the concern that we are almost purely their antithesis, with too little emphasis on moral/social changes.</p>", "parentCommentId": "X3xuG2gTt5zKAM7Aq", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "sDGqigqfzeTCegJBv", "postedAt": "2022-09-11T09:38:36.255Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I had to re-read too, but I read it as \"Slavery was <em>not</em> primarily abolished for economic reasons.\"</p>\n", "parentCommentId": "DyShJrTYjzRPmaHGd", "user": {"username": "Holly"}}, {"_id": "qLYApgmHGSen5psLM", "postedAt": "2022-09-11T11:18:08.950Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks Tyner!&nbsp;</p><blockquote><p>The below sentence is difficult to parse, what do you actually mean? &nbsp;That it <i>was</i> economic reasons, or that it <i>was not</i> economic reasons, or something else entirely?</p></blockquote><p>What I said there was that Will convinced me that it is mostly non-economic reasons that abolished slavery.</p>", "parentCommentId": "DyShJrTYjzRPmaHGd", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "5mmEYAjdAPgcyurgu", "postedAt": "2022-09-11T12:47:06.077Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks! Also this is a small point but I find it easier to skim articles when they have formatted headings (so there's an overview of the article on the left hand side). You can do this using the forum formatting features.</p>", "parentCommentId": "kPSPbu78DoDu4jDjk", "user": {"username": "Evie Cottrell"}}, {"_id": "v7kdys2Sfv9avNFCK", "postedAt": "2022-09-11T17:16:54.847Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I think There is an important difference between plant based products and cultured meat for this conversation</p>\n<p>A society that stops eating meat will be able to ban meat</p>\n<p>A society that replaces animal meat with cultured meat would not be able to ban animal meat, because the animal meat and cultured meat are the same thing so There  would be no way for law enforcement to recognize contraband, I can see large numbers of backyard slaughterhouses , hunting/fishing and small scale animal meat production surviving indefinitely in the second situation.</p>\n", "parentCommentId": null, "user": {"username": "Vgvt"}}, {"_id": "tkZ2jAhGAsgNK9GyJ", "postedAt": "2022-09-11T18:28:30.327Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I think I disagree fwiw. Making cultured meat is not &nbsp;like making a synthetic diamond. I think cultured meat is not and likely will never be chemically indistinguishable from conventional meat without substantial optimization pressures in that direction. And I do not expect people to be aiming extremely hard at making cultured meat chemically indistinguishable from conventional meat (as opposed to just having similar enough taste/texture/nutritional profile at an appropriate price point).&nbsp;</p><p>In addition (and maybe more importantly) I expect there to be a bunch of ways to do law enforcement/surveillance to enforce bans at the production stage, rather than at the consumption stage. We might get some empirical tests of this crux soon, particularly when through seeing whether <a href=\"https://www.smithsonianmag.com/science-nature/faking-elephant-ivory-180963226/\">synthetic ivory</a> will make it harder to crack down on elephant poaching.</p>", "parentCommentId": "v7kdys2Sfv9avNFCK", "user": {"username": "Linch"}}, {"_id": "h6YejM5Cj9933MbqN", "postedAt": "2022-09-12T00:18:19.693Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thanks for the thoughtful response!</p>\n<blockquote>\n<p>I actually think this paragraph you created is worth presenting and considering. The thing is, it's pretty much been presented already. This is, for example, roughly the story of  Bruce Friedrich (founder and CEO of GFI), and maybe pretty much GFI too. And that was my story too, and might be the story of a lot of EA animal/alt-pro advocates. So if this argument is presented, why not also consider its counterpart? (what I did)</p>\n</blockquote>\n<p>I think this is subtly off. The story I've heard from alt-pro advocates <a href=\"https://www.ted.com/talks/bruce_friedrich_the_next_global_agricultural_revolution?language=en\">is that</a> we should focus on making it easier for people to drop factory farming because that would get people to do so, while generations of moral advocacy against factory farming have failed to achieve mass consumer change. That's a historical argument about tractability--it's not a speculative argument about how we might inspire or mislead future advocates.</p>\n<p>(To be fair, the above is still not an argument about long-term impacts. But I think the related long-term argument that \"good, lasting value change is more likely when it's convenient\" is a much better-grounded claim than \"good, lasting value change is more likely when advocates have historical examples of entirely morality-driven change\"; the latter claim seems entirely speculative, while the former is at least in line with various historical examples and psychological findings.)</p>\n", "parentCommentId": "ReLgqe9u5kvbYsPLj", "user": {"username": "Mauricio"}}, {"_id": "jgT7QtNz7z2pa6hbK", "postedAt": "2022-09-12T04:24:59.680Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Thank you for the recommendation! I spent a few minutes looking for function but I can't find it. I wonder if you can teach me?</p>", "parentCommentId": "5mmEYAjdAPgcyurgu", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "rZnDQ4bKxpzRe3JFi", "postedAt": "2022-09-12T04:45:55.076Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I also think banning shouldn't happen too early. I think we need a lot of moral progress to prepare for that.&nbsp;</p>", "parentCommentId": "JNnHBsDKzB7eHuueF", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "GJZ7dWCRgriPHC8io", "postedAt": "2022-09-13T07:21:38.918Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I strong-up-voted this for the effort to clarify things while the post is no longer on the frontpage.&nbsp;</p><p>I think I still have reservations. You tried to point out the story that points to historical evidence about what worked and what did not. &nbsp;But meta discussions about what kind of work motivates (though I believe they don't talk about misleading) advocates being effective and sustainable (not burning out) is a constant topic that goes on in pretty much all annual meetings/retreats of FAW advocacy groups. Street advocacy/education advocacy, or just any moral advocacy that is not working, is being discussed as a reason to move away BOTH because of direct effectiveness and how much we can stay motivated. And the reverse is said for what's working. And even if those were mentioned, I don't think it is possible that each of us, as individuals, wasn't affected by such motivation/frustrations in choosing our career, for instance, I was.</p><p>Also, as a side story, I heard that people left some FAW-related orgs for overrepresenting/overmotivating, and I tend to agree with them about their judgment. So maybe there is actually some active misleading.</p><p>So in a sense, \"speculative argument about how we might inspire or mislead future advocates\" IS happening, at least the \"inspire\" part (and I suspect that the misleading part is also there, just not framed this way).</p><p>&nbsp;</p><blockquote><p>\"good, lasting value change is more likely when it's convenient\" is a much better-grounded claim than \"good, lasting value change is more likely when advocates have historical examples of entirely morality-driven change\"; the latter claim seems entirely speculative,</p></blockquote><p>I think you kind of changed the \"latter argument\" &nbsp;a bit here from what we were discussing before. Copying things over, it was A:\"economic changes that drive moral progress will inspire and inform future advocates to take pragmatic approaches that actually work well rather than engaging in endless but ineffective moral grandstanding;\"</p><p>And B: \"always waiting for moral progress might mislead us to think we have less obligation to improve economic incentives\"</p><p>And my point is that, within the FAW and altpro movements, A is mentioned, often as a point for advocacy sustainability and self-care.</p><p>B is also mentioned, but much less than A (A is a recurring theme in retreats, I literally heard it just last week), as a criticism of abolitionist vegans who often spend a big chunk of their time criticizing us (us as in the FAW/altpro movement).</p>", "parentCommentId": "h6YejM5Cj9933MbqN", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "QdoLn3CQpkqwLNHjP", "postedAt": "2022-09-13T08:05:09.385Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<blockquote>\n<p>my point is that, within the FAW and altpro movements, A is mentioned</p>\n</blockquote>\n<p>Oh interesting, I wasn't aware this point came up much. Taking your word for it, I agree then that (A) shouldn't get more weight than (B) (except insofar as we have separate, non-speculative reasons to be more bullish about economic interventions).</p>\n<blockquote>\n<p>I think you kind of changed the \"latter argument\"  a bit here from what we were discussing before.</p>\n</blockquote>\n<p>Sorry for the confusion--I was trying to say that alt-pro advocates often have an argument that's different (and better-grounded) than (A) and (B).</p>\n<p>In other words, my current view is that (A) and (B) roughly \"cancel out\" due to being similarly speculative, while the separate view that \"good, lasting value change is more likely when it's convenient\" is better-grounded than its opposite.</p>\n", "parentCommentId": "GJZ7dWCRgriPHC8io", "user": {"username": "Mauricio"}}, {"_id": "JqdijzwTuqNC2upux", "postedAt": "2022-09-13T09:46:15.425Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Voted agree! I think we are gaining understanding, and maybe converging on our views a bit.&nbsp;</p><p>Also, I want to mention that I have shifted quite a bit from my worry I wrote in this post, so much that I actually updated some parts of it. My high level takeaway now is that we SHOULD keep up, probably speed up alt-pro (maybe particularly CM), but at roughly the point that alt-pro replaced 70-80% of factory farming, we should seriously consider putting much more effort (than now) on moral and legal advocacy.&nbsp;</p><p>Thank you everyone for the discussion!</p>", "parentCommentId": "QdoLn3CQpkqwLNHjP", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "YAyd6xMoaddRykqs2", "postedAt": "2022-09-14T21:43:23.836Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>The moral needs PBM. It is the only way to get there. Decades of moral arguments have left us with record-high per-capita consumption of animals.<br><a href=\"https://www.mattball.org/2016/10/what-have-we-learned.html\">https://www.mattball.org/2016/10/what-have-we-learned.html</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "tn7RACpyasHagus59", "postedAt": "2022-09-15T04:26:00.590Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I am curious how much of what you consider harmful about factory farming is already illegal under at least the spirit of a law somewhere on the books in various countries around the world.&nbsp;</p><ol><li>Could a change from enforcing laws for only local animal products to imported animal products as well help address the legality of the suffering associated with factory farming? For example, EU laws cover its member states, but how do <a href=\"https://www.euractiv.com/section/agriculture-food/news/eu-official-imposing-animal-welfare-standards-on-imports-would-be-wto-compliant/\">international trade relations </a>play a role in enforcement of anti-cruelty laws for imported meat?</li></ol><p>My belief is that farming of animals will continue, and decisions about how animals are treated on farms will have more to do with how laws are enforced than how laws are written. Farmed animal products might reach a smaller segment of animal product consumers that want \"the real thing\" even after effective substitutes are available.</p><p>There are likely to be differences between synthetic and actual meats, because animal chemistry is complicated. For example, milk from real animals could contain some amount of biochemical contaminants that alter flavor profile or bodily response to the milk, while manufactured milk would lack those. I'm thinking of blood and its constituents, hormones, and a larger profile of proteins that break down differently (for example, into caseomorphins of various types). I think some people will notice the difference somehow. This or just the appeal of something traditional will create a market for animal products with consumers that are willing to pay premium prices.</p>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "vbqXMeDcAhmXrjEo4", "postedAt": "2022-09-27T16:21:01.827Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>I agree with Tejas' comment, particularly the second point. As a social psychologist, cognitive dissonance is exactly what I would cite too. Reducing the disparity between attitudes and behaviour by any means (such as increasing plant-based eating for health reasons) leaves the mental space to either learn about moral reasons without the same degree of defensiveness OR -- even better and fairly likely in my opinion -- start adopting moral reasons without even any external influence. At least in western societies, the moral reasons for going vegan are pretty well-known, so motivated reasoning may work in our favour over time.&nbsp;Reducetarians may look at their behaviour and \"decide\" subconsciously that it was partially motivated by moral reasons because that&nbsp;makes them feel like a good person... which then encourages them to make further changes on moral grounds.&nbsp;</p>", "parentCommentId": "WcBy9cgYz8tFsNedP", "user": {"username": "jo"}}, {"_id": "cMTSfQfBJkxrDyBzs", "postedAt": "2022-09-28T12:23:32.565Z", "postId": "2KbLLyxj5gYJniHp2", "htmlBody": "<p>Fai, thanks for your article. Interesting thoughts. I do think that my book might be interesting to you &nbsp;(Sjlver thanks for mentioning it) - it's certainly relevant for this discussion. I give several examples in it of how moral attitude change is easier achieved after having alternatives (technological ones being one kind of them). I like what Sam Harris said (or quoted) somewhere: that cultivated meat could be the technological revolution <i>that precedes</i> the moral revolution. I think it's entirely likely that moral arguments will more easily find a firm footing and be more palatable when people know they don't have much to lose. &nbsp;</p>", "parentCommentId": "v7Z2bBDhFmtepdmcb", "user": {"username": "tobiasleenaert"}}]