[{"_id": "u4MFXSxcTWBEbFHGX", "postedAt": "2015-03-01T17:41:40.086Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>How can we get more involved in policy? There's some historically contingent reasons that we haven't done so before. 1 - policy impact is hard to measure, 2 - policy can make people irrational.</p>\n<p>But it's also fun to read - at SSC, in the news, and in general. Open Philanthropy Project is doing some policy research, as is GPP, and as is CSER. But how can we do it better? Probably we need better engagement with existing policy researchers. So should we host policymaking workshops? Should EAs practice getting involved by writing letters to our local members? Should we commission Scott Alexander to write extra policy essays about things we care about? Should we fund Niel B and others to do direct lobbying? How should this all play out?</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "aMtquEKrR6SXaNmmZ", "postedAt": "2015-03-01T17:44:08.810Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Tom Ash wrote a piece a month ago called <a href=\"http://effective-altruism.com/ea/eg/effective_altruism_and_consequentialism/\"><strong>Effective Altruism and Consequentialism</strong></a>. In it, he covers a particular issue.</p>\n<blockquote>\n<p>A third sort of non-consequentialist position is that we should not act wrongly in certain ways even if the results of doing so appear positive in a purely consequentialist calculus. On this position we should not treat our ends as justifying absolutely any means. Examples of prohibited means could be any of the adjectives or nouns commonly associated with wrongdoing: dishonesty, unfairness, cruelty, theft, et cetera. This view has strong intuitive force. And even if we don’t straightforwardly accept it, it’s hard not to think that a sensitivity to the badness of some of these actions is a good thing, as is a rule of thumb prohibiting them - something that many consequentialists accept.</p>\n</blockquote>\n<p>It would be naive to suppose that effective altruists are immune to acting in these wrong ways - after all, they’re not always motivated by being unusually nice or moral people. Indeed, effective altruism makes some people more likely to act like this by providing ready-made rationalisations which treat them as working towards overwhelming important ends, and indeed as vastly important figures whose productivity must be bolstered at all costs. I’ve seen prominent EAs use these justifications for actions that would shock people in more normal circles. [...] And there are also attitudes that are sufficiently common to not be personally identifiable, such as that one’s life as an important EA is worth that of at least 20 “normal” people.</p>\n<p>I believe there should be an essay targeted at the issue above. It should be posed as a problem, or a question, which we will make an effort to solve. The question is:</p>\n<blockquote>\n<p>What, if any, circumstances allow us to make special exceptions for ourselves to act in ways we and others would usually prohibit?</p>\n</blockquote>\n<p>The question isn't &quot;is consequentialism true?&quot;, nor &quot;is effective altruism the same thing as consequentialism?&quot; Those are questions which have already been examined, not the least by the rest of Tom's essay. I want this essay for the sake of posterity, something we can point to as a common-sense guide to whether such an action is acceptable, and why not. So, it might be more about personal behavior, psychology, and practicality than philosophy. I <strong>really</strong> want help writing this. I think it needs to be written sometime, but I can't do it alone. Please offer your help in comment replies, or a PM. </p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "vTuLFqhvDro86X8ja", "postedAt": "2015-03-01T17:44:24.639Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Obviously, we must be sensitive in covering the topic, especially in which examples are chosen. Some examples will present edge cases, problems where even the greatest moral philosophers in the world will be hard-pressed to conclusively solve. Some may not seem like edge cases to us in particular, but they may to others. Some examples, even single words used for reference, could be <a href=\"http://lesswrong.com/lw/gm9/philosophical_landmines/\">philosophical landmines</a>. It would like to avoid such examples as best we can.</p>\n<p>I believe good examples are the ones which are the least controversial among everyone, and are failure modes of consequentialist rationalizing in obviously hazardous ways. I read an article about how one anonymous woman in the United States was making money by writing essays for students at American universities with poor English skills. She was making enough money that I speculated, as an adept student of English, it was worth it for me to take up a career of plagiarism to earn to give. I was dumb. Jack LaSota commented I shouldn't consider it because if I was found out such actions would tarnish effective altruism by association. Months later, in another conversation, someone asked if funneling money into secret Swiss bank accounts to avoid paying taxes so the money could instead be donated to effective charities would be a good idea. Everyone responded 'uh, no', but I gave a lengthy and well-received response as to <strong>why</strong> it was a bad idea.</p>\n<p>Justifying crime and fraud are great, uncontroversial examples of things <strong>WE TOTALLY SHOULDN'T DO</strong>. I think building from like examples is a good starting point, and we can extrapolate to general rationale behind <strong>not</strong> doing them to get the thesis across.</p>\n", "parentCommentId": "aMtquEKrR6SXaNmmZ", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "qGuAP7ZPgyWmDjEgv", "postedAt": "2015-03-01T17:47:38.091Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Feel free to ask for advice regarding donations, projects and career choice here. If you just want to put important questions out there without attaching your username, it's fine to use a different one!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "qTtHzcwo2PGgEMhkT", "postedAt": "2015-03-01T18:01:14.320Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Good question. Policy is an important area that the EA movement will need to address.</p>\n<p>I  will add another reason which may have limited policy engagement: policy is hard! Finding policies that would definitely be good and wouldn't face significant opposition requires substantial work. It is also possible to be overconfident about policy ideas: most of our ideas have looked better at a first glance than on closer inspection. This means we shouldn't be too hasty to fix on policies we choose to push.  </p>\n<p>It's possible to do this work, and GPP is experimenting with fleshing out policies at the moment, but it's not necessarily easy. </p>\n<p>Another option is to lobby for &quot;obvious&quot; policies, like increasing foreign aid. But this is hardly a neglected area. </p>\n", "parentCommentId": "u4MFXSxcTWBEbFHGX", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "9r8FDsTfTDmGFqSXL", "postedAt": "2015-03-01T18:07:56.295Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Yeah, I think you're right that we need to have some common-sense guidelines, or 'injunctions' or 'deontology' or 'virtue ethics'. And it's not great to act on a view that EAs are extra valuable. But what should we do about it?  Why do people come to this position? What mistakes are they making? </p>\n<p>Or maybe the issue can be extended other ways, and then it would be a nice juicy big post topic!</p>\n", "parentCommentId": "aMtquEKrR6SXaNmmZ", "user": {"username": "RyanCarey"}}, {"_id": "bNBdRaDeLJCaLvjCA", "postedAt": "2015-03-01T18:11:55.324Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>If it's difficult but tractable, then liasing with existing policymakers is good, as is getting practice in lobbying and policymaking.</p>\n<p>I also feel like science and tech lobbying is a bit neglected, and could be popular with the public and with great scientists, while giving us an opportunity to talk to relevant policymakers about risk-mitigating interventions.</p>\n", "parentCommentId": "qTtHzcwo2PGgEMhkT", "user": {"username": "RyanCarey"}}, {"_id": "TocKST2rfKRzdnXGf", "postedAt": "2015-03-01T21:18:53.844Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Things that seem pretty useful for career development are online education, tutoring and networking. How can we provide these better? Can 80,000 Hours focus more on some or all of these?</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "7sMEEy5iRbhJb5E3q", "postedAt": "2015-03-01T21:50:53.367Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Yes, although engaging with existing policymakers too soon is a good way to lose credibility. There is definitely more room to talk to friendly policy experts though!</p>\n<p>I'm not sure that doing lobbying 'just for practice' is a good idea. It would be fairly easy to accidentally lobby for something bad, and equally the reputational consequences of lobbying can be complicated if you don't know an area.</p>\n<p>What do you mean by science/tech lobbying? Lobbying for what?</p>\n", "parentCommentId": "bNBdRaDeLJCaLvjCA", "user": {"username": "Sebastian_Farquhar"}}, {"_id": "uXpRmzQa4PMLKSpZs", "postedAt": "2015-03-02T08:38:28.768Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Genetal science stuff like research funding, improved research infrastructure, better research regulation, better patent law, better education, all the while promoting public understanding of science. All of this could be a good platform to build on even if some of these areas are somewhat crowded, reducing immediate impact.</p>\n", "parentCommentId": "7sMEEy5iRbhJb5E3q", "user": {"username": "RyanCarey"}}, {"_id": "hCfrsQTMyEazv6tn2", "postedAt": "2015-03-02T22:36:42.354Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p><a href=\"http://lesswrong.com/lw/9j/bystander_apathy/\">The bystander effect!</a>\nMaybe you should ask someone specific who you know!</p>\n", "parentCommentId": "aMtquEKrR6SXaNmmZ", "user": {"username": "RyanCarey"}}, {"_id": "A3SyTddpEFDssgT7W", "postedAt": "2015-03-03T00:07:18.477Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I go to Cornell, and I'm mildly interested in starting an EA student group here. For various reasons, this only seems likely to work if I can find other already-EA people. Do any of you attend (or I suppose work at) Cornell or live in Ithaca or nearby, and if so, would you like to start a club?</p>\n", "parentCommentId": null, "user": {"username": "Yavanna"}}, {"_id": "4TkijXuiTXYZPb3Eq", "postedAt": "2015-03-03T02:23:46.099Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I assume you've read <a href=\"http://lesswrong.com/lw/uv/ends_dont_justify_means_among_humans/\">this</a> <a href=\"http://lesswrong.com/lw/v0/ethical_inhibitions/\">series</a> <a href=\"http://lesswrong.com/lw/v2/prices_or_bindings/\">of</a> <a href=\"http://lesswrong.com/lw/v3/ethics_notes/\">posts</a>?</p>\n", "parentCommentId": "aMtquEKrR6SXaNmmZ", "user": {"username": "Larks"}}, {"_id": "aeihXHxXj5wYFWrYb", "postedAt": "2015-03-03T08:55:24.019Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Not sure I know anyone. I suggest also asking Jonathan Courtney, Tom Ash, and a <a href=\"http://www.lesswrong.com\">www.lesswrong.com</a> open thread!</p>\n", "parentCommentId": "A3SyTddpEFDssgT7W", "user": {"username": "RyanCarey"}}, {"_id": "W6dpq969CpiSrKEqh", "postedAt": "2015-03-03T11:45:42.234Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Hi Yavanna, I helped start the new <a href=\"http://effectivealtruismhub.com/groups/effective-altruism-cornell\">Effective Altruism Cornell group</a> so you can join that! I'd encourage you to give them an email. In general, anyone can find local EA groups at <a href=\"http://effectivealtruismhub.com/groups\">http://effectivealtruismhub.com/groups</a></p>\n", "parentCommentId": "A3SyTddpEFDssgT7W", "user": {"username": "Tom_Ash"}}, {"_id": "cGjXHQJy7bvs8c8B2", "postedAt": "2015-03-03T11:48:09.992Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I was curious who'd heard of a few organisations and places in the EA orbit, with a range of fame and nicheness. So I started a poll on the EA Facebook group: <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/832289520160740/?qa_ref=qd\">https://www.facebook.com/groups/effective.altruists/permalink/832289520160740/?qa_ref=qd</a> . I'd be interested in your responses!</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "54nsKr3WFafXZk6JE", "postedAt": "2015-03-03T14:32:23.980Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I think it's not so much that it's crowded as that it's often unclear what the actual thing you'd lobby for  is: is more research funding better research funding? Maybe. What exactly would better patent law be? Better education? These are all things where it is easy to come to views, and even to be quite confident about them, but where the realities are often much more complicated than they seem.</p>\n<p>I don't mean that in a nihilistic way - I'm currently working on building a much more informed view of safe biological research funding in order to lobby for a specific policy - it's just that there's quite a lot of work to be done to be sure something is good before you advocate for it.</p>\n", "parentCommentId": "uXpRmzQa4PMLKSpZs", "user": {"username": "Sebastian_Farquhar"}}, {"_id": "5Wp646FHAfCoyeKne", "postedAt": "2015-03-05T03:31:24.913Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I know for a fact that there are intelligent and thoughtful people who argue that foreign aid spending has not been effective, and in some cases has actually been harmful. And there are other people who are convinced that we need to increase it. So, so much for 'obvious'. : )</p>\n", "parentCommentId": "qTtHzcwo2PGgEMhkT", "user": {"username": "LKor"}}, {"_id": "sHyHZqPQRbtexetT5", "postedAt": "2015-03-05T03:53:20.675Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Has the date for the 2015 EA Summit been set yet? </p>\n", "parentCommentId": null, "user": {"username": "LKor"}}, {"_id": "Hz3RfkeZTS6Ka9pog", "postedAt": "2015-03-07T00:40:18.561Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>A post on how to balance doing good where it has the highest impact and doing &quot;frivolous&quot; good for your friends: <a href=\"http://www.patheos.com/blogs/unequallyyoked/2015/03/effective-altruism-ethically-questionable-cookies.html\">http://www.patheos.com/blogs/unequallyyoked/2015/03/effective-altruism-ethically-questionable-cookies.html</a></p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "fmeZj6MvjaknvSPWW", "postedAt": "2015-03-07T04:41:13.207Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Hi all,\nNot sure if this has been posted somewhere but basically, it's FREE money for charity donations. the animals and it will only take two minutes. Follow these seven easy steps and you're done:</p>\n<ol>\n<li><p>Visit <a href=\"http://www.pledgeling.com\">www.pledgeling.com</a> and use the “Sign Up” button (in the purple bar at the top) to create an account.</p>\n</li>\n<li><p>Fill in your name and email address, and create a password. No credit card required!</p>\n</li>\n<li><p>Click the verification link you will receive in an email and have $5 automatically added to your account.</p>\n</li>\n<li><p>Find your charity by using the search bar.</p>\n</li>\n<li><p>Click the “Donate” button and confirm that you would like to pass the $5 along to that charity.</p>\n</li>\n<li><p>Use the social media share buttons to ask your friends and family members to help as well.</p>\n</li>\n<li><p>Congratulate yourself on making a $5 donation in two minutes!</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "kierangreig"}}, {"_id": "ekN2XPndicGZ6LCf5", "postedAt": "2015-03-09T01:47:25.707Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I don't think the other comments have really nailed the most challenging parts of working in policy.</p>\n<ol>\n<li><p>It is all about the voters. 99% of what politicians care about is reelection, and therefore the will of the majority often wins. Voters are stupid, especially when it comes to the majority. They don't want to see their policymakers spend time (much less money!) on things that don't matter to them. This is why letter-writing (although at much greater scale than the EA community could currently support) is actually somewhat effective.</p>\n</li>\n<li><p>Lobbying is all about relationships. Lobbying does not get done with an appointment set up with a representative. It happens over very long periods of getting to know a number of politicians involved, including frank discussions and the support of a powerful group.</p>\n</li>\n<li><p>Politicians rely on those they've selected as experts. There's no chance they're going to listen to EA at this point... they're going to listen to the head of the World Bank and USAID. They'll pay a little attention to Gates, Amnesty and ONE, but those organizations struggle mightily to influence policy themselves.</p>\n</li>\n</ol>\n<p>OK, now that I was a jerk who discussed huge barriers, here's what I see as opportunities:</p>\n<ol>\n<li><p>One thing organizations such as J-PAL have clearly demonstrated is that the details of interventions matter greatly. Luckily, the details are often the things policymakers care the least about. There are opportunities to make what would be considered minute changes in policy, as long as we pay close attention and then work hard to make them happen.</p>\n</li>\n<li><p>Because policymakers represent a single geography, if you can gain scale within a single geography, you can get the attention of that policymaker. A concentrated EA population in Oxford and/or SF for example, can have an outside shot of getting the attention of their representative. If they happen to have a good one, he could help get the ball rolling a bit.</p>\n</li>\n<li><p>Organizations like ONE and Gates have spent many years doing a lot of this work for us. What that means is if we can influence them, or even partner with them, there's the potential to piggy-back those relationships and be heard.</p>\n</li>\n</ol>\n<p>It's definitely a very difficult road, and scaling EA while gaining influence and political contacts is key. Of course, it does open up the potential for enormous long-term opportunity.</p>\n<p>I worked for a US Congressman and a US Congress Committee on policy, so let me know if there's questions regarding those experiences that I could help answer.</p>\n", "parentCommentId": "u4MFXSxcTWBEbFHGX", "user": {"username": "joshjacobson"}}, {"_id": "xWPR6SgejBguH7nyi", "postedAt": "2015-03-10T02:05:41.843Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>West Oxford's MP, <a href=\"http://en.wikipedia.org/wiki/Nicola_Blackwood\">Nicola Blackwood</a>, is actually pretty promising from this point of view!</p>\n<blockquote>\n<p>In late 2010, Blackwood was elected to serve on the Home Affairs Select Committee and is secretary of the All-Party Parliamentary Group on Overseas Development.[5] Before her election to parliament, Blackwood worked as a volunteer on human rights and aid projects in the Middle East, Mozambique, Rwanda and Bangladesh, and has also worked as a volunteer among the disadvantaged in Birmingham and Blackpool. Prior to running for office, Blackwood worked with the Conservative Party Human Rights Group which was set up to find ways for the UK to combat human rights abuses in places like Burma and the Democratic Republic of the Congo and as an adviser to the then Shadow International Development Secretary, Andrew Mitchell. She is a member of the Conservative Party Human Rights Commission,[6] as well as holding a position on the Council of Advisors for ZANE, a charity which seeks to support pensioners in Zimbabwe.[7]</p>\n</blockquote>\n<p>I recall her being a lovely person, back when I was trudging around handing out leaflets in the rain for her.</p>\n", "parentCommentId": "ekN2XPndicGZ6LCf5", "user": {"username": "Larks"}}, {"_id": "D2EyqwaSJipfbuX5q", "postedAt": "2015-03-10T07:13:46.407Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I've been tentatively considering a career in the actuarial sciences recently. It seems like the field compensates people pretty well, is primarily merit-based, doesn't require much, if any programming ability (which I don't really have), and doesn't have very many prerequisites to get into, other than strong mathematical ability and a commitment to taking the actuarial exams.</p>\n<p>Also, actuarial work seems much slower paced than the work done in many careers that are frequently discussed on 80K Hours, which would make me super happy. I'm a bit burnt out on life right now, and I really don't want to go into a high-stress job, or a job with unusually long hours after I graduate at the end of this semester. I guess that if I wasn't a failure, I would have figured out what I was doing after graduation by now.</p>\n<p>Are there any actuaries in the EA movement, or does anyone have any insights about this field that I might not have? My main concern regarding potentially becoming a trainee actuary is that the field is somewhat prone to automation. Page 71 of <a href=\"https://web.archive.org/web/20150109185039/http://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf\">this paper</a>, which was linked to in <a href=\"https://80000hours.org/2015/02/which-careers-will-be-automated/?hvid=1b3MsX\">80K Hours' report</a> on career automation, suggests that there's a 21 % chance that actuarial work can be automated. The automation of certain tasks done by actuaries is frequently discussed on the actuary subreddit, as well.</p>\n<p>Thanks for reading, and for any advice or thoughts that you might have for me!</p>\n", "parentCommentId": "qGuAP7ZPgyWmDjEgv", "user": {"username": "Fluttershy"}}, {"_id": "XLdpCisXz44or5X4X", "postedAt": "2015-03-10T09:33:40.698Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I'm not expert on actuarial studies but I agree with your description that it seems good, challenging, decently rewarding reasonable low-stress and good for people with strong mathematical ability. Regarding programming ability, if you're a relatively analytical thinker, it's pretty feasible to learn to program, even without formal study, so doubt that it would be a decisive factor for most people.</p>\n<p>&quot;I guess that if I wasn't a failure, I would have figured out what I was doing after graduation by now.&quot;</p>\n<p>Although you're also clearly giving it some thought, considering that you're posting about it here, and that you're reading 80,000 Hours, so maybe  you needn't feel so downcast about things.</p>\n", "parentCommentId": "D2EyqwaSJipfbuX5q", "user": {"username": "RyanCarey"}}, {"_id": "Sz5zko7yxABudvRQ2", "postedAt": "2015-03-11T01:20:03.632Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Thanks for the encouragement, Ryan!</p>\n", "parentCommentId": "XLdpCisXz44or5X4X", "user": {"username": "Fluttershy"}}, {"_id": "cjMnGXbRmWQh7zBCd", "postedAt": "2015-03-14T20:37:17.093Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>A thought about the question whether to donate now or later: why would I invest money in myself or my own career, if the expected return on an investment in someone else is greater?</p>\n<p>Total (altruistic) human potential might increase more if I donate to SCI which indirectly improves the education of many people, or to CFAR to pay for someone else's workshop rather than go to the workshop myself. </p>\n<p>How and why could this thought be wrong ( or right?)</p>\n", "parentCommentId": null, "user": {"username": "ImmaSix"}}, {"_id": "9o2WL6Cuw3EAcnx86", "postedAt": "2015-03-15T01:08:06.857Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I think this idea raises some good questions. Something that Paul says along these lines is that when you donate funds, we expect that you might get some good flow-through benefits to the recipient and their contacts, but we should often assume that the economic benefits to people will eventually compound at roughly the interest rate.</p>\n<p>The challenge is finding opportunities where good can compound faster than a few percent. And investing in the study and career progression of someone who is trying to answer these kinds of questions might be such an example. If you think so, then the question becomes whether you think that CFAR is a good opportunity for compounding your impact like that.</p>\n", "parentCommentId": "cjMnGXbRmWQh7zBCd", "user": {"username": "RyanCarey"}}, {"_id": "ueBcfgtfTiLMjtb75", "postedAt": "2015-03-15T06:45:39.408Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>For those who are reading along, Ryan is referring to <a href=\"http://globalprioritiesproject.org/2015/02/give-now-or-later/\">this</a>.\nI mention CFAR as an example. There might be (identifiable) better giving opportunities somewhere in the world.</p>\n", "parentCommentId": "9o2WL6Cuw3EAcnx86", "user": {"username": "ImmaSix"}}, {"_id": "ytupJGoKErzGGLqKP", "postedAt": "2015-03-20T21:14:25.323Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>When considering working for a startup/company with significant positive externalities, would it be far off to estimate your share of impact as (estimate of total impact of the company vs. the world where it did not exist) * (equity share of company)? </p>\n<p>This seems easier to estimate than your impact on company as a whole, and matches up with something like the impact certificate model (equity share seems like the best estimate we would have of what impact certificate division might look like). It's also possible that there are distortions in allocation of money that would lead to an underestimate of true impact.</p>\n<p>On the downside, it doesn't fully account for replaceabilty, and I'm not sure if it meshes with the assessment that &quot;negative externalities don't matter too much in most cases because someone else would take your job&quot; that seems to be the typical EA position.</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "ix7pzdhuafCHMaapJ", "postedAt": "2015-03-21T10:01:40.038Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I think this is a good starting point for estimating share of externalities in a start-up (particularly the expected externalities that will be caused if the start-up is very successful).</p>\n<p>I don't think it will be all that accurate, for the kind of reasons you mention, but it has the major advantages that it is easy to measure and somewhat robust. I expect that replaceability means that it tends to be an overestimate, but typically by less than an order of magnitude.</p>\n<p>A warning, though: replaceability can operate on the level of startups as well as the level of jobs. You should consider that if your start-up weren't very successful in the niche it's going for, then someone else might be (even if they're a bit less good). This will tend to make the externalities of the whole company smaller than they first appear.</p>\n", "parentCommentId": "ytupJGoKErzGGLqKP", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "uE5ogesD4BBgEHZvF", "postedAt": "2015-03-28T03:42:34.177Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Thanks! I just emailed them.</p>\n", "parentCommentId": "W6dpq969CpiSrKEqh", "user": {"username": "Yavanna"}}, {"_id": "TkyfNFjvqBuPTDfti", "postedAt": "2015-03-28T03:51:33.154Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>Thanks for the open thread suggestion. I just asked; we'll see what happens!</p>\n", "parentCommentId": "aeihXHxXj5wYFWrYb", "user": {"username": "Yavanna"}}, {"_id": "3dG8z3KrCnCSH7ATu", "postedAt": "2015-04-01T19:56:18.324Z", "postId": "2LLsLAWpJqGBaoSFg", "htmlBody": "<p>I just came across an interesting set of short, user friendly videos describing how QALYs are derived using the standard gamble or time tradeoff techniques.  They mainly focus on applications in the US healthcare system, but I think they could be useful for anyone trying to communicate the ideas of cost effectiveness research. </p>\n<p><a href=\"https://www.youtube.com/watch?v=UeKQ7kBc33w\">Determining utilities using the standard gamble and time tradeoff techniques</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=RSBaEz10sQk&amp;feature=player_embedded\">Calculating QALYs, and applying them to the healthcare system</a></p>\n<p>They're written by Aaron Carroll, who regularly <a href=\"http://www.nytimes.com/2014/12/16/upshot/forbidden-topic-in-health-policy-debate-cost-effectiveness.html?_r=0\">writes</a> for the NYTimes, and blogs at <a href=\"http://theincidentaleconomist.com/\">The Incidental Economist</a>.  Their blog outlines the general concept behind EA <a href=\"http://theincidentaleconomist.com/wordpress/could-the-marginal-health-care-dollar-be-put-to-better-use/\">here</a>, so maybe they'd be open to consulting with an EA group?  In general, I think healthcare economists have really interesting viewpoints to add to this movement.  </p>\n", "parentCommentId": null, "user": {"username": "Phil_Thomas"}}]