[{"_id": "aw87KiBymDbikT9TX", "postedAt": "2023-11-27T20:27:25.370Z", "postId": "2MHpzN33bmqm2BHwJ", "htmlBody": "<p>Oh my god I am so excited for this, I've been trying to put together a thesis paper on this exact subject! I have had such a hard time finding prior relevant work.</p>\n", "parentCommentId": null, "user": {"username": "Devin Kalish"}}, {"_id": "yc2AB6cXd7BW5axM6", "postedAt": "2023-11-28T07:05:37.683Z", "postId": "2MHpzN33bmqm2BHwJ", "htmlBody": "<p>I think there are some interesting arguments here, but the argument in \"4.3 Computational Equivalence\" can probably still be saved, because it shouldn't depend on any controversial parts of computational theories.</p><p>Instead, imagine two identical brains undergoing the same physical events, but one doing so at twice the speed and over a period of time half as long.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefccl6r20tdd6\"><sup><a href=\"#fnccl6r20tdd6\">[1]</a></sup></span>&nbsp;Neural signals travel twice as fast, the time between successive neuron firings is halved, etc..</p><p>In my view, any plausible theory of consciousness and moral value should assign the same inherent hedonistic value to the two brains over their respective time intervals.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreft3yeyerao4\"><sup><a href=\"#fnt3yeyerao4\">[2]</a></sup></span>&nbsp;Computational theories are just one class of theories that do. But we can abstract away different physical details.</p><p>&nbsp;</p><p>On the other hand, I can imagine two people with identical preferences living (nearly) identical lives over the same objective time intervals (from the same reference frame), but one with twice the subjective rate of experience as the other, and this making little difference to the moral value on preference accounts. Each person has preferences and goals like getting married, having children, for there to be less suffering in the world, etc., and while how they care subjectively about those matters, the subjective rate of experience doesn't make their preferences more or less important (at least not in a straightforward multiplicative way). Rather, we might model them as having preferences over world states or world histories, and their <i>subjective appreciation</i> of how things turn out isn't what matters, it's just that things turn out more or less the way they prefer.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnccl6r20tdd6\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefccl6r20tdd6\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Maybe the thought experiment is in fact physically impossible, except through relativity, which the author addresses, but I don't think the right theory of consciousness should depend on those details, and we can make the brains and events different enough while still preserving value and having corresponding events unfold at twice the speed.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnt3yeyerao4\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreft3yeyerao4\">^</a></strong></sup></span><div class=\"footnote-content\"><p>And I'd guess the same subjective value from the perspectives of those brains in most cases, but people can care about their relationships with the world in different ways that we might care about, e.g. maybe they want the timing of their subjective experiences or neural activity to match some external events. That seems like an odd preference, but I'm still inclined to care about it.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "ndQLBvmwjH3wDTFSk", "postedAt": "2023-12-13T14:11:09.981Z", "postId": "2MHpzN33bmqm2BHwJ", "htmlBody": "<p>Thanks, Michael - Sorry for the delay in replying to this!</p><p>What I was trying to argue in 4.3 is that the following is a bad reason to think that the different experiences have the same value in spite of lasting for very different amounts of clock time: a computational theory of consciousness is true and the time that a given computation needs in order to complete when physically instantiated ought to be irrelevant to the character of mind, since there's nothing in a Turing-machine model of computation corresponding to the amount of time the machine spends in a given configuration or requires when transitioning from one configuration to another.&nbsp;</p><p>I take it that that style of argument does depend on assuming that mind is Turing-style computation. I can see that you could perhaps have some other kind of theory of mind and say that according to this theory, mental processing is to be modelled as this kind of state, followed by this kind of state, and we make no reference in our model to the amount of time the system is in each state or the amount of time required between transitions, although what is happening is not to be understood as computation. You might then argue in a somewhat similar way that because you model mental processing thusly and the model omits any time dimension, the time required for the physical instiatiation of the modelled process ought to be irrelevant to the value of a given experience.&nbsp;</p><p>However, if you try to say something along those lines, then I think a very similar objection arises to the one I outline in the paper. Since what's described appears to be an atemporal model of mental processing, whereas experience in fact unfolds in time, the model has got to be incomplete and needs to be supplemented somehow if it's to properly describe the basis of experience, and thus we seem to be drawing inferences about the phenomena we are trying to model that simply reflect gaps and abstractions in our models of them, i.e., ways in which our models fail to capture the reality of what's actually going on. That seems like a mistake. So I think that what I say in the paper about computationalism can be recast as applied to any similar way of drawing inferences from any model of what realizes experience that is essentially atemporal. In that sense, I don't think that retreat from the computational theory of mind helps.&nbsp;</p><p>That having been said, I want to emphasize that the argument in section 4.3 is not intended to show that it is false to judge that the clock time required for a physical process to complete is irrelevant to the value of the realized experience. It's merely intended to show that a particular argument for making that judgment isn't a very good one. In that sense, I am not giving any kind of positive argument against the claim that the two brains you describe realize experiences with the same hedonic value. In 4.3, I'm just trying to say that a particular argument that one might give for a view like that isn't a good one, and so if you think that the amount of clock time a person is in pain is irrelevant to the disvalue of their experience in this sort of case, you need a different reason for holding that view. In some sense, the rest of the paper might be taken as arguing that other reasons of that kind don't seem to be available.&nbsp;</p>", "parentCommentId": "yc2AB6cXd7BW5axM6", "user": {"username": "Andreas_Mogensen"}}, {"_id": "aJfBrdCMjHqiDkMkF", "postedAt": "2023-12-14T05:25:39.527Z", "postId": "2MHpzN33bmqm2BHwJ", "htmlBody": "<p>Fair enough about the objection being more general.</p>\n<p>However, I don't see why such a model (including a computational one) must be incomplete. What specific and important observations (or intuitions) about consciousness does it fail to explain?</p>\n<p>The mere fact that experience unfolds over time doesn't seem important to me. Maybe the disagreement is over just that? Or do you have something more in mind?</p>\n", "parentCommentId": "ndQLBvmwjH3wDTFSk", "user": {"username": "MichaelStJules"}}, {"_id": "qjeHGTyqzwsvMXbvj", "postedAt": "2023-12-14T12:41:20.844Z", "postId": "2MHpzN33bmqm2BHwJ", "htmlBody": "<p>No, it's just the fact that the experience unfolds in time. It seems clear to me that that's important from the perspective of explaining consciousness as an empirical phenomenon. I obviously agree we might have our doubts about whether the way experience unfolds in clock time matters from an ethical perspective.&nbsp;</p>", "parentCommentId": "aJfBrdCMjHqiDkMkF", "user": {"username": "Andreas_Mogensen"}}]