[{"_id": "3WMxmtnG5MBFGkiuZ", "postedAt": "2022-12-07T17:58:08.759Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>Just disagree with this :</p>\n<p>\"I do not consider myself a hardcore consequentialist. In general, I find it strange to believe that a single ethical theory could/should possibly guide all aspects of one's life.\"</p>\n<p>How is it difficult to believe that trying to promote good conscious experiences and minimize bad conscious experiences could be the key guide to one's behavior? A lot of EAs, myself included, consider this to be the ultimate goal for our actions... Of course, we need many other areas of study and theory to guide in specific areas.</p>\n<p>I understand that you disagree with hardcore consequentialism, but I don't see why you think it is strange for others to adopt it. This is especially true when you acknowledge the complexity in consequentialist decision-making, as you did in this post.</p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "GR5kahGTsw7Diz5L4", "postedAt": "2022-12-07T18:46:05.915Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>Thanks for the insight. Fortunately, you don't have to agree with this disclaimer in my post for the rest of the argument to remain sound.&nbsp;</p><p>That being said, I find it perfectly reasonable for one's actions to be primarily (or even almost entirely) guided by consequentialist reasoning. However, I cannot understand <i>never</i> considering reasons stemming from deontology or virtue ethics. For example, it's impossible for me to imagine condemning a gross rights violation <i>purely</i> based on its consequences without even considering that perhaps violating personal rights has some intrinsic dis-value.</p>", "parentCommentId": "3WMxmtnG5MBFGkiuZ", "user": {"username": "Jasper Meyer"}}, {"_id": "6GF3nppkeGdMprcpM", "postedAt": "2022-12-07T21:04:14.491Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>I believe that rights have value insofar as they promote positive conscious states and prevent negative conscious states. Their value or disvalue would be a function of whether they make lives better. Assigning weight to them beyond that is simply creating a worse world.</p>\n<p>I do, however, find the assignment of intrinsic value,\nimaginable, though mistaken. I do not take umbrage so much at you disagreeing with me so much as you finding my view unimaginable.</p>\n", "parentCommentId": "GR5kahGTsw7Diz5L4", "user": {"username": "Brad West"}}, {"_id": "NJBPZQuAkXvz6QjD8", "postedAt": "2022-12-07T21:30:25.391Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>That's a very fair point - unimaginable is the wrong word. I guess I'll say I find it curious.</p><p>To use a stronger example, suppose a dictator spends all day violating the personal rights of her subjects and by doing so increases overall well-being. I find it curious to believe she's acting morally. You don't need to believe in the intrinsic badness of rights violations to hold this point of view. You just have to believe that objective moral truth cannot be fully captured using a single, tidy theory. Moral/ethical life is complex, and I think that even if you are committed to one paradigm, you still ought to occasionally draw from other theories/thinkers to inform your moral/ethical decision making.</p><p>This agrees with what you said in your first comment: \"We need many other areas of study and theory to guide in specific areas.\" As long as this multifaceted approach is at least a small part of your overall theory, I can definitely imagine holding it, even if I don't agree.</p>", "parentCommentId": "6GF3nppkeGdMprcpM", "user": {"username": "Jasper Meyer"}}, {"_id": "jyKjCvhsgcFwBhhRY", "postedAt": "2022-12-07T22:50:17.659Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>I think the complexity arises in evaluating the value and disvalue of different subjective states as well as determining what courses of action, considering all aspects involved, have the highest expected value.</p>\n<p>You discuss the example of the despot regularly violating rights of subjects, yet increasing utility. Such a scenario seems inherently implausible, because if rights are prudently delineated, general respect for them, in the long run, will tend to cultivate a happier, more stable world (I.e, higher expected utility). And perhaps incursions upon these rights would be warranted in some situations. For instance, perhaps the public interest may allow someone's property rights to be violated if there is a compelling public interest (eminent domain). This is why we have exceptions to rights (I. E.- free speech and instigating imminent violence). If the rights you are advancing tend to lower the welfare of conscious beings, I would think such formulation of rights is immoral.</p>\n<p>You are correct that moral life is complex, but I think the complexity comes down to how we can navigate ourselves and our societies to optimize conscious experience.  If you are incorporating factors into your decisions that don't ultimately boil down to improving conscious experience, in my view, you are not acting fully morally.</p>\n", "parentCommentId": "NJBPZQuAkXvz6QjD8", "user": {"username": "Brad West"}}, {"_id": "27xYnH5kTyJsHLQ3c", "postedAt": "2022-12-07T23:21:49.283Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>This post argues against a strawman - it's not credible that utilitarianism <strong>endorses</strong> frauding to give. It's also not quite a question of whether Sam \"misconstrued\" utilitarianism, in that I <a href=\"https://forum.effectivealtruism.org/posts/ZbdNFuEP2zWN5w2Yx/ryancarey-s-shortform?commentId=iFiK3GuWLG7Zg5iiZ\">doubt</a> that he did a rational calculus on whether fraud was +EV, and he <a href=\"https://archive.ph/uwawF\">denies doing so</a>.</p><p>The potential problem, rather, is that naive consequentialism/act utilitarianism removes some of the <strong>ethical guardrails</strong> that would ordinarily make fraud very unlikely. <a href=\"https://forum.effectivealtruism.org/posts/ZbdNFuEP2zWN5w2Yx/ryancarey-s-shortform?commentId=iFiK3GuWLG7Zg5iiZ\">As I've said:</a> <i>In order to avoid taking harmful actions, an act utilitarian has to remember to calculate, and then to calculate correctly. (Whereas rules are often easier to remember and to properly apply.)</i> The way Sam tells it, he became \"less grounded\" or \"cocky\", leading to these mistakes. Would this have happened if he followed another theory? We can't know, but we should be clear-eyed about the fact that hardcore utilitarians, despite representing maybe 1/1M of the world's population, are responsible for maybe 1/10 of the greatest frauds, i.e. they're over-represented by a factor of 100k, in a direction that would be pretty expected, based on the (italicised) argument above (which must surely have been made previously by moral philosophers). For effective altruists, we can lop off maybe one order of magnitude, but it doesn't look great either.</p>", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "QJeCfvsWGog7KJYdh", "postedAt": "2022-12-08T00:15:28.113Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>I disagree that I argue against a strawman. The media's coverage of Bankman-Fried frequently implies that he used consequentialism to justify his actions. This, in turn, implies that consequentialism endorses fraud so long as you give away your money. Like I said, the arguments in the post are not revolutionary, but I do think they are important.&nbsp;</p><p>You give no evidence for your claim that hardcore utilitarians commit 1/10 of the \"greatest frauds\". I struggle to even engage with this claim because it seems so speculative. But I will say that I agree that utilitarianism has been (incorrectly) used to justify harm. As I stated:&nbsp;</p><blockquote><p>\"the EA movement is broadly consequentialist, so we should examine our own theoretical endorsements under a broadly consequentialist framework. If we determine that publicly advocating consequentialism directly causes many people to act immorally \"in the name of consequentialism\", we should either 1. change our messaging or 2. stop advocating consequentialism even if it's still what we truly believe\"</p></blockquote><p>Part of my motivation for making this post was helping consequentialists think about our actions - specifically those around the idea of earning to give. In other words, the post is intended to clarify some \"ethical guardrails\" within a consequentialist framework.</p>", "parentCommentId": "27xYnH5kTyJsHLQ3c", "user": {"username": "Jasper Meyer"}}, {"_id": "Ci7JBrjZkybEm5rJe", "postedAt": "2022-12-08T00:23:47.499Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<blockquote><p>You give no evidence for your claim that hardcore utilitarians commit 1/10 of the \"greatest frauds\". I struggle to even engage with this claim because it seems so speculative.</p></blockquote><p>I mean that the dollar value of lost funds would seem to make it one of the top ten biggest frauds of all time (assuming that fraud is what happened). Perusing a list on <a href=\"https://en.wikipedia.org/wiki/List_of_fraudsters#:~:text=Harshad%20Mehta%2C%20did%20a%20fraud,his%20life%20and%20fraudulent%20activity.\">Wikipedia</a>, I can only see four times larger sums were defrauded: Madoff, Enron, Worldcom, Stanford.</p>", "parentCommentId": "QJeCfvsWGog7KJYdh", "user": {"username": "RyanCarey"}}, {"_id": "vfCPGoKyJyY66q7Dy", "postedAt": "2022-12-08T00:46:17.945Z", "postId": "2mirCRXvahGk3mC9j", "htmlBody": "<p>Okay, I see now. I read that as \"one-tenth\" not one out of 10.</p><p>I'm on board with your lack-of-guardrails argument against utilitarianism. I hope arguments like the one made in this post help to construct them so we don't end up with another catastrophe.&nbsp;</p>", "parentCommentId": "Ci7JBrjZkybEm5rJe", "user": {"username": "Jasper Meyer"}}]