[{"_id": "rtYHThbQdRTGvWb6d", "postedAt": "2023-07-27T13:39:28.559Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Probable typo: $200,00, [is this $200,000]?</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "SAPrCekTERMZcz5S5", "postedAt": "2023-07-27T14:03:50.960Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Fixed, thank you :)&nbsp;</p>", "parentCommentId": "rtYHThbQdRTGvWb6d", "user": {"username": "CE"}}, {"_id": "FjZJCWfeAwcKAbcog", "postedAt": "2023-07-27T15:51:19.004Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Thanks for these! A super interesting read.</p>\n<p>Given that you don't cap the number of people on the Incubation Programme, what will happen if you accept more than eight people and only have these four charities? Are the 'considered ideas' not options at all at this stage?</p>\n<p>Thanks!</p>\n", "parentCommentId": null, "user": {"username": "Sentient Toucan"}}, {"_id": "rEuoaNZ8c23rDPkTq", "postedAt": "2023-07-27T16:11:03.473Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Excited to hear which Manifold comments won prizes! Also unclear to me if EU fish advocacy should resolve the EU animal advocacy or the fish advocacy market YES</p><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/CE/7-encouraging-higher-vaccination-ra\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/CE/7-encouraging-higher-vaccination-ra\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/CE/2-using-mass-media-to-tackle-violen\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/CE/2-using-mass-media-to-tackle-violen\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/CE/2-animal-advocacy-organization-at-t\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/CE/2-animal-advocacy-organization-at-t\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/CE/8-fish-welfare-policy-advocacy\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/CE/8-fish-welfare-policy-advocacy\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/CE/4-preventing-the-takeoff-of-insect\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/CE/4-preventing-the-takeoff-of-insect\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure>", "parentCommentId": null, "user": {"username": "Pat Myron"}}, {"_id": "LvAtEE5m66m9C83SA", "postedAt": "2023-07-27T16:15:11.415Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>By the most recent World Bank and FAO data, as well as the 2017 FAO data you link to, Greece isn't close to being the largest producer of fish in the EU nor the 15th largest producer in the world. Correct me if I'm wrong, I think the correct claim is that Greece <i>farms</i> the greatest <i>number</i> of fish in the EU. Fish production statistics are generally by total weight rather than fish number, and I see how the latter is more relevant to welfare concerns. However I think your phrasing is a bit misleading, as Greece has a very unique fish industry for the EU. It farms a huge amount of low-weight fish and has a relatively small wild-catch industry. For most (all?) other European countries, total national fish catch (by weight and number) is still dominated by fishing fleet capture rather than aquaculture. I'd be curious to know how your model weights welfare impacts on humane slaughter method adoption vs improving living conditions on farms. If the latter is a bigger deal, I see how Greece can be a high-leverage country to start with, especially considering the growing proportion of aquaculture in fish production worldwide.</p>", "parentCommentId": null, "user": {"username": "Dave Canberra"}}, {"_id": "fAHH3gxEe3NiXhbZK", "postedAt": "2023-07-28T09:28:08.181Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Hi Pat -- We're currently coordinating on which comments will receive prizes and will let Manifold and the commenters know soon.<br>&nbsp;<br>The fish idea would resolve the Fish welfare policy advocacy market as a YES. Thank you!</p>", "parentCommentId": "rEuoaNZ8c23rDPkTq", "user": {"username": "vicky_cox"}}, {"_id": "H8eBgpLC8xGpom3Dy", "postedAt": "2023-07-28T10:24:02.943Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Hi Sentient Toucan (lovely name!),</p><p>in short, we do in fact cap the number of people in some ways, and there will be more than these four charities, and/but/also we are quite creative if we should be so lucky as to get too many people! I'll go into more detail:</p><p>First, there are in fact two caps on the number of people in each IP cohort:&nbsp;</p><ol><li>Most importantly, there is a pragmatic cap in that we do see clear tiers between the people we make offers to and the people who are close but not quite there in terms of a sufficient likelihood to launch one of the top charities we are looking to launch (like LEEP, FEM, Fortify Health etc.).</li><li>Secondly, we usually have a soft cap in that we think there is an ideal number of participants in a cohort. Given our experiments in the last years with both large and small cohorts, we currently believe it to be around 12-14 people.</li><li>Thirdly, there are many smaller, softer factors and heuristics that might lean us towards accepting or rejecting a candidate in any given round - e.g., if we have 2 animal ideas and there are 3-5 similarly strong animal candidates and a slightly weaker candidate, we might lean towards letting in the latter person as well.</li></ol><p>Secondly, we currently expect to have at least five ideas for this Feb - March 2024 cohort (the four mentioned above, one passing over from the current IP, and perhaps one or two more we are currently considering adding). We usually don't add \"considered ideas\" to the pool after deciding they didn't make the cut as there was usually a reason they were considered, not recommended - that is, the research team looked into them and decided that they were in a lower tier than the ideas we do recommend.</p><p>Thirdly, given our past experience, that means the ideal cohort for that round would be 12-14 people. Usually about 90% of incubatees in each cohort end up founding charities while about 10% don't find their ideal co-founder and/or idea match and/or decide this career path is not quite the right fit for them at this time.</p><p>However, if there were more than 12-14 candidates during the application process that we would be super excited to have on the program, we would find a way to make it work. We are quite pragmatic and creative.</p><p>Hope this helps!</p>", "parentCommentId": "FjZJCWfeAwcKAbcog", "user": {"username": "Judith"}}, {"_id": "TjB3q7eum9Yn36a3p", "postedAt": "2023-07-28T10:57:27.244Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Hi – thanks for your comment.</p><p>&nbsp;</p><p>You're correct in that we are prioritizing for the greatest number of fish on farms rather than the total tonnage produced. Our claim that Greece is the largest producer in the EU (and the 15th largest in the world) is based on estimates (using the FAO data linked) of the number of fish alive on farms in each country at any given time. This has to do with the total farmed as well as their lifespans and expected mortality rates on farms pre-slaughter.&nbsp;</p><p>&nbsp;</p><p>We generally prioritize farmed fish as you can impact their whole lives, whereas for wild-caught fish, you can only impact the end of their lives. However, if the new charity chooses to focus on humane slaughter, then there could be scope to focus on both farmed and wild-caught fish. Note, however, that protections for wild-caught fish, to the best of my knowledge, don't exist in legislation anywhere yet, so we might not expect this to be very tractable. Overall, at least in the short-term, we would recommend that a new org should focus on farmed fish and should try to push for the inclusion of stocking density and water quality parameters as well as humane slaughter in any ask where possible. Still, we could see that the new org chooses to only focus on slaughter – at least at first – as this seems to be what the rest of the movement is likely to focus on, and there could be benefits from all being on the same page and asking for the same thing.</p>", "parentCommentId": "LvAtEE5m66m9C83SA", "user": {"username": "vicky_cox"}}, {"_id": "BRQf5hSL45vLx382s", "postedAt": "2023-07-28T22:27:43.543Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<blockquote><p>90% of incubatees in each cohort end up founding charities</p></blockquote><p>That's way higher than I thought! You must have a great recruitment process!</p><p>What % of these incubatees found CE incubated charities? (i.e. get seed funding, support, and so on)</p><p>On your website, I see you <a href=\"https://www.charityentrepreneurship.com/incubation-program\">have assisted 50+ individuals from a wide range of backgrounds in launching 27 high-impact charities</a>. Does that mean that fewer than 10 people went through the program and <i>didn't</i> start a charity? Or that there are many individuals who started non-high-impact charities? Or something else?</p>", "parentCommentId": "H8eBgpLC8xGpom3Dy", "user": {"username": "AnonymousAccount"}}, {"_id": "RRmoHDXu5FAcnWaCy", "postedAt": "2023-08-21T13:40:01.949Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Is funding limited only to yet-to-be-founded organizations? I'm asking because my company (Simprints, a tech non-profit) is starting a new project in Ghana for the distribution (among other vaccines) of the new malaria vaccine. As part of the program we are evaluating an option to send SMS reminders to caregivers. If this is a funding opportunity for us, I can forward it to our partnerships team but don't want to waste yours and their time if it's not.</p>", "parentCommentId": null, "user": {"username": "Milen Marinov"}}, {"_id": "pGMXgFateMcNpGXLz", "postedAt": "2023-09-05T20:57:02.643Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Really excited to see this coming along!</p><p>I'm particularly keen on the mass media to prevent violence against women intervention. In fact in August, I sent a version of <a href=\"https://www.charityentrepreneurship.com/post/announcing-our-february-2024-charity-ideas\">your webpage</a> covering the same topic to the co-authors of the \"one<a href=\"https://doi.org/10.1177/0010414020912275\"><u> experimental study</u></a> [that] measured effects on behavior\" (my advisor and two grad school classmates, FWIW), and they are all positive about this project as well.</p><p>I'd like to know more about the thinking behind the claim that a mass media IPV campaign would be 50x as effective as cash transfers at improving welfare (which roughly follows from your claim that you want to fund things that are 5X as effective as GiveWell's top charities, which they claim are all 10X as effective as GiveDirectly's programs). For two reasons, this seems like a very high estimate to me:</p><ol><li>As it happens, we can make an apples-to-apples comparison between cash transfers' and mass media's effects on IPV, because <a href=\"https://www.nber.org/papers/w25627\">Haushofer et al. (2019)</a> study the effects of cash transfers on IPV, and and find that transfers to \"women averaging USD 709 reduced physical and sexual violence (-0:26, -0:22 standard deviations),\" while \"Transfers to men reduced physical violence (-0:18 SD).\" In more detail, transfers led to \"a decrease in being pushed or shaken by the husband by 7 percentage points relative to a control group mean of 27 percent (a 26 percent reduction); being slapped by the husband (11 percentage point decrease relative to 33 percent control group mean, a 33 percent reduction); being punched (6 percentage point decrease relative to 15 percent control group mean, a 39 percent reduction); and being kicked, dragged, or beaten (8 percentage point decrease relative to 15 percent control group mean, a 51 percent reduction).\"&nbsp;<br><br><a href=\"https://journals.sagepub.com/doi/10.1177/0010414020912275#supplementary-materials\">Green, Wilke, and Coope</a>r, by contrast, report that \"screenings reduced the average rate at which women in treatment communities experienced violence by roughly .15 to .34 of an incident, from a baseline of just over half an incident on average...[which] fall short of significance.\" However, \"the campaign reduces the village-level proportion of women respondents who report any violence in their household by seven percentage points.\"<br><br>Reading these two papers side by side, my overall impression is that cash is probably <strong>better, </strong>for an individual woman, at reducing IPV than a mass media campaign. So I am wondering how you got to a conclusion that mass media is 50x more effective? I am assuming it has something to do with cost of delivery, but to get from a <strong>smaller effect size</strong> to a <strong>better cost benefit-analysis </strong>would require the intervention to be incredibly cheap to deliver on a per-person basis -- I'm ballparking it at like $10. Perhaps this is possible once you've achieved massive scale and content you're happy with, but both of those things are going to take time and money, and the project might fail along the way, all of which raise costs in expectation. Giving a dollar to GiveDirectly, by contrast, leads to about 89c going to a person in extreme poverty right away. So I'd love to hear your thinking on this question spelled out in more detail.<br>&nbsp;</li><li>You write: \"The evidence on the effectiveness of mass media in IPV is limited but cautiously optimistic: While only one experimental study measured effects on behavior, four other experimental and quasi-experimental studies found sizable shifts in attitudes and norms related to IPV.\" How well do you think those norms <strong>are </strong>correlated with IPV, and how well do you think that changing one will change the other?&nbsp;<br><br>Another way to frame this: Going back to Haushofer et al., the authors posit a very different theory, which is that men who commit IPV in the sample do so mainly to extract financial resources from their spouses -- in other words, because they're poor, which is not an attitude problem. How do you reconcile these two perspectives?&nbsp;<br><br>Thanks in advance, I really look forward to seeing this all come together!<br>&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "setgree"}}, {"_id": "nfibbFy6keYLQ9Hzq", "postedAt": "2023-10-13T09:40:51.691Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Dear Seth,&nbsp;</p><p>Thank you for your support and thoughtful comments! Apologies for the delay – it’s a really busy time for us.&nbsp;</p><p>To clarify, we aimed for 5x GiveWell bar for health policy ideas - the text is an example of our goals in our research process. For this round, the bar needed to be more formally established.&nbsp;</p><p>Our claim for the idea around IPV is that the modeled cost-effectiveness for a “hypothetical 5-year intervention in Lesotho, Rwanda, Angola, and Ethiopia revealed a cost per disability-adjusted life year (DALY) averted ranging from $28 to $1419”. The wide range is because it is highly unclear how one should model the DALY burden of IPV, among other reasons. Our&nbsp;<a href=\"https://9475dbf4-555e-4808-9886-5f8ee815cc82.usrfiles.com/ugd/9475db_a4444e9a0e174269a96c0f4d566aed66.pdf\"><u>full report</u></a> is published on our website now, so you can further dig into our thinking behind this. Of note, GiveWell tends to use a cost-effectiveness bar of $100-150 per DALY averted (which they claim to be ~8X GiveDirectly, note this is no longer the case given OP updates), which means that our estimates for this charity fall within the range of 40-0.5x GiveDirectly in cost-effectiveness. However, we aren’t sure if GiveWell has directly included these IPV benefits in its evaluation of GiveDirectly’s program.</p><p>Regardless, thanks for bringing this&nbsp; <a href=\"https://www.nber.org/papers/w25627\"><u>Haushofer et al. (2019)</u></a> paper to our attention, We hadn’t seen this paper during our research, which is a pity. I cannot look into the paper in detail now; hopefully, my above clarification shows that we aren’t directly claiming a “ 50x over GD” bar. What you say sounds roughly true - I’d expect cash transfers to be far more expensive per person (mass media would be cents per person reached) but more effective (if the effect holds - I haven’t looked at the paper in any detail).&nbsp;</p><p>On your second point. We write a bit more about our sense of what the mechanism behind the intervention is in the report. To summarise - there is no clear sense in the literature about the main accepted mechanism for reducing violence or the true causal link between attitudes/norms and the prevalence of violence. It’s plausible that finances are a part of this, but it is likewise plausible that patriarchal norms, acceptability, etc., play a role. Different papers point in different directions, and this is an area that would benefit a lot from further research so that we can understand what works best.&nbsp; The context will matter a lot as well in terms of what drives violence and what type of violence is committed.&nbsp;</p>", "parentCommentId": "pGMXgFateMcNpGXLz", "user": {"username": "emefair"}}, {"_id": "yhC2KKbAQKbGx6Em2", "postedAt": "2023-10-13T21:08:54.633Z", "postId": "2Nnu9ykixiqG2mMit", "htmlBody": "<p>Good stuff, thanks!</p><p>FWIW I am a co-author on a <a href=\"https://forum.effectivealtruism.org/editPost?postId=uWh8N5DtbSLsuuTzL&amp;key=4bfa3aec48e6ebfb0c60207a43e445\">meta-analysis of interventions to reduce sexual violence</a>, where we found a disappointing lack of correlation between changes in stated attitudes and change in behavior.</p><p>I look forward to seeing this come together!</p><p>P.S. another two studies on this subject: <a href=\"https://journals.sagepub.com/doi/abs/10.1177/00104140221139385\">https://journals.sagepub.com/doi/abs/10.1177/00104140221139385</a> (found significant effects on attitudes towards early and forced marriage) and <a href=\"https://www.journals.uchicago.edu/doi/abs/10.1086/726964?journalCode=jop\">https://www.journals.uchicago.edu/doi/abs/10.1086/726964?journalCode=jop</a> (found \"sporadic\" effects on attitudes)&nbsp;</p>", "parentCommentId": "nfibbFy6keYLQ9Hzq", "user": {"username": "setgree"}}]