[{"_id": "8W8GMjBA5xkxo6Yje", "postedAt": "2015-02-09T02:19:56.535Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Minor complaint: It felt like you spent most of the space going over obvious (to me, at least) things like how to use Facebook/Meetup. The only reason I've not started a group in my area is because I have no idea what would happen at events. This article did not do much to clarify.</p>\n<p>Unrelated: Question: Why do you recommend Facebook, specifically, to start with?</p>\n", "parentCommentId": null, "user": {"username": "JMeans"}}, {"_id": "onuRSw5XEonYASocb", "postedAt": "2015-02-09T05:42:26.707Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Not the OP, but I've run a bunch of events with a college group and we consistently got higher turnout when we used Facebook invites than other methods. I suspect it's a good way to reach people because everyone checks Facebook all the time and people can see that their friends are going.</p>\n", "parentCommentId": "8W8GMjBA5xkxo6Yje", "user": {"username": "Ben_Kuhn"}}, {"_id": "tGvzecZPGctabXhpe", "postedAt": "2015-02-09T05:47:45.104Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Great writeup, thanks!</p>\n<p>Have you had any problems with your meetup becoming too insular?</p>\n<p>I live in Berkeley, and I'm missing the Boston meetups, which is weird because the Bay Area is a much bigger EA hub. But the meetups here are basically 100% people from the rationality community, which means whenever I go it's the same people talking about the same stuff, and if I bring new people, they mostly get bored if they're not super-compatible with the rationalist community (which includes lots of people for various reasons).</p>\n<p>Would love any advice you/others have about ways to deal with this.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "DfTgt6edAvw788DEQ", "postedAt": "2015-02-09T08:44:59.939Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>I don't understand... are your events less than 30 minutes long (because it says that they now happen more than once a month)?  It seems like most of the time in running our group doesn't go into social media promotion and reminders, but into the group meetings, discussions, and activities, and the socializing before and after that makes people stick around.  </p>\n<p>I felt like this post was a misleading because the author appears to spend more than 30 minutes, as any group leader should expect.  I am concerned that the author used a surprising title to get attention but then added lower-value, common-sensey content.</p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "HXxwDdurHoFB5ut3J", "postedAt": "2015-02-09T12:39:23.862Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Thank you for writing this! It had a lot of useful suggestions. (E.g. I'll take away from this post that I should also publicise our meetups on Facebook.)</p>\n<p>I'm not sure whether &quot;30min a month&quot; translates that well to the time when you're just starting as well as smaller cities than London.</p>\n<p>I've recently started a meetup in Frankfurt (we had one so far and the next is already planned) and I think I've invested about five to ten hours already, not even counting the meetup itself. Those went into creating a meetup account and getting familiar with the website, creating a mailinglist and curating it, preparing a talk for the first meetup, writing texts to be inviting, etc, then opportunity costs (I couldn't manage to organize the LW meetups as I usually do, so I was trying to get other people to do that and so on).</p>\n<p>But for me it's not so much the time as the mental energy which is the problem here, in the sense that it grabbed a lot of my attention. This might be my own personal problem that others don't have, but I don't know what to do about it.</p>\n<p>The other point is that I live in a much smaller city where &quot;just post an event&quot; doesn't seem to work very well, when I look at my experience organizing the local LW meetups for the past 1,5 years. To get people to show up, I need to think of an interesting programme that is the biggest time sink. For what it's worth, maintaining the LW meetups costs me a lot less time than starting EA meetups costed me.</p>\n<p>Whenever I am in London and visit LW or EA meetups, I can see how it can easily work differently just by the fact that you have lots of people showing up - they'll always find something interesting to talk about in smaller groups. In a smaller city we have fewer attendees and they need more deliberate entertainment.</p>\n<p>In general, I'm strongly in favor of encouraging people to start meetups, I wish I had started ours sooner. A clear outline of what to do can help a lot with that! </p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "2PRLDvJ7t6issfMcL", "postedAt": "2015-02-09T17:03:10.016Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>When I saw the title I understood it to mean &quot;30 minutes of overhead,&quot; not that the author was accomplishing something physically impossible.</p>\n", "parentCommentId": "DfTgt6edAvw788DEQ", "user": {"username": "Ben_Kuhn"}}, {"_id": "xnomqipSR6QmAZxpX", "postedAt": "2015-02-10T00:38:31.513Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>I have not had much of this problem think we had this problem a little bit before it was on Meetup. I think we have slightly more insular groups now that meetings are more regular. Based in part on this experience, the advice I would give would be:</p>\n<p> • Advertise more (be on Meetup etc)</p>\n<p> • Have less frequent but bigger events rather than more frequent smaller events. At bigger events people can find people they get on with and the regulars can sit in the corner doing regular talk. Also regulars will come more frequently so bigger events will dilute the numbers of regulars somewhat.</p>\n<p> • Actively encourage people to be more welcoming to new folk.</p>\n<p> • You could split up the events into an event for regulars and and event for new folk. I have never done this but it could be worth trying and if you do this let me know how it goes!</p>\n", "parentCommentId": "tGvzecZPGctabXhpe", "user": {"username": "weeatquince"}}, {"_id": "JLnqR6LzWqGuuSJz4", "postedAt": "2015-02-10T00:55:29.619Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Hi Claire, sorry if the post and the title were unclear. (I will edit to make it clearer). I can totally see why this is misleading as I did not count the time spent at events.</p>\n<p>I think the very basic principle I wanted to get across here is that the only thing the organiser NEEDS to do on an ongoing basis is to take the responsibility to choose a time and place and post an event online, somewhere where a group of members can grow, once every month or every other month, and this does not take long.</p>\n<p>I personally do not consider the events as work. Almost all the events are socials so there is very little to do to host the event (be nice and make sure people can find us) and I would attend the events anyway if someone else was doing the organising. </p>\n<p>Also I have not even attended all of the events that I have organised and have on occasion asked others to host.</p>\n<p>I hope that helps. Thanks for the feedback on my post.</p>\n", "parentCommentId": "DfTgt6edAvw788DEQ", "user": {"username": "weeatquince"}}, {"_id": "zwbzvpPesqQFAdDEW", "postedAt": "2015-02-10T01:04:22.762Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Hi. Thanks for the feedback.</p>\n<p>EVENTS - To clarify, most of our events are just social events. People turn up at a pub and discuss whatever takes their fancy often including effective altruism. This is low effort but seems to be working.</p>\n<p>FACEBOOK - My cop out answer to this is just - this is what I did and it worked for me. (This post is an awkward mix of writing up what I did in a way that could be posted to the EA wiki so that others could edit it and add their advice.) That said the &quot;copy event&quot; feature does make it very very easy to create repeat events with minimal effort until you get round to starting an actual facebook group.</p>\n", "parentCommentId": "8W8GMjBA5xkxo6Yje", "user": {"username": "weeatquince"}}, {"_id": "gtmxYoaZ5aMjBbHMs", "postedAt": "2015-02-10T03:04:03.188Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Thanks for replying. Have you run into much issues with underage members not being allowed in pubs?</p>\n", "parentCommentId": "zwbzvpPesqQFAdDEW", "user": {"username": "JMeans"}}, {"_id": "HfyGTcocdH54pEv9r", "postedAt": "2015-02-10T03:28:09.207Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>PS. Also I wanted to add that if you are putting in and can put in more than 30 min a month  (+ time at events) of organising events that are better than just social events then that is amazing and you should keep doing that. Running a group on a very minimal basis is not ideal - but, in London at least, it can be done when needed - and such a group can grow!</p>\n", "parentCommentId": "DfTgt6edAvw788DEQ", "user": {"username": "weeatquince"}}, {"_id": "W7foeQhFkM4BvePmF", "postedAt": "2015-02-10T10:05:44.945Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Most of the pubs in London are happy to have families with young kids come in, and I haven't seen anyone have their age checked despite being a young looking group.</p>\n", "parentCommentId": "gtmxYoaZ5aMjBbHMs", "user": {"username": "DavidNash"}}, {"_id": "9Y9NXs7uQWakHZsL4", "postedAt": "2015-02-11T00:14:57.219Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Even when our events are not in pubs we do not really attract many (if any) under 18s so I suspect the negative impacts of people not being able to turn up because of age are minimal. \n(But we do have a few 18-21 year olds so if the UK had a higher drinking age that could be problematic.)</p>\n", "parentCommentId": "gtmxYoaZ5aMjBbHMs", "user": {"username": "weeatquince"}}, {"_id": "xoCwbSHEcLP4kNP2G", "postedAt": "2015-02-11T03:03:44.056Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>What is LW?</p>\n", "parentCommentId": "HXxwDdurHoFB5ut3J", "user": {"username": "Ken_Scheffler"}}, {"_id": "oCvEhX6eJrjCWeKRE", "postedAt": "2015-02-11T08:12:52.487Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>LessWrong, a community dedicated to improving &quot;rationality&quot;. It has a decent overlap with the EA community.</p>\n", "parentCommentId": "xoCwbSHEcLP4kNP2G", "user": {"username": "Denise_Melchin"}}, {"_id": "u5wDyP2CyPxoFuEXg", "postedAt": "2015-02-11T14:39:48.304Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Thanks Sam, this is really useful! I love the specificity of the recommendations. I always find things so much easier to get around to if I know the precise steps I'll be taking. Also really appreciate all the links to samples of all the stuff you mention. \nIf you or others ever want to respond to questions about EA but don't have time, do feel free to introduce them to Giving What We Can central team people. Jon would be a particularly good person to answer questions. As our Director of Outreach, he's keen to get to know everyone in chapters and answer All The Questions.  </p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "iuLLJpwijaRZq2Y3h", "postedAt": "2015-02-11T20:59:14.943Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>I have a similar experience for EA in the Netherlands. My post may sound somewhat negative, but I decided to continue writing it to reduce possible bias towards success stories.</p>\n<p>We are a very small meetup group, and the most frequent attendees do not even live in the same city - the density of people interested in EA is very low. We meet near the train station in  Utrecht, which is a city in the centre of the country. Convincing people from your local network to a meetup in another city is difficult (I managed twice). The large travel cost, low popularity of donating money and unfamiliarity with EA are big thresholds for potential attendees. </p>\n<p>I always have great time during the meetups and met really awesome people, got a lot of new insights, and some people reported the social support has been useful.  </p>\n<p>Mental energy cost is significant for me too. I don't see this as something really bad.</p>\n<p>My rough guess is that in a city where very few people are <em>already interested</em> in EA, organizing a meetup is probably not worth it (depending on how much you value your time). EA Netherlands falls below this threshold, although we decided to keep going. Alternative EA or LW events do not exist at reasonable travel distance. The nearest are Frankfurt for EA and Brussels for LW.</p>\n", "parentCommentId": "HXxwDdurHoFB5ut3J", "user": {"username": "ImmaSix"}}, {"_id": "ptmGDRJ8kMMMMmaCo", "postedAt": "2015-02-12T02:51:36.538Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p><a href=\"http://lesswrong.com/\">Lesswrong</a></p>\n", "parentCommentId": "xoCwbSHEcLP4kNP2G", "user": {"username": "Larks"}}, {"_id": "shsnSWSQku77r5x3e", "postedAt": "2015-02-12T04:56:53.908Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>This is great!</p>\n<p>Do you have any &quot;impact stories&quot; to share about the group? That is, people who signed the Pledge but would not have if not for EA London, or donations given that otherwise would not have been, etc.? Getting 250 people into a Facebook group is definitely a good thing, and worth replicating, but any tricks for turning semi-passive followers into an active/impactful community would also be welcome.</p>\n", "parentCommentId": null, "user": {"username": "aarongertler"}}, {"_id": "Bu6zZxAgNKrJnF7pY", "postedAt": "2015-02-13T16:38:43.771Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>I have asked people for their success stories here: <a href=\"https://www.facebook.com/groups/EALondon/permalink/776410502448627/\">https://www.facebook.com/groups/EALondon/permalink/776410502448627/</a></p>\n<p>I have had a few success stories of people becoming more involved and donating more effectively and I think someone recently told me that they took the GWWC pledge. We have also had people with very high impact jobs turn up. But it is hard to take the various counterfactuals into account. </p>\n<p>I do not have any tips for generating success in only 30 min a month. But if you had extra time to put in on top of the 30 min a month you could run extra events to promote people actively doing something. Eg A pledge panel where people talk about taking the GWWC pledge and there is a panel of pledgees who have taken the pledge in the past and can answer questions. Or a volunteer-a-thon like: <a href=\"https://www.facebook.com/events/1066695483346249\">https://www.facebook.com/events/1066695483346249</a></p>\n", "parentCommentId": "shsnSWSQku77r5x3e", "user": {"username": "weeatquince"}}, {"_id": "3GR2XfMtdLr9HZFWi", "postedAt": "2015-03-18T02:04:09.568Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>I want to add that having organized the second and third meetup which were quite successful, it shows it actually doesn't require many resources to keep the minimum level up.</p>\n", "parentCommentId": "HXxwDdurHoFB5ut3J", "user": {"username": "Denise_Melchin"}}, {"_id": "DYfrLxmnx2N9B229g", "postedAt": "2015-11-28T11:54:38.626Z", "postId": "2NsnGWtC2jxLxEQYR", "htmlBody": "<p>Great post, thanks for that. I've noticed that most of the other EA groups seem to meet in the evenings, but in the Adelaide chapter we always meet for lunch! Not sure why it's turned out that way. Do you have any thoughts about whether evening meet ups are better/worse? The first thing I can think of is people might not have to rush back to work (as I do), but others with young families might not be able to come.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDello"}}]