[{"_id": "LugYsxjyTc6GeqfH3", "postedAt": "2015-03-24T21:59:21.479Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>Sounds good!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "PKNREBhM6CwLb2c5c", "postedAt": "2015-03-25T02:33:29.762Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>Are you only going to use people who sign up to promote things the Centre for Effective Altruism is working on, like the books by Will and Peter that EA Outreach is working on (and in Will's case is even written by the founder)? Are there any specific non-Centre for Effective Altruism things that you plan to promote?</p>\n", "parentCommentId": null, "user": {"username": "Vincent_deB"}}, {"_id": "NCKscxLikSsbT4x52", "postedAt": "2015-03-25T08:20:44.090Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>Peter Singer's book is not a CEA project. </p>\n", "parentCommentId": "PKNREBhM6CwLb2c5c", "user": {"username": "Bernadette_Young"}}, {"_id": "AphtgHRcppW7CHcBW", "postedAt": "2015-03-25T15:28:07.399Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>As I understand it, it's one of the core things that EA Outreach is working on in advance of Will's book - they raised funds for doing so as part of their funding announcement here. So it would still be using these people for EA Outreach projects.</p>\n", "parentCommentId": "NCKscxLikSsbT4x52", "user": {"username": "Vincent_deB"}}, {"_id": "HFZDbvdZjbeXpptYj", "postedAt": "2015-03-25T18:25:48.384Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>The main things we know in advance that we'll focus on this year are those two books and the EA Global summit. We're also keeping an eye out for unexpected situations where a social media response could be useful. For example, when Will MacAskill's <a href=\"http://qz.com/249649/the-cold-hard-truth-about-the-ice-bucket-challenge/\">ice bucket challenge article</a> received widespread attention last year, a coordinated response could have helped direct readers of that article to the <a href=\"http://qz.com/250845/this-week-lets-dump-a-few-ice-buckets-to-wipe-out-malaria-too/\">follow-up article</a> that went into greater depth about impact metrics.</p>\n<p>It would be good to know when a lot of people in the group are interested in coordinating to promote something CEA might not already be thinking about, though. In the short term we can discuss possibilities on the Facebook group (invitations for that will be going out by email soon).</p>\n", "parentCommentId": "PKNREBhM6CwLb2c5c", "user": {"username": "ChrisJenkins"}}, {"_id": "rxZiu3EWMAuEiGeoD", "postedAt": "2015-03-25T18:28:55.711Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>Presumably in formulating the plans for EA outreach, CEA looked for the areas of greatest importance and tractability. It would be very surprising if, in forming anther initiative centred on public communication, there wasn't significant overlap. If there wasn't, I would think EA outreach had ignored an important problem. I'm not sure why you would label all such important, tractable topics 'CEA things'. </p>\n", "parentCommentId": "AphtgHRcppW7CHcBW", "user": {"username": "Bernadette_Young"}}, {"_id": "MpCemWeqBXoM6ZPMx", "postedAt": "2015-03-26T00:17:16.530Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>Just signed up and left a review on Amazon. Awesome idea.</p>\n", "parentCommentId": null, "user": {"username": "tyleralterman"}}, {"_id": "qYnnKHvNTjAMQ8Hiz", "postedAt": "2015-03-27T14:53:55.291Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>To clarify, while 'The Most Good You Can Do' is not a CEA project, in that we do not own rights to the book, it is a CEA project in that we are coordinating the global marketing campaign for the book with Goldberg McDuffie Communications (USA), Yale University Press (USA), Yale University Press UK (Europe), Text Publishing (Australia), and The Life You Can Save doing the bulk of the work.    We will be playing a similar role for William MacAskill's book, except that the holding company for the rights for Will's book is contractually obliged to donate the royalties beyond the advance to CEA.  </p>\n<p>I imagine that EA Advocates will promote a range of both CEA and non-CEA projects, where the requirement is that the actions take by participants have a particularly high value.  </p>\n", "parentCommentId": "NCKscxLikSsbT4x52", "user": {"username": "Niel_Bowerman"}}, {"_id": "oEdgDMkKyyMbR56uJ", "postedAt": "2015-03-27T17:33:01.580Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>A bit OT but this reminded me: Does anyone know if The Most Good You Can Do is coming out for Kindle?</p>\n<p>I strongly prefer digital books, so buying it for Kindle would be the medium by which I can leave a verified purchase review on Amazon. However, the book doesn't seem to available digitally anywhere in the U.S. iBooks is seemingly selling it for Australia only.</p>\n<p>I'm pretty sure I'm grasping at proverbial straws here though.</p>\n", "parentCommentId": "MpCemWeqBXoM6ZPMx", "user": {"username": "Marcus_A_Davis"}}, {"_id": "pgMtb9oTgtmog9b8t", "postedAt": "2015-04-02T01:10:23.328Z", "postId": "2pCkRYGJ7LfafdYPz", "htmlBody": "<p>To answer myself: turns out at least for iBooks the problem was my impatience. It's now in the library and it's still a week before it is officially released. Perhaps Kindle will be the same way.</p>\n<p>Still, I so rarely anticipate books being released I'm not sure if this is common.</p>\n", "parentCommentId": "oEdgDMkKyyMbR56uJ", "user": {"username": "Marcus_A_Davis"}}]