[{"_id": "FeoQzMM52rMrtN4aJ", "postedAt": "2018-08-03T20:14:46.860Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>One easy way you could get a sample that's both broadly representative and also weights more involved EAs more is to make the survey available to everyone on the forum, but to weight all responses by the square root of the respondent's karma. Karma is obviously an imperfect proxy, but it seems much easier to get than people's donation histories, and it doesn't seem biased in any particular direction. The square root is so that the few people with the absolute highest karma don't completely dominate the survey.</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "u3ENu8TvmrdFsA6dX", "postedAt": "2018-08-03T20:27:12.422Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I think EA Forum karma isn't the best because a lot of the people who are particularly engaged in EA do not spend much time on the forum and instead focus on more action-relevant things for their org. The EA Forum will be biased towards people more interested in research and community related things as opposed to direct actions. For example, New Incentives is a very EA aligned org in direct poverty, but they spend most of their time doing cash transfers in Nigeria instead of posting on the forum.  </p>\n<p>To build on your idea though, I think forming some sort of index of involvement would get away from any one particular thing biasing the results. I think including karma in the index makes sense, along with length of involvement, hours per week involved in EA, percent donated, etc.</p>\n", "parentCommentId": "FeoQzMM52rMrtN4aJ", "user": {"username": "katherinesavoie"}}, {"_id": "bvDYmbiYoiq8agzmW", "postedAt": "2018-08-03T21:19:32.239Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>[I'm a CEA staff member, but writing as an individual and a local group founder/organizer]</p>\n<p>&quot;EA chapter building is currently fairly tightly controlled&quot; - what aspect of this do you see as tightly controlled? Funding? Advising? </p>\n<p>As someone who helped start a local group before there were funds, written resources, or other advising for starting or running an EA group, I see how those things would be helpful, but don't see them as essential. The only request I can remember to focus on a particular cause area was back when GWWC was solely focused on global poverty and invited the Boston group to affiliate, which we decided not to do.</p>\n<p>I'm all for EA movement-building orgs doing a better job at supporting local groups and people who are thinking of starting one. But I wouldn't want people to come away from this post with the understanding that they're somehow restricted from starting a group, or that they'll only be able to do so if they support the right cause. My guess is that most EA groups were founded by people who saw a gap and decided to start something, not people who were tapped on the shoulder by a movement-building organization. </p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "tdCsvHhY5cD2gkRcL", "postedAt": "2018-08-03T21:43:07.694Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Should we expect a difference between materials aimed at beginners and those more involved? I think it makes sense to a adopt a clearer point of view toward cause areas if you expect your audience to be familiar with most common arguments in Effective Altruism. In my opinion, it's more important for beginner-oriented materials to be &quot;representative.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "qPcX6HhSXsYAGiHwr", "postedAt": "2018-08-03T21:45:45.100Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Thanks for writing this up. Attempting to read between the lines, I am also increasingly frustrated by the feeling that near-term projects are being squeezed out of EA. I've been asking myself when (I think it's a 'when' rather than 'if') EA will become so far-future heavy there's no point me participating. I give it 2 years. </p>\n<p>There are perhaps a couple of bigger conversations to be had here. Are the different causes friends or enemies? Often it feels like the former, and this is deeply disappointing. We do compete over scarce resources (e.g. money) but we should be able to cooperate at a broader societal level (post forthcoming). Further, if/when would it make sense for those of us who feel irked by what seems to be an exclusionary, far-futurist, tilt that seems to be occuring to split off and starting doing our own thing?</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "PmfWK9ciHt2xY7rrP", "postedAt": "2018-08-03T21:57:30.614Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Should probably mention I have raised similiar concerns before in <a href=\"http://effective-altruism.com/ea/1cd/ea_marketing_and_a_plea_for_moral_inclusivity/\">this post: 'the marketing gap and a plea for moral inclusivity'</a></p>\n", "parentCommentId": "qPcX6HhSXsYAGiHwr", "user": {"username": "MichaelPlant"}}, {"_id": "hxsigMK4fCMCzwyqY", "postedAt": "2018-08-03T22:38:55.624Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>So my personal experience starting a chapter was a long time ago, but what I have heard from people more involved in chapters currently is that there has been social pressure towards focusing on certain cause areas and funding pressure along with it. For example, a sense that chapters are much more likely to get funding, attention, etc, from movement building organizations if they are more far future focused. I think chapters can of course run without any support of any major organization, but the culture of chapters will change if support is more conditional over the long term. As far as I know, no one has been specifically told not to run a chapter based on a different cause focus and I agree this is not the reason most groups start (but it can be a big difference in which groups grow).</p>\n<p>Tightly controlled also is in reference to what competing chapter building / movement building organizations would go through to work in the space. For example, the recent post on Leverage is explicitly aimed at caution towards a conference being run under a different organization. I have heard from other organizations about similar frustrations and coordination problems when trying to work in the outreach space.</p>\n", "parentCommentId": "bvDYmbiYoiq8agzmW", "user": {"username": "Joey"}}, {"_id": "cTmmMLNiX5ZJqnvy2", "postedAt": "2018-08-03T23:04:50.359Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Thanks for the link, Michael - I've missed that post and it's indeed related to the current one.</p>\n<p>Thanks, Joey, for writing this up. My worry is that making any hard rules for what counts as representative may do more harm than good, if only due to deep (rational) disagreements that may arise on any particular issue. The example Michael mentions is a case in point: for instance, while I may not necessarily disagree that research on AI safety is worthy of pursuit (though see <a href=\"https://m.facebook.com/story.php?story_fbid=10155225415057143&amp;id=722677142\">the disagreements between Yann LeCun, the head of AI research at Facebook with Bostrom's arguments</a>), I find the transparency of the criteria used by EA organizations to make decisions which projects to fund unsatisfactory, to the point of endangering the EA movement and is reputation when it comes to the claim that EA is about <em>effective</em> paths of reducing suffering. The primary problem here, as <a href=\"http://effective-altruism.com/ea/1l6/how_effective_and_efficient_is_the_funding_policy/\">I argued in this post</a> is that it remains unclear why the currently funded projects should count as effective and efficient scientific research.</p>\n<p>In view of this, I find it increasingly frustrating to associate myself with the EA movement and its recent development, especially since the issue of efficiency of scientific research is the very topic of my own research. The best I can do is to treat this as an issue of a peer disagreement, where I keep it open that I might be wrong after all. However, this also means we have to keep an open dialogue since either of the sides in the disagreement may turn out to be wrong, but this doesn't seem easy. For instance, as soon as I mention any of these issues on this forum, a few downvotes tend to pop up, with no counterargument provided (edit: this current post ironically turned out to be another case in point ;)</p>\n<p>So altogether, I'm not sure I feel comfy associating myself with the EA community, though I indeed deeply care about the idea of effective charity and effective reduction of suffering. And introducing a rule-book which would claim, for instance, that EAs support the funding of research on of AI safety would make me feel just as uncomfy, not because of this idea in principle, but because of its current execution.</p>\n<p>EDIT: Just wanted to add that the proposal for community-building organizations to strive for cause indifference sounds like a nice solution.</p>\n", "parentCommentId": "PmfWK9ciHt2xY7rrP", "user": {"username": "Dunja"}}, {"_id": "itbX6bSBwgoh7ytA7", "postedAt": "2018-08-04T02:17:19.574Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Joey, thanks for your post! I work for CEA and am the Curator of EA Global. I manage content for the event so I’m responding to that part of the post. </p>\n<p>When deciding which speakers to solicit, I try to consider things like cause area representation, presenter diversity, and the development of community norms, among other things. It is really hard to get this right, and I know that I’ve fallen short of where I’d like to be on all of these.</p>\n<p>I do think we’ve managed to improve on the representativeness dimension over the past couple of years. I know there’s room for reasonable disagreement about how to categorize talks, and I think you and I must be looking at the talk categories differently because I’m coming up with a very different distribution than you mention. For talks at EA Global 2018, I count 21% animals, 18% meta/rationality, 25% AI/x-risk/GCRs, 14% global health and development, 7% government/policy and 14% other topics. Across the four events in 2017 and 2018, my breakdown shows 15% animals, 20% AI/x-risk/GCRs, 14% health and development, 11% government/policy, 23% meta/rationality, and 19% other. <a href=\"https://docs.google.com/document/d/15I3SYP01aNQdH0Kp3rk6FdjlEnkff6lekh76e_bsOKE/edit?usp=sharing\">Here is a link to a categorization of all of the talks from 2017 and 2018 by cause area</a> so that you can see how I’m thinking about the talk distribution (in the interest of time, and since you mentioned talks, I haven’t included meetups, office hours, workshops, or whiteboard sessions). I haven’t done the breakdown for 2015 and 2016, but I think we are representing the community’s interests better in recent years than we did in the past. </p>\n<p>This year I’ve commissioned recommendations from EAs with subject matter expertise in the different cause areas to try to improve further. We also welcome speaker and content suggestions from the community. <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfCfGs2T-Fp3ZgCc9rSGjwAY2wThes7XPY21nxR8u8nannK-Q/viewform\">Please submit ideas for EA Global London here</a>.</p>\n", "parentCommentId": null, "user": {"username": "AmyLabenz"}}, {"_id": "xSCgzXXfYEmXCL3TY", "postedAt": "2018-08-04T04:27:39.240Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Would it make sense to have a separate entity for some aspects of global poverty and animal suffering? This is already the case for charity evaluation (GiveWell, ACE). It's also more or less already the case for EA Funds and could easily be extended to EA Grants (with a separate donation pool for each cause area). I can also envision a new career advice organization that provides people interested in global poverty and animal suffering with coaching by people very familiar with and experienced in those areas. (80,000 Hours has problem profiles, career reviews, and interviews related to both of those areas, but their coaching seems to focus primarily on other areas.) To be clear, I'm not proposing that EA outreach (as opposed to cause-specific outreach) be formally split between different organizations (since I think that's likely to be harmful). I'm also not proposing that EA infrastructure (the EA Forum, EA Global, GWWC etc.) be split up (since there's less of a tradeoff between supporting cause areas for general infrastructure). But I do think that when there is a significant tradeoff (due to the function being resource intensive), it would be good for there to be a separate entity so that those who prioritize different cause areas can also have that function for their preferred area. (It seems to me it would be difficult to do this within a single organization since that organization would understandably want to prioritize the cause area(s) it felt were most effective.)</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "fAnoXZ67EgYcjD6Sz", "postedAt": "2018-08-04T07:34:22.002Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Hi Joey, thank you for writing this.</p>\n<p>I think calling this a problem of representation is actually understating the problem here.</p>\n<p>EA has (at least to me) always been a community that inspires encourages and supports people to use all the information and tools available to them (including their individual priors intuitions and sense of morality) to reach a conclusion about what causes and actions are most important for them to take to make a better world (and of course to then take those actions).</p>\n<p>Even if 90% of experienced EAs / EA community leaders currently converge on the same conclusion as to where value lies, I would worry that a strong focus on that issue would be detrimental. We'd be at risk of losing the emphasis on cause prioritisation - arguably most useful insight that EA has provided to the world.</p>\n<ul>\n<li>We'd risk losing an ability to support people though cause prioritisation (coaching, EA or otherwise, should not pre-empt the answers or have ulterior motives)</li>\n<li>we risk creating a community that is less able to switch to focus on the most important thing</li>\n<li>we risk stifling useful debate</li>\n<li>we risk creating a community that does not benefits from collaboration by people working in different areas</li>\n<li>etc</li>\n</ul>\n<p>(Note: Probably worth adding that if 90% of experienced EAs / EA community leaders converged on the same conclusion on causes my intuitions would suggest that this is  likley to be evidence of founder effects / group-think as much as it is evidence for that cause. I expect this is because I see a huge diversity in people's values and thinking and a  difficulty in reaching strong conclusions in ethics and cause prioritisation)</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "n9EkqzDDB7W7jbCtg", "postedAt": "2018-08-04T14:30:39.388Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Maybe this is off topic, but can any near future EAs recommend something I can read to understand why they think the near future should be prioritized?</p>\n<p>As someone focused on the far future, I'm glad to have near future EAs: I don't expect the general public to appreciate the value of the far future any time soon, and I like how the near future work makes us look good as a movement.  In line with the idea of moral trade, I wish there was something that the far future EAs could do for the near future EAs in return, so that we would all gain through cooperation.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "AhsgQXz2orX4sudNY", "postedAt": "2018-08-04T15:17:20.548Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Hi Joey, thanks for raising this with such specific suggestions for how this should be done differently.</p>\n<p>I won't respond to the specific Handbook concerns again, since people can easily find my previous responses in the comment threads that you link to. </p>\n<p>I think that part of the problem was caused by the general trend that you're discussing, but also that I made mistakes in editing the Handbook, which I'm sorry for. In particular, I should have:</p>\n<ul>\n<li><p>Consulted more widely before releasing the Handbook</p>\n</li>\n<li><p>Made clearer that the handbook was curated and produced by CEA</p>\n</li>\n<li><p>Included more engaging content related to global poverty and animal welfare.</p>\n</li>\n</ul>\n<p>I've tried to fix all of these mistakes, and we are currently working on producing a new edition which includes additional content (80,000 Hours' Problem Framework, Sentience Institute's Foundational question summaries (slightly shortened), David Roodman's research for GiveWell on the worm wars).</p>\n", "parentCommentId": null, "user": {"username": "Maxdalton"}}, {"_id": "83EoSwCbn6bX67WCY", "postedAt": "2018-08-04T15:56:45.187Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Hi John, I don't have any concrete links, but I'd start by distinguishing different kinds of far-future causes: on the one hand, those that are supported by a scientific consensus, and those that are a matter of scientific controversy. An example of the former would be global warming (which isn't even that far future for some parts of the world), while the example of the latter would be the risks related to the development of AI. </p>\n<p>Now in contrast to that, we have existing problems in the world: from poverty and hunger, to animals suffering across the board, to existing problems related to climate changes etc. While I wouldn't necessarily prioritize these causes to future-oriented charities (say, climate related research), it is worth keeping in mind that investing in the reduction of the existing suffering may have an impact on the reduction of future suffering as well (e.g. by increasing the number of vegans we may impact the ethics of human diet in the future). The impact of such changes is much easier to assess than the impact of the research in an area that concerns risks which are extremely hard to predict. Hence, I don't think the research on AI risks is futile --not at all-- I just find it important to have a clear assessment criteria, just like in any other domain of science, as for what counts as effective and efficient research strategy, how are future assessments of the currently funded projects going to proceed (in order to determine how much has been done within these projects and whether a different approach would be better), whether the given cause is already sufficiently funded in comparison to other causes, etc.</p>\n", "parentCommentId": "n9EkqzDDB7W7jbCtg", "user": {"username": "Dunja"}}, {"_id": "bExASgPh2wv2nXeGH", "postedAt": "2018-08-04T18:12:11.886Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Here are ten reasons you might choose to work on near-term causes. The first five are reasons you might think near term work is more important, while the latter five are why you might work on near term causes even if you think long term future work is more important.</p>\n<ol>\n<li><p>You might think the future is likely to be net negative. Click <a href=\"http://effective-altruism.com/ea/1cl/an_argument_for_why_the_future_may_be_good/\">here</a> for why one person initially thought this and <a href=\"http://reducing-suffering.org/altruists-focus-reducing-short-term-far-future-suffering/#Flow-through_effects\">here</a> for why another person would be reluctant to support existential risk work (it makes space colonization more likely, which could <a href=\"https://reducing-suffering.org/will-space-colonization-multiply-wild-animal-suffering/\">increase future suffering</a>).</p>\n</li>\n<li><p>Your view of population ethics might cause you to think existential risks are relatively unimportant. Of course, if your view was merely a standard person affecting view, it would be subject to the <a href=\"http://effective-altruism.com/ea/1n0/the_personaffecting_value_of_existential_risk/\">response</a> that work on existential risk is high value even if only the present generation is considered. However, you might go further and adopt an <a href=\"http://effective-altruism.com/ea/1cd/ea_marketing_and_a_plea_for_moral_inclusivity/bc4\">Epicurean view</a> under which it is not bad for a person to die a premature death (meaning that death is only bad to the extent it inflicts suffering on oneself or others).</p>\n</li>\n<li><p>You might have a <a href=\"http://reducing-suffering.org/altruists-focus-reducing-short-term-far-future-suffering/#Sequence_vs_cluster_thinking\">methodological objection</a> to applying expected value to cases where the probability is small. While the author attributes this view to Holden Karnofsky, Karnofsky now <a href=\"https://www.openphilanthropy.org/blog/update-cause-prioritization-open-philanthropy#Long-termist_vs._near-termist_views\">puts much more weight</a> on the view that improving the long term future is valuable. </p>\n</li>\n<li><p>You might think it's <a href=\"http://everydayutilitarian.com/essays/why-im-skeptical-about-unproven-causes-and-you-should-be-too/\">hard to predict</a> how the future will unfold and what impact our actions will have. (Note that the post is from five years ago and may no longer reflect the views of the author.)</p>\n</li>\n<li><p>You might think that AI is unlikely to be a concern for <a href=\"https://www.youtube.com/watch?v=tcs9p5b5jWw&amp;t=17m51s\">at least 50 years</a> (perhaps <a href=\"https://www.youtube.com/watch?v=tcs9p5b5jWw&amp;t=54m11s\">based on your conversations</a> with people in the field). Given that ongoing suffering can only be alleviated in the present, you might think it's better to focus on that for now. </p>\n</li>\n<li><p>You <a href=\"https://www.openphilanthropy.org/blog/update-cause-prioritization-open-philanthropy#Issue_4:_the_outlier_opportunities_principle\">might think</a> that when there is an opportunity to have an unusually large impact in the present, you should take it even if the impact is smaller than the expected impact of spending that money on long term future causes.</p>\n</li>\n<li><p>You <a href=\"https://www.openphilanthropy.org/blog/update-cause-prioritization-open-philanthropy#Causes_with_reasonable-length_feedback_loops\">might think</a> that the shorter feedback loops of near term causes allow us to learn lessons that may help with the long term future. For example, Animal Charity Evaluators may help us get a better sense of how to estimate cost-effectiveness with relatively weak empirical evidence, Wild Animal Suffering Research may help us learn how to build a new academic field, and the Good Food Institute may help us gain valuable experience influencing major economic and political actors. </p>\n</li>\n<li><p>You might feel like you are a bad fit for long term future causes because they require more technical expertise (making it hard to contribute directly) and are less funding constrained (making it hard to contribute financially). </p>\n</li>\n<li><p>You might feel a <a href=\"http://reducing-suffering.org/altruists-focus-reducing-short-term-far-future-suffering/#My_compromise_position\">spiritual need</a> to work on near term causes. Relatedly, you might feel like you're more likely to do direct work long term if you can feel motivated by videos of animal suffering (similar to how you might donate a smaller portion of your income because you think it's more likely to result in you giving long term).</p>\n</li>\n<li><p>As you noted, you might think there are public image or recruitment benefits to near term work. </p>\n</li>\n</ol>\n<p>Note: I do not necessarily agree with any of the above. </p>\n", "parentCommentId": "n9EkqzDDB7W7jbCtg", "user": {"username": "RandomEA"}}, {"_id": "Esei79dojKho6p4Bm", "postedAt": "2018-08-04T18:23:28.337Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>This is great – consider making it a standalone post?</p>\n", "parentCommentId": "bExASgPh2wv2nXeGH", "user": {"username": "Milan_Griffes"}}, {"_id": "apubdXujx2t94y7Mx", "postedAt": "2018-08-04T19:58:09.479Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Seconded!</p>\n", "parentCommentId": "Esei79dojKho6p4Bm", "user": {"username": "Peter_Hurford"}}, {"_id": "y4EeiiL5nWrcgBNyF", "postedAt": "2018-08-04T20:10:38.814Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I'll consider expanding it and converting it into its own post. Out of curiosity, to what extent does the Everyday Utilitarian article still reflect your views on the subject?</p>\n", "parentCommentId": "apubdXujx2t94y7Mx", "user": {"username": "RandomEA"}}, {"_id": "XM7tutyF52zXrn6JK", "postedAt": "2018-08-04T22:14:37.478Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I agree the far future is overwhelmingly important. However, I don't think it's been shown that focusing on the far-future really is more cost-effective, even when taking a far-future point of view. I have a degree of epistemic uncertainty with wide error bars such that I wouldn't be too surprised if MIRI turned out to be the most cost-effective but I also wouldn't be too surprised if it turned out that AMF was the most cost-effective. Right now, in my view, the case for the far-future seems to be arguing that if you take a large number and divide it by some unknown probability of success that you must still get a large number, where this isn't true. <a href=\"https://www.lesswrong.com/posts/iELiEEZERCXJS9DT4/how-does-miri-know-it-has-a-medium-probability-of-success\">I'd like organizations like MIRI to back up the claim that they have a &quot;medium probability&quot; of success.</a></p>\n<p>I personally tend to value being able to learn about causes and being empirical about how to do good. This makes it more difficult to work in far-future causes due to the lack of feedback loops, but I don't think it's impossible (e.g., I like the approach being taken by <a href=\"https://aiimpacts.org/\">AI Impacts</a> and through <a href=\"http://rethinkpriorities.org/\">Rethink Priorities</a> I'm now working to try to refine my own views on this).</p>\n<p>I think <a href=\"https://www.lesswrong.com/posts/tX93igpzE5spGkpmp/where-i-ve-changed-my-mind-on-my-approach-to-speculative\">this update on my skepticism post</a> still represents my current position somewhat well, though it is definitely due for an update.</p>\n<p>Overall, I definitely favor spending resources on x-risk reduction efforts. I'm even comfortable with roughly 50% of the EA movement's resources being spent on it, given that I sure wouldn't want to be wrong on this issue -- extinction seems like a tremendous downside! However, I'd prefer there to be more effort spent on learning what we can about the value of these efforts and I also think it's not yet clear that poverty or animal-focused interventions are not equally or more valuable.</p>\n<p>Lastly, as a movement, we certainly can and should do more than one thing. We can fight x-risk while also fighting malaria. I think we'd have a stronger and more robust movement this way.</p>\n<p>I hope to write more on this in the future, eventually.</p>\n", "parentCommentId": "n9EkqzDDB7W7jbCtg", "user": {"username": "Peter_Hurford"}}, {"_id": "cJqBAeGHsYE39FAWZ", "postedAt": "2018-08-04T22:44:58.368Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p><a href=\"http://effective-altruism.com/ea/1r5/problems_with_ea_representativeness_and_how_to/f5e\">I wrote up a reply to this here as a higher level comment</a>.</p>\n", "parentCommentId": "y4EeiiL5nWrcgBNyF", "user": {"username": "Peter_Hurford"}}, {"_id": "S6X67m5zzzQdMLrdT", "postedAt": "2018-08-05T02:20:35.581Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Nice comment; I'd also like to see a top-level post.  </p>\n<p>One quibble: Several of your points risk conflating &quot;far-future&quot; with &quot;existential risk reduction&quot; and/or &quot;AI&quot;.  But there is far-future work that is non-x-risk focused (e.g. Sentience Institute and Foundational Research Institute) and non-AI-focused (e.g. Sentience Institute) which might appeal to someone who shares some of the concerns you listed.</p>\n", "parentCommentId": "bExASgPh2wv2nXeGH", "user": {"username": "JesseClifton"}}, {"_id": "gghAQkw7BfqjNEw7D", "postedAt": "2018-08-05T04:36:52.215Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>It's a helpful list and I think these considerations deserve to be more well known.</p>\n<p>If you were going to expand further, it might be useful to add in more about the counterarguments to these points. As you note in a few cases, the original proponents of some of these points now work on long-term focused issues.</p>\n<p>I also agree with the comment above that it's important to distinguish between what we call &quot;the long-term value thesis&quot; and the idea that reducing extinction risks is the key priority. You can believe in the long-term value thesis but think there's better ways to help the future than reducing extinction risks, and you can reject the long-term value thesis but still think extinction risk is a top priority.</p>\n", "parentCommentId": "y4EeiiL5nWrcgBNyF", "user": {"username": "Benjamin_Todd"}}, {"_id": "RnRnLZd8hK78mW3LY", "postedAt": "2018-08-05T04:39:36.030Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>See a list of reasons why not to work on reducing extinction risk here: <a href=\"https://80000hours.org/articles/extinction-risk/#who-shouldnt-prioritise-safeguarding-the-future\">https://80000hours.org/articles/extinction-risk/#who-shouldnt-prioritise-safeguarding-the-future</a></p>\n<p>See a list of counterarguments to the long-term value thesis here:\n<a href=\"https://80000hours.org/articles/future-generations/\">https://80000hours.org/articles/future-generations/</a></p>\n<p>There are also further considerations around coordination that we're writing about in an upcoming article.</p>\n", "parentCommentId": "n9EkqzDDB7W7jbCtg", "user": {"username": "Benjamin_Todd"}}, {"_id": "ScoHeoBiQa87yzp5v", "postedAt": "2018-08-05T08:22:27.771Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<blockquote>\n<blockquote>\n<p>I also agree with the comment above that it's important to distinguish between what we call &quot;the long-term value thesis&quot; and the idea that reducing extinction risks is the key priority. You can believe in the long-term value thesis but think there's better ways to help the future than reducing extinction risks, and you can reject the long-term value thesis but still think extinction risk is a top priority.</p>\n</blockquote>\n</blockquote>\n<p>Agreed. Calling reducing X-risks non-near-term-future causes strikes me as using bad terminology.</p>\n", "parentCommentId": "gghAQkw7BfqjNEw7D", "user": {"username": "Denise_Melchin"}}, {"_id": "AJugPzqveMhv6squ6", "postedAt": "2018-08-05T11:35:58.739Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I plan on posting the standalone post later today. This is one of the issues that I will do a better job addressing (as well as stating when an argument applies only to a subset of long term future/existential risk causes). </p>\n", "parentCommentId": "ScoHeoBiQa87yzp5v", "user": {"username": "RandomEA"}}, {"_id": "6Qq5S5vyvgmPsAczK", "postedAt": "2018-08-05T11:53:14.075Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>For 5, the survey (<a href=\"https://arxiv.org/pdf/1705.08807.pdf\">https://arxiv.org/pdf/1705.08807.pdf</a>) sort of ends all discussion about AI timelines. Not that it's necessarily right, just that no one is in a position to second-guess it.</p>\n<p>For another relevant reason to think less about the future, take a look at this. <a href=\"https://web.stanford.edu/~chadj/IdeaPF.pdf\">https://web.stanford.edu/~chadj/IdeaPF.pdf</a> </p>\n<p>For 7, we can learn quite a bit from working on long term causes, and WASR is an example of that: it's stuff that won't be implemented any time soon, but we can gain feedback from the baby steps. The same thing has applied to some AI work.</p>\n<p>Also, it seems to me that the kind of expertise here is highly domain-specific, and the lessons learned in one domain probably won't help elsewhere. I suppose that short term causes let you perform more trials after observing initial results, at least.</p>\n<p>For 8, nontechnical people can work on political issues with long-term implications.</p>\n<p>Lists of 10 are always fishy because the author is usually either stretching them out with poor reasons to make it to 10, or leaving out good reasons to keep it at 10. Try not to get attached to the number :) </p>\n", "parentCommentId": "bExASgPh2wv2nXeGH", "user": {"username": "kbog"}}, {"_id": "suxgDdqC9uytzjZCJ", "postedAt": "2018-08-05T13:18:53.113Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I'd add one more: having to put your resources towards more speculative, chancy causes is more demanding. </p>\n<p>When donating our money and time to something like bednets, the cost is mitigated by the personal satisfaction of knowing that we've (almost certainly) had an impact. When donating to some activity which has only a tiny chance of success (e.g., x-risk mitigation), most of us won't get quite the same level of satisfaction. And that's pretty demanding to have to give up not only a large chunk of your resources but also the satisfaction of having <em>actually</em> achieved something.</p>\n<p>Rob Long has written a bit about this - \n<a href=\"https://experiencemachines.wordpress.com/2018/06/10/demanding-gambles/\">https://experiencemachines.wordpress.com/2018/06/10/demanding-gambles/</a></p>\n", "parentCommentId": "bExASgPh2wv2nXeGH", "user": {"username": "HaydenW"}}, {"_id": "Lxi49NZLdMvnLcas3", "postedAt": "2018-08-05T14:07:23.221Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Thanks for that link, it's an interesting article.  In the context of theory within the animal movement Singer's pragmatism isn't particularly demanding, but a more justice oriented approach is (along the lines of Regan).  In my view it would be a good thing not least for the sake of diversity of viewpoints to make more claims around demandingness rather than largely following a less demanding position.  Though i do think that because people are not used to ascribing significant moral value to other animals then it follows that anything more than the societal level is therefore considered demanding, particularly in regard to considering speciesism alongside other forms of human discrimination.</p>\n", "parentCommentId": "suxgDdqC9uytzjZCJ", "user": {"username": "KevinWatkinson"}}, {"_id": "tyzyX4n56dFvsiAhQ", "postedAt": "2018-08-05T19:54:21.537Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>As a further illustration of the difference with your first point, the idea that the future might be net negative is only reason against reducing extinction risk, but it might be <em>more</em> reason to focus on improving the long-term in general. This is what the s-risk people often think.</p>\n", "parentCommentId": "AJugPzqveMhv6squ6", "user": {"username": "Benjamin_Todd"}}, {"_id": "WTDHpEbPZEWx9yEe4", "postedAt": "2018-08-05T20:53:41.741Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Just wanted to say that I'd be really excited to read more of your thoughts on this. As mentioned above, I think many considerations and counter-considerations against x-risk work deserve more attention and exposure in the community. </p>\n<p>I encourage you to write up your thoughts in the near-term rather than far future! :P</p>\n", "parentCommentId": "XM7tutyF52zXrn6JK", "user": {"username": "james_aung"}}, {"_id": "KbTabM3DniBbzsSAQ", "postedAt": "2018-08-05T21:47:48.006Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<blockquote>\n<p>For 5, the survey (<a href=\"https://arxiv.org/pdf/1705.08807.pdf\">https://arxiv.org/pdf/1705.08807.pdf</a>) sort of ends all discussion about AI timelines. Not that it's necessarily right, just that no one is in a position to second-guess it.</p>\n</blockquote>\n<p>I don't follow what you mean by &quot;ends all discussion.&quot; </p>\n<p>Even if AI development researchers had a consensus opinion about AI timelines (which they don't), one could still disagree with the consensus opinion. </p>\n<p>I suspect AI dev researcher timeline estimates vary a lot depending on whether the survey is conducted during an AI boom or AI winter.</p>\n", "parentCommentId": "6Qq5S5vyvgmPsAczK", "user": {"username": "Milan_Griffes"}}, {"_id": "ejKNbaLTfTHzYLtiY", "postedAt": "2018-08-05T21:52:06.311Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I do agree WASR seems pretty tractable and the near-term learning value is pretty high even if we don't have a good idea of the long-term feasibility yet. I think it's promising, but I could also see it being ruled out as impactful, and I feel like we could have a good answer in a few years.</p>\n<p>I don't have a good sense yet on whether something like AI research has a similar feel. If it did, I'd feel more excited about it.</p>\n", "parentCommentId": "6Qq5S5vyvgmPsAczK", "user": {"username": "Peter_Hurford"}}, {"_id": "Mu3kzdL8PKwvHmEG4", "postedAt": "2018-08-05T23:04:36.455Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Well, you might disagree, but you'd have to consider yourself likely to be a better predictor than most AI experts. </p>\n<p>The lack of consensus doesn't really change the point because we are looking at a probability distribution either way.</p>\n<p>Booms/winters are well known among researchers, they are aware of how it affects the field so I think it's not so easy to figure out if they're being biased or not.</p>\n", "parentCommentId": "KbTabM3DniBbzsSAQ", "user": {"username": "kbog"}}, {"_id": "MYxypxkmWfnDPLnju", "postedAt": "2018-08-06T00:25:42.860Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I think it's important to hold &quot;AI development research&quot; and &quot;AI timeline prediction-making&quot; as two separate skillsets. Expertise in one doesn't necessarily imply expertise in the other (though there's probably some overlap). </p>\n<p>Any good model of the quality of AI dev researcher timeline opinions needs to be able to explain why AI safety was considered a joke by the field for years, and only started to be taken seriously by (some) AI dev researchers after committed advocacy from outsiders.</p>\n", "parentCommentId": "Mu3kzdL8PKwvHmEG4", "user": {"username": "Milan_Griffes"}}, {"_id": "QFEFoFEWXqbdAtPSM", "postedAt": "2018-08-06T00:36:20.539Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<blockquote>\n<p>I think it's important to hold &quot;AI development research&quot; and &quot;AI timeline prediction-making&quot; as two separate skillsets. Expertise in one doesn't necessarily imply expertise in the other (though there's probably some overlap).</p>\n</blockquote>\n<p>OK, that's true. The problem is, it's hard to tell if you are better at predicting timelines. </p>\n<blockquote>\n<p>Any good model of the quality of AI dev researcher timeline opinions needs to be able to explain why AI safety was considered a joke by the field for years, and only started to be taken seriously by (some) AI dev researchers after committed advocacy from outsiders.</p>\n</blockquote>\n<p>I think that's a third issue, not a matter of timeline opinions either.</p>\n", "parentCommentId": "MYxypxkmWfnDPLnju", "user": {"username": "kbog"}}, {"_id": "cmehBPvvWG2Wi7T5k", "postedAt": "2018-08-06T01:09:08.660Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<blockquote>\n<p>I think that's a third issue, not a matter of timeline opinions either.</p>\n</blockquote>\n<p>Seems relevant in that if you surveyed timeline opinions of AI dev researchers 20 years ago, you'd probably get responses ranging from &quot;200 years out&quot; to &quot;AGI? That's apocalyptic hogwash. Now, if you'd excuse me...&quot; </p>\n", "parentCommentId": "QFEFoFEWXqbdAtPSM", "user": {"username": "Milan_Griffes"}}, {"_id": "qXDzQ69oqhBjWkxPG", "postedAt": "2018-08-06T03:12:51.049Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I don't know which premise here is more greatly at odds with the real beliefs of AI researchers - that they didn't worry about AI safety because they didn't think that AGI would be built, or that there has ever been a time when they thought it would take &gt;200 years to do it.</p>\n", "parentCommentId": "cmehBPvvWG2Wi7T5k", "user": {"username": "kbog"}}, {"_id": "2Fr7vrc2h9Ey7Y5PT", "postedAt": "2018-08-06T04:10:52.915Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I'm working on a project to scale up <a href=\"http://effective-altruism.com/ea/1oc/volunteer_opportunities_in_effective_altruism/\">volunteer work opportunities</a> with all kinds of EA organizations. Part of what I wanted to do is develop a system for EA organizations to delegate tasks to volunteers, including writing blog posts. This could help EA orgs like New Incentives get more of their content up on the EA Forum, such as research summaries and progress updates. Do you think orgs would find this valuable. </p>\n", "parentCommentId": "u3ENu8TvmrdFsA6dX", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "TPs4SDdCWFxNeeZE5", "postedAt": "2018-08-06T08:53:16.535Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Agreed. As someone who prioritises <a href=\"http://s-risks.org/faq/\">s-risk reduction</a>, I find it odd that long-termism is sometimes considered equivalent to x-risk reduction. It is legitimate if people think that x-risk reduction is the best way to improve the long-term, but it should be made clear that this is based on additional beliefs about ethics (rejecting suffering-focused views and not being very concerned about value drift), about how likely x-risks in this century are, and about how tractable it is to reduce them, relative to other ways of improving the long-term. I for one think that none of these points is obvious. </p>\n<p>So I feel that there is a representativeness problem between x-risk reduction and other ways of improving the long-term future (not necessarily only s-risk reduction), in addition to an underrepresentation of near-term causes.</p>\n", "parentCommentId": "tyzyX4n56dFvsiAhQ", "user": {"username": "Tobias_Baumann"}}, {"_id": "6yioF9DDqbNr87m3x", "postedAt": "2018-08-06T09:03:38.448Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Why do you think Epicureanism implies a focus on the near term and not a focus on improving the quality of life in the long-term future?</p>\n", "parentCommentId": "bExASgPh2wv2nXeGH", "user": {"username": "Jonas Vollmer"}}, {"_id": "Q4g2o8zeZ6hoKX4fF", "postedAt": "2018-08-06T09:48:35.720Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I'm aware of this and also planning on addressing it. One of the reasons that people associate the long term future with x-risk reduction is that the major EA organizations that have embraced the long term future thesis (80,000 Hours, Open Phil etc.) all consider biosecurity to be important. If your primary focus is on s-risks, you would not put much effort into biorisk reduction. (See <a href=\"http://reducing-suffering.org/altruists-focus-reducing-short-term-far-future-suffering/\">here</a> and <a href=\"http://effective-altruism.com/ea/1k4/cause_prioritization_for_downsidefocused_value/\">here</a>.)</p>\n", "parentCommentId": "tyzyX4n56dFvsiAhQ", "user": {"username": "RandomEA"}}, {"_id": "MWvc7H3dEcFwZPCKJ", "postedAt": "2018-08-06T11:44:30.882Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I actually began to wonder this myself after posting. Specifically, it seems like an Epicurean could think s-risks are the most important cause. Hopefully Michael Plant will be able to answer your question. (Maybe EA Forum 2.0 should include a tagging feature.)</p>\n", "parentCommentId": "6yioF9DDqbNr87m3x", "user": {"username": "RandomEA"}}, {"_id": "iQqoT8YM57KoMMCPJ", "postedAt": "2018-08-06T16:01:42.830Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I'm not sure I see which direction you're coming from. If you're a symmetric person-affector (i.e. reject the procreatve asymmetry, the view we're neutral about creating happy lives but agasinst creating unhappy lives) then you don't think there's value in creating future life, good or bad. So neither x-risks nor s-risks are a concern. </p>\n<p>Maybe you're thinking 'don't those with person-affecting views care about those who are going to exist anyway?' the answer is Yes if you're a necessitarian (No if you're a presentist), but given that what we do changes who comes into existence necessitarianism (holds you value wellbeing of those that exist anyway) collapses, in practice, into presentism (holds you value wellbeing of those that exist right now).</p>\n<p>Vollmer, the view that would be care about the quality of the long-term future, but not whether it happens, seems to be averagism. </p>\n", "parentCommentId": "MWvc7H3dEcFwZPCKJ", "user": {"username": "MichaelPlant"}}, {"_id": "27gEua3ZHuWb4gzSu", "postedAt": "2018-08-06T16:02:58.249Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I liked this solely for the pun. Solid work, James.</p>\n", "parentCommentId": "WTDHpEbPZEWx9yEe4", "user": {"username": "MichaelPlant"}}, {"_id": "xsbN9WrWTRkCqdsYL", "postedAt": "2018-08-06T16:39:59.427Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>A. Does that mean that, under a symmetric person-affecting Epicurean view, it's not bad if a person brings into existence someone who's highly likely to have a life filled with extreme suffering? Do you find this plausible?</p>\n<p>B. Does that also mean that, under a symmetric person-affecting Epicurean view, there's no benefit from allowing a person who is currently enduring extreme suffering to terminate their life? Do you find this plausible?</p>\n<p>C. Let's say a person holds the following views:</p>\n<ol>\n<li><p>It is good to increase the well-being of currently existing people and to decrease the suffering of currently existing people. </p>\n</li>\n<li><p>It is good to increase the well-being of future people who will necessarily exist and to decrease the suffering of future people who will necessarily exist. (I'm using necessarily exist in a broad sense that sets aside the non-identity problem.)</p>\n</li>\n<li><p>It's neither good nor bad to cause a person with a net positive life to come into existence or to cause a currently existing person who would live net positively for the rest of their life to stay alive.</p>\n</li>\n<li><p>It's bad to cause a person who would live a net negative life to come into existence and to cause a currently existing person who would live net negatively for the rest of their life to stay alive.</p>\n</li>\n</ol>\n<p>Does this qualify as an Epicurean view? If not, is there a name for such a view? </p>\n", "parentCommentId": "iQqoT8YM57KoMMCPJ", "user": {"username": "RandomEA"}}, {"_id": "iLmmDsiwbJtXsuQPo", "postedAt": "2018-08-07T04:21:43.774Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I agree the long-term value thesis and the aim of reducing extinction risk often go together, but I think it would be better if we separated them conceptually.</p>\n<p>At 80k we're also concerned that there might be better ways to help the future, which is one reason why we highly prioritise global priorities research.</p>\n", "parentCommentId": "Q4g2o8zeZ6hoKX4fF", "user": {"username": "Benjamin_Todd"}}, {"_id": "vYXBAafE7Fo4fdJD3", "postedAt": "2018-08-07T08:06:56.561Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Right, sorry, I misread. I thought you were assuming some form of Epicureanism with concern for all future beings, not Epicureanism plus a person-affecting view.</p>\n", "parentCommentId": "iQqoT8YM57KoMMCPJ", "user": {"username": "Jonas Vollmer"}}, {"_id": "tzdDtZbpc6ibkgvNS", "postedAt": "2018-08-08T02:37:50.360Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>On the topic of Effective Altruism Global, I'm not just concerned about the lower representation of non-x-risk cause areas, but also the speaker selection for those cause areas. In 2016 as an example, the main animal welfare speaker was a parrot intelligence researcher who seemed, I'm sorry to say this, uninformed about animal welfare, even of birds. I think the animal welfare speakers over the years have been more selected for looking cool to the organizers (who didn't know much about animal welfare) and/or increasing speaker demographic diversity (Not that this is a bad thing, but it's unhelpful to just get diversity in one cause area.), instead of actually having the leading experts on EA and animal welfare.</p>\n", "parentCommentId": "itbX6bSBwgoh7ytA7", "user": {"username": "redmoonsoaring"}}, {"_id": "3hj57EQMgtDFmsDzy", "postedAt": "2018-08-08T05:17:15.715Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I agree that a lot of work on X risk/far future is value of information. But I argued <a href=\"https://link.springer.com/article/10.1007/s13753-016-0097-2\">here</a> that the distributions of cost-effectiveness in the present generation of <a href=\"https://en.wikipedia.org/wiki/Feeding_Everyone_No_Matter_What\">alternative food</a> for agricultural catastrophes did not overlap with AMF. There very well could be flow-through effects from AMF to the far future, but I think it is hard to argue that they would be greater than actually addressing X risk. So I think if you do value the far future, it would be even harder to argue that the distribution of alternate foods and AMF overlap. There would be a similar results for AI vs AMF if you believe the model referred to <a href=\"http://effective-altruism.com/ea/1g9/should_we_be_spending_no_less_on_alternate_foods/\">here</a>.</p>\n", "parentCommentId": "XM7tutyF52zXrn6JK", "user": {"username": "Denkenberger"}}, {"_id": "pzd2CKM7w2CRXb4nw", "postedAt": "2018-08-08T14:44:36.954Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I agree that our selection process for animal-focused speakers in 2015 and 2016 left a lot to be desired. In 2017 we began working with advisors from specific fields to be sure we’re reaching out to speakers with expertise on the topics that conference attendees most want to hear about. This year we’ve expanded to a larger advisory board with the hope that we can continue to improve the EA Global content.</p>\n", "parentCommentId": "tzdDtZbpc6ibkgvNS", "user": {"username": "AmyLabenz"}}, {"_id": "XkLZMr997YD8oCrPz", "postedAt": "2018-08-08T15:09:22.065Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I think what conference attendees most want to hear about but also worth considering what potential attendees would want to hear about.  Personally i would prefer more diversity within the cause area to look at various challenges to conventional EAA whilst focussing more on philosophy and demandingness.  I think in this way people could become somewhat more familiar with the broader cause area rather than in my view a tendency to focus on a fairly narrow group of organisations and individuals.  </p>\n<p>Would it be possible to say who is on the advisory board?</p>\n", "parentCommentId": "pzd2CKM7w2CRXb4nw", "user": {"username": "KevinWatkinson"}}, {"_id": "ba7PeTjLv3a5FYC62", "postedAt": "2018-08-08T19:02:16.454Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>It's certainly possible to generate a cost-effectiveness estimate that doesn't overlap with AMF. I'd just be concerned with how well that estimate holds up to additional rigorous scrutiny. Many such estimates tend to decline dramatically as additional considerations are explored.</p>\n", "parentCommentId": "3hj57EQMgtDFmsDzy", "user": {"username": "Peter_Hurford"}}, {"_id": "5ZtpTYrPdsEKBunoY", "postedAt": "2018-08-08T22:41:49.422Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Hi Kevin,</p>\n<p>Thanks for your comment. To improve the breadth of EAA topics covered at EA Global, I started working with Tyler John as my first advisor in 2017. This year we have an advisory board consisting of ~25 people outside of CEA with expertise in AI, animals, biosecurity, global health &amp; development, horizon scanning (topics that push the frontiers of EA), and meta EA, as well as a “wild card” section for additional suggestions. I’d need to check with the rest of the advisors before sharing their names.</p>\n", "parentCommentId": "XkLZMr997YD8oCrPz", "user": {"username": "AmyLabenz"}}, {"_id": "Ja3zWCSDcZeWRN5pQ", "postedAt": "2018-08-10T15:23:29.937Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Thank you for the explanation. I still believe the 2017 and 2018 animal welfare and global poverty line-ups left a lot to be desired, but those years might have been better than 2016 at least in the choice of keynote speaker.</p>\n<p>Maybe there could be more transparency in regards to the advisory board, because without knowing those details, I don't know how to evaluate the situation. I do feel concern from CEA's history that the advisory board may favor people with close ties to CEA rather than actual meaningful representation from those fields. But I can't be confident in that without knowing the details.</p>\n", "parentCommentId": "pzd2CKM7w2CRXb4nw", "user": {"username": "redmoonsoaring"}}, {"_id": "NQoiiZo3fQWDKnnxY", "postedAt": "2018-08-11T22:45:31.149Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>I think there is an 11th reason why someone may want to work on near-term causes: while we may be replaceable by the next generations when it comes to working on the long-term future, we are irreplaceable when it comes to helping people / sentient beings who are alive today. In other words: influencing what may happen 100 years from now can be done by us, our children, our grand-children and so on; however, only we can help say the 700 million people living in extreme poverty today.</p>\n<p>I have not come across the counter-arguments for this one: has it been discussed on previous posts or related material? Or maybe it is a basic question in moral philosophy 101 and I am just not knowledgeable enough :-)</p>\n", "parentCommentId": "bExASgPh2wv2nXeGH", "user": {"username": "pmelchor"}}, {"_id": "w6tff8su6honZjP8j", "postedAt": "2018-08-12T22:12:06.028Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>The argument is that some things in the relatively near term have lasting effects that cannot be reversed by later generations. For example, if humanity goes extinct as a result of war with weapons of mass destruction this century, before it can become more robust (e.g. by being present on multiple planets, creating lasting peace, etc), then there won't be any future generations to act in our stead (for at least many millions of years for another species to follow in our footsteps, if that happens before the end of the Earth's habitability).</p>\n<p>Likewise, if our civilization was replaced this century by unsafe AI with stable less morally valuable ends, then future generations over millions of years would be controlled by AIs pursuing those same ends.</p>\n<p>This period appears exceptional over the course of all history so far in that we might be able to destroy or permanently worsen the prospects of civilizations as a result of new technologies, but before we have reached a stable technological equilibrium or dispersed through space.</p>\n", "parentCommentId": "NQoiiZo3fQWDKnnxY", "user": {"username": "CarlShulman"}}, {"_id": "rF7JEp6n2nX9YXMCJ", "postedAt": "2018-08-15T14:46:04.366Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Thanks, Carl. I fully agree: if we are convinced it is essential that we act now to counter existential risks, we must definitely do that.</p>\n<p>My question is more theoretical (feel free to not continue the exchange if you find this less interesting). Imagine we lived in a world just like ours but where the development of AI, global pandemics, etc. are just not possible: for whatever reason, those huge risks are just not there. An argument in favour of weighting the long-term future heavily could still be valid (there could be many more people alive in the future and therefore a great potential for either flourishing or suffering). But how should we weight that against the responsibility to help people alive today, since we are the only ones who can do it (future generations will not be able to replace us in that role)?</p>\n", "parentCommentId": "w6tff8su6honZjP8j", "user": {"username": "pmelchor"}}, {"_id": "8FjeyMymm5Zt8EWpj", "postedAt": "2018-08-15T18:03:42.541Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<blockquote>\n<p>Imagine we lived in a world just like ours but where the development of AI, global pandemics, etc. are just not possible: for whatever reason, those huge risks are just not there</p>\n</blockquote>\n<p>If that was the only change our century would still look special with regard to the possibility of lasting changes short of extinction, e.g. as discussed in this posts by <a href=\"https://www.lesswrong.com/posts/5czcpvqZ4RH7orcAa/a-proposed-adjustment-to-the-astronomical-waste-argument\">Nick Beckstead</a>. There is also the astronomical waste argument: delay in interstellar colonization by 1 year means losing out on all the galaxies reachable (before separation by the expansion of the universe) by colonization begun in year n-1 instead of n. The population of our century is vanishingly small compared to future centuries, so the ability of people today to affect the colonized volume is accordingly vastly greater on a per capita basis, and the loss of reachable galaxies to delayed colonization is irreplaceable as such.  </p>\n<p>So we would still be in a very special and irreplaceable position, but less so.</p>\n<p>For our low-population generation to really not be in a special position, especially per capita, it would have to be the case that none of our actions have effects on much more populous futures as a whole. That would be very strange, but if it were true then there wouldn't be any large expected impacts of actions on the welfare of future people.</p>\n<blockquote>\n<p>But how should we weight that against the responsibility to help people alive today, since we are the only ones who can do it (future generations will not be able to replace us in that role)?</p>\n</blockquote>\n<p>I'm not sure I understand the scenario. This sounds like a case where an action to do X makes no difference because future people will do X (and are more numerous and richer). In terms of Singer's drowning child analogy, that would be like a case where many people are trying to save the child and extras don't make the child more likely to be saved, i.e. extra attempts at helping have no counterfactual impact. In that case there's no point in helping (although it may be worth trying if there is enough of a chance that extra help will turn out to be necessary after all).</p>\n<p>So we could consider a case where there are many children in the pond, say 20, and other people are gathered around the pond and will save 10 without your help, but 12 with your help. There are also bystanders who won't help regardless. However, there is also a child on land who needs CPR, and you are the only one who knows how to provide it. If you provide the CPR instead of pulling children from the pond, then 10+1=11 children will be saved instead of 12. I think in that case you should save the two children from drowning instead of the one child with CPR, even though your ability to help with CPR is more unique, since it is less effective.</p>\n<p>Likewise, it seems to me that if we have special reason to help current people at the expense of much greater losses to future generations, it would be because of flow-through effects, or some kind of partiality (like favoring family over strangers), or some other reason to think the result is good (at least by our lights), rather than just that future generations cannot act now (by the same token, billions of people could but don't intervene to save those dying of malaria or suffering in factory farms today).</p>\n", "parentCommentId": "rF7JEp6n2nX9YXMCJ", "user": {"username": "CarlShulman"}}, {"_id": "SbPtbWFAxwee4LJK8", "postedAt": "2018-11-04T11:05:55.456Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Hi Amy, is there any progress in terms of presenting who is on the advisory boards?  Or if people don't want to be named that would be useful information too.</p>\n", "parentCommentId": "5ZtpTYrPdsEKBunoY", "user": {"username": "KevinWatkinson"}}, {"_id": "HLJwPvfgExdhSZFww", "postedAt": "2019-09-08T01:55:54.795Z", "postId": "2qGL7FoTEZTwp38ij", "htmlBody": "<p>Very late reply, but the first parts of 3 and 4 together are the procreation asymmetry, which together lead to antinatalism (it&#x27;s better for individuals not to be born, ignoring other effects) unless you accept sufficiently low risks of bad lives, and adding the second parts of each leads to promortalism (it&#x27;s better for people to die painlessly as soon as possible, ignoring other effects) unless you accept sufficiently low risks of bad lives.</p><p>If you accept 2 (the non-identity problem) and believe adding people with good lives is never good in itself, that leads to antinatalism regardless of uncertainty for any life that isn&#x27;t maximally good, or you need to reject the independence of irrelevant alternatives (or transitivity) as in <a href=\"https://philpapers.org/rec/MEAPVA\">this paper</a>. </p><p>The argument with the independence of irrelevant alternatives is that for any hypothetical individual A without maximal welfare, there is some hypothetical individual B (the same individual or a different individual) with higher welfare, so by 2, it&#x27;s strictly better for B to come to exist than A, but since, by 3, it&#x27;s never good in itself to bring a new individual into existence, then B coming to exist is at best neutral, and since A is strictly worse than B, then (by transitivity and the independence of irrelevant alternatives) A coming to exist is bad in itself, which would contradict the &quot;nor bad&quot; from &quot;It&#x27;s neither good nor bad to cause a person with a net positive life to come into existence&quot;.</p><p>The same argument can be made about existing people with respect to death using 1 and the second part of 3 (and transitivity and the independence of irrelevant alternatives), leading to promortalism.</p><p>That being said, I wouldn&#x27;t guess that it&#x27;s uncommon for those defending person-affecting views to reject the independence of irrelevant alternatives. But if you do accept it, then I think the four statements together are best described as promortalism (if you omit the &quot;nor bad&quot; from 3, otherwise they are inconsistent).</p>", "parentCommentId": "xsbN9WrWTRkCqdsYL", "user": {"username": "MichaelStJules"}}]