[{"_id": "ttbuYqaAhtcNL89kL", "postedAt": "2023-09-26T12:12:38.081Z", "postId": "2qmYZHMMDw3mEbZua", "htmlBody": "<p><strong>Executive summary</strong>: The author argues that far-future government commitments can be enforced through creative mechanisms like issuance of \"enforcement perpetuities\" that incentivize follow-through.</p><p><strong>Key points</strong>:</p><ol><li>Governments can issue financial instruments that cease payouts upon implementation of a delayed policy, creating a large penalty for reneging.</li><li>As an example, \"enforcement perpetuities\" could raise funds to buy out landowners when implementing a future land value tax.</li><li>Constitutional amendments requiring supermajorities to overturn delayed policies are another enforcement mechanism.</li><li>Delayed policies should only be pursued if optimal policies cannot be implemented immediately.</li><li>First attempts at unprecedented solutions often seem \"silly\" despite potential effectiveness.</li><li>The author continues to believe delayed commitments are a promising and underutilized strategy.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "nw5WcEBbQMziJz9vN", "postedAt": "2023-09-26T12:21:28.084Z", "postId": "2qmYZHMMDw3mEbZua", "htmlBody": "<p>Damn, the nicest comment I've ever gotten and it's a bot lol</p>\n<p>Just one point of nuance. Even if the current government issues the asset with the intention of breaking the promise, they lose basically nothing in net present terms (because those cashflows 50 years into the future are discounted by 1+d to the 50th power). I've updated the post to make the point clearer.</p>\n", "parentCommentId": "ttbuYqaAhtcNL89kL", "user": {"username": "FCCC"}}]