[{"_id": "7cfrNiyKeCjDhbXp4", "postedAt": "2018-08-09T17:02:38.691Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Hey, thanks for this :) </p>\n<p>EA Cambridge (UK) has been tracking gender ratios at events for several years now, and we have fairly complete data for the last year. As far as I know, this hasn't yet been written up or shared in any formal way, but that is something I would like to do in the near future. </p>\n<p>On the topic of pub socials, I don't find the gender bias surprising. The pub socials which we started running this year, aimed at non-students and postgrads, were almost always heavily male-dominated. Other types of pub social that we've run, targetted at newcomers, people somewhat engaged, and people deeply engaged in the community respectively, have similarly been male-dominated. At least two women, despite being deeply involved in the EA Cambridge community, have mentioned to me that they do not feel comfortable at pub socials. So while I think there are probably several reasons why fewer women attend socials in general (e.g. to do with women often feeling less comfortable in situations where they're expected to talk on a topic, especially when they're new), pub environments might compound the problem.  </p>\n<p>Very much looking forward to reading the results of your research about what motivates men and women to attend events :) </p>\n", "parentCommentId": null, "user": {"username": "evemccormick"}}, {"_id": "jduTcRQhpWK2prf9T", "postedAt": "2018-08-09T19:03:06.301Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Looking at other social events not at pubs the ratio has been similar, ranging from picnics, hikes, Disney movies, restaurants, education/animal focused topics.</p>\n", "parentCommentId": "7cfrNiyKeCjDhbXp4", "user": {"username": "DavidNash"}}, {"_id": "tMy6hLb5J5ppq9cXp", "postedAt": "2018-08-10T05:18:59.276Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>You show Disney movies at EA meetups!! That is really lovely! </p>\n", "parentCommentId": "jduTcRQhpWK2prf9T", "user": {"username": "cafelow"}}, {"_id": "5k6XRkeKefG3wruBD", "postedAt": "2018-08-10T08:24:21.635Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Thanks a lot for this post, that's really interesting and highly relevant. I'd be curious to see also the proportion of women in online forums such as this one. And of course, I'm super interested in possible reasons behind the tendencies you describe.</p>\n", "parentCommentId": null, "user": {"username": "Dunja"}}, {"_id": "siccsPj6ZNfeqPtrQ", "postedAt": "2018-08-10T13:00:56.730Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>After years of speculation on where in the pipeline the difference is appearing, I'm so happy to see numbers that let us have a more concrete idea of what's going on, at least in this group!</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "4FGLmmkueRMMxFmFq", "postedAt": "2018-08-10T19:33:10.545Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Some questions that come to mind:</p>\n<p>1-- Are women who wish to speak during events given equal (de facto) opportunity to speak? (Of course they are given equal formal opportunity, but as I saw in my postgrad program, group sessions that favour more typically 'masculine' ways of engaging in dialogue-- favouring assertiveness and competitiveness-- would tend to leave the women in my program alienated). \n2-- Could the gender difference in jobs and education and its relation to the sorts of activities EA emphasises play a part? \n3-- Do women feel uncomfortable at events for any other reason? If they did, would it be in such a way that they could or would report it on a survey? \n4-- Would the amount of women in leadership positions alter this? \n5-- Have similar surveys been conducted with people of different races and ethnic backgrounds? </p>\n<p>Cheers </p>\n", "parentCommentId": null, "user": {"username": "KyleYork"}}, {"_id": "MRtc86Epxw9gCmrwi", "postedAt": "2018-08-10T20:25:07.659Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Hi Kyle! A lot of these questions are about how women feel at events--I hope to be able to answer them after I finish working through my focus group data. I can tell you that EA London has two paid staff, one male and one female.</p>\n<p>We haven't used our attendance data to look for patterns in race/ethnicity because it would be more difficult. We can usually make a good guess at someone's gender from their name and appearance, but can't always make a good guess at someone's ethnic background from their name and appearance. We'd have to ask, and asking first-time visitors about their race seemed like a bad idea.</p>\n", "parentCommentId": "4FGLmmkueRMMxFmFq", "user": {"username": "Khorton"}}, {"_id": "ie6vXeMkFdmaxdqNB", "postedAt": "2018-08-10T20:27:44.499Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>There is also some data from Facebook groups that might add context.</p>\n<p>On the EA London group with 1797 members the split is 43.8% women and 54.7% men.</p>\n<p>For the London animal group with 495 members the split is 50.6% women and 46.9% men.</p>\n", "parentCommentId": null, "user": {"username": "DavidNash"}}, {"_id": "DhyS8WHBKAnmpmxKe", "postedAt": "2018-08-10T22:59:48.529Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Interesting data!</p>\n<p>Sounds like churn is much lower with men. Unless it is much more expensive (in terms of advertising etc.) to get new men, which looking at the '1+' row doesn't seem to be the case, or women are more productive, this suggests you have a higher Customer-Lifetime-Value / Customer-Acquisition-Cost ratio with men. If this is the case then, to the extent you can, you should re-allocate your efforts at the relevant margin towards attracting more men.</p>\n<p><a href=\"https://www.klipfolio.com/resources/kpi-examples/saas-metrics/customer-lifetime-value-to-customer-acquisition-ratio\">https://www.klipfolio.com/resources/kpi-examples/saas-metrics/customer-lifetime-value-to-customer-acquisition-ratio</a></p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "fiTfzPpLbrH7eDqKj", "postedAt": "2018-08-10T23:33:17.519Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>It may be a bit short sighted to try and grow in a way that leads to 0.1% of people being interested in effective altruism rather than 5%.</p>\n<p>It seems to be a mistake that both the atheist and skeptic communities have made in the past.</p>\n", "parentCommentId": "DhyS8WHBKAnmpmxKe", "user": {"username": "DavidNash"}}, {"_id": "6XBmEpgGjRP5zGwSG", "postedAt": "2018-08-11T05:45:02.915Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Are women more likely to return for a second event if the gender ratio of the first event they attended was more balanced? This could tell you whether the difference is simply a result of the community being mostly male right now, or if it's due to some other reason(s).</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "spTqxKeLfPvSWLcHG", "postedAt": "2018-08-11T10:10:12.287Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Several previous forum posts have suggested that it's useful to try to have a balance of men and women because:</p>\n<p>-In the longer term, only focusing on white, middle-class men who want to do good using evidence will mean we lose out on a large amount of talent and resources. <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/\">source</a></p>\n<p>-The focus on men might not be reversible: unbalanced events now could put off &quot;highly productive&quot; women, who might continue to view EA unfavourably years later. <a href=\"http://effective-altruism.com/ea/zu/making_ea_groups_more_welcoming/\">source</a></p>\n<p>-Diversity will likely make conversations and viewpoints less predictable and more useful. <a href=\"https://www.benkuhn.net/welcoming\">source</a></p>\n", "parentCommentId": "DhyS8WHBKAnmpmxKe", "user": {"username": "Khorton"}}, {"_id": "c7oW3wujXY4v53tx3", "postedAt": "2018-08-11T18:44:29.405Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<blockquote>\n<p>I'd be curious to see also the proportion of women in online forums such as this one.</p>\n</blockquote>\n<p>We have that in the EA Survey data.</p>\n", "parentCommentId": "5k6XRkeKefG3wruBD", "user": {"username": "Peter_Hurford"}}, {"_id": "PLCzwbpKEvyykQwWW", "postedAt": "2018-08-11T22:10:54.905Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>I'm not sure where to find that - can you link to it or post an extract here? </p>\n", "parentCommentId": "c7oW3wujXY4v53tx3", "user": {"username": "Khorton"}}, {"_id": "QNj4DQG6wKCYqwjBS", "postedAt": "2018-08-13T04:49:43.267Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>As a baseline, the overall population of the survey was 73% male.</p>\n<p>Of those who indicated they were members of the EA Forum, they were 79% male.</p>\n<p>Of those who indicated they were member of a local group, they were 72% male.</p>\n<p>Of those who indicated they were member of the EA Facebook Group, they were 72% male.</p>\n<p>Of those who indicated they were member of GivingWhatWeCan, they were 76% male.</p>\n<p>Of those who indicated they were a user of LessWrong, they were 85% male.</p>\n<p><em>(For simplicity only, these responses drop people who don't indicate they are EA, don't answer either question (gender or membership), and don't pick either &quot;Male&quot; or &quot;Female&quot; as their gender. All answers are rounded to the nearest percent. Also, keep in mind the sampling bias of needing to have seen and filled out the survey in order to be counted - this may mean that we don't correctly reflect an unbiased census of the entire population as a whole.)</em></p>\n", "parentCommentId": "PLCzwbpKEvyykQwWW", "user": {"username": "Peter_Hurford"}}, {"_id": "c2mHfDZhtCo6paEvd", "postedAt": "2018-08-15T08:30:45.701Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Oh damn :-/ I was just gonna ask for the info (been traveling and could reply only now). That's really interesting, is this info published somewhere online? If not, it would maybe be worthwhile to make a post on this here and discuss both the reasons for the predominantly male community, as well as ideas for how to make it more gender-balanced.</p>\n<p>I'd be very interested in possible relations between the lack of gender balance and the topic of representation discussed in another recent thread. For instance, it'd be interesting to see whether non-male EAs find the forum insufficiently focused on causes which they find more important, or largely focused on issues that they do not find as important.</p>\n", "parentCommentId": "QNj4DQG6wKCYqwjBS", "user": {"username": "Dunja"}}, {"_id": "784yubWwqJGkseZ8G", "postedAt": "2018-08-15T17:27:28.755Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>We haven't posted a gender breakdown by group yet. I can see if there may be ways to follow this up as part of our forthcoming 2018 EA Survey work.</p>\n", "parentCommentId": "c2mHfDZhtCo6paEvd", "user": {"username": "Peter_Hurford"}}, {"_id": "sHzrBKWm5mHwcQLpa", "postedAt": "2018-08-15T19:17:16.270Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>That would be great!</p>\n", "parentCommentId": "784yubWwqJGkseZ8G", "user": {"username": "Dunja"}}, {"_id": "q8CJuG6WB8QKi47T7", "postedAt": "2018-10-11T15:04:09.202Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>I looked into this and of the women that came to just 1 event, there was an average of 49% female attendance. Of women who came to 2 or more events, the first event they came to had,  an average of 45% female attendance.</p>\n<p>Also of the women who came to 5 or more events, half of them came to an event with less than 40% female attendance and half of them came to an event with more than 40%.</p>\n", "parentCommentId": "6XBmEpgGjRP5zGwSG", "user": {"username": "DavidNash"}}, {"_id": "dusxifBMz6fxTuyJ9", "postedAt": "2019-02-12T06:27:07.398Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Thanks for taking this question seriously and doing the quant leg work - much appreciated! Just wondering if you / other authors working on this topic have now managed to conduct any qualitative &#x27;exit&#x27; interviews (or at least feedback interviews) whose key reflections have been shared publicly? </p>", "parentCommentId": null, "user": {"username": "LucyW"}}, {"_id": "MddkRhxq6KALtj5c4", "postedAt": "2019-02-12T08:25:27.241Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<html><head></head><body><p>I have done some interviews, actually - the Forum post has just gotten held up by my personal life.</p>\n</body></html>", "parentCommentId": "dusxifBMz6fxTuyJ9", "user": {"username": "Khorton"}}, {"_id": "Nyfd4QnekW6m3eGfa", "postedAt": "2019-03-11T04:33:31.376Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<p>Any follow up here on qualitative reasons why women are less likely to return to EA events?</p>", "parentCommentId": null, "user": {"username": "andrewpei"}}, {"_id": "G4MGMuaa3ToCDXN2N", "postedAt": "2019-03-15T18:48:58.878Z", "postId": "2RfQT7cybfS8zoy43", "htmlBody": "<html><head></head><body><p>I have the follow-up sitting on my computer at home, but for personal reasons I am unable to actually go home and upload it, so it might be another couple of months before I can share it.</p>\n</body></html>", "parentCommentId": "Nyfd4QnekW6m3eGfa", "user": {"username": "Khorton"}}]