[{"_id": "8PWvxRtM37Q7yQYmv", "postedAt": "2023-08-18T11:27:33.463Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Hi! I enjoyed reading this; thanks for writing and posting it!</p><p>I'd make a tentative guess that many (most?) longtermists would totally agree with a ton of the substantive claims in this post — or at least I do — such as:&nbsp;</p><ul><li>Substantive equality, as defined in this post, is the right way to think about equality<ul><li>(Though I'll register that I personally find discussions about equality to often be pretty confusing/unhelpfully framed, when we don't agree on a) what quantities should be equal, b) how they're currently distributed, and c) and what it would look like for them to be equal)</li></ul></li><li>Systemic marginalisation matters, and should be taken very seriously</li><li>The developing world is hugely important when thinking about building a better future (&amp; will become more so over time)</li></ul><p>I think one way we could make discussions about the kinds of issues you've brought up here go better would be to make them more concrete and explicit about the kinds of things we'd like to see more of versus less of.</p><p>Here's my attempt to summarise the 'my claim' section (do you think this seems right?)</p><ol><li>'Systemic issues [such as] weak national institutions and widening inequalities to systemic biases with regards to their race and gender (as well as ableism, cis-heteronormativity, etc.) and...anti-immigration stances...are quite likely to persist into the future if they are not strategically and intentionally addressed.'</li><li>[Just paraphrasing for brevity] Longtermists should think more carefully about what this means for their work.</li><li>'It is not good enough to work only towards ensuring that the longterm future exists...we ought to strive to ensure that those who will live then live sufficiently well.'</li><li>'The currently pursued longtermist interventions by the community are too narrow, almost entirely focused on preventing or mitigating x-risks.'</li></ol><p>I feel like I'd be much better able to figure out whether I agreed with your argument here, if I had a few examples of the kinds of things you'd be interested in seeing longtermists do more of to 'broaden' the interventions we pursue.</p><p>I think some of them I'd really support, and others I'd be less excited about — at least in part because my impression is that lots of methods we know of for fighting inequality are pretty popular with mainstream movements for doing good (so they're less neglected than weirder stuff EAs tend to do).&nbsp;</p><p>Thanks again for your post! :D</p>", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "WmcCnayWcCX5CLNww", "postedAt": "2023-08-18T13:27:39.823Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Hey Nat, thanks for writing up this post (I've been procrastinating on writing a similar sort of post myself) and sharing it :)</p><p>Like Bella, I think many people who'd call themselves longtermists would agree with a lot of it. I've tried to reconstruct this argument from it (paraphrasing as little as I can), but please correct me if I'm wrong:</p><p><strong>1 - </strong>we live in a deeply unequal world and some of the causes of inequality are deeply entrenched into our systems</p><p><strong>2 - </strong>these challenges (most of them systemic) are quite likely to persist into the future if they are not strategically and intentionally addressed</p><p><strong>3 - </strong>an increasing percentage of the world’s population will be born in and live in a world with deeply entrenched systemic issues</p><p><strong>4 - </strong>it is difficult to envision a truly flourishing longterm future for all people while social, political, and economic inequalities persist and become more entrenched</p><p><strong>5 - </strong>currently, longtermism's focus on mitigating x-risks leads it to promote interventions that are too narrow to change these systemic issues</p><p><strong>Conclusion - </strong>Therefore, current longtermism will not guarantee a truly flourishing future</p><p>I think many people in EA would be on the spectrum of sympathetic to in full agreement with you here. So I'd be interesting where your perception of longtermism or longtermists being against or averse to this comes from? I think my counterpoint is that at the moment there isn't a lot of longtermist work out there (compared, say, to discussions on animal welfare or the moral value of philanthropy) as it's a young movement</p><p>And in <i>What We Owe the Future, </i>MacAskill talks a lot about \"Trajectory Changes\", i.e. making the future world better (or not worse) and not just creating more of it. and gives the example of abolitionism as a movement for longtermists to emulate when trying to effective long-term moral change.</p><p>If you want to revisit this post or make it a sequence, I think looking into:</p><ul><li>Examples of what current longtermist interventions and why you think they're narrow</li><li>Examples of specific interventions that should be considered instead (e.g. reforming global institutions such as the World Trade Organisation or UN Security Council?)</li><li>If the current state of the world were to be existential secured - how good would that be? I think, reading between the lines,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref292k3fwntey\"><sup><a href=\"#fn292k3fwntey\">[1]</a></sup></span>&nbsp;you might conclude that the human race lasting into the long-term future in its current form would be morally questionably if not outright bad. Perhaps this might be a crux with some longtermists who view that existence as positive morally, or perhaps think that the future will be morally better than the present 'by default'</li></ul><p>These would be great to read, but no pressure, I really enjoyed this post :)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn292k3fwntey\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref292k3fwntey\">^</a></strong></sup></span><div class=\"footnote-content\"><p>and please correct me if I'm wrong</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "FmBm9htYP3uBPkkvy", "postedAt": "2023-08-19T02:17:08.799Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Thank you for sharing your impressions! Some comments and questions:<br>&nbsp;</p><ol><li>Does <a href=\"https://forum.effectivealtruism.org/posts/CqDzfiLhShqu9CS4F/paper-summary-longtermist-institutional-reform-tyler-m-john\">longtermist institutional reform</a> count as systemic change?<ol><li>Meta-question: What is systemic change? How do you define it?<br><br>I think this a term that has become memetically dominant in the Left and has lost its meaning because it is used far too often and casually. So, now whenever people mention that term, I am not quite sure if I know what they mean by it.</li></ol></li><li>I think one speculative reason why longtermist circles don't discuss concerns like the ones you raise is because of a somewhat prevalent belief that the post-scarcity utopia will happen soon after AGI. In a nutshell: AGI will happen very soon, the creation of AGI will lead to ASI (or AGI+) fairly quickly, and if this whatchamacallit is sufficiently aligned, it will solve all our problems.<br><br>Even if an individual somewhat subscribed to this notion, they may not think about most present concerns as they would all seem trivial. After all, they will soon be \"solved\" in the post-AGI world.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref9wcyakmn425\"><sup><a href=\"#fn9wcyakmn425\">[1]</a></sup></span></li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn9wcyakmn425\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref9wcyakmn425\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I don't think professional longtermist organizations operate on this belief or even entertain it.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "satpathyakash"}}, {"_id": "wsp5iD2krNk8KgWWr", "postedAt": "2023-08-19T07:25:08.349Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>I distance myself from longtermism for the reasons you spell out here, &nbsp;i.e. correcting inequality is not seen as a priority. But I do agree that fixing inequality should be a key priority even by longtermist principles. The longtermists that do not think it is a priority are often not even aware that they hold shaky (in my opinion) assumptions that:</p><ul><li>Inequality does not deprive us of talent to solve presing world problems</li><li>Inequality does not exacerbates the scale and probability of X-Risks and Catastropic-Risks</li><li>Inequality itself is not a significant source of suffering if allowed to perpetuate into the future</li></ul><p>There are other reformulations of longtermism that exist outside of the normal EA community, usually by critics of longtermism. For example:</p><p><a href=\"https://www.carlbeijer.com/p/there-is-no-long-term-without-socialism\">https://www.carlbeijer.com/p/there-is-no-long-term-without-socialism</a> (article is paywalled but if you message me privately, I am happy to share a copy of it I have saved).</p>", "parentCommentId": null, "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "wNvx5pcSomQFpgQMs", "postedAt": "2023-08-19T11:30:23.318Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Just to highlight how I am integrating these issues into my own longtermist work:<br><br>In my work on <a href=\"https://forum.effectivealtruism.org/topics/refuges\">refuges </a>I am keenly aware of how choices made will affect different people and cultures in the long-term. The basic question is: Who would survive an ~extinction-level catastrophe?&nbsp;<br><br>In some conversations I have had and writing I have read, this question has been seen as more of an opportunity than a challenge: We could perhaps to some degree influence the composition of the people inhabiting these refuges to positively lay the foundation for an egalitarian, pluralistic and tolerant future society. In a few conversations I had we even speculated on the need for as many men as women, as the intervention would look a lot cheaper if genetic diversity could be solved by access to reproductive facilities including a cryobank. What would that do to gender relations in the subsequent, post-catastrophe society?</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "QtxNiwSycygsakssg", "postedAt": "2023-08-23T07:00:45.530Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Hi akash,</p><p>Thanks for the comment!</p><p>I define systemic change plainly (not as a technical term) i.e. as change that would affect an entire system or a fundamental part of it. In which case I would consider longtermist institutional reform and some work under animal welfare as pursuing systemic change. Your second point feeds into one of my key concerns which is that the absence of work around systemic change being explored under longtermism could be intentional for such reasons even though these reasons might not be formally acknowledged. I certainly think that such an assumption would be inaccurate.</p>", "parentCommentId": "FmBm9htYP3uBPkkvy", "user": {"username": "NatKiilu"}}, {"_id": "icRLFu9j9JemsmobS", "postedAt": "2023-08-23T07:01:10.451Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Hi Mohammad,</p><p>Thanks for your comment which I find expounds on my train of thought fairly accurately!</p>", "parentCommentId": "wsp5iD2krNk8KgWWr", "user": {"username": "NatKiilu"}}, {"_id": "e9zqPEtivTPtXtKcp", "postedAt": "2023-08-23T07:02:06.099Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Hi JWS,</p><p>I am glad to hear there are others grappling with these questions too, and I would really like to see your take on this, as I’m sure there are certain things about which you have thought more deeply or differently. Your summary is pretty accurate, and because your question is similar to Bella's, I tried to respond more fully there. However, if I missed anything, I'd love to continue the conversation!</p><p>I do agree with your ‘reading between the lines’ conclusion of my post that a long-term future where these injustices and inequalities persist or worsen is morally questionable. I still think that there’s value in such a future, as at least then there would be a chance to improve things (although I worry that as these problems become more and more entrenched, the chances of things changing for the better decrease).</p><p>Thanks for the suggestions, I’ll start looking into them</p>", "parentCommentId": "WmcCnayWcCX5CLNww", "user": {"username": "NatKiilu"}}, {"_id": "Rpe2LnvKyKStoFEWE", "postedAt": "2023-08-23T07:02:27.917Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>This sounds quite interesting, I’d like to learn more about this kind of work! Thanks for sharing.</p>", "parentCommentId": "wNvx5pcSomQFpgQMs", "user": {"username": "NatKiilu"}}, {"_id": "32WRbFbhptmkwbAAq", "postedAt": "2023-08-23T07:02:54.345Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Hi Bella,&nbsp;</p><p>I’m glad to hear that, and thanks for your comment, it’s been very helpful!</p><p>I think your summary is pretty accurate, although I think I ought to clarify my position on things we’d like to see more of than less of. I really make no claims about what I want to see less of. For example, I don’t think that the work being done on x-risks is overemphasised; rather, I am making the argument that we can begin to tackle more problems as longtermists given their huge potential benefits in the far future.</p><p><i>A bit of a warning:&nbsp;</i>I haven’t spent as much time thinking about the solution space but intend to do more of this going forward, so take my responses as preliminary thoughts.</p><p>When writing this post, I did think that most of these claims seemed reasonable enough, but I worried that I could be missing a crucial fact that would show these views as not fitting into the longtermist philosophy or practise, e.g., an informal consensus on longtermism being solely focused on ensuring that future people exist. This was also a concern because, other than passing mentions of good value lock-in and trajectory changes in literature, I haven’t seen examples of work pursued for these reasons.</p><p>Regardless, I think that theoretically, longtermism could espouse these views. However, my reflections really come from the actual work being done in the longtermist space, which I can call here longtermism in practise (I refer here to the kinds of work I see being supported by longtermist organisations). My solution space at the moment is quite significantly influenced by the ideas put forward by <a href=\"https://academic.oup.com/book/32430/chapter-abstract/268752370?redirectedFrom=fulltext\">Iason Gabriel and Brian McElwee</a> when discussing the missing middle problem. In brief, they attempt to show that EA (in the general sense as to include Longtermism) tends to focus on low-value/high-confidence low-impact interventions (picking the low hanging fruits) such as vaccinations on the one hand and high-value/low-confidence (x-risk and GCR work) on the other hand. They point out that interventions in the medium-value/medium-confidence band could potentially help us tackle more problems, including ones that would contribute to systemic change. Some examples of this work would include the <a href=\"https://www.openphilanthropy.org/focus/immigration-policy/\">immigration policy</a> and <a href=\"https://www.openphilanthropy.org/focus/criminal-justice-reform/\">criminal justice reform</a> work supported by Open Phil which seem to be the only interventions pursued in EA under this band (although perhaps some animal welfare work could fall here). Such interventions, I argue, should be more actively sought out and funded by longtermists because of their potential impact on not only improving the lives of current or near-future generations but also setting a positive trajectory for their descendants. I think that the availability of funding for such medium-value/medium-confidence interventions (for example, in tackling poverty or racial and gender inequality, etc.) would incentivize the best minds to explore these issues more and provide more robust proposals for interventions. I also think this is where my call to make it easier to make a case for certain interventions tackling systemic problems would apply to both EA and Longtermism recognising that work here will necessarily have numerous benefits for current generations but is keenly focused on the long view, where it will have the highest returns.</p><p>On your last concern, I acknowledge that for many of the problems I specifically highlighted, there is a high chance that most of their most promising interventions are not neglected at all, which is part of the reason I think we might gain more if we review the methodology we use as well. Without seriously considering this particular point, I think that the importance of these interventions (how many lives they may potentially positively affect and for how long) could be argued in place of the emphasis on neglectedness. There might also be other interventions in these areas that may have high returns but are less popularised or explored. Regardless of the robustness of my rough suggestions here, I think encouraging more work here makes it easier to hear of and support more (and better quality) proposed interventions on these issues.</p>", "parentCommentId": "8PWvxRtM37Q7yQYmv", "user": {"username": "NatKiilu"}}, {"_id": "bWeRgqvBMrefQJYXe", "postedAt": "2023-08-23T08:22:22.404Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>Thanks for your thoughtful comment, &amp; thanks for providing some more explicit/concrete examples of the kind of thing you'd like to see more of — that was really helpful!</p>\n<p>(And I hadn't read that article you linked before, or thought about the \"missing middle\" as a frame — thanks!)</p>\n<p>I think I'm now more confident that I disagree with the argument you've laid out here.</p>\n<p>The main reason is that I disagree with your claim that we'd be able to do more good by reviewing our methodology &amp; de-emphasising neglectedness.</p>\n<p>I basically just think neglectedness is really important for what I'm trying to do when I'm trying to do good.</p>\n<p>I think there are really compelling arguments for working on e.g. immigration policy and criminal justice reform, that are going to appeal to a much broader audience than the one on this Forum. You don't need to be, like, a 'moral weirdo' to think that it's unnacceptable that we keep humans in near-indefinite imprisonment for the crime of being born in the wrong country.</p>\n<p>And I think the core strength of EA is that we've got a bunch of 'moral weirdos,' who are interested in looking at ways of doing good for which there <em>aren't</em> clear, emotionally compelling arguments, or that don't seem good at first. E.g. when improving education, everyone thinks it seems good to provide teachers and textbooks, but fewer people think of removing intestinal parasites. [1]</p>\n<p>I recognise this isn't anywhere close to a watertight defence of the current main focus of longtermists versus the other kinds of interventions you highlighted, but I think it's the core thing driving why I don't currently buy the argument you laid out here :)</p>\n<p>[1] putting aside for one second the arguments about whether this actually works, lol! Was just the first example that came to mind of something deeply \"unsexy\" that EAs talk about.</p>\n", "parentCommentId": "32WRbFbhptmkwbAAq", "user": {"username": "Bella_Forristal"}}, {"_id": "6NBA276cwaKMtPYEA", "postedAt": "2023-08-31T12:02:53.879Z", "postId": "2rRsjdrL9BEWC3d7C", "htmlBody": "<p>I see what you mean and figured that the neglectedness consideration will be a significant block to my argument within the EA/Longtermist framework but (my current inability to provide a methodological appraisal notwithstanding) &nbsp;I still find myself hesitant to accept that we should not delve into these issues (given what is at stake that is, the quality of lives of potentially billions of future beings). I also reckon that part of the work under good value lock-in will inevitably involve working on many systemic problems even if the difference will lie in the approach we take. Ultimately though my argument is hinged on whether we should as a community find it acceptable to ignore these issues while proclaiming we want to do the most good we can (and for the most number of people). I concede that these are indeed very hard problems to solve as seen by the several players who have been trying to solve them but this community has some of the smartest and most innovative minds, I think the challenge might be one worth taking up.</p>", "parentCommentId": "bWeRgqvBMrefQJYXe", "user": {"username": "NatKiilu"}}]