[{"_id": "puLTESi2LnsQMqaCK", "postedAt": "2023-08-15T19:32:49.030Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>Have you considered polishing this for publication in a peer-reviewed academic journal? It is a very interesting case you make, and I think it would be valuable to make it citeable in academic publications.</p>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "nRgXr337svvssdHmg", "postedAt": "2023-08-15T20:09:24.846Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>Hey! Thanks for stopping by. I am very open to this idea, and would be thankful if you could point me to a journal that would publish such a paper. Thanks again. :)</p>", "parentCommentId": "puLTESi2LnsQMqaCK", "user": {"username": "Zayn."}}, {"_id": "toAageP7NxHviT8BC", "postedAt": "2023-08-15T22:15:42.072Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>Really good piece, kudos!</p>\n<p>The bit you may add probably in a subsequent write up is that Islam's concept of a day of judgment where humans will account for their actions on this earth supplemented by its teachings of focusing on working towards success in the afterlife is the ultimate and best example of longtermism.</p>\n<p>The benefit of having a longtermism mindset may not benefit the individual who practices it since the fruits of practice may be seen years or even generations later whereas there is a direct benefit for the individual who practices longtermism based on Islamic belief system as the said individual will see the benefits of his actions on judgement day and such actions will inevitably lead him to eternal bliss or torture.</p>\n<p>\"Islamic longtermism\", if I may term it that way is superior to the longtermism concept coined by MacAskill and his likes since it addresses in a more effective and practical way various problems that longtermism attempts to deal with.</p>\n<p>To finish off, I am firmly of the view that longtermism is definitely enshrined within the Islamic tradition (as you have aptly proven) and if anything, the said principle when looked at through the Islamic lens gives it more meaning and significance compared to when looked at independently from the Islamic faith.</p>\n", "parentCommentId": null, "user": {"username": "Truth seeker"}}, {"_id": "v7ivqDao9rxkRRd4y", "postedAt": "2023-08-16T09:44:48.994Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>Hi!</p>\n<p>Thank you for your comment. I appreciate your input. For this study, the scope was limited since it's just a beginning. Perhaps for future studies, I could make other claims. The claim you suggest, though, in my view, is unfeasible.</p>\n<p>Thank you. :)</p>\n", "parentCommentId": "toAageP7NxHviT8BC", "user": {"username": "Zayn."}}, {"_id": "YCqcu2KeToDEHij5L", "postedAt": "2023-08-16T19:59:19.210Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>Correct me if I'm way off the mark, but something like an I see lslamic theology journal or book could be an option, especially as the kind of readers for that could be the ones most likely to appreciate it and make high impact changes.</p>\n<p>Perhaps something like this in the Oxford university of Islamic studies. <a href=\"https://academic.oup.com/jis/pages/General_Instructions\">https://academic.oup.com/jis/pages/General_Instructions</a></p>\n", "parentCommentId": "puLTESi2LnsQMqaCK", "user": {"username": "NickLaing"}}, {"_id": "nibyETBycQxmdM7yx", "postedAt": "2023-08-16T20:10:43.050Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>Hi!&nbsp;</p><p>I'll be sure to look into that. Thank you.&nbsp;</p>", "parentCommentId": "YCqcu2KeToDEHij5L", "user": {"username": "Zayn."}}, {"_id": "TpuRuYYshcNHG38Wz", "postedAt": "2023-08-17T17:34:27.437Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>It depends on what the final version looks like. Nick Laing makes some good suggestions; I could also see this go to e.g. a philosophy journal, given longtermism and intercultural philosophy are both topics that are currently popular in philosophy. Doing so would require a somewhat less EA-ish framing, and going away from the pragmatic \"how do we make people\" longtermist framing. Instead, it would require careful exposition of Longtermism, then exegetical work on how Muslim sources seem to accord or not accord with it. Most of this latter work is already quite well done in this post.</p><p>If you want to follow up on this, feel free to shoot me a message.</p>", "parentCommentId": "nRgXr337svvssdHmg", "user": {"username": "mhendric"}}, {"_id": "qveGvKeb2Ci5ofS7t", "postedAt": "2023-08-18T19:13:02.069Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<p>Thank you so much. I will reach out to you for further guidance soon.&nbsp;</p><p>Thanks again.&nbsp;</p>", "parentCommentId": "TpuRuYYshcNHG38Wz", "user": {"username": "Zayn."}}, {"_id": "xAYFZpw9bMspDxtH8", "postedAt": "2023-08-25T13:40:25.704Z", "postId": "2sgSwwTe4mG4uP36e", "htmlBody": "<blockquote><p>Hillary Greaves and MacAskill have postulated that that decision making in EA must be premised on two factors: (a) every option that is near-best overall is near-best for the far future; and (b) every option that is near-best overall presents significantly more benefits to far future people, than it does to near future people.<sup><u>[26]</u></sup></p></blockquote><p>&nbsp;</p><p>Point of information: I don't think that they've said that<strong> all decision making in EA </strong>should be based on axiological or deontic strong longtermism, which is specifically what that paper is about.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Kaleem"}}]