[{"_id": "Q25n4zav3zYrTThYu", "postedAt": "2022-12-14T06:22:32.189Z", "postId": "2tYdLAtgyrvN2eCHN", "htmlBody": "<p>I worry that this post is claiming that EAs are uncommonly likely to recommend rules violations in order to achieve their goals (ie, ends justify the means). I don't think that's true, and I generally see EAs as trying very hard to be scrupulous and do right by all involved parties.<br><br>Concretely, I believe that if you went to an EA conference or a similar gathering and presented people with prisoners dilemma issues, or just lost wallets, they would behave more pro-socially than average for the country.<br><br>I think that the FTX collapse is a very salient example of EA folks committing crime (perhaps in the belief that the ends justified it?), but that doesn't mean that EA increases the probability of crime.</p>", "parentCommentId": null, "user": {"username": "dan.pandori"}}, {"_id": "x6bmcc9N4rz6qEACw", "postedAt": "2022-12-14T08:21:04.025Z", "postId": "2tYdLAtgyrvN2eCHN", "htmlBody": "<p>\"Samuel Bankman-Fried committed wire fraud and conspiracy against innocent people in order to raise money for philanthropic and political causes\"<br><br>I wish people would stop saying this as if it were true -- this idea that Sam's primary motivation was all about raising money for EA or 'the greater good' more broadly. As Eliezer pointed out, \"<a href=\"https://forum.effectivealtruism.org/posts/SP3Hkas3jo6i2cmqb/who-s-at-fault-for-ftx-s-wrongdoing\">The amount that FTX spent on e-sports naming rights for TSM was greater than everything they donated to effective altruism</a>\", to give just one example of a decidedly non-philanthropic-or-political cause that he apparently spent tons of money on. The fact that SBF was an EA fanboy just isn't enough to give very much weight to the claim \"if mainstream American government agencies and philanthropists had given higher priority to important/neglected/tractable cause areas then Bankman-Fried might not have engaged in wire fraud\", at all.<br><br>\"So a strong belief in longtermism doesn't inherently give rise to rulebreaking... it's simply the sharp disparity in values between longtermists and everybody else. \"<br><br>This assumption of an association between longtermism and rulebreaking is something we should be pushing back on, unless there is strong evidence for it. We shouldn't be accepting the assumption as true and then trying to explain it post-hoc.</p>", "parentCommentId": null, "user": {"username": "illative"}}, {"_id": "ceH4hDvs5hgjuKqys", "postedAt": "2022-12-14T08:27:58.887Z", "postId": "2tYdLAtgyrvN2eCHN", "htmlBody": "<p>Thank you for the important clarification regarding FTX.</p><p>I still think the idea of longtermism -&gt; rulebreaking is something philosophically meaningful that merits my response even if FTX does not serve as a true example.</p>", "parentCommentId": "x6bmcc9N4rz6qEACw", "user": {"username": "kbog"}}]