[{"_id": "q3LoKHPWdSEJjawHt", "postedAt": "2014-10-17T15:17:02.997Z", "postId": "2X9rBEBwxBwxAo9Sd", "htmlBody": "<p>The first 5 paragraphs are repeated twice. Could someone fix this?</p>\n", "parentCommentId": null, "user": {"username": "DavidBernard"}}, {"_id": "u3zzkEuCiRZzMS4wG", "postedAt": "2014-10-20T16:34:45.491Z", "postId": "2X9rBEBwxBwxAo9Sd", "htmlBody": "<p>We must educate public and politicians and promote policies of human services decisions based on optimizing cost-effectiveness for total benefit of human population.  Foe example, dogs for blind people can be trained in other countries at a fraction what it costs in America.</p>\n", "parentCommentId": null, "user": {"username": "Ilya"}}, {"_id": "yxKrbRvo4tgap7oJb", "postedAt": "2015-04-20T12:32:13.644Z", "postId": "2X9rBEBwxBwxAo9Sd", "htmlBody": "<p>I enthusiastically agree with most of your ideas. This is a very insightful text. However, I partially disagree with your paragraph on Cost Benefit Analysis (&quot;Another reason people might be initially suspicious of prioritisation based on cost-effectiveness is through confusing it with cost-benefit analysis (CBA). [...] the wealthy are willing to pay more for a given benefit.&quot;).\nWillingness-to-pay is a measure of subjective value relative to the marginal utility of money. Indeed, &quot;the wealthy are willing to pay more for a given benefit&quot;, because marginal private consumption provides less utility to a rich person than to a poor one. Therefore, to use CBA in a more ethically acceptable fashion, one would need to adjust benefits (measured in dollars) according to marginal utility of income of people receiving those benefits.\nEven though that practice is still relatively rare, it is already mentioned by British and French guidelines on economic appraisal. I don't know much about how CBA is done in the US, but anyway accounting for the diminishing value of the extra dollar is <em>not</em> an intrinsic limitation of economic appraisal techniques. Those techniques do have some other drawbacks. On the other hand, they can also overcome some limitations of Cost Effectiveness Analysis. But that is outside the scope of this comment.</p>\n", "parentCommentId": null, "user": {"username": "vitorm"}}, {"_id": "ozi5eqdgGnrKmuwrQ", "postedAt": "2023-02-10T21:52:58.905Z", "postId": "2X9rBEBwxBwxAo9Sd", "htmlBody": "<p>Okay.</p>\n", "parentCommentId": null, "user": {"username": "Annette Nakakande"}}, {"_id": "nNtChxXxJ9s2Ldusd", "postedAt": "2023-03-17T16:37:14.825Z", "postId": "2X9rBEBwxBwxAo9Sd", "htmlBody": "<p>Does it make sense for me to point out the typos here so that they can be fixed? I believe such important texts convey their message better when written without typos. Let me know if there is a better place for me to point them out.</p><p>#1: &nbsp;\"compare the values any two health benefits\".</p><p>#2: \"which given rise to a number of subtly different versions\"</p><p>#3: \"is estimated to be 1,400 times as cost-effectiveness as the least good\"</p><p>#4: \"per year before eradication.8\"</p><p>#5: \"costeffectiveness\" and \"costeffective\" appear around 5 times in the text in total</p>", "parentCommentId": null, "user": {"username": "Diego Oliveira"}}, {"_id": "ekWfyd7GpEdDBQ32T", "postedAt": "2023-03-17T20:38:21.729Z", "postId": "2X9rBEBwxBwxAo9Sd", "htmlBody": "<p>Hi, thanks for flagging these. I've made the necessary changes. Let me know if you need anything else.&nbsp;</p>", "parentCommentId": "nNtChxXxJ9s2Ldusd", "user": {"username": "Forum assistant"}}, {"_id": "PJvvb8xWhqN3QS5wx", "postedAt": "2022-09-16T04:11:15.831Z", "postId": "2X9rBEBwxBwxAo9Sd", "htmlBody": null, "parentCommentId": "u3zzkEuCiRZzMS4wG", "user": null}]