[{"_id": "qXck6xuTgJwoCR9f9", "postedAt": "2023-07-14T08:08:53.147Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>Love it good points! I'm also surprised there isn't really an EA presence on social media - apart from the twitter storms which may or may not be net positive. Rationalist animations is the closest I can think of for positive content on the internet which has some serious reach.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "sJ7PgFu5CWsdn5EbJ", "postedAt": "2023-07-14T10:46:41.530Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>I believe CEA's general lack of engagement with social media (and with some traditional media) was a deliberate choice of not wanting EA to grow too quickly, and because of concerns about the 'fidelity' of ideas. See e.g. <a href=\"https://www.centreforeffectivealtruism.org/blog/the-fidelity-model-of-spreading-ideas\">this CEA blog post</a>. There has been some previous discussion of this on the Forum, e.g. <a href=\"https://forum.effectivealtruism.org/posts/PsztRbQnuMmpgSrRc/why-we-re-getting-the-fidelity-model-wrong\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/q2M9DDoogZGTJjQbg/revisiting-ea-s-media-policy\">here</a>.</p><p>I don't know if this is still their approach, or will be once they have a new Executive Director in place.</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "M4bsf8aySxkhvuaaT", "postedAt": "2023-07-14T13:01:10.821Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>I'm sympathetic to this, but so people don't think this will be trivial, note the 80k Podcast did produce some video episodes, and 60 extracts that went out <a href=\"https://www.youtube.com/@eightythousandhours/videos\">on YouTube</a> and Twitter and I think some other places. They got only a middling level of engagement and it didn't go up much over time.</p>\n<p>Some nearby podcasts have made video episodes and had a lot of success (e.g .The Lunar Society), while others it doesn't seem like it has become a major way people consume the content (e.g. FLI, EconTalk).</p>\n<p>So whether this is a high priority seems to depend on whether you can succeed at the content marketing aspect.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "TcT9cF36MtDu3THAw", "postedAt": "2023-07-14T13:19:57.360Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>Thanks for this. I agree that we’ve been neglecting social media; the main reason for this as far as I can tell is that no one at CEA was primarily focused on comms/marketing until I was hired in September; then other events proved to be attention-stealing.</p>\n<p>Social media is going to be a major part of the communications strategy I outlined here; I expect you'll see us being more active in the coming months.\n<a href=\"https://forum.effectivealtruism.org/posts/mFGZtPKTjqrfeHHsH/how-cea-s-communications-team-is-thinking-about-ea\">https://forum.effectivealtruism.org/posts/mFGZtPKTjqrfeHHsH/how-cea-s-communications-team-is-thinking-about-ea</a></p>\n", "parentCommentId": null, "user": {"username": "Shakeel Hashim"}}, {"_id": "C8xKyHXaNbGsy2Mgz", "postedAt": "2023-07-14T15:02:35.552Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>Thank you so much for the response! I look forward to seeing the upcoming changes. There’s so many potential opportunities and avenues of growth, it’s exciting to think about!</p>\n", "parentCommentId": "TcT9cF36MtDu3THAw", "user": {"username": "Andie Rodriguez"}}, {"_id": "trBTPzTcJDc9pzQKe", "postedAt": "2023-07-14T15:05:48.603Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>Thank you for informing me on the video episodes! Personally, I definitely think EA can successfully market these videos by properly editing and taking a clip approach. If others have done it with great results, I think we have the potential to succeed via this route as well!</p>\n", "parentCommentId": "M4bsf8aySxkhvuaaT", "user": {"username": "Andie Rodriguez"}}, {"_id": "xgb6evjXQhcjAvzcH", "postedAt": "2023-07-14T21:38:32.743Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>Andie - thanks for an excellent, well-researched, and persuasive post. I agree with all your suggestions.</p><p>I suspect that there are a few reasons for EA not being savvier or more effective about outreach on the social platforms favored by Gen Z (e.g. YouTube, Instagram, TikTok).&nbsp;</p><p>First, I think there may be a view among many EA leaders that 'serious ideas' are conveyed through written text (e.g. EA Forum &amp; LessWrong posts; peer-reviewed academic publications, books), or podcast interviews (eg. 80k Hours), or maybe sometimes Twitter. There's often a disdain (which I admittedly share) for the video-heavy 'influencer' culture of YouTube, Instagram, and TikTok. But, I think you're right that these platforms are where the young people are, and we might as well reach them there. This doesn't require us to adopt the more superficial, eye-candy, status-seeking narcissism of many Instagram influencers. We can use these platforms however we want, and build the audience we want to attract. All of the key ideas in EA could be conveyed effectively through 'video shorts' of the kind that are <i>extremely</i> popular on social media at the moment. We just need good 'spokespeople' who are comfortable and skilled at communicating through this medium.</p><p>Second, I think there's an assumption among some older EAs (also admittedly including me) that only stupid and superficial people spend huge amounts of time on YouTube, Instagram, and TikTok -- and that EA doesn't want to recruit stupid and superficial people. Certainly <i>most</i> of the content on these platforms may seem dumb and vacuous by EA standards. But, as you point out, the vast majority of Gen Z spends a lot of time on these platforms -- and that probably includes plenty of the smartest, most open-minded, and most ethically serious young people. My hunch is that the average IQ of Twitter users might be little higher than that of TikTok users -- but, there are one billion monthly active users on TikTok, and millions of them are plenty smart enough to be good EA recruits.</p><p>We should also think more creatively about social media for global outreach. For example, TikTok is banned in India, since it's seen as a platform for Chinese influence and propaganda; but Instagram, Facebook, and Twitter are quite popular in India (and many educated people in India are English-fluent). Whereas in China, the most popular social media apps are WeChat, Sina Weibo, Youku, and Douban, and the working language is Mandarin, with very little English-language content.</p><p>One additional comment about ageism and social media to recruit mid-career and older adults: just as Millennials in their 30s may feel some disdain for the short-video social media platforms favored by teens and 20-somethings, they may also feel some disdain for the platforms favored by older professionals, such as Facebook (3 billion users) and LinkedIn (1 billion users). I think it's important to build our EA outreach efforts to people over 40, not just people under 25.&nbsp;</p><p>Epistemic status: I'm far more familiar with Twitter (where I have 130k followers) than with other platforms, although I have posted a few videos on my YouTube channel; so, I'm not very familiar with the subcultures on Instagram or TikTok; and my knowledge of social media in other countries (e.g. India, China) is pretty weak.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "qtFDvyPyfKa8ipi9k", "postedAt": "2023-07-14T21:41:01.851Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>Nick - it has been fascinating to see how common and passionate the arguments around AI X risk have become on Twitter these days. It does seem to be a major platform for influencing public opinion -- or at least the views of journalists, academics, AI researchers, policy wonks, regulators, politicians, etc.</p>", "parentCommentId": "qXck6xuTgJwoCR9f9", "user": {"username": "geoffreymiller"}}, {"_id": "CN2B89ocXB5ozoN8G", "postedAt": "2023-07-28T16:11:50.446Z", "postId": "2YfKuWgC2QfTQgPRQ", "htmlBody": "<p>Thanks for writing this! I agree that we should be doing more social media; as Shakeel mentioned, this is a major part of our comms strategy.</p><p>In case you haven't seen it: a few of us did <a href=\"https://forum.effectivealtruism.org/posts/rGNZxAittib4FqjfH/tiktok-dgb-giveaway-results\">an experiment on TikTok last year</a>. I think it was nice, but seemed unlikely to be the best use of my time, and haven't pursued it much.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}]