[{"_id": "ryHaA8qzfWvpEvgFR", "postedAt": "2023-12-06T13:50:31.069Z", "postId": "2YPKiEBYCbRD38ruF", "htmlBody": "<p><strong>Executive summary</strong>: The author analyzes the pros and cons of pursuing a PhD, concluding that it is the optimal path to impact for a minority of people due to the opportunity cost, financial constraints, and mental health challenges.</p><p><strong>Key points</strong>:</p><ol><li>PhDs can provide valuable research skills, credentials, and access to impactful work, but have high opportunity costs of 3-5+ years.</li><li>PhDs typically pay much less than industry jobs requiring similar credentials, limiting finances.</li><li>PhDs are unnecessary for many careers and can scare away employers.</li><li>Lack of PhD structure can negatively impact mental health.</li><li>Signalling benefits mainly come at the end, creating inertia to leave.</li><li>Ensure no better impact opportunities, good supervisor/project fit, and entrepreneurship positioning before pursuing a PhD.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "dZXx9yL2cm67todyB", "postedAt": "2023-12-07T11:10:10.697Z", "postId": "2YPKiEBYCbRD38ruF", "htmlBody": "<p>As much as I love the summaries from the summary bot, I think this one missed the mark. The reason why we talk with people 1 to 1 about whether they should do a PhD is because there is so much nuance and variation depending on personal fit, career goals, industry circumstances, impact goals, etc. This summary does a bad job at conveying these nuances.</p><p>For example, point 2 mentions that doing a PhD limits finances, which is a short-sighted way of putting it, especially considering that over a lifetime, PhDs make back the earnings that they lose over the time that they are doing a PhD, and jobs requiring a PhD are often much more highly paid.</p><p>Point 3 feels pretty blanket-statement-y about scaring away employers when really there is only a minority of employers who are scared away (they probably won't be if you're willing to take the pay that they're offering).</p><p>Point 6 also feels too strongly worded – I don't think you can ever know if there are no better impact opportunities. Also, not everyone wants to go into entrepreneurship so this last consideration wouldn't apply.<br><br>I know this summary is AI-generated but I think a more nuanced and less strongly worded summary could be created.</p>", "parentCommentId": "ryHaA8qzfWvpEvgFR", "user": {"username": "Jessica Wen"}}]