[{"_id": "jo9469MLGdbxvk2ox", "postedAt": "2023-02-21T13:33:32.403Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>I sort of genuinely think I dislike that title if you aren't going to clearly answer the question.</p><p>Should we tell people they are morally obligated to give to charity?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "AvsqgwFpndpvwJ2Zn", "postedAt": "2023-02-21T13:39:12.274Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>That's very fair! I'm not familiar with the norms for EA Forum title posts. What do you think a better title would be?&nbsp;</p>", "parentCommentId": "jo9469MLGdbxvk2ox", "user": {"username": "benleo"}}, {"_id": "qaqXF2C8ZoKfpQoCN", "postedAt": "2023-02-21T13:42:03.399Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>I guess something that summarises your research results. But also I genuinely want your expert view on this.<br><br>Should we? I guess not, right?</p>", "parentCommentId": "AvsqgwFpndpvwJ2Zn", "user": {"username": "nathan"}}, {"_id": "7p2eDAsygn3qmHHvY", "postedAt": "2023-02-21T14:17:31.070Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>In that case, a better title would probably be something like \"Tell people why they should donate, not that they &nbsp;morally obligated to.\"*&nbsp;</p><p>I had a strong prior that telling people they were morally obligated to donate would not have a positive effect and if anything backfire. So I have actually updated a bit in the other direction regarding the backfire effect.&nbsp;</p><p>However, given we have evidence that moral demandingness &nbsp;didn't produce any positive outcomes, I would currently tell people not to use them and instead stick to moral arguments (which may even be underused given how effective they are). &nbsp;</p><p>In saying that, &nbsp;further research is &nbsp;needed, as there isn't much of a literature at the moment.&nbsp;</p><p>&nbsp;</p><p>*Can I change the title?&nbsp;</p>", "parentCommentId": "qaqXF2C8ZoKfpQoCN", "user": {"username": "benleo"}}, {"_id": "KCWtsLspC2i8GNzwE", "postedAt": "2023-02-21T14:22:52.316Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>You can change the title, though I actually think I was being a bit snotty to pull you up on it.</p>\n", "parentCommentId": "7p2eDAsygn3qmHHvY", "user": {"username": "nathan"}}, {"_id": "8JtddekdTxbDMChAr", "postedAt": "2023-02-21T16:28:16.138Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Thanks for this research!</p><p>Do you suspect that there might be correlations between certain personality traits/values (conscientiousness, discipline, etc) and the convincingness of arguments from moral obligation?</p><p>Several people I've met who read The Life You Can Save have told me they were so turned off by the moral obligation arguments that they nearly gave up on it. For me, reading the argument from moral obligation just made the conclusion follow compulsorily.</p><p>I was raised as an Orthodox Jew, and others have speculated that being raised within a demanding religious movement where discipline is prioritized might translate to being more receptive to arguments from moral obligation. Of course, I don't know whether or not this is actually true.</p>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "fbEQjGFsdowgAjbGm", "postedAt": "2023-02-21T17:16:43.835Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>But you don’t want to imply that the morally demanding argument backfired either. Donations <em>were</em> higher in the morally demanding case, no?</p>\n<p>So we should update our beliefs in that direction I think, even if you don’t have statistical power to “rule out” that this difference was due to chance.</p>\n<p>Can you tell us: in a simple bayesian updating model what is the ~ posterior probability that the strong moral demandingness condition performed</p>\n<ul>\n<li>equal or worse than the regular moral argument</li>\n<li>no more than 10% better</li>\n<li>more than 10% better (1- the last thing)</li>\n<li>more than 20% better\n?</li>\n</ul>\n", "parentCommentId": "7p2eDAsygn3qmHHvY", "user": {"username": "david_reinstein"}}, {"_id": "uJsL2czGXQ4vcsaFP", "postedAt": "2023-02-21T18:45:52.929Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>As you only have a limited time on this earth, the most valuable thing you possess is time. &nbsp;So the most valuable thing you can give to someone is your time, devotion and love. Ignoring some one you could help is wrong. &nbsp;</p><p>I can't help thinking that whilst giving money to charity is laudable, &nbsp;and I give when ever I can, it is only a minor thing, and gives an excuse not to do more. Is giving to charity just an excuse to get stinking rich?&nbsp;</p><p>Working for nothing for a charity would be a far superior act of altruism.</p>", "parentCommentId": null, "user": {"username": "Trev Prew"}}, {"_id": "KYSJurqPF3ChxSfXa", "postedAt": "2023-02-21T19:25:50.419Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>You are erroneously centering the cost to the giver instead of the value to the receiver.</p>\n<p>Money enables a charity to obtain the resources it needs, including potentially, the time of someone who can serve its mission and do more good than you could with your time.</p>\n<p>If you are very well-suited to help a charity-perhaps you have special skills it needs or the organization is new and needs help in absence of having funds for staff-giving of your time can be very helpful.</p>\n<p>But money, given the huge variety of capacities that it can enable, is extremely valuable.</p>\n<p>In any case, effective altruism is about centering the effect of one's activity, not the cost to the giver. Dear sacrifice is certainly appreciated, but one should try to leverage it toward achieving a better world.</p>\n", "parentCommentId": "uJsL2czGXQ4vcsaFP", "user": {"username": "Brad West"}}, {"_id": "7w3YoHkzKMx7z5pdX", "postedAt": "2023-02-21T22:36:40.643Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Thank you for the research.</p><p>I do not necessarily disagree with the limitation that the moral argument watered down the demandingness. However, my intuition was that the framing of the \"strong demandingness\" condition was particularly likely to result in the expected backfire effect.</p><p>I think real-life &nbsp;strongly-demanding arguments are much more likely to use the collective \"we\", acknowledge that this is not socially normal, and acknowledge the incongruence of this obligation with intuitions and psychology. I don't think having this more forgiving/nuanced framing shifts it into a weaker demandingness . I appreciate that the study is also likely better as it is, but I think this is a limitation.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Punty"}}, {"_id": "xTBnf7RrAiFhoMRHB", "postedAt": "2023-02-22T12:05:59.574Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Thanks Ariel. That's a great question.&nbsp;</p><p>We checked a number of different correlations cross both studies, including altruistic type, how utilitarian they are, guilt, how manipulated they felt, agreeableness, and a number of demographic characteristics including religion.&nbsp;</p><p>We didn't find anything in our regression analysis that stood out. However, we reported everything in the appendix, which can be accessed in the paper. Alternatively, I can send it to you.&nbsp;</p><p>I guess another question is who is the obligation coming from? In our experiments it was either from us or GWWC. With regards to religion, if it is in scripture or communicated by a religious figure (such as a rabbi or a priest), maybe it holds more weight? Also, the norms regarding giving are different to secular norms.&nbsp;</p><p>&nbsp;</p><p>We didn't measure how convinced they were by the argument (in hindsight we probably should have), but we did ask how obligated they felt and obligations ratings were significantly higher in the Moral Argument treatment than the control. That correlation may be explained by finding the argument more convincing, but we don't have any concrete evidence (from this study) to strongly update our beliefs.&nbsp;</p>", "parentCommentId": "8JtddekdTxbDMChAr", "user": {"username": "benleo"}}, {"_id": "5DkavdrbJj2JmF5wy", "postedAt": "2023-02-22T12:09:13.394Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Thanks Scott, that's a really good point.&nbsp;</p><p>One of the variables we thought about manipulating was \"who is the demand coming from\"? The use of language here \"I\", \"We\" and other expressions could easily make a difference (social norms are usually presented in terms of \"X% of people believe\").</p><p>&nbsp;Unfortunately, we didn't have the budget to test whether how much of a difference (if any) this made. It would definitely be worth following up on if we were able to get the funding.&nbsp;</p>", "parentCommentId": "7w3YoHkzKMx7z5pdX", "user": {"username": "benleo"}}, {"_id": "WaAhmaz2EQsCTJtot", "postedAt": "2023-02-22T12:12:02.242Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>In experiment 1, condition on them donating they actually donated significantly less in the Moral Demandingness condition (but this didn't replicate in E2).&nbsp;</p><p>Can you DM me about the model, I am happy to run that analysis. We ran mean equivalence tests to provide evidence of the bounds of the null result, but I believe what you are suggesting is quite different. &nbsp;</p>", "parentCommentId": "fbEQjGFsdowgAjbGm", "user": {"username": "benleo"}}, {"_id": "eHW2PguTzLeKeNbAG", "postedAt": "2023-02-22T12:12:43.033Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>In experiment 1, condition on them donating they actually donated significantly less in the Moral Demandingness condition (but this didn't replicate in E2).&nbsp;</p><p>Can you DM me about the model, I am happy to run that analysis. We ran mean equivalence tests to provide evidence of the bounds of the null result, but I believe what you are suggesting is quite different. &nbsp;</p>", "parentCommentId": "fbEQjGFsdowgAjbGm", "user": {"username": "benleo"}}, {"_id": "5kec85pCuyu9aaymr", "postedAt": "2023-02-22T14:40:09.987Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>'Conditional on positive' results are less reliable because of the potential for differential selection, but that is still a bit interesting.  (But it could be e.g., 'bigger push to get people to donate means you attract less interested people on average, so they respond with smaller amounts.)</p>\n<p>The equivalence testing is close to what I meant (do you want to expand on/link those), but no, not quite the same.</p>\n<p>Quickly, what I had in mind is a 'Bayesian regression'. You input  a model, priors over all parameters (perhaps 'weakly informative' priors centered at a 0 effect) and you can then compute the posterior belief for these parameters. R's BRMS package is good for this. Then you can report 'what share of the posterior falls into each of the categories I mentioned below'.</p>\n<p>I'll try to follow up on this more specifically, and perhaps share some code.</p>\n", "parentCommentId": "WaAhmaz2EQsCTJtot", "user": {"username": "david_reinstein"}}, {"_id": "5qkJaufDYphe3DiPf", "postedAt": "2023-02-22T14:55:49.851Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Very interesting research, thanks for sharing. I feel like you (at least in this post) don't really get to the crux of the matter. The most important question, when deciding whether or not to tell someone that donating is morally obligatory, is whether it is true that donating is morally obligatory. We shouldn't just be optimizing for the most effective methods of rhetorical manipulation.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "bBL43e2HXbM6ADKxD", "postedAt": "2023-02-22T20:01:05.477Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Thanks David, that would be great! I'll check to see if there is a way to run it on STATA, but if not I can just run it on R.&nbsp;</p>", "parentCommentId": "5kec85pCuyu9aaymr", "user": {"username": "benleo"}}, {"_id": "piyBpyAae5TpwRbRM", "postedAt": "2023-02-23T13:26:49.559Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Hi Ben and Philipp, thanks for sharing your research in the post. I’m interested in how you recruited your study participants?</p>\n", "parentCommentId": null, "user": {"username": "Catherine Fist"}}, {"_id": "KiKNhjdhtTRikzox8", "postedAt": "2023-02-23T14:24:31.916Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Thanks Catherine. We just used the platform Prolific for subject recruitment.</p>", "parentCommentId": "piyBpyAae5TpwRbRM", "user": {"username": "benleo"}}, {"_id": "kBBkDuJw6YrvXsWzs", "postedAt": "2023-02-24T22:19:39.958Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p><a href=\"https://en.wikipedia.org/wiki/Betteridge%27s_law_of_headlines\">Betteridge's law of headlines</a> is an adage that states:&nbsp;</p><h1><strong>Any headline that ends in a question mark can be answered by the word no.</strong></h1><blockquote><p>It is named after Ian Betteridge, a British technology journalist who wrote about it in 2009, although the principle is much older. It is based on the assumption that if the publishers were confident that the answer was yes, they would have presented it as an assertion; by presenting it as a question, they are not accountable for whether it is correct or not. The adage does not apply to questions that are more open-ended than strict yes–no questions.</p></blockquote>", "parentCommentId": null, "user": {"username": "DaveC"}}, {"_id": "xogCrqEd8QQhyRTzQ", "postedAt": "2023-03-26T15:42:26.657Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>This is my intuition as well - the phrasing of the 'strong demandingness' seemed quite jarring compared to the usual language of donation page copy.</p>\n", "parentCommentId": "5DkavdrbJj2JmF5wy", "user": {"username": "jlewars"}}, {"_id": "CTK9XNy6nguP8Jkt5", "postedAt": "2023-03-26T15:45:35.105Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Thanks for posting this.</p>\n<p>Just to check my understand - did the participants actually donate their own money? Or were they asked how many frictional units of money they would theoretically donate?</p>\n", "parentCommentId": null, "user": {"username": "jlewars"}}, {"_id": "qisFTfw2n7xBhYDmG", "postedAt": "2023-03-27T12:39:29.741Z", "postId": "2yrprQuNJpFJKMGWh", "htmlBody": "<p>Participants donated their own money. They received a bonus of £1 and could choose how much of it they wanted to keep or donate.&nbsp;</p>", "parentCommentId": "CTK9XNy6nguP8Jkt5", "user": {"username": "benleo"}}]