[{"_id": "GGWthyLPKJci9jh2Z", "postedAt": "2015-02-25T20:33:54.892Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>This is an exciting idea and I am glad you are seeking to push it. I might be interested in offering funding.</p>\n<p>Am I correct in thinking that:</p>\n<p>(i) Work done for an employer will generally be the employer's to offer rather than the employee's? (Unless there is a contract between the employer and employee stating how ownership of certificates should be divided between them; actually I would love to have something like this in my contract).</p>\n<p>(ii) Charities will generally not be eligible to apply, since it is ambiguous how initial ownership of the certificates should be distributed between the charity and their donors? This could be avoided if the charity explicitly handed over certificates to donors.</p>\n<p>Overall I wonder how much it would be good to start pushing supply side of certificates rather than demand side. Are you in a position to offer certificates for the AI Impacts site? I would certainly think about buying some (of course it would depend on price; this makes me realise that in the current charitable economy people mostly do things they themselves think are particularly valuable, which may mean they set higher prices than donors would).</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "nBRukecYwSTExaG4P", "postedAt": "2015-02-25T20:58:45.784Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>(i) Neither of them could offer the certificates unilaterally unless they had sorted this out in advance, since workers often do jobs in part because of their humanitarian impact. I suspect no one at most EA organizations would be working there for the salary!</p>\n<p>(ii) Yes. (This is very similar to the last point, with similar caveats.)</p>\n<p>I don't think that trading certificates will be worthwhile very often. As you say, people tend to work on things they are particularly optimistic about. So for the moment I mostly expect the buyers and sellers to be disjoint sets.</p>\n", "parentCommentId": "GGWthyLPKJci9jh2Z", "user": {"username": "Paul_Christiano"}}, {"_id": "PxmEcFP9tLbPe4SJt", "postedAt": "2015-02-25T21:56:46.014Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>The example projects link is not working. Thanks!</p>\n", "parentCommentId": null, "user": {"username": "redmoonsoaring"}}, {"_id": "SZiWDDERYgrwShj7i", "postedAt": "2015-02-25T22:06:36.511Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Fixed. Thanks for the heads up.</p>\n", "parentCommentId": "PxmEcFP9tLbPe4SJt", "user": {"username": "Paul_Christiano"}}, {"_id": "B42pqSPvSob9nNMKj", "postedAt": "2015-02-25T23:47:23.833Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Good point on (i). I'd been (somewhat inconsistently) thinking of for-profit ventures.</p>\n<p>I realise that there is an interpretation of impact under which issue (ii) could disappears. Donors have given money to the charity to make use to further their charitable objectives. It's generally fine for charities to do things like fundraising with some of this money. Performing charitable activities and selling the certificates of impact if they think they can make better use of the money would just be another form of fundraising. This is analogous to a company issuing more shares -- although it dilutes the ownership of existing shareholders, it is balanced by the extra value the company now holds.</p>\n<p>Of course you'd also need to resolve the employer/employee issue.</p>\n", "parentCommentId": "nBRukecYwSTExaG4P", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "4BEWowZkbEPZob2j4", "postedAt": "2015-02-26T03:38:33.221Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>When I read <a href=\"http://effective-altruism.com/ea/ak/certificates_of_impact/\">this</a>, I thought, &quot;that's an interesting idea. It's too bad no one will ever try it.&quot; I'm glad to see that I have underestimated you.</p>\n", "parentCommentId": null, "user": {"username": "AlexMennen"}}, {"_id": "vvkzCDsoDmDXmATWq", "postedAt": "2015-02-26T03:42:05.333Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Kudos for putting your money where your mouth is!</p>\n<p>I'm not sure about the precise meaning of &quot;undoing the good done&quot; here.</p>\n<p>For instance, there were multiple points at which single people's actions likely prevented Harvard College Effective Altruism from dying. If I sold you mine, it would seem that I should value it equal to the entire long-term humanitarian consequences of HCEA's output. But if John Sturm sold you his, he should put the same valuation on it, and then you would have overpaid.</p>\n<p>I probably won't sell you any of HCEA--information asymmetry suggests it would be hard for us to agree on a price--but I figure this is probably a pretty common concern.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "vhdvTuCzZo5SYkvNP", "postedAt": "2015-02-26T03:44:13.179Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Also, it seems from the auction structure that people should only apply with things where they feel reasonably confident that your impact assessment will value it higher than theirs. Can you give any guidance about what kinds of things these might be?</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "SfbRRgKSSDv4JGr3d", "postedAt": "2015-02-26T03:54:30.784Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>If you apply and our willingness-to-pay is lower than yours, then we won't buy anything from you. Hopefully this isn't too bad, though you will have lost the time required to submit an application. If you are on the fence you might want to wait until the second round when you see what the prices look like in this round. </p>\n<p>In general, I hope that the prices in earlier rounds will be informative for people deciding whether/what to apply with in follow-up rounds.</p>\n<p>One reason I may be willing to pay more than someone else is that I've used the lowest-hanging opportunities to turn my money into my time, whereas many EA's have tighter budget constraints and so may have cheaper opportunities available.</p>\n", "parentCommentId": "vhdvTuCzZo5SYkvNP", "user": {"username": "Paul_Christiano"}}, {"_id": "bYESwa8gSXamEPLjK", "postedAt": "2015-02-26T04:14:06.303Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>We don't expect to fund any collaborative projects, or projects where the impact of one project is so contingent on a complementary response by specific other people. Does that clear up most of the ambiguity?</p>\n<p>In principle this kind of complementarity happens for most projects to some small extent; in practice I expect we'll be able to focus on impacts that stand on their own. </p>\n<p>Note that if no contributor to HCEA had other <em>particular people</em> in mind, then the undoing interpretation seems fine. We can just look sequentially, and e.g. discount the first contributions based on the probability that the project would fizzle---the total impact should still add up to 1. When things are complementary in the wider world, this seems like the usual case.</p>\n<p>The same problem arises whenever there are returns to scale, and marginal impacts exceed average impacts. This comes up all of the time in the for-profit sector. There the approach is essentially the same: collaborative projects have to allocate profits to the contributors somehow, and we use that rather than marginal impacts in order to determine compensation. At the super-firm level, returns to scale manifest as unpriced externalities; so we use contracts to organize tightly complementary activities, and then we underprovide unpriced externalities.</p>\n", "parentCommentId": "vvkzCDsoDmDXmATWq", "user": {"username": "Paul_Christiano"}}, {"_id": "64B57gbHkA27bnPcT", "postedAt": "2015-02-26T04:29:09.778Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<blockquote>\n<p>This is an exciting idea and I am glad you are seeking to push it. I might be interested in offering funding.</p>\n</blockquote>\n<p>Great! </p>\n<p>It probably makes sense to wait and see how the first one or two rounds go / until some kinks are ironed out. We should talk about it by PM/email.</p>\n", "parentCommentId": "GGWthyLPKJci9jh2Z", "user": {"username": "Paul_Christiano"}}, {"_id": "pXCrYq2fCkmcCXpqS", "postedAt": "2015-02-26T12:08:25.178Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Very interesting project! </p>\n<p>Do you buy certificates on expected good done ex ante or on actual good accomplished? Eg if I previously bought a $1 lottery ticket with an expected value of $2 (&quot;gambling to give&quot;) which didn't win, can I sell that for $2 or not? I can see arguments either way.</p>\n<p>Should I feel reticent about submitting many projects for the information value?</p>\n", "parentCommentId": null, "user": {"username": "William_MacAskill"}}, {"_id": "y3BFg5Sjf4Cq56nn6", "postedAt": "2015-02-26T12:55:08.825Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>This is a very interesting idea!</p>\n<p>I wonder about how the mechanism leads to behaviour-change though. In particular, each prize is relatively small compared to the cost of launching an activity - the expected value of the reward is significantly below start-up costs unless one was planning to basically do that anyhow. This means you might end up just funding the activities that were most effective in the last cycle but which would have happened anyway (which may be fine, they might be most likely to do well in the future with that money).</p>\n<p>An opposite end of the spectrum would be to offer larger chunks that were big enough to motivate people to invest their own resources chasing it. I.e., an EA X-Prize. I think there will be some really cool lessons from varying the size of the award.</p>\n", "parentCommentId": null, "user": {"username": "Sebastian_Farquhar"}}, {"_id": "EEYwiLkPrZa32C9rC", "postedAt": "2015-02-26T13:18:39.245Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Maybe a link to that post should be included at the top of this article.</p>\n", "parentCommentId": "4BEWowZkbEPZob2j4", "user": {"username": "Jonas Vollmer"}}, {"_id": "L4c2WSWRoeF54XBoY", "postedAt": "2015-02-26T16:04:01.890Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Will you make prices and projects public after the first round so that we can calibrate?</p>\n", "parentCommentId": null, "user": {"username": "Niel_Bowerman"}}, {"_id": "FfXEzDpbsRJ7Hfkn4", "postedAt": "2015-02-26T17:01:34.407Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Definitely.</p>\n", "parentCommentId": "L4c2WSWRoeF54XBoY", "user": {"username": "Paul_Christiano"}}, {"_id": "bqQLPsx4uCJ27uerb", "postedAt": "2015-02-26T22:51:30.387Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>minor: this would look more professional if you changed the font to match the normal font. Its different here and looks weird.</p>\n", "parentCommentId": null, "user": {"username": "John_Salvatier"}}, {"_id": "fnhkugfRGx7WdtTn8", "postedAt": "2015-02-26T23:03:01.912Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Yep, a blessing and curse of the LessWrong and EA Forum article software is that it gives you a lot of freedom to edit html formatting and preserves the formatting of pasted text:\n<a href=\"http://www.effective-altruism.com/ea/8g/how_to_make_your_article_have_consistent/\">How to make your article have consistent formatting</a></p>\n", "parentCommentId": "bqQLPsx4uCJ27uerb", "user": {"username": "RyanCarey"}}, {"_id": "mpL3SXMtZf7MsXWXB", "postedAt": "2015-02-27T22:19:49.831Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>We'll pay based on our current best estimate for how much good the project will accomplish. So the certificate for a donated lottery ticket is not worth anything after the drawing.</p>\n<p>Submitting many projects is welcome.</p>\n", "parentCommentId": "pXCrYq2fCkmcCXpqS", "user": {"username": "Paul_Christiano"}}, {"_id": "m7o5hfdhmqwHxiexL", "postedAt": "2015-02-27T22:21:40.085Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>We expect to be purchasing small activities for now. We also expect to be funding things that would have happened otherwise (e.g. we are purchasing stuff that was done in 2014), in large part. See <a href=\"http://impactpurchase.org/why-certificates/the-effect-of-purchasing-a-certificate/\">here</a> for some discussion of the anticipated direct impacts.</p>\n", "parentCommentId": "y3BFg5Sjf4Cq56nn6", "user": {"username": "Paul_Christiano"}}, {"_id": "YBfT3uCAmnep4pTPZ", "postedAt": "2015-03-01T13:05:53.293Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Roughly how many applications have you had, and have you heard from anyone who might be interested in funding this?</p>\n", "parentCommentId": null, "user": {"username": "jayd"}}, {"_id": "8ScrN4GRzYYxecqSi", "postedAt": "2015-03-04T15:48:05.331Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>So far there have been 2 applicants, and I have heard from potential funders. I expect the number of applications to grow before the deadline, but it does provide some inducement to apply.</p>\n", "parentCommentId": "YBfT3uCAmnep4pTPZ", "user": {"username": "Paul_Christiano"}}, {"_id": "CLKr3W5zWSfMrJFcv", "postedAt": "2015-03-13T22:44:07.986Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Gustavo Bicalho seemed interested in doing a similar project. At least he described a very similar project to me. </p>\n", "parentCommentId": "8ScrN4GRzYYxecqSi", "user": {"username": "Diego_Caleiro"}}, {"_id": "8hDqMZmu65n5qQmvM", "postedAt": "2015-03-14T13:05:09.067Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Alrighty, I’m officially psyched about this, and I have a few more questions.</p>\n<p>Owen wrote that the collaborative nature of charities would bar you from buying impact certificates for donations, but that this could be avoided if the charity writes them for donors, and you agreed. Since AMF converts donation into nets 1:1 unless you specifically make an unrestricted donation, I could probably just ask Rob to write a certificate for me over the full amount of the donation, right?</p>\n<p>I believe that AMF has significant long-term impact, but you may disagree on the exact degree of significance, so a certificate over a $1,000 donation to AMF might not be priced at exactly $1,000 in the end (ignoring inflation), right? Is there going to be a precedent for such prices of donation impact certificates or should I submit one?</p>\n<p>GiveDirectly is currently using 9% for administrative expenses and all that. If I make a $100 donation to them, should I ask for a certificate over the full amount or $91? I don’t want to rip them off impact-wise, but those 9% might be more valuable than any other 9 pp. of my donation.</p>\n<p>What proof would you like to see that someone at GiveDirectly actually wrote that impact certificate for me?</p>\n<p>I’d use AMF or GiveDirectly for this benchmark, but I’m also thinking about obtaining a certificate from Animal Equality that I’d be hesitant to sell to you for fear of influencing future prices of animal charity donations downward but that I would like to gift to carnivore friends in fractions that I hope offset a month of meat consumption. Is someone already doing this?</p>\n<p>What would have to happen for impact certificates to become interesting for the mainstream investor? Would it be enough for a few major funders like Good Ventures, the Gates Foundation, a government, vel sim. announce that they will continually buy certificates for a fixed yearly budget? When will I be able to trade impact certificates at Wall Street?</p>\n<p>Also, who is really going to own the impact you buy? Is it going to be owned by some sort of unincorporated voluntary association by the name of “The impact purchase” or by the funders in proportion to the funding they contributed?</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "BJQzRBh7p9duh2yah", "postedAt": "2015-03-15T17:25:52.525Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>I would buy certificates for a donation to AMF (no need to talk with them about it), but not for a bednet distribution. It is fine to offer to sell them; I probably should have included something like this as a benchmark, but I would prefer to buy them from someone else. The price I'm willing offer  is unlikely to end up anywhere close to $1000, unless multiple people offer to sell certificates for a donation to amf and they end up competing with each other. If your asking price was much less than $1000 I would be incredulous, though I guess it should be a bit lower because you can take an extra deduction.</p>\n<p>Similarly for a donation to givedirectly, I'd buy a certificate for the donation but not the cash transfer itself, so no need to worry about $100 vs $91. I won't ask for any kind of elaborate proof, a tax receipt is plenty.</p>\n<p>Note that I personally am not super optimistic about development, though amf donations may nevertheless be the best option on the table.</p>\n<p>I would not bet on certificates ever becoming interesting to mainstream investors (at the point when any given certificate is sufficiently straightforward / commodified that a normal investor would buy it, they aren't really adding any value and the philanthropist could just by it themselves). If it got big enough there may eventually be loosely grounded speculation on particularly straightforward certificates, which would mostly amount to bets on the size of philanthropy or the longevity of the certificate market.</p>\n<p>The certificates are owned by the funders who purchase them. Different funders can have different values, and the purchasing decisions aren't necessarily made jointly (though we will preserve truthfulness for the seller).</p>\n", "parentCommentId": "8hDqMZmu65n5qQmvM", "user": {"username": "Paul_Christiano"}}, {"_id": "3BdtLzhBRJ4YdRC7J", "postedAt": "2015-03-16T16:56:57.743Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Okay, thanks! Seems I have nine days left. That should be plenty to submit an offer over a benchmark donation certificate. (Update: done.) I think GD is probably the simpler baseline for this.</p>\n<p>I hope the fact of it being a benchmark for this system (greater impact) won’t affect the usefulness of the benchmark (lower impact)? Those considerations cancel each other out impact-wise, right? This is getting curiouser and curiouser.</p>\n<p>You had a few scenarios in your first post that sounded like they would be interesting for mainstream investors, like funding research in return for a share of the certificate. That sounds like something VCs might do.</p>\n", "parentCommentId": "BJQzRBh7p9duh2yah", "user": {"username": "Telofy"}}, {"_id": "YXsis5YrnpGaRir74", "postedAt": "2015-03-17T06:57:39.258Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>Interesting, any updates on the numbers of either?</p>\n", "parentCommentId": "8ScrN4GRzYYxecqSi", "user": {"username": "jayd"}}, {"_id": "ecovT7Ea7Wn3n2qQZ", "postedAt": "2015-03-17T16:11:01.724Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>One good outcome would be if people who sold one certificate were incentivised to do some more good to get another. These could well be the people with the strongest incentive, as they'll be most convinced they have a chance of selling a certificate for future impact. However do you think they'll be enough funding in the future to allow for this?</p>\n", "parentCommentId": null, "user": {"username": "arrowind"}}, {"_id": "KZaigAAzr6P7pnZ5K", "postedAt": "2015-03-27T13:58:39.304Z", "postId": "2ZjdGTZv5QscFzJX6", "htmlBody": "<p>This is great. I currently see a lot of double counting as people mentally think ' this wouldn't have happened without my money/initiative/talent/ideas/influence' without thinking of all other things that it wouldn't have happened with either. It's kind of the right way to think in terms of guiding individual action most of the time but not good in terms of objective impact assessment. I think doing this will force us to figure out which counts when even if it doesn't end up starting a new and interesting market!</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}]