[{"_id": "uumoLHsDxDnwxJmMu", "postedAt": "2023-09-11T22:52:57.761Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>I really enjoyed this one! These feel like common EA mistakes, and I feel like I see them often</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "pGhf5GjijrBReJJzd", "postedAt": "2023-09-12T00:21:23.898Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>this was a great listen, thanks alex!</p>", "parentCommentId": null, "user": {"username": "Saul"}}, {"_id": "hmNFGGWjKnPfpFJnK", "postedAt": "2023-09-12T07:18:06.279Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>'Follow your passion (on the margin in EA)' :)</p>\n<p>Great podcast!</p>\n", "parentCommentId": null, "user": {"username": "HaukeHillebrandt"}}, {"_id": "JtQFETmCArsMvKEYM", "postedAt": "2023-09-12T14:21:01.789Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>I love that you wrote such a readable summary!</p><p>&nbsp;</p><p>More thoughts:</p><ol><li>Regarding \"Taking 80,000 Hours’ rankings too seriously\" (and specifically thinking that you MUST work on AI Safety) - maybe it's worth writing something about that in the website in the section about AI Safety?<ol><li>(I think I share 80k's views both on the importance of AI Safety and also that not everyone should go do that)</li></ol></li><li>I love that you talk so much about personal fit.&nbsp;<ol><li>I think this is something that historically 80k says a lot but readers don't internalize. Not sure how to fix it but I'm happy it's on your radar</li></ol></li><li><i>\"Another one that I’m super familiar with is basically being on a reasonably high-impact path or in a high-impact role, but still constantly considering other career options that might be even more impactful\"</i> - I'd like to point out that the new 80k career guide (that I'm currently listening to) seems to have a narrative of \"thinking that X is good, then discovering Y! thinking Y is good, and then discovering Z!\".<ol><li>I think there are lots of positive things about this kind of writing and I'm not saying I'd change it, but it might be contributing to your readers' perfectionism. (again, not saying you should change this, idk really)</li><li><i>\"And for years it just meant I ended up being in a role for a bit, and someone suggested I apply for another one. In some cases, I got those roles, and then I’d switch because of a bunch of these biases, and then spent very little time getting actually very good at one thing because I’ve done it for years or something.\" </i>- are you sure this is actually bad? If each time you moved to something 10x more effective, and then at some point (even if years later) settled into learning your job and doing it really well, it might still be.. good?<ol><li>Alex, regarding <i>\"The next time I’m looking at options is in a couple of years.\"</i> - would you endorse this sort of thing for yourself? I mean, I'm guessing it would be a big loss if you weren't in 80k, and if (now) you weren't in OP. I do think it would be reasonable to have you take even a whole day of vacation each week in order to make sure you get to OP 1-2 years sooner. [not as a realistic suggestion, I don't think you could consider career options for a whole day per week, but I'm saying that the value of you doing exploration seems pretty high and would probably even justify that. no? or maybe the OP job had nothing to do with your proactive exploration]</li></ol></li><li>My own opinion here is that people are often just pretty bad at considering alternatives. Time spent in considering alternatives just isn't so effective, so deciding to \"only spend X time\" doesn't seem to solve the problem, I think.<ol><li>I do think that talking to someone like an 80k advisor is a pretty good magic pill for many people. 80k does have a sense of what careers a certain person might get, and also has a sense of \"yeah that is actually super useful\", plus 100 other considerations that it's pretty hard to figure out alone imo. It also overcomes impostor syndrome (people not even considering jobs that seem to senior regardless of how long they spend thinking) and so on.<ol><li>I acknowledge this doesn't scale well</li></ol></li></ol></li></ol></li></ol>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "fwHPPb7mBCmPv8cZr", "postedAt": "2023-09-12T19:26:58.091Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>Thanks for asking these! Quick reaction to the first couple of questions, I'll get to the rest later if I can (personal opinions, I haven't worked on the web team, no longer at 80k etc. etc.):<br><br><br>I don't think it's possible to write a single page that gives the right message to every user - having looked at the pressing problems page - the second paragraph visible on that page is entirely caveat. It also links to an FAQ, where multiple parts of the <a href=\"https://80000hours.org/problem-profiles/#problems-faq\">FAQ</a> directly talk about whether people should just take the rankings as given. When you then click through to the AI problem profile, the part of the summary box that talks about whether people should work on AI reads as follows:</p><blockquote><p>As a result, the possibility of AI-related catastrophe may be the world’s most pressing problem — and the best thing to work on for those who are well-placed to contribute.</p></blockquote><p><br>Frankly, for my taste, several parts of the website already contain <i>more</i> caveats than I would use about ways the advice is uncertain and/or could be wrong, and I think moves in this direction could just as easily be patronising as helpful.</p>", "parentCommentId": "JtQFETmCArsMvKEYM", "user": {"username": "alexrjl"}}, {"_id": "9AD7QwxsWEKCcobAc", "postedAt": "2023-09-12T19:46:49.046Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>Hey Alex :)</p><p>1.</p><blockquote><p>I don't think it's possible to write a single page that gives the right message to every user</p></blockquote><p>My own <a href=\"https://forum.effectivealtruism.org/posts/bCDzacsx5cbzNzdHF/software-developers-how-to-have-impact-a-software-career\">attempt</a> to solve this is to have the article MAINLY split up into sections that address different readers, which you can skip to.</p><p>&nbsp;</p><p>2.</p><blockquote><p>the second paragraph visible on that page is entirely caveat.</p></blockquote><p>2.2. [edit: seems like you agree with this. TL;DR: too many caveat already] My own experience from reading EA material in general, and 80k material specifically, is that there is going to be lots of caveat which I didn't (and maybe still don't) know how to parse. it feels almost like how people are polite in the U.S (but not in Israel), or like fluff in emails, I'm never sure how to &nbsp;understand it, so I mostly skip it</p><p>2.3. [more important] I think there's a difference between saying \"we're not sure\" and saying \"here's a way that reading this advice might do you more harm than good\" (which I personally often write in my docs (<a href=\"https://forum.effectivealtruism.org/posts/g7kDhcsHeRCpeJijb/how-to-become-a-professional-software-developer#Do_you_read_lots_of_advice_like_this__Then_maybe_skip_this_post\">example</a>), including something I wrote today)</p>", "parentCommentId": "fwHPPb7mBCmPv8cZr", "user": {"username": "hibukki"}}, {"_id": "estHkvWDY8WAA3ktm", "postedAt": "2023-09-12T21:29:50.108Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>I don't think it's worth me going back and forth on specific details, especially as I'm not on the web team (or even still at 80k), but these proposals are different to the first thing you suggested. Without taking a position on whether this structure would overall be an improvement, it's obviously not the case that just having different sections for different possible users ensures that everyone gets the advice they need.<br><br>For what it's worth, one of the main motivations for this being an after-hours episode, which was promoted on the EA forum and my twitter, is that I think the mistakes are much more common among people who read a lot of EA content and interact with a lot of EAs (which is a small fraction of the 80k website readership). The hope is that people who're more likely than a typical reader to need the advice are the people most likely to come across it, so we don't have to rely purely on self-selection.</p>", "parentCommentId": "9AD7QwxsWEKCcobAc", "user": {"username": "alexrjl"}}, {"_id": "ayWj5AREse5ssGSHQ", "postedAt": "2023-09-12T21:53:20.017Z", "postId": "32LmGryHhsCYcvr72", "htmlBody": "<p>Responding here to parts of the third point not covered by \"yep, not everyone needs identical advice, writing for a big audience is hard\" (same caveats as the other reply):</p><blockquote><p><i>\"And for years it just meant I ended up being in a role for a bit, and someone suggested I apply for another one. In some cases, I got those roles, and then I’d switch because of a bunch of these biases, and then spent very little time getting actually very good at one thing because I’ve done it for years or something.\" </i>- are you sure this is actually bad? If each time you moved to something 10x more effective, and then at some point (even if years later) settled into learning your job and doing it really well, it might still be.. good?</p></blockquote><p>No, I don't think it's always bad to switch a lot. The scenario you described, where the person in question gets a 1 OOM impact bump per job switch and then also happens to end up in a role with excellent personal fit is obviously good, though I'm not sure there's any scenario discussed in the podcast that wouldn't look good if you made assumptions that generous about it.</p><blockquote><p>Alex, regarding <i>\"The next time I’m looking at options is in a couple of years.\"</i> - would you endorse this sort of thing for yourself? I mean, I'm guessing it would be a big loss if you weren't in 80k, and if (now) you weren't in OP. I do think it would be reasonable to have you take even a whole day of vacation each week in order to make sure you get to OP 1-2 years sooner. [not as a realistic suggestion, I don't think you could consider career options for a whole day per week, but I'm saying that the value of you doing exploration seems pretty high and would probably even justify that. no? or maybe the OP job had nothing to do with your proactive exploration]</p></blockquote><p>The thing I describe as being my policy in the episode isn't a hypothetical example, it's an actual policy (including the fact that the bounds are soft in my case, i.e. I don't actively look before the time commitment is through, and have a strong default but not an unbreakable rule to turn down other opportunities in the meantime. I think that taking a 20% time hit to look for other things would have been a huge mistake in my case. The OP job had nothing to do with proactive exploration, as I wasn't looking at the time (though having got through part of the process, I brought the period of exploration I'd planned for winter 2023 forward by a few months, so by the time I got the OP offer I'd already done some assessment of whether other things might be competitive).</p><blockquote><p>My own opinion here is that people are often just pretty bad at considering alternatives. Time spent in considering alternatives just isn't so effective, so deciding to \"only spend X time\" doesn't seem to solve the problem, I think.</p><ol><li>I do think that talking to someone like an 80k advisor is a pretty good magic pill for many people. 80k does have a sense of what careers a certain person might get, and also has a sense of \"yeah that is actually super useful\", plus 100 other considerations that it's pretty hard to figure out alone imo. It also overcomes impostor syndrome (people not even considering jobs that seem to senior regardless of how long they spend thinking) and so on.<ol><li>I acknowledge this doesn't scale well</li></ol></li></ol></blockquote><p>Not 100% sure I followed this but if what you're saying is \"don't just sit and think on your own when you decide to do the career exploration thing, get advice from others (including 80k)\", then yes, I think that's <strong>excellent advice</strong>. In making my own decision I, among other things:</p><ul><li>Spoke to my partner, some close friends, my manager at 80k (Michelle), and my (potential) new manager at Open Phil (Luke)</li><li>Wrote and shared a <a href=\"https://forum.effectivealtruism.org/posts/GskGj9wCzLdP8WgmT/an-easy-win-for-hard-decisions\">decision doc</a></li><li>Had 'advising call' style conversations with three people (to whom I'm extremely grateful), who I asked because I thought they'd make good advisors, and I didn't want to speak to one of 80k's actual advisors because that's a really hard position to put someone in, even though I think they'd have been willing to try to be objective. (I had other conversations with various 80k staff, just not an advising session)</li></ul>", "parentCommentId": "JtQFETmCArsMvKEYM", "user": {"username": "alexrjl"}}]