[{"_id": "tqYMiqGfKYouL4RiS", "postedAt": "2023-10-04T20:22:45.659Z", "postId": "33CJvNbMeMQitSXLi", "htmlBody": "<p>I think this is a great perspective on the future of EA and as SBF’s trial is about to explode across world media and bring a new wave of negative mentions of EA, people I know who are building effective giving org’s while considering themselves within EA are also choosing to use the term Effective Giving more broadly in their communications because the term EA is facing an extended bad press cycle. I deeply regret this reality but it’s the nature of how things work these days.</p>\n<p>The other thing this presentation touches on and I will discuss it with my own twist is that we’ve somewhat abandoned our fundraising core…and I think many EA’s have failed to grasp how big fundraising is to our core essence and place in the world. Early EA full of STEM people did the remarkable job of pushing evidence based impact to the fore of the whole philanthropic world. If you read outside of EA in other philanthropic circles all you hear about is effective impact. It’s a classic success story of a small movement changing the bigger narrative in its field. And one of the proofs of this is how so many people decided to rely upon EA charity evaluators for their donations and we built up a massive amount of funds spread over 50+ fundraising organizations.</p>\n<p>One of the things that always amazes me about EA is how many take this massive success for granted. It is almost without precedent that a small group of philosophy and STEM activists build up billions of dollars of funds. That just doesn’t happen. Most movements struggle for years. Having 25-50 million dollars is considered a hugely successful movement. Many EA’ers making 100K plus as altruists have no clue that is not how altruists in the past got paid…a career in altruism meant you made very little money, it was like you were choosing to donate the huge portion you weren’t getting paid as your sacrifice for doing good.</p>\n<p>This isn’t just a case of an older generation perspective being jealous of a younger generations success…this lack of awareness of the actual core accomplishment of EA in the world leads to mistakes because when you are not operating in reality you are guaranteed to make choices that won’t work.</p>\n<p>When you have billions of dollars under your management in todays world it gives you a weight in public forums that is not based in your philosophical work, but based in your clout. This allowed the philosophers who did great things in building EA to go back to their roots and spin out new esoteric concepts totally shifting EA in its second wave toward Longtermism and X-risk and away from charity and fundraising. This was a mistake because it was built on clout and not a long career building the philosophical foundations.  Which lead to problems.</p>\n<p>I believe the third wave of EA should be to now build upon its true foundation of fundraising leadership and to take it out to a bigger and broader audience. The new EA cannot continue as a mostly STEM elite group. That doesn’t fit the mission. A broader more mature effective giving movement reaching all the millions of wealthy donors has to have a culture that is more welcoming to those donors.</p>\n<p>I have been in movements that have had to change from their early core culture to a broader more mature culture as they’ve grown and it’s a painful thing for many who bemoan the loss of the little tight knit community they loved. And I’m sympathetic, but it’s the same sympathy you feel for a sad teenager having to leave their friends and school because their parents got an important new job far away. It’s a painful loss but it’s just life.</p>\n<p>As a non STEM person I will tell you this forum is not a welcoming place. This is not new information, I’ve read here and spoken to people who all know it. It’s time to open EA up to more arts and humanities people, to more mid and later career people and as I’ve argued elsewhere to probably guffaws from EA readers, to more average people that are not elite. This is the kind of balance that will change the culture and make EA more welcoming to all the people it needs to draw in to go where it needs to go.</p>\n<p>We will surely always need a STEM core to do charity evaluations and to continue a healthy subsection of philosophical thinking about X-risk and Longtermism or whatever it evolves into. I love and value that work, but it’s not what EA actually is in the world.</p>\n<p>What EA actually is, is the network of local groups CEA supports, the charity evaluation work and the many funds relying on their work, the various think tank research org’s, the efforts to help people work in effective impact jobs and both the charities EA supports and the new ones it starts. That’s what EA is and we now need to get a whole bunch of new people involved in and supporting all that…and to get those people we have to do some new things like more creative marketing, make documentary films and other creative media to spread the vision and inspire imaginations, and change the culture to make it more welcoming to non-STEM people. To do all that we need more artists and creatives and more average people and more mid and senior career people.</p>\n", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "2jPdHpwBabLjx6biQ", "postedAt": "2023-10-05T21:34:16.551Z", "postId": "33CJvNbMeMQitSXLi", "htmlBody": "<p>This is a great talk. This and another recent <a href=\"\">post by Gemma Paterson</a> highlight the importance of standing up for EA and funding it.&nbsp;<br><br>This is even more important today, in the context of the SBF trial, when it feels like EA is under attack from many sides.&nbsp;<br><br>In an ideal world, people would be supportive or, at worst, indifferent towards a group of people trying to make the world better and safer for everyone.&nbsp;</p><p>But in our bizarre world, no good deed goes unpunished, and the SBF affair seems to have put new wind in the sails of those who would find fault with EA. I couldn't resist doing an internet search for the term you mentioned, \"Defective Altruism\", and predictably I found more, and more recent, articles along a similar theme, referring to EA as \"elitist\" or even \"repugnant\". I am purposefully not including links to these diatribes.&nbsp;</p><p>But we need to be aware that this mentality is out there, and it's impacting the narrative that many people hear.&nbsp;<br><br>I think it's important to realise that, outside of this community, many people either have no idea what EA is, or have only heard one of these negative views, often ridiculing an idea they are intentionally misunderstanding.</p><p>It's rarely a good idea to try to argue with someone whose views are the opposite of yours, especially if you believe their views are misguided. Most people with negative views of EA are not bad people. But they may have been raised to view charity the way I was raised to view it - with a deep <u>focus on the giver rather than the receiver</u>.&nbsp;</p><p>Growing up as a Christian, I was taught that what matters is how much I personally sacrifice to support a good cause. If I suffer, all the better. Whether the net result of my suffering makes a difference is almost an afterthought. This is absolutely <strong>not</strong> to say that Christians did not care about the poor or the sick - I had so many wonderful role-models, including my parents and several priests who did great work to help the poor. In the Bible, Jesus Himself cares deeply for the poor, yet insists that the poor man who donates a tiny amount is better than the rich man who makes a huge donation.&nbsp;</p><p>So when EA's come and put the focus firmly on the impact, we are challenging some very deeply-held beliefs. Actually, we're not challenging them at all, rather we're separating two different things. We're saying that we make no moral or ethical judgments about what or why you donate - be it time or money. We focus only on the question of how to maximise the good that you can do with that.&nbsp;</p><p>But in the eyes of someone raised on traditional Christian values, this can easily be misperceived - or intentionally misunderstood - as our equating more impactful donors with \"morally superior\" people.&nbsp;</p><p>Cases like SBF are extreme examples, which unfortunately get a lot of publicity. To an EA, before his fall, SBF was a great example of an effective altruist, whose altruism was doing more than 1000 average charity volunteers. Yet there he was living in extreme luxury while they struggled to survive. How could this make sense, morally?&nbsp;</p><p>I have even read a description of EA as being essentially a vehicle to enable mega-rich people like SBF to justify their wealth and even their criminality by claiming that they were earning to give. That the causality of this is backwards doesn't make it less harmful when a credible journalist write that to an audience who know little of EA. &nbsp;</p><p>In our sound-bite world, EA is very easy to denigrate, and quite difficult to defend, because one look at the EA Forum will show the depth of thought and complex analysis that underlies EA's positions.&nbsp;<br><br>In that context, I think videos like this one are wonderful. It shows a side of EA that is much closer to what people view as \"charity\". It shows deep concern about people in poverty and a desire to help them. It speaks of people devoting their whole careers to doing good. It does not get tangled up in philosophical arguments, but just looks at how we can do more to help more people.&nbsp;<br><br>It would be great if there were a way to get this, or something similar, on TED, to help counter some of the misguided negativity and disinformation that is out there right now.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}]