[{"_id": "TJHJpDNHrE4uYF4cn", "postedAt": "2023-09-09T19:42:09.172Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Do you have plan to share the results of the community survey?&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "53nu6H4DGDRxqRERL", "postedAt": "2023-09-09T19:45:02.722Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thanks for sharing this post, this is a really positive step forward in transparency, I especially appreciated the list of attendees and description of the structure of the Forum. I like that there will be assigned owners of different projects, and I hope that outcomes of the Forum and information on initiatives that came out of it will also be shared with the community.&nbsp;</p><p><strong>TL:DR;&nbsp;</strong></p><p>I think that ultimately, issues pertinent to the community need to have meaningful, two way, sustained engagement with the community. I'd like to see participation from more \"regular\" community members as well who will add necessary and valuable perspectives to understand our community better and help improve it.</p><p>I believe there is a need for two different spaces - one for leaders to coordinate with each other, and one for a dialogue to be had. But I think the latter is essential to informing the agenda of the former. I'd love for the community survey to be a first step towards creating that second space. Perhaps something like what I’m describing could even be the kind of thing that’s discussed during the Forum.&nbsp;</p><p><strong>To elaborate:&nbsp;</strong></p><p>Often I think the term “EA community” or “community building” can be used to mean different things. I think there’s a difference between efforts towards “EA the movement” vs those (perhaps more internally facing) “EA the community. For example, funding a new organization to target policy professionals for AI governance would “EA the movement” decision (even though it’s&nbsp;<i>community&nbsp;</i>building), while improving sexual misconduct practices would be “EA the community”.&nbsp;</p><p>From the post, I understand that the forum’s remit is both “movement” and “community”(emphasis mine):</p><blockquote><p>only focused on the<strong> “meta”/community-building</strong> space rather than object-level decisions in any cause area.</p></blockquote><p>and is&nbsp;</p><blockquote><p>aimed at improving the trajectories of EA and related&nbsp;<strong>communities</strong>”</p></blockquote><p>They are of course very intertwined, and from the events of the past year it is likely that community concerns will be an important topic of conversation.&nbsp;</p><p>For such issues, I think it’s essential for there to be meaningful dialogue between (regular, representative) community members and EA decision-makers and leaders, and more mechanisms by which community members can systematically raise concerns that are directly relevant to them (e.g. a place to see current issues, how much support there is for addressing those issues, potential solutions being considered &amp; worked on, etc.)&nbsp;</p><p>I think that in any community, leaders will likely not always be aware of what is happening \"on-the-ground\", and that there are many systemic, power-differential related reasons that they won’t always be getting the information they need. I wouldn’t be surprised if this has improved post-FTX, but I’m pretty sure we have a ways to go in this regard.</p><p>Up until now, leaders haven’t prioritized this very highly (even if they believe it's important). I think this is because there has historically been a lack of clarity as to whose responsibility managing the community is. The community itself has grown faster than the community infrastructure could keep up.</p><p>I don’t think setting up the infrastructure to allow for this dialogue to occur is trivial or easy. It's costly to do well. It requires investment from leaders and others who would work on these issues full time. The work is (often emotionally) hard, unrewarding, and sometimes it’s not clear if you’ve had an impact. That being said, I believe it is essential infrastructure to make this community sustainable and health (and allow it to grow).&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "xbgcDsuE83aoqs79q", "postedAt": "2023-09-10T21:03:05.645Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>\"After the event, we plan to publish a summary of the survey responses.\"</p>", "parentCommentId": "TJHJpDNHrE4uYF4cn", "user": {"username": "David Mears"}}, {"_id": "HubnPstzi8LrvP7Zz", "postedAt": "2023-09-10T22:55:44.132Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Ah yes thanks! Meant to delete this.</p>\n", "parentCommentId": "xbgcDsuE83aoqs79q", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "pcGBpoFABY2zDDu6Z", "postedAt": "2023-09-10T23:30:35.540Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Naming nitpick: Given the title, an expression of valuing transparency, and this being in the Bay, I originally thought this was about Zuckerberg's Meta, not Meta-EA :)</p>", "parentCommentId": null, "user": {"username": "Gabe Mukobi"}}, {"_id": "2oeRrdLMtavvpQnkD", "postedAt": "2023-09-11T03:00:00.629Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>It would be useful to know the date of the last such forum as it would make it easier for us to know what topics would be new since that event.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "ykdCDnNZmGzY4p2WX", "postedAt": "2023-09-11T08:21:17.527Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thank you for sharing this!</p><p>My answer to the <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSf4bKvDVwb7OxSuUfwOyx5_7pIXmuCTlDyWaVhZLgniH9g59g/viewform\">survey</a>'s question \"<strong>Given the growing salience of AI safety, how would you like EA to evolve?\"</strong>:</p><p>I think EA is in a great place to influence the direction of AI progress and many orgs and people should be involved with this project. However, I think that many people in this forum think that the most important outcome of the EA community is by influencing this technology, and I think this is mistaken and misleading.</p><p>The alternative would be to continue supporting initiatives in this space, including AI safety-specific subcommunities, but to support a thriving EA community which is measured by the quality of thought and decision making, and the number of people actively dedicating a sizable proportion of their resources toward doing the most good they can (in contrast with measuring communities and individuals based on their deference to top-down cause prioritization).</p><p>I'm reasonably sure that the current wave of orgs and people working on AI safety is strong enough to maintain itself and grow well, and I'm worried about over-optimizing on near timelines. &nbsp;</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "kAmAohEzJYSRrw8Hk", "postedAt": "2023-09-11T08:21:46.062Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>(Sharing this because I'm uncertain and would be interested in thoughts/pushbacks)</p>", "parentCommentId": "ykdCDnNZmGzY4p2WX", "user": {"username": "edoarad"}}, {"_id": "baHF97ysr9jXui8G8", "postedAt": "2023-09-11T09:18:07.773Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thanks for sharing this, really looking forward to the results of the survey.&nbsp;<br><br>As this event is for \"a group of key people focused on meta / community-building work\", wouldn't it make sense to include those doing community-building work 'on the ground'? E.g., organisers that work for national, uni, city, or profession-based community-building organisations?<br><br>Rob provides some representation as head of CEA's Groups Team, and obviously many of the attendees were working at the coalface in the recent past, but it still feels like a missed opportunity.&nbsp;<br><br>I recognise I'm probably biased because I co-run the Dutch national organisation.&nbsp;</p>", "parentCommentId": null, "user": {"username": "James Herbert"}}, {"_id": "N4EmhuFFvCsDCnjPk", "postedAt": "2023-09-11T10:07:51.926Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I'm pretty curious about any tools/events that could be built to help such events run better. To give a short but not exhaustive list:</p><ul><li>Do people write short statements of their views on topics beforehand? Are these useful?</li><li>Is there any attempt to specifically channel people who disagree together and get them to talk? Does this work?</li><li>Do people in general change their minds (the recent Xrisk Prediction Tournament was kind of a downer in that many superforecasters and experts seemingly don't)&nbsp;</li><li>Would it be worth having a live voting session that people could submit to through the event to anonymously judge sentiment</li><li>Has there ever been on-site mediation to try and resolve longstanding differences? I bet some of these people don't trust one another and that hampers information sharing</li></ul><p>I sort of guess the main value add is having a load of decision makers in one space for an extended period of time to develop trust. But in turn it seems surprising to me that we can't do better than that. It would be really interesting to understand problems you folks have because I guess those apply to political and non-profit decision makers too.</p><p>Finally a confusion</p><blockquote><p>Invitation to this event is not proof of trustworthiness.</p></blockquote><p>and</p><blockquote><p>We value collaboration and learning among people, taking place in an environment of well-calibrated trust.</p></blockquote><p>These two statements read as contradictory to me? These people aren't necessarily trustworthy but you value well-calibrated trust? Perhaps I'm meant to understand that you lot know how much to trust each other but that we shouldn't necessarily do so? I don't really understand what you mean here.</p><p>&nbsp;</p><h1>&nbsp;</h1>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "yzAPb8LXkWdxoCEkt", "postedAt": "2023-09-11T10:10:32.597Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>A suggestion of a minimal viable way to do this might be to have a small group of randomly chosen EAs who attend part of events like this. That would probably make it easier to empathise with the community as it currently is.&nbsp;</p><p><i>I am pretty uncertain if I endorse this idea.&nbsp;</i></p>", "parentCommentId": "53nu6H4DGDRxqRERL", "user": {"username": "nathan"}}, {"_id": "Sg6NCgcyiZkZwYgWG", "postedAt": "2023-09-11T10:59:18.373Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Yeah, dunno if this would be good but, if people are interested in exploring it further, I can recommend <a href=\"https://www.oecd.org/gov/innovative-citizen-participation-and-new-democratic-institutions-339306da-en.htm\">this report</a> from the OECD.&nbsp;<br><br>Amongst other things, it gathers close to 300 representative deliberative practices to explore trends in such processes, identify different models, and analyse the trade-offs among different design choices as well as the benefits and limits of public deliberation.&nbsp;<br><br>It divides these processes into four different types:&nbsp;</p><ol><li><strong>Informed citizen recommendations on policy questions:</strong> These processes require more time (on average a minimum of four days, and often longer) to allow citizens adequate time and resources to develop considered and detailed collective recommendations. They are particularly useful for complex policy problems that involve many trade-offs, or where there is entrenched political deadlock on an issue.</li><li><strong>Citizen opinion on policy questions: </strong>These processes require less time than those in the first category, though still respect the principles of representativeness and deliberation, to provide decision makers with more considered citizen opinions on a policy issue. Due to the time constraints, their results are less detailed than those of the processes designed for informed citizen recommendations.</li><li><strong>Informed citizen evaluation of ballot measures: </strong>This process allows for a representative group of citizens to identify the pro and con arguments for both sides of a ballot issue to be distributed to voters ahead of the vote.</li><li><strong>Permanent representative deliberative bodies:</strong> These new institutional arrangements allow for representative citizen deliberation to inform public decision making on an ongoing basis.</li></ol>", "parentCommentId": "yzAPb8LXkWdxoCEkt", "user": {"username": "James Herbert"}}, {"_id": "mrwecJ3GhmHBvApzd", "postedAt": "2023-09-11T11:04:48.532Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Yeah I can only find reference to the <a href=\"https://forum.effectivealtruism.org/posts/SppupBEiPCAYA5nLW/cea-s-2020-annual-review#Virtual_Coordination_Forum\">Virtual Coordination Forum in 2020</a> and the <a href=\"https://forum.effectivealtruism.org/posts/TpoeJ9A2G5Sipxfit/ea-leaders-forum-survey-on-ea-priorities-data-and-analysis\">Leaders Forum in 2019</a>.&nbsp;</p>", "parentCommentId": "2oeRrdLMtavvpQnkD", "user": {"username": "James Herbert"}}, {"_id": "YwFCuxasPzKvuWab8", "postedAt": "2023-09-11T11:18:34.745Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Yeah this looks great. Thanks so much. Exactly the kind of thing I wanted.</p>", "parentCommentId": "Sg6NCgcyiZkZwYgWG", "user": {"username": "nathan"}}, {"_id": "sTRm9qCniyX7Wt7wi", "postedAt": "2023-09-11T14:48:39.088Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I think that the last one was in July 2022.</p>", "parentCommentId": "2oeRrdLMtavvpQnkD", "user": {"username": "Maxdalton"}}, {"_id": "jCbECdMeM7oAcmmaS", "postedAt": "2023-09-11T14:52:36.598Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>[Brief comment, sorry!]</p><p>Thanks for those thoughts - we're planning to do some of those (e.g. have people write memos on important topics before the event), and I think we've considered doing all of those things. (Not sure if we made the right decision on how to handle each of these, and not explaining our stance on all of them because of time.)</p><p>Re trust: Sorry, that second sentence is rather confusing. What I mean is that: we're not guaranteeing that everyone attending the event is 100% trustworthy. And I hope that the event will allow <i>attendees</i> to understand each other's motivations/strengths/weaknesses/etc in more depth, so that attendees can get a better understanding of when/how to trust each other and collaborate. I think that <i>non-attendees </i>won't get these benefits, and shouldn't make big updates from the fact that someone is invited/not. I hope that's a bit clearer.</p>", "parentCommentId": "N4EmhuFFvCsDCnjPk", "user": {"username": "Maxdalton"}}, {"_id": "RaPeZLQDhvSMv6aoP", "postedAt": "2023-09-11T14:54:07.553Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I vastly prefer a brief comment to none, thanks for your time.</p>", "parentCommentId": "jCbECdMeM7oAcmmaS", "user": {"username": "nathan"}}, {"_id": "Q48kSXZ2sT6iHKako", "postedAt": "2023-09-11T14:58:02.766Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thanks for sharing James! We did invite a few people doing more on-the-ground community building in various university/national groups, and some of them (e.g. Anne Schulze) are attending (note that not all attendees are public). But I'm not sure whether we got the balance right here, maybe we should have invited more such people.</p>", "parentCommentId": "baHF97ysr9jXui8G8", "user": {"username": "Maxdalton"}}, {"_id": "9g4apiyXaxo2HcFeg", "postedAt": "2023-09-11T15:26:31.068Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Cheers! I haven't met Anne, does she do community building work alongside her role as a Co-director at Effektiv Spenden? Because I don't think I'd count Effektiv Spenden as a community building organisation, and certainly not in the way I'd count EA Germany as a community building organisation. &nbsp;</p>", "parentCommentId": "Q48kSXZ2sT6iHKako", "user": {"username": "James Herbert"}}, {"_id": "kTLEjXziwGgpBpWMA", "postedAt": "2023-09-11T15:32:22.166Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Makes sense! I was thinking of Effectiv Spenden, but I see that that's an ambiguous example. Another public attendee who is doing on-the-ground community building is Kuhan Jeyapragasan (and I think that there were 1-2 others who were invited but can't make it, or aren't public).</p>", "parentCommentId": "9g4apiyXaxo2HcFeg", "user": {"username": "Maxdalton"}}, {"_id": "ACxE7eQ4GpFwjzxbk", "postedAt": "2023-09-11T15:45:45.820Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Maybe I'm being picky but hasn't it been quite a while since Kuhan was involved in the day-to-day running of EA Stanford? Wasn't it around 2021? Because I don't think I'd count SERI or CBAI as EA community building either.<br><br>(I appreciate this is probably very irritating if you've got 1-2 people from the 12 non-public names who are perfect examples of people who have been doing on-the-ground EA community building in the past two years or so).&nbsp;</p>", "parentCommentId": "kTLEjXziwGgpBpWMA", "user": {"username": "James Herbert"}}, {"_id": "NygXWvwhbRc6uvofi", "postedAt": "2023-09-11T16:53:42.594Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Chiming in just to second James. There are dozens of us operating large regional meta EA organizations and I don't see anyone representative of that perspective on the public list. I think it would be extremely valuable to have at least one leader from the CBG organizations present, ideally nominated by other CBGs such that they could represent our collective \"on the ground\" perspective. I'm happy to write a full list of why I think this perspective is valuable and not covered by the (also very valuable) perspectives in the public attendee list, if that would be useful.</p>\n", "parentCommentId": "ACxE7eQ4GpFwjzxbk", "user": {"username": "Rockwell Schwartz"}}, {"_id": "P9n56YNWoGxY5w4ux", "postedAt": "2023-09-11T17:03:41.762Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<blockquote><p>Up until now, leaders haven’t prioritized this very highly</p></blockquote><p>Hmm, this doesn't feel true of my experience. I'm mentally running through a list of recent large-ish CEA projects, and they all involved user interviews, surveys, or both.&nbsp;</p><p>It's possible that you mean something else by \"meaningful dialogue\"? (Or are referring to non-CEA projects?)</p>", "parentCommentId": "53nu6H4DGDRxqRERL", "user": {"username": "Ben_West"}}, {"_id": "x5nF47Qzxr5CFjEju", "postedAt": "2023-09-11T23:57:08.518Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Fwiw, I would be really interested in hearing why you think the <i>currently on the ground running a city or national group</i> perspective is not already covered and would be a valuable &nbsp;addition.</p><p>It seems very plausible to me that the event is missing this perspective, but, I think several listed attendees have past hands-on CB experience or work fairly closely with community builders e.g. Anne, myself, Dewi, Jan, Kuhan, Max Daniel, Max Dalton, Rob (I could be wrong about some of these people).</p>", "parentCommentId": "NygXWvwhbRc6uvofi", "user": {"username": "calebp"}}, {"_id": "gv83JCotBr3oKkyJ9", "postedAt": "2023-09-12T00:01:43.756Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>To add a bit of context in terms of on-the-ground community building, I've been working on EA and AI safety community building at MIT and Harvard for most of the last two years (including now), though I have been more focused on AI safety field-building. I've also been helping out with advising for university EA groups, workshops/retreats for uni group organizers (both EA and AI safety), and organized beginning-of-year residencies at a few universities to support beginning-of-year EA outreach in 2021 and 2022 along with other miscellaneous EA CB projects (e.g. working with the CEA events team last year).</p><p>I do agree though that my experience is pretty different from that of regional/city/national group organizers.</p>", "parentCommentId": "ACxE7eQ4GpFwjzxbk", "user": {"username": "kuhanj"}}, {"_id": "P5GMXaihR4iRRLtHj", "postedAt": "2023-09-12T07:07:12.885Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thanks Kuhan!</p>\n", "parentCommentId": "gv83JCotBr3oKkyJ9", "user": {"username": "James Herbert"}}, {"_id": "qNcmzZH8B8eCj8zfg", "postedAt": "2023-09-12T08:41:25.137Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>If you're willing to write up some of your on the ground perspective and it seem valuable, we'd be happy to share it with attendees!</p><p>Off the top of my head, I'm thinking things like:</p><ul><li>What changes in community members attitudes might 'leaders' not be tracking?</li><li>From your engagement with 'leaders' and community members, what seem to be the biggest misunderstandings?</li><li>What cheap actions could leaders take that might have a really positive influence on the community?</li></ul><p>I'll DM you with info on on how to share such a write up, if you're interested. &nbsp;</p>", "parentCommentId": "NygXWvwhbRc6uvofi", "user": {"username": "MJusten"}}, {"_id": "4yeyMA8qqBnmXSn6D", "postedAt": "2023-09-12T10:07:23.871Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thanks for sharing this - I really appreciate the transparency!</p><p>A quick question on the attendees: Are there any other (primarily) animal advocacy-focused folks within the 43 attendees or is it just Lewis? I don't know the exact breakdown of meta EA efforts across various cause areas but I would be somewhat surprised if meta animal work was below 2% of all of meta EA spending (as is implied by your 1/43 ratio). There are several notable meta EA animal orgs doing work in this space (e.g. <a href=\"https://animalcharityevaluators.org/\">Animal Charity Evaluators</a>, EA Animal Welfare Fund, <a href=\"https://farmedanimalfunders.org/\">Farmed Animal Funders</a>, <a href=\"https://focusphilanthropy.org/\">Focus Philanthropy</a> and <a href=\"https://www.animaladvocacycareers.org/\">Animal Advocacy Careers</a>) so wondering if Lewis is meant to represent them all? If so, I think that's a pretty tough gig! Would be curious to hear more about what determined the relative cause area focuses of the attendees or if there's some dataset that shows meta EA spending across various cause areas.&nbsp;</p><p>&nbsp;</p><p>(Note: I'm aware there is some overlap between other attendees and animal work e.g. Joey and Charity Entrepreneurship, but it's not their primary focus hence me not including them in my count above).&nbsp;</p>", "parentCommentId": null, "user": {"username": "JamesOz"}}, {"_id": "SLXDnf9KzNusvGtRu", "postedAt": "2023-09-12T15:28:16.290Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Seeing the other replies, it seems the specific experience of running a national EA organisation is not specifically represented, although, in our (EA Germany) case, Anne Schulze is part of the community. Bigger EA organisations like ours (&gt;100 members, supporting 27 local/uni groups, providing fiscal sponsorship/employer of record services, having a community health contact, etc.) might bring an additional perspective.&nbsp;</p><p>However, I see that having a representative for each sub-group would make for a big forum and that it's okay to have people who represent multiple perspectives.</p>", "parentCommentId": "baHF97ysr9jXui8G8", "user": {"username": "gruban"}}, {"_id": "hxF7cSYAiMtsujAYz", "postedAt": "2023-09-12T17:44:47.739Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thanks! I’m happy to expound.</p><p>I’ve tried categorizing the public attendee list by their area of meta EA work. There are many different ways to categorize and this is just one version I put together quickly. It looks something like:</p><ul><li>Funding<ul><li>Fundraising</li><li>Grantmaking</li></ul></li><li>Programming<ul><li>Events</li><li>Education</li><li>Advising</li></ul></li><li>Growth and Strategy<ul><li>Service providers (Not included in the public list)</li><li>Comms (Not included in the public list)</li><li>Incubation</li><li>Community Health</li><li>Field-building</li><li>High-level meta EA<ul><li>OP, CEA, EVF, LessWrong</li></ul></li><li>\"On the ground\" meta EA (Not included in the public list)<ul><li>Regional organizations</li><li>Professional organizations</li><li>University groups<ul><li>Kuhan checks this last box but also has a cause-specific bent</li></ul></li></ul></li></ul></li></ul><p>While the people listed make critical decisions regarding resource allocation, granting, setting strategic directions, or providing critical infrastructure, their experience is fundamentally different from those who are directly involved in \"on the ground\" organizations. &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/33o5jbe3WjPriGyAR/announcing-the-meta-coordination-forum-2023?commentId=53nu6H4DGDRxqRERL\">Vaidehi writes</a> that \"issues pertinent to the community need to have meaningful, two way, sustained engagement with the community.\" \"On the ground\" organizations likely do this among the most of any orgs in the EA ecosystem.</p><p>I think the perspective of the wider breadth of “on the ground” community leaders is important, but I’ll speak to regional EA organizations, as that’s what I know best:</p><p>Before the FTX collapse, there was a heavy emphasis on making&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/ewCdRr2ZBkrwXMaoX/making-community-building-a-more-attractive-career-path-1\"><u>community building a long-term and sustainable career path</u></a>. As a result, there are now dozens of people working professionally and often full-time on meta EA regional organizations (MEAROs).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefqzfo1rq60b\"><sup><a href=\"#fnqzfo1rq60b\">[1]</a></sup></span>&nbsp;By and large, we are a team of sorts: we’re in regular communication with each other, we have a shared and evolving sense of what MEAROs are and can be, and our strategic approaches intertwine and are mutually reinforcing. We essentially function as extended colleagues in a niche profession that feels very distinct to me from even other “on the ground” meta-EA community building (such as professional or uni groups). <strong>I don’t think anyone on the attendee list has run a MEARO, and certainly not in 2023.</strong></p><p><strong>There is a distinct&nbsp;</strong><i><strong>zeitgeist</strong></i><strong> among MEAROs.</strong> Consistently, I’ve been amazed how MEARO leaders seem to independently land on the same conclusions and strategic directions as our peers across the globe, “multiple discovery” if you will. This zeitgeist is&nbsp;<i>not</i> captured in larger EA discourse, from the Forum to conversations I have with non-MEARO community leaders. And this MERAO zeitgeist is evolving rapidly, such that it looks very different from even four months ago. As a result, I don’t think anyone who hasn’t been intimately involved in MEAROs in the past 3-6 months can represent our general shared perspective.</p><p>This shared perspective is born out of three main ingredients:</p><ol><li><strong>“On the ground” intensive feedback loops:</strong> We are engaging directly with community members at all stages of the funnel—across EA causes and professions—understanding their concerns, aspirations, and challenges in real time. This provides a richness of information on everything from how people are finding EA, to reactions to current events, to what HEAs see as their biggest needs from community builders. Think of us as carrying out unofficial and constant surveying on everything you’d want the broader EA community’s feedback on.</li><li><strong>High-level EA org feedback:</strong> EA orgs and projects from throughout the ecosystem consistently correspond and collaborate with MEAROs in a way that provides us with a decently holistic and up-to-date understanding of where EA is and where it is headed.</li><li><strong>MEARO-level strategy:&nbsp;</strong>It is our job to think about what MEAROs are and what they should be to achieve maximum impact. We arguably have the most mental bandwidth for this task of anyone in EA and, again, this is shifting dramatically as the EA community and the causes we care about rapidly change.</li></ol><p>I think segments of #1 and #3 are captured by some of the publicly listed attendees, and I imagine the attendees have an equally good or even substantially better experience of #2, but it is the unique perspective that the combination of the three enables that I’m referencing.</p><p>At an event focused on meta coordination, it seems really important to have the perspective of those engaging constantly and deeply with “the EA masses,” immersed in regional strategy, and among the best able to shape the future of EA perception as the on-the-ground representatives of EA to thousands of people worldwide.</p><p>I talked this through with <a href=\"https://forum.effectivealtruism.org/users/james-herbert-1?mention=user\">@James Herbert</a> a bit and we discussed three possible cruxes here:</p><ol><li>Are the people in the public attendee list doing different work from MEARO leaders?<ol><li>For example, have they directly done things listed in <a href=\"https://forum.effectivealtruism.org/posts/33o5jbe3WjPriGyAR/announcing-the-meta-coordination-forum-2023?commentId=SLXDnf9KzNusvGtRu\">Patrick's comment</a>, or advised hundreds of regular people in their geographic region?</li></ol></li><li>If they have, how long is that knowledge valid?<ol><li>For example, EA looks very different in September 2023 than it did in September 2022, and that changes the nature of some aspects of MEARO leadership more than others.</li></ol></li><li>Does directly doing the type of work involved in operating a MEARO give you a different set of knowledge that is useful in contexts like the Mera Coordination Forum?<ol><li>I hope the above gestures at why I think the answer is \"yes\" and believe most other MEARO leaders are likely to agree.</li></ol></li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnqzfo1rq60b\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefqzfo1rq60b\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Yes, I totally just coined this acronym.</p></div></li></ol>", "parentCommentId": "x5nF47Qzxr5CFjEju", "user": {"username": "Rockwell Schwartz"}}, {"_id": "WDp74dk3LMBsgnFHz", "postedAt": "2023-09-12T17:45:30.419Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thank you, Michel! I'm replying over DM.</p>", "parentCommentId": "qNcmzZH8B8eCj8zfg", "user": {"username": "Rockwell Schwartz"}}, {"_id": "KudHdJNRRDGDctinA", "postedAt": "2023-09-13T13:00:11.371Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thanks for sharing your perspective Patrick!<br><br>Yeah, every sub-group being present would be ridiculous, but I think one or two people who have previously done the work and are now working full-time supporting people who are still doing it would be a big improvement, e.g. Naomi/Amarins for national and city groups, or Jessica/Joris for uni groups (I'm not sure who the equivalent would be for professional groups like High Impact Engineers, etc.).&nbsp;<br><br>Perhaps an even better solution would be to have the CBG/UGAP/Infra Fund<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefs04g185eto\"><sup><a href=\"#fns04g185eto\">[1]</a></sup></span>&nbsp;recipients elect one or two people, as Rocky suggested, or even just select random representatives through sortition.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fns04g185eto\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefs04g185eto\">^</a></strong></sup></span><div class=\"footnote-content\"><p>E.g. EA Denmark or EA Philippines</p></div></li></ol>", "parentCommentId": "SLXDnf9KzNusvGtRu", "user": {"username": "James Herbert"}}, {"_id": "f6ztAQNuRuDyYxFJG", "postedAt": "2023-09-13T15:48:24.110Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Talks about \"calibrated trust\", has no forecasters, sad. In the absence of someone to represent my exact niche interest I guess that if we were doing a transferable votes, mine would go to Habryka.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "EzHEwLezk6FHYpmrE", "postedAt": "2023-09-14T09:23:23.999Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I appreciate the partial transparency, but I'm disappointed with the choice to leave the names of some attendees unpublished. It is inappropriate for some people to direct these important decisions from the shadows, even if they themselves would prefer it that way.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "4CYF7aGiiLrdNHCwG", "postedAt": "2023-09-14T12:00:49.232Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I suppose you could think of it as a manner of degree, right? Submitting feedback, doing interviews etc. are a good start, but involve people having less of a say than either 1. being part of the conversation or 2. having decision-making power, eg through a vote. People like to feel their concerns are heard - not just in EA, but in general - and when eg. a company says \"please send in this feedback form\" I'm not sure many people feel as heard as if someone (important) from that company listens to you live and publicly responds.</p>\n", "parentCommentId": "P9n56YNWoGxY5w4ux", "user": {"username": "MichaelPlant"}}, {"_id": "zMWnspZykhvkwBCzd", "postedAt": "2023-09-14T20:33:23.041Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Thank you for all of your work organizing the event, communicating about it, and answering people's questions. None of these seem like easy tasks!</p>\n", "parentCommentId": null, "user": {"username": "alexrjl"}}, {"_id": "3c7NxsogkhqpEMAPg", "postedAt": "2023-09-15T14:30:00.090Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I disagree fwiw. The benefits of transparency seem real but ultimately relatively small to me, whereas there could be strong personal reasons for some people to decline to publicise their participation.</p>", "parentCommentId": "EzHEwLezk6FHYpmrE", "user": {"username": "Stephen Clare"}}, {"_id": "HA2LbMqqQZYLJs6iq", "postedAt": "2023-09-15T19:18:06.696Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I think it's hard for a lot of people to think of what those reasons could be that are compelling, without further specificity</p>", "parentCommentId": "3c7NxsogkhqpEMAPg", "user": {"username": "bec_hawk"}}, {"_id": "YCbMjZxLtpqmgDPzB", "postedAt": "2023-09-15T20:17:29.056Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>The scandals of the last year have shown us that the importance of transparency and oversight is anything but small.</p>\n<p>It's easy to dismiss it, but the fact is you have no idea if the people whose identities are hidden are ones you could trust. And even if they were, as long as much money and influence are at play, they corrupt people.</p>\n", "parentCommentId": "3c7NxsogkhqpEMAPg", "user": {"username": "Guy Raveh"}}, {"_id": "zBbwiJ6yP45yJypyr", "postedAt": "2023-09-17T07:42:05.755Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I think there aren't really any attendees who are doing meta work for a single cause. Instead, it seems to be mostly people who are doing meta work for multiple areas.</p><p>(I also know of many people doing AI safety meta work who were not invited.)</p>", "parentCommentId": "4yeyMA8qqBnmXSn6D", "user": {"username": "Jonas Vollmer"}}, {"_id": "yfDrLMo4vFZ55bM8T", "postedAt": "2023-09-17T11:49:30.882Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>I do very much agree with Nathan's sentiment here.</p><p>I appreciate the original post announcing this forum is aims to expectation manage and temper potential concerns people will have about this group producing a 'grand strategy' for EA or similarly agree solutions to all the big problems. However, there is also acknowledgment that the event is aiming to help plan the next two years and set the trajectory going forward.&nbsp;</p><p>These are important topics and issues (as reflected by the significant senior time involved in the event), and pretty much all of them require a lot of individual and group reasoning under uncertainty. As such I do think there is a very beneficial role for robust methods to help facilitate discussion and decision-making.&nbsp;</p><p>I don't know what things you may already be planning to implement, so I'm mostly just putting a flag down to say if you haven't already, it'd be worth investing in such methods. So I'm not entirely 'talk and no suggestion', some very basic things to introduce (if not already) at low/cost and effort could be:</p><ul><li>Clear framework for all attendees on how uncertainty and predictions should be communicated during the event to ensure consistency and transparency of reasoning between attendees, to help reduce misinterpretation errors which is always a risk in such forums/events.</li><li>External/third party (to the attendees but could still be EA) to provide a mediation and challenge function (similar to what Nathan suggested).&nbsp;</li><li>Collection of prior positions on key topics, with confidence %'s provided before the event. With updating rounds during and at the event of the event, with short notes on what contributed to any % change (one to show impact of the event, but also helps identify where and with whom the more intractable differences lie - which can help more focused action/discussion later). &nbsp;</li></ul>", "parentCommentId": "jCbECdMeM7oAcmmaS", "user": {"username": "JamesN"}}, {"_id": "fLmF6trnKwjz83o7a", "postedAt": "2023-09-17T13:24:55.003Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>Yeah I interpreted the scope of the forum as 'meta-EA'/meta-meta rather than meta-[specific causes].</p>", "parentCommentId": "zBbwiJ6yP45yJypyr", "user": {"username": "bec_hawk"}}, {"_id": "gjba5HRZ9wHTmyBax", "postedAt": "2023-09-18T10:56:16.567Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>In addition to Rocky's comment, there's also the fact that only a tiny proportion of the attendees have experience with CB outside the anglosphere (Sjir and Jan are the two I know of, but I might be missing some). This seems disproportionate given that approx 40% of the 2022 survey respondents reside in non-English speaking countries.&nbsp;</p>", "parentCommentId": "x5nF47Qzxr5CFjEju", "user": {"username": "James Herbert"}}, {"_id": "sTJwxg9TmaDcipa5R", "postedAt": "2023-09-21T13:49:01.168Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>My understanding is that the main reason people wouldn't want to publicize their involvement is to minimize reputation risk(most likely because of FTX). For those doing direct work it could hurt their ability to engage with non-EA actors. I think this is a pretty compelling reason not to publicize your involvement.</p>\n", "parentCommentId": "EzHEwLezk6FHYpmrE", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "FAm8prxCoamsfAY3G", "postedAt": "2023-09-21T20:34:37.694Z", "postId": "33o5jbe3WjPriGyAR", "htmlBody": "<p>An alternative solution would be not to participate in the forum.</p>\n", "parentCommentId": "sTJwxg9TmaDcipa5R", "user": {"username": "Guy Raveh"}}]