[{"_id": "xaat8zWkQ6ySf4KNm", "postedAt": "2022-09-20T03:06:12.503Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>I think per forum norms this should be a personal blog post rather than front page material.</p><p>There are numerous criticisms I would make of your proposal but one simple one is that this system would favor A) challengers who had never held office and B) people who campaigned on vague, vibe-based platforms.</p>", "parentCommentId": null, "user": {"username": "bbartlog"}}, {"_id": "6poQH6mXgYbdCfbsD", "postedAt": "2022-09-20T03:10:20.186Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<ul><li>Lying about your record seems worse and easier to avoid than failing to live up to a promise; you seem to suggest that keeping promises is as easy as being truthful about your record.</li><li>More importantly, this amendment would probably be bad. (Who decides whether I've made a \"promise,\" and whether I've kept it? What's the punishment if they decide I've broken a promise and failed to acknowledge that?)</li><li>More relevantly, this amendment is totally intractable; no amendment like this will be proposed.</li></ul>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "ib5keaYAsJQagHodh", "postedAt": "2022-09-20T10:10:13.572Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>Divisions of power are a very useful tool in a democracy. The US supreme court is already too political for many people.&nbsp;</p><p>If you would make it one of their most important jobs to decide which politicians have to publically say which promises they violated that's likely making the court more political.&nbsp;</p><p>The key problem is that voters and the media put too much stock into the promises that a politician makes about what they will do in the future and too little in looking at the past record. It's the job of the media as the fourth estate and not the job of the judiciary to look into the promises of politicians and would be really bad to change that.</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "2g3a4qpPHjrfSH8n5", "postedAt": "2022-09-21T22:17:29.899Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>\"may politicize the courts\" turned into \"that would be really bad\". Did you have additional critique? I have a hunch that, if I'd stood in the Second Continental Convention and said, \"What if the check-and-balance the courts could wield over the Legislature and Executive included making them admit their broken campaign promises?\" Ben might wink! \"A Democracy, if you can keep it...\" meant you'd have to take active steps to preserve the spirit, as laws become loopholes and citizens become consumers.</p><p>So, it's been a pattern among the hundreds of academics and dozens of engineers I've met - academics like to say \"I have a single flaw, so your proposal is impossible/untenable.\" Good engineers, giving constructive criticism, say \"Well, that won't work, <i>unless</i> you find a way to...\" Do you have any constructive criticism? I'd be honored!</p>", "parentCommentId": "ib5keaYAsJQagHodh", "user": {"username": "Anthony Repetto"}}, {"_id": "KMAF4iPHeF5D3qLBp", "postedAt": "2022-09-21T22:25:09.816Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>Thank you!</p><p>&nbsp;1. Keeping promises is hard, being truthful seems to be hard to them... I'm not sure why their relative difficulty makes any difference? Could you outline the steps in that argument a bit more?</p><p>&nbsp;2. &nbsp;If the amendment operates by criteria, rather than dictate, it's aligned with what I originally described. For example, \"Make Everything Fantastic\" would only be rated true if nothing declined. There are objective metrics for these things, and in those cases of ambiguity, you side on \"broken promise\" for safety. I don't pretend to have perfect mechanism design on my first try, either - that's why I shared a rough thought which might be developed further. I value investigating questions like \"what is the repercussion of not admitting a broken promise?\" Yet, the existence of such questions does not invalidate the task. It might be worth looking into. Do you see that?</p><p>&nbsp;3. Again, I'm missing your arguments. You're making a claim, and then stating its consequent, without stating its necessary cause(s). What makes this intractable? Leaving-out your arguments implies that you assume you are right, which isn't the \"Scout's Mindset\" that I heard about...</p>", "parentCommentId": "6poQH6mXgYbdCfbsD", "user": {"username": "Anthony Repetto"}}, {"_id": "wQigavmo3TLRNPx5i", "postedAt": "2022-09-22T14:06:55.478Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>Destroying the separation between branches of government is \"really bad\" and not just a random single flaw.&nbsp;</p><blockquote><p>I have a hunch that, if I'd stood in the Second Continental Convention and said, \"What if the check-and-balance the courts could wield over the Legislature and Executive included making them admit their broken campaign promises?\" Ben might wink! \"A Democracy, if you can keep it...\"</p></blockquote><p>The founding fathers believed in the independence of congressmen. The right to be able to say anything in parliament without being prosecuted for it is a key right of parliamentarians in the House of Commons.&nbsp;</p><p>Having a centralized way where the federal government censures the free speech of congressmen would have been opposed by those at the Second Continental Convention and likely be seen as a good way to not have a democracy because democracy needs independent congressmen.&nbsp;</p>", "parentCommentId": "2g3a4qpPHjrfSH8n5", "user": {"username": "ChristianKleineidam"}}, {"_id": "75aBDsAfYotSBoYcj", "postedAt": "2022-09-23T00:41:14.619Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>When someone offers \"what if we measure, to verify their claim?\" - that is what destroys democracy, by limiting the speech of active politicians. Is that correct? Because it seems that \"allowing politicians to lie on campaign to voters, thereby deceiving them in their vote and making that vote a lie\" seems worse than limiting candidates' <i>extravagant claims</i> , only.</p>", "parentCommentId": "wQigavmo3TLRNPx5i", "user": {"username": "Anthony Repetto"}}, {"_id": "2kf377aPDK8jKvsjK", "postedAt": "2022-09-23T08:48:10.921Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>You are giving an organization like a court the ability to censor politicians. They have a political bias. They are going to treat a statement that's coming from a political enemy as a lie when they are treating a similar statement by a political friend as not a lie.&nbsp;</p><p>If you have a 400-page law that pretends to do something about climate change and a politician votes against it because they don't believe that it actually does something about climate change a court can say that they lied in their campaign promise to vote for actions against climate change.&nbsp;</p><p>In a democracy, parliamentarians are supposed to be held to account for their actions as parliamentarians by voters who can evaluate their actions and not by courts.&nbsp;</p><p>Even if you don't believe that voters should not have the responsibility to evaluate parliamentarians but that courts should have that responsibility, the people at the Second Continental Convention believed that it's the responsibility of voters.&nbsp;</p>", "parentCommentId": "75aBDsAfYotSBoYcj", "user": {"username": "ChristianKleineidam"}}, {"_id": "fJNvrE8DJctwDzsTC", "postedAt": "2022-09-23T18:18:29.210Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>Hmm... I suppose we're looking at the \"preferred agent\" as different members: I think of the People as the privileged agents, with statesmen taking an oath to those People, which seems to be a breach of their oath of office if they intentionally misrepresent their goals in office. You favor the statesmen, even when the evidence of history is that voters are repeatedly fooled because there is no reliable account of politicians' actions?</p><p>[Also, the existence of Representative government, by the way, is the admission that each voter <i>not</i> be burdened with every task of verification, and this seems to be another instance of that.]</p>", "parentCommentId": "2kf377aPDK8jKvsjK", "user": {"username": "Anthony Repetto"}}, {"_id": "vTpPRBwFKyBEMww7u", "postedAt": "2022-09-23T19:30:23.586Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<blockquote><p>with statesmen taking an oath to those People</p></blockquote><p>That's not how the political system of the United States is set up. &nbsp;The oath of office for the president is:</p><p>\"I do solemnly swear (or affirm) that I will faithfully execute the office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"</p><p>Congressmen swear:</p><p>\"I do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I take this obligation freely, without any mental reservation or purpose of evasion; and that I will well and faithfully discharge the duties of the office on which I am about to enter: So help me God.\"</p><p>The oath is toward the constitution and not toward citizens. There are reasons for why the oath is written the way it is and why the founders did not want an oath that's about serving the citizens.&nbsp;</p><blockquote><p>You favor the statesmen, even when the evidence of history is that voters are repeatedly fooled because there is no reliable account of politicians' actions?</p></blockquote><p>I don't think in terms of statemen vs. voters.&nbsp;</p><blockquote><p>Also, the existence of Representative government, by the way, is the admission that each voter <i>not</i> be burdened with every task of verification</p></blockquote><p>Yes, you can read a newspaper and outsource the task of verifying to them. That's why it's the fourth estate.&nbsp;</p>", "parentCommentId": "fJNvrE8DJctwDzsTC", "user": {"username": "ChristianKleineidam"}}, {"_id": "dc37wvJty7pkybJPa", "postedAt": "2022-09-24T20:55:06.222Z", "postId": "34XyqopH9fS7g9SZJ", "htmlBody": "<p>Thank you for your detailed critique! I'm glad to hear firm arguments - we are two halves of progress, Speculator and Skeptic. Isn't the Constitution the means by which the Government inherits the Will of the People? Such that, though the oath is directly to the Constitution, it is ultimately to the People? The founders didn't want a <i>direct</i> link, due to the whims of the majority and the moment... yet, we are not slaves to our own Constitution, instead its recipient?</p>", "parentCommentId": "vTpPRBwFKyBEMww7u", "user": {"username": "Anthony Repetto"}}]