[{"_id": "ACWDbAj4PJXkkxhKC", "postedAt": "2022-09-06T11:29:56.032Z", "postId": "35nRwEyzCKDfh3dCr", "htmlBody": "<p>Hi Emrik,<br><br>[I work on the CEA events team]</p><p>Thanks for writing this up :) I don’t totally follow your argument here, sorry. I’ll respond below to some specific points, but please let me know if I’m misunderstanding your core argument.</p><p>I agree online conferences are valuable for many of the reasons you outlined and that’s why I’m excited about EAGxVirtual (applications launching soon!). I also agree that deeper, long-lasting connections are important and that our events should try to create them (I think retreats are particularly good at this, for example).</p><p>However, I disagree with some of the takes here:</p><blockquote><p>Moving almost all real-life EA conferences online</p></blockquote><p>At a high-level, <strong>virtual events score lower on “likelihood to recommend” and “number of new connections made” than in-person events</strong>. I strongly think they’re still worth doing largely because it’s too costly for many people to attend in-person events.<br><br>Furthermore, I don’t quite see how favouring virtual conferences leads you to recommend cancelling in-person ones - you can have more of both!</p><blockquote><p>“The connections EAGs generate are <i>almost exclusively online”</i></p></blockquote><p>What’s your evidence for this? My sense is that being physically co-located with other EAs is highly valuable, and that many people move to EA hubs for this reason</p><blockquote><p>&nbsp;Hence why measuring the <i>number</i> of connections sounds severely misguided to me, especially when you have opportunities to optimise more closely for the correlates of peak friendships.</p></blockquote><p>I would guess that number of connections correlates quite closely with new peak friendships (the more people you meet, the more potential close friends you meet), so I don't think it's misguided.&nbsp;</p>", "parentCommentId": null, "user": {"username": "OllieBase"}}, {"_id": "yZjMpN7FtRuEfgGyM", "postedAt": "2022-09-06T22:38:57.238Z", "postId": "35nRwEyzCKDfh3dCr", "htmlBody": "<p>After talking a bit with Ruth Grace Wong about it, I admit to having framed this entire thingthink I should just reframe this entire thing. I’m not trying to <i>reduce</i> irl activity. I’m more concerned with the idea that irl EAG(x)s are short, and connections made are largely long-distance. People meet wonderfwl people they’d like to keep in touch with over the weekend, but because they live far apart, it’s hard to maintain the connection.</p><p>As you point out, <a href=\"https://forum.effectivealtruism.org/posts/M5GoKkWtBKEGMCFHn/what-s-the-theory-of-change-of-come-to-the-bay-over-the\"><u>moving to a hub</u></a> makes it a lot easier to maintain connections because there’s less stress involved with seeing each other frequently. But realistically, most people aren’t going to move to stay in touch, either because they lack the opportunity or inclination. And even if most people <i>did </i>move, I think there’s still a lot of value to making it easier for people to keep in touch after they fly back to their respective homes from just having met at EAG. I think the virtual aspects of community building have been neglected, and marginal efforts to optimise this can pay manyfold greater dividends. : )</p><blockquote><p><i>“I would guess that number of connections correlates quite closely with new peak friendships”</i></p></blockquote><p>My best friends have all come about because we’ve shared spaces where we serendipitously see each other frequently (e.g. the Gather Town coworking space we use). Regular contact is <i>really important</i>. I’ve met several people whom I would consider very usefwl to interact frequently with, but because those interactions would have to be scheduled, they rarely reach their potential. I think people maybe underestimate how much of a hassle it can be for most people to keep scheduling things, even if the call itself is very positive. The scheduling aspect just makes it a lot costlier to maintain.</p><p>I’ve had conversation-length interactions with many more high-compatibility EAs than the number of EAs that I’ve shared office space with, yet it’s overwhelmingly the EAs I’ve shared daily interactions with who have ended up important to me (important in the sense that they keep me going and help &amp; inspire me to do good). On Bayes then, this implies that conversation-length first-impressions have very inferior conversion rates to lasting friendships compared to online shared office spaces--even if the latter generates fewer first-pass \"connections\". Hence why the metric itself seems ill-advised when applied to different activities.</p><p>This is part of my reasoning for why I want <strong>EAG(x)s to be </strong><i><strong>specifically optimised</strong></i><strong> as on-ramps for regular meeting-places online</strong> (virtual hubs), like EA Anywhere, mastermind groups, <a href=\"https://forum.effectivealtruism.org/groups/e4ijnQ45gevf8Qcck\">EAVR</a>, or especially coworking office spaces like <a href=\"https://forum.effectivealtruism.org/groups/MCtKD7oex9jhsAWvD\"><u>EAGT</u></a> or Complice.</p><p>The latter spaces also serve as places for the community to just hang out online, and attendance is less <a href=\"https://forum.effectivealtruism.org/posts/EpMQBmQv7e4yaDYYN/community-building-solely-as-a-tool-for-impact-creates-toxic\"><u>explicitly focused on having impact</u></a>.</p><blockquote><p><i>The sign of having a healthy community is that when people burn out and need to take a break from trying to have impact, they don't also feel the need to take a break from the community. <strong>The community is their refuge.</strong></i></p></blockquote><p>Anne Wissemann (from the <a href=\"https://forum.effectivealtruism.org/posts/LR2LG8wggLTG5Gjbe/ea-workspace-virtual-co-working-chatroom-for-eas\"><u>EA Workspace</u></a> project in 2015) also talks about how important it is to have spaces to casually bump into each other for the maintenance of friendship:</p><blockquote><p><i>“Many of us have full schedules and Skype calls to uphold friendships pose a real cost on time and flexibility and can be a pain to arrange. Keeping in touch via the EAW is easy - you’re bound to bump into each every once in a while if you work at similar times. It doesn’t cost you any additional time since you were having a break anyways, and you can make progress on your projects in the meantime. Win-win!”</i></p></blockquote><p>The effect both on happiness and akrasia on finding important value-aligned friends in a daily-interacting coworking environment is <a href=\"https://docs.google.com/forms/d/1KsADx-Zh8hqTSXxgi9vUIn44FEwknXifiPGifoAxo_o/viewanalytics\"><u>hard</u></a> to <a href=\"https://www.lesswrong.com/posts/EYKRYNzdrZ4LH2jma/less-wrong-study-hall-year-1-retrospective#Hedonic_Impact__Hedonic_improvement_in_the_Hall__1_5__1_being_no_negative_impact__5_being_large_impact_\"><u>understate</u></a>, and the solutions are far from saturated with all the people who could benefit from them.</p><p>Btw, I'd be eager to talk about<a href=\"https://docs.google.com/document/d/1Zdsii4c8kbXmgzsEkboTrRcSFiiRco6WqeB7IKW4vXI/\"> <u>some plans</u></a> we have to grow the online office/hub thing, and how CEA might be able to help, if you have time and inclination. Feel free to<a href=\"https://calendly.com/emrik/talking\"> <u>book a time</u></a> with me if that sounds interesting to you! Otherwise, thanks for commenting on my post and have a nice day. : )</p><p>For the pony!</p>", "parentCommentId": "ACWDbAj4PJXkkxhKC", "user": {"username": "Emrik"}}, {"_id": "HypiXBRZ7pvDK93KS", "postedAt": "2022-09-09T16:39:57.214Z", "postId": "35nRwEyzCKDfh3dCr", "htmlBody": "<blockquote><p>I think the virtual aspects of community building have been neglected, and marginal efforts to optimise this can pay manyfold greater dividends. :)</p></blockquote><p><br>I agree with this! :)&nbsp;</p><blockquote><p>On Bayes then, this implies that conversation-length first-impressions have very inferior conversion rates to lasting friendships compared to online shared office spaces</p></blockquote><p>I think you’re updating a bit too much on your own experiences here. This seems possible to me, but I also know that many people find virtual interactions more draining (myself included).</p><p>Very inferior also doesn’t sound right to me - I regularly talk to people who make close friends at conferences and retreats (again, retreats seem better for the thing you’re describing) and our data suggests this is a regular occurrence.<br><br>I don’t have data for the virtual spaces &gt; close friends pipeline, but I would be surprised if it was markedly better. But let's do both!</p><blockquote><p>This is part of my reasoning for why I want&nbsp;<strong>EAG(x)s to be&nbsp;</strong><i><strong>specifically optimised</strong></i><strong>&nbsp;as on-ramps for regular meeting-places online</strong></p></blockquote><p>Promoting these things alongside hubs and future events seems good :) Again, I don’t see why we should privilege online spaces to the extent that you’re pushing here, and I disagree that EAGx events should specifically optimised for anything.<br><br>The plans for a virtual EA office look really exciting :) I’ve requested comment access to that doc :)&nbsp;</p>", "parentCommentId": "yZjMpN7FtRuEfgGyM", "user": {"username": "OllieBase"}}, {"_id": "C5kE4ZaAxuF6whcXN", "postedAt": "2022-09-09T17:04:15.057Z", "postId": "35nRwEyzCKDfh3dCr", "htmlBody": "<p>I think I have a tendency to explain/talk things with much simpler models than I actually operate with, and I should adjust. But to be clear, I think yeah, EAG(x) shouldn't be exclusively optimised as on-ramps. What I meant by \"specifically optimised\" wasn't \"exclusively\", but I realise I wasn't being very clear. And I agree that retreats sound more conducive to friendships than online interactions for most people.</p><p>What I hope for is just that the a virtual hub/coworking office that's always accessible (this could be EAGT, but anything that serves the purpose is fine) is advertised at EAG(x)s as a way to keep in touch with the people you meet. And perhaps that CEA helps advertise the coworking week starting at the 24th to give it some credibility. But that's only if you think it's a good idea, and I don't want to come across as too much of a salesperson. :p</p><p>I'm on a vacation 'till Monday, so I won't be optimising the document much until then, but thanks for noticing us. Have a happy weekend!&nbsp;</p>", "parentCommentId": "HypiXBRZ7pvDK93KS", "user": {"username": "Emrik"}}]