[{"_id": "8y7MmPRZQrdGLMfrS", "postedAt": "2017-07-21T16:04:18.053Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<p>Some of the reasons you gave in favor of autonomy come from a perspective of subjective pragmatic normativity rather than universal moral values, and don't make as much sense when society as a whole is analyzed. E.g.:</p>\n<blockquote>\n<p>You disagree with the larger system for moral reasons, for example if it is using slavery or polluting the seas. You may wish to opt out of the larger system in whole or in part so you are not contributing to the activity you disagree with.</p>\n</blockquote>\n<p>But it's equally plausible that the larger system will be enforcing morally correct standards and a minority of individuals will want to do something wrong (like slavery or pollution). </p>\n<blockquote>\n<p>The larger system is hostile to you. It is an authoritarian or racist government.  There are plenty examples of this happening in history, so it will probably happen again.</p>\n</blockquote>\n<p>Individuals could be disruptive or racist, and the government ought to restrain their ability to be hostile towards society.</p>\n<p>So when we decide how to alter society as a whole, it's not clear that more autonomy is a good thing. We might be erring on different sides of the line in different contexts.</p>\n<p>Moreover, I don't see a reason that we ought to intrinsically value autonomy. The reasons you gave only support autonomy instrumentally through other values. So we should just think about how to reduce catastrophic risks and how to improve the economic welfare of everyone whose jobs were automated. Autonomy may play a role in these contexts, but it will then be context-specific, so our definition of it and analysis of it should be contextual as well.</p>\n<blockquote>\n<p>The autonomy view vastly prefers a certain outcome to the airisk question. It is not in favour of creating a single AI that looks after us all (especially not by uploading)</p>\n</blockquote>\n<p>But by the original criteria, a single AI would (probably) be robust to catastrophe due to being extremely intelligent and having no local competitors. If it is a good friendly AI, then it will treat people as they deserve, not on the basis of thin economic need, and likewise it will always be morally correct. It won't be racist or oppressive. I bet no one will want to leave its society, but if we think that that right is important then we can design an AI which allows for that right. </p>\n<p>I think this is the kind of problem you frequently get when you construct an explicit value out of something which was originally grounded in purely instrumental terms - you reach some inappropriate conclusions because future scenarios are often different from present ones in ways that remove the importance of our present social constructs.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "6jGCsxkbxbZL2fu3f", "postedAt": "2017-07-21T18:11:49.163Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<blockquote>\n<p>But it's equally plausible that the larger system will be enforcing morally correct standards and a minority of individuals will want to do something wrong (like slavery or pollution).</p>\n</blockquote>\n<p>Both of these would impinge on the vital sets of others though (slavery directly, pollution by disrupting the natural environment people rely on). So it would still be a bad outcome from the autonomy viewpoint if these things happened. </p>\n<p>The autonomy viewpoint is only arguing that lots of actions should physically possible for people, all the actions physically possible aren't necessarily morally allowed.</p>\n<p>Which of these three scenarios is best?:</p>\n<ol>\n<li>No one has guns so no-one gets shot</li>\n<li>Everyone has guns and people get shot because they have accidents</li>\n<li>Everyone has guns but no-one gets shot because they are well trained and smart.</li>\n</ol>\n<p>The autonomy viewpoint argues that the third is the best possible outcome and tries to work towards it. There are legitimate uses for guns.</p>\n<p>I don't go into how these things should be regulated, as this is a very complicated subject. I'll just point out that to get the robust free society that I want you would need to not regulate the ability to do these things, but make sure the incentive structures and education is correct. </p>\n<blockquote>\n<p>I don't see a reason that we ought to intrinsically value autonomy. The reasons you gave only support autonomy instrumentally through other values.</p>\n</blockquote>\n<p>I don't think I can argue for intrinsically valuing anything. I agree with not being able to argue <a href=\"https://en.wikipedia.org/wiki/Is%E2%80%93ought_problem\">ought from is</a>. So the best I can do is either claim it as a value, which I do, and refer to other value systems that people might share. I suppose I could talk about <a href=\"https://en.wikipedia.org/wiki/Live_Free_or_Die\">other people</a> who value autonomy in itself. Would you find that convincing? </p>\n<blockquote>\n<p>But by the original criteria, a single AI would (probably) be robust to catastrophe due to being extremely intelligent and having no local competitors. </p>\n</blockquote>\n<p>Unless it is omniscient I don't see how it will see all threats to itself. It may lose a gamble on the logical induction lottery and make an ill-advised change to itself.</p>\n<p>Also what happens if a decisive strategic advantage is not possible and this hypothetical single AI does not come into existence. What is the strategy for that chunk of probability space?</p>\n<blockquote>\n<p>If it is a good friendly AI, then it will treat people as they deserve, not on the basis of thin economic need, and likewise it will always be morally correct. It won't be racist or oppressive. </p>\n</blockquote>\n<p>I'm personally highly skeptical that this will happen.</p>\n<blockquote>\n<p>I bet no one will want to leave its society, but if we think that that right is important then we can design an AI which allows for that right.</p>\n</blockquote>\n<p>How would that be allowed if those people might create a competitor AI?</p>\n<blockquote>\n<p>you reach some inappropriate conclusions because future scenarios are often different from present ones in ways that remove the importance of our present social contexts.</p>\n</blockquote>\n<p>Like I said in the article, if I was convinced of decisive strategic advantage my views of the future would be very different. However as I am not, I have to think that the future will remain similar to the present in many ways.</p>\n", "parentCommentId": "8y7MmPRZQrdGLMfrS", "user": {"username": "WillPearson"}}, {"_id": "8s9jfLHaaJ8Hhc7t8", "postedAt": "2017-07-22T08:22:05.872Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<p><a href=\"https://philosophicaldisquisitions.blogspot.fi/2017/06/the-tell-tale-brain-effect-of.html\">Another discussion and definition of autonomy</a>, by philosopher John Danaher:</p>\n<blockquote>\n<p>Many books and articles have been written on the concept of ‘autonomy’. Generations of philosophers have painstakingly identified necessary and sufficient conditions for its attainment, subjected those conditions to revision and critique, scrapped their original accounts, started again, given up and argued that the concept is devoid of meaning, and so on. I cannot hope to do justice to the richness of the literature on this topic here. Still, it’s important to have at least a rough and ready conception of what autonomy is and the most general (and hopefully least contentious) conditions needed for its attainment.</p>\n</blockquote>\n<blockquote>\n<p>I have said this before, but I like Joseph Raz’s general account. Like most people, he thinks that an autonomous agent is one who is, in some meaningful sense, the author of their own lives. In order for this to happen, he says that three conditions must be met:</p>\n</blockquote>\n<blockquote>\n<p><em>Rationality condition:</em> The agent must have goals/ends and must be able to use their reason to plan the means to achieve those goals/ends.</p>\n</blockquote>\n<blockquote>\n<p><em>Optionality condition:</em> The agent must have an adequate range of options from which to choose their goals and their means.</p>\n</blockquote>\n<blockquote>\n<p><em>Independence condition:</em> The agent must be free from external coercion and manipulation when choosing and exercising their rationality.</p>\n</blockquote>\n<blockquote>\n<p>I have mentioned before that you can view these as ‘threshold conditions’, i.e. conditions that simply have to be met in order for an agent to be autonomous, or you can have a slightly more complex view, taking them to define a three dimensional space in which autonomy resides. In other words, you can argue that an agent can have more or less rationality, more or less optionality, and more or less independence. The conditions are satisfied in degrees. This means that agents can be more or less autonomous, and the same overall level of autonomy can be achieved through different combinations of the relevant degrees of satisfaction of the conditions. That’s the view I tend to favour. I think there possibly is a minimum threshold for each condition that must be satisfied in order for an agent to count as autonomous, but I suspect that the cases in which this threshold is not met are pretty stark. The more complicated cases, and the ones that really keep us up at night, arise when someone scores high on one of the conditions but low on another. Are they autonomous or not? There may not be a simple ‘yes’ or ‘no’ answer to that question.</p>\n</blockquote>\n<blockquote>\n<p>Anyway, using the three conditions we can formulate the following ‘autonomy principle’ or ‘autonomy test’:</p>\n</blockquote>\n<blockquote>\n<p><em>Autonomy principle:</em> An agent’s actions are more or less autonomous to the extent that they meet the (i) rationality condition; (ii) optionality condition and (iii) independence condition.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Kaj_Sotala"}}, {"_id": "fN2WLHAQ6ApRm5Evo", "postedAt": "2017-07-22T10:27:00.593Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<p>Thanks. I know I need to do more reading around this. This looks like a good place to start.</p>\n", "parentCommentId": "8s9jfLHaaJ8Hhc7t8", "user": {"username": "WillPearson"}}, {"_id": "iDik4kcDew5gFcNeJ", "postedAt": "2017-08-16T13:06:03.615Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<blockquote>\n<p>I don't think I can argue for intrinsically valuing anything. I agree with not being able to argue ought from is. </p>\n</blockquote>\n<p>The is-ought problem doesn't say that you can't intrinsically value anything. It just says that it's hard. There's lots of ways to argue for intrinsically valuing things, and I have a reason to intrinsically value well-being, so why should I divert attention to something else?</p>\n<blockquote>\n<p>Unless it is omniscient I don't see how it will see all threats to itself. </p>\n</blockquote>\n<p>It will see most threats to itself in virtue of being very intelligent and having a lot of data, and will have a much easier time by not being in direct competition. Basically all known x-risks can be eliminated if you have zero coordination and competition problems.</p>\n<blockquote>\n<p>Also what happens if a decisive strategic advantage is not possible and this hypothetical single AI does not come into existence. What is the strategy for that chunk of probability space?</p>\n</blockquote>\n<p>Democratic oversight, international cooperation, good values in AI, FDT to facilitate coordination, stuff like that.</p>\n<blockquote>\n<p>I'm personally highly skeptical that this will happen.</p>\n</blockquote>\n<p>Okay, but the question was &quot;is a single AI a good thing,&quot; not &quot;will a single AI happen&quot;.</p>\n<blockquote>\n<p>How would that be allowed if those people might create a competitor AI?</p>\n</blockquote>\n<p>It will be allowed by allowing them to exist without allowing them to create a competitor AI. What specific part of this do you think would be difficult? Do you think that everyone who is allowed to exist must have access to supercomputers free of surveillance?</p>\n", "parentCommentId": "6jGCsxkbxbZL2fu3f", "user": {"username": "kbog"}}, {"_id": "aPrwGLyNPszFX2xpc", "postedAt": "2017-08-18T18:13:11.629Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<blockquote>\n<p>The is-ought problem doesn't say that you can't intrinsically value anything</p>\n</blockquote>\n<p>I never said it did, I said it means I can't <em>argue</em> that you should intrinsically value anything. What arguments could I give to a paper clipper to stop its paper clipping ways.</p>\n<p>That said I do think I can argue for a plurality of intrinsic values. </p>\n<p>1) They allow you to break ties. If there are two situations with equal well being then having a second intrinsic value would give you a way of picking between the two.</p>\n<p>2) It might be computationally complicated or informationally complicated to calculate your intrinsic value. Having another that is not at odds with it and generally correlates with it allows you to optimise for that. For example you could optimise for political freedom which would probabilistically lead to more eudaemonia, even if it is not the case that more political freedom always leads to more eudaemonia under all cases. As you can't measure the eudaemonia of everyone.</p>\n<blockquote>\n<p>It will see most threats to itself in virtue of being very intelligent and having a lot of data, and will have a much easier time by not being in direct competition. Basically all known x-risks can be eliminated if you have zero coordination and competition problems.</p>\n</blockquote>\n<p>I am thinking about unknown internal threats. One possibility that I alluded to is if it modifies itself to improve itself, but it does that on shakey premise and destroys itself. Another possibility is that parts of may degrade and/or get damaged and it gets the equivalent of cancers.</p>\n<blockquote>\n<blockquote>\n<p>I'm personally highly skeptical that this will happen.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Okay, but the question was &quot;is a single AI a good thing,&quot; not &quot;will a single AI happen&quot;</p>\n</blockquote>\n<p>I was assuming a single non-morally perfect AI as that seems like the most likely outcome of the drive to a single AI to me.</p>\n<blockquote>\n<p>It will be allowed by allowing them to exist without allowing them to create a competitor AI. What specific part of this do you think would be difficult? Do you think that everyone who is allowed to exist must have access to supercomputers free of surveillance?</p>\n</blockquote>\n<p>If they are not free of surveillance, then they have not left the society. I think it a preferable world if we can allow everyone to have supercomputers because they are smart and wise enough to use them well.</p>\n", "parentCommentId": "iDik4kcDew5gFcNeJ", "user": {"username": "WillPearson"}}, {"_id": "errhfinRJJ8JvReoJ", "postedAt": "2017-08-20T18:34:18.246Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<blockquote>\n<p>I never said it did, I said it means I can't argue that you should intrinsically value anything. What arguments could I give to a paper clipper to stop its paper clipping ways.</p>\n</blockquote>\n<p>Still, this is not right. There are plenty of arguments you can give to a paper clipper, such as Kant's argument for the categorical imperative, or Sidgwick's argument for utilitarianism, or many others.</p>\n<blockquote>\n<p>1) They allow you to break ties. If there are two situations with equal well being then having a second intrinsic value would give you a way of picking between the two.</p>\n</blockquote>\n<p>I don't see why we should want to break ties, since it presupposes that our preferred metric judges the different options to be equal. Moreover, your pluralist metric will end up with ties too.</p>\n<blockquote>\n<p>2) It might be computationally complicated or informationally complicated to calculate your intrinsic value. </p>\n</blockquote>\n<p>Sure, but that's not an argument for having pluralism over intrinsic values.</p>\n<blockquote>\n<p>I am thinking about unknown internal threats. One possibility that I alluded to is if it modifies itself to improve itself, but it does that on shakey premise and destroys itself. Another possibility is that parts of may degrade and/or get damaged and it gets the equivalent of cancers.</p>\n</blockquote>\n<p>If a single ASI is unstable and liable to collapse, then basically every view would count that as a problem, because it implies destruction of civilization and so on. It doesn't have anything to do with autonomy in particular.</p>\n<blockquote>\n<p>I was assuming a single non-morally perfect AI as that seems like the most likely outcome of the drive to a single AI to me.</p>\n</blockquote>\n<p>AI being non-morally perfect doesn't imply that it would be racist, oppressive, or generally as bad or worse as existing or alternative institutions. </p>\n<blockquote>\n<p>If they are not free of surveillance, then they have not left the society. </p>\n</blockquote>\n<p>Why should we care about someone's desire to have a supercomputer which doesn't get checked for the presence of dangerous AGI...? </p>\n", "parentCommentId": "aPrwGLyNPszFX2xpc", "user": {"username": "kbog"}}, {"_id": "xxRSt6KsLnDXy4jhK", "postedAt": "2017-08-21T09:02:34.122Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<p>I think we want different things from our moral systems. I think my morality/value is complicated and best represented by different heuristics that guide how I think or what I aim for. It would take more time than I am willing to invest at the moment to try and explain my views fully.</p>\n<blockquote>\n<p>Why should we care about someone's desire to have a supercomputer which doesn't get checked for the presence of dangerous AGI...?</p>\n</blockquote>\n<p>Why should we care about someone's desire to have their thoughts not checked for the presence of malicious genius? They may use their thinking to create something equally dangerous that we have not yet thought of.</p>\n<p>Why care about freedom at all?</p>\n<p>If I upload and then want to take a spaceship somewhere hard to monitor, will I be allowed to take a super computer, if I need it to perform science?</p>\n<p>What is in my pocket was once considered <a href=\"https://www.armscontrol.org/node/3147\">a dangerous super computer</a>. The majority of the world is now trusted with it, or at least the benefits of having them out weigh the potential costs.</p>\n", "parentCommentId": "errhfinRJJ8JvReoJ", "user": {"username": "WillPearson"}}, {"_id": "aDDR4nhTqa7QtS5ca", "postedAt": "2017-08-22T17:38:24.073Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<p>This <a href=\"https://improvingautonomy.wordpress.com/2017/08/22/how-neglected-is-freedom-in-effective-altruism-measures/\">post</a> covers what I want to get out of my autonomy measure. I think I might have pitched it wrong to start with. It is more along the lines of trying to increase the world economy than a base value. It also covers some of my initial forrays into the research into whether freedom is psychologically useful (I need to find out how reliable these are).</p>\n", "parentCommentId": "6jGCsxkbxbZL2fu3f", "user": {"username": "WillPearson"}}, {"_id": "Jih9pkYvTpgWPPyAc", "postedAt": "2017-08-25T09:52:27.428Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<blockquote>\n<p>Why should we care about someone's desire to have their thoughts not checked for the presence of malicious genius? They may use their thinking to create something equally dangerous that we have not yet thought of.</p>\n</blockquote>\n<p>If you can do that, sure. Some people might have a problem with it though, because you're probing their personal thoughts.</p>\n<blockquote>\n<p>Why care about freedom at all?</p>\n</blockquote>\n<p>Because people like being free and it keeps society fresh with new ideas. </p>\n<blockquote>\n<p>If I upload and then want to take a spaceship somewhere hard to monitor, will I be allowed to take a super computer, if I need it to perform science?</p>\n</blockquote>\n<p>Sure. Just don't use it to build a super-AGI that will take over the world.</p>\n<blockquote>\n<p>What is in my pocket was once considered a dangerous super computer. The majority of the world is now trusted with it, or at least the benefits of having them out weigh the potential costs.</p>\n</blockquote>\n<p>That's because you can't use what is in your pocket to take over the world. Remember that you started this conversation by asking &quot;How would that be allowed if those people might create a competitor AI?&quot; So if you assume that future people can't create a competitor AI, for instance because their computers have no more comparative power to help take over the world than our current computers do, then of course those people can be allowed to do whatever they want and your original question doesn't make sense.</p>\n", "parentCommentId": "xxRSt6KsLnDXy4jhK", "user": {"username": "kbog"}}, {"_id": "Tew4DLk6ZXmDXYTHJ", "postedAt": "2017-08-25T14:16:42.404Z", "postId": "38ZpdnHMcJG9vHKJf", "htmlBody": "<blockquote>\n<blockquote>\n<p>Why care about freedom at all?</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Because people like being free and it keeps society fresh with new ideas.</p>\n</blockquote>\n<blockquote>\n<blockquote>\n<p>If I upload and then want to take a spaceship somewhere hard to monitor, will I be allowed to take a super computer, if I need it to perform science?</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Sure. Just don't use it to build a super-AGI that will take over the world.</p>\n</blockquote>\n<p>What if there is a very small risk that I will do so, lets say 0.0000001%? Using something like the arguments for the cosmic inheritance, this could be seen as likely causing a certain amount of astronomical waste. Judged purely on whether people are alive, this seems like a no go. But if you take into consideration that the society that stops this kind of activity would be less free, and less free for all people throughout history, this is a negative. I am trying to get this negative included in our moral calculus, else I fear we will optimize it away.</p>\n", "parentCommentId": "Jih9pkYvTpgWPPyAc", "user": {"username": "WillPearson"}}]