[{"_id": "s2xg27ouaZAmzC4xh", "postedAt": "2023-01-13T08:42:31.195Z", "postId": "3b3hhDnxxTbDKqcEq", "htmlBody": "<p>Hi Francis, thanks for this thoughtful write-up, I didn't realise so many people were exposed to dangerous levels of arsenic!</p><p>I have some (perhaps) sad news though, that I believe your cost-effectiveness estimates are 10x too optimistic: you list the annual mortality rate in Bangladesh as 5.5%, however the source you cite gives the (far more plausible - 5% would imply a life-expectancy on the order of 20) figure of 5.5 per thousand.</p><p>This, combined with the fact that I basically buy your/others' critique of Argos 2010 that not taking into account socioeconomic differences makes the correlational analysis not very informative, makes me think the bottom line is arsenic interventions are very likely not on the same order of cost-effectiveness as GiveWell top charities.</p><p>Given the above, perhaps this is a moot point, but I am interested in adsorption because you say it is the best intervention. I think it would be useful to say something about the practicalities of the process. Is it as simple as dropping a bag of chemicals into a well and letting chemistry happen? It feels important to me to know how simple (and hence scalable) the intervention is.</p><p>Finally, two suggestions on communication:</p><ul><li>I think the interventions should be listed in the same order in-text and in the table (and it would be an added bonus if interventions were headings and so showed up in the outline on the left of the forum post).</li><li>Your spreadsheet has hard-coded number, instead, for instance I2 should be \"=E2*H2\" not \"=0.003*0.055\". Otherwise when you fix the mortality numbers nothing will happen in the downstream cells.</li></ul>", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "yacc77XHmEmcGeswN", "postedAt": "2023-01-15T04:47:20.923Z", "postId": "3b3hhDnxxTbDKqcEq", "htmlBody": "<p>Thanks Oscar! I really appreciate you catching that. I've revised the post to reflect the more accurate statistics.</p><p>With regards to your question, the sources I found seemed to mostly describe adsorption as a relatively simple process -- e.g. Nicomel et. al. specifically highlighted \"easy operation and handling\" as a major advantage of adsorption (and gave that as a reason for why it has been commonly used in the past).</p>", "parentCommentId": "s2xg27ouaZAmzC4xh", "user": {"username": "Francis"}}, {"_id": "ioSGyGKcrAHThiuad", "postedAt": "2023-01-15T06:00:25.195Z", "postId": "3b3hhDnxxTbDKqcEq", "htmlBody": "<p>OK nice, thanks for the prompt changes, especially the new income effects part of the model!</p>\n", "parentCommentId": "yacc77XHmEmcGeswN", "user": {"username": "Oscar Delaney"}}]