[{"_id": "NnZT9DCJf2yNkiWJ5", "postedAt": "2014-12-01T22:29:32.798Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Technical question: can Harvard EA cross-post articles from our website? We mostly do interviews with people in academia, examples here: <a href=\"http://harvardea.org/blog/\">http://harvardea.org/blog/</a></p>\n", "parentCommentId": null, "user": {"username": "Ales_Flidr"}}, {"_id": "hPP3gJDBgMiPQgX25", "postedAt": "2014-12-01T23:21:43.225Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Post it. It's great to have more relevant content. Take note of whether people vote up your content so you know whether to post more like it.</p>\n", "parentCommentId": "NnZT9DCJf2yNkiWJ5", "user": {"username": "RyanCarey"}}, {"_id": "mzuioHmwC2uZ6MWxv", "postedAt": "2014-12-02T01:17:42.271Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Looks fun to me!</p>\n", "parentCommentId": "NnZT9DCJf2yNkiWJ5", "user": {"username": "Peter_Hurford"}}, {"_id": "wMiCi3TvbYHLJCo7H", "postedAt": "2014-12-02T01:57:01.053Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Does anyone know of any <a href=\"https://gtl.xmp.net/about/intro\">&quot;Go teaching ladder&quot;</a> - type resources for skills other than Go? As a concept, this was discussed at the 2014 EA summit, and it sounds like a great idea for effective learning of many disciplines.</p>\n", "parentCommentId": null, "user": {"username": "AlexCuevas"}}, {"_id": "BNYH7LHCTvC8yaT3i", "postedAt": "2014-12-02T11:02:15.043Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>What do you think counts as earning to give, and what do you think <em>should</em> be the definition of the concept that we use? I'd say it involves taking a job partly because it has good earning potential, and donating a significant proportion of your income. I don't have a particular sense of what the thresholds should be. I don't think these thresholds should be part of a 'public' definition, but they're interesting to think about. 5% might be considered a &quot;significant&quot; proportion, or for high earners you might think at least 50%. Similarly I suspect that people have different senses of the income threshold, though this plausibly depends on the options that are reasonably open to a particular individual.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "g3c6TJqT6SPumPgFY", "postedAt": "2014-12-02T11:50:35.972Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>My internal definition is &quot;take a job (or build a business) so that you donate more than you otherwise would have&quot; [1].  It's too minimalist a definition to work in every case (it'd be unreasonable to call someone on a $1mn salary who donates $1000 &quot;earning to give&quot;, even if they wouldn't donate anything on $500k), but if you're the sort of person who considers &quot;how much will I donate to charity&quot; as an input into their choice of job, then I think the definition will work most of the time.</p>\n<p>There probably needs to be a threshold amount donated for &quot;earning to give&quot; to be applied in an EA context, but I don't see the need for a progressive percentage scale for higher-income earners.  If you're giving 10% of $1mn, then you're doing a lot more than me and my higher percentage of a lot less.</p>\n<p>[1] That needs a bit of pedantic re-writing for it to perfectly match what I mean.  e.g., I consider myself earning to give because if it wasn't for my pesky conscience, I'd negotiate a reduced salary for a four-day work week.  It'd still be basically the same job, just a different contract... anyway I don't think this sort of pedantry is important here.</p>\n", "parentCommentId": "BNYH7LHCTvC8yaT3i", "user": {"username": "pappubahry"}}, {"_id": "wTt5zjvxmH4uodYP5", "postedAt": "2014-12-02T14:00:50.984Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<blockquote>\n<p>My internal definition is &quot;take a job (or build a business) so that you donate more than you otherwise would have&quot;</p>\n</blockquote>\n<p>I think that'd have to be &quot;<em>in part</em> so that you donate more than you otherwise would have&quot;. And it doesn't capture people who'd have taken their jobs anyway, like several EtG-ers in finance. But this is nitpicking - it's a pretty good definition.</p>\n", "parentCommentId": "g3c6TJqT6SPumPgFY", "user": {"username": "Tom_Ash"}}, {"_id": "MrZvwuS4jJW8cwdvv", "postedAt": "2014-12-02T15:47:04.128Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Can anyone help me find an article I saw yesterday and then lost track of? My memory is that it was from the NYT (but possibly another paper). It was by a Mormon who talked about how surprised he was that so few people donate 10%.</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "QqskCDsouGiPgScfk", "postedAt": "2014-12-02T15:49:06.086Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I often wonder about this with my own career. It's not particularly high earning but I do donate a high percentage (50%). I don't think it really makes sense to use this as an example of earning to give, since it's more simply described as &quot;giving a high percentage.&quot;</p>\n", "parentCommentId": "BNYH7LHCTvC8yaT3i", "user": {"username": "Julia_Wise"}}, {"_id": "GJJgAQ6RZ5WeZ5P9F", "postedAt": "2014-12-02T17:47:57.244Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Was it this one? <a href=\"http://www.nytimes.com/2014/11/24/your-money/if-giving-feels-so-good-why-dont-we-do-it.html\">http://www.nytimes.com/2014/11/24/your-money/if-giving-feels-so-good-why-dont-we-do-it.html</a></p>\n", "parentCommentId": "MrZvwuS4jJW8cwdvv", "user": {"username": "Andy_Schultz"}}, {"_id": "yXfe3cNkAWgp555n3", "postedAt": "2014-12-02T22:54:16.670Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I think of earning to give as a <em>strategy</em>, rather than a place you're at. Pursuing earning to give will nudge you in the direction of:</p>\n<ul>\n<li>giving a larger % of income to charity</li>\n<li>giving some conscious thought to your career, taking earning potential into consideration</li>\n<li>keeping up to date with which charities seem the most cost effective</li>\n</ul>\n<p>But you don't have to do all those things, or do them especially well, or do them a certain amount to say you're pursuing an earning to give strategy.</p>\n", "parentCommentId": "BNYH7LHCTvC8yaT3i", "user": {"username": "Giles"}}, {"_id": "gotuSTXSa9gmaE6z2", "postedAt": "2014-12-02T23:08:24.799Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>We could make one.</p>\n<p>If everyone on the ladder is EA-aligned then each person benefits from teaching almost as much as learning. It makes me think of <a href=\"http://skillshare.im/\">Skillshare.im</a>, though the structure is a little different.</p>\n", "parentCommentId": "wMiCi3TvbYHLJCo7H", "user": {"username": "Giles"}}, {"_id": "mH7LtYB29RRPfSejv", "postedAt": "2014-12-03T00:10:04.874Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>If I click the &quot;New to Effective Altruism&quot; link in the sidebar, I get a page with very little information asking for my email address. Is this what we want?</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "HQpmn8uvorb4xiwDW", "postedAt": "2014-12-03T00:55:17.840Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I think the page in question is under construction, but the link should be fixed.</p>\n", "parentCommentId": "mH7LtYB29RRPfSejv", "user": {"username": "Peter_Hurford"}}, {"_id": "TCNBsuLazwk4oJhNB", "postedAt": "2014-12-03T01:33:40.841Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Never saw that skillshare resource, thanks for the link.</p>\n<p>I was hoping to find a platform that already existed within the general public, so we could benefit from people based on their skills &amp; teaching ability rather than their EA orientation. We even get some advocacy potential there if we form bonds with our teachers/students and get to explain why we want to learn/teach certain skills.</p>\n<p>If no such platform exists, I think making one could be a very high-value proposition. There are definite advantages to the ladder structure vs lecture style teaching.</p>\n", "parentCommentId": "gotuSTXSa9gmaE6z2", "user": {"username": "AlexCuevas"}}, {"_id": "47wPo23RREtDsQwdS", "postedAt": "2014-12-04T10:27:14.520Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>What are some good introductions to Effective Altruism?</p>\n", "parentCommentId": "HQpmn8uvorb4xiwDW", "user": {"username": "jayd"}}, {"_id": "hkPcbDTNLRuqAWKnX", "postedAt": "2014-12-04T12:15:05.758Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>If you click 'More on Effective Altruism' in the sidebar, the essays under 'what is effective altruism' are the best introductions I've found so far.</p>\n", "parentCommentId": "47wPo23RREtDsQwdS", "user": {"username": "RyanCarey"}}, {"_id": "6H7FPtymFz7AE3zkh", "postedAt": "2014-12-04T12:17:31.625Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Good feedback guys. I've forwarded this to Kerry Vaughan, who is planning some A/B tests on that site. I'm happy to leave the site there from now, and to wait to hear from them.</p>\n", "parentCommentId": "HQpmn8uvorb4xiwDW", "user": {"username": "RyanCarey"}}, {"_id": "2MQ6w4Xbb6QhJzRG5", "postedAt": "2014-12-04T20:40:28.545Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I'm relaunching local EA meetups in Toronto, yay!</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "b2rnvcnCRgNpwcz2J", "postedAt": "2014-12-05T03:55:58.211Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I was having a look at the total budgets for various EA orgs to see what the overall balance looks like:</p>\n<p>Meta (3.8%)</p>\n<ul>\n<li>GW 2.7%</li>\n<li>ACE 0.2%</li>\n<li>80K 0.2%</li>\n<li>GWWC 0.2%</li>\n<li>LYCS 0.5%</li>\n</ul>\n<p>Poverty (79.6%)</p>\n<ul>\n<li>AMF 7.6%</li>\n<li>GD 54.9%</li>\n<li>SCI 9.8%</li>\n<li>DtW 7.3%</li>\n</ul>\n<p>Animal (11.2%)</p>\n<ul>\n<li>AE 0.9%</li>\n<li>THL 1.5%</li>\n<li>MFA 8.8%</li>\n</ul>\n<p>xrisk (5.4%)</p>\n<ul>\n<li>MIRI 5.4%</li>\n</ul>\n<p>I was unable to find figures for FHI, FLI, CSER, GCRI or CFAR so the meta and xrisk portions are going to be larger than this. Also note that, along with usual caveats, these figures are <em>probably wrong</em> as I wasn't putting much care into them. Let me know if I should tidy this up a bit and write a post on it or whether the whole exercise is a waste of time.</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "DofMRn4ic7hMCq5uT", "postedAt": "2014-12-05T08:31:31.194Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Thanks for putting this together! It's interesting enough that I hope it doesn't get buried in the open thread.</p>\n<p>You could add <a href=\"http://www.charityscience.com/about-us.html\">Charity Science</a> to the Meta section as the organisation focused on fundraising for GiveWell-recommended charities. Though it wouldn't affect the figures much, as we could support the three of us if we got less than 0.02%.</p>\n<p>I also understand that FHI's budget is quite large, so it would change the figures somewhat. It might be worth emailing sean . oheigeartaigh at philosophy.ox.ac.uk to find out the budget for it and CSER.</p>\n", "parentCommentId": "b2rnvcnCRgNpwcz2J", "user": {"username": "Tom_Ash"}}, {"_id": "kuGdZWXJ5NfLtkL2g", "postedAt": "2014-12-05T10:30:24.252Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>My very vague guess would be that GCRI, CSER and FLI have $200k/yr, CFAR $400k/yr and FHI $600k/yr.</p>\n<p>It would also be interesting to think about how much of a demand these organisations place on EA donors as opposed to academic grants.</p>\n<p>See also <a href=\"http://lesswrong.com/lw/7sc/siai_vs_fhi_achievements_20082010/\">here</a> for more figures.</p>\n", "parentCommentId": "b2rnvcnCRgNpwcz2J", "user": {"username": "RyanCarey"}}, {"_id": "ZXGcLP58N3s2w5vM4", "postedAt": "2014-12-05T13:46:37.447Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>It'd be good to add links to more EA resources in the sidebar rather than just directing everyone to the &quot;New to Effective Altruism?&quot; website, especially now while it isn't a particularly good link for that purpose, but also in general, no matter how good that one website is.</p>\n", "parentCommentId": "6H7FPtymFz7AE3zkh", "user": {"username": "Nekoinentr"}}, {"_id": "vABZoFjrRsKYN2MSi", "postedAt": "2014-12-05T19:19:10.895Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I would be interested in more detailed numbers on these, including the numbers for spending in $s as well as the %. </p>\n", "parentCommentId": "b2rnvcnCRgNpwcz2J", "user": {"username": "Joey"}}, {"_id": "po74GYGK86A64d4cM", "postedAt": "2014-12-05T20:37:44.838Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Hey Giles! The current page is, admittedly, not very informative. We're currently using Unbounce to test a number of hypotheses that will inform the building of the completed effectivealtruism.org.</p>\n<p>A more informative page will be coming soon.</p>\n", "parentCommentId": "mH7LtYB29RRPfSejv", "user": {"username": "Kerry_Vaughan"}}, {"_id": "DqC4awR6rgaiQ9dGc", "postedAt": "2014-12-05T21:51:50.612Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Yes, I should at least make a links page. Any suggestions beyond <a href=\"http://effectivealtruismhub.com/links\">these</a>, and <a href=\"https://gratipay.com/for/effective-altruists/\">Gratipay</a>, which Diego has previously suggested?</p>\n", "parentCommentId": "ZXGcLP58N3s2w5vM4", "user": {"username": "RyanCarey"}}, {"_id": "o6pMaZeQwhdSjYury", "postedAt": "2014-12-06T09:58:31.869Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Great! I was thinking of resources more like Gratipay going directly into the sidebar, rather than a long links page like that one. Gratipay would be worth linking to if that link leads to more money exchanged. In general the things that could benefit from more exposure are the main .impact projects - SkillShare, the EA Donation Registry, the EA Profiles/map (one link would cover both) and the new podcast. Have you talked to the .impact people about this and got their take? It seems worth coordinating these web-based projects with them.</p>\n", "parentCommentId": "DqC4awR6rgaiQ9dGc", "user": {"username": "Nekoinentr"}}, {"_id": "MFy5gPCY7gETeob96", "postedAt": "2014-12-06T16:52:27.918Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I like the links <a href=\"http://www.reddit.com/r/smartgiving\">in the sidebar of r/smartgiving</a>.</p>\n", "parentCommentId": "DqC4awR6rgaiQ9dGc", "user": {"username": "Peter_Hurford"}}, {"_id": "9mkZJoqbwQdc3AP3T", "postedAt": "2014-12-07T04:05:56.620Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Just stumbled upon this in Baron's <em>Thinking and Deciding</em>:</p>\n<p><em>&quot;For example, Breyer (1993) argues that the removal of asbestos from school buildings might, if it were done throughout the United States, would cost about $100,000,000,000 and save about 400 lives over a period of 40 years. This comes to $250,000,000 per life saved. (And it might not save any lives at all in total, because it endangers the workers who do the removal.)&quot;</em> - BARON, J. Thinking and Deciding, p.502. New York : Cambridge University Press, 2008.</p>\n<p>Does anyone know more about the actual implementation/figures? If it was anywhere close to truth, it could serve as PlayPumps-style example of ridiculously ineffective altruism for x-risk.</p>\n", "parentCommentId": null, "user": {"username": "Ales_Flidr"}}, {"_id": "sbNdvR9c38YxCxEct", "postedAt": "2014-12-07T06:17:04.729Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<blockquote>\n<p>ridiculously ineffective altruism for x-risk.</p>\n</blockquote>\n<p>Why &quot;for x-risk&quot; in particular?</p>\n", "parentCommentId": "9mkZJoqbwQdc3AP3T", "user": {"username": "Peter_Hurford"}}, {"_id": "FNWJdRWShkYi3m5kW", "postedAt": "2014-12-07T09:01:32.962Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I came across Toby Ord's <a href=\"http://www.gooddoneright.com/#!toby-ord/c1dae\">&quot;moral trade&quot;</a> proposal recently. As far as I can tell (correct me if I'm wrong), it's intended to let effective altruists with different values to cooperate and reach a mutually beneficial outcome - for example, if I think that Thing A is good, and you think that it's bad, we can avoid wasting our money by agreeing not to donate to charities that are primarily about promoting or opposing Thing A. This seems most applicable to animal rights/ethics and population ethics, where there's little consensus on how valuable particular outcomes are.</p>\n<p>My question is: how would moral trade work on a large scale when it involves agreeing <em>not</em> to do something? (I'm particularly interested in the case of population changes, where EAs with different population-ethical views might have incompatible goals.) It seems like &quot;cheating&quot; would be quite hard to prevent, since it's hard to detect secret donations.</p>\n", "parentCommentId": null, "user": null}, {"_id": "JoWj5zCnRR7w2CR5N", "postedAt": "2014-12-07T15:34:11.856Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Not necessarily, but it's a risk management issue, so it seems like a good fit. Could be equally useful for other EA causes, though. I'll look at it after I'm done with my finals in a week or so.</p>\n", "parentCommentId": "sbNdvR9c38YxCxEct", "user": {"username": "Ales_Flidr"}}, {"_id": "MYTqNiQaXvZjA823H", "postedAt": "2014-12-09T23:26:31.793Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I've taken the liberty of adding this project idea to .impact. Feel free to improve it!</p>\n<p><a href=\"https://impact.hackpad.com/Skills-Teaching-Ladder-ejESyTh9DN9\">https://impact.hackpad.com/Skills-Teaching-Ladder-ejESyTh9DN9</a></p>\n", "parentCommentId": "TCNBsuLazwk4oJhNB", "user": {"username": "Giles"}}, {"_id": "Ch5vqShq2nvi99qJH", "postedAt": "2014-12-13T05:55:39.330Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Far future fossil fuels might be more valuable. I mean, suppose we never find better energy sources. Oil would be a one-time gift from the planet. It seems like our civilization would get the best cumulative use if we saved most for future generations and only used today what was absolutely needed. I wonder how big the gains would be. </p>\n", "parentCommentId": null, "user": {"username": "Alexander"}}, {"_id": "yS2Y26TGbXzjNTMgw", "postedAt": "2014-12-13T18:21:51.388Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>If fossil fuels will be more valuable in the future, we would expect companies that own reserves to delay exploiting them so they can instead sell them in the future. We would also expect the <a href=\"http://www.cmegroup.com/trading/energy/crude-oil/light-sweet-crude.html\">forward curve for oil</a> to be upwards-sloping. The latter is true, but only because the spot price has fallen so much over the past 4 months; 6 months ago the spot price of oil was well above the price of oil in 2020.</p>\n<p>Now, you might object that private actors would only save the oil if they expected to make returns greater than current interest rates; otherwise they would be better off producing now and saving they money. As such, if oil is more valuable in the future, but only a little bit, private firms would inefficiently produce now. But this is not a special feature of oil - this is a fully general complaint against positive interest rates. </p>\n<p>So essentially either:</p>\n<ul>\n<li>You are better at predicting future demand than the highly liquid oil futures market</li>\n<li>Interest rates are too high</li>\n<li>The market is currently efficient; there are no gains from such a plan.</li>\n</ul>\n<p><a href=\"http://daviddfriedman.blogspot.com/2010/11/sustainability-part-ii.html\">Here is a related post by David Friedman on Sustainability</a></p>\n", "parentCommentId": "Ch5vqShq2nvi99qJH", "user": {"username": "Larks"}}, {"_id": "6KM8PcHCEHm2rppNh", "postedAt": "2014-12-13T19:10:33.894Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>If you have a chance within the next 22 hours, you should go to the Project for Awesome website (<a href=\"http://www.projectforawesome.com/\">http://www.projectforawesome.com/</a>) and vote for effective charities. Search for GD, DtW &amp; AMF. </p>\n<p>Project for Awesome is an annual YouTube project run by the Vlogbrothers, that raises awareness and money for charity. The participants (video creators, viewers, donors, etc.) are probably relatively young and this is a great way of introducing EA to them.</p>\n", "parentCommentId": null, "user": {"username": "UriKatz"}}, {"_id": "4P6zcCmRGRP3Ex5Xa", "postedAt": "2014-12-15T03:44:17.726Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>On LW there's a little envelope that lights up red when someone replies to one of your comments or messages you. Is there an equivalent here? Frequently I don't notice where people reply to me.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "hGSZYmHQjFvFQQmKi", "postedAt": "2014-12-15T06:19:46.199Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>The envelope icon next to &quot;Messages&quot; in the top-right (just below the banner) becomes an open envelope when you have a reply.  (I think it turns a brighter shade of blue as well? I can't remember.)  The icon returns to being a closed envelope after you click on it and presumably see what messages/replies you have.</p>\n", "parentCommentId": "4P6zcCmRGRP3Ex5Xa", "user": {"username": "pappubahry"}}, {"_id": "6kRYCHuTF3PDiEqAb", "postedAt": "2014-12-15T09:36:18.133Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Yes, the envelope goes to a light, bright blue open envelope..</p>\n", "parentCommentId": "hGSZYmHQjFvFQQmKi", "user": {"username": "RyanCarey"}}, {"_id": "uBb4JXBm2cheqFKA4", "postedAt": "2014-12-16T01:49:25.319Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Thanks very much! Very helpful.</p>\n", "parentCommentId": "hGSZYmHQjFvFQQmKi", "user": {"username": "Larks"}}, {"_id": "zS9vSwFLCzurf6RTH", "postedAt": "2014-12-16T09:53:27.975Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Thanks for making this!</p>\n<p>FYI, almost all of GiveDirectly's income comes from Good Ventures or non-EAs. Its funding sources break down as follows:</p>\n<p><a href=\"https://www.givedirectly.org/financials.html\">Total: 17.4 million</a>\n<a href=\"http://blog.givewell.org/2014/03/19/givewell-annual-review-for-2013-details-on-givewells-money-moved-and-web-traffic/\">Good Ventures: 7 million</a>\n<a href=\"http://blog.givewell.org/2014/03/19/givewell-annual-review-for-2013-details-on-givewells-money-moved-and-web-traffic/\">Other Givewell: ~3.4 million</a>\nOther non-EA: 7 million (presumably)</p>\n<p>I think this sort of comparison is very valuable overall!</p>\n", "parentCommentId": "b2rnvcnCRgNpwcz2J", "user": {"username": "AlexRichard"}}, {"_id": "huDYFB6EutSjGLFgQ", "postedAt": "2014-12-17T17:18:59.010Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Yes, please do do a proper post on this with cites etc, I think this is really valuable!</p>\n", "parentCommentId": "b2rnvcnCRgNpwcz2J", "user": {"username": "Paul_Crowley"}}, {"_id": "4YMA6kLBFsqWx5G6L", "postedAt": "2014-12-19T17:35:32.810Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Thanks for the response. This is cool info, but I'm not convinced. I wonder if there is value that exists but can't be captured by individuals alive today, causing them to not care. </p>\n<p>That post on sustainability I disagree with. I don't think we understand enough about technological advance to plan for specific future technologies, except in the short term. </p>\n", "parentCommentId": "yS2Y26TGbXzjNTMgw", "user": {"username": "Alexander"}}, {"_id": "gNHf8W6bfP5GqkbN8", "postedAt": "2014-12-20T04:16:32.142Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<blockquote>\n<p>I wonder if there is value that exists but can't be captured by individuals alive today, causing them to not care.</p>\n</blockquote>\n<p>Yes I think this is very plausible - indeed, I donate to MIRI! But as I noted above, this is an argument against positive interest rates in general, not anything specific to fossil fuels. If interest rates were negative, backwards induction in asset prices would lead to current prices accurately reflecting future values.</p>\n", "parentCommentId": "4YMA6kLBFsqWx5G6L", "user": {"username": "Larks"}}, {"_id": "KfWjcrNXxp4x74nqa", "postedAt": "2015-01-08T20:11:28.131Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I have a small amount of money I want to invest. If all goes well, I will eventually donate the appreciated stock, but there is a small chance I might need the money so I don't want to donate it now. I was wondering what would be more effective altruism: to focus on socially responsible investing at the possible cost of lower returns, or to maximize returns so I can donate a larger sum to the most effective charities in the end?\nI stumbled upon this article on the subject, which I find interesting, but wanted to hear more opinions: <a href=\"https://blog.wealthfront.com/socially-responsible-investing-strategy-or-luxury/\">https://blog.wealthfront.com/socially-responsible-investing-strategy-or-luxury/</a> \n(the TL;DR is that for a $100,000 investment over 30 years, a socially responsible mutual fund will make $50,000 less for charity.)</p>\n", "parentCommentId": null, "user": {"username": "UriKatz"}}, {"_id": "FWYYE9Yc2jtqnQFNw", "postedAt": "2015-01-08T21:23:58.762Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Interesting. I haven't read much analysis of this. One question you can ask is: assuming ordinary shares have a greater return, if you donate that dividend to AMF, will the world be better off.</p>\n<p>We think AMF can save a life for $3k (or $10-15k if it's affected by inflation). And our guess it that after investing $100k in normal shares for 30 years, you're $50k ahead. That's 17 lives (or 3-5).</p>\n<p>On the other hand, you're giving up the opportunity to give more responsible companies $100k of investment for 30 years. So the question would be - how good are these companies, and is funding them better than saving a few lives?</p>\n<p>Also, intuitively, it seems like there should be some price elasticity situation here, where whichever shares you buy, some other people will sell them off, partially offsetting your direct impact. I'm not sure how that works with shares though.</p>\n<p>Anyway, if you see any more useful info about it all, do report back!</p>\n", "parentCommentId": "KfWjcrNXxp4x74nqa", "user": {"username": "RyanCarey"}}, {"_id": "XCHmkjL6KJN44mfij", "postedAt": "2015-01-09T11:14:42.798Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>I will start my reply from the end. Your intuition is right. My investment will simply go into another share holder's pocket, and the company, socially responsible or otherwise, will see none of it. However, this will also decrease the company's cost of capital: when they go to the markets for additional funds, investors will know there is a market for these stocks and will be willing to pay more for them. I have no data on the extent of this impact.</p>\n<p>As for your AMF example, I have no way of quantifying the good my SRI (socially responsible investing) may do, unless I fall upon work that someone else did on this subject. My main concern, however, is more along the lines of facilitating harm. For example, am I endorsing, or even causing, suffering by buying stocks in a cosmetic company that does research on animals? My meager funds obviously have little effect, but there are good reasons to think that every penny counts, and besides the issue here is that of comparing different outcomes for these meager funds. \nAt this moment, I think that for me the &quot;do no harm&quot; principle is a good enough reason to earn a little less. My main problem is that an SRI focused portfolio might require more attention and consume more of my time, time I may not have to spare. </p>\n<p>Finally here are a few more useful links the subject:</p>\n<p><a href=\"http://academiccommons.columbia.edu/download/fedora_content/download/ac:126635/CONTENT/HowResponsibleisSocially12_9_04.pdf\">http://academiccommons.columbia.edu/download/fedora_content/download/ac:126635/CONTENT/HowResponsibleisSocially12_9_04.pdf</a> - a short academic paper on the subject (there must be more recent ones, but this gives a pretty good overview). </p>\n<p><a href=\"http://www.yourethicalmoney.org/investments/\">http://www.yourethicalmoney.org/investments/</a> - a chart with SRI mutual funds and thier policies.</p>\n<p><a href=\"http://www.ussif.org/\">http://www.ussif.org/</a> - A nonprofit dedicated to SRI</p>\n", "parentCommentId": "FWYYE9Yc2jtqnQFNw", "user": {"username": "UriKatz"}}, {"_id": "zaRREGiGA8QqDYJPC", "postedAt": "2015-01-09T12:43:25.127Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>Cool. Yeah I don't know how much harm normal stocks do compared to socially responsible ones, although I imagine they both do a lot of good on average.</p>\n<p>Philosophically, I'm not sold that &quot;do no harm&quot; is decisive here, because you're doing harm by earning less money and withholding donations to amf in a sense.</p>\n<p>Good luck!</p>\n", "parentCommentId": "XCHmkjL6KJN44mfij", "user": {"username": "RyanCarey"}}, {"_id": "P3jNgWDCGeYetmZJY", "postedAt": "2015-01-12T04:38:29.394Z", "postId": "3b87XHvfgd7N7aLgy", "htmlBody": "<p>That is interesting. My knowledge here is pretty limited. If interest rates were lower, saving would be lower and so technological progress would be slower--unless, I guess, governments intervened to make folks save. </p>\n<p><a href=\"http://reflectivedisequilibrium.blogspot.com/2014/06/increasing-and-improving-saving-as.html\">http://reflectivedisequilibrium.blogspot.com/2014/06/increasing-and-improving-saving-as.html</a></p>\n<p>What might other concrete effects of artificially low interest rates be?</p>\n", "parentCommentId": "gNHf8W6bfP5GqkbN8", "user": {"username": "Alexander"}}]