[{"_id": "cFFvDEDgHwGhXc2s9", "postedAt": "2023-01-08T16:28:01.171Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>Does ubi pertain to longtermism in ways that givedirectly does not?</p>\n", "parentCommentId": null, "user": {"username": "Daryl D'Souza"}}, {"_id": "dofGhFQz8wwsF9iBv", "postedAt": "2023-01-08T16:50:04.324Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I have many reservations about UBI and uncertainty about the surrounding research. However, at a fundamental and simple level, I have yet to hear someone explain why a UBI is preferable to a more nuanced policy, such as a negative income tax credit that gradually tapers off from, say, $60K to $120K annual income. I even moderated a discussion on <a href=\"http://Kialo.com\">Kialo.com</a> regarding UBI and never came across a satisfactory answer—the closest thing I saw to a serious potential justification was not actually a policy justification but rather a political justification: that it would be easier to get passed as a UBI (which I disagree with). (I have also heard people try to make arguments about psychological effects of it being universal, but I did not find what they said very compelling or evidence-based).</p>\n<p>Can you provide arguments or direct me to any research on this question?</p>\n", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "jpaj8ddwvWK7Bma7G", "postedAt": "2023-01-08T18:57:41.678Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>Re-reading my original comment, I may have miscommunicated a bit: I am <i>aware</i> of arguments such as those that you mention above, I just don't find them very compelling—in fact, they don't even seem to come close to justifying the added costs, they are just noisy observations.</p><p>As background for the following responses, assume that &gt;10M Americans make more than $120K annually as individuals.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreflcxtpqjb0w\"><sup><a href=\"#fnlcxtpqjb0w\">[1]</a></sup></span>&nbsp;So, ignoring all the savings that are saved by reduced payments to people making between $60K and $120K, and ignoring the option to set the bar differently for household income (e.g., the option to reduce payments for children of wealthy parents):&nbsp;<br>If the UBI is set at just $10K annually,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref23igt3lp9mg\"><sup><a href=\"#fn23igt3lp9mg\">[2]</a></sup></span>&nbsp;this translates to $100,000,000,000 ($100B) in cost savings by not providing income to already-well-off people. The unique advantages of UBI (or unique disadvantages of more-nuanced systems) need to overcome this threshold to even begin to justify a simplistic UBI.</p><p>With that in mind, I'll respond to your points:</p><ol><li>Administrative costs<ol><li>You still need administrative costs for a simplistic UBI to reduce fraud, ensure delivery of payments, etc. Thus, one cannot attribute the full administrative cost to ensuring income eligibility / it is not possible to run a UBI without administrative costs.</li><li>There is no way that ensuring income eligibility would come even close to the cost savings identified above (~$100B). Just for a very quick illustration, the entire budget of the IRS in the current, more complex system is only ~$15B (if I read this <a href=\"https://www.irs.gov/statistics/irs-budget-and-workforce\">website correctly</a>).</li></ol></li><li>Personal costs<ol><li>Again, this is not entirely unique to a more-nuanced system; similar efforts may have to take place with a simple UBI.</li><li>I would assume that you could automatically be means-tested based on your reported taxable income. If you already report making $100K a year for income tax purposes, I don't see why it would take much more reporting/administrative effort.</li></ol></li><li>Distortion of incentives<ol><li>The system I described does not significantly suffer from this. To make the math easier, let's just say the range were actually $60K to $110K. Even if one assumes a linear progression (rather than a more nuanced, super-linear system which I would recommend but won't bother discussing here), then this means that for every extra dollar one makes after $60K, their benefits are only reduced by 20 cents ($0.20), thus meaning that they still make $0.80 with every extra dollar of income. (There is an added question of how this would be designed to interact with tax brackets, but the bottom line is that one can still be incentivized to make more money.)</li><li>If one thinks that the incentive reduction described above is too steep, you can expand the window of eligibility (e.g., $60K to $160K) to reduce the slope and still likely save tens of billions of dollars.</li></ol></li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnlcxtpqjb0w\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreflcxtpqjb0w\">^</a></strong></sup></span><div class=\"footnote-content\"><p>According to governmental stats reported on <a href=\"https://en.wikipedia.org/wiki/Personal_income_in_the_United_States#Income_distribution\">Wikipedia</a>, roughly 20M Americans make more than $100K annually.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn23igt3lp9mg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref23igt3lp9mg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>There are longer debates to be had whether this is actually \"basic\" (sufficient for living), but that can of worms need not be opened here.&nbsp;</p></div></li></ol>", "parentCommentId": "GrKxdCpeESFNrnm2t", "user": {"username": "Harrison D"}}, {"_id": "percmEYW4mTSqrouK", "postedAt": "2023-01-08T19:09:37.747Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<blockquote><p>Extrapolated over a longtermist time horizon, the impacts could be monumental.</p></blockquote><p>Most of your argument is not specific to UBI at all; any contemporary policy could be made to look very important if you:</p><ol><li>Assume your policy will solve a major problem (instead of merely partially ameliorating)</li><li>Ignore all costs in your cost-benefit analysis</li><li>Assume the benefits will persist over very long time scales</li></ol><p>Contrary to the your thoughts, I think a longtermist perspective makes UBI look considerably less attractive. In the future we will likely gain the ability to grow the population very quickly, whether through uploads or other technology. At this point, a guaranteed per-capita income becomes an invitation for groups to rapidly grow so they can seize more resources. This requires higher taxes, reducing the incentives to work, making this strategy look even better on a relative basis. (We already see a very mild version of this problem today).</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "teE3S9yPvWSganNf5", "postedAt": "2023-01-08T21:53:02.388Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I don't strongly prefer UBI over a negative income tax, and I agree with you that 'ease of passing through the political system' is not a compelling argument. In practice, a UBI with an intelligent tax framework functions the same as a negative income tax (no less nuance, just different). The link below is what you're looking for:</p><blockquote><p><a href=\"https://www.scottsantens.com/negative-income-tax-nit-and-unconditional-basic-income-ubi-what-makes-them-the-same-and-what-makes-them-different/\">\"A NIT is like giving someone $50 and asking for nothing back, and a UBI is like giving someone $100 and asking for $50 from their next paycheck. Both result in the person getting an extra $50. The question of which is better depends on the details involved and how the person feels about them.\"</a></p></blockquote><p>I would highly recommend reading the link above for all the nuance in this space. Given the other benefits to UBI, such as supplementing it from additional Pigovian Taxes (taxes on undesirable things like carbon taxes &amp; drugs).</p><p>Ultimately, both policies achieve the same important outcome in slightly different ways: a Basic Income Guarantee (BIG) AKA solid foundation of economic security for all.</p>", "parentCommentId": "dofGhFQz8wwsF9iBv", "user": {"username": "Michael Simm"}}, {"_id": "bgjPDumfXth8ySEHE", "postedAt": "2023-01-08T22:21:54.849Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>And now we move to the motte, it seems. <strong>A program which simultaneously adds a UBI and a special tax specifically designed to take away the UBI from richer income groups is a UBI in name only, if even that; it is functionally just a more complicated form of income-adjusted welfare (e.g., a negative income tax credit but with extra steps).</strong>&nbsp;</p><p>It's important to recognize that the new tax would actually have to be genuinely special/separate from the rest of the system in order to be functionally similar to what I have described, given that the highest income tax bracket in the US is only 37% (if I understand correctly).</p><p>Such an \"intelligent tax framework\" (especially if it includes Pigovian taxes) could involve imposing more administrative or cognitive costs on people who are trying to figure out how much they owe in taxes, unless one is actually just saying \"a tax framework which is only different in that it hides the fact that some people are actually just paying the same/more in taxes even after accounting for the UBI.</p><p>Again, it might be plausible that this sneaky setup has political justifications, although I am fairly skeptical of that, given that I don't think people are that gullible / I think some commentators will be very outspoken that this is just a deceptive form of income-adjusted welfare. Moreover, I'm also quite skeptical of the argument that the people who make more than the cutoff would actually care enough about such a relatively small payment to lobby against it, unless one is supposing that the new system would not actually replace/eat most pre-existing welfare (in which case I think the new program would unacceptably increase the deficit in ways likely to create its own political backlash).&nbsp;</p><p>Also, it is <i>almost</i> a red herring to claim benefits of imposing Pigovian Taxes as a way to fund the UBI, except insofar as one is appealing to the argument that such taxes are not politically feasible without reimbursement. But one does not need a \"UBI\" (emphasis on the \"universal\" and \"basic\" characteristics) to impose Pigovian Taxes, and in fact there are many proposals that take the form of limited rebates tied to specific taxes (e.g., carbon tax rebates). Additionally, it is possible that politicians/voters would still demand an end to the taxes while maintaining the UBI.</p><p>In the end, I disagree that one can have a UBI that is functionally equivalent to the kind of income-adjusted tax credit I've described, while still genuinely calling the UBI a \"universal\" basic income.</p>", "parentCommentId": "teE3S9yPvWSganNf5", "user": {"username": "Harrison D"}}, {"_id": "8fBpvGHjySKy6vf8L", "postedAt": "2023-01-08T22:40:59.048Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I think GiveDirectly is absolutely on the right track regarding the superiority of cash over other aid interventions, especially at scale. Note that none of GiveWell's top charities are capable of spending billions of dollars without dropping below 1X GiveDirectly. <a href=\"https://www.givedirectly.org/giving-directly-still-means-giving-well/\">It's the only intervention that seems theoretically capable of ending global poverty</a>.</p><p>GiveDirectly has the (admirable, I love what they're doing &amp; they should not change gears) desire to give cash (or UBI) to the poorest people in the world.&nbsp;</p><p>The longtermist question is more about the positives for society from having a policy that creates a stable economic foundation over the long term. It would suggest that we should not just focus on global development aid, but also focus on ending poverty in developed countries.</p><p>Poverty itself is a massive drain on resources, and I think it's the greatest creator of problems in society. Ending it,<a href=\"https://twitter.com/scottsantens/status/1040683616488103936\"> based on the research above</a>, would meaningfully improve the human experience for most people (even the wealthy who would have extra taxes) because we would have a more stable society.</p><p>In particular, helping hundreds of millions of people (especially kids) escape poverty could result in a ton more interest and workers available to work on longtermist issues. When people don't have to think about day-to-day survival all the time, they can care about the long-term future.</p>", "parentCommentId": "cFFvDEDgHwGhXc2s9", "user": {"username": "Michael Simm"}}, {"_id": "ZbyAfdeffHJsh8tmj", "postedAt": "2023-01-08T22:53:12.418Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I don't think we are disagreeing.&nbsp;</p><p>By intelligent tax framework, I simply meant lower tax % for people with less income, and higher tax % for people with more income. A graduated tax like we have today instead sales taxes or a flat tax. Maybe there's an argument to use a wealth tax as well or instead, but most proponents I've seen support increasing the top marginal tax rate from&nbsp;</p><p>Pigovian taxes would not be substantive to the cost of a UBI, so I'm rather ambivalent as to whether they need to funnel back into a UBI. The best argument I've seen so far for funneling carbon taxes into UBI (Carbon Tax) is that:&nbsp;</p><ol><li>All people have a carbon footprint</li><li>A Carbon tax would increase the cost of living for most people, and people could be financially hurt by gas (for example) being more expensive, so&nbsp;</li><li>Distributing the tax revenue back to the people directly would counteract that cost</li></ol><p>Perhaps I shouldn't have brought Pigovian taxes up, as they are not central or important to the debate of UBI.</p>", "parentCommentId": "bgjPDumfXth8ySEHE", "user": {"username": "Michael Simm"}}, {"_id": "RvqwEDakGHWosqp5Q", "postedAt": "2023-01-08T23:47:55.441Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I get your point about various policies looking very important if extrapolated far enough, but I disagree with your supposition that I (and other people who've advocated for UBI) am ignoring all costs in the cost-benefit analysis. There is <a href=\"https://twitter.com/scottsantens/status/1040683616488103936\">a ton of research that has been done on this topic</a> that considers your three points in detail, and I've seen it mostly come to these conclusions (although I 100% think we need more research and experiments):</p><ol><li>The problem UBI policy solves by definition, poverty, is the root of all other ongoing problems in our society (excepting existential risks and climate/plastics problems). It is different and far more fundamental than any other policy because it establishes a strong foundation for economic security.&nbsp;</li><li>There are most certainly costs, primarily from higher taxes on the wealthy, but the benefits far outweigh them. The amount of damage (economically, socially, and mentally (WELLBYs)) that poverty causes is far larger than the cost of ending it.&nbsp;</li><li>One of the benefits of UBI should be a far more resilient, educated, and durable civilization. The longtermist case for UBI is that it will enable our society to persist longer and with greater prosperity.</li></ol><p>I would highly recommend reading <a href=\"https://twitter.com/scottsantens/status/1040683616488103936\">this thread by Scott Santens that discusses questions 1 &amp; 2</a>.</p><blockquote><p>In the future we will likely gain the ability to grow the population very quickly, whether through uploads or other technology. At this point, a guaranteed per-capita income becomes an invitation for groups to rapidly grow so they can seize more resources.</p></blockquote><p>I'm not very convinced by this argument, although <strong>I'm interested to hear more</strong> about how you think it would play out. I'm not sure this fits with the nature of resource conflict within nations in the modern world. I think <a href=\"https://www.rethinkx.com/humanity\">we will soon be moving past many kinds of resource scarcity</a>, and I just don't see why UBI would be a good way to seize resources (get rich). If we saw this happening, we could probably adjust policy to ensure fairness (we need a lot more research and philosophy done before building major baby factories). And why would the kids produced be interested in keeping this hustle going?&nbsp;</p><p>Population collapse is also a potential global issue so it may be good to incentivize people to make more people.</p><p><strong>IMHO: The best argument against UBI as a longtermist priority</strong> is that it is possible (if not highly likely) that technology will advance to such a level (I hope within the next 50 years) that money becomes mostly meaningless and people upload themselves to computers or merge with AI.&nbsp;</p><p>If that's the case, we should probably consider the benefit of spending money impactfully sooner rather than waiting for it to become useless. This might upset some people at the one fund I heard about that's trying to save up money to spend impactfully in the far future when the time arises.</p>", "parentCommentId": "percmEYW4mTSqrouK", "user": {"username": "Michael Simm"}}, {"_id": "9orhE5b5omMyGoFKZ", "postedAt": "2023-01-08T23:59:11.219Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>we already have a UBI-style structure for welfare in the UK. It's called Universal Credit, but is set at a very low % of median income, so you aren't living off it very comfortably. But the political economy here doesn't seem very likely to support a much higher basic income any time soon. &nbsp;This imo gives the lie to the claims that simpler welfare systems on their own are more generous: I suspect for a variety of reasons the opposite is true.</p>", "parentCommentId": "bgjPDumfXth8ySEHE", "user": {"username": "Sabs"}}, {"_id": "PLM8xBzAePDAjG4Ab", "postedAt": "2023-01-09T00:01:53.031Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I have no idea what's going on in this comment thread ^</p><p>But I had one tiny comment about this footnote:</p><blockquote><p>2. There are longer debates to be had whether this is actually \"basic\" (sufficient for living), but that can of worms need not be opened here.&nbsp;</p></blockquote><p>\"Sufficient for living\" is one way to interpret the word basic, but basic can also be interpreted as simply \"the size of the base income\" or floor. It doesn't necessarily have to be a livable amount. Most of the benefits of UBI come from the substantial amount of power that people can leverage even with only $1000 or even $500 extra per month.</p>", "parentCommentId": "jpaj8ddwvWK7Bma7G", "user": {"username": "Michael Simm"}}, {"_id": "b7nAiHcsX6gyZphed", "postedAt": "2023-01-09T00:21:22.816Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<blockquote><p><strong>A program which simultaneously adds a UBI and a special tax specifically designed to take away the UBI from richer income groups is a UBI in name only, if even that; it is functionally just a more complicated form income-adjusted welfare (e.g., a negative income tax credit but with extra steps).</strong>&nbsp;</p></blockquote><p>UBI has always been a fundamentally redistributive policy proposal and is what people like Dr. Luther King Jr. and Milton Friedman meant back in the 60s. A special/additional tax specifically designed to transfer some wealth from richer people &amp; distribute it to poorer people is most certainly what the name UBI means.</p><p>One thing I love about it is that it should benefit wealthy people a great deal as well. Not only would it reduce homelessness and petty crime drastically (as they are almost entirely caused by poverty), but rich people would know there is a limit to how far they can fall. Wealthy people are constantly afraid of losing their wealth, and UBI would meaningfully reduce that fear. A few rich people have told me it would make up for the higher taxes.</p><p>Finally, I find it much simpler actually than a negative income tax. My perspective is somewhat altered by the fact that I speak with a lot of homeless and impoverished individuals, and they would much prefer a simple check each month as it would be far more stable than a once-a-year thing.</p>", "parentCommentId": "bgjPDumfXth8ySEHE", "user": {"username": "Michael Simm"}}, {"_id": "ETKuQ2zdXyj4rHg5Z", "postedAt": "2023-01-09T01:14:31.427Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>A UBI by definition cannot distribute the new money in a way that is not universal. If you want to keep current taxes or even change tax brackets so that they are more progressive by increasing taxes on the wealthy that could still be a UBI, but it would mean that people making &gt;$150K annually receive additional money for the government that they clearly don't need, even if they are in a 50% income tax bracket. However, I don't think you can in good faith call a program that adds a new special tax that only applies to the UBI and thus deposits money in rich people's bank accounts only to immediately yank 100% of the money back a \"UBI,\" as that clearly goes against the spirit of the \"Universal\" characteristic.</p><p>&nbsp;</p><p>You insist that this policy was supported by Milton Friedman:</p><blockquote><p>UBI has always been a fundamentally redistributive policy proposal and is what people like Dr. Luther King Jr. <strong>and Milton Friedman meant back in the 60s.</strong></p></blockquote><p>However, I doubt this is an accurate interpretation of Milton Friedman, and I have only ever heard him talk about negative income taxes. From one quickly-found <a href=\"https://reason.com/2019/08/01/do-milton-friedman-mlk-and-andrew-yang-really-agree-on-the-universal-basic-income/\">source</a>:</p><blockquote><p>The crowd at Yang's Washington, D.C., rally on April 15&nbsp;burst into applause at the mention of Friedman. But <strong>the famous free-market economist's idea of UBI doesn't square up with Yang's. Friedman advocated for a negative income tax</strong>, which replaces levies on low-income individuals with supplemental funds from the government. <strong>Friedman's plan consequently ensures that everyone in society receives a guaranteed minimum income, but it doesn't redistribute money to people who don't need it.</strong></p></blockquote><p>&nbsp;</p><blockquote><p>Wealthy people are constantly afraid of losing their wealth, and UBI would meaningfully reduce that fear.</p></blockquote><p>A UBI would not save rich people from losing &gt;90% of their income if something catastrophic were to happen to their business/etc., and it does not act as a better social safety net than alternative policies such as negative income tax or other means-tested/emergency assistance (e.g., TANF).</p>", "parentCommentId": "b7nAiHcsX6gyZphed", "user": {"username": "Harrison D"}}, {"_id": "yjkpkaypEjou25Xbx", "postedAt": "2023-01-09T01:19:19.128Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>We are disagreeing, if only insofar as that I disagree that a UBI can be universal and also functionally equivalent to an income-adjusted tax credit. Or at least, I think it is disingenuous to call that a UBI. And I think that if a UBI genuinely gives money to people making more than ~$120K a year without doing this whole bait-and-switch, it's a terrible policy relative to alternatives (e.g., income-adjusted tax credits). (Which to be clear is not even to suggest that I think income-adjusted tax credits are a good policy; I simply think that they are almost strictly superior to a UBI, except maybe for political tractability or other non-policy reasons.)&nbsp;</p>", "parentCommentId": "ZbyAfdeffHJsh8tmj", "user": {"username": "Harrison D"}}, {"_id": "WYbvgnQGbqPL9egPC", "postedAt": "2023-01-09T02:58:37.516Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I think we are not understanding UBI to mean the same thing. UBI is a government policy that distributes funds to all people equally, through redistributive taxes that are high enough for the wealthy to pay for the full amount. I don't think there's any bait-and-switch in that everybody <i>should</i> &nbsp;know from the start that people making 120+ per year will make net-less income.</p><p>The breakeven point should be somewhere around 50-70K I think.</p><p>The fundamental issue (unless I'm misunderstanding) with tax-credit is that if you're poor and have not made a high income, you can't get any benefit from them. It doesn't accomplish the fundamental BIG (Basic Income Guarantee) like UBI or Negative income tax.</p>", "parentCommentId": "yjkpkaypEjou25Xbx", "user": {"username": "Michael Simm"}}, {"_id": "kdALxDdpyYCZsqSqK", "postedAt": "2023-01-09T03:23:23.725Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<blockquote><p>I don't think you can in good faith call a program that adds a new special tax that only applies to the UBI and thus deposits money in rich people's bank accounts only to immediately yank 100% of the money back a \"UBI,\" as that clearly goes against the spirit of the \"Universal\" characteristic.</p></blockquote><p>I don't think the 'Universality' of UBI has ever meant that every person will benefit from it. The universality thing points to the fact that no-one will ever go below it. It is a minimum base income that is universally applied, and that universality has nothing to do with the tax structure used to fund said program.</p><p>A program would still be a UBI if it was funded entirely from government oil profits or some other source than taxes. It could even be funded by wealth taxes not income taxes. The source of funds is irrelevant to a UBI being a universal income floor.</p><blockquote><p>However, I doubt this is an accurate interpretation of Milton Friedman, and I have only ever heard him talk about negative income taxes.</p></blockquote><p>I feel like we're going in circles with this one. I already described how NIT is functionally identical to UBI after all is said and done. It just depends on how people feel about accounting.</p><p><a href=\"https://www.scottsantens.com/negative-income-tax-nit-and-unconditional-basic-income-ubi-what-makes-them-the-same-and-what-makes-them-different/\">\"A NIT is like giving someone $50 and asking for nothing back, and a UBI is like giving someone $100 and asking for $50 from their next paycheck. Both result in the person getting an extra $50. The question of which is better depends on the details involved and how the person feels about them.\"</a></p><p><a href=\"https://medium.com/basic-income/why-milton-friedman-supported-a-guaranteed-income-5-reasons-da6e628f6070\">Milton Friedman used guaranteed income and NIT interchangeably</a>, and I would guess (although I can't confirm) that he understood NIT and UBI to be two sides of the same coin. Maybe we can ask an AI language model to pretend to be Milton Friedman.</p><blockquote><p>A UBI would not save rich people from losing &gt;90% of their income if something catastrophic were to happen to their business/etc., and it does not act as a better social safety net than alternative policies such as negative income tax or other means-tested/emergency assistance (e.g., TANF).</p></blockquote><p>You're completely right, it would not save them from losing all of their money &amp;/or job income, but that's not what I'm talking about. I'm saying that they will never fall below a certain level, and that level is enough to help a person recover at least part of their dignity &amp; wealth over time.</p><p>Imagine you're a rich person - something goes horribly wrong - now you're bankrupt and have $0 in your bank account. Would you rather have to wait until the next April to get a big NIT check (you'll have to wait a year for your income to go to 0), or get your $1,000 check at the beginning of the next month?</p><p>I've spoken to people on TANF and means-tested emergency assistance. It sucks and is absolutely awful for everyone involved. It's especially rough because these people are in great need and it makes them jump through so many unnecessary hoops.</p>", "parentCommentId": "ETKuQ2zdXyj4rHg5Z", "user": {"username": "Michael Simm"}}, {"_id": "gy7sgQ5LWvomXodkz", "postedAt": "2023-01-09T03:45:24.347Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>(Responding to two of your comments at once)</p><p>First, just ignore the whole thing about TANF; I included that on a whim and I'm aware of the many criticisms of the program, but I have no interest in defending it as it is not central to the main argument I'm making. That aside...</p><p>You say that:</p><blockquote><p>The fundamental issue (unless I'm misunderstanding) with tax-credit is that if you're poor and have not made a high income, you can't get any benefit from them.</p></blockquote><p>I suppose I should not have used the term \"tax credit,\" as I think most tax credits are non-refundable, but there are refundable tax credits (i.e., you can be paid by the government in excess of what you owe in taxes). What I have in mind would be a refundable tax credit, which also applies for people who do not pay excess amounts in income taxes. (i.e., it would be like receiving a $X check if you have not paid any taxes)</p><p>&nbsp;</p><p><strong>You say that:</strong></p><blockquote><p><strong>UBI is a government policy that distributes funds to all people equally</strong>, through redistributive taxes that are high enough for the wealthy to pay for the full amount.</p></blockquote><p><strong>Curiously, in a separate comment you also say:</strong></p><blockquote><p><strong>I don't think the 'Universality' of UBI has ever meant that every person will benefit from it</strong>. The universality thing points to the fact that no-one will ever go below it.</p></blockquote><p>I'm not exactly sure how to reconcile these two comments, but what I will say is: I do not get the impression that people usually have the \"the government ensures all people will stay above X income\" interpretation in mind when talking about a UBI (except sometimes when they are retreating to a definitional motte, as currently appears to be the case); most people have in mind \"a government policy that distributes funds to all people equally,\" as you wrote in one of your comments. (I thought this is also what Andrew Yang had in mind, but I must admit some unfamiliarity with the details of his plan.)</p><p>Ultimately, I'll just conclude by saying that I think that redefining UBI in such a way as to allow a policy such as a negative income tax just destroys the definition of a UBI, and I think you will not find many people who are sympathetic to such definitional stretching (although they may unfortunately be unaware of what's happening).</p>", "parentCommentId": "kdALxDdpyYCZsqSqK", "user": {"username": "Harrison D"}}, {"_id": "uGgW3cAJrB4KCdb7D", "postedAt": "2023-01-09T05:13:58.146Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<blockquote><p>but I disagree with your supposition that I (and other people who've advocated for UBI) am ignoring all costs in the cost-benefit analysis.</p></blockquote><p>You provided a sketch of a cost-benefit analysis in this post (the four bullet points) and it does not include any costs.</p><blockquote><p>that money becomes mostly meaningless and people upload themselves to computers or merge with AI.&nbsp;</p></blockquote><p>Uploads don't mean money becomes useless; there is still need for a price mechanism to allocate scarce resources like electricity and semiconductors. Uploads can copy themselves instantly an arbitrary number of times; if each copy gets a new UBI, they can use that to buy the resources for another copy until we run out of resources. The 'kids' are interested in keeping the hustle going because they are essentially identical to the parent.</p><p>Now, there are ways around this problem. Maybe uploads don't get the same rights as traditional humans (though this seems potentially quite unfair!). I think this is the most important distinctly longtermist consideration relevant to this issue, and directionally it seems negative.</p>", "parentCommentId": "RvqwEDakGHWosqp5Q", "user": {"username": "Larks"}}, {"_id": "aGuLsTaHjoCbTTJGA", "postedAt": "2023-01-09T08:03:10.999Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<blockquote><p>You provided a sketch of a cost-benefit analysis in this post (the four bullet points) and it does not include any costs.</p></blockquote><p>Thanks so much for pointing this out! You're totally right. I just went and added one, and this is what I added:&nbsp;</p><blockquote><p>What about the downsides?</p><ul><li>The primary losers of UBI policy would be (extremely) wealthy people and people with very high incomes as they will get higher tax rates.</li><li>In 2022, 34.4% of American households saw a $100,000+ income. It would be reasonable to say households with over $100,000 annual income could probably be negatively affected by increased taxes.&nbsp;</li><li>34.4% * 332M = <strong>115M Americans</strong></li><li>They will likely lose some amount of WELLBYs as their lifestyles will be harder to maintain. Increased taxes, the resulting stress, and a slight decline in living standards could likely contribute to, (spitballing again because living with slightly less affluence isn't the same as living in poverty), a loss of <strong>0.05 WELLBYs</strong> per year. I think this could be a massive overestimation though because although some people would have higher taxes, they would also benefit from their friends, family, and neighbors being much more economically secure.&nbsp;</li><li>I think it's more likely only people with over $500K in annual income would be negatively affected (and only as long as their family &amp; friends are also in the same tax bracket). 1% of American households make 500K+ annually. The 1% comprises 1.32 Million Americans.&nbsp;</li><li>115M * 0.05 = <strong>6M less WELLBYs/Yr</strong></li><li>1.32M * 0.05 <strong>= 66K less WELLBYs/Yr</strong></li></ul><p>Based on this back-of-the-napkin cost-benefit estimation, it seems like the benefits by far outweigh the costs&nbsp;</p><ul><li>33M - 6M = <strong>27 M net positive WELLBYs annually</strong></li></ul></blockquote><p>Regarding Sentience Factories:</p><p>I very much agree with your point that UBI goes totally out the window the instant we give rights to sentient computers or uploaded humans because they can infinitely copy themselves into new beings (and that we don't know when or if that will happen).</p><p>At that point though, I think pretty much everything else normal about the world will go totally out the window as well, including currencies. We could end up in some kind of star trek situation + the TV show Upload. I agree that from a longtermist perspective that this possibility is directionally negative. Good point!</p>", "parentCommentId": "uGgW3cAJrB4KCdb7D", "user": {"username": "Michael Simm"}}, {"_id": "afYbskeLvJ3nmE7Fp", "postedAt": "2023-01-09T08:49:11.788Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<blockquote><p>What I have in mind would be a refundable tax credit, which also applies for people who do not pay excess amounts in income taxes. (i.e., it would be like receiving a $X check if you have not paid any taxes)</p></blockquote><p>I think this is the same idea as a Negative Income Tax. As mentioned before UBI and NIT are functionally identical and only differ in accounting terms.</p><p>I want to make it clear I'm not attempting to stretch the definition of UBI to include NIT. A Universal Basic Income is a very different mechanism from a Negative Income Tax, my point is that both policies achieve the game-changing impact of a Basic Income Guarantee (BIG).</p><p><strong>UBI is a government policy that distributes funds to all people equally</strong></p><p>My point here is that the government distributes those funds equally, establishes that baseline of economic stability, and that does not include how it's being paid for. GiveDirectly is running <strong>a UBI experiment where every person in Maryland Liberia will receive UBI for 3 years</strong>. The UBI is not being paid for by taxes, but by philanthropy &amp; international aid money. Whether something is UBI or not depends on the disbursement mechanism, not on the means of funding.</p><p>From what I've seen it's incredibly likely (logical economically) that direct cash transfers - or funding guaranteed income - is the most cost-effective way to help <i>almost all</i> people in need philanthropically. If we can prove this claim with rigorous RTC trials, it could substantially blur the lines between paying taxes dedicated for UBI &amp; spending money on high-impact philanthropy.</p><p>Wouldn't a rich person or organization in Maryland Liberia also want to support GiveDirectly's UBI program?</p>", "parentCommentId": "gy7sgQ5LWvomXodkz", "user": {"username": "Michael Simm"}}, {"_id": "yNFaiox9LcXSAZwij", "postedAt": "2023-01-09T08:53:12.828Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>Well America has the world's most dubious social safety net and is also the most dynamic , richest major economy. Meanwhile much of Europe has extensive income protections in the case of job loss (less so in the UK) but &nbsp;also vastly less dynamic economies. Almost immediately there's a large presumption against increasing welfare universality imo, and it can't just be assumed away. There needs to be some argument for why the massively increased taxes &amp; redistribution necessary to fund a meaningful UBI won't have hugely negative dynamic effects! &nbsp;Especially in a world of mobile capital and tax competition.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "AtMuHmmPvQzpEPJMH", "postedAt": "2023-01-09T19:41:33.944Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I think the idea that UBI would 'massively increase taxes' could do with some solid numbers. Taxes would increase moderately, but it's not nearly as high as you think:</p><p>Research by Karl Widerquist of Georgetown University shows that&nbsp;<a href=\"https://www.georgetown.edu/news/less-than-3-percent-of-gdp-could-end-u-s-poverty-new-research-shows/\"><u>it would cost only $539 Billion, less than 3 percent of the U.S. GDP, to permanently end poverty with Universal Basic Income</u></a>. Widerquist says the $539 billion per year is 2.95 percent of America’s GDP &amp; about one-sixth of the cost of commonly circulated estimates, and that this amount is less than 25 percent of current entitlement programs.</p><p>Widerquist’s research used U.S. Census Bureau data for 2015 to examine an estimated poverty-level UBI of $12,000 per adult and $6,000 per child. It also found that some 43.1 million people (including 14.5 million children) would benefit from this increased income, reducing the poverty rate from 13.5 percent of the population to zero.</p><p>The additional $539 Billion <a href=\"https://en.wikipedia.org/wiki/United_States_federal_budget\">would account for less than 10% of the U.S. federal budget</a>, even though proponents think it would be far more positively impactful than... well... pretty much everything else the government does put together. Creating a stable foundation for society is the function of government.</p>", "parentCommentId": "yNFaiox9LcXSAZwij", "user": {"username": "Michael Simm"}}, {"_id": "AfjtC2Ez5epnS4KZF", "postedAt": "2023-01-09T20:11:04.417Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>I do not believe that UBI of 12k a year is going to abolish poverty. It might well be an improvement over the current welfare system, but I assume you'd have to abolish quite a lot of the existing welfare system in order to fund your UBI. And I struggle to see who is going to sign up for increasing America's entitlement spend by 25%!</p>", "parentCommentId": "AtMuHmmPvQzpEPJMH", "user": {"username": "Sabs"}}, {"_id": "2ddxMyzicM9ktyemu", "postedAt": "2023-01-09T21:05:43.693Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>It is true that the 'poverty line' is an arbitrary number that doesn't necessarily equate to life experience not being 'in poverty' if you're above it. It is also true that UBI puts every person, universally, over a certain amount of income. If you define poverty as people living under the poverty line, then a UBI reaching the poverty line would abolish poverty <i>by definition</i>.</p><p>Regarding the welfare system, almost everybody is in favor of dramatically reforming the welfare system because a lot of it right now is actually harmful to people. The one program most people approve of, social security, already functions (sort of) as a UBI for the elderly.&nbsp;</p><p>I struggle to see who, after looking at the numbers, would be against spending &lt;10% of America's budget ($539B) on a UBI that would pay for itself several times over &amp; make it so the government can delete a ton of less effective welfare programs. Do you know that child poverty alone (only one small part &nbsp;of the damage of poverty)<a href=\"https://source.wustl.edu/2018/04/childhood-poverty-cost-u-s-1-03-trillion-in-a-year-study-finds/\"><u> costs over $1.03 Trillion annually?</u></a></p>", "parentCommentId": "AfjtC2Ez5epnS4KZF", "user": {"username": "Michael Simm"}}, {"_id": "CgeN87huEk5Px8KBN", "postedAt": "2023-01-09T21:17:10.074Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>This is a fake, made-up number that massively overestimates the effects of child poverty by ignoring the huge genetic confounding that accounts for a very substantial part of the correlation between child poverty experience and worse adult outcomes.&nbsp;</p>", "parentCommentId": "2ddxMyzicM9ktyemu", "user": {"username": "Sabs"}}, {"_id": "GkakixaWwXvrPT7Qf", "postedAt": "2023-01-09T22:20:28.051Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>One justification for a universal basic income over benefits that are contingent on means testing is that it avoid the perverse incentives and poverty traps of means testing. The classic example for this is something like this: if you're entitled to receive 10.000 USD when under the means testing cut off, taking a job that would pay you 12.000 USD and put you above the cut off, leading to loss of benefits, tends to be a risk and potentially very costly move for people in poverty, and is disincentivized by the means testing system. This is because if you lose employment for some reason, or if the job you're taking is seasonal employment, you generally have to reapply for benefits. Applying to receive means tested benefits tends to be a long and difficult process and even a short term loss of income that is later compensated by back pay can have catastrophic results. Removing this risk allows for people to be able to take work that would be too risky or short term otherwise. Although I'm not too well versed on the details, I believe negative tax credits can also be similarly problematic because of the payment structure: if the income is only received during a certain time of the year and changes significantly on low thresholds, as opposed to being dependable and foreseeable and at usefully frequent intervals (read: generally aligned with the intervals of important expenses, like rent and bill payments), it can create similar perverse incentives. That being said, there should be ways to tinker with it to alleviate these concerns.</p><p>It's also important to recognize a difference between universal disbursement of a UBI and the net amount received when accounting for taxes. In a comment below you say \"<strong>A program which simultaneously adds a UBI and a special tax specifically designed to take away the UBI from richer income groups is a UBI in name only, if even that; it is functionally just a more complicated form of income-adjusted welfare (e.g., a negative income tax credit but with extra steps). \"</strong> I understand where you're coming from and I do see your point, but UBI being universal doesn't mean that the net amount after taxes is necessarily going to be the same for everybody. It's in reference to the method of disbursement and administration of benefits. You can equalize this in a way, by making UBI payments tax exempt: I have heard proposals that UBI should not be factored into the total amount of taxed income or wealth, and there are merits to that. But in either case, from a policy perspective, the benefit of universality and regularity is to create a greater freedom of movement for recipients without having to be concerned about the risks of temporarily losing entitlement to benefits if they take a job that doesn't work out or have to drop out of the workforce for care duties or health conditions or any other pressing reason or want to take on seasonal employment, thus counteracting the perverse incentives of means testing.</p>", "parentCommentId": "dofGhFQz8wwsF9iBv", "user": {"username": "tugbazsen"}}, {"_id": "rN5h24QTNSrTocjTm", "postedAt": "2023-01-09T22:28:10.911Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>This concern is largely not applicable to a common-sense program that I describe, such as a negative income tax, as there is no threshold where you suddenly lose most of your benefits.&nbsp;</p><p>First, the reduction of benefits would not begin until one is already making a fairly decent salary (e.g., $60K). Second, the benefits would only reduce gradually over a span of, say, $60K, which means that every dollar you earn only costs a fraction of a dollar of benefits. To repaste one of my responses from elsewhere (with minor edits):</p><blockquote><ol><li>To make the math easier, let's just say the income range points were actually $60K to $110K. Even if one assumes a linear progression (rather than a more nuanced, super-linear system which I would recommend but won't bother discussing here), then this means that for every extra dollar one makes after $60K, their benefits are only reduced by 20 cents ($0.20), thus meaning that they still make $0.80 with every extra dollar of income. (There is an added question of how this would be designed to interact with tax brackets, but the bottom line is that one can still be incentivized to make more money.)</li><li>If one thinks that the incentive reduction described above is too steep, you can expand the window of eligibility (e.g., $60K to $160K) to reduce the slope and still likely save tens of billions of dollars.</li></ol></blockquote>", "parentCommentId": "GkakixaWwXvrPT7Qf", "user": {"username": "Harrison D"}}, {"_id": "kC97uzb3NYX3zKJLX", "postedAt": "2023-01-09T22:36:39.900Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>You write that:</p><blockquote><p>It's also important to recognize a difference between universal disbursement of a UBI and the net amount received when accounting for taxes.</p></blockquote><p>I would first encourage you to read the rest of the discussion, as I think I address most of the first half of that paragraph (over the legitimacy of some definitions of a \"UBI\") in my back-and-forth with Michael Simm.</p><p>In the second half of the paragraph (especially \"the benefit of universality and regularity is to create a greater freedom of movement for recipients without having to be concerned about the risks of temporarily losing entitlement [...]\") you seem to retreat to the point that I addressed in my other reply.</p><p>Ultimately, I see the choices here as ultimately boiling down to&nbsp;</p><ul><li>\"create a UBI which is not actually a UBI, because it is not universal or it adds special taxes/workarounds to functionally just undo the payment to richer people (rather than just having a special negative income tax system which does not send out payments to rich people in the first place)\" (the definitional debate), or</li><li>\"create a UBI which provides payments to people regardless of income, spending 10s if not 100s of billions of dollars in payments for people who are not poor.\"</li></ul>", "parentCommentId": "GkakixaWwXvrPT7Qf", "user": {"username": "Harrison D"}}, {"_id": "aq5csT6rJmkxXZwqM", "postedAt": "2023-01-09T22:58:55.262Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>Eh, I don't really agree with you on the definitional point - I understand it, and I don't think it's invalid, but I don't really think it's responding well to what UBI proponents usually mean when they talk about it being universal.&nbsp;</p><p>In response to your other comment, I already said that you could tinker with negative income credits to alleviate the concerns related to means-testing and perverse incentives. I'm not trying to argue with you or convince you that UBI is better or anything like that, just trying to provide one common argument as to why UBI proponents argue that basic income should be disbursed universally instead of the initial payment being dependent on or tempered by income or wealth levels.</p>", "parentCommentId": "kC97uzb3NYX3zKJLX", "user": {"username": "tugbazsen"}}, {"_id": "3GzHgLgAodpumxG2D", "postedAt": "2023-01-10T04:19:24.586Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<blockquote><p>I don't really think it's responding well to what UBI proponents usually mean when they talk about it being universal.&nbsp;</p></blockquote><p>I would be open to this response, but in every conversation that I can recall having with someone who advocates for a UBI (including other people in this comment section), this has been wrong, at least initially: they start out by describing it as a series of payments to all people, regardless of income/etc. This is also true for popular proponents of UBI programs, like Andrew Yang. And usually people justify it by saying things like what you said in your own comment, about \"oh, well if it isn't given to rich people then it'll disincentivize them from working, because then they'll hit the cutoff and lose all the benefits.\"</p><p>But of course, once someone highlights how this is almost strictly inferior to a more nuanced system (e.g., special negative income taxes), some proponents will just start retreating to a vague definition of UBIs which water down the whole concept and abandon a lot of the arguments they were just making in favor of it.</p><p>Now, I'll admit I didn't see the original point about temporary positions and pay periods. I don't think I've heard people make this point before, but it's still unclear to me what it actually looks like in practice (e.g., \"what if you get a job which pays $10K a month, but then lose the job on the first week and are thus ineligible for benefits that month\"?)... Given the lack of clarity, and what I've been able to imagine on my own, I don't find this very compelling, as it seems to refer to a rather rare scenario where people may just have to manage the risks and/or deal with special bureaucracy despite it being inconvenient. The fact is, I can't imagine how this could be significant enough to overcome 10s or 100s of billions of dollars in cost savings by restricting payments to people who are already making decent incomes. However, if someone were to clarify the argument, I would be willing to consider it further.</p>", "parentCommentId": "aq5csT6rJmkxXZwqM", "user": {"username": "Harrison D"}}, {"_id": "CG7wjSWSsaJeghgNN", "postedAt": "2023-01-10T07:46:17.055Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>Re: universality: there are a lot of different UBI proposals, and a lot of things that are proposed as a \"UBI\" that i don't think enter into that definition, so I really can't speak to the UBI proponents you've been talking to, and I'm not familiar with Yang's proposals. I'm mostly familiar with academic works on basic income, and my understanding is that the most common definition of the universal component of UBI is that everyone gets a certain amount of money every so often, regardless of their income, tax bracket, in some cases citizenship status, etc. Some of these proposals argue that it should be tax exempt completely, while some say that it can be included in the total calculated for income taxes. In either case, it is still universal. I personally think arguing that a UBI where some people pay back part of it in taxes isn't really universal because of that, which is how I understand your argument on that point, is akin to arguing that, for example, you get paid less than your colleague because you have a second stream of income that puts you in a higher tax bracket and results in you paying a higher tax percentage on your salary, despite both of you getting the same amount of pay before taxes. Again, I can't speak to anyone you've spoken to, and I'm not trying to convince you of anything, but this is my understanding of the way universal is meant to function.</p>\n<p>The thing I was talking about is known as a welfare trap, or an unemployment trap. This all depends on context and can vary wildly, but in a lot of welfare systems benefits - particularly cash benefits - are tied to fairly low thresholds, and depending on how your income/tax system functions, can be recalculated on different time scales. Where I'm from, last I checked, a number of poverty alleviation programs like food support and income support are tied to a level of household income that is something around a third of the monthly minimum wage per person (I'm a bit fuzzy on the exact number, but it's definitely less than minimum wage and very far below the poverty line) in the household. We have a very centralized social security and taxation system where your income is reported by your employer every month, and taxed before you receive it -so unless you're working freelance (which requires you to set up a tax entity and report income ~every three months) or illegally under the table, your income is reported to the government and entered into the central system which is used for means testing every month once you get any job. Once you get a job that moves you above the threshold, if you then lose the job, reapplying for and receiving benefits can take months. They'll pay you a lump sum for the time between your application and actual disbursements, so you don't end up not receiving what you're entitled to, but those months in between can be without any payment at all. So taking a job, particularly in job markets where employment security isn't great, is a serious risk for a lot of people who are low income enough to be receiving these benefits, which are almost certainly lost if you take any job because the cut off threshold is so low. This isn't really as rare a scenario as you might think, and you can look it up if you're interested in knowing more -there are a lot of papers studying this in detail in a lot of different places, and it's been a while since I looked into it so my knowledge is a bit rusty.</p>\n<p>In regards tax credits that are payed out on a yearly or quarterly basis, if they are disbursed retroactively, then someone who had a good 2021 fiscal year and a bad 2022 fiscal year, for example, may not have access to funds to bridge the gap until they receive their disbursement, and if its projected than thats a wholeother issue - again, I think that this should be easy to tinker with and make it not be a problem, and what exactly it would look like depends entirely on your tax system and tax credit system proposal.</p>\n<p>Similarly, there's a lot you can do even in a means tested system to try and remove the welfare trap - UBI proponents are just suggesting we solve the problem at the bud. I understand that you sent find it compelling - yeah, I do agree that the savings are not considerable, but if I were to argue that we should have UBI (I'm personally a proponent of universal basic services and don't think any proposed UBI should function as a replacement for welfare services, but that's a whole other topic) it would not be from a cost saving perspective. In regards to unemployment traps in particular, I think the universal aspect is important not because of savings but because it prevents people from falling through the cracks, and it's totally understandable if you have a different perspective on that ot that find it valuable. Again, I'm not trying to convince you or even make you consider anything, I'm just trying to answer what I perceived to be an open question about the arguments for universality with one that I think is interesting enough to merit attention.</p>\n", "parentCommentId": "3GzHgLgAodpumxG2D", "user": {"username": "tugbazsen"}}, {"_id": "HnSQALaKdDquv8yWK", "postedAt": "2023-01-11T07:34:19.009Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>Hold up. That $1T number originated from this <a href=\"https://academic.oup.com/swr/article-abstract/42/2/73/4956930?redirectedFrom=fulltext&amp;login=false\">peer-reviewed study</a> that I cited. I'd be happy to see your strong evidence that the $1T number is overblown, or perhaps even off by 10X. The goal here is to be less wrong.</p><p>But this is the EA forum, my friend. You can't just claim something's \"a fake, made-up number\" without any evidence. Especially when that source is a peer-reviewed academic study.</p><blockquote><p>ignoring the huge genetic confounding that accounts for a very substantial part of the correlation between child poverty experience and worse adult outcomes.&nbsp;</p></blockquote><p>If anything, this seems to me like an extremely dubious claim. The idea that 'genetic confounding' has anything to do with why impoverished childhood experiences lead to worse adult outcomes absolutely needs a strong RTC Study cited. Actually, it would need several gold-standard studies and a meta-review.</p><p>At first glance, 'genetic confounding' (especially in the context of poverty) also seems like a slippery slope to the idea that poor people are poor because there is something wrong with them, ignoring the multitude of ways the cards are stacked against them.</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=ydKcaIE6O1k\"><div><iframe src=\"https://www.youtube.com/embed/ydKcaIE6O1k\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure><p>However, I'd really like to give you the benefit of the doubt. What were you trying to get at?</p><p><strong>Cite your sources, this isn't Twitter.</strong></p><ul><li>Approach disagreements with curiosity</li></ul>", "parentCommentId": "CgeN87huEk5Px8KBN", "user": {"username": "Michael Simm"}}, {"_id": "AouQwntFWbwpvxKZ9", "postedAt": "2023-01-30T13:23:40.606Z", "postId": "3Cm7jFAxiNAKbQTki", "htmlBody": "<p>Dear friends,&nbsp;<br><br>I won't hide this, I was kindly asked by a friend to take a look at this thread. I have to admit that I was surprised and taken aback from the fact that the discussion focused not on whether this will restore dignity and give independence and a new lease on life to those not-so-well-off for whatever reason, and the reduction of inequality (after all, from what I hear, the US is one of the most unequal societies in the developed world), but rather gave me the impression that it was concerning itself too much with minutiae. From the evidence and the history, as this article points out: <a href=\"https://en.wikipedia.org/wiki/Universal_basic_income\">https://en.wikipedia.org/wiki/Universal_basic_income</a> , it seems that the idea is a) not new at all and that it has quite a venerable and 'universal' history (from Julius Caesar's Rome to Ahmadinejad's Iran) and that b) it has worked well in various settings (not everywhere admittedly).&nbsp;<br><br>So with all due respect I would kindly ask you to see the forest and miss it for the tree, in other words consider whether UBI can help alleviate poverty and reduce inequality (my take would be by empowering people through guaranteed money - If I remember correctly, in some experiments with UBI, there was a surge in enterpreneurship from formerly disempowered sections of the population).<br><br>As for numbers (I think EA likes numbers), if a person with an income of 5,000 annually receives a 1,000 annual help, this represents a 20% increase in their revenues. If a person earns 1,000,000 annually then a 1,000 help is merely a (if i'm doing my sums right) 0,1% percent revenue added. However, the difference may be that the first person feeds their whole family milk and bread for the year whilst the second one buys their third Rolex watch. So everybody's happy.&nbsp;<br><br>Apologies in advance if this sounds a bit crude and not logical enough, I'm just feeling a bit sentimental today,<br>Haris</p>", "parentCommentId": null, "user": {"username": "Haris Shekeris"}}]