[{"_id": "iuT9quT9mmxtbsxGd", "postedAt": "2013-10-18T06:25:00.000Z", "postId": "3DGYg2RxXHgekLGeG", "htmlBody": "<p>Doh, this is so wrong, and I note in your criticism of Howard Buffet that you simply don't understand why.</p><p>Simply, the global system of capitalism is unfair.</p><p>The winners take order-of-magnitude multiples of reward, completely disproportionate to their efforts, compared to the poor.  It's a power law, and part of that is the self-reinforcing effect that having wealth makes it easier to get more wealth.  The only way this can happen is that wealth is shifted from the poor to the rich, and of course Wall Street is the very pinnacle of this system.</p><p>Like in sports. The best players are multi-millionaires, the worst get nothing at all, indeed they end up contributing towards the winners by buying sponsored sports equipment, paying for training, seminars, etc, attending sporting events, and often volunteering for free.</p><p>That might be fine for sports. But it's not what we want in life.</p><p>By proposing that do-gooders work on wall street, you're advocating people do exactly what Howard Buffet talks about.  Taking with their left hands, before giving with their right.</p><p>The Aid industry is just a salve on the problem, and though it obviously helps individuals and saves lives, it doesn't address the underlying problem. Indeed it can make the most glaring of the symptoms disappear to a point that to some people the problem doesn't appear to need a solution.</p>", "parentCommentId": null, "user": {"username": "Jack_Jones"}}, {"_id": "aFwgZ2s2NfDSWcP4t", "postedAt": "2014-09-10T20:57:02.945Z", "postId": "3DGYg2RxXHgekLGeG", "htmlBody": "<p>Thanks for raising this topic. Your position probably captures what very many people think when hearing about &quot;earning to give&quot; for the first time. It's difficult to engage with most of your points, though, because in the last sentence of your reply you seem to be favoring a situation where conditions deteriorate, rather than improve, for impoverished people, so that political changes will take place that you believe will be ultimately beneficial. That's probably correct under some circumstances, but in general the burden of proof would be on you.</p>\n<p>Alternatively, if you think political change is the way to ultimately help people, wouldn't you want high-earning persons to support efforts at political change, if there are advocacy organizations in need of funds? Would you agree that, in principle, the positive effects of that investment could outweigh negative effects from the marginal usefulness of that person to their employer, above their next-best-qualified potential employee?</p>\n", "parentCommentId": "iuT9quT9mmxtbsxGd", "user": {"username": "ChrisJenkins"}}, {"_id": "zCZypDiFPgXoH24qB", "postedAt": "2016-04-15T18:51:00.086Z", "postId": "3DGYg2RxXHgekLGeG", "htmlBody": "<p>I have often heard in the flights that in case of emergency first help yourself and then help others. The concept of self has always had a preference over the personhood of others. Having said that, the argument of the author seems to suffer from some fundamental flaws: The premise of his argument is based on an assumption that that work done by an individual is independent of any utility that she may derive from her work. It further assumes that utility derived by doing charity might substitute the utility which one may derive from one's work. Both the arguments are interconnected. Say, it is difficult to say how long would merely a charity derive A to suck up to a corporate job which she doesn't enjoy. This is an economic argument. </p>\n<p>There are social and moral drawbacks too. If one does a work merely to benefit another and not because one enjoys it then society may be deprived of works of excellence and this drag may impede the development of society at large. Imagine if Einstein or Michelangelo, may have take up a corporate job to benefit others.</p>\n<p>Third and the most important argument against this approach is moral. We all have autonomy to choose what we want to. It's certainly that one makes a choice to take up a high paying job, to benefit others. The fundamental idea behind exercising autonomous choice is to find ones' meaning of life. As the Greek philosophy goes on this, the purpose of life is to find ones' own destiny. I would place certitude and conviction to be of paramount importance in making ones' choice. If one's experience, culture and other influences lead to that certitude and conviction about ones' decision to take up a high paying job and do charity then that's fine, else one may find herself in a drag and thoroughly despicable situation, certainly sailing through against fulfilling ones' destiny. </p>\n", "parentCommentId": null, "user": {"username": "sushantlawyer"}}, {"_id": "2eudZujq5hygLdLrQ", "postedAt": "2016-12-24T09:59:08.814Z", "postId": "3DGYg2RxXHgekLGeG", "htmlBody": "<p>The fact that so many people do this is exactly why we have harmful charities like AMF ranked as the top charities, because the people involved in the EA movement are not on the ground.  They do not see the long-term harm that these charities do to communities.  They fail to realize that they are actually increasing the amount of money that is destroying jobs, limiting freedom, and increasing dependence.  When you are not on the ground you don't realize how harmful the charities promoted here are.  I live in Africa and I have seen for years the long term harm that charities like AMF do.  They are not merely ineffective, they do more harm than good.  <a href=\"https://www.youtube.com/watch?v=cmzTAJUspc8\">Here's the full argument</a></p>\n", "parentCommentId": null, "user": {"username": "carneades"}}]