[{"_id": "LGQGoqW4AbjZA8tBd", "postedAt": "2023-11-23T09:48:17.413Z", "postId": "3diski3inLfPrWsDz", "htmlBody": "<p>I don't think it would very surprising if a <a href=\"https://xkcd.com/1838/\">giant pile of linear algebra calculations</a> figured out how to do linear algebra calculations.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "7NuA2NtZefhscPPDo", "postedAt": "2023-11-24T21:56:06.165Z", "postId": "3diski3inLfPrWsDz", "htmlBody": "<p>Thoughts on <a href=\"https://www.youtube.com/watch?v=3d0kk88IE8c&amp;ab_channel=DavidShapiro\">this</a>? Supposedly shows the leaked letter to the board. But seems pretty far out, and if true, it's basically game over (AES-192 encryption broken by the AI with new unintelligible maths; the AI proposing a new more efficient and flexible architecture for itself). Really hope the letter is just a troll!</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "6rAEdTYJyjJcb3wK2", "postedAt": "2023-11-24T22:00:32.923Z", "postId": "3diski3inLfPrWsDz", "htmlBody": "<p>I guess you're sort of joking, but it should be really surprising (from an outside perspective) that biological brains have figured out how to understand neural networks (and it's taken billions of years of evolution).</p>", "parentCommentId": "LGQGoqW4AbjZA8tBd", "user": {"username": "Greg_Colbourn"}}, {"_id": "YFy6FEuwLvYeLmMid", "postedAt": "2023-11-25T21:16:47.250Z", "postId": "3diski3inLfPrWsDz", "htmlBody": "<p>Whatever the nature of Q*, there is not much evidence that it could have prompted the Altman firing. It's not clear why some very early preliminary results about a Q* as described would prompt a firing nor why the firing would be so abrupt or when it was if the research happened months ago (and Altman was alluding to it publicly weeks ago), while Sutskever's involvement &amp; the exact timing of the firing appear to be adequately explained by <a href=\"https://www.lesswrong.com/posts/KXHMCH7wCxrvKsJyn/openai-facts-from-a-weekend?commentId=3cj6qhSRt4HoBLpC7\">other issues</a>.</p>\n<p>As there is still nothing leaking or confirming Q*, I'm increasingly skeptical of its relevance - for something supposedly being demoed and discussed company-wide, if it was so cosmically important or so safety-relevant, you'd think there'd be more meat on the rumor bones by now, and there wouldn't be issues like denying that Murati confirmed the rumors as opposed to merely described the rumors (which is the sort of garbling that is in line with past leaks like the initial misdescriptions of Sutskever refusing to give examples of Altman's deceptive behavior). This increasingly sounds like a real system (maybe) which has been seized on by hype and yoked to a scandal it's mostly uninvolved with. (Maybe related to issues of candor, but not 'the' reason.)</p>\n<p>Discussing Q* seems like a big distraction and waste of time, IMO, when there are better-reported things to discuss (like Altman trying to fire Helen Toner from the OA board).</p>\n<p>I'm confused why people are broadcasting such a tiny morsel of news so much, and it's getting so much play on places like Marginal Revolution, while other parts of the recent OA drama don't seem to rate a mention. Nobody seemed to care even 1% as much about the prior OA research like GPT-f or process evaluation...</p>\n", "parentCommentId": null, "user": {"username": "gwern"}}]