[{"_id": "pyeyt97BPsf6qmpJi", "postedAt": "2022-11-15T18:03:08.523Z", "postId": "3EvLvjfsujzjjXTJM", "htmlBody": "<p>Thanks for posting this, Jeremy! The Delay, Detect, Defend framework is the best I know for understanding the strategy behind actionable interventions for GCBR reduction. A biosafe world seems within our reach, but we must take these threats seriously.</p>", "parentCommentId": null, "user": {"username": "Lenny McCline"}}, {"_id": "7otwSLc7FvqWZsZ9p", "postedAt": "2022-11-15T18:35:03.684Z", "postId": "3EvLvjfsujzjjXTJM", "htmlBody": "<p>Agreed. I find Kevin to be an excellent communicator on the subject. There are a few other posts on the forum with podcasts and videos featuring him, easily found my searching on his name, for those who are interested in further content.</p>\n", "parentCommentId": "pyeyt97BPsf6qmpJi", "user": {"username": "captainjc"}}, {"_id": "pNZ8DQuDygkGoiCa8", "postedAt": "2022-11-16T17:00:56.829Z", "postId": "3EvLvjfsujzjjXTJM", "htmlBody": "<p>For anyone interested in this topic, I recommend listening to <a href=\"https://open.spotify.com/episode/1ijFdqtpISsZngIdsfn5GI?si=741e568fab3947bd\">this </a>podcast, which hosts Kevin Esvelt and Jonas Sandbrink. They cover a lot of similar ground as the paper and I found it to be a pretty good listen.&nbsp;</p>", "parentCommentId": null, "user": {"username": "aj_kourabi"}}, {"_id": "n3FrhejRypB7CafEr", "postedAt": "2022-11-23T19:50:51.419Z", "postId": "3EvLvjfsujzjjXTJM", "htmlBody": "<p>This is terrifying.</p>\n", "parentCommentId": null, "user": {"username": "Michael_2358"}}, {"_id": "T3s97ZrRAHXmDEZwC", "postedAt": "2022-11-23T19:54:31.130Z", "postId": "3EvLvjfsujzjjXTJM", "htmlBody": "<p>Does anyone know if pandemic prevention PAC that SBF had been funding (Protecting our Future?) is going to live on? Seems like it should.</p>\n", "parentCommentId": null, "user": {"username": "Michael_2358"}}, {"_id": "3Z5a5EmhavYCBKjuL", "postedAt": "2022-11-23T19:55:18.154Z", "postId": "3EvLvjfsujzjjXTJM", "htmlBody": "<p>Thanks for sharing this! In case someone wants another summary/writeup, Kelsey Piper also <a href=\"https://www.vox.com/future-perfect/2022/11/23/23475085/covid-pandemic-infectious-disease-virus-pathogen-illness-kevin-esvelt-genetic-sequencing\">wrote about this for Vox's Future Perfect</a>.</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "RWF35Akz6z54AYJ9G", "postedAt": "2022-12-08T11:31:31.656Z", "postId": "3EvLvjfsujzjjXTJM", "htmlBody": "<p>It's a great overview.</p>\n<p>Some things I find missing/underemphasized in the Defense section:</p>\n<ul>\n<li>\n<p>Ventilation is mentioned briefly, mentioning that achieving aircraft-level ventilation (20 air changes/hour, ACH) is expensive and noisy. But substantial reduction already comes at 6ACH, and 12 ACH is really good (but would probably not stop Omicron BA1-level transmission in an immunologically naive population). Enforcing air quality standards in transport hubs seems a sensible and valuable policy to me.</p>\n</li>\n<li>\n<p>Broad-spectrum antivirals aren't empathized because they would be circumventable and face distribution issues. The first seems not a strong reason: a number of antiviral medications together would very significantly constrain the option space. There are also plenty of immunosupportive therapeutics in development that would be hard to circumvent. I would think production would be a bigger issue than distribution? Stockpiling seems like the obvious solution.</p>\n</li>\n<li>\n<p>There's decent evidence of certain nasal sprays (containing eg povidone iodine or carrageenan) being broadly effective against airborne pathogens. These could be stockpiled, freely distributed/cheaply promoted at travel hubs, or added to people's daily routines (e.g. like washing hands and brushing teeth)</p>\n</li>\n</ul>\n<p>Regarding Detection:</p>\n<ul>\n<li>I'm not sure how long it will take to convince institutions to do air sampling. As an intermediate solution, air sampling could also be crowdsourced. There are people measuring CO2 levels everywhere they go. Let them take swabs from the outside of their respirators or portable air filters and send it to a lab?</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}]