[{"_id": "rySAGkwpTqXva7jQX", "postedAt": "2022-12-09T20:22:28.269Z", "postId": "3EWpLid8tkyYJakfm", "htmlBody": "<p>Really excited to see this initiative! AGISF is one of my favourite AI Safety field building projects, and I'm excited that there'll be an org focusing and iterating on making this kind of thing better</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "wGsNcA4vKiqvoMAuu", "postedAt": "2022-12-10T05:39:31.180Z", "postId": "3EWpLid8tkyYJakfm", "htmlBody": "<p>Can I ask why you ended up going with the BlueDot name, given the name collision with <a href=\"https://bluedot.global/\">another project in the biosecurity space</a>?</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "ZdgbLgefxz6cAQ7tg", "postedAt": "2022-12-10T12:32:17.123Z", "postId": "3EWpLid8tkyYJakfm", "htmlBody": "<p>We don't currently believe the name collision will cause significant issues, and we're taking steps to mitigate any potential confusions that do arise.&nbsp;</p><p>We also discussed the name collision with the other BlueDot in August and September of this year to evaluate how much of an issue it would pose to them and to us, and we ultimately decided to move forward with this name choice.&nbsp;</p><p>Some other things:&nbsp;</p><ul><li>We consulted with other advisors within and outside the biosecurity community to evaluate how much of an issue this might pose&nbsp;</li><li>We emphasize that we're an education-y project that has courses on many different global problems&nbsp;</li><li>Our focus area websites (e.g. the <a href=\"https://www.agisafetyfundamentals.com/\">AGI Safety Fundamentals</a> site) are currently the more public-facing brands that we use, as opposed to the project brand (BlueDot Impact), though this might change with time&nbsp;</li><li>We always say \"BlueDot Impact,\" and not \"BlueDot\", and the BlueDot Impact &nbsp;branding is very different from the other BlueDot&nbsp;</li></ul><p>I started thinking about alternative names in Summer 2021, and we've brainstormed and evaluated many different names since then. BlueDot Impact was overwhelmingly preferred by people we surveyed and within the team. I'm overall very excited about this name and to develop this brand, and hope to be able to collaborate with other stakeholders if/when confusions arise :)&nbsp;</p>", "parentCommentId": "wGsNcA4vKiqvoMAuu", "user": {"username": "dewierwan"}}, {"_id": "phiQmemKdb48EHLSF", "postedAt": "2022-12-11T03:34:29.475Z", "postId": "3EWpLid8tkyYJakfm", "htmlBody": "<blockquote><p>We also discussed the name collision with the other BlueDot in August and September of this year to evaluate how much of an issue it would pose to them and to us, and we ultimately decided to move forward with this name choice.&nbsp;</p></blockquote><p>Does this mean \"we discussed this with them and they were happy for us to use the name BlueDot\", or does this mean \"we discussed this with them, and they weren't happy, but we decided the tradeoff was worth it\", or something else?</p>", "parentCommentId": "ZdgbLgefxz6cAQ7tg", "user": {"username": "pseudonym"}}, {"_id": "arKGvku2ynxJAtNyf", "postedAt": "2022-12-11T19:26:51.599Z", "postId": "3EWpLid8tkyYJakfm", "htmlBody": "<p>Yeah, given that both BlueDots are active in my biosecurity network (albeit in quite different capacities), I'm a little annoyed about this.</p>", "parentCommentId": "wGsNcA4vKiqvoMAuu", "user": {"username": "willbradshaw"}}, {"_id": "ojETeRL9JQZeyp8Ra", "postedAt": "2022-12-16T17:06:17.364Z", "postId": "3EWpLid8tkyYJakfm", "htmlBody": "<p>Congrats, team! Excited to see you all scaling the programs to help people build their careers alongside a community. 🚀&nbsp;</p>", "parentCommentId": null, "user": {"username": "harshitajain"}}]