[{"_id": "LG6WDAmugt7FFeGzm", "postedAt": "2024-01-01T08:27:57.118Z", "postId": "3fceNPRkSwqTivJJ7", "htmlBody": "<blockquote>\n<p>I remember a lot of DIY spirit in the early EA days - the idea that people in the community are smart and capable of thinking about charities and evaluating them, by themselves or with their friends or meetup groups.</p>\n<p>Nowadays the community has more professional and specialized programs and organizations for that, which is very much a positive, but I feel like has consequently led to some learned helplessness for those not in those organizations.</p>\n</blockquote>\n<p>I strongly, strongly agree with this. I think professionalized charity evaluation is a key part of the EA ecosystem, but I see its role as downstream of people experimenting to discover good opportunities. The limiting factor in making final, gold-standard approvals is expertise - professional evaluations help with that process. However, the limiting factor in discovering potential candidates for gold-standard approval is that <em>the world is really fucking big</em>. It would take billions of work-hours to evaluate all the potential candidates, more than the professional evaluators could handle if all of them worked 24/7 for years.</p>\n<p>We can all contribute a lot by digging up opportunities, especially in domains where we are experts of a kind. OP's Cause Exploration Prize was <a href=\"https://forum.effectivealtruism.org/posts/LSDZ22GFryC3dhWvd/cause-exploration-prize-organophosphate-pesticides-and-other\">won</a> by a domain expert on biology, another prize was <a href=\"https://forum.effectivealtruism.org/posts/majcwf7i8pW8eMJ3v/new-cause-area-violence-against-women-and-girls\">won</a> by a domain expert on social work. These authors may not have been professional evaluators, but they knew enough about their respective areas to make a good case that was legible to the professional evaluators, who could then recognize their value, even if they wouldn't have uncovered that opportunity in the first place.</p>\n<p>\"Expert\" doesn't mean you have a PhD or whatever, it just means you have inside information about a field/region/ecosystem that others don't. You have a lamp post that you can search for your keys under. Yes, in the original metaphor, searching for your key under the lamp post is irrational, but imagine if ten thousand of us each search under a lamp post that only we can see; between all of us, the chance that someone finds the key is very high! On the other hand, if only ten of us search, even if those ten people have really big lamp posts (= larger range of expertise) they won't cover as much area.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "3CmdeeJG5gPyocg4u", "postedAt": "2024-01-02T01:09:58.669Z", "postId": "3fceNPRkSwqTivJJ7", "htmlBody": "<p>I really like your lamp post analogy! The world is big and the more EAs practice looking under their own lamp posts and writing up what they find the better the community will be for it.</p>", "parentCommentId": "LG6WDAmugt7FFeGzm", "user": {"username": "jenn"}}, {"_id": "wyxMbZS9fBrZ3CzYn", "postedAt": "2024-01-02T15:56:30.246Z", "postId": "3fceNPRkSwqTivJJ7", "htmlBody": "<p><strong>Executive summary</strong>: The author donated $16,500 CAD in 2023, with 90% going to the Against Malaria Foundation and 10% to local charities. They struggled with evaluating a charity providing medical aid to Palestinians but ultimately stuck with the most cost-effective option.</p><p><strong>Key points</strong>:</p><ol><li>Donated $15,000 to Against Malaria Foundation, which saves one life per $7,300 donated. Considered a charity providing medical aid to Palestinians but it did not reach the same cost-effectiveness.</li><li>Donated $750 to Sanguen, a local safe supply/harm reduction charity. Believes harm reduction has positive impacts despite mixed evidence.</li><li>Donated $750 to a financial assistance department helping new immigrants and refugees access government benefits. Estimates a 20-30x return on donations.</li><li>Organized effective altruism events focused on near-term and non-AI issues, with funding from the EA Infrastructure Fund.</li><li>Encourages evaluating local charities as a community building exercise, to improve charity selection skills and push back against overreliance on centralized charity evaluators.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]