[{"_id": "mKXyEr9fEKzvM7C5a", "postedAt": "2023-05-17T18:31:09.324Z", "postId": "3fpsT79M4sj2cDvxt", "htmlBody": "<p>That's a real shame, It was a really good idea, they were really well put together, and I found them really helpful, and they definitely looked like something that would be extremely high EV. But I almost never encountered them because they frequently didn't seem to get enough upvotes to persist on the main page for long (maybe extremely large numbers of people didn't have their posts make the cut so a few of them strong downvoted it?). I definitely thought that they should have been integrated into the site somehow.</p><p>I'll go over the archive when I have time to do some reading, since they really were a great way to find a post that interested me.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "KSYbcyafaTcHzqtGk", "postedAt": "2023-05-17T22:29:46.040Z", "postId": "3fpsT79M4sj2cDvxt", "htmlBody": "<p>I was really appreciating these, but (as I said privately) this seems like a great opportunity, so congratulations!&nbsp;</p><p>As an aside, there's also the <a href=\"https://www.effectivealtruism.org/ea-newsletter-archives\">monthly \"EA Newsletter\"</a> (which I run, so I'm biased when I'm recommending it) and newsletters on the <a href=\"https://forum.effectivealtruism.org/topics/newsletters\">\"Newsletters\" topic page</a>.</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "ckNK8N5nFznxvyPjs", "postedAt": "2023-05-18T07:54:34.719Z", "postId": "3fpsT79M4sj2cDvxt", "htmlBody": "<p>Thanks! And good call, sorry for missing that one - added it into the post :-)</p>", "parentCommentId": "KSYbcyafaTcHzqtGk", "user": {"username": "GreyArea"}}, {"_id": "MgofpcWhGM2rwohYK", "postedAt": "2023-05-18T07:56:54.393Z", "postId": "3fpsT79M4sj2cDvxt", "htmlBody": "<p>Thanks, this is great feedback to hear, even if things are closing shop for a while.</p>", "parentCommentId": "mKXyEr9fEKzvM7C5a", "user": {"username": "GreyArea"}}]