[{"_id": "iNx83mSqzSeqHt4wC", "postedAt": "2018-09-21T15:50:31.563Z", "postId": "3hXsB5B8WMZ6usRTu", "htmlBody": "<p>I found it to be a pleasant read, thanks. I always like clear distinctions between concepts and I feel your article does this well. The article also seems to include several partially implicit recommendations. I feel these recommendations should either have been made more explicit and more structured or should not have been there. </p>\n<ol>\n<li><p>In various parts of the article you make a connection between the effectiveness of a community building organisation and them receiving money. To me it is unclear whether you are recommending that more money should be allocated towards community building (in which case I feel there is a lack of supportive evidence presented) or whether you are just posting a hypothesis (in which case I feel it is presented too much as a recommendation).</p>\n</li>\n<li><p>The conclusion of the article also seems to hold a recommendation. To me it is unclear what the difference is between your recommendation and the current situation. Right now I feel slightly confused and if pressed I would guess (based on the paragraph including the “-yay, meta!-” comment)  that you would like to cut out a middle layer? </p>\n</li>\n</ol>\n<p>These are just two examples, similar issues arise for me with the other recommendations. A possible way of solving this (next time?) could be to include your recommendations as bullet points in your conclusion and explicitly state to what open question the recommendation pertains and how your recommendation differs from the current consensus opinion or current situation. I think this will facilitate discussion.</p>\n<p>Overall I like it as  I feel all your recommendations seem both relevant and sensible. I just feel it could be improved by being more explicit and structured in your recommendations.</p>\n", "parentCommentId": null, "user": {"username": "direct_feedback"}}, {"_id": "KWPZ8RbfXHNP7qiw4", "postedAt": "2018-09-25T11:56:39.231Z", "postId": "3hXsB5B8WMZ6usRTu", "htmlBody": "<p>Thanks a lot for this, much appreciated! This gave me the chance to clear up some things for myself. It’s hard to get direct_feedback. ;)</p>\n<p>There are two key points I tried to get across with this post and that I should have highlighted more clearly:</p>\n<ol>\n<li>Propose new language to talk more productively about network and community building; and</li>\n<li>Present and illustrate reasons for why I think this lingo is needed and closer to reality.</li>\n</ol>\n<p>Regarding your points:</p>\n<p>I) Effectiveness and receiving money: I would want to encourage people who are able to/want to invest significant amounts of time into EA work to figure out what kind of direct, non-”community building” project they could start/contribute to (without significant downside risks) <em>before</em> they start building a local group or alike.</p>\n<p>Most of such work will likely look similar in many places: offer career coaching to the most promising people you can find. Being able to coach people requires you to stay on top of things. 1-on-1 discussions leave plenty of room to avoid negative impact and learn quickly.</p>\n<p>I could see community development happening in a more meaningful way through such outcome oriented work than through &quot;starting a local group and organizing meetups&quot;. Such concrete work helps to a) develop individuals’ expertise much more directly and b) produces the outcomes that can prove alignment to the larger network with fairly tight feedback loops. Later, they can figure out their comparative advantage and, with support, tackle more risky prospects. </p>\n<p>To have the time to do that though, one has to have money. My recommendation here wouldn't be to simply pay more people to have this time. I could e.g. imagine that the &quot;network development organisation&quot; offers “EA trainings” to promising individuals. If completed successfully, people receive a first grant to build up their community through such direct work. Grants get renewed based on performance on a few standard metrics that can be built upon over time.</p>\n<p>Some of this is already happening, but I see much room for improvement by modeling these structures more explicitly and driving their development more openly.</p>\n<p>II) Conclusion: I’d recommend to define labels, roles and accountabilities within the network more clearly.</p>\n<p>We often label CEA, LEAN, and EAS as &quot;community building orgs&quot; - but all three actually have quite different roles. I believe that it would be better if these organisations explicitly defined their respective roles. It is not clear to me that these three organisations really are working on similar things beyond the fact that the same label is used for their activities. I would claim they mostly aren't, and the few things they all do could be more efficient and improved faster by only one.</p>\n<p>What is different from reality? Mostly the labels and definitions - which I hope should give a clearer sense of what everyone is doing and thereby ease the development of the network as a whole.</p>\n<hr />\n<p>I aimed to contribute to a common understanding of what the network is, what communities are, how to build good ones, who has which responsibilities, how to define them better, how to make sure the network maintains high quality, and how to make people learn/understand all of that.</p>\n<p>In the process of writing the other articles in our series on EA Geneva’s “community building”, we got much feedback that especially the latter point of “how to make people learn/see/understand all of that” is currently a big issue. Many people seem upset with how they are received when they are trying to contribute/start something in good will. Due to a lack of clarity, they end up wasting their own or EA orgs time and it is frustrating for everyone involved.</p>\n<p>We could make network building and community building much more effective if we employed better terminology, had a clearer vision of what the ideal network development structure might look like and could be collectively working towards it - or at least discuss it better. I hope this contributes a little to that process.</p>\n", "parentCommentId": "iNx83mSqzSeqHt4wC", "user": {"username": "konrad"}}, {"_id": "chzZ2JYW8rxp8JLCr", "postedAt": "2018-09-27T14:57:40.930Z", "postId": "3hXsB5B8WMZ6usRTu", "htmlBody": "<p>Amazing. Love your reply (all of it). Your second point in the beginning made me realize that your definitions are meant to match your observations (not some hypothetical construct). I like the paragraph &quot;I could see... Risky prospects&quot; because it makes one of your recommendations really explicit and therefore makes it easier for me to understand what you think ought to be and what is. And on top of that I like the recommendation. So thanks.</p>\n", "parentCommentId": "KWPZ8RbfXHNP7qiw4", "user": {"username": "direct_feedback"}}]