[{"_id": "WgyLLYGfQqkAQT88N", "postedAt": "2022-10-01T20:12:58.143Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I love this post. I’m a secular atheist and am strongly influenced by the New Atheism movement, but even I must admit there are habits and customs we can learn from religions and religious communities that can be beneficial if we apply it to ourselves and our communities.</p>\n<p>Some of the acts Tyler Cowen recommended was abstaining from alcohol, being co-dependent on others (if I recall that correctly), having many children, and building private social safety nets.</p>\n<p>(I’m just listing what Cowen said and am not saying I agree or disagree with them all).</p>\n<p>I’ve been trying to find this book which talks about the importance of ritual for secular people (I think the author was a secular atheist too). Lmk if anyone knows the name of the book I’m talking about.</p>\n", "parentCommentId": null, "user": {"username": "Jeffrey Arana"}}, {"_id": "ygzSJrBdfPDcRrroL", "postedAt": "2022-10-01T21:50:43.804Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Some quick impressions and thoughts:</p><p>1. I like historical&nbsp;anecdotes and forgotten/underappreciated pieces of history. I enjoyed learning about the Quakers and some of their achievements.</p><p>2. I agree that a lot of the discussion on whether religion is good or bad is incredibly&nbsp;superficial. Nowadays it's popular (among secular elites)&nbsp;to slam religion, but I'm quite certain that religions have played important roles in many positive developments (and, on the other hand, in many&nbsp;atrocities). Of course different religious groups are very different from one another and I think it's very likely that some have been net positive while others net negative (it likely also depends on what you'd consider the counterfactual alternative to religion, given that it's been so prevalent throughout most of human history).</p><p>3. It's not entirely clear to me what you suggest in this post. Do you think that EAs should embrace a more religious attitude in general (and what would it mean practically, given that religions are so different)? Or do you specifically advocate for Quakerism? (Again, what would it&nbsp;mean in practical terms?) Or should we just be more open to learn useful lessons from historical&nbsp;groups wherever they happen to present themselves? If you just intended for this post to provide some inspiration and didn't have clear action items in mind that's also perfectly fine (I just left the reading with some uncertainty about what you really&nbsp;tried to say).</p>", "parentCommentId": null, "user": {"username": "nadavb"}}, {"_id": "oPZeHgjzZdHktC3uP", "postedAt": "2022-10-02T18:14:00.590Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Thanks for this - really appreciate your thoughts!</p><p>On 3 - I think seriously examining what made Quaker membership so impactful, as well as ahead of the moral curve, is something we should consider as a community. I think we should consider that various culture parts of Quakerism may have contributed meaningfully to their productivity - for example, I do wonder if EA meetups that emphasise silence, with occassional spoken words or passages read aloud by members who felt compelled, would actually have a bunch of unknown positive effects to the quality of debate and ideas.</p><p>I am definitely uncertain about what this would mean in a multitude of ways but I do think emulation means that you can improve a community through grabbing a series of positives that you might not, through a priori reasoning, realise are positives. Things that seem unnecessary might be very important - and we should be open to historical precedents to see if we can try any of these (at least particularly low cost examples) and see if we find a bunch of unintended positive results.</p>", "parentCommentId": "ygzSJrBdfPDcRrroL", "user": {"username": "Lawrence Newport"}}, {"_id": "3ke9ehneNLjDo2sgW", "postedAt": "2022-10-02T18:15:05.593Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Really great to hear - yes I don't advocate for adopting Quaker views, but I do think Quaker practices may be of some use to us. Which ones, and in what ways, I don't know - but I do consider its worth taking a very broad look at the Quakers and attempting some versions of key parts of their practices.</p>", "parentCommentId": "WgyLLYGfQqkAQT88N", "user": {"username": "Lawrence Newport"}}, {"_id": "8zRSHQCPoMpTZfySr", "postedAt": "2022-10-02T18:24:58.314Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Yeah. I like your analogy of EA and Quakers being a minority, but hopefully, EA can make an ethical revolution as the Quakers did with the abolition of slavery. We can certainly learn some tactics and habits from them while simultaneously not believing in their faith.&nbsp;<br><br>If someone is interested in looking more into this, I remember Willam MacAskill wrote about Quakers and their impact on the abolition movement in \"What We Owe the Future.\"</p>", "parentCommentId": "3ke9ehneNLjDo2sgW", "user": {"username": "Jeffrey Arana"}}, {"_id": "Pkkdtj2gGjjESMFYA", "postedAt": "2022-10-02T20:46:06.233Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I like this post. It also seems to me that your point is really about community, not religion. The good things about the Quakers you mention don't seem to be fundamentally about God or mysticism or something. What do you think?&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "uyLGszRsH95GKuziR", "postedAt": "2022-10-03T03:03:29.943Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Interesting post! Something I've thought about in a different direction is how EA seems to share the dedication to doing good of many religions but not the emphasis on a particular practices aimed at reducing greed/negative traits and building discipline/compassion/positive traits/emotional resources that help sustain such altruistic action. For example, various forms of meditation like loving-kindness and insight, reflection, etc.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "JXPAp89sBfC3apE7r", "postedAt": "2022-10-03T09:41:18.652Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Yes, I'm not advocating for a belief in God, but perhaps for practices that arose due to a particular belief in God. For instance, Quaker style meetings might have a bunch of unknown positive effects that we just can't reason or realise a priori. It's worth looking at their practices and seeing which ones we consider might be useful for the community (or parts of the community) to adopt</p>\n", "parentCommentId": "Pkkdtj2gGjjESMFYA", "user": {"username": "Lawrence Newport"}}, {"_id": "sqmuxYJXAij8qXQuX", "postedAt": "2022-10-03T09:47:49.053Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>In a way I suppose EA does rather heavily emphasise against greed in a few directions (giving what we can, earning to give) but it certainly doesn't emphasise many personal behaviours beyond (adjacently perhaps) rationalism.</p>\n<p>I do wonder if, as you say, some of the strength of effective religious movements was an emphasis on personal behaviours the community should strive to include and praise. This was somewhat Tyler's point about being Mormon - they have a bunch of behaviours that push the group towards long-term success (for instance, banning alcohol consumption from members and encouraging lots of children).</p>\n", "parentCommentId": "uyLGszRsH95GKuziR", "user": {"username": "Lawrence Newport"}}, {"_id": "Hh3Xp6whKjdqgmW7C", "postedAt": "2022-10-03T22:43:44.594Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Yeah, that's a good point about giving. Giving itself can be a transformative action. I guess if I were to put it another way, EA shares many religions' emphasis on works/charity but not necessarily experiences and practices of 'faith'/transcendence.&nbsp;<br><br>In terms of the Mormon stuff, I think importing cultural habits is maybe different but adjacent to what I mean. Although maybe some aren't that separate. It seems like abstaining from alcohol exists in a lot of different religions so maybe that particular behavior was found to be helpful in some way to personal transformation (I am assuming certain kinds of personal growth as a kind of distinct goal to be paired with charity/good deeds in the world). And in terms of having kids, it seems like many religions distinguish between a \"lay\" path that may or may not emphasize having kids, and a more hardcore \"monastic\" (to use Buddhist terminology) path that emphasizes celibacy as a virtue to clear the mind and have more time to focus on transformation and service.&nbsp;</p>", "parentCommentId": "sqmuxYJXAij8qXQuX", "user": {"username": "Peter Gebauer"}}, {"_id": "JyXFCuz9csByKABYf", "postedAt": "2022-10-06T02:01:07.237Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Wow Lawrence great post. I have been beating a similar drum for some years. I am a humanist/Universalist but previously I was a Christian pastor, and I have No negative thoughts toward religion, in fact as a Universalist I admire all religions and as a humanist no religion. But like you I understand there is so much good useable stuff to be mined from religion. I think Anabaptists are also similar in many ways to Quakers and I’ve learned so much from them, though never a member myself.</p>\n<p>As a community of Altruists wanting to reach peak effectiveness it seems so obvious to me we should do what you’re saying. The single greatest altruist communities on earth today are religious communities and it’s always been that way…Universities as a thing, hospitals as a thing directly created by religious groups. Research and Science all comes from religious origins. Of course religion in Europe got so toxic just at the same point the scientific revolution took off that science was a meaningful refuge away from religion…you could have a life that made sense and do good things in the world for the first time away from the toxic religious situation at that time so educated people began fleeing religion. That set up the current unfortunate situation of secular humanists looking down their noses at religious people, culture, etc. I feel it’s a pendulum thing where they had to swing away, to escape the toxicity of hundreds of years of European religious wars following the reformation in 1500’s but now we can swing back and realize how much good was in religion as you’ve shown.</p>\n<p>Religion has these swings itself, where it goes good for some years and then usually gets a taste of political power and swings towards doing bad. I experienced this swing when the religious right in the 80’s discovered they could elect Presidents and Legislators and grabbed the power leading to the current poor state. I was in a big movement in the 90’s and 00’s where basically a bunch of us ejected ourselves out of the horrible directions things were going and started an alternative movement much inspired by Quakers, Anabaptists and others, called the Emerging Church Movement. It was a bunch of young leaders wanting to go in a way different direction and lead to a lot of great things. Unfortunately it was too white and male and we decided to lay it down and let others not white and male lead us forward…a very good death.</p>\n<p>One example of a useful thing for EA is cross cultural communication. For millennia religious people have crossed borders to communicate their messages…motivated by pure pragmatism they slowly but surely got good at it. My Bachelors degree is 50% exactly that…we got into it at a deep level. It has helped me so much in so many areas of life over the years. I think EA needs it in this way — to cross the cultural divide between Elite/STEM culture and creative/business and working class culture. For EA to grow and prosper these folks need to come in and there is a lot of work to be done to be able to communicate to them in ways they feel culturally comfortable with. That’s the goal of cross cultural communication- for the other to hear you in their own language and culture, the place they feel comfortable.</p>\n<p>Here’s where I think the trajectory of your post can be very fruitful…it’s not so much setting up a bunch of EA groups to study Quakerism…I doubt that would happen, rather it’s just to culturally swing the pendulum to a place where elite academic STEM people just feel comfortable and are more accepting of religious people and ideas, and lose their penchance to dismiss them, but rather have a new curiosity and openness.</p>\n<p>This becomes pragmatically hugely important if you found a new charity in Africa or South America or Asia and find yourself needing to work with stakeholders locally that are frequently going to be religious.  Then you are forced to get more religion friendly…why not start now and be ready.</p>\n", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "y8taqZk3s6DvauHPw", "postedAt": "2022-10-06T04:40:43.974Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>You've mentioned upthread that you're uncertain what exactly EAs should do to be \"more like peak Quakerism\", but can you take a stab at some concrete suggestions that illustrate what you mean? I'm just wondering what would change. Paraphrasing examples from other comments:</p><ul><li>emphasizing silence in EA meetups to improve the quality of debate and ideas?</li><li>whatever other aspects of Quaker-style meetings that make them distinctive? (like what?)</li><li>abstaining from alcohol?</li><li>being more co-dependent on others?</li><li>more rituals?&nbsp;</li><li>more children? (probably not?)</li><li>various forms of meditation like loving-kindness and insight, reflection, etc?</li><li>emphasizing other personal behaviors the community should strive to include and praise because they push the group towards long-term success?</li></ul>", "parentCommentId": null, "user": {"username": "Mo Nastri"}}, {"_id": "rcbjpMc8SmpGmZKae", "postedAt": "2022-10-06T04:46:48.687Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I interpret 80000 Hours as explaining this in their <a href=\"https://80000hours.org/articles/what-is-social-impact-definition/#social-impact-is-about-making-the-world-better\">What is social impact?</a> page (emphasis mine):</p><blockquote><p>What does it mean to act ethically? Moral philosophers have debated this question for millennia, and have arrived at three main kinds of answers:</p><ol><li>Making the world better — e.g. helping others.</li><li>Acting rightly — e.g. respecting the rights of others and not doing wrong.</li><li>Being virtuous — e.g. being honest, kind, and wise.</li></ol><p>These correspond to <a href=\"https://forum.effectivealtruism.org/tag/consequentialism\">consequentialism</a>, <a href=\"https://forum.effectivealtruism.org/tag/deontology\">deontology</a>, and <a href=\"https://forum.effectivealtruism.org/tag/virtue-ethics\">virtue ethics</a>, respectively.</p><p>We think all three perspectives have something to offer, but when our readers talk about wanting to “make a difference,” they’re most interested in the first of these perspectives — changing the world for the better.</p><p>We agree this focus makes sense — we don’t just want to avoid doing wrong, or live honest lives, but actually leave the world better than we found it. And there is a lot we can all do to get better at that. ...</p><p>In our essay on <a href=\"https://80000hours.org/make-a-difference-with-your-career/\">your most important decision</a>, we argued that some career paths open to you will do hundreds of times more to make the world a better place than others. So it seems really important to figure out what those paths are.</p><p><strong>In contrast, it’s often a lot easier to know whether a path violates someone’s rights or involves virtuous behaviour</strong> (most career paths seem pretty OK on those fronts), <strong>so there’s less to gain from focusing there.</strong></p><p>In fact, even people who emphasise moral rules and virtue agree that if you can make others better off, that’s a good thing to do, and that it’s even better to make more people better off than fewer. (And in general we think <a href=\"https://twitter.com/ben_j_todd/status/1463867302089302019\">deontologists and utilitarians agree a lot more than people think</a>.) ...</p><p>Since there seem to be big opportunities to make people better off, and some seem to be better than others, we should focus on finding those.</p><p>So, while we think <a href=\"https://80000hours.org/articles/harmful-career/\">it’s really important to avoid harming others</a> and to <a href=\"https://80000hours.org/articles/coordination/#1-adopt-nice-norms-to-an-exceptional-degree\">strive to act virtuously</a>, <strong>when it comes to real decisions, we think the potential positive consequences are what we should focus on the most</strong>.</p></blockquote>", "parentCommentId": "uyLGszRsH95GKuziR", "user": {"username": "Mo Nastri"}}, {"_id": "88riXmNbioQSkayj8", "postedAt": "2022-10-06T10:15:14.540Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Nice post! Like other have said in the comments, it's hard to come up with concrete takeaways. Personally, I'm going to spend more time with the very few quakers I know just to learn more about their general vibe.</p>", "parentCommentId": null, "user": {"username": "James Herbert"}}, {"_id": "3YfkZWEkQr6f7hmie", "postedAt": "2022-10-06T17:33:08.487Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I think building skills to become better at research and building skills to become better at things like dealing with stress or interacting with others are both important to having a greater positive impact on the world, so my point wasn't exactly about deontology vs consequentialism.&nbsp;</p><p>And I'd guess EA probably has more concrete consensus on the former than the latter. &nbsp;</p>", "parentCommentId": "rcbjpMc8SmpGmZKae", "user": {"username": "Peter Gebauer"}}, {"_id": "mKNbCPP54jK5qxFe4", "postedAt": "2022-10-07T02:45:15.836Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I enjoyed reading this - I spent 10 years active in Quakerism, including a college course on Quaker history and a year working at a Quaker retreat center. I also happened to write a <a href=\"https://juliawise.net/moral-aesthetics/\">post</a> about EA and Quakerism recently.<br>I like the idea of drawing inspiration from historical Quakers. But I feel confused about what it would look like for EA to emulate peak Quakerism.<br><br>Some counter-points:<br>- Early (and peak) Quakers went down some weird ineffective paths. It's cool that they were into nonviolence and class equality, but they were also really into renaming the days of the week and months of the year to avoid pagan names. Even at their peak, they were maybe most notable for dressing funny. Even one of the cofounders described the fastidiousness about clothing as \"a silly poor gospel.\"<br>- Quakerism doesn't have heresy per se as a concept, but you could definitely get kicked out for doing it wrong. Perhaps most commonly in the past for marrying a non-Quaker, but <a href=\"https://katebahlkehornstein.com/2021/12/07/the-5-best-ways-to-get-kicked-out-of-quaker-meeting/\">also</a> for extramarital sex or disagreeing about the nature of God.<br><br>Modern Quakerism isn't very religious for a religion (at least in the UK and coastal US - there are evangelical branches elsewhere), but until the 20th century it really was. I don't really understand what led this particular sect to hit on a bunch of social policies that look really good to modern views, but a ton of 17th century sects didn't.&nbsp;<br><br>As for what made them successful, a couple of things come to mind<br>- inability to participate in the military or universities (because those required violence and swearing an oath of loyalty to the crown respectively) meant that their talented people went into business. Similar to other religious minorities that sometimes do well after being cornered into one part of the economy.<br>- Businesses did well partly because they were so fastidious about honesty, so they had a reputation for fairness. I do think this is worth learning from - for a while one theory about what EA's brand should be was \"astonishingly rigorous\", and I think there's something parallel here.</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "enHGCufx8GMRnFADu", "postedAt": "2022-10-13T15:16:42.313Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Thanks for writing this up, and as someone who is on the margins of Quaker culture in the Philadelphia area (a central hub of Quakerism in the US), I thought this was interesting to look at. I think that EA ideas and Quaker values do have some amount of modern overlap which would be potentially useful to look at further.&nbsp;<br><br>I have a comment on nonviolence:&nbsp;<br><br>You write: \"They were non-violent, considered, calm but <i>principled</i>. They had beliefs that were well constructed, well founded and considered - and beliefs they held <i>strongly to</i>, but never violently.\"&nbsp;<br><br>Something to add, for context about Quakers -- while they are deeply committed to nonviolence, historically this was not always calm, and the meaning of nonviolence held and still holds a good deal of plurality within it.&nbsp;<br><br>For example, Quakers were ahead of the moral curve on some things like abolition of slavery.&nbsp;<br>However, we should be careful not to believe that this was a monolithic view strongly held within the community from the outset. It took time and advocacy within Quakers to see it this way. Benjamin Lay, one of the first Quakers seriously outspoken against slavery in the states was extremely passionately outspoken, seriously shamed his fellow Quakers who held slaves and, as I have heard, was indeed kicked out of multiple meetings for his passionate exhortations.&nbsp;<br><br>Benjamin Lay was nonviolent but he was he was not calm. His tactics of the time involved such things as <a href=\"https://www.smithsonianmag.com/history/quaker-comet-greatest-abolitionist-never-heard-180964401/\">spraying fake-blood on fellow meeting goers who held slaves </a>and laying infront of the meeting house door so that people would need to step on him to exit.&nbsp;<br><br>He isn't representative of the median Quaker, of course, but I think in reasoning out the origins of Quaker abolitionism, it was likely that some tactics like Lay's were instrumental to getting the rest of the mass of the group to pay attention and start taking different kinds of actions. There are other Quakers in the tradition of taking \"radical\" action to spark change or push the group, such as <a href=\"https://www.quakersintheworld.org/quakers-in-action/15/Mary-Dyer\">Mary Dyer</a> who was hanged after advocating for religious freedom.&nbsp;<br><br>I think the answer the question of \"How did they best ensure they were on the right-side of the moral curve?\" involves at least some amount of \"there were people with radical views who expressed them extremely strongly and vividly in ways that caught attention and sparked conversation and action among the masses\"&nbsp;AND because this religion believes that God speaks through people, sometimes passionately, people with strong and consistent views were often taken seriously in their moral convictions.&nbsp;<br><br>That's a bit of a rough/crude take, and is no where near complete. My bottom line is to encourage people not conflate \"nonviolent\" with \"dispassionate\", \"calm\" or \"measured\" when it comes to historical Quakers.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lee McC"}}, {"_id": "zskipQft7xrumL8mo", "postedAt": "2022-10-17T09:00:28.383Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>The England and Wales Green Party in the 1980s &nbsp;took a lot of Quaker business method and applied it to their conferences. They called it 'Other Ways of Working'. Unfortunately, they have been lost int he mists of time, but they included silence for a minut's relfection at the beginning of sessions to give people the chance to consider their goals and relationship with the group, the chair calling for silent reflection (or table-talk) for a few minutes if discussion got heated, respect for minority opinion as enriching the group, and a whole load of other practices. As a Quaker Green Party member I of course like this thread.</p><p>Paul Ingram</p>", "parentCommentId": "y8taqZk3s6DvauHPw", "user": {"username": "Paul Ingram"}}, {"_id": "RgdC2QTHGusTnorL3", "postedAt": "2022-10-17T09:45:47.688Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I think that referring to the successes you mention as 'peak Quakerism' actually misses the point rather. At the time of its establishment Quakerism was a very outward looking sect seeking for radical renewal of the world in the aftermath of the English Civil War. At one point perhaps 25% of the population of England were convinced of the truth of the tenets of Quakerism. However, this period was short lived and the movement faltered in size and importance and became highly insular shortly afterwards.<br><br>This insularity is not at all unrelated to the successes you talk about. For instance, one of the key aspects of Quaker business successes was that the society (Quakers refer to ourselves as The Religious Society of Friends) provided a very strong social network with a high degree of interpersonal trust. Quakers would know that they could seek one another out wherever they were and arrange business transactions on favourable terms. If anyone was found to have been acting in bad faith they would be 'cast out' and shunned by other Quakers, which due to the highly insular nature of the society would generally mean losing contact with all their family and friends and quite likely a good deal of their property as well. There was also a tradition that if a Quaker business were to fail then other Quakers would pay its debts off, which again was generally very good for business. While some Quakers still did act highly dishonourably (e.g. The famous mid-victorian case of Overend, Gurney and Company) these advantages were of significant value, especially to bankers and merchants, and explain &nbsp;lot of Quakers commercial successes.</p><p>One can make a similar argument about Quaker opposition to the slave trade. One of the things that caused Quakers to produce some of the earliest corporate statements in opposition to slavery was that slave owning was a huge problem for individual Quakers and their communities. Quakers, especially in the US, were among the most prolific slave owners. However, other Quakers were also convinced that slavery was abhorrent and needed to be abolished. The insular nature of the Society meant that in many meetings in the US these two groups were in close connection with one another and it was very difficult for either group to escape from this connection. This meant that individual meetings had to work to resolve such disagreements if they were going to survive. There were many instances in which meetings resolved them by ejecting those who were opposed to slavery (again have a look at the history of Benjamin Lay, perhaps the most 'cast out' Quaker in history). However, within time the dispute was eventually settled largely in favour of the anti-slavers and this is often what lead to these early statements. When the society was finally lead to go further and say that not only was slavery not fit for Quakers but that it should be abolished in society as a whole (this certainly did not happen overnight) it's dense social networks also provided highly valuable as a means of organising the anti-slavery movement and local meetings became valuable resources.</p><p>I could go further, it is a fascinating history. I am a longstanding Quaker and I love the society and our history. However, I do think that a lot of people have a very limited view of how the society operates and why it has had some notable successes. For what it is worth my personal view is that Quakers have a lot to teach those who are willing to patiently come to understand these things but that there are also many many examples of people drawing the wrong conclusions. The Quakers are, and always were, a peculiar people and in many ways the society is a failure. At only 300,000 members worldwide and divided into many factions, most of which do not see eye to eye on a great many things, the society is a long way from peak anything. However, we still have our successes (for instance I was directly involved in successful efforts to use our special marital exemptions to force the UK government's hand on introducing equal marriage, since we believed that we could go ahead and do it anyway if they didn't change the law), and I am glad of that.</p>", "parentCommentId": null, "user": {"username": "Simon_Beard"}}, {"_id": "iHqhu8ciropEdvYwJ", "postedAt": "2022-10-28T11:12:05.170Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I think it's important to consider the counterfactual when considering the impact of religious groups.  For example, many religious terrorists may simply be using religion to try to claim moral authority when the reality often is that their behavior contradicts what the religion teaches.  Without religion, they might still be terrorists.  I also think that a lot of the positives are not reported / downplayed to fit a secular narrative, e.g. the anti-slavery movement relied on the church.</p>\n", "parentCommentId": "ygzSJrBdfPDcRrroL", "user": {"username": "Grayden"}}, {"_id": "NyESYjuWFEAsRXB8d", "postedAt": "2022-11-22T12:17:24.787Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Quakers did a lot of good things. But be careful not to deify them. For example their ideology also put them at the &nbsp; forefront of <a href=\"https://www.ariel.ac.il/wp/nrps/2022/11/09/the-quakers-dark-side-appeasement-ambivalence-and-antisemitism-1933-1939/\">appeasing the Nazis</a>. &nbsp;Perhaps some of that can be called necessary collaboration with the Nazis for the purpose of doing good work; and perhaps the world needs a minimal number of &nbsp;appeasers to do their thing even when war is called for. But we should remember that the Quaker movement does -- of course -- &nbsp; good and evil.</p>", "parentCommentId": null, "user": {"username": "JoshuaFox"}}, {"_id": "bmBoovyGgH5jbzm9j", "postedAt": "2023-08-28T02:14:13.980Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Thank you for this detailed post of an \"insider\". I'm fascinated by this suggestion that EA community can learn from Quakers and its achievements in effecting social change. And I agree that Quakers are poorly understood, and also relate to this idea that EAs are similar to Quakers in amnh ways.</p>\n", "parentCommentId": "RgdC2QTHGusTnorL3", "user": {"username": "Yael Lechtchiner"}}, {"_id": "WMDa4p7fgrFr8eAx9", "postedAt": "2023-08-28T02:27:21.630Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>Great post, Lawrence, thanks for taking the time to elaborate on detailed hisotry of Quakers. I totally see all four parallels that you mentioned, and I'd like to raise the minority idea, fourth one. As someone who is fascinated by belongong and claiming authority as a minority group member I can't agree more --  this history lesson is crucial to study and apply to EA community building.</p>\n", "parentCommentId": null, "user": {"username": "Yael Lechtchiner"}}, {"_id": "3ReiWv9yLDuAujmWC", "postedAt": "2023-12-10T06:55:32.262Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<p>I am visiting a Quaker church for the first time ever tomorrow. I've been out of religious community for 15 years or so and I'd like to explore one that is compatible with my current views.</p>\n<p>I'm trying to think about what \"EA but more religious\" might look like. Could you form a religious community holding weekly assemblies to celebrate our aspirations to fill the lightcone with happy person moments? I think that is a profoundly spiritual and emotional activity and I think we can do it.</p>\n<p>I'll post a longer post to this effect soon.</p>\n", "parentCommentId": null, "user": {"username": "ben.smith"}}, {"_id": "CJSAgDiprAT4NzHur", "postedAt": "2023-12-10T06:57:43.051Z", "postId": "3Jm6tK3cfMyaan5Dn", "htmlBody": "<blockquote>\n<p>Early (and peak) Quakers went down some weird ineffective paths. It's cool that they were into nonviolence and class equality, but they were also really into renaming the days of the week and months of the year to avoid pagan names.</p>\n</blockquote>\n<p>This sounds like hits-based cause selection. The median early Quaker cause area wasn't particularly effective, but their best cause area was probably worth all of the wasted time in all of the others.</p>\n", "parentCommentId": "mKNbCPP54jK5qxFe4", "user": {"username": "ben.smith"}}]