[{"_id": "foLWG49vZFsQq38z9", "postedAt": "2022-11-21T22:04:53.890Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thank you so much for doing this!</p>\n<p>Also the implicit extended timeline (no longer due Dec 23) is also very welcomed.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "bBhnzSeqFyfcikyEb", "postedAt": "2022-11-21T22:47:11.108Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>I'm not sure contests like this are a good idea, but pre-announced contests are better than spontaneous contests in cases like this, so yay.</p><p>It would be even better if you clarified that current posts are eligible, so that people don't save their posts until you announce the details.</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "ZQKiJXfksgG62Btak", "postedAt": "2022-11-21T23:51:19.581Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>yey</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "zkSPyN29FjXnWpwby", "postedAt": "2022-11-22T00:01:25.966Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Even more specifically, it would be helpful to confirm that work published on or after the date of the Future Fund's announcement on 23rd Sep 2022 is eligible (if that is actually the case).</p>", "parentCommentId": "bBhnzSeqFyfcikyEb", "user": {"username": "Jason"}}, {"_id": "5dY9Jsbu2ZYzEfEqu", "postedAt": "2022-11-22T12:28:05.549Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Glad to hear about this!</p><p>I have a recommendation for the structure of it. I'd recommend that anonymous reviewers review submissions and share their reviews with the authors (perhaps privately) before a rebuttal phase (also perhaps private). And then reviewers can revise their reviews, and then chairs can make judgments about which submissions to publish.</p>", "parentCommentId": null, "user": {"username": "Michael_Cohen"}}, {"_id": "CEGNnDhd8pjHw5KJ9", "postedAt": "2022-11-22T12:46:30.980Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>What are the reasons against contests like this being a good idea?</p>", "parentCommentId": "bBhnzSeqFyfcikyEb", "user": {"username": "Quadratic Reciprocity"}}, {"_id": "Rrc4Df3ribL7weW7F", "postedAt": "2022-11-22T20:03:13.479Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>I might write this up someday, but briefly:</p><ol><li>I'm skeptical that they increase quality-adjusted work going into the area much (particularly if you subtract the value of the work that people would have done if not for the contest).</li><li>I'm skeptical that they better-distribute work within the area well.</li><li>I'm skeptical that they redistribute money well.</li><li>I'm skeptical that they have much other benefits.</li></ol><p>(Edit: that said, some contests can certainly achieve #1, and some can certainly have substantial other benefits.)</p>", "parentCommentId": "CEGNnDhd8pjHw5KJ9", "user": {"username": "zsp"}}, {"_id": "hSbvh3wzN3FyhRaKT", "postedAt": "2022-11-22T21:53:33.053Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Fantastic news!!! My main question:</p>\n<p>The Future Fund AI Worldview Prize had specific, very bold criteria, such as raising or lowering to certain thresholds the probability estimates of transformative AI timelines or probabilities of an AI related catastrophe, given certain timelines;</p>\n<p>Will this AI Worldview Prize have very similar criteria, or do you have any intuitions what these criteria might be?</p>\n<p>This would be very helpful for researchers like myself deciding whether to continue on a particular line of research!</p>\n", "parentCommentId": null, "user": {"username": "Jordan Arel"}}, {"_id": "65QryfqutcLujcuiS", "postedAt": "2022-11-22T22:34:07.877Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thank you for carrying this forward!&nbsp;<br><br>One comment: as with the old contest, I strongly support the decision to use a number of judges that are outside of/independent from EA. I fear the EA bubble is becoming something of an echo chamber: this is a great opportunity to verify whether such fears are well-founded, and if so, provide a check on this detrimental effect.</p>", "parentCommentId": null, "user": {"username": "c.trout"}}, {"_id": "bK32Kaqvg6RRRwduC", "postedAt": "2022-11-23T04:00:38.279Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Here are a few ideas relevant to an AI contest that could be helpful:</p>\n<ul>\n<li>make the goal specific to developments in AI safety, rather than AI\n<ul>\n<li>if checking for a prediction's probability, choose a prediction that is specific to AI safety (for example, <em>\"When would  P(AGI is aligned with at least one human's values|AGI is developed) &gt; .50\"</em>).</li>\n<li>if asking for specific content, choose content helpful to AI safety (for example, <em>\"What cause area of AI safety research do you feel is currently neglected, tractable, and important to AI safety, and why?\"</em>).</li>\n</ul>\n</li>\n<li>browse the comments on the FTX contest announcement post for ideas and complaints about that prize's requirements (for example, I think someone suggested that contest submissions should have up to a year to be made, for a substantial reward, that makes a lot of sense, and would encourage more outside entries and original research from experts in the space).</li>\n<li>commit to concrete submission standards that you feel are minimum requirements for you to read each submission, whatever those might be (academic credentials, format, content requirements, research approach, etc), and publish those along with the formal announcement.  Then commit to reading each entry that meets the standards.</li>\n<li>make the $$ amount used for the prizes guaranteed to go to some contestant, rather than optional for you and only if you think some entry deserves it. The grand prize should go to an entrant, I think that's fair and honest in a competition.</li>\n</ul>\n<p>I think it's a good idea to continue the prize to the extent that it encourages AI safety research directly. My impression of the original prize was that it could encourage AGI development without necessarily encouraging AI Safety development, because its questions required more knowledge and consideration of AGI development than of AGI safety.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "qDYv5gjkKkFBcC88s", "postedAt": "2022-11-23T05:19:12.078Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>As one datapoint, the time spent on my entry to the original worldview prize was strictly additive. I have a grant to do AI safetystuff part time, and I still did all of that work; the work I <i>didn't</i> do that week was all non-AI business.</p><p>It's extremely unlikely that I would have written that post without the prize or some other financial incentive. So, to the extent that my post had value, the prize helped make it happen.</p><p>That said, when I saw another <a href=\"https://www.lesswrong.com/posts/JNtGxrusJRpx53Q8L/announcing-ai-alignment-awards-usd100k-research-contests\">recent prize</a>, I did notice the incentive for me to conceal information to increase the novelty of my submission. I went ahead and <a href=\"https://www.lesswrong.com/posts/DSEwkvj8W7y8C3jau/simulators-constraints-and-goal-agnosticism-porbynotes-vol-1\">posted </a>that information anyway because that's not the kind of incentive I want to pay attention to, but I can see how the competitive frame <i>could</i> have unwanted side effects.</p>", "parentCommentId": "Rrc4Df3ribL7weW7F", "user": {"username": "porby"}}, {"_id": "viiif6p4CoGqvANJP", "postedAt": "2022-11-23T18:11:00.765Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>^seconding this question 😊</p>", "parentCommentId": "zkSPyN29FjXnWpwby", "user": {"username": "bhalperin"}}, {"_id": "oSdpoe36sinRZatsE", "postedAt": "2022-11-25T10:01:23.254Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Awesome news, thanks! Looking forward to hearing more about the operationalization, and logistics.&nbsp;<br><br>Wondering if there could be a way to incorporate the fact that doom is conditional on year that TAI is developed (i.e how well developed AI Alignment/strategy/governance is when TAI is possible)? P(doom|TAI in year 20xx) and P(<a href=\"https://forum.effectivealtruism.org/posts/9BPs6ZmtqCbNfYaKg/agi-x-risk-timelines-10-chance-by-year-x-estimates-should-be\">10%</a> chance of TAI in year 20xx) are both important questions.</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "DAxMYYJPcjsfFcAgq", "postedAt": "2022-12-02T18:28:49.749Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Supporting the community with this new competition is quite valuable. &nbsp;Thanks!</p><p>&nbsp;</p><p>Here is an idea for how your impact might be amplified: &nbsp;For ever researcher that is somehow has full time funding to do AI safety research I suspect there are 10 qualified researchers with interest and novel ideas to contribute, but who will likely never be full time funded for AI safety work. &nbsp;Prizes like these can enable this much larger community to participate in a very capital efficient way.</p><p>But such \"part time\" contributions are likely to unfold over longer periods, and ideally would involve significant feedback from the full-time community in order to maximize the value of those contributions.</p><p>The previous prize required that all submissions be of never before published work. &nbsp;I understand the reasoning here. &nbsp;They wanted to foster NEW work. &nbsp;Still this rule drops a wet blanket on any part-timer who might want to gain feedback on ideas over time.</p><p>Here is an alternate rule that might have fewer unintended side effects: &nbsp;Only the portions of ones work that has never been awarded prize money in the past is eligible for consideration.</p><p>Such a rule would allow a part-timer to refine an important contribution with extensive feedback from the community over an extended period of time. &nbsp;Biasing towards fewer higher quality contributions in a field with so much uncertainty seems a worthy goal. &nbsp;Biasing towards greater numbers of contributors in such a small field also seems valuable from a diversity in thinking perspective too.</p>", "parentCommentId": null, "user": {"username": "Dan Oblinger"}}, {"_id": "s9RqkFFWCncoz4b7y", "postedAt": "2022-12-08T14:40:45.281Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Hi Zach, thanks for the question and apologies for the long delay in my response. I'm happy to confirm that work posted after September 23 2022 (and before whatever deadline we establish) will be eligible for the prize. No need to save your work until the formal announcement.</p>\n", "parentCommentId": "bBhnzSeqFyfcikyEb", "user": {"username": "Jason Schukraft"}}, {"_id": "tB5KatB9CCHKP6faw", "postedAt": "2022-12-08T14:42:17.279Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thanks Jason. I can now confirm that that is indeed the case!</p>\n", "parentCommentId": "zkSPyN29FjXnWpwby", "user": {"username": "Jason Schukraft"}}, {"_id": "pwzhEEiChBkdkmbjZ", "postedAt": "2022-12-10T19:48:30.921Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thank you, I was struggling to finish a forecasting essay for the Future Fund's prize. &nbsp;I intend to submit something regardless of whether there's prize money, but prize money surely would help orient effort anyway. &nbsp;Resources are finite.</p>", "parentCommentId": null, "user": null}, {"_id": "qpZyk2yNRvqN8EMih", "postedAt": "2022-12-20T14:11:43.805Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>The FTX contest description listed \"two formidable problems for humanity\":&nbsp;<br><br><strong>\"1. Loss of control to AI systems</strong><br>Advanced AI systems might acquire undesirable objectives and pursue power in unintended ways, causing humans to lose all or most of their influence over the future.</p><p><strong>2. Concentration of power</strong><br>Actors with an edge in advanced AI technology could acquire massive power and influence; if they misuse this technology, they could inflict lasting damage on humanity’s long-term future.\"</p><p>My sense is that the contest is largely framed around (1) at the neglect (2). Nick Beckstead's rationale behind his current views is based around a scenario involving power seeking AI, whereas arguably scenarios related to (2) don't require the existence of AGI in the first place. which is central to the main forecasting question. It seems AI developments short of AGI could be enough for all sorts of disruptive changes with catastrophic consequences, for instance in geopolitics.&nbsp;</p><p>Based on my limited understanding, I'm often surprised how little focus there is within the AI safety community on human misuse of (non-general) AI. In addition to not requiring controversial assumptions about AGI, these problems also seems more tractable since we can extrapolate from exisiting social science and have a clearer sense of what the problems could look like in practice. This might mean we can forecast more accurately, and my current sense is that it's not obvious AI-related catastrophic consequences are more likely to come from AGI than human misuse (of non-AGI).&nbsp;</p><p>Maybe it would be helpful to frame the contest more broadly around catastrophic consequences resulting from AI.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Steven Cuppen"}}, {"_id": "y4o6bWYnJh6fgkBJw", "postedAt": "2023-02-05T00:35:09.694Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thank you for organizing this! I have two questions. First, is there any update regarding when the official announcement will be made? Second, will essays submitted to other competitions, or for publication, be eligible? In other other words, is there any risk that submitting research elsewhere prior to the announcement of the competition will render it ineligible for the competition?</p>", "parentCommentId": null, "user": {"username": "paul_dfr"}}, {"_id": "bcxPqCe9MMksNr7F7", "postedAt": "2023-02-06T21:12:06.361Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thanks for your questions!</p>\n<p>We plan to officially launch the contest sometime in Q1 2023, so end of March at the latest.</p>\n<p>I asked our in-house counsel about the eligibility of essays submitted to other competitions/publications, and he said it depends on whether by submitting elsewhere you've forfeited your ability to grant Open Phil a license to use the essay. His full quote below:</p>\n<blockquote>\n<p>Essays submitted to other competitions or for publication are eligible for submission, so long as the entrant is able to grant Open Phil a license to use the essay. Since we plan to use these essays to inform our future research and grantmaking, we need a license to be able to use the IP.  Our contest rules will state that by submitting an entry, each entrant grants a license to Open Phil to use the entry to further our mission.  If you had previously submitted an essay to another contest or for publication, you should check the terms and conditions of that contest/publication to confirm they do not now have exclusive rights to the work or in any way prohibit you from granting a license to someone else to use it.</p>\n</blockquote>\n", "parentCommentId": "y4o6bWYnJh6fgkBJw", "user": {"username": "Jason Schukraft"}}, {"_id": "aYnA2tZxWArttQ2u7", "postedAt": "2023-02-08T05:13:33.966Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thanks for a great answer! That's very helpful.</p>", "parentCommentId": "bcxPqCe9MMksNr7F7", "user": {"username": "paul_dfr"}}, {"_id": "ADuxhsc3oCWdK2eTY", "postedAt": "2023-03-01T01:40:16.816Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Hello, checking in on any updates to the Open Phil contest. I look forward to submitting an entry soon!</p>", "parentCommentId": "aYnA2tZxWArttQ2u7", "user": {"username": "srhoades10"}}, {"_id": "4Bvct5MhRoaQzcWii", "postedAt": "2023-03-01T13:13:46.473Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>We are just ironing out the final legal details. The official announcement will hopefully go live by the end of next week. Thanks for checking!</p>\n", "parentCommentId": "ADuxhsc3oCWdK2eTY", "user": {"username": "Jason Schukraft"}}, {"_id": "fj4uLv8fLQQMScmMj", "postedAt": "2023-03-12T06:52:49.926Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Any update on when \"early 2023\" will be?</p>", "parentCommentId": null, "user": {"username": "TedSanders"}}, {"_id": "CAQkSxcEaajGoDJPb", "postedAt": "2023-03-12T09:43:13.804Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>It was announced two days ago: <a href=\"https://forum.effectivealtruism.org/posts/NZz3Das7jFdCBN9zH/announcing-the-open-philanthropy-ai-worldviews-contest\">https://forum.effectivealtruism.org/posts/NZz3Das7jFdCBN9zH/announcing-the-open-philanthropy-ai-worldviews-contest</a></p>\n", "parentCommentId": "fj4uLv8fLQQMScmMj", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "wrHvoAWKhkjuraeyS", "postedAt": "2023-03-13T12:59:50.777Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": "<p>Thanks both - I just added the announcement link to the top of this page.</p>\n", "parentCommentId": "CAQkSxcEaajGoDJPb", "user": {"username": "Jason Schukraft"}}, {"_id": "mu2wcdtptqJX7WKrk", "postedAt": "2022-11-22T15:38:12.676Z", "postId": "3kaojgsu6qy2n8TdC", "htmlBody": null, "parentCommentId": "foLWG49vZFsQq38z9", "user": null}]