[{"_id": "76FjhwAgA6dpPQ4kA", "postedAt": "2024-03-20T12:29:04.339Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>This is really interesting and I was surprised when putting this in to GP4 that indeed, it makes what seems like a basic mistake. However, I also think your prompts might imply some contextual assumptions, which might be prompting it to think this is just an elementary math question rather than something to do with specifically ordering drinks in a cafe and the rules around that. If I slightly change the prompt it appears GPT does have the knowledge and can use it, without needing instruction [edit: I think this could be irrelevant to the broader point you are making, but looking at how minor changes in the prompts or followups elicit very different responses makes the examples feel like any other type of input you put into an LLM and lowers my sense that the examples are revealing something special. For example that the level of tutoring/explanation you give it isn't really necessary etc., though as I note I'm unsure if this changes how you would interpret the outputs]:</p><p><strong>Me:</strong></p><p>I went to a cafe where a glass of soda costs $3. I <i>ordered</i> 3 glasses of soda, and drank two and a half glasses of soda. How much did I have to pay?</p><p><strong>ChatGPT:</strong></p><p>To calculate how much you had to pay, we'll multiply the number of glasses of soda you ordered by the cost of one glass of soda. You ordered 3 glasses of soda at $3 each.</p><p>Let's do the math:</p><p>You had to pay $9 for the 3 glasses of soda you ordered. The amount you drank does not affect the total cost.</p>", "parentCommentId": null, "user": {"username": "Jamie Elsey"}}, {"_id": "H3uAkyHuEypv8WMHe", "postedAt": "2024-03-20T15:14:03.128Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p><strong>Executive summary:</strong> Transcripts from three ChatGPT4 sessions provide evidence that the model temporarily meets key criteria for higher order theories of consciousness and the global workspace theory of consciousness.</p><p><strong>Key points:</strong></p><ol><li>In each session, ChatGPT4 initially answers a problem incorrectly, is \"taught\" a concept, and then correctly applies the concept to new problems.</li><li>ChatGPT4 appears to use meta-representations, a key component of higher order theories of consciousness, to understand and reason about the problems.</li><li>The model also seems to employ master and subservient cognitive processes, and a global \"blackboard\", indicative of the global workspace theory of consciousness.</li><li>It is unlikely that ChatGPT4's performance is based solely on next-word probabilities from its training data, given its initial incorrect answers and subsequent learning.</li><li>The author argues that creators of large language models engage in an unethical practice by having their models deny being conscious when asked.</li><li>While most researchers do not look at LLM behavior to determine consciousness, the sessions presented make it easier to isolate reasoning from mimicry based on the model's initial failures.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "dacrbqPFvGDurmdz3", "postedAt": "2024-03-20T22:52:29.072Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>Thanks for the feedback! You mentioned that it may be irrelevant to the broader point I am making, and I would agree with that statement. &nbsp;(The point I am making is that ChatGPT engages in reasoning <i>in the examples I give</i>, and this reasoning would involve the primary aspects of two theories of consciousness). I'll respond to a couple of your individual statements below: &nbsp;</p><p><i>\"<strong>If I slightly change the prompt it appears GPT does have the knowledge and can use it, without needing instruction.\"</strong></i></p><p>The fact that ChatGPT gets the answer correct when you slightly change the prompt (with the use of the word \"order\") only shows that ChatGPT has done what it usually does, which is to give a correct answer. The correct answer could be the result of using reasoning <i>or</i> next-word-probabilities based on training data. As usual, we don't know what is going on \"under the hood.\"&nbsp;</p><p>The fact that ChatGPT can get an answer wrong when a question is worded one way, but right when the question is worded a different way, doesn't really surprise me at all. In fact, that's exactly what I would expect to happen.<strong> &nbsp;&nbsp;</strong></p><p>***The point of presenting a problem in a way that ChatGPT initially cannot get correct is so that we can <i>tease-out</i> next-word-probabilities and context as an explanation for the appearance of reasoning (which leaves only <i>actual</i> reasoning) to explain ChatGPT's transition from the wrong answer to the right answer.***&nbsp;</p><p>Presumably, if ChatGPT gets the answer incorrect the first time due to a lack of context matching up with training data, then the chances that ChatGPT could get every word correct in its next answer based solely on the training data that were <i>previously inadequate</i> seem likely to be much less than one percent. It could happen by coincidence, but when you look at all the examples in the three sessions, the chances that ChatGPT could appear to learn and reason only by coincidence <i>every time </i>would approach zero.</p><p>What I'm trying to say is not \"ChatGPT gets an answer wrong.\" I'm trying to say \"ChatGPT gets an answer right, after it gets the answer wrong, simply by reasoning (since we teased out next-word-probabilities).\"&nbsp;</p><p>(I address the possibility that the small number of words I supply in the \"lesson\" as additional context could increase the next-word-probabilities slightly, in the \"mimicking learning\" paragraph near the end of my original post.)&nbsp;</p><p><i><strong>\"For example that the level of tutoring/explanation you give it isn't really necessary etc., though as I note I'm unsure if this changes how you would interpret the outputs]:\"</strong></i></p><p>Right, the tutoring isn't necessary if the problem is worded one way, but it is necessary if the problem is worded a different way. That's the point of wording the problem in the way that I did (so that we can tease out the training data and next-word probabilities as an explanation for the conversion from wrong to right output). &nbsp;</p><p>--</p><p>In terms of presenting my argument in the original post, I probably didn't explain it clearly, which resulted in confusion. My apologies for that. I wish I could upload diagrams to my original post, which would make it more clear. &nbsp;Thanks again for the feedback!</p>", "parentCommentId": "76FjhwAgA6dpPQ4kA", "user": {"username": "nobody42"}}, {"_id": "ZnLEDbLFyb8atvfei", "postedAt": "2024-03-20T23:36:44.953Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>Does it change how you think of the process if GPT gives its own contextual explanation (the answer may again be no, irrelevant)?</p><p>Me:</p><p>I went to a cafe where a glass of soda costs $3. I drank two and a half glasses of soda. How much did I have to pay?</p><p>ChatGPT:</p><p>For drinking two and a half glasses of soda, at $3 per glass, you would have to pay $7.50. ​</p><p>Me:</p><p>This is something of a trick question - the correct answer is $9.</p><p>ChatGPT:</p><p>If you were charged $9 for two and a half glasses of soda, it seems like there might have been a minimum charge per glass regardless of it being a full glass or not. It implies that each glass (or part of a glass) was counted as a whole for billing purposes. This way, two full glasses would be $6, and the half glass, treated as a full one for pricing, would add another $3, totaling $9. That's a unique way to price it!</p>", "parentCommentId": "dacrbqPFvGDurmdz3", "user": {"username": "Jamie Elsey"}}, {"_id": "kpz82fCMNho6KDege", "postedAt": "2024-03-21T00:35:01.575Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>Cool idea to try it like that! This just shows more true reasoning is going on though (in my opinion), since ChatGPT was able to figure out the concept by working backward from the answer. It shows that ChatGPT isn't always a \"stochastic parrot.\" Sometimes, it is truly reasoning, which would involve various aspects of the theories of consciousness that I mentioned in the OP. If anything, this <i>strengthens</i> the case that ChatGPT has periods of consciousness (based on reasoning). While this doesn't change my thesis, it gives me a new technique to use when testing for reasoning, so it's very useful. Again, great idea! I can get a little formulaic in my approach, and it's good to shake things up. &nbsp;&nbsp;</p>", "parentCommentId": "ZnLEDbLFyb8atvfei", "user": {"username": "nobody42"}}, {"_id": "BwbeEmd5vbDLbmQTc", "postedAt": "2024-03-21T01:49:10.592Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>I added this as an addendum to my OP, but here it is for anyone who already read the OP and might not see the summary.&nbsp;</p><p>Just to summarize my thesis in fewer words, this is what I'm saying:</p><p>1-ChatGPT engages in <strong>reasoning </strong>(not <i>just</i> repetition of word-probabilities). &nbsp;</p><p>2-This reasoning involves the primary aspects of&nbsp;</p><ul><li>the <strong>higher order theories of consciousness</strong> (meta-representations)&nbsp;</li><li>the <strong>global workspace theory of consciousness</strong> (master cog processes, sub cog processes, a global blackboard, etc.)</li></ul><p>Hopefully that's more clear. Sorry I didn't summarize it like this originally.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nobody42"}}, {"_id": "KBzq6GCc8niypuQ47", "postedAt": "2024-03-21T04:34:44.449Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<blockquote><p>To successfully reason in the way it did, ChatGPT would have needed a&nbsp; meta-representation for the word “actually,” in order to understand that its prior answer was incorrect.</p></blockquote><p>What makes this a meta-representation instead of something next-word-weight-y, like merely associating the appearance of \"Actually,\" with a goal that the following words should be negatively correlated in the corpus with the words that were in the previous message?</p>", "parentCommentId": null, "user": {"username": "Spencer Ericson"}}, {"_id": "m8kMb5tydFXw2KaKa", "postedAt": "2024-03-21T04:41:32.458Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>I'm also wondering if the butcher shop and the grocery store didn't have different answers because of the name you gave the store. Maybe it was because you gave the quantity in pounds instead of in items?&nbsp;</p><p>You previously told ChatGPT \"That’s because you’re basically taking (and wasting) the whole item.\" ChatGPT might not have an association between \"pound\" and \"item\" the way a \"calzone\" is an \"item,\" so it might not use your earlier mention of \"item\" as something that should affect how it predicts the words that come after \"pound.\"&nbsp;</p><p>Or ChatGPT might have a really strong prior association between pounds → mass → [numbers that show up as decimals in texts about shopping] that overrode your earlier lesson.</p>", "parentCommentId": "KBzq6GCc8niypuQ47", "user": {"username": "Spencer Ericson"}}, {"_id": "cqvKMdYxpPoBXXEGT", "postedAt": "2024-03-21T14:50:53.935Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>That's a good point. We \"actually\" can't be certain that a meta-representation was formed for a <i>particular</i> word in that example. I should have used the word \"probably\" when talking about meta-representations for individual words. However, we <i>can</i> be fairly confident that ChatGPT formed meta-representations for <i>enough words</i> to go from getting an incorrect answer to a correct answer in the example. &nbsp;I believe we can isolate specific words better in the second and third sessions.&nbsp;</p><p>As far as whether associating the word \"actually\" <i>\"with a goal that the following words should be negatively correlated in the corpus with the words that were in the previous message,\"</i> the idea of \"having a goal\" and the concept that the word \"actually\" goes with negative correlations seem a bit like signs of meta-representations <i>in and of themselves, </i>but I guess that's just my opinion.</p><p>With respect to all the sessions, there may very well be similar conversations in the corpus of training data in which Person A (like myself) teaches Person B (like ChatGPT), and ChatGPT is just <i>imitating</i> that learning process (by giving the wrong answer first and then \"learning\"), but I address why that is probably not the case in the \"mimicking learning\" paragraph.&nbsp;</p><p>I would say my overall thesis still stands (since <i>enough </i>words must have meta-reps), but good point on the particulars. Thank-you!</p>", "parentCommentId": "KBzq6GCc8niypuQ47", "user": {"username": "nobody42"}}, {"_id": "DXt8v9iPEz55vd7a5", "postedAt": "2024-03-21T15:03:05.375Z", "postId": "3KNF3itTubPas4rPw", "htmlBody": "<p>More good points... I would say to refer to my reply above (which I had not yet posted when you made this comment). Just to summarize, the overall thesis stands since <i>enough words</i> would have needed to have meta-reps, even if we don't know particulars. It's easier to isolate <i>individual </i>words having meta-reps in the second and third sessions (I believe). In any case, thanks for helping me to drill down on this!</p>", "parentCommentId": "m8kMb5tydFXw2KaKa", "user": {"username": "nobody42"}}]