[{"_id": "eac7ydy96qtnsyq33", "postedAt": "2023-10-13T18:23:56.846Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>I just read the summary but I want to disagree with:</p><blockquote><p>Contractualism says: When your actions could benefit both an individual and a group, don't compare the individual's claim to aid to the <i>group's</i>&nbsp;claim to aid, which assumes that you can aggregate claims across individuals. Instead, compare an individual's claim to aid to the claim of every other relevant individual in the situation by pairwise comparison. If one individual's claim to aid is a lot stronger than any other's, then you should help them.</p></blockquote><p>\"Contractualism\" is a broad family of theories, many of which don't entail this. (Indeed, some are equivalent to classical utilitarianism.) (And in particular, Scanlonian contractualism or (C1) don't entail this.)</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "oxqw76uEvFcjKaibH", "postedAt": "2023-10-13T18:44:06.487Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Fair point about it being a broad family of theories, Zach. What's the claim that you take Scanlonian contractualism not to entail? The bit about not comparing the individual's claim to aid to the group's? Or the bit about who you should help?</p>", "parentCommentId": "eac7ydy96qtnsyq33", "user": {"username": "bob-fischer"}}, {"_id": "9rb6ZWKNdcduEf5gF", "postedAt": "2023-10-13T18:58:05.666Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Both. As you note, Scanlonian contractualism is about reasonable-rejection.</p><p>(Personally, I think it's kinda appealing to consider contractualism for deriving principles, e.g. via rational-rejection or more concretely via veil-of-ignorance. I'm much less compelled by thinking in terms of claims-to-aid. I kinda assert that deriving-principles is much more central to contractualism; I notice that <a href=\"https://plato.stanford.edu/entries/contractualism/\">https://plato.stanford.edu/entries/contractualism/</a> doesn't use \"claim,\" \"aid,\" or \"assistance\" in the relevant sense, but does use \"principle.\")</p><p>(Probably not going to engage more on this.)</p>", "parentCommentId": "oxqw76uEvFcjKaibH", "user": {"username": "zsp"}}, {"_id": "7nASCr3bZrmSAuf8w", "postedAt": "2023-10-13T19:01:44.340Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Ah, I see. Yeah, we discuss this explicitly in Section 2. The language in the executive summary is a simplification.</p>", "parentCommentId": "9rb6ZWKNdcduEf5gF", "user": {"username": "bob-fischer"}}, {"_id": "TGxoaxKA926jnEXvm", "postedAt": "2023-10-13T19:25:44.132Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>(EDIT: It looks like the section <a href=\"https://forum.effectivealtruism.org/posts/3KsvReHD6CckfwHak/if-contractualism-then-amf#3_2__S_risk_Interventions_\">3.2. S-risk Interventions?</a> is somewhat relevant, but I think the probabilities here for people living very long voluntarily aren't as small as those for people alive today being subject to extended torture, except for those already being tortured.)</p><p>I wonder if the possibility of people living extremely long lives, e.g. thousands of years via anti-aging tech or mind uploading, would change the conclusions here, by dramatically increasing the ex ante person-affecting stakes, assuming each person's welfare aggregates over time. Now, it's possible that AMF beneficiaries will end up benefitting from this tech and saving them increases their chances of this happening, so in fact the number of person-affecting years of life saved in expectation by AMF could be much larger. However, it's not obvious this beats x-risk work, especially aligning AI, which could help with R&amp;D. Also, instead of either, there's direct work on longevity or mind uploading, or even accelerating AI (which would increase x-risk) to use AI for R&amp;D to save more people alive now from death by aging.</p><p>See also:</p><ol><li>Gustafsson, J. E., &amp; Kosonen, P. (20??). <a href=\"https://philpapers.org/rec/GUSPLR\"><i>Prudential Longtermism</i></a>.</li><li>Carl Shulman. (2019). <a href=\"https://reflectivedisequilibrium.blogspot.com/2019/11/person-affecting-views-may-be-dominated.html\"><i>Person-affecting views may be dominated by possibilities of large future populations of necessary people</i></a>.</li><li>Matthew Barnett. (2023). <a href=\"https://forum.effectivealtruism.org/posts/k6K3iktCLCTHRMJsY/the-possibility-of-an-indefinite-ai-pause\"><i>The possibility of an indefinite AI pause</i></a>, section <a href=\"https://forum.effectivealtruism.org/posts/k6K3iktCLCTHRMJsY/the-possibility-of-an-indefinite-ai-pause#The_opportunity_cost_of_delayed_technological_progress\"><i>The opportunity cost of delayed technological progress</i></a><i>.</i></li><li>Chad I. Jones. (2023). <a href=\"https://web.stanford.edu/~chadj/existentialrisk.pdf\"><i>The A.I. Dilemma: Growth versus Existential Risk</i></a>. (<a href=\"https://www.youtube.com/watch?v=6xBqv0BMi3k\">talk</a>, <a href=\"https://bcf.princeton.edu/wp-content/uploads/2023/05/Combined-1.pdf\">slides</a>).</li></ol><p>I think most people discount their future welfare substantially, though (perhaps other than for meeting some important life goals, like getting married and raising children), so living so much longer may not be that valuable according to their current preferences. To dramatically increase the ex ante stakes, one of the following should hold:</p><ol><li>We need to not use their own preferences and say their stakes are higher than they would recognize them to be, which may seem paternalistic and will fail to respect their current preferences in other ways.</li><li>The vast majority of the benefit comes from the (possibly small and/or atypical) subset of people who don't discount their future welfare much, which gets into objections on the basis of utility monsters, inequity and elitism (maybe only the relatively wealthy/educated have very low discount rates). Or, maybe these interpersonal utility comparisons aren't valid in the first place. It's not clear what would ground them.</li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "8dpCnDXHg2sneRnH4", "postedAt": "2023-10-13T20:15:59.966Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>In case we're prioritizing fates worse than death (section 3.2), some other potentially promising interventions off the top of my head could be:</p><ol><li>Work against slavery and human trafficking</li><li>Work reducing violence that leads to long-term trauma/PTSD, including sexual violence</li><li>Rescuing factory farmed animals<ol><li>Most interventions to improve conditions on factory farms will be too late to help animals alive today, because they usually only live &lt;2 years. If they're rescued, they can live a decade or two. It's still not clear the difference between a very short horrible life and 10 years of decent life as a nonhuman animal beats 50 extra life years for a human (or saving a parent's child) through AMF, though. EDIT: Inspired by Jakob's comment below, the ex ante risk of death by malaria is low, and we'd need to discount by that. On the other side, if we have a rule for picking animals to save, e.g. the ones in the worst health (but still savable) on a farm, then we can keep the ex ante chance of being saved relatively high for some animals. There might be surer ways to save a specific human life, though.</li></ol></li><li>Increasing access to medically assisted suicide</li><li>Humane slaughter for animals (but would need quick implementation to help animals alive today)</li><li>Increasing access to or better treatments for severe pain and mental health issues, e.g. cluster headaches, PTSD, severe depression</li><li>Closing Guantanamo Bay or getting people released from it (people there now are already being tortured or otherwise subject to horrible conditions)</li><li>Work to take in more refugees.</li></ol><p>On the standard contractualist views, nonhuman animals don't count in themselves, so the nonhuman animal interventions plausibly wouldn't be very valuable. But then how old do humans have to be to count, too, or have large stakes? Children under 5 don't typically have full understandings of death. Still, maybe we can explain it to them well enough for them to understand, though, and we should consider such hypotheticals in deciding their stakes. And losing a child is (typically) a large burden for a parent.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "LFhHuqCmkLH9mTEHm", "postedAt": "2023-10-13T20:21:34.976Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Also, following up on 2, depending on how we make interpersonal utility comparisons, rather than focusing on those with low personal time discount rates, those with the largest preference-based stakes could be utilitarians, especially those with the widest moral circles, or people with fanatical views or absolutist deontological views.</p>", "parentCommentId": "TGxoaxKA926jnEXvm", "user": {"username": "MichaelStJules"}}, {"_id": "fouudjsEHBoKSbE9s", "postedAt": "2023-10-13T22:11:52.590Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Hey Bob, I'm currently working on a paper about a similar issue, so this has been quite interesting to read! (I'm discussing more generally the implications of limited aggregation, but as you note contractualism has primarily distinct implications because of its (partially) non-aggregative nature.) While I mostly agree with your claims about the implications of the ex ante view, I disagree with your claim that this is the most plausible version of contractualism. In fact, I think that the ex ante view is clearly wrong and we should not be much concerned with what it implies.</p><p>First, briefly to the application part. I think you are right that, given the ex ante view, we should not focus on mitigating x-risks, and that we should rather perform global health interventions. However, as you note, there is usually a very large group of potential beneficiaries when it comes to global health interventions, so that the probability for each individual to be benefited is quite small, resulting in heavily diminished ex ante claims. I wonder, therefore, if we shouldn't, on the ex ante view, rather spend our resources on (relatively needy) people we know or people in small communities. Even if these people would benefit from our resources 100+ times less than the global poor, this could well be overcompensated by the much higher probabilities for each of these individuals to actually be benefited.&nbsp;</p><p>But again, I think the ex ante view is clearly false anyway. The easiest way to see this is that the view implies that we should prioritize one identified person over any number of \"statistical\" people. That is: on the ex ante view, we should save a given person for sure rather than (definitely!) save one <i>million </i>people if these are randondomly chosen from a sufficiently large population. In fact, there are even worse implications (the identified person could merely lose a finger and not her life if we don't help), but I think this implication is already bad enough to confidently reject the view. I don't know of anybody who is willing to accept that implication. The typical (if not universal?) reaction of advocates of the ex ante view is to go <i>pluralist </i>and claim that the verdicts of the ex ante view only correspond to one of several pro tanto reasons. As far as I know, no such view has actually been developed and I think any such view would be highly implausible as well; but even if it succeeded, its implications would be much more moderate: all we'd learn is that there is one of several pro tanto reasons that favour acting in (presumably) some short-term way. This could be well compatible with classic long-term interventions being overall most choiceworthy / obligatory.</p><p>I'm sure that I'm not telling you much, if anything, new here, so I wonder what you think of these arguments?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jakob Lohmar"}}, {"_id": "e2eCfTEQwpQQdB5Ro", "postedAt": "2023-10-13T23:44:10.680Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>I'm far from an expert on contractualism, but iirc it's standardly presented as a theory of just <i>one part</i> of morality, which Scanlon characterizes as \"what we owe to each other\". Do many regard it as a serious contender for what we <i>all things considered</i> ought to do? (The exclusion of animal interests, for example, would seem to make this implausible. But the implicit disregard for overall value also strikes me as entirely disqualifying. &nbsp;If I became convinced that contractualism were the true account of \"morality\", I would probably also become an amoralist of a sort, because other things just strike me as vastly more objectively important than \"what we owe to each other\".)<br><br>Edit: just saw footnote 4 (initially hidden) relates to this point. You say, \"If we owe it to others to favor GHW-like interventions over x-risk interventions, then that’s enough for practical purposes.\" I guess I'm questioning that. Surely what's practically relevant is what we <i>all things considered</i> ought to do.</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "qjvYjEATKDwkfxnN5", "postedAt": "2023-10-14T00:52:40.955Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>(None of this may be news to you, either, but potentially of interest to other readers.)</p>\n<p>Furthermore, ex ante views will tend to be dynamically inconsistent. For example, you have a lottery where you pick one person to be sacrificed for the benefit of the many, and this looks permissible to everyone ex ante, but once we find out who will be sacrificed, it's no longer permissible. And it wouldn't be permissible no matter who we found out would be sacrificed. This violates the Sure-Thing Principle. That being said, I’m not sure I'd call violating the STP enough to rule out a view or principle, but it should count against the view.</p>\n<p>To satisfy the STP, you're also pretty close to maximizing expected utility due to Savage's Theorem and generalizations. But maximizing expected utility with a specifically unbounded utility functions, like total welfare, also violates a more general version of the Sure-Thing Principle, because of St Petersburg prospects (infinite expected utility, but finite actual utility in each outcome), e.g. Russell and Isaacs, 2021 <a href=\"https://philarchive.org/rec/RUSINP-2\">https://philarchive.org/rec/RUSINP-2</a> . It also gets worse, because Anteriority (weaker than ex ante Pareto, but generalized to individuals whose existence is uncertain) + Impartiality + Stochastic Dominance are jointly inconsistent due to St Petersburg-like prospects over population sizes, with a few additional modest assumptions (Goodsell, 2021, <a href=\"https://philpapers.org/rec/GOOASP-2\">https://philpapers.org/rec/GOOASP-2</a> ).</p>\n<p>We could idealize and decide as if we had full information, looking for agreement, or just take an ex post view. See Fleurbaey and Voorhoeve, 2013 <a href=\"https://philarchive.org/rec/VOODAY\">https://philarchive.org/rec/VOODAY</a></p>\n", "parentCommentId": "fouudjsEHBoKSbE9s", "user": {"username": "MichaelStJules"}}, {"_id": "9MNEsZ9aSinRaNmfg", "postedAt": "2023-10-14T05:32:57.237Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>[On mobile; sorry for the formatting]</p>\n<p>Given my quick read and especially the bit below, it seems like the title is at least a bit misleading.</p>\n<p>Quote: “To be clear: this document is not a detailed vindication of any particular class of philanthropic interventions. For example, although we think that contractualism supports a sunnier view of helping the global poor than funding x-risk projects, contractualism does not, for all our argument implies, entail that many EA-funded global poverty interventions are morally preferable to all other options (some of which are probably high-risk, high-reward longshots).”</p>\n<p>I think a reasonable person would conclude from the title “If Contractualism, Then AMF” essentially the opposite of this more nuanced clarification.</p>\n<p>Perhaps it’s reasonable to infer that “Then AMF” really means “then the cluster of beliefs that leads GiveWell to strongly recommend AMF are indeed true (even if ex post it turns out that deworming or something was better)” but even this doesn’t seem to be what you are arguing (given the quote above).</p>\n", "parentCommentId": null, "user": {"username": "aaronb50"}}, {"_id": "auAebkzQXpQNgJmzd", "postedAt": "2023-10-14T07:57:50.941Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Can you explain how, in practice, one would choose between similar interventions within global health under this lens?</p>\n", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "z8n2fznhGRxTPZCaP", "postedAt": "2023-10-14T10:13:24.388Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Fair enough re: the view that contractualism is just one part of morality. I suppose that the contractualist has two obvious maneuvers here. One of them is to reject this assumption and take what we owe one another to be all of morality. Another is to say that what we owe one another is sensitive to the rest of morality and, for that reason, it's appropriate to have what we owe one another trump other moral considerations in our practical deliberations. Either way, if we owe it to the global poor to prioritize their interests, it's what we &nbsp;ought to do all things considered.</p><p>FWIW, given my own uncertainties about normative theory, I care more about the titular conditional (If contractualism, then AMF) than anything else here.</p>", "parentCommentId": "e2eCfTEQwpQQdB5Ro", "user": {"username": "bob-fischer"}}, {"_id": "fkKqKjDiofwM9XWKX", "postedAt": "2023-10-14T10:18:41.509Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for this, Aaron. Fair point. A more accurate title would be something like: \"If Scanlonian contractualism is true, then between Emma Curran's work on the ex post version of the view and this post's focus on the ex ante version, it's probably true that when we have duties to aid distant strangers, we ought to discharge them by investing in high impact, high confidence interventions like AMF.\"&nbsp;</p>", "parentCommentId": "9MNEsZ9aSinRaNmfg", "user": {"username": "bob-fischer"}}, {"_id": "sFX4GXJM3BhTAFCud", "postedAt": "2023-10-14T10:39:06.924Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for the question, John. I'm not sure how much weight to put on \"similar\" in your question. In general, you'd be looking to minimize the greatest strength-weighted complaint that someone might have. Imagine a simple case where all the individuals in two equally-sized populations you might help are at risk of dying, which means that the core content of the complaint would be the same. Then, we just have the strength-weighting to worry about. The two key parts of that (at least for present purposes) would be the probability of harm, your probability of impact, and the magnitude of the impact you can have. So, we multiply through to figure out who has the strongest claim. In a case like this, intervention prioritization looks very similar to what we already do in EA. However, in cases where the core contents of the complaints are different (death vs. quality of life improvements, say), the probabilities might not end up mattering. Or in cases where your action would have high EV but only because you're aggregating over a very large population where each individual has a very low chance of harm, it could easily work out that, according to EAC, you should get less EV by benefitting individuals who are exposed to much greater risk of harm. So the core process can sometimes be similar, but with these anti-aggregative (or partially-aggregative) side constraints.</p>", "parentCommentId": "auAebkzQXpQNgJmzd", "user": {"username": "bob-fischer"}}, {"_id": "4X32FayC8ZxbEBmbs", "postedAt": "2023-10-14T10:44:25.753Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for this, Michael. You're right that if people could be kept alive a lot longer (and, perhaps, made to suffer more intensely than they once could as well), this could change the stakes. It will then come down to the probability you assign to a malicious AI's inflicting this situation on people. If you thought it was likely enough (and I'm unsure what that threshold is), it could just straightforwardly follow that s-risk work beats all else. And perhaps there are folks in the community who think the likelihood is sufficiently high. If so, then what we've drafted here certainly shouldn't sway them away from focusing on s-risk.</p>", "parentCommentId": "LFhHuqCmkLH9mTEHm", "user": {"username": "bob-fischer"}}, {"_id": "w4NFWqtmdn7iPhfhn", "postedAt": "2023-10-14T10:48:25.126Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>This is helpful, Michael. I was holding the standard EA interventions fixed, but I agree that, given contractualism, there's a case to be made for other priorities. Minimally, we'd need to evaluate our opportunities in these and similar areas. It would be a bit surprising if EA had landed on the ideal portfolio for an aim it hasn't had in mind: namely, minimizing relevant strength-weighted complaints.&nbsp;</p>", "parentCommentId": "8dpCnDXHg2sneRnH4", "user": {"username": "bob-fischer"}}, {"_id": "wb8MvsHxkLj5SAJno", "postedAt": "2023-10-14T12:26:57.398Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks so much for this, Jakob. Really great questions. On the application part, let me first quote something I wrote to MSJ below:</p><blockquote><p>I was holding the standard EA interventions fixed, but I agree that, given contractualism, there's a case to be made for other priorities. Minimally, we'd need to evaluate our opportunities in these and similar areas. It would be a bit surprising if EA had landed on the ideal portfolio for an aim it hasn't had in mind: namely, minimizing relevant strength-weighted complaints.&nbsp;</p></blockquote><p>That being said, a lot depends here on the factors that influence claim strength. Averting even a relatively low probability of death can trump lots of other possible benefits. And cost matters for claim strength too: all else equal, people have weaker claims to large amounts of our resources than they do to small amounts. So, yes, it could definitely work out that, given contractualism, EA has the wrong priorities even within the global health space, but isofar as some popular interventions are focused on inexpensive ways of saving lives, we've got at least a few considerations that strongly support those interventions. That being said, we can't really know unless we run the numbers.<br><br>Re: the statistical lives problem for the ex ante view, I have a few things to say---which, to be clear, don't amount to a direct reply of the form, \"Here's why the view doesn't face the problem.\" First, every view has horrible problems. When it comes to moral theory, we're in a \"pick your poison\" situation. There are certainly <i>some </i>views I'm willing to write off as \"clearly false,\" but I wouldn't say that of most versions of contractualism. In general, my approach to applied ethics is to say, \"Moral theory is brutally hard and often the best we can do is try to assess whether we end up in roughly the same spot practically regardless of where we start theoretically.\" Second, and in the same spirit, my main goal here is to complement Emma Curran's work: she's already defended the same conclusion for the ex post version of the view. So, it's progress enough to show that, whichever way you go, you get something other than prioritizing x-risk. Third, the ex ante view doesn't imply that we should prioritize one identified person over <i>any</i> number of \"statistical\" people unless all else is equal---and all else often isn't equal. I grant that there are going to be lots of cases where identified lives trump statistical lives, but for the kinds of reasons I mentioned when thinking about your great application question, we still need to sort out the details re: claim strength.<br><br>Really appreciate the very helpful engagement!</p>", "parentCommentId": "fouudjsEHBoKSbE9s", "user": {"username": "bob-fischer"}}, {"_id": "xx79Pmv7bYvk5GQ6J", "postedAt": "2023-10-14T13:12:11.044Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for your helpful reply! I'm very sympathetic to your view on moral theory and applied ethics: most (if not all) moral theories face severe problems and that is not generally sufficient reason to not consider them when doing applied ethics. However, I think the ex ante view is one of those views that don't deserve more than negligible weight - which is where we seem to have different judgments. Even when taking into consideration that alternative views have their own problems, the statistical lives problem seems to be as close to a \"knock-down argument\" as it gets. You are right that there are possible circumstances in which the ex ante view would not prioritize identified people over any number of \"statistical\" people, and these circumstances might be even common. But the fact remains that there are also possible circumstances in which the ex ante view <i>does </i>prioritize one identified person over <i>any </i>number of \"statistical\" people - and at least to me this is just \"clearly wrong\". I would be less confident if I knew of advocates of the ex ante view who remain steadfast in light of this problem; but no one seems to be willing to bite this bullet.</p><p>After pushing so much that we should reject the ex ante view, I feel like I should stress that I really appreciate this type of research. I think we should consider the implications of a wide range of possible moral theories, and excluding certain moral theories from this is a risky move. In fact, I think that an ideal analysis under moral uncertainty should include ex ante contractualism, only I'm afraid that people tend to give too much weight to its implications and that this is worse than (for now) not considering it at all.</p>", "parentCommentId": "wb8MvsHxkLj5SAJno", "user": {"username": "Jakob Lohmar"}}, {"_id": "ET2BGA2rsJDFrDpLS", "postedAt": "2023-10-14T13:31:45.643Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>I should also at least mention that I think that the more plausible versions of limiting aggregation under risk are well compatible with classic long-term interventions such as x-risk mitigation. (I agree that the \"ex post\" view that Emma Curran discusses is not well compatible with x-risk mitigation either, but I think that this view is not <i>much </i>better than the ex ante view and that there are other views that are more plausible than both.) Tomi Francis from GPI has an unpublished paper that reaches similar results. I guess this is not the right place to go into any detail about this, but I think it is even initially plausible that small probabilities of much better future lives ground claims that are more significant than claims that are usually considered irrelevant, such as claims based on the enjoyment of watching part of a football match or on the suffering of mild headaches.</p>", "parentCommentId": "wb8MvsHxkLj5SAJno", "user": {"username": "Jakob Lohmar"}}, {"_id": "qSqaneBkotL4GWMg6", "postedAt": "2023-10-14T13:39:39.959Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Yes, that's another problem indeed - thanks for the addition! Johann Frick (\"Contractualism and Social Risk\") offers a \"decomposition test\" as a solution on which (roughly) every action of a procedure needs to be justifiable at the time of its performance for the procedure to be justified. But this \"stage-wise ex ante contractualism\" has its own additional problems.</p>", "parentCommentId": "qjvYjEATKDwkfxnN5", "user": {"username": "Jakob Lohmar"}}, {"_id": "eNFdpdYu5jsPi4nLs", "postedAt": "2023-10-14T16:38:36.038Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Oh, sorry if I was unclear. I didn't have in mind torture scenarios here (although that's a possibility), just people living very long voluntarily and to their own benefit. So rather than AMF saving like 50 years of valuable life in expectation per life saved, it could save thousands or millions or more. And other work may increase some individual's life expectancy even more.</p>\n<p>I think it’s not too unlikely that we'll cure aging or solve mind uploading in our lifetimes, especially if we get superintelligence.</p>\n", "parentCommentId": "4X32FayC8ZxbEBmbs", "user": {"username": "MichaelStJules"}}, {"_id": "gJmGxmkNtp7rEE6qn", "postedAt": "2023-10-14T16:42:45.980Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<blockquote><p>Since any given future person only has an infinitesimally small chance of coming into existence, they have an infinitesimally weak claim to aid.</p></blockquote><p>&nbsp;</p><p>I think this is confused. Imagine we consider each person different over time, a la <a href=\"https://link.springer.com/article/10.1007/s11098-019-01298-w\">personites</a>, and consider the distribution of possible people I will be next year. There are an incredibly large number of possible changes which could occur which would change my mental state, and depending on what I eat, the physical composition of my body. Does each of these future me have only an infinitesimal claim, and therefore according to contractualism, have almost no importance compared to any claim that exists before that time - and therefore you can only care about the immediate future, and never prioritize what will affect me in a year over what will affect some other person in 10 minutes?</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "W45A53uFG2BMqwrzF", "postedAt": "2023-10-14T16:55:30.969Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>I wonder if the Greater Burden Principle over ex ante interests tells you not to do broad exploratory research into interventions and causes or even much or any research at all, because any such research is very unlikely to benefit any particular individual. Instead, you should just pick from one of the interventions you already know rather than spread the ex ante benefits more thinly by investigating more options. Any time you expand the set of interventions under consideration, those who'd benefit ex ante in the original set lose substantially ex ante in the expanded set because they're now less likely to be targeted at all, while those added only stand to gain a little ex ante, because whatever intervention is chosen is unlikely to help them.</p>\n<p>To make it even more concrete, consider helping A with 100% probability. Now, you consider the possibilities of helping B or C, and you're very unsure now about which of A, B or C you'll help after you investigate further, so now assign each a 1/3 chance of being helped. A loses a ~67% chance of being helped, which is larger than the ~33% chance each of B and C gain. So, you shouldn't even start to consider helping B and C instead of A.</p>\n<p>However, if you did it one at a time, i.e. first consider B, going from 100% A to 50% A and 50% B, this would be permissible. And then going from 50% A and 50% B to 33% to each of A, B and C is also permissible (and required, because C gains 33% compared to the loss of 17% to each of A and B).</p>\n<p>Is this a strawman? Or maybe contractualists make more space for deliberation by recognizing other reasons, like you suggest.</p>\n", "parentCommentId": "fouudjsEHBoKSbE9s", "user": {"username": "MichaelStJules"}}, {"_id": "unMFiMPFKdw5DekKo", "postedAt": "2023-10-14T18:46:23.781Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for sharing! I think Frick's approach looks pretty promising, although either with limited/partial aggregation or, as he does, recognizing that this isn't the full picture, and we can have other reasons to balance, to appropriately handle cases with many statistical lives at stake but low individual risks. What additional problems did you have in mind?</p>", "parentCommentId": "qSqaneBkotL4GWMg6", "user": {"username": "MichaelStJules"}}, {"_id": "FPR2vC5vzHemisfmH", "postedAt": "2023-10-14T22:47:11.021Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<blockquote><p>So, it may be true that some x-risk-oriented interventions can help us all avoid a premature death due to a global catastrophe; maybe they can help ensure that many future people come into existence. But how strong is any individual's claim to your help to avoid an x-risk or to come into existence? Even if future people matter as much as present people (i.e., even if we assume that totalism is true), the answer is: Not strong at all, as you should discount it by the expected size of the benefit <i>and you don’t aggregate benefits across persons</i>. Since any given future person only has an infinitesimally small chance of coming into existence, they have an infinitesimally weak claim to aid.</p></blockquote><p>&nbsp;</p><p>There's a Parfit thought experiment:</p><p><i>I go camping and leave a bunch of broken glass bottles in the woods. I realize that someone may step on this glass and hurt themselves, so perhaps I should bury it. I do not bury it. As it turns out, 20 years pass before someone is hurt. In 20 years, a young child steps on the glass and cuts their foot badly.</i></p><p>It seems like the contractualist principle above would say that there's no moral value to burying the glass shard, because for any given individual, the probability that they'll be the one to step on the glass shard is very low<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0ln13xepr59\"><sup><a href=\"#fn0ln13xepr59\">[1]</a></sup></span>. Is that right?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0ln13xepr59\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0ln13xepr59\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I think you can sidestep issues with population ethics here by just restricting this to people already alive today (so replace \"young child\" in the Parfit example with \"adult\" I guess). Though maybe the pop ethics issues are the crux?</p></div></li></ol>", "parentCommentId": null, "user": {"username": "reallyeli"}}, {"_id": "oMQtxspwYWqsrLEsc", "postedAt": "2023-10-14T23:02:12.494Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<blockquote><p>Moreover, it’s common to assume that efforts to reduce the risk of extinction might reduce it by one basis point—i.e., 1/10,000. So, multiplying through, we are talking about quite low probabilities. Of course, the probability that any particular poor child will die due to malaria may be very low as well, but the probability of making a difference is quite high. So, on a per-individual basis, which is what matters given contractualism, donating to AMF-like interventions looks good.</p></blockquote><p>&nbsp;</p><p>It seems like a society where everyone took contractualism to heart might have a hard time coordinating on <strong>any</strong> large moral issues where the difference any one individual makes is small, including non-x-risk ones like climate change or preventing great power war. What does the contractualist position recommend on these issues?</p><p>(In climate change, it's plausibly the case that \"every little bit helps,\" while in preventing war between great powers outcomes seem much more discontinuous — not sure if this matters.)</p>", "parentCommentId": null, "user": {"username": "reallyeli"}}, {"_id": "YFrEfWwXT2koNPiGX", "postedAt": "2023-10-14T23:34:44.342Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>It seems like even the AMF vs global catastrophic risk comparison on an ex ante greater burden principle will depend on how much we're funding them, how we individuate acts and the specifics of the risks involved. To summarize, if you invest enough in global catastrophic risk mitigation, you might be able to reduce the maximum risk of very early death for at least one individual by more than if you give the same amount all to AMF, because malaria mortality rates are &lt;1% per year where AMF works (<a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1364064522&amp;range=A55\">GiveWell's sheet</a>), but extinction risk within the next few decades could be higher than that (mostly due to AI) and reducible in absolute terms by more than 1 percentage point with enough funding. On the other hand, some people may be identified as immunocompromised and so stand to gain much more than a 1 percentage point reduction in mortality risk from GiveWell recommendations.</p><p>I illustrate in more detail with the rest of this comment, but feel free to skip if this is already clear enough.</p><p>&nbsp;</p><hr><p>Where AMF works, the annual mortality rate by malaria is typically under 0.3% (see <a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1364064522&amp;range=A55\">GiveWell's sheet</a>) and the nets last about two years (<a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1364064522&amp;range=A27\">again GiveWell</a>), so we get a maximum of around 0.6% average risk reduction per distribution of bednets (and malaria medicine, from Malaria Consortium, say). Now, maybe there are people who are particularly prone to death if they catch malaria and are identifiable as such, e.g. the identified immunocompromised. How high can the maximum ex ante risk be across individuals? I don't know, but this could matter. Let's say it's 1%. I think it could be much higher, but let's go with that to illustrate here first.</p><p>With up to $100,000 dollars donated to AMF and Malaria Consortium, suppose then we can practically eliminate one such person's risk of death, dropping it from 1% to around 0% (if we know where AMF and MC will work with that extra funding). On the other hand, it seems hard to see how only $100,000 dollars targeted at catastrophic risks could reduce anyone's risk of death by 1 percentage point. That would fund at most something like 2 people working full-time for a year, and probably less than 1 at most organizations working on x-risk, given current salaries. That will be true separately for the next $100,000, and the next, and the next, and so on, probably up to at least the endowment of Open Phil.</p><p>However, what about all of what Open Phil is granting to GiveWell, $100 million/year (<a href=\"https://blog.givewell.org/2023/10/06/open-philanthropys-2023-2025-funding-for-givewells-recommendations/\">source</a>), <i>all together</i>, rather than $100K at a time? That still, by assumption, only gives a 1 percentage point reduction in mortality across the beneficiaries of GiveWell recommendations, if malaria mortality rates are representative (<a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1070538669&amp;range=A31\">it seems it could be somewhat higher for Helen Keller International</a>, and <a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1176773164&amp;range=A86\">somewhat higher for New Incentives</a>, if we account for individuals at increase personal risk for those, too, and that covers the rest of GiveWell's top charities). Can we reduce global catastrophic risks by more than 1 percentage point with a $100 million? What about $100 million/year over multiple years? I think many concerned with AI risk would say yes. And it might even be better for those who would otherwise receive bednets to protect them from malaria.</p><p>Now, malaria incidence can be as high as around 300 cases per 1000 people a given year in some places where AMF works (<a href=\"https://ourworldindata.org/malaria#malaria-incidence\">Our World in Data</a>). If the identified immunocompromised have a 50% chance of dying from malaria if they catch it, then a naive<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6xg2f3ilp6q\"><sup><a href=\"#fn6xg2f3ilp6q\">[1]</a></sup></span>&nbsp;risk reduction estimate could be something like 15 percentage points. It seems hard to reduce extinction risk or anyone's risk of death from a global catastrophe by <i>that</i> much in absolute terms (percentage points). For one, you need to believe the risk is at least 15%. And the ones with high risk estimates (&gt;85%) from AI tend to be pessimistic about our ability to reduce it much. I'd guess only a minority of those working on x-risk believe we can reduce it 15 percentage points with <i>all of Open Phil's endowment</i>. You have to be in a sweet spot of \"there's a good chance this won't go well by default, but ~most of that is avertable\".</p><p>And, on the other hand, AI pause work in particular could mean some people will definitely die who would otherwise have had a chance of survival and a very long life through AI-aided R&amp;D on diseases, aging and mind uploading.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6xg2f3ilp6q\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6xg2f3ilp6q\">^</a></strong></sup></span><div class=\"footnote-content\"><p>One might expect the immunocompromised to be extra careful and buy bednets themselves or have bednets bought for them by their family. Also, some of those 300 cases per 1000 could be multiple cases in the same person in a year.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "ik4mahtW7qrRHsQvB", "postedAt": "2023-10-15T01:18:29.428Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for your question, Eli. The contractualist can say that it would be callous, uncaring, indecent, or invoke any number of other virtue theoretic notions to explain why you shouldn't leave broken glass bottles in the woods. What they can't say is that, in some situation where (a) there's a tradeoff between some present person's weighty interests and the 20-years-from-now young child's interests and (b) addressing the present person's weighty interests requires leaving the broken glass bottles, the 20-years-from-now young child could reasonably reject a principle that exposed them to risk instead of the present person's. Upshot: they can condemn the action in any realistic scenario. &nbsp;&nbsp;</p>", "parentCommentId": "FPR2vC5vzHemisfmH", "user": {"username": "bob-fischer"}}, {"_id": "HCgxdBmCW6F4qPdai", "postedAt": "2023-10-15T01:20:44.399Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Hi David. It's probably true that if you accept that picture of persons, then the implications of contractualism are quite counterintuitive. Of course, I suspect that most contractualists reject that picture.</p>", "parentCommentId": "gJmGxmkNtp7rEE6qn", "user": {"username": "bob-fischer"}}, {"_id": "L7dgzcThB88x2GDQG", "postedAt": "2023-10-15T01:22:46.315Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Very interesting, Jakob! I'll have to contact Tomi to get his draft. Thanks for the heads up about this work. And, of course, I'll be curious to see what you're working on when you're able to share!</p>", "parentCommentId": "ET2BGA2rsJDFrDpLS", "user": {"username": "bob-fischer"}}, {"_id": "bBXsLdkyKEyHttNNE", "postedAt": "2023-10-15T01:34:50.607Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Good question, Eli. I think a lot here depends on keeping the relevant alternatives in view. The question is not whether it's <i>permissible </i>to coordinate climate change mitigation efforts (or what have you). Instead, the question is whether we owe it to anyone to address climate change <i>relative to the alternatives</i>. And when you compare the needs of starving children or those suffering from serious preventable diseases, etc., to those who might be negatively affected by climate change, it becomes a lot more plausible that we <i>don't </i>owe to anyone to address those things over more pressing needs (assuming we have a good chance of doing something about those needs / moving the needle significantly / etc.).&nbsp;</p>", "parentCommentId": "oMQtxspwYWqsrLEsc", "user": {"username": "bob-fischer"}}, {"_id": "aHQ9eQi4GeGgguCjQ", "postedAt": "2023-10-15T01:42:36.736Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>This is the right place to press, Michael. These are exactly the probabilities that matter. Because I tend to be pretty pessimistic about our ability to reduce AI risk, I tend to think the numbers are going to break in favor of AMF. And on top of that, if you're worried that x-risk mitigation work might sometimes increase x-risk, even a mild level of risk aversion will probably skew things toward AMF more strongly. But it's important to bring these things out. Thanks for flagging.</p>", "parentCommentId": "YFrEfWwXT2koNPiGX", "user": {"username": "bob-fischer"}}, {"_id": "n4ApowQxDCKtCWTvw", "postedAt": "2023-10-15T01:55:04.144Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p><i>(My only understanding of contractualism comes from this post, The Good Place, and the </i><a href=\"https://plato.stanford.edu/Archives/Win2012/entries/contractualism/\"><i>SEP article</i></a><i>. Apologies for any misunderstandings)</i></p><p><strong>tl;dr: I think contractualism will lead to pretty radically different answers than AMF. So I dispute the \"if contractualism, then AMF\" conditional. Further, I think the results it gives is so implausible that we should be willing to reject contractualism as it applies to the impartial allocation of limited resources. I'm interested in responses to both claims, but I'm happy to see replies that just address one or the other.</strong></p><p>Suppose there's a rare disease that would kill Mary rather painfully with probability ~=1. Suppose further that we estimate that it takes ~1 billion dollars to cure her. It seems that under contractualism, every American (population ~330 million) is obligated to chip in 3 dollars to save Mary's life. It is after all implausible that a tax increase of 3 dollars per year has nearly as much moral claim to wrongness as someone dying painfully, even under the much more relaxed versions that you propose.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefcej097vw92n\"><sup><a href=\"#fncej097vw92n\">[1]</a></sup></span></p><p>Without opining on whether contractualism makes sense in its own lane<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref005le2wn0j8ap\"><sup><a href=\"#fn005le2wn0j8ap\">[2]</a></sup></span>, I personally think the above is a <i>reductio ad absurdum</i> of contractualism as applied to the rational impartial allocation of limited resources, namely that it elevates a cognitive bias (the identifiable victim effect) to a core moral principle. But perhaps other people think privileging Mary's life over every American having 3 dollars (the equivalent on the margin to 330 million used books or 330 million ice cream cones) is defensible or even morally obligatory. Well it so happens that 3 dollars is close to the price of a antimalarial <a href=\"https://www.againstmalaria.com/dollarspernet.aspx\">bednet</a>. My guess is that contractualism, even under the more relaxed versions, will have trouble coming up with why preventing some number of people (remember, contractualism doesn't do aggregations!) having a ~50% chance of getting malaria and a ~0.3% chance of dying is morally preferable to preventing someone from dying with probability ~1. This despite the insecticidal bednets potentially saving tens or even hundreds of thousands of lives in expectation!&nbsp;<br><br>But I guess one person's modus tollens is another's modus ponens. What I consider to be a rejection of contractualism can also logically be interpreted by others as a rejection of AMF, in favor of much more expensive interventions that can save someone's life with probability closer to 1. (And in practice, I wouldn't be surprised if the actual price to save a life for someone operating under this theory is more like a million dollars than a billion). So I would guess people who believe in contractualism as applied to charities to end up making pretty radically different choices than the current EA set of options.</p><p>EDIT: 2023/10/15: I see that <a href=\"https://forum.effectivealtruism.org/posts/3KsvReHD6CckfwHak/if-contractualism-then-amf?commentId=fouudjsEHBoKSbE9s\">Jakub</a> has already made the same point I had before I commented, just more abstract and philosophical.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fncej097vw92n\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefcej097vw92n\">^</a></strong></sup></span><div class=\"footnote-content\"><p>A related issue with this form of contractualism is its demandingness, which taken literally seems more demanding than even naive act utilitarianism. Act utilitarianism is often criticized for its demandingness, but utilitarianism at least permits people to have simple pleasures while others suffer (as long as the simple pleasures are cheap to come by).</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn005le2wn0j8ap\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref005le2wn0j8ap\">^</a></strong></sup></span><div class=\"footnote-content\"><p>As you and SEP both note, contractualism is only supposed to describe a subset of morality, not all of it.&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "sbhHYF2HmWespy8Eg", "postedAt": "2023-10-15T14:20:37.137Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for your interest! I will let you know when my paper is ready/readable. Maybe I'm also going to write a forum post about it.</p>", "parentCommentId": "L7dgzcThB88x2GDQG", "user": {"username": "Jakob Lohmar"}}, {"_id": "fDBzL2wYQkQWik5eJ", "postedAt": "2023-10-15T14:27:58.657Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Hmm I can't recall all its problems right now, but for one I think that the view is then not compatible anymore with ex ante Pareto - which I find the most attractive feature of the ex ante view compared to other views that limit aggregation. If it's necessary for justifiability that all the subsequent actions of a procedure are ex ante justifiable, then the initiating action could be in everyone's ex ante interest and still not justified, right?</p>", "parentCommentId": "unMFiMPFKdw5DekKo", "user": {"username": "Jakob Lohmar"}}, {"_id": "c7LkAWebo2uitorvk", "postedAt": "2023-10-15T15:59:17.259Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Note that the AMF example does not quite work, because if each net has a 0.3% chance of preventing death, and all are independent, then with 330M nets you are &gt;99% sure of saving at least ~988k people.</p>\n", "parentCommentId": "n4ApowQxDCKtCWTvw", "user": {"username": "Jsevillamol"}}, {"_id": "CTj4m9CmCSAoDKjDg", "postedAt": "2023-10-15T19:20:44.559Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for the reply.</p><p>I think \"don't work on climate change<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefh7d0yi3pfjk\"><sup><a href=\"#fnh7d0yi3pfjk\">[1]</a></sup></span>&nbsp;if it would trade off against helping one currently identifiable person with a strong need\" is a really bizarre/undesirable conclusion for a moral theory to come to, since if widely adopted it seems like this would lead to no one being left to work on climate change. The prospective climate change scientists would instead earn-to-give for AMF.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnh7d0yi3pfjk\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefh7d0yi3pfjk\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Or bettering relations between countries to prevent war, or preventing the rise of a totalitarian regime, etc.</p></div></li></ol>", "parentCommentId": "bBXsLdkyKEyHttNNE", "user": {"username": "reallyeli"}}, {"_id": "gpnzuSWgtQmivadwx", "postedAt": "2023-10-15T20:25:27.359Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>The problem (often called the \"statistical lives problem\") is even more severe: ex ante contractualism does not only prioritize identified people when the alternative is to <i>potentially</i> save very many people, or many people <i>in expectation</i>; the same goes when the alternative is to save many people <i>for sure</i> as long as it is unclear <i>who </i>of a sufficiently large population will be saved. For each individual, it is then still unlikely that <i>they </i>will be saved, resulting in diminished ex ante claims that are outweighed by the undiminished ex ante claim of the identified person. And that, I agree, is absurd indeed.&nbsp;</p><p>Here is a thought experiment for illustration: There are two missiles circulating earth. If not stopped, one missile is certain to kill Bob (who is alone on a large field) and nobody else. The other missile is going to kill 1000 people; but it could be any 1000 of the X people living in large cities. We can only shoot down one of the two missiles. Which one should we shoot down?</p><p>Ex ante contractualism implies that we should shoot down the missile that would kill Bob since he has an undiscounted claim while the X people in large cities all have strongly diminished claims due to the small probability that <i>they </i>would be killed by the missile. But <i>obviously </i>(I'd say) we shoud shoot down the missile that would kill 1000 people. (Note that we could change the case so that not 1000 but e.g. 1 billion people would be killed by the one missile.)</p>", "parentCommentId": "n4ApowQxDCKtCWTvw", "user": {"username": "Jakob Lohmar"}}, {"_id": "NAbjNmo6HSaNsbFxZ", "postedAt": "2023-10-15T20:32:29.809Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Contractualism doesn't allow aggregation across individuals. If each person has 0.3% chance of averting death with a net, then any one of those individual's claims is still less strong than the claim of the person who will die with probability ~=1. Scanlon's theory then says save the one person.</p>", "parentCommentId": "c7LkAWebo2uitorvk", "user": {"username": "jackmalde"}}, {"_id": "wWJi54B7a7ipdf8hd", "postedAt": "2023-10-15T20:38:26.991Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>A relevant GPI paper is <a href=\"https://globalprioritiesinstitute.org/longtermism-aggregation-and-catastrophic-risk-emma-j-curran/\"><strong>Longtermism, aggregation, and catastrophic risk</strong></a><strong> </strong>by Emma J. Curran.</p><p>I briefly summarised it <a href=\"https://forum.effectivealtruism.org/posts/xHrN4APvEjCkC4ceb/mini-summaries-of-gpi-papers#Longtermism__aggregation__and_catastrophic_risk__Emma_J__Curran_\">here</a>, also pasted below:</p><blockquote><p><strong>The bottom line: </strong>If one is sceptical about aggregative views, where one can be driven by sufficiently many small harms outweighing a smaller number of large harms, one should also be sceptical about longtermism.</p></blockquote><p>My brief summary:</p><ul><li>Longtermists generally prefer reducing catastrophic risk to saving lives of people today. This is because, even though you would be reducing probability of harm by a small amount if focusing on catastrophic risk, the expected vastness of the future means more good is done in expectation.</li><li>This argument relies on an aggregative view where we should be driven by sufficiently many small harms outweighing a smaller number of large harms. However there are some cases where we might say such decision-making is impermissible e.g. letting a man get run over by a train instead of pulling a lever to save the man but also make lots of people late for work. One argument for why it’s better to save the man from death is the separateness of persons - there is no actual person who experiences the sum of the individual harms of being late - so there can be no aggregate complaint.</li><li>The author shows that a range of non-aggregative views (where we are not driven by sufficiently many small harms outweighing fewer large ones), under different treatments of risk, undermine the case for longtermism. These views typically generate extremely weak claims of assistance from future people.</li></ul>", "parentCommentId": null, "user": {"username": "jackmalde"}}, {"_id": "JZvSxPdRLrRcbpJwX", "postedAt": "2023-10-15T23:56:30.530Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<blockquote><p>Or many people <i>in expectation</i>; the same goes when the alternative is to save many people <i>for sure</i> as long as it is unclear <i>who </i>of a sufficiently large population will be saved</p></blockquote><p>Yep you're right. And importantly, this isn't a far-off hypothetical: as Jaime <a href=\"https://forum.effectivealtruism.org/posts/3KsvReHD6CckfwHak/if-contractualism-then-amf?commentId=c7LkAWebo2uitorvk\">alludes to</a>, under most reasonable statistical assumptions AMF will almost certainly save a great number of lives with probability close to 1, not just save many lives in expectation. The only problem is that you don't know for sure who those people are, ex ante.</p>", "parentCommentId": "gpnzuSWgtQmivadwx", "user": {"username": "Linch"}}, {"_id": "dQ2zbDEvdpaQYtPN2", "postedAt": "2023-10-16T00:17:57.716Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Yeah Scanlon's theory doesn't allow for differentiation even between a strong claim and many only slightly worse claims. The authors of this post tries to rescue the theory by the small relaxation that you can treat high probabilities and numbers of morally almost-as-bad things to be worse than 1 very bad and certain thing.</p><blockquote><p>We find it plausible that if Scanlon’s argument for saving the greater number succeeds, then, for some&nbsp;<i>n</i>, you ought to save the <i>n</i>. Here’s our thinking: First, imagine a version of <i>Death/Paraplegia</i>&nbsp;in which <i>n</i> = 1. In this case, you ought to save Nora outright. Now imagine a version in which <i>n</i> = 2. In this case, if you were to save Nora, then, plausibly, the additional person on the side of the many has a complaint, for you would thereby treat the case as though the additional person weren't even there. (Recall that we’re supposing that Scanlon’s argument described above succeeds.) So, you ought to do something appropriately responsive to the additional person’s presence. Perhaps this will take the form of flipping a coin to determine whether to save Nora or the many; perhaps it will take the form of running a lottery heavily weighted on Nora’s side—the details won’t matter here. What matters is that whatever such an act would be, it would presumably be “closer” to saving the <i>n</i> than what it was permissible to do when <i>n</i> = 1 (namely, saving Nora outright).</p></blockquote><blockquote><p>But now imagine iterating this process over and over, increasing the size of <i>n</i> by 1 each time. Eventually, we think, you’ll get to a point where outright saving the <i>n</i> is the only acceptable thing to do. <strong>This suggests that Scanlonian contractualism can accommodate some aggregation of lesser bads, at least if Scanlon’s argument for saving the greater number is successful.[emphasis mine]</strong></p></blockquote><p>But while I could imagine it going through for preventing 2 people from dying with 80% probability vs 1 person with 100%, I don't think it goes through for ice cream, or AMF. A system that doesn't natively do aggregation has a lot of trouble explaining why many numbers of people each with a 0.3% of counterfactually dying has as much ore more moral claim to your resources as a single identified person with ~100% chance of counterfactually dying.</p><p>(As a side note, I try to ground my hypotheticals in questions that readers are likely to have first-hand familiarity with, or can easily visualize themselves in that position. Either very few or literally no one in this forum has experience with obscenely high numbers of dust specks, or missile high command. Many people in this conversation have experience with donating to AMF, and/or eating ice cream).&nbsp;</p>", "parentCommentId": "NAbjNmo6HSaNsbFxZ", "user": {"username": "Linch"}}, {"_id": "R2hCcDoqoPpieF98J", "postedAt": "2023-10-16T00:30:28.653Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>As a fairly unimportant side note, I was imagining that <i>som</i>e nets has a 0.3% chance of saving <i>some</i> (unusually vulnerable) people, but the average probability (and certainly the marginal probability) is a lot lower. Otherwise $1B to AMF can save ~1M lives, and which is significantly more optimistic than the best GiveWell estimates.</p>", "parentCommentId": "c7LkAWebo2uitorvk", "user": {"username": "Linch"}}, {"_id": "oxTqcxXrQdH6DW8pc", "postedAt": "2023-10-16T00:47:40.934Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>I think this argument doesn't quite go through as stated, because AMF doesn't have an infinite funding gap. If everybody on Earth (or even, say, 10% of the richest 10% of people) acted on the version of contractualism that mandated donating significantly to AMF as a way to discharge their moral obligations, we'll be well-past the point where anybody who wants and needs a bednet can have one.&nbsp;</p><p>That said, I think a slightly revised version of your argument can still work. In a contractualist world, people should be willing to give almost <i>unlimited </i>resources to a <a href=\"https://forum.effectivealtruism.org/posts/3KsvReHD6CckfwHak/if-contractualism-then-amf?commentId=n4ApowQxDCKtCWTvw\">single identifiable victim</a> than working on large-scale moral issues, or having fun.&nbsp;</p>", "parentCommentId": "CTj4m9CmCSAoDKjDg", "user": {"username": "Linch"}}, {"_id": "HeyM9zFAvpDDuRZJ4", "postedAt": "2023-10-16T01:32:00.964Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Yeah I feel that sometimes theories get really convoluted and ad hoc in an attempt to avoid unpalatable conclusions. This seems to be one of those times.</p><p>I can give Scanlon a free pass when he says under his theory we should save two people from certain death rather than one person from certain death because the 'additional' person would have some sort of complaint. However when the authors of this post say, for a similar reason, that the theory implies it's better to do an intervention that will save two people with probability 90% rather than one person with probability 100%, I just think they're undermining the theory.&nbsp;</p><p>The logic is that the 'additional' person in the pair has a complaint because you're acting as if they aren't there. But you aren't acting as if they aren't there - you're noticing they have a lesser claim than the single individual and so are (perhaps quite reluctantly) accommodating the single individual's larger claim. Which is kind of the whole point of the theory!</p>", "parentCommentId": "dQ2zbDEvdpaQYtPN2", "user": {"username": "jackmalde"}}, {"_id": "NaKaC2QgtszCAR7jA", "postedAt": "2023-10-16T03:44:40.051Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>One way you could do this is by defining what kinds of claims would be \"relevant\" to one another and aggregatable. If X is relevant to Y, then enough instances of X (or any other relevant claims) can outweigh Y. Deaths are relevant to other deaths, and we could (although need not) say that should hold no matter the probability. So multiple 0.3 percentage point differences in the probability of death can be aggregated and outweigh a 100 percentage point difference.</p>\n<p>Some serious debilitating conditions could also be relevant to death, too, even if less severe.</p>\n<p>On the other hand, ice cream is never relevant to death, so there's no trade off between them. Headaches (a common example) wouldn't be relevant to death, either.</p>\n<p>I think this is the idea behind one approach to limited aggregation, specifically Voorhoeve, 2014 (<a href=\"https://doi.org/10.1086/677022\">https://doi.org/10.1086/677022</a>).</p>\n<p>But this seems kind of wrong as stated, or at least it needs more nuance.</p>\n<p>There's a kind of sequence argument to worry about here, of increasingly strong claims. Is ice cream relevant to 1 extra second of life lost for an individual? Yes. If ice cream is relevant to n extra seconds of life lost for an individual, it seems unlikely 1 more second on top for the individual will make a difference to its relevance. So by induction, ice cream should be relevant to any number of extra seconds of life lost to an individual.</p>\n<p>However, the inductive step could fail (with high probability). Where it could fail seems kind of arbitrary, but we could just have moral uncertainty about that.</p>\n<p>Also, there are nonarbitrary (but uncertain) places it could fail for this specific sequence. Some people have important life goals that are basically binary, e.g. getting married. Losing enough years of life will prevent those goals from being fulfilled. So, rather than some cutoff on seconds of life lost or death itself, it could be such preferences that give us cutoffs.</p>\n<p>Still, preference stength plausibly comes in many different degrees and many preferences themselves are satisfiable to many different degrees, so we could make another sequence argument over preference strengths or differences in degree of satisfaction.</p>\n", "parentCommentId": "dQ2zbDEvdpaQYtPN2", "user": {"username": "MichaelStJules"}}, {"_id": "YHFW2S6Qn2Sx6jsQm", "postedAt": "2023-10-16T09:19:24.431Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Yes indeed! When it comes to assessing the plausibility of moral theories, I generally prefer to make \"all else equal\" to avoid potentially distorting factors, but the AMF example comes close to being a perfect real-world example of (what I consider to be) the more severe version of the problem.&nbsp;</p>", "parentCommentId": "JZvSxPdRLrRcbpJwX", "user": {"username": "Jakob Lohmar"}}, {"_id": "N358gq5YdczP2aNSX", "postedAt": "2023-10-16T12:38:28.589Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Thanks for all the productive discussion, everyone. A few thoughts.</p><p>First, the point of this post is to make a case for the conditional, not for contractualism. So, I'm more worried about \"contractualism won't get you AMF\" than I am about \"contractualism is false.\" I assumed that most readers would be skeptical of this particular moral theory. The goal here isn't to say, \"If contractualism, then AMF---so 100% of resources should go to AMF.\" Instead, it's to say, \"If contractualism, then AMF---so if you put any credence behind views of this kind at all, then it probably isn't the case that 100% of resources should go to x-risk.\"</p><p>Second, on \"contractualism won't get you AMF,\" thanks to Michael for making the move I'd have suggested re: relevance. Another option is to think in terms of either nonideal theory or moral uncertainty, depending on your preferences. Instead of asking, \"Of all possible actions, which does contractualism favor?\" We can ask: \"Of the actual options that a philanthropist takes seriously, which does contractualism favor? It may turn out that, for whatever reason, only high-EV options are in the set of actual options that the philanthropist takes seriously, in which case it doesn't matter whether a given version of contractualism wouldn't select all those options to begin with. Then, the question is whether they're uncertain enough to allow other moral considerations to affect their choice from among the pre-set alternatives.</p><p>Finally, on the statistical lives problem for contractualism, I'm mostly inclined to shrug off this issue as bad but not a dealbreaker. This is basically for a meta-theoretic reason. I think of moral theories as attempts to systematize our considered judgments in ways that make them seem principled. Unfortunately, our considered judgments conflict quite deeply. Some people's response to this is to lean into the process of reflective equilibrium, giving up either principles or judgments in the quest for perfect consistency. My own experience of doing this is that the push for *more* consistency is usually good, whereas the push for *perfect* consistency almost always means that people endorse theories with implications that I find horrifying *that they come to believe are not horrifying,* as they follow from a beautifully consistent theory. I just can't get myself to believe moral theories that are that revisionary. (I'm reporting here, not arguing.) So, I prefer relying on a range of moral theories, acknowledging the problems with each one, and doing my best to find courses of action that are robustly supported across them. In my view, EAC is based on the compelling thought that we ought to protect the known-to-be-most vulnerable, even at the cost of harm to the group. In light of this, what makes identified lives special is just that we can tell who the vulnerable are. So sure, I feel the force of the thought experiments that people offer to motivate the statistical lives problem; sure, I'm strongly inclined to want to save more lives in those cases. But I'm not so confident to rule out EAC entirely. So, EAC stays in the toolbox as one more resource for moral deliberation.</p>", "parentCommentId": "R2hCcDoqoPpieF98J", "user": {"username": "bob-fischer"}}, {"_id": "zuL7TS4noQNvGEsA5", "postedAt": "2023-10-16T17:03:22.465Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>I don't see a coherent view of people that doesn't have some version of this. My firstborn child was not a specific person until he was conceived, even when I was planning with my wife to have a child. As a child, who he is and who he will be is still very much being developed over time. But who I will be in 20 years is also still very much being determined - and I hope people reason about their contractualist obligations in ways that are consistent with considering that people change over time in ways that aren't fully predictable in advance.</p><p>More to the point, the number of possible mes in 20 years, however many there are, should collapse to having a value exactly equal to me - possibly discounted into the future. Why is the same not true of future people, where the number of different possible people each have almost zero claim, and it doesn't get aggregated at all?</p>", "parentCommentId": "HCgxdBmCW6F4qPdai", "user": {"username": "Davidmanheim"}}, {"_id": "fy4XvqXKz8drCRmJS", "postedAt": "2023-10-16T17:26:16.318Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Hi David. There are two ways of talking about personal identity over time. There's the ordinary way, where we're talking about something like sameness of personality traits, beliefs, preferences, etc. over time. Then, there's \"numerical identity\" way, where we're talking about just being the same thing over time (i.e., one and the same object). It sounds to me like either (a) you're running these two things together or (b) you have a view where the relevant kinds of changes in personality traits, beliefs, preferences, etc. result in a different thing existing (one of many possible future Davids). If the former, then I'll just say that I meant only to be talking about the \"numerical identity\" sense of sameness over time, so we don't get the problem you're describing in the intra-individual case. If the latter, then that's a pretty big philosophical dispute that we're unlikely to resolve in a comment thread!</p>", "parentCommentId": "zuL7TS4noQNvGEsA5", "user": {"username": "bob-fischer"}}, {"_id": "aQWYtStDgfvLoynDG", "postedAt": "2023-10-19T08:42:05.247Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>I don't necessarily care about the concept of personal identity over time, but I think there's a very strong decision-making foundation for considering uncertainty about future states. In one framing, I buy insurance because in some future states it is very valuable, and in other future states it was not. I am effectively transferring money from one future version of myself to another. That's sticking with a numerical identity view of my self, but it's critical to consider different futures despite not having a complex view of what makes me \"the same person\".</p><p>But I think that if you embrace the view you present as obvious for contractualists, where we view future people fundamentally differently than present people, and do not allow consideration of different potential futures, you end up with some very confused notions about how to plan under uncertainty, and can never prioritize any types of investments that pay off primarily in even the intermediate-term future. For example, mitigating emissions for climate change should be ignored, because we can do more good for current people by mitigating harms rather than preventing them, and should emit more and ignore the fact that this will, with certainty, make the future worse, because those people don't have much of a moral claim. And from a consequentialist viewpoint - which I think is relevant even if we're not accepting it as a guiding moral principle - we'd all be much, much worse off if this sort of reasoning had been embraced in the past.</p>", "parentCommentId": "fy4XvqXKz8drCRmJS", "user": {"username": "Davidmanheim"}}, {"_id": "N9hGdhXQjSdwyYXFs", "postedAt": "2023-10-27T08:45:09.915Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Great to see this out there - a very useful piece of work!&nbsp;</p><p>I actually have another manuscript on an ex-ante/ex-post fairness argument against longterm interventions. Could I send it to you sometime? Would love to hear your thoughts.&nbsp;</p>", "parentCommentId": null, "user": {"username": "emmajcurran"}}, {"_id": "txGkoDJoYmEvsnAw4", "postedAt": "2023-10-27T12:20:12.532Z", "postId": "3KsvReHD6CckfwHak", "htmlBody": "<p>Of course!</p>", "parentCommentId": "N9hGdhXQjSdwyYXFs", "user": {"username": "bob-fischer"}}]