[{"_id": "sLzZ4GsEjjLf6fPms", "postedAt": "2023-06-01T10:37:34.825Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Thanks for this, I found it interesting!</p><ol><li>I think HTA offers a concrete path to better emulate moral uncertainty and pluralism, though I worry it could soften and blunt the insight EA contributes through its focus on cost-effectiveness. Do you think this is a real trade-off? Is pluralism better emulated at the field-level, such that it is served by EA continuing its narrow focus?</li><li>I liked the other recent <a href=\"https://www.cgdev.org/blog/how-economists-got-africas-aids-epidemic-wrong\">CGD blog on PEPFAR</a>, a case where cost-effectiveness analysis was &nbsp;misleading. Seemingly the failures were strategic - not considering how budgetary constraints could be loosened nor how prices could be affected by major efforts. Do you think HTA would have fared better?</li></ol>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "yn3x7ZhRYcQFRjoAj", "postedAt": "2023-06-01T14:20:06.760Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Hi Ben&nbsp;</p><p>First off - I see HTA as a kind of process wrapper for cost-effectiveness analysis. So in a sense It's CEA+, rather than an alternative.&nbsp;</p><p>I'm not sure I followed you points about moral uncertainty and emulation of pluralism. Would you try again to say what you mean?&nbsp;</p><p>On Justin's blog, CGD welcomes - even encourages - a diversity of views within its staff. I don't agree with everything in this blog. For example HTA (which as I say, encompasses CEA) is precisely the tool used by many countries in price negotiation. I think there will be a follow up CGD blog with the opposing view, but I would say that CEA/HTA is now adopted by a large and increasing number of countries to inform health policy. If we're saying it's good enough domestic policy but not aid policy, we need to be really clear why.</p><p>Thanks,</p>", "parentCommentId": "sLzZ4GsEjjLf6fPms", "user": {"username": "TomDrake"}}, {"_id": "KqsBw8XFfBPPD3xgM", "postedAt": "2023-06-01T14:51:14.938Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Thanks! To clarify about moral uncertainty/pluralism - a caricatured EA approach might use CEA to evaluate how well different interventions maximise units of a particular benefit (e.g. DALYs, lives saved, ROI), and then follow those results to fulfil a consequentialist ethic. HTA seems like a method that could additionally weight equity, fairness, or benefit to the worst off, such that it would be more inclusive of prioritarian or justice-based views. HTA's greater emphasis on participation by different stakeholders also seems more amenable to considering a plurality of worldviews, rather than reliance on those of a small set of donors and analysts.&nbsp;<br><br>So all that sounds quite good to me, but I'm aware that there may be a trade-off where EA loses some its weirdness, such that high-impact but niche interventions and cause areas would be neglected if EA became more like the rest of the aid landscape. I'm not sure what to think here.</p>", "parentCommentId": "yn3x7ZhRYcQFRjoAj", "user": {"username": "BenStewart"}}, {"_id": "qJDrhgwC6jk7b24S2", "postedAt": "2023-06-01T15:53:49.421Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Thanks for sharing this, Tom!</p><p>Some thoughts for future development -- I recognize, of course, that you were working within the confines of a blog post:</p><p>On difference 1: Would it be more accurate to describe this as a continuum? E.g., <i>EA organizations tend to invest significantly fewer resources into translating and adapting cost-effectiveness work in Country A before applying it in Country B than organizations applying HTA. </i>Although giving no thought to emergent properties like differences in disease burden would be really unwise, I am not aware of any evidence that major EA funders are missing the super-low-hanging fruit there. (Of course, I could be underinformed, in which case some concrete examples of serious misses would help me update on their methodology!)&nbsp;</p><p>The idea of the suggested reframing is to paint investing in cost-effectiveness translation as a tradeoff -- one can do more extensive work in this area (HTA) or relatively less (EA), and both approaches have their benefits and downsides. It intuitively seems that best approach would depend on the resources that would be going into the intervention in a new location, the costs of additional translation efforts, and the likelihood that the results of those efforts would either shape the intervention-as-deployed or change funding decisions. Indeed, my hunch is that -- in general -- your suggestions grow stronger as the amount of money EA is putting into global health increases, and the odds of EA funders being able to influence other funders through their actions increases.</p><p>On difference 2: I think the crux here is about the effect of other donors and the likelihood of successfully coordinating with them. If one views the decisions of other donors as essentially fixed, then it likely makes sense to allocate one's own funds in a way that seeks to gives cost-effectiveness (or other atttributes one thought undervalued by the broader funding ecosystem) the appropriate amount of emphasis in the global health ecosystem as a whole -- rather than weighing a basket of attributes in the way the donor would if they controlled how all donors spent their monies on global health.&nbsp;</p><p>For longer pieces (not blog posts), it would be worth considering that \"someone should do X,\" \"EA as a whole should do X,\" and \"Specific Organization C should do X\" are different claims. I think the kind of thinking in your blog post has a lot to offer EA organizations, but at later stages of development would need to be actionable by specific people and organizations in light of their particular constraints to achieve impact. In particular, I see GiveWell as acting more as a pure advisor to donors, so it faces the constraint of keeping those donors (which it has attracted with a goal of finding \"charities that save or improve lives the most per dollar\") happy. Much more so than Open Phil and Founders Pledge, it is also built around the Unix-like philosophy of (mostly) doing one thing and doing it very well and may experience adverse outcomes from even well-intentioned mission creep by funding more \"meta\" work like your recommendation 4.&nbsp;</p><p>So I am not sure how actionable recommendations 2, 3, and 4 (maybe even 1) are for an organization in the style of GiveWell. On the other hand, I think they are quite actionable for OpenPhil. Given that GiveWell alone is a significant part of the ecosystem, a suggestion for longer pieces would be to offer more action items that clearly fit within its operating philosophy and constraints.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "rdhCbDdBKzvSBg7uM", "postedAt": "2023-06-01T21:32:15.397Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Thanks Jason, appreciate your thoughts.&nbsp;</p><p>Taking your points in order</p><ol><li>Yes I essentially agree - though the other option available is to decide to work more through local institutions to prioritise and fund health services. Again yes this may be better done at scale. Though with the rate of growth in EA funding, I wouldn’t rule out a role for this kind of EA engagement. Or perhaps there is a role for EA as a kind of catalytic funder, investing in frameworks/platforms for more effective aid policy from states and major multilaterals.&nbsp;</li><li>I think you mean that if there are gaps for highly cost-effective services that aren’t being delivered by other donors (or indeed the national health system, we should remember that even in the very poorest countries, national institutions are still likely to be the main healthcare funder and provider, not the donors) then it makes sense for EA to fill those gaps. I think gap-filling and prioritisation are separate steps. With the additional criteria we’re still trying to assess value and therefore in a sense a certain kind of more broadly conceived assessment of cost-effectiveness. For example, if intervention A has a better cost per DALY than intervention B but equity considerations mean the HTA committee strongly prefers intervention B, then B is rightly considered a higher priority. We could then look at the practical issues of gaps, organisations that can deliver etc.&nbsp;</li><li>On specificity of recommendations, yes that’s fair. As you say this is just a blog so perhaps for future work. I also considered working out a clearer taxonomy of what is being prioritised (causes/programmes/interventions/charities etc). But this one was on the long side for a blog as it is</li></ol>", "parentCommentId": "qJDrhgwC6jk7b24S2", "user": {"username": "TomDrake"}}, {"_id": "Zgce3aFWfkvukk6Ac", "postedAt": "2023-06-01T21:41:25.354Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Ok gotcha this time. Similar to some of the response to Jason below I would say that the assessment of value and the assessment of gaps etc are separate steps. We shouldn’t think about adopting a value framework because it allows us to find a practical niche. I suppose it does beg the question; whose value framework should we use? I don’t have that answer, but I do think that it links to the 4th difference in my blog; about institutionalisation and participation.&nbsp;</p><p>Btw, you imply that the rest of the aid landscape uses this HTA-like approach to prioritisation.. Sadly this is certainly not the case! I worked in the UK Department for International Development for several years, in a team that was tasked with providing evidence to the rest of the organisation. We did our best but it was a long way from perfect. Indeed I do see a significant opportunity for EA movement and organisations to influence other donors to take a more systematic, evidence-informed approach. For me this absolutely does mean using cost-effectiveness - but it means using it not in a blunt way but as part of an appropriate process and so that - wherever possible - we work with, not around, local systems and institutions.&nbsp;</p>", "parentCommentId": "KqsBw8XFfBPPD3xgM", "user": {"username": "TomDrake"}}, {"_id": "EhqGQaEp9hpZdS9pr", "postedAt": "2023-06-05T15:55:05.671Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Thanks for this thoughtful post, Tom. You’ve definitely raised some thoughts that have been on our mind recently, such as how GiveWell could systematically incorporate more external input into our grant-making process. We’ve taken some steps towards this, such as with a&nbsp;<a href=\"https://www.givewell.org/research/incubation-grants/IDinsight-beneficiary-preferences-march-2019\"><u>beneficiary survey in 2019</u></a>, and seeking out more external experts, but we’d like to do more – it was really great to read through your recommendations.&nbsp;</p><p>We did want to clarify, however, that GiveWell’s approach to modeling cost-effectiveness and making grant recommendations is heavily context-specific. You’re right that we start with intervention-level analysis in order to get a rough sense of the cost-effectiveness of any given program. But, our next step is to modify our models with many charity- and context-specific data and only fund grant opportunities that are above our&nbsp;<a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models#grantmaking\"><u>10x bar</u></a>. For example, when we’re considering making grants to Malaria Consortium's SMC program, we assess funding opportunities at the country level, taking into consideration the differences in&nbsp;<a href=\"https://docs.google.com/spreadsheets/d/10JFJaWnFAEKmsv5XjXqGqEoMUx0eM7x3WYwu_vC7FRw/edit#gid=791021775&amp;range=A54:A58\"><u>malaria prevalence</u></a>,&nbsp;<a href=\"https://docs.google.com/spreadsheets/d/10JFJaWnFAEKmsv5XjXqGqEoMUx0eM7x3WYwu_vC7FRw/edit#gid=791021775&amp;range=A97:A98\"><u>demographics (age distribution)</u></a>,&nbsp;<a href=\"https://docs.google.com/spreadsheets/d/10JFJaWnFAEKmsv5XjXqGqEoMUx0eM7x3WYwu_vC7FRw/edit#gid=791021775&amp;range=A44\"><u>mortality rates</u></a>,&nbsp; <a href=\"https://docs.google.com/spreadsheets/d/10JFJaWnFAEKmsv5XjXqGqEoMUx0eM7x3WYwu_vC7FRw/edit#gid=791021775&amp;range=A17\"><u>program costs</u></a>, and&nbsp;<a href=\"https://docs.google.com/spreadsheets/d/10JFJaWnFAEKmsv5XjXqGqEoMUx0eM7x3WYwu_vC7FRw/edit#gid=791021775&amp;range=A193\"><u>the spending we might expect from other actors in each setting</u></a>. The result is that the same program may clear our cost-effectiveness bar in some locations and not in others. For a recent example, see&nbsp;<a href=\"https://www.givewell.org/research/grants/Malaria-Consortium-SMC-renewal-Nigeria-Burkina-Chad-Togo-January-2023\"><u>this page</u></a> about a grant we recommended in January for Malaria Consortium; we decided to extend funding for its SMC program in Nigeria, Burkina Faso, and Togo (where estimated cost-effectiveness was near or above our bar), but provide only exit funding for Chad (which was below our bar).&nbsp;&nbsp;</p><p>If there’s reason to expect variations&nbsp;<i>within</i> countries, we also build out our model at the subnational level. For example, in 2022&nbsp;<a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models/changelog-2022#Change_3_Updated_our_CEA_of_Malaria_Consortium-s_seasonal_malaria_chemoprevention_SMC_program_in_Nigeria_with_subnational_data\"><u>we updated our model of Malaria Consortium's SMC program in Nigeria with state-level malaria prevalence and mortality data</u></a>. While we don’t capture every variance one could expect, we're trying to adjust for the major variances that could exist in different contexts (and which therefore could affect our bottom-line grantmaking decisions).&nbsp;</p><p>We realize that this nuance isn’t captured in our external-facing marketing, and we’re working on updates to our website to address this. We really appreciate your engagement with our work; we aspire to account for context-specific variables in our grantmaking and appreciate the push to consider this further and to make this aspect of our work clearer.</p>", "parentCommentId": null, "user": {"username": "GiveWell"}}, {"_id": "gLjtk7C9WYtBf5YaS", "postedAt": "2023-06-06T13:40:44.166Z", "postId": "3KuCzHJHCz99sf3ZB", "htmlBody": "<p>Greetings GiveWell Colleagues,&nbsp;</p><p>Let me first re-emphasise that this blog is very much in a “yes and…” spirit. As I say in the blog, I believe EA is a positive influence on philanthropy and global development and has more potential to continue to shake things up for the better.&nbsp;</p><p>Thank you for this detailed response and the clarification that some of your analysis and grant making is indeed context-specific; great to see, particularly as someone who cut their teeth on CEA of malaria interventions. My impression is still that context-differentiated analysis perhaps the exception rather than the rule within the EA space - i.e. including organisations beyond GiveWell and topics beyond global health. It doesn’t yet come out strongly in the back-and-forth in forums like this one nor in presentations at EA Global conferences and it’s usually not emphasised in recommendations of EA donors - perhaps including GiveWell if we look at the evidence in the Top Charities page (as you note). Solving this challenge is not straightforward of course and remains an issue for other donors in the development space.&nbsp;</p><p>I don’t mean to suggest there are off-the-shelf lessons from HTA - on this or the other differences I highlight - that could be adopted directly by EA organisations. Equally, the field of HTA has been developing approaches for cost-effectiveness-based decision-making for several decades and may be fertile ground to explore for the development of EA prioritisation.&nbsp;</p><p>Happy to keep in touch as useful.</p>", "parentCommentId": "EhqGQaEp9hpZdS9pr", "user": {"username": "TomDrake"}}]