[{"_id": "R6r2b4swfGLByuJot", "postedAt": "2023-06-03T03:43:00.249Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>“The human health gains are small relative to the harms to animals”&nbsp;</p></blockquote><p>I'd argue further that even if the human health benefits are large in the space of human health outcomes, they are so tiny in comparison to the harm an omnivorous diet causes to animals that they are scarcely worth discussing.</p><blockquote><p>It takes a few seconds to taste a bite of a dish. Let's assume that a portion of chicken is eaten in 24 bites. If, in order for us to eat such a portion, there is a chicken that has had to suffer 9 days, and has been deprived of 2 years of life, how much harm is inflicted on the chicken for each of those 24 bites? Doing the math, the result is as follows. <strong>In exchange for each brief moment of tasting its flesh, the chicken has had to suffer on average for about 9 hours on a farm.</strong> And it has been deprived of a month's life. That's just for every single bite. Every second of our taste pleasure is very expensive for the animal that is eaten.</p></blockquote><ul><li>Oscar Horta, <i>Making a Stand for Animals</i> (2022)</li></ul><p>This isn't hyperbole. Here's a description of the experiences of the chickens most people eat:</p><blockquote><p>Broiler chickens are the chickens raised for meat, rather than the ones raised to lay eggs. Chickens are endure cruel transport right from the moment of birth, in small crates. They’re sent to overcrowded sheds where they have no space to turn around. They have nothing interesting to do, and not enough space to do it. <strong>They express none of their natural behaviors and are subject to constant horrifying disease, injury, and artificial lighting that leads to torturous sleep deprivation. They spend their days unable to move much, living in feces and ammonia, subject to constant violence, and with horrifying diseases.</strong> Then, they’re cruelly slaughtered, wherein they’re crammed into small crates, leading to many chickens dying, and many more enduring bone-breaking injuries and weather extremes. Then, those that haven’t died yet are brutally slaughtered, some stunned, some with their throats slit while they’re conscious, and some boiled alive while fully conscious.</p></blockquote><p><a href=\"https://benthams.substack.com/p/a-brief-summary-of-what-goes-on-in\">Source</a></p><p>The idea that the potential human health benefits of meat consumption could possibly be decisive on the question of whether it's ethical to eat meat is a fantasy.</p><p>If we found out that torturing a baby for 9 hours created a cup's worth of baby tears which, when drank regularly, extended the human lifespan by 20 years, we would obviously not do it.</p><p>Thankfully, we can eat chicken and cause the same harm to a being <a href=\"https://www.business-standard.com/article/pti-stories/are-chickens-smarter-than-humans-113062000318_1.html\">of similar intelligence</a>, with far less positive impact on our health.</p>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "c557TaSKmzAasuR6s", "postedAt": "2023-06-03T06:48:20.043Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>You saw the counterarguments section \"The human health gains are small relative to the harms of animals\", but presumably missed that the next section was titled \"The health costs don't matter, no benefit justifies the horror of farming animals\", and made that exact counterargument rather than responding to Elizabeth's preemptive response.</p>", "parentCommentId": "R6r2b4swfGLByuJot", "user": {"username": "orthonormal"}}, {"_id": "Jpno9A9mhphnGehxc", "postedAt": "2023-06-03T10:42:46.889Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I think it would have been more fair if you hadn't removed all the links (to supporting evidence) that were included in the quote below, since it just comes across as a string of unsupported claims without them:</p><blockquote><p>Beyond the environmental effects, there are also significant health risks associated with the direct consumption of animal products, including <a href=\"https://www.youtube.com/watch?v=Ud7RkxtO3-Y&amp;ab_channel=NutritionFacts.org\">red</a> <a href=\"https://www.youtube.com/watch?v=aSHv5vDi3Is&amp;ab_channel=NutritionFacts.org\">meat</a>, <a href=\"https://www.youtube.com/watch?v=e78wdyOKGKw&amp;ab_channel=NutritionFacts.org\">chicken</a> <a href=\"https://www.youtube.com/watch?v=nJy9VjtQ9u0&amp;ab_channel=NutritionFacts.org\">meat</a>, <a href=\"https://www.youtube.com/watch?v=3l9T9t4s3uk&amp;t=15s&amp;ab_channel=NutritionFacts.org\">fish</a> <a href=\"https://www.youtube.com/watch?v=crVbnU_tHOA&amp;ab_channel=NutritionFacts.org\">meat</a>, <a href=\"https://www.youtube.com/playlist?list=PL5TLzNi5fYd9lgvt0-8Oi9BIQ-jO2PBD3\">eggs</a> and <a href=\"https://www.youtube.com/watch?v=zo1lljXf_gQ&amp;list=PL5TLzNi5fYd_aITY_VAyKONn3LgW8mWmM&amp;ab_channel=NutritionFacts.org\">dairy</a>. Conversely, significant health benefits are associated with alternative sources of protein, such as <a href=\"https://www.youtube.com/watch?v=hXxFdBwvLRE&amp;list=PL5TLzNi5fYd_74knd-28TH_3OCPWckuT4&amp;ab_channel=NutritionFacts.org\">beans</a>, <a href=\"https://www.youtube.com/watch?v=ZUmFfHNyj7s&amp;list=PL5TLzNi5fYd9GAyFQKU1OLz7CW_IZZ5Ww&amp;ab_channel=NutritionFacts.org\">nuts</a>, and <a href=\"https://www.youtube.com/watch?v=BaMAQ5CIuIs&amp;list=PL5TLzNi5fYd9VnRr95gZd0r9-ZjV5N9lZ&amp;ab_channel=NutritionFacts.org\">seeds</a>. This is relevant both collectively, for the sake of not supporting industries that <a href=\"https://www.youtube.com/watch?v=RnW2U0fI0K4&amp;ab_channel=NutritionFacts.org\">actively</a> <a href=\"https://www.youtube.com/watch?v=6aATqWWv2Bs&amp;ab_channel=NutritionFacts.org\">promote</a> poor human nutrition <a href=\"https://www.youtube.com/watch?v=40Qitvl2DA8&amp;ab_channel=NutritionFacts.org\">in general</a>, as well as individually, to maximize one’s own health so one can be more effectively altruistic.</p></blockquote><p>I think this evidence on personal health is relevant in the ways described. I don't think it's fair to say that the quote above implies that “[health benefits] will definitely happen with no additional work from you, without any costs or trade-offs”; obviously, any change in diet will require some work and will involve some tradeoffs. But I agree that it's worth addressing the potential pitfalls of vegan diets, and it's a fair critique that that would have been worth including in that essay (even though a <a href=\"https://magnusvinding.com/links/\">top link</a> on the blog does list some resources on this).</p><p>FWIW, in terms of additional work, tradeoffs, and maximizing health, I generally believe that it is worth making a serious investment into figuring out how to optimize one's health, such as by investing in a <a href=\"https://vojo.health/\">DNA test for nutrition</a>, and I think this is true for virtually everyone. Likewise, I think it's worth being clear that <i>all</i> diets involve tradeoffs and risks, including both vegan and omnivore diets (some of the risks associated with the latter are hinted at in the links above: \"<a href=\"https://www.youtube.com/watch?v=Ud7RkxtO3-Y&amp;ab_channel=NutritionFacts.org\">red</a> <a href=\"https://www.youtube.com/watch?v=aSHv5vDi3Is&amp;ab_channel=NutritionFacts.org\">meat</a>, <a href=\"https://www.youtube.com/watch?v=e78wdyOKGKw&amp;ab_channel=NutritionFacts.org\">chicken</a> <a href=\"https://www.youtube.com/watch?v=nJy9VjtQ9u0&amp;ab_channel=NutritionFacts.org\">meat</a>, <a href=\"https://www.youtube.com/watch?v=3l9T9t4s3uk&amp;t=15s&amp;ab_channel=NutritionFacts.org\">fish</a> <a href=\"https://www.youtube.com/watch?v=crVbnU_tHOA&amp;ab_channel=NutritionFacts.org\">meat</a>, <a href=\"https://www.youtube.com/playlist?list=PL5TLzNi5fYd9lgvt0-8Oi9BIQ-jO2PBD3\">eggs</a> and <a href=\"https://www.youtube.com/watch?v=zo1lljXf_gQ&amp;list=PL5TLzNi5fYd_aITY_VAyKONn3LgW8mWmM&amp;ab_channel=NutritionFacts.org\">dairy</a>\").</p>", "parentCommentId": null, "user": {"username": "MagnusVinding"}}, {"_id": "hNnyt8m3zkiSaiNHA", "postedAt": "2023-06-03T11:31:34.822Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Points of agreement:</p><p>I agree that it is important to refrain from claiming that a vegan diet is the optimal choice for overall health.</p><p>It is crucial to emphasize the need for careful planning and the inclusion of necessary supplements when making people vegan.</p><p>Points of disagreement:</p><p>I don't see conclusive evidence that a vegan diet is less healthy than some other diet. While it is plausible that consuming small quantities of animal products could be more healthy compared to a strictly vegan diet, the evidence supporting such claims doesn't seem conclusive to me. The studies I have encountered predominantly compare average meat eaters with average vegans. My conclusion from the existing body of evidence is that \"whole foods plant-based diets are sufficiently healthy. We don't know yet what precise diet is optimal for most people\"</p><p>I do not agree that we are obligated to highlight the non-health-related costs of veganism. The inconveniences associated with this lifestyle are already apparent to most individuals based on their firsthand experiences. Furthermore, my personal experience suggests that people generally overestimate the difficulties involved and often find it easier than anticipated after trying it. Reiterating the challenges may actually lead to further misconceptions.</p><p>In other contexts, such as promoting alternative diets or lifestyles, it does not strike me as dishonest if people omit mentioning the non-health costs. For instance, consuming berries is healthy, despite them being among the more expensive fruits. If someone doesn't mention the costs of berries when they say \"you should eat 1 portion of berries everyday\" that seems OK to me.</p><p>In that context it seems more important to not deny the costs rather than actively bringing them up.</p><p>Things I'm not sure whether we agree about:</p><p>We should stick precisely to the statement of Academy of Nutrition and Dietetics, and keep mentioning this in our conversations about veganism:</p><p>\"It is the position of the Academy of Nutrition and Dietetics that appropriately planned vegetarian, including vegan, diets are healthful, nutritionally adequate, and may provide health benefits for the prevention and treatment of certain diseases.\"</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "qaE875imfkG2pNzQe", "postedAt": "2023-06-03T12:25:02.132Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I <em>did</em> read Elizabeth’s preemptive response to the counterargument. However, her preemptive response doesn’t seem to actually argue against the counterargument, so I didn’t see any need to address it. I wrote my earlier comment to highlight that <strong>the counterargument is decisively strong—the health costs of veganism are scarcely worth discussing.</strong></p>\n<p>If you’d like to volunteer a consideration I may have missed, I’m all ears! However, Elizabeth’s preemptive response you mentioned doesn’t try to rebut the counterargument at all. Instead, it calls the counterargument a “fair argument for veganism”, and lists some tangential considerations which I didn’t find relevant enough to address in my earlier comment:</p>\n<blockquote>\n<p>But it’s not grounds to declare the health costs to be zero.</p>\n</blockquote>\n<p>The argument doesn’t do that. It just says they’re so small relative to the harms causes to animals that they’re scarcely worth discussing.</p>\n<blockquote>\n<p>It’s also not grounds to ignore nutrition within a plant-based diet.</p>\n</blockquote>\n<p>The argument isn’t about that at all, and I think most people would agree that nutrition is important.</p>\n", "parentCommentId": "c557TaSKmzAasuR6s", "user": {"username": "Ariel Simnegar"}}, {"_id": "f3a3DvsNjRtwCJ76W", "postedAt": "2023-06-03T12:41:01.957Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>Animal products are incredibly nutrient dense.</p></blockquote><p>I agree with many points in this essay but was surprised by this claim. The claim is definitely <i>not</i> true if by \"nutrient density\" you mean \"nutrients per calorie\", which is how that expression is generally understood in the scientific literature. I think this is also the most relevant metric when comparing how much \"bang for your buck\" you get from eating different types of food: if you approach this as a problem of constrained optimization, where you are optimizing for health and nutrient content is regarded as the measure of healthfulness, energy (as measured in calories) rather than, say, volume or weight is ultimately the constraint you are dealing with.</p><p>Perhaps you meant something vaguer by \"nutrient density\", like \"the degree to which a person's diet would move closer to meeting their nutritional needs if a portion of this particular food were added to it\". Depending on how this idea is made more precise, the claim that \"animal products are incredibly nutrient dense\" might become more defensible. But this would need more elaboration and supporting evidence.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "BhpdxTYCeL9CdkLD3", "postedAt": "2023-06-03T14:04:13.026Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I appreciate this post: I think it makes progress in a conversation that can sometimes be an elephant in the room.</p><p>An experience I once had, which I bring up to illustrate how the state of this conversation has real effects on the ground, involved an EA—someone in a hiring position—saying that they are suspicious of x-risk-focused people who aren't vegan. Attitudes like this within EA are harmful, in my opinion. The thesis put forward in this post, that veganism entails at least some trade-offs, seems clearly true to me, and I think that a dynamic—I'm not sure how prevalent this dynamic might be—of EAs feeling pressured into being vegan when really the trade-offs for them aren't worth it, is unhealthy.</p><p>(For what it's worth, I'm not a vegan, though I was vegan in the past for around a year.)</p>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "gTzqTf6h2Kaaqf9ix", "postedAt": "2023-06-03T15:05:05.468Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I appreciate the extensive time and effort you've put into this post/project, and I also find the framing odd and potentially misleading. Health risks change when someone stops eating animal products, but the health risks of a vegan diet are substantially less bad than the health risks of a standard diet.<br><br>I believe you <a href=\"https://www.lesswrong.com/posts/Wiz4eKi5fsomRsMbx/change-my-mind-veganism-entails-trade-offs-and-health-is-one?commentId=uh8w6JeLAfuZF2sxQ\">overstate the risks of nutrient insufficiency generally</a> and largely fail to engage with the health ramifications of animal product consumption. The \"trade-off\" is a possible increased risk of nutrient deficiency and <strong>decreased</strong> risk of a host of pervasive and debilitating health issues. If option A is \"the nutrient deficiencies you found in <a href=\"https://forum.effectivealtruism.org/posts/LwdcFT5MwiyS5TqLr/lessons-learned-from-offering-in-office-nutritional-testing#Test_Results:~:text=With%20those%20caveats,is%20no%20point)\">previous research</a>, such as iron and Vitamin D, which can have palpable effects if left unaddressed\" and option B is \"the <a href=\"https://lpi.oregonstate.edu/mic/micronutrient-inadequacies/overview\">standard risk of nutrient insufficiencies/deficiencies</a> and an increased for <a href=\"https://pubmed.ncbi.nlm.nih.gov/32889521/#:~:text=In%20the%20process%2C%20consumption%20of,%2C%20obesity%2C%20and%20other%20disorders.\">cardiovascular disease, cancer, diabetes, obesity</a>, and foodborne illness,\" I think most people would readily opt for option A. All else equal and ethics aside, I'd personally rather take some supplements than increase my risk of cancer or salmonella or E. coli.<br><br>The \"trade-off,\" as a result, ends up skewing in a positive direction for most people switching from e.g. the <a href=\"https://nutritionfacts.org/topics/standard-american-diet/\">Standard American Diet</a> to a vegan diet; the vegan diet just comes with new, readily addressable, and substantially less scary risks.</p><p>People should pay attention to their nutrition. They should e.g. get blood tests at their yearly checkups. And no one should act like veganism is a silver bullet to all health issues. But I find this post overall misleading.</p>", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "zdG4ppB7RkeYEmk2G", "postedAt": "2023-06-03T19:52:30.870Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p><i>Writing this as a separate comment to my </i><a href=\"https://forum.effectivealtruism.org/posts/3Lv4NyFm2aohRKJCH/change-my-mind-veganism-entails-trade-offs-and-health-is-one?commentId=BhpdxTYCeL9CdkLD3\"><i>earlier one</i></a><i>, since it's on a different tack.</i></p><p>A crux for me, which isn't in the post, is the effect of a vegan diet on productivity.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8vj9pvmuzrv\"><sup><a href=\"#fn8vj9pvmuzrv\">[1]</a></sup></span>&nbsp;(I imagine this effect routes through health.)</p><p>A not-unreasonable chain of reasoning, in my view: if one works in x-risk reduction, and one knows that consuming meat improves one's productivity, then one could see oneself as morally permitted—obligated, even—to eat meat.</p><p>I'm aware that this argument is profoundly icky and arrogant,&nbsp;and that someone who employs it in their dietary choices may be falling foul of motivated reasoning. However, I also think there's something true here which calls into question the strength of some claims, including <a href=\"https://forum.effectivealtruism.org/posts/3Lv4NyFm2aohRKJCH/change-my-mind-veganism-entails-trade-offs-and-health-is-one?commentId=R6r2b4swfGLByuJot\">above</a>—currently the top comment—in this comments section: \"The idea that the potential human health benefits of meat consumption could possibly be decisive on the question of whether it's ethical to eat meat is a fantasy.\" (To be clear, I do empathize with the emotion behind the claim.)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8vj9pvmuzrv\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8vj9pvmuzrv\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm a little worried that I'll receive some backlash for this comment. Especially given how I expect those who self-select into reading this post, and engaging in the comments, will be disproportionately vegan, even by EA standards. Nevertheless, I think if nobody speaks up to surface this crux then that will be to the detriment of our community's <a href=\"https://forum.effectivealtruism.org/topics/scout-mindset\">scout mindset</a>. (Edited to add: A friend points out that I could have used an anonymous account. This did not occur to me. My friends are wiser than I.)</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "zFZHwz5jvChZScEo6", "postedAt": "2023-06-03T22:25:17.522Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>The argument isn’t about that at all, and I think most people would agree that nutrition is important.</p></blockquote><p>It sounds like you're misreading the point of the article.</p><p>The entire point of this article is that there are vegan EA leaders who downplay or dismiss the idea that veganism requires extra attention and effort. It doesn't at all say \"there are some tradeoffs, therefore don't be vegan.\" &nbsp;(it goes out of the way to say almost the opposite)</p><p>Whether costs are worth discussing doesn't depend on how large one cost is vs the other – it depends on whether the health costs are large enough to hurt people, destroy trust, and (from an animal welfare perspective), whether the human health costs directly cause more animal suffering via causing ~30% of vegans to relapse.</p>", "parentCommentId": "qaE875imfkG2pNzQe", "user": {"username": "Raemon"}}, {"_id": "rrhMDeTGJKAJGenJg", "postedAt": "2023-06-03T22:54:44.069Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I don't have links on hand but this gets brought up fairly often, or at least it used to. One reason I wrote that is that some of the responses to that concern were really dismissive, and the discussions were too complicated and heated to debate it on the object level.&nbsp;</p><p>You might also be interested in <a href=\"https://acesounderglass.com/2023/01/10/iron-deficiencies-are-very-bad-and-you-should-treat-them/\">this post of mine,</a> examining the cognitive effects of iron deficiency (not vegan specific)</p>", "parentCommentId": "zdG4ppB7RkeYEmk2G", "user": {"username": "Elizabeth"}}, {"_id": "Bn6Z4cow83djMHpuy", "postedAt": "2023-06-03T23:06:14.978Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I 100% agree the Standard American Diet is shit. I also think \"take some tests and then pills\" fixes most of the problems of veganism for most people (although I'm not holding effort constant). If Standard American Diet had as easy a fix I would absolutely be talking about that, but it mostly doesn't, because fixing Standard American Diet involves giving up things people like or eating things they don't. &nbsp;When I find potential improvements to SAD that are anywhere near as easy to implement or evaluate as \"take some tests and some pills\", I'm very quick to <a href=\"https://acesounderglass.com/2020/05/10/product-endorsement-enof/\">talk</a> about <a href=\"https://twitter.com/acesounderglass/status/1640108712886173696\">them</a>.</p><p>But I see a lot of vegans who aren't taking the tests or pills, who didn't know that was necessary, and are hurt because of it. And when I try to talk about and fix the problem, by providing tests and pills, people tell me I shouldn't because <a href=\"https://www.lesswrong.com/posts/rRkhATuztvfMLFhT8/vegan-nutrition-testing-project-interim-report?commentId=Z26fPExJJyni69Nq8\">it might discourage veganism</a>.&nbsp;</p>", "parentCommentId": "gTzqTf6h2Kaaqf9ix", "user": {"username": "Elizabeth"}}, {"_id": "wpTpbdDJqckhEy8Jt", "postedAt": "2023-06-04T01:20:06.757Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Another question raised by your post is the point at which someone who is experiencing certain symptoms (e.g., fatigue) yet has normal lab levels and is on supplements should consider a trial of reintroducing a moderate amount of animal products in their diet. Nutrition is complex, and modern applied understandings often seem to be reductionistic -- so establishing normal lab values doesn't clearly rule out a dietary contribution. My answer would be that this is a conversation someone should be having with their treating physician, which is one of the reasons why I don't like sources that come across as dismissive about taking medical advice, or that suggest that adverse health consequences are impossible.&nbsp;</p><p>I can't answer that question, but would note that a elaborate medical workup can be financially and logistically arduous, can take a significant amount of time during which the person doesn't have any relief, and can involve some risk. If no reversible cause is found for the symptom, and you're stuck with symptom management -- those treatments may have side effects and risks.</p>", "parentCommentId": "Bn6Z4cow83djMHpuy", "user": {"username": "Jason"}}, {"_id": "zvXBrkiinDPtjhK7G", "postedAt": "2023-06-04T01:50:06.144Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>(The following example is not meant to \"gotcha\" you, but to illustrate an analogous situation where the other perspective hits closer to home for most people.)</p><p>Let's say there was an AI safety researcher who de-stresses each morning by kicking a homeless person in the face. Kicking that homeless person each morning helps the researcher focus and be more productive in his day. Is the researcher then morally obligated to continue kicking the homeless person in the face each morning? (What a coincidence that the choice which is easy and convenient happened to be the morally obligatory one!)</p><p>Of course, it's important to note the difference between this example and meat consumption. From a consequentialist perspective, eating meat on a typical day causes significantly more harm than kicking a homeless person in the face.</p>", "parentCommentId": "zdG4ppB7RkeYEmk2G", "user": {"username": "Ariel Simnegar"}}, {"_id": "4qid6dx2neAestfnH", "postedAt": "2023-06-04T02:46:05.822Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I've fixed this on my blog but LW's editor is being difficult (and because this is a cross-post I can only fix it there), I've pinged the team about getting access to the right editor. &nbsp;I wish I'd included your links because it's always good to quote people more accurately. I'm not sure it matters materially, because I preemptively agreed that overconsumption of animal products has its own risks.&nbsp;</p><p>I think most of the nutritional harm would be mitigated if vegan advocates said \"all large dietary changes have challenges, here's an easy guide to starting\" in a way people believed and followed up on (and no one loudly argued to the contrary, which at one point was very widespread within EA). I would still think there was something important in acknowledging that it can't work for everyone, and thus the <a href=\"https://forum.effectivealtruism.org/posts/3Lv4NyFm2aohRKJCH/change-my-mind-veganism-entails-trade-offs-and-health-is-one?commentId=R6r2b4swfGLByuJot\">strongest forms</a> of vegan advocacy will leave those people malnourished. I can respect arguments that this is a regrettable necessity, but not blindness to it. &nbsp;I would also still see value in arguing about the ideal diet, or more properly how to discover an individual's ideal diet, which is so complicated and has so much variation between people. But I wouldn't have put nearly this level of work in if I didn't see people being harmed.&nbsp;</p>", "parentCommentId": "Jpno9A9mhphnGehxc", "user": {"username": "Elizabeth"}}, {"_id": "9DgDmMdfyEjbencG7", "postedAt": "2023-06-04T03:01:10.082Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thanks for laying out your cruxes so clearly, let me respond individually.&nbsp;</p><blockquote><p>I don't see conclusive evidence that a vegan diet is less healthy than some other diet. While it is plausible that consuming small quantities of animal products could be more healthy compared to a strictly vegan diet, the evidence supporting such claims doesn't seem conclusive to me</p></blockquote><p>I think this is a reasonable state to be in. The data isn't conclusive, except for people who have other constraints that render veganism impossible (godspeed, <a href=\"https://web.archive.org/web/20220422010949/https://chrislakin.com/carnivore\">bear diet guy</a>). My best guess is small amounts of animal products are helpful even above the perfect vegan diet, and that allowing them makes planning easier, but I could definitely be convinced otherwise- that's why this is \"change my mind\" and not \"agree with me right now\".</p><blockquote><p>In other contexts, such as promoting alternative diets or lifestyles, it does not strike me as dishonest if individuals omit mentioning the non-health costs</p></blockquote><p>I mostly agree with this, with a few caveats. The larger one is \"okay, but don't <a href=\"https://www.jefftk.com/p/two-kinds-of-vegan\">shout people down</a> when they bring it up\" (which was a common thing in EA for a while).&nbsp;</p><p>The other is that, while I agree no one person is obligated to take cost into consideration, I think vegan advocacy would in general benefit from considering a wider variety of people with a wider variety of constraints. This doesn't mean trumpeting \"it's very expensive!!\", but it might mean not assuming fake meats are a trivial solution for everyone. No one document can be for everyone, but if you only produce one work for one demographic you can't be surprised when others don't listen very hard.</p><blockquote><p>We should stick precisely to the statement of Academy of Nutrition and Dietetics, and keep mentioning this in our conversations about veganism:</p><p>\"It is the position of the Academy of Nutrition and Dietetics that appropriately planned vegetarian, including vegan, diets are healthful, nutritionally adequate, and may provide health benefits for the prevention and treatment of certain diseases.\"</p><p><br>&nbsp;</p></blockquote><p>I think it's true as written, but \"appropriately planned\" is an important caveat many people ignore to their detriment, and \"adequate\" is a low bar. I also wish they caveated \"for many people\", instead of the implied \"literally everyone\".&nbsp;</p>", "parentCommentId": "hNnyt8m3zkiSaiNHA", "user": {"username": "Elizabeth"}}, {"_id": "TqtsruGuyqQFxdjxx", "postedAt": "2023-06-04T12:57:06.870Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Firstly, on where I think you and I agree:</p><ul><li>Under “normal” circumstances it is morally bad to kick homeless people, and monstrous to eat animals.</li><li>Even if AI alignment and deployment goes well, the value of the future will be very negative if factory farms continue to exist.</li></ul><p>The premise in my parent comment is that, for at least some people, a diet that includes meat leads to higher productivity. This premise is an empirical claim which I believe to be true, though I imagine some might disagree and get off my chain of reasoning at this point.</p><p>The conclusion in my parent comment, that eating meat is morally permissible (and perhaps even obligatory) for at least some people, is animated by the distinct non-normality of the circumstances we may be in. Namely, that we appear to find ourselves at the&nbsp;<a href=\"https://forum.effectivealtruism.org/topics/hinge-of-history\"><u>hinge of history</u></a>, where a major bottleneck is productive time spent by people trying to positively influence the long-term future. Nonetheless, “the hinge of history is now” is a big claim, and some might disagree and get off my chain of reasoning at this point.</p><p>For those still with me, there are now (various levels of) consequences to consider. My conception:</p><ol><li>First order. Simply weigh up the disvalue of face-kicking or animal slaughtering against the expected value from more productive time spent on reducing x-risk. (Some may stop here. Those who stop here are most likely to view meat-eating as obligatory.)</li><li>Second order. Is the kind of world where people who may have an outsize influence on the future bite bullets like kicking people and eating sentient beings the kind of world we want to be living in? (Most who’ve stayed with me this far probably stop here.)</li><li>[Known unknowns. For example, which action—biting the bullet or not—puts me in a larger pool of&nbsp;<a href=\"https://longtermrisk.org/msr\"><u>evidentially cooperating</u></a> agents across the multiverse? Also, if the&nbsp;<a href=\"https://en.wikipedia.org/wiki/Simulation_hypothesis\"><u>simulation hypothesis</u></a> is true, then our creators might turn us off once the hinge of history is over, which would mean that the near-term is what matters.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefr3a6zjua78\"><sup><a href=\"#fnr3a6zjua78\">[1]</a></sup></span>]</li><li>[Unknown unknowns. See “<a href=\"https://forum.effectivealtruism.org/topics/cluelessness\"><u>Cluelessness</u></a>”.]</li></ol><p>2 is hard to quantify, and 3 and 4 are deep in galaxy brain territory. The decision algorithm I employ at this point is: “If being vegan is not costly, then be vegan. If being vegan is costly, then don’t be vegan.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefqvjnebr8a5\"><sup><a href=\"#fnqvjnebr8a5\">[2]</a></sup></span>”</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnr3a6zjua78\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefr3a6zjua78\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I’ve yet to see someone express a credence on us being in a simulation that doesn’t seem very arbitrary. And I think it’s not impossible that, after&nbsp;<i>a lot</i> of reflection, we could converge on a credence of ~1. (A credence of basically 1 is needed, in my view, to override the <a href=\"https://forum.effectivealtruism.org/topics/universe-s-resources\">vast expected value</a>—assuming one does not subscribe to a&nbsp;<a href=\"https://longtermrisk.org/cause-prioritization-downside-focused-value-systems/\"><u>downside-focused value system</u></a>—of the long-term future, if there is a long-term future.)</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnqvjnebr8a5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefqvjnebr8a5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Unfortunately, in my case being vegan turned out to be costly. I look forward to mass-produced cultured meat (or, better still, to being a mind upload, whereupon I’d need only consume electricity).</p></div></li></ol>", "parentCommentId": "zvXBrkiinDPtjhK7G", "user": {"username": "Will Aldred"}}, {"_id": "G7ZK76h99Nrv6GCEq", "postedAt": "2023-06-04T16:10:22.644Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p><a href=\"https://slatestarcodex.com/2019/12/11/acc-is-eating-meat-a-net-harm/?utm_source=substack&amp;utm_medium=email\">https://slatestarcodex.com/2019/12/11/acc-is-eating-meat-a-net-harm/?utm_source=substack&amp;utm_medium=email</a></p><p>(a good number of people feel just as fine on a vegan diet as a non-vegan one [<a href=\"https://www.theguardian.com/commentisfree/2023/sep/07/scientific-self-experiment-vegan-diet-meat-diet\">example</a>] - most of the potential \"costs\" are in terms of energy/vitality which they will feel if they feel it). I am ovo-vegetarian and I have reasonably high iron levels myself. From the limited studies available, vegans have lower ACM than even vegetarians do.</p><p>It's important for people to get an ION Panel to test for amino acid deficiencies (these are hard to order w/o a doctor)</p><blockquote><p>Scientists found three genes linked with vegetarianism and another 31 genes that are potentially associated.</p><p>Several of these genes, according to the study, are involved in lipid (fat) metabolism and/or brain function including two of the top three (NPC1 and RMC1).</p><p>“My speculation is there may be lipid component(s) present in meat that some people need. And maybe people whose genetics favor vegetarianism are able to synthesize these components endogenously,” Dr Yaseen said.</p></blockquote><p>=====</p><blockquote><p>4.2. Long Term Health Outcomes</p><p>Estimating the long-term health outcomes of eating certain things is difficult because food is highly bound up in the culture we live in and culture correlates to just about every health outcome you could possibly imagine. Even less conveniently, nutritional science is highly anti-inductive; if a particular food group is identified as being healthy people with an interest in being healthy flock to that food group, and people with an interest in being healthy are likely to be healthy for a bunch of reasons regardless of diet.</p><p>So here’s a nice headline result: <a href=\"https://www.researchgate.net/publication/293329136_Vegetarian_vegan_diets_and_multiple_health_outcomes_A_systematic_review_with_meta-analysis_of_observational_studies\"><u>vegetarians have</u></a> less heart disease with extremely high certainty, and probably less cardiovascular disease and cancer too. Most of the studies in that meta-analysis have had some of the really obvious stuff adjusted away (race, income, etc.) but not all studies adjust for all confounders, and we should be <a href=\"https://slatestarcodex.com/2014/04/26/stop-confounding-yourself-stop-confounding-yourself/\"><u>cautious about</u></a> trusting studies that ‘adjust for confounders’. If you ignore confounders then the answer is clear; eating vegetarian is good for you in every single way we can measure (including, possibly, circulating <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/19087438\"><u>testosterone</u></a> in defiance of stereotypes about meat eaters!).</p><p><a href=\"https://slatestarcodex.com/blog_images/ACMeat2.png\"><u><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/G7ZK76h99Nrv6GCEq/p3ei2xauko2wzuy77dqg\" alt=\"ACMeat2.png\"></u></a></p><p>If you are interested in confounders: There are a handful of cool natural experiments, taking groups with reasons to eat certain food but not bother with the associated healthy lifestyles, which are the closest we are likely to come to a true experiment in this area. In particular, the <a href=\"https://publichealth.llu.edu/adventist-health-studies\"><u>American Adventist Health Studies</u></a> are pretty much state of the art in the field from what we can see. Adventists have quite unique dietary habits, brought about by religious prohibitions on certain foodstuffs which some Adventist churches follow and some don’t. Consequently, if you are an Adventist you are functionally ‘randomized’ into different food-eating conditions depending on which church you attend, and this randomization can be exploited by researchers.</p><p>Based on the Adventist Health Studies, a vegetarian diet increases life expectancy by <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4144107/\"><u>around 3.6 years</u></a>. The less meat you eat, the healthier your BMI and the less likely you are to get <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4144107/\"><u>diabetes</u></a>.</p><p>Overall we might expect lacto-ovo vegetarians to have a health related quality of life around 10% better than a meat eater, with most of this benefit being apparent 20 years after making the switch to a vegetarian diet.</p><p>You could complicate this picture a lot (especially by introducing future discounting) but we think the general principle that if you value life-years towards the end of your life you should likely go vegetarian is well demonstrated by the data:</p><p><a href=\"https://slatestarcodex.com/blog_images/ACMeat3.gif\"><u><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/G7ZK76h99Nrv6GCEq/b0o6fxhelrrmcvuilzzi\" alt=\"ACMeat3.gif\"></u></a></p><p>One final point on how meat might affect your lifespan; there is a growing awareness of the fact that industrially produced meat is an ideal breeding ground for <a href=\"https://www.sciencedirect.com/science/article/pii/S0140673612616845\"><u>zoonotic disease</u></a>, and that those diseases can mutate and jump to humans very quickly. Previous pandemics such as H1N1 (‘swine flu’) and H5N1 (‘bird flu’) may have originated with farmed animals, and were rapidly spread by the close contact of unhealthy animals and global nature of the meat supply chain. At the margin, eating meat probably increases the probability of a global pandemic but there isn’t good evidence on how much your individual consumption affects things at the margin.</p><p><i>In the model we take the Adventist study result at almost face value, estimating that eating vegetarian will increase your lifespan by 3 years, and include constant low costs due to possible nutritional deficiency and moderate benefits to health that appear later in life.</i></p></blockquote><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "InquilineKea"}}, {"_id": "gkvDPaTDAwuzxBiZo", "postedAt": "2023-06-04T17:16:49.358Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thanks for the breakdown of effects! It was helpful for identifying our cruxes. Ignoring unknowns<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefd044gz12il5\"><sup><a href=\"#fnd044gz12il5\">[1]</a></sup></span>, there are two uncertain quantities under consideration:</p><ol><li>The expected value of veganism continually reminding you of the importance of caring about others.<ol><li>Veganism has substantially increased my dedication to my altruistic work, and I think it's increased the likelihood that I'll stay altruistic and continue to contribute to the most important causes for the long term.</li><li>Being vegan shows others that you take altruism seriously, and makes you more likely to inspire others to take altruistic steps in their own lives, possibly including transitioning to direct work in x-risk reduction. This can be especially impactful if you're well-positioned to influence the long-term future.</li></ol></li><li>The expected loss in productivity from veganism.</li></ol><p>I find quantity 1 &gt;&gt; quantity 2, and I think you find quantity 2 &gt; quantity 1.</p><p>As a completely separate point, I also think that there are <i>far </i>lower-hanging fruit for maximizing productivity than eating meat, and the fact that some people pick the meat-eating fruit rather than the lower-hanging fruit is evidence of motivated reasoning.</p><p>I think being vegan makes me lose 5 minutes of productivity per week. That's 30 seconds of taking supplements each morning * 7 days per week = 3.5 minutes, plus 90 seconds of reading grocery labels to make sure they don't contain animal ingredients.</p><p>If I wanted the same productivity gain, I could spend 5 fewer minutes playing online chess, or watching videos about future megastructures, or reading Wikipedia. So if I were hyperfocused on optimizing productivity and cared about nothing else, it'd still be pretty weird for me to conclude that eating meat should be the first change to make.</p><p>I'll close with a relevant quote:</p><blockquote><p>What we find important can be fickle and more dependent on environmental cues than we might think. As a result, we may want to embed ourselves in physical and social environments that can best foster our altrustic work. While productivity is important, we also need to keep our lives balanced, both for our long-term sustainability and because of the benefits of learning about many fields. <strong>Sometimes we do selfish things, and it's better to admit this and move on than distort our beliefs to try to justify it.</strong></p></blockquote><ul><li>Brian Tomasik, <a href=\"https://reducing-suffering.org/staying-altruistic-for-the-long-term/\">\"Staying Altruistic for the Long Term\"</a></li></ul><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnd044gz12il5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefd044gz12il5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I think the unknowns you listed are quite important, though I feel quite clueless when speculating on them. If we knew for certain that our simulators would turn us off once the hinge of history was over, I think our priority would shift to reducing as much present-day suffering as possible, which I think in practice means prioritizing animal welfare. On the other hand, I think being a simulation should increase your credence in theories where only you and perhaps those close to you are actually conscious, and others are low-fidelity constructs which have much less expected moral importance.</p></div></li></ol>", "parentCommentId": "TqtsruGuyqQFxdjxx", "user": {"username": "Ariel Simnegar"}}, {"_id": "xNuf6ZHiPcFMAzyEr", "postedAt": "2023-06-04T18:12:41.972Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/will-aldred?mention=user\">@Will Aldred</a> , <a href=\"https://forum.effectivealtruism.org/users/ariel-simnegar?mention=user\">@Ariel Simnegar</a> - I should have shut this down at the beginning. \"Is it morally bad but worth it?\" is an argument that has happened several times on EAF already, and I ask you to not rehash here. This post is for quantifying the health effects (in both directions).&nbsp;</p><p>&nbsp;If you really want to, please feel free to link to a different post or shortform</p>", "parentCommentId": "zdG4ppB7RkeYEmk2G", "user": {"username": "Elizabeth"}}, {"_id": "3S3ZGkbAojNsvAGoA", "postedAt": "2023-06-04T18:26:27.601Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>most of the potential \"costs\" are in terms of energy/vitality which they will feel if they feel it</p></blockquote><p>&nbsp;</p><p>I think there are many people for whom this is not true.* Many of even the most-affected people don't keel over the second they decide to identify as vegan; it takes time for nutrient stores to deplete. If it happens slowly enough they may never notice, or not notice until it becomes life-ruiningly severe (obviously this effect isn't unique to veganism, and many of the ill effects of meat are very hard to notice). I've also seen vegans who knew they had serious energy issues just... not consider diet as a hypothesis, and not had any vegan friends suggest it either.</p><p>I want to be fair, so I should note that in one case I'm thinking of there's some evidence veganism wasn't the problem. &nbsp;It's the person <a href=\"https://acesounderglass.com/2023/01/16/vegan-nutrition-testing-project-interim-report/\">here</a> who tested deficient on almost everything including vitamin C, which is just not a problem a plant-based diet should cause. But something has gone wrong if anyone with fatigue issues doesn't <i>consider</i> dietary causes, much less a vegan.&nbsp;<br><br>*I feel like I should quantify many here but it's hard because by definition, everyone I see with a fatigue issue either hasn't noticed or doesn't know how to fix it. People who notice minor energy drops and immediately fix them drop out from the sample.&nbsp;</p>", "parentCommentId": "G7ZK76h99Nrv6GCEq", "user": {"username": "Elizabeth"}}, {"_id": "yGL2pRBzYpYobyPWF", "postedAt": "2023-06-04T18:35:56.867Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thank you for the link, that adventist data is indeed beautiful. But if I'm reading it correctly it's comparing omnivores to vegetarians, not vegans. I think eggs and milk handle most of the issues caused by veganism, so this doesn't update me on that front.&nbsp;</p>", "parentCommentId": "G7ZK76h99Nrv6GCEq", "user": {"username": "Elizabeth"}}, {"_id": "q2p6jgY9C9r4fpxtG", "postedAt": "2023-06-04T18:49:09.651Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thanks for this - this and an earlier post you wrote have made me, as it were, examine my privilege, since I'm one of the lucky vegans who genuinely seems to pay minimal costs, of any kind, from being vegan. This might be a combination of being taught good nutrition principles by my (pescatarian) parents, lucky genetics, living in vegan-friendly places, and having a reasonable budget for food. I'm in favour of people going some but not all of the way to vegan, if full veganism is massively costly and especially if it gives them health issues or makes them feel bad and undernourished day to day. I'm interested to hear people's stories (both positive and negative) about dietary change and what was hard about it, what they wish they'd known, etc</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "cJydGWvcvsf4kigza", "postedAt": "2023-06-04T19:01:04.933Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>My major concern is that this article is too one-sided: it mentions the difficulties/trade-offs of vegan diets, without mentioning difficulties/trade-offs of non-vegan diets. Eating a non-vegan diet is also not easy. Some examples of what you have to tell to people who want to eat animal products:</p><ul><li>Don’t eat too much meat, that is unhealthy. You can look on some websites how much gram per day is too much, according to your age and bodily needs.</li><li>Fry the meat well enough, because (almost all) meat can contain harmful bacteria. Also wash well enough all the cutlery, the knife, the chopping board and everything that was in contact with the meat, because of contamination risks.</li><li>But don’t fry your meat too much. Frying meat can produce carcinogenic substances. Especially when there is a dark or black crust visible, the meat was fried too much. For the same reason, avoid barbeque and flambé. Heating up meat in the microwave oven is not good enough to kill the bacteria. If you don’t know how to cook your meals properly, you can eat vegan meat alternatives: they can be safely eaten even uncooked (or used in the microwave oven).</li><li>Don’t drink unpasteurized milk.</li><li>Animal products don’t contain dietary fiber, so make sure to eat a proper source of dietary fiber.&nbsp;</li><li>Meat doesn’t contain vitamin C, so make sure to eat a proper source of vitamin C. There are websites that tell you which products contain vitamin C.&nbsp;</li><li>Avoid processed meat: that is unhealthy. You can look on some websites what counts as processed meat. I think bacon and ham also count as processed.</li><li>Many meat products, especially fresh products, don’t show an expiration date on the package. You can look for some information on the internet how to learn to detect when your meat is expired. If you don’t know how to smell expired meat, don’t keep your meat too long in the fridge, or eat plant-based meat alternatives as they show a best before date on the package.</li><li>In many cases, cheaper meat products may be unhealthier than more expensive meat products. There is often a trade-off between price and health/quality of the meat product. Consult a nutritionist to figure out the best diet according to your budget.&nbsp;</li><li>Almost none of the meat eaters had a recent blood test to check if they have for example too much bad cholesterol that could be the result of eating too much animal products. They also don’t know if their bodies can properly absorb for example the iron in the meat. It is recommended to visit a nutritionist and ask for a blood test.&nbsp;</li><li>Some people are allergic to milk, fish, and other animal products. You can consult your doctor if you don’t know about your potential allergies.</li></ul><p>These examples should be enough to show that eating animal products is equally difficult as eating vegan. My worry is that focusing too much on vegan nutrition issues (telling people a lot about how to eat a healthy vegan diet), might give people the impression that veganism is difficult, and then they continue eating animal products and causing harm to animals. But focusing too little might be counterproductive as well, because then people don’t eat enough healthy vegan diets, they become ill and revert back to animal products.&nbsp;</p><p>So I recommend that when you tell potential vegans how to eat a healthy vegan diet, you also mention the health concerns related to animal products, to make clear that eating a healthy non-vegan diet is equally difficult or easy.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Stijn"}}, {"_id": "HtmKssekuy2BPgFmL", "postedAt": "2023-06-04T21:18:45.963Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thanks for your constructive reply.</p><blockquote><p>I think being vegan makes me lose 5 minutes of productivity per week.</p></blockquote><p>Okay, it looks like this is where we've been talking past each other. I agree with you that if being vegan costs only a few minutes per week, then switching to eat meat would be a bizarre thing to do.</p><p>For me, when I spent a year being vegan, I felt near-constantly unsatiated and low on energy, irritable and mentally slow.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefznuakhx1wyh\"><sup><a href=\"#fnznuakhx1wyh\">[1]</a></sup></span>&nbsp;My guess was that this was costing me as much as 30% of my productivity, or ~18 hours per week. The internal experience for me was something like, “Okay, I’ve already changed jobs to try to do good directly, which involved life sacrifices, and I already donate. Adding this being-hungry-and-irritable-the-whole-time thing on top is a step further than I’m willing to go. In fact, if I take this step, I might be more likely to burn out and become disillusioned with all this altruism business.”</p><p>It may well be that I’m unusually ill-suited to a vegan diet,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreff030d9g0bxi\"><sup><a href=\"#fnf030d9g0bxi\">[2]</a></sup></span>&nbsp;and that my original comment reflects&nbsp;<a href=\"https://www.lesswrong.com/tag/typical-mind-fallacy\"><u>typical mind fallacy</u></a> on my part. When I wrote that comment, I was non-consciously assuming that: 1) for a nontrivial number of people working directly in x-risk reduction, being vegan would, or does, incur a cost on the order of a few hours (as opposed to a few minutes) of productive work per week; 2) struggles like mine are common enough stories<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvqdp28pobx\"><sup><a href=\"#fnvqdp28pobx\">[3]</a></sup></span>&nbsp;in vegan and vegan-adjacent circles that readers would understand 1, or something close to 1, to be my background assumption.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnznuakhx1wyh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefznuakhx1wyh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>And I <i>did</i> try hard to make the vegan diet work. I was tracking all my vitamins and nutrients and consuming ample calories. I'd also put in an \"upfront\" effort of at least 10 hours of reading about vegan diet pitfalls (and how to avoid them), researching supplements, and experimenting with vegan foods and recipes.</p><p>(Possibly also worth mentioning: 1| Nowadays, I'm reducetarian, at 60% meat consumption relative to before my failed vegan conversion. 2| I expect my non-vegan diet, both now and before, is 99th percentile for healthfulness (i.e., it's nothing close to the average British or American diet; I was an athlete in college and received substantial nutrition coaching). I mention this to acknowledge that my vegan diet was up against a very high—perhaps unfairly high—baseline.)</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnf030d9g0bxi\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreff030d9g0bxi\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In&nbsp;<a href=\"https://forum.effectivealtruism.org/topics/moral-trade\"><u>moral trade</u></a> terms, being vegan is probably far from my comparative advantage.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvqdp28pobx\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvqdp28pobx\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I remember coming across a large (~20k members) Reddit community at the time—I think it might have been r/AntiVegan—which, as best I could tell, was partially (mostly?) made up of former vegans. These former vegans would recount the negative health effects they’d experienced while being vegan. I took this as pretty strong evidence that (plenty of) other people out there had had as rough a time trying to be vegan as I did.</p></div></li></ol>", "parentCommentId": "gkvDPaTDAwuzxBiZo", "user": {"username": "Will Aldred"}}, {"_id": "ezsuN8c94RWFYfWvg", "postedAt": "2023-06-04T21:20:28.102Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>(Also, this is very tangential to the main thread, but I spotted in your footnote:</p><blockquote><p>I think being a simulation should increase your credence in theories where only you and perhaps those close to you are actually conscious, and others are low-fidelity constructs which have much less expected moral importance.</p></blockquote><p>This is likely incorrect, I believe, for the reasons Bostrom gives:</p><blockquote><p>In addition to ancestor-simulations, one may also consider the possibility of more selective simulations that include only a small group of humans or a single individual. The rest of humanity would then be zombies or “shadow-people” – humans simulated only at a level sufficient for the fully simulated people not to notice anything suspicious. It is not clear how much cheaper shadow-people would be to simulate than real people. It is not even obvious that it is possible for an entity to behave indistinguishably from a real human and yet lack conscious experience. Even if there are such selective simulations, you should not think that you are in one of them unless you think they are much more numerous than complete simulations. There would have to be about 100 billion times as many “me-simulations” (simulations of the life of only a single mind) as there are ancestor-simulations in order for most simulated persons to be in me-simulations.</p><p>—<a href=\"https://www.simulation-argument.com/simulation\">Are You Living in a Computer Simulation?</a></p></blockquote><p>Nonetheless, I do agree with the other point you make:</p><blockquote><p>If we knew for certain that our simulators would turn us off once the hinge of history was over, I think our priority would shift to reducing as much present-day suffering as possible, which I think in practice means prioritizing animal welfare.</p></blockquote><p>)</p>", "parentCommentId": "gkvDPaTDAwuzxBiZo", "user": {"username": "Will Aldred"}}, {"_id": "LBxhTD6td6yapH7GH", "postedAt": "2023-06-04T22:12:04.385Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I think there's a reasonable case that, from a health perspective, many people should eat less meat. But \"less meat\" !== \"no meat\".&nbsp;</p><p>Elizabeth was pretty clear on her take being:</p><blockquote><p>Most people’s optimal diet includes small amounts of animal products, but people eat sub-optimally for lots of reasons and that’s their right.</p></blockquote><p>i.e. yes, the optimal diet is small amounts of meat (which is less than most people eat, but more than vegans eat).</p><p>The article notes:</p><blockquote><p>It’s true that I am paying more attention to veganism than I am to, say, the trad carnivore idiots, even though I think that diet is worse. But veganism is where the people are, both near me and in <a href=\"https://www.statista.com/statistics/993725/consumer-diet-share-us/\">the US as a whole</a>. Dietary change is so synonymous with animal protection within Effective Altruism that the <a href=\"https://forum.effectivealtruism.org/topics/dietary-change\">EAForum tag</a> is a wholly-owned subsidiary of the animal suffering tag. At a young-EA-organizer conference I mentored at last year, something like half of attendees were vegan, and only a handful had no animal-protecting diet considerations. If keto gets anywhere near this kind of numbers I assure you I will say something.</p></blockquote>", "parentCommentId": "cJydGWvcvsf4kigza", "user": {"username": "Raemon"}}, {"_id": "AxXgrorS7gvR7Fkt4", "postedAt": "2023-06-05T01:43:27.549Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>This is a really good question. It's taking a fair amount of time to formalize my answer but I wanted to let you know I was working on it.</p>", "parentCommentId": "f3a3DvsNjRtwCJ76W", "user": {"username": "Elizabeth"}}, {"_id": "LDfgAiAnax4ZduDP5", "postedAt": "2023-06-05T02:43:17.846Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>My major concern is that this article is too one-sided: it mentions the difficulties/trade-offs of vegan diets, without mentioning difficulties/trade-offs of non-vegan diets</p></blockquote><p>&nbsp;</p><p>I'd like to talk about this post's goals and why it seemed like the best route to them.</p><p><a href=\"https://acesounderglass.com/2023/05/13/lessons-learned-from-offering-in-office-nutritional-testing/\">Last year</a> I gave nutritional tests and supplement suggestions. This was focused on vegans but not exclusive to them. When I wrote up my results I got responses, <a href=\"https://www.lesswrong.com/posts/rRkhATuztvfMLFhT8/vegan-nutrition-testing-project-interim-report?commentId=Z26fPExJJyni69Nq8\">public</a> and private, that felt extremely <a href=\"https://acesounderglass.com/2022/02/07/epistemic-legibility/#:~:text=Epilogue%202%3A%20Epistemic%20Cooperation\">epistemically uncooperative</a>. Some would outright admit that education was necessary for switching to veganism, if only because any major dietary change requires education, but they still thought I should have done a diet-neutral project, or just not mentioned issues with veganism. Some were less explicit, but the things they said only made sense if they believed every single person could smoothly transition to veganism with no effort or trade-off. And I could not get them to present their reasoning for that claim in a legible way.</p><p>The goal of this post was never \"provide comprehensive information about the relative costs and benefits of various diets\". It was \"get the people making a particular claim to spell out their reasoning.\" And this came in the form of a blunt post because my gentler attempts had been rebuffed.&nbsp;</p><p>&nbsp;</p><p>I think your list of reasons animal products can be difficult would be a major hurdle for someone raised in a vegan culture that wanted to start eating meat. I would definitely recommend that person read the carnivore equivalent of veganhealth.org. That doesn't cancel out the difficulty a given omnivore has switching to veganism. Except for the lucky goat people, all serious diets impose trade-offs and require new education, and I find the question of \"which transition requires exactly how much work?\" much less interesting than making sure everyone is properly onboarded to the diet they chose.&nbsp;</p>", "parentCommentId": "cJydGWvcvsf4kigza", "user": {"username": "Elizabeth"}}, {"_id": "fNxwRxnqB5LKNC8na", "postedAt": "2023-06-05T09:55:57.459Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Hi Elizabeth, I'm the co-author of the piece linked above. You're absolutely right we chose to focus on the omnivore-vs-vegetarian comparison, for a variety of different reasons. However, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4191896/\">AHS-2</a> does have some comparisons between omnivores to vegans. From the abstract: \"the adjusted hazard ratio (HR) for all-cause mortality in all vegetarians combined vs non-vegetarians was 0.88 (95% CI, 0.80–0.97). The adjusted HR for all-cause mortality in vegans was 0.85 (95% CI, 0.73–1.01)\". So depending on how strict you are being with statistical significance there's somewhere between a small signal and no signal that veganism is better with respect to all-cause mortality than omnivorism.</p><p>I think AHS is the best data we've got on this topic, but I'd be cautious about over-interpreting it. In my mind the biggest criticism is that Adventists are generally more healthy than the typical American (they do a lot more exercise, avoid alcohol and tobacco etc), which leads to extremely pernicious selection bias. For example, it could be that a vegan diet is much healthier than an omnivorous diet <i>if you are the kind of person who spends a lot of time worrying about your health generally</i>, but the risk of getting the wrong nutrients is so high with a vegan diet that it is harmful to people who are not otherwise concerned about their health. So I'm not confident the very slight improvement in overall mortality from switching from a vegetarian diet to a vegan diet can be judged to be a real effect from AHS alone.</p><p>On the other hand, I think I would be confident enough in the AHS data to say that it shows that veg*nism does not entail a tradeoff on the 'years of life lived' axis. The most conservative reading of the data possible would be that a veg*n diet has no effect on years of life lived, and I think it is probably more reasonable to read the AHS study as likely <i>underestimating</i> the benefits a veg*n diet would give the average person. Obviously 'years of life lived' is not the same thing as 'health' so I'm not saying this is a knock-down argument against your main point - just wanted to contextualise how we were using the data in the linked piece.</p>", "parentCommentId": "yGL2pRBzYpYobyPWF", "user": {"username": "Froolow"}}, {"_id": "R8rq6HGDCffzJY5Jx", "postedAt": "2023-06-05T16:29:24.039Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I think this kind of reasoning (the justification for eating meat) is very dangerous and leads to atrocities like Sam Bankman-Fried's fraudulent behavior. I am very confident that such justifications for meat eating are motivated reasoning. I can't imagine someone is really that more productive and good at saving the future, by eating meat. If someone says that he eats meat because of being more productive in saving the future, for me it is a clear sign of having a bad character, or a weakness of will, and I don't think people with such a weakness of will are good in doing much good.</p>", "parentCommentId": "zdG4ppB7RkeYEmk2G", "user": {"username": "Stijn"}}, {"_id": "tCs3ShCx6JGBwSXic", "postedAt": "2023-06-05T16:46:47.308Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>It seems that you make nothing but a very trivial claim, that if you are used to A, a change from A to B is difficult. But then you frame it like B being difficult. But it is the transition which is difficult, not B itself. As an analogy, let's discuss whether Chinese is difficult. You would say yes, because it is not your native language. It will take some effort for you to learn Chinese. But a Chinese person thinks Chinese is easy, and English is difficult. Who is right? In the end, once you have learned to speak Chinese, it is as easy as most other languages that you have learned. Some languages are objectively more difficult than others (like Dutch is probably more difficult than Afrikaans, and English is more difficult than Esperanto), and for the same reason, some diets are objectively more difficult than others. But you make it look like veganism is objectively more difficult than other diets. I disagree with that: just see how much you have to learn for a healthy diet with meat. I think a healthy vegan diet is as difficult as a healthy omnivorous diet, and an unhealthy vegan diet is as easy as an unhealthy omnivorous diet. Transitions may be difficult, but they involve one time transition costs, which become negligible in the long run. Once you have learned a foreign language, the cost of learning drops to zero, and the new language becomes easy for the rest of your life.</p>", "parentCommentId": "LDfgAiAnax4ZduDP5", "user": {"username": "Stijn"}}, {"_id": "aJoyrniRcH748SkDm", "postedAt": "2023-06-05T17:06:33.636Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I'll be completely honest and say I came into this post expecting to be annoyed, mostly for reasons you address (especially the \"you're singling out veganism\" and \"sick of concern trolls\" issues). However, after reading I agree with pretty much all of your cruxes.&nbsp;</p><p>Particularly, I would agree that most [current] vegans [living in omnivorous cultures] are sacrificing one of health/taste/cost/convenience.</p><p>I have been vegan for 2.5 years and have had no negative health effects (at least that I'm aware of, or that I didn't have while omnivorous), but I would also consider myself decently well-educated in vegan nutrition.</p><p>I think there are some health issues that may make it too difficult for some people to eat plant based* (ex. <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5372909/\">genetic difficulties</a> with converting provitamin beta-carotene into proper vitamin A, or simultaneous soy &amp; gluten &amp; nut allergies). I don't think a perfect 100% of humans today could eat entirely plant based* with the agricultural and nutritional knowledge we currently have.</p><p><i>However</i>, I strongly believe:</p><ul><li>The number of people who could be healthy <s>vegans</s> [EDIT: on a plant-based diet] is far, far higher than the number that are currently <s>vegan</s> [EDIT: plant-based]. It's not 100%, but if forced to make a numerical estimate I'd say &gt;=80% (if cost was not an issue), or &gt;=50% of the U.S. at their current income.</li><li>People who are unable to be fully plant-based should <i>ideally</i> still reduce their contributions to animal suffering, insofar as is possible &amp; practical for them. A lot of people seem to commit to failing with abandon if they can't be perfectly plant-based. [This is difficult to judge from the outside though, and I don't feel comfortable passing this judgement on anyone I don't know extremely well, and very few of those I do.]</li><li>If cultured meat production and/or nutritionally comparable meat replacement continues to advance, most objections will be pretty much irrelevant. I would be very suspicious of people who say they can't eat plant-based for health reasons, but then don't switch to cultured meat (/ nutritionally comparable meat replacements) if it becomes easily available.</li><li>There are no negative health effects to avoiding buying leather, for example. You can debate leather ethics on its own merits, but people who say \"I think we should stop farming animals but I can't be vegan for health reasons\" who also buy leather seem like they are just searching for free virtue points.</li></ul><p>All of the vegan places I've hung out in (that talk about practical veganism, not just the broad philosophical argument) have pointed toward the important bits of vegan nutrition. Ex. B12 being a running joke on VCJ. I don't think general philosophical arguments should be required to contain implementation details, but I would consider any practical veganism guides that didn't include <i>at least</i> info on B12 supplementation &amp; preventing iron deficiency irresponsible.</p><p>Not sure we actually disagree much, but feel free to let me know. Honestly my biggest disagreement would just be that I don't run into \"there are no downsides!!!\" messaging much and therefore this seems like a non-issue. Though I don't spend much time reading about EA-specific vegans, so maybe it's more of a local issue?<br><br>[*] - retaining a distinction between a plant-based diet (zero animal-origin products in food) and vegan (philosophical framework that extends beyond the diet but also allows more leniency when full abstention isn't possible)</p>", "parentCommentId": null, "user": {"username": "MintSnap"}}, {"_id": "Jj7rCcDXovpnNw9mX", "postedAt": "2023-06-05T17:19:15.964Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>While I think the meat-eating-for-productivity justification can be very perilous, I still strong downvoted this for what I perceive as an uncharitable tone toward those who report significant adverse effects from a vegan diet. I don't think it is appropriate to summarily dismiss everyone who reports that they are significantly more productive when eating meat as guilty of \"motivated reasoning,\" along with \"a bad character, or a weakness of will . . . .\"&nbsp;</p><p>As relevant here, Will reported a significant loss of productivity that seems strongly suggestive of health problems, despite trying \"very hard to do the vegan thing properly.\" As far as I know, neither of us are a physician or a psychologist who have examined the people making similar claims and given them the proverbial million-dollar workup. Nutritional research is hard, and we'd need a significantly stronger body of research (e.g., random assignment, very large samples) to say that a vegan diet is maximally healthful for <strong>everyone at an individual level</strong> (as opposed to healthier on the a population average). Unless and until the data get to that level, we should err on the side of not diagnosing and condemning people via Internet forum who are reporting their own lived experiences.</p>", "parentCommentId": "R8rq6HGDCffzJY5Jx", "user": {"username": "Jason"}}, {"_id": "aN2Actkiz6Jb9u9mS", "postedAt": "2023-06-05T20:00:50.421Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Someone who is highly productive in reducing X-risks, is first highly intelligent, which means intelligent enough to know how to eat a healthy vegan diet, and second, most likely living in a wealthy environment with good access of healthy vegan food, which means able to follow the knowledge about healthy vegan diets. So that means if a person still has adverse health effects from the vegan diet, while following all knowledge about healthy vegan diets, it must be because of unknown reasons. And that seems very unlikely to me. We know so much about healthy food...</p>", "parentCommentId": "Jj7rCcDXovpnNw9mX", "user": {"username": "Stijn"}}, {"_id": "wtoasyzdexuYLqDry", "postedAt": "2023-06-05T20:53:36.221Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>&nbsp;I agree with approximately all of this, I have some quibbles but also some things I would take farther so I think we're pretty resonant.&nbsp;</p><p>I'm going to respond to some stuff line by line. For clarity I've swapped out the word vegan with your definition of it, which I think is not how everyone uses it.</p><blockquote><p>The number of people who could be healthy [eating a plant-focused diet but some leniency when full abstention isn't possible] is far, far higher than the number that are currently [eating a plant-focused diet but some leniency when full abstention isn't possible]</p></blockquote><p>Yeah absolutely. I think the most common optimal diet looks like \"healthy plant-based diet + small amounts of animal products\", with exceptions in both directions.</p><blockquote><p>People who are unable to be fully plant-based should <i>ideally</i> still reduce their contributions to animal suffering, insofar as is possible &amp; practical for them</p></blockquote><p>I think this is good for the sake of animals and also for people's health. It probably requires trade-offs on money and taste for many people, but so do many other health improvements. &nbsp;</p><p>Someone on lesswrong mentioned <a href=\"https://thingofthings.substack.com/p/on-ameliatarianism\">Ameliatarianism</a> (dropping specific animal products from your diet based on suffering math) and I think it's a great idea, my biggest concern is that mathematically calculating suffering is hard and what if we get the math so wrong it makes things worse? But it seems very unlikely to land on something worse than Standard Shitty American Diet.</p><p>&nbsp;</p><blockquote><p>If cultured meat production and/or nutritionally comparable meat replacement continues to advance, most objections will be pretty much irrelevant</p></blockquote><p>I have some concerns about unknown unknowns that might make me draw the parity line in a different place, but stipulating actual nutritional parity, yes, obviously.&nbsp;</p><p>I want to give animal EAs credit for pushing forward on this one, although I tentatively wish they'd focused on cultured meat and not fortified plant-based substitutes.</p><blockquote><p>There are no negative health effects to avoiding buying leather</p></blockquote><p>I agree with the principle. I think it's pretty plausible the health justification doesn't apply to desserts for people getting enough calories already, and so desserts should be entirely plant-based even for people who eat meat. I think it might even be reasonable to say \"if it's about health while are you eating pepperoni and not liver?\"</p><p>For this exact issue: I've heard scary things about leather replacements (something something microplastics), but haven't looked into it. I think it's equally likely that that's propaganda from the leather industry, or that Big Pleasther is suppressing knowledge that the real problem is worse.&nbsp;</p>", "parentCommentId": "aJoyrniRcH748SkDm", "user": {"username": "Elizabeth"}}, {"_id": "27Y3QSP86DfRaYcD8", "postedAt": "2023-06-05T21:03:36.500Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>yeah, it seems like a trivial claim to me as well, which is why I'm confused so many people argue against it so vehemently.&nbsp;</p><p>If I saw people making a strong ethical argument for eating meat in a meat-naive population, and the converts hurting themselves food poisoning and scurvy, I would absolutely think the meat advocates were doing something wrong and be advocating for a fix.&nbsp;</p>", "parentCommentId": "tCs3ShCx6JGBwSXic", "user": {"username": "Elizabeth"}}, {"_id": "RN97iN4Xu7cPRiZ8K", "postedAt": "2023-06-06T00:27:15.898Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I indeed didn't quite mean \"nutrients per calorie\".<br><br>The following is a chart I made for some common animal vs. plant protein sources. All the values come from the cronometer database. To get everything in the same units I converted everything to % daily need.&nbsp;</p><p>To create this chart I copied over the calories, protein, and micronutrients for several common sources of protein from animals and plants. The animal sources were off the top of my head, the plants were primarily from <a href=\"https://www.healthline.com/nutrition/protein-for-vegans-vegetarians\">the first list</a> I found on google, + Impossible Burgers. To get everything in the same units, I used % daily value.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefb9fjkfl7yjm\"><sup><a href=\"#fnb9fjkfl7yjm\">[1]</a></sup></span>. This was all done using the cronometer food database</p><p>First I assumed 100g of each food product, and summed the % target values together for a nutritional score. But it doesn't make sense to credit them for vitamins no one needed, so I capped the values at 100% of target value (excluding protein, for now). I also 0ed out biotin, because only a few foods have filled out that value and I didn't want to unfairly penalize ones that didn't. From there I calculated [nutrient score/calorie], both with and without protein.</p><p>&nbsp;</p><figure class=\"image\"><img></figure><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/omz8cajtxi8qhrdrogt3\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/ki3gais9rbvw3rv4o5xx 250w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/v2l1fyrcfcgpfklc3kjx 500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/dcsmtxf2vxosm43yv4jg 750w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/wcmhijpxce6lcucxau2i 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/bcunpa8avvit2oycfcww 1250w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/tfvmxx4eiuwzagihmh7u 1500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/myyxz7cnbk2t5g8u7ydx 1750w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/vf298u6ver7jkfdtowgu 2000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/idir5zoacccli1hqyiag 2250w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/RN97iN4Xu7cPRiZ8K/a1ooynf5kwif0caoo3nr 2466w\"></figure><p>Spreedshet available <a href=\"https://docs.google.com/spreadsheets/d/1JMZ-7KJTAmW3NYk_F6pJvdAUjzsmRacNw4ekPhZsxlA/edit#gid=0\">here</a>.</p><p>For total score (not normed/calorie, excluding protein), excluding Impossible Burger which I want to talk about separately, the least nutritious animal product (eggs) is still more nutritious than the most nutritious plant product (edamame), although not by much. If you norm per calorie, edamame eeks ahead of eggs, who are now tied with lentils. Norming per calorie kills cashews.</p><p>Including protein (as % of DRI) doesn't change much, so I'm going to ignore it.&nbsp;</p><p>But this kind of assumes the daily targets (which are based on DRI<strong> </strong>but somewhat personalized to me) are right, and that you're not eating anything else. In practice (and excluding Impossible Burger), the nutrients that beans/edamame/non-nut sources are rich in are things anyone with a halfway decent plant diet should already be doing well in. This is much less true of nuts, but nuts have far too many calories for most people to use as a major source of anything.&nbsp;</p><p>Which is why I think the median meat eater would benefit nutritionally from swapping in one of those plant protein sources, and the average vegan would benefit from swapping in an animal product. Similar to what you described, it's about the density of what a particular person needs.</p><p>I said I wanted to handle Impossible Burger separately. It scores pretty well; above eggs but below steak, salmon, and liver (same ranking whether you include protein or not). For who people who like and can absorb nutrients from Impossible Burger and other fortified products, they seem pretty good, although not quite as dense. And for people who can digest IBs more easily than meat, seems great. I'm still pretty worried about unknown unknowns, and the <a href=\"https://medium.com/@justinmares/why-beyond-meat-impossible-are-bad-for-you-33f1ddb35191\">health nuts have concerns,</a> but I think both of those are beyond the scope of this post, which is about satisficing not optimization.</p><p>You might ask \"why focus on high protein foods?\" &nbsp;Because protein is the hardest and most valuable macronutrient for most diets, and because it's correlated with the subset of vitamins that's richer in meat sources. There are plant sources that are rich in other vitamins (kale is looking at these nutrient/calorie scores and laughing), but except maybe for nuts nothing unfortified is rich in this set. It's mostly fixable, by you have to tetris together the missing nutrients from multiple sources.</p><p>In the reverse situation I would 100% describe kale as nutrient dense to someone eating the Stanard Shit American Diet. I expect it to be less helpful to them than an egg is to a vegan, but for reasons that reflect well on plant-based diets: most of the problems from meat-based diets aren't nutritional deficiencies that can be fixed by eating more things. Many SSAD problems &nbsp;(cholesterol, calorie excess) are an accumulation of problems from what you do eat, and can't be fixed by throwing in more vegetables.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2hzmxedgx0n\"><sup><a href=\"#fn2hzmxedgx0n\">[2]</a></sup></span></p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnb9fjkfl7yjm\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefb9fjkfl7yjm\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This is tricky on a few levels. First, the RDA is too high for most people. Second, I didn't use RDA, I used my personal targets, which I've modified for some nutrients (roughly: (vitamin A (x1.5), riboflavin (x2), niacin (x0.3), folate (x0.5)). I eyeballed it and didn't feel like the shift was giving animal products an unfair advantage, and it would have been a huge pain to correct, so I didn't fix this.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2hzmxedgx0n\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2hzmxedgx0n\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My personal opinion is that people would eat less shit if they were getting enough vitamins, and so forcefeeding them kale would eventually lead to less bad stuff, but it's a more complicated process.&nbsp;</p></div></li></ol>", "parentCommentId": "f3a3DvsNjRtwCJ76W", "user": {"username": "Elizabeth"}}, {"_id": "NpvqJF3xmQZpJtCot", "postedAt": "2023-06-06T12:55:28.148Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thanks for the extended reply. I understand your position much better now.</p><p>On a meta note about communication, I think \"Substituting non-animal protein with animal protein likely gets you closer to meeting all the Dietary Reference Intakes for vitamins\" is more informative, less likely to be misinterpreted, and probably more persuasive than \"Animal products are incredibly nutrient dense\". (I offer this as a constructive criticism focused on one relatively minor point of how your post is written rather than as an objection to its substance.)</p>", "parentCommentId": "RN97iN4Xu7cPRiZ8K", "user": {"username": "Pablo_Stafforini"}}, {"_id": "a2KvXxnmuyMbpE3Fp", "postedAt": "2023-06-06T14:19:20.228Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>This is a very long piece and also a lot of comments, and so I apologise if I've missed something relevant by skimming.</p><p>I think my main disagreement is that I would frame it as few weeks of adjustments rather than lasting tradeoffs (except for logistics and social pressure). My model of the adjustment period is nutrition education and body adjustment. Everyone should do the first, and some have the second, with a small minority needing some help (e.g. <a href=\"https://www.youtube.com/playlist?list=PLEKrpnrEoqr0YsS6hk-Rc11O_2omeZ1bG\">these case studies from this nutritionist</a>).</p><p>Here's an RCT <a href=\"https://www.nature.com/articles/nutd20173\">https://www.nature.com/articles/nutd20173</a> it's across 6 months, and also looks at 'quality of life' variables,&nbsp;</p><blockquote><p>Between-group differences favouring intervention were significant at 6 months for both the physical component summary (<i>P</i>=0.03) and the mental component summary (<i>P</i>&lt;0.01) (<a href=\"https://www.nature.com/articles/nutd20173#Tab4\">Table 4</a>). At 6 months no significant between-group differences were seen for: average daily exercise, food enjoyment or food costs (<a href=\"https://www.nature.com/articles/nutd20173#Tab4\">Table 4</a>). Statistically significant differences favouring the intervention were seen at 6 months for general self-efficacy (<i>P</i>=0.01), nutritional self-efficacy (<i>P</i>&lt;0.0001) and self-esteem (<i>P</i>&lt;0.01).</p></blockquote><p>There are a few claims that were asserted and I found very surprising; maybe I've spent too much time on nutritionfacts.org. I think the bar of evidence you ask for, whilst would be conclusive, seems a little high and unrealistic given the practicalities around most nutrition research.</p><p>It's not clear that the claims your baselines (in particular the one below) are based on the same high bar: most of the \"I found veganism difficult\" anecdotes I come across are incredibly vague and describe no systematic investigation of what actually went wrong (e.g. Cronometer/food diary, blood tests, SIBO tests etc), and usually just attribute it to \"no animal products\".</p><blockquote><p>People are extremely variable. This includes variation in digestion, tastes, time, money, cooking ability…&nbsp;</p><p>Most people’s optimal diet includes small amounts of animal products, but people eat sub-optimally for lots of reasons and that’s their right.</p><p>but if you add up all the foods you would need to meet every need, for people who aren’t gifted at digestion, it’s far too many calories and still fairly restrictive.</p></blockquote><p>Especially the last claim (have you come across \"How Not to Die?\" and \"How Not to Diet?\"); the <a href=\"https://nutritionfacts.org/daily-dozen/\">daily dozen</a> has around 1200-1500 calories in it; it's not clear that someone is 'gifted at digestion' or not, with no ability to change (in fact, <a href=\"https://nutritionfacts.org/video/how-to-change-your-enterotype/\">the opposite seems to be true</a>, and there seems to be <a href=\"https://www.youtube.com/watch?v=yKp8-X1zZqo\">some evidence documenting the shifts,</a> across admittedly short-timescales).</p>", "parentCommentId": null, "user": {"username": "Dhruv Makwana"}}, {"_id": "cJWA7AyeGSC9WNvtG", "postedAt": "2023-06-06T15:46:44.045Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I take issue with the way you respond to the first quote; I think the way it's written would likely give a newcomer to the discussion wildly incorrect assumptions about what I'm saying.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8bcbfhzyq0d\"><sup><a href=\"#fn8bcbfhzyq0d\">[1]</a></sup></span></p><p>I would consider my definition of veganism the \"correct\" one, as the practicality limit is baked into the official <a href=\"https://www.vegansociety.com/go-vegan/definition-veganism\">Vegan Society definition</a> of veganism. But I think there are good reasons discussion in wealthy countries de-emphasizes the practicality limits.</p><p>Particularly, veganism seems susceptible to a lot of <a href=\"https://www.theatlantic.com/health/archive/2018/08/freeloaders-social-movements-veganism/569020/\">free riders</a> that dilute the language and [arguably] make the movement weaker. I think the number of people that actually <i>need</i> to eat meat/eggs/whatever in the first world is much lower than the number of people that <i>think</i> they need to, and it <i>feels like</i> the way you swapped out my first quote &amp; responded to it encourages the second group to free-ride without critically examining their own habits. [This is not at all meant as a personal criticism, just an explanation of my thought process.]</p><p>I'm using emotional language because this is obviously subjective, but I am assuming good faith and doing my best to articulate why the way you responded would make me <i>feel like</i> we're on different \"sides\" if we were discussing this IRL. I would happily accept impoverished subsistence farmers who eat their cattle as vegan<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefyn6rd4xx2d\"><sup><a href=\"#fnyn6rd4xx2d\">[2]</a></sup></span>, but I have a hard-earned inherent suspicion of wealthy<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefevl6nyph7fi\"><sup><a href=\"#fnevl6nyph7fi\">[3]</a></sup></span>&nbsp;people who eat multiple eggs for breakfast every morning because they \"need\" to. Neither are plant-based, but the \"impossible to abstain from animal foods\" bar is much higher for the average person in a developed country.</p><p>Honestly, in my first bullet point, the word \"vegan\" would be better replaced by \"plant based\". Mea culpa.</p><p>[EDIT: The (unsupplemented) diet most humans are best adapted to may be mostly plants with some animal protein, but I am strongly against labelling that the unqualified \"optimal\" diet, for multiple reasons.&nbsp;</p><p>While I agree with your cruxes that not every person is physically capable of being 100% plant-based, I think most people would be more healthy on a decent plant-based diet than on the SAD, and given its ethical benefits I'd say fully plant-based is the \"optimal\" diet for anyone without very strong health/poverty reasons that make it undoable.]</p><p>--</p><p>I prefer amelitarians to generic omnivores for logical suffering-reduction reasons, as long as they don't dilute the definition of vegan. Though obviously I think it'd be better if everyone was fully vegan.</p><p>But [again, in the interest of full disclosure of the sake of meaningful discussion] I don't have the same automatic emotional impression of them; it <i>feels like</i> other vegans are providing meaningful, credible, and falsifiable proof of good intent and therefore I automatically am much more trusting &amp; willing to sacrifice for their good; I don't have similar ingroupishness toward amelitarians (or pescetarians, etc.).&nbsp;</p><p>Whether this matters at all depends on what you consider the importance of community in pursuing major &amp; sometimes lonely life changes.</p><p>--</p><p>I'd strongly agree with the pepperoni/liver argument. Anyone who says the <i>only reason</i> they aren't vegan is health but then buys e.g. a pepperoni pizza seems like they are more likely to be searching for free virtue points than actually concerned about the suffering of animals.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefaadury85cc\"><sup><a href=\"#fnaadury85cc\">[4]</a></sup></span>&nbsp; I'm not expecting humanity writ large to be morally perfect &amp; entirely consistent, so this isn't a judgment on whether those people are \"good people.\"</p><p>It seems psychologically much more difficult to be \"almost vegan\" than \"fully vegan\" or \"not vegan.\" In my experience it is much easier when eating any animal products to put animal suffering out of the mind than to live with constant internal conflict. My pet theory is that (in fully omnivorous cultures) it is emotionally harder to be a committed vegetarian than a committed vegan, etc.</p><p>For leather in particular, consider that the <a href=\"https://en.wikipedia.org/wiki/Tanning_(leather)#Health_and_environmental_impact\">tanning of leather</a> is also a health concern. My shoes are neither leather nor virgin plastic; this is veering off into minutiae, but there are plenty of attractive non-plastic vegan shoes (<a href=\"https://www.nae-vegan.com/en/unisex/boots/peta-black-organic-cotton-vegan-boots_p3139.html\">ex</a>, or <a href=\"https://www.converse.com/shop/p/chuck-70-vintage-canvas-unisex-high-top-shoe/A03449C.html\">more common</a>).</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8bcbfhzyq0d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8bcbfhzyq0d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>It seems implied that you're equating \"full abstention isn't possible\" with \"full abstention isn't convenient\" which is <strong>emphatically not what I'm saying</strong>. When I say vegans don't use animal-derived ingredients except where it's super impractical, I have in mind e.g. someone getting a <a href=\"https://www.cdc.gov/flu/prevent/egg-allergies.htm\">vaccine developed using eggs</a> because they can't find an alternative plant-based vaccine. I would NOT include someone who e.g. eats red meat because they are worried about iron deficiency (when they could just take an iron supplement).</p><p>If this is what you meant to imply, then we have a genuine disagreement here.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnyn6rd4xx2d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefyn6rd4xx2d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Provided they are minimizing animal suffering as much as is possible given their circumstances</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnevl6nyph7fi\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefevl6nyph7fi\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Relative to global standards, not country average</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnaadury85cc\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefaadury85cc\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Though, like I mention in my first post, this is really hard to judge. For example, some people with extreme sensory processing disorder might currently need to eat non-vegan junk food in order to avoid losing too much weight, even if the junk food itself isn't health food. Though I think it's obvious that my bar for this is much higher than yours.</p></div></li></ol>", "parentCommentId": "wtoasyzdexuYLqDry", "user": {"username": "MintSnap"}}, {"_id": "zLxXHeNY3vouQRTky", "postedAt": "2023-06-06T18:49:44.657Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>fwiw I've felt confused about this post because it seemed like you were making such an unobjectionable claim that I didn't understand why you bothered to write the post, and therefore figured I had just not read it closely enough, but I think maybe you are just actually making an unobjectionable claim?</p><p>I know you tried to flag this at the beginning of your post, and it's very possible that I'm still misunderstanding things, but it would help me if you had a one sentence summary of your claim.<br>&nbsp;</p>", "parentCommentId": "27Y3QSP86DfRaYcD8", "user": {"username": "Ben_West"}}, {"_id": "TueAz8MAjCmsy9Kt6", "postedAt": "2023-06-06T19:10:37.907Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I'm a little jealous of the \"minimal costs of any kind\" bit, though I'm also very glad it's worked out that well for you! :-)</p><p>The only costs for me have been convenience (I don't have any vegan/vegetarian/etc family or close friends, and where I live there are few to no vegan options at most venues). For example, I went to a friend's wedding recently, and spent ~9 hours at the event with nothing to eat, which was mildly inconvenient. This was totally doable (I pre-ate because I guessed this would be the case, and if I had ex. unsteady blood sugar I would've just packed myself a couple snacks).</p><p>I think the vast majority of people can be vegan at low cost &amp; high taste &amp; high health, but for some of us it's more inconvenient than for others.</p>", "parentCommentId": "q2p6jgY9C9r4fpxtG", "user": {"username": "MintSnap"}}, {"_id": "RucegEG4f3xCyZfty", "postedAt": "2023-06-07T00:40:34.707Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>A one sentence summary is a really reasonable request that's difficult for me to fulfill because:</p><ol><li>Reality is very complicated</li><li>Any simplifications I make that exaggerate the challenges of veganism will be viewed extremely uncharitably.</li></ol><p>Which is how I got to an excruciatingly clause-filled 6000-word post in the first place.&nbsp;</p><p>I'm going to try for one sentence, but I'd also like to offer you a video call or in-person meeting, with or without a double crux mediator. The mediator I have in mind is even near-vegan, although I don't know if he's available. &nbsp;[Ben West is not the only person I'd do this with but it's not an open invite either.]</p><p>My one-sentence summary:</p><p>Diet and health are complex multidimensional problems; if you remove a wide swath of your current tools you make the problem harder.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefjpt604ww1xg\"><sup><a href=\"#fnjpt604ww1xg\">[1]</a></sup></span>&nbsp;You can make it easier with education,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefajc5kdk3n7f\"><sup><a href=\"#fnajc5kdk3n7f\">[2]</a></sup></span>&nbsp;but that's not being done for young EA vegans and the subsequent malnutrition is hurting them.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefajbermt0iis\"><sup><a href=\"#fnajbermt0iis\">[3]</a></sup></span></p><p>That's two sentences with three footnotes, which I think is the best I can do.</p><p>To answer your implied question of \"why was this post necessary\" I wanted to direct you to <a href=\"https://forum.effectivealtruism.org/posts/3Lv4NyFm2aohRKJCH/change-my-mind-veganism-entails-trade-offs-and-health-is-one?commentId=LDfgAiAnax4ZduDP5\">this comment</a>, but it's a grandparent of your comment so probably you've already seen it.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnjpt604ww1xg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefjpt604ww1xg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Most of the time. Sometimes it's technically harder but people have enough slack in their life it doesn't matter. Sometimes the options were net harmful so removing them is helpful- which wouldn't be necessary for <i>Homo economicus</i> but seems fine to include as a benefit for real people.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnajc5kdk3n7f\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefajc5kdk3n7f\">^</a></strong></sup></span><div class=\"footnote-content\"><p>But how much slack you can add varies a lot by person. For some it's pretty easy to restore 95%+ of the slack, and for others no amount of education will render the problem solvable without large sacrifices in health.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnajbermt0iis\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefajbermt0iis\">^</a></strong></sup></span><div class=\"footnote-content\"><p>E.g. I can't prove one person's peripheral neuropathy was caused by a B12 deficiency, but it did stop progressing when he started supplements, and if he'd been told that from the beginning it could have saved him potentially lifelong pain.</p></div></li></ol>", "parentCommentId": "zLxXHeNY3vouQRTky", "user": {"username": "Elizabeth"}}, {"_id": "Ct4cFXGGCFmZCRArf", "postedAt": "2023-06-07T01:09:46.024Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thanks! That's a helpful summary. (And I don't disagree with those two sentences.)</p><p>It sucks that you put a bunch of work into helping vegans with nutrition and got epistemically uncooperative responses. I was appreciative of your work there.</p>", "parentCommentId": "RucegEG4f3xCyZfty", "user": {"username": "Ben_West"}}, {"_id": "HbpALPrrzzsAzjith", "postedAt": "2023-06-07T02:55:38.793Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>There's a lot here so apologies if I miss something.</p><p>I didn't mean to equate \"full abstention isn't possible\" with \"full abstention isn't convenient\", but I probably did misunderstand your statement. My guess is that for the median person full abstention is possible, in the sense that people won't die from it, and the ceiling on how good a vegan diet can be is well above the Standard Shit American Diet. But probably the ideal plant-based diet + a few ounces of beef liver and salmon per week is better than theideal plant-based diet alone, for the median person. I think that amount of optimization is beyond what most people are trying to do, and think it's fair to discount health as an explanation for meat consumption for someone who isn't shipping in grass-finished antibiotic-free hand-massaged liver and installing 3 stage water filters on their entire plumbing system.</p><p>I get why my insistence on tracking that last little bit of optimization, while people kill themselves with cheetos, would feel bad to vegans. I think I'd be more relaxed about it if I hadn't seen vegan advocates shout down <i>obviously</i> true things and honest investigations (and then delete the receipts). &nbsp;</p><p>I also think there's a long tail of people for whom it isn't possible to be in good health while plant-exclusive, for reasons that go well beyond convenience. E.g. iron supplements don't work for everyone, for reasons we don't understand. I think it would be great if someone invented a better supplement and then more people could go plant-exclusive, but until then I want the problem on the record.</p><hr><p>I want to note that I've seen \"vegan\" used in almost the opposite of the way you define it, and TBH I'm not sure how to relate your definition of vegan with your concerns about free-riding. I've seen people (not in EA) say \"vegan is for life. if you ever eat animals again then you're just someone who ate plants for a while\". Vegan Society does say \"as far as is possible and practicable\", but it also says \"one thing all vegans have in common is a plant-based diet avoiding all animal foods such as meat (including fish, shellfish and insects), dairy, eggs and honey - as well as avoiding animal-derived materials, products tested on animals and places that use animals for entertainment\". &nbsp;And I've seen lots of EAs use \"vegan\" to mean \"exclusively plant-based diet\" without political conntations.&nbsp;</p><p>IIUC you want to allow vegans to be imperfect (with the acceptable bar raising with wealth), but are pretty worried about free riders saying \"yay animals! I'm a vegan!\" while not actually doing much that actually matters. That feels very relatable to me but as someone who wouldn't qualify for any definition of vegan I feel uncomfortable having an opinion on where the line should be, and in the meantime want to sidestep the word in favor of more explicit descriptions.&nbsp;</p><p>I accept that for many people it's easier to be fully plant-based than plant-based + a bit of animal products. I think it's valid to argue that \"for the median person, the health benefits of a few ounces of meat are N, which is small, and the risk of relapsing is M, which is large, so you should be safe and stay entirely plant-based. It's not even a health cost if you include the second order effect of excess meat if you relapse\"- but only if you've actually calculated N and M, and ideally looked for improvements on the margin.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefnzubsx0s6q\"><sup><a href=\"#fnnzubsx0s6q\">[1]</a></sup></span>&nbsp; You can't ignore the health costs and <a href=\"https://www.lesswrong.com/posts/rRkhATuztvfMLFhT8/vegan-nutrition-testing-project-interim-report?commentId=Z26fPExJJyni69Nq8\">tell people it's bad to investigate them</a>, and then claim to know which of N or M*costs is larger.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefnu314zdpm8j\"><sup><a href=\"#fnnu314zdpm8j\">[2]</a></sup></span>&nbsp; And even if ideal-N is small, you still need to do the work to get people on a good plant-exclusive diet.&nbsp;</p><p>And then N and M differ widely across the population. It's entirely possible for the current plant-exclusive population to be best served (incorporating the cost of animal suffering) by staying plant-exclusive, and for a different population to be best served by ameliatarianism. I think it's fair to not get the same social reinforcement from them you would from a fellow vegan, but they don't owe you social reinforcement. If you somehow found ameliatarians worse for your morale than standard omnivores I'd be sympathetic (people are messy) but consider it fundamentally your problem, not theirs.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnnzubsx0s6q\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefnzubsx0s6q\">^</a></strong></sup></span><div class=\"footnote-content\"><p>what if no to <i>tasting</i> animals but yes to <a href=\"https://heartandsoil.co/\">offal pills</a>?&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnnu314zdpm8j\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefnu314zdpm8j\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Unless you're willing to declare M*costs is greater than the disability and death of a given human. That's a logically coherent position.</p></div></li></ol>", "parentCommentId": "cJWA7AyeGSC9WNvtG", "user": {"username": "Elizabeth"}}, {"_id": "R6vrFfLcEEnriKvZt", "postedAt": "2023-06-07T12:21:17.294Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>First off, thank you for your thorough &amp; thoughtful replies (as well as the thorough &amp; thoughtful original post). I appreciate you using your time to improve the quality of the conversation on veganism.</p><hr><p>I agree it's possible that small amounts of high-quality animal products provide minor benefits to people heavily optimizing for health who are otherwise capable of being healthy on a plant-based diet. I just think that 1) very few people are optimizing hard enough for this to matter, and 2) [in people that could be healthy vegans] the value of the mild health benefit is less than the ethical value of preventing the required animal suffering, <i>even if</i> they are being consistent by buying small amounts of extremely expensive high-quality meat.</p><p>People for whom iron supplements / heme iron in plant-based meat doesn't help (&amp; would be anemic on any plant-based diet) seem like the kind of people who have obvious and justifiable health-based reason for eating meat. In footnote 1 I was thinking of people who hadn't <i>tried</i> a supplement.</p><p>(Also, this is obviously the type of discussion I'd only have in venues like this forum. If a friend says \"I have to eat meat because I'm anemic,\" I don't say \"Are you sure??? Have you <i>really tried</i> multiple vegan supplements???\" I just say \"Dang, that sucks, hope you feel better.\")</p><hr><blockquote><p>IIUC you want to allow vegans to be imperfect (with the acceptable bar raising with wealth), but are pretty worried about free riders saying \"yay animals! I'm a vegan!\" while not actually doing much that actually matters.</p></blockquote><p>This is an accurate description.&nbsp;The details are obviously harder to hammer out.</p><p>I would make E being the ethical cost of animal products, s.t. one should go vegan iff N &lt; M*(health costs of meat) + M*E.&nbsp;</p><p>Ideally going vegan keeps you in good health. For many on the SAD, I think a vegan diet will improve health. However, if veganism is going to cause death/disability, avoid it.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref1xdnfomee8u\"><sup><a href=\"#fn1xdnfomee8u\">[1]</a></sup></span><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefbw553ouy5ow\"><sup><a href=\"#fnbw553ouy5ow\">[2]</a></sup></span>&nbsp;If it's going to keep you in good health but keep you slightly short of <i>technically optimal</i> functioning, I think the ethical benefits are enough for veganism to still be worth it.</p><p>I'm not entirely sure what you mean by \"looking for improvements on the margin\" before recommending veganism — do you mean health improvements? I'd prefer people default to the maximally-ethical diet and then only introduce animal products as <i>really needed</i> for health, not default to eating animals and then only test out veganism after being super-duper sure they can't eke out a few % increase using offal.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref9yi64xqszu\"><sup><a href=\"#fn9yi64xqszu\">[3]</a></sup></span></p><p>As far as amelitarianism — I'm sure there are indeed plenty of people who'd find amelitarianism easier, and I'm under no illusion that they care about my personal opinions.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefc7b3hbmp5zc\"><sup><a href=\"#fnc7b3hbmp5zc\">[4]</a></sup></span>&nbsp;They don't affect my morale, and I prefer amelitarians to standard omnivores. I would only take issue if they <i>call themselves</i> vegan, as then (in aggregate) it affects the meaning of the word, my ability to get (actually) vegan food, etc.</p><hr><p>For the record, I hope I haven't come off as too critical; I think we largely agree.</p><p>I am very in favor of gathering more empirical evidence on veganism. I think it helps everyone, very much including vegans; a rising tide lifts all boats, etc.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefl1k8y1el92k\"><sup><a href=\"#fnl1k8y1el92k\">[5]</a></sup></span><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefmyi3d46wqre\"><sup><a href=\"#fnmyi3d46wqre\">[6]</a></sup></span></p><p>I think testing people's vitamin levels is good, both in giving us community information, and in helping those individuals avoid deficiency. Telling people who somehow missed the memo about B12 supplementation is <i>very</i> good; I'd strongly prefer people not give themselves permanent nerve damage.</p><p>Some of your writing feels concern-troll-ish at first pass, but a) I'm not the tone police, b) I think your research is beneficial, and c) there's a reasonable chance I'm just oversensitized by how often I bump into <i>actual</i> concern trolls.</p><p>I think our only real disagreement is how much animal suffering matters compared to minor human health benefits (in the population of people who could be healthy plant-based<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefng8ldlcw7e\"><sup><a href=\"#fnng8ldlcw7e\">[7]</a></sup></span>).</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn1xdnfomee8u\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref1xdnfomee8u\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My hot political take is that I quite like humans, and would prefer humans not suffer/die. I would also prefer animals not suffer. I think these can usually be resolved with minimal conflict, but unfortunately not always. What are the odds I convince lots of non-vegans to get their animal-eating needs in the form of stationary bivalves and/or roadkill? :P</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnbw553ouy5ow\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefbw553ouy5ow\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Again, both in the \"literally cannot process vegan supplements correctly\" way and the \"extenuating circumstances\" way. I mention SPD in a previous-post footnote. I also would be uncomfortable talking about veganism with someone with a history of eating disorders, for example.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn9yi64xqszu\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref9yi64xqszu\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Actually I'm not sure what the offal footnote means in general. I hope I've accurately conveyed that \"tasting\" animals is not the problem. Though offal pills might be more ethical if they're low-cost byproducts? Or maybe you're saying sticking to offal-only decreases the chance of eating unnecessary animal products?</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnc7b3hbmp5zc\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefc7b3hbmp5zc\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I read Ozy's post a while back and have never commented on amelitarianism before. I only gave an opinion on amelitarianism here because you specifically brought it up in a reply to me.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnl1k8y1el92k\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefl1k8y1el92k\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm sure the link was for illustrative purposes, but just to be clear, I'm not the linked LW commenter, nor am I opposed to you conducting research.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnmyi3d46wqre\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefmyi3d46wqre\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Also, completely selfishly, I'd prefer vegans not Streisand effect the real but (IMO) manageable convenience costs of being vegan, at least for those of us in very-omnivorous communities. [Maybe there are no convenience costs for people in wealthy coastal cities with high vegan populations and multiple vegan friends, but if so I can't relate.]</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnng8ldlcw7e\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefng8ldlcw7e\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Which I estimated at &gt;=80% if ignoring financial constraints, but I'm very open to both research into what this percent actually is and (ideally) nutrition/agriculture/etc research on ways to raise it.</p></div></li></ol>", "parentCommentId": "HbpALPrrzzsAzjith", "user": {"username": "MintSnap"}}, {"_id": "kwHvn3CcFYWPxsQ3i", "postedAt": "2023-06-07T12:52:31.698Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>It is funny<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefy1ii6cgek98\"><sup><a href=\"#fny1ii6cgek98\">[1]</a></sup></span>&nbsp;how long the post ended up &amp; how much we've all ended up debating in the comments, given that I am in 100% agreement with the two-sentence summary and all three footnotes.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fny1ii6cgek98\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefy1ii6cgek98\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Not blaming you, of course. Just observing</p></div></li></ol>", "parentCommentId": "RucegEG4f3xCyZfty", "user": {"username": "MintSnap"}}, {"_id": "mFqQx37WPeqTt86Ac", "postedAt": "2023-06-07T18:04:42.976Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>You've said some charged things and asked that I take them as information (and I'm glad I did). I'm going to ask for the same trust now.&nbsp;</p><blockquote><p>For many on the SAD, I think a vegan diet will improve health</p></blockquote><p>This sentence, without specifying effects on axes besides health, seems very slippery to me. <i>Lots</i> of diets improve health relative to SAD. SAD strongly optimizes for taste, convenience, and cost, with health being at best a distant afterthought, so there are lots of improvements available if you change your priorities.</p><p>I think it's locally valid to say \"after skilling up, the median person can spend $N and $M hours/week to get P health improvements, with no change in taste, and that's obviously worth it for benefit Q to animals\". &nbsp;Or the same sentence with your personal values, which are easier to calculate. But specifying P without gesturing at the order of magnitude of N and M is not very useful.&nbsp;</p>", "parentCommentId": "R6vrFfLcEEnriKvZt", "user": {"username": "Elizabeth"}}, {"_id": "CTjs4BN6yJgfhgvQv", "postedAt": "2023-06-07T19:12:07.814Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>You're absolutely correct on the details. Most people going SAD -&gt; vegan increase health, because they generally trade cost or convenience.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefl6472rk4dtk\"><sup><a href=\"#fnl6472rk4dtk\">[1]</a></sup></span></p><p>Most people<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefxfkqnjwwwhh\"><sup><a href=\"#fnxfkqnjwwwhh\">[2]</a></sup></span>&nbsp;wouldn't pay $N or $M for P <i>without</i> Q, as most people who don't value Q don't make the trade. I would not expect any completely amoral Americans to be vegan. My veganism is an argument based on Q, not for the irrelevance of N/M or the magnitude of P. I would expect both N &amp; M to decrease as percent vegans in the local population increase.</p><p>However, while vegan being &gt; SAD on health (even without mentioning N/M) is not relevant to <i>this</i> discussion, correctly saying \"hey a balanced vegan diet won't make you waste away\" is still shocking news to many people. Therefore noting that <i>there is a P</i> is <i>very</i> useful with many non-vegans. If any EA people think there is <i>no</i> N/M, I think this is possibly the only U.S. subculture where that's true.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdwjvkoaymy9\"><sup><a href=\"#fndwjvkoaymy9\">[3]</a></sup></span></p><p>Also, to take a step toward the meta: \"good health\" and \"animal suffering\" are [sometimes] sacred values, where time/$ aren't. So for whom those are sacred values, this is noting that you can have <i>both</i> sacred values by trading against <i>only</i> non-sacred values. Hopefully this is irrelevant to EA/LW people, but it is extremely relevant in the \"real world\".</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnl6472rk4dtk\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefl6472rk4dtk\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In wealthy urban areas with higher % vegans, the trade-off is usually cost (eating out at vegan restaurants, etc.). In areas that are small with few vegans, the trade-off is convenience (I started cooking more; there is only one vegan restaurant near me that is too far &amp; expensive to regularly visit).</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnxfkqnjwwwhh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefxfkqnjwwwhh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In regular meat-heavy U.S. culture. YMMV in specific subcultures.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndwjvkoaymy9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdwjvkoaymy9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Sorry for my clumsy wording &amp; many footnotes. What I'm trying to say is that in the equation where you trade $N and $M for P and Q, I think people (outside <i>maybe</i> EA) systematically overcalculate N and M and undercalculate P, even before accounting for Q, since they think being vegan is harder than it actually is and leads to a negative P value, which is usually false.</p><p>I still don't think they'd make the trade without Q, but in an effort to \"counter-balance\" Q people seem to (unconsciously?) distort N, M, and P.</p></div></li></ol>", "parentCommentId": "mFqQx37WPeqTt86Ac", "user": {"username": "MintSnap"}}, {"_id": "JCvcbMGhwJCzgW8o5", "postedAt": "2023-06-07T19:39:24.434Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>My veganism is an argument based on Q, not for the irrelevance of N/M or the magnitude of P.</p></blockquote><p>But <i>this discussion</i> is about N, M, and P. There have been many discussions of Q, I have already acknowledged Q&gt;0, quantifying Q is outside of scope of the this post. Over on LW I deleted attempts to argue Q=0 because it was out of scope. When N, M, and P are quantified people can combine all the information to argue and make decisions, but getting all 4 pieces quantified is a necessary step.&nbsp;</p>", "parentCommentId": "CTjs4BN6yJgfhgvQv", "user": {"username": "Elizabeth"}}, {"_id": "TR2feuN5eQFy8kx7a", "postedAt": "2023-06-07T20:23:54.128Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I fully agree with all of the above. From the first message of this thread I noted that I agreed with the cruxes of the post. I agree that N, M, and P are important and we should gather &amp; disseminate better information on them.</p><p>To my understanding, in futher posts we've been discussing how much the trade-offs matter, to what extent they've been suppressed, and whether some sub-fields have trade-offs at all (e.g. leather).</p><p>I don't think it's possible to have a discussion without <i>any</i> shadow of Q, because ultimately without Q there's not even a discussion (beyond a 1-page of current research on one lifestyle choice among many). Your \"why is this so hard to talk about\" section is answered mostly with Q itself.&nbsp;</p><p>That being said, I should have worked harder to stay on topic. I apologize if my replies here have been unhelpful to this discussion.&nbsp;</p><p>At the very least, I am still thankful for your thoughtful responses, as I have found this thread both interesting and useful.</p>", "parentCommentId": "JCvcbMGhwJCzgW8o5", "user": {"username": "MintSnap"}}, {"_id": "uqvusGRTG2io5oQfu", "postedAt": "2023-06-07T21:27:37.145Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>[Speaking as a mod.]</p><p>This comment is breaking <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">Forum norms</a>. It is too harsh. I would like to see more appreciation for the human on the other side of the screen and a collaborative mindset. You can do that while still maintaining a strong stance against the reasoning you don't like.</p>", "parentCommentId": "R8rq6HGDCffzJY5Jx", "user": {"username": "jpaddison"}}, {"_id": "8GnMhqKtuXcTiBWCK", "postedAt": "2023-06-07T21:54:33.960Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I read a few of your points, skimmed the rest. It sounds like you're talking about a <em>healthy</em> omnivorous diet, which I agree is maybe as hard as a vegan diet. However, I eat a <em>convenient</em> diet, not a healthy one, filled with microwave and fast food, and it's much more likely to eat a convenient omnivorous diet.</p>\n", "parentCommentId": "cJydGWvcvsf4kigza", "user": {"username": "DonyChristie"}}, {"_id": "yhfzgXaQnupaDdKgf", "postedAt": "2023-06-08T02:13:11.316Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Yep, in retrospect, my \"5 minutes\" remark didn't sufficiently account for the adjustment period. I went through a similar adjustment to yours, and spent several months constantly hungry and low energy. (The mental slowness sounds like a symptom of B12 deficiency, which I had at first, but stopped once I started supplementing.) By a year's end, I was back to normal. I can see how my comment could have been understood as diminishing what you went through, which wasn't my intention :)</p><p>I agree that burnout is important to stave, and being dedicated to sufficiently altruistic pursuits can help you accomplish a lot more good than your dietary choices.</p><p>As a compromise, what do you think about choosing beef when it's an option rather than other meat choices (chicken or pork)? In terms of suffering reduction, a non-vegan diet where beef is the only meat consumed is perhaps 90% of the way there.</p>", "parentCommentId": "HtmKssekuy2BPgFmL", "user": {"username": "Ariel Simnegar"}}, {"_id": "DihPpSEA9xkruEafa", "postedAt": "2023-06-08T18:08:24.157Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I think emphasising protein is totally the wrong track, since it's just not that important (and also if you're getting enough calories near impossible to have a deficiency in)</p>\n<p><a href=\"https://nutritionfacts.org/video/the-great-protein-fiasco/\">https://nutritionfacts.org/video/the-great-protein-fiasco/</a></p>\n<p>I also think your general model of \"satisfying\" is built off of myths which just are not supported by the evidence</p>\n<p><a href=\"https://nutritionfacts.org/video/evidence-based-weight-loss-live-presentation/\">https://nutritionfacts.org/video/evidence-based-weight-loss-live-presentation/</a></p>\n<p>See especially 38:41 where he talks about a review with meat industry funding</p>\n<p>\"In general, these data confirm a modest satiety effect with protein-rich meals but do not support an effect on energy intake at the next eating occasion.\"</p>\n<p>Lastly your omission of leafy greens is suspicious - from memory spinach has about 40% of its calories from protein, and (dry) soya chunks/mince around 66%, far exceeding most animal products (due to fat), and legumes.</p>\n", "parentCommentId": "RN97iN4Xu7cPRiZ8K", "user": {"username": "Dhruv Makwana"}}, {"_id": "ZyHjpqZQ3ttPTMrLx", "postedAt": "2023-06-09T00:49:23.410Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I made the mistake of looking at the total of the 7DA health data and I'm both excited and overwhelmed. Are there papers you would recommend I prioritize, besides the AHS2 one? Is there anything on adventists with medical issues affecting digestion?</p>", "parentCommentId": "fNxwRxnqB5LKNC8na", "user": {"username": "Elizabeth"}}, {"_id": "f8CDgZzeLFWWC5auF", "postedAt": "2023-06-09T03:52:45.266Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Scott describes the study as functionally randomized because restrictions vary by church, which is indeed the closest I could possibly hope to get with a nutrition RCT. However the <a href=\"https://pubmed.ncbi.nlm.nih.gov/17726038/\">cohort description</a> makes no mention of this, and the 7DA I talked to said that it wasn't his experience: individual churches varied a little in their recommendations, but people within the same church varied a little in their choice of diet. This seems corroborated by the fact that meat eating is associated with ~every bad thing.</p><p>Also if I'm reading this correctly, the rank ordering of death rates is<br>for women: pescatarian &lt; lacto-ovo-veg &lt;vegan &lt; omnivore &nbsp; (lower is better)<br>for men: pescatarian =~ vegan &lt; lacto-ovo vegetarian &lt; omnivore<img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/oq9n8xuzv10hhgnqho7o\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/ft23rzji1p8ho6p0shhc 146w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/iu7recsujwmyeczqw6on 226w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/dagxticofghavmtxmt8d 306w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/qgpzohsgmmsunnyuvjdv 386w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/h8gmld1ygrjgt4xt8jws 466w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/t4vtluo8dkle4jvt0jui 546w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/bhw76qqyq5tjn7xuhhac 626w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/d6wikpxuuaxyqfobja9f 706w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/atypl55dykobfzqcdumg 786w\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/b6iup9a7hqg8gesklngj\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/k5wd2gha4erpwljuuhet 132w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/bx6hyo40a2pg42qhxodf 212w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/nbytdfk1g5gxm1agk55w 292w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/jxi2kzjvrbg26kowqlss 372w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/tmprsogqku5sslaioqtt 452w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/ouso0qytaqrmldv1ot3i 532w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/dsainxkwrcw4ejezdswr 612w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/w8dv89ztfgma1w2qagtd 692w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/f8CDgZzeLFWWC5auF/oar1qnvahtlchbfphsg9 772w\"></p><p>I have several questions on how you did the statistics, would you be willing to talk more over email?</p>", "parentCommentId": "fNxwRxnqB5LKNC8na", "user": {"username": "Elizabeth"}}, {"_id": "6kxpzdB85e7dKoCEu", "postedAt": "2023-06-09T06:43:32.316Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>This is the first decent post I’ve read on the subject on this forum. Thank you, it gives me hope that EA has not completely lost the plot when it comes to the intersection between animal advocacy and diet.</p>\n<p>I would add that for those of us that eat a Mediterranean diet, Veganism presents a significant trade-off in terms of diet quality.</p>\n<p>For those of us in Southern Europe, it also has a trade-off on environmental impact due to the nature of agro-silvo-pastoralism here (although that is outside of the scope of a mere forum comment).</p>\n", "parentCommentId": null, "user": {"username": "Duarte M"}}, {"_id": "PavpXdn5vC9aWNdBz", "postedAt": "2023-06-11T07:06:43.996Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I'd say a healthy vegan diet is roughly as difficult as a healthy omnivorous diet, and a convenient vegan diet is roughly as easy as a convenient omnivorous diet.</p>", "parentCommentId": "8GnMhqKtuXcTiBWCK", "user": {"username": "Stijn"}}, {"_id": "mwp5phPELTDcjBDLT", "postedAt": "2023-06-11T07:21:32.030Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I agree with your two sentences, but the first one is very ambiguous. You mention someone with a B12 deficiency. The way I see it, both vegans and omnivores remove sources of B12 from their diet: the vegan doesn't eat animal products that contain B12, the omnivore doesn't eat B12 supplements (or B12-enriched products that are suitable for vegans). Many omnivores even refuse to eat those vegan B12 supplements, just like vegans refuse to eat meat. Now you have someone who doesn't eat either of those B12 sources: no meat and no vegan supplement. You can call it a too restrictive, unhealthy vegan diet (because the diet doesn't contain meat), but you can equally call it a too restrictive, unhealthy omnivorous diet (because the diet doesn't contain vegan B12-sources). There is a kind of symmetry.</p>", "parentCommentId": "RucegEG4f3xCyZfty", "user": {"username": "Stijn"}}, {"_id": "zeWveRrEy8ZvWsRj3", "postedAt": "2023-06-12T06:24:53.677Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>This feels very muddled to me. Could you rewrite it with your explicit cruxes/assumptions/beliefs, and the logical chain between them and your conclusion?&nbsp;</p>", "parentCommentId": "mwp5phPELTDcjBDLT", "user": {"username": "Elizabeth"}}, {"_id": "sdzfjbxD9QvKnACrk", "postedAt": "2023-06-14T11:10:53.231Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Ah sorry, I seem to have slightly misled you. The quote which you attribute to Scott is actually written by me and the co-author of an adversarial collaboration hosted on Scott's old blog. I'm not the author of the Adventist Health Study linked, much that I wish I was!</p><p>If you have questions about the statistics in the adversarial collaboration I'd be more than happy to talk through the approach we used. If you have questions about AHS2, by all means let's share the work of finding the answer but I can't promise to be any more help than any other random person you'd pick off the street</p>", "parentCommentId": "f8CDgZzeLFWWC5auF", "user": {"username": "Froolow"}}, {"_id": "mYwzeJijWdzZw2aAg", "postedAt": "2023-06-17T04:11:04.826Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Getting the paper author on EAF did seem like an unreasonable stroke of good luck.</p><p>I wrote out my full thoughts <a href=\"https://acesounderglass.com/2023/06/14/adventist-health-study-2-supports-pescetarianism-more-than-veganism/\">here, </a>before I saw your response, but the above captures a lot of it. The data in the paper is very different than what you described. I think it was especially misleading to give all the caveats you did without mentioning that pescetarianism tied with veganism in men, and surpassed it for women.&nbsp;</p>", "parentCommentId": "sdzfjbxD9QvKnACrk", "user": {"username": "Elizabeth"}}, {"_id": "LNzFmHKkRJXjMwzRb", "postedAt": "2023-06-22T18:33:56.802Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I want to talk about the risks of meat consumption in the next post. Is <a href=\"https://pubmed.ncbi.nlm.nih.gov/32889521/#:~:text=In%20the%20process%2C%20consumption%20of,%2C%20obesity%2C%20and%20other%20disorders.\">the post you link to here</a> your favorite source, or is there another you think is better? &nbsp;</p>", "parentCommentId": "gTzqTf6h2Kaaqf9ix", "user": {"username": "Elizabeth"}}, {"_id": "bDeKjruXrCEc8TFtS", "postedAt": "2023-06-24T13:43:45.648Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I was pointing at a non-vegan bias in the way how you framed your argument: that a vegan diet is restrictive. But non-vegans also eat a restrictive diet, as they don't eat (and often refuse to eat) vegan foods. Vegans don't eat non-vegan sources of B12, and non-vegans don't eat vegan sources of B12.&nbsp;</p><p>Your bias is comparable to a native English speaker who has an English bias and claims that French is a difficult language because the French people don't use those simple words like \"door\" and \"table\". So when you want to speak French, you first have to learn new words. But the fact that the French language doesn't use the words that you use, doesn't make it a difficult language. For native French people, French is an easy language.</p><p>So the crux is: a vegan diet is not difficult, but changing diet is difficult. For vegans (who learned how to eat vegan), a vegan diet is easy, just like a non-vegan diet is easy for non-vegans (who learned how to eat non-vegan).</p>", "parentCommentId": "zeWveRrEy8ZvWsRj3", "user": {"username": "Stijn"}}, {"_id": "6L3pdJHuQKW9Ni4zm", "postedAt": "2023-06-24T15:09:02.211Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I don't think the claim that non-vegans don't eat vegan foods is well-supported. For instance, a cake made with eggs and butter still consists of mostly vegan foodstuffs; that a non-vegan may refuse to eat a vegan cake does not mean they are restricting specific foodstuffs from their diet. Likewise, non-vegans do not categorically refuse to eat vegan B12 supplements (I assume the B12 in a multivitamin is made in a lab?) even if they do not eat them as part of 100 percent vegan completed foods.</p>\n", "parentCommentId": "bDeKjruXrCEc8TFtS", "user": {"username": "Jason"}}, {"_id": "y529APmihRtfozr3A", "postedAt": "2023-06-25T07:40:13.887Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Most non-vegans don't take vegan B12 supplements. That means this vegan product is excluded from the non-vegan's diet. The reason why non-vegans exclude it (whether they don't like it, consider it as immoral...), is not important because reasons are not health related. Whether or not someone who doesn't take the B12 supplement categorically refuses to take it, has no impact on that person's health.</p>", "parentCommentId": "6L3pdJHuQKW9Ni4zm", "user": {"username": "Stijn"}}, {"_id": "voTMbBgxDts78sCBu", "postedAt": "2023-07-15T07:47:51.942Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I agree with some of this post and more of the comments, but I want to focus on one thing. The \"veganism has tradeoffs\" frame isn't helpful; it's much too ambiguous.</p><p>Three main claims can distilled here. You may be claiming that&nbsp;</p><ol><li>Advocacy orgs focusing on diet change should be de-emphasized on the margin.</li></ol><p>and/or</p><p>&nbsp; &nbsp; &nbsp; 2. *I*<i> </i>the reader, the audience of this post should de-emphasize the urgency of diet change in my personal life on the margin.</p><p>and/or</p><p>&nbsp; &nbsp; &nbsp; 3. Systemically and/or individually, some sort of non-vegan diet change should be focused on, eg vegetarianism, no-chicken diet, reductarianism, meat-free mondays, etc</p><p>&nbsp;</p><p>I usually assume that blog posts, unless otherwise specified, are meant to be targeted to their readership. If this was just explicitly directed around 1, I may have a different response.</p><p>I don't think most vegan EAs have the problems listed. I won't exclude the possibility of a few rare cases, people who have peculiarities of some sort that makes veganism unhealthy, but lets focus on 3 for the next best thing then!</p><p>If I was to bet on it, I'd say that +90% of vegan EAs are aware of B-12 deficits and either take supplements or seek out supplemented foods. &nbsp;</p><p>Insofar as there are vegan diets not \"properly planned\" they occur among the health crowd (which outnumber the pro-animal vegans), those who believe it to be some sort of panacea for their ills or distrust the medical establishment. I could be wrong about this general claim, but I think it's roughly correct. (I agree about the need for better studies which control for supplement use!)</p><p>Back to number 3. I appreciate that you mention the issue with concern trolls and you briefly allude to \"vegetarianism being much nutritionally closer\", but I really wish people would be more explicit about this. Far, far, to many (purposefully or not) use criticisms of veganism as a way to avoid personal responsibility.</p>", "parentCommentId": null, "user": {"username": "Dylan Richardson"}}, {"_id": "AsbK7chff9f4uJh9n", "postedAt": "2023-09-11T23:47:45.827Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>a vegan diet is not difficult, but changing diet is difficult. For vegans (who learned how to eat vegan), a vegan diet is easy, just like a non-vegan diet is easy for non-vegans (who learned how to eat non-vegan)</p></blockquote><p>&nbsp;</p><p>Accepting this arguendo, it doesn't seem like an argument against education for vegan converts.</p>", "parentCommentId": "bDeKjruXrCEc8TFtS", "user": {"username": "Elizabeth"}}, {"_id": "rAoASwPKJfHT77byc", "postedAt": "2023-09-12T00:48:18.150Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>What is your confidence level in the RCT you cite? Any shortcomings I should know about?</p>", "parentCommentId": "a2KvXxnmuyMbpE3Fp", "user": {"username": "Elizabeth"}}, {"_id": "jHSztuiRjYynZKbhw", "postedAt": "2023-09-13T20:57:38.950Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I don't understand really what \"confidence level in the RCT\" means? The main shortcoming is that it's an education based intervention, not a strict \"lock them up in a hospital and give them precisely calculated meals\" (see Kevin Hall's NIH experiments for something like that <a href=\"https://youtu.be/zOAapJo9cE0?feature=shared\">https://youtu.be/zOAapJo9cE0?feature=shared</a> ). The second is the small sample size.</p>\n<p>However I'd also like to point out that for something like diet, you need both long-term epidemiology and short-term RCTs. Throwing out epidemiology is throwing out the way we figured out smoking was super bad for your health.</p>\n<p>For further details, please see</p>\n<p><a href=\"https://youtu.be/S8Pm-m87sEc?feature=shared\">https://youtu.be/S8Pm-m87sEc?feature=shared</a> starting 11:20</p>\n<p><a href=\"https://youtu.be/POhkKgBeA1A?feature=shared\">https://youtu.be/POhkKgBeA1A?feature=shared</a> starting 20:39</p>\n<p><a href=\"https://youtu.be/nnyzuY-Xwe4?feature=shared\">https://youtu.be/nnyzuY-Xwe4?feature=shared</a> starting 23:03</p>\n<p>I have come to the conclusion that Nutrition Research is actually doing fine as a field and food companies have used the same playbook to confuse us as the fossil fuel companies did to confuse people about climate change (see Marion Nestle's work, summary here <a href=\"https://youtu.be/a7SprgZTK2o?feature=shared\">https://youtu.be/a7SprgZTK2o?feature=shared</a> starting 8:39)</p>\n", "parentCommentId": "rAoASwPKJfHT77byc", "user": {"username": "Dhruv Makwana"}}, {"_id": "bxoim44BFPRWzGc4M", "postedAt": "2023-09-14T00:36:12.830Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>By confidence level I mean something like \"how confident are you in the methodology of this study\", which could be operationalized as \"how much would this change your mind if you didn't already agree with it?\". I'm specifically not asking how confident you are in the study's conclusion: bad studies demonstrate true things all the time.</p><p>I ask because checking studies is a lot of work, and it's frustrating to spend several hours reading a paper, only to have a person dismiss fatal flaws by citing a different paper (that is equally flawed, but will also take hours to nail down). No data is perfect so I don't have the luxury of throwing flawed studies out, but asking for a declaration of flaws felt like a good compromise to me. &nbsp;</p><p>For example, in addition to the issues you list with the study you cited, I see several more just from the abstract:</p><ol><li>The study population was selected to have health issues exacerbated by Standard Shitty American Diet.<ol><li>As I said in the post, I have zero interest in defending SSAD, and believe most people consume too much meat to the detriment of their health.&nbsp;</li><li>This is the equivalent of taking anemic vegans and putting them on a well-administered high-meat diet. It probably wil raise the iron levels of study participants, and that may represent a net improvement in their health, but it wouldn't prove naive high-meat diets superior to veganism in the general population.</li></ol></li><li>the difference in change in cholesterol levels between plant-based and control was not statistically significant.&nbsp;<ol><li>The difference in BMI change is quite statistically significant, and large (4 BMI points).</li></ol></li><li>BMI and cholesterol were the only end points, not mortality or cardiac events</li><li>The dropout rate was pretty bad (25%), although ~equal between treatment and control group so not nearly as distorting as it could have been.</li><li>The control group was on SSAD, rather than an equally effortful meat-containing diet.&nbsp;</li><li>The intervention group received B12 and pretty extensive nutrition education, which is the exact thing I complain about EA vegans not doing.</li></ol><p>The videos you link to are comparing veganism to keto or very high-meat diets- which I already agreed are probably bad for most people. I wish you had declared that as well.</p><p>I fully agree large ag companies have been waging a multi-decade war on nutrition epistemics. That's one reason I discount nutritional research, and I'm confused why you take the war as a reason to trust it.&nbsp;</p>", "parentCommentId": "jHSztuiRjYynZKbhw", "user": {"username": "Elizabeth"}}, {"_id": "HCjgBE8y9YMfqgEg7", "postedAt": "2023-09-14T17:50:16.046Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thanks for your comment and clarifying, I appreciate the effort, I realise it is difficult to converse about these things whilst retaining respect and sanity.</p>\n<p>This RCT came to mind not because it meets all your criteria, but because I thought it was relevant (especially non-monetary costs, i.e. quality of life) to the criteria you set out, modulo multiple months rather than years. It also I think alleviates some concerns about unfeasibility you think vegan diets.</p>\n<p>\"ideal study is a longitudinal RCT where diet is randomly assigned, cost (across all dimensions, not just money) is held constant, and participants are studied over multiple years to track cumulative effects.\"</p>\n<p>I didn't mean to suggest this study implies that a WFPB diet is healthier than (for example) WFPB+(Fish 2/week). I don't think that sort of question is resolvable on the current evidence either way.</p>\n<p>I am sorry I was not clearer about what the video links were saying - I didn't mean to imply about high meat vs vegan etc. I linked the first one to signpost a scientist who does tightly controlled experimentals setups (perhaps too tersely) but not specifically on WFPB vs WFPB+(Fish 2/week).</p>\n<p>The next 3 were about epidemiological evidence that reducing meat consumption follows a strong dose response relationship. While we can't rule out there could be an uptick in negative outcomes at eliminating, agnosticism seems like the right call.</p>\n<p>I don't take the war as reason to blanket trust nutrition research (or blanket doubt) either, but to be suspicious of conclusions that favour industry and look to a few well done studies and well-respected researchers that have stood the test of time.</p>\n<p>Thank you for writing this and if it's any help, your article is what prompted me to eventually find Plant Chompers and soften to your position to my current agnosticism about the optimality of WFPB vs WFPB+(Fish 2/week). While I do have concerns about some of your baselines assumptions (see initial comment), I think it's admirable to spend hours on each paper. You might find it beneficial to reach out to Chris Macaskill and collaborate on this projects with him - I suspect he's got much more time and knowledge than me!</p>\n<p>For the sake of my time, this should hopefully be my last comment on this post. Apologies for misleading or inconveniencing you in any way.</p>\n", "parentCommentId": "bxoim44BFPRWzGc4M", "user": {"username": "Dhruv Makwana"}}, {"_id": "hksLgQMGpy8MfS6yA", "postedAt": "2023-09-14T22:23:38.048Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Thank you, I really appreciate everything you said here. I respect your desire to bow out and hope it is okay for me to say a few things.&nbsp;</p><p>I think \"meat seems dose-dependently bad, and it would be weird if that reversed at low levels\" is one of the strongest arguments I've heard. I have a bunch of specifics I'd want to follow up on, but I think the argument is both well-formed and has considerable evidence behind it.&nbsp;</p>", "parentCommentId": "HCjgBE8y9YMfqgEg7", "user": {"username": "Elizabeth"}}, {"_id": "ar69sw2cHekjp2mrq", "postedAt": "2023-09-18T02:47:22.613Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p><strong>the counterargument is decisively strong—the health costs of veganism are scarcely worth discussing.</strong></p></blockquote><p>&nbsp;</p><p>this sounds like you believe the health costs of veganism are unfixable without animal products. Is that the case?<br>&nbsp;</p>", "parentCommentId": "qaE875imfkG2pNzQe", "user": {"username": "Elizabeth"}}, {"_id": "4dMixZMCGwGkPxaWL", "postedAt": "2023-09-20T06:27:37.866Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I'm really confused that you'd invoke a paper to tell people their experience of their own hunger is wrong.&nbsp;</p>", "parentCommentId": "DihPpSEA9xkruEafa", "user": {"username": "Elizabeth"}}, {"_id": "PCtf2KF5spamzyA7s", "postedAt": "2023-09-21T22:25:38.004Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Before I reply, I'd like to acknowledge that my original comment from 3 months ago, much before our recent, cordial and respectful exchange elsewhere on this post, was probably a 6-6.5/10 in terms of tone and clarity, and could have been made more conducive to discussion: sorry.&nbsp;</p><p><strong>I'd also like to say upfront that I am very reluctantly spending 150+ minutes getting nerdsniped into writing this comment during a week when I'm aiming to address a sleep deficit, and as I said in my other comment, \"For the sake of my time, this should hopefully be my last comment on this post.\", but this time for real.</strong></p><p>I realise making a point and walking away can come off frustrating/rude, but that's not my intention here, it's just self-preservation. If that's objectionable, you may ignore the rest of this comment.</p><p>But to your basic point - my point is not that \"people are wrong about their feelings of hunger\" (which off the top of my head, and my experience, I think they can be - for example mistaking stress/discomfort/boredom for hunger - but this is besides the point).&nbsp;</p><p>My point is about the <i>primary</i> <i>attribution</i> of the cause of the subjective feeling of hunger to a not easily perceptible thing such as protein. My intuition comes from subjective wellbeing (e.g. Stumbling on Happiness by Dan Gilbert) and also perception/embodied cognition research (e.g. rubber hand illusion). The <i>attribution</i> is an empirical claim, and that's what I was (very poorly) getting at.</p><p>As part of this empirical attribution, there's two different concepts at play here: satiation and satiety (yes, silly naming). Satiation is how much of food can be consumed in one sitting. Satiety is how much a given food will delay or decrease calorie intake in the next meal.</p><p>From the post:</p><blockquote><p>But there isn’t a satisfying plant product that is as rich in as many things as meat, dairy, and especially eggs.&nbsp;</p><p>But there isn’t a satisfying plant product that is as rich in as many things as meat, dairy, and especially eggs. Every “what about X?” has an answer, but if you add up all the foods you would need to meet every need, for people who aren’t gifted at digestion, it’s far too many calories and still fairly restrictive.</p></blockquote><p>From the comment:</p><blockquote><p>Because protein is the hardest and most valuable macronutrient for most diets, and because it's correlated with the subset of vitamins that's richer in meat sources.</p></blockquote><p>It looks like there's two aspects to this: (a) judging plants using meat as the standard (b) an implicit assumption that protein is (b) important, (c) especially \"satisfying\"-ness, i.e. satiation and satiety.&nbsp;</p><p>[Tangent: I think others have pointed out that (a) is a little unfair - meat doesn't have many health promoting things like Vit C, fibre, antioxidants, easier to regulate absorption of nutrients, lack of cholesterol, less saturated fat etc.]</p><p>In response to (b) the first video about the very low protein requirement for humans I think covers the major aspects (babies need the most protein and human breast milk is 1% protein by weight, 5-7% by calories, adults need around 0.8g/kg of body-weight, maximum up to 1.5-1.8g/kg for strength training etc).</p><p>In response to (c), a whole host of other factors influence satiation and satiety (as mentioned in video 2 and elsewhere<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref42r6mn5yqi3\"><sup><a href=\"#fn42r6mn5yqi3\">[1]</a></sup></span>).</p><ul><li><strong>Calorie density, influenced mostly by lack of fats and increased water. </strong>Quoting Dr. Greger, \"When dozens of common foods, pitted head-to-head for for their ability to satiate appetites for hours, the characteristic most predictive was not how little fat or how much protein it had, but how much <i>water</i> it had.\" (https://pubmed.ncbi.nlm.nih.gov/7498104/). Whole fresh fruit &amp; veg generally fall in at &lt; 100 calories per cup, whereas meats are 300-600 calories per cup.</li><li>&nbsp;<strong>Fibre. </strong>Fibre limits the absorption of calories, meaning that you can eat more but still absorb the same amount of calories.</li><li><strong>Absorbability. </strong>Conversely, processing (e.g. turning peanuts into peanut butter) separates the peanut's calories from the fibrous cell walls and thus making it more vastly more absorbable. Animal product do not have a fibrous cell walls, meaning they are absorbable off the bat. This means <i>lower</i> satiation per calorie - you eat more calories in a stomach full.</li><li><strong>Thylakoids. </strong>The thing that makes leaves green slows down fat absorption in the gut. Slowing down fat absorption means that un-absorbed calories can reach the end of the intestine (ileum). When this is detected, appetite is decreased dramatically.</li><li><strong>Hardness of food</strong>. Same food, presented hard or soft (e.g. carrots) leads to fewer calories being consumed but no extra calories as compensation in the next meal.</li></ul><p>To be clear, <i>I am willing to grant the premise that \"protein &gt; carb &gt; fat\" in terms of satiation</i>. But this would not be the end of the matter, because cardinality matters too. I don't want to spend an hour digging for numbers at this stage, but I can illustrate what I mean with an example:</p><ul><li>Chicken/beef roughly 45% calories from protein (rest from fat).</li><li>Chickpeas roughly 22% calories from protein (rest from carbs incl. fibre).</li><li>Dry soya chunks rougly 57% calories from protein (rest from carbs incl. fibre).</li></ul><p>Based only on macros (let's say you blitzed the chickpeas into ultra fine hummus and equalised the water content), which of these is going to be more satisfying is going to depend on the ratio of <i>how much</i> less satisfying carbs and fat are (per calorie) compared to protein. And it's not clear to me based solely on protein being most important that meat has a slam dunk advantage here.</p><p>Anyways, as I said in the other comment, I'm going to signpost Chris MacAskill as a source of information and potential collaborator. Toodles!</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn42r6mn5yqi3\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref42r6mn5yqi3\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Chris MacAskill's <a href=\"https://youtu.be/zOAapJo9cE0?feature=shared\">https://youtu.be/zOAapJo9cE0?feature=shared</a> high-protein, animal keto vs low-fat, plant-based diet especially the section on satiety vs satiation, which is the source of my information in this comment.</p></div></li></ol>", "parentCommentId": "4dMixZMCGwGkPxaWL", "user": {"username": "Dhruv Makwana"}}, {"_id": "oLNkzHq399TCLmX3t", "postedAt": "2023-09-28T23:36:13.162Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>First, I want to apologize. I didn't realize you were the same commenter I'd been talking to and had asked to bow out. I'm not sure what the right way to handle this was, but I should have at least acknowledged it.</p><p>I have some disagreements with some of your claims here, but mostly they feel irrelevant to my claims. This feels like an argument against a heavily meat-based diet, not against small amounts of meat in an otherwise plant-based one.</p>", "parentCommentId": "PCtf2KF5spamzyA7s", "user": {"username": "Elizabeth"}}, {"_id": "uCJ9b4YsMmwEBtGow", "postedAt": "2024-01-10T01:36:19.547Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>Some people are already struggling to feed themselves on an omnivore diet, and have nothing to replace meat if you take it away.</p></blockquote><p>This statement seems a bit exaggerated and emotionally charged. Do you think that having literally “nothing to replace meat if you take it away” is a serious problem for more than, say, one in 10k<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref7qfvy4lz7yv\"><sup><a href=\"#fn7qfvy4lz7yv\">[1]</a></sup></span>&nbsp;people? Meat is not known for being particularly cheap or easily available. It doesn’t grow on trees. More than a billion people live without it. Even when it comes to protein, grains and legumes are a cheaper source than meat.&nbsp;</p><p>Does this sentence refer to people like the small percentage of Inuit who still hunt for most of their food? Vegan outreach is not targeted at such people, so it doesn’t seem relevant to bring it up.</p><p>Maybe by “some people” you did mean something like “one in 10k” or way fewer people in which case the claim could be true. But then it’s useful to make that clear. The way it’s written, it sounds like the purpose of the sentence is mostly to generate an emotional reaction in the reader. A vegetarian could say “a single bite of meat can kill you.”&nbsp; It would be a true sentence because you can get fatal food poisoning from a single bite of meat. But it would have little place in serious, level-headed discussions. And again, people who actually have the problem you described are not the target of vegan advocacy, so it's not clear why you're bringing this up.</p><p>Maybe what you meant to say was “some people would have a harder time following a healthy diet without animal products.” But if so, why didn’t you write that instead?</p><blockquote><p>Animal products are incredibly nutrient dense. You can get a bit of all known nutrients from plants and fortified products, and you can find a vegan food that’s at least pretty good for every nutrient, but getting enough of&nbsp;<i>all</i>&nbsp;of them is a serious logic puzzle unless you have good genes.&nbsp;</p></blockquote><p>This claim also seems to be a bit overstated and emotionally charged. I guess it could be technically true if the vast majority of people “have good genes” according to your definition, but the way you write it makes it sound like having “good genes” is an exception.&nbsp; What nutrients specifically are you concerned about? B12 and multivitamins are extremely cheap. This pea protein <a href=\"https://www.amazon.com/America-Organic-Flavonoids-Minerals-Friendly/dp/B01DWUEQ7C/\">powder</a> with good reviews is as cheap per gram of protein as chicken breast at my local Costco, and very protein-dense. This makes it cheaper than almost all animal protein sources. Grains and legumes are even cheaper per gram of protein but less protein-dense. Eating a few cheap pills each day and a scoop of protein powder or legumes doesn't sound like “a serious logic puzzle.”</p><p>Also, how are animal products “incredibly nutrient dense”? What nutrients are you referring to? Do you mean per calorie, or per dollar, and compared to what? Micronutrients are much cheaper in supplements than in animal products.&nbsp;</p><blockquote><p>Food allergies and digestion issues mean lots of people struggle to feed themselves even with animal products; giving up a valuable chunk of their remaining options comes at a huge cost.</p></blockquote><p>This sentence has the same hyperbole problem. “Struggle to feed themselves” conjures images of people who literally struggle to get enough calories to survive. Some people do struggle to get enough calories to survive because they’re allergic to a lot of foods, but they're not the target of vegan advocacy. This problem is incredibly rare among wealthy young Westerners. What you probably meant to say is that some people have a hard time having a perfectly healthy diet because of their food allergies. In which case you should just have said that instead.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn7qfvy4lz7yv\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref7qfvy4lz7yv\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I would be surprised if the claim was true for anywhere near that number of people.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "2zebLpALme3L5FcgY", "postedAt": "2024-01-11T00:01:28.197Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>Is there a reason this comment got a pretty big strong downvote? I'm willing to hear reasons why the sentences I quoted are relevant in level-headed discussions about vegan advocacy, and why they couldn't be substituted with \"some individuals may struggle to maintain a healthy diet as vegans.\"</p>", "parentCommentId": "uCJ9b4YsMmwEBtGow", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "avKFdzheocb4wtpBx", "postedAt": "2024-01-14T20:24:58.846Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I downvoted you because you responded to a very legible and effortful post (after going to a lot of trouble <a href=\"https://forum.effectivealtruism.org/posts/LwdcFT5MwiyS5TqLr/lessons-learned-from-offering-in-office-nutritional-testing\">testing EAs and finding them nutritionally deficient to the point where it might affect their work</a>), a post making the author's cruxes clear, and what kind of evidence would change her mind, with incredulity, accusations of bad faith, and a brazenly made-up number. I don't find any of your later arguments to be of sufficient quality to reverse that judgment.<br><br>The obvious case where someone might be hard pressed to be healthy on a vegan diet is when someone has allergies to multiple things that are ingredients in many of the common vegan protein staples. This is common enough that I've met ex-vegans who had to compromise on their diet for this reason, as well as a vegan who seemed very clearly nutritionally deprived because of FODMAP and gluten allergies but was toughing it out regardless for ethical reasons, so I'd be quite surprised if you've never met someone with multiple allergies that severely constrict their vegan options for getting the full spectrum of known nutrition. (Supplementation can help but is often less effective than nutrients in their original context.)</p><p>\"Some cultures don't eat meat\" does not in fact prove that nobody has nutritional deficiencies from not eating meat; some people in those cultures may be nutritionally deficient for that reason! That's like saying that because bread was ubiquitous in Europe, no Europeans have issues with gluten.</p>", "parentCommentId": "2zebLpALme3L5FcgY", "user": {"username": "orthonormal"}}, {"_id": "gADyF94QMbCsasef2", "postedAt": "2024-01-15T01:25:47.677Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<p>I would find the existence of vegan cultures to be substantial evidence, if they existed. I <i>do</i> find the existence of lactovegetarian cultures compelling; that is part of why I think milk is a pretty sufficient meat replacement for some people. But AFAICT there <a href=\"https://www.quora.com/Are-there-any-cultures-that-are-entirely-vegan\">aren't any vegan cultures</a>. There are vegan traditions making up a minority of certain cultures (although there are allegations that it's more aspirational than obeyed, and because I think it only takes small amounts of meat to gain the nutritional benefits they count as omnivore for my purposes), and there are cultures that can't afford meat and start eating it once they do (and their health improves with it, although of course wealth can improve health lots of ways).</p><p>But the existence of successful lactovegetarian cultures doesn't make lactovegetarianism a health choice for members of east Asian, sub-Saharan African, or Native American cultures<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdwga38ujfra\"><sup><a href=\"#fndwga38ujfra\">[1]</a></sup></span>&nbsp;whose members are overwhelmingly lactose intolerant. It doesn't even make it a healthy choice for northern Europeans with lactose intolerance, even though they're an anomaly in their culture.&nbsp;</p><p>There is some interesting work being done now on genetic differences between vegetarians and omnivores. I don't put a lot of credence in any one finding at this point, but it <i>makes sense</i> that cultures would adapt their genetics around what food was available to them, and those adaptations would affect the optimal diet of their descendants. It would be weird if that didn't happen.</p><p>FDD, if you want to quantify and make a case for your belief that people who struggle to eat well on a vegan diet are vanishingly rare, I would welcome that, and have laid out what evidence I would find most convincing.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndwga38ujfra\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdwga38ujfra\">^</a></strong></sup></span><div class=\"footnote-content\"><p>genetics is of course more complicated than this. Continents are not good places to draw genetic lines, there are cultures within those groups that have high rates of lactose tolerance, although off the top of my head they're all pastoralists and so decidedly not vegetarian.&nbsp;</p></div></li></ol>", "parentCommentId": "avKFdzheocb4wtpBx", "user": {"username": "Elizabeth"}}, {"_id": "HbGf45qJLqgfH6HzY", "postedAt": "2024-01-17T03:35:23.487Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": "<blockquote><p>a brazenly made-up number</p></blockquote><p>I said a specific number for two reasons: to express my personal opinion and to ask if the author disagrees. I thought that was clear. Without saying a number, I would not be able to check if there is any disagreement.</p><blockquote><p>what kind of evidence would change her mind</p></blockquote><p>My comment was not about presenting evidence or changing minds about veganism. I agree with the sentences I quoted and with what you wrote in your second and third paragraphs. But, even true statements can be misapplied. Would you object to a vegetarian saying \"a single bite of meat can kill you\"? I would in most contexts.<br>&nbsp;</p><p>ETA<br>&gt; \"Some cultures don't eat meat\" does not in fact prove that nobody has nutritional deficiencies from not eating meat<br>Where did I say that nobody has nutritional deficiencies from not eating meat?</p>", "parentCommentId": "avKFdzheocb4wtpBx", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "mruYqDHyg49sSKgM6", "postedAt": "2023-06-06T14:18:29.938Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": null, "parentCommentId": null, "user": null}, {"_id": "PoTs98vdCeL3tqWsT", "postedAt": "2023-06-06T14:18:46.537Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": null, "parentCommentId": null, "user": null}, {"_id": "DA8zdtpSnSaCLcG5L", "postedAt": "2023-09-21T22:24:38.047Z", "postId": "3Lv4NyFm2aohRKJCH", "htmlBody": null, "parentCommentId": "4dMixZMCGwGkPxaWL", "user": null}]