[{"_id": "7vws2MrGNBGWMmQuk", "postedAt": "2022-12-17T16:20:05.189Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>\"What can we do to help improve this situation?\"</p><p>Before we assume there is a situation that needs to be improved, it is important to make clear that there is a problem. The existence of an article from someone in an extremely poor place saying that EA has not helped his community is not compelling evidence that there is a problem with how EA is using its resources.<br><br>The total cash flow through from AMF, the deworming programs and Give Directly through their whole history is probably in the area of 1-2 billion dollars. Or something like 2-4 dollars per extremely poor person.<br><br>Obviously this hasn't made a big direct impact on the day to day life of a random poor person in a random poor country . It isn't enough money.</p><p>So the question that we actually want to answer is: Given the actual quantity of resources we have available to put towards extremely poor countries, would that tiny amount of resources do more good per dollar if we adopted the proposals put forward here? Alternatively, would these proposals allow us to mobilize more rich Western person money, until there is enough being donated to actually fill the holes?</p>", "parentCommentId": null, "user": {"username": "timunderwood"}}, {"_id": "uMCrRJ9QmRX2HGJqr", "postedAt": "2022-12-17T17:00:34.137Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Let's talk about two ways of granting money to small, hard-to-evaluate projects to help people in extreme poverty.</p><ul><li>One is the method Kalulu is calling for, which is donating to small, local, grassroots charities like his Uganda Community Farm. UCF has existed since 2013. They grow crops at their farm, then train other farmers to do the same, give them material inputs, and build a pipeline to market for their collective output.<ul><li>They have 4-7 people on their team, have a tiny budget (\"$0 for the most part\"), and work with 300-400 farmers, of whom about 50 have made a switch in what they plant. After stopping their sorghum operations during 2020-2021 due to COVID-19, they are back. They also have a vision of building an agro-processing plant, which they estimate would cost $1 million for farmer support and cassava, cereal and grain processing, and a further $14 million for an additional component for processing fruit.</li></ul></li><li>The other is donating directly to individuals living in extreme poverty, to spend the money as they see fit. This is what GiveDirectly, founded in 2008, does.<ul><li>On their website, requests come with the potential recipient's own story about why they are requesting a grant. Isaiah, 26, of Pleebo, Liberia, says \"Since I dropped out of school in 2019 when I was in the eleventh grade, I am happy that GiveDirectly has given me the hope of restarting my education... One of the main things that I am thinking of right now is to invest in a mini business wherein I will be buying goods from Pleebo and taking them to my community to be sold. The proceeds from my business will provide funds to forward my education.\"</li></ul></li></ul><p>One rebuttal to Kalulu's argument about the superior persistence of local, grassroots organizations is that UCF did have to stop its operations for about two years due to COVID-19. Certainly, that's not UCF's fault, and I feel sympathy for their hardship. I also admire Kalulu's work to lift himself and his neighboring farmers out of extreme poverty.</p><p>But by contrast, GiveDirectly not only maintained its operations during COVID-19, but created a new program for COVID-19 support that distributed $76 million to 342,000 African families. They can do this because they can wire money directly to recipients. GiveDirectly is also experimenting with 2-year and 12-year basic incomes for 40 villages.</p><p>Kalulu's article is hard to interpret because he doesn't name the \"one [well-funded] international charity which is among those described by the EA movement as being 'effective'.\" He says they're also working with local farmers on maize, which he thinks is a bad choice relative to sugarcane and other cash crops. I don't know what charity he's referring to, but perhaps they should hire Kalulu for some kind of local consulting role?</p><p>But I don't think his descriptions of EA charities are accurate. GiveDirectly is giving people money to do with as they choose, and is experimenting with long-term commitments to UBI. Their operations are continuous. That does not strike me as the transient, passive charity Kalulu's critiquing. AMF has existed since 2004, GiveDirectly since 2008, and both have maintained continuous operations since then. It's not at all a fair comparison, but UCF is 5-9 years younger as an organization, and has faced ~two years of stoppped or slowed operations due to COVID-19. I'm sure their situation would have been different, had they been better funded, but I think it's important to respond to the specific arguments Kalulu is making in his article.</p><p>Overall, I would not support donating to local, little-vetted grassroots charities with a modest track record of success to the tune of millions of dollars. I would be open to an experiment with donating to local grassroots charities in smaller amounts. For example, each of the ~6,000 recipients of GiveDirectly's long-term basic income experiment will receive a total of $3285 over the lifetime of the experiment. Donating about $3,000 to a set of 6,000 randomly-selected local grassroots charities &nbsp;in impoverished regions (perhaps focusing on ones that have already existed for at least 3-5 years) seems like a reasonable way to experiment with spending $18 million.</p>", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "qQfCcv6YNbJSYtXND", "postedAt": "2022-12-17T17:47:36.502Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>deleted because Karthik clarified what the OP meant.<br>&nbsp;</p>", "parentCommentId": "7vws2MrGNBGWMmQuk", "user": {"username": "Lauren Maria"}}, {"_id": "7tbkavdpeDPntG56R", "postedAt": "2022-12-17T18:06:26.538Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>The only EA aligned charity I can find doing  anyrhing in Africa with maize is the food fortification initiative, although they don't really fit Anthony's description, so he may be referring to a different EA aligned charity</p>\n", "parentCommentId": "uMCrRJ9QmRX2HGJqr", "user": {"username": "Gideon Futerman"}}, {"_id": "NjtDh6K26JtRbeZiv", "postedAt": "2022-12-17T18:09:34.789Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>I charitably read \"random\" as \"randomly drawn\" i.e. if you look at any poor community, the odds that they have been helped by EA is small because EA's money flow is very small. This is also likely because of the quote from Anthony's article.</p>\n<blockquote>\n<p>if you randomly asked one of the people who themselves live in abject poverty, there is no chance that they will mention one of EA’s supported “effective” charities, as having impacted their lives more than the work of traditional global antipoverty agencies. No. That’s out of question.</p>\n</blockquote>\n<p>I believe Tim was responding to this part.</p>\n", "parentCommentId": "qQfCcv6YNbJSYtXND", "user": {"username": "therealslimkt"}}, {"_id": "3GTpHxwELEPnkFdn6", "postedAt": "2022-12-17T18:10:13.109Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>I read that critique with hope, but ultimately <strong>I found it largely unconvincing</strong>.</p><p>I'm very surprised by the claim that mosquito nets keep their beneficiaries in poverty. Mosquito nets are not <i>trying</i> to lift people out of poverty, and yet there is some evidence that they do help lift people out of poverty to some extent. I really don't understand how distributing nets can <i>keep</i> people in poverty.&nbsp;</p><p>Kalulu says:</p><blockquote><p>if you randomly asked one of the people who themselves live in abject poverty, there is no chance that they will mention one of EA’s supported “effective” charities, as having impacted their lives more than the work of traditional global antipoverty agencies. No. That’s out of question.</p></blockquote><p>To be honest, if you asked someone who had received $1000 from GiveDirectly whether it impacted their lives, I'm pretty confident they would say a hearty yes. It also allows the lived experiences of the poor to dictate what happens to the money -- something which Kalulu demands.</p><p>GiveWell believes that all of the GiveWell Top Charities outperform GiveDirectly, and I think this is correct, unless you place an unusually low amount of value on saving a life. Again, GiveWell have validated whether they are imposing a Western perspective when it comes to this moral weight judgement -- they have surveyed people in Africa on this question.</p><p>One area where I do agree to some extent: I think it would be good if more people from the populations which benefit from these interventions actually worked at GiveWell. I have certainly had conversations with GiveWell where we have discussed the details of models and I have invoked lived experience of spending time among the global poor, and I got the impression that GiveWell could have benefited from having more of this perspective.</p><p>Overall I still don't feel we need to galvanise actions to improve the situation.</p><p>Some might be sceptical of a critique which could be paraphrased as: \"EA is getting it wrong because it should be funding NGOs which are run by people who have lived experience of being ultra poor. By the way I have lived experience of being ultra poor and I run an NGO.\" I don't think you need to invoke this scepticism in order to find this critique unconvincing.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "zF6fbEsSGiZCweEga", "postedAt": "2022-12-17T18:15:24.302Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Not sure, but I would bet &nbsp;Anthony is referring to One Acre Fund.</p>", "parentCommentId": "7tbkavdpeDPntG56R", "user": {"username": "Stephen Clare"}}, {"_id": "W69er757gx9K7BBRG", "postedAt": "2022-12-17T18:17:45.012Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Thanks, I deleted my comment. I appreciate your clarification.</p>", "parentCommentId": "NjtDh6K26JtRbeZiv", "user": {"username": "Lauren Maria"}}, {"_id": "QxdFiavhuGCMLcXNw", "postedAt": "2022-12-17T18:30:26.000Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>That would make sense, <a href=\"https://www.thelifeyoucansave.org/blog/were-adding-one-acre-fund-to-our-list-of-best-charities-heres-why/\">they're on The Live You Can Save's list of charities.</a> I note on the article for One Acre Fund that \"In 2018, 78% of One Acre’s higher-skilled Africa-based roles were filled by African nationals — including the CEO. By the end of 2020, One Acre Fund will recruit, manage, and deliver professional development services to over 10,000 African national employees.\" That doesn't necessarily make it grassroots and local on the same level of granularity or comprehensiveness of UCF, but it's also a much bigger organization serving a much wider area.</p>", "parentCommentId": "zF6fbEsSGiZCweEga", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "n7MF9PpbEaRs7gJAm", "postedAt": "2022-12-17T19:13:16.088Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>One Acre Fund also works with a huge variety of crops in different countries. They don't seem to bring some Western doctrinaire attachment to maize. I wouldn't be surprised if they could do better with another crop but that seems like a technical question more than anything.</p>\n", "parentCommentId": "QxdFiavhuGCMLcXNw", "user": {"username": "therealslimkt"}}, {"_id": "yLi9Xag7EfqC8DSLw", "postedAt": "2022-12-17T21:53:47.152Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Thanks for linking to this article and providing highlights. I tend to take this kind of criticism very seriously, and despite my pushback in the next paragraph, I still think we should pay attention to it.</p>\n<p>On the other hand, it appears to me that very clearly many global health NGOs supported by GiveWell would have results mostly unfelt by those in poverty, not because they're ineffective, but <strong>because they're preventative</strong>. If AMF succeeded in its mission, all you got from it was a mosquito net. You can't know that your own child would've otherwise been the one to die from malaria. The same goes for deworming and food fortification (the latter might even be entirely unfelt by a consumer).</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "TKoSiuEwcN35MbmiB", "postedAt": "2022-12-17T22:59:11.309Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Thanks so much for this - am loving the development focused discussions on the forum at the moment!<br><br>I'm a New Zealander who has lived in Northern Uganda for 10 years and this is exactly the kind of response I often get from Ugandan development workers. I think his argument is well intentioned but flawed, while raising a bunch of important points we can work on. Here are a few thoughts on his arguments</p><ol><li><strong>Unfortunately empirical evidence is rarely valued highly here</strong> - instead development theory and logic are leant on. You can see the author lean heavily on the kind of \"teach a man to fish\" development theory that still predominates in mainstream aid, even when that theory isn't usually backed by evidence.<br><br><i>\"If you visited a truly impoverished country like Uganda, you will quickly notice that many of the things that effective altruists call “effective” — from mosquito nets, to $100 business grants that are provided to groups of 3 people — are the same short-term, disposable solutions that have not only kept their recipients in abject poverty, but also, they are the very kind of solutions that often disappear the same day their proponents exit.\"</i><br><br>His explanation for why he doesn't believe the interventions are effective is based on theory not evidence. I'm yet to meet a Ugandan development worker here in Gulu, Northern Uganda at least who has quoted evidence about development - and that's after 10 years working here. Unfortunately the education system here focuses heavily on theory and barely at all on evidence. Part of the reason for this is lack of resources - university students here often don't have access to databases because their universities can't afford it which is pretty tragic. Also many older lecturers who are 20-30 years behind on development theory.<br>&nbsp;</li><li>His point on all EA charities being Western is a good one, but I think this more drives at the point that <i><strong>almost all large charities </strong>(with some exceptions like BRAC) &nbsp;</i>are Western. The way EA operates, relying mostly on RCTs and big studies that only large charities can afford, means that for better or worse (I think often worse), only big charities can be funded. I LOVE the idea of funding potentially effective local charities while reviewing their effectveness, and I also think that many of them have opportunity for scaling. I think this comment misses the point a bit <i>\"so spending $100k on a study might be pointless when the org only has capacity to absorb $50k.\" &nbsp;</i>first because studies are likely to cost more than 100k, and second because many local charities do have big scalabilty potental. Maybe you fund 10, and find only 1 has the potential to become both big and effective, but that might be worth it.<br>&nbsp;</li><li>&nbsp;\"Conduct third-party surveys of the intended beneficiaries of poverty relief. So far the only instrument of this kind I've seen is GiveDirectly's program.\"<br><br>On this point I think before and after surveys are deeply flawed for a number of reasons but this is an interesting debate. Both sides of the argument play out a bit in the discussion about Wellbys especially in the comments here.<br><br>&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/uY5SwjHTXgTaWC85f/don-t-just-give-well-give-wellbys-hli-s-2022-charity\">https://forum.effectivealtruism.org/posts/uY5SwjHTXgTaWC85f/don-t-just-give-well-give-wellbys-hli-s-2022-charity</a><br>&nbsp;</li><li>His observation here is brilliant and I think 100% correct, but it' not reallys a criticism of EA, more a critcism of the uselessnes of charity in general in Uganda. I believe most charity in Uganda is useless and often even harmful. Farming improvements have come mostly through the market not aid - as one example new effective seeds for the cash crops he talks about.<br><br><i>\"But the thing is: every household in our region that depends on maize, lives in chronic extreme poverty, and has lived in chronic poverty for eternity. Neither the effective charity nor the other big antipoverty agencies that came before it, have changed this. By contrast, those farmers who are growing crops like sugarcane, no charity or antipoverty agency has ever supported them. But today, every village in our region that you visit, is covered with sugarcane. It is also the same with many other crops (rice, tomatoes, water melon etc) that are at least providing rural farmers with some tangible income.\"</i><br><br><br><br>Unfortunately I don't think there's much hope of EA theory taking off here for a long time unfortunately, due to lack of focus on evidence locally and the lack of ability for people to have critical discussion about charity. Unfortunately there's too much self interest at stake. For social and political reasons people are VERY hesitant to criticise other charities here. It might &nbsp;cause you to not get a job in future or worse annoy a political establishment. As a expat here I have the white privilege of being able to speak critically without threatening my livelihood.<br><br>As a brief note, hiring locally already happens most of the time as it is a core part of mainstream development theory. Most charities mostly people from the local (ish) community.<i>\"If you are a charity working in eg Uganda, try promoting your hiring rounds among your beneficiaries and their surrounding communities\" -&nbsp;</i><br><br>&nbsp;</li></ol><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "cuE2NimKxFsJrtSkk", "postedAt": "2022-12-17T23:04:17.232Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Agree with all of this nice one! As a quick note (as I've noted in more detail in a comment) &nbsp;it's important to note that evidence around charity is rarely discussed here in Uganda. You can notice this especially when you see that his claims about mosquito nets are not backed up by any evidence. Also there is evidence that people funded by Givedirectly in Uganda have appreciated it, but unfortuately. he won't have considered this evidence.</p>", "parentCommentId": "3GTpHxwELEPnkFdn6", "user": {"username": "NickLaing"}}, {"_id": "EXwqfSrdfMQFu4gj2", "postedAt": "2022-12-17T23:08:39.044Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>100% great point!. Because preventative effects are spread out over such long time periods, it's almost impossible for someone t associate the cause (mosquito net, deworming and fortification) with the effect (longer, healthier life for their kids)..</p>", "parentCommentId": "yLi9Xag7EfqC8DSLw", "user": {"username": "NickLaing"}}, {"_id": "HNoqifCnQDwk3hJZ9", "postedAt": "2022-12-18T00:49:49.641Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<blockquote><p>Unfortunately the education system here focuses heavily on theory and barely at all on evidence. Part of the reason for this is lack of resources - university students here often don't have access to databases because their universities can't afford it which is pretty tragic. Also many older lecturers who are 20-30 years behind on development theory.</p></blockquote><p>Maybe one thing EA could do to address some of these issues and build bridges with local development workers is to package and deliver the latest empirical evidence to university students and lecturers in places like Uganda.</p>", "parentCommentId": "TKoSiuEwcN35MbmiB", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "yCWFJqGsbzf9ftsm8", "postedAt": "2022-12-18T01:06:51.407Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Another point is we'd expect EA not to be able to help a random poor person by chance.</p>\n<p>Assuming EA is actually effective, but not having magic, it means billions of dollars will go to millions of people. Problem is, hundreds of millions are poor, so behind the veil of anthropics, we should mostly expect not to be in the helped group by pure chance.</p>\n", "parentCommentId": "cuE2NimKxFsJrtSkk", "user": {"username": "Sharmake"}}, {"_id": "Ci9jN9nYYomcj8hSz", "postedAt": "2022-12-18T02:22:56.707Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<blockquote>\n<p>GiveWell have validated whether they are imposing a Western perspective when it comes to this moral weight judgement -- they have surveyed people in Africa on this question.</p>\n</blockquote>\n<p>People bring this up a lot, and I think it's inaccurate. Although GiveWell has discussed the IDinsight survey as factoring into their moral weights, they do not actually incorporate its results, and the vast majority of their moral weights comes from surveys of donor preferences. From their <a href=\"https://docs.google.com/document/d/1hOQf6Ug1WpoicMyFDGoqH7tmf3Njjc15Z1DGERaTbnI/edit?usp=drivesdk\">2020 update</a>:</p>\n<ul>\n<li>60% weight on donor responses</li>\n<li>10% weight on James Snowden's 2018 weights (as a proxy for 2018 GiveWell staff)</li>\n<li>30% weight on YLLs (both as a commonly-used metric itself and as a proxy for the IDinsight survey)</li>\n</ul>\n<p>They discuss their issues with the IDinsight survey:</p>\n<blockquote>\n<p>Lots of respondents placed extremely high value (over $10 million) on life. That doesn't necessarily imply lack of engagement with the question – it might be a true preference – but it's not helpful for resource allocation. It's an extraordinary result without extraordinary evidence to support it. If we believed this was an \"accurate\" representation of how the world should work, we expect that it would imply that low- and middle-income country governments and other institutions should be acting very differently than they currently are.</p>\n</blockquote>\n<p>And conclude:</p>\n<blockquote>\n<p>we don't really trust the results as providing a coherent and accurate picture of people's preferences.</p>\n</blockquote>\n<p>So it's not accurate to say that GiveWell's moral weights have been \"validated\" by beneficiary preferences. GiveWell claims to be quite skeptical of the beneficiary preferences survey, so they just added a bit more weight on years of life lost (YLLs) to capture the rough idea of people valuing life more than they expected. In practice, this amounts to valuing the lives of under-5 children a bit more than valuing the lives of other people (since they have more YLLs):</p>\n<blockquote>\n<p>our new weights value young children slightly more highly relative to people over the age of five, and <em>essentially leave the relationship between averting a death and increasing consumption unchanged.</em> (emphasis mine)</p>\n</blockquote>\n<p>Given how much more people valued averting death over increasing consumption in the <a href=\"https://forum.effectivealtruism.org/posts/mKGbeX5tQu4zshY4j/alice-redfern-moral-weights-in-the-developing-world\">IDinsight survey</a>, the fact that this relationship was unchanged makes it difficult to argue that GiveWell has really incorporated beneficiary preferences into their moral weights.</p>\n<p>I know this wasn't the main point of your comment, but it's important to clarify because it comes up a lot as a defense when EA is criticized for being paternalistic, and I just don't think that represents reality. GiveWell is absolutely imposing a Western perspective by having 70% of their weights be from donors and staff.</p>\n", "parentCommentId": "3GTpHxwELEPnkFdn6", "user": {"username": "therealslimkt"}}, {"_id": "EQKbThx5SvtkoTuv5", "postedAt": "2022-12-18T09:08:21.364Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<blockquote><p>I really don't understand how distributing nets can <i>keep</i> people in poverty.&nbsp;</p></blockquote><p>&nbsp;</p><p>There is <a href=\"https://www.nber.org/system/files/chapters/c7278/c7278.pdf\">one &nbsp;paper from 2009</a> suggesting that, in the short run, eradicating malaria can lower income per capita slightly but only by a few percentage points and in the longer run it raises income. This is because it doesn't affect prime age workers so much.</p>", "parentCommentId": "3GTpHxwELEPnkFdn6", "user": {"username": "HaukeHillebrandt"}}, {"_id": "itEbBZzMP8NFKMr8i", "postedAt": "2022-12-18T10:58:05.559Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Oh wow, I really didn't think anyone would have an answer to that question. Nice one!</p>", "parentCommentId": "EQKbThx5SvtkoTuv5", "user": {"username": "Sanjay"}}, {"_id": "a8YRdTMAcnq48BZig", "postedAt": "2022-12-18T13:11:13.915Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>I parse the argument as \"EA interventions don't have lasting impact. They might prevent some bad things, but they don't fundamentally improve the conditions that cause poverty.  People are not kept in poverty because of bad public health in their community, but because of economic factors that disempower them.\"</p>\n<p>And this might well be true. Bednets save the lives of their recipients, but I'm unsure if this leads to a more productive next generation or a more stable political situation.</p>\n<p>Basically, live-saved measures are too short-sighted.</p>\n", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "AiZ5ys4LMp36P3PWg", "postedAt": "2022-12-18T15:10:01.932Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>This is a good point.</p>\n<p>My understanding is that the IDinsight study had about 35 percent of beneficiaries choosing saving lives over any presented amount of cash transfers, while the respondents who switched based on the # of transfers per life saved expressed preferences that were (on the median) roughly similar to preexisting GiveWell weights.</p>\n<p>So I think a model that gives about 35 percent weight to a lives-saved-only calculus and about 65 percent weight to a tradeoff calculus would accurately reflect the beneficiary preferences in the survey. That isn't too far off from the 60/10/30 model.</p>\n<p>Going solely by the preferences in this one survey might affect some GiveWell decisions on the margin, but the bulk of their top charities' rated effectiveness already comes from saving lives under five.</p>\n", "parentCommentId": "Ci9jN9nYYomcj8hSz", "user": {"username": "Jason"}}, {"_id": "X9for5k36KqdX2NXq", "postedAt": "2022-12-18T15:25:58.321Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>That's still not accurate because the YLLs adjustment mostly matters on the intensive margin (saving kids vs adults), and as GiveWell states, their lives vs income tradeoff was essentially unchanged compared to their previous moral weights.</p>\n", "parentCommentId": "AiZ5ys4LMp36P3PWg", "user": {"username": "therealslimkt"}}, {"_id": "tCeu3RDg4yx6qqqxK", "postedAt": "2022-12-18T16:55:34.611Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Although I'm not sold on Kalulu's argument (and didn't see enough information about his charity on its website to assess whether I think it is effective), I think this is a good time to remember and acknowledge the weaknesses and limitations of current EA measurement of effectiveness in the global health/development area. It seems quite likely to me that there are grassroots organizations that are more effective at the margin than the current GiveWell four (and many that are significantly less effective). EA simply lacks the resources to evaluate them all, and evaluating them up to the GiveWell gold standard would not be cost-effective even if it did. So the message we have with confidence is something like: \"We are very confident that EA's recommended charities are very effective at doing good, and we believe they are the best <i>known </i>use for your marginal dollar.\"</p><p>I share Jaime's view that we should \"[t]ry to identify the best local grassroot efforts to support.\" I'd add that this should be done by people from the countries (or at least subcontinents) &nbsp;in question to the maximum extent practicable, both for cost-effectiveness and other reasons. &nbsp;</p><p>I wonder if the most effective (in a EA sense) way to help these organizations would be some sort of meta support. If we believe that a dollar in meta support could help move a number of Western charitable dollars away from less effective charities, we do not need to believe these organizations are as effective as AMF et al for meta support to be potentially effective.&nbsp;</p><p>Taking Kalulu's organization as an example, I could find no indication of tax-deductibility status in any country (although references to Donorbox and Benevity suggest there might be). If the organization has a fiscal sponsor offering tax deductibility, not advertising that fact is a major error (which suggests that training for \"the best\" grassroots organizations on how to effectively seek money for Westerners could be cost-effective). If it does not, then it may be cost-effective to set up an organization to serve as a fiscal sponsor for grassroots organizations that have been identified as \"the best local grassroot efforts to support.\" For better or worse, many donors use that status as a marker for some limited amount of vetting/oversight in addition to the obvious advantages. Of course, for the smallest organizations, the most effective meta might be to set up a fund for \"the best tiny local grassroots efforts to support\" rather than provide assistance with individual-org fundraising.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "3WyaGLDt9Ru34oriL", "postedAt": "2022-12-18T19:09:53.543Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>It's very hard to get clear evidence on this as it's so difficult to assess what actually leads to a more productive next generation, but &nbsp;there is some evidence focusing on health and education might make a big difference. For example there is evidence that if you have malaria a lot you get iron deficient or anemic and do worse at school. I know this is a lame anecdote, but I can tell you our nurses get malaria a lot and it's bad for productivity!<br><br>There are some interventions like family planning measures which have even better evidence behind them - smaller family size is associated with higher income on a household level and also faster development on a country measure.</p><p>Obviously it's not the be all and end all, but there is a decent amount of evidence out there that life-saving and health-improving measures can help assist development.</p>", "parentCommentId": "a8YRdTMAcnq48BZig", "user": {"username": "NickLaing"}}, {"_id": "cMKqMuH2ngQN8gLgy", "postedAt": "2022-12-18T19:29:29.815Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>This is fantastic. I speak just from Ugandan experience here again.<br><br>I'm sure there are grassroots orgs that are more effective at the margins than GiveWell's orgs. Even just from a probability perspective with thousands of small orgs, the chances of a handful being super-effective in their context seems pretty high. I know we are obsessed with scale, but if a small org is effective and it would only take 100k a year to max out what they could do in a local context, why not give them that? As an example there is a great education org here that runs on a shoestring (maybe 60k a year) called Read4Life that has good evidence over a number of years of operation that their interventions have greatly sped up learning of reading and writing for thousands of kids. It's wild how hard it is for orgs like this to get funding.&nbsp;<br><br>I don't know enough about Givewell to say this with any confidence, butit might not be shard for Givewell to loosely assess say 1000 small orgs and select a handful that might be effective. &nbsp;Obviously with a less rigorous assessment, Givewell couldn't be confident that the orgs were effective but they could at least offer some smaller orgs as options for donation. I would love like you say for this to be done in-country, but in places like here in Uganda I'm not sure the expertise is really around to do solid Givewell style assessments - but I could be wrong maybe there are people out there who could do it!<br><br>There are a some orgs already which can help serve as fiscal sponsors for grassroots organisations, but it's not straightforward to get connected to them. I'm also not sure just being tax deductable to help people donate though would make a huge difference unless the money coming in was huge - Big Local NGOs here have better ways of getting large amounts of money.</p><p>Big local NGOs here in Uganda get the vast majority of their money through grant applications not individuals as well. The biggest 5 or so local NGOs here in Gulu have enormous budgets funded by DANIDA (danish aid), USAID, GIZ etc. This is a bad situation as these donors give close to zero weight to actual effectiveness - instead what mostly matters is the relationships that they build with the donor organisations and their grant writing skills. Also these NGOs just tailor their programs to whichever wind the donor funds are blowing in. Today it's \"Gender based violence\", tomorrow it's \"climate friendly agriculture\". And the programs they roll out when they get the funding I think often do close to zero good or even harm.</p><p>My point is that the way to get a lot of money jere as a local NGO isn't to connect with a personal donor base in another country, but through getting big grants through big donor organisation, either philanthropies or National Aid organisatns.. Maybe EA incentives could help turn this tide, but it would take a LOT of &nbsp;EA money to push local NGOs away from this model of growth and towards more effective programs.<br><br>Despite that limitation I LOVE your idea of setting up an EA &nbsp;based fiscal sponsor for potential high impact small local organisations. I don't particularly like the word \"grass roots\" though, because I'm never quite sure what it means.</p>", "parentCommentId": "tCeu3RDg4yx6qqqxK", "user": {"username": "NickLaing"}}, {"_id": "6iaaLnaceaho9Ro3y", "postedAt": "2022-12-19T03:11:17.689Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>Yeah, I'm not holding out much hope right now for the governmental funders and the large NGOs that rely upon them. The vision was much more modest -- finding ways to provide \"small\" (e.g., high-4 to low-6 figures) funding for smaller nonprofits who have been effectively doing what they have been doing (rather than pivoting to what the politicals want this year).</p><p>I was thinking more about the private dollars (e.g., people who give to World Vision, which IIRC you do not rate highly). In particular, I speculate that there is a donor \"market\" for supporting efforts that come authentically out of the areas whose populations they serve, rather than being dreamt up by and run by Westerners. That is a market the big EA charities cannot compete in. (For my part, I don't care whether a charity is being run by Westerners or not, but some donors do.) EA is not going to convince everyone of the EA way of thinking, but funneling non-EA dollars into better charities is still a win.</p><p>It may be challenging to make &nbsp;cost-effectiveness work out for having paid Western evaluators evaluating microsized charities in Africa. Let's say we were looking at 1000 charities, 20 of which would clear whatever bar we set, and this could optimistically be done in 1500 hours (because most organizations could be non-selected quickly). Let's say the 20 have on average $100K in room for funding. At an organization like GiveWell's cost/overhead rates, that is probably something like a $150K or so project to select the 20 programs.&nbsp;</p><p>That level of analysis is not likely to persuade us that it is more likely than not that the bucket of microcharities is more effective than the big charities GiveWell would otherwise recommend. So we'd want to find funders for these 20 that wouldn't displace (any, or much) funding that would have otherwise gone to a standard GiveWell charity. That sounds <i>plausibly </i>cost-effective by EA standards to me, but it's a whole lot easier to justify if the bulk of the evaluation work could be done in the lower-income country/region with a final check of the proposed approvals by high-income country sources. The cost for that might be more on the $15K-$25K level? Some of that could potentially be justified by the informational value of having done the survey alone (e.g., we might find an idea that could scale or at least would learn about what local solutions are and aren't working in a semi-effective manner).</p><p>I totally hear that that capacity may not exist in many lower-income countries right now. So I guess one initial pitch would be to find some recent college grads sympahetic to EA ideas, hire them at private-sector local salaries (is that on the order of a few thousand USD in Uganda a year?), and teach them how to do shallow EA-style investigations. Frankly, I think a few programs of that nature would also be an inexpensive way to lay the groundwork for mitigating the reputational issue of EA being viewed as largely a movement of people from certain countries, races, and educational backgrounds.</p><p>The less ambitious approach would be to solicit nominations for microcharities to evaluate from people with both EA sympathies and on-the-ground experience, like yourself. That would keep the evaluation time at a much more manageable level, but it would miss a lot of organizations. I'd be willing to consider making donations to small groups on the recommendation of a trusted source vouching for their cost-effectiveness, but I may not be representative of others.</p><p>I have assisted, in a non-lawyer capacity, with setting up a US fiscal sponsor for a foreign non-profit entity before . . . in Uganda, curiously! It is fairly <a href=\"https://www.irs.gov/instructions/i1023ez\">easy </a>(and a few hundred dollars) if you're not expecting to bring in more than $50K in &nbsp;donations routed through the US non-profit in the first three years. Multiple non-profits can share the same fiscal sponsor...although the tax filing gets more complex at 50K and considerably more complex at 100K. (It seems that Read4Life has fiscal-sponsor relationships with an organization having like 200 projects. They have US, UK, and AUS tax deductibility.)</p>", "parentCommentId": "cMKqMuH2ngQN8gLgy", "user": {"username": "Jason"}}, {"_id": "PYbqHjAJDfcSYXGp7", "postedAt": "2022-12-19T12:49:13.830Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>I love this this idea here a lot &nbsp;<br><br>\"So I guess one initial pitch would be to find some recent college grads sympahetic to EA ideas, hire them at private-sector local salaries (is that on the order of a few thousand USD in Uganda a year?), and teach them how to do shallow EA-style investigations. Frankly, I think a few programs of that nature would also be an inexpensive way to lay the groundwork for mitigating the reputational issue of EA being viewed as largely a movement of people from certain countries, races, and educational backgrounds.\"<br><br>My only addition is that you would probably need someone more versed in EA evaluations out here supervising this. Also you'd need really good grads, because this would be a very new concept and would need a lot of learning.<br><br>I don't love the soliciting idea, because like you say it would &nbsp;still favour bigger organisations and would miss a lot of potentially great really small ones.<br>&nbsp;</p>", "parentCommentId": "6iaaLnaceaho9Ro3y", "user": {"username": "NickLaing"}}, {"_id": "nkFd5er2vuomvTCeo", "postedAt": "2022-12-20T20:34:23.390Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>An interesting piece. I live and work in Nigeria. I have always argued that what is effective and good is relative.causes that are considered “effective” by the west may not make meaning to us. What I have observed, I have worked as a consultant to some international NGOs working in Nigeria. You see figures sent to the donors so that money will keep coming. No real impact.</p>\n<p>I suggest that even when considering grant applications, EA should consider having someone from LMIC look at grant applications and charities. For example, the level of poverty and hunger in Nigeria is so high that any animal and welfare charity will be resisted to a stop.</p>\n", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "3xYggLAgqMa2ZNyza", "postedAt": "2023-01-21T11:24:10.668Z", "postId": "3M7iL4cb3LJjj7zNp", "htmlBody": "<p>I'd like to comment not on Kalulu's criticism itself, but mention a specific solution he proposed here - <a href=\"http://dear-humanity.org/my-intended-solution/\">http://dear-humanity.org/my-intended-solution/</a> .&nbsp;</p><blockquote><p>My intended solution is: an integrated agro-processing plant that shall both reverse poverty and create jobs in our region, by minimizing post-harvest food loses, creating new market linkages for rural poor farmers, and linking these farmers’ produce with agri-value chains — like bakeries &amp; confectioneries; bottling companies and breweries, etc.</p></blockquote><p>I think Kalulu's proposal can be described more broadly as improving market access for farmers. Here are some other sources mentioning similar strategies:</p><blockquote><p>Government officials convinced the Coca-Cola Company and TechnoServe executives to build a plant near the orchards. “The company now has a fresher fruit source and a profit center, and growers are able to sell most of what they grow at higher prices in a guaranteed market,”</p></blockquote><p><a href=\"https://www.rockefellerfoundation.org/blog/smallholder-farmers-food-loss-hits/\">https://www.rockefellerfoundation.org/blog/smallholder-farmers-food-loss-hits/</a></p><blockquote><p>In a bid to improve the access to markets, we support the development of proven post-harvest management technologies, business models and linkages to farmers, traders, and processors.</p></blockquote><p><a href=\"https://agra.org/markets-post-harvest-management/\">https://agra.org/markets-post-harvest-management/</a></p><p>Do you know &nbsp;if interventions focusing on improving market access for farmers were considered and evaluated by any of the EA organizations?</p>", "parentCommentId": null, "user": {"username": "Michal Porwisz"}}]