[{"_id": "MwdCwvnxugzEN3Tpq", "postedAt": "2023-08-25T17:44:40.198Z", "postId": "3NvLqcQPjBeBHDjz6", "htmlBody": "<p>It’s hard to take these responses too literally since the median response for chicken was 1,000 and the average American consumes over 1,000 chickens per lifetime.</p>\n<p>It would be interesting to focus group or hear from some of the respondents about the process they used to produce their answers.</p>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "95PwEvgHPvxezf9fh", "postedAt": "2023-08-25T18:04:37.958Z", "postId": "3NvLqcQPjBeBHDjz6", "htmlBody": "<blockquote><p>It’s hard to take these responses too literally since the median response for chicken was 1,000 and the average American consumes over 1,000 chickens per lifetime.</p></blockquote><p>Personally I think the largest part of the explanation of this is what we say here:</p><blockquote><p>For example, we anticipate that participants would likely give different responses were questions posed not in terms of the moral value of different species in the abstract, but in terms of concrete trade-offs, e.g., whether to save 1 human life or x animals. We would anticipate that this would likely lead to lower moral value being assigned to animals.</p></blockquote><p>Note that in <i>most</i> studies of people's attitudes towards animals find that most people state significant levels of care for animals, while still eating them (the famous \"<a href=\"https://www.taylorfrancis.com/chapters/edit/10.4324/9781351181440-11/meat-paradox-steve-loughnan-thomas-davies\">meat paradox</a>\"), so this is not distinctive of this particular paradigm. I think it plausible that in the abstract, people do assign significant moral value to animals, despite their decision-making in concrete situations being in conflict with this. I think you would find similar inconsistencies between people ascribing high value to humans other than themselves or humans other than themselves, but not being willing to make minimal sacrifices to avoid harming them.</p><blockquote><p>It would be interesting to focus group or hear from some of the respondents about the process they used to produce their answers.</p></blockquote><p>I think more data would be interesting, though I suspect in this case is would likely not be very informative. <a href=\"https://home.csulb.edu/~cwallis/382/readings/482/nisbett%20saying%20more.pdf\">Very often</a> people can't give particular reasons for the specific value they would assign to something (c.f. a <a href=\"https://en.wikipedia.org/wiki/Value_of_life\">statistical value of life</a> paradigm where someone is asked how much they'd be willing to pay to reduce their risk of dying 0.001% over the next year). I think <i>most</i> people would struggle to explain why they think this is $1,000 or $10,000, despite not being conceptually confused about the judgement.</p>", "parentCommentId": "MwdCwvnxugzEN3Tpq", "user": {"username": "David_Moss"}}, {"_id": "hGDf2BYiZuM2AxWo6", "postedAt": "2023-08-25T19:48:47.461Z", "postId": "3NvLqcQPjBeBHDjz6", "htmlBody": "<p>Sorry if I missed it, but are the logarithms here base 10?</p>\n", "parentCommentId": null, "user": {"username": "Jacob_Peacock"}}, {"_id": "AJqDDAYrgPib7FQ9h", "postedAt": "2023-08-26T11:39:36.963Z", "postId": "3NvLqcQPjBeBHDjz6", "htmlBody": "<p>No, they're natural logarithms.</p>", "parentCommentId": "hGDf2BYiZuM2AxWo6", "user": {"username": "WillemSleegers"}}, {"_id": "ErZXqk74PKSufvTBd", "postedAt": "2023-08-26T20:47:12.358Z", "postId": "3NvLqcQPjBeBHDjz6", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "AJqDDAYrgPib7FQ9h", "user": {"username": "Jacob_Peacock"}}]