[{"_id": "aKZ6K5So7DmaZqbEj", "postedAt": "2018-03-14T16:38:41.439Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<blockquote>\n<p>I interested Tee Barnett and Peter Hurford in adding sexual violence questions to the survey. Therefore sexual violence definitions need to be created.</p>\n</blockquote>\n<p>Thanks for your dedication to this issue. I'm compelled to point out that that briefly speaking about a particular issue in an informal manner should not be seen as an endorsement on behalf of myself or Rethink Charity. </p>\n", "parentCommentId": null, "user": {"username": "Tee"}}, {"_id": "kZPEmwngL9q5xBKr8", "postedAt": "2018-03-14T18:33:55.624Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>Whether you effective altruists decide to track and solve this issue or discover the consequences of ignoring it is up to you. Choose wisely.</p>\n", "parentCommentId": "aKZ6K5So7DmaZqbEj", "user": {"username": "Kathy_Forth"}}, {"_id": "M3hTeRMa4s5sT55Nn", "postedAt": "2018-03-15T15:39:03.036Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>In response to the comment that was deleted below, we do not intend to ignore this issue. </p>\n", "parentCommentId": "aKZ6K5So7DmaZqbEj", "user": {"username": "Tee"}}, {"_id": "ha5fjpfqydtANpaaG", "postedAt": "2018-03-18T05:06:27.705Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>Is the &quot;collaboration&quot; mentioned <a href=\"http://effective-altruism.com/ea/1h7/sexual_violence_risk_reduction_lets_do_tracking\">here</a> referring to the same brief informal conversation?</p>\n", "parentCommentId": "aKZ6K5So7DmaZqbEj", "user": null}, {"_id": "FKeas6WS2H6iafRvH", "postedAt": "2018-03-19T19:16:21.710Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>Can we put a lid on all these disclaimers being thrown everywhere by everyone who does anything in EA? It is getting stifling and degrading. Just state what you believe.</p>\n", "parentCommentId": "aKZ6K5So7DmaZqbEj", "user": {"username": "kbog"}}, {"_id": "DMSufTbiXF4iCS8T4", "postedAt": "2018-03-19T19:28:07.939Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>Well this seems to make sense, though it's worth remembering that unconventional definitions and standards on this subject could be picked up by progressive activists and used as a political weapon against us. And while good definitions are important for research and arguments, I'm not sure if creating a better set of definitions would provide much added benefit in terms of helping us reduce sexual crimes in the organizational sense.</p>\n<p>I'm not sure exactly what you're proposing as a plan of action. Surveys? I'll always be happy to fill one out. Now I presume that EA organizations have discrete channels for reporting sexual harassment and assault; if not then that sounds like obvious good practice. </p>\n<p>Some people get rejected from EA Global, so the comparison would have to look at visitors who applied to visit subsequent conferences.</p>\n<p>As an aside, I find talking about 'leaving EA' on the basis of personal issues to be sort of distasteful as it trivializes the importance of reducing poverty, factory farming and so on, as if they were less important than our own experiences. Probably it is better to say more careful things like &quot;I am going to work to reduce poverty on my own in accordance with Peter Singer's philosophy without being involved with the EA community&quot;, or something of the sort. As a rule, communities seem to be strong when they have negative attitudes towards defection and leaving.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "X2my96FJbhAtHY7Dr", "postedAt": "2018-03-21T00:45:28.930Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>As I said previously, I'm glad you are working on this problem.  However, I suspect you are defaulting too strongly to public communication and coordination on this forum.  My impression is that many EA orgs tend to keep their analysis private and publish only if there's a compelling reason.  For this particular issue, I see a few reasons to default even more strongly to privacy: First, there are reputational risks to the EA movement.  Second, public online discussion of topics like this can degrade notoriously quickly.  Therefore, I suggest that instead of soliciting public comments, you put together a small group of advisors, people with a few different perspectives from a few different stakeholders, and ask them to provide views on things like what the right set of questions to ask is.  I suspect that this approach will get you better advice than drive-by internet commenting, while also mitigating the risks I described.</p>\n<p>I have some more thoughts, but I'm following my own advice and sending them via a personal message :)</p>\n", "parentCommentId": null, "user": {"username": "xccf"}}, {"_id": "adn9TfBdYqPQFNYLC", "postedAt": "2018-03-24T12:12:08.206Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>I am also not an expert on designing surveys, but it seems really hard to get meaningful data on something like the 'consent philosophies' that you describe, at least without broadly-understood and theorised examples of different versions of them. Imagine trying to get an idea of the different ethical views of EAs without being able to rely on terms like 'utilitarianism' and 'condequentialism' and others that have a well-developed meaning from the philosophical literature.</p>\n<p>Asking people to describe their ethical views in such a situation seems like a really bad idea - not only would it require a ton of work in reading through all the responses to get even a vague idea of the common threads, it requires the survey-taker to do a ton of work in writing up their views; not only to describe them, which itself might take some time, but also to reflect and come up with verbal descriptions of things they don't neccessarily think explicitly about.</p>\n", "parentCommentId": null, "user": {"username": "somervta"}}, {"_id": "eBs3gQF4yF4vQFTXb", "postedAt": "2018-06-21T04:44:29.074Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>I fucking hope not. RIP Kathy &lt;3</p>\n", "parentCommentId": "M3hTeRMa4s5sT55Nn", "user": {"username": "worldofsimulacra"}}, {"_id": "4Ks74nYQt5GMeWBem", "postedAt": "2018-06-21T05:20:09.976Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>Mate, she was already 2 days dead when you wrote this.</p>\n<p>For a really good cognitive exercise in empathy, which is what Kathy was all about at the end of the day, go re-read all your communications with her in this context. It's literally the first thing I did when I heard, and my communications, arguments, debates, and love with her go back to 2001.</p>\n<p>Then re-read her main article.</p>\n<p>Then reiterate to yourself how &quot;probably it is better to say more careful things&quot; to a person who suicided and whose entire life work was literally her cry for help that the community she cared so much about did not seem to hear.</p>\n<p>Then maybe ponder again the insular nature of this little community.</p>\n<p>I only know of EA through Kathy. I do not know if you've read her 30-page suicide note; it is online now, so probably not too hard to do. I do know, however, that she intentionally died in a deliberate attempt to make people aware of something sick in society than goes FAR beyond this little self-important online subcultural ghetto. She was willing and ready to burn EA and this whole society to the ground if necessary to make things right. While the ethics and expediency of such an approach is certainly debatable at the very least, as her friend and former partner I will do everything I can do, until I die, to stoke the flames of the fires she was trying to light. </p>\n<p>&quot;The child who is not embraced by the village will burn it down to feel its warmth.&quot;</p>\n", "parentCommentId": "DMSufTbiXF4iCS8T4", "user": {"username": "worldofsimulacra"}}, {"_id": "zQce7SdejsioQkNRP", "postedAt": "2020-05-27T22:19:41.728Z", "postId": "3oukNayDZXWLzte7c", "htmlBody": "<p>Posting these links here for cross-reference:</p><ul><li><a href=\"https://www.lesswrong.com/posts/s93F5JmhCxKDxWukD/remembering-the-passing-of-kathy-forth\">Remembering the passing of Kathy Forth</a> (<a href=\"https://archive.vn/3ITST\">a</a>)</li><li><a href=\"https://medium.com/@itai.ilyich/if-i-cant-have-me-no-one-can-kathleen-rebecca-forth-born-april-11-1980-31c49ed15121\">If I Can&#x2019;t Have Me, No One Can</a> (<a href=\"https://archive.vn/XDGlo\">a</a>) [Content warning: a suicide note that deals heavily with sexual violence]</li></ul>", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}]