[{"_id": "whg3ZdbdktfzJ4kQ9", "postedAt": "2023-10-17T12:53:42.531Z", "postId": "3poe76XToREWoxMxF", "htmlBody": "<blockquote><p>attracted over 25,000 applications</p></blockquote><p>This is pretty wild, congrats</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "YmrndgWj2G6FFJNKP", "postedAt": "2023-10-17T14:52:26.872Z", "postId": "3poe76XToREWoxMxF", "htmlBody": "<p>Thanks, very kind of you to say!</p>", "parentCommentId": "whg3ZdbdktfzJ4kQ9", "user": {"username": "Peter McIntyre"}}, {"_id": "MMvkMscdoJhEbHxNs", "postedAt": "2023-10-18T01:32:43.749Z", "postId": "3poe76XToREWoxMxF", "htmlBody": "<p>I wanted to add my experience as a Non-trivial winner to show the positive impact it's had on me and my career trajectory, and hopefully show why you should consider applying if it's a good fit.</p><p>I completed the Fellowship over the summer as part of a team working on policy to improve the information security of leading AI companies. We were awarded first prize in both the main category and AI Governance Grand Challenge for our final outputs - you can <a href=\"https://www.youtube.com/watch?v=45i4Gj9eumE\">watch our presentation</a> and <a href=\"https://docs.google.com/document/d/1xssqS1bK0bglw0bU-O1sJpyNZDLGplB3me-o79ZBe1M/edit?usp=sharing\">read our policy proposal</a>, with the supporting <a href=\"https://docs.google.com/document/d/17VCUeEQXNnObl95Vh1U_b5idbiBBDI-rZAD-oruT8pY/edit?usp=sharing\">list of promising security practices</a>.</p><p>Here's some of the counterfactual impact that completing the Fellowship has had on me:</p><ul><li>It demonstrated that <strong>there's nothing stopping me from contributing right now</strong>, so I'm continuing to work on projects in AI infosec and other areas</li><li>It significantly increased my confidence, agency, and professionalism</li><li>I now plan to work on AI safety (or whatever's high impact while still being fun) where I was previously interested in cybersecurity and finance</li><li>I met some really cool people in the process!</li></ul><p>The feedback and advice of Peter and the facilitators was especially valuable as a Fellow, along with the resources Peter created and compiled. <strong>This suggests that a good Program Manager and Program Associate could be particularly important in increasing the Fellowship's impact</strong>, as there's lots of low-hanging fruit still out there.</p><p>Overall, <strong>I would really encourage applying if you think these roles might suit you</strong>. The Fellowship really helped me and was massively fun, and getting the right people working on it could make it even better!</p>", "parentCommentId": null, "user": {"username": "XaviCF"}}, {"_id": "DWvG5K4zcspPH8RZm", "postedAt": "2023-10-18T08:13:11.948Z", "postId": "3poe76XToREWoxMxF", "htmlBody": "<p>I'm one of the alumni mentioned and a former intern — just to add my perspective, Non-trivial is a great initiative and I highly recommend and enjoy working with Peter!</p>", "parentCommentId": null, "user": {"username": "SahebG"}}]