[{"_id": "dZj33Lh226hftZ2G6", "postedAt": "2018-07-11T14:47:56.987Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Dear Halstead, </p>\n<p>thank you for the effort updated information on effective climate charities is a great and valuable thing to me and probably many other EAs. </p>\n<p>However, I had a look at the website and the report but I couldn't really find the discussion of why you do not recommend Cool Earth (searched for the name Cool Earth and only found one unrelated mention). As a past donor to that charity it would be awesome to have a direct link to that information.</p>\n<p>Additionally, without having read the report in detail, I think it would be a great addition if you wouldn't exclusively focus on the selected recommendations but position them in context to the other options. That way I could more easily understand if I agree with your selection. </p>\n<p>Anyhow, thank you for posting this and investing the time and effort to make this information accessible to a broader audience!</p>\n<p>Cheers, Alex</p>\n", "parentCommentId": null, "user": {"username": "alexherwix"}}, {"_id": "P7jCpznMx25moCd6m", "postedAt": "2018-07-11T15:09:20.022Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>cheers, the page that mentions cool earth also discusses why we think project based deforestation approaches are unlikely to be the most cost-effective thing. We discuss this at length in the discussion of CfRN. </p>\n<p>As for comparing to other charities, as we briefly mention, the main reasons we favour our two charities are that they have much stronger track records than the alternatives and plan to work on very high value areas. I agree that in retrospect there could probably have been more discussion of the relative merits, but the report is already very long. Having looked at the area for many months, I'd be fairly surprised if there were many better climate charities than the ones we recommend. </p>\n", "parentCommentId": "dZj33Lh226hftZ2G6", "user": null}, {"_id": "QTKCMksrXzot6nrqL", "postedAt": "2018-07-12T06:37:09.042Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Thank you John Halstead for putting this report together.\nClimate change is a significant issue in popular culture, and one of the most widely known catastrophic risks, with relatively little analysis in the EA community.  So I'm glad you took it on.</p>\n<p>Some general comments on this report:</p>\n<p>COMMENT 1 - IMPORTANCE VS. MARGINAL TRACTABILITY REGARDING CLIMATE CHANGE\nSomething I've been puzzling over with climate change specifically is that I think funding at the margin might miss the largest emissions reductions needed to stay under a warming target.</p>\n<p>For example, I've contributed to Cool Earth with the goal of rainforest protection.  At the margin, this is an amazing bargain for carbon storage - and can be equated to very cheap carbon emissions reductions at $1 or so per tonne CO2e.  However, there is a limited supply of rainforest protection we can do, and if other areas of emissions are unaddressed, the Amazon may turn into a savanna anyways at current projections of warming, releasing all that carbon.  At higher expected warming, rainforest protection becomes less useful.  This was not considered in the report.  Relevant recent papers on that:\n<a href=\"http://www.pnas.org/content/113/39/10759\">http://www.pnas.org/content/113/39/10759</a>\n<a href=\"https://www.nature.com/articles/s41598-017-15788-6\">https://www.nature.com/articles/s41598-017-15788-6</a></p>\n<p>It's the sort of problem where you may get good returns at the margin for the first 10% of emissions reductions, but you need to hit 80% of the reductions or more to achieve the desired outcome.  Another way to say it is that in most EA causes, marginal tractability counts more than overall importance/scale, but for climate change, these concerns are more equal.</p>\n<p>I think an analogy to this is how energy is priced in a deregulated market - generators bid in their power at a price, the grid operator buys it, and everyone gets paid the price of the last MWh purchased, the highest price on the marginal cost curve that meets the total load.</p>\n<p>I expect the best use of my marginal dollar for climate philanthropy will depend on the current landscape of funding and projections for how quickly we are reducing emissions.  On our current track, we are set for 3-4C of warming, so I'm more inclined to put dollars towards adaptation efforts and economic development / global health for the worlds poorest to lessen the damage than I would be if we were farther along in our decarbonization efforts.</p>\n<p>COMMENT 2 - RENEWABLE ADOPTION POTENTIAL\nA recent report out of the Electric Markets and Policy Group at LBNL (<a href=\"https://emp.lbl.gov\">https://emp.lbl.gov</a>) and related work at NREL <a href=\"https://www.nrel.gov/analysis/re-futures.html\">https://www.nrel.gov/analysis/re-futures.html</a> (disclosure: I'm an NREL employee) have found that we could probably push renewable generation up to 80% of total annual electric production without a significant cost increase.  I think the 2016 reference cited in this report saying &gt;50% would be cost prohibitive with storage is outdated.  This year, renewables + storage beat out gas generation on cost in both California and Colorado markets.  The last 20% of storage will be expensive, and there is ongoing work at the national labs to finds ways to reduce that cost or shift times of energy demand.</p>\n<p>I'll need to review the sources used to do the importance calculation for renewables and EE ( <a href=\"https://docs.google.com/spreadsheets/d/1Bvm8exmAdOUDF1wM1BM5qXBhs5jHIRF6qGGL2le17D4/edit#gid=0)\">https://docs.google.com/spreadsheets/d/1Bvm8exmAdOUDF1wM1BM5qXBhs5jHIRF6qGGL2le17D4/edit#gid=0)</a>, but my initial read is that they are already 4-5 years out of date given recent research.  (As is to be expected; academic meta-reviews lag a few years behind reviews, which lag a few years behind potential studies).</p>\n<p>The electrification of the transportation sector is ignored in this report, but is a necessity towards greater emissions reductions goals, and will greatly increase the importance of renewables.</p>\n<p>COMMENT 3 - MARKET ADOPTION AND COST\nPart of the reason why Nuclear is underfunded in the philanthropic sector is that it cannot compete on cost with renewables. /9<a href=\"https://www.vox.com/energy-and-environment/2018/7/11/17555644/nuclear-power-energy-climate-decarbonization-renewables/0\">https://www.vox.com/energy-and-environment/2018/7/11/17555644/nuclear-power-energy-climate-decarbonization-renewables/0</a>\nPhilanthropists have largely moved on from funding this, except for some fundamental research in reactor designs, simply because market economics means that more plants won't get built, even with a carbon price.\nIn this case, philanthropic neglectedness is a measure of the philanthropic sector's pessimism that more $ towards advocacy would result in greater nuclear power build-out.  The scoring in the report treats neglectedness as a positive for nuclear advocacy when there is a strong reason behind the neglectedness that should decrease the score.</p>\n<p>COMMENT 4 - COMPARISON TO RELATED WORK AND OTHER INTERVENTIONS\nDrawdown <a href=\"https://www.drawdown.org/\">https://www.drawdown.org/</a> is another recent project that does a more thorough calculation of carbon mitigation potential for the interventions considered.  It reaches different estimates of mitigation potential for some interventions. (10x difference for nuclear for example)\nI would have liked this report to have considered other GHGs besides CO2, namely methane and refrigerants.\nRefrigerant emissions reductions have made major progress in recent years with the Kigali Accord (<a href=\"https://www.nytimes.com/2016/10/15/world/africa/kigali-deal-hfc-air-conditioners.html)\">https://www.nytimes.com/2016/10/15/world/africa/kigali-deal-hfc-air-conditioners.html)</a>, but there is much to be done in the space of recovering and controlled destruction of existing refrigerants, refrigerant alternatives, and compressor-free cooling designs.\nClean and plant-based meats to replace animal agriculture and associated methane emissions was excluded from this report for lack of time to evaluate it.  It has importance comparable to or greater than many of the interventions considered and is vastly underfunded in comparison.  I hope it is included in a subsequent analysis.</p>\n<p>COMMENT 5 - SELECTIONS OF SPECIFIC CHARITIES\nI think both Clean Air Task Force and Coalition for Rainforest Nations were excellent choices for funding between 5-20 years ago, and this report does a great job of synthesizing their impressive accomplishments.  I do not share the outlook that their future work will be as impactful.\nGiven that nuclear (even with new designs) and fossil fuel generation are losing the market competitiveness battle to renewables, and that nuclear, CSS, and power plant regulations are the vast majority of the funding gap for CATF, I expected CATF to have very little impact per $ of additional funding in their campaigns over the next several years.  This is the opposite conclusion of the report.<br />I'm also cautious of the potential for Coalition for Rainforest Nations funding given the projections of future warming and the impact on rainforests as carbon sources/sinks.</p>\n<p>I don't have strong candidates for charities I'd recommend in their place, but I'd be happy to contribute to a short-list for the next round of analysis.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "MnvkcFwZ5ymkQiBcs", "postedAt": "2018-07-12T08:25:03.600Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>I turned first to Appendix 5 on concerns about nuclear power and found this: &quot;It needs to be borne in mind that all forms of energy production involve waste.&quot; Is this correct? What sort of waste do solar &amp; wind power produce? if you are recommending nuclear power because the waste it produces is not as bad as that from fossil fuels, but have made an erroneous assumption about waste from renewable sources like solar and wind, then it invalidates the conclusion that nuclear power is a good sector to promote. </p>\n<p>Furthermore, reliance on future technology which does not yet exist to deal with the after-effects is yet another instance of visiting the sins of the fathers on their children - it's reproducing the same behaviour that got us into our present fix (on the brink if not quite yet over it of catastrophic climate change) in the first place!</p>\n<p>I'll read the rest (not all of it backwards!) and may have other queries/comments.</p>\n", "parentCommentId": null, "user": {"username": "JennyJ"}}, {"_id": "sCcuaGsQmXWA3bGzw", "postedAt": "2018-07-12T10:28:11.240Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Thank you for your reply :) </p>\n<p>I will have a deeper look at it when I find the time! So the main take away from my previous comment could be that it may be useful to highlight the &quot;surprises&quot; in the executive summary for people who don't have the time to engage in depth and maybe provide a stronger summary of your process for reaching your recommendation (e.g., have comparative metrics like we have for poverty/health related interventions). Or maybe that's good content for a summarizing blog post? </p>\n<p>Anyhow, thanks again for your effort to update the EA community on this topic :) </p>\n", "parentCommentId": "P7jCpznMx25moCd6m", "user": {"username": "alexherwix"}}, {"_id": "8cwmRxfddP6RKLpnJ", "postedAt": "2018-07-12T15:49:26.629Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Hello, yes wind and solar also both produce waste - old wind turbines and solar panels have to be disposed of. AFAIK, solar involves the handling of hazardous toxic waste to produce the panels - this is why solar has higher death rates per kwh than nuclear, on some studies. Solar and wind are very energy diffuse which means they involve large amounts of hardware; nuclear is energy dense so involves much less land use and waste. </p>\n<p>See this paper on wind turbine blade waste - <a href=\"https://www.sciencedirect.com/science/article/pii/S0956053X17300491\">https://www.sciencedirect.com/science/article/pii/S0956053X17300491</a> </p>\n<p>On your second point, we deal quite easily with nuclear waste with current technology, so I don't think this argument works. It will be even easier to deal with in the future presumably, and there isn't very much of it, in the grand scheme of hazardous waste</p>\n", "parentCommentId": "MnvkcFwZ5ymkQiBcs", "user": null}, {"_id": "t6yCmgFHqNe5uFvHN", "postedAt": "2018-07-12T16:23:13.554Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Thanks for these very insightful comments. </p>\n<p>#1</p>\n<p>I dont think the considerations you mention are a good reason not to think on the margin. Concerns about your gains from preventing deforestation being reversed should be accounted for in your marginal cost-effectiveness estimate. Even if our aim is to reduce emissions by 80%, the best approach is to move down the options on our marginal abatement curve in order of cost. </p>\n<p>I should make clear that I do not think those Cool Earth cost-effectiveness estimates are accurate for the reasons I outline in the report relating to leakage, permanence, verification etc</p>\n<p>#2\nThis seems to be an area with some disagreement, with studies varying between 50% to 80% renewables in certain least cost electricity systems (the latter with huge expansion of intercontinental transmission). I don't think the reference given is outdated (only two years old), and I have read other recent or soon to be published papers drawing the same conclusion, some of which are cited in the report. </p>\n<p>The importance estimates are from AR5 IPCC report integrated assessment models, so yes 4 years old, but reputable. Another option would have been to use the latest IEA World Energy Outlook estimates, which I think would bump solar and wind up a bit, but it wouldn't make any difference to the ITN ranking. I'm not sure the extent to which these models account for transmission and actually matching demand, and it would be very hard to build a model that does this for the entire global electricity system. Accounting for these things tends to disfavour renewables. Also, this is only electricity not all energy, so other stuff like CCS and nuclear will be necessary to get us all the way to decarbonise</p>\n<p>The main thing that justifies deprioritising solar and wind is that they are not neglected, not that they won't have a big part to play. Electrification of transport is ignored in the report but would likely fare poorly because it's already receiving lots of attention. </p>\n<p>I'm very pro-renewables, but I did want to counteract the view, which you implicitly endorse in your comment, that the aim is to get as much renewables as possible. The aim is to decarbonise, and we should do that in the best and cheapest way possible with all technologies at our disposal. </p>\n<p>#3 \nI haven't looked through that paper and will try to have a look, but if it uses levelised cost for each energy source, rather than system levelised cost, then it is misleading. Technology levelised cost is not a fair way to compare intermittent and non-intermittent power sources because it doesn't account for value to the grid, which is better for non-intermittent sources. Energy markets are also not structured to reward nuclear for these services, which is why it sees its margins eaten up by the price volatility associated with renewables. </p>\n<p>One's prior should be that the 'dominant renewables' narrative is surprising given that renewables currently provide very little global energy, whereas nuclear supplies 25% of low carbon energy, and has been doing for ages. There are concerns about nuclear cost, which I discuss in the report, but CATF has a plausible path to actually reducing these costs, which is what needs to be done, otherwise we're screwed.</p>\n<p>The track record of heavy renewables focused countries in actually reducing emissions is not great. Germany has spent billions upon billions on renewables subsidies and yet has not actually reduced emissions per head because it is shutting down its nuclear plants. Decarbonised electricity systems exist today and can be done - they all involve massive reliance on nuclear, hydro or geothermal. Renewables will be able to supply a bigger part of the pie in the future but I feel a lot of the debate is getting ahead of itself.</p>\n<p>#4\nYes I looked at drawdown a bit, but my concern was that it's very unclear where they got their numbers from and since it was done technology by technology and not at the system level, it would get misleading answers. For electricity, getting the system right is what matters and the cost of abatement varies depending on the combination of technologies. </p>\n<p>Drawdown doesn't consider neglectedness of any kind in prioritising interventions. It also looks at things from the point of view of society, whereas I'm looking at things from the pov of the philanthropist. </p>\n<p>I agree that methane and SLCPs are important, and CATF does a lot of work on these. I now think their importance may be overstated at present relative to CO2. (<a href=\"https://www.oxfordmartin.ox.ac.uk/downloads/briefings/Short_Lived_Promise.pdf\">https://www.oxfordmartin.ox.ac.uk/downloads/briefings/Short_Lived_Promise.pdf</a>) Open Phil has funded some refrigerant stuff. </p>\n<p>The stance on clean meat is discussed in the report - I agree it should be included in future if we have time to properly research it. </p>\n<p>#5\nI don't agree with your view that CATF's and CfRN's best days are behind them. Only this year, CATF won a tax credit for CCS in the US (discussed in the report) which stands to have massive climate impact. it would be surprising if they went from conceiving campaigns reducing emissions by megatonnes to having no impact starting right now. It has directly and greatly influenced US government nuclear policy going forward. I disagree with your dim view of nuclear's prospects for the reason outlined above. Again, I think you are only focusing on electricity, not all energy, and renewables can't do much for most of  industry and half of transport - we need CCS, nuclear and synthetic fuels there. CATF continues to produce great research on all parts of the climate puzzle (even the neglected bits) and has a pretty staggering record of getting things done.</p>\n<p>I agree that is a concern about CfRN, but even on pessimistic scenarios of climate-induced forestry protection reversal, delaying climate damages by a number of decades would be highly valuable for adaptation and buying time to develop low carbon technologies. The tonnes of CO2 that CfRN could sequester permanently or for multiple decades if fully funded are extremely large. </p>\n", "parentCommentId": "QTKCMksrXzot6nrqL", "user": null}, {"_id": "WbDwEWofLDM9AihHg", "postedAt": "2018-07-12T17:36:50.291Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Borderline offtopic, but it would be great if you could provide a version of your research that is readable on a smartphone (aka no PDF).</p>\n", "parentCommentId": null, "user": {"username": "BastiS"}}, {"_id": "mTzc2hTyQmEvz7jYu", "postedAt": "2018-07-13T11:38:04.146Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>I'd suggest also evaluating Citizens' Climate Lobby. </p>\n<p>They are working on introducing a revenue-neutral price on carbon, and in their modeling with REMI, the analysis concluded that, during the first 20 years alone, a CF&amp;D policy would lead to:</p>\n<p>• A 50% reduction of carbon emissions below 1990 levels\n• The addition of 2.8 million jobs above baseline, driven by the steady economic stimulus of the energy dividend\n• The avoidance of 230,000 premature deaths due to reduction in air pollutants that often accompany carbon emissions</p>\n<p>The modeling summary is here: <a href=\"https://citizensclimatelobby.org/remi-report/\">https://citizensclimatelobby.org/remi-report/</a></p>\n<p>In terms of progress, in the US they have helped support the formation of the House Climate Solutions Caucus which has 84 members, 42 of which are Republican. Getting Republican support is a game changer. <a href=\"https://citizensclimatelobby.org/climate-solutions-caucus/\">https://citizensclimatelobby.org/climate-solutions-caucus/</a></p>\n<p>Also, they have done it with a volunteer-based approach, where they keep minimal staff in comparison to many other environmental organizations, so the cost-effectiveness is high. </p>\n<p>A last bit, which I don't know that I can quantify, is about EA's rising interest in anti-authoritarianism. CCL's approach is strictly non-partisan, and as a result helps people create bonds across the ideological spectrum. Since authoritarian figures often arise in divided environments, the creation of unity helps mitigate that. </p>\n", "parentCommentId": null, "user": {"username": "BreeneMurphy"}}, {"_id": "qe2P5FMTYKQ9DRDsc", "postedAt": "2018-07-13T13:39:45.669Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Hello we deprioritised carbon price advocacy in the US for the next few years because it looks very intractable at the moment. Might be worth looking at in the next few years if the political situation changes - but we'd be looking at substantial changes as preconditions - congress, senate and president all go democract</p>\n", "parentCommentId": "mTzc2hTyQmEvz7jYu", "user": null}, {"_id": "THfYZ3BbfheGzxQ4S", "postedAt": "2018-07-13T20:00:47.497Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>I can second this. I prefer to download long pieces of text to my phone to read on Pocket/Instapaper. In addition, putting this report up as a web page will make it much more likely to be passed around on social media, Reddit, Hacker News, and so on.</p>\n", "parentCommentId": "WbDwEWofLDM9AihHg", "user": {"username": "Robert_Wiblin"}}, {"_id": "pmp3uA5gifGBYfibW", "postedAt": "2018-07-14T05:19:20.054Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>1\n&quot;Concerns about your gains from preventing deforestation being reversed should be accounted for in your marginal cost-effectiveness estimate.&quot;\nWell yes, if we account for the fact that current best marginal emissions reductions at present might fail in later years into our marginal cost-effectiveness estimate then we can still use the marginal cost-effectiveness estimate.\nIf I did that, it would show rainforest work having mediocre cost-effectiveness because emissions reductions aren't robust.  So we reach different conclusions on best interventions, despite claiming to adhere to the same principle. \nI agree with the position &quot;we should act on the best marginal effectiveness&quot;.  It's just that rainforest work is not independent of other interventions.  Its cost-effectiveness is co-dependent on the cost-effectiveness of other interventions - needing to hit sub 3C century end warming.  So my cost-effectiveness estimate cares more about the 80th percentile on the cost abatement curve from future projects, while a simpler analysis may just focus on the cheapest marginal abatement cost intervention at present yearly emissions. </p>\n<p>This is heavily related to the concept of lock-in (<a href=\"https://www.nature.com/articles/s41558-018-0100-6)\">https://www.nature.com/articles/s41558-018-0100-6)</a>.  Even though some interventions may be more expensive than others, they may represent a substantial enough amount of emissions and lock-in threat that on a longer time horizon they become the best marginal cost-effective interventions at present.</p>\n<p>Once we've accounted for lock-in, largest emissions interventions, robustness, etc., THEN we can start moving down our new inclusive-forecast-century-weighted abatement curve of best interventions.  I just think this will look different from McKinsey's abatement curve and yield different interventions than the ones you've selected in the report.</p>\n<p>2\nI agree the aim is to decarbonize, not get as much renewables growth as possible.  My statement wasn't cheerleading renewables, it was making the observation that in actual grid capacity purchases and planning at present - the current market - renewables are more bullish than they appear in the reports you reference.\nIEA World Energy Outlook has abysmal prediction accuracy on renewable install rates (<a href=\"https://www.vox.com/2015/10/12/9510879/iea-underestimate-renewables)\">https://www.vox.com/2015/10/12/9510879/iea-underestimate-renewables)</a>, and the integrated assessment models in AR5 are similarly conservative in their estimates.<br />This is good news given the amount of emissions that come from the power and buildings sectors.</p>\n<p>I'm confused by your comment &quot;Also, this is only electricity not all energy, so other stuff like CCS and nuclear will be necessary to get us all the way to decarbonise&quot;\nWhere does nuclear contribute besides the power sector?  Your &quot;emissions averted by different energy technologies&quot; has nuclear's impact only from displacing coal and gas electric power.</p>\n<p>4\nYeah, I wish Drawdown was more explicit in their calculations.  I found an error in their documentation on plant diets, but couldn't track down if that was just in the documentation on the calculation too.\nI only reference drawdown because it gives explicit GtCO2e estimates.  For instance, it's nuclear estimate is 16 GtCo2e <a href=\"https://www.drawdown.org/solutions/electricity-generation/nuclear\">https://www.drawdown.org/solutions/electricity-generation/nuclear</a>, while yours is 136 GtCO2e.  It's wind and solar estimate in total is 171 GtCO2e, while yours is 135 GtCO2e.  Not enough to change things on a log scale.\nObviously, you have to look elsewhere for philanthropic neglectedness calculations.</p>\n<p>On points 3 &amp; 5 - \nRecent bids for renewables <em>with</em> storage are cost competitive with gas, and cheaper than nuclear, even at the $60/MWh quoted in the report.</p>\n<p>The intermittent and non-intermittent power source debate is about a decade old, and doesn't reflect the reality that additional intermittent contributions to the grid have made the grid more reliable, not less, at least in the United States.\nEnergy markets are structured to provide a reliable electric grid - they price capacity and <em>when</em> electricity can be produced - and nuclear isn't competing in this environment.\nRecently in the U.S. the nuclear lobby has hitched itself to the coal lobby to argue for emergency interference in energy markets by the government to require subsidizing large plants, precisely because they could not compete in the hourly capacity market.</p>\n<p>Your comment about Germany doesn't seem applicable; renewables reduced emissions compared to the proper counterfactual where they hadn't been installed AND the nuclear plants were taken offline.</p>\n<p>Again, this isn't me cheerleading renewables at the expense of nuclear.  It's an observation of the current energy market that no one is even thinking about starting a new nuclear plant build because of how outrageously expensive they are compared to other options.  There are 2 reactors under construction in the U.S. <a href=\"https://en.wikipedia.org/wiki/Vogtle_Electric_Generating_Plant#Planning_phase\">https://en.wikipedia.org/wiki/Vogtle_Electric_Generating_Plant#Planning_phase</a>, 2 recently abandoned <a href=\"https://en.wikipedia.org/wiki/Virgil_C._Summer_Nuclear_Generating_Station\">https://en.wikipedia.org/wiki/Virgil_C._Summer_Nuclear_Generating_Station</a>, with the primary contractor filing for bankruptcy last year.  All vastly overbudget.</p>\n<p>Given the state of affairs with nuclear, CATF's large share of funding towards nuclear seems like pissing money away, especially since the government already funds this heavily through the DOE for reasons other than emissions reductions and competitive energy.  I think the argument for CATF has the best donation target relies on their CCS work solely.</p>\n<p>We can have different perspectives on this, and I share a different outlook, so I propose a bet:\nIf a nuclear plant is built in the US:\n1) at least 150 MW in size,\n2) in the next 10 years,\n3) with construction started 2019 or later,\n4) and sells its power in a competitive bid process for an electric grid,\nI will pay you $100.  If not, you pay me $100.</p>\n<p>Also - can you respond or publish on why you didn't include an analysis of the other charities in the report that you include but do not recommend? Why were they rejected?</p>\n", "parentCommentId": "t6yCmgFHqNe5uFvHN", "user": {"username": "MatthewDahlhausen"}}, {"_id": "6PDYrMgc6RvDsucc9", "postedAt": "2018-07-14T09:12:48.043Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>cool, will pass on </p>\n", "parentCommentId": "THfYZ3BbfheGzxQ4S", "user": null}, {"_id": "cNtAA7HMvAnJyTubF", "postedAt": "2018-07-14T10:00:36.618Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<ol>\n<li><p>I would need to look in more detail at the predictions about savannisation of the Amazon - I know Amazon dieback is extremely controversial in the literature, with some people dismissing the possibility. From memory, the last IPCC report leaned towards it not being a major risk. It's normal to arrive at different estimates of marginal cost-effectiveness if we disagree about some relevant facts. I thought initially you were chiefly questioning the principle, not the relevant facts.</p>\n</li>\n<li><p>Nuclear can be used in the future to produce industrial heat or to produce synthetic fuels. The model I use is an admittedly crude attempt to get the right ballpark of what nuclear can do, but I believe are accurate enough, for the reasons given. </p>\n</li>\n</ol>\n<p>I don't agree that the intermittent/non-intermittent debate is in some way out of date. The debate I am talking about is about what a least cost fully decarbonised energy system would look like, and I am claiming it will not have &gt;&gt;50% renewables. Considering the recent Clack-Jacobsen farrago, this debate is definitely not out of date. As I see it, I'm defending the mainstream view, as accepted by many pro-renewables people like Clack and Sivaram.</p>\n<p>Adding renewables on to the grid at the moment poses less of an intermittency challenges because they are not supplying (say) 30% of electricity. AFAIK, the storage capacity to get them to do this doesn't exist/would be incredibly expensive. </p>\n<p>I explicitly frame CATF's nuclear innovation work as a 'high risk high reward' bet on them getting it to reduced cost, and I go into some depth showing why I think they probably (&gt;50% probability) won't succeed. So, I don't think we're disagreeing. Even a relatively small chance of getting nuclear to around the current price of gas in numerous different countries would be a huge win. CATF seems uniquely well-placed to have an effect on this front.</p>\n<p>I should note that rising costs are not a feature of all nuclear projects. China, Korea and the UEA all build cheap nuclear power plants. It's not going well at the moment in Europe and the US. Hence, why it is worth exploring ways to reduce cost.</p>\n<p>I do like a bet, but I don't think this one would get at our disagreement, which seems to be about the role of renewables in future least cost electricity systems. CATF's nuclear innovation project, if it succeeds, will only have an effect by the mid-2020s at the earliest. I agree with you that overbudget nuclear projects are likely within the next few years. The point is that nuclear will have to have a major role in future decarbonised electricity systems. </p>\n<p>Other charities - the reason at the time was excessive length, though as I have mentioned, in retrospect, more detail would have been better. </p>\n<p>In brief: CfRN is better than project-based deforestation charities for the reasons outlined. It is also much better placed to have influence on REDD negotiations than other advocates like EDF because it actually has a seat at the table in UN negotiations. This is likely to be true in the future and definitely was true in the past, according to sources I have reason to believe would be neutral.</p>\n<p>CATF has many more major policy successes than Third Way or Energy for Humanity, even though I like both orgs. CATF conceived of the only major succesful CCS advocacy project to date. Given that CCS is so high priority on the ITN analysis, this alone is almost decisive. EDF Europe does good work but a lot of their successful campaigns were conceived and led by CATF, and they are large and well funded, so CATF looks a better bet on the counterfactual impact front. They also don't do much work on the priority areas I identified. Bellona are one of the few groups advocating for CCS in Europe, but they appear to be struggling to make serious progress, unlike CATF. Sources also informed me that CATF gets more done in China than any other group. Sandbag have a good approach, but I marked out climate in Europe as lower priority, and they haven't had any major success on CCS and their track record cannot compete with CATF. I'm very sceptical of the confrontational approach taken by Shellenberger and Environmental Progress, and I'm not sure they should get as much credit as they claim for their policy successes. </p>\n", "parentCommentId": "pmp3uA5gifGBYfibW", "user": null}, {"_id": "BTaJrnzu65jhsf9ZP", "postedAt": "2018-07-16T11:40:31.661Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>While a few years ago I would have understood, there has been a significant change on the Republican side. There are 43 Republican members of the House who have joined the Climate Solutions Caucus and are working on policy. Also, there's the Climate Leadership Council that is comprised of business leaders and fellow Republicans who are actively lobbying Republicans with success. I referenced the Climate Solutions Caucus above, so here's the Climate Leadership Council: <a href=\"https://www.clcouncil.org/\">https://www.clcouncil.org/</a></p>\n", "parentCommentId": "qe2P5FMTYKQ9DRDsc", "user": {"username": "BreeneMurphy"}}, {"_id": "hBofYRWkpvXrF4MtQ", "postedAt": "2018-07-16T14:55:23.155Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>For future reference, in the interests of full disclosure I think it would be worth mentioning when you recommend a charity that you volunteer for it </p>\n", "parentCommentId": "BTaJrnzu65jhsf9ZP", "user": null}, {"_id": "ECqxbKqjsYTGKZGpq", "postedAt": "2018-07-18T12:51:48.842Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Will do. Sorry about that. </p>\n<p>Interesting news on Republicans and climate change: <a href=\"https://www.eenews.net/stories/1060089315\">https://www.eenews.net/stories/1060089315</a></p>\n", "parentCommentId": "hBofYRWkpvXrF4MtQ", "user": {"username": "BreeneMurphy"}}, {"_id": "9ay7qxbm2uBXFMNWC", "postedAt": "2018-07-20T23:39:04.694Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Hello - Not sure what happened, but it looks like the report is no longer linked to in the Climate Change Prevention section of the research page (<a href=\"https://founderspledge.com/research)\">https://founderspledge.com/research)</a>. Can someone please repost the link to the report?</p>\n", "parentCommentId": null, "user": {"username": "hannahkates"}}, {"_id": "ND59h2i8A6jXTHXrF", "postedAt": "2018-07-22T15:48:54.705Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>I think that a focus on partisan politics, and one that especially tries to narrow its scope to Republicans, suffers from lacking a firm framework of how this is supposed to create a specific outcome. One individual Republican representing a heavily Democratic district on the front lines of sea level rise discussing a carbon tax, with almost no real support from the rest of his caucus, is an aberration.</p>\n<p>Across the board, Republican politicians oppose carbon taxes, the House took such a vote this week and the efforts by CCL to provide cover to the Republicans in the Climate Solutions Caucus who voted for a resolution opposing carbon taxes seems like the very definition of ineffective.</p>\n<p>If there's a case for engagement in the political process around climate change, it's looking at the risks of climate change and determining the most effective strategies to adapt to them. For example, perhaps a certain degree of sea level rise is baked into the cake and an effective policy response is reducing exposure of properties to this risk. So coastal resiliency and flood insurance reform would make sense. However while some of the values of properties and communities involved in, say, significant flooding in Miami may be high, I don't know if it's that significant in any sort of global sense.</p>\n", "parentCommentId": "ECqxbKqjsYTGKZGpq", "user": {"username": "LHarrison"}}, {"_id": "zwmM6g8Zsycz8gJSi", "postedAt": "2018-07-29T22:39:58.939Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Have you considered reaching out to Giving What We Can and asking them to add a notice at the top of <a href=\"https://www.givingwhatwecan.org/report/cool-earth/\">their Cool Earth page</a> informing donors that they may be interested in your report? They already have a notice that says the information may be outdated, but a donor who reads that may think that it's still the best available research unless informed of newer research.</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "dnxjrRFGDtXbLczEA", "postedAt": "2018-07-30T17:06:58.780Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>Sorry if this is 'clutter' but i will mention CCAN (chesapeake climate action network, based near Wash DC).They do good work mostly on energy conservation, solar power, carbon taxation (which may be feasible politically in this area), , mountain top removal coal ming, and fracking and pipelines in the Appalachian mountains--all very difficult political and social issues.  i have disagreed with a few of their policies (ie putting wind farms in Appalachian Mountains; i support offshore wind power rather than turning near wilderness into industrial wind farms--and I think they now mostly support my position),</p>\n<p>  Its likely CCAN because it operates in an area which has many envrionmentalists and  affluent people does not really need more funding (one of the EA concepts---dont put more money where its not needed)---CCAN knows how to raise funds (eg they have a 3 day comedy show benefit this weekend).  But I will just put out a plug for them as being an ok group but there may be other groups with higher priority.</p>\n<p>This subgroup of EA i find interesting and potentially useful. </p>\n", "parentCommentId": null, "user": {"username": "ishi"}}, {"_id": "jc76h2EndNjoi4ej9", "postedAt": "2018-08-01T15:31:25.027Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>It is back on the page, as well as here: <a href=\"https://founderspledge.com/research/Cause%20Report%20-%20Climate%20Change.pdf\">https://founderspledge.com/research/Cause%20Report%20-%20Climate%20Change.pdf</a></p>\n<p>Sorry about that.</p>\n", "parentCommentId": "9ay7qxbm2uBXFMNWC", "user": {"username": "DevonFritz"}}, {"_id": "M288gone9aTHhXTBC", "postedAt": "2018-08-31T08:15:41.476Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>I've been volunteering for climate change for over a decade now, and after thoroughly researching the topic, have finally settled on Citizens' Climate Lobby as the best approach to solving the problem. Based on what I've seen, if we could get ~250 active volunteer constituents in at least 2/3rds of Congressional districts, we could pass Carbon Fee &amp; Dividend. There is actually a majority in support now in each Congressional district (<a href=\"http://climatecommunication.yale.edu/visualizations-data/ycom-us-2018/\">http://climatecommunication.yale.edu/visualizations-data/ycom-us-2018/</a>) and each political party (<a href=\"http://climatecommunication.yale.edu/wp-content/uploads/2018/05/Global-Warming-Policy-Politics-March-2018.pdf\">http://climatecommunication.yale.edu/wp-content/uploads/2018/05/Global-Warming-Policy-Politics-March-2018.pdf</a>) for a revenue-neutral carbon tax. More than 2/3rds of Republicans are actually receptive (<a href=\"https://community.citizensclimatelobby.org/wp-content/uploads/2017/11/june-2017-meeting-analysis-1127.pdf)\">https://community.citizensclimatelobby.org/wp-content/uploads/2017/11/june-2017-meeting-analysis-1127.pdf)</a>, and that's despite the fact that the typical Republican district has just over ~50 active volunteers (though as many as 283 and as few as 2).  We probably only need an additional 45k volunteers in targeted districts, and that's on the conservative side, as it could take even fewer. </p>\n<p>Lobbying works (<a href=\"https://sociology.stanford.edu/sites/default/files/publications/friends_or_foes-how_social_movement_allies_affect_the_passage_of_legislation_in_the_u._s._congress.pdf)\">https://sociology.stanford.edu/sites/default/files/publications/friends_or_foes-how_social_movement_allies_affect_the_passage_of_legislation_in_the_u._s._congress.pdf)</a>, and public opinion matters (<a href=\"https://www.tandfonline.com/doi/abs/10.1080/09644016.2016.1116651)\">https://www.tandfonline.com/doi/abs/10.1080/09644016.2016.1116651)</a>. The biggest barrier is probably that people tend to underestimate how popular these policies are (<a href=\"https://earth.stanford.edu/news/public-support-climate-policy-remains-strong\">https://earth.stanford.edu/news/public-support-climate-policy-remains-strong</a>) and that prevents them from taking action. </p>\n", "parentCommentId": "hBofYRWkpvXrF4MtQ", "user": {"username": "EmilyC"}}, {"_id": "9tGmei9JHdmMjK7g4", "postedAt": "2018-08-31T16:41:31.287Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>It's not really narrowing its scope to Republicans. It's a non-partisan organization with a policy that has bipartisan support. It's just been especially important to talk about Republican support since Republicans have been largely denying climate change up until very recently. </p>\n<p>A carbon tax is required to solve climate change (<a href=\"http://news.mit.edu/2016/carbon-tax-stop-using-fossil-fuels-0224\">http://news.mit.edu/2016/carbon-tax-stop-using-fossil-fuels-0224</a>) and only government has the power to levy a tax.</p>\n", "parentCommentId": "ND59h2i8A6jXTHXrF", "user": {"username": "EmilyC"}}, {"_id": "HZev6KJRXtNDLfbPN", "postedAt": "2019-05-14T09:31:18.667Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<html><head></head><body><p>Hey guys, does anyone know how effective the organisation Chooose actually is? Should they be in the pile of recommendations?</p>\n<p>Best</p>\n</body></html>", "parentCommentId": null, "user": {"username": "KFP"}}, {"_id": "bfby8RhHN2N7eNfAw", "postedAt": "2019-09-21T02:39:54.463Z", "postId": "3poYR8mXfcr9YM34Z", "htmlBody": "<p>The report link has moved to: <a href=\"https://founderspledge.com/research/fp-climate-change\">https://founderspledge.com/research/fp-climate-change</a> </p>", "parentCommentId": "jc76h2EndNjoi4ej9", "user": {"username": "vivek"}}]