[{"_id": "p8fKqw3qKY4mHuLpS", "postedAt": "2017-12-16T01:03:36.941Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>This isn't a commitment, but, just as a curiosity: does the CEA take cryptocurrency?</p>\n", "parentCommentId": null, "user": {"username": "brunoparga"}}, {"_id": "AbF3rTCY8XtkJz3pr", "postedAt": "2017-12-16T03:14:14.521Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Interesting! Some questions from the explanation on the website:</p>\n<blockquote>\n<p>But choosing which advisors to rely on is also difficult, and it may be the case that there is no relevant expert who you believe captures all the considerations.</p>\n</blockquote>\n<p>It's not clear to me how a donor lottery would capture all the considerations. Can you elaborate? </p>\n<blockquote>\n<p>In expectation, each donor is granting the same amount of money to their preferred charities as they would have if they had donated directly.</p>\n</blockquote>\n<p>Does this presume that (some) donors already know where they prefer to donate, rather than offsetting time spent on additional research with a larger donation pool? </p>\n<blockquote>\n<p>However, for the donor that wins, the larger pot of money makes it worthwhile to spend more time and energy researching where the money should go. It also creates an economy of scale for the other individual donors in the lottery, as only one person is required to do the research...</p>\n</blockquote>\n<p>Is there an expectation (or requirement) that the winning donor provides a write-up of their research and reasoning for their selected charity? </p>\n", "parentCommentId": null, "user": null}, {"_id": "5Cu7fZ8fRN8d7ytkH", "postedAt": "2017-12-16T07:43:24.572Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>It's not clear to me how a donor lottery would capture all the considerations. Can you elaborate?</p>\n</blockquote>\n<p>In this case, you haven't found an advisor who you trust to take into account all the things you consider to be relevant. So, instead of relying on a third-party advisor, you do the research yourself. As research is costly for any given individual to undertake, it may not make sense for you to do this with a smaller donations, but with the larger pot, if you win, you've got more incentive to undertake whatever research you feel is necessary (i.e. that 'captures the relevant considerations').</p>\n<blockquote>\n<p>Does this presume that (some) donors already know where they prefer to donate, rather than offsetting time spent on additional research with a larger donation pool?</p>\n</blockquote>\n<p>It's just meant to illustrate that the value of the <em>amount</em> that you would be able to grant to a preferred organization is the same in expectation whether you participate in the lottery or donate directly. The lottery then may generate additional upside, potentially increasing the effectiveness of your donation if you do more research, and also giving you access to different funding opportunities (providing seed funding for an organization, donating to organizations that have a minimum donation threshold etc)</p>\n<blockquote>\n<p>Is there an expectation (or requirement) that the winning donor provides a write-up of their research and reasoning for their selected charity?</p>\n</blockquote>\n<p>[updated — see more in the discussion below]</p>\n<p><em>We think that it's in the spirit of the lottery that someone who does useful research that would be of interest to other donors should publish it (or give permission for CEA to publish their grant recommendation). Also, if they convince others to donate then they'll be causing additional grants to go to their preferred organization(s). We'll strongly encourage winners to do so, however, in the interests of keeping the barriers to entry low, we haven't made it a hard requirement.</em></p>\n", "parentCommentId": "AbF3rTCY8XtkJz3pr", "user": {"username": "SamDeere"}}, {"_id": "b7rdqYmTHzMJ8tSBX", "postedAt": "2017-12-16T07:46:43.389Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Yes, we can take donations in cryptocurrency (it's worth noting that donating appreciated assets can have tax advantages over converting and donating in fiat). We're in the process of figuring out a solution that allows you to do this directly via the website, but for now if you want to donate in crypto please email lottery[at]effectivealtruism[dot]org and we can discuss</p>\n", "parentCommentId": "p8fKqw3qKY4mHuLpS", "user": {"username": "SamDeere"}}, {"_id": "dLKMAkRQM6M68R5v4", "postedAt": "2017-12-16T17:38:36.869Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Maybe mention that on the site? There are a lot of crypto donations happening now.</p>\n", "parentCommentId": "b7rdqYmTHzMJ8tSBX", "user": {"username": "CarlShulman"}}, {"_id": "wxaX7PYmutJdLfonz", "postedAt": "2017-12-16T17:40:38.373Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>It's also not entirely clear to me how block overflow is handled. Do you have a second guarantor waiting in the wings for the second block?</p>\n</blockquote>\n<p>If you have overflow, that means you have more than the amount of the first block coming in, so you only need the guarantor for the last block. E.g. if people enter with $150,000 collectively, then $100,000 of that goes to pay out for the first block (which will definitely pay out because all of its numbers are allocated). In the 50% chance that the second block is won, then the guarantor will add $50,000 to pay out the second block (and otherwise the guarantor will allocate the funds, basically the guarantor is just committing to take all the unclaimed tickets on the last block).</p>\n", "parentCommentId": "XLgfukian5oYtqh8s", "user": {"username": "CarlShulman"}}, {"_id": "9zs65tRjLzMHXNTBb", "postedAt": "2017-12-16T19:40:07.314Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Is there a recap of what happened in last year's lottery?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "i2pWJk6jkY73tzeh7", "postedAt": "2017-12-16T20:28:25.588Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>See the <a href=\"http://effective-altruism.com/ea/166/donor_lottery_details/\">post</a> for that lottery: Tim Telleen-Lawton (former GiveWell employee) won. He is planning to post about his donations soon.</p>\n<p>Do note, though, that the odds of payouts for other participants are unaffected by anyone's particular participation in this lottery design. For you, it doesn't matter what other participants plan to do except insofar as you would change your donation plans upon hearing they had made or not made a similar donation outside the lottery context. [I mention this because there is a common misconception to the contrary.] </p>\n<p>One way in which your donation decision might depend on those of others would be if you were part of a small school of thought on the best giving (with total donations that are on the rough scale of the block size or smaller), and a large portion of that school was in the donor lottery. E.g. say only donors with $20,000 in total donations are interested in cause X, and there are significantly diminishing returns going from $20,000 to $100,000. Then if all the donors entered a donor lottery (in the same block) with a block size of $100,000 there would be an 80% chance of $0 to cause X and a 20% chance of $100,000 to cause X. The benefits of better investigation in the latter case might not be enough to offset the diminishing returns. This is analogous to how your decision to donate to cause X could be affected by the news that it was currently receiving donations of $20,000 or $100,000 outside the lottery context.</p>\n<p>However, the total pool of EA giving, and EA giving for most causes (including donors who can switch based on changes in funding levels) is large enough that small donors in one $100,000 block won't significantly move along the diminishing returns curve.</p>\n", "parentCommentId": "9zs65tRjLzMHXNTBb", "user": {"username": "CarlShulman"}}, {"_id": "Qx6AEHk9ufciTjvGE", "postedAt": "2017-12-16T22:28:50.691Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>We think that it's in the spirit of the lottery that someone who does useful research that would be of interest to other donors should publish it (or give permission for CEA to publish their grant recommendation). Also, if they convince others to donate then they'll be causing additional grants to go to their preferred organization(s). We'll strongly encourage winners to do so, however, in the interests of keeping the barriers to entry low, we haven't made it a hard requirement.</p>\n</blockquote>\n<p>Seems like even strong social pressure might be enough to be a significant barrier to entry. I feel excited about entering a donor lottery, and would feel less excited if I thought I'd feel accountable if I won (I might still enter, but it seems like a significant cost).</p>\n<p>Would an attitude of &quot;we think it's great if you want to share (and we could help you with communication) but there's no social obligation&quot; capture the benefits? That's pretty close to what you were saying already, but the different tone might be helpful for some people.</p>\n", "parentCommentId": "5Cu7fZ8fRN8d7ytkH", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "NE38unCicruH2DXRH", "postedAt": "2017-12-17T03:16:07.135Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Good stuff, joined!</p>\n", "parentCommentId": null, "user": null}, {"_id": "YntJCvbLSd3BBWZqs", "postedAt": "2017-12-17T08:57:01.651Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>I'm certainly happy with that. I think it's important to point out the positive externalities to the community/other donors if people make interesting research findings, especially if there's a relatively high likelihood that people will be investing time and energy into the research. When responding I had in mind that this could be a very minimalistic thing (e.g. the name of the recipient and possibly a couple of sentences explaining the thinking behind the decision), but on reflection I think the words 'write-up of their research and reasoning' in the OP imply something much more substantial. In either case, I agree that it'd be bad for this to feel like a cost that stopped people entering, so I'm endorsing your phrasing, and I'll edit my previous message to point this out.</p>\n", "parentCommentId": "Qx6AEHk9ufciTjvGE", "user": {"username": "SamDeere"}}, {"_id": "xwrAaA8g7aucYMPbf", "postedAt": "2017-12-17T09:01:53.180Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Yes! Sorry about the wait on this — just after moving the Pledge form to EffectiveAltruism.org, we decided to prioritise getting the donor lottery ready in time for the end of the US tax year, but this will be implemented soon.</p>\n", "parentCommentId": "FRnbz3pRBRCGGtDR3", "user": {"username": "SamDeere"}}, {"_id": "gfR7Xr3ra9mLL9GhJ", "postedAt": "2017-12-17T09:03:17.777Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Agreed — I'll get this updated early next week</p>\n", "parentCommentId": "dLKMAkRQM6M68R5v4", "user": {"username": "SamDeere"}}, {"_id": "khynnfz4QPXktdwip", "postedAt": "2017-12-17T12:21:29.723Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>What happens if a non-EA wins? </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "kKp9WHA75DjyZ4M8P", "postedAt": "2017-12-17T14:32:48.141Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Ideally, non-EAs can enter and win. As <a href=\"http://effective-altruism.com/ea/1ip/announcing_the_2017_donor_lottery/cvm\">Carl said</a>, on a first cut analysis, what you're doing doesn't depend on what other people do. You're simply buying a 1/m chance of donating m times your contribution, and if other EAs or non-EAs want to do the same, then all power to them.</p>\n<p>In practice, CEA technically gets to make the final donation decision. But I can't see them violating a donor's choice.</p>\n", "parentCommentId": "khynnfz4QPXktdwip", "user": {"username": "RyanCarey"}}, {"_id": "2zTEECuiWTjkuMMxu", "postedAt": "2017-12-17T18:00:05.801Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>I'm curious about why blocks were chosen rather than just a single-lottery scheme, i.e., having all donors contribute to the same lottery, with a $100k backstop but no upper limit.  The justification on the webpage is</p>\n<blockquote>\n<p>Multiple blocks ensure that there is no cap on the number of donors who may enter the lottery, while ensuring that the guarantor's liability is capped at the block size.</p>\n</blockquote>\n<p>But of course we could satisfy this requirement with the single-lottery scheme.  The single-lottery scheme also has the benefits that (1) the guarantor has significantly less risk since there's a much higher chance they need to pay nothing, especially once the popularity of donor lotteries is more stable and (2) the &quot;leverage&quot; can get arbitrarily high rather than being capped by $100k/.  The main feature (benefit?) of the multi-block scheme is, as Carl says elsewhere in this thread, &quot;the odds of payouts for other participants are unaffected by anyone's particular participation in this lottery design&quot;.  But it's not clear to me why this non-interaction principle is better than allowing large leverage.  We just want to be really careful about unintended incentives?</p>\n", "parentCommentId": null, "user": {"username": "Jess_Riedel"}}, {"_id": "X3stRLL3DPgvXAS35", "postedAt": "2017-12-17T18:26:08.580Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>The point of a donor lottery is to help donors move to an efficient scale to research their donations or cut transaction costs. But there are important diminishing returns to donations if those donations are large relative to total funding for a cause or organization. So it is possible to have a pot that is inefficiently large, so that small donors risk not plucking low-hanging fruit. If the odds and payouts were determined by the unknown level of participation, then a surge of interest could result in an inefficiently large pot (worse, one that is set after people have entered).</p>\n<p>$100,000 is small enough relative to total EA giving, and most particular causes in EA, not to worry much about that, but large enough to support increased research while reducing the expected costs thereof. If a lottery winner, after some further consideration, wants to try to lottery up to a still larger scale they can request that. However, overly large pots cannot be retroactively shrunk after winning them.</p>\n<blockquote>\n<p>We just want to be really careful about unintended incentives?</p>\n</blockquote>\n<p>One of the most common mistakes people have on hearing about donor lotteries is worrying about donors with different priorities. So making it crystal clear that you don't affect the likelihood of payouts for donors to other causes (and thus the benefits of additional research and reduced transaction costs for others) is important.</p>\n", "parentCommentId": "2zTEECuiWTjkuMMxu", "user": {"username": "CarlShulman"}}, {"_id": "3LtkFhH5NbY4fCb3z", "postedAt": "2017-12-17T18:44:59.992Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Right, non-EAs entering the lottery get to improve their expected donation quality but don't change the expected payouts for anyone else (and we generally don't have reason to worry about correlating donation sizes via the lottery with them, unless you would otherwise want to switch your donation depending on slight changes in the amount of non-EA donations in whatever area).</p>\n", "parentCommentId": "kKp9WHA75DjyZ4M8P", "user": {"username": "CarlShulman"}}, {"_id": "Gk5NWFSbJmSiymcYu", "postedAt": "2017-12-17T19:21:15.000Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>A $200k lottery has about 4x as much cost-via-risk as a $100k lottery. Realistically I think that smaller sizes (with the option to lottery up further) are significantly better than bigger pots. As the pot gets bigger you need to do more and more thinking to verify that the risk isn't an issue.</p>\n<p>If you were OK with variable pot sizes, I think the thing to do would be:</p>\n<ul>\n<li>The lottery will be divided up into blocks.</li>\n<li>Each block will have have the same size, which will be something between $75k and $150k.</li>\n<li>We provide a backstop only if the total donation is &lt; $75k. Otherwise, we just divide the total up into chunks between $75k and $150k, aiming to be about $100k.</li>\n</ul>\n", "parentCommentId": "2zTEECuiWTjkuMMxu", "user": {"username": "Paul_Christiano"}}, {"_id": "4DhzSLC6dYCtaEEEh", "postedAt": "2017-12-17T23:42:10.566Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>In practice, CEA technically gets to make the final donation decision. But I can't see them violating a donor's choice.</p>\n</blockquote>\n<p>To emphasise this, as CEA is running this lottery for the benefit of the community, it's important for the community to have confidence that CEA will follow their recommendations (otherwise people might  be reticent to participate). So, to be clear, while CEA makes the final call on the grant, unless there's a good reason not to (see the 'Caveats and Limitations' section on the EA.org Lotteries page) we'll do our best to follow a donor's recommendation, even if it's to a recipient that wouldn't normally be thought of as a strictly EA.</p>\n<hr />\n<blockquote>\n<p>What happens if a non-EA wins?</p>\n</blockquote>\n<p>It's worth pointing out that one's motivation to enter the lottery should be to <em>win the lottery</em>, not to put money into a pot that you in fact hope will be won and allocated by someone else better-qualified to do the research than you are. If there are people entering the lottery who you think will make better decisions than you (even in the event that you won), then you should either donate on their behalf (i.e. agree with them <em>in advance</em> that they can research and make the recommendation if you win), or wait for the lottery draw, and then follow their recommendation if they win.</p>\n<p>(not implying that this necessarily is your motivation, just that &quot;I'll donate hoping for someone else to win&quot; is a meme that I've noticed comes up a lot when talking about the lottery and I wanted to address it)</p>\n", "parentCommentId": "kKp9WHA75DjyZ4M8P", "user": {"username": "SamDeere"}}, {"_id": "WazoeDa3izbmCSKky", "postedAt": "2017-12-18T04:18:24.818Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>Could you explain your first sentence?  What risks are you talking about?</p>\n<p>Also, how does one lottery up further if all the block sizes are $100k?  Diving it up into multiple blocks doesn't really work.</p>\n", "parentCommentId": "Gk5NWFSbJmSiymcYu", "user": {"username": "Jess_Riedel"}}, {"_id": "nQLLQnn3gxMEyX2Yo", "postedAt": "2017-12-18T05:40:50.226Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>Could you explain your first sentence? What risks are you talking about?</p>\n</blockquote>\n<p>Probably the risks of moving down the diminishing returns curve. E.g. if Good Ventures put its entire endowment into a donor lottery (e.g. run by BMGF) for a 1/5 chance of 5x endowment diminishing returns would mean that returns to charitable dollars would be substantially higher in the worlds where they lost than when they won. If they put 1% of their endowment into such a lottery this effect would be almost imperceptibly small but nonzero. Similar issues arise for the guarantor.</p>\n<p>With pots that are small relative to the overall field or the guarantor's budget (or the field of donors the guarantor considers good substitutes) these costs are tiny but for very big pots they become less negligible.</p>\n<blockquote>\n<p>Also, how does one lottery up further if all the block sizes are $100k?</p>\n</blockquote>\n<p>Take your 100k and ask Paul (or CEA, to get in touch with another backstopping donor) for a personalized lottery. If very large it might involve some haircut for Paul. A donor with more resources could backstop a larger amount without haircut. If there is recurrent demand for this (probably after donor lotteries become more popular) then standardized arrangements for that would likely be set up (I would try to do so, at least).</p>\n", "parentCommentId": "WazoeDa3izbmCSKky", "user": {"username": "CarlShulman"}}, {"_id": "3CPc8QnjgTbTwNWPy", "postedAt": "2017-12-18T06:41:14.972Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>You have diminishing returns to money, i.e. your utility vs. money curve is curved down. So a gamble with mean 0 has some cost to you, approximately (curvature) * (variance), that I was referring to as the cost-via-risk. This cost is approximately linear in the variance, and hence quadratic in the block size.</p>\n", "parentCommentId": "WazoeDa3izbmCSKky", "user": {"username": "Paul_Christiano"}}, {"_id": "azpBnfnASvLXqgCj5", "postedAt": "2017-12-18T14:11:49.544Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>A simple variation on the current system would allow people to opt into lottery-ing up further (to the scale of the total donor lottery pot):</p>\n<p>Ask people what scale they would like to lottery to. If $100k, allocate them a range of tickets in one block as in the current system. If (say) $300k, split their tickets between three blocks, giving them the same range in each block. If their preferred scale exceeds the total pot, just give them correlated tickets on all available blocks.</p>\n<p>If there's a conflict of preference between people wanting small and large lotteries so they're not simultaneously satisfiable (I think this is somewhat unlikely in practice unless someone comes in with $90k hoping to lottery up to $100k), first satisfy those who want smaller totals, then divide the rest as fairly as possible.</p>\n", "parentCommentId": "WazoeDa3izbmCSKky", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "9BuFx2QuiRJb63yfa", "postedAt": "2017-12-18T14:15:22.029Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>I don't quite have an algorithm in mind for this. I think in practice it would likely be easy to find solutions to dividing tickets, but perhaps one would want something more specified first.</p>\n<p>With a well-specified algorithm and an understanding that it was well-behaved, one could imagine shrinking the block size right down to give people flexibility over their lottery size and reduce the liability of the guarantor. There is perhaps an advantage to having a canonical size for developing buy-in to the idea, though.</p>\n", "parentCommentId": "azpBnfnASvLXqgCj5", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "Ao7zTYnnZNX29oSYv", "postedAt": "2017-12-18T21:42:53.681Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>An alternative model for variable pot sizes is to have a much larger guarantor (or a pool of guarantors), and then run rolling lotteries. Rather than playing against the pool, you're just playing against the guarantor, and you could set the pot size you wanted to draw up to (e.g. your $1000 donation could give you a 10% shot at a $10k pot, or a 1% shot at a $100k pot). The pot size should probably be capped (say, at $150k), both for the reasons Paul/Carl outlined re diminishing returns, and to avoid pathological cases (e.g. a donor taking a $100 bet on a billion dollars etc). Because you don't have to coordinate with other donors, the lottery is always open, and you could draw the lottery as soon as your payment cleared. Rather than getting the guarantor to allocate a losing donation, you could also 'reinvest' the donations into the overall lottery pool, so  eventually the system is self-sustaining and doesn't require a third-party guarantor. <em>[update: this model may not be legally possible, so possibly such a scheme would require an ongoing guarantor]</em></p>\n<p>This is more administratively complex (if only because we can't batch the manual parts of the process to defined times), but there's a more automated version of this which could be cool to run. At this stage I want validate the process of running the simpler version, and then if it's something there's demand for (and we have enough guarantor funds to make it feasible) we can look into running the rolling version sometime next year.</p>\n", "parentCommentId": "WazoeDa3izbmCSKky", "user": {"username": "SamDeere"}}, {"_id": "SCB6933ac7QBG29Ry", "postedAt": "2017-12-20T18:40:02.749Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>I've posted <a href=\"http://effective-altruism.com/ea/166/donor_lottery_details/cwv\">an update about my donation plans</a> in the comments of the post that Carl linked above.</p>\n", "parentCommentId": "i2pWJk6jkY73tzeh7", "user": {"username": "TimothyTelleenLawton"}}, {"_id": "Bb3EoCZA4Hzyjdd2e", "postedAt": "2017-12-21T16:15:17.531Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>1) The winner of the last lottery, Tim, wrote several paragraphs explaining his choice of where to send the winnings. Is this required/expected of future winners? I can understand that a winner selecting a non-EA cause might end up having to convince CEA of their decision, but if I win and just want to give the money to a bona fide EA cause, do I have to say anything about my thought process?</p>\n<p>2) Are there advocacy-related reasons for donating directly to charities instead of joining such a lottery? For example, if I'm trying to increase my impact by convincing others to join EA, and someone asks where I donate, there seems to be a cost associated with describing a complicated lottery scheme that may end up with my money going to a cause that I think is ineffective or possibly even bad. It seems likely that people would be confused by the scheme and put off, or even think that I was being swindled.</p>\n<p>2b) Relatedly, while I personally trust that the complexities of the scheme arise from a desire to optimise it for fairness and other considerations, I worry that the explanations may be off-putting to some. I appreciate that they are in beta, so I will try to be constructive: I would like to see something like an interactive page with colourful buttons and neat graphics that explains how the scheme works. The boxes (A,B,C,G) are a great start, but I think that for example the equations would be best kept behind an expanding box, or even on another page. The headers as they are are good (though might be better framed as questions like &quot;how will the winner be chosen?&quot;). My take-home point here is that having all of the information on one page is intimidating. These are suggestions largely based on my personal experience of looking through the page.</p>\n", "parentCommentId": null, "user": {"username": "Simon_Jenkins"}}, {"_id": "9T5PWQgqGYLGCTf7E", "postedAt": "2017-12-21T16:29:27.483Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>2) Are there advocacy-related reasons for donating directly to charities instead of joining such a lottery? For example, if I'm trying to increase my impact by convincing others to join EA, and someone asks where I donate, there seems to be a cost associated with describing a complicated lottery scheme that may end up with my money going to a cause that I think is ineffective or possibly even bad</p>\n</blockquote>\n<p>Yes, but on the other hand, the audacity of the scheme will surely get some attention, and those who are attracted by it will probably be intelligent, analytical types.</p>\n", "parentCommentId": "Bb3EoCZA4Hzyjdd2e", "user": {"username": "RyanCarey"}}, {"_id": "NYLKGYmemNAdm63Fn", "postedAt": "2017-12-21T20:19:30.305Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>I can't help but notice that one of the lottery entrants is listed as anonymous. According to <a href=\"https://app.effectivealtruism.org/lotteries\">the rules</a>, entrants may remain anonymous even if they win, so long as they express a strong objection to their name being public before the draw date. (No entrants to the 2016 donor lottery were anonymous.)</p>\n<p>I realize that which charitable cause the winner chooses to fund doesn't change the expected value of any entrant's contribution to the lottery. <a href=\"http://effective-altruism.com/ea/166/donor_lottery_details/cx4\">As Carl Shulman points out</a>, the lottery's pot size and draw probability, as well as entrants' expected payout, are all unaffected even if the eventual winner does nothing effective with their donation.</p>\n<p>Nevertheless, donor lotteries like this would seem to rely strongly on trust. Setting aside expected value calculations, there seems to be a strong cultural norm in my country against allowing lottery winners to remain anonymous. In the United States, only seven states allow this without an exemption being made—of course, that only applies to standard lotteries, not donor lotteries. But the point remains: there exists a common understanding in the US and Canada that lottery winners should not be allowed to remain anonymous without good reason.</p>\n<p>This is not the case in Europe, where it is far more common for lottery winners to remain anonymous.</p>\n<p>When the rules for anonymity were being drafted, was any thought given to this issue? Or was it just decided by default because the rules were drafted by people in a country for which this is just their cultural norm?</p>\n<p>(I'm not necessarily against allowing anonymous winners; it just initially feels weird to me because of the cultural norm of the society in which I was raised, and I'm interested in knowing how much thought went into this decision.)</p>\n", "parentCommentId": null, "user": {"username": "EricHerboso"}}, {"_id": "axCytwS6WCjfzNczG", "postedAt": "2017-12-21T22:06:12.381Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>there seems to be a strong cultural norm in my country against allowing lottery winners to remain anonymous...\nThis is not the case in Europe, where it is far more common for lottery winners to remain anonymous.\nWhen the rules for anonymity were being drafted, was any thought given to this issue?</p>\n</blockquote>\n<p>If a lottery organization is conducting a draw itself, and could rig the draw, publishing the winner's identity allows people to detect fraud, e.g. if the lottery commissioner's family members keep winning that would indicate skulduggery. I think this is the usual reason for requiring publicity. Did you have another in mind?</p>\n<p>In the case of CEA's lottery (and last year's lottery), the actual draw is the U.S. National Institute of Science and Technology public randomness beacon, outside of CEA's control, which allows every participant to know whether their #s were drawn.</p>\n<blockquote>\n<p>When the rules for anonymity were being drafted, was any thought given to this issue?</p>\n</blockquote>\n<p>Someone raised the possibility of people who didn't want publicity/celebrity being discouraged from making use of the option, as part of the general aim of making it usable to as many donors as possible.</p>\n", "parentCommentId": "NYLKGYmemNAdm63Fn", "user": {"username": "CarlShulman"}}, {"_id": "sP8KeXK4MGWuiyXo9", "postedAt": "2017-12-21T22:18:22.799Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>I can understand that a winner selecting a non-EA cause might end up having to convince CEA of their decision, </p>\n</blockquote>\n<p>See Sam's comment below:</p>\n<p>&quot;to emphasise this, as CEA is running this lottery for the benefit of the community, it's important for the community to have confidence that CEA will follow their recommendations (otherwise people might be reticent to participate). So, to be clear, while CEA makes the final call on the grant, unless there's a good reason not to (see the 'Caveats and Limitations' section on the EA.org Lotteries page) we'll do our best to follow a donor's recommendation, even if it's to a recipient that wouldn't normally be thought of as a strictly EA.&quot;</p>\n<blockquote>\n<p>Are there advocacy-related reasons for donating directly to charities instead of joining such a lottery?</p>\n</blockquote>\n<p>One data point: last year Jacob Steinhardt put a majority of <a href=\"https://jsteinhardt.wordpress.com/2016/12/28/donations-for-2016/\">his donations</a> into the lottery for expected direct impact, and then allocated the remainder himself for practice donating and signaling value.</p>\n", "parentCommentId": "Bb3EoCZA4Hzyjdd2e", "user": {"username": "CarlShulman"}}, {"_id": "KcCvNPktJoRLK8Rnt", "postedAt": "2017-12-21T22:23:33.797Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>An update on this: Cryptocurrency donations are now live on the site, so you can now enter the lottery (or make a regular donation to EA Funds) using BTC, ETH and LTC</p>\n", "parentCommentId": "p8fKqw3qKY4mHuLpS", "user": {"username": "SamDeere"}}, {"_id": "WM73mDa5H9ajr7LDb", "postedAt": "2017-12-22T02:37:51.683Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>I think the words 'write-up of their research and reasoning' in the OP imply something much more substantial. </p>\n</blockquote>\n<p>Yes, you're right. I was thinking of a more detailed and substantial post on why the winner selected their charity / charities. Although it wouldn't have to be onerous, I expect one or two paragraphs with accomanying links to research would be good enough. </p>\n<blockquote>\n<p>In either case, I agree that it'd be bad for this to feel like a cost that stopped people entering, so I'm endorsing your phrasing, and I'll edit my previous message to point this out.</p>\n</blockquote>\n<p>While I agree that deterring people from entering because of social pressure is not a good outcome, I'm not entirely sure I agree that the conclusion is that there's no expectation for the winner to share their reasoning. I place more value on the upsides of transparency than the potential downside of feeling social pressure, and I wonder if there isn't another way to alleviate the social pressure while still maintaining something like a &quot;low bar&quot; expectation for the winner to share their findings. </p>\n<p>For example, CEA could share the winner's reasoning anonymously.</p>\n", "parentCommentId": "YntJCvbLSd3BBWZqs", "user": null}, {"_id": "CpHBuRXBnpBeSiABK", "postedAt": "2017-12-22T04:58:47.521Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<p>What are the biggest upsides of transparency?</p>\n<p>The actual value of the information produced seems modest.</p>\n", "parentCommentId": "WM73mDa5H9ajr7LDb", "user": {"username": "Paul_Christiano"}}, {"_id": "ZakpSGYw5Rn295kwZ", "postedAt": "2017-12-24T10:06:26.370Z", "postId": "3q3mPbrqZEWARjrgE", "htmlBody": "<blockquote>\n<p>What are the biggest upsides of transparency?</p>\n</blockquote>\n<p>Two specific upsides that come to mind:</p>\n<ol>\n<li><p>If the winner chooses to use the opportunity to research a novel or speculative cause area, intervention or charity which they might not otherwise have thought worth their time. I could see a lot of learning value in this. </p>\n</li>\n<li><p>If the winner's incentive to enter the lottery is purely because it's a lottery and with a large enough contribution to the pool they like their odds at being able to influence more money towards their preferred charity. This would be contrary to the expected reason for entering i.e. to research impactful donation opportunities. I'm not sure if this is likely to happen, or if it even matters if some participants are incentivised to behave like this, but I'd be curious to learn if it happened. </p>\n</li>\n</ol>\n<p>A generic upside to transparency is just general learning value from research, which I agree might be modest. Although that also depends on variables like: how thorough the winner's research is, whether they rely on popular findings in EA or branch out, how informed the readers are, etc. </p>\n", "parentCommentId": "CpHBuRXBnpBeSiABK", "user": null}]