[{"_id": "r6Gdwxy8SjQWw7shP", "postedAt": "2024-02-16T06:36:24.480Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p>As a social scientist, these lists are very helpful, thank you team. It's useful to be able to point students and colleagues to open questions that are immediately decision-relevant.</p>\n", "parentCommentId": null, "user": {"username": "mnoetel"}}, {"_id": "TQAp6vcojpTwsjRoY", "postedAt": "2024-02-16T14:38:20.258Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p><strong>Executive summary</strong>: Open Philanthropy is interested in funding additional social science research to help guide their grantmaking decisions in areas like health, migration, and economic growth. They list specific questions where more evidence would be useful.</p><p><strong>Key points</strong>:</p><ol><li>There are key questions on the effects of different types of air pollution that could inform grants to improve air quality.</li><li>Better evidence is needed on the long-term impacts of malaria to estimate the value of preventing it.</li><li>Understanding factors affecting construction and housing supply could improve land use reform grants.</li><li>More evidence is needed on vaccine demand and adoption to guide vaccine development funding priorities.</li><li>Research on the effects of elite policy education in lower-income countries could inform grants in this area.</li><li>Studies on scientific funding criteria, systematic reviews, and prize competitions could improve science meta-funding.</li><li>Evidence on foreign aid decision-making and growth diagnostics could guide grantmaking on global development.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "3GrypMHFWgeoeDxfW", "postedAt": "2024-02-17T01:54:13.020Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p>This statement cracked me up for some reason: \"<strong>At this point, we are not actively making grants to further investigate these questions.</strong> It is possible we may do so in the future, though, so if you plan to research any of these, please <a href=\"mailto:academicresearch@openphilanthropy.org\"><u>email us</u></a>.\"</p><p>I.e., this isn't an RFP (request for proposals). Instead, it's more like a RFINP, BMITFWDEK? Request for Information Not Proposals, But Maybe In The Future (We Don't Even Know)?&nbsp;</p><p>OK, mostly joking -- in all seriousness, I haven't seen wealthy philanthropies release lists of ideas that are hopefully funded elsewhere, but maybe that actually makes sense! No philanthropy can fund everything in the world that might be interesting/useful. So maybe all philanthropies should release lists of \"things we're not funding but that we hope to see or learn from.\"&nbsp;</p>", "parentCommentId": null, "user": {"username": "Stuart Buck"}}, {"_id": "AEBwnkSZRCCCweNxJ", "postedAt": "2024-02-18T05:44:16.191Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p>On media influencing decision-making, you might want to give Giulia Buccione and Marcela Mello's <a href=\"https://marcelamello90.github.io/Paper/JMP.pdf\">working paper</a> \"Religious Media, Conversion and its Socio-Economic Consequences: The Rise of Pentecostals in Brazil\" a read.</p>", "parentCommentId": null, "user": {"username": "HStencil"}}, {"_id": "pczSsi3HL6FAs2Cev", "postedAt": "2024-03-01T13:33:08.046Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p>I'm curating this post. I appreciate OpenPhil taking the time to signal the research they would value!<br><br>If anyone has thoughts about a research question in this list, consider writing some preliminary notes for <a href=\"https://forum.effectivealtruism.org/posts/NyNa4YYAm7zQuLLva/announcing-draft-amnesty-week-march-11-17\">Draft Amnesty Week</a>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "Y4TFJuDg5GXNyzW8r", "postedAt": "2024-03-06T14:20:09.904Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p>On Health (point 8), this paper shows that patent pooling can be effective at improving access to drugs in LMICs:</p><p>https://www.sciencedirect.com/science/article/pii/S0167629622000868?via%3Dihub</p>", "parentCommentId": null, "user": {"username": "dwebb"}}, {"_id": "HueHGjFCQ6axTCxKQ", "postedAt": "2024-03-12T21:53:09.960Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p>On this topic, Desmond Ang's recent <i>AER</i> <a href=\"https://www.aeaweb.org/articles?id=10.1257/aer.20201867\">paper</a> “The Birth of a Nation: Media and Racial Hate” is also worth a look.</p>", "parentCommentId": "AEBwnkSZRCCCweNxJ", "user": {"username": "HStencil"}}, {"_id": "Eq89JEhYCqFanscvq", "postedAt": "2024-03-17T17:51:18.241Z", "postId": "3Y7c7MXf3BzgruTWv", "htmlBody": "<p>Nice list. I wish I had the econ expertise to do land use reform research, but since I don't, I'm happy to be a resource if anyone has law-related questions about it.</p>", "parentCommentId": null, "user": {"username": "Eli Barrish"}}]