[{"_id": "Hft6d74FfxGsAtgv4", "postedAt": "2023-06-06T19:52:45.702Z", "postId": "3yAtGF3bCHqkSN52h", "htmlBody": "<p>I always get confused about the difference between superposition and poly-semanticy. Would be great if the article clarified this.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "tnC94XccAAZtzTnXd", "postedAt": "2023-06-07T21:29:38.123Z", "postId": "3yAtGF3bCHqkSN52h", "htmlBody": "<p>It's always hard finding a balance between brevity + de-jargonification in the answers while also touching on every topic that people might be confused about. Mainly because we expect a large diversity of people with varying technical and non-technical backgrounds to interact with the answers. This means that we try and minimize the information per answer to the main essentials required for understanding the topic.</p><p>All that being said, I also don't really know if there is a major difference between polysemanticity and superposition. Additionally, I am also confused about if polysemantic and monosemantic neurons refer to the same underlying concept as&nbsp;<a href=\"https://deepai.org/machine-learning-glossary-and-terms/disentangled-representation-learning\">disentangled vs distributed representations</a>&nbsp;because all these concepts sound like they are describing the same thing. I took note of your&nbsp;<a href=\"https://discord.com/channels/677546901339504640/1089788940300595220\">comment in the thread about that particular answer</a>, and will get back to it when I learn more.</p><p>If you have any resources/posts/papers that point out that they are indeed different let me know and I'll write up a new answer. Something like - What is the difference between polysemantic neurons and superposition?, and, What is the difference between solving polysemanticity in neurons and disentangling latent space representations?</p><p>Alternatively, if you come by some awesome explanation and feel like writing it up, you could just edit the stampy docs on&nbsp;<a href=\"https://docs.google.com/document/d/1mdb-K6d4NZ0089nkPHfMWzHl8dqq_UtCa5pPIPg3eFA/edit#\">superposition</a>&nbsp;or&nbsp;<a href=\"https://docs.google.com/document/d/1Xn_fyjjbUZAb7hghg0H-HbpmRAom4Wp_M9ALb9-A9fs/edit#\">polysemanticity</a>&nbsp;yourself.</p>", "parentCommentId": "Hft6d74FfxGsAtgv4", "user": {"username": "markov"}}]