[{"_id": "ox77rdQBCpDqJkz5f", "postedAt": "2023-02-21T19:45:43.248Z", "postId": "3YKZEFYgTccGbpQvf", "htmlBody": "<p>I agree that to the extent that EA engages in policy evaluation or political/economic evaluation more generally, it should use a sentient-experience maximization framework, while discarding the labels of particular political theories, in the way that you described. And I think that so far every discussion I've seen of those matters in EA follows that framework, which is great.</p>\n<p>With regard to specific arguments about post-politics:</p>\n<p>I thought you made a strong case for post-politics in general, but arguing that a specific economic strategy is the best possible beyond all doubt is much more difficult to defend, and besides, does not seem very post-political. In general, a post-political person might argue for any economic strategy under the sun as optimal for sentient beings, though of course some arguments will be stronger than others.</p>\n<p>Also, regardless of the systems they believe to be optimal, post-political people should be sure to entertain the possibility that they, others, or a given group or polity are actually too post-political--not having the optimal amount or type of cultural orthodoxy/dogma and being unwilling to address that issue.</p>\n<p>This may come into play when an individual or group's conviction in rights and other deontological tools becomes too weak, or the deontological rules and norms they follow are worse than competing options.</p>\n<p>After all, an orthodoxy or political culture beyond post-politics is necessary for \"tie-breaking\" or producing decisions in situations where calculation is inconclusive. Some political culture beyond post-politics will inevitably sway people in such situations, and it is worth making sure that that political culture is a good one.</p>\n<p>An individual post-political thinker therefore may embrace advocacy of a certain political culture because they think it is so valuable and under-utilized that advocating for it is a more efficient use of their resources than advocating for post-politics.</p>\n<p>Generally I would say most people and institutions could stand to be more post-political, but I am not sure whether post-politics is currently a better advocacy target than  other cultural/political movements.</p>\n<p>If one was to advocate for such a movement, I'd guess the best way would be to create a political forum based on those principles and try to attract the people who like participating in political forums. Then the goal would be to make sure the discourse is focused on doing the most good for the most people, with rigorous evidence-based breakdowns for particular policies. This might be a decent use of time given that this post-political approach could improve thousands of people's decisions as they relate to systems change.</p>\n<p>If something like this was created, I would recommend adding a system for users to catalogue, quantify, and compare their political positions, including their degree of confidence in each position. The capability to quickly and easily compare political positions between individuals seems like a very fast way to advance the accuracy of individuals' beliefs, especially in a community dedicated to strong beliefs lightly held and finding the policies that do the most good.</p>\n", "parentCommentId": null, "user": {"username": "Sam Battis"}}, {"_id": "mr93tkSBKAvsMyiaB", "postedAt": "2023-02-21T20:13:44.605Z", "postId": "3YKZEFYgTccGbpQvf", "htmlBody": "<p>First of all thank you for your comment. What I describe here is not about Effective Altruism, but about utilitarianism. And it is more about how to rule a country that about how to allocate charitable funds.</p>\n<p>In my view this is the only possible political framework for an utilitarian,  but disagreements on interpersonal utility comparisons, and in “Science” can lead to substantial differences on optimal policies that can escalate into differences on the optimal decision making procedures.</p>\n<p>This is quite theoretical, but in my view this is the way to think about the “general interest” and the Government.</p>\n", "parentCommentId": "ox77rdQBCpDqJkz5f", "user": {"username": "Arturo Macias"}}, {"_id": "ZfNQspdkuhHsv33TB", "postedAt": "2023-02-21T20:24:42.371Z", "postId": "3YKZEFYgTccGbpQvf", "htmlBody": "<p>Well, of course, “my opinion” is not really mine. This is textbook political economy , I hope well summarized…</p>\n", "parentCommentId": "mr93tkSBKAvsMyiaB", "user": {"username": "Arturo Macias"}}, {"_id": "2FC38FPGRzKWRHoQx", "postedAt": "2023-02-21T21:31:58.223Z", "postId": "3YKZEFYgTccGbpQvf", "htmlBody": "<p>Right, I was just looking for some ways to apply it to EA. I figured you were recommending that post-political-ness become a more explicit part of EA or more frequently used by EAs in their public or private evaluation of policy.</p>\n<p>I agree this sort of loose framework of sentence maxing should be used by EAs when evaluating policy interventions, and it seems to be used, so I agree it should continue. And then on top of that, if someone EA-aligned wanted a potentially high-impact way to spend time advocating for post-political views, I would recommend the forum project.</p>\n<p>When you say this is the only possible political framework for a utilitarian--if you're referring to sentience maxing with whatever tools available, I agree. If you're saying utilitarians should ignore the tools of political culture entirely and their instrumental uses, including supporting the rights and other deontological rules that utilitarians sometimes find justified, then I would disagree for the reasons stated.</p>\n<p>For example, assuming democracy is the most effective government form, I would want some amount of pro-democracy emotional content in K-12 schools and a broader social penalty for advancing anti-democratic ideas like reducing voter eligibility/access, in order to safeguard it against short-term cultural shifts and meddling. I think hard-coding things that we are pretty sure are good or bad into culture is wise, so that we avoid having to rehash the same issues generation to generation. In this case \"dogma\" is basically just \"accepting a moral conviction that has been baked into your culture through historical experience,\" which is often quite useful.</p>\n<p>If you're saying that the economic system you outlined (which if I understand correctly is limited to a private market and wealth transfers, implying no public goods) is the only defensible one, then that's also a separate debate we could have. I'm not sure if this is what you're referring to when you say this is the only possible political framework.</p>\n", "parentCommentId": "mr93tkSBKAvsMyiaB", "user": {"username": "Sam Battis"}}, {"_id": "aRB6yGaaL3mKJXD27", "postedAt": "2023-02-21T21:54:47.460Z", "postId": "3YKZEFYgTccGbpQvf", "htmlBody": "<p>Oh, of course en the real world, political action is unfortunately based on expectations manipulation, mood affiliation, and any utilitarian shall understand the logic of activism.</p>\n<p>But it is important to have an idea of what we want,  and in the difference between value and fact, and between policy and institutional mechanism.</p>\n<p>This kind of idealization is in my view for utilitarians what “class struggle” is for marxists, or “property” is for libertarians.</p>\n<p>Unlike them, our ideal construction is truly fundamental.</p>\n<p>An interesting side effect is that “deontology” can be utilitarian: often objective rules are the best device to obtain maximum welfare.</p>\n<p>In fact, good rules are the main product a good utilitarian framework!</p>\n", "parentCommentId": "2FC38FPGRzKWRHoQx", "user": {"username": "Arturo Macias"}}, {"_id": "JgZSxBkB4XxRENqyq", "postedAt": "2023-02-21T21:59:36.072Z", "postId": "3YKZEFYgTccGbpQvf", "htmlBody": "<p>Agreed on all counts.</p>\n", "parentCommentId": "aRB6yGaaL3mKJXD27", "user": {"username": "Sam Battis"}}]