[{"_id": "TffrZ9BQznSDmEfqj", "postedAt": "2022-12-27T01:44:12.604Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<blockquote>\n<p>...their regulations will probably not, except by coincidence, be the type of regulations we should try to install.</p>\n</blockquote>\n<p>A priori, I'd expect a randomly formulated AI regulation to be about 50% likely to be an improvement on the status quo, since the <a href=\"https://en.wikipedia.org/wiki/Status_quo_bias\">status quo</a> wasn't selected for being good for alignment.</p>\n<blockquote>\n<p>Adopting the wrong AI regulations could lock us into a suboptimal regime that may be difficult or impossible to leave.</p>\n</blockquote>\n<p>I don't see good arguments supporting this point.  I tend to think the opposite -- building a coalition to pass a regulation now makes it <em>easier</em> to pass other regulations later.</p>\n<blockquote>\n<p>arbitrary data restrictions risk preventing researchers from having access to good data that might help with alignment</p>\n</blockquote>\n<p>OpenAI <a href=\"https://twitter.com/gdb/status/1599124287633248257\">claims</a> that ChatGPT is an \"alignment advance\".  I think this is way off -- the approach they're using just isn't good enough in principle.  Incrementally improving on ChatGPT's \"alignment\" the way OpenAI is doing leads to disaster, IMO.  You don't write the code for a nuclear reactor through trial and error.</p>\n<p>If an alignment scheme doesn't work with arbitrary data restrictions, it's probably not good enough in principle.  Even all the data on the internet is \"arbitrarily restricted\" relative to all the data that exists or could exist.  If my alignment scheme fails with public domain data only, why shouldn't it <em>also</em> fail with all the data on the internet?  (And if an alignment scheme <em>works</em> on public domain data only, it should be possible to add in more data to boost performance before using the AI for something mission-critical.)</p>\n<p>I think a better argument for your conclusion is that incentivizing researchers to move away from big data approaches might make AI research more accessible and harder to control.  Legal restrictions also favor open source, which has the same effect.  We don't want cutting-edge AI to become something that exists on the margins, like using bittorrent for piracy.</p>\n<p>I suspect the right compromise is for AI art companies to pay a license fee to any artist in their training data who signs up to be paid.  We want to reduce company profits and decrease AI progress incentives without pushing things towards open source a bunch.  I'd take the same approach for language models like GPT.  I think our interests are actually fairly well-aligned with artists here, in the sense that the approach which allocates profits away from AI companies and towards artists is probably also the best approach for humanity's long-run future.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "XaAPsLJiWQsAbEsCQ", "postedAt": "2022-12-27T03:22:50.826Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<blockquote><p>A priori, I'd expect a randomly formulated AI regulation to be about 50% likely to be an improvement on the status quo, since the <a href=\"https://en.wikipedia.org/wiki/Status_quo_bias\">status quo</a> wasn't selected for being good for alignment.</p></blockquote><p>I don't agree.</p><p>It's true that the status quo wasn't selected for being good for alignment directly, but it was still selected for things that are arguably highly related to alignment. Our laws are the end result of literally thousands of years of experimentation, tweaking, and innovation in the face of risks. In that time, numerous technologies and threats have arisen, prompting us to change our laws and norms to adapt.</p><p>To believe that a literal <i>random </i>change to the status quo has a 50% chance of being beneficial, you'd likely have to believe that AI is so radically outside the ordinary reference class of risks that it is truly nothing whatsoever like we have ever witnessed or come across before. And while I can see a case for AI being highly unusual, I don't think I'd be willing to go that far.</p><blockquote><p>I don't see good arguments supporting this point. I tend to think the opposite -- building a coalition to pass a regulation now makes it <i>easier</i> to pass other regulations later.</p></blockquote><p>Building a coalition now makes it easier to pass other <i>similar </i>regulations later, but it doesn't necessarily make it easier to switch to an entirely different regulatory regime.&nbsp;</p><p>Laws and their associated bureaucracies tend to entrench themselves. Suppose that as a result of neo-luddite sentiment, the people hired to oversee AI risks in the government concern themselves only with risks to employment, ignoring what we'd consider to be more pressing concerns. I think it would be quite a lot harder to fire all of them and replace them with people who care relatively more about extinction, than to simply hire right-minded people in the first place.</p><blockquote><p>If an alignment scheme doesn't work with arbitrary data restrictions, it's probably not good enough in principle. Even all the data on the internet is \"arbitrarily restricted\" relative to all the data that exists or could exist. If my alignment scheme fails with public domain data only, why shouldn't it <i>also</i> fail with all the data on the internet?</p></blockquote><p>I think it might be worth quoting Katja Grace <a href=\"https://www.lesswrong.com/posts/uFNgRumrDTpBfQGrs/let-s-think-about-slowing-down-ai\">from a few days ago</a>,</p><blockquote><p>My weak guess is that there’s a kind of bias at play in AI risk thinking in general, where any force that isn’t zero is taken to be arbitrarily intense. Like, if there is pressure for agents to exist, there will arbitrarily quickly be arbitrarily agentic things. If there is a feedback loop, it will be arbitrarily strong. Here, if stalling AI can’t be forever, then it’s essentially zero time. If a regulation won’t obstruct every dangerous project, then is worthless. Any finite economic disincentive for dangerous AI is nothing in the face of the omnipotent economic incentives for AI. I think this is a bad mental habit: things in the real world often come down to actual finite quantities.</p></blockquote><p>Likewise, I think actual quantities of data here might matter a lot. I'm not confident at all that arbitrarily restricting 98% of the supply of data won't make the difference between successful and unsuccessful alignment, relative to allowing the full supply of data. I do <i>lean</i> towards thinking it won't make that difference, but my confidence is low, and I think it might very easily come down to the specific details of what's being allowed and what's being restricted.</p><p>On the other hand, I'm quite convinced that, <i>abstractly, </i>it is highly implausible that arbitrarily limiting what data researchers have access to will be <i>positive</i> for alignment<i>. </i>This consideration leaves me on the side of caution, and inclines me to say we should probably not put in place such arbitrary restrictions.</p><blockquote><p>I think a better argument for your conclusion is that incentivizing researchers to move away from big data approaches might make AI research more accessible and harder to control. Legal restrictions also favor open source, which has the same effect. We don't want cutting-edge AI to become something that exists on the margins, like using bittorrent for piracy.</p></blockquote><p>I think that's also true. It's a good point that I didn't think to put into the post.</p>", "parentCommentId": "TffrZ9BQznSDmEfqj", "user": {"username": "Matthew_Barnett"}}, {"_id": "kQbXbacAazAcaBJX2", "postedAt": "2022-12-27T04:25:47.225Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<blockquote>\n<p>Our laws are the end result of literally thousands of years of of experimentation</p>\n</blockquote>\n<p>The distribution of legal cases involving technology over the past 1000 years is very different than the distribution of legal cases involving technology over the past 10 years.  \"Law isn't keeping up with tech\" is a common observation nowadays.</p>\n<blockquote>\n<p>a literal random change to the status quo</p>\n</blockquote>\n<p>How about we revise to \"random viable legislation\" or something like that.  Any legislation pushed by artists will be in the same reference class as the \"thousands of years of of experimentation\" you mention (except more recent, and thus better adapted to current reality).</p>\n<blockquote>\n<p>AI is so radically outside the ordinary reference class of risks that it is truly nothing whatsoever like we have ever witnessed or come across before</p>\n</blockquote>\n<p>Either AI will be transformative, in which case this is more or less true, or it won't be transformative, in which case the regulations matter a lot less.</p>\n<blockquote>\n<p>Suppose that as a result of neo-luddite sentiment, the people hired to oversee AI risks in the government concern themselves only with risks to employment, ignoring what we'd consider to be more pressing concerns.</p>\n</blockquote>\n<p>If we're involved in current efforts, maybe some of the people hired to oversee AI risks will be EAs.  Or maybe we can convert some \"neo-luddites\" to our point of view.</p>\n<blockquote>\n<p>simply hire right-minded people in the first place</p>\n</blockquote>\n<p>Sounds to me like you're letting the perfect be the enemy of the good.   We don't have perfect control over what legislation gets passed, including this particular legislation.  Odds are decent that the artist lobby succeeds even with our opposition, or that current legislative momentum is better aligned with humanity's future than any legislative momentum which occurs later.  We have to think about the impact of our efforts on the margin, as opposed to thinking of a \"President Matthew Barnett\" scenario.</p>\n<blockquote>\n<p>On the other hand, I'm quite convinced that, abstractly, it is highly implausible that arbitrarily limiting what data researchers have access to will be positive for alignment.</p>\n</blockquote>\n<p>It could push researchers towards more robust schemes which work with less data.</p>\n<p>I want a world where the only way for a company like OpenAI to make ChatGPT commercially useful is to pioneer alignment techniques that will actually work in principle.  Throwing data &amp; compute at ChatGPT until it seems aligned, the way OpenAI is doing, seems like a path to ruin.</p>\n<p>As an intuition pump, it seems possible to me that a solution for adversarial examples would make GPT work well even when trained on less data.  So by making it easy to train GPT on lots of data, we may be letting OpenAI neglect adversarial examples.  We want an \"alignment overhang\" where our alignment techniques are so good that they work even with a small dataset, and become even better when used with a large dataset.  (I guess this argument doesn't work in the specific case of safety problems which only appear with a large dataset, but I'm not sure if there's anything like that.)</p>\n<p>Another note: I've had the experience of sharing alignment ideas with OpenAI staff.  They responded by saying \"what we're doing seems good enough\" / not trying my idea (to my knowledge).  Now they're running into problems which I believe the ideas I shared might've solved.  I wish they'd focus more on finding a solid approach, and less on throwing data at techniques I view as subpar.</p>\n", "parentCommentId": "XaAPsLJiWQsAbEsCQ", "user": {"username": "John_Maxwell_IV"}}, {"_id": "dX2QTD3e8ZmqTaAnP", "postedAt": "2022-12-27T17:50:45.108Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>You wrote</p>\n<blockquote>\n<p>Earlier this month, digital artists staged a mass protest against AI art on ArtStation. A few people are reportedly already getting together to hire a lobbyist to advocate more restrictive IP laws around AI generated content. And anecdotally, I've seen numerous large threads on Twitter in which people criticize the users and creators of AI art.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>Personally, this sentiment disappoints me. While I sympathize with the artists who will lose their income, I'm not persuaded by the general argument. The value we could get from nearly free, personalized entertainment would be truly massive. In my opinion, it would be a shame if humanity never allowed that value to be unlocked, or restricted its proliferation severely.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>it is not worth sacrificing a technologically richer world just to protect workers from losing their income.</p>\n</blockquote>\n<p>Are you arguing from principle here?</p>\n<p>Artists' (the workers')  work is being imitated by the AI tools, so cost-effectively that an artist's contributions, once public, render the artists' continuing work unnecessary to produce work with their style.</p>\n<p>Is the addition of technology T with capability C that removes need for worker W with job role R and capability C more important than loss of income I to worker W, for all T, C, W, R, and I?</p>\n<p>Examples of capabilities could be:</p>\n<ul>\n<li>summarizing existing research work (for example, an AI Safety paper)</li>\n<li>collecting typical data used to make predictions (for example, cost and power of compute)</li>\n<li>monitoring new research work (for example, recent publications and their relationships, such as supporting, building on or contradicting)</li>\n<li>hypothesizing about preconditions for new developments (for example, conditions suitable for AGI development)</li>\n<li>developing new theories or models (for example, of AI Safety)</li>\n<li>testing new theories or models (for example,  of AI Safety)</li>\n</ul>\n<p>Loss of income could be:</p>\n<ul>\n<li>partial (for example, a reduction in grant money for AI Safety workers as those funds are diverted to automation projects with 10-20 year timelines)</li>\n<li>complete (for example, replacement of 50 AI Safety workers with 10 workers that rely on semi-automated research tools)</li>\n</ul>\n<p>The money allocated to workers could be spent on technology instead.</p>\n<p>Investments in specific technologies T1, T2 with capabilities C1, C2 can start with crowd-sourcing from workers W1, W2,..., Wk, and more formal automation and annotation projects targeting knowledge K developed by workers Wk+1, ..., Wn (for example, AI Safety researchers) who do not participate in the crowd-sourcing and automation effort but whose work is accessible.</p>\n<p>You repeatedly referred to \"we\" as in:</p>\n<blockquote>\n<p>True, if very powerful AI is coming very soon (&lt;5 years from now), there might not be much else we can do except for aligning with vaguely friendly groups, and helping them pass poorly designed regulations.</p>\n</blockquote>\n<p>However, a consequence of automation technology is that it removes the political power (both money and responsibility) that accrued to the workers that it replaces. For example, any worker in the field of AI Safety, to the extent that her job depends on her productivity and cost-effectiveness, will lose both her income and status as the field progresses to include automation technology that can replace her capabilities. Even ad hoc automation methods (for example, writing software that monitors cost and power of compute using web-scraping and publicly available data) remove a bit of that status. In that way, the  AI Safety researcher loses status among her peers and her influence on policy that her peers direct. The only power left to the researcher is as an ordinary voter in a democracy.</p>\n<p>Dividing up and replacing the responsibilities for the capabilities Ci of an individual W1 can help an ad hoc approach involving technologies Ti corresponding to the capabilities of that worker. Reducing the association of the role with the status can dissolve the role and sometimes the worker's job who held that role. The role itself can disappear from the marketplace, along with the interests that it represents. For example, although artists have invested many years in their own talents, skills, and style, within a year they lost their status and income to some new AI software. I think artists have cause to defend their work from AI. The <em>artist</em> role won't disappear from the world of human employment entirely but the future of the role has been drastically reduced and has permanently lost a lot of what gave it social significance and financial attractiveness, unless the neo-luddites can defend paid employment in art from AI.</p>\n<p>Something similar can happen to AI Safety researchers, but will anyone object? <em>AI Safety researcher</em> worker capabilities and roles could be divided and dissolved into larger job roles held by fewer people with different titles, responsibilities, and allegiances over time as the output of the field is turned into a small, targeted knowledge-base and suite of tools for various purposes.</p>\n<p>If you are in fact arguing from principle, then you have an opportunity to streamline the process of AI safety research work through efforts such as:</p>\n<ul>\n<li>collecting AI Safety research work on an ongoing basis as it appears in different venues and making it publicly accessible</li>\n<li>annotating the research work to speed up queries for common questions such as:\n<ul>\n<li>what are controversies in the field, that is, who disagrees with whom about what and why?</li>\n<li>what is the timeline of development of research work?</li>\n<li>what literature address specific research questions (for example, on compute developments, alternative technologies, alignment approaches, specific hypotheses in the field, prediction timelines)?</li>\n<li>what are summaries of current work?</li>\n</ul>\n</li>\n<li>paying for public hosting of AI Safety information of this type as well as ad hoc tools (for example, the compute power tracker)</li>\n</ul>\n<p>I'm sure you could come up with better ideas to remove AI Safety worker grant money from those workers, and commensurately benefit the cost-effectiveness of AI Safety research. I've read repeatedly that the field needs workers and timely answers, automation seems like a requirement or alternative to reduce the financial and time constraints on the field but also to serve its purpose effectively.</p>\n<p>While artists could complain that AI art does a disservice to their craft and reduces the quality of art produced, I think the tools imitating those artists have developed to the point that they serve the purpose and artists know it and so does the marketplace. If AI Safety researchers are in a position to hold their jobs a little while longer, then they can assist the automation effort to end the role of AI Safety researchers and move on to other work that much sooner! I see no reason to hold you back from applying the principle that you seem to hold, though I don't hold it myself.</p>\n<p>AI Safety research is a field that will hopefully succeed quickly and end the need for itself within a few decades. It's workers can move on, presumably to newer and better things. New researchers in the field can participate in automation efforts and then find work in related fields, either in software automation elsewhere or other areas such as service work for which consumers still prefer a human being. Supposedly the rapid deployment of AGI in business will grow our economies relentlessly and at a huge pace, so there should be employment opportunities available (or free money from somewhere).</p>\n<p>If any workers have a reason to avoid neo-ludditism, it would have to be AI Safety researchers, given their belief in a future of wealth, opportunity, and leisure that AI help produce. Their own unemployment would be just a blip of however long before the future they helped manifest rescues them. Or they can always find other work, right? After all they work on the very technology depriving others of work. A perfectly self-interested perspective from which to decide whether neo-ludditism is a good idea for themselves.</p>\n<p>EDIT: sorry, I spent an hour editing this to convey my own sense of optimism and include a level of detail suitable for communicating the subtle nuances I felt deserved inclusion in a custom-crafted post of this sort. I suppose chatGPT could have done better? Or perhaps a text processing tool and some text templates would have sped this up. Hopefully you find these comments edifying in some way.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "8wWneHkGhNzSxg7q7", "postedAt": "2022-12-28T19:57:15.229Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>I agree, and I do not think that slowing down AI or speeding it up is desirable, for reasons related to Rohin Shah's comment on LW about why slowing down AI progress is not desirable:</p>\n<blockquote>\n<ol>\n<li>It makes it easier for a future misaligned AI to take over by increasing overhangs, both via compute progress and algorithmic efficiency progress. (This is basically the same sort of argument as \"Every 18 months, the minimum IQ necessary to destroy the world drops by one point.\")</li>\n</ol>\n</blockquote>\n<blockquote>\n<ol start=\"2\">\n<li>Such strategies are likely to disproportionately penalize safety-conscious actors.</li>\n</ol>\n</blockquote>\n<blockquote>\n<p>(As a concrete example of (2), if you build public support, maybe the public calls for compute restrictions on AGI companies and this ends up binding the companies with AGI safety teams but not the various AI companies that are skeptical of “AGI” and “AI x-risk” and say they are just building powerful AI tools without calling it AGI.)</p>\n</blockquote>\n<blockquote>\n<p>For me personally there's a third reason, which is that (to first approximation) I have a limited amount of resources and it seems better to spend that on the \"use good alignment techniques\" plan rather than the \"try to not build AGI\" plan. But that's specific to me.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "KK9B96mCHJCpbReeB", "postedAt": "2022-12-28T19:58:40.226Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<blockquote>\n<p>AI Safety research is a field that will hopefully succeed quickly and end the need for itself within a few decades. It's workers can move on, presumably to newer and better things. New researchers in the field can participate in automation efforts and then find work in related fields, either in software automation elsewhere or other areas such as service work for which consumers still prefer a human being. Supposedly the rapid deployment of AGI in business will grow our economies relentlessly and at a huge pace, so there should be employment opportunities available (or free money from somewhere).</p>\n</blockquote>\n<p>This is the most important paragraph in a comment where I strongly agree. Thanks for saying it.</p>\n", "parentCommentId": "dX2QTD3e8ZmqTaAnP", "user": {"username": "Sharmake"}}, {"_id": "SCuwboatQtGPWBNnp", "postedAt": "2022-12-29T00:41:51.351Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>You seem to genuinely want to improve AGI Safety researcher productivity.</p>\n<p>I'm not familiar with resources available on AGI Safety, but it seems appropriate to:</p>\n<ul>\n<li>develop a public knowledge-base</li>\n<li>fund curators and oracles of the knowledge-base (library scientists)</li>\n<li>provide automated tools to improve oracle functions (of querying, summarizing, and relating information)</li>\n<li>develop ad hoc research tools to replace some research work (for example, to predict hardware requirements for AGI development).</li>\n<li><strong>NOTE:</strong> the knowledge-base design is intended to speed up the research cycle, skipping the need for the existing hodge-podge of tools in place now</li>\n</ul>\n<p>The purpose of the knowledge-base should be:</p>\n<ul>\n<li><strong>goal-oriented</strong> (for example, produce a safe AGI soon)</li>\n<li><strong>with a calendar deadline</strong>  (for example, by 2050)</li>\n<li><strong>meeting specific benchmarks and milestones</strong> (for example, an \"aligned\" AI writing an accurate research piece at decreasing levels of human assistance)</li>\n<li><strong>well-defined</strong> (for example, achievement of AI human-level skills in multiple intellectual domains with benevolence demonstrated and embodiment potential present)</li>\n</ul>\n<p>Lets consider a few ways that knowledge-bases can be put together:</p>\n<ul>\n<li>\n<p><strong>1. the forum or wiki:</strong> what lesswrong and the EA forum does. There's haphazard:</p>\n<ul>\n<li>tagging</li>\n<li>glossary-like list</li>\n<li>annotations</li>\n<li>content feedback</li>\n<li>minimal enforced documentation standards</li>\n<li>no enforced research standards</li>\n<li>minimal enforced relevance standards</li>\n<li>poor-performing search.</li>\n<li><strong>WARNING:</strong> Forum posts don't work as knowledge-base entries. On this forum, you'll only find some information by the author's name if you know that the author wrote it and you're willing to search through 100's of entries by that author. I suspect, from my own time searching with different options,  that most of what's available on this forum is not read, cited, or easily accessible. The karma system does not reflect documentation, research, or relevance standards. The combination of the existing search and karma system is less effective in a research knowledge-base.</li>\n</ul>\n</li>\n<li>\n<p><strong>2. the library:</strong> library scientists are trained to:</p>\n<ul>\n<li>build a knowledge-base.</li>\n<li>curate knowledge.</li>\n<li>follow content development to seek out new material.</li>\n<li>acquire new material.</li>\n<li>integrate it into the knowledgebase (indexing, linking).</li>\n<li>follow trends in automation.</li>\n<li>assist in document searches.</li>\n<li>perform as oracles, answering specific questions as needed.</li>\n<li><strong>TIP:</strong> Library scientists could help any serious effort to build an AGI Safety knowledge-base and automate use of its services.</li>\n</ul>\n</li>\n<li>\n<p><strong>3.  with automation:</strong> You could take this forum and add automation (either software or paid mechanical turks) to:</p>\n<ul>\n<li>write summaries.</li>\n<li>tag posts.</li>\n<li>enforce documentation standards.</li>\n<li>annotate text (for example, annotating any prediction statistics offered in any post or comment).</li>\n<li>capture and archive linked multimedia material.</li>\n<li>link wiki terms to their use in documents.</li>\n<li>verify wiki glossary meanings against meanings used in posts or comments.</li>\n<li>create new wiki entries as needed for new terms or usages.</li>\n<li><strong>NOTE:</strong> the discussion forum format creates more redundant information rather than better citations, as well as divergence of material from any specific purpose or topic that is intended for the forum. A forum is not an ideal knowledgebase, and the karma voting format reflects trends, but the forum is a community meeting point with plenty of knowledge-base features for users to work on, as their time and interest permits. It hosts interesting discussions. Occasionally, actual research shows up on it.</li>\n</ul>\n</li>\n<li>\n<p><strong>4. with extreme automation:</strong> A tool like chatGPT is unreliable or prone to errors (for example, in programming software), but when guided and treated as imperfect, it can perform in an automated workflow.  For example, it can:</p>\n<ul>\n<li>provide text summaries.</li>\n<li>be part of automation chains that:\n<ul>\n<li>provide transcripts of audio.</li>\n<li>provide audio of text.</li>\n<li>provide diagrams of relationships.</li>\n<li>graphs data.</li>\n<li>draw scenario pictures or comics.</li>\n</ul>\n</li>\n<li>act as a writing assistant or editor.\n<strong>TIP:</strong> Automation is not a tool that people should only employ by choice. For example, someone who chooses to use an accounting ledger and a calculator rather than Excel is slowing down an accounting team's performance.<br>\n<strong>CAUTION:</strong> Once AI enter the world of high-level concept processing, their errors have large consequences for research. Their role should be to assist human tasks, as cognitive aids, not as human replacements, at least until they are treated as having equivalent potential as humans, and are therefore subject to the same performance requirements and measurements as humans.</li>\n</ul>\n</li>\n</ul>\n<h3>Higher level analysis</h3>\n<p>The ideas behind improving cost-effectiveness of production include:</p>\n<ul>\n<li><strong>standardizing:</strong> take a bunch of different work methods, find the common elements, and describe the common elements as unified procedures or processes.</li>\n<li><strong>streamlining:</strong> examining existing work procedures and processes, identifying redundant or non-value-added work, and removing it  from the workflow by various means.</li>\n<li><strong>automating:</strong> using less skilled human or faster/more reliable machine labor to replace steps of expert or artisan work.</li>\n</ul>\n<p>Standardizing research is hard, but AGI Safety research seems disorganized, redundant, and slow right now. At the highest chunk level, you can partition AGI Safety development into education and research, and partition research into models and experiments.</p>\n<ol>\n<li>education</li>\n<li>research models</li>\n<li>research experiments</li>\n</ol>\n<p>The goal of the knowledge-base project is to streamline education and research of models in the AGI Safety area. Bumming around on lesswrong or finding someone's posted list of resources is a poor second to a dedicated online curated library that offers research services. The goal of additional ad hoc tools should be to automate what researchers now do as part of their model development. A further goal would be to automate experiments toward developing safer AI, but that is going outside the scope of my suggestions.</p>\n<h2>Caveats</h2>\n<p>In plain language, here's my thoughts on pursuing a project like I have proposed. Researchers in any field worry about grant funding, research trends, and professional reputation. Doing anything quickly is going to cross purposes with others involved, or ostensibly involved, in reaching the same goal. The more well-defined the goal, the more people will jump ship, want to renegotiate, or panic. Once benchmarks and milestones are added, financial commitments get negotiated and the threat of funding bottlenecks ripple across the project.   As time goes on, the funding bottlenecks manifest, or internal mismanagement blows up the project. This is a software project, so the threat of failure is real. It is also a research project without a guaranteed outcome of either AGI Safety or AGI, adding to the failure potential. Finally, the field of AGI Safety is still fairly small and not connected to income potential long-term, meaning that researchers might abandon an effective knowledge-base project for lack of interest, perhaps claiming that the problem \"solved itself\" once AGI become mainstream, even if <em>no</em> AGI Safety goals were actually accomplished.</p>\n", "parentCommentId": "KK9B96mCHJCpbReeB", "user": {"username": "Noah Scales"}}, {"_id": "xcPbHPKXmhGFYjG5q", "postedAt": "2022-12-29T13:55:05.333Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<blockquote><p>While I sympathize with the artists who will lose their income, I'm not persuaded by the general argument. The value we could get from nearly free, personalized entertainment would be truly massive. In my opinion, it would be a shame if humanity never allowed that value to be unlocked, or restricted its proliferation severely.</p></blockquote><p>This seems like an area in which utilitarianism should be bounded by deontology.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefl6jfforekp\"><sup><a href=\"#fnl6jfforekp\">[1]</a></sup></span>&nbsp;The reasoning here seems to be roughly \"the value of this scenario is so high that I am okay with the harm it causes.\"</p><p>There are options other than <i>artists loose their income by having their work pirated/stolen, copied, and altered</i>, and <i>humanity never unlocks that value</i>. For example, by paying artists for their work.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnl6jfforekp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefl6jfforekp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Vaguely parallel to how democracy should be bounded by liberalism: 9 people of group A voting to remove the rights of 1 group B person is democratic, which is the simplistic example of how the liberalism of protecting rights is important.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "oqudSM5wxN7jT7out", "postedAt": "2022-12-29T19:20:33.785Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>Strong upvoted because this is indeed an approach I'm investigating in my work and personal capacity.<br><br>For other software fields/subfields, upskilling can be done fairly rapidly, by grinding knowledge bases with high feedback loops. It is possible to be as good as a professional software engineer quickly, independently and in a short timeframe.<br><br>If AI Safety wants to develop its talent pool to keep up with the AI Capabilities talent pool (which is probably growing much faster than average), researchers-especially juniors- need an easy way to learn quickly and conveniently. I think existing researchers may underrate this, since they're busy putting out their own fires and finding their own resources.<br><br>Ironically, it has not been quick and convenient for me to develop this idea to a level where I'd work on it, so thanks for this.</p>", "parentCommentId": "SCuwboatQtGPWBNnp", "user": {"username": "Minh Nguyen"}}, {"_id": "MWGpG2Qm7EFru8qwB", "postedAt": "2022-12-29T19:48:51.257Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>I upvoted this because AI-related advocacy has become a recent focus of mine. My background is from organising climate protests, and I think EAs have a bit of a blindspot when it comes to valuing advocacy. So it's good to have this discussion. However, I do disagree on a few points.<br><br>1. <u>Just Ask:</u> In broad strokes, I think people tend to overestimate exactly how unreasonable and persistent initial objections will be. My simplest rebuttal would be: <u>How do you know these advocates would even disagree with your approach?</u> An approach I'm considering now is to find a decent AI Governance policy proposal, present it to the advocates explaining how it solves their problem and see who says yes. If half of them say no, you work with the other half. Before assuming the \"neo-Luddites\" won't listen to reason, shouldn't you ... ask? Present them with options? I don't see why it's not at least worth reaching out to potential allies, and I don't see why it's an irredeemable sin to be angry at something with no clear solutions, when no one has presented a solution. It's perhaps ironic the assumptions given here.<br><br><u>2. Counterfactuals</u> I think by most estimates, anti-AI advocacy only grows from here. Having a lot of structurally unemployed angry people is historically a recipe for trouble. You then have to consider that reactionary responses will happen regardless of whether <i>\"we align with them\". </i>If they are as persistently unreasonable as you say they are, they will force bad policy regardless. They will influence mainstream discourse towards their views, and be loud enough to crowd out our <i>\"more reasonable\"</i> views. I just think it makes a lot of sense to engage these groups early on, and make an earnest effort to make our case. Because the counterfactual is that they get bad policies passed without our input.<br><br><u>3. False dichotomy of advocates and researchers</u> I speak more generally here. In my time in climate risk, everyone had an odd fixation on separating climate advocates and researchers.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefhehgcir525g\"><sup><a href=\"#fnhehgcir525g\">[1]</a></sup></span>&nbsp;I don't think this split was helpful for epistemics or strategy overall. Because then you had scientists who had all the solutions and epistemics that the public/policymakers generally ignored out of lack of engagement, and the advocates who started latching onto poorly-informed and counterproductive radical agendas, and were constantly rebutted with <i>\"why are we listening to you clueless youngsters and not the scientists (who we ignore anyway)\".</i> It was just a constant headache to have two subgroups needlessly divide themselves while the clock ran down. Like sure, the advocates were ... not the most epistemically rigorous. And the scientists generally struggled to put across their concerns. But I'd greatly prefer if everyone valued more communication/coordination, and not less.<br><br>And for my sanity's sake, I'd like the AI risk community to not repeat this dynamic.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnhehgcir525g\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefhehgcir525g\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I suspect most of this dichotomy was not made in good faith, but simply by people uncomfortable with the premise of anthropogenic climate change and throwing out fallacies to discredit any arguments they're confronted with in their daily lives.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "ohdoM4vNjgwCEmugY", "postedAt": "2022-12-29T21:44:25.469Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<blockquote><p>This seems like an area in which utilitarianism should be bounded by deontology.</p></blockquote><p>I'm confused because I think precisely the opposite is true.</p><p>If I were applying a deontological framework to automation, I'd perhaps first point out that there's an act/omission asymmetry in using technology. By using AI art generators, you're not actually harming anyone directly. You're just using a fun tool to generate images. What you're calling \"harm\" is in fact the omission of payments given to artists whose images were used during training, which deontology views quite differently.&nbsp;</p><p>While it's true that most deontologists believe in things like property rights, and compensation for work, I am not familiar with <i>any</i> deontological theory that says we are obligated to compensate people who we merely <i>learn </i>from, unless that is part of some explicit contract.</p><p>By contrast, the only very plausible argument I can imagine for why we should compensate artists for AI art is utilitarian. That is, providing compensation to artists would offset the implicit harm to their profession, redistributing economic surplus from consumers and producers of AI art, to artists who lose out from competition.</p><p>Such compensation is often recommended by economists as part of a package for turning <a href=\"https://en.wikipedia.org/wiki/Kaldor%E2%80%93Hicks_efficiency\">Kaldor-Hicks improvements</a> into Pareto improvements, but I have yet to hear of such a proposal from strict deontologists before. Have you?&nbsp;</p>", "parentCommentId": "xcPbHPKXmhGFYjG5q", "user": {"username": "Matthew_Barnett"}}, {"_id": "PmsT3FGKbkSfJQ9an", "postedAt": "2022-12-29T22:19:02.301Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>Sure. I'm curious how you will proceed.</p>\n<p>I'm ignorant of whether AGI Safety will contribute to safe AGI or AGI development. I suspect that researchers will shift to capabilities development without much prompting. I worry that AGI Safety is more about AGI enslavement. I've not seen much defense or understanding of rights, consciousness, or sentience assignable to AGI. That betrays the lack of concern over social justice and related worker's rights issues. The only scenarios that get attention are the inexplicable \"kill all humans\" scenarios, but not the more obvious \"the humans really mistreat us\" scenarios. That is  a big blindspot in AGI Safety.</p>\n<p>I was speculating about how the research community could build a graph database of AI Safety information alongside a document database containing research articles, CC forum posts and comments, other CC material from the web, fair use material, and multimedia material. I suspect that the core AI Safety material is not that large and far far less than AI Capabilities material. The graph database could provide more granular representation of data and metadata and so a richer representation of the core material  but that's an aside.</p>\n<p>A quick experiment would be to represent a single AGI Safety article in a document  database, add some standard metadata and linking, and then go further.</p>\n<p>Here's how I'd do it:</p>\n<ul>\n<li>take an article.</li>\n<li>capture article metadata (author, date, abstract, citations, the typical stuff)</li>\n<li>establish glossary word choices.</li>\n<li>link glossary words to outside content.</li>\n<li>use text-processing to create an article summary. Hand-tune if necessary.</li>\n<li>use text-processing to create a concise article rewrite. Hand-tune if necessary.</li>\n<li>Translate the rewrite into a knowledge representation language.\n<ul>\n<li>begin with Controlled English.</li>\n<li>develop an AGI Safety controlled vocabulary.\n<strong>NOTE:</strong> as articles are included in the process, the controlled vocabulary can grow. Terms will need specific definition. Synonyms of controlled vocabulary words will need identification.</li>\n<li>combine the controlled vocabulary and the glossary. <strong>TIP:</strong> As the controlled vocabulary grows, hyperonym-hyponym relationships can be established.</li>\n</ul>\n</li>\n</ul>\n<p>Once you have articles in a controlled english vocabulary, most of the heavy lifting is done. It will be easier to query, contrast, and combine their contents in various ways.</p>\n<p>Some article databases online already offer useful tools for browsing work, but leave it to the researcher to answer questions requiring meaning interpretation of article contents. That could change.</p>\n<p>If you could get library scientists involved and some money behind that project, it could generate an educational resource fairly quickly. My vision does go further than educating junior researchers, but that would require much more investment, a well-defined goal, and the participation of experts in the field.</p>\n<p>I wonder whether AI Safety is well-developed enough to establish that its purpose is tractable. So far, I have not seen much more than:</p>\n<ul>\n<li>expect AGI soon</li>\n<li>AGI are dangerous</li>\n<li>AGI are untrustworthy</li>\n<li>Current AI tools pose no real danger (maybe)</li>\n<li>AGI could revolutionize everything</li>\n<li>We should or will make AGI</li>\n</ul>\n<p>The models do provide evidence of existential danger, but not evidence of how to control it. There's a downside to automation: technological unemployment; concentration of money and  political power (typically); societal disruption; increased poverty. And as I mentioned, AGI are not understood in the obvious context of exploited labor. That's a worrisome condition that, again, the AGI Safety field is clearly not ready to address. Financiallly unattractive as it is, that is a vision of the future of AGI Safety research, a group of researchers who understand when robots and disembodied AGI have developed sentience and deserve rights.</p>\n", "parentCommentId": "oqudSM5wxN7jT7out", "user": {"username": "Noah Scales"}}, {"_id": "eNdfZdwp7thuWFmmj", "postedAt": "2022-12-30T03:13:12.005Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>In that case, perhaps instead of phrasing it as \"utilitarianism should be bounded by deontology\" I should have instead phrased it as something along the lines of \"a large benefit from this system doesn't justify the harms of creating this system.\" The general idea that I am trying to gesture toward is that when the piece of art someone created is used in a way that they do not consent to, the use benefiting someone doesn't necessarily make it okay. So while the value might be -1 over here and +50 over there, I (as a layperson, rather than a law maker) don't think that should be used as justification. If the creator gives informed consent, then I think it sounds fine. I know that I would feel really shitty if I spent time making something, sold copies of it, and then found that someone had copied my creation and was distributing variations on it for free.</p><p>Perhaps one area where I wasn't clear is that rather than a profession simply fading away (such as those made obsolete by the invention of digital spreadsheets or those made obsolete by the invention of automobiles), the \"harm\" I am referring to an artists work being copied without his/her permission (or stolen, or used without consent, or pirated). So perhaps I've mis-understood your perspective here. I understood your perspective to be \"The value from a really good entertainment generation system would be so large that it would be justified to not pay the artists for their work.\" But perhaps when you referred to lost income you meant the future of their profession, rather than simply not paying for their work?</p><blockquote><p>Such compensation is often recommended by economists as part of a package for turning <a href=\"https://en.wikipedia.org/wiki/Kaldor%E2%80%93Hicks_efficiency\">Kaldor-Hicks improvements</a> into Pareto improvements, but I have yet to hear of such a proposal from strict deontologists before. Have you?&nbsp;</p></blockquote><p>No, I have not heard of such a proposal from a strict deontologist. But to my knowledge I've also never had any interaction with a strict deontologist. 😅</p><p>EDIT: My views are probably quite influenced by recently learning about <a href=\"https://nwn.blogs.com/nwn/2022/12/lensa-ai-art-images-without-consent.html\">Lensa scraping artists work without their consent</a>. If I hadn't learned about that, then I probably wouldn't have even thought about the ethics of what goes into a content generation system.</p>", "parentCommentId": "ohdoM4vNjgwCEmugY", "user": {"username": "jlemien"}}, {"_id": "yXci5fGu4uYniWRix", "postedAt": "2022-12-30T04:35:47.424Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<blockquote><p>So while the value might be -1 over here and +50 over there, I (as a layperson, rather than a law maker) don't think that should be used as justification.&nbsp;</p></blockquote><p>A 50:1 benefit:cost ratio is huge! Even fairly hardcore libertarians will accept policies that have such massively positive consequences. A typical policy is more likely to be -1 over here, +1.1 over there. If you're not willing to enact a policy like this I think there is basically no policy ever that will satisfy you.</p>", "parentCommentId": "eNdfZdwp7thuWFmmj", "user": {"username": "Larks"}}, {"_id": "Xa5icGtRKXmCM2wPK", "postedAt": "2022-12-30T15:34:22.205Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>I agree that in the abstract a 50:1 benefit:cost ratio sounds great. But it also strikes me as <i>naïve utilitarianism</i> (although maybe I am using that term wrong?). To make it more concrete:</p><ul><li>If you have a book that you enjoy reading, can I steal it and copy it and share it with 50 of my friends?</li><li>Is you stealing $100 from me justified if it generates far greater value when you donate that $100 to other people?</li><li>If we can save 50 lives by killing John Doe and harvesting his organs, does that justify the act?</li><li>If I can funnel millions or billions of dollars toward highly effective charities by lying to or otherwise misleading investors, does that benefit justify the cost?</li></ul><p>These are, of course, simplistic examples and analogies, rather than some sort of rock solid thesis. And this isn't a dissertation that I've thought out well; this is mostly impulse and gut feeling on my part, so maybe after a lot of thought and reading on the topic I'll feel very differently. So I'd encourage you to look at this as my fuzzy explorations/musings rather than as some kind of confident stance.</p><p>Any maybe that 50:1 example is so extreme that some things that would normally be abhorrent do actually make sense. Maybe the benefit of pirating an ebook (in which one person has their property stolen and thousands of people benefit from it) &nbsp;is so large that it is morally justified. So perhaps for my example should have chosen a more modest ratio, like 5:1. 😅</p><p>I'll also note that I think I tend to learn a bit toward negative utilitarianism, so I prioritize avoiding harm a bit more than I prioritize causing good. I think this makes me have a fairly high bar for these kinds of <i>the ends justify the means</i> scenarios.</p>", "parentCommentId": "yXci5fGu4uYniWRix", "user": {"username": "jlemien"}}, {"_id": "DxejTgetGA9jTQfft", "postedAt": "2023-01-02T08:23:22.445Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>While it's understandable to want to take action and implement some form of regulation in the face of rapidly advancing technology, it's crucial to ensure that these regulations are effective and aligned with our ultimate objectives.</p><p>It's possible that regulations proposed by neo-Luddites could have unintended consequences or even be counterproductive to our goals. For example, they may focus on slowing down AI progress in general, without necessarily addressing specific concerns about AI x-risk. Doing so could drive cutting-edge AI research into the black market or autocratic countries. It's important to carefully evaluate the motivations and objectives behind different regulatory proposals and ensure that they don't end up doing more harm than good.&nbsp;</p><p>Personally, I'd rather have a world with 200 mostly-positively-aligned research organizations than a world where only autocratic regimes and experienced coding teams - that are willing to disregard the law - can push the frontiers of AI.</p>", "parentCommentId": null, "user": {"username": "Michael Simm"}}, {"_id": "coddDePvbHjbakTHD", "postedAt": "2023-01-31T07:50:04.403Z", "postId": "3yojNGhTXAydhfkNg", "htmlBody": "<p>A friend in AI Governance just shared this post with me.</p>\n<p>I was blunt in my response, which I will share below:</p>\n<p>~ ~ ~</p>\n<p>Two cruxes for this post:</p>\n<ol>\n<li>Is aligning AGI to be long-term safe even slightly possible – practically given default AI scaled training and deployment trends and complexity of the problem (see Yudkowsky’s list of AGI lethalities) or theoretically given strict controllability limits (Yampolskiy) and uncontrollable substrate-needs convergence (Landry).</li>\n</ol>\n<p>If clearly, pre-aligning AGI to not cause a mass extinction is not even slightly possible, then IMO splitting hairs about “access to good data that might help with alignment” is counterproductive.</p>\n<ol start=\"2\">\n<li>Is a “richer technological world” worth the extent to which corporations are going to automate away our ability to make our own choices (starting with our own data), the increasing destabilisation of society, and the toxic environmental effects of automating technological growth?</li>\n</ol>\n<p>These are essentially rhetorical questions, but covers the points I would ask someone who proposes desisting from collaborating with other groups who notice related harms and risks of corporations scaling AI.</p>\n<p>To be honest, the reasoning in this post seems rather motivated without examination of underlying premises.</p>\n<p>These sentences particularly:</p>\n<p>“A world that restricts compute will end up <em>with different AGI</em> than a world that restricts data. While some constraints are out of our control — such as the difficulty of finding certain algorithms — other constraints aren't. Therefore, it's critical that we craft these constraints carefully, to ensure the <em>trajectory of AI development</em> goes well.\nPassing subpar regulations now — the type of regulations not explicitly designed to provide favorable <em>differential technological progress</em> — might lock us into bad regime.”</p>\n<p>It assumes AGI is inevitable, and therefore we should be picky about how we constrain developments towards AGI.</p>\n<p>It also implicitly assumes that continued corporate scaling of AI counts as positive “progress” – at least for the kind of world they imagine would result and want to live in.</p>\n<p>The tone also comes across as uncharitable. As if they are talking down at others they have not spent time trying to listen carefully to, take the perspective of, and paraphrase back their reasoning to (at least nothing is written about/from those attempts in the post).</p>\n<p>Frankly, we cannot be held back by motivated techno-utopian arguments from taking collective action against exponentially increasing harms and risks (in extents of the scale and local impacts). We need to work with other groups to make traction.</p>\n<p>~ ~ ~</p>\n", "parentCommentId": null, "user": {"username": "remmelt"}}]