[{"_id": "5SY9XMpvFLpP9rfm7", "postedAt": "2015-05-19T21:05:19.748Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>To play devil's advocate (these don't actually represent my beliefs):</p>\n<blockquote>\n<p>I can’t remember any EA orgs failing to reach a fundraising target.</p>\n</blockquote>\n<p>This doesn't necessarily mean much, because fundraising targets have a lot to do with how much money EA orgs believe they can raise.</p>\n<blockquote>\n<p>Open Phil has recently posted about an org they wish existed but doesn’t and funder-initiated startups.</p>\n</blockquote>\n<p>It's pretty hard to get funding for a new organization, e.g. Spencer and I put a lot of effort into it without much success. The general problem I see is a lack of &quot;angel investing&quot; or its equivalent–the idea of putting money into small, experimental organizations and funding them further as they grow. (As a counter-counterpoint, EA Ventures seems well poised to function as an angel investor in the nonprofit world.)</p>\n<p>Also, to address the general point that EA is talent-constrained, the problem might be that there are very few people with the skills needed, and more funding can be used to train people, like MIRI is doing with the summer fellows program. In that case earning to give is still a good solution to the talent constraint.</p>\n", "parentCommentId": null, "user": {"username": "satvikberi"}}, {"_id": "2YCnqdzkiXiLq36EK", "postedAt": "2015-05-19T21:13:18.384Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Sounds reasonable - and if successful will come back to a funding constraint.</p>\n<p>You want to put your most expensive resource at the bottle-neck as an efficiency heuristic. </p>\n<p>Do people think the bottle neck is ideas, execution, or funding - or the infrastructure needed to facilitate one or more of those?</p>\n<p>It seems a shame that such intelligent and amazing people in the EA movement are, on the whole, putting their most productive and creative years (25-35?) into EtG rather than building and delivering practical solutions to improve the world in the best way possible outside of AI/Xrisk and movement building - as I think there is a lot of learning value from this kind of thing!</p>\n<p>EA groups specialised around key promising interests such as healthcare, AI, governance, animal welfare, poverty and development etc. that can learn together, network efficiently, keep track of projects, prioritise collective resources etc. might be a way forward. AI/X-risk and perhaps animal welfare appears from the outside to be more developed along these lines than the others? What are people's thoughts?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "qodcaatrYv58vZsAM", "postedAt": "2015-05-19T21:41:05.173Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I think there are plausibly contrary explanations for some of these observations. for senior staff moving to Open Phil, it could be because Open Phil is younger, and its tasks are less structured. For top charities running out of room for more funding, this is only the top couple of GiveWell charities, and this needn't apply to intergenerationally-altruistic charities. GiveWell has mentioned a couple of organisations that they would like to see, but it's not as though finding such opportunities has yet become their main activity.</p>\n<p>I think the general point is right though: Good Ventures has most of the cash that we need, and EA Ventures has some also, as do Jaan Tallin, Sam Harris, edit: Matt Wage and others. Most of the people who are clever enough to want to make epic charities are also clever enough to know that they can have a more secure and conventional life elsewhere. This can be solved by just starting epic charities anyway, and by accumulating more funding to push more marginal individuals to do the same.</p>\n<p>What charity would you start?</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "hSj5KhEqAQy74BtCj", "postedAt": "2015-05-19T21:49:19.167Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I don't have any new considerations to add but I agree with a) there's probably a relative oversupply of 'EA money' on the margin and b) there are various psychological reasons that would pull towards E2G over direct work. </p>\n", "parentCommentId": null, "user": {"username": "Gregory_Lewis"}}, {"_id": "LtkknwmLnAtCjHCaQ", "postedAt": "2015-05-19T23:37:06.010Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Has there been much thought or discussion put into the idea of making existing charities more effective? Sure there are lots of organizations out there that focus on making marketing more effective or getting more donors; but there seems to be a big whole in the market for people or organizations that work to turn current charities into ones we would consider effective. I've thought about this myself quite frequently and would be stoked to see something like this. Has this already been discussed elsewhere?</p>\n", "parentCommentId": null, "user": {"username": "SydMartin"}}, {"_id": "w3esCG4hqZn5CqWuH", "postedAt": "2015-05-20T00:45:47.970Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>To avoid confusing people: my own annual contributions to charity are modest.</p>\n", "parentCommentId": "qodcaatrYv58vZsAM", "user": {"username": "Nick_Beckstead"}}, {"_id": "rFZymKZohzyyAWzsi", "postedAt": "2015-05-20T01:04:06.611Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>It's pretty hard to get funding for a new organization, e.g. Spencer and I put a lot of effort into it without much success. The general problem I see is a lack of &quot;angel investing&quot; or its equivalent–the idea of putting money into small, experimental organizations and funding them further as they grow.</p>\n</blockquote>\n<p>I agree with this. Moreover, I think there's a serious lack of funding in the 'fringe' areas of EA like biosecurity, systemic change in global poverty, rationality training, animal rights, or personal development. These areas arguably have the greatest impact, but it's difficult to attract the major funders. </p>\n<p>For example, I think the Swiss EA groups are quite funding-constrained, but they aren't well-known to the major funders and movement-building lacks robust evidence.</p>\n", "parentCommentId": "5SY9XMpvFLpP9rfm7", "user": {"username": "redmoonsoaring"}}, {"_id": "j4eBLhNSEL6jdNFNi", "postedAt": "2015-05-20T01:33:35.021Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Note that GiveWell / Good Ventures (unsurprisingly) like to research a charity or cause area <em>themselves</em> before they direct funding to it, and this is tightly constrained by the pace of GiveWell research staff growth, so in practice many high-leverage opportunities are still (in my opinion) available to marginal EtGers — at-least, if those EtGers are willing to be at least 1/5th as proactive about finding good opportunities as, say, Matt Wage is. Maybe that won't be true after 10 years of additional research conducted by GiveWell (incl. OpenPhil), but I think it'll be true for the foreseeable future.</p>\n<p>There are probably additional reasons GiveWell / Good Ventures won't fund particular things, besides the fact that they haven't been researched in sufficient depth <em>by GiveWell</em>. E.g. GiveWell might think it's a good thing for there to be multiple meta-charities in the EA space that maintain independence, and so even if funding CEA projects is a clear win, they still might think it's a bad idea for GW/GV to direct any support to CEA projects.</p>\n<p>And finally, it's also possible that individual EtGers might have different values or world-models than the public faces of GW/GV have, and for that reason those marginal EtGers could have good opportunities available to them that are not likely to be met by GW-directed funding anytime soon, if ever.</p>\n<p>(I say all this as a random EA who thinks about these things, not as a <a href=\"https://intelligence.org/2015/05/06/a-fond-farewell-and-a-new-executive-director/\">soon-to-be GW staffer</a>.)</p>\n<p>That said, I <em>also</em> think people with the right collection of talents should seriously consider applying to do cause prioritization research at GW or elsewhere, and people with a different right collection of talents should consider starting new projects/organizations, especially when doing so in coordination with an already-interested funder like GV.</p>\n", "parentCommentId": null, "user": {"username": "lukeprog"}}, {"_id": "3zgFKYAWuJ6rtmhpW", "postedAt": "2015-05-20T04:32:44.005Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Have the Swiss EA groups tried to raise funding from the broader community? I had no idea they were funding-constrained until you mentioned it.</p>\n", "parentCommentId": "rFZymKZohzyyAWzsi", "user": {"username": "Ben_Kuhn"}}, {"_id": "az6jZoSzCc8t7rGnA", "postedAt": "2015-05-20T04:41:15.094Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Also,</p>\n<blockquote>\n<p>I agree with this.</p>\n</blockquote>\n<p>Do you have other evidence on this than Satvik's? Have you also tried to get angel funding or something?</p>\n", "parentCommentId": "rFZymKZohzyyAWzsi", "user": {"username": "Ben_Kuhn"}}, {"_id": "gtrpapFMaw2Zhdez6", "postedAt": "2015-05-20T04:43:09.940Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>This doesn't necessarily mean much, because fundraising targets have a lot to do with how much money EA orgs believe they can raise.</p>\n</blockquote>\n<p>I agree that this could confound the result, but it's still some evidence!</p>\n<blockquote>\n<p>The general problem I see is a lack of &quot;angel investing&quot; or its equivalent–the idea of putting money into small, experimental organizations and funding them further as they grow. (As a counter-counterpoint, EA Ventures seems well poised to function as an angel investor in the nonprofit world.)</p>\n</blockquote>\n<p>It's hard to say for sure without knowing the fraction of solicited EA startups that get funding, but GiveWell has made some angel-esque investments in the past (e.g. New Incentives), and I think some large individual donors have as well.</p>\n<blockquote>\n<p>the problem might be that there are very few people with the skills needed, and more funding can be used to train people, like MIRI is doing with the summer fellows program.</p>\n</blockquote>\n<p>This is pretty plausible for AI risk, but not so obvious for generic organization-starting, IMO. Are there specific skills you can think of that might be a factor here?</p>\n", "parentCommentId": "5SY9XMpvFLpP9rfm7", "user": {"username": "Ben_Kuhn"}}, {"_id": "YptuLjdoriLhTFAEB", "postedAt": "2015-05-20T04:52:25.194Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>I think there are plausibly contrary explanations for some of these observations.</p>\n</blockquote>\n<p>Yeah, I agree; I think they're suggestive rather than definitive.</p>\n<blockquote>\n<p>and by accumulating more funding to push more marginal individuals to do the same.</p>\n</blockquote>\n<p>Sorry--didn't you previously say that you agreed marginal people should be focusing <em>less</em> on accumulating more funding? I think I'm missing a link somewhere here.</p>\n<blockquote>\n<p>What charity would you start?</p>\n</blockquote>\n<p>Good question! I suspect the fact that this is much less well-defined than &quot;which org would you donate to&quot; is one of the psychological factors in favor of EtG :P</p>\n", "parentCommentId": "qodcaatrYv58vZsAM", "user": {"username": "Ben_Kuhn"}}, {"_id": "PqyjetCoNkBiCxPvT", "postedAt": "2015-05-20T04:59:46.845Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>in practice many high-leverage opportunities are still (in my opinion) available to marginal EtGers — at-least, if those EtGers are willing to be at least 1/5th as proactive about finding good opportunities as, say, Matt Wage is.</p>\n</blockquote>\n<p>Interesting! Are you able to be more concrete about those opportunities? (Or how proactive Matt is?)</p>\n<blockquote>\n<p>And finally, it's also possible that individual EtGers might have different values or world-models than the public faces of GW/GV have, and for that reason those marginal EtGers could have good opportunities available to them that are not likely to be met by GW-directed funding anytime soon, if ever.</p>\n</blockquote>\n<p>Yeah, definitely agree that this is the case--on the other hand, it seems like there are a lot of EtGers with a fairly diverse set of values/world-models in place already. I'm worried specifically about marginal EtGers; I think the average EtGer is doing super useful stuff.</p>\n", "parentCommentId": "j4eBLhNSEL6jdNFNi", "user": {"username": "Ben_Kuhn"}}, {"_id": "h5rYLXexTT9TtoE5F", "postedAt": "2015-05-20T05:20:36.399Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I think EAs irrationally avoid giving to &quot;second-best&quot; charities (like GiveWell's standouts) , but that's a relatively weak impression.  It might be helpful to talk more about top giving opportunities in a given moment/year, rather than talking about top charities, which can become less top as donations are made, until donating doesn't feel so shiny anymore (also saying this as a random EA, not soon-to-be GW staffer). </p>\n<p>Of course, it might be better to ask people to give later in general, but there's no reason as far as I know to believe the best order would be 'donate to room-for-funding-remaining top charity' &gt; 'donate later' &gt; 'donate to second-best charity.' </p>\n<p>Also, as Eliezer and Jacy pointed out on Facebook, this sufficient funding argument is far less true of existential risk and animal-focused charities than global poverty ones (in fact, many of those are somewhat strapped for cash). </p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "2XFAWW2izamsMkzes", "postedAt": "2015-05-20T05:33:26.920Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>This is what I was trying to get at with <a href=\"http://acesounderglass.com/2015/05/11/map-of-open-spaces-in-effective-altruism/\">http://acesounderglass.com/2015/05/11/map-of-open-spaces-in-effective-altruism/</a> .  I don't think the number of unsolved problems is at all well publicized.</p>\n", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "hmLspePcgnmGYuGqD", "postedAt": "2015-05-20T06:22:34.265Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>I think EAs irrationally avoid giving to &quot;second-best&quot; charities (like GiveWell's standouts)</p>\n</blockquote>\n<p>I thought the GW belief was that their top charities are still more effective than standouts. What are the arguments against this reluctance?</p>\n", "parentCommentId": "h5rYLXexTT9TtoE5F", "user": {"username": "Ben_Kuhn"}}, {"_id": "mKp6b2QR3X9dfrrdP", "postedAt": "2015-05-20T06:43:52.704Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I don't know the whole story, but Matt Wage kept close tabs on FLI, and gave a substantial amount of money at a well-chosen time, which helped make the AI conference planning go more smoothly.</p>\n", "parentCommentId": "PqyjetCoNkBiCxPvT", "user": {"username": "janos"}}, {"_id": "ouJfgRCS8tNtneiio", "postedAt": "2015-05-20T07:00:09.868Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>It's hard to say for sure without knowing the fraction of solicited EA startups that get funding, but GiveWell has made some angel-esque investments in the past (e.g. New Incentives), and I think some large individual donors have as well.</p>\n</blockquote>\n<p>I get the impression that these are going mostly to programs that already have a lot of evidence and aren't really exploring the space of possible interventions. I tend to believe that the effectiveness of projects probably follows a power law, and that therefore the most effective interventions are probably ones people haven't tried yet, so funding variants on existing programs doesn't help us find those interventions.</p>\n<blockquote>\n<p>This is pretty plausible for AI risk, but not so obvious for generic organization-starting, IMO. Are there specific skills you can think of that might be a factor here?</p>\n</blockquote>\n<p>GiveWell style research seems very trainable, and it is plausible that GiveWell could hire less experienced people &amp; provide more training if they had significantly more money (I have no information on this though.)</p>\n<p>The right way to learn organization-starting skills might be to start an organization; Paul Graham suggests that this is the right way to learn startup-building skills. In that case we'd want to fund more people running experimental EA projects.</p>\n", "parentCommentId": "gtrpapFMaw2Zhdez6", "user": {"username": "satvikberi"}}, {"_id": "ESG2K4vhSxAypTyzK", "postedAt": "2015-05-20T07:02:26.028Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>From talking to Matt Wage a few times I got the impression that he spends the equivalent of a few full time work weeks per year figuring out where to donate. Requiring potential donors to spend that much time seems like a flaw in the system, and EA ventures seems to be addressing it.</p>\n", "parentCommentId": "PqyjetCoNkBiCxPvT", "user": {"username": "satvikberi"}}, {"_id": "sqpmAP9jXojXFx4nm", "postedAt": "2015-05-20T07:56:18.241Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>They do.  My comment was in reference to the fact that the top charities may run out of room for funding.  When that occurs, in my experience (some) EAs tend to forget about or avoid opportunities to help fund standout charities, which are still very although slightly less effective, out of a bias against &quot;second-best&quot; opportunities.</p>\n", "parentCommentId": "hmLspePcgnmGYuGqD", "user": {"username": "ClaireZabel"}}, {"_id": "d9cYznvz6Hpv8DfP3", "postedAt": "2015-05-20T08:09:48.249Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I've heard about 7 EAs discuss hesitating to donate to GW's top charities because they thought the top charities would run out of room for funding without their contributions.  They all decided to either give later, or give to a non-global poverty charity.  None mentioned the possibility of donating to a standout charity.</p>\n", "parentCommentId": "sqpmAP9jXojXFx4nm", "user": {"username": "ClaireZabel"}}, {"_id": "4EkABp7bTSZvJ4Rxj", "postedAt": "2015-05-20T10:15:18.338Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I liked this article! There may be enough forum-goers that haven't seen it (as I hadn't) that it would be worth cross-posting.</p>\n", "parentCommentId": "2XFAWW2izamsMkzes", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "xbQbpxWB8vpRjSqXz", "postedAt": "2015-05-20T10:35:14.771Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>At a broad level, I expect the ratio of (value of marginal earning-to-give):(value of marginal direct work) can't get <em>too</em> distorted, because of mechanisms like:</p>\n<ul>\n<li>Donors discuss publicly whether they feel the pool of giving opportunities is deep;</li>\n<li>Charities talk publicly about whether they are more funding- or talent-constrained;</li>\n<li>Charities raise or lower salaries, making direct work more or less appealing to people using that as a heuristic in choosing a career.</li>\n</ul>\n<p>However this isn't in conflict with your suggestion that at the margin now there may be slightly too much EtG. I'm not sure about that.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "a6SS3iKNKmzHtqPqM", "postedAt": "2015-05-20T10:38:10.552Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>A note on what we mean when we talk about &quot;marginal EtGers&quot;.</p>\n<p>In some sense all EtGers look marginal, in that they could shift the margins by moving onto direct work. But there's a coordination issue. Really the people who have the highest comparative advantage at EtG should be pursuing that, and whether we have the right balance determines where the cut-off should be between people choosing EtG or direct work. &quot;Marginal EtGers&quot; are people who only just decided on EtG. They could be people already in EtG careers, but they will more often be people who haven't started, because experience and specialisation shifts your comparative advantage.</p>\n<p>I expect this is all exactly as you were thinking, but I've been confused about this before so the clarification seemed like it might be useful for somebody!</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "vLsbHPxAXcCDMzimF", "postedAt": "2015-05-20T12:56:45.174Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I wouldn't say that New Incentives has &quot;a lot of evidence and aren't really exploring the space of possible interventions.&quot; But again, this is just dueling anecdata for now.</p>\n<blockquote>\n<p>GiveWell style research seems very trainable, and it is plausible that GiveWell could hire less experienced people &amp; provide more training if they had significantly more money</p>\n</blockquote>\n<p>GiveWell already hires and trains a number of people with 0 experience (perhaps most of their hires).</p>\n<blockquote>\n<p>The right way to learn organization-starting skills might be to start an organization; Paul Graham suggests that this is the right way to learn startup-building skills. In that case we'd want to fund more people running experimental EA projects.</p>\n</blockquote>\n<p>Ah, good point. This seems like a pretty plausible mechanism.</p>\n", "parentCommentId": "ouJfgRCS8tNtneiio", "user": {"username": "Ben_Kuhn"}}, {"_id": "rkv7Dn6qkR838MNaZ", "postedAt": "2015-05-20T13:00:12.942Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks for clarifying! Yup, the coordination problem is pretty hard. (Personally, I actually basically have no idea whether I should actually consider myself a marginal EtGer, and don't really know how to answer the parts of this question that require information about the rest of the EA community.)</p>\n", "parentCommentId": "a6SS3iKNKmzHtqPqM", "user": {"username": "Ben_Kuhn"}}, {"_id": "L2rkvPr44am4iaDYa", "postedAt": "2015-05-20T13:05:14.917Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<ul>\n<li>Donors discuss publicly whether they feel the pool of giving opportunities is deep;</li>\n<li>Charities talk publicly about whether they are more funding- or talent-constrained;</li>\n</ul>\n</blockquote>\n<p>You mean like they are in the comments of this post? ;-)</p>\n<p>(This reminds me of a similar conversation we had on <a href=\"http://effective-altruism.com/ea/ib/request_for_feedback_researching_global_poverty/\">this post</a>...)</p>\n<blockquote>\n<ul>\n<li>Charities raise or lower salaries, making direct work more or less appealing to people using that as a heuristic in choosing a career.</li>\n</ul>\n</blockquote>\n<p>Do we know how sensitive recruiting is to salaries? I would have thought not very for direct work, because many people weren't using salary as a heuristic.</p>\n", "parentCommentId": "xbQbpxWB8vpRjSqXz", "user": {"username": "Ben_Kuhn"}}, {"_id": "rnrmbCfPGhbg3yhD9", "postedAt": "2015-05-20T13:19:30.036Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>It's correct that the Swiss EA organizations are currently funding-constrained. We haven't pitched any projects to the international community yet, but we're considering it if an opportunity arises where this makes sense. </p>\n<p>I also think that funding is going to be less of an issue once more people in the movement transition from still being students to etg. </p>\n", "parentCommentId": "3zgFKYAWuJ6rtmhpW", "user": {"username": "Lukas_Gloor"}}, {"_id": "uFzTkJE42r249sxf9", "postedAt": "2015-05-20T13:43:24.512Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>You mean like they are in the comments of this post? ;-)</p>\n</blockquote>\n<p>Yes, exactly. :)</p>\n<blockquote>\n<p>Do we know how sensitive recruiting is to salaries? I would have thought not very for direct work, because many people weren't using salary as a heuristic.</p>\n</blockquote>\n<p>I can't quantify this, but I can give anecdata which suggest &quot;a bit&quot;:</p>\n<ul>\n<li>CEA has before been interested in people who we couldn't attract for salary reasons;</li>\n<li>I personally had reservations about how useful it would be for me to work at CEA. When I unpacked this I realised that I had been using salary as a partial heuristic for how much value I was adding, and it looked weak compared to postdocs (also not in a &quot;optimised for making money&quot; category). This was easier to lay aside after spotting, and I suspect that relatively few people use it as an explicit heuristic, but it is a fairly normal thing in society generally, so I wouldn't be surprised if some other people were letting it enter into their decision making.</li>\n</ul>\n<p>Even if there is an effect here, it could be that organisations can end up talent-constrained, so that it is hard/expensive to pay money for better staff. VipulNaik posted <a href=\"http://lesswrong.com/r/discussion/lw/jw8/on_the_concept_of_talentconstrained_organizations/\">some analysis of this on LW</a>; I also did <a href=\"https://docs.google.com/document/d/1CzRkt3oJLyvX7eowJA_XjW9v4lrc32_2RUp4M-nO0vU/edit\">some thinking about it</a> before joining CEA.</p>\n", "parentCommentId": "L2rkvPr44am4iaDYa", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "tfMNXTPY8XiNKLgmJ", "postedAt": "2015-05-20T14:42:58.126Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Didn't we all already mean that when we said 'marginal EtGers'? Like - the people whose decision to be in an earning-to-give career rather than charity is marginal? And I agree that it applies more frequently to early-career-stage. But yes, I agree that anyone could theoretically do a little less earning and a little more volunteering for example.</p>\n", "parentCommentId": "a6SS3iKNKmzHtqPqM", "user": {"username": "RyanCarey"}}, {"_id": "vMsNemLgsWKHkPYqG", "postedAt": "2015-05-20T14:49:38.865Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Yes, I think it's right that people can find opportunities beyond those that are researched by GW if they have different values, different epistemology, pro-actively investigate opportunities to fund, or even outsource this evaluation to Wage, EA Ventures, Beckstead or elsewhere.</p>\n", "parentCommentId": "j4eBLhNSEL6jdNFNi", "user": {"username": "RyanCarey"}}, {"_id": "uyDcmJWCRkvpY6S5Z", "postedAt": "2015-05-20T14:50:16.688Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Wait, I meant Matt Wage. Why did I write Nick Beckstead???</p>\n", "parentCommentId": "w3esCG4hqZn5CqWuH", "user": {"username": "RyanCarey"}}, {"_id": "meyxYvFfJ6SG2hzJd", "postedAt": "2015-05-20T14:53:14.120Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks for posting this Ben, I've noticed some of the same things you mention.</p>\n<p>I personally would be more motivated against earning to give if I heard an argument about why the &quot;more money equals more stuff done&quot; equation which seems to hold in the rest of our economy fails for charities.</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "E6xGbQBXjTEkb3vKi", "postedAt": "2015-05-20T14:56:17.402Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<blockquote>\n<p>and by accumulating more funding to push more marginal individuals to do the same.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Sorry--didn't you previously say that you agreed marginal people should be focusing less on accumulating more funding? I think I'm missing a link somewhere here.</p>\n</blockquote>\n<p>EA charities seem sufficiently talent constrained at the moment that I think some organisations will want to take a combination of two different measures: increasing salaries and encouraging people to move across from ETG (or not enter ETG in the first place).</p>\n", "parentCommentId": "YptuLjdoriLhTFAEB", "user": {"username": "RyanCarey"}}, {"_id": "5GzHByRQkBZdQah6Y", "postedAt": "2015-05-20T15:14:56.304Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>We probably did, but the meaning of &quot;marginal EtGers&quot; should be context-dependent[1], so it seemed worth clarification.</p>\n<p>[1] For example if we're talking about the value of persuading people to re-cast their professional career as earning-to-give, we could want to refer to people who were only just persuaded, or people in different areas who might be reached by expanding the efforts -- either of which is a different margin.</p>\n", "parentCommentId": "tfMNXTPY8XiNKLgmJ", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "vLJsaj373e6TM6jJm", "postedAt": "2015-05-20T15:55:30.304Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks :)  I plan to do so as soon as I have the karma</p>\n", "parentCommentId": "4EkABp7bTSZvJ4Rxj", "user": {"username": "Elizabeth"}}, {"_id": "sJnhhNnBicD64g8Wc", "postedAt": "2015-05-20T16:37:23.204Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Like Owen all I can offer is anecdata. I've worked in nonprofits or public sector jobs during my career and there is a serious brain drain problem. Again I don't have specific numbers but it is talked about frequently, and definitely felt. I know several talented, thoughtful, hard working people who left nonprofit work because there was no money, and no expectation of this changing through their career. </p>\n<p>In my experience there is actually the established norm that if you are asking for money on-par with what your position would earn in for-profit you are vilified. This is one reason I mentioned improving nonprofits in my previous comment. I have the impression that changing some of the cultural norms around nonprofit work would create the turnover necessary to lift an under-preforming organization into EA efficacy.</p>\n", "parentCommentId": "uFzTkJE42r249sxf9", "user": {"username": "SydMartin"}}, {"_id": "4dCGSqrT7Yk2F63zb", "postedAt": "2015-05-20T17:01:56.411Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I get the (purely anecdotal) impression that recruiting is sensitive to salaries in the sense that some people who would be good fits for EA charities automatically rule them out because the salaries are low enough that they would have to make undesirable time/money tradeoffs. However, it's a bit of a tricky problem, because most nonprofits want to pay everyone roughly the same amount, so hiring one marginal person at say 20% more really means increasing all salaries by that much.</p>\n<p>Another relevant factor is how much of a salary cut you're looking at when moving from EtG to direct work. In for-profit organizations, the most competent people frequently get paid 3-10x as much as average. I don't think a 3-10x disparity would be culturally acceptable in EA charities, which means that someone at the top essentially has to forgo a much higher percentage of their salary to do direct work.</p>\n", "parentCommentId": "L2rkvPr44am4iaDYa", "user": {"username": "satvikberi"}}, {"_id": "u6MZvHK2sxJEvrR3y", "postedAt": "2015-05-20T17:45:11.413Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>why the &quot;more money equals more stuff done&quot; equation which seems to hold in the rest of our economy fails for charities</p>\n</blockquote>\n<p>Why isn't there an equal presumption that &quot;more people willing to try things equals more stuff done&quot;? EtGers and org-starters are complementary goods. The point isn't that EtG is <em>not going to do anything</em>, just that there might be other things that did even more.</p>\n", "parentCommentId": "meyxYvFfJ6SG2hzJd", "user": {"username": "Ben_Kuhn"}}, {"_id": "FT8buMnyuP7j6rNWP", "postedAt": "2015-05-20T20:12:08.253Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks Ben, maybe I should be more clear. The naïve argument for earning to give is something like: &quot;I donated $100,000 last year; based on my skill set I would probably earn $50,000 working at a charity; therefore earning to give is twice as good.&quot;</p>\n<p>My presumption is that you think this argument gets something wrong, and I'm trying to figure out what it is. </p>\n<p>(As Owen mentioned elsewhere: if you are talking about truly marginal EtGers then the argument doesn't have much force, so I am perhaps unfairly putting words into your mouth by assuming you mean that people like me are incorrectly following arguments like the above.)</p>\n", "parentCommentId": "u6MZvHK2sxJEvrR3y", "user": {"username": "Ben_West"}}, {"_id": "DSn3ftaYuKrjgbfCx", "postedAt": "2015-05-20T21:19:20.226Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>GiveWell already hires and trains a number of people with 0 experience (perhaps most of their hires).</p>\n</blockquote>\n<p>Oh, cool! I definitely didn't realize this. </p>\n", "parentCommentId": "vLsbHPxAXcCDMzimF", "user": {"username": "satvikberi"}}, {"_id": "CuXojcoqb4BQL2gTH", "postedAt": "2015-05-20T23:25:13.831Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Oh, yeah, that assumes that the marginal person who was hired by the charity (a) existed and (b) their salary was a good proxy for their value created. Those seem pretty shaky, since more people means more ability to raise funds from outside EA and my impression is that people working for nonprofits don't pay super much attention to salary as a signal.</p>\n<p>The argument you give proves far too much; for instance, it suggests that Holden and Elie should go back to finance.</p>\n", "parentCommentId": "FT8buMnyuP7j6rNWP", "user": {"username": "Ben_Kuhn"}}, {"_id": "5LscaQGegxCmB3iox", "postedAt": "2015-05-20T23:31:31.999Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>&quot;I donated $100,000 last year; based on my skill set I would probably earn $50,000 working at a charity; therefore earning to give is twice as good.&quot;</p>\n<p>The naive argument definitely works if $50,000 will reliably hire someone as good as you would be at the job, where that someone would otherwise have been doing activities of little altruistic value.</p>\n<p>That's a bit of an odd situation. Say your programming skills are worth $200k on the open market, and a charity needs skills like those. Why can they successfully hire a programmer for $50k? They need some combination of a supply of candidates who are eager to work for them for non-monetary reasons and lowered standards. Sort of like how lots of people want to be musicians, so average musician wages are very low.</p>\n<p>Basically the naive argument assumes that there is a large population ready to donate their time at discount rates and high productivity but not to earn and donate with comparable willingness/productivity. Earning to give then exploits the opportunity for cut-rate hiring created by others' unreasonable enthusiasm for direct work.</p>\n<p>And that's true for many positions, especially for people who have particular advantages in earning income. But it will break down for less popular positions, which offer less non-monetary compensation: they may be higher risk, weirder, have poorer exit options, involve fewer warm fuzzies, require years of onerous preparation getting a PhD or proceeding on the tenure track, etc.</p>\n<p>In some cases there are also other pressures to keep wages low and rely on employees voluntarily taking low wages, e.g. if you have several employees already doing that then hiring new ones at market wages can create workplace jealousy (which is a big deal, believed to be a major contributor to wage stickiness and unemployment).</p>\n", "parentCommentId": "FT8buMnyuP7j6rNWP", "user": {"username": "CarlShulman"}}, {"_id": "7uZLu4HsNYEhtcxwR", "postedAt": "2015-05-21T20:50:51.639Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I love the idea of outsourcing my donation decisions to someone who is much more knowledgeable than I am about how to be most effective. An individual might be preferable to an organization for reasons of flexibility. Is anyone actually doing this -- e.g., accepting others' EtG money?</p>\n<p>In fact, I'd outsource all kinds of decisions to the smartest, most well-informed, most value-aligned person I could find. Why on earth would I trust myself to make major life decisions if I'm primarily motivated  by altruistic considerations?   </p>\n", "parentCommentId": "vMsNemLgsWKHkPYqG", "user": {"username": "mhpage"}}, {"_id": "Sj2C2Sz6g5bNsyYY4", "postedAt": "2015-05-21T21:07:57.352Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>CEA has before been interested in people who we couldn't attract for salary reasons</p>\n</blockquote>\n<p>Why couldn't CEA fundraise more to pay for better salaries?  This sort of thing seems like a failure of too little ETG.</p>\n", "parentCommentId": "uFzTkJE42r249sxf9", "user": {"username": "Peter_Hurford"}}, {"_id": "L4LDFb3LaQkjnzN7Z", "postedAt": "2015-05-22T11:47:15.038Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Well, even if you're primarily motivated by altruistic considerations, there are likely to be some significant personal factors that you can introspect more easily. But what's related, and clearly beneficial, is getting advice from mentors who you talk to when you have a bigger than usual decision.</p>\n<p>My other thought is: what kinds of decisions do you want to outsource? Clever altruistic people have occasionally described why they made various kinds of decisions in their personal lives, and these can be copied e.g.:</p>\n<ul>\n<li><a href=\"http://www.gwern.net/DNB%20FAQ\">http://www.gwern.net/DNB%20FAQ</a></li>\n<li><a href=\"https://meteuphoric.wordpress.com/2014/11/21/when-should-an-effective-altruist-be-vegetarian/\">https://meteuphoric.wordpress.com/2014/11/21/when-should-an-effective-altruist-be-vegetarian/</a></li>\n<li><a href=\"http://robertwiblin.com/2012/04/19/should-you-floss-a-cost-benefit-analysis/\">http://robertwiblin.com/2012/04/19/should-you-floss-a-cost-benefit-analysis/</a></li>\n</ul>\n", "parentCommentId": "7uZLu4HsNYEhtcxwR", "user": {"username": "RyanCarey"}}, {"_id": "9zdmfvraHTBFTDBdm", "postedAt": "2015-05-22T11:57:14.547Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I'm not sure whether it should have happened in these cases (particularly if the total costs of offering high salaries spills over into higher salaries across the board), but yes, it was meant to be evidence that higher salaries could achieve at least somewhat better outcomes, a corollary of which is that the marginal value of EtG can't diminish too severely.</p>\n", "parentCommentId": "Sj2C2Sz6g5bNsyYY4", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "gmpf7Gxqaw2cLQPDC", "postedAt": "2015-05-22T14:14:59.277Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Absolutely re personal factors. &quot;Outsource&quot; is an overstatement. </p>\n<p>And no, I don't mean decisions like whether to be a vegetarian (which, as I've noted elsewhere, presents a false dichotomy) or whether to floss, which can be generically answered. </p>\n<p>I mean a personalized version of what 80,000 hours does for people mid-career. Imagine several people in their mid-30s to -40s--a USAID political appointee; a law firm partner; a data scientist working in the healthcare field--who have decided they are willing to make significant lifestyle changes to better the world. What should they do? This seems to be a very different inquiry than it is for an undergrad. And for some people, a lot turns on it--millions of dollars. Given the amount at stake, it seems like a decision that should be taken just as seriously by the EA community as how an EA organization should spend millions of dollars. </p>\n", "parentCommentId": "L4LDFb3LaQkjnzN7Z", "user": {"username": "mhpage"}}, {"_id": "ED3j22ZFiXQFvnAD5", "postedAt": "2015-05-22T17:04:26.567Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Ah, mid-career work-related decisions. Yes, it seems important. As mid-career decisions are more tailored, they're harder for 80,000 Hours, who are nonetheless better equipped than most for this task.</p>\n<p>Although career direction is important, you can see why it might be done less than directing donations - everyone's money works the same, and so one set of charity-evaluations generalises reasonably well to everyone, assuming they have fairly similar values. Career decisions are harder.</p>\n<p>Mentors who sympathise with the idea of effective altruism are helpful here, because they know you. Also special interest groups could be useful. So for people in policy, it makes sense for them to be acquainted with other effective altruists in a similar space, even if they're living in a different country. If someone who had an unusually high-stakes career (say Jaan Tallinn, a cofounder of Skype) wanted to make an altruistic decision about his career, I'm sure he could pull together some of 80,000 Hours and others to do some relevant research for him. </p>\n<p>Beyond that, how we can get these questions better answered is an open question :)</p>\n", "parentCommentId": "gmpf7Gxqaw2cLQPDC", "user": {"username": "RyanCarey"}}, {"_id": "MqrWquFuhahfsDezS", "postedAt": "2015-05-22T18:18:19.236Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I'm thinking more along the line of mentors for the mentors, and I think one solution would be a platform on which to crowd source ideas for individuals' ten-year strategic plan. In a perfect world, one would be able to donate one's talents (in addition to one's money) to the EA cause, which could then be strategically deployed by an all-seeing EA director. Maybe MIRI could work on that.</p>\n", "parentCommentId": "ED3j22ZFiXQFvnAD5", "user": {"username": "mhpage"}}, {"_id": "J5aicGE9JyxLNNMxn", "postedAt": "2015-05-22T20:15:48.645Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I broadly agree with this (and have some relevant posts in draft).</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "hcads4yndAhk38SHv", "postedAt": "2015-05-22T23:27:41.536Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks! Do you have a perspective on specific things you'd like to see more of instead?</p>\n", "parentCommentId": "J5aicGE9JyxLNNMxn", "user": {"username": "Ben_Kuhn"}}, {"_id": "yfmgTfdtevyiKuoa7", "postedAt": "2015-05-23T00:46:09.198Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>MIRI is focussing on mathematical AI safety research at the moment, so they wouldn't currently want to act as a director of EA resources in general!!</p>\n<p>I think for people who really have substantial personal non-monetary resources to give away, there are people who are prepared to step into a temporary advice-giving role, which might not even be so materially different from what you're describing. even with my limited non-monetary resources, I've got quite helpful advice from people like Carl Shulman, Nick Beckstead and Paul Christiano, who I think are somewhat of a collective miscellaneous-problem-EA-question-answerer!!</p>\n<p>Mentoring the mentors: the problem with giving advice to senior people is that if you know less about their domain than they do, then your advice might well make them worse off. So in such cases, it's often preferable to bring you together with similar people, so that you can bounce ideas off one another. Or maybe I'm still missing some considerations, but these reservations seem worth taking into account.</p>\n", "parentCommentId": "MqrWquFuhahfsDezS", "user": {"username": "RyanCarey"}}, {"_id": "tKJ5TC2mFm9yr5d3r", "postedAt": "2015-05-23T01:41:43.866Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks, Ryan. That's all very helpful.</p>\n<p>(And the MIRI reference was a superintelligent AI joke.)</p>\n", "parentCommentId": "yfmgTfdtevyiKuoa7", "user": {"username": "mhpage"}}, {"_id": "fMHW93q4eS7JEmWQm", "postedAt": "2015-05-23T07:58:50.456Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Haha ohhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh!</p>\n", "parentCommentId": "tKJ5TC2mFm9yr5d3r", "user": {"username": "RyanCarey"}}, {"_id": "95io8eWB2uGMWoGAD", "postedAt": "2015-05-24T04:06:50.910Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>They could be people already in EtG careers, but they will more often be people who haven't started, because experience and specialisation shifts your comparative advantage.</p>\n</blockquote>\n<p>I'm only twenty-two years old, and I haven't completed a university or college certification yet. When I first encountered 80,000 Hours and effective altruism, I opted for earning to give because I didn't think of myself as having many skills. I don't know what soft or general skills I'll learn in various careers by the time I'm thirty or forty, but I know the names of jobs which earn lots of money. Earning to give is what seems available to me. I'm aiming for it because it's the only thing I can concretely imagine myself doing right now. I think this might be the case for lots of young(er) effective altruists, so I think Owen's correct.</p>\n", "parentCommentId": "a6SS3iKNKmzHtqPqM", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "B3Q6gLGf64LeyNbbe", "postedAt": "2015-05-24T04:10:02.222Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I haven't seen this discussed online. When I met Holden Karnofsky, co-executive director of Givewell, I asked him if making existing charities more effective is work Givewell would consider getting into. He told me Givewell is not considering that, and they intend to stick to their work of charity evaluation. He believes making existing charities more effective would be a more difficult job than evaluating them. </p>\n", "parentCommentId": "LtkknwmLnAtCjHCaQ", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "DTb6S2BcAXw7LskmT", "postedAt": "2015-05-24T04:11:45.335Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>This seems like an important overlooked point. I'll try bringing this up if I'm ever present at such a conversation.</p>\n", "parentCommentId": "d9cYznvz6Hpv8DfP3", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "KinZmgaYuNupHHcZt", "postedAt": "2015-05-24T04:18:52.505Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>It seems a shame that such intelligent and amazing people in the EA movement are, on the whole, putting their most productive and creative years (25-35?) into EtG rather than building and delivering practical solutions to improve the world in the best way possible outside of AI/Xrisk and movement building - as I think there is a lot of learning value from this kind of thing!</p>\n</blockquote>\n<p>I think animal welfare is more developed along these lines as well. Animal Ethics, the Foundational Research Institute, Animal Charity Evaluators, and Raising for Effective Giving are all organizations started by effective altruists with a total or partial focus on animal welfare. The coordinated efforts for animal welfare within effective altruism are newer, so you may not have heard of these organizations as much as MIRI or FLI. None of those organizations was founded earlier than late-2013. Hopefully more success is to come to and from them.</p>\n", "parentCommentId": "2YCnqdzkiXiLq36EK", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "RbwQxFWpHmxnTptAs", "postedAt": "2015-05-26T07:15:17.454Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks Evan - is it your impression that EAs across these activities are in touch and taking each other's projects, strategies and learning into account when they plan their work?</p>\n", "parentCommentId": "KinZmgaYuNupHHcZt", "user": {"username": "tomstocker"}}, {"_id": "p7hr6K89Xs7psXyCC", "postedAt": "2015-05-26T07:33:27.844Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>So if starting new projects and enterprises is the constraint, then surely ETG is still less marginally effective than doing and facilitating support for these endeavours where they have high expected value?</p>\n", "parentCommentId": "vLsbHPxAXcCDMzimF", "user": {"username": "tomstocker"}}, {"_id": "pQyNBu3HpHsGi25YK", "postedAt": "2015-05-26T07:53:29.841Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Would you be the first to jump ship, around the middle or towards the end?</p>\n", "parentCommentId": "rkv7Dn6qkR838MNaZ", "user": {"username": "tomstocker"}}, {"_id": "cqSoDEGknTXadJDZf", "postedAt": "2015-05-26T07:57:35.495Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>On the face of it, the Carter Centre, Fred Hollows Foundation, and several other charities look like they are already doing fantastically cost effective projects, but that on the whole they don't fair as well. On the face of it, it appears like large donors can request that certain things are done with their money (from having worked at WaterAid) and concerns about intra-organisation arbitrage might be over-stoked. I think you're on the right lines there Syd! Perhaps this could be an article on its own?</p>\n", "parentCommentId": "LtkknwmLnAtCjHCaQ", "user": {"username": "tomstocker"}}, {"_id": "CCAGM2SRuH3sChFLE", "postedAt": "2015-05-26T08:09:16.729Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I think the counterfactual shouldn't be seen as being an employee, it should be seen as being a leader - that's what's wrong - that leaders aren't really easily replacable. Starting a new charity or project that wouldn't have happened otherwise should perhaps be the counterfactual. Now we can start talking about the relative scarcity of funds against ideas against quality execution and see where the gap is and send marginal EA talent in that direction? Doesn't make that much sense to put your career into executing someone else's plan that would have been done anyway so its a bit of a straw man against ETG?</p>\n", "parentCommentId": "FT8buMnyuP7j6rNWP", "user": {"username": "tomstocker"}}, {"_id": "NBwkEYCyGhDME3poq", "postedAt": "2015-05-26T08:12:16.271Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Psychological reasons? Social status of high earning jobs? The dopaminergic reward of numbers on a page and the oxytocic reward of the expression of gratitude from those you fund? Certainty against uncertainty? Any others?</p>\n", "parentCommentId": "hSj5KhEqAQy74BtCj", "user": {"username": "tomstocker"}}, {"_id": "StY8iubC4j55MY9dt", "postedAt": "2015-05-28T02:28:54.943Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>The answer to this question depends somewhat on your focus area, but my experience so far has been that almost all the organizations I work with could use more money (including ACE, Animal Ethics, most Swiss EA projects, MIRI, FHI, and most object-level charities except those that get saturated by Good Ventures). Many of these groups need money more than talent right now.</p>\n<p>I also think the people who can be hired for an opportunity cost of ~$50K aren't 4 times less talented than those who can be hired for an opportunity cost of $200K. This belief is partly based on what I've seen at current charities and partly based on the premise that EAs aren't as special as they can sometimes seem. When you do nonprofit startups, most of the time goes toward ordinary tasks that lots of people could do.</p>\n<p>I enjoy working on nonprofit stuff, so I don't find EtG psychologically more attractive, but after a lot of thinking about this question, I've tentatively concluded that I can make a bigger impact EtGing. I think this would be true even if I could only make ~$150K/year, which is too low as an estimate of long-term future earnings.</p>\n", "parentCommentId": null, "user": {"username": "Brian_Tomasik"}}, {"_id": "wGbTeokr4e7XLufCF", "postedAt": "2015-05-29T07:20:58.796Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Animal Charity Evaluators acts like the nexus between all these organizations. The newer ones founded by effective altruists don't have enough of a track record to merit a recommendation from Animal Charity Evaluators yet. However, all these, and ACE's top recommended charities, like Mercy For Animals and the Humane League, are in touch with each other. Nick Cooney, who works for Animal Charity Evaluators, has written a book about effective altruism this year, in addition to the one Peter Singer has written, and recommend each other's books to the public.</p>\n<p>So, yes, they're definitely in touch with each other. One difference between existential risk reduction and animal activism is x-risk is smaller. X-risk reduction is so integrated with effective altruism that I think EA knows about everyone in x-risk reduction, and everyone in x-risk reduction knows about EA. However, animal activism is a much bigger movement than just what's touched by effective altruism. Animal welfare/rights has much overlap with environmentalism, which might be the biggest social movement in the world, stretching even the definition of &quot;movement&quot;, really. The rest of animal activism seems so big it's difficult for effective altruism to take into account the actions of the rest of that community, and EA itself is probably only a small part of animal activism. </p>\n<p>For more information, I recommend contacting a <a href=\"http://www.animalcharityevaluators.org/about/meet-our-team/board-of-directors/\">director from the Board of ACE</a>, such as Rob Wiblin, Brian Tomasik, or Jacy Anthis</p>\n", "parentCommentId": "RbwQxFWpHmxnTptAs", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "4NjDwT83idMmuBEeA", "postedAt": "2015-06-02T15:45:31.796Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks Tom. I think I will pose this question in it's own article, but wanted to get some initial feedback from people beforehand. So thanks :)</p>\n", "parentCommentId": "cqSoDEGknTXadJDZf", "user": {"username": "SydMartin"}}, {"_id": "5WaCMdozmXZhocMye", "postedAt": "2015-06-02T15:57:30.283Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>I agree that making charities more effective is a difficult uphill battle. It is definitely easier and more beneficial in the short term to evaluate existing charities. It would be really great to see some sort of cost/benefit break down comparing the time and energy it would take to create a new charity vs retrofitting an existing one.</p>\n<p>This seems like a very complex question but I think it may be valuable as a long-term strategy for EAs to look at. Ultimately the goal is to divert enough energy and attention to highly effective charities, which would ultimately mean that other charities notice what donors want. To my mind it would be really fantastic if at that moment there was an EA organization or group that could step in and help organizations look at how to become more effective. Again this seems to be a long way off, but something worth doing an analysis of.</p>\n", "parentCommentId": "B3Q6gLGf64LeyNbbe", "user": {"username": "SydMartin"}}, {"_id": "559aTrcWxHXkFzXSp", "postedAt": "2015-06-06T15:31:05.519Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>Thanks Carl. Here's a specific example: ACE spends about <a href=\"http://www.animalcharityevaluators.org/wp-content/uploads/2014/04/ACE_2015_Projected_Budget.pdf\">$100,000</a> per year on its five staff members. I don't think all five are full-time paid, but still this implies a pretty low average salary.</p>\n<p>While ACE probably has some need for software skills, my guess is that my labor would be significantly less valuable than the staff they currently have on board with backgrounds in statistics etc.</p>\n<p>Does this imply that earning to give is a good career route for me? Or is there something I'm not thinking of?</p>\n", "parentCommentId": "5LscaQGegxCmB3iox", "user": {"username": "Ben_West"}}, {"_id": "4eDbNr7RcEKPS6bLw", "postedAt": "2015-06-21T06:06:09.216Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<blockquote>\n<p>Nick Cooney, who works for Animal Charity Evaluators, has written a book about effective altruism this year, in addition to the one Peter Singer has written, and recommend each other's books to the public.</p>\n</blockquote>\n<p>Nick Cooney <a href=\"http://www.mercyforanimals.org/jobs\">works for MFA.</a> Although MFA is one of ACE's top ranked charities.</p>\n", "parentCommentId": "wGbTeokr4e7XLufCF", "user": {"username": "kierangreig"}}, {"_id": "XYZqTNTmgCnrfSeMZ", "postedAt": "2017-06-20T14:20:47.471Z", "postId": "4385HNATyQLg28ztL", "htmlBody": "<p>This is now a thing: <a href=\"http://effective-altruism.com/ea/174/introducing_the_ea_funds/\">http://effective-altruism.com/ea/174/introducing_the_ea_funds/</a></p>\n", "parentCommentId": "7uZLu4HsNYEhtcxwR", "user": {"username": "Jeff_Kaufman"}}]