[{"_id": "8kWfhhi8ZJr4ND4kv", "postedAt": "2023-08-24T20:55:55.197Z", "postId": "44jwMq9FSXwhScGuy", "htmlBody": "<p>Thanks for sharing this. I appreciate posts like this, because they broaden the scope of ideas that EAs are exposed to.</p><p>I'm surprised that many people had not heard of Rotary, Lions, or Freemasons. I have the impression that all of them are fairly famous/well-known organizations.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "LKkuX5R8HbQjCsEbs", "postedAt": "2023-08-25T12:01:05.546Z", "postId": "44jwMq9FSXwhScGuy", "htmlBody": "<p>Happy to hear that you find it useful!</p>\n<p>Yes, my subjective feeling from talking to people at EAG London, ~&lt;30% people knew of Rotary. That was surprising to me, so this post was pushed higher on my priorities list.</p>\n", "parentCommentId": "8kWfhhi8ZJr4ND4kv", "user": {"username": "Dušan D. Nešić (Dushan)"}}, {"_id": "vpc8ziKpHCzqnsY4p", "postedAt": "2023-08-25T17:21:14.690Z", "postId": "44jwMq9FSXwhScGuy", "htmlBody": "<p>Congrats on the new role, it sounds like it took a lot of commitment to get there. As president, do you think you'll have more influence among members, local or international? I wonder if becoming involved could help others consider <a href=\"https://forum.effectivealtruism.org/topics/cause-prioritization?tab=wiki\">cause prioritization</a> when selecting projects.</p><p>(I was a Kiwanis<strong> </strong>Junior member back in middle school. I remember doing literally random volunteering to meet the community service hour minimum.)</p>", "parentCommentId": null, "user": {"username": "AllisonA"}}, {"_id": "9cwWWYueJYDdNezna", "postedAt": "2023-08-30T10:35:36.966Z", "postId": "44jwMq9FSXwhScGuy", "htmlBody": "<p>Thanks, Allison!</p><p>The commitment is actually not that huge - there are many clubs, and many of them are quite small, meaning that every year ~20% of members are board members, and people usually do not want to be board members multiple times, so even a year after joining you can make your way up with ambition and drive.</p><p>My hope is absolutely to aim for cause prioritization within Rotary - and Rotarians I spoke to are quite keen on the idea! No one likes being ineffective!</p><p>(Yes, that's often the case when incentives are poor - I think things would be different if you were given a budget and asked to create maximum impact with guidance from someone experienced, a la Charity Elections!)</p>", "parentCommentId": "vpc8ziKpHCzqnsY4p", "user": {"username": "Dušan D. Nešić (Dushan)"}}, {"_id": "8brk5nBDEqQoxm3X2", "postedAt": "2023-09-19T21:17:46.670Z", "postId": "44jwMq9FSXwhScGuy", "htmlBody": "<p>Fantastic post! I had interacted with Rotary Clubs many times in a few projects I coordinated in Latin America and personally. There's a lot to learn from them, especially the way Rotary builds communities, and their influence in some is very interesting (in a few Brazilian states, they partnered with courts to donate a % of fines to communities). Although I'm new to EA, I would love to see how this collaboration could go and the potential impact of it.</p>", "parentCommentId": null, "user": {"username": "mattfelipe"}}, {"_id": "5LLB6mTgbDcz27Bpc", "postedAt": "2023-09-27T13:39:40.191Z", "postId": "44jwMq9FSXwhScGuy", "htmlBody": "<p>Thanks for the input Matheus - yes indeed, they create quite tight communities in really diverse places, lots to learn! I hope to post more about successes in cooperation once we have them :)</p>", "parentCommentId": "8brk5nBDEqQoxm3X2", "user": {"username": "Dušan D. Nešić (Dushan)"}}, {"_id": "gySWM3c4QxHCrEFD3", "postedAt": "2023-09-27T19:05:03.387Z", "postId": "44jwMq9FSXwhScGuy", "htmlBody": "<p>It's good to see this post. I was a member of my local Rotaract club for years until I eventually aged out of their 18-30 age limit. I think I actually at one point got us to send some donations from one of our events to the Against Malaria Foundation. Overall, it was a great experience, although I ended up not joining Rotary Club proper later, mostly because I moved away from my hometown and didn't know anyone in the Rotary Club of my current city.</p><p>I do agree that EA can learn a lot from Rotary as a highly successful organization and community and I'm glad to see someone else mention it here.</p>", "parentCommentId": null, "user": {"username": "Joseph_Chu"}}]