[{"_id": "hGu4FR6TqG4vukecD", "postedAt": "2024-01-05T03:30:46.443Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>It might help if you summarized the arguments made in the video or, ideally, shared a transcript.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "sC5yeBhrRcSAktJmG", "postedAt": "2024-01-05T05:07:12.715Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>I put this video into <a href=\"https://summarize.tech\">summarize.tech</a> and this is what it came back with:</p>\n<blockquote>\n<p>In the \"How the Wealthy Use “Charity” to Screw Everyone Else with Amy Schiller - Factually! - 238\" YouTube video, Amy Schiller discusses concerns with effective altruism, a philosophy of donating based on its potential impact, which grew out of a desire to do the most good and reduce suffering. However, Schiller believes that effective altruism reduces human worth to mere survival and neglects the importance of human flourishing and creating new things. She criticizes its hubris and paternalistic view, which aims to optimize and perfect the outcomes of philanthropy for the donor's satisfaction. Schiller also questions the lack of focus on climate change and social issues like income inequality and labor rights in certain philanthropic organizations. She calls for a more democratic approach to giving, where more people have the discretionary income to engage in charitable giving, and for philanthropists to use their wealth to influence policy directly. Schiller advocates for partnerships between philanthropy, government, and public institutions to create positive change. LeBron James' philanthropy, which provides both tangible and intangible benefits to the community, is given as an example of effective and humble philanthropy. The speaker emphasizes the need for government to provide basic needs and philanthropy to provide things that bring joy and connect people to their souls</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "5qWngZ2aRshKNrFLq", "postedAt": "2024-01-05T19:22:26.775Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>I watched the video and then downvoted this post. The video is a criticism of EA and philanthropy, but there isn't anything new, thoughtful, or useful. I would have upvoted if I thought the criticism was insightful. We've had <a href=\"https://forum.effectivealtruism.org/posts/SBSC8ZiTNwTM8Azue/a-libertarian-socialist-s-view-on-how-ea-can-improve\">much better left-wing criticism of EA before on the forum</a>.</p>\n<p>Adam and Amy make basic mistakes. For example at 15:30, Adam says that GiveWell recommends funding AI alignment work, and that caused him to become critical because they weren't also recommending climate change mitigation. Adam treats GiveWell, SBF, and the entire EA movement as the same entity. Amy claims that EA is entirely about saving human lives. Neither demonstrated they were aware of the intense debate on saving vs. improving lives, or the concern for animals.</p>\n<p>Among Amy's examples of good philanthropy are a billion dollars for the Amazon strike fund, and purchasing lots in NYC to make them community gardens instead of housing. Adam comes away from the conversation thinking that his philanthropic dollars that he gave to the Against Malaria Foundation would have better been spent on the Metropolitan Museum of Art in NYC or a local community garden (60:00). Both <em>celebrate</em> scope neglect, nepotism, and a worldview that the root of problems is political. They mock trolley problems and other philosophy thought problems as a masturbatory, navel-gazing effort, with no real world implications. All they have to offer in support of their preferred charities is an onslaught of left-wing buzzwords.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "PySQpCdd8NNFhYXzq", "postedAt": "2024-01-05T20:49:20.369Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>I think keeping people aware of criticism is worthwhile, but this would be better as a quick take than a full post because it's the same old stuff.</p>\n<p>Some criticism isn't worthy of even a quick take, but the author's bio has enough to justify one here, especially since she just published a book on the topic and seems to be on a marketing campaign.</p>\n", "parentCommentId": "5qWngZ2aRshKNrFLq", "user": {"username": "Jason"}}, {"_id": "AAkC5pqHcRyXjzKvN", "postedAt": "2024-01-07T18:10:48.280Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>I just wanted to point out some more errors with this podcast (though Matthew's comment does it well, and perhaps better), just to underscore how a poor a job I think both did with the EA section. Like even if you agree with this worldview and perspective to criticise EA from, you have to be better than this. To Joseph, I feel like if you can (as a left-wing EA?) be a part of bridge-building between the movements that would be good. But this seems to be the latest in a long string of left-leaning criticisms that goes so far beyond the facts, and never thinking about whether they've got their case right:</p><ul><li>3 minutes in Amy states what seems to be her core issue with EA: \"<i>this all comes down to how we define Humanity. Is Humanity sustenance, just merely surviving? Or is Humanity really about thriving and our full human capabilities to flourish and to create new things in in common with one another? So my feeling is philanthropy went wrong when it started to become a utilitarian practice and not an enabler of human flourishing.\"&nbsp;</i><ul><li>This doesn't describe EA remotely accurately, at least to me. EAs seem to want a world where humans and other sentient beings flourish as far as I'm aware. Most charitably, maybe she's mixing up EA methods with EA ends? Less charitably, she's just making up a strawman to attack.</li><li>Furthermore, Amy doesn't explain when she thinks philanthropy became a 'utilitarian practice', or what that even means. She doesn't seem to back this up afaik? EA is still a small drop in the overall tide of worldwide philanthropy to me knowledge. But then the utiliarian practice of philanthropy can't be EA's fault.</li></ul></li><li>Following on from the above, at around 7 mins. Amy says that giving money is a better way of supporting human flourishing than other means. But GiveDirectly is charity that many EAs donate to and support!<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefb6habcq56vk\"><sup><a href=\"#fnb6habcq56vk\">[1]</a></sup></span>&nbsp;Does she not know this? Is there some reason this doesn't count? Why do all the other charities in the world that aren't GiveDirectly also get similar treatment?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref7wtizujf6cr\"><sup><a href=\"#fn7wtizujf6cr\">[2]</a></sup></span></li><li>At multiple times in the opening segments (up to 6/7 mins) Adam says that EA has <i>\"collapsed\"</i>, <i>\"been largely discredited\" </i>and <i>\"been entirely discredited\". </i>No evidence for this is true, how much of EA this refers to, and so on. This just seems to be reporting his vibe. Most of this podcast just seems to be shared confirmation of a vibe.</li><li>At around 13 mins, Amy brings up Angus Deaton's view on EA. I think a great case study of this the second-half of his interview on <a href=\"https://rationallyspeakingpodcast.org/246-deaths-of-despair-effective-altruism-angus-deaton/\"><i>Rationally Speaking </i>with Julia Galef</a>, which goes largely off the rails and not in Deaton's favour imo. Adam and Amy don't actually back up Angus' point here, they seem to say imply that <i><strong>even if GiveWell's estimates of how much more effective their Top Charities are is true, it still wouldn't be morally right to donate to them over local ones.</strong></i></li><li>As Matthew mentions, at around 15 mins Adam seems to get confused with GiveWell and perhaps OpenPhil in terms of climate change vs AI risk mitigation? Adam's turn away from GiveWell is a key thread that runs throughout the podcast, and this just seems to be a complete confabulation.</li><li>Around 17 mins Amy says: \"<i>this is sort of the end state of thinking of Humanity only in terms of volume. Like how the number of beings that we count as human beings who are, who could maximally be alive. And not about quality of life, not about quality of our world,\" </i>which doesn't seem true of EA,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefmr9jkqfgxw\"><sup><a href=\"#fnmr9jkqfgxw\">[3]</a></sup></span>&nbsp;it only seems true of Parfit's repgunant conclusion, but even that makes an assumption about the quality of life of people in that scenario.</li><li>Around 19 mins Adam says <i>\"You don't actually do that shit... it's a thought experiment\"</i>. I don't know how he'd feel about Republicans in Congress or even moderate Democrats voting down any progressive taxation bill by saying <i>\"Rawl's viel of ignorance is just a thought experiment\". </i>Thought experiments are used to elucidate ideas and arguments. I feel like Amy and Adam actually take issue with the ideas, not the whole concept of thought experiments.</li><li>Around 28:30 Amy implies EA is <i>\"we can do the most good in the world without actually really caring about other people and our obligations to them.\" </i>I guess we'd probably mean different things here, but the EAs I've met care a lot, an awful lot about other people and take their obligations seriously to others, even those different from their own demographics or on the other side of the world.</li><li>The second half is more about Amy laying out a positive account of her own ideas for philanthropy, which I didn't listen to apart from skimming through. Quickly looking at the transcript it seems to be a classic critique of philanthropy from a left-wing perspective, preferring to have action take place through mutual aid and worker solidarity.&nbsp;</li><li>It's interesting around 52 mins that Amy is concerned that her 'democratize philanthropy' views when combined with her and Adam's dissatisfaction with American democracy could lead her to some libertarian conclusions, which she views as a sign something's gone wrong, rather than a conclusion to accept or even just to explore more.</li><li>Around 1hr 3mins Adam actually asks where to donate to, and says (as he used to donate to EA orgs/causes) \"<i>I don't mind that my money went to bed nets, but now I'm like, I could have done a little better.\" </i>In the various suggestions that follow, I'm not sure I see something that is a better use of funds, explicitly funds for donation, than AMF.</li></ul><p><strong>tl;dr</strong> - This was a highly frustrating listen, mostly because there are some interesting lines of critique I feel this podcast could have gone down in an alternate universe where Adam and Amy cared more to find out more about what EA actually is and what EA says. I don't think either of them are intentionally lying per se, but they definitely don't seem interested in questioning whether they've got the basic facts of the case right, and it just seems to lead them to make obviously wrong claims and just have a bad-quality discussion overall.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnb6habcq56vk\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefb6habcq56vk\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Including myself</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn7wtizujf6cr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref7wtizujf6cr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I think in the second half Amy tries to ground this is local ties of community, solidarity, and mutual aid. I just find these very unconvincing compared to the alternatives, to be honest.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnmr9jkqfgxw\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefmr9jkqfgxw\">^</a></strong></sup></span><div class=\"footnote-content\"><p>again</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "qGFGb9tNjhPmipjko", "postedAt": "2024-01-07T23:10:35.057Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>Yes, I think there is a growing group of \"left-wing/progressive\" people that attack EA with mostly lazy/old arguments. To me, I feel they have a sizable audience that genuinely care about the state of the world, and maybe we could have something like an \"Anti- Anti-EA F.A.Q.\", seeing as how Anti-\"TESCREAL\"ists are surging</p>\n", "parentCommentId": "AAkC5pqHcRyXjzKvN", "user": {"username": "Joseph Quevedo"}}, {"_id": "nqLJCSqCQyGjF3zgN", "postedAt": "2024-01-07T23:12:14.291Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>I didn't know if it was okay for me to push the whole transcript onto here, is that usually done that way?</p>\n", "parentCommentId": "hGu4FR6TqG4vukecD", "user": {"username": "Joseph Quevedo"}}, {"_id": "rzBM6zg2Dwmbu9syn", "postedAt": "2024-01-08T07:05:35.508Z", "postId": "49AtXTjapKwDy29zk", "htmlBody": "<p>Is there an existing transcript you can link to? I feel like generally it’s worth including the film transcript in the forum post when the comment is worth engaging with on a detailed level - in this case it sounds like the criticism itself has little worth engaging with</p>\n", "parentCommentId": "nqLJCSqCQyGjF3zgN", "user": {"username": "bec_hawk"}}]