[{"_id": "ZErzYG5cs9vh7jqhE", "postedAt": "2022-11-13T11:00:04.632Z", "postId": "4axeYmgKBhZovrvYL", "htmlBody": "<p>This is an exceptional write-up. Thank you. I have learned a lot from it I'll be able to apply right away!</p>\n", "parentCommentId": null, "user": {"username": "Pseudonym101"}}, {"_id": "zsr8ziNpkqymwpsqy", "postedAt": "2022-11-14T07:47:22.826Z", "postId": "4axeYmgKBhZovrvYL", "htmlBody": "<p>Great Timeline. Quite motivating as well.</p>", "parentCommentId": null, "user": {"username": "Mayank Modi"}}, {"_id": "7eyFo9fARWjZTNjHS", "postedAt": "2022-11-14T07:56:00.725Z", "postId": "4axeYmgKBhZovrvYL", "htmlBody": "<p>another story from me ;)-</p><p>&nbsp;</p><p>When I went to rejoin the government hostel of IIT Delhi after the lockdown and subsequent online semester, I found out the bizarre ways the mess management of the hostel used to dispose of tons of fresh food.&nbsp;</p><p>There had been many NSS(National Social Services) drives related to disposing of remaining food before, for all three meal timings and despite the planning to great lengths and student participation they were never successful and eventually ceased. The real reason behind it- the doers get bored after the doing eventually.</p><p>When the messes opened after the lockdown, there were systems placed for cooking and distribution to other hostels. Initially, food used to come prepared. Approximately, for a hundred students. After the mess timings, almost half of it was being drained into the waste sewer. When asked to one of the staff officials talked to the mess supervisor about it, he said it was meant to be this way as they are not interested enough to do this additional task in such dark times. Hence I decided to do something on my own.&nbsp;</p><p>According to the rules, a student is supposed to take food in the desired amount as well as has the option to save food for later and keep it in the common small fridge. Then I started implementing my own initiative gradually, day by day. Every day, starting from the morning meal, I went on going to the mess to eat at the end and till the very last minute on the schedule. Eating ever so slowly I befriend the staff of the kitchen. When the end time hit, I used to go to the kitchen to pack food for later, but in a significant amount, which I stored in the fridge. Simultaneously, I noticed the staff of various hostel departments, taking some of the remaining food for their family and occasionally trying to hide it . Instead, I promoted their personal agenda and even offered my food stored in the fridge to them if needed in case of shortage ‘cuz if it’s drained it’s begone. At that time only I revealed to them that I donate most of my stored food (after eating part of it during the night hours) to the slums surrounding the campus. I was open from the beginning and kind, gentle, and straightforward, because technically I was the only authority on that material, and what I took outside was defined as waste. In weeks of time, it was established that the remaining food will belong to me every day and that's without any official permission because I am solely acting on my own. Since it was made known to staff and local authorities and because I was honest in the process, most of them supported me in their own way. I used disposable bags of different sizes from my own money which were not expensive, AL foil from the mess staff and fresh bin bags from the cleaning staff for the ultimate storage of the filled bags. At the time of curfew in the hostel, I used local delivery apps to deliver the packages at nominal rates, which was hard in the beginning but gradually sustained. The whole operation lasted until I left the college in July. The entire expenditure was a bit at times, it was worth actually feeding a significant number of people than an entire small NGO.</p>", "parentCommentId": null, "user": {"username": "Mayank Modi"}}]