[{"_id": "vskfsvnjTJguRW5ca", "postedAt": "2023-11-14T12:55:32.477Z", "postId": "4bcDNzA6iGMdjaa9E", "htmlBody": "<p><strong>Executive summary</strong>: A study analyzing the Tesco 1.0 dataset of food purchases finds benefits in using actual sales data to understand meat consumption, though some limitations exist.</p><p><strong>Key points</strong>:</p><ol><li>Actual sales data like Tesco provides more reliable insights into meat consumption than self-reports.</li><li>Analysis found seasonal and demographic variations in meat purchases.</li><li>Data limitations include single retailer, city, and year coverage.</li><li>Results highlight value of sales data to inform meat reduction efforts.</li><li>Future research would benefit from extended, multi-location purchase datasets.</li><li>Relating purchases to family structure could reveal more on intended consumption.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "pqyyRy4tvHdKWrRpa", "postedAt": "2023-11-14T12:57:47.159Z", "postId": "4bcDNzA6iGMdjaa9E", "htmlBody": "<p>This is really great, and thanks for highlighting where to get the data - I wouldn't have heard about this otherwise.</p><p>Regarding this:</p><blockquote><p>For instance, it was found that areas with older, lower education, and more conservative voter-support had a <i>lower</i> proportion of meat purchases</p></blockquote><p>That's definitely an interesting finding. Is it possible that some of these factors, such as lower education, are associated with lower income - thus less able to afford a lot of meat? Alternatively, might there also be differences in where people shop; perhaps they get meat from another store or local butcher?</p><p>I agree that sales data can be much more informative, or informative in different ways, than self-report data, so this is really nice to see</p>", "parentCommentId": null, "user": {"username": "Jamie Elsey"}}]