[{"_id": "hbfreC3TCb44fKPjf", "postedAt": "2022-11-13T11:38:44.090Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<blockquote><p>I have an Anki deck devoted to memories I want to savour.</p></blockquote><p>I really like this idea. But surely the specialness wears off over time? Do you have a lot of churn?</p>", "parentCommentId": null, "user": {"username": "Hamish Doodles"}}, {"_id": "Aj7qCdAWqPkpXxXer", "postedAt": "2022-11-13T11:51:01.936Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<p>Anki goes up to really long time scales. If it's a memory you don't want to see too often you can click 'easy', and then its default time sequence will be something like: first day, 5 days later, a month later, a year later.&nbsp;</p><p>I also have things in there for which I like seeing them pretty often, like baby photos of my son. It's not dissimilar to having a photo displayed in the house, except that instead of it being on show all the time it's brought to your full attention periodically. &nbsp;</p>", "parentCommentId": "hbfreC3TCb44fKPjf", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "ARguJANKcoLrtSvQr", "postedAt": "2022-11-13T15:20:03.751Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<p>Yes, I like your approach.\nI do similar, following what I call \"simple rules\".\nThere was even a book by that name.\nThanks for sharing this.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "BHxf24jWyGp2jYGGw", "postedAt": "2022-11-13T21:04:06.520Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<p>Thanks for sharing. I've never heard of this Anki deck idea before and am intrigued. I have used Anki before for language learning. But I really like your idea of more deliberately \"consuming\" pleasant memories - I've often thought it's a shame how little we savour most of our nice memories.</p><p>If you don't mind me asking:</p><ul><li>How many cards are in your deck right now?&nbsp;</li><li>Roughly how often do you add new memories to it?&nbsp;</li><li>Do you review daily, weekly, or whenever you feel like it?</li></ul>", "parentCommentId": null, "user": {"username": "Trish"}}, {"_id": "kjNKcKApZBmckKe64", "postedAt": "2022-11-13T21:55:31.110Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<p>Happy to share! I forgot to say, I think I got this idea from Tara Mac Aulay</p><ul><li>43</li><li>Pretty rarely - just whenever I remember, which is probably only every couple of months</li><li>Whenever I feel like it, though most often just after I've gone through my other anki decks, which I do around twice a week.</li></ul>", "parentCommentId": "BHxf24jWyGp2jYGGw", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "kZJt5krQqCP4b3wAn", "postedAt": "2022-11-14T10:25:26.178Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<p>I understand if they might be private in nature, but would you (or anyone else) be willing to share more of your policies?&nbsp;</p><p>I found the examples in this post very helpful, but I think I could benefit from hearing even more concrete ideas.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ThomasFowl"}}, {"_id": "XQ7AKEBhByMbzREqN", "postedAt": "2022-11-14T10:40:33.034Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<p>Sick days: If I'm on the fence about calling in sick to work for my physical health, I consider whether I'm feeling unwell enough that I'd cancel  fun personal plans. Usually the answer is a resounding yes and it gives me more confidence that I should be calling in sick to work.</p>\n", "parentCommentId": "kZJt5krQqCP4b3wAn", "user": {"username": "Khorton"}}, {"_id": "vigA4DCzmky5ZvwEo", "postedAt": "2022-11-14T12:15:29.712Z", "postId": "4bDRdeRHH57G34fv9", "htmlBody": "<p>Thanks for sharing!</p>", "parentCommentId": "XQ7AKEBhByMbzREqN", "user": {"username": "Michelle_Hutchinson"}}]