[{"_id": "cKvPSgXdG4MHbgzmh", "postedAt": "2024-01-29T21:38:39.496Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks for posting this update. I prefer to have it out rather than pending, and I think it’s appropriate that people will get a sense of approximately the scope of what happened. I deeply regret my actions, which were wrong and harmful; I think it’s a fair standard to expect me to have known better; I will of course abide by the restrictions you’re imposing.</p><p>I spent a lot of last year working on these issues, and&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology?commentId=D7fJfwHq68qewZyCD\"><u>I put up an update in December</u></a>; that’s still the best place to understand my perspective on things going forwards.</p><p>I think that the first-order impression given by these findings is broadly accurate — I did a poor job of navigating feelings of romantic attraction, failed to track others’ experiences, took actions which were misguided and wrong, and hurt people. For most readers that’s probably enough to be going with. Other people might be interested in more granularity, either because they care about the nature of my character flaws and what types of mistakes I might be prone to in the future, or because they care about building detailed pictures of the patterns that cause harm. For this audience I’ve put my takes on the specific findings in&nbsp;<a href=\"https://docs.google.com/document/d/1AoRnwe0vemYN5xzpB815cG4H8XuJVqG-7i0JzZpICRg/edit?usp=sharing\"><u>this document</u></a>. My&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology?commentId=D7fJfwHq68qewZyCD\"><u>December update</u></a> also includes implicit discussion of some subtle harms not discussed in EV’s findings.</p><p>I continue to care a lot about this community, including making it a very safe, inclusive, and welcoming space. I am pained that I’ve hurt individuals, and harmed the fabric of the community itself. I’d like to do whatever I can to contribute to it continuing to build towards being the best version of itself, but I expect I’ll continue to tread cautiously in community interactions for a while (as well as avoiding romance-related things altogether).</p>", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "7PWAHGveSjyHtqSjG", "postedAt": "2024-01-29T21:47:43.261Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>As the post says above, I’d like to share updates the &nbsp;team has made on its policies based on the internal review we did following the Time article and Owen’s statement as a manager on the team and the person who oversaw the internal review. (My initial description of the internal review is&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=CRdikDzzK2z92GLSs\"><u>here</u></a>). In general, these changes have been progressing prior to knowing the boards’ determinations, though thinking from Zach and the EV legal team has been an important input throughout.<br>&nbsp;</p><p><strong>Changes&nbsp;</strong></p><p>Overall we spent dozens of hours over multiple calendar months in discussions and doing writeups, both internally to our team and getting feedback from Interim CEA CEO Ben West and others. Several team members did retrospectives or analyses on the case, and we consulted with external people (two EAs with some experience thinking about these topics as well as seven professionals in HR, law, consulting and ombuds) for advice on our processes generally.&nbsp;</p><p>From this we created a list of practices to change and additional steps to add. The casework team also reflected on many past cases to check that these changes were robust and applicable across a wide variety of casework.&nbsp;</p><p>Our changes, in rough order of importance:</p><ol><li>Defaulting more often to getting input from more people on the team (especially if a case involves someone with power in the EA community) by having multiple caseworkers on a case and/or involving managers for oversight<ol><li>Specifically, most cases now get seen by more than one person, particularly cases that involve someone with sufficient power in the community (confidentiality constraints may limit how many caseworkers work on a case.)</li></ol></li><li>For the cases we take on, we have a lower bar for proactively reaching out to members to the community in order to get more information. For example, if this same case came up again, we would weigh more highly the importance of getting additional information from the woman Zach mentions above. Our previous approach pointed in this direction as well, but this change will make it less likely we miss an important opportunity.</li><li>We are creating a system that automatically flags to us when complaints about the same person come to different caseworkers, making us more likely to catch patterns of poor behavior (this previously was caught in a less systematic way)</li><li>We have lowered the bar for what’s considered a personal conflict of interest and improved our systems so it is easier to pass a case on to another caseworker. For instance, if the same case came up again, we would have it owned by someone else.</li><li>We’ve added and improved written internal guidelines for considerations to take into account during cases, particularly for cases involving someone with power in the EA community. Previously these were distributed across different documents and tacit understanding; they are now more formalized.&nbsp;</li><li>Automatic reminders for follow-ups on old cases to see if any more action is needed</li><li>An update towards overcommunication and explicitness when giving feedback to people whose behavior we’d like to change; an update against assuming the feedback has been understood and incorporated</li><li>An update towards escalations to boards, legal teams and HR departments where relevant.&nbsp;</li><li>Better systems (reminders, templates in meetings, etc) for making sure balls aren’t dropped based on when or how information comes in<br>&nbsp;</li></ol><p>The casework side of our team meets monthly to check that we are using our systems effectively, that we have implemented these changes with new and existing cases, and to update our internal guidelines as needed.</p><p><strong>Some notes on the changes</strong></p><p>I’m glad we have these changes, though I think it’s worth noting my guess that a big part of what will end up driving change here is also in large part due to CH team members’ individual reflections on the original events (Time article + statement from Owen + original case).&nbsp;</p><p>The list of changes is not exhaustive, since many of the changes stemming from this internal review (depending on your bar for “policy change”) are quite small e.g. “adding a consideration to our list of factors that may make a case more serious.” I think those “nudge” type changes are important and useful for incorporating data without over-updating or over-bureacratizing, though they are harder to assess externally. In general I’m trying to convey our high level changes without creating a laundry list. Nonetheless I hope the descriptions of our process changes help people make accurate updates and have accurate expectations about our team.</p><p>There is some broader context, which is that the casework team’s approach in January of 2023 (before the Time article came out) was already in significant ways different than in 2021. For instance, since Catherine joined in late 2021 (and even more so since Charlotte joined in 2023), the casework team has been able to double-check cases more often and have a lower bar for passing on cases where there was a personal connection. The changes as a result of the internal review add on to these previous shifts.&nbsp;</p><p>We’ll be checking in as a team at regular intervals to reflect on the value of these changes at getting better outcomes. This refers both to whether the increased time and effort per case looks like the right call (relative to e.g. handling more cases) and whether the decisions made are overall better (rather than the changes overfitting to this specific instance).&nbsp;</p><p><strong>What’s still underway</strong></p><p>In addition to the changes in how we handle personal COIs (with some person one team member has a COI with), we’re still working on a general approach to&nbsp;<i>institutional</i> COIs and what constitutes one, e.g. if a case involves someone in EV leadership. So far our planned approach is to ask for a person external to EV to give an independent view when such an institutional COI comes up in a case we take on, but it’s not obvious that there will always be an appropriate person willing. This will need more work to figure out.</p><p>As Zach indicates above, we’ll be working on a more formalized version of our current processes for escalation, COIs, and anything else the boards ask for.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "xN9ix3Xy6zzwKuQME", "postedAt": "2024-01-29T22:17:22.973Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I’m sorry I didn’t handle this better in the first place. My original comments are&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=vjtEvaxDHFvfTXwBF\"><u>here</u></a>, but to reiterate some of the mistakes I think I made in handling the concerns about Owen:</p><ul><li>I wish I had asked the various women for permission to get a second opinion from a colleague or to hand the case over to a colleague.&nbsp;</li><li>In the case where Owen told me he believed he’d made someone uncomfortable, I wish I had reached out to the woman to get her side of the story (if she was willing to share that). This would have given me a clearer picture of some of his actions that I didn’t know about until after the investigation.</li><li>I wish I had been clearer to Owen about specific changes he should make.</li><li>I wish I had flagged my concerns earlier and more clearly to people at CEA and EV. Two of the people I&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=F5Zfn6MPAw3TBhmua\"><u>told</u></a> about some of my concerns were on the boards of EV US or EV UK (then called CEA US and CEA UK), but I didn’t properly think through Owen’s role on the board or flag that to them.</li></ul><p>Some things that are different now, related to the changes that <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=7PWAHGveSjyHtqSjG\">Chana describes</a>:</p><ul><li>The community health team has spent months going through lessons learned both from this situation and from other cases we’ve handled. Based on reflecting independently and together, and now with the input from the HSF investigation, we drew up a list of practices to change and additional steps to add.</li><li>Each month the casework team goes through cases we’re handling, and checks whether we’re implementing the practices we agreed on.</li><li>To me, the most important change is getting more advice and support from other caseworkers when handling difficult cases, especially if the case involves someone with influence or power in EA. I think this helps correct for an earlier pattern where there was too much deferral to individual judgment. We had started this change before 2023, and now I feel it’s much better-established. For example, when working on a recent difficult case, two of us went over the information and wrote up our questions and proposals independently, then discussed together and came to a joint set of proposed actions. This takes more time, but I think it’s a more robust process.</li><li>Over time our team has grown, and it’s more viable than it once was to hand off cases when one of us has some entanglement or conflict of interest.</li><li>As Chana describes, we’re developing a process for getting independent opinions when a concern relates to EV leadership or someone else who has power over the community health team.</li></ul>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "Gy6ZZXiJqNyTaFeje", "postedAt": "2024-01-29T22:21:09.380Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks to the boards for thinking through this and thinking about how Community Health can do better in the future.<br><br>I’m sorry for my mistakes here and the harms my mistakes have caused. In particular, I should have given more support to Julia’s decision-making by getting more details about the case, forming my own inside view and double-checking the actions taken in this case. I think that would likely have caused us to take different actions here and prevented some harms. Our changes, listed in more detail in <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=7PWAHGveSjyHtqSjG\">Chana</a> and <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=xN9ix3Xy6zzwKuQME\">Julia’s</a> comments, make a mistake like this much less likely in the future.<br><br>I also wish I had ensured I had a clearer set of principles and policies for when, either as a board member or the manager of the Community Health team, an issue needed escalation to the whole board. We’re working on a team-wide policy to this effect.<br><br>In general, I’ve also made a lot of personal updates in line with the mistakes listed above (e.g., I put higher weight on the value of pre-agreed-upon policies relative to case-by-case decision-making than I used to). I'm grateful for everyone's work and support on the changes our team is making; I think it’s making us better and more robust.</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Nicole_Ross"}}, {"_id": "DRX9vHqppmAttqhG7", "postedAt": "2024-01-29T22:33:11.926Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>[Liberally edited to clarify / address misunderstandings]<br><br>I assume it's obvious to everyone that it's a bad idea to make [things that are perceived as] unwanted romantic or sexual advances towards people, and that serious action should be taken if someone receives repeated complaints about that.&nbsp;I assume everyone agrees that \"ignore complaints of harassment if a few people say they're pretty sure the perpetrator is a good person / they're a pillar of the community / their work is valuable / etc\" is a bad policy.&nbsp;<br><br>I assume everyone has a shared goal along the lines of \"make the community safe and welcoming for people in general, and especially for underrepresented, vulnerable, or easy-to-make-feel-unwelcome groups\".<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdxceppehjqr\"><sup><a href=\"#fndxceppehjqr\">[1]</a></sup></span><br><br>As a potential member of such a group who has had significant interactions with Owen, I think I have information that might help people to pursue that goal more effectively. I assume one sensible way to make decisions that improve the welcomingness for particular groups is to ask representatives of that group whether a particular decision would make them feel more or less welcome. In the absence of general solicitation to that effect (at least with respect to this decision), I am giving my unsolicited opinion (which obviously introduces bias, but I'm thinking the value is mostly by pointing out that some type of opinion exists rather than thinking that anyone should make strong inferences about the distribution of opinions).<br><br>Here is the information I have that might be useful:<br><br>I have many interactions with Owen, since 2015 or so, originally as a much younger (late teens), new-to-EA, and female person, and in many situations where he had substantial power dynamics relative to me. I found him extremely respectful, kind, supportive, and empowering. He actively increased my intellectual and social confidence and made me feel safe, comfortable and welcome in the community. I think it would have been a big loss to me personally not to have interacted with Owen, and from my perspective he substantially <i>improved</i> the fabric of the community. For me, I expect that having Owen present in a community space would make it feel safer and more welcoming, even if I didn't know him already.&nbsp;<br><br>More specifically with respect to safety and unhealthy power dynamics, there was a particular episode (related to people who are no longer part of the community) where I was in a situation which was pressuring and manipulative and had weird power dynamics. Owen's support and advice was helpful for me keeping my sanity and perspective and avoiding getting sucked in. This was downstream of particular personality traits and ways of interacting with people that would likely be helpful to other people he interacted with too, including: listening intently and taking people very seriously even when they're junior; presenting his opinions in a way that doesn't force them onto others; being generally calm, reasonable and gentle in manner.<br><br>Similar to comments by Emma and Jonas, I want to prevent people taking away what I would consider a misleading picture of Owen's behavior, because I think people having a misleading picture will make it harder to achieve the goal of making the community more welcoming.<br><br>I think people might read from this post that it matches a pattern of predatory or nefarious behavior - which definitely does exist, and which I think should be handled very aggressively by removing people from the community, which I have advocated in other cases. &nbsp;Whereas, I think the pattern in this case is social clumsiness, some misunderstandings, and some psychological hangups around scrupulosity and needing to confess attraction and receive moral validation.&nbsp;<br><br>I think the latter pattern of behavior should be handled differently than the former, and I think it's very important information for people to know when deciding e.g.:<br>- &nbsp;how likely is Owen to cause similar problems in the future?<br>- what is the net effect of Owen's presence in a community space?<br>- in what way do they personally want to interact with Owen?<br>&nbsp;- what interventions could be undertaken to prevent problems like this from occurring in the future?<br>- what warning signs indicate that someone might be at risk of causing similar problems?<br>- what should they take away from this situation as to what their response should be to someone who <i>is</i> displaying predatory behavior? (in particular, I think that if this <i>was</i> part of a pattern of sociopathic or predatory behavior, I think the response is significantly too mild, and I wouldn't want people to reproduce this response in that situation)<br><br>I am also somewhat worried that the accounts as stated might provide a slightly inaccurate picture of the events; I am particularly surprised about the claim that \"Owen did not stop making repeated unwanted attempts at contact after being asked to do so\". Based on my experiences with him, I personally would strongly predict that this was based on misunderstanding or confusion about what the other person wanted rather than Owen knowingly ignoring someone's requests.&nbsp;This is obviously not hard evidence, but if many people had similar reactions it might suggest there was either something wrong with the investigation, or with the framing of the conclusions, or with my and other people's ability to predict people's behavior!<br><br>Again, I obviously can't know how much harm Owen's actions caused other people. But if I was asked to give an overall judgement, in terms of:<br>- harm caused to people from interacting with Owen<br>- benefit to people from interacting with Owen<br>- how inviting vs unsafe community spaces feel for people, if they know that people are excluded on the basis of behavior like Owen's<br>then I would guess that it is substantially better to include Owen in community spaces.</p><p>More generally, I feel subjectively highly confident that Owen is broadly well described as:</p><ul><li>highly morally scrupulous, kind, and careful person</li><li>would hate to cause someone to feel unsafe or uncomfortable</li><li>thinks a lot about other people’s comfort and how to make them feel happy and safe,</li><li>would only ever cause someone to feel uncomfortable by accident</li><li>would make concerted + successful efforts to change if he was told something he was doing was causing problems for someone</li><li>tries hard to view and interact with people how they would want to be viewed and interacted with</li><li>acknowledges his limitations and takes careful steps to compensate for these&nbsp;</li><li>engages deeply and sensitively with different perspectives and understands that good intentions are not sufficient for avoiding causing other people harm</li></ul><p>and is <strong>not</strong> well-described as:</p><ul><li>someone who is callous about other people’s needs and sense of safety</li><li>puts his own needs ahead of theirs</li><li>feels entitled to ask things of them</li><li>isn’t interested in learning about how his actions affected people or changing his behavior</li><li>views or treats people in a sexualized or objectified manner</li><li>doesn’t acknowledge power dynamics, social and societal context, highly subjective nature of social interactions</li><li>thinks that if they weren’t deliberately doing harm, and it seemed fine to them, then everything’s fine and anyone complaining of being harmed is just making a fuss</li></ul><p><br>I am sharing this under a pseudonym for reasons like \"not wanting this content to be something that comes up if someone searches my name in a professional context\". I'm hoping I can confirm my identity to the EA forum team and they can attest that the factual claims about my demographics and interactions with Owen are correct.<br>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndxceppehjqr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdxceppehjqr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Possibly more controversially, and not pertinently to the rest of this comment, I personally think we should give non-zero weight to the impact on the wellbeing of a category of people something like: &nbsp;\"neurodivergent or otherwise socially unskilled people who have serious difficulties and/or mental health issues related to shame, social anxiety, and deprivation of social/romantic connection\".&nbsp;My guess (which is anchored very strongly to my subjective experience of the intensity of suffering from these two kinds of harm and from talking to a small number of other people who have experienced both, and therefore could easily be changed by testimonials from other people who feel the intensity obviously goes the other way ) is that there is a significantly larger amount of suffering caused by social anxiety, shame and loneliness than there is by sexual harassment in the EA community.&nbsp;<br>&nbsp;<br>Somewhat relatedly, I think: &nbsp;there is a meaningful way in which the treatment of Owen here is plausibly unjust, namely: in terms of the amount of harm caused, and the level of vigilance that would be required to avoid that harm, I think Owen and people similar to him are being held to a much higher standard than we hold other people to with respect to different types of harms. That is to say, I think most people have done many things that are more blameworthy (in terms of the amount of harm caused, and the effort that would have been required on their part to avoid it) as the things listed here. I think if we banned everyone from the community who had caused this level of suffering with this level of avoidability, I'm not sure there would be anyone left. This kind of justice or proportionality is obviously not the only criteria on which decisions like this should be made, and there are good reasons to have strict policies around particular types of harm even if those policies sometimes lead to locally unjust decisions, but I think it bears acknowledging.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "lyra"}}, {"_id": "HiLNtxdWWv27AB67i", "postedAt": "2024-01-30T00:57:33.386Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I worked closely with Owen for several years. This was not my experience with him nor the experience of many others who worked with him. I found Owen to have \"favorites\" he treated well and others he treated very poorly. Including me. The pain he inflicted on me was not trivial and still bites.&nbsp;</p>", "parentCommentId": "DRX9vHqppmAttqhG7", "user": {"username": "I_machinegun_Kelly"}}, {"_id": "xTcsrutBZ8qx8B6Au", "postedAt": "2024-01-30T01:09:33.620Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I'm glad to hear that your experiences were so positive, but I'm afraid in the grip of angst I didn't always manage to hold to all of these ideals. I wasn't properly aware of my shortcomings; I sought to move on quickly from processing feedback; I sometimes felt entitled to ask for emotional support in ways I now think were highly inappropriate and damaging. These issues are discussed a bit further in the notes linked from my other comment.</p>\n", "parentCommentId": "DRX9vHqppmAttqhG7", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "NWpk6vizkQuNEQG7q", "postedAt": "2024-01-30T01:14:46.395Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Over the years, I’ve done a fair amount of community building, and had to deal with a pretty broad range of bad actors,&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/jLaDP2aWxdDCzwBYy/takes-from-staff-at-orgs-with-leadership-that-went-off-the\"><u>toxic leadership</u></a>, sexual misconduct, manipulation tactics and the like. Many of these cases were associated with a pattern of&nbsp;<a href=\"https://hypatia.ca/2016/06/21/no-more-rock-stars/\"><u>narcissism</u></a> and dark triad spectrum traits, self-aggrandizing behavior, manipulative defense tactics, and unwillingness to learn from feedback. I think people with this pattern rarely learn and improve, and in most cases should be fired and banned from the community even if they are making useful contributions (and I have been involved with handling several such cases over the last decade). I think it’s important that more people learn to recognize this; I encourage you to read the two above-linked articles.</p><p>I feel worried that some readers of this Forum might think Owen matches that pattern. Knowing him professionally and to some degree personally, I think he clearly does not. I’ve collaborated and talked with him for hours in all kinds of settings, and based on my overall impression of his character, I understand his problematic behavior to have arisen from an inability to model others’ emotions, an inability to recognize that he was in a position of power and influence, and moral scrupulosity (obsession about whether he’s a bad person or not for inappropriately feeling attracted to someone).&nbsp;</p><p>This obviously doesn’t make his past behavior any less bad and doesn’t excuse any of it. But it makes it more likely that he makes a real effort to learn and improve, and based on some conversations I’ve had with Owen, I believe this learning has indeed happened. I think Owen is unlikely to repeat his mistakes, and his document seems honest and he’s not just trying to tell us what we want to hear (in fact, I think his moral scrupulosity makes him unusually honest in this situation).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref3w5iyefxveu\"><sup><a href=\"#fn3w5iyefxveu\">[1]</a></sup></span></p><p>Personally, I hope Owen can be involved in the community soon again. I think a temporary ban is important, both as an incentive against bad behavior and as a precaution so the harms don’t continue. That said, two years are a long time, and I hope other EA orgs won't take his loss too lightly and will consider inviting him to participate again. I think we would benefit a lot from his participation, both in terms of ensuring the community is safe and welcoming for everyone (where I've seen him go out of his way in the past), and in terms of getting more of his contributions to the causes we all care about.</p><p>(This comment is intended as sharing my impression from knowing Owen personally, which I figured might be helpful context for some readers. I welcome others sharing different perspectives, especially if you disagree. By default I won’t engage in much discussion due to lack of time.)<br>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn3w5iyefxveu\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref3w5iyefxveu\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I think a significant share of sexual misconduct or unwelcome sexual attention in EA is caused by the broad cluster of poor theory of mind and autism-spectrum / OCD-spectrum personality traits, as opposed to the more broadly publicized manipulative/sociopathic/narcissistic spectrum. The latter seems characterized by not caring sufficiently about the victim’s experience, whereas the former seems characterized by a lack of understanding of the effects of one’s actions, which makes it more tractable. I think Owen’s example could be instructive and hope it helps others avoid similar mistakes.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jonas Vollmer"}}, {"_id": "GNDMvEa9MA2hM9TSi", "postedAt": "2024-01-30T01:24:28.296Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I would also add that as far as I can recall, everyone I've ever spoken with about Owen has had positive experiences interacting with him. This includes multiple other people in the same sort of demographic situation as me. This is obviously not conclusive evidence of anything, and there can be all sorts of selection effects, but is at least evidence that there are multiple other people with similar positive experiences to me.</p>", "parentCommentId": "DRX9vHqppmAttqhG7", "user": {"username": "lyra"}}, {"_id": "zvTntheMPxXJZ4Bsb", "postedAt": "2024-01-30T01:32:36.469Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I'm really sorry to hear that this was your experience. I don't know who you are, but ... I wish you'd said something at the time? (Though I recognize that speaking up can be difficult and costly, and I don't think you had a responsibility to speak up; I'm just expressing a felt desire to have lived in the world where you had.)</p>\n<p>Or if you feel like you tried to say something and it didn't get through, I'm sorry for that.</p>\n<p>Without knowing more I don't know how much these are issues where I've updated my policies in the meanwhile. I guess not entirely (in that I wouldn't have described myself that way). If you feel like sharing more information (publicly or privately) I'm interested, but I don't want to put you on the spot just because you wanted to share this high-level experience.</p>\n", "parentCommentId": "HiLNtxdWWv27AB67i", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "T7WYftdtc2A6nFPNY", "postedAt": "2024-01-30T02:31:56.629Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I mostly want to +1 to&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=NWpk6vizkQuNEQG7q\"><u>Jonas’ comment</u></a> and share my general sentiment here, which overall is that this whole situation makes me feel very sad. I feel sad for the distress and pain this has caused to everyone involved.&nbsp;</p><p>I’d also feel sad if people viewed Owen here as having anything like a stereotypical sexual predator personality.</p><p>My sense is that Owen cares extraordinarily about not hurting others.&nbsp;</p><p>It seems to me like this problematic behavior came from a very different source – basically problems with poor theory of mind and&nbsp;underestimating power dynamics. Owen can speak for himself on this; I’m just noting as someone who knows him that I hope people can read his reflections genuinely and with an open mind of trying to understand him.&nbsp;</p><p>That doesn’t make Owen’s actions ok – it’s definitely not – but it does make me hopeful and optimistic that Owen has learnt from his mistakes and will be able to tread cautiously and not make problems of this sort again.</p><p>Personally, I hope Owen can be involved in the community again soon.&nbsp;</p><p>&nbsp;</p><p><i>[Edited to add: I’m not at all confident here and just sharing my perspective based on my (limited) experience. I don’t think people should give my opinion/judgment much weight. I haven’t engaged at all deeply in understanding this, and don’t plan to engage more]</i></p>", "parentCommentId": null, "user": {"username": "EmmaAbele"}}, {"_id": "S9uoowghDo7bANL6F", "postedAt": "2024-01-30T05:11:02.876Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Perhaps not directly related to this post: Is anyone interested in looking to use Metaculus or Manifold to predict the future frequency and/or number of occurrences of sexual misconduct within EA?&nbsp;<br><br>I am asking as I suspect the EA community might be putting a disproportionate amount of resources into understanding past occurrences with a disproportionally smaller effort into preventing future occurrences. Maybe having a clear-eyed view on what might be in store going forward could go some way to alleviating this.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "qHBFSFSMzBAC33KRK", "postedAt": "2024-01-30T06:03:05.787Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>How can the EA community better support neurodivergent community members who feel like they might make mistakes without realizing it?</p>", "parentCommentId": "NWpk6vizkQuNEQG7q", "user": {"username": "evelynciara"}}, {"_id": "CL28mDtxCNKYTjJJM", "postedAt": "2024-01-30T07:57:46.475Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Could you please indicate why you are disagreeing with me? To make it easier, I will make a sub comment each with possible objections so all you have to do is read and click.&nbsp;<br><br>I am genuinely keen to understand what, if anything, can be done to reduce the chance of future offences. I should make it clear, in case there was any doubt: I am talking about offences from anyone, and not from anyone in particular. In other words, I have no reason to suspect that Owen in particular is at increased risk from repeat offences. If anything, I would trust the judgement of other commenters indicating such risks are low.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "XK9X9FNRbc96ehSQw", "postedAt": "2024-01-30T07:58:09.859Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>EA is already putting sufficient focus on preventing future occurrences.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "7iRt2BacfQWxbhQkP", "postedAt": "2024-01-30T07:58:47.992Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>There is not much that can be done.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "mg2NyPnxysMP27saP", "postedAt": "2024-01-30T07:59:44.214Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>By doing something to prevent future occurrences, we are risking causing enough trouble so that there is chance people are deterred from engaging with EA and/or important people might leave our community.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "MwktbExmYJgPqibhd", "postedAt": "2024-01-30T08:00:41.506Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>A prediction of future occurrences is unlikely to be effective.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "KfNE7WWpqT6oWW49m", "postedAt": "2024-01-30T08:02:21.701Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Specifically doing something by forecasting future occurrences is likely to be net negative. It could e.g. deter more women from engaging with EA and cause ~panic as the numbers could end up looking pretty high.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "t2BPdbaHoZmmLFx7m", "postedAt": "2024-01-30T08:20:25.853Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>This is the wrong place to pose that question.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "wD44sbmtegKyckNBL", "postedAt": "2024-01-30T10:02:52.050Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I do not know Owen. I am however a bit worried to see two people in these comments advocating for Owen while this affair does not look good and the facts speak for themselves; there is a certain irony to see these two people coming to defend Owen while the community health head, Julia, admits to a certain level of bias when handling this affair since he was her friend. It seems that EA people do not learn from the mistakes that are courageously being owned up here. This posts talks about Owen misbehaving: it does not talk about Owen's good deeds. So this kind of comment defeats the point of this post.&nbsp;</p><p><strong>Can you put yourself two seconds in the shoes of these women who received unwanted and pressing attention from Owen, with all the power dynamics that are involved, reading comments on how Owen is responsible and a great addition to the community, even </strong><i><strong>after</strong></i><strong> women repeatedly complained about him? </strong>What I read is 'He treated me well, so don't be so quick to dismiss him' and 'I've dealt with worse cases, so I can assure you this one is not that bad'.&nbsp;</p><p>Do you really think that such attitudes encourage women to speak up? Do you really think that this is the place to do this?&nbsp;</p><p>Edit:<strong> I want to thank those who have written this post and highlight the courage that it has taken. </strong>I know that I am flagging up the things that are not okay, e.g these comments, but I am very happy that this does not stay within community building circles and gets shared. Yeay for transparency, yay for honesty, yay for highlighting what is wrong if we want to do better. I know of instances where such bad press has been kept within closed doors, and I'm glad this one has not. So, thanks. I yell a lot (I wish I did not have to, of course) but I also want to be grateful.</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "t6GAfybgDs8gaGG7f", "postedAt": "2024-01-30T10:37:35.418Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>As a person with an autism (at the time \"asperger's\") diagnosis from childhood, I think this is very tricky territory. I agree that autistics are almost certainly more likely to make innocent-but-harmful mistakes in this context. But I'm a bit worried about overcorrection for that for a few reasons:&nbsp;<br><br>Firstly, men in general (and presumably women to some degree also), autistic or otherwise are already incredibly good at self-deception about the actions they take to get sex (source: basic commonsense). So giving a particular subset of us more of an excuse to think \"I didn't realize I would upset her\", when the actual facts are more \"I did know there was a significant risk, but I couldn't resist because I really wanted to have sex with her\", seems a bit fraught. I think this is different from the sort of predatory, unrepentant narcissism that Jonas Vollmer says we shouldn't ascribe to Owen: it's a kind of self-deception perfectly compatible with genuine guilt at your own bad behavior and certainly with being a kind and nice person overall. I actually think the feminism-associated* meme about sexual bad behavior being always really about misogyny or dominance can sometimes obscure this for people a bit.<br><br>Secondly, I worry that &nbsp;people who are both autistic or at least autistic-coded <i>and</i> predatory can take advantage of a perception that their bad behavior is always a mistake and not deliberate. I <i>strongly</i> suspect SBF, though he is not a diagnosed autistic, deliberately exploited a perception that \"nerds\" are not socially savvy enough to engage in deliberate deception.&nbsp;<br><br>Thirdly, I'm worried about being patronized.&nbsp;<br><br>Fourthly, I'm worried that if the association between \"autistic\" and (even accidental) \"sexual misconduct risk\" becomes too strong in people's heads, this will actually lead to overcorrection in the other way, with people becoming <i>too reluctant</i> to hire autistics. (Probably not an issue in EA to the degree it would be in less autistic communities though.) &nbsp;We don't actually <i>know</i> how much more likely autistics are to behave badly in which particular ways.&nbsp;<br><br>Alas 4 and 1 kind of point in opposite directions.&nbsp;<br><br>*My guess is that feminists who've actually written carefully and at length about sexual bad behaviour have more nuanced views than this, and often when they cite \"misogyny\" as an explanation, they mean something structural, not something in the psychology of people who behave badly.)&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "qHBFSFSMzBAC33KRK", "user": {"username": "Dr. David Mathers"}}, {"_id": "9LDiG4psPeDrn64La", "postedAt": "2024-01-30T12:40:53.512Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>[T]here is a certain irony to see these two people coming to defend Owen while the community health head, Julia, admits to a certain level of bias when handling this affair since he was her friend.</p></blockquote><p>Jonas's comment includes statements like \"This obviously doesn’t make his past behavior any less bad and doesn’t excuse any of it\" and \"I think a temporary ban is important, both as an incentive against bad behavior and as a precaution so the harms don’t continue. That said, two years are a long time, [...]\"<br><br>So, I don't think this would be repeating the mistakes that the community health team acknowledged. I also think Jonas made important points.<br><br>Generally, I think as long as someone acknowledges what's at stake for both sides (underreaction vs overreaction), it should be okay to try to add important nuance to a conversation.<br><br>Regarding lyra's comment, among other things, she says that she thinks Owen would be positively welcoming for lots of communities. In light of several people speaking up about their negative experiences, I can see why that's weird to hear. Like, even if it's true <i>going forward</i> (I think it might be!), I'd personally would have liked it better if lyra's comment had contained more of a mention of how she agrees the patterns described in the update were indeed concerning and very much warranted action. (I don't know who lyra is – it's plausible that she'd agree with that and simply didn't bother to write it because she thought readers can already see all the negative descriptions.)</p><blockquote><p>Can you put yourself two seconds in the shoes of these women who received unwanted and pressing attention from Owen,</p></blockquote><p>Again, I can see why you're writing this in response to lyra's comment. At the same time, I want to point out that \"being concerned about overreactions\" isn't just one-sidedly bad for the goal of improving community safety and welcomingness. If the community doesn't have a sense of how there's still a big difference in \"potential for future harm\" between someone like Owen and someone like Jeffrey Epstein, then how is that conducive for welcomingness and safety? This isn't yet a fleshed out argument, but I have the intuition that if we react with all-out outrage at even comparatively more fixable/improvable incidents of harm, we'll do a worse job at having the energy and vigilance to maximally pursue the worst cases of it, which often also involve a lot of deception and \"enemy action\" that distorts the discourse around what's happening and around \"who's the bad party?.\" In those situations, you really want people who can pay attention to lots of subtleties of character and don't fall into outrage traps around whose side is currently winning.&nbsp;</p>", "parentCommentId": "wD44sbmtegKyckNBL", "user": {"username": "Lukas_Gloor"}}, {"_id": "8GTpjPYHbwf8aeAd5", "postedAt": "2024-01-30T12:44:49.677Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>The post did a great job at describing exactly what is reproached to Owen. I do not see anyone in the comment claiming that he is more than what is described in the post, and in general, I do not see anything pointing at overaction from anybody.&nbsp;</p><p>Citing Epstein looks like a strawman and does not make my point less salient: that some members jumping to defend Owen is an insult to the testimony of these women as if Owen's good behaviour removed his bad behaviours, and contradictory to what has been courageously empathized in this post, i.e. that EAs knowing each other and defending each other encourage secrecy and overlooking potential serious misconducts.&nbsp;</p><p>I would even add that assuming that the community will conflate Owen and Epstein's case is patronizing and far-fetched; I think that people are able to make the distinction between a sex offender who got jail time and Owen.&nbsp;</p>", "parentCommentId": "9LDiG4psPeDrn64La", "user": {"username": "Vaipan"}}, {"_id": "BQj5YdSXtFqGCfAtm", "postedAt": "2024-01-30T13:06:49.118Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>For reasons I went into <a href=\"https://forum.effectivealtruism.org/posts/5uZiBK4h5WcccjA2R/ea-is-too-new-and-important-to-schism?commentId=BHfv9dt8BTfgiTy5Q\">here</a>, I think it often sets things up for vexed discussion dynamics when we're criticizing how others are reacting or aren't reacting, and whether they are emphasizing the right points with the appropriate degree of strength. (I do this myself occasionally, and there isn't anything wrong with doing it, per se. I'm just pointing out why we're doomed to have an unpleasant discussion experience.)</p><blockquote><p>I would even add that assuming that the community will conflate Owen and Epstein's case is patronizing and far-fetched;</p></blockquote><p>I feel like you're being uncharitable here; I was commenting on \"not leaving much space for things to be worse\" rather than making a specific claim about conflation.<br><br>Edited to add:</p><blockquote><p>I do not see anyone in the comment claiming that he is more than what is described in the post, and in general, I do not see anything pointing at overaction from anybody.</p></blockquote><p>Just want to flag that I agree with this. It still doesn't seem unreasonable to me to proactively make the sort of comment that Jonas made (in fact, I liked the comment a lot). But I also see why you find it odd to do this \"unpromptedly.\"&nbsp;<br><br><strong>2nd edit 24h later: Someone has now </strong><a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=c5r547F2GmqZDgd8H\"><strong>made a comment</strong></a><strong> pointing out how maybe Jonas just got \"charmed.\" The comment stating this hypothesis got lots of upvotes, which is okay/good for balance, but it shows why Jonas's comment was very valuable in the first place. When you ban someone from community spaces for two years, it really is in a lot of people's mind that the person might be antisocial and manipulative. That's the sort of associations this conjures up. It's important to point out how this case is atypical and that there are many reasons to assume that risk of future harm is very low – as others have pointed out with concrete examples/arguments. (Which I also believe to be the case firsthand, so not just based on updating to Jonas, lyra, Emma, etc.)</strong></p>", "parentCommentId": "8GTpjPYHbwf8aeAd5", "user": {"username": "Lukas_Gloor"}}, {"_id": "uHmvrQAKLd4JinxNN", "postedAt": "2024-01-30T13:17:56.396Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p><strong>Executive summary:</strong> An independent investigation into sexual misconduct allegations against Owen Cotton-Barratt found multiple instances of inappropriate behavior. EV boards have banned Owen from activities for 2 years and mandated misconduct training, while also directing Community Health to reform policies.</p><p><strong>Key points:</strong></p><ol><li>Owen expressed unwanted romantic/sexual interest towards younger, less influential women on multiple occasions.</li><li>His actions caused substantial, foreseeable harm that is unacceptable.</li><li>Owen is banned from EV activities for 2 years and must appeal to participate thereafter.</li><li>Community Health made mistakes in handling allegations against Owen.</li><li>Community Health lacked sufficient policies and oversight; boards have mandated reforms.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "P4wFLGcNXSALNA6ca", "postedAt": "2024-01-30T16:11:03.309Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think it would be net negative, in the \"What is your community doing to prevent sexual misconduct? - Oh, we make bets about it\" kind of way.</p>\n", "parentCommentId": "MwktbExmYJgPqibhd", "user": {"username": "Guy Raveh"}}, {"_id": "3kEXCeYraTAhKyriJ", "postedAt": "2024-01-30T16:24:28.422Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Have you considered blinded case work / decision making?\nLike one person collects the key information annonomises it and then someone else decides the appropriate responce without knowing the names / orgs of the people involved.</p>\n<p>Could be good for avoiding some CoIs. Has worked for me in the past for similar situations.</p>\n", "parentCommentId": "7PWAHGveSjyHtqSjG", "user": {"username": "weeatquince"}}, {"_id": "h93QzsJE8n6bPCy7S", "postedAt": "2024-01-30T16:58:34.685Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>This. It's awful from a reputational perspective</p><p>But also there seems to be a total lack of upside. Reported sexual misconduct is not the same as actual sexual misconduct (generally it significantly undercounts) so there's no real indication whether an apparent improvement in the number represents perceptions of improved behaviour or worsened reporting process. Pretty much all the incentives on either side of the bet are perverse (people with relevant knowledge can earn from suppressing information or breaching confidences, and people can earn money from there being lots of sexual harassment or perhaps even buy looser safeguarding policy!), particularly as I can't imagine it being a liquid market lots of people uninvolved in sexual harassment cases want to bet on.&nbsp;</p>", "parentCommentId": "P4wFLGcNXSALNA6ca", "user": {"username": "David T"}}, {"_id": "Dte9n6MB4LywzatcQ", "postedAt": "2024-01-30T17:14:40.087Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think your right that it would be very bad reputationally if the community as a whole was widely perceived as doing this. But it's also a bit easier to say that if you also believe that this is actually a bad, or at least useless, thing to do on it's own merits. If you don't think that, it seems a bit sleazy (even if perhaps correct) to reason 'this would actually help improve how we deal with sexual misconduct, but we shouldn't do it because it'll make us look bad'. &nbsp;Of course, the fact that something looks bad is evidence it IS bad, even if it seem good to you, but not always definitive evidence. Personally I don't think it would be &nbsp;useful, but I'm not sure how much someone making a Manifold market would actually cause outside people to perceive this as something \"EAs\" do, or even that they would notice the market at all.&nbsp;</p>", "parentCommentId": "P4wFLGcNXSALNA6ca", "user": {"username": "Dr. David Mathers"}}, {"_id": "5FPsSpk7YJT6oCJJu", "postedAt": "2024-01-30T17:19:27.594Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>(Fwiw, the Forum moderation team does this for many of our cases.)</p>", "parentCommentId": "3kEXCeYraTAhKyriJ", "user": {"username": "Will Aldred"}}, {"_id": "a6bFqDJsnvdefYdfp", "postedAt": "2024-01-30T18:32:23.831Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I haven't disagree voted this. I'm the #1 trader on Manifold. I doubt prediction markets will be useful here. In fact, I think I could probably use prediction markets to \"screw with people\". For example \"watch out for X, Manifold thinks there is a 15% chance that they have a sexual assault charge in the next year\".</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "MarcusAbramovitch"}}, {"_id": "xKF2PMaLPYWJv2Q2t", "postedAt": "2024-01-30T18:41:14.704Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Yes I wasn't sure it was a good idea. Anecdotally, I forecasted a question on VC funding to female founders. My forecast was negative and accurate and I was surprised of how well most other forecasters thought things were going for female founders. The process of forecasting also forced me to think through the factors preventing more female founders from getting more funding which I found educational. But perhaps my experience doesn't translate well. That said I think most negative reactions to my idea was mostly me hijacking this post which I think is fair criticism and some people seemed to think it might be worthwhile.</p>\n<p>I agree it would not be good if predictions are made about people - that seems really bad a bit like black mirror!</p>\n", "parentCommentId": "a6bFqDJsnvdefYdfp", "user": {"username": "Ulrik Horn"}}, {"_id": "E9CmT7vTFufqDcDno", "postedAt": "2024-01-30T19:34:41.365Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks — yes, we've done this in some cases.</p>", "parentCommentId": "3kEXCeYraTAhKyriJ", "user": {"username": "Julia_Wise"}}, {"_id": "8v4PbtxCzpc45GZZe", "postedAt": "2024-01-30T20:36:12.552Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p><i>Edit to add: I edited my original comment to hopefully address these misunderstandings</i><br><br>Yep - indeed - I assumed it's obvious to everyone that it's a bad idea to make [things that are perceived as] unwanted romantic or sexual advances towards people, and that serious action should be taken if someone receives repeated complaints about that.&nbsp;<br><br>The intentions of my comment were to give information that might be helpful + informative for people deciding how to best achieve a goal of something like \"make the community safe and welcoming for people in general, and especially for underrepresented, vulnerable, or easy-to-make-feel-unwelcome groups\". As a potential member of such a group, I was assuming my experiences are at least somewhat relevant.<br><br>Similar to comments by Emma and Jonas, I want to prevent people taking away what I would consider a misleading picture of Owen's behavior, because I think people having a misleading picture will make it harder to achieve the goal.<br><br>I think people might read from this post that it matches a pattern of predatory or nefarious behavior - which definitely does exist, and which I think should be handled very aggressively by removing people from the community, which I have advocated in other cases. &nbsp;Whereas, I think the pattern in this case is social clumsiness, some misunderstandings, and some psychological hangups around scrupulosity and needing to confess attraction and receive moral validation. I think the latter pattern of behavior should be handled differently than the former, and I think it's very important information for people to know when deciding e.g. how likely Owen is to cause similar problems in the future, whether or in what way they personally want to interact with Owen, whether to ban him from particular spaces, what interventions could be undertaken to prevent problems like this from occurring, or what information they should take away from this situation as to what their response should be to someone who <i>is</i> displaying predatory behavior.&nbsp;<br><br>&nbsp;I continue to think that decisions whether to ban people from shared spaces should at least <i>consider</i> what their <i>net</i> effect was. I think that excluding Owen from the community in the past would have made it less welcoming for me and even specifically would have made me more vulnerable to harm from some situations that <i>were</i> more sinister. There was a particular episode (related to people who are no longer part of the community) where I was in a situation which was pressuring and manipulative and had weird power dynamics, and Owen's support and advice was helpful for me keeping my sanity and perspective and avoiding getting sucked in.&nbsp;<br><br>Obviously my experiences don't erase the negative experiences other people had, and the algorithm of \"ignore complaints of bad behavior if someone else says the person seems nice\" is not a good one. But \"get information from multiple sources to understand what overall pattern of behavior things were part of, and what the net effect on the community was\" seems like a better algorithm than \"consider only evidence about the worst things people did\".</p>", "parentCommentId": "9LDiG4psPeDrn64La", "user": {"username": "lyra"}}, {"_id": "bcueDtS2fnXyKmzSL", "postedAt": "2024-01-30T20:57:37.858Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Presumably there is some level of [mildness / accidentalness of misconduct ] and [strength of response] at which the correct community response <i>is</i> to say \"that response seems a bit too strong for the level of misconduct\" - do you disagree? &nbsp;If that's the case I don't think it's that helpful to claim that it's generically bad to ever say that you think a response is too strong - it has to depend on the specifics of a case.</p>", "parentCommentId": "wD44sbmtegKyckNBL", "user": {"username": "lyra"}}, {"_id": "6qdeTFkGyqocbYnoL", "postedAt": "2024-01-30T22:28:05.686Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I certainly <em>also</em> think it'd be useless, like most prediction markets in EA.</p>\n", "parentCommentId": "Dte9n6MB4LywzatcQ", "user": {"username": "Guy Raveh"}}, {"_id": "ZfXBmsBoyuR8cZynj", "postedAt": "2024-01-31T05:38:20.231Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Yeah, I think there's a lot more to be said about this topic, and I'm glad that your said some of it - thanks!</p>\n", "parentCommentId": "t6GAfybgDs8gaGG7f", "user": {"username": "Jonas Vollmer"}}, {"_id": "c5r547F2GmqZDgd8H", "postedAt": "2024-01-31T07:07:51.978Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think what Jonas has written is reasonable, and I appreciate all the work he did to put in proper caveats. I also don’t want to pick on Owen in particular here; I don’t know anything besides what has been publicly said, and some positive interactions I had with him years ago. That said: I think the fact that this comment is so highly upvoted indicates a systemic error, and I want to talk about that.</p><p>The evidence Jonas provides is equally consistent with “Owen has a flaw he has healed” and “Owen is a skilled manipulator who charms men, and harasses women”. And if women (such as myself) report he never harassed them, that’s still consistent with him being a serial predator who’s good at picking targets. I’m not arguing the latter is true- I’m arguing that Jonas’s comment is not evidence either way, and its 100+ karma count has me worried people think it is. &nbsp;There was a similar problem with the supportive comments around Nonlinear from people who had not been in subservient positions while living with the founders, although those were not very highly upvoted.</p><p>“If every compliment is equally strong evidence for innocence and skill at manipulation, doesn’t that leave people with no way to prove innocence, or in this case improvement?” Yes, it is very hard to prove a negative, or that you’ve genuinely improved instead of merely hiding things better. I don’t know what the right way to handle that is, although I can point to a few things I think would have made Jonas’s comment more valuable.</p><p>As written, this comment contains only Jonas’s interpretations (and appropriate caveats- still really appreciate those). Those are valuable to the extent people have informed trust in Jonas in particular. But if he had shared specifics, people have a chance to evaluate themselves. This could include things Owen had said or done, or what Jonas hopes to gain from Owen’s return. I also think providing unrelated positives is good for contextualizing people; it has to be done carefully to avoid presenting it as a counterargument, but I think Jonas could pull it off.&nbsp;</p>", "parentCommentId": "NWpk6vizkQuNEQG7q", "user": {"username": "Elizabeth"}}, {"_id": "rzYvnLYxi4HqtFPvL", "postedAt": "2024-01-31T07:13:37.985Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Those all seem like good changes, but they also feel like what <a href=\"https://forum.effectivealtruism.org/posts/BNKBJs4RJsA8FtdWE/a-personal-reflection-on-sbf?commentId=mAGp6DnRyATyPbQhF\">Nate Soares described</a> as \"I wish I had bet on 23\" errors. What could have been done to help the team notice things needed to be handled differently, before such a costly failure?&nbsp;</p>", "parentCommentId": "xN9ix3Xy6zzwKuQME", "user": {"username": "Elizabeth"}}, {"_id": "SrFuQXEjTeNnww4Ea", "postedAt": "2024-01-31T08:43:39.298Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote>\n<p>We’ve also included some detail about the process in an appendix below.</p>\n</blockquote>\n<p>The Google doc isn’t set to be publicly available.</p>\n", "parentCommentId": null, "user": {"username": "iamasockpuppet"}}, {"_id": "sc7YQxE8NP22ptmxw", "postedAt": "2024-01-31T09:50:02.113Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>The evidence Jonas provides is equally consistent with “Owen has a flaw he has healed” and “Owen is a skilled manipulator who charms men, and harasses women”.</p></blockquote><p>Surely there are a lot of other hypotheses as well, and Jonas's evidence is relevant to updating on those?</p><p>More broadly, I don't think there's any obvious systemic error going on here. Someone who knows the person reasonably well, giving a model for what the causes of the behavior were, that makes predictions about future instances, clearly seems like evidence one should take into account.</p><p>(I do agree the comment would be more compelling with more object-level details, but I don't think that makes it a systemic error to be happy with the comment that exists.)</p>", "parentCommentId": "c5r547F2GmqZDgd8H", "user": {"username": "rohinmshah"}}, {"_id": "GJkWLfoZQQLTTwqf4", "postedAt": "2024-01-31T10:03:35.847Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>There's been some complaints from a banned EA Forum user that the timing of this post, and the timing of comments that bolster the character of Owen, have been coordinated. Whilst I think it's unlikely this is the case, I would love to see the following:&nbsp;<br><br>- Confirmation from OP (<a href=\"https://forum.effectivealtruism.org/users/ev-uk-board?mention=user\">@EV UK Board</a>) that Owen was not given advanced warning on the posting of this report. Or if he was, some discussion around the potential issues with doing so.&nbsp;<br><br>- Some further discussion in the EA Forum team, and perhaps rules set, on coordinated posting (AKA \"brigading\").&nbsp;</p>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "75hP74suvkwYiBDiJ", "postedAt": "2024-01-31T10:07:02.084Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Why would it be bad if he was given advance warning about this report? There's nothing in here about him being retaliatory. It seems probably good to hear the other side and be given a chance to look at the post before it goes live.&nbsp;</p><p>Also, it does say in the document that Owen was given advanced notice. His document says that he saw the draft and disagreed with aspects of it that they didn't address in the post.&nbsp;</p>", "parentCommentId": "GJkWLfoZQQLTTwqf4", "user": {"username": "katherinesavoie"}}, {"_id": "cQaMpRDuCmgMsHFrE", "postedAt": "2024-01-31T10:18:05.484Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>Why would it be bad if he was given advance warning about this report?</p></blockquote><p><br>Some people - &nbsp;to be completely frank, like yourself - will use advanced notice to schedule their friends, fans and colleagues to write defensive comments. A high concentration of these types of comments can distort the quality of the conversation. This is commonly referred to as <a href=\"https://en.wikipedia.org/wiki/Vote_brigading\">brigading</a>.&nbsp;<br><br>This strategy is so effective, that foreign governments have setup \"troll-farms\", and companies have setup \"astroturfing\" operations to benefit from degrading the quality of certain conversations on the internet. &nbsp;</p><blockquote><p>Also, it does say in the document that Owen was given advanced notice. His document says that he saw the draft and disagreed with aspects of it that they didn't address in the post.&nbsp;</p></blockquote><p>I would create a distinction between giving someone a read of a draft ahead of time, and actively communicating the date and time something is posted.&nbsp;<br><br>Edit: Added third paragraph, changed wording on first sentence of second paragraph.&nbsp;</p>", "parentCommentId": "75hP74suvkwYiBDiJ", "user": {"username": "ElliotJDavies"}}, {"_id": "8DkKnvSv3yLxqq83s", "postedAt": "2024-01-31T10:29:50.967Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Astroturfing and troll farms are different from friends and people on your side saying their opinion. Astroturfing is when it's people or fake people saying things they don't actually believe in exchange for pay.&nbsp;</p><p>Are you saying you're against people being allowed to tell their friends and supporters about something they consider to be unethical and encouraging them to vote and comment according to their conscience?</p>", "parentCommentId": "cQaMpRDuCmgMsHFrE", "user": {"username": "katherinesavoie"}}, {"_id": "TytQvFvDGLX3ptWJF", "postedAt": "2024-01-31T10:41:38.206Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>Astroturfing and troll farms are different from friends and people on your side saying their opinion</p></blockquote><p>This is correct. What I am talking about is <a href=\"https://en.wikipedia.org/wiki/Vote_brigading\">brigading</a>.&nbsp;<br><br>Astroturfing and troll farms are only similar in <strong>the mechanism</strong> behind their ability to distort public opinion. That mechanism is: People are influenced by the tone and volume of comments they read.</p><blockquote><p>Are you saying you're against people being allowed to tell their friends and supporters about something they consider to be unethical and encouraging them to vote and comment according to their conscience?</p></blockquote><p>Yes, this is brigading. There are things you can do mitigate this brigading effect, for example: (1) &nbsp;Begin comments with \"<i>I am here from ..</i>.\" or \"<i>This post was shared by...</i>\". (2) Commenters acknowledge, when asked, that the post was shared with them.<br><br>Take your case (i.e. Ben Pace's post on nonlinear), neither (1) or (2) was done. In fact, I found myself needing to comment alluding to this effect, after I confirmed this was the case with one of your collaborators.&nbsp;</p>", "parentCommentId": "8DkKnvSv3yLxqq83s", "user": {"username": "ElliotJDavies"}}, {"_id": "oDEWP3wG3xFphLgqF", "postedAt": "2024-01-31T10:44:49.121Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>OK, that seems more reasonable. Not sure I agree, but at least this seems doable. Before it just seemed like you were saying that people shouldn't be allowed to share a post with friends and say to vote and comment according to their conscience.&nbsp;</p><p>This is food for thought. I will think about it and may update my policy.&nbsp;</p>", "parentCommentId": "TytQvFvDGLX3ptWJF", "user": {"username": "katherinesavoie"}}, {"_id": "wFFydHoJiBtHe9gAm", "postedAt": "2024-01-31T10:46:05.102Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/ev-us-board?mention=user\">@EV US Board</a> <a href=\"https://forum.effectivealtruism.org/users/ev-uk-board?mention=user\">@EV UK Board</a> could you include <a href=\"https://docs.google.com/document/d/1AoRnwe0vemYN5xzpB815cG4H8XuJVqG-7i0JzZpICRg/edit \">Owen's response document</a> somewhere in the post? It contains a lot of important information and it's getting lost in the comments.&nbsp;</p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "cQrW42ihsdKSGzDkC", "postedAt": "2024-01-31T11:41:38.791Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>This happens often when users copy-paste from Google Docs to the EA Forum; it's usually meant to link to a section of the post, in this case the <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health#Appendix__Investigative_process\">Appendix</a></p>", "parentCommentId": "SrFuQXEjTeNnww4Ea", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "MpcExGnaSaL8cKoNB", "postedAt": "2024-01-31T12:23:56.972Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Not sure if everyone does it this way, but I find agree/disagree votes more important for what you're saying than merely upvotes. In cases like this, I would use agree/disagree votes if I know a lot about either Owen directly, or about Jonas's judgment in situations like this.* Even though it's technically anonymous, I think of agree/disagree votes in situations like this as \"staking a small part of my own reputation on the claims in the comment.\" I'd use upvotes more liberally and upvote things that sound potentially important or insightful even if I'm still unsure about them.</p>\n<p>*I guess a third case is if I think a comment uses weird reasoning that makes me think the person who wrote it has bad people judgment, I could also see myself disagree-voting it from a distance/without any more direct knowledge.</p>\n", "parentCommentId": "c5r547F2GmqZDgd8H", "user": {"username": "Lukas_Gloor"}}, {"_id": "DprgFkEifMqHgLPyu", "postedAt": "2024-01-31T15:08:19.329Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>I'm hoping I can confirm my identity to the EA forum team and they can attest that the factual claims about my demographics and interactions with Owen are correct.</p></blockquote><p><br>I'm not on the EA Forum team, but I have strong reason to believe (&gt;95%) that lyra is indeed someone who had \"many interactions with Owen, since 2015 or so, originally as a much younger (late teens), new-to-EA, and female person\".</p><p>If you want, feel free to send me a message from a non-anonymous account to confirm your identity and your interactions with Owen.</p>", "parentCommentId": "DRX9vHqppmAttqhG7", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "S5Ndego9e2i3WjfAJ", "postedAt": "2024-01-31T15:43:35.803Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>There seems to be two main accusations here:</p><ol><li>“Owen expressed sexual and / or romantic interest in women who were younger and less influential than he was.”</li><li>“In at least one case, Owen did not stop making repeated unwanted attempts at contact after being asked to do so”</li></ol><p>I’ll address 1 here and 2 in another comment.&nbsp;</p><p>For 1, why is expressing romantic or sexual interest unethical? Why is this worthy of a two-year ban?&nbsp;</p><p>I imagine that the power difference is an important thing to the OP. I imagine, given that this is a common argument, that it’s because they felt uncomfortable saying no because he was powerful and if they said no, he could then harm them with his power.&nbsp;</p><p>I’d first like to say that this particular dynamic, let’s call it the Scorned Powerful Lover dynamic, totally does happen, and we should figure out ways to prevent it.&nbsp;</p><p>However, never expressing romantic or sexual interest if there’s a power difference seems like a poor solution. Lots of people would like to date somebody who has more power than them (e.g. wouldn’t it have been horrible for the world if Cari Tuna and Dustin Moskovitz or Bill and Melinda Gates couldn’t have dated because there was a power difference?).&nbsp;</p><p>Also, it will lead to essentially classism. Lower power people are going to be scared to ask the higher power person out because of exactly the same fears. Higher power people can’t ask people out for the above described reasons. This will then lead to not being able to date outside of your class. Poor people can’t date rich people. Less successful people can’t date more successful people. This seems bad.&nbsp;</p><p>I don’t know the particular solution, but the current solution of banning people who’ve asked out somebody with less power and didn’t exhibit any Scorned Powerful Lover dynamics seems suboptimal. I think we can find something better.</p><p>Especially given that in this particular case, nobody is claiming that Owen was retaliatory. So that’s direct evidence that he didn’t do the Scorned Powerful Lover dynamic, so there was nothing bad, consequentially, that happened.&nbsp;</p><p>I’ll write another argument about this in a separate comment so people can vote on particular arguments instead of the whole package. I wrote other reasons for believing that expressing romantic interest is not unethical, even if there's a power difference, <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=EXbg5DJK7aTbmJgS5\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=cDiu8cNvXkQrtpvqn\">here</a></p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "EXbg5DJK7aTbmJgS5", "postedAt": "2024-01-31T15:44:36.742Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Another consequentialist argument for it not being unethical to express romantic/sexual interest in somebody, even if there’s a power difference: it’s always uncomfortable to reject a guy.&nbsp;</p><p>It seems like a lot of the argument relies on the idea that the women were upset or felt uncomfortable when he expressed interest. See “Multiple women expressed being upset by Owen’s advances.”</p><p>Speaking as a woman who’s had to turn down many guys in my time and as somebody who’s more comfortable saying no than probably 99% of women, I can assure you - it’s always upsetting to reject somebody’s advances.&nbsp;</p><p>At least for me, there’s always the compassion, thinking that I’m hurting their feelings. I’m also worried that it might make our friendship weird in the future (which sometimes does happen but usually doesn’t). Many people are worried that the guy will respond with hostility, which is never fun. And tons of people find it really uncomfortable to say no in general.&nbsp;</p><p>So using as an argument that they felt upset rejecting his advances would mean that anybody who’s ever asked somebody out and been rejected has behaved unethically and should be exiled from EV events for 2 years. This proves too much.&nbsp;</p><p>We can feel compassion for people who feel upset rejecting advances, but that doesn’t mean that then we should just stop all advances, unless we’re absolutely certain they’re reciprocated (which is impossible). This is a standard that, if equally applied, would mean that virtually no EA men could attend EAGs.&nbsp;</p><p>This addresses just one argument against just one accusation. I cover other aspects of the accusations and other counterarguments <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=S5Ndego9e2i3WjfAJ\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=cDiu8cNvXkQrtpvqn\">here</a></p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "cDiu8cNvXkQrtpvqn", "postedAt": "2024-01-31T15:46:38.461Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>In at least one case, Owen did not stop making repeated unwanted attempts at contact after being asked to do so[2].</p></blockquote><p>I’m surprised and confused as to why the EV Board did not include that Owen says that he has written evidence showing that this isn’t true. (See the&nbsp;<a href=\"https://docs.google.com/document/d/1AoRnwe0vemYN5xzpB815cG4H8XuJVqG-7i0JzZpICRg/edit\"><u>“On feedback” section here</u></a>)</p><p>Did the investigators look at the evidence and disagree that the evidence was exculpatory? Or did they not look at the evidence at all and just post anyways, despite Owen telling them he had evidence (<a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went\"><u>great article here about why this is suboptimal</u></a>)?&nbsp;</p><p>Given that Owen has been more than forthcoming about everything so far, so it’s unlikely he’s hiding anything, and he says he has written evidence to the contrary, I am inclined to believe that this accusation is false or misleading until I get more evidence to the contrary.&nbsp;</p><p>I would appreciate if <a href=\"https://forum.effectivealtruism.org/users/ev-uk-board?mention=user\">@EV UK Board</a> <a href=\"https://forum.effectivealtruism.org/users/ev-us-board?mention=user\">@EV US Board</a> &nbsp;shared more information about what they did in this case, since it seems like a very cruxy accusation.&nbsp;</p><p>If the only thing he did was express romantic interest in people who weren’t as influential as him, I think that is a&nbsp;<i>much</i> less bad thing (even not bad at all), and the 2 year banishment seems unwarranted.&nbsp;</p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "4yaRY2Hc3rKA9DNNs", "postedAt": "2024-01-31T17:12:24.158Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I don't think \"only thing he did was express romantic interest in people who weren’t as influential as him\" would be a full characterization of the factual findings here. For example, the Boards found that the \"frequency and the content of the advances contributed to the women’s feelings.\" That's still vague, but it's more than merely expressing interest across a power/influence gradient. There's a finding concerning inconsistent recognition (and thus, management) of conflicts of interest. There's an implied finding that the circumstances of some expressions of interest were inappropriate: \"it was difficult for the women to avoid interacting with Owen while the inappropriate actions were taking place, e.g. with a woman staying at Owen’s house.\"</p><p>More generally: The Boards' post lists their findings of fact at a fairly high level. The post clearly states that it is not a \"shared perspective\" document and that involved persons may disagree with some of the conclusions. There's a footnote indicating that Owen doesn't seem to agree with the factual finding you identified.</p><p>I think that's enough here. It's almost inevitable that factual findings in a matter like this will rely in significant part on information obtained in confidence and on reasoning that is not publicly disclosed. The Boards' primary responsibility here was to take action necessary to protect the EVFs' interests and those of involved members of the public. In my view, it would be inappropriate for the Boards to give less weight to information or reasoning merely because it could not be publicly disclosed. Given that, a disconnect between the presented rationale and the strength of the action is not terribly surprising.</p><p>Of course, the Boards are not trial courts for the EA community, and it would be reasonable to consider the relatively low reasoning transparency when deciding whether / how much to update, what to do in your own non-EVF organization, etc.</p><p>Furthermore, presenting evidence and reasoning favorable to Owen could make the post imbalanced if the information to which the Boards assigned greater weight could not be disclosed because of confidentiality commitments, concerns about losing legal privilege over the investigative report, etc. For example, some of the incidents involved people with formal power differentials; saying much more about those matters would likely pose a serious risk of identifying the individuals. I think giving Owen advance notice of the post's contents and noting that he may wish to make a response was a reasonable approach here.</p>", "parentCommentId": "cDiu8cNvXkQrtpvqn", "user": {"username": "Jason"}}, {"_id": "AJE4YZLp2uRf6BmKG", "postedAt": "2024-01-31T17:25:36.547Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>So using as an argument that they felt upset rejecting his advances would mean that anybody who’s ever asked somebody out and been rejected has behaved unethically and should be exiled from EV events for 2 years. This proves too much.&nbsp;</p></blockquote><p>The women pointed to specific factors that were relevant to being upset: the specific content and frequency of the advances. The Boards also found that some of the advances were made under circumstances where it was \"difficult for the women to avoid interacting with Owen while the inappropriate actions were taking place.\"&nbsp;</p><p>I think the volume of complaints is also relevant here. Presumably, the [EDIT: individual(s)] who went to Community Health with concerns are not doing so every time -- or even a significant portion of the time -- someone in EA expresses romantic/sexual interest in them. Nor is CH likely to learn of romantic/sexual advances in EA that are anywhere near the baseline level of upsetness that is inherent to declining an advance. That suggests there was something about Owen's advances that was particularly upsetting to a number of the recipients of those advances. Although a single recipient concluding that an advance warranted CH involvement might not itself be evidence of inappropriate behavior, the existence of a number of similar reports [EDIT: would be] a much stronger indication that something more than baseline upsetness with turning down advances was at play here.</p><p>Thus, I don't think the quoted statement is an appropriate inference from the Boards' action.</p>", "parentCommentId": "EXbg5DJK7aTbmJgS5", "user": {"username": "Jason"}}, {"_id": "joSeqqYH7AajeomSP", "postedAt": "2024-01-31T17:40:40.404Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I view power differentials, workplace dating, etc., as something that's risky/delicate, but it can be fine if done carefully. Even if something goes poorly in one instance, it doesn't necessarily mean that a person did something immoral.</p><p>However, when there's a pattern of several people complaining, that's indicative of some kind of problem.</p><p>It means likely that either a person was particularly likely to make people really uncomfortable with their advances when they made them, or that the person made a ton of advances in professional contexts (and a small portion of them left people unusually uncomfortable). I think both of these would be bad, for different reasons.&nbsp;<br><br>(Why is bad to make tons of careful advances? I feel like it's bad because it reflects not taking seriously the view that one's prior should be against it being a good idea, especially if your professional context is about having impact rather than a means for getting romance or sex.)</p>", "parentCommentId": "S5Ndego9e2i3WjfAJ", "user": {"username": "Lukas_Gloor"}}, {"_id": "Q6XFX8drKqvuHuEr4", "postedAt": "2024-01-31T18:48:51.442Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote>\n<p>“Owen expressed sexual and / or romantic interest in women who were younger and less influential than he was.”</p>\n</blockquote>\n<p>That seems like it's missing important components?  Going back to where this originally became public in the <a href=\"https://time.com/6252617/effective-altruism-sexual-harassment/\">Time Magazine article</a>:</p>\n<blockquote>\n<p>A third described an unsettling experience with an influential figure [1] in EA whose role included picking out promising students and funneling them towards highly coveted jobs. After that leader arranged for her to be flown to the U.K. for a job interview, she recalls being surprised to discover that she was expected to stay in his home, not a hotel. When she arrived, she says, “he told me he needed to masturbate before seeing me.”</p>\n</blockquote>\n<p>In this case, going just on the claim in the article, it's not just that the woman was younger and less influential, but also that the job she was interviewing for put her up at Owen's house.</p>\n<p>[1] Confirmed in the <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=vjtEvaxDHFvfTXwBF\">EV UK board statement on Owen's resignation</a> to be referring to Owen.</p>\n<p>(Disclosure: married to Julia Wise.)</p>\n", "parentCommentId": "S5Ndego9e2i3WjfAJ", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ejMXZGrxcv9rzu3fA", "postedAt": "2024-01-31T21:03:09.311Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p><strong>It's important to point out how this case is atypical</strong></p></blockquote><p>&nbsp;</p><p>I want to distinguish between \"he is not the kind of deliberate predator you typically think of when you hear about sexual harassment\" and \"he is different than most people who sexually harass others\".</p><p>I think that <strong>\"well-meaning person does damage through neglect rather than malice or deliberate disregard\" is a fairly typical case; maybe more common than deliberate predation</strong>. You can do a lot of damage through neglect alone, especially when you underestimate your power in a situation. &nbsp;So while I think it is very good to push back against the assumption that harm came from deliberate malice, and provide evidence for a given situation, this is almost orthogonal to expectations of future harm.&nbsp;</p>", "parentCommentId": "BQj5YdSXtFqGCfAtm", "user": {"username": "Elizabeth"}}, {"_id": "zNBtJaoHFHXFrEY9t", "postedAt": "2024-01-31T21:30:14.203Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I agree with those points and they seem important.</p><p>I didn't write this further above, but thinking about it now, I think there was also another dimension that fed into me thinking of this case as \"atypical.\" (But maybe this isn't the best wording and these things are more typical than we think, but what I'm trying to gesture at is \"the sort of thing that has high chances of getting fixed.\") In any case, when I think of cases of \"harm through neglect,\" where someone isn't ill-intentioned but still has a pattern of making others uncomfortable, some cases that come to mind are with people who are kind of hopeless and their personality and psychology seems tragic and like they are unlikely to improve without excessive amount of supervision/handholding and fix all the stuff that is at risk of causing harm in different ways. Importantly, Owen very much doesn't seem to me like that either.* So, <i>according to my interpretation and guesses</i>, there is indeed less potential for future harm than in many other conceivable cases where someone e.g., received a two-year ban for making people uncomfortable.&nbsp;<br><br>It's good that you made this point because I agree we shouldn't place too much importance on the \"intentional harm vs unintentional harm\" distinction. Instead, I think what matters if people overall have a prosocially-oriented and corrigible cognition.&nbsp;</p><p>*That said, I acknowledge that Owen needed more than just the initial pointer from the first time he was approached by Community Health, so I'm not saying this is the most obvious call in the world. It would be a longer topic to elaborate on why I feel confidently optimistic, but people can read for themselves the document he wrote on all of this and see how much (if at all) it makes them feel reassured about steps Owen has taken since then and how much it seems he now has insight into what went wrong and why he did what he did, etc.&nbsp;</p>", "parentCommentId": "ejMXZGrxcv9rzu3fA", "user": {"username": "Lukas_Gloor"}}, {"_id": "qZ3sFfG8Luo9d9h2L", "postedAt": "2024-02-01T04:22:29.850Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>frequency and the content of the advances contributed to the women’s feelings.</p></blockquote><p>If somebody doesn't express disinterest in the romantic interest, why is frequency a problem? There is only one claimed case where a person says he didn't stop when she said no, and he says he has written evidence against that.&nbsp;</p><p>For \"content\", this could be reframed as saying \"don't ask people out in the wrong way\" which seems like a vague and impossible standard. There is no right or wrong way to ask somebody out (of course, I'm sure there are edge cases).&nbsp;</p>", "parentCommentId": "4yaRY2Hc3rKA9DNNs", "user": {"username": "katherinesavoie"}}, {"_id": "axnxdPwjwuuiWhgkd", "postedAt": "2024-02-01T04:23:47.739Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>it was difficult for the women to avoid interacting with Owen while the inappropriate actions were taking place, e.g. with a woman staying at Owen’s house.</p></blockquote><p>Is this cruxy for anybody? If people found out that he'd expressed romantic interest in somebody at his house, would people think that's an bannishable offense?&nbsp;</p>", "parentCommentId": "4yaRY2Hc3rKA9DNNs", "user": {"username": "katherinesavoie"}}, {"_id": "XhHTHfRHLX4WHqgxr", "postedAt": "2024-02-01T04:27:39.700Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>concerning inconsistent recognition (and thus, management) of conflicts of interest</p></blockquote><p>In the same article they say that Julia Wise also did this and had troubles managing conflicts of interest. Should she be banished for 2 years?&nbsp;</p><p>There are plenty of EA leaders who've had this problem (managing COIs is hard and not straightforward!) and they are not being banished.&nbsp;</p><p>It seems that the more likely explanation is that there was a big blow up for EA's reputation with that Time magazine article, and EV is trying to protect themselves by making a public example of somebody.&nbsp;</p>", "parentCommentId": "4yaRY2Hc3rKA9DNNs", "user": {"username": "katherinesavoie"}}, {"_id": "uGWphhEzZaHfeWY3h", "postedAt": "2024-02-01T06:54:42.222Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>I assumed it's obvious to everyone that it's a bad idea to make [things that are perceived as] unwanted romantic or sexual advances towards people, and that serious action should be taken if someone receives repeated complaints about that.</p></blockquote><p><a href=\"https://forum.effectivealtruism.org/users/lyra?mention=user\">@lyra</a> Can you clarify what you mean by this?&nbsp;</p><p>It reads like you're saying that if you ask somebody out and they say no (aka unwanted romantic advances), that this is obviously bad and that serious action should be taken against you? This seems clearly wrong, because it would mean that virtually all people who've ever asked somebody out should have serious actions taken against them.&nbsp;</p><p>Or is it saying only to take serious actions if somebody makes repeated romantic advances despite the person saying they're not interested?&nbsp;</p><p>If the latter, only one anonymous woman claims this happened to her (\"In at least one case, Owen did not stop making repeated unwanted attempts at contact after being asked to do so\") and <a href=\"https://docs.google.com/document/d/1AoRnwe0vemYN5xzpB815cG4H8XuJVqG-7i0JzZpICRg/edit\">Owen says that he has written evidence that this didn't happen</a> (see the \"On feedback\" section).</p><p>Given that he's been very forthcoming about everything else, so doesn't seem to be hiding anything, that he says he has written evidence to the contrary, and it seems to go against most people who know him's priors, I'm inclined to believe him until further evidence is provided.&nbsp;</p>", "parentCommentId": "8v4PbtxCzpc45GZZe", "user": {"username": "katherinesavoie"}}, {"_id": "nLE8nT5u9FcCT9bcn", "postedAt": "2024-02-01T08:09:50.964Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Owen says in his <a href=\"https://docs.google.com/document/d/1AoRnwe0vemYN5xzpB815cG4H8XuJVqG-7i0JzZpICRg/edit\">response</a></p><blockquote><p>My understanding is that I always followed the letter of policy on when to recuse.&nbsp;</p></blockquote><p>I'm curious to hear whether the OP disagree with this. Do they think that he broke the rules on conflict of interest? Or do they think that he did indeed follow the rules, but there were some instances where there were unspoken rules or hard to make judgment calls that he didn't realize?&nbsp;</p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "WqrSctYE7ydoNN9uK", "postedAt": "2024-02-01T08:55:26.244Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I would like to recognize that I have a lot of empathy for the EV board. I think that no matter what decision they made, they would get criticized. That's a really hard position to be in and I hope that their friends are reaching out to them and sending them comfort and funny gifs.&nbsp;</p><p>I personally don't hold anything against them, because I think it's really hard to do things like this and ethics is complicated and fundamentally unsolved.&nbsp;</p><p>I hope they can find some solace in this situation: if people are going to critcize you no matter what you do, you can simply make the decision you think is right instead of trying to please the public, which are fundamentally unpleasable, because there's too many of us. &nbsp;</p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "n6jpuGJfXEAmxHPos", "postedAt": "2024-02-01T08:57:27.937Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>If you combine someone frequently expressing sexual/romantic interest in you when there's a power differential, that is a problem. It might mean, especially when the person who's doing that is your boss/mentor/someone more senior than you, that you don't feel like you can (clearly) refuse. When this is a situation involving a junior woman and a senior man, social behavior patterns of women being afraid of telling someone \"no\" often make this worse.<br><br>Even if both people are interested in each other, the way they relate to each other in an organization should ideally be changed to reduce the power differential. This is a standard procedure in some countries, e.g. Israel.</p>", "parentCommentId": "qZ3sFfG8Luo9d9h2L", "user": {"username": "Milena Canzler"}}, {"_id": "Wqzv4mLj2iJdhZRqf", "postedAt": "2024-02-01T09:00:53.034Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Yes, in this specific context it's a crux for me. If someone hosted a new person of the community at their house in a foreign country, and then made sexual advances at them, I'd not want that person to host newcomers/foreigners again.&nbsp;<br>Edit: I'm writing in personal capacity here, this is not a statement by EA Germany.&nbsp;</p>", "parentCommentId": "axnxdPwjwuuiWhgkd", "user": {"username": "Milena Canzler"}}, {"_id": "5u8dq72eyKKwe8if7", "postedAt": "2024-02-01T09:22:47.699Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>OK. Does it make a difference that the only instance where we have public details, Owen wasn't making sexual advances in his house? He just mentioned, to a friend where they were both doing radical honesty with each other, inspired by circling, that he was going to masturbate that day. When she wasn't in the house. Not masturbating <i>about</i> her or anything. Just that he'd do what the vast majority of guys do every day.&nbsp;</p><p>She was a friend, not a colleague. He wasn't doing professional connecting people with jobs or anything like that. He only started that role later.&nbsp;</p><p>It's a weird thing to say in most contexts, but if you're friends and have mutually agreed radical honesty, it seems fine. It would be like attending a circling event (where radical honesty is expected). As long as people are choosing to do it, then they're adults and can do what they want.&nbsp;</p><p>Now, it's unclear whether he also expressed romantic interest in others while at his house, and it's also unclear whether such people were working for/with him or were visting his house as a friend, etc.&nbsp;</p>", "parentCommentId": "Wqzv4mLj2iJdhZRqf", "user": {"username": "katherinesavoie"}}, {"_id": "ttEC76vE9BYYDn9fX", "postedAt": "2024-02-01T09:32:19.536Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Edit: I wrote the following without consulting with my team, in private manner only. This does not represent the position or views of EA Germany, nor is it intended as an official statement.<br><br>Thanks to the EV boards for deciding to publish this.&nbsp;<br><br>As someone who's directly supported several people right after, and in the months after other sexual misconduct situations, I want to support <a href=\"https://forum.effectivealtruism.org/users/vaipan?mention=user\">@Vaipan</a>'s sentiment. The comments defending Owen Cotton-Barratt's character are clearly well-intentioned and not meant to harm those women who remain silent and anonymous. Although they are not meant that way, the comments might hurt those women and discourage others in similar positions to come forward. Reactions like these are part of the reason why victims of abuse and assault remain silent, they are perceived as reminders that the perpetrator matters more than the victim(s). Depending on he severity of the harm caused, they might cause <a href=\"https://www.onlinemswprograms.com/resources/how-to-be-mindful-re-traumatization/\">retraumatization</a> by giving the impression that everyone is supporting the person in power and not caring about the people harmed.<br><br>I don't think there's an easy fix for that: Owen Cotton-Barratt is not anonymous, and a prominent figure (at least in the UK community). As such, people will want to give their personal testimony of what threat he might pose or not. The women who reported him remain anonymous - no one will come to defend their character or great deeds for the community, since no one knows who they are.&nbsp;[To make this clear: they should remain anonymous for as long as they wish.]<br>This pattern also happens in a context of similar reactions that people grow up with (e.g. media coverage of sexual assault cases). So while the comments in this case might not want to defend Owen's actions, they are still easily perceived as hitting the same note.&nbsp;<br><br>&nbsp;[I previously suggested some ways to comment here, but deleted them after further discussion with others. I just wish we wouldn't forget the victims so often.]</p>", "parentCommentId": null, "user": {"username": "Milena Canzler"}}, {"_id": "6zFJbbDyfhy9hgGch", "postedAt": "2024-02-01T09:47:28.560Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I'm confused. Why would people be afraid to come forward? Owen is being banned, was forced to resign, and many other punishments. One of the women who spoke to the Time journalist got a ton of karma for writing about it.&nbsp;</p><p>Even the peope saying he's a good guy in the comments are saying what he did was still unethical (I disagree, but I'm not saying he's a good guy. I don't know him. I just disagree with the ethical framework of this whole thing).&nbsp;</p><p>EA does not seem to have an under-reporting problem for issues.&nbsp;</p>", "parentCommentId": "ttEC76vE9BYYDn9fX", "user": {"username": "katherinesavoie"}}, {"_id": "B9wEwenKt8RgDbdFH", "postedAt": "2024-02-01T09:59:25.073Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>It might mean, especially when the person who's doing that is your boss/mentor/someone more senior than you, that you don't feel like you can (clearly) refuse</p></blockquote><p>&nbsp;</p><p>It looks like this is saying that women can't say no to powerful men? Why is that?&nbsp;</p><p>I assume that women are strong and independent and if a powerful person tells them to do something, they can say no just fine, just like anybody else.&nbsp;</p><p>Am I missing something?&nbsp;</p>", "parentCommentId": "n6jpuGJfXEAmxHPos", "user": {"username": "katherinesavoie"}}, {"_id": "7JzCot8yKfHKbmsQW", "postedAt": "2024-02-01T10:03:45.210Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>When this is a situation involving a junior woman and a senior man, social behavior patterns of women being afraid of telling someone \"no\" often make this worse.</p></blockquote><p>I do think many women experience fear around this, and many have troubles expressing their wants in general. Many don't though. What's the solution then?&nbsp;</p><p>Should we encourage women to be strong, to do things that scare them, to stand up for themselves? Should we encourage women to tell people what they want instead of holding it in and not getting their needs met?</p><p>Or should we make it so they're never in situations that they might feel scared? Should we protect women from any danger, including the danger of being asked out and it feeling awkward to say no?&nbsp;</p><p>I think the former is a better solution.&nbsp;</p>", "parentCommentId": "n6jpuGJfXEAmxHPos", "user": {"username": "katherinesavoie"}}, {"_id": "Bvc9dkPA9H8cxXd77", "postedAt": "2024-02-01T12:48:56.873Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>As well as the reasons Jason lists, I think there are difficulties relating to preserving anonymity here. The identities of the people involved are known to me, to Community Health, and to the external investigation -- but not as far as I'm aware to the EV boards. The external investigation is complete, and I can't share evidence with the EV boards without damaging that anonymity (although note also that I don't completely agree with Kat's characterisation of my view of the evidence). Moreover, although it's transparent to me who this finding must be relating to, it's presumably not transparent to the EV boards that it's transparent to me, so I imagine they want to avoid leaking any bits of information about people who may or may not have spoken to the investigation. (I'm still not in fact certain that this person spoke to the investigation! It seems unlikely-but-conceivable that the finding is a garbled version of a thing I said to the investigation about the person's bad experience.)</p><p>I understand now that the boards wanted to base their actions just on the findings of the investigation, so there could be no question about the process being impartial.</p>", "parentCommentId": "4yaRY2Hc3rKA9DNNs", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "XRT6iNroZzFnDFHto", "postedAt": "2024-02-01T14:19:29.451Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>There's a big difference between expressing interest on a social visit to one's home and doing so under the circumstances described in the Time article to which this is apparently alluding. It's not particularly for the person on a social visit to leave and thus get away from the situation.</p>\n", "parentCommentId": "axnxdPwjwuuiWhgkd", "user": {"username": "Jason"}}, {"_id": "aBjzrRmtYXjBofPr5", "postedAt": "2024-02-01T14:50:52.691Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think it's also highly salient that concerns about frequency were apparently raised by multiple women. This implies that they believed they had made it sufficiently clear enough that the attention was unwelcome before at least some of the expressions of interest. If there were just one report of that nature, one might conclude that the identified individual was not given enough information to reasonably understand that further attention was unwelcome. This becomes an increasingly unlikely theory as the number of reports increases.</p>", "parentCommentId": "n6jpuGJfXEAmxHPos", "user": {"username": "Jason"}}, {"_id": "iM52H2mBXYcxnJ65s", "postedAt": "2024-02-01T14:53:53.145Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote>\n<p>also give credit to what [the women he harmed] they might have contributed to the community</p>\n</blockquote>\n<p>I'm confused what you're proposing here.  Since, as you say above, no one knows what their contributions are, what would crediting them look like?</p>\n", "parentCommentId": "ttEC76vE9BYYDn9fX", "user": {"username": "Jeff_Kaufman"}}, {"_id": "gESf3vJCTPHecnR4K", "postedAt": "2024-02-01T15:07:13.279Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks for asking, Jeff, I see why that might be confusing.&nbsp;<br>I was thinking of a statement such as:&nbsp;<br>\"I want to first pay my respect to the people who have been harmed by X's actions. I want to ask readers to remember that these people might have contributed greatly to our community too, and that several people were harmed by one person.\"&nbsp;<br>&nbsp;</p>", "parentCommentId": "iM52H2mBXYcxnJ65s", "user": {"username": "Milena Canzler"}}, {"_id": "tJeCKbqHSy5rHn2BS", "postedAt": "2024-02-01T15:12:00.872Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>The Boards found that Owen committed acts of sexual misconduct. That he failed to appropriately manage COIs related to expressing sexual/romantic interest is an aggravating factor to the finding that he had committed misconduct with respect to expressions of interest.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefkhcv4nq1bfk\"><sup><a href=\"#fnkhcv4nq1bfk\">[1]</a></sup></span>&nbsp;The Boards are not suggesting that a 2 year ban from EVF activities is some sort of default penalty for COI mismanagement.&nbsp;</p><p>I think many organizations in both the US and UK would have disassociated themselves from a former trustee for the conduct described in the Time magazine article alone. Thus, I do not think the sanction here is excessive. The Boards have no power to make decisions for the EA community or any other organization; that is up to all of us.</p><p>Julia made some (admittedly significant) errors of judgment in a very difficult situation not of her own making, where the existing policies, precedents, and resources were not remotely up to the task set before her. It is relatively uncommon for an organization to suspend or fire a longstanding employee for an honest mistake in judgment in one case on the job. I do not see any evidence that the Boards' decision here was outside of their discretion.</p><p>I have no idea whether the Boards considered public reputation in deciding on this action. However, it would not have been inappropriate for the Boards to give some weight to Owen's prominence and the need to set an example (\"general deterrence\"). By analogy, the US Department of Justice is pretty open that it goes after celebrities for criminal tax violations to achieve maximum public awareness and deterrence. Moreover, it's appropriate to hold people in senior positions to a stricter standard.</p><p>It also wouldn't have been inappropriate for the EVF UK Board to consider that it is under statutory inquiry in part for Board-related issues when addressing sexual misconduct by someone who was recently a trustee of that organization. No one has a right to be associated with EVF, and the Board's responsibilities are to EVF and its mission, not to Owen personally. And of course, the Boards did not -- nor did they have the power to! -- \"banish[]\" anyone from EA.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnkhcv4nq1bfk\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefkhcv4nq1bfk\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The findings do not state whether the COI problems were associated with the individuals who were known to be upset by the advances.</p></div></li></ol>", "parentCommentId": "XhHTHfRHLX4WHqgxr", "user": {"username": "Jason"}}, {"_id": "uFe3Th5SJPf6bLg9g", "postedAt": "2024-02-01T15:19:48.263Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>I would create a distinction between giving someone a read of a draft ahead of time, and actively communicating the date and time something is posted.&nbsp;</p></blockquote><p>Could you say more about that? The Boards' post stated their factual findings and actions without giving much of Owen's side of the story. While I don't think that was inappropriate, it seems fair to give Owen at least some lead time to prepare a statement of his perspective on the matter.&nbsp;</p><p>There is a history of people on this Forum veering to one side when a post is published before the respondent has a fair chance to respond, then moving to the other side when the response is filed. It's better to avoid that dynamic when possible.</p>", "parentCommentId": "cQaMpRDuCmgMsHFrE", "user": {"username": "Jason"}}, {"_id": "Eid7tJt6Hha4bXj2w", "postedAt": "2024-02-01T15:30:08.954Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>My best guess is that it's not correct that concerns about frequency were raised by multiple women, and the sentence is referring to different things contributing to the feelings of different people (most likely two).</p><p>In the case I'm aware of the key thing that went wrong was that I didn't realise some of what I was communicating would be taken as continued expression of interest (I thought it was a settled \"no\"). Of course there may be a case where I'm still unaware of this facet of their experience.</p>", "parentCommentId": "aBjzrRmtYXjBofPr5", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "gZWwnXpGoRobTDEx2", "postedAt": "2024-02-01T15:46:55.918Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>There are some grey areas here:</p><ul><li>Inviting participation from people who are <i>not </i>part of the relevant community is clearly brigading. Unless they abstain from voting and clearly disclose their origin, they would be masquerading as community members and giving a false impression of the community's views.</li><li>Inviting participation from people who <i>are </i>part of the relevant community presents a closer question. There's still a risk of creating a misleading impression of the community's views, but there isn't the astroturf-like presentment of inauthentic views as community-member views that classic brigading presents.<ul><li>For instance, I would generally view reaching out to a reasonable number of active Forum participants individually as not brigading. This is less likely to create a sufficient mass effect to mislead observers about the community's range of views. This may be contingent on those individuals following the next bullet point.</li><li>I suggest that people who have been \"recruited\" in this manner should ordinarily refrain from strong-voting on the post, either up or down. A small group of strong-vote wielding users can significantly effect the course of discussion on the Forum through their voting. If someone is close enough to the subject of the post to solicit for support without constituting brigading, they are likely too close to the subject to be casting strong up/downvotes on that post.</li></ul></li></ul>", "parentCommentId": "TytQvFvDGLX3ptWJF", "user": {"username": "Jason"}}, {"_id": "pwAkjmJSKzgFEFhJd", "postedAt": "2024-02-01T16:02:24.471Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>If concerns about frequency were only raised by one person, the Boards should amend the second factual finding. If changing the text much would be problematic due to confidentiality concerns and/or ambiguities in the investigative report, changing \"and\" to \"and/or\" would at least help.</p><p>In my reading, the fifth finding involves a specific complaint about frequency.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefqf8sxj2u3b\"><sup><a href=\"#fnqf8sxj2u3b\">[1]</a></sup></span>&nbsp;Given that, there shouldn't be references to frequency in the second paragraph in a context that implies that there were multiple such complaints (e.g., stating that frequency \"contributed to the <i>women’s </i>feelings\" (emphasis mine)). Rather, referring to the same complaint in both the second and fifth finding would constitute double-counting and thus overstate the findings.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnqf8sxj2u3b\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefqf8sxj2u3b\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In common language, I would describe a frequency concern as ~\"it happened too many times.\" I think that \"it happened too many times\" is necessarily implied by the fifth finding, that ~\"it happened again to the same person after Owen was asked to stop.\"</p></div></li></ol>", "parentCommentId": "Eid7tJt6Hha4bXj2w", "user": {"username": "Jason"}}, {"_id": "XQmuiHBtNbNCdCBwx", "postedAt": "2024-02-01T16:32:20.065Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>I would generally view reaching out to a reasonable number of active Forum participants individually as not brigading. This is less likely to create a sufficient mass effect to mislead observers about the community's range of views.</p></blockquote><p>I think about it this way. If a post was written critically about me, I would suspect 5-10% of people that know me in the community to see it, and 0.5% to comment. If I reach out to everyone I have ever been friendly with, I expect these numbers would be 50% and 5%, respectively. In other words, there would be 10x more comments defending me if I reach out to friends than if I don't.&nbsp;<br><br>I think for independent observers, reading comments in fictional scenario above, it's useful to know whether comments were of unsolicited or not.&nbsp;<br>&nbsp;</p><blockquote><p>A small group of strong-vote wielding users can significantly effect the course of discussion on the Forum through their voting.</p></blockquote><p>Totally agree. Why would the same not be true of comments?&nbsp;</p>", "parentCommentId": "gZWwnXpGoRobTDEx2", "user": {"username": "ElliotJDavies"}}, {"_id": "HvaPD32wnw5dkBGmt", "postedAt": "2024-02-01T17:02:22.726Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks, I thought a bit more about this (I'd previously just been assuming that it meant the case I knew about), and I find it plausible it was more than one. In particular, as I explained in <a href=\"https://docs.google.com/document/d/1AoRnwe0vemYN5xzpB815cG4H8XuJVqG-7i0JzZpICRg/edit?usp=sharing\">my notes</a> there was a pattern in the cases of harm in which I read the other person as having more reciprocated attraction than they did. I find it plausible that things I said working from such a mistaken impression would have been read as advances, and have little idea what the frequency of such things could have been.</p>", "parentCommentId": "pwAkjmJSKzgFEFhJd", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "tjvXDYDNqF6M5wniL", "postedAt": "2024-02-01T17:32:04.860Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I haven't wanted to speak about the people who were upset for fear public attention could be uncomfortable, but for the record and because as you say others can't speak to this:&nbsp;</p><ul><li>I believe all of them are smart, honourable people who care a lot about doing the right thing.&nbsp;</li><li>I think they have made important contributions to the community, and I personally have learned deeply from them.&nbsp;</li></ul><p>Then a couple of things which probably go without saying, but to remove any ambiguity I'll say anyway:</p><ul><li>I think it would be ridiculous to question their reports of bad experiences; I wouldn't dream of bearing them ill-will over this; and I sincerely hope they've had good support networks and are doing well now.&nbsp;</li><li>I'd be happy if any of them wanted to talk publicly (anonymously or otherwise) about their experience, about things that would be helpful for them now, or about their views of my character; but I don't want to put that on them.</li></ul>", "parentCommentId": "ttEC76vE9BYYDn9fX", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "zdcjBmQtzxq3Pjcah", "postedAt": "2024-02-01T18:02:59.235Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think if you're colouring the situation in a way that would influence the person's perception when they go to comment or vote, that would be against the rules of the EA forum.</p><p>Separately, I think I probably am against asking people to pile on to a post, even if you're not directly telling them which way to pile on? I think it's bad to have comments sections be emotionally charged regardless of which direction the sentiment points on net. We want to incentivise deliberation and good judgement, not moral crusading.</p>", "parentCommentId": "8DkKnvSv3yLxqq83s", "user": {"username": "bec_hawk"}}, {"_id": "WFJSJw7myHaJmt6R5", "postedAt": "2024-02-01T18:13:35.806Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I was told approximately when the post would go up. In fact, I asked them to delay a few days so that somebody could write to the people who spoke to the investigation to give them an opportunity to fact-check or object to my detailed responses. (I made some minor updates following feedback there, but of course this shouldn't be taken as saying that everyone involved endorses what I've written; in particular, people may reasonably have chosen not to read it.)</p><p>I did not suggest anyone comment in my defence, something I'd regard as inappropriate. Nor did I let more than a handful of people know that it was coming out. One of the people who commented, Jonas, was in the loop because he'd offered to give me advice on how to write about things publicly.</p>", "parentCommentId": "GJkWLfoZQQLTTwqf4", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "rjNf2qkquaRiRNvhs", "postedAt": "2024-02-01T18:30:30.741Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think the qualifier \"a reasonable number of active Forum participants\" in my comment is doing some real work and wouldn't be met if you asked \"everyone [you] have ever been friendly with\" -- even if we add in an implied limitation to current Forum participants.</p><p>Let's take a case in which I invited my hypothetical friends Abel, Baker, and Charlie to participate in a thread that was critical of me. I think there is value in having some people who know the person well who is subject to the controversy present in the conversation. An invitation increases the likelihood of having those voices present; if the base rate of people even seeing the post is 5-10% per your example above, there's a good chance that zero of the ten community members best situated to provide a favorable perspective on the subject will even see the post -- much less decide to comment.&nbsp;</p><p>On the whole, I think the presence of Abel, Baker, and Charlie in the comments would be net positive. I'm sure it is exhausting to feel the need to respond to a post that is critical of you and all the comments thereunto, and asking for help can be appropriate. Even if all accept, it's only three voices, and the community is capable of evaluating the substance of what they say and reacting accordingly. In contrast, with votes there is no ability to evaluate whether the votes are based on solid reasoning or instead represent a voter's predisposition toward the subject of the post.</p><p>I see the point that Abel, Baker, and Charlie could say that I asked them to comment. However, I think they <i>should </i>be part of the conversation, and expecting them to flag themselves gives the impression that they are true brigadiers. People have all sorts of incentives and motivations for posting, and I'm not convinced this motivation should be singled out for <i>per se</i> special disfavor.</p><p>In this particular case, most active Forum participants would have seen the post given the prominence of the Owen situation and the Time article. And participation rates are likely to be high due for various reasons. So I see concerns about a few \"recruited\" members of the community potentially upsetting the balance as less pressing than in the hypothetical case in which the post was critical of you.&nbsp;</p><p>Admittedly, I have seen some <i>possible </i>evidence of strategic voting here (e.g., a strong downvote on a post with lots more agrees than disagrees is a yellow flag for me, certain posts got a good bit of karma quickly and were then voted down to near-zero or even negative karma). But that would likely be coming from people who are pretty active on the Forum anyway (as evidenced by their powerful strongvotes), so the nexus between \"recruitment\" and that strategic voting is doubtful to me.</p>", "parentCommentId": "XQmuiHBtNbNCdCBwx", "user": {"username": "Jason"}}, {"_id": "aptYuYehWfxjDgo4R", "postedAt": "2024-02-01T18:52:21.175Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>If someone else had written my comment, I would ask myself how good that person's manipulation detection skills are. If I judge them to be strong, I would deem the comment to be significant evidence, and think it more likely that Owen has a flaw that he healed, and less likely that he's a manipulator. If I judge them to be weak (or I simply don't have enough information about the person writing the comment), I would not update.&nbsp;</p><p>If there are a lot of upvotes on my comment, that may indicate that readers are naïvely trusting me and making an error, or have good reason to trust my judgment, or have independently reached similar conclusions. I think it's most likely a combination of all of these three factors.</p>", "parentCommentId": "c5r547F2GmqZDgd8H", "user": {"username": "Jonas Vollmer"}}, {"_id": "c2PDecLtDzi6eHqoq", "postedAt": "2024-02-01T19:41:35.386Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>While I don't think that was inappropriate, it seems fair to give Owen at least some lead time to prepare a statement of his perspective on the matter.&nbsp;</p></blockquote><p>I think your right about this, and have changed my mind.&nbsp;</p>", "parentCommentId": "uFe3Th5SJPf6bLg9g", "user": {"username": "ElliotJDavies"}}, {"_id": "ndi4GwLCAnn9ejjE9", "postedAt": "2024-02-01T20:17:30.893Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>This is hard and that should be recognized. It seems you all are taking this extremely seriously and that should be commended.</p>\n<p>The recent discussion around Nonlinear got me wondering about one aspect of CH reports I hadn't considered before.</p>\n<p>Has the CH team ever spoken negatively about the person who made a report to people outside the CH team?</p>\n<p>I'm thinking of a scenario like: Steve makes an accusation against Lina. The CH team interacts with Steve and through this interaction comes to view him as somewhat of an unstable character. Even though no one has reported Steve, the CH team advises against hiring Steve to other institutions within the EA space, based on their interactions they had with Steve when the reported about Lina's behavior.</p>\n", "parentCommentId": "7PWAHGveSjyHtqSjG", "user": {"username": "Masha Winchell"}}, {"_id": "8BBcQQmAgZs2Xsmip", "postedAt": "2024-02-01T22:35:01.876Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>Surely there are a lot of other hypotheses as well, and Jonas's evidence is relevant to updating on those?</p></blockquote><p>&nbsp;</p><p>There are of course infinite hypotheses. But I don't think Jonas's statement adds much to my estimates of how much harm Owen is likely to do in the future, and expect the same should be true for most people reading this.</p><p>To be clear I'm not saying I estimate more harm is likely- taking himself off the market seems likely to work, and this has been public enough I expect it to be easy for future victims to complain if something does happen. I'm only saying that I think large updates based on Jonas's statement are a mistake for people who already know Owen was an EA leader in good standing for many years and had many highly placed friends.&nbsp;</p><p>If I was completely unfamiliar with EA and Jonas's comment was the first piece of information I got, that would probably shift my probability weights for what happened. Although it's still consistent with a lot of harm being done by accident, and with harm done being difficult to estimate.</p><p>But for anyone who knows Owen's place in EA, &nbsp;Jonas's comment is a high level assessment that is only useful insofar as you trust his judgment. I contend that that kind of trust should only come from observing someone in detail over a prolonged period, and few people are likely to have that about Jonas. Not because of anything specific to him, it just takes a lot of time and intimacy to develop that kind of justified trust. There are a handful of people I'd defer to in this situation and I've had high-information engagement with them for years.&nbsp;</p><p>In contrast, <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=DRX9vHqppmAttqhG7\">lyra's comment</a> contains a lot of details I can use to inform my own reasoning. She was also in a better position to notice Owen's harms, and to hear about them second hand. Hher comment has half the karma of Jonas's (and had 1/3 when I wrote my original comment), which I think indicates systemic bad judgment and probably excess deference to professional reputation, even accounting for the fact that lyra's comment is anonymous.&nbsp;</p>", "parentCommentId": "sc7YQxE8NP22ptmxw", "user": {"username": "Elizabeth"}}, {"_id": "2y8qcp6sqbzjE5sh8", "postedAt": "2024-02-01T23:04:05.108Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks, Kat. Readers may also be interested in checking Owen's December 2023 <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology?commentId=D7fJfwHq68qewZyCD\">update</a>, which is mentioned midway through Owen's response document:</p><blockquote><p>I think that&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology?commentId=D7fJfwHq68qewZyCD\"><u>my December update</u></a> is still much more central to what I want to communicate to people [than Owen's response document]</p></blockquote>", "parentCommentId": "wFFydHoJiBtHe9gAm", "user": {"username": "vascoamaralgrilo"}}, {"_id": "XC7YjWXhTwZbrNYDm", "postedAt": "2024-02-02T02:11:00.258Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>Owen very much doesn't seem to me like that either</p></blockquote><p>&nbsp;</p><p>Part of me wants to ask what you're basing that on. And on one hand, I do think specifics are better than general assessments (which I explain in more detail <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=8BBcQQmAgZs2Xsmip\">here</a>). On the other, I think trying to relitigate this on the forum is likely to go poorly, and isn't worth it given that EV has laid down a reasonable plan.&nbsp;</p>", "parentCommentId": "zNBtJaoHFHXFrEY9t", "user": {"username": "Elizabeth"}}, {"_id": "xk4YdDwvxYuZmPFLB", "postedAt": "2024-02-02T03:17:52.042Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>So there's no confirmed person aside from the one listed, but there could feasibly be more?&nbsp;</p><p>Is there anybody aside from the one person publicly listed who asked you to stop expressing interest or asked you to stop talking to them or anything like that?&nbsp;</p>", "parentCommentId": "HvaPD32wnw5dkBGmt", "user": {"username": "katherinesavoie"}}, {"_id": "a6wWiYn9wnuHcnDYs", "postedAt": "2024-02-02T08:13:10.344Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>FWIW there was actually someone <a href=\"https://www.metaculus.com/questions/6024/sexual-scandal-amongst-animal-advocates/\">making such a prediction for ACE</a> back in the days. It stood at 15% chance which I think is uncomfortably high for chance of a scandal in a single year - it implies an 80% chance of it happening over a 10-year period! They also ran another question on a scandal related to racism.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "ZAxzsKhrmrijhhgQx", "postedAt": "2024-02-02T08:34:41.679Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Whomever you are who is on a downvoting rampage against me: Really? A -6 vote on all these comments when I just tried to make it easier for people to give me feedback anonymously? I know it is stupid of me to care about karma but that was just plain mean of you.</p>", "parentCommentId": "S9uoowghDo7bANL6F", "user": {"username": "Ulrik Horn"}}, {"_id": "H5dsdfcQAb8sz7y6w", "postedAt": "2024-02-02T09:19:32.285Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I agree that this is part of what was problematic.</p>\n<p>[Edited to remove an attempt to give a little further context on the error ... I'm torn between a desire to provide transparency, and a desire not to repeat the original errors of oversharing, and on reflection I think this was veering a bit too much to the latter compared to the amount of value it was providing on the former.]</p>\n", "parentCommentId": "Q6XFX8drKqvuHuEr4", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "AWTDmbETuDRiWdZyx", "postedAt": "2024-02-02T11:05:56.480Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>(Fyi, I probably won't engage more here, due to not wanting to spend too much time on this)</p><blockquote><p>Jonas's comment is a high level assessment that is only useful insofar as you trust his judgment.</p></blockquote><p>This is true, but I trust basically any random commenter a non-zero amount (unless their comment itself gives me reasons not to trust them). I agree you can get more trust if you know the person better. But even the amount of trust for \"literally a random person I've never heard of\" would be enough for the evidence to matter to me.</p><blockquote><p>I'm only saying that I think large updates based on Jonas's statement are a mistake for people who already know Owen was an EA leader in good standing for many years and had many highly placed friends.</p></blockquote><p>SBF was an EA leader in good standing for many years and had many highly placed friends. It's pretty notable to me that there weren't many comments like Jonas's for SBF, while there are for Owen.</p><blockquote><p>In contrast, <a href=\"https://forum.effectivealtruism.org/posts/4CBoJ5jgmGfdMFnAE/ev-investigation-into-owen-and-community-health?commentId=DRX9vHqppmAttqhG7\">lyra's comment</a> contains a lot of details I can use to inform my own reasoning.</p></blockquote><p>It seems so noisy to compare karma counts on two different counts. There are all sorts of things we could be failing to miss about why people voted the way they did. Maybe people are voting Jonas's comment up more because they liked that it went more out of its way to acknowledge that the past behavior was bad and that a temporary ban is good.</p><p>It seems like a mistake to treat karma as \"the community's estimate of the evidence that the comment would provide to a new reader who knows that Owen was a leader in good standing but otherwise doesn't know anything about what's going on\". I agree you'll find all sorts of ways that karma counts don't reflect that.</p>", "parentCommentId": "8BBcQQmAgZs2Xsmip", "user": {"username": "rohinmshah"}}, {"_id": "upvNW2tw8GbsgYJYJ", "postedAt": "2024-02-02T13:14:24.671Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote>\n<p>It stood at 15% chance which I think is uncomfortably high for chance of a scandal in a single year</p>\n</blockquote>\n<p>Note that it wasn't just ACE, it was ACE or any of it's (~dozen) top or standout charities.</p>\n<blockquote>\n<p>it implies an 80% chance of it happening over a 10-year period</p>\n</blockquote>\n<p>I don't think assuming full independence makes sense?  I wouldn't go all the way to \"if they have a scandal-likely person/culture then they will definitely have a scandal this year, so 15% is the probability they have a scandal-likely person/culture\" but I do think that's a piece of it.  Very roughly I'd guess that 15% in one year gives 50% in ten?</p>\n", "parentCommentId": "a6wWiYn9wnuHcnDYs", "user": {"username": "Jeff_Kaufman"}}, {"_id": "QtmYtZSaTxy8nD7oJ", "postedAt": "2024-02-02T13:25:48.794Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thank you Milena for writing this. Let's not forget the painful reality of the victims. The fact that their anonymity prevents them from getting the personal support of many only exacerbates the need for our solidarity with them.</p>", "parentCommentId": "ttEC76vE9BYYDn9fX", "user": {"username": "alix.pham"}}, {"_id": "ruyQBhZ7bpFhirokz", "postedAt": "2024-02-02T13:46:12.292Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks, those are important points. I just quickly came across it by searching for something else and thought I would share as it seemed very relevant.</p>", "parentCommentId": "upvNW2tw8GbsgYJYJ", "user": {"username": "Ulrik Horn"}}, {"_id": "FtLKQCbd3dhwLHTPX", "postedAt": "2024-02-02T14:23:27.629Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I would agree with this comment if it was regarding a situation of sexual assault or similar severity.</p>\n", "parentCommentId": "ttEC76vE9BYYDn9fX", "user": {"username": "bec_hawk"}}, {"_id": "emNj7FMnDfDeStCiZ", "postedAt": "2024-02-02T14:25:47.445Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I agree that the women affected are what this is primarily about. But there's also an issue with not wanting to ascribe to anyone how we think they likely feel, without knowing much about them. Like, maybe at least some of the women who had negative experiences have nuanced feelings that <i>aren't</i> best described as \"I feel bad/invalidated whenever I see someone say positive things about Owen, even if they take care to not thereby downplay that the things he did weren't acceptable.\" Maybe some feel things like, \"this stuff was messed up and really needed to be dealt with, and it sucks that it took so long/seemed like initially it wasn't going to be dealt with, but it seems like things are developing in a good direction now.\" Or maybe not! Maybe they're still super upset and wish that Owen never re-enter the community again. That would be their right and seems understandable, too. In any case, the way I see it, we don't know at this point (at least I don't), and while I agree that it's important to create encouraging incentives so people will be likely to report future instances of misconduct, I don't think this requires a policy of \"avoid <i>at all costs</i> saying things that <i>might</i> make someone who was affected uncomfortable.\" (In fact, there's also a risk of making people less likely to report uncomfortable experiences if they worry that there'll be a community overreaction. That's not the first thing I'd worry about, to be clear; I'm just pointing out that this could happen/be someone's reason to be hesitant about speaking up about something.) Personally, the message I find most important is something like: I want us to take seriously that it's unacceptable for people to predictably be at risk to have bad experiences like that in the EA community, and the community/Community Health takes this seriously and takes appropriate action.<br><br>I expressed support of another person's comment that contained many positive points about Owen. I hope that no one feels like this means I'm \"on Owen's side\" rather than on the side of the people who brought up these complaints. Owen seems to largely agree about the facts of what happened, and he seems genuinely committed to making sure similar stuff doesn't happen again, plus he accepted the consequences (stepping down, two-year ban). These features of the situation IMO make it possible to not have to view this as \"either you support the victims, <i>or</i> you can say a redeeming thing or two about Owen.\"<br><br>This option of \"not thinking of the situation as one where it's about picking sides\" isn't always available. If a person accused of causing harm goes <a href=\"https://en.wikipedia.org/wiki/DARVO\">DARVO</a> and accuses the alleged victims to be malefactors in return who make up false stories, then one is forced to either side with the alleged victims, <i>or</i> with the accused. Similarly, sometimes someone does something that's immediately strong evidence that they are operating without even a desire to respect others (Milena Cenzler's comment originally contained a hyperlink to the case of Brock Turner, who sexually assaulted an unconscious woman, as an example of how comments by supporters can sometimes be re-traumatizing to the victims). In those cases, it also seems to me like one can't say much that's redeeming about the person who caused harm without this being disrespectful towards the victims, both because of the severity of what they faced and because there's not much redeeming you can say about someone who even lacks a basic desire/intent to respect others. But that sort of case has very different features from \"confessed feeling attracted out of scrupulosity and misguided desire to get moral absolution from the people one is attracted to for not having to feel bad about the attraction.\" It's a very different thing.&nbsp;<br>(Edit) Lastly, I guess sometimes someone can be a skilled manipulator and seem remorseful and accept consequences but downplay the extent of the harm and downplay their \"bad character.\" If Owen were like that and people who said positive things about him just fell victim to his charm, that could also be invalidating for the people who were harmed. I don't think that's the case, but this would be another situation we want to try to avoid, so I feel like the people who say positive things about Owen have a responsibility to consider the possibility \"am I being manipulated?.\"&nbsp;</p>", "parentCommentId": "QtmYtZSaTxy8nD7oJ", "user": {"username": "Lukas_Gloor"}}, {"_id": "gu6y2Ef6nGZ5kANeu", "postedAt": "2024-02-02T14:58:56.388Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>As we got more caseworkers, practices like getting input / sanity-checking from other caseworkers and managers on important cases have been helpful in a variety of situations.</p>", "parentCommentId": "rzYvnLYxi4HqtFPvL", "user": {"username": "Julia_Wise"}}, {"_id": "hMXJ4Ft5GWq86MKcx", "postedAt": "2024-02-02T18:30:25.870Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Sorry, was being somewhat sloppy - I meant to broadly wave at \"I think sexual harassment is bad\". More specifically could say:<br>- It's probably suboptimal ex post to make an unwanted romantic or sexual advance on someone, but it can definitely be reasonable ex ante&nbsp;<br>- If it's predictably unwanted then it's probably bad ex ante<br>- if it's uncertain and the asker is in position of power / you are in professional setting / other person is esp likely to feel uncomfortable etc etc, then it's probably a bad idea ex ante<br>- If someone has a pattern of doing this and has received complaints about it then either they should update that they are bad at judging when this is ok and be really careful to steer pretty clear of this kind of thing<br>- The community should in general take repeated complaints of this kind of thing pretty seriously and not let it be brushed off with \"but this person is good in X way\", because some fraction of the time this is the tip of an iceberg of manipulative/abusive/harassing behavior, and is the best chance you'll get to catch it<br>- Even if you conclude it's not part of a pattern of nefarious behavior, it's still pretty costly to the community, and actions should be taken that provide high confidence it won't continue happening</p>", "parentCommentId": "uGWphhEzZaHfeWY3h", "user": {"username": "lyra"}}, {"_id": "SACcyQMyh5Fdrcv33", "postedAt": "2024-02-02T18:38:07.043Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Did you read the actual <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology?commentId=D7fJfwHq68qewZyCD\">description of the incident</a> in question?</p>", "parentCommentId": "Wqzv4mLj2iJdhZRqf", "user": {"username": "lyra"}}, {"_id": "bnbqAipMFJiJbCsmo", "postedAt": "2024-02-02T19:41:20.402Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I haven't voted either way on your comments, but in general making several comments as a way to run a poll is not a good idea unless you're pretty confident others will find your poll interesting.  And then if someone does/doesn't think the poll belongs here they upvote/downvote each question in the poll, magnifying the karma impact.</p>\n<p>Then I expect this comment was downvoted because (a) it's complaining about downvotes and (b) doesn't engage with what people should do if they don't think your poll comments belong on the Forum.</p>\n", "parentCommentId": "ZAxzsKhrmrijhhgQx", "user": {"username": "Jeff_Kaufman"}}, {"_id": "4emCrgv5cuhGiXc7x", "postedAt": "2024-02-02T20:06:24.225Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I often downvote enough of the options to zero out the karma gain from posting the options, on the theory that the user shouldn't reap an automatic +1 or +2 for each option posted. I would not <i>strong</i>-downvote on the basis (if other users had found value in the options being listed, who am I to attempt to overrule them?) and was not the strong-downvoter here.</p>", "parentCommentId": "bnbqAipMFJiJbCsmo", "user": {"username": "Jason"}}, {"_id": "SwMtLBEXohDcTYu3X", "postedAt": "2024-02-02T20:53:44.212Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think \"a reasonable number of active Forum participants individually\" is doing some real work here -- \"everyone I have ever been friendly with\" would not count. I think there is usually value in having people who know the subject well participating in the comments, and by your math there is a good chance that zero or one of the ten people best positioned to provide a sympathetic perspective would even see the post organically. A reasonable number would depend on the circumstances, but I was thinking more ~3 acceptances?</p><p>One could argue that these individuals should disclose their status as solicited commenters. But people comment on the Forum for any number of reasons, obvious and inscrutable, so I can't find a sufficient rationale for singling out <i>a few</i> solicited commenters. There's no norm, for instance, for friends of a post's author to self-identify themselves as such.</p><p>I am relatively less worried about a few commenters skewing the course of discussion (as opposed to strongvoters) for two reasons. The first is that comments have substance that can be evaluated as convincing or non-convincing. The popularity of that substance can be evaluated via up/down and agree/disagree voting, which provides some check on unrepresentative comments appearing to be consensus. Second, at least regulars have a decent sense of who is who; if someone who is an infrequent commenter starts on a commenting spree defending person X, we have a pretty good idea that they are motivated by some sort of external reason and can adjust accordingly.</p>", "parentCommentId": "XQmuiHBtNbNCdCBwx", "user": {"username": "Jason"}}, {"_id": "BmFc48d9bF2m53owf", "postedAt": "2024-02-02T21:53:37.345Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I think people do not get karma from the baseline +1 or +2 that comes with making a new comment.</p>", "parentCommentId": "4emCrgv5cuhGiXc7x", "user": {"username": "ChanaMessinger"}}, {"_id": "fuoCZQuyYCcs4enrk", "postedAt": "2024-02-02T21:56:19.935Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I'm glad to see:</p>\n<ol>\n<li>The Community Health team adopting more robust procedures</li>\n<li>Transparency regarding the changes made and the reasons for them</li>\n<li>The boards of EV taking an active role in overseeing this and in acting even against a well known and powerful figure.</li>\n</ol>\n<p>I was also glad to see Owen step down from his role, taking full responsibility and apologizing for his actions, cooperating and attempting to improve himself. This sets a good example.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "ATTAwecAfeLGhv7Pr", "postedAt": "2024-02-02T22:47:55.663Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>What is the inaccuracy you’re pointing to?</p>\n", "parentCommentId": "SACcyQMyh5Fdrcv33", "user": {"username": "bec_hawk"}}, {"_id": "LmRdcxuDxw5YEXx7a", "postedAt": "2024-02-03T00:01:15.228Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I'm not sure why your comment was downvoted. I think it's a perfectly reasonable request since, as you say correctly in other comments, people who don't know enough to form their own opinion can't just trust that other forum commenters with direct opinions are well-calibrated/have decent people judgment about this.</p>\n<p>I started writing down some points, but it's not easy and I don't want to do it in a half-baked fashion and then have readers go \"oh, those data points and interpretations all sound pretty spurious, if that's all you have, it seems weird that you'd even voice an opinion.\" It's often hard to put in words convincingly why you believe something about someone.</p>\n<p>I might still get around to finishing the comment at some point in the next few days, but don't count on it.</p>\n", "parentCommentId": "XC7YjWXhTwZbrNYDm", "user": {"username": "Lukas_Gloor"}}, {"_id": "CxKBJxNEAy2aP4jRk", "postedAt": "2024-02-03T19:43:07.276Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>I don't think there's an easy fix for that: Owen Cotton-Barratt is not anonymous, and a prominent figure (at least in the UK community). As such, people will want to give their personal testimony of what threat he might pose or not. The women who reported him remain anonymous - no one will come to defend their character or great deeds for the community, since no one knows who they are.&nbsp;</p></blockquote><p>I'd also flag the related risk of cognitive bias here -- the women who were affected by Owen's actions are in a sense abstractions to the vast majority of readers. By that I mean we (understandably) haven't heard their stories in their own words or in any detail; we largely are reliant on the Boards' (understandably) concise and not-too-specific factual findings. In contrast, Owen is known and has (mostly) positive history with people in the community.</p><p>That's largely unavoidable, because of course we should honor the women's desire not to be identified. But I would say that if someone's reaction to what happened changes <i>too</i> much if they change from evaluating the abstract \"a senior EA figure\" to \"Owen,\" they may want to consider that they have been exposed to humanizing/de-abstracting information (I'd like a better word here!) for one participant but not for other participants in the situation.&nbsp;</p><p>I don't know what epistemic strategy is best employed in this kind of circumstance. Having one person as a known entity with the other people feeling like abstractions could lead to a position that is more favorable to the identified person than it would be if humanizing/de-abstracting information existed on both sides. One could argue for falling back to the level of abstractions, deciding how one would react if only aware that \"a senior EA figure\" committed the actions, and update according to that -- but that strategy comes at the cost of disregarding pretty relevant information. Maybe the best that can be done is to evaluate one's position with and without the Owen-specific contextual information, and update to ~ the median of the two evaluations?</p>", "parentCommentId": "ttEC76vE9BYYDn9fX", "user": {"username": "Jason"}}, {"_id": "9ruEjpmCqJorejcXm", "postedAt": "2024-02-04T11:39:33.487Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Some thoughts:</p><ul><li>Seems this situation could have been handled worse.<ul><li>When I was a christian several churches I was part of had serial sexual harassment by powerful men that was discovered years later. This seems unlikely in EA</li><li>My friends in political communities imply sexual harassment is rife</li><li>Cotton-Barratt could have been thrown out without any possibility of discussion. I am reliability told this is the policy of some UK universities.</li><li>Lesswrong user Mingyuan writes usefully on how difficult due process is <a href=\"https://www.lesswrong.com/posts/sJEcNgqnSL2n35QWR/the-impossible-problem-of-due-process?commentId=NfP9XFyTizs9FixSc\">here</a></li></ul></li><li>This topic feels costly to discuss. It is my general view that communities need to be able to have discussions on what their norms should be. I don't think EA has really been capable of that here.&nbsp;</li><li>When did the worst of these cases happen? If the worst cases happened 5 years ago, that seems materially different than if they happened 1 year ago. eg, where does the majority of the 'predictable harm' fall on the timeline? Likewise, Cotton-Barratt has been de fact ostracised for months now. Seems like this should count towards the ban time.</li><li>To what extent is this about Owen and to what extent is this as an example? I would softly hold that some parts of this decision are to show that even powerful people should be held accountable. I think we should be honest with ourselves if this is the case.</li><li>\"After February 11th, 2025, Owen Cotton-Barratt will need to appeal to the boards of EV US and EV UK to participate in any overnight events or to be a member in an EV coworking space.\" I note there is no path for Cotton-Barratt to become a typical member of the community again. Personally I guess I want this for restorative justice. Such standards might be very high, but some notion of community forgiveness/normalisation is important to me.</li></ul>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "zq2TbqRqFmWmzddGm", "postedAt": "2024-02-04T12:52:13.168Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>Cotton-Barratt has been de fact ostracised for months now. Seems like this should count towards the ban time.</p></blockquote><p>Just wanted to note that ~1 year of the 2-year ban is retroactive so this has happened</p>", "parentCommentId": "9ruEjpmCqJorejcXm", "user": {"username": "bec_hawk"}}, {"_id": "gzD6tPtS4fvqHzS77", "postedAt": "2024-02-04T12:59:49.920Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Fair enough, I will definitely think of better ways to get feedback in the future. It is completely on me that I didn't realise the karma impact could be magnified like that (or that running polls that way might cost me karma!). And my concerns about karma is insignificant compared to the personal suffering by those affected by the actions of the original post. What's most important to me is that I can find ways to constructively and meaningfully contribute to reducing the risk of future harms to the community, something I am dedicating more time to than writing here on the forum. Thanks for your patience Jeff!</p>\n", "parentCommentId": "bnbqAipMFJiJbCsmo", "user": {"username": "Ulrik Horn"}}, {"_id": "vNi8kPgGoouddWfxk", "postedAt": "2024-02-04T13:18:41.624Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote>\n<p>I note there is no path for Cotton-Barratt to become a typical member of the community again</p>\n</blockquote>\n<p>I don't think this is true?</p>\n<p>I don't feel qualified to give an opinion on the board decisions, punishment etc. for the specific case. But in nature, it does look like a decision that allows returning to full participation in the community, subject to some future checks, which makes sense.</p>\n<p>And his reputation has suffered a blow, but not a very big one? Like, I don't see anyone publicly objecting to his presence on the forum.</p>\n", "parentCommentId": "9ruEjpmCqJorejcXm", "user": {"username": "Guy Raveh"}}, {"_id": "4CzmaNLpRFLffSpfH", "postedAt": "2024-02-04T14:49:36.883Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><ul><li>\"After February 11th, 2025, Owen Cotton-Barratt will need to appeal to the boards of EV US and EV UK to participate in any overnight events or to be a member in an EV coworking space.\" I note there is no path for Cotton-Barratt to become a typical member of the community again. Personally I guess I want this for restorative justice. Such standards might be very high, but some notion of community forgiveness/normalisation is important to me.</li></ul></blockquote><p>The Boards' action only applies to the EVFs -- and so the post-2025 restrictions only have effect insofar as the EVFs continue to exist, and (sponsor overnight events or run coworking spaces). I think the probability of those things holding for more than 2-3 years is less than even. There's also nothing to preclude future Boards from removing these restrictions on Owen's petition -- in fact, it would be somewhat difficult for the current Boards to bind future Boards to not remove them. Moreover, I don't think a requirement that two specific forms of participation be approved at a higher organizational level is a meaningful departure from being a \"typical member.\"</p><p>More broadly, I don't think forgiving misconduct means ignoring the consequences that flow from what happened. For example, allowing Owen to have certain roles carries some legal and PR risk -- potentially for any organization, but especially for EVF. Forgiveness wouldn't absolve the Boards of their fiduciary responsibility to consider, manage, and mitigate those risks.</p><p>&nbsp;Likewise, forgiving someone for cheating on you doesn't imply that you need to lift the real-world consequences of their behavior (you broke up with them, you still won't get back together with them, etc.). One could argue that forgiveness implies remission of any sanctions imposed for the purposes of retribution and/or specific deterrence (i.e., persuading you to behave in the future), but I don't see those as the main drivers of the Boards' action here.</p>", "parentCommentId": "9ruEjpmCqJorejcXm", "user": {"username": "Jason"}}, {"_id": "4oyGtRBrXXxEyPwom", "postedAt": "2024-02-04T16:43:51.311Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>&gt; Cotton-Barratt could have been thrown out without any possibility of discussion. I am reliability told this is the policy of some UK universities.</p><p>Depending on what 'discussion' means here, I'd be surprised. It would be illegal to fire someone without due process. Whether discussion would be public as in here is a different matter; there tends to be a push towards confidentiality.</p><p>For balance: I've been an advocate for victims in several similar cases in UK universities, at least one of which was considerably more severe than what i've seen described in this case. I've encountered intervention and pressure from senior academic/administrative figures to discourage formal complaints being submitted, resulting in zero consequences for the perpetrator, and the victims leaving their roles. I would expect this to be the outcome more often on average than the very strong reaction Nathan describes.&nbsp;</p>", "parentCommentId": "9ruEjpmCqJorejcXm", "user": {"username": "Sean_o_h"}}, {"_id": "h55x9xdht4h5YRWAt", "postedAt": "2024-02-04T21:10:13.829Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Nobody else like that.</p>\n", "parentCommentId": "xk4YdDwvxYuZmPFLB", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "6r2YWumgAACsggeAb", "postedAt": "2024-02-04T21:23:42.190Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I'm not sure that there was more than one (unprompted) complaint to CH. In addition to the one complaint, there was one case of something potentially inappropriate they heard about from a third party, <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology?commentId=QuiEfn6PMvHo8j4nz\">one case they uncovered when they went looking</a>, and a couple of other cases I told them about.</p><p>However, I do think that my communications were unusually likely to be upsetting (and relatedly that some of what I now understand to have been the most damaging communications were not understood by me at the time to be advances).</p>", "parentCommentId": "AJE4YZLp2uRf6BmKG", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "S5Q5CWofEJLh6TqsL", "postedAt": "2024-02-05T04:29:25.683Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>I didn’t vote on any of the poll comments, but one major thing in my mind is that they should have been posted under the comment saying you’re going to be doing the poll, not under the parent comment</p>\n", "parentCommentId": "ZAxzsKhrmrijhhgQx", "user": {"username": "bec_hawk"}}, {"_id": "vedhmzPnPTroXLyRd", "postedAt": "2024-02-05T19:56:44.045Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>So I asked my friend who runs training at universities on this topic and they said that at one university it appeared that way for a while, which is moderately weaker than what I said. So I got that wrong.</p><p>But that still works as an example. There was a real world place where things were worse than here.</p>", "parentCommentId": "4oyGtRBrXXxEyPwom", "user": {"username": "nathan"}}, {"_id": "f74EX9PdNykzZEkpT", "postedAt": "2024-02-06T04:00:59.472Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<blockquote><p>SBF was an EA leader in good standing for many years and had many highly placed friends. It's pretty notable to me that there weren't many comments like Jonas's for SBF, while there are for Owen.</p></blockquote><p>&nbsp;</p><p>I think these cases are too different for that comparison to hold.&nbsp;</p><p>One big difference is that SBF committed fraud, not sexual harassment. There's a long history of people minimizing sexual harassment, especially when it's as ambiguous. There's also a long history of ignoring fraud when you're benefiting from it, but by the time anyone had a chance to comment on SBF he had already incontrovertibly failed, in public, at an epic scale.</p><p>Additionally, even in the most generous interpretation of the overall situation, Owen seems extremely bad at assessing how his advances are received. Jonas's comment doesn't mention any source of information other than Owen himself, who even if he's not actively lying, is not a reliable source of information. Maybe I'm wrong and Jonas has more sources, in which case I would love for him to give more details on that.&nbsp;</p>", "parentCommentId": "AWTDmbETuDRiWdZyx", "user": {"username": "Elizabeth"}}, {"_id": "RpwSXTtm6dxLuJzZt", "postedAt": "2024-02-06T13:44:07.279Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Here are (finally) some thoughts:</p><ul><li>Owen clearly doesn't fit the pattern of grandiose narcissism or sociopathy. I could say more about this but I doubt it's anyone's crux, and I prefer to not spend too much time on this.</li><li>Next to grandiose narcissism or sociopathy, there are other patterns how people can systematically cause harm to others. I'm mostly thinking of \"harm through negligence\" rather than with intent (but this isn't to say that grandiose narcissists cause all their harm fully-consciously). Anyway, many of these other patterns IMO involve having a bad theory of mind at least in certain domains. And we've seen that Owen has had this. However, I think it only becomes really vexed/hard to correct if someone (1) lacks a strong desire to improve their understanding of others <i>so as to </i>(i.e., with the prosocial goal being the primary motivation) avoid harming them/to make them more comfortable, or (2) if they are hopelessly bad at improving their understanding of others for reasons other than lacking such a desire in the first place.</li><li>On (1), I'm confident that Owen has a strong desire to improve his understanding of others so as to avoid harming them and make people positively comfortable. I don't remember the specifics, but I remember thinking that he's considerate in a way that many people aren't, which suggests that other people's feelings and comfort is often on his mind (edit) <i>at least in some contexts</i>. (E.g., in conversations about research, he'd often ask if what he's been saying so far is still helpful, or if we should move on to other questions. But more importantly, I think I also noticed signs of scrupulosity related to how he picks words carefully to make sure he doesn't convey the wrong thing, which I think is linked with not wanting to be bad socially or not wanting to come to the wrong conclusions about research relevant to the other party's path to impact.) Sure, people who are scared of social rejection can also be hypervigilant like that, and sometimes it's more people-pleasing than sincere concern, but I also felt like I picked up on \"he's sincerely trying to be helpful\" when talking to him. Though this is more of an intuition-based judgment than anything where I can say \"this specific thing I've observed is the reason.\" (Edit: Actually, one concrete thing that comes to mind is that he was among the very few people who said things about s-risks that made my research priorities seem less important, so he was honest about this in a way that exposes him to me thinking less of him if I were the sort of person who would take stuff like this personally.) Lastly, I think the apology really speaks to all this as well. (That said, I guess someone with cynical priors could point out that the apology might have been written in a very different way if it wasn't for showing it to friends – I doubt that it would be fundamentally different, and in fact I don't even know if he showed it to other people before posting [though I think that would be the wise thing to do]. In any case, I agree it's important to look at whether what people say in their apology is consistent with what we know about them from other situations; anyway, my answer to that is \"yes, feels very consistent.\")</li><li>Regarding (2), I have no doubts that Owen can greatly improve his understanding of others. He seems among the most \"interested in introspection and analyzing social stuff\" men that I've met, and he's very intelligent, so it's not like he lacks the cognitive abilities or interest to improve.</li><li>This leaves us with \"are there other character obstacles that we should expect that would stop him from improving sufficiently?.\" The other negative patterns that I can think of in this domain are:<br>(a.) Extreme entitlement;<br>(b.) being very bad at taking feedback to heart because one \"flinches away\" from bad parts of one's psychology, to the point that all one's introspection is premature and always an exercise in ego protection;<br>(c.) issues with externalizing shame/bad feelings, such as (e.g.) an underlying drive to emotionally control others or \"drag them down to one’s level\" when one is feeling bad;<br>(d.) domain-specific tendency to form strong delusional beliefs, like believing that people who aren't attracted to you are attracted to you, and keeping these even in the light of clear counterevidence.<br>Of the above, I think (c.) doesn't fit the pattern of observed harm in this case here (this would be more relevant in people who make false accusations), so let's focus on (a.), (c.) and (d.)</li><li>Regarding (a.) (\"extreme entitlement\"), I haven’t observed anything that would make me worry that Owen is very entitled. Admittedly, I only know him from a few professional (or semi-professional – e.g., talking in a small group of people after a retreat) context occasions, and I'm not a woman he's attracted to, so I may not have seen all sides. Still, for further consistency of what I already thought about him before all of this based on my intuitions from meeting him, I note that having extreme entitlement would be in tension with not causing bigger issues after being rejected (and it seems like he faced a lot of rejection in these cases), nor is it consistent with writing an apology where the fault isn't placed on other people.</li><li>Regarding (b.) (\"a pattern of habitually flinching away from self-critical thoughts\"), my best guess is that Owen’s interest in introspection is too deep for a person with this issue. (Edit: Also, he partly felt driven to mention his attraction because there was shame attached to it, and even though this made him maybe not think clearly about everything, it's not like, if I understand correctly, that he flinched away from mentioning or at least noticing the shame altogether.) The people I know who exhibited this \"flinching away\" pattern to a severe degree seemed uncomfortable with serious introspection in the first place. They sometimes were very quick to apologize, but they seemed to distort what they were accused of to a point where they were only apologizing for things that are easy to <i>apologize to</i>. By contrast, I feel like Owen's apology admits a bunch of things about himself that aren't easy to say, so it feels like genuine self-work went into it.</li><li>Regarding (d.) (\"motivated cognition dialed up into proper delusions\"), I get that people are concerned about this when they read the accounts of what happened. I am too, a little bit. However, I think that it's not super uncommon to not pick up on people feeling uncomfortable when they try to hint at this discreetly. I also think the instances where Owen kept talking to someone about topics they expressed they wanted him to stop talking about are at most only one or two instances? I feel like if he were severely deluded in the sense of flat-out not cognitively accepting when his advances are rejected, he'd have kept talking to people a lot more than what he actually did? So, I think the levels of motivated cognition here were most likely \"bad, but not too far out of the ordinary\" (i.e., nowhere near \"stalker levels\"), so I'm not too worried about this for the future. We should also keep in mind how this was a big event in Owen's life he's unlikely to forget, and how much updating he's probably been doing (and he also said he's been discussing this stuff with a therapist).</li><li>&nbsp;Lastly, something that goes into my assessment of (d.) that I could imagine other people missing is that I feel I have a good model of what went wrong. In that model, it's not necessary for (d.) (or anything else that would spell trouble) to be pathological about Owen's psychology. Instead, I think what went poorly is primarily explained by (i) bad theory of mind and (ii) character-related scrupulosity that led to persistently bringing up things that were no longer appropriate (or were never appropriate in the first place, such as with some of the comments or locations where things were brought up).</li><li>[Now describing my model.] When people read Owen's account of why he did what he did, one reaction they might have is the following. \"So, okay, he felt attracted to someone, he worried that this attraction would make him a bad person, he wanted to get feedback to reassure himself that he isn't bad for this. So far, so good. But then, out of everyone he could've picked for that conversation, why on earth would he pick the person he's attracted <i>to</i> to discuss this with? Why not discuss it with <i>anyone</i> else? Doesn't that mean there must be some more sinister underlying motive at play? How could 'wanting to be reassured that he isn't bad' be anything but an excuse to make repeated advances?\" My reaction to that interpretation is \"people who think this are probably missing something about what it's like to have character-related scrupulosity.\"</li><li>&nbsp;I'm only speculating here, but it feels like the sort of thing I'm likely right about at least directionally. Namely, my guess is that Owen, over the five or so years that this is about, confessed his attraction also to the women he was attracted to (instead of only seeking out other people to discuss his feelings with) and sought absolution from them<i> </i>partly because he cared particularly about what these women think about him, which was related to him being attracted to them in the first place (meaning he admired them character-wise).</li><li>[Edit: paragraph added roughly 8h after posting the comment] Owen reached out to me (first time we communicated in several years) after I wrote this comment and said he felt seen by this paragraph (the one right above), but that I was missing a further factor. He felt – at the time – like the women in question had moral authority on this topic. Quoting: \"If they didn't mind my attraction, then by their judgement my attraction wasn't bad. If they did mind it, it was bad (and I should take therefore take further internal steps to suppress the feeling).\" Don't take from this that Owen necessarily agrees with all the other descriptions in my long comment, but I wanted to highlight this bit in particular because it sheds more light on why he talked about his attraction to the women directly. I didn't think of this possibility independently, but it seems credible/consistent to me. (I got permission from Owen to share.)</li><li>In some men, it's common to feel like the ultimate judge of your character is a woman with desirable character qualities herself. If you have a strong desire to be trusted and accepted for who you are, not for who others think you are but for who you actually are, it makes sense that you overshare weird details about yourself that you feel the least comfortable about. And someone with obsessive tendencies in that area may make the mistake of doing this too often or in contexts where it isn't appropriate. This is a common motivation (I know because I have the same feelings around some of this), and it IMO explains a lot of what happened, so it's not like we need to postulate other outlier-y things (extreme entitlement, extreme propensity to form delusional beliefs, etc.) to explain why Owen did what he did. (Other than poor theory of mind and common levels of motivated cognition, I mean.)</li><li>Lastly, and ironically, I think part of what caused things to go wrong here is actually protective for avoiding bad outcomes in the future. It makes it so much easier to evaluate someone's character if the person proactively gives you lots of information about it and if one of their primary drives seems to be to help you with that. It serves to rule out a lot of ways someone's character could be, but isn't. (Like, I’m pretty sure if Owen had had any sinister motives besides just having a crush on the women, he'd have confessed those other motives as well to the women in question, and we'd have a bigger scandal.) I think this is a positive thing and one reason I'm drawn to defending Owen here as someone who doesn't know him super well (without saying that he didn't do anything wrong) is because I can easily imagine how other people would react in similar situations, and I want to flag that I like it when people make it easier for others to evaluate them.</li><li>A caveat here is that, as we've seen, a desire to be trusted and act so as to earn trust by proactively doing lots of introspection and sharing negative information by no means implies that someone is free from massive blind spots or self-deception. There's even a hypothesis that people who practice radical honesty and transparency thereby&nbsp;<i>dial up</i> their self-deception –&nbsp;see Holly Elmore’s&nbsp;<a href=\"https://mhollyelmoreblog.wordpress.com/2018/12/12/on-privacy/\"><u>post on privacy</u></a>, which seems relevant here, though (a) \"making oneself transparent on matters relevant to trust\" isn't exactly the same as \"declining to have any sort of privacy in any context,\" and so, (b), I'm not sure I'd say that self-deception is&nbsp;<i>necessarily</i> dialed up in all instances of trying to do&nbsp;the former. Still, it seems plausible that it could come with that sort of <i>risk</i>.) Anyway, despite the concern that self-deception and blind spots remain very much possible/to be expected, I think that people who try to make themselves transparent to have their character more easily evaluated <i>are in fact</i> easier to evaluate for good character than people who don't do that.</li></ul>", "parentCommentId": "LmRdcxuDxw5YEXx7a", "user": {"username": "Lukas_Gloor"}}, {"_id": "ZekGKJFLF8ipSdhy3", "postedAt": "2024-02-06T15:05:52.830Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks for your question, Tiresias. We appreciate people coming to us with concerns, and we absolutely don't want to disincentive people from doing so. And we know that people usually aren’t at their best when they’re in the midst of stressful situations.<br><br>However, we don't think it’s a workable policy to promise never to take action against people who come to us. Many concerns we get involve two or more people who each have complaints about the other's actions. In those cases, we don't want to unfairly advantage the side of the person who raises the topic with us first. Or there could be a concern separate from the problem the person reported. So we have to balance these two considerations.</p>", "parentCommentId": "ndi4GwLCAnn9ejjE9", "user": {"username": "Julia_Wise"}}, {"_id": "kDM4cT59L8yM9ZxWG", "postedAt": "2024-02-07T03:40:47.805Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks for the honest and thoughtful response. I have a couple follow up questions. Since this does occur, I think it would be useful for the community to know what risks they are taking if they choose to report to the CH team.</p>\n<p>I am reading what you stated as \"reporting something to us does not mean that we will never take action against the person who reported to us.\" I see two possible scenarios here, so want to get clarification on what you mean.</p>\n<p>One scenario, James reports something to you. You conclude at some point that James has engaged in misconduct, based on reports from people outside of the CH team. Maybe you collected those reports in the process of investigating James's claim. Maybe someone just separately came to you on an unrelated matter about James. Regardless, it ends up that you have some credibly allege James of misconduct, so you act on that.</p>\n<p>Second scenario, James reports something to you. In talking to James, you find him to be abrasive, unreasonable, and generally quite unpleasant to interact with. You grow to have serious concerns about him based on how he's interacted with you. He's not engaged in any misconduct (eg, he's not sexualy harassing you or anything), just generally displaying an unstable personality. You do not receive any reports of misconduct against James.</p>\n<p>Have you taken action against someone like \"James\" in either scenario? Or just in the first scenario?</p>\n<p>My second question is: Would it be possible for you to share the percentage of time you've taken action against a reporter over the last, say, 5 years?</p>\n<p>Thanks again.</p>\n<p>P.S. This whole OCB scenario seems like it would be very hard, Julia, and I really appreciate how forthcoming you have been about it. While you admit to making mistakes, I hope the wider community sees that the real mistakes in the CH's response came from flawed processes more than from any one individual. We all make mistakes in our jobs, and unfortunately yours are publicized more than most. It's a tough job and I wish you the best</p>\n", "parentCommentId": "ZekGKJFLF8ipSdhy3", "user": {"username": "Masha Winchell"}}, {"_id": "GmrbS7dhwPbiZsjfB", "postedAt": "2024-02-12T10:55:23.440Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": "<p>Thanks for this comment. I think I agree with a lot of what you say, and wanted to clarify that I am not saying people should pick sides. I just wanted to point out the imbalance of total personal support expressed for each \"side\", without implying that you can't show support for both.</p>", "parentCommentId": "emNj7FMnDfDeStCiZ", "user": {"username": "alix.pham"}}, {"_id": "G5NpSHtLoLJpMkgsy", "postedAt": "2024-01-30T08:08:34.405Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": null, "parentCommentId": "S9uoowghDo7bANL6F", "user": null}, {"_id": "t8BYyyFxbLnExAJ9o", "postedAt": "2024-01-30T20:59:11.539Z", "postId": "4CBoJ5jgmGfdMFnAE", "htmlBody": null, "parentCommentId": "DRX9vHqppmAttqhG7", "user": null}]