[{"_id": "JqnKxdGRLe3SMqbNp", "postedAt": "2017-10-23T20:28:06.497Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I've posted about <a href=\"https://www.lesserwrong.com/posts/KttF9b9MRgKxDWrZZ/agi-estimation\">an approach to AGI estimation</a>. </p>\n<p>I would love to find collaborators on this kind of thing. In London would be great.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "jFZQzhfoPq5ki693J", "postedAt": "2017-10-23T23:53:40.950Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p><a href=\"https://www.lesserwrong.com/\">LW 2.0</a> now exists. It's still in beta, with a significant number of bugs left to fix and many features that haven't been added yet, but at some point it will become stable enough that it would be reasonable to consider switching. I'm curious what people think about this? Just thought that I'd flag this now.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "WPoNWEiELzB4QGcPc", "postedAt": "2017-10-25T19:01:47.689Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I recently wrote about if <a href=\"https://mapandterritory.org/is-feedback-suffering-cf18006deca8\">generic feedback processes might produce suffering</a>. I'm working on a follow up post now so interested especially in things I didn't address that people would like to see addressed.</p>\n", "parentCommentId": null, "user": {"username": "gworley3"}}, {"_id": "TD9drRHEztqQ8dide", "postedAt": "2017-10-25T19:04:27.108Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>My guess is that it probably makes sense to keep the brands separate even if they are intertwined. That does mean there may be a lot of cross posting or posting things in one location when they would have done better in the other. Unless LW 2.0 has some plans I'm unaware of to support branded sub-groups so EA could have its own identity on the LW platform.</p>\n", "parentCommentId": "jFZQzhfoPq5ki693J", "user": {"username": "gworley3"}}, {"_id": "7i4aaCCeZDZ3nf2F3", "postedAt": "2017-10-25T21:03:14.921Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I meant keeping the site separate, but changing the tech underneath.</p>\n", "parentCommentId": "TD9drRHEztqQ8dide", "user": {"username": "casebash"}}, {"_id": "7p46GEfqHrsCRWY6y", "postedAt": "2017-10-26T11:05:18.339Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I have a query regarding DALYs which I've been unable to find an answer too, but suspect there is literature on were I more familiar with econ/global health:</p>\n<p>By my understanding one of the main advantages of DALYs is that they capture the intuition action in cases like &quot;You may extend either person As life by 5 healthy years or extend person Bs life by 5 mediocre years (lets say they go blind due to the treatment).&quot;</p>\n<p>However, there seems to be no way of distinguishing the case where person A and B start of as perfectly healthy and we may help the former more and the cases where B is already blind and we may add &quot;five years at their current state of well-being&quot;. This seems to not be ideal.</p>\n<p>Is there any talk or use of &quot;marginal DALYs&quot; for want of a better term, where the intervention is considered relative to the previous level of wellbeing? Alternatively, is it simply common practise to use QALYs in the kind of case I am concerned with?</p>\n", "parentCommentId": null, "user": {"username": "ELW"}}, {"_id": "XtXnZBAoH6dbDT9qa", "postedAt": "2017-10-26T14:05:25.269Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<blockquote>\n<p>However, there seems to be no way of distinguishing the case where person A and B start of as perfectly healthy and we may help the former more</p>\n</blockquote>\n<p>If you improve the number of years lived for a healthy person, that is &quot;straightforward&quot; on the DALY view -- it's +1 DALY for every extra year of life added.</p>\n<p>The question of <em>improving</em> the <em>quality</em> of their life is a harder one -- I think the suggestion from the DALY framework is that if the person has perfect health, there isn't any way to improve the quality of their life (because it's already perfect). ...However, we know that's not actually true, because there is no DALY weight for getting tickets to go see Hamilton, while I think that would improve nearly anyone's life. That's just an area where DALY metrics are incomplete, but you could extend the DALY framework that way, by asking people questions like &quot;If you could choose between an free Hamilton tickets but had a 1% chance of death, would you take the tickets?&quot; (I'd probably take the tickets at a 0.005% chance of death.)</p>\n<p>-</p>\n<blockquote>\n<p>and the cases where B is already blind and we may add &quot;five years at their current state of well-being&quot;. This seems to not be ideal.</p>\n</blockquote>\n<p>This one is also &quot;straightforward&quot; in the DALY view -- you're adding more years at their current disability weight. If I recall correctly, an extra year of life that would otherwise not have been lived, but lived with blindness is worth +0.8 DALY. Thus adding &quot;five years at their current state of well-being&quot; (that is, blindness but no other issues), would be +4 DALY.</p>\n", "parentCommentId": "7p46GEfqHrsCRWY6y", "user": {"username": "Peter_Hurford"}}, {"_id": "3HhB4SKJzhrKGwTtt", "postedAt": "2017-10-26T14:06:44.654Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I'd want to wait for more info on how LW 2.0 plays out. The EA Forum doesn't seem broken in any way right now, so I don't think there's a rush to switch over the backend.</p>\n", "parentCommentId": "jFZQzhfoPq5ki693J", "user": {"username": "Peter_Hurford"}}, {"_id": "LvWWqe3tpeD6W9GN3", "postedAt": "2017-10-27T21:12:18.049Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I made a list of what I call &quot;life gems&quot; - those rare and precious things in my life that were easily introduced and have enabled me to &quot;level up&quot; in the amount of positive impact I create. It's obviously not exhaustive, but I started it ~3 months ago and have been adding to it since as things occur to me.</p>\n<p>On motivation:</p>\n<ul>\n<li><p>The System 1 / System 2 framework</p>\n</li>\n<li><p>Audiobooks - I otherwise struggle to get through books (h/t Sarah Morgan?)</p>\n</li>\n<li><p>Token payments to an EA friend every time I continue a bad habit or fail to sustain a regular, good habit (h/t Niel Bowerman and Sam Hilton)</p>\n</li>\n<li><p>Planning when exactly I will work on tasks so that my current to-do list is always short, otherwise I am tempted to do the quick - and usually less important - tasks in order to shorten the list as quickly as possible (h/t Sam Hilton)</p>\n</li>\n</ul>\n<p>On rationality:</p>\n<ul>\n<li>The 'regression to the mean' phenomenon (h/t Toby Ord)</li>\n</ul>\n<p>On practical ethics:</p>\n<ul>\n<li><p>The idea of astronomical waste (h/t Ben Hoskin and Nick Bostrom)</p>\n</li>\n<li><p>The idea that if you're not sure where your meat comes from, the harm of factory farming is so great that you should hardly ever take the chance - this is what first made me a vegetarian (h/t a conversation with Marc Crosby although it may be significant that it was still me who came up with the argument)</p>\n</li>\n<li><p>Figures comparing direct suffering caused by various animal foods (h/t Brian Tomasik)</p>\n</li>\n<li><p>The implication of the prevalence of r-selected species for wild animal suffering (h/t probably Oscar Horta, David Pearce or Brian Tomasik)</p>\n</li>\n<li><p>&quot;A quick test of the assertion that enjoyment outweighs pain in this world, or that they are at any rate balanced, would be to compare the feelings of an animal engaged in eating another with those of the animal being eaten.&quot; (h/t Brian Tomasik and Schopenhauer)</p>\n</li>\n<li><p>Graphs comparing what we'd be prepared to pay for an extra QALY for ourselves, vs what we actually pay for ourselves, vs what the NHS would pay for others, vs what various HIV treatments/prevention methods cost, vs what deworming costs (h/t Toby Ord) </p>\n</li>\n<li><p>The idea that contributing to collective action has value because of the small chance that you tip the balance (h/t Toby Ord)</p>\n</li>\n<li><p>The idea that you should choose a cause to focus your career on before thinking about your comparative advantage, because the scale of the differences between causes dwarfs the scale of the differences in your future talents (h/t 80,000 Hours)</p>\n</li>\n<li><p>The idea that doing good now through donating and direct work at the expense of investing in yourself long-term implies a surprisingly low confidence in the altruism of your future self (h/t Robin Hanson)</p>\n</li>\n<li><p>The idea that the way you evaluate a startup is different from the way you evaluate an established organisation (h/t Rochelle Harris and CEA)</p>\n</li>\n</ul>\n<p>On normative ethics:</p>\n<ul>\n<li>The realisation that deontology and virtue ethics collapse into consequentialism much more easily than one of the other ways around</li>\n</ul>\n<p>On metaethics:</p>\n<ul>\n<li>The argument that &quot;If nihilism is true, it doesn't matter what I do, so I might as well assume it's false.&quot; (h/t DanielLC)</li>\n</ul>\n<p>On teamwork:</p>\n<ul>\n<li><p>The notion of having a 'blaming mindset' - giving it a bad name helps me to recognise and stop it (h/t Adam Freeman)</p>\n</li>\n<li><p>The notion that everyone is just fighting a hard battle (h/t Will Jefferson and Ian Maclaren)</p>\n</li>\n</ul>\n<p>On my social life:</p>\n<ul>\n<li>The notion of permanent singlehood as a lifestyle choice</li>\n</ul>\n<p>On money:</p>\n<ul>\n<li>An awareness of the risks of developing expensive new habits / increased standards of living i.e. huge future expense for temporary boost in happiness thanks to the hedonic treadmill</li>\n</ul>\n<p>On everything:</p>\n<ul>\n<li>Committing to weekly reviews with someone else that include the question &quot;How can we improve this process?&quot; (h/t Niel Bowerman and Sam Hilton)</li>\n</ul>\n<p>It's a good exercise. It helps you have more realistic expectations of how much future self-improvement you can expect, or how often you will be able to really help someone else improve. The content is interesting too, as indications of what efforts you and others could make to help someone else become more impactful.</p>\n", "parentCommentId": null, "user": null}, {"_id": "BZtuuB9yPzDPJe4wB", "postedAt": "2017-11-02T21:08:55.661Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>The recent quality of posts has been absolutely stellar*. Keep it up everyone!</p>\n<p>*interesting, varied, informative, written to be helpful/useful, rigorous, etc</p>\n", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "2qxdHisSEPE5mmHAv", "postedAt": "2017-11-05T20:44:34.102Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I've written up some notes from EA Global London – anyone who attended (or indeed spoke at) the conference should feel free to add/edit!</p>\n<p><a href=\"https://docs.google.com/document/d/1v5DDS90tCFe6EbxEzR7G6CCkDjcHoYXzcXuaVtGNdcQ/edit?usp=sharing\">https://docs.google.com/document/d/1v5DDS90tCFe6EbxEzR7G6CCkDjcHoYXzcXuaVtGNdcQ/edit?usp=sharing</a></p>\n", "parentCommentId": null, "user": {"username": "HenryStanley"}}, {"_id": "sEdLwnE69p2rBiD94", "postedAt": "2017-11-07T02:51:58.283Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi everyone!</p>\n<p>I'm new to EA, but after reading 80,000 Hours and Doing Good Better, I'm eager to incorporate these ideas into my life. I find it amusing that I discovered EA shortly after getting accepted into medical school, since doctors have often come up as the prototypical example for being counter-intuitively ineffective. I don't think this is unrelated to the lack of fulfillment and jadedness that many doctors eventually come to experience, and I've since been consumed by the desire to find a promising way to avoid this trap. I think EA offers a compelling perspective, one which gives me inspiring and explicit suggestions for directing my time and resources.</p>\n<p>At my school, we're required to conduct an independent research project on any medically-related topic of our choosing by the time we graduate. I've decided to use this as an opportunity to delve deeper into EA as it relates to my future career as a physician, and ideally, to form connections with individuals who can help me towards my altruistic goals in the future. Some topics I've considered include examining the ways that physicians make a difference other than earning to give, identifying the different metrics by which to measure a physician's impact, and interviewing specific physicians who accomplish impactful goals. As you've probably already noticed, these topics are extremely broad, and I was hoping that members here might offer suggestions for specific research questions that I could investigate - ideally something that is as of yet under or unexplored. While I've read many great suggestions on how to navigate careers, I'm interested in learning more about how this applies to the practicing physician. I would also be interested to hear from/about doctors who have chartered their own unique path towards making a difference, challenging the typical template for what a medical doctor looks like. Any ideas would be greatly appreciated!</p>\n<p>Thanks,</p>\n<p>Michael</p>\n", "parentCommentId": null, "user": {"username": "dponce"}}, {"_id": "Gy9Khonx9NXkbrW3c", "postedAt": "2017-11-07T15:58:44.902Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi, I'm planning a post on finding relevant literature (I'm a librarian), as well as using reference management software to save time. Does anyone have any great suggestions for places they go for academic writing on EA-related topics, or for datasets? I'm thinking things beyond Google Scholar/Arxiv/JSTOR. All input valued.</p>\n", "parentCommentId": null, "user": {"username": "kastrel"}}, {"_id": "qYZySMNiJYx6b9mtt", "postedAt": "2017-11-24T23:16:57.011Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>You might find this group useful (once it get's a bit bigger)\n<a href=\"https://www.facebook.com/groups/HealthEA/\">https://www.facebook.com/groups/HealthEA/</a></p>\n", "parentCommentId": "sEdLwnE69p2rBiD94", "user": {"username": "DavidNash"}}, {"_id": "ycqeTMATaBc8iW4Yw", "postedAt": "2017-12-02T22:28:18.561Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I'm thinking about funding an analysis of the link between autonomy and happiness.</p>\n<p>I have seen papers like</p>\n<p><a href=\"https://academic.oup.com/heapro/article/28/2/166/661129\">https://academic.oup.com/heapro/article/28/2/166/661129</a></p>\n<p>and <a href=\"http://www.apa.org/pubs/journals/releases/psp-101-1-164.pdf\">http://www.apa.org/pubs/journals/releases/psp-101-1-164.pdf</a></p>\n<p>I am interested in how reproducible and reliable they are and I was wondering if I could convert money into an analysis of the methodology used in (some of) these papers. </p>\n<p>As I respect EA's analytical skills (and hope their is a shared interest in happiness and truth), I thought I would ask here.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "9Cdon4yeFcy9BNdSg", "postedAt": "2017-12-03T07:06:41.405Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Thanks Will Pearson for creating this open thread!</p>\n<p>Hi EA Community,</p>\n<p>I recently heard about this forum and would like to share a pitch for your consideration. It relates to our need as a global community to address human population growth by tasking every nation with the responsibility to stabilize their population at a sustainable level.</p>\n<p>Feedback is welcome and appreciated. Thank you.</p>\n<p>THE PITCH</p>\n<p>Goal\nTo catalyze an international campaign that leads to the UN establishing a Framework Convention on Population Growth. Further, the goal I have in mind is to present a joint international position statement with signatory organizations and/or individuals representing countries from every inhabited continent to the UN in 2018 prior to COP24 and UNEA-4.</p>\n<p>Note: I would like to attend the 2018 meeting of the UN's Commission on Population and Development in April and am seeking fellow supporters to join me.</p>\n<p>Context\nSeveral environment-related international treaties exist today, yet none of them address the root cause of our oversized demands on the planet: human overpopulation. Every country deserves a voice at the table and this would provide them that opportunity.</p>\n<p>We as a global community can't view the UN's population growth projections as destiny -- 9.8 billion people in the year 2050 should be viewed as wholly unacceptable if we're keeping future generations and other species as well as our own livelihoods in mind. The earth simply can't support this. We are choosing short-term aggregate economic growth over long-term environmental, economic, political, social, and cultural stability, putting the future habitability of the entire planet in jeopardy. We know this is true and such knowledge demands action.</p>\n<p>My thought is, if we can get human overpopulation + continued growth to be formally recognized by the UN as a global issue that must be addressed via national population policies (like the NDCs for the Paris Agreement), then people around the world will become more amenable to openly discussing local population matters, such as unintended pregnancy rates, sexuality education programs, access to family planning information and services, and migration, as well as foreign aid and economic justice.</p>\n<p>Vision\nMy vision for the UN treaty is that it would formally recognize existing human overpopulation + continued growth -- within the context of the IPAT formula -- as a significant environmental issue and existential threat to the survival of humanity (one of several, to be sure). It would also promote a 3-pronged solution at national and international levels to achieve the goal of sustainable populations in every country.</p>\n<p>3-pronged solution\n(1) Emphasize education about the issue of existing human overpopulation + continued growth, including why it poses an existential threat and why embracing small families to achieve a global TFR below 2.0 for the foreseeable future is an essential component of the solution.\n(2) Prioritize the &quot;ease of access&quot; model of fertility decline, which appears to fit every country's situation and addresses the goals of rapid fertility decline followed by sustained sub-replacement fertility rates by way of freedom to make informed family size choices, not coercion.\n(3) Promote smaller &quot;normal&quot; family sizes -- we need to establish a new normal for the Anthropocene.</p>\n<p>Underlying this 3-pronged solution are the 5 principles presented in a paper written by Population Matters Director Robin Maynard. The 5 principles are (1) Universality, (2) Proportionality, (3) Equity, (4) Equality, and (5) Choice. [<a href=\"http://robinmaynard.com/portfolio/population-matters/]\">http://robinmaynard.com/portfolio/population-matters/]</a></p>\n<p>For solution (2) above, the keynote address by Martha Campbell from Population &amp; Sustainability Network's first annual meeting in 2005 provides helpful context.</p>\n<p>For all 3 elements of the solution, Population Media Center President Bill Ryerson's essay from the 2010 Post Carbon Reader Series provides excellent context. [<a href=\"http://mahb.stanford.edu/wp-content/uploads/2014/02/2010_Ryerson_TheMultiplierofEverythingElse_PostCarbonReaderSeries.pdf]\">http://mahb.stanford.edu/wp-content/uploads/2014/02/2010_Ryerson_TheMultiplierofEverythingElse_PostCarbonReaderSeries.pdf]</a></p>\n<p>Top reasons for pursuing a treaty through the UN\n(1) To tell the story, the &quot;whole truth&quot; about human overpopulation</p>\n<p>Great opportunity to tell the human overpopulation story, to share the story with a global audience including world leaders and members of the general public, and to publicly and formally assert that human overpopulation is solvable by embracing small families* for the foreseeable future.</p>\n<p>(2) To bring the term &quot;overpopulation&quot; and the existing reality of human overpopulation into the mainstream</p>\n<p>The UN is recognized globally as a lawful, mainstream international governing body. Formal UN recognition of existing human overpopulation and the solution of embracing small families* could help legitimize the issue and the solution in the eyes of world leaders as well as members of the general public.</p>\n<p>(3) To make national population policies necessary and politically expedient</p>\n<p>The Paris Agreement has helped apply pressure on governments and the private sector to &quot;act on climate change&quot;. Efforts to date have been somewhat misguided since they are focused on &quot;downstream&quot; issues, and that's precisely why our cause could benefit from having a similar international accord -- hopefully one that is universally ratified -- that prioritizes action specifically on human overpopulation and highlights the clear, compassionate solution: embracing small families*. As our colleague Karen Shragg likes to say, if we don't act on overpopulation then all of our other efforts will never be enough.</p>\n<ul>\n<li>It's worth noting that I don't believe this treaty should be overly prescriptive about particular family sizes. I'm including a &quot;1 child, on average&quot; clarification to describe what constitutes a small family as an unofficial, prudent guideline given the depth of overshoot we're already in. While I'm envisioning this as a non legally binding international accord, it seems like it's high time that we explicitly encourage those family size decisions that will most benefit our shared cause within a reasonable time horizon given the other existential threats we currently face. The &quot;1 child, on average&quot; clarification takes into account the (at least narrowly) accepted notion that 0 children is fine, 1 child is good, and 2 children is enough.</li>\n</ul>\n<p>Language\nThe specific language used in the treaty (and even preliminary documents as the campaign grows) will likely make or break this initiative. Population size and growth are understandably sensitive issues, and to ignore this is likely to accept failure. Fortunately, I don't have any deep ties to particular terms (e.g. overpopulation) and have no issue challenging those that do. I want big results (as we all do), and the language that will best allow us to get there with a mutual understanding among all member states is the language we should use. Winning some &quot;battles&quot; should not be misinterpreted as winning the &quot;war&quot;. Winning the &quot;war&quot; is the focus of this initiative, which I believe will be achieved by breaking the mainstream silence on human overpopulation and the resultant overshoot compassionately.</p>\n", "parentCommentId": null, "user": {"username": "rdharding2"}}, {"_id": "gxTPniYMpbLj7aSfv", "postedAt": "2017-12-04T19:45:47.511Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Is there an Effective Altruism wiki? I found this one: <a href=\"http://effective-altruism.wikia.com/wiki/Effective_Altruism_Wiki\">http://effective-altruism.wikia.com/wiki/Effective_Altruism_Wiki</a> but the URL that it asks you to go to doesn't take you anywhere. </p>\n<p>I am sorta new to the EA movement. I think contributing to a wiki will help me learn more. Plus as a non-native English speaker trying to improve English writing skills, I think contributing to a Wiki can be useful to me. So where is the Wiki? If not, shouldn't we start one or improve the aforementioned wikia page?</p>\n", "parentCommentId": null, "user": {"username": "Venkatesh"}}, {"_id": "xDGCyxxxYsaYXocLD", "postedAt": "2017-12-04T21:14:45.565Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>According to <a href=\"https://www.reddit.com/r/EffectiveAltruism/comments/6tjddf/what_happened_to_wikieffectivealtruismhubcom_is/\">this reddit thread</a>:</p>\n<blockquote>\n<p>The EA Hub team had to take down a few sites because of a CPU overuse error. Until they work out what the problem is and an alternative, some sites will have to stay offline. An archive has been retained.</p>\n</blockquote>\n", "parentCommentId": "gxTPniYMpbLj7aSfv", "user": {"username": "MetricSulfateFive"}}, {"_id": "TQMyiLBzi5vDYYjgF", "postedAt": "2017-12-04T21:22:59.583Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Right. I sent a message via the contact page in the EA Hub Website. Maybe I will get an update on what is going on.</p>\n", "parentCommentId": "xDGCyxxxYsaYXocLD", "user": {"username": "Venkatesh"}}, {"_id": "fRuvns3npuMeHyCyP", "postedAt": "2017-12-29T22:05:34.138Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I posted a couple months ago that I was working on an effective altruism board game. You can now order a copy <a href=\"https://www.kickstarter.com/projects/655575278/the-life-you-can-lead-game?ref=8wwivn&amp;token=60f41081\">online</a>! </p>\n<p>To recap:</p>\n<ul>\n<li><p>it's a cooperative game where you start out as a random human sampled from the real-world distribution of income</p>\n</li>\n<li><p>try to get lots of human QALYs and animal QALYs and reduce existential risk</p>\n</li>\n<li><p>all while answering EA-related trivia questions, donating to effective charities, partaking in classic philosophy thought experiments, realizing your own private morality and</p>\n</li>\n<li><p>try to avoid being turned into a chicken.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "JamesDrain"}}, {"_id": "FSHJ4EWPrsWzexqGw", "postedAt": "2017-12-31T21:00:59.231Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<h2>Stats, or Software?</h2>\n<p>Hey guys, I might make this a full post later but I realllly need advice.</p>\n<p>I am a software developer with a BA in Ecomonics and Int'l Studies. I became a dev cause I needed a job terribly and didnt have any connections to orgs I was really passionate about. Ive been thrilled to learn programming can really help people! But im starting to get the vibe that data science and statistics might do a bit more damage.</p>\n<p>What do ya'll think? How do I approach my developing my skillset without getting too distracted? I love stat and I love programming, want to help the most people. Im specifically interested in economic empowerment.</p>\n<p>Ive read chunks of the fantastic material on 80k but would love to hear some arguments and stories that pit the two options against each other more closely.</p>\n<p>Im Denver based if anyone want to chat about this over a beer or food ;)</p>\n", "parentCommentId": null, "user": {"username": "VinceB"}}, {"_id": "qqohkXSAHEszupJEw", "postedAt": "2018-01-05T15:22:40.886Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi guys, I wanted to make you aware of a global online debate on the governance of AI by a Harvard-incubated think-tank.</p>\n<p>For background, I’m a French EA, and I recently decided to work on AI policy as it is a pressing and neglected issue. I’ve been working for The Future Society for a few weeks already and would like to share with you this opportunity to impact policy-making. <a href=\"http://www.thefuturesociety.org/\">The Future Society at Harvard Kennedy School</a> is a think tank dedicated to the governance of emerging advanced technologies. It has partnerships with the Future of Life Institute and the Centre for the Study of Existential Risk. </p>\n<p>The think-tank provides an participatory debate platform to people all around the world\nThe objective is to craft actionable and ethical policies that will be delivered in a White Paper, to the White House, the OECD, the European Union and other policymaking institutions that the think-tank is working with.</p>\n<p>Because we know AI policy is hard, the idea is to use collective intelligence to provide innovative and reasonable policies. The debate is hosted on an open source collective intelligence software resulting from a research project funded by the European Commission, technologically supported by MIT. It’s based on research on collective intelligence, going from open and exploratory questions to more in-depth discussions. Right now, we are in the “Ideation” phase, which is very open. You can make constructive answers and debate with other people who are also interested in crafting AI Policies with instant translation.</p>\n<p>The platform is like an online forum articulated around several issues, both short-term and long-term oriented. You have six themes, including “AI Safety and Security”, “Reinvent Man &amp; Machine Relationship” and “Governance Framework”. </p>\n<p>So far, most of the answers have been very constructive. But with you guys… it can be even better.</p>\n<p>Because you are EAs, I really wanted to pick your brains!</p>\n<p>It would be great if you guys could participate, on the topic you’re most interested in, knowing that a) it will be impactful b) you will be able to challenge your thoughts with other people passionate about AI social impacts. Of course, you don’t have to talk about AI safety if you’d rather focus on other topics.</p>\n<p>Also, the more EAs, the merrier. Or rather, the more impactful! </p>\n<p>So please connect on the debate, and participate!!</p>\n<p><a href=\"https://assembl-civic.bluenove.com/ai-consultation/debate/thread\">Debate is here</a></p>\n", "parentCommentId": null, "user": {"username": "CarolineJ"}}, {"_id": "LTbpDRZ8phMm3HR5v", "postedAt": "2018-01-06T18:27:29.195Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hey all. I have a personal challenge. \nI'm a student from Iran. And I want to be a more effective altruist. However I'm not sure how. So here are a few points to consider:\n1.There are no channels like givewell.org for charities here. And most charities are horrible at best here. </p>\n<ol>\n<li>As Iran is boycotted, sending money overseas is rather hard and inefficient (though more efficient than local charities)</li>\n<li>as an student, I have little money to spare (few dollars every week).   </li>\n<li>Also as a double majors student, I have no time time to spare as well. So money is all I can do. </li>\n</ol>\n<p>So what can I do? </p>\n", "parentCommentId": null, "user": {"username": "amirography"}}, {"_id": "YKCSRfL2wKCLJZ4fp", "postedAt": "2018-01-14T07:18:13.538Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Is there any forum online where individuals can put their personal circumstances/choices/options up for discussion? Kind of like the 80 000 Hours coaching service, but since they don't have the resources to advise everyone, more of a crowd-sourced effort where someone could say &quot;I'm in this situation, considering X, Y or Z, can anyone provide opinions/experiences/perspectives/alternatives I may not have thought of?&quot; </p>\n<p>I was kind of hoping this forum would be like that, but it seems like it's more academic - and the posts are very interesting and high-quality, so I wouldn't want to see it spammed up with thousands of personal questions. But is there anywhere else on the internet where people can ask this stuff? I have literally been asking careers counsellors since high school how I can make an impact on the world, and they haven´t necessarily had the best info. </p>\n", "parentCommentId": null, "user": {"username": "some_arts_student"}}, {"_id": "c3bM82NfDjWBsjoYh", "postedAt": "2018-01-24T16:11:35.195Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>When I was preparing my recent forum post, it doubled itself if I tried to edit it after posting. Also, the &quot;upload an image&quot; box is very user unfriendly. I could not figure it out.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "vfWygw2PaWbrFbnph", "postedAt": "2018-01-30T15:53:58.380Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<blockquote>\n<p>Figures comparing direct suffering caused by various animal foods (h/t Brian Tomasik)</p>\n</blockquote>\n<p><a href=\"http://reducing-suffering.org/how-much-direct-suffering-is-caused-by-various-animal-foods/\">This was the thing that made me go vegetarian.</a></p>\n", "parentCommentId": "LvWWqe3tpeD6W9GN3", "user": {"username": "HenryStanley"}}, {"_id": "genEsWdY94e3yjN5x", "postedAt": "2018-02-03T11:16:09.026Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Do you know of organisations, that take donations, and that are at least to some extent dedicated to the building and maintenance of roads in poor regions?\f</p>\n<p>The only organisation that i have found that at least somewhat falls into this category is the german organisation <a href=\"https://www.welthungerhilfe.de/\">welthungerhilfe</a>.</p>\n<p>--</p>\n<p>Background:</p>\n<p>I believe that the role of a proper road system is strongly underappreciated in development aid. What arteries are to the human body, roads are to a continent. The arteries transport all the different nutrients and elements that are required by the human body to all its different locations; similarly roads transport all the various goods of a continent to where they are needed.</p>\n<p>If the road systems are in poor shape, so is the economy; as a result there is poverty. Roads in africa, for example, are often so bad that it takes hours just to drive a few kilometers. A good road system, however, widens the markets; trade can develop, which again spurs motivation, specialisation, innovation and ultimately living standards.</p>\n<p>As a result I have been looking for organisations that are dedicated at least to some extent to the set up of good road systems in poor regions.</p>\n<p>--</p>\n<p>Relevant links:</p>\n<ul>\n<li><a href=\"http://12.000.scripts.mit.edu/mission2014/solutions/roads-in-sub-saharan-africa\">12.000.scripts.mit.edu/mission2014/solutions/roads-in-sub-saharan-africa</a></li>\n<li><a href=\"https://www.amazon.com/Role-Transportation-Industrial-Revolution-Comparison/dp/B01K94GVWM/\">amazon.com/Role-Transportation-Industrial-Revolution-Comparison/dp/B01K94GVWM/</a> (the review at the bottom of the page gives a good summary)</li>\n<li><a href=\"https://csr21.org/content/reporting-west-africa-where-are-road-building-ngos\">csr21.org/content/reporting-west-africa-where-are-road-building-ngos</a></li>\n</ul>\n", "parentCommentId": null, "user": {"username": "walter1980"}}, {"_id": "44B7zTbHeZXHtnBBc", "postedAt": "2018-02-07T23:00:59.924Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>very neglected climate cause\n(an e-mail I wrote) </p>\n<p>Hello Professors A and B, </p>\n<p>Earlier this year I looked over a paper that was published in 2010 called &quot;An adaptability limit to climate change due to heat stress”. It made a strong impression on me. I think heat stress must be the biggest danger to human beings from climate change. If a region becomes uninhabitable, or at least uninhabitable to folks too poor to afford air conditioning, that trumps everything else. </p>\n<p>I wrote to you because I am puzzled that journalists and researchers do not seem to agree. For example in this article</p>\n<p><a href=\"https://www.vox.com/science-and-health/2017/1/9/14186328/risks-climate-change-graph\">https://www.vox.com/science-and-health/2017/1/9/14186328/risks-climate-change-graph</a></p>\n<p>David Roberts says, &quot;The risks of climate change are not easy to communicate clearly. Since the atmosphere affects everything, everything will be affected by its warming — there’s no single risk, but a wide and varied array of risks, of different severities and scales, affecting different systems, unfolding on different timelines. It’s difficult to convey to a layperson, at least without droning on and on.”</p>\n<p>To me this sounds stupid. Partly this is because I am mostly concerned about the United States and a few other countries that I have some connection to. I am less concerned about saving the whale or preserving nature for its own sake. Okay, so maybe Roberts and I just disagree about values. (Explanations of social trends, let alone predictions, with many moving parts also seem suspect to me, i.e. <a href=\"http://slatestarcodex.com/2015/02/14/how-likely-are-multifactorial-trends/\">http://slatestarcodex.com/2015/02/14/how-likely-are-multifactorial-trends/</a> )</p>\n<p>But even the economic literature on climate seems flawed. I think Professor Martin Weitzman was correct in this paper when he said, &quot;we might be underestimating considerably the welfare losses from uncertainty by using a quadratic damages function and/or a thintailed temperature distribution.” </p>\n<p><a href=\"http://docplayer.net/20146089-Ghg-targets-as-insurance-against-catastrophic-climate-damages.html\">http://docplayer.net/20146089-Ghg-targets-as-insurance-against-catastrophic-climate-damages.html</a>\nThat paper talks about perhaps losing 50% of GDP. </p>\n<p>There was a study that came out this year on heat stress in the United States. It extrapolated the changes in mortality from past hot days. But if there are days unlike any we have seen before, days where the wet bulb temperature approaches or exceeds human limits, then this extrapolation is not accurate. </p>\n<p><a href=\"https://www.nytimes.com/interactive/2017/06/29/climate/southern-states-worse-climate-effects.html\">https://www.nytimes.com/interactive/2017/06/29/climate/southern-states-worse-climate-effects.html</a> (flawed) \n<a href=\"http://www.sciencedirect.com/science/article/pii/S0095069611001033\">http://www.sciencedirect.com/science/article/pii/S0095069611001033</a> (flawed) \n<a href=\"http://www.pnas.org/content/114/15/3861.short\">http://www.pnas.org/content/114/15/3861.short</a> (on nonlinearity) </p>\n<p>Also I do not see any research on future adaptation to heat stress. I did find this paper on past adaptations: </p>\n<p><a href=\"http://www.nber.org/papers/w18692\">http://www.nber.org/papers/w18692</a></p>\n<p>To sum up, I don’t understand why even many supposedly more pessimistic studies like the Stern Review don’t take into account heat stress at all. I don’t understand why the study that made headlines this year in the New York Times ignores the issue of the wet bulb limit. I don’t understand why more hasn’t been done on future adaptation to heat stress. I also don’t see why heat stress doesn’t have a higher profile in activist organizations trying to fight climate change and among people in the media. </p>\n<p>I hope you can share with me your views on these questions. </p>\n<p>Thank you, </p>\n", "parentCommentId": null, "user": {"username": "nobody"}}, {"_id": "mRErxoeJRxgxNatEo", "postedAt": "2018-02-12T16:46:43.689Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>That was great, I've read about a lot of those things already, but it gave me some more reading material. Fantastic! </p>\n<p>The one I'd never really heard anyone say was &quot;An awareness of the risks of developing expensive new habits / increased standards of living i.e. huge future expense for temporary boost in happiness thanks to the hedonic treadmill.&quot; - Where did that idea come from?</p>\n", "parentCommentId": "LvWWqe3tpeD6W9GN3", "user": {"username": "turnercore"}}, {"_id": "Wpvzbg32XmWNMCr3c", "postedAt": "2018-02-12T16:49:04.589Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>If you put on a donation event, is it better to keep donations for global EA causes, or to tie the event in with a logical charity (art charity for art event, or a local charity). I prefer EA causes, but the event might be weaker since most people don't think in an EA way. I don't want to ruin the good for want of the perfect. What would you do?</p>\n", "parentCommentId": null, "user": {"username": "turnercore"}}, {"_id": "Hduw2anCjcPndgBQC", "postedAt": "2018-02-12T21:15:54.806Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I'm thinking about radically more secure computer architectures as a cause area.</p>\n<ol>\n<li>Radical architecture changes are neglected because it hard to change computer architecture</li>\n<li>Bad Computer security costs a fair amount at the moment</li>\n<li>Having a computer architecture that is insecure is making it hard to adopt more useful technology like Internet of Things.</li>\n</ol>\n<p>I'd be interested in doing an analysis of whether it is effective altruistic cause. I'm just doing it as a <a href=\"https://offpistearchitecture.wordpress.com/\">hobby</a> at the moment. Anyone interested in the same region want to collaborate?</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "Ai6mptez96SE8BWQe", "postedAt": "2018-02-13T00:41:50.822Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I suppose a variety of places, and it's just particularly relevant to people who try to donate what they can. The term &quot;hedonic treadmill&quot; I probably first encountered via felicifia.org or David Pearce.</p>\n", "parentCommentId": "mRErxoeJRxgxNatEo", "user": null}, {"_id": "nHzK82y9zdMXQLJbk", "postedAt": "2018-02-13T05:56:40.210Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hello! </p>\n<p>I'm a student and iOS developer and I'm fairly new to the EA community. I'm willing to offer some of my time pro-bono in helping to build iOS apps for EA-related projects. Please let me know if there are any projects that you know of that require help in this field, via comments or messages! </p>\n<p>Thanks!</p>\n", "parentCommentId": null, "user": {"username": "iossc"}}, {"_id": "49KumJBX82peMReuP", "postedAt": "2018-02-13T16:18:42.427Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>There are many important limitations to the direct impact of teaching, that 80,000 hours note in their teaching career review here <a href=\"https://80000hours.org/career-reviews/teaching/\">https://80000hours.org/career-reviews/teaching/</a> </p>\n<p>However, after some reflection, I think that this review underestimates some of the potential for impact through teaching, especially in terms of providing opportunities to promote effective altruism.</p>\n<p>I have created the document below (which is still a work-in-progress) primarily with the intention of using it to discuss ideas with other teachers, and potentially advise them on opportunities for high-impact activities that they can do. It is quite anecdotal and impressionistic, and is not intended (at least in its current format) to be comprehensive, but more to spark ideas about how to make your impact greatest within a teaching career.</p>\n<p><a href=\"https://docs.google.com/document/d/1JViIzFzBbepiaoO2x17ubIG0JTHB20HSHOVoSNDSogM/edit\">https://docs.google.com/document/d/1JViIzFzBbepiaoO2x17ubIG0JTHB20HSHOVoSNDSogM/edit</a></p>\n<p>To some extent, it's useful to have being a teacher / social worker / doctor as good examples of where direct impact isn't as important as it might seem, but I still think we need to be fully open and honest about the full range of possibilities that these career paths open. </p>\n<p>I'd be grateful if people had a read through the list and share any thoughts / give feedback!\nDo people agree with the basic premise that teaching and education might be more promising career areas for having a positive impact than have previously been suggested by 80K (and in Doing Good Better etc), especially when used as a platform for EA community building and advocacy?  Are there any specifics that people would challenge, or add to?</p>\n<p>The goal of this post and discussion is that a) if people here agree, 80K might slightly adjust their advice to reflect these ideas, b) although I don't see it as a priority for my own time, for those who are determined to focus their careers and efforts on education, it might be useful to flesh and out and develop this document with greater evidence, analysis and examples.</p>\n<p>Personal background: as a UK-based history teacher who only started reading very much about EA ideas in January 2017 (after completing my PGCE course and teaching professionally for about half a year), reading 80k advice has had a massive effect on how I think about and plan my own career. I am now seeking to work directly for effective animal advocacy organisations. Nevertheless, I believe that working in education has potential for higher impact than has been assumed. </p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "skL365tyu8ntmGRjp", "postedAt": "2018-02-13T16:24:55.645Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>This is quite an old post, but if anyone comes across it now, they might find the following two links useful:</p>\n<p>1) My review of EA Global London, largely intended as an insight into whether you'd want to attend future EA Global conferences\n<a href=\"https://butcantheysuffer.wordpress.com/2017/11/12/effective-altruism-global-london-3rd-to-5th-november-2017/\">https://butcantheysuffer.wordpress.com/2017/11/12/effective-altruism-global-london-3rd-to-5th-november-2017/</a></p>\n<p>2) The videos of the talks from EA Global London <a href=\"https://www.youtube.com/channel/UCEfASxwPxzsHlG5Rf1-4K9w\">https://www.youtube.com/channel/UCEfASxwPxzsHlG5Rf1-4K9w</a></p>\n", "parentCommentId": "2qxdHisSEPE5mmHAv", "user": {"username": "Jamie_Harris"}}, {"_id": "qEKXZZXEb3tjc7yrg", "postedAt": "2018-02-16T14:07:09.565Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>What do folks here think about the political views of Noam Chomsky? I ask because he is a strict global cosmopolitan thinker on foreign policy. And global cosmopolitanism is a central part of EA. Do any seasoned members of this site have an opinion? </p>\n", "parentCommentId": null, "user": {"username": "nobody"}}, {"_id": "osNJPQkFvHFFjp58K", "postedAt": "2018-02-20T21:52:21.141Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Has anyone read the 80000 hours pdf? On page 12 I'm not sure how they arrived at the figure that a single individual needs $40000 of individual income. They say in footnote 9 that it comes from the fact that in an average household, the first single individual accounts for 1 out of 2.5 people, but then they say that using this approximation that individual requires about 53% as much as a typical household. Shouldn't it actually be 1/ 2.5 = 40% as much?</p>\n", "parentCommentId": null, "user": {"username": "imu96"}}, {"_id": "zpMkp5gtmbEAHMeEB", "postedAt": "2018-03-05T04:05:03.554Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi.</p>\n<p>Given recent absurd temperatures in the Arctic, I've never been less sure than I am now that the human species even can avoid an early and untimely death. For that reason, I am now also interested in continuing the human legacy, once humans as we know them today have disappeared. I assume that no intelligent species exists aside from what we are aware of here on Earth. For the endeavors of the human species to continue after we expire, we need to make sure <em>ourselves</em> that the closest thing to human endeavor continues, and not pin our hopes on something that may not ever find us, exist, or even be interested in reviving us should they find our DNA somewhere.</p>\n<p>So, does anybody here know any work I can get involved with that works towards that end? Some thoughts that have interested me so far are uploading human memories and tasks into things and/or robots that don't need food or water and can withstand extreme heat and extreme weather events. (Resilient solar-powered items, for instance, that would do the best things that we would like to see done were we still alive.) I am also interested in merging with and/or shaping the future of the resilient species that are more likely to outlive us.</p>\n<p>Any other suggestions? How should I pursue this?</p>\n", "parentCommentId": null, "user": {"username": "zepedad"}}, {"_id": "m5j4NPZdryt958PbX", "postedAt": "2018-03-06T01:16:27.018Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I am searching how to get attention to my 196p.A4 Dynamic Magnum Opus Multiple 'Humanitarian' Theoretic Solutions, Leads and Quests I compiled and are extremely important for the world to get familiar with the 2005/2018 text's many brake thru's.\nI'll of course keep searching a bit what others are writting and asking and delivering, but to be honnest I need mine to be made a EA group for, can I do this without karma points?\nAnd how to exactly earn Karma points?\nThank you in advance for any time to provide me the facts, I am new and a bit confused by the interface and Karma points minimal requirements etc. I just want a theoretic chance to show how in theory I resolved the world part 1 solo.</p>\n<p>DirK GieLeN</p>\n", "parentCommentId": null, "user": {"username": "DirKGieLeN"}}, {"_id": "oEyuhbbr72W443rft", "postedAt": "2018-03-06T10:03:47.140Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi, I´d like to share a full post about a potential of cost-benefit prioritization projects in developed countries. I´m heavily involved in EA, but a newbie to this forum, so need karma points. Here is a link to the planned post, if you think it´s relevant, like this comment :)</p>\n<p><a href=\"https://www.scribd.com/document/373093413/Prioritization-in-a-Developed-Country\">https://www.scribd.com/document/373093413/Prioritization-in-a-Developed-Country</a></p>\n", "parentCommentId": null, "user": {"username": "janklenha"}}, {"_id": "hkvL6X6oGvNADbXqM", "postedAt": "2018-03-25T17:16:45.022Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Do you know if anyone has done a more recent analysis of this kind of thing? He lists quite a few caveats/reservations at the end of this post. </p>\n", "parentCommentId": "vfWygw2PaWbrFbnph", "user": {"username": "harald"}}, {"_id": "nuF4e68gDaKfh9fBa", "postedAt": "2018-03-25T17:18:30.935Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Worth keeping an eye on this for potentially relevant projects: <a href=\"http://www.eawork.club/\">http://www.eawork.club/</a></p>\n", "parentCommentId": "nHzK82y9zdMXQLJbk", "user": {"username": "harald"}}, {"_id": "iDa6fTPsggjQ83ocZ", "postedAt": "2018-03-25T17:20:47.693Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Have you had any updates on this? This topic came up at a recent meetup I was at; I'd be interested in reading/contributing. </p>\n", "parentCommentId": "TQMyiLBzi5vDYYjgF", "user": {"username": "harald"}}, {"_id": "wWgNJ8rrdZ3x2eghf", "postedAt": "2018-03-25T17:22:46.472Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Cool! Who would you say is the target audience for this? Is it suitable for people who are very new to EA? </p>\n", "parentCommentId": "fRuvns3npuMeHyCyP", "user": {"username": "harald"}}, {"_id": "R4wXi59uFLzDZS46h", "postedAt": "2018-03-26T06:40:34.583Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Nope. Its been a long time now and I had almost forgotten about it! I guess this means we should start one...</p>\n", "parentCommentId": "iDa6fTPsggjQ83ocZ", "user": {"username": "Venkatesh"}}, {"_id": "zs4mCbDhcnufmHZD3", "postedAt": "2018-03-30T10:15:15.067Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Are you looking for more mods? I'd be happy to help out.</p>\n", "parentCommentId": null, "user": {"username": "HenryStanley"}}, {"_id": "rKS9PGN6D8j7uFi3P", "postedAt": "2018-03-30T10:17:31.290Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Oops, just saw that there's <a href=\"http://effective-altruism.com/ea/1m3/meta_notes_on_ea_forum_moderation/\">a post on exactly this</a>.</p>\n", "parentCommentId": "zs4mCbDhcnufmHZD3", "user": {"username": "HenryStanley"}}, {"_id": "Z3hcuFPnLDs4GRZc2", "postedAt": "2018-04-01T13:03:53.996Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I'm new to the idea of EA, and interested in pursuing it further. I'm finding that I have a hard time buying the argument of using expected value to make a decision, when I don't have a large number of decisions I get to make. Expected value works because it &quot;averages out&quot; over the long term. I'm especially concerned about <a href=\"https://blog.givewell.org/2016/07/26/deworming-might-huge-impact-might-close-zero-impact/\">the recommendations by GiveWell on deworming</a>. I am not a rich person, and I want to be able to make an impact if I can. Nothing in life is a certainty. That said, putting a large portion of the $ that I can contribute to something that has a high probability of not succeeding means that there is a high probability that my contribution will make no difference whatsoever. If I put money into a large number of causes, each of which has that profile, and if they are independent of each other, I accept that expected value kicks in. But in the case where I only get to make a contribution to a very limited number of causes, I don't see that expected value is the right philosophy. Can anyone help clarify?</p>\n", "parentCommentId": null, "user": {"username": "musicant"}}, {"_id": "Zh8KaZTycXjSedrMR", "postedAt": "2018-04-23T12:41:10.629Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi all, Liv here (REG co-founder). I've just joined the forum for the first time and don't have enough karma to post in the main thread yet, but hopefully someone very well-versed in climate change intervention rankings will see this:</p>\n<p>I'm looking for feedback on the following prioritisation list <a href=\"http://www.drawdown.org/solutions-summary-by-rank\">http://www.drawdown.org/solutions-summary-by-rank</a></p>\n<p>This list is being referenced by a potentially very high impact and well-intentioned individual I'm in conversation with, but it IMO it contains a number of surprises and omissions. Does anyone have  a more EA-vetted ranking of interventions they could direct me to? Feel free to PM me, thanks.  </p>\n", "parentCommentId": null, "user": {"username": "LivBoeree"}}, {"_id": "wkDgwspRMLg3fKR9C", "postedAt": "2018-04-23T14:14:05.833Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi. Firstly, I want to say that many people within the movement differ in how risk averse they are and make decisions with that taken into account. For example, this flowchart on deciding which cause to work on <a href=\"http://globalprioritiesproject.org/2015/09/flowhart/\">http://globalprioritiesproject.org/2015/09/flowhart/</a> has a question “would you rather do something that has a 1% chance of saving 1,000 lives than save one life for sure?” I know some smart people who would answer that question with a “no” and behave accordingly.</p>\n<p>However, many EAs think that the 1% chance option is better and many EAs spend entire life’s effort on causes like AI-safety even though it’ll almost surely have no impact because for them it’s not that important to make sure you have at least some impact, for them the small possibility of having a huge impact is just as motivating. I do share your feeling that having at least some impact is better, but personally I try to somewhat ignore it as a bias when making important decisions. To me, in some abstract sense, 1% chance of saving 1,000 lives is better than 100% chance of saving 1 life. In the same way that helping 10 people africa is in some abstract sense better than helping 1 person who lives in my country. And in the same way that helping 10 people who will live in million years is better than helping 1 person who is living now. Part of my brain disagrees but I choose to call that a bias rather than a part of my moral compass. Which IMO is a totally subjective choice.</p>\n<p>Even if all of us were risk averse, it might still make sense for all of us to cooperate and put money into different risky causes, because then there’s a high probability that all of us combined will have a big positive impact. Instead of making sure that you yourself make a significant difference, you could think how EA community as whole (or humanity as a whole) could make a big positive difference. EA already supports many charities and maybe the risky charity that you donate to personally won’t have an impact, but if many people support different risky charities like you will, all of us combined will have a bigger impact with a high probability.</p>\n<p>All that said, some EAs donate some money to causes that make sure that they have at least some impact and some money to risky causes with high expected value. More on this in <a href=\"https://www.lesswrong.com/posts/3p3CYauiX8oLjmwRF/purchase-fuzzies-and-utilons-separately\">https://www.lesswrong.com/posts/3p3CYauiX8oLjmwRF/purchase-fuzzies-and-utilons-separately</a></p>\n", "parentCommentId": "Z3hcuFPnLDs4GRZc2", "user": {"username": "saulius"}}, {"_id": "RiNE2FhWrrdziJtgc", "postedAt": "2018-04-23T14:55:35.466Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Could also post to the effective environmentalism group on FB as well.\n<a href=\"https://www.facebook.com/groups/1509936222639432/\">https://www.facebook.com/groups/1509936222639432/</a></p>\n", "parentCommentId": "Zh8KaZTycXjSedrMR", "user": {"username": "DavidNash"}}, {"_id": "az6XXAiuahpc3KNSF", "postedAt": "2018-04-23T14:59:25.114Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Career Discussion group on FB</p>\n<p><a href=\"https://www.facebook.com/groups/473795076132698/\">https://www.facebook.com/groups/473795076132698/</a></p>\n", "parentCommentId": "YKCSRfL2wKCLJZ4fp", "user": {"username": "DavidNash"}}, {"_id": "qHTenTpBPvHJwvndG", "postedAt": "2018-05-09T17:54:02.912Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hey! I've written a post about prioritising between different worldviews (as Open Phil calls them), using expected-value/expected choice-worthiness calculation. It would be nice if you could\n1) give me feedback\n2) like this post if you think I should be able to post this on the forum.</p>\n<p>Thanks everyone :)</p>\n<p><a href=\"https://docs.google.com/document/d/1E2JF9mqDiMS4Q-QQd8TnWUwNmMC9uoym2p3x7W7rhGA/edit?usp=sharing\">https://docs.google.com/document/d/1E2JF9mqDiMS4Q-QQd8TnWUwNmMC9uoym2p3x7W7rhGA/edit?usp=sharing</a></p>\n", "parentCommentId": null, "user": {"username": "Ronja_Lutz"}}, {"_id": "ngf843ThZbeuciisT", "postedAt": "2018-05-23T03:52:13.570Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Greetings Do-gooders,</p>\n<p>I'm wondering if this is an appropriate place to ask for college advice. I read Doing Good Better and 80000 hours, and am interested in joining the movement but haven't finished college. I have an associate's degree (from a community college) but I'm having a hard time deciding on a major/school.</p>\n<p>I struggle with math and am unsure I'd be able to complete a math-intensive major. 80000 hours advises alternatively majoring in a liberal art or business. I'm trying to decide between studying a liberal art (e.g. political science) at my state's flagship school or business/accounting at a less-selective school (I couldn't get into flagship business school, but I could study business/accounting as an &quot;individualized major&quot; outside their business program (with some classes in the business school), there's also a marketing major and economics major outside the business school).</p>\n<p>Any advice anyone can offer would be greatly appreciated.</p>\n", "parentCommentId": null, "user": {"username": "jelsen"}}, {"_id": "FC6aSL2yarxXSwK8c", "postedAt": "2018-05-23T08:21:54.544Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>The FB group on career discussions might be a good place to ask - with more people paying attention to it.</p>\n<p><a href=\"https://www.facebook.com/groups/473795076132698/\">https://www.facebook.com/groups/473795076132698/</a></p>\n", "parentCommentId": "ngf843ThZbeuciisT", "user": {"username": "DavidNash"}}, {"_id": "zdJohagTekpfxeQze", "postedAt": "2018-05-29T22:02:11.821Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi everyone.</p>\n<p>I've been thinking about the potential effectiveness of lobbying for legalisation of psychedelics (whether individually or as part of a total legalisation of drugs) or the effectiveness of encouraging their use, legal or not, in terms of increasing the empathy of a population (and therefore their likelihood of becoming EAs). </p>\n<p>Given their reputation for making people more open to new ideas, psychedelics could significantly bolster the number of people who agree with and act on EA principles.</p>\n<p>Does anyone know of any research into anything related / any good articles on this?</p>\n", "parentCommentId": null, "user": {"username": "fergusb1232"}}, {"_id": "HKHHsmvJS2sdXCGnG", "postedAt": "2018-05-30T00:28:15.369Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>You could save it, if you believe that a) a time will come fairly soon when you can move the money easier or you will leave Iran and be able to take the money and b) the money won't significantly depreciate in value during this time. </p>\n<p>If I was you I would set up a small donation ($1 maybe) to the best charity you can find in Iran, or one that makes you feel good to donate to, to try and establish a habit of giving, while investing the rest of the money in yourself (decreasing the amount of time you have to work (if you work) so you can read more, getting a gym membership to maximise your health and therefore your working life and donatable earnings, etc).</p>\n", "parentCommentId": "LTbpDRZ8phMm3HR5v", "user": {"username": "fergusb1232"}}, {"_id": "M8bpZuGd4hiq7naJF", "postedAt": "2018-05-30T01:09:45.099Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I suggest starting with <a href=\"http://www.maps.org/\">MAPS</a>.</p>\n", "parentCommentId": "zdJohagTekpfxeQze", "user": {"username": "PeterMcCluskey"}}, {"_id": "Eyn8chYnKgnF5vR9B", "postedAt": "2018-06-04T21:53:16.350Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>I think these can be categorised as follows (as of Oct 2017):</p>\n<ul>\n<li>8/22 came from my 1st year with the &quot;pre-EA&quot; community (felicifia.org/reducing-suffering.org (4), Toby Ord (3), the rationalists (1))</li>\n<li>4/22 from 6 years of social/professional relationships with EA types who are hot on personal development</li>\n<li>3/22 from my 2nd-8th years with the pre-EA/EA community</li>\n<li>2/22 from 2 years of independent thought prompted by reading philosophy and having a utilitarian friend at sixth form</li>\n<li>1/22 from 3 years of colleagues at non-EA orgs (Oxfam retail and a &quot;digital transformation&quot; consultancy startup)</li>\n<li>1/22 from independent thought plus ~7 years of knowing sexually diverse communities via university and EA</li>\n<li>1/22 from 26 years of family</li>\n<li>1/22 from really mixed sources</li>\n</ul>\n<p>(+ the Robin Hanson one that I want to take off the list in light of the <a href=\"http://effective-altruism.com/ea/1ne/empirical_data_on_value_drift/\">value drift post</a>)</p>\n<p>Takeaway: <strong>My first year of being part of an EA-type community was disproportionately valuable.</strong></p>\n<p>I wonder how other people's experiences compare, and if they're similar, the extent to which that implies that we should focus community-building on brief intense immersion and retention-wise simply optimise for something like subscribers to a quarterly newsletter.</p>\n", "parentCommentId": "LvWWqe3tpeD6W9GN3", "user": null}, {"_id": "9Y2sBov8JZKm22moa", "postedAt": "2018-06-05T23:10:41.038Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi, I've written an article on climate change but I don't have enough karma points to post. Below I've written the abstract of my paper and I was hoping to get enough karma points to post the full article. </p>\n<p>This paper will discuss the impact that climate change has had on the Earth. The issue of climate change has become a huge problem because of the continued campaigns to spread misinformation to the public. Climate change has been affecting the world’s ecosystems, and if nothing is done to fix this issue, various species of animals and plants will become extinct. Although the extinction of some species has already occurred, it is believed that if people work together to limit Earth’s current temperature increase to 1.5˚ Celsius, the rapid extinction of species and devastation of ecosystems will become stabilized. In this paper, some possible solutions to the rapid climate change are also discussed.\nKeywords: climate, change, global, warming, natural, human</p>\n<p>Thanks for taking the time to read this</p>\n", "parentCommentId": null, "user": {"username": "Alyssa497"}}, {"_id": "Lo7p9myiBzCfPifoi", "postedAt": "2018-06-05T23:24:23.012Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>You could just link to a Google Drive (or other) copy of your full article in your comment, both to let people read the article, and to accumulate the karma for a top-level post if people like it.</p>\n", "parentCommentId": "9Y2sBov8JZKm22moa", "user": {"username": "CarlShulman"}}, {"_id": "iKQmfhLefQFxgjY6v", "postedAt": "2018-06-12T10:57:17.890Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Plea for authors to write summaries at the top of each post - it makes skimming the forum easier. (And a reminder that putting your &quot;This post was cross-posted to...&quot;, &quot;This post was co-authored by...&quot; etc. above the summary takes up valuable space.)</p>\n<p>This is also an idea for the forum structure itself: forcing people to write a tl;dr in order to post.</p>\n", "parentCommentId": null, "user": null}, {"_id": "WPkX3b45PNZh22Pce", "postedAt": "2018-06-12T12:47:54.667Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>see <a href=\"http://effective-altruism.com/ea/1d8/dpr/\">http://effective-altruism.com/ea/1d8/dpr/</a></p>\n", "parentCommentId": "zdJohagTekpfxeQze", "user": {"username": "saulius"}}, {"_id": "mJ2xx9t8YXq8wDjN8", "postedAt": "2018-06-26T02:28:47.543Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hey, everyone! What do you think about ocean plastics in terms of tractable, impactful, and neglected solutions?</p>\n<p>I am a plastics manufacturing engineer with EA on the brain. Here are the assumptions I've found based on my research so far:</p>\n<p>We dump lots of plastic into our oceans, it destabilizes economies in some places and also poisons food/water supplies, i.e. high cost to humanity.\nConsumers are interested in buying products with post-consumer recycled content for a small price difference because they know that it reduces plastic that would otherwise go into the ocean. \nBrands are interested in creating these products to pique consumer interest.\nManufacturers are interested in making these products but are limited by technology in terms of how much recycled content can be added.\nOur current recycling technology is not as advanced or capable as it could be.\nSteering technology can be an efficient path for Effective Altruism under some circumstances.\nIf I can work for a business, start a business, or conduct research for an organization that improves recycling technology, I can benefit humanity in a highly leveraged way (i.e. assist in diverting millions or tens of millions of pounds of plastic from the ocean each year).</p>\n<p>Question 1: is there anything philosophically or economically wrong with my assumptions? check them please!\nQuestion 2: is there something else I can work on that would be better?\nQuestion 3: is there a different place I should ask these questions?\nQuestion 4: can anyone point me to a contact who is knowledgeable about any of these topics?\nQuestion 5: is there anyone else who is working on ocean plastic, especially in a scaleable way?</p>\n<p>Thanks for the help.</p>\n<p>Dan</p>\n", "parentCommentId": null, "user": {"username": "danbakke"}}, {"_id": "Rqjhih2TQeCy5jwD5", "postedAt": "2018-07-05T23:18:04.926Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>One disadvantage of &quot;earning to give&quot; that I don't recall anyone mentioning: These careers tend to be long hours, giving you less freedom to review and potentially pivot. I think this is a major consideration. I wonder how many people earning to give have a vague feeling that they could probably find something more effective to do with their time, but are struggling to even find the time to stay healthy (sleep, exercise, fulfilling relationships etc), let alone conduct a career review and research, experiment with and apply for other options.</p>\n<p>Another consideration for people further into their careers who are contemplating a path change is to think about how easy it would be to return to your current career if the new path doesn't work out. This is generally pretty obvious to such people, but I thought this might help some people here update their models of how others make and should make career decisions.</p>\n", "parentCommentId": null, "user": null}, {"_id": "4yF3ckd8kdsBi9JuG", "postedAt": "2018-07-06T09:48:33.332Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>You may get more of a response here.\n<a href=\"https://www.facebook.com/groups/1509936222639432/\">https://www.facebook.com/groups/1509936222639432/</a></p>\n", "parentCommentId": "mJ2xx9t8YXq8wDjN8", "user": {"username": "DavidNash"}}, {"_id": "A42wMkAg3aDgKgTRt", "postedAt": "2018-07-07T00:08:23.003Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Have you seen this?: <a href=\"https://conceptually.org/about/\">https://conceptually.org/about/</a></p>\n", "parentCommentId": "LvWWqe3tpeD6W9GN3", "user": {"username": "Roxanne_Heston"}}, {"_id": "NX7fF5wTEeTNNkQrQ", "postedAt": "2018-07-07T01:24:59.290Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Yes. And I think the fact that I find it pretty useless is a good reflection on our community :-) ...rather than a poor reflection on the creators!</p>\n", "parentCommentId": "A42wMkAg3aDgKgTRt", "user": null}, {"_id": "vo2KJM9tejMLwgxxt", "postedAt": "2018-07-08T22:18:18.758Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Hi, a little late, but did you get an answer to this? I am not an expert but can direct this to people in EA London who can maybe help.</p>\n<p>My very initial (non-expert) thinking was:</p>\n<ul>\n<li><p>this looks like a very useful list of how to mitigate climate consequences through further investment in existing technologies.</p>\n</li>\n<li><p>this looks like a list written by a scientist not a policy maker. Where do diplomatic interventions such as &quot;subsidise China to encourage them not to mine as much coal&quot; etc fall on this list. I would expect subsidies to prevent coal mining are likely to be effective.</p>\n</li>\n<li><p>&quot;atmospheric carbon capture&quot; is not on the list. My understanding is that &quot;atmospheric carbon capture&quot; may be a necessity for allowing us to mitigate climate change in the long run (by controlling CO2 levels) whereas everything else on this list is useful in the medium-short run none of these technologies are necessary.</p>\n</li>\n</ul>\n", "parentCommentId": "Zh8KaZTycXjSedrMR", "user": {"username": "weeatquince"}}, {"_id": "pzb3hDWnRzT9eYHGv", "postedAt": "2018-07-09T08:49:10.894Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>Ok, so you're talking about a scenario where humans cease to exist, and other intelligent entities don't exist or don't find Earth, but where there is still value in certain things being done in our absence. I think the answer depends on what you think is valuable in that scenario, which you don't define. Are the &quot;best things&quot; safeguarding other species, or keeping the earth at a certain temperature? </p>\n<p>But this is all quite pessimistic. Achieving this sort of aim seems like a second best outcome, compared to humanity's survival. </p>\n<p>For example, if earth becomes uninhabitable, colonisation of other planets is extremely good. Perhaps you could do more good by helping humans to move beyond earth, or to become highly resilient to environmental conditions? Surely the best way to ensure that human goals are met is to ensure that at least a few humans survive.</p>\n<p>Anyway, going with your actual question, how you should pursue it really depends on your situation, skill set, finances, etc, as well as your values. The philosophical task of determining what should be done if we don't survive is one potential. (By the way, who should get to decide on that?) Robotics and AI seem like another, based on the examples you gave. Whatever you decide, I'd suggest keeping the flexibility to change course later, e.g. by learning transferrable skills, in case you change your mind about what you think is important.</p>\n", "parentCommentId": "zpMkp5gtmbEAHMeEB", "user": {"username": "Michael_Wulfsohn"}}, {"_id": "tS4uafaoXgJFAiEZc", "postedAt": "2018-07-12T01:18:49.961Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": "<p>New piece by John Halstead: <a href=\"http://effective-altruism.com/ea/1qs/new_research_on_effective_climate_charities/\">http://effective-altruism.com/ea/1qs/new_research_on_effective_climate_charities/</a></p>\n", "parentCommentId": "Zh8KaZTycXjSedrMR", "user": {"username": "Roxanne_Heston"}}, {"_id": "2fmpf45mt8dzJy4Gy", "postedAt": "2018-06-11T01:26:38.035Z", "postId": "4E7f9eNbe4dMbnsme", "htmlBody": null, "parentCommentId": null, "user": null}]