[{"_id": "BhXCMXdFjbvmeQrZh", "postedAt": "2023-12-18T22:19:06.215Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>What does 'Big 3' refer to in \"'Big 3' podcast engagement hours\"?</p>", "parentCommentId": null, "user": {"username": "GMcGowan"}}, {"_id": "ZwBAuKEPtkCviCQEd", "postedAt": "2023-12-19T00:10:27.843Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>My understanding is that this refers to the combined engagement time reported across Spotify, Apple and Google. &nbsp;</p>", "parentCommentId": "BhXCMXdFjbvmeQrZh", "user": {"username": "Niel_Bowerman"}}, {"_id": "HcsuFwjGak32fLKgy", "postedAt": "2023-12-19T10:48:17.028Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>I'll ask the obvious awkward question:&nbsp;</p><p>Staff numbers are up ~35% this year but the only one of your key metrics that has shown significant movement is \"Job Vacancy Clickthroughs\".</p><p>What do you think explains this? Delayed impact, impact not caught by metrics, impact not scaling with staff - or something else?</p>", "parentCommentId": null, "user": {"username": "GMcGowan"}}, {"_id": "hTvJeuTXHcbJqiiZX", "postedAt": "2023-12-19T17:14:04.835Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>Equally curious about the push to grow the team if not seeing significant increase in impact, especially given the $2M marketing push this past year.</p><p>In <a href=\"https://docs.google.com/document/d/1mZmox0G910jw7I9jCoDC6vowz_PcrHRfFoW04G59XMA/edit\">80K’s 2021-2022 Review</a> it mentioned:&nbsp;</p><p>(1) “we seem to be <strong>hitting diminishing returns</strong> in outreach encouraging more people to apply to advising...” <i>(page 7 under current challenges)</i></p><p>and again&nbsp;</p><p>(2) “overall, we’d guess that 80,000 Hours continued to see <strong>diminishing returns to its impact per staff member</strong> per year.” <i>(on page 10 under impact evaluation)</i></p><p>What is the strategy/argument for “expand the team” being the best intervention for increasing organizational outreach and subsequent impact? Is it really just a capacity issue or could it be a scope issue?&nbsp;</p>", "parentCommentId": "HcsuFwjGak32fLKgy", "user": {"username": "barkbellowroar"}}, {"_id": "KXwwXsFerroHhEZRM", "postedAt": "2023-12-19T17:26:04.337Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>On a related note to my other comment on this post:&nbsp;</p><p>A lot of organizations are acknowledging the impact of FTX on their work which is important but I would also like to see <strong>an EA organization try to evaluate the positive or negative impact switching to longtermism has had on their ability to attract talent, donors etc.</strong></p><p>You say you want to diversify assets but Open Phil still holds a commanding 80% of your bottom line - and both orgs have become much more longtermist in recent years. If OP is going to just prop up 80k for the next several years because it serves their aims, why would I fund 80k when there is now a considerable gap in the landscape for a new career service org that caters to the other cause priorities of EA?&nbsp;</p>", "parentCommentId": null, "user": {"username": "barkbellowroar"}}, {"_id": "3JGLupXPMKuyhcsWn", "postedAt": "2023-12-19T21:03:42.200Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>Hey George —thanks for the question!</p><p>We haven’t done a full annual review of 2023 and the complete data isn’t in yet, so we haven't done a thorough assessment of the answer to your question yet. The answers to your question probably differ quite a bit programme to programme. But here are a few thoughts that seemed relevant to me:</p><p>On web:</p><ul><li>Over the past couple of years, the biggest predictor of change in web engagement time appears to be changes in our marketing spending.&nbsp; In 2022 we substantially increased our marketing spend.&nbsp; In 2023 our marketing spend was not dramatically larger than in 2022.&nbsp; This is reflected in the web engagement time metrics.&nbsp; (We are actively investigating the cost-effectiveness of marginal marketing spending, and are not fundraising for marketing as part of this public fundraising round as it is already being covered by Open Philanthropy.)&nbsp;&nbsp;</li><li>We have also put more effort into driving off-site engagement time in 2023, e.g. via our&nbsp;<a href=\"https://www.youtube.com/watch?v=qzyEgZwfkKY\"><u>AI video</u></a>, improvements to our newsletter, etc.&nbsp; This is not included in the engagement time metrics in the chart, but we estimate that in 2023 we grew off-site engagement time notably more than we did on-site engagement time.&nbsp;&nbsp;</li></ul><p>On podcast:</p><ul><li>The drivers of engagement with the podcast are more mysterious to me, and I have trouble making accurate predictions of future engagement time with the podcast.&nbsp; Viewed on a quarterly basis, growth in the podcast appears to be healthy.&nbsp;&nbsp;<br>&nbsp;<img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/3JGLupXPMKuyhcsWn/wh6goeyexqkv0ln0d5cm\"></li></ul><p><br>On advising:</p><ul><li>In 2023 we focused more on growing and systematising headhunting, active outreach and systems, and relatively less on increasing call numbers.&nbsp;&nbsp;</li><li>We didn't make as many calls as we had hoped to, due in part to a manager on the team leaving.&nbsp;&nbsp;</li><li>We also put relatively more focus on improving call quality, for example by putting in place feedback systems. This was a focus because we grew the team in 2021 and 2022 and wanted more systems to keep everyone in sync and ensure continued quality.</li></ul><p>On job board:</p><ul><li>We've actually reduced our FTE input into the job board in 2023, but we are still seeing solid quarter-on-quarter growth.&nbsp;&nbsp;</li></ul><p>Additional points:</p><ul><li>Some of our staff growth came from hires to our internal systems team, which should strengthen our capacity over time but won’t result in direct improvements on these metrics.</li><li>We do expect some diminishing returns to staff growth over time.&nbsp; I'll address this in another comment on this thread.&nbsp;&nbsp;</li></ul>", "parentCommentId": "HcsuFwjGak32fLKgy", "user": {"username": "Niel_Bowerman"}}, {"_id": "6xyLsLbZmbWiC5Cnm", "postedAt": "2023-12-19T22:16:49.555Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>Thanks for engaging with this post! &nbsp; A few thoughts prompted by your comment in case they are helpful:</p><ul><li>80k has been interested in longtermism-related causes for many years, including many years in which we’ve seen a lot of growth.&nbsp; We were&nbsp;<a href=\"https://80000hours.org/2013/08/how-important-are-future-generations/\"><u>interested in longtermism</u></a> for several years before we received our&nbsp;<a href=\"https://www.openphilanthropy.org/grants/80000-hours-general-support/\"><u>first grant</u></a> from Open Philanthropy.&nbsp;&nbsp;</li><li>We believe there’s still a lot of need for talent in the problems areas that we focus on, so we don’t think there’s a strong reason for us to shift our focus on that front — at least for the time being.&nbsp;</li><li>In evaluating our impact, you should consider whether the causes where we focus seem most pressing to you. If you think <a href=\"https://80000hours.org/problem-profiles/#most-pressing-world-problems\">our focus areas</a> are not that pressing, we think it’s reasonable to be less interested in donating to us.&nbsp;</li><li><a href=\"https://forum.effectivealtruism.org/posts/Ay42LLjQDjkTpnaMJ/80k-would-be-happy-to-see-more-projects-in-the-careers-space\"><u>We’re happy</u></a> to see others offering alternatives to our career advice — this kind of competition is healthy and we are keen to encourage it in the ecosystem.</li><li>All that said, we do have a lot of advice to people who are not that interested in longtermism. For example, our job board features opportunities for people working on <a href=\"https://jobs.80000hours.org/?refinementList%5Btags_area%5D%5B0%5D=Animal%20welfare&amp;refinementList%5Btags_area%5D%5B1%5D=Global%20health%20%26%20development\">global health and animal issues</a>, and our <a href=\"https://80000hours.org/career-guide/\">career guide</a> offers advice that is widely applicable, including about how readers could approach thinking through the question of which problems are most pressing for themselves.</li></ul>", "parentCommentId": "KXwwXsFerroHhEZRM", "user": {"username": "Niel_Bowerman"}}, {"_id": "vbpxkjq9mRSjbBL5h", "postedAt": "2023-12-19T22:22:07.594Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<blockquote><p>a new career service org that caters to the other cause priorities of EA?&nbsp;</p></blockquote><p>I'm guessing you are familiar with <a href=\"https://probablygood.org/\">Probably Good</a>? &nbsp;They are doing almost exactly the thing that you describe here. &nbsp;They are also accepting donations, and if you want to support them you can do so <a href=\"https://give.cornerstone.cc/probablygood\">here</a>. &nbsp;</p>", "parentCommentId": "KXwwXsFerroHhEZRM", "user": {"username": "Niel_Bowerman"}}, {"_id": "9RvNEcbFPw5yQsu4F", "postedAt": "2023-12-19T22:45:31.063Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>Thanks for the question. To be clear, we do think growing the team will significantly increase our impact in expectation.&nbsp;</p><ul><li>We do see diminishing returns on several areas of investment, but having diminishing returns is consistent with significantly increasing impact.</li><li>Not all of our impact is captured in these metrics. For example, if we were to hire to increase the quality of our written advice even while maintaining the same number of website engagement hours, we’d expect our impact to increase (though this is of course hard to measure).</li><li>In our view, investments in 80k’s growth are still well above the cost-effectiveness bar for similar types of organisations and interventions in the problem areas we work on.</li></ul>", "parentCommentId": "hTvJeuTXHcbJqiiZX", "user": {"username": "Niel_Bowerman"}}, {"_id": "tEjhLFYo5jYRHqgms", "postedAt": "2023-12-20T16:02:00.618Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<blockquote><ul><li><a href=\"https://forum.effectivealtruism.org/posts/Ay42LLjQDjkTpnaMJ/80k-would-be-happy-to-see-more-projects-in-the-careers-space\"><u>We’re happy</u></a> to see others offering alternatives to our career advice — this kind of competition is healthy and we are keen to encourage it in the ecosystem.</li></ul></blockquote><p>&nbsp;</p><p>I wanted to chime in and say that while a lot of people / organizations say things like this, in my experience, 80,000 really does mean it and follows through. When we were setting up Probably Good (and not only then) the amount of encouragement and help we received from Michelle, Niel and others there has been incredible.&nbsp;</p>", "parentCommentId": "6xyLsLbZmbWiC5Cnm", "user": {"username": "omernev@gmail.com"}}, {"_id": "F8nfJyCdHwXLnvfKP", "postedAt": "2023-12-22T11:23:16.135Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>I think this comment would be more persuasive if it shared some evidence or reasoning as to why its claims are likely true</p>\n", "parentCommentId": "9RvNEcbFPw5yQsu4F", "user": {"username": "John Salter"}}, {"_id": "3idtiHrvjvspmcsvR", "postedAt": "2023-12-22T22:36:32.348Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>Hey John, unfortunately a lot of the data we use to assess our impact contains people’s personal details or comes from others’ analyses that we’re not able to share. As such, it is hard for me to give a sense of how many times more cost-effective we think our marginal spending is compared with the community funding bar.&nbsp;</p><p>But the original post includes various details about assessments of our impact, including the plan changes we’ve tracked, placements made, the EA survey, and the Open Philanthropy survey.&nbsp; We will be working on our annual review in spring 2024 and may have more details to share about the impact of our programmes then.</p><p>If you are interested in reading about our perspective on our historical cost-effectiveness from our 2019 annual review, you can do so<a href=\"https://docs.google.com/document/d/1PFSKzGV_fVcBJgV77dtiNTi9d1kFE1_skODtPXXqGec/edit#heading=h.ecly0t2tlm9z\">&nbsp;<u>here</u></a>.&nbsp;&nbsp;</p>", "parentCommentId": "F8nfJyCdHwXLnvfKP", "user": {"username": "Niel_Bowerman"}}, {"_id": "8ua2PYKusAHxBkpT6", "postedAt": "2024-03-26T10:59:26.044Z", "postId": "4ebRNGi3aHWnCw5m8", "htmlBody": "<p>Here’s a quick update to say that we’ve closed this fundraising round.&nbsp;</p><p>If you’re still interested in donating to 80,000 Hours, we always welcome donations through our&nbsp;<a href=\"https://www.givingwhatwecan.org/en-GB/charities/80000-hours\"><u>Giving What We Can donation page</u></a> and are excited to hear from potential donors at&nbsp;<a href=\"mailto:jess.smith@80000hours.org\"><u>jess.smith@80000hours.org</u></a>.</p><p>We have also updated the&nbsp;<a href=\"https://80000hours.org/support-us/donate/#top\"><u>donate page</u></a> of our site — updating the metrics to cover the whole of 2023 and making an adjustment to account for cookie banner changes in 2023 which affects our&nbsp;<a href=\"https://80000hours.org/support-us/donate/#growth-over-time\"><u>growth over time&nbsp;</u></a>metrics. Going forward,&nbsp;<a href=\"https://80000hours.org/support-us/donate/#top\"><u>our page</u></a> is a better source of up-to-date information than this forum post.</p>", "parentCommentId": null, "user": {"username": "80000_Hours"}}]