[{"_id": "8pGqMLZnK9Wz7nf3b", "postedAt": "2023-09-01T12:16:52.867Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p><strong>Executive summary</strong>: The post describes mistakes HLI made in overconfident and inaccurate communications, outlines steps HLI is taking to improve research rigor and communications, and invites further constructive feedback.<br><br><strong>Key points</strong>:</p><ol><li>HLI acknowledges errors like overconfidence in claims about StrongMinds, misleading language, data mistakes in cost-effectiveness estimates, and delayed website updates.</li><li>HLI adds transparency with a public \"Our Blunders\" page and clarity in StrongMinds recommendations.</li><li>HLI improves research practices like more reviewer checks, uncertainty communication, and following best practices.</li><li>HLI revamps communications with a new Comms Manager role and tone changes.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "gmkoBjvaPtXxjzkwg", "postedAt": "2023-09-01T15:28:36.525Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Thanks for sharing this. I've not been following your work closely, but running a new org with very ambitious goals must be challenging, and I appreciate you acknowledging and sharing your mistakes so far. It would be surprising if you <i>hadn't</i> made a few mistakes at this point. Good luck!</p>", "parentCommentId": null, "user": {"username": "OllieBase"}}, {"_id": "FDXiWQg4dYoa2qtvz", "postedAt": "2023-09-01T15:38:25.278Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>I've not seen this feature before but it looks awesome! If testing goes well, it would be really cool to integrate it more fully (eg: allow post author's to put this executive summary at the top of their post).</p>\n", "parentCommentId": "8pGqMLZnK9Wz7nf3b", "user": {"username": "jooke"}}, {"_id": "738xgNPWWNyMYmJy2", "postedAt": "2023-09-01T17:27:12.811Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>I'm excited about this, thanks Michael and Peter!</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "rdRcSr6SAb7ZBbpcW", "postedAt": "2023-09-03T13:40:52.934Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>And perhaps test ways of allowing users to edit or correct the summary.</p>", "parentCommentId": "FDXiWQg4dYoa2qtvz", "user": {"username": "nathan"}}, {"_id": "qr8PD6oGucAGfewLD", "postedAt": "2023-09-03T13:54:43.631Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Thanks for taking costly steps.&nbsp;</p><p>I'm generally of the opinion that it's worth waiting a bit after changes to decide if changes have worked or not, so I'm looking forward to checking back in 6 months. I hope we can become convinced that the situation is unlikely to happen again and the basically not mention this any more.</p><p>I am unsure about a general practice of hiring comms people to interact with the community. I guess I'd prefer a frame of mediation - the aim is for us all to communicate better with one another. I softly predict that if every org hired intra-community comms people that would lead to less signal in discussion overall.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "LmAN3LCAMLgxifZyb", "postedAt": "2023-09-05T09:29:08.182Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Hey Nathan!&nbsp;<br><br>Appreciate the comment, and totally agreed on your first paragraph. We'll continue to post updates as the work progresses, and we'll welcome feedback and comments as we go.<br><br>On the second paragraph, fear not. Lara wasn't brought on to interface with the community in our stead, but provide comms wisdom and support. We've been discussing creating a formal HLI account through which we'd do future posting, but that would still be us at the keys.&nbsp;</p>", "parentCommentId": "qr8PD6oGucAGfewLD", "user": {"username": "PeterBrietbart"}}, {"_id": "df2kvpJhnTRctB4jn", "postedAt": "2023-09-05T11:33:06.712Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>I'd personally like that, as it summarised only 4 of the 7 points we made.</p>", "parentCommentId": "rdRcSr6SAb7ZBbpcW", "user": {"username": "PeterBrietbart"}}, {"_id": "CTFQaRdXbsk6GxJ8x", "postedAt": "2023-09-05T21:10:34.052Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>This post is why EA is so great. The broader take home is that human life and social systems are infinitely complex and all of EA needs to continue to trend humble regarding our ability to figure things out in the specific window/perspective we have. And since our funding advice goes to the wealthiest and most willing to give humans on earth, we hold a significant sway on which interventions get funded, so if we are off or wrong, we do harm. Thanks for continuing to iterate humbly.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "Cq86EEavCjYwtiaEY", "postedAt": "2023-09-07T12:54:13.248Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Great! Thanks for your work Peter.</p>", "parentCommentId": "LmAN3LCAMLgxifZyb", "user": {"username": "nathan"}}, {"_id": "8opdw97Mk3qHkhnct", "postedAt": "2023-09-07T14:50:42.496Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Hi Peter,</p><blockquote><p>We've been discussing creating a formal HLI account through which we'd do future posting, but that would still be us at the keys.&nbsp;</p></blockquote><p>Would such HLI account be used just for posts, or also for comments? For the latter, I guess personal accounts may be better, because different people from the team can have different views. Aggregating these into a single one would lead to some loss of potentially relevant information.</p>", "parentCommentId": "LmAN3LCAMLgxifZyb", "user": {"username": "vascoamaralgrilo"}}, {"_id": "3c5i38p73nou8Jpdy", "postedAt": "2023-09-08T09:17:03.722Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Yep exactly. Nothing set in stone, but 'official' account for top level posts and then named-person accounts for individual views/commentary seems decent.</p>", "parentCommentId": "8opdw97Mk3qHkhnct", "user": {"username": "PeterBrietbart"}}, {"_id": "JvYgv48NdSdEdsXAj", "postedAt": "2023-09-12T12:05:36.493Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>If summaries are editable, it could be nice to keep the same length limit so that they don't balloon during editing. &nbsp;</p>", "parentCommentId": "rdRcSr6SAb7ZBbpcW", "user": {"username": "Niel_Bowerman"}}, {"_id": "7xFeaSedRQRAgwGGg", "postedAt": "2023-09-12T12:09:14.306Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Or a character limit.&nbsp;</p><p><i>edit </i>Also I'm not sure it would balloon. I have runa couple of open documents with 100s or 1000s of editors and my experience is that people obey norms. I guess that if the box said, please be concise, EAs would bel</p>", "parentCommentId": "JvYgv48NdSdEdsXAj", "user": {"username": "nathan"}}, {"_id": "hGcifovj9xKrHD9DF", "postedAt": "2023-09-22T08:35:25.401Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": "<p>Thanks for this thoughtful and grounded post. I feel this shows dedication to improvement and transparency and appreciate that you've openly called out the mistakes HLI has made and identified specific ways you're planning to improve moving forward. These all sound like great steps be taking with direct lines between the missteps and next steps.<br><br>PS excited to hear about your new position, Peter! Looking forward to seeing HLI progress under your leadership.</p>", "parentCommentId": null, "user": {"username": "Rachel Abbott"}}, {"_id": "Aa2bKxJmbkqybNs5d", "postedAt": "2023-09-08T14:11:24.550Z", "postId": "4edCygGHya4rGx6xa", "htmlBody": null, "parentCommentId": "CTFQaRdXbsk6GxJ8x", "user": null}]