[{"_id": "ijqvsj2fZKYz8yicz", "postedAt": "2022-09-13T17:26:54.436Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>What is the name and do you have a website for your  project?</p>\n", "parentCommentId": null, "user": {"username": "Felix Wolf"}}, {"_id": "5vDcvfjbQhzGra85m", "postedAt": "2022-09-13T18:29:17.395Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>I like the post and your hands-on attitude!</p>\n<p>May I suggest to change the title to something more descriptive?</p>\n<p>Eg \"Requesting feedback: funding proposal for remote training of healthcare workers in LMICs\"</p>\n<p>Also: it's generally considered bad form to claim your organisation is highly effective, especially in such an early stage.. better to use the phrase \"potentially highly effective\"</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "RL7teyAHeQzFkbwLD", "postedAt": "2022-09-13T18:29:44.872Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>Thanks! I have a few possible names but haven't picked one (and the associated website domain name) yet. The pilots described here recently wrapped up but I'd be happy to share a demo module hosted on our MVP that's focused on neonatal / child health. Please DM me if you're interested.</p>", "parentCommentId": "ijqvsj2fZKYz8yicz", "user": {"username": "mpt7"}}, {"_id": "qs5HiBikoxfyAJLQY", "postedAt": "2022-09-13T18:35:02.766Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>Many thanks for reading and for your suggestions, which I've acted on! The title is now updated :).</p>", "parentCommentId": "5vDcvfjbQhzGra85m", "user": {"username": "mpt7"}}, {"_id": "zignXwYq5fFKD2DZi", "postedAt": "2022-09-13T19:07:47.254Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>I’d also recommend putting “funding” in the title to make potential funders more likely to read this</p>\n", "parentCommentId": "qs5HiBikoxfyAJLQY", "user": {"username": "freedomandutility"}}, {"_id": "tePNiiWxhFBtQu5Jy", "postedAt": "2022-09-13T21:13:06.114Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>Thanks for this! It's exciting to see people try out new things and experiment with ways to improve the world.&nbsp;</p><p>Some thoughts on the information you present in this post, and what it seems to be missing:</p><ol><li>Based on the information presented in this post alone, I'm not confident in the theory of change you present, specifically the (crucial) link between \"training HW's\" -&gt; \"reduction in deaths\", or your team's plans to measure the impact of training on:&nbsp;<ol><li>The actual change in HW behavior (e.g. they are now giving better advice and treatment in real life / on the field)</li><li>Whether the change in HW behavior actually saves lives (e.g. the improvement in advice/treatment leads to X lives saved)</li></ol></li></ol><p>[EDIT, Sep 13 2022: The paragraph after this one is wrong, see the excerpt below where Marshall links to the post about neonatal care, which includes studies of this kind of intervention directly measuring deaths averted.)&nbsp;</p><blockquote><p>My analysis of existing research studies shows that training HWs to properly care for newborn babies is likely to be&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/B7wohgDDdwPoQAatt/new-cause-area-training-health-workers-to-prevent-newborn\"><u>highly cost-effective</u></a>, with an average cost of&nbsp;<strong>$59 per DALY</strong> averted ($100 per DALY averted is&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/HbunzTyFPRwcYihg6/long-lasting-insecticide-treated-nets-usd3-340-per-life\"><u>sometimes cited</u></a> as a benchmark for highly effective interventions)....</p></blockquote><p>I still think my points apply to Marshall's teams specific implementation of the intervention. &nbsp;</p><p>[End Edit]</p><p>The closest I found in this post was a discussion on evidence related to skill gains &amp; knowledge retention. None of the following mention either a or b.&nbsp;</p><blockquote><ul><li>Online neonatal care training&nbsp;<a href=\"https://human-resources-health.biomedcentral.com/articles/10.1186/s12960-021-00559-2\"><u>leads</u></a> to significant knowledge and skills gains among HWs.</li><li>The infection control training I’ve been working on&nbsp;<a href=\"https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-12943-1\"><u>has</u></a> high completion rates, learning gains comparable to those seen in more resource-intensive in-person training, and very positive learner feedback.</li><li>Recent research&nbsp;<a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/jch.14419\"><u>shows</u></a> that a short online training in blood pressure measurement improves HWs’ clinical skills.</li></ul></blockquote><p>The second study you cite doesn't mention actual skills change, which seems more important than knowledge retention. The third study you cite is the one above in a US context, and I don't know how much this evidence transfers to an LMIC context.</p><p>However, you mention a lack of evidence in a <a href=\"https://forum.effectivealtruism.org/posts/B7wohgDDdwPoQAatt/new-cause-area-training-health-workers-to-prevent-newborn#comments\">previous post</a> \"New cause area: training health workers to prevent newborn deaths\" you mention that:</p><blockquote><p>I was tempted to title this piece “New cause area: health workforce development,” but the reality is that there’s much better data to quantify cost-effectiveness on a dollars-per-DALY basis in the niche of neonatal care training.<a href=\"https://forum.effectivealtruism.org/posts/B7wohgDDdwPoQAatt/new-cause-area-training-health-workers-to-prevent-newborn#fnluuyf8byg6\"><sup>[3]</sup></a>&nbsp;I believe that this much narrower cause area is just the tip of the iceberg – it’s easy to see and quantify but also indicative of a much bigger underlying and unaddressed problem. Fortunately, modest investments in neonatal care training might be cost-effective on their own while <i>also</i> generating transferable lessons applicable to the bigger problem.&nbsp;</p></blockquote><p>2. Based on this post, it's not clear to me how you / your team is prioritizing which countries or regions to operate in, which health problems to work on first, and why. Based on what you wrote in the previous post, <a href=\"https://forum.effectivealtruism.org/posts/B7wohgDDdwPoQAatt/new-cause-area-training-health-workers-to-prevent-newborn#Thoughts_on_next_steps\">the next steps</a> you outlined seemed very promising, and plausibly neonatal care could be good, but this is not mentioned in this post.&nbsp;</p><p>3. Becaus the funding amount is quite large ($4 million), it would be good to explain why you think this is the right amount to ask for right now. Based on my knowledge of early-stage global health startup NGOs, I'd expect that you could probably create a strong case for impact (e.g. run an RCT) and create a strong case for impact for somewhere in the range of USD $100,000-$500,000 (very very rough estimate, someone please correct me if this is way off!).&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "vzbmgsvDz5Ab3Me3s", "postedAt": "2022-09-13T22:14:35.005Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>Thanks for this feedback! This is exactly why I posted, so before I provide any specific responses to your points, please know that I appreciate all of the questions and suggestions and I'm already thinking of how they could be addressed in a future version of this proposal.</p><p>1. I appreciate your point that the key step in the theory of change is not clear - and I think this is not due to a gap in the data itself but instead due to a gap in my presentation of the evidence. The key supporting evidence is linked out from this statement:</p><blockquote><p>My analysis of existing research studies shows that training HWs to properly care for newborn babies is likely to be&nbsp;<a href=\"/posts/B7wohgDDdwPoQAatt/new-cause-area-training-health-workers-to-prevent-newborn\"><u>highly cost-effective</u></a>, with an average cost of&nbsp;<strong>$59 per DALY</strong> averted ($100 per DALY averted is&nbsp;<a href=\"/posts/HbunzTyFPRwcYihg6/long-lasting-insecticide-treated-nets-usd3-340-per-life\"><u>sometimes cited</u></a> as a benchmark for highly effective interventions)....</p></blockquote><p>The linked post cites six studies that show reductions in mortality due to HW training. &nbsp;While there are remaining reasons for skepticism, I think these six studies support this key step in the theory of change, at least for some types of training. Regarding your sub-points on point (1), I accept the feedback that we can and should provide more detail on the evaluation in a future version of this. The six studies provide pretty clear guidance on the type of data we would collect.</p><p>2. I agree that a roadmap of regions / countries / priority courses would be helpful to include and can add this to a future version. Thanks for the suggestion. We'd want to start with topics that have the strongest existing evidence base (such as neonatal care and management of childhood illness).</p><p>3. The dollar amount may seem high, but this is a technology development project. I think it will be very difficult to build a truly excellent learning platform that is tailored to this target audience without attracting top engineering talent, and that gets expensive. As I mentioned in the post, we've already done substantial piloting &nbsp;on a shoestring and I plan to continue to do that! I'll think further about whether we can present a tiered approach, with additional pilots done with an MVP.</p>", "parentCommentId": "tePNiiWxhFBtQu5Jy", "user": {"username": "mpt7"}}, {"_id": "jcEjX9igEdnBppBfx", "postedAt": "2022-09-13T22:43:26.615Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>Thanks for responding!</p><ol><li>I missed that link! Thanks for flagging. I think when I read that, it wasn't clear to me that this study had explicit examples of reduction in mortality. &nbsp;I'll edit my first comment so that people know it was included.&nbsp;</li><li>That makes sense, and I think it could make a big difference to e.g. potential funders reading this to be more clear.&nbsp;</li><li>I think the thing I would see as most important is demonstrating that your specific implementation of the solution results in deaths averted, and this could be done for a lower cost. At that point, if there is evidence, it makes sense to scale up / professionalize the platform.&nbsp;</li></ol>", "parentCommentId": "vzbmgsvDz5Ab3Me3s", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "hTkbgPep7gcY4jfxe", "postedAt": "2022-12-01T03:02:39.423Z", "postId": "4f7tXpp8npR853g9d", "htmlBody": "<p>Thank you for sharing this project. It looks great. A few minor comments and ideas. Wordpress is very flexible but requires lots of plugins to interface with each other for many functions to work. Consider chatting to <a href=\"https://www.linkedin.com/in/aliaqeel/\">Aqeel</a> or JJ Hepburn from <a href=\"https://sangro.io/\">Sangro</a>/AI Safety Support who recently used wordpress for a learning management system to see how they found it. Consider also using an existing platform with more pre-built features (e.g., Thinkific) where cross-compatibility might be less painful (see our&nbsp;<a href=\"https://eauq.thinkific.com/courses/ea-uq-intro\"><u>uni EA fellowship site</u></a>). At least at the start, these help projects like this get off the ground more easily. Most projects add their bells and whistles later.</p><p>My PhD student is doing a thesis very close to this project. She’s trying to accelerate knowledge translation in developing countries. Our hypothesis, like yours, is that online learning will rapidly and cost-effectively close the research-practice gap.</p><p>The first study in her thesis&nbsp;<a href=\"https://docs.google.com/document/d/13Zfd9PmhABV4xxJRPEPtqO0VkDSpU0Kj3enooL8Kj2o/edit\"><u>is a systematic review of randomised trials</u></a> using online learning in healthcare. We want to know how well online learning teaches professionals, and how well the training helps people translate it into practice. She’s aiming to find what features help the interventions work better. If you’re interested in the review, she’s looking for team members. Being a team member means you learn the results much more quickly and become an author on the paper, which can be good for credibility. If you want to find out more, email me at noetel [at] gmail.com or send me a message on the forum.</p><p>Her second study is a cost-effectiveness analysis of an online nursing intervention. Her third study is&nbsp;<a href=\"https://docs.google.com/document/d/19tyLyUyDgVn3BnTKmJ4Z9KHnR7bfU6OpnPoHrG-MnhI/edit?usp=sharing\"><u>a series of interviews in LMICs to see how professionals from those countries feel about online learning</u></a>. It sounds pretty well aligned with the kind of scoping your team is doing. If you’d be interested in the findings of a study like that, and possibly have some contacts from healthcare in LMICs, then again we’d be interested in collaborating (email me). She could run the interviews but you might find the results valuable.</p>", "parentCommentId": null, "user": {"username": "mnoetel"}}]