[{"_id": "xwgidYuXosMKhgEKY", "postedAt": "2015-07-14T02:41:11.959Z", "postId": "4HwgjhYrGat9Lcds5", "htmlBody": "<p>I've sometimes felt tensions in collective action problems between &quot;I should be a good altruist and go along with what benefits the group&quot; and &quot;I should take as much as I can because I'm the only EA here and I can put this to better use than anyone else.&quot;  It's not always been easy, but I think generally I'd rather just go for the collective action problem solution.</p>\n<p>Another anecdote is that my workplace has a workplace giving program where people can volunteer and donate to help underprivileged Americans.  I feel weird turning these down and I think it makes me look selfish, but little do they know that I'm actually having a tremendous impact (I hope).</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "4W9aM6kNK8auXsX7X", "postedAt": "2015-07-14T17:16:09.279Z", "postId": "4HwgjhYrGat9Lcds5", "htmlBody": "<p>I'd suggest being very cautious in thinking &quot;I should take as much as I can because I'm the only EA here and I can put this to better use than anyone else&quot; and analogous thoughts (though I know you don't personally fall into that trap Peter, being good-natured and gentle as a lamb :-). I discussed this in my post on <a href=\"http://effective-altruism.com/ea/eg/effective_altruism_and_consequentialism/\">effective altruism and consequentialism</a>:</p>\n<blockquote>\n<p>A third sort of non-consequentialist position is that we should not act wrongly in certain ways even if the results of doing so appear positive in a purely consequentialist calculus. On this position we should not treat our ends as justifying absolutely any means. Examples of prohibited means could be any of the adjectives or nouns commonly associated with wrongdoing: dishonesty, unfairness, cruelty, theft, et cetera. This view has strong intuitive force. And even if we don’t straightforwardly accept it, it’s hard not to think that a sensitivity to the badness of this sort of behaviour is a good thing, as is a rule of thumb prohibiting them - something that many consequentialists accept.</p>\n</blockquote>\n<blockquote>\n<p>It would be naive to suppose that effective altruists are immune to acting in these wrong ways - after all, they’re not always motivated by being unusually nice or moral people. Indeed, effective altruism makes some people more likely to act like this by providing ready-made rationalisations which treat them as working towards overwhelming important ends, and indeed as vastly important figures whose productivity must be bolstered at all costs. I’ve seen prominent EAs use these justifications for actions that would shock people in more normal circles. I shouldn’t give specific examples that are not already in the public domain. But some of you will remember a Facebook controversy about something (allegedly and contestedly) said at the 2013 EA Summit, though I think it’d be fairest not to describe it in the comments. And there are also attitudes that are sufficiently common to not be personally identifiable, such as that one’s life as an important EA is worth that of at least 20 “normal” people.</p>\n</blockquote>\n<p>Refraining from tipping might be an interesting and/or useful marginal case to consider. I'm not saying that EAs should <em>never</em> maximise their own gains in collective action problems, and tipping could be a case in which they should <em>if they're sufficiently sure they'll donate the money they thereby save</em>.</p>\n", "parentCommentId": "xwgidYuXosMKhgEKY", "user": {"username": "Tom_Ash"}}, {"_id": "YS3hRARPvQSSxks5R", "postedAt": "2015-07-18T21:11:32.068Z", "postId": "4HwgjhYrGat9Lcds5", "htmlBody": "<blockquote>\n<p>Refraining from tipping might be an interesting and/or useful marginal case to consider. I'm not saying that EAs should never maximise their own gains in collective action problems, and tipping could be a case in which they should if they're sufficiently sure they'll donate the money they thereby save.</p>\n</blockquote>\n<p>That's actually a really interesting question.  I try to tip generously, even though I'm pretty sure I'd donate the extra money.  I think that's definitely the right call when other people are watching.  It might not be the right call when you're alone but I think it still may be because it's important to show consistency and that the EA movement doesn't come at the cost of the developed world poor.</p>\n", "parentCommentId": "4W9aM6kNK8auXsX7X", "user": {"username": "Peter_Hurford"}}]