[{"_id": "cw9b4s2buTovqTe5a", "postedAt": "2022-12-15T17:54:08.684Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>Money is generally fungible, so in addition to \"grant is made using individual/small donations\" being a stronger case for your proposal, I think it is also stronger to the extent  that the organization as a whole seeks funding from, and is meaningfully funded by, small/medium donors.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "sRtHcuJfzCg3CcpWT", "postedAt": "2022-12-15T18:51:39.237Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>Good post</p>", "parentCommentId": null, "user": {"username": "Nick Lowry"}}, {"_id": "gLufLrjTvzZHnM2BC", "postedAt": "2022-12-15T19:28:19.744Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<blockquote><p>Currently, I’m still slightly sceptical but I’m happy I now understand the reasoning behind it a lot better</p></blockquote><p>I'd be really interested to see you comment on the Wytham discussion page with your current all-things-considered take.</p>", "parentCommentId": null, "user": {"username": "willbradshaw"}}, {"_id": "7zAfd8ytPTdjYjkoA", "postedAt": "2022-12-15T21:02:42.255Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>I think most of the organizations you're talking about already explain almost all of their major spending efforts in their annual reports, grants databases, and similar. &nbsp;CEA posts an annual update on the forum, and blogs about its plans. Open Phil posts [per comment below, edit to add: almost] all of its grants with some explanation. And they do have only limited details in many cases - but their more detailed anlyses often involve non-public information, such as consultations with experts who don't want to be publicly named, or analysis of grantees' finances and internal strategy documents.</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "dBqEqeAzWz4WBi5ei", "postedAt": "2022-12-15T21:57:50.272Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>I think the Wytham Abbey situation is a success for transparency. Due to transparency, many people became aware of the purchase, and were able to give public feedback that it seemed like a big waste of money, and it's embarassing to the EA cause. Now, hopefully, in the future EA decisionmakers will be less likely to waste money in this way.</p><p>It's too much to expect EA decisionmakers to never make any mistakes ever. The point of transparency is to force decisionmakers to learn from their mistakes, not to avoid ever making any mistakes.</p>", "parentCommentId": null, "user": {"username": "Kevin Lacker"}}, {"_id": "jCrfsHxgKriacc9gs", "postedAt": "2022-12-16T01:15:08.339Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<blockquote>\n<p>“Open Phil posts all of its grants with some explanation.”</p>\n</blockquote>\n<p>I do not think that this is accurate, I believe that some of their grants are not posted to their website.</p>\n", "parentCommentId": "7zAfd8ytPTdjYjkoA", "user": {"username": "jtm"}}, {"_id": "L7wWJTQZKNfpRzPfs", "postedAt": "2022-12-16T08:45:24.648Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>\"CEA posts an annual update on the forum.\"</p><p>This seems not to be true? &nbsp;CEA posted annual reviews for 2019 and 2020, but the most recent update post I see is for Q2 2021. &nbsp;Of course that was before the name change, so it was what we would now call an EVF update, but I can't see that EVF has ever made an equivalent post.</p><p>There is also nothing (I can find) more up-to-date on CEA's own website or EVF's own website. &nbsp;In fact, the best public source of information about EVF appear to be its statutory filings, which are extremely thorough, but still only run to 30 June 2021 (the filing for 2021/2 won't be due for about 4 months). &nbsp;In a sense, that's the system working as intended, but it does seem that an organisation commited to transparency might make some information available both more prominently and timelier.&nbsp;</p>", "parentCommentId": "7zAfd8ytPTdjYjkoA", "user": {"username": "RobertJones"}}, {"_id": "TguJBHDisovkAkREE", "postedAt": "2022-12-16T10:56:43.120Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>Another consideration is that no-one wants to perform the same cost benefit analysis every year on very similar expenses. Although that seems quite resolvable, by not mandating updates on calculations that have barely changed.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "4GFJdygjiATG4cMoP", "postedAt": "2022-12-16T11:57:33.544Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>Is the problem a lack of transparency, or a lack of timely information? &nbsp;They aren't able to reveal it before the decision is made, and there is a very high cost to rapid turnaround.</p>", "parentCommentId": "L7wWJTQZKNfpRzPfs", "user": {"username": "Davidmanheim"}}, {"_id": "4HzjATfutdFNRnP8h", "postedAt": "2022-12-16T12:06:23.013Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>Thanks, you're corect - they say they publish almost every grant, and have detailed explanations of most, but that some have less detail, and some are delayed due to sensitivity or undermining the purpose of the grant. See <a href=\"https://www.openphilanthropy.org/research/update-on-how-were-thinking-about-openness-and-information-sharing/\">here</a>, and especially the bolded points in the quote below:<br>&nbsp;<br>\"...we have stopped the practice of writing<strong> in detail</strong> about every grant that we make. We plan to continue to write in detail about many of them. We will try to focus on those that are especially representative of our thinking and strategy, or otherwise seem like they would be interesting and helpful to discuss.</p><p><strong>In most cases, when we do not produce a detailed writeup on a grant, we will still include the grant in our </strong><a href=\"https://www.openphilanthropy.org/giving/grants\"><strong><u>database</u></strong></a> with basic information about the date, amount and recipient, and a link to the relevant <a href=\"https://www.openphilanthropy.org/focus\"><u>focus area</u></a> so people can understand what broader goals the grant supports.</p><p>In some cases, even basic information about a grant (date, amount, recipient) could constitute sensitive information, for reasons including:</p><ul><li>It might reveal our tactical approach to a contested issue, helping people with directly opposing goals anticipate our and our grantees’ actions.</li><li>It might pose a serious risk of misinterpretation, and explaining our reasoning might be difficult and time-consuming.</li><li>It might pose a risk of exposing us to active harassment from people who oppose our goals.</li></ul><p>In these cases, we will generally<i><strong> delay</strong></i><strong> publishing</strong> basic information about the grant until and unless we have settled on a good strategy for communicating about it. We expect these cases to be rare.\"</p>", "parentCommentId": "jCrfsHxgKriacc9gs", "user": {"username": "Davidmanheim"}}, {"_id": "iXnJjBTr9aJ3jSC3v", "postedAt": "2022-12-16T12:25:59.266Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>I don't have anything really useful to say that isn't mentioned by others. My goal of the post was to ask a question and gather information. I don't have a strong opinion on the purchase anymore and the ones I have are with high uncertainty.</p>\n", "parentCommentId": "gLufLrjTvzZHnM2BC", "user": {"username": "Jeroen_W"}}, {"_id": "dMCdSyYNx9yyFjRoz", "postedAt": "2022-12-16T12:53:07.345Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>I had practically finished this post before Claire Zabel's comment. And since the purchase was was made a while back I was of the opinion EVF should've already written something about it. But since it's through Open Phil and only finalized this year plus with delay in grant publishing, that changes things. It still comes across as a 'failure' (I don't want to sound this harsh) that there is so much delay, but perhaps there are good reasons for it. Still, I hope this post has some usefulness so I decided to publish it anyway, as I would still like to see more transparency and clearer reasoning. But the case is potentially less strong as I preciously thought. I'll add this info to the post.</p>\n", "parentCommentId": "4GFJdygjiATG4cMoP", "user": {"username": "Jeroen_W"}}, {"_id": "znXyq6vu4kSvLYPYW", "postedAt": "2022-12-21T09:51:52.111Z", "postId": "4iLeA9uwdAqXS3Jpc", "htmlBody": "<p>FYI we just posted our annual review <a href=\"https://forum.effectivealtruism.org/posts/DajpFcaMrHv4fPLTy/cea-s-work-in-2022\">here</a>.</p>", "parentCommentId": "L7wWJTQZKNfpRzPfs", "user": {"username": "Maxdalton"}}]