[{"_id": "gP2SDjB9ueMRtoreL", "postedAt": "2022-12-18T20:01:20.892Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Thanks for the update. I think it would be valuable if you further update which of all these [things that might happen] are actually going to happen, once you know.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "5ARSBpkrA5zqyFf9X", "postedAt": "2022-12-18T20:08:28.592Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Thanks for sharing these details.</p><blockquote><p>We might introduce a variable pricing ticketing system where we ask people with higher incomes to pay more for their tickets (we expect to still have free and reduced cost tickets available for students and those on lower incomes).</p></blockquote><p>Is this new? I recall there being a tiering structure already. Or does this effectively mean there will be new, extra-high tiers on top?</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "RjffxpkWtmDkwTuob", "postedAt": "2022-12-18T20:11:13.652Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Yep that's right, there were already tiered discounts available, but now we'll likely be asking higher earners to pay more for their tickets (i.e., a new extra-high tier).</p>", "parentCommentId": "5ARSBpkrA5zqyFf9X", "user": {"username": "Eli_Nathan"}}, {"_id": "opvYftHFvC7LF8ecK", "postedAt": "2022-12-18T20:52:22.448Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I am somewhat surprised by some of these choices, and I'd be somewhat interested in hearing more about the reasoning (but no problem if you think it's too time-consuming to explain).</p><p>&nbsp;</p><p>Re catering, here's my quick, very low-confidence estimate:</p><ul><li>I'd have thought that access to catered dinners maybe increases the value of EAG by as much as making the event have twenty more minutes in it. (Because people otherwise have to go find dinner elsewhere in a way that might be inefficient, and they will have to get dinner in a place that is worse for mingling.)</li><li>Maybe the cost per person is like $30 (and if you don't cater, the attendees have to spend money on dinner themselves)</li><li>So the dinners buy you an EAG-equivalent hour for $90.</li><li>I'd have thought that EAG typically costs ~$4000 per attendee, and causes like 20 engagement-hours, which gives us a price of $200 per engagement hour. This is more expensive than the dinner, so I'd have thought the dinner looks cost-effective assuming EAG is cost-effective overall.&nbsp;<ul><li>EDIT: Actually, I think my $4k estimate is probably wrong; I now vaguely remember that EAGs cost $2k/attendee, at which the dinners still look better than EAG as a whole but not as much better.</li></ul></li></ul><blockquote><p>We might need to limit capacity at certain events (whereas previously we always accepted people if they were above a certain bar).</p></blockquote><p>What do you mean by this? I don't get why the policy shouldn't be \"always accept people if they are above a certain bar\". Perhaps the bar should change, but it feels to me like the obvious way of deciding who to accept should be something like \"for everyone who wants to attend, estimate how much value it would produce for them to attend, and estimate how costly it would be, and then accept everyone where value exceeds benefits\". It sounds like you're suggesting doing something else--what other policy are you suggesting following?</p>", "parentCommentId": null, "user": {"username": "Buck"}}, {"_id": "23TGbv3ZhY2WGLPmE", "postedAt": "2022-12-18T21:00:13.801Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>If there's not enough money to pay for all the things they're now considering cancelling, and you think they're making a mistake, shouldn't you bring up ideas for where else to save money rather than argue that some things are \"cost effective\"? \"Cost effective\" is relative to how much money you have available – if the money were extremely thin then all but the very best spending opportunities have to be cancelled!&nbsp;</p>", "parentCommentId": "opvYftHFvC7LF8ecK", "user": {"username": "Lukas_Gloor"}}, {"_id": "Fm8zp3oKNYe5oBKfL", "postedAt": "2022-12-18T21:09:32.793Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I hope that there is an emphasis on increasing the quality and focus on virtual events in the future. I want to be able to meet people in different cities who can't cover travel costs themselves but it feels like virtual events are not as prioritised, so in the past the types of people I would have wanted to talk to mostly did not engage as much with them.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Quadratic Reciprocity"}}, {"_id": "55E6raxkwGTBmr4v6", "postedAt": "2022-12-18T21:23:57.707Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p><strong>I don't think we should think of EA as having \"not enough money to pay for all the things they're now considering cancelling\".</strong> Open Phil has enough money for at least a decade of longtermist spending at current rates; the fact that they aren't spending all their money right now means that they think that there will be grant opportunities in the future that are better than grant opportunities that they choose not to make now.</p><p><strong>Decisions to cut back on spending on a community-wide level shouldn't be made from the perspective of short-term budgetary constraints,</strong> they should be made by thinking about what opportunities we'll have over the long term.</p><p>(That said, for practical reasons it does make sense for funders to give organizations budgets and then have those organizations try to optimize their spending subject to the budget constraint, instead of just giving all organizations a blank check and saying \"please only spend money that is better than our last dollar\". But this is not the frame we should use when we're deciding e.g. how much total funding EAGs should have.)</p>", "parentCommentId": "23TGbv3ZhY2WGLPmE", "user": {"username": "Buck"}}, {"_id": "riwxAhMGz4GY9CcF2", "postedAt": "2022-12-18T21:31:29.843Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<blockquote><ol><li><strong>Catering will likely be cut down.</strong> We’ll likely have to stop providing all three of breakfast, lunch, and dinner on each day for our conferences — we still expect to have&nbsp;<i>some</i> food or snacks available, but it’s currently unclear exactly what we’ll be able to provide.</li></ol></blockquote><p><br>I'd be curious to see a breakdown of catering costs in SF, DC &amp; London if you have them - specifically costs per meal, for drinks, and for snacks and what % of the total budget food has been. Things I think are more or less important (but don't have a sense of where the budget cut-offs are, hence the request for breakdown)</p><ul><li>I think having some kind of breakfast (even if it's just bread/peanut butter/ hummus/bananas) feels super important for essentially buying an extra 1-2 hours per person. If catering doesn't allow for a lighter breakfast and/or doesn't allow outside food etc. [edit: breakfast could also just be snacks/protein bars/etc.]</li><li>From my limited catering knowledge, drinks are usually the most expensive, so if not serving drinks during opening / closing speeches could potentially subsidise breakfasts / more food, that seems worth it.&nbsp;</li><li>Snacks also feel more optional</li></ul>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "jpbBg3M2LD5GQDQAT", "postedAt": "2022-12-18T21:36:04.116Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<blockquote><ul><li>Snacks also feel more optional</li></ul></blockquote><p>I strongly disagree fwiw; it was seriously inconvenient for me that there weren't snacks at EAGx Berkeley recently. And they're not very expensive compared to catering actual meals, I think.</p>", "parentCommentId": "riwxAhMGz4GY9CcF2", "user": {"username": "Buck"}}, {"_id": "qjmn35x5sMjxnWDyN", "postedAt": "2022-12-18T21:46:59.586Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>On point 3. I can imagine a \"staggered\" stipend system worth experimenting with, where volunteers can choose from e.g. 0, 100, 200, 500 USD etc. based on their own needs.</p><p><br>Reasons why I think this could work:<br>- Some volunteers that have less financial stability could really benefit from getting this option (the intrinsic motivation for wanting to volunteer doesn't take away &nbsp;thoughts of struggling financially. And I'm not saying volunteering should be an alternative for earning money but if that ends up being the decision ultimately, some people might need to decide to spend those volunteer hours doing other work. Especially if the volunteering requires several hours of travelling.)<br>- Volunteers are nudged to think about trade-offs (e.g. do I really need the additional 100 USD if for example they are choosing between a 100 and 200 stipend)</p>", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "82Bkr2BJf9JkYEF8T", "postedAt": "2022-12-18T21:56:51.383Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Your first comment sounded like you're criticizing CEA for their allocation of resources. Your second reply now sounds more like you're criticzing funders (like Open Phil) for not increasing CEA's budget. (Or maybe CEA for not asking for a funding increase more aggressively.) I guess the main thing you're saying &nbsp;is that you find it hard to believe everyone is acting optimally if we have to cut back on EAGs in these ways, given that money isn't <i>that</i> tight in the EA movement as a whole.&nbsp;</p>", "parentCommentId": "55E6raxkwGTBmr4v6", "user": {"username": "Lukas_Gloor"}}, {"_id": "HgPrn6jMFEaxqt9Hq", "postedAt": "2022-12-18T22:04:01.577Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<blockquote>\n<p>I think having some kind of breakfast (even if it's just bread/peanut butter/ hummus/bananas) feels super important for essentially buying an extra 1-2 hours per person</p>\n</blockquote>\n<p>Huh, can you say more on this?</p>\n", "parentCommentId": "riwxAhMGz4GY9CcF2", "user": {"username": "Neel Nanda"}}, {"_id": "x6brZfSXJCED4df2s", "postedAt": "2022-12-18T22:27:53.109Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Good to know a counterpoint - I guess different people have different preferences (e.g. breakfast is very important for me to be focused / able to fully participate in the mornings). I think I would still make the trade-off of to have breakfast over snacks (for reasons I mention in response to Neel below)</p><p>And now that I think about it, breakfast could just be snacks if it's cheaper.&nbsp;</p>", "parentCommentId": "jpbBg3M2LD5GQDQAT", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "nMqgodBvatmJQ4j2d", "postedAt": "2022-12-18T22:35:19.914Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>these are mostly educated guesses:</p><ul><li>some people (20%?) will arrive later to the conference venue if they need to get food first (30-60m later if you incl. transport, buying, eating outside the venue etc.). for those people, they might have had either 1-1s or casual conversations over breakfast.&nbsp;</li><li>some people (10?) might be more tired or have a less good experience if they come early but don't have time to get breakfast (so it's not really buying hours, but quality-adjust hours?)</li><li>some people (1%? 5%?) might come in much later if they know there won't be food til lunch</li></ul>", "parentCommentId": "HgPrn6jMFEaxqt9Hq", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "CSRii7AceRfqoBthy", "postedAt": "2022-12-18T22:39:35.961Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<blockquote><ol><li><strong>Travel grant funding will likely be more restrictive.</strong> Previously we’ve funded people to travel to any EA conference they’ve been accepted to. We expect to retain some amount of travel funding moving forwards, but we’ll likely have to be much more conservative about how much we give and who we give it to. When planning around an event,&nbsp;<strong>we’d recommend you act under the assumption that we will&nbsp;</strong><i><strong>not</strong></i><strong> be able to grant your travel funding request</strong> (unless it has already been approved).&nbsp;</li></ol></blockquote><p>I think it would be good to clarify how this affects people with less financial stability and/or who are based in countries that are farther away (specifically for EAG's). To me, providing funding for these groups seems like the biggest positives, since they would be least likely to attend without support. [edit: and generally have less opportunities for meeting the international EA community]</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "Bd4jMHmxyNroTZjDT", "postedAt": "2022-12-18T23:15:34.664Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Agree, besides being further away, this would most probably reduce the number of EAs from LMICs who go to &nbsp;EA conferences. I'm from Turkey and the limited number of people from Turkey who have gone to an EAGx did so because there was travel funding(including my first two conferences) and I'm quite confident none of them would be able to go if there was no funding(because I personally know them). I was thinking that 6 people from our college group would come to the next EAGx in Europe, but if there is no travel funding no one besides me <i>most probably&nbsp;</i> won't go(and I would be able to go because I'm on an EA fellowship!)&nbsp;<br><br>Still, I'm not saying all EAs from LMICs should be reimbursed or it makes sense to fund people who wouldn't otherwise be able to come to conferences(if they didn't receive funding) but i) on the margin providing travels grants to people from countries with low EA presence may have higher bang for the buck ii)A very selective travel grants policy would have this consequence(effectively reducing a considerable number of EAs based in LMICs from participating in EAGs)</p>", "parentCommentId": "CSRii7AceRfqoBthy", "user": {"username": "Berke"}}, {"_id": "R2Axqfvbyq89fSRYQ", "postedAt": "2022-12-18T23:24:52.665Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>FWIW there were lots of cause area themed / profession themed dinners at external venues on both days of EAGx Oxford and EAG London this year, despite the catered dinner being available, so that seems like a sensible area for you guys to cut spending.</p>\n<p>A bit concerned about travel funding reductions though, as that might have negative effects on cultural diversity within EA. Might make sense to target this reduction further, eg - retaining funding for people in LMICs but not providing it for people in HICs.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "7kxfjppcBWDp6M4ae", "postedAt": "2022-12-18T23:47:54.242Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>It seems like a good solution to consider would be to host a few/several EA global events/conferences/other events in countries with cheaper operating costs. There are several countries that are cheaper than US/UK and are still extremely safe and accessible for several people (if anything, some other countries have more liberal visa conditions that would cut down visa spending costs as well). Money spent per person could go long way in other countries and you wouldn't need to compromise funding people who could benefit from the conferences but can't afford them otherwise.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Davit Jintcharadze"}}, {"_id": "C4qZPCrAvDoKQQPar", "postedAt": "2022-12-18T23:55:39.715Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Is there information about how the rest of CEA's budget is affected by the circumstances above? That might help people put these reductions in context.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "JKMKJzkDJE53bkMor", "postedAt": "2022-12-19T00:01:52.950Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Agree, the FTX loss in particular is not just \"short-term budgetary constraints.\" It would seem  either that the EA movement was underfunding EAGs prior to these financial changes, or that reductions in funding are warranted now given the significant loss of expected money in the ecosystem.</p>\n", "parentCommentId": "82Bkr2BJf9JkYEF8T", "user": {"username": "Jason"}}, {"_id": "hSG4ArbAXk6Hg6md7", "postedAt": "2022-12-19T00:37:22.832Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I find this appealing but then I realised that most EAG attendees are US and UK based, so it'd result in \"attendees\" as a group spending more money on traveling to the conference. But maybe this expense would still be outweighed by the savings.</p>\n", "parentCommentId": "7kxfjppcBWDp6M4ae", "user": {"username": "Kaleem"}}, {"_id": "Gtbktnv8DzkZhpJ8f", "postedAt": "2022-12-19T01:18:03.092Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Thanks for the update.&nbsp;</p><p>I'd like to recommend that part of the process review for providing travel grant funding includes consideration of the <strong>application process timing</strong> for CEA-run or supported events. In my experience, key dates in the process (open, consideration/decision, notification of acceptance, notification of travel grant funding) happen much closer to the date &nbsp;of the event than other academic or trade conferences.&nbsp;</p><p>For example, in 2022, several Australian EAs I know applied ~90 days in advance of EAG London or EAG SF, but were accepted only around 30-40 days before the event.&nbsp;<br><br>A slow application process creates several issues for international attendees:</p><ol><li><i><u>Notice is needed for employment leave</u></i>. Prospective attendees who are employed usually need to submit an application for leave with 1+ months notice, especially for a trip of ~1 week or longer needed for international travel. Shorter notice can create conflict or ill-feeling between the employee and employer.</li><li><i><u>Flight prices increase as the travel date approaches</u></i>. An Australian report <a href=\"https://www.expedia.com.au/stories/2023-flight-hacks/\">recommended</a> booking international flights 6 months ahead of the date of travel. A Google <a href=\"https://blog.google/products/travel/how-to-find-the-best-deal-on-your-next-flight/\">report</a> recommended booking international travel (US&lt;&gt;Europe) at least 50-180 days [~2-6 months] ahead of the date of travel. By 30 days out - when my colleagues received notice of acceptance - flights were much more expensive, and some of the most convenient travel dates were unavailable.</li><li><i><u>Fit with other commitments and needs</u></i>. For parents, people with caring responsibilities, or people with disabilities, a slow process can lead to stress and conflict about whether to accept the invitation and how to make arrangements to support attendance at short notice.</li><li><i><u>Visa issues</u></i>. Visa applications can take weeks or months to approve by the destination country.</li></ol><p>Providing travel grant funding can help to \"smooth over\" some of these issues, e.g., by subsidising the increase in flight costs, offsetting the (literal or emotional) costs of navigating / negotiating commitments and needs. It is not a panacea - the application process itself also needs to be reviewed to reduce these issues. If the travel grant funding is significantly reduced but no change is made to the application process, there may be an unintended consequence of fewer international attendees who would otherwise be a good fit for events.</p><p>I support a review of travel grant funding processes. I ask that you also consider the application process (especially timing) and its relationship with the travel grant funding process, to improve the experience for international attendees so that the flagship events of EA Global can continue to live up to their name.</p>", "parentCommentId": null, "user": {"username": "AlexanderSaeri"}}, {"_id": "rdK23rwWWL9wcCEAd", "postedAt": "2022-12-19T01:26:05.983Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I'd be very curious how far EAG could go by <i>just</i> focusing on Soylent / Huel &nbsp;/ Mealsquares.</p><p>I can imagine you could get pretty serious savings by making a deal with a small number of brands for a large purchase. I would suspect EA's account for a serious proportion of these brand's revenue, and EAG's are the ideal place for them to market to new EA's and EA adjacent individuals, so they'd stand to gain a lot from even just providing merchandise at-cost.</p><p>Also, when hosting retreats, &nbsp;Soylent was always the most in demand item.&nbsp;</p><p>I have not loved the catering at past EAG events (EAG London, EAG SF, EAG DC... the exception was EAGx Boston, whose catering I thought was very good. Though no disrespect to CEA - I've handled event catering and <i>it is hell</i>. ). At all of these, I actually would have preferred it if instead of some (most) catered meals there were just assorted Huels (There has been soylent - but I can't stand soylent). &nbsp;</p><p>Lastly, I think this would be pretty funny. &nbsp;It's a pretty severe change, but I'd be curious to see how EAG participants would respond to this if proposed in a survey, and it's a fun visual symbol of \"efficiency and cost effectiveness <i><strong>vibes</strong></i>\" so there's some signaling benefit.&nbsp;</p>", "parentCommentId": "riwxAhMGz4GY9CcF2", "user": {"username": "EverettSmith"}}, {"_id": "xBotWEq33qrj5SSQ4", "postedAt": "2022-12-19T01:58:55.726Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>This is kind of tangential, but anyone who is FODMAP-sensitive would be unable to eat any of Soylent, Huel, or Mealsquares as far as I'm aware.</p>\n", "parentCommentId": "rdK23rwWWL9wcCEAd", "user": {"username": "jsteinhardt"}}, {"_id": "fZThfBainyR53Bdgx", "postedAt": "2022-12-19T02:03:50.027Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I don't like the food at EAGs and survive off of Huel/Soylent during the conference, it also makes it easier to carry on a conversation while consuming it.&nbsp;</p>", "parentCommentId": "rdK23rwWWL9wcCEAd", "user": {"username": "Quadratic Reciprocity"}}, {"_id": "o4X8RNwLuQe4mRksn", "postedAt": "2022-12-19T04:50:52.327Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>One candidate place is Mexico, which is much cheaper than the US while also being close enough that the cost of travel should be comparable to within the US. Though maybe it's higher.</p>\n", "parentCommentId": "hSG4ArbAXk6Hg6md7", "user": {"username": "therealslimkt"}}, {"_id": "fFY6hcztWoykzMkAB", "postedAt": "2022-12-19T08:49:24.452Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Counterpoint: if you do that, you'll get only people who like eating meal replacement as food. <em><strong>Ew</strong></em>.</p>\n", "parentCommentId": "rdK23rwWWL9wcCEAd", "user": {"username": "Guy Raveh"}}, {"_id": "LAQfFFvugAHB3aMTy", "postedAt": "2022-12-19T08:51:50.852Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I &nbsp;think this is something worth calculating, but I think we should consider that there are several people, who, for various visa-related issues, don't make it to UK/US conferences or who feel less incentive to travel due to other reasons (for instance if you have a full-time job outside of EA it can be tricky to ask for a day off at times) so it can make it seem like conference-goer EAs are mostly from the UK and the US. I don't know how seriously has this option been considered before. While I know these two countries have bigger EA populations, I wonder if traveling to a cheaper country and having the same conference conditions is better than traveling within the same country and having fewer resources available. I don't know if in terms of distance traveled someone from Utah would care significantly whether the conference is in SF/DC or Mexico City, or whether someone from England/Wales cares whether the conference is in London or Porto/Riga/Rome/Prague. I live in London and I feel like there are several cheap flights to other European countries from here, and flights within Europe are generally affordable at times.&nbsp;</p>", "parentCommentId": "o4X8RNwLuQe4mRksn", "user": {"username": "Davit Jintcharadze"}}, {"_id": "LYRgGvpfGJxcPF7WZ", "postedAt": "2022-12-19T11:12:23.490Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>To continue the tangent, I'm pretty sure this is not true for Huel. From <a href=\"https://uk.huel.com/pages/ibs-fodmaps-huel\">their UK website</a>:</p><blockquote><p>All ingredients listed in Huel Powder v3.0 and Black Edition Huel are low FODMAP and for this reason they can be used alongside the Low FODMAP Diet and as part of your dietary routine if you have IBS. If you have IBS and an extremely busy lifestyle where convenience is a top priority, Huel could form a part of your eating routine to ensure you are achieving a regular meal pattern and optimal nutrition.</p></blockquote>", "parentCommentId": "xBotWEq33qrj5SSQ4", "user": {"username": "JamesOz"}}, {"_id": "nR6CN5EoYnL9zXWSG", "postedAt": "2022-12-19T15:21:46.832Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>It's hard to respond with too much detail here because it's a changing landscape and I'm not sure what things will look like in six months or even a year. But broadly speaking I expect the policies to be different for EAGs and EAGx's, and also to vary between EAGx conferences (some EAGx events wouldn't really work without travel support, whereas others would work roughly fine).<br><br>For EAGs in particular, we'll assess each case individually (taking into account to what extent they'd be unable to attend without support) but expect to not be able to give out much travel grants overall — if I had to ballpark make a guess here I'd say ~10% of what we gave this year (but again the landscape might change, so don't take this too literally).</p><p>(Someone else commented about applicants from LMICs — this is minor but I'll note that we don't get too many applications from LMICs and the bulk of travel grant applications are from people living in the \"standard\" countries you'd expect, like the US, UK, and Europe.)</p>", "parentCommentId": "CSRii7AceRfqoBthy", "user": {"username": "Eli_Nathan"}}, {"_id": "3TiDLKHnSkBcAoX6p", "postedAt": "2022-12-19T15:30:58.942Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Based on your comment I looked this up:</p>\n<p>Right now flights from London to San Francisco cost £400-£500, compared to what they may be shorter notice (approx £1500+ in some cases). The difference is 2-4x , and you could buy flights + accommodation for a week now (around 2 months out) for less than just the flights may be around 2 weeks out (which is when the EA Global website says you would hear by). This is a significant difference when acting under the assumption of not being able to receive travel grant funding. I can see this in many cases being the difference between 'I can afford to go' and 'I cannot + will need the travel funding', particularly as hotels are also likely to get sold out and the remaining ones potentially being more expensive or further away.</p>\n<p>For EAGs, there was the policy of if you were accepted into one in a year, you would be accepted into all of them. If this will continue being the same, it feels like perhaps there should be an application round early, so people could know that they would get into future conferences (if they wanted to) and book flights/accommodation in advance accordingly.</p>\n<p>(For EAGxs the apply to one get into everything policy did not exist, but those are meant to be regional so the travel costs are significantly less anyway, at least within Europe)</p>\n", "parentCommentId": "Gtbktnv8DzkZhpJ8f", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "hWxdSLzKNpNQQeQvq", "postedAt": "2022-12-19T15:44:23.281Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>EAGx is in Mexico in a few weeks: https://www.eaglobal.org/events/eagx-latam/</p>", "parentCommentId": "o4X8RNwLuQe4mRksn", "user": {"username": "David Mears"}}, {"_id": "DmdBc2wckQuZi8D8Y", "postedAt": "2022-12-19T17:04:07.018Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I also was surprised to see meals being one of the places to cut, for similar reasons to Buck (but with more emphasis on \"if you don't cater, the attendees have to spend money on dinner themselves\").</p>\n<p>If grant funding isn't enough to cover food, the natural place to make this up is in the event pricing, which is already a sliding scale.</p>\n", "parentCommentId": "23TGbv3ZhY2WGLPmE", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Mk3AhgwXJtxK9m6zX", "postedAt": "2022-12-19T17:04:09.113Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<blockquote><p><strong>Catering will likely be cut down.</strong> We’ll likely have to stop providing all three of breakfast, lunch, and dinner on each day for our conferences — we still expect to have&nbsp;<i>some</i> food or snacks available, but it’s currently unclear exactly what we’ll be able to provide.</p></blockquote><p>This seems like it might be a bit of a false economy. People need to eat, and there are probably economies of scale in food purchasing that make it easier to buy in bulk (both financially and in time spent). Additionally, if food is funded by CEA (rather than from ticket sales) then the conferences are buying it with pre-tax dollars. Also, proper catering helps the conference have proper vibes.</p><p>Against this we have to consider the fact that not everyone likes the same food, for example if the conference only serves vegan food but some attendees want to eat meat. But on the whole my impression is the median attendee has found the food satisfactory.</p><p>My guess is that if you (hypothetically) offered people the choice between tickets with and without food, with the price difference set as the average per-capita cost of catering, then most people would choose to pay the higher price.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "sbdpE4WSNSy6JP2Wf", "postedAt": "2022-12-19T17:04:28.507Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I really like the availability of food at EAGs. I'd spend more and be hungrier if that weren't the case. Here are some suggestions to reduce costs while not reducing availability:</p><ul><li>Reduce the amount of alcohol. This feels less important to me, though I guess I don't really drink so I'm biased</li><li>Reduce the amount of snacks/ deserts. I like these but they seem less important than ensuring people are fed</li><li>Have less fancy vegan food. I would happily eat beyond meat burgers like 25% of the time, or as a filler alongside the nicer food</li><li>Have less huel/soylent. I like this, but maybe there is a cheaper option. The bottled stuff is pretty pricey.</li></ul>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "7wwWkA2vyRbwszRab", "postedAt": "2022-12-19T17:21:05.613Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I've seen this discussed on some other comments, though I'll just respond to this one point here: catered food as provided by most large venues and caterers (at least in the US) is generally <i>much</i> more expensive per person than people just buying meals on their own at normal restaurants, it's not a simple case of economies of scale unfortunately — there's a big mark up.</p>", "parentCommentId": "Mk3AhgwXJtxK9m6zX", "user": {"username": "Eli_Nathan"}}, {"_id": "x8iroz6Spdr5JuCsX", "postedAt": "2022-12-19T17:41:11.361Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<blockquote><p>Open Phil has enough money for at least a decade of longtermist spending at current rates; the fact that they aren't spending all their money right now means that they think that there will be grant opportunities in the future that are better than grant opportunities that they choose not to make now.</p></blockquote><p><br>This doesn't match my model of philanthropic portfolio investment management. One key problem is that there is a lot of value in <i><strong>ongoing</strong></i> funding of organizations and projects, and having a donor who can fund you for a decade is easily &gt;20x as valuable as one who will fund a bunch of work all at once, then disappear - and giving an organization a decade worth of funding all at once is far less useful than monitoring and calibrating to the organization's success and needs.</p>", "parentCommentId": "55E6raxkwGTBmr4v6", "user": {"username": "Davidmanheim"}}, {"_id": "C3CzxuysjJfntzqSe", "postedAt": "2022-12-19T17:57:17.224Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Spending any money on alcohol (at least at catering prices) seems like bad optics at a minimum. I'd argue that is always so, but especially in light of current dynamics. It would give the impression that providing expensive free booze for insiders is more important than returning every penny that was stolen from FTX depositors. (Of course, this concern will expire if EVF makes a firm commitment to disgorge all funds ever received from an FTX or Alameda associated source.)</p>\n", "parentCommentId": "sbdpE4WSNSy6JP2Wf", "user": {"username": "Jason"}}, {"_id": "FGWJmLJnkgoBnyjGv", "postedAt": "2022-12-19T19:33:37.127Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I would think that if Huel/Soylent substitutes at all for other catered food, it's likely very cost-effective to stock</p>", "parentCommentId": "sbdpE4WSNSy6JP2Wf", "user": {"username": "MHR"}}, {"_id": "uD9kLTKT3hsHCvNwa", "postedAt": "2022-12-19T20:05:23.862Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I'm pretty sure EVF will send all that it's legally required to send to EVF depositors.</p><p>After that I <i>really</i> hope that the argument \"that money could instead go to FTX depositors\" will not replace \"that money could literally save several lives\", when talking about buying food/drinks vs donating money.</p>", "parentCommentId": "C3CzxuysjJfntzqSe", "user": {"username": "AnonymousAccount"}}, {"_id": "9kbWoQ6EukvCkTaSn", "postedAt": "2022-12-19T20:25:25.345Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>For various reasons, there may be a difference between <i>returning all that is legally required</i> and <i>returning every penny received</i> (we don't know yet). From an optics perspective, I think there is very much a reputational hit for any charity -- EA or not -- that does not return an amount equal to what it got. But that hit is magnified if it then spends money in a way that seems to benefit insiders more than the charitable mission.</p><p>I wasn't intending to restate the debate over whether monies used to fund meta things would be better spent on direct work -- I have my opinions on that (which would favor no free alcohol for the reasons you imply), but I don't presume that I have anything to add to what has been said in the past on the meta/direct tradeoff more generally.</p><p>On the broader scale, I think one of the greatest long-term existential risks to any charitable organization or movement is a slow, nearly inperceptible drift to decisions being made based on the interests of insiders as opposed to beneficiaries. It's happened too many times to count with other charities/movement, and is in my mind a likely outcome for <i>any</i> charity/movement that does not maintain constant vigilance surrounding its culture. So in addition to the optics question and the question you posed, I would ask: \"Does incurring this expense create a risk of subtly moving culture and expectations away from a beneficiary-focused mission, in which meta is a means to an end and not an ultimate end in itself?\"</p>", "parentCommentId": "uD9kLTKT3hsHCvNwa", "user": {"username": "Jason"}}, {"_id": "Eg4AyDjXLL6t23H9W", "postedAt": "2022-12-19T20:38:47.322Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Many venues don't let you bring in outside food. Catering is extremely overpriced (the cost per person per meal) and oftentimes you can't sign a contract for a venue without agreeing to catering costs.&nbsp;</p>", "parentCommentId": "FGWJmLJnkgoBnyjGv", "user": {"username": "ElikaSomani"}}, {"_id": "rJZ9FGiPRaCn5pxCF", "postedAt": "2022-12-19T20:41:44.731Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Catering can often be a lot more than $30 USD per person per meal. And it's also sometimes necessary to go with a certain catering company and meet a minimum in order to book a venue.&nbsp;</p>", "parentCommentId": "23TGbv3ZhY2WGLPmE", "user": {"username": "ElikaSomani"}}, {"_id": "xCfJEjao2rAMdNCAt", "postedAt": "2022-12-19T21:36:58.344Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>And/or holding these events out of fancy urban centers perhaps?</p>\n", "parentCommentId": "7kxfjppcBWDp6M4ae", "user": {"username": "david_reinstein"}}, {"_id": "QZgmiyLdXArWb8ABb", "postedAt": "2022-12-19T22:31:01.085Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I think it's a great idea. I'm sure there are strong selection effects when it comes to who decides to go to EAG, and that if we hosted it for instance in Mexico or India, there would be a large number of qualified folks that decided to come.&nbsp;</p><p>Not only does it help make sure we are sourcing individuals with a high potential impact from countries outside of the U.S. and U.K., it also would be a great PR move for EA, and CEA specifically. I think it would show a strong commitment from EA as a whole that we care about actual ability and potential good, rather than selecting for people with high levels of wealth, academic credentials, or raw technical ability.&nbsp;</p><p>My personal, anecdotal take is that the above signals have been vastly overrepresented in EA to date, which may have been helpful to grow the movement. However as we get bigger and look to sway mainstream opinion, we need to start becoming more appealing to those on the lower end of the income spectrum, &nbsp;people with more soft skills, and older people who have desperately needed experience.</p>", "parentCommentId": "hSG4ArbAXk6Hg6md7", "user": {"username": "Wil Perkins"}}, {"_id": "HpnronfdMdKp5ocs4", "postedAt": "2022-12-19T22:48:08.125Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>That would be even more effective. I imagine the cost of an event outside of a capital of a Southern European/Eastern European country &lt; &nbsp;cost of an event in the capital of these countries &lt; cost of an event in US, UK, Western Europe &amp; Nordics in the capitals. &nbsp;And this is just taking Europe alone.&nbsp;</p>", "parentCommentId": "xCfJEjao2rAMdNCAt", "user": {"username": "Davit Jintcharadze"}}, {"_id": "dkmhnv2DaWAEsidse", "postedAt": "2022-12-19T22:49:37.069Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I wonder if cheaper venues further out could be worth considering?</p>\n<p>If most conference attendees don't live in the city but only travel there for the conference, they might not care much if it's in the center or else where. I (and many others I spoke to) actually would prefer an EAG London in a less expensive, less central part of the city.</p>\n", "parentCommentId": null, "user": {"username": "Manuel_Allgaier"}}, {"_id": "SCfTYGQWTKC3JaHks", "postedAt": "2022-12-19T22:51:58.777Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Excited to hear that you're considering variable ticket pricing!</p>\n<p>This worked very well for us at German EA retreats - people paid anywhere from 50-200€ per ticket and we reached our target of 100€ on average.</p>\n", "parentCommentId": null, "user": {"username": "Manuel_Allgaier"}}, {"_id": "EJ7ppqad3TnDBLuCC", "postedAt": "2022-12-19T23:19:14.858Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>And -- ask your lawyer/accountant -- but at least in the US I think you could give attendees a certain amount of cash for meals without requiring receipting or generating taxable income.  This would be pointless since you could just lower the entry fee instead --  <em>except</em> to the extent someone's entry fee was already zero due to limited income and you were worried about making their attendance unaffordable by eliminating catering.</p>\n", "parentCommentId": "rJZ9FGiPRaCn5pxCF", "user": {"username": "Jason"}}, {"_id": "BmhBzwwfnAv2ff4Rt", "postedAt": "2022-12-20T02:59:01.933Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Most things get cheaper if you want to buy a lot of them at a predictable time known well in advance than if you just show up and ask for a small amount, so this is really pretty weird. I wonder how much of this is that CEA is generally looking for vegan caterers, and has a very different crowd (lots of non-vegans, much less health focused, more men, people who want more protein, etc) than most events that want vegan catering?  I just did about five minutes of looking around at cheap catering (ex: <a href=\"https://www.spinellis.com/wp-content/uploads/2020/03/East-Boston-Catering-Menu-2022.pdf\">Spinelli's</a>) and if you give up that constraint it looks much cheaper than \"everyone goes to a restaurant\".</p>\n", "parentCommentId": "7wwWkA2vyRbwszRab", "user": {"username": "Jeff_Kaufman"}}, {"_id": "FzjDn9w9SZcLfxHrB", "postedAt": "2022-12-20T03:01:50.812Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I think this probably isn't the case for the venue's CEA is renting for EAG etc, because most of these venues wouldn't be able to meet CEA's catering constraints (vegan but not anywhere near your typical vegan, <a href=\"https://forum.effectivealtruism.org/posts/4JF39v548SETuMewp/update-on-spending-for-cea-run-events?commentId=BmhBzwwfnAv2ff4Rt\">etc</a>)</p>\n", "parentCommentId": "Eg4AyDjXLL6t23H9W", "user": {"username": "Jeff_Kaufman"}}, {"_id": "DkmqCRoZBsLKopiPs", "postedAt": "2022-12-20T03:28:46.274Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>We generally have to use the caterer the venue provides or recommends (or pay a fee) — and if that's not the case we're generally pretty limited in our options anyway. These caterers (e.g. the ones based out of a hotel) are usually not vegan only and we just get them to build out a vegan-specific menu. I've often seen the pricing for their standard non-vegan stuff (for hypothetical events a year in advance) and it doesn't differ that much.</p><p>My guess of what's going on here is that these venues often make a substantial amount of money through their catering, and they don't have back to back meals (like a restaurant does), and so they charge a substantial mark up.</p>", "parentCommentId": "BmhBzwwfnAv2ff4Rt", "user": {"username": "Eli_Nathan"}}, {"_id": "RjRJkaZGbmhqBXrka", "postedAt": "2022-12-20T03:30:50.182Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Replied on the other thread, but yeah I'll note that this is annoyingly the case for most of the EAGs we run — we just get the caterers to build out custom menu for our events (usually with a lot of back and forth).</p>", "parentCommentId": "FzjDn9w9SZcLfxHrB", "user": {"username": "Eli_Nathan"}}, {"_id": "WW4rBwTHnFdQsHFQz", "postedAt": "2022-12-20T11:51:45.026Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>If you don't offer meals do you still have to pay the fee?</p>\n", "parentCommentId": "DkmqCRoZBsLKopiPs", "user": {"username": "Jeff_Kaufman"}}, {"_id": "DRzaA4yXJybMmZc8d", "postedAt": "2022-12-20T12:00:19.890Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I'm not entirely sure, most of our contracts have a food and beverage minimum, meaning that you need to spend a certain amount of money on catering with the venue. My guess is that we could get contracts without this minimum but they'd be much higher (and you'd get no food, so you'd be wasting money kinda).</p>", "parentCommentId": "WW4rBwTHnFdQsHFQz", "user": {"username": "Eli_Nathan"}}, {"_id": "DrXL9pkuXz89DeGAz", "postedAt": "2022-12-20T13:11:03.585Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I just want to say, I found this to be a super interesting comment. Thanks!</p>\n", "parentCommentId": "DkmqCRoZBsLKopiPs", "user": {"username": "jpaddison"}}, {"_id": "ppkePdC2umsnYNXzS", "postedAt": "2022-12-20T22:35:26.990Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Super interesting, thanks for sharing! This has completely changed my mind from \"CEA Events seem to be screwing up\" to \"huh, this seems entirely reasonable, and is just some weird market failure\"</p>\n", "parentCommentId": "DkmqCRoZBsLKopiPs", "user": {"username": "Neel Nanda"}}, {"_id": "Bs93TDp6Ebj9WPP7h", "postedAt": "2022-12-21T00:52:24.177Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Thanks for your detailed comment! I work on the events team so I can add some info.&nbsp;<br>Yep, we broadly agree here. We're keen to open and review applications earlier than we have been doing, for many of the reasons you mention. It's something we've been actively working on for a while, but unfortunately we have been dealing with a variety of bottlenecks on this front. We have designed a new application system for EAG 2023, which will open &nbsp;very soon. It's an application for all of the EAGs in 2023, rather than on a conference by conference basis. So, once people are accepted, they can then register (and plan/book travel for) any of the announced EAGs in 2023.</p><p>EAGx admissions are done by their respective organising teams, as they are community hosted. CEA just supports them, so we can't directly control their admissions turnaround, but we are making systems improvements that the EAGx teams can benefit from too. This will hopefully help somewhat!</p>", "parentCommentId": "Gtbktnv8DzkZhpJ8f", "user": {"username": "charlottedarnell"}}, {"_id": "nvgLdH8Ycdj7usktR", "postedAt": "2022-12-21T02:24:24.214Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Roughly how many meals per conference is the minimum?</p>", "parentCommentId": "DRzaA4yXJybMmZc8d", "user": {"username": "Linch"}}, {"_id": "en4bmvhsbEjW8axE8", "postedAt": "2022-12-21T16:32:32.943Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Thanks for the update!<br><br>I am curious about the odds of EA-London not being fully catered so I created a market: \"<a href=\"https://manifold.markets/ElliotDavies/will-eag-london-2023-be-fully-cater?referrer=ElliotDavies\">Will EAG London 2023 be fully catered</a>?\".&nbsp;</p>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "6E8h5Y4b9wPKf4SmA", "postedAt": "2022-12-21T22:38:24.742Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>To give people some idea about the cost of EAGX's: for Prague, where we had about 400 attendees, the cost was roughly £270 per person, and out of that, £120 was for food. Our venue didn't have its own catering so we could arrange what we wanted on whatever scale we wanted. We could easily just do lunch and snacks.</p>", "parentCommentId": null, "user": {"username": "IrenaK"}}, {"_id": "4eMCdoNFw9ifNjXCx", "postedAt": "2022-12-22T05:19:13.993Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Not hugely surprising, given the people at CEA have certainly thought about this more than random forum users. Still, it's good to do diligence. Thank you Eli for responding; this is a model example of somebody graciously explaining non-obvious considerations in a decision.</p>\n", "parentCommentId": "ppkePdC2umsnYNXzS", "user": {"username": "ThomasWoodside"}}, {"_id": "QqM7HchetdYhA9kgr", "postedAt": "2022-12-22T11:20:11.190Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>I'd be excited about CEA hosting or supporting more virtual conferences. These are far cheaper than in-person events, are more accessible in many ways, and I'd estimate they capture about 60% of the value for an individual attendee that an in-person event does.</p><p>I could imagine 2-3 of these happening in 2023, perhaps including some for more specific audiences like the previous <a href=\"https://forum.effectivealtruism.org/posts/jsNP3KLfHwmsSkqiM/apply-now-ea-student-summit-october-24-25\">student summit</a>. These would have the advantage of being able to have a much lower bar for entry (since costs don't increase as linearly as in-person conferences). They could therefore be a place to absorb all those who won't be accepted to conferences or won't be able to travel.&nbsp;</p><p>[I was on the organising team for EAGxVirtual 2022]</p>", "parentCommentId": null, "user": {"username": "Jordan Pieters"}}, {"_id": "aHdvF9Gy6QqXdHEaz", "postedAt": "2022-12-22T11:28:09.486Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>The idea of there being increased financial barriers to attending conferences concerns me a lot.</p><p>I'd hate to end up in a situation where lower income people or students are discouraged from even applying because they know they won't be able to afford it. I know it would be soul crushing for many people to receive an email saying they've been accepted, but be unable to consider attending due to financial barriers.&nbsp;</p><p>I'd have a preference for smaller events where people are guaranteed funding if they need. I think that looking after a smaller group of people very well can be better than a large group of people having a worse experience.</p><p>There's a chance that these increased financial barriers could negatively affect the geographic and socioeconomic diversity in EA that some people have been working hard to improve.</p>", "parentCommentId": null, "user": {"username": "Jordan Pieters"}}, {"_id": "qnigAibLiGZ65mYWj", "postedAt": "2022-12-23T13:05:51.362Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Probably around three, though we get snacks and drinks (coffee, tea, etc.) too which eats into the minimum spend.</p>", "parentCommentId": "nvgLdH8Ycdj7usktR", "user": {"username": "Eli_Nathan"}}, {"_id": "iuykmxnhc2QBuMzqJ", "postedAt": "2022-12-23T14:38:21.823Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Thanks this is helpful.</p>", "parentCommentId": "qnigAibLiGZ65mYWj", "user": {"username": "Linch"}}, {"_id": "onq3hqhzsZX7hSDvL", "postedAt": "2022-12-23T15:38:10.307Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>There's several comments here about the catering part, so I just wanted to say that cutting down on catering doesn't seem like a big deal to me. I'll bring some trail mix.</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "GGjY8fGSYPjhzipRr", "postedAt": "2022-12-23T15:45:49.206Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Seconding this: I think food at EAG is really high-impact:</p><ul><li>It keeps people together in one place (rather than dispersing to restaurants).</li><li>It gives a natural informal social time.</li><li>It stops people from wasting time/energy finding food.</li></ul><p>That last one is particularly valuable if, like me, you find one-on-one meetings both valuable and draining, and end up with ~no energy by the end of the day.</p><p>In terms of tradeoffs, I'd much prefer (full catering + worse venue) over (reduced catering + nicer venue), and I think that applies even if the venue is like, a tent in a field 20 miles from Heathrow.&nbsp;</p>", "parentCommentId": "opvYftHFvC7LF8ecK", "user": {"username": "Adam Jermyn"}}, {"_id": "tyYqJwmQAhY4r9QYj", "postedAt": "2022-12-23T23:03:32.371Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>re my previous comment (and I noticed Nathan brought it up in another comment, but haven't seen it addressed), i'm curious what portion of spend comes from drinks / alcohol?</p>", "parentCommentId": "DRzaA4yXJybMmZc8d", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "AShZvy4XbSNGYtFhM", "postedAt": "2022-12-23T23:07:04.354Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>It's not just the money, it's also the collective time costs. My guess is that it would cost quite a lot although it would great to get numbers on what % of attendees are locally based for SF &amp; London respectively, and then do rough estimates.&nbsp;</p>", "parentCommentId": "hSG4ArbAXk6Hg6md7", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "AHsak823G9zihh6kB", "postedAt": "2022-12-23T23:11:15.924Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Curious where the 60% number is coming from - is that because people make 60% of the connections?</p>", "parentCommentId": "QqM7HchetdYhA9kgr", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "w3heGeCcvNjKc99tP", "postedAt": "2022-12-24T09:04:19.885Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>It's a rough estimate. I think it's difficult to quantify the value of a conference for one individual</p>", "parentCommentId": "AHsak823G9zihh6kB", "user": {"username": "Jordan Pieters"}}, {"_id": "bNfEX9hZ7LvEZ2DBY", "postedAt": "2023-01-04T17:21:12.992Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>What don't you like about it? Signed, future EAGx organiser</p>", "parentCommentId": "fZThfBainyR53Bdgx", "user": {"username": "David Mears"}}, {"_id": "wzyHSEcWfu4M5nk5h", "postedAt": "2023-01-05T17:19:33.664Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Have we considered not having the events be vegan? Seems like it adds a lot of cost. If they were 50% vegan how much would be saved?</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "rYmqtaZTiJFaFCLHw", "postedAt": "2023-01-05T17:45:18.894Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>It doesn’t really add much cost, pricing for vegan vs non vegan items under standard large venue caterers is pretty similar.</p>\n", "parentCommentId": "wzyHSEcWfu4M5nk5h", "user": {"username": "Eli_Nathan"}}, {"_id": "pwKFs7gBZeuXr5888", "postedAt": "2023-01-10T08:06:08.040Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Or even some other, much cheaper, well connected UK city (eg Birmingham, Manchester, York, or Edinburgh).</p>\n", "parentCommentId": "dkmhnv2DaWAEsidse", "user": {"username": "jooke"}}, {"_id": "dn3wjkAEyhzQGZRNP", "postedAt": "2023-01-14T13:43:39.177Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Generally, we get our contracts to have alcohol \"by consumption\" so we only pay for what we use. My experience with EA events is that people usually don't drink that much so the portion of spend on alcohol is typically not significant.&nbsp;</p>", "parentCommentId": "tyYqJwmQAhY4r9QYj", "user": {"username": "AmyLabenz"}}, {"_id": "gZnpC3MGkHEMi9mjp", "postedAt": "2023-01-24T04:06:22.181Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Apparently catering at conferences typically costs more like $50-80 per person per meal, according to the EAGxBerkeley postmortem thread.</p>", "parentCommentId": "opvYftHFvC7LF8ecK", "user": {"username": "robirahman"}}, {"_id": "whtFRLFyWEvcbA3hz", "postedAt": "2023-01-24T04:09:50.734Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<blockquote><p>&gt; We might need to limit capacity at certain events (whereas previously we always accepted people if they were above a certain bar).</p></blockquote><blockquote><p>What do you mean by this? I don't get why the policy shouldn't be \"always accept people if they are above a certain bar\". Perhaps the bar should change, but it feels to me like the obvious way of deciding who to accept should be something like \"for everyone who wants to attend, estimate how much value it would produce for them to attend, and estimate how costly it would be, and then accept everyone where value exceeds benefits\". It sounds like you're suggesting doing something else--what other policy are you suggesting following?</p></blockquote><p>It sounds like previously the policy was that they have some threshold they had thought of in advance of setting up the conferences - let's say everyone above this threshold is a Qualified Effective Altruist, and their policy is to open the applications for every event and make all the conferences big enough to admit every QEA who applies. But now there is less funding and more QEAs, so individual conferences may have to have higher bars for entry, and they might not admit you even if they think you're qualified according to the previous standard.</p>", "parentCommentId": "opvYftHFvC7LF8ecK", "user": {"username": "robirahman"}}, {"_id": "wkyQJtnAyNLbjH9AF", "postedAt": "2023-08-03T11:30:13.675Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>Is there a viable version of non-catering where the organizers promise nothing but also invite a bunch of food trucks to camp by the venue? Perhaps that could help at least some of the attendees have fast and affordable food options.</p>", "parentCommentId": "rJZ9FGiPRaCn5pxCF", "user": {"username": "VictorW"}}, {"_id": "ZYeAcj5YvtiPo6uAQ", "postedAt": "2023-08-04T16:04:33.181Z", "postId": "4JF39v548SETuMewp", "htmlBody": "<p>We've looked into this very briefly for EAG, and my understanding is that there aren't many (large) venues for which this would work well. Most of our venues require us to spend a minimum amount of money on food and beverage, there often isn't a clear location where food trucks would park, and most venues don't let you bring in outside food into the venue (meaning that if it's raining for example, attendees would have to eat their food truck lunches outside).<br><br>These aren't slam down points, mostly because I'm not 100% confident how food trucks would work, and this has prompted me to investigate food trucks more deeply now, so thanks for that!<br><br>For EAG Bay Area 2023, we didn't do dinners on the Saturday and Sunday night (to save money) and it worked well-ish because there were lots of restaurants nearby. I do think it meant that most attendees left at ~6pm and didn't come back (whereas when we've provided dinner, lots of people stay until the 10pm closing time). This tells me that not providing dinner did come at some cost (reduced networking time), though I still think the decision to not provide these dinners was worth it given their potential financial cost.</p>", "parentCommentId": "wkyQJtnAyNLbjH9AF", "user": {"username": "Eli_Nathan"}}]