[{"_id": "5zzpLadXnK5vopBFg", "postedAt": "2014-12-18T13:25:33.413Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>For someone who is new to the concept of EA, I found it incredibly helpful. Thank you for this. </p>\n", "parentCommentId": null, "user": {"username": "ullmann"}}, {"_id": "rfxbsZTxwBcMjRNBK", "postedAt": "2016-11-02T07:57:51.608Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Thanks. Taking care of the others means that in the same time we have to take care of ourselves. If it doesn't happen and it costs us too much there will be more people who do not agree in order to help others: everyone needs to be happy. But if we live without taking care of the others we'll fail in our self realisation that asks to do our duty, but our duty cheerfully, with joy, not as a heavy weight.</p>\n", "parentCommentId": null, "user": {"username": "Patrizia"}}, {"_id": "Rf6ecGheLFRdq2NWo", "postedAt": "2017-02-22T18:09:31.105Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p> (excuse my english ) is a very useful concept, thanks !  is always a bad history of suffering behind those who do harm to others.  when we feel better with our lives is the best moment for help other people.  is very importan than everyone get their goals beacouse when people feels realize is ready to help the others.</p>\n", "parentCommentId": null, "user": {"username": "silvia_fromargentina"}}, {"_id": "8zkaZjf5K2nwzMCbX", "postedAt": "2017-05-02T03:49:28.362Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Thank you so much. This has become a sticking point for me, because suddenly my need to be altruistic also became a need to punish myself for how lucky I am. I was overwhelmed by everything I had, which also made it hard to just move forward and DO SOMETHING about what I'm seeing. Thank you for mentioning cheerfulness. I'm finally starting to DO, and notice when I can't do. </p>\n", "parentCommentId": null, "user": {"username": "ashley_p"}}, {"_id": "i8zpjKnHt5rN59Sjo", "postedAt": "2018-01-25T18:56:03.276Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Truly lovely post. Thanks</p>\n", "parentCommentId": null, "user": {"username": "tamama"}}, {"_id": "gxyxH4RHfuNpGXzXE", "postedAt": "2018-09-06T13:37:22.615Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>This is an interesting concept.  Giving is a cheerful act not a punishing and resentful event.   Agree.   From my perspective giving means leaving behind self interest and receiving the satisfaction in invisibly giving and witnessing the development of others.   I say invisibly because much of my giving through online forums is not experienced in a face to face encounter.  We may receive a thank you or an updated report but we are not there to see first hand the results.  Yet this type of giving frees myself from the false pride I could receive through potential accolades.  This is because it is not about me but it is about us as humans and us as a community helping each to feel safe, secure, happy and fulfilled.  In these cases, I am choosing to focus more on the lives of others and not my own.  And consequently it allows me to see more clearly the value in others and to be a distance observer of their growth.  I think it helps me remember there are those who live in poverty and in a small way I can help.   </p>\n", "parentCommentId": null, "user": {"username": "Jan"}}, {"_id": "3Dw2bxZJKifZXQWm6", "postedAt": "2018-10-26T19:46:34.742Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Somehow this doesn’t sit right with me. I know that people have breaking points (maybe more than most), and I don’t believe in optimizing everything in your life in a way that doesn’t reflect what actually motivates you.</p>\n<p>I think more abstractly, about doing wrong, and don’t imagine that woman unable to help her family. I feel more as if a sense of sin were building up and up that presses urgently on me, to do justice. I do feel guilty about most of my life, and feel like I owe the world a lot. But the emotional reality of that isn’t just a burden but also a sense of self and empowerment. Changing your daily view from thinking about the checkout line to something else would seem like a betrayal of something like god to me. It’s hard for me to imagine. I think I might prefer to break up than lose the sense in everything I do that being a human being powerfully matters.</p>\n<p>Thoughts? </p>\n", "parentCommentId": null, "user": {"username": "khalil_mcwilliams_duplicate0.603684681915428"}}, {"_id": "JZgT49kuq9YcBSnCy", "postedAt": "2019-07-21T10:45:22.808Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>If I deprive myself of a fertile soil to birth meaning then soon I will no longer be in a position to do things that promote well being more generally.  There is a reason that on airlines they tell you to secure your own oxygen mask before attempting to help others.  (I will not be of great use if I collapse and need help just to survive, or have the flame of life&#x27;s candle flicker and spit by imposing a false frugality.)</p><p>It is about becoming aware of the distinction between want and need, and not mis-categorizing one as the other.  We will make mistakes in the borderlands from time to time, and then we can correct those errors and move on.  Life is very much a dynamic process, and it calls for a flexible set of frames that can allow us to avoid becoming stuck and bewildered.  Each day I need to find nourishment - in food, in ideas, in nature, in art.  These nourishments provide me with the means to be useful, effective and vital.  They are my oxygen mask.</p><br/><br/><br/>", "parentCommentId": null, "user": {"username": "iso-nfulford"}}, {"_id": "5ZJ4A4MTkNEGfmmZi", "postedAt": "2019-09-08T01:34:16.907Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Unfortunately, we are not algorithm-driven machines maximally enhancing the public good, while simultaneously using artificial intelligence to improve our understanding of the public good, and fueling this activity from some magical perpetual motion machine.  I think daily we have to both accept and challenge our limits to give, and to expand the diversity and difficulty of activities that nourish ourselves.  I did something difficult for me the other day:  in my upstate bungalow colony (21 of use share a communal property with individual residences), the governing board cleared a black raspberry bush that gave me a lot of berries and a lot of joy, without my knowledge or consent.  Rather than fume, I sent a thoughtful response, which resulted in me leading an effort ($100 budget) to replace the plants.  A bunch of us found some end-of-season plants, and seven of us worked together to gather compost and recreate this garden patch better than ever.  THIS is what I want more of in my life.  Yet I offered only condemnation and annoyance to the woman who huffily came over and tried to keep me from playing fetch with my dog in a dog park (like most everyone else) because it was against city park regulations.  I hope someday to be the person who can attempt to engage constructively with someone who offended and annoyed me as much as this woman.  Yet spending time stewing in being disappointed in myself will not enable me to become that person.  I have to grow my capacity for perspective-taking and concern for the well-being of others, and I can only do this by maintaining my own capacity to engage positively with myself and with the world, which I can only do through nourishing activities, some of which consume resources and benefit only myself (or others only via market transactions).  That&#x27;s the current functioning capacity of my altruism factory, and that&#x27;s the only way I know of maintaining it and increasing its productive capacity :)</p>", "parentCommentId": null, "user": {"username": "CTownBrooklyn"}}, {"_id": "MRYPftquKo8xPDZfy", "postedAt": "2019-10-19T16:16:38.010Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>This is a lovely, gentle explanation of EA: to do the best we can. Thank you. </p>", "parentCommentId": null, "user": {"username": "TheCrumbyVegan"}}, {"_id": "GresTeFpFAHx7sTee", "postedAt": "2020-03-19T19:46:48.021Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I sense a continuum here. From the warm glow to resentment or bitterness, with various stages of &quot;good&quot; and &quot;bad&quot; feelings along the continuum. I have no problem with give until in hurts, if the hurt is that I have to deny myself something relatively unimportant or delay gratification for something. For example handing my brown bag lunch to a hungry homeless person is painful, especially once the hunger sets in, but I realize that my hunger is much less than his. This certainly won&apos;t make me angry or bitter. The challenge is for each of us to find our own place along this continuum.</p>", "parentCommentId": null, "user": {"username": "MW"}}, {"_id": "po9auJbYHdJ3Eqpi9", "postedAt": "2020-03-19T19:54:31.148Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I agree with you. I don&apos;t give in order to get thanks, accolades or praise from the recipient or from those who witness my giving. I much prefer to give anonymously in private. </p>", "parentCommentId": "gxyxH4RHfuNpGXzXE", "user": {"username": "MW"}}, {"_id": "i8xGMmbNiWX7tsMzD", "postedAt": "2020-03-24T21:41:11.906Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I believe that, still young, some adolescents are considering the possibility of not having children, due to the American culture itself, in defending that TIME IS MONEY, in detriment of realizing the dream of motherhood, claiming that they do not intend to have children to SPEND their time and neither money on raising children.</p><p>On the other hand, there are other societies, especially those with a strong interference from religion, where having a child is perceived as a dream to be fulfilled, and the procreation and constitution of a family is almost a life goal.<br>  In this context, it is possible to observe that CULTURE has a direct influence on people&apos;s lives.<br>We do not assess what is right or wrong, better or worse, however it is important to keep in mind, some decisions may even impact the poverty level of some countries.</p>", "parentCommentId": null, "user": {"username": "thisisbrazil"}}, {"_id": "7bpdXZTxpEgzj3man", "postedAt": "2020-03-31T15:57:23.447Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I really see myself in many aspects mentioned in this article. And as mentioned in the conclusion of this article, it&#xB4;s all about seeing other ways of livings and try to help the people in need, always respecting our well being in a way that our mentally atmosphere is &quot;cheerfull&quot;, because in the end, we will help more if we feel good about ourselves and about and the (altruistic) footprint we leave in this world. </p>", "parentCommentId": null, "user": {"username": "mary_tdc"}}, {"_id": "JPTE3sMJAvywmSypC", "postedAt": "2020-04-08T13:36:01.908Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Cheerfully going down by the path of sadness and misery so others will live what I should not. </p><p>It seems that the road to hell is paved with good intentions. But what kind of hell would I find? if I am a good person and giving my time and efforts to others, that does not make me a good person, the over necessity as a giver is not my decision, to help others must be a part of everyone, when the opportunity is given, when I have the voluntary will to proceed. It is easier to help others when you can help yourself. Would you rather become successful and collaborate or just be an impulsive man to seek to do good things without a plan. </p><p>From my perspective, a sacrifice has meaning when a person detracts more than the rational support and gives a &quot;part&quot; that would not come back, like time as a volunteer for immigrants or donate a kidney to a patient in urgency.</p><p>I agree 100% with avoiding the breakdown, it is not selfish to love oneself and try to be in a good place. The &quot;belief&quot; of a modern martyr is distorted and lately strained by &quot;obligations from doubled standard morality&quot;</p>", "parentCommentId": null, "user": {"username": "Felipe"}}, {"_id": "NMT4byW5r9tQMbWQ6", "postedAt": "2020-04-10T10:14:45.533Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I find this very usefully as a new starting point. I have struggled in the past with allowing myself to book a holiday and feel good about it, buy a drink at a bar etc because I felt guilty about having thee nice experiences when some people do not have basic necessities or the support they need.</p><br><p>I feel I have disconnected from this to some extent/somehow, but I want to get to a place where I can feel happy and also feel like I am helping others to the best of my ability and means.</p><br><p>However, I always have a voice telling me &apos;I can do more&apos;. For example, I have savings.... how much savings do I really &apos;need&apos; right now... it is hard not to feel selfish... and hard to put a number on how much I should keep and how much I should donate to help others. </p><br><p>Not buying a new boardgames will make me sad, because I wanted to invite friends round and play together... but am I miserable...? probably not... can I justify it? I don&apos;t know.</p>", "parentCommentId": null, "user": {"username": "Nic Tea"}}, {"_id": "4QGu24Wj954o9gWLt", "postedAt": "2020-04-13T15:54:26.241Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Thank you so much for such a good article.</p>", "parentCommentId": null, "user": {"username": "Anja Slisko"}}, {"_id": "waerWsvH4BshAgHiW", "postedAt": "2020-04-22T18:25:34.371Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Thank you for reminding us that positive actions come from positive minds, just doing and giving cheerfully.</p>", "parentCommentId": null, "user": {"username": "xgallegos10@gmail.com"}}, {"_id": "rb5sx34zaaCPCQegW", "postedAt": "2020-04-22T18:41:14.162Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I also find life as a process in which our view changes depending where we stand, what we encounter and how we respond to it. I think altruism comes with compassion which is the essence we all have inside, so at the end we all feel fulfilled when we give, no matter how much material things we have, it&#xB4;s not about feeling guilty, it&#xB4;s about feeling cheerful. </p>", "parentCommentId": "JZgT49kuq9YcBSnCy", "user": {"username": "xgallegos10@gmail.com"}}, {"_id": "75N2Le9bixxB83Wwx", "postedAt": "2020-04-28T19:51:59.632Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<html><head></head><body><p>I give when I can,  and I always wish I could give more</p>\n</body></html>", "parentCommentId": null, "user": {"username": "Psanchez1012"}}, {"_id": "PZau5tSgJcyQe5kt3", "postedAt": "2020-06-18T09:17:28.756Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>ssposso</p><br><p>Not being a mother or father might be an option however it is difficult to be maintained as human nature drives us to have descendents .In my view for not suffering a breakdown either you are strong and fully convinced or you need to go for a paliative as the one explained in the text.</p>", "parentCommentId": null, "user": {"username": "ssposso@gmail.com"}}, {"_id": "C5QHzw6EtfkXj6RgP", "postedAt": "2020-10-31T06:31:45.418Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I had to check whether this extract was called childless or cheerful...\nCheerfully....\nAnd hmmm both some what emotive, on the global scale I think if we are ever going to bring about any level of balance is going to come at a cost. Let's face it the luxury many westerners enjoy has already cost if not our wildlife and wilderness many people living in poor resource rich countries, should we make our selves sick to help others, obviously not, was the instance in the extract was the girl really sick???\nIs misery a sickness?, left un treated it can certainly become or develop into it.\nDo the have nots not deserve to be cheerful too. Strange that when most haves visit the have nots the most usual comment is \" i can't get over how cheerful they all are. \"\nParticularly liked the comment re perhaps not being a mother or father being an option, is parenthood the biggest ego trip of them all?\nWhat about here in the West were poor people are literally paid to reproduce in numbers despite in many cases being unable to provide a what we now know to be a healthy growth environment for children?\nWhat are the most basic physical and emotional needs and doesn't every single human being have a most basic right to them especially in a world governed by people paid to take care of management of such things. Not to mention the physical and emotional needs of our flora fauna and planet dare I say herself... Lol don't tell me plants and animals don't have feelings too...\nJolly big re shuffle n re think needed, n so far down the wrong track will we ever manage to change course without a wipeout, especially since them that's paid to manage will have to have meetings and produce reports bla bla before every making a step in the right direction or laying a hand to help...  Cheerfully... Let's do another live aid n have a party for the poor and not invite them of course...  God or something help us all...</p>\n", "parentCommentId": null, "user": {"username": "wilcoxism"}}, {"_id": "er5afvourNwppbrrC", "postedAt": "2021-01-19T07:44:24.327Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>In order to help others we must first be able to help ourselves to live a honest existence.  The saying “doctor heal thyself”, has much wait with me.  Carl Jung also said “in order to teach first know your self”. To practice a effective altruism is extremely difficult as my cultural and genetic background will always cloud my decisions. To fully appreciate the consequences of actions is near impossible.</p>\n", "parentCommentId": null, "user": {"username": "noswadbert@gmail.com"}}, {"_id": "AdWyK8JLFzTnLDesF", "postedAt": "2021-08-24T16:11:28.853Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>This was a beautiful, inspiring read. Thank you.</p>", "parentCommentId": null, "user": {"username": "sophiababb"}}, {"_id": "kP6bd8YuGZCxbaAfq", "postedAt": "2021-12-27T16:15:44.800Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>There can never be too many essays recommending EAs not to push themselves past their breaking point. This essay may not be the most potent take on this concept, but since there are bound to be some essays on optimization-at-all-costs among the most-upvoted EA essays, there should be <i>some</i> essays like this one to counterbalance that. For instance, <a href=\"https://forum.effectivealtruism.org/posts/pseF3ZmY7uhLtdwss/aiming-for-the-minimum-of-self-care-is-dangerous\">this</a> essay is an expanded take on the concept, but is too new to be eligible for this year's EA Review.</p>", "parentCommentId": null, "user": {"username": "tobias-daenzer"}}, {"_id": "imrmp2fN8RtbQMXMj", "postedAt": "2022-03-29T05:12:46.949Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I agree with that sentiment about being cheerful. I've been a volunteer for our Beaver Scouts locally in my hometown. After a year I felt drained because the team had been relying on me more than I had the will to realize my limits. I kept saying yes to everything and it was burning me out with all my other work. Eventually I stepped back as one of the support leaders rather than the main leader and my disposition changed. I made it less about me and allowed myself to focus on putting smiles on kids faces and strengthening them when tears came. I look forward to my Tuesdays with the kids now.</p>", "parentCommentId": null, "user": {"username": "Henry Hamilton"}}, {"_id": "GAifZAdtEkAXGd2Be", "postedAt": "2022-08-20T14:17:21.677Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>I really like this post and it reminds of Peter Singer's thought experiment of getting your shoes wet to save a child from drowning in a shallow pond.</p><p>The idea is that altruism is right when the gain to someone else is large and the personal sacrifice is relatively small.</p><p>So although small sacrifices for the sake of benefiting other people are often worth doing, large sacrifices that significantly decrease your wellbeing probably aren't.</p>", "parentCommentId": null, "user": {"username": "Stephen McAleese"}}, {"_id": "MBmhARJJmsqapCANi", "postedAt": "2023-01-05T10:03:22.505Z", "postId": "4kqiHGrZh6Rj7EmEW", "htmlBody": "<p>Thanks for sharing. This is an example of why naive utilitarianism can be harmful. EA needs to more clearly adopt a framework with duties of care, and personal rights. I dare call it “common sense ethics”.</p>\n<p>I would add that having children in the West is a huge net good on society, even if that means fewer shrimp have their welfare improved. (We can think about EY’s argument on hiccups here)</p>\n<p>The economy is a positive sum game, meaning children add more than they take, and there simply would be no wealth to distribute otherwise. If we think on a long enough time horizon, the only way to improve everyone’s welfare significantly is by having more children in productive areas.</p>\n", "parentCommentId": null, "user": {"username": "Duarte M"}}]