[{"_id": "ufRzWwtSHRHcPATve", "postedAt": "2017-10-01T20:46:55.278Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>This makes a lot of sense to me - people usually give me a funny look if I mention AI risks. I'll try mentioning &quot;AI accidents&quot; to fellow public policy students and see if that phrase is more intuitive.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "2B7w8oM7f7WbdpDrx", "postedAt": "2017-10-01T21:36:50.983Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>It might make a lot of sense to test the risk vs. accidents framing on the next survey of AI researchers.</p>\n", "parentCommentId": null, "user": {"username": "Michael_S"}}, {"_id": "Ry9bGHkRtvx7iXTqb", "postedAt": "2017-10-02T15:16:32.401Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>However, &quot;AI accidents&quot; don't communicate the scale of a possible disaster. Something like &quot;global catastrophic AI accidents&quot; may be even clearer. Or &quot;permanent loss of control of a hostile AI system&quot;.</p>\n", "parentCommentId": null, "user": {"username": "turchin"}}, {"_id": "ZdphkfEKp3TyRpMga", "postedAt": "2017-10-02T20:27:26.005Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Meh, that makes it sound too narrowly technical - there are a lot of ways that advanced AI can cause problems, and they don't all fit into the narrow paradigm of a system running into bugs/accidents that can be fixed with better programming. </p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "29NJBEwyBzEFnE8jf", "postedAt": "2017-10-02T21:30:42.137Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>So what are the risks of this verbal change?</p>\n<p>Potentially money gets mis-allocated: Just like all chemistry got rebranded nanotech during that phase in the 2000, if there is money in AI safety, computer departments will rebrand research as AI safety to prevent AI accidents. This might be a problem when governments start to try and fund AI Safety.</p>\n<p>I personally want to be able to differentiate different types of work, between AI Safety and AGI Safety. Both are valuable, we are going to living in a world of AI for a while and it may cause catastrophic problems (including problems that distract us from AGI safety) and learning to mitigating them might help us with AGI Safety. I want us to be able continue to look at both as potentially separate things, because AI Safety may not help much with AGI Safety.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "L2ZFv88Po5S4bmaGF", "postedAt": "2017-10-03T12:58:42.625Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>What do you have in mind? If it can't be fixed with better programming, how will they be fixed? </p>\n", "parentCommentId": "ZdphkfEKp3TyRpMga", "user": {"username": "Lee_Sharkey"}}, {"_id": "b7gswfPkfYqZNavqS", "postedAt": "2017-10-03T13:54:41.285Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>I think this proposition could do with some refinement. AI safety should be a superset of both AGI safety and narrow-AI safety. Then we don't run into problematic sentences like &quot;AI safety may not help much with AGI Safety&quot;, which contradicts how we currently use 'AI safety'. </p>\n<p>To address the point on these terms, then:</p>\n<p>I don't think AI safety runs the risk of being <em>so</em> attractive that misallocation becomes a big problem. Even if we consider risk of funding misallocation as significant, 'AI risk' seems like a worse term for permitting conflation of work areas.  </p>\n<p>Yes, it's of course useful to have two different concepts for these two types of work, but this conceptual distinction doesn't go away with a shift toward 'AI accidents' as the subject of these two fields. I don't think a move toward 'AI accidents' awkwardly merges all AI safety work. </p>\n<p>But if it did: The outcome we want to avoid is AGI safety getting too little funding. This outcome seems more likely in a world that makes two fields of N-AI safety and AGI safety, given the common dispreference for work on AGI safety. Overflow seems more likely in the N-AI Safety -&gt; AGI Safety direction when they are treated as the same category than when they are treated as different. It doesn't seem beneficial for AGI safety to <em>market</em> the two as separate types of work.</p>\n<p>Ultimately, though, I place more weight on the other reasons why I think it's worth reconsidering the terms. </p>\n", "parentCommentId": "29NJBEwyBzEFnE8jf", "user": {"username": "Lee_Sharkey"}}, {"_id": "siLsyHoiBRosZ7Gb2", "postedAt": "2017-10-03T14:04:07.374Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>&quot;permanent loss of control of a hostile AI system&quot; - This seems especially facilitative of the science-fiction interpretation to me. </p>\n<p>I agree with the rest.</p>\n", "parentCommentId": "Ry9bGHkRtvx7iXTqb", "user": {"username": "Lee_Sharkey"}}, {"_id": "qDpPLccr4NJHPZnTW", "postedAt": "2017-10-03T15:09:41.925Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>OpenPhil notion of 'accident risk' more general than yours to describe the scenarios that aren't misuse risk and their term makes perfect sense to me: <a href=\"https://www.openphilanthropy.org/blog/potential-risks-advanced-artificial-intelligence-philanthropic-opportunity\">https://www.openphilanthropy.org/blog/potential-risks-advanced-artificial-intelligence-philanthropic-opportunity</a></p>\n", "parentCommentId": "ZdphkfEKp3TyRpMga", "user": null}, {"_id": "4QziFz2JteEcKBaaP", "postedAt": "2017-10-03T17:55:55.733Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>What do you think the risk is of AI accidents just adopting the baggage that AI risks has now via the <a href=\"https://stevenpinker.com/files/pinker/files/1994_04_03_newyorktimes.pdf\">euphemism treadmill</a>?</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "9gZBY6WoQ3vF9JHAB", "postedAt": "2017-10-03T18:26:27.862Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>I agree it is worth reconsidering the terms!</p>\n<p>The agi/narrow ai distinction is beside the point a bit, I'm happy to drop it. I also have an AI/IA bugbear so I'm used to not liking how things are talked about.</p>\n<p>Part of the trouble is we have lost the marketing war before it even began, every vaguely advanced technology we have currently is marketing itself as AI, that leaves no space for anything else.</p>\n<p>AI accidents brings to my mind trying to prevent robots crashing into things. 90% of robotics work could be classed as AI accident prevention because they are always crashing into things.</p>\n<p>It is not just funding confusion that might be a problem.  If I'm reading a journal on AI safety or taking a class on AI safety what should I expect? Robot mishaps or the alignment problem? How will we make sure the next generation of people can find the worthwhile papers/courses?</p>\n<p>AI risks is not perfect, but is not at least it is not that.</p>\n<p>Perhaps we should take a hard left and say that we are looking at studying Artificial Intelligence Motivation? People know that an incorrectly motivated person is bad and that figuring out how to motivate AIs might be important. It covers the alignment problem and the control problem.</p>\n<p>Most AI doesn't look like it has any form of motivation and is harder to rebrand as such, so it is easier to steer funding to the right people and tell people what research to read.</p>\n<p>It doesn't cover my IA gripe, which briefly is: AI makes people think of separate entities with their own goals/moral worth. I think we want to avoid that as much of possible. General Intelligence augmentation requires its own motivation work, but one so that the motivation of the human is inherited by the computer that human is augmenting. I think that my best hope is that AGI work might move in that direction.</p>\n", "parentCommentId": "b7gswfPkfYqZNavqS", "user": {"username": "WillPearson"}}, {"_id": "cbcAvNp6oSbb5Fw6t", "postedAt": "2017-10-03T19:15:09.357Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>This seems unnecessarily rude to me, and doesn't engage with the post. For example, I don't see the post anywhere characterising accidents as only coming from bugs in code, and it seems like this dismissal of the phrase 'AI accidents' would apply equally to 'AI risk'. </p>\n", "parentCommentId": "ZdphkfEKp3TyRpMga", "user": {"username": "Nick_Robinson"}}, {"_id": "7CuRy4JSw9B6KHpgs", "postedAt": "2017-10-04T00:16:04.381Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<blockquote>\n<p>AI accidents brings to my mind trying to prevent robots crashing into things. 90% of robotics work could be classed as AI accident prevention because they are always crashing into things.</p>\n<p>It is not just funding confusion that might be a problem. If I'm reading a journal on AI safety or taking a class on AI safety what should I expect? Robot mishaps or the alignment problem? How will we make sure the next generation of people can find the worthwhile papers/courses?</p>\n</blockquote>\n<p>I take the point. This is a potential outcome, and I see the apprehension, but I think it's a probably a low risk that users will grow to mistake robotics and hardware accidents for AI accidents (and work that mitigates each) - sufficiently low that I'd argue expected value favours the accident frame. Of course, I recognize that I'm probably invested in that direction. </p>\n<blockquote>\n<p>Perhaps we should take a hard left and say that we are looking at studying Artificial Intelligence Motivation? People know that an incorrectly motivated person is bad and that figuring out how to motivate AIs might be important. It covers the alignment problem and the control problem.</p>\n<p>Most AI doesn't look like it has any form of motivation and is harder to rebrand as such, so it is easier to steer funding to the right people and tell people what research to read.</p>\n</blockquote>\n<p>I think this steers close to an older debate on <a href=\"https://ai-alignment.com/ai-safety-vs-control-vs-alignment-2a4b42a863cc\">AI “safety” vs “control” vs “alignment”</a>. I wasn't a member of that discussion so am hesitant to reenact concluded debates (I've found it difficult to find resources on that topic other than what I've linked - I'd be grateful to be directed to more). I personally disfavour 'motivation' on grounds of risk of anthropomorphism. </p>\n", "parentCommentId": "9gZBY6WoQ3vF9JHAB", "user": {"username": "Lee_Sharkey"}}, {"_id": "PPPGaCScHZK58uSYA", "postedAt": "2017-10-04T00:24:48.405Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>I don't think it's an <em>implausible</em> risk, but I also don't think that it's one that should prevent the goal of a better framing. </p>\n", "parentCommentId": "4QziFz2JteEcKBaaP", "user": {"username": "Lee_Sharkey"}}, {"_id": "sEAFHegKQq3WK6xWE", "postedAt": "2017-10-04T08:23:05.258Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Looks like DeepMind have gone with &quot;AI risk&quot; and classified that into &quot;misuse and unintended consequences&quot;, among other ethical challenges. See <a href=\"https://deepmind.com/applied/deepmind-ethics-society/\">https://deepmind.com/applied/deepmind-ethics-society/</a></p>\n", "parentCommentId": null, "user": {"username": "Nick_Robinson"}}, {"_id": "bC5gs9iRRXdrsDK9g", "postedAt": "2017-10-04T19:13:34.985Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<blockquote>\n<p>I take the point. This is a potential outcome, and I see the apprehension, but I think it's a probably a low risk that users will grow to mistake robotics and hardware accidents for AI accidents (and work that mitigates each) - sufficiently low that I'd argue expected value favours the accident frame. Of course, I recognize that I'm probably invested in that direction.</p>\n</blockquote>\n<p>I would do some research onto how well sciences that have suffered brand dilution do. </p>\n<p>As far as I understand it Research institutions have high incentives to </p>\n<ol>\n<li>Find funding</li>\n<li>Pump out tractible digestible papers</li>\n</ol>\n<p>See this <a href=\"https://www.nature.com/news/the-pressure-to-publish-pushes-down-quality-1.19887\">kind of article</a> for other worries about this kind of thing.</p>\n<p>You have to frame things with that in mind, give incentives so that people do the hard stuff and can be recognized for doing the hard stuff.</p>\n<p>Nanotech is a classic case of a diluted research path, if you have contacts maybe try and talk to Erik Drexler, he is interested in AI safety so might be interested in how the AI Safety research is framed.</p>\n<blockquote>\n<p>I think this steers close to an older debate on AI “safety” vs “control” vs “alignment”. I wasn't a member of that discussion so am hesitant to reenact concluded debates (I've found it difficult to find resources on that topic other than what I've linked - I'd be grateful to be directed to more). I personally disfavour 'motivation' on grounds of risk of anthropomorphism.</p>\n</blockquote>\n<p>Fair enough I'm not wedded to motivation (I see animals having motivation as well, so not strictly human).  It doesn't seem to cover <a href=\"https://en.wikipedia.org/wiki/Phototaxis\">Phototaxis</a> which seems like the simplest thing we want to worry about. So that is an argument against motivation. I'm worded out at the moment. I'll see if my brain thinks of anything better in a bit. </p>\n", "parentCommentId": "7CuRy4JSw9B6KHpgs", "user": {"username": "WillPearson"}}, {"_id": "kosfewH3ECgyoEebL", "postedAt": "2017-10-05T01:56:32.405Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>&quot;Rude?&quot; Oh please, grow some thick skin.</p>\n<blockquote>\n<p>For example, I don't see the post anywhere characterising accidents as only coming from bugs in code, and it seems like this dismissal of the phrase 'AI accidents' would apply equally to 'AI risk'.</p>\n</blockquote>\n<p>But I didn't say that the author is characterizing accidents as coming from bugs in code. I said that the language he is proposing has that effect. The author didn't address this potential problem, so there was nothing for me to engage with.</p>\n<blockquote>\n<p>it seems like this dismissal of the phrase 'AI accidents' would apply equally to 'AI risk'.</p>\n</blockquote>\n<p>It does in fact apply, since AI risk neglects important topics in AI ethics, but it doesn't apply as strongly as it would for &quot;AI accidents.&quot;</p>\n", "parentCommentId": "cbcAvNp6oSbb5Fw6t", "user": {"username": "kbog"}}, {"_id": "onbdWrMkJMDq2GS33", "postedAt": "2017-10-05T01:58:28.571Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Yeah, well I don't think we should only be talking about accident risk.</p>\n", "parentCommentId": "qDpPLccr4NJHPZnTW", "user": {"username": "kbog"}}, {"_id": "3L42ymtbCq3xCGNnC", "postedAt": "2017-10-05T01:59:03.936Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Better decision theory, which is much of what MIRI does, and better guiding philosophy.</p>\n", "parentCommentId": "L2ZFv88Po5S4bmaGF", "user": {"username": "kbog"}}, {"_id": "iHmkMvguPD9KMtnTg", "postedAt": "2017-10-05T10:13:44.900Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Hi Kyle, I think that it's worth us all putting effort into being friendly and polite on this forum, especially when we disagree with one another. I didn't find your first comment informative or polite, and just commented to explain why I down-voted it. </p>\n", "parentCommentId": "kosfewH3ECgyoEebL", "user": {"username": "Nick_Robinson"}}, {"_id": "EkNFCR2HZvAmHGvsQ", "postedAt": "2017-10-05T10:54:31.184Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p><a href=\"https://www.centreforeffectivealtruism.org/blog/considering-considerateness-why-communities-of-do-gooders-should-be/\">https://www.centreforeffectivealtruism.org/blog/considering-considerateness-why-communities-of-do-gooders-should-be/</a></p>\n", "parentCommentId": "iHmkMvguPD9KMtnTg", "user": {"username": "Benjamin_Todd"}}, {"_id": "qMzprmX7WXptz5MYZ", "postedAt": "2017-10-05T20:03:29.297Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<blockquote>\n<p>I didn't find your first comment informative or polite, and just commented to explain why I down-voted it.</p>\n</blockquote>\n<p>Yeah, and now I'm commenting to explain why I downvoted yours, and how you are failing to communicate a convincing point. If you found my first comment &quot;rude&quot; or impolite then you've lost your grip on ordinary conversation. Saying &quot;meh&quot; is not rude, yikes.</p>\n", "parentCommentId": "iHmkMvguPD9KMtnTg", "user": {"username": "kbog"}}, {"_id": "bbkCNbji3TLWTYEq3", "postedAt": "2017-10-05T20:04:52.469Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Thanks Ben, for telling us that communities of do-gooders should be considerate. But I wasn't inconsiderate. If you linked an article titled &quot;why communities of do-gooders should be so insanely fragile that they can't handle a small bit of criticism&quot; then it would be relevant.</p>\n", "parentCommentId": "EkNFCR2HZvAmHGvsQ", "user": {"username": "kbog"}}, {"_id": "fmujRwaCnXnX6Lg2d", "postedAt": "2017-10-05T20:10:20.622Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>You will have to be sure that the researchers actually know what you mean though. AI researchers are already concerned about accidents in the narrow sense, and they could respond positively to the idea of preventing AI accidents merely because they have something else in mind (like keeping self driving cars safe or something like that).</p>\n<p>If accept this switch to language that is appealing at the expense of precision then eventually you will reach a motte-and-bailey situation where the motte is the broad idea of 'preventing accidents' and the bailey is the specific long-term AGI scheme outlined by Bostrom and MIRI. You'll get fewer funny looks, but only by conflating and muddling the issues.</p>\n", "parentCommentId": "2B7w8oM7f7WbdpDrx", "user": {"username": "kbog"}}, {"_id": "gb45KFinR2nDs4CPG", "postedAt": "2017-10-06T12:32:52.480Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>I agree that more of both is needed. Both need to be instantiated in actual code, though. And both are useless if researchers don't care implement them.</p>\n<p>I admit I would benefit from some clarification on your point - are you arguing that the article assumes a bug-free AI won't cause AI accidents? Is it the case that this arose from Amodei et al.'s definition?: “unintended and harmful behavior that may emerge from poor design of real-world AI systems”. Poor design of real world AI systems isn't limited to being bug-free, but I can see why this might have caused confusion. </p>\n", "parentCommentId": "3L42ymtbCq3xCGNnC", "user": {"username": "Lee_Sharkey"}}, {"_id": "NQTTnZfDFj88rWv6z", "postedAt": "2017-10-06T18:39:31.362Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<blockquote>\n<p>are you arguing that the article assumes a bug-free AI won't cause AI accidents? </p>\n</blockquote>\n<p>I'm not - I'm saying that when you phrase it as accidents then it creates flawed perceptions about the nature and scope of the problem. An accident sounds like a onetime event that a system causes in the course of its performance; AI risk is about systems whose performance itself is fundamentally destructive. Accidents are <em>aberrations</em> from normal system behavior; the core idea of AI risk is that any known specification of system behavior, when followed comprehensively by advanced AI, is not going to work. </p>\n", "parentCommentId": "gb45KFinR2nDs4CPG", "user": {"username": "kbog"}}, {"_id": "xTahCmW4HetXhQ4k6", "postedAt": "2017-10-07T01:49:58.402Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Was your &quot;WEF&quot; link supposed to point to something involving the World Economic Forum?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "Ns4xmK2coSJ23fk66", "postedAt": "2017-10-15T18:30:21.090Z", "postId": "4kRPYuogoSKnHNBhY", "htmlBody": "<p>Yes. Thanks. Link has been amended. Author was in fact Luke Muehlhauser, so labeling it 'WEF' is only partially accurate.</p>\n", "parentCommentId": "xTahCmW4HetXhQ4k6", "user": {"username": "Lee_Sharkey"}}]