[{"_id": "vioKDErztzbhA5DDp", "postedAt": "2023-10-10T21:04:10.619Z", "postId": "4MkkdbSa42h73pXi8", "htmlBody": "<p><strong>Executive summary</strong>: This post argues that recent progress in language models like ChatGPT has been driven by scaling them up as well as integrating them into usable systems, and both trends will continue.</p><p><strong>Key points</strong>:</p><ol><li>Increasing the scale of language models by training them on more data and compute has been the primary driver of improvements so far.</li><li>But integrating language models into well-designed systems through techniques like prompting and fine-tuning also unlocks major gains.</li><li>Scale and system-building are complementary - gains in one enhance the other.</li><li>There is still a lot of low-hanging fruit in system design to better leverage existing large language models.</li><li>Commercial efforts are focused on building agentic systems that can take actions, which will benefit from scale and system improvements.</li><li>We're still early in developing language model capabilities, with potential for rapid progress on both scale and systems fronts.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "BsmHpP79dyrnvN4ik", "postedAt": "2023-10-12T07:28:29.041Z", "postId": "4MkkdbSa42h73pXi8", "htmlBody": "<p>Just out of curiosity: Where is the word \"schlep\" originating from in the context of AI? Don't think I ever came across it before reading this post.&nbsp;</p>", "parentCommentId": null, "user": {"username": "FJehn"}}, {"_id": "e78cxzEKLBKDLxRQA", "postedAt": "2024-01-04T11:46:51.571Z", "postId": "4MkkdbSa42h73pXi8", "htmlBody": "<p>I assume and (ChatGPT agrees) that it's the tedious, unglamorous, and labor-intensive work. It probably comes from the Germany \"schleppen\" which is \"heavy lifting\".</p>", "parentCommentId": "BsmHpP79dyrnvN4ik", "user": {"username": "Milli"}}]