[{"_id": "BuAWpgfHFvdE725Wr", "postedAt": "2023-05-19T12:34:07.109Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>Quick suggestion on the title: If many potential readers may not know what OPTIC is, could change to OPTIC (forecasting comp) Pilot Postmortem. On mobile at least, the reader doesn't get much context at all before deciding to click.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "SHFL3G9ioeBGk4F7D", "postedAt": "2023-05-19T12:47:25.219Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>I'm curious whether there is a viable way to add a short quick-resolving round, either with a subset of questions that will resolve within days or by adding another discipline like Fermi estimation (e.g., <a href=\"https://www.quantifiedintuitions.org/estimation-game\">https://www.quantifiedintuitions.org/estimation-game</a>)</p>\n<p>Human psychology being what it is, getting some sort of results sooner may be reinforcing. From a recruiting/buzz perspective, \"our school's team won a prize at a forecasting tournament last week!\" is a lot easier to pitch to the campus newspaper than \"we actually won this thing three months ago but just found out...\"</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "CyrAFCne7zEHPq8nP", "postedAt": "2023-05-19T13:07:01.236Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>Good point! Changed :)</p>", "parentCommentId": "BuAWpgfHFvdE725Wr", "user": {"username": "OPTIC"}}, {"_id": "T2nKYCfgyyBGxCGP3", "postedAt": "2023-05-19T18:42:59.085Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>love the idea of a hackathon for forecasting</p><p>btw your website is so aesthetic, i love the text effects~</p>", "parentCommentId": null, "user": {"username": "vandemonian"}}, {"_id": "XK6JGbN47ydAvYsmE", "postedAt": "2023-05-19T22:49:53.900Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>thank you! :)</p>", "parentCommentId": "T2nKYCfgyyBGxCGP3", "user": {"username": "Saul"}}, {"_id": "2QqKihCW8kcfqHDrF", "postedAt": "2023-05-20T01:58:39.002Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>great points!</p><p>agreed, quick feedback loops are vital for good engagement + learning. we couldn't figure out a good way to do it for the pilot, but this is definitely something we're interested in building out for the next competition.</p><p>also, fermi estimation is a great idea — jane street sometimes runs an (unaffiliated) <a href=\"https://estimathon.com/\">estimathon</a>, but it would be cool to build in an estimation round, or something along those lines. do you have any other ideas for quickly-resolving rounds?</p><p>thanks for your thoughts!</p><p>~ saul</p>", "parentCommentId": "SHFL3G9ioeBGk4F7D", "user": {"username": "Saul"}}, {"_id": "3KtZhfvxcA6yzAQBk", "postedAt": "2023-05-20T17:38:50.069Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>Metaculus is getting better at writing quickly-resolving questions, and we can probably help write some good ones for the next iteration of OPTIC.<br><br>There's a certain eye for news that is interesting, forecastable, and short-term one develops. Our Beginner tournaments (<a href=\"https://www.metaculus.com/tournament/beginner-tournament/\">current</a>, <a href=\"https://www.metaculus.com/tournament/Q12023-beginner-tournament/\">2023 Q1</a>, <a href=\"https://www.metaculus.com/tournament/Q42022-beginner-tournament/\">2022 Q4</a>) explicitly only have questions that resolve within 1 week, so you can see some inspiration there.<br><br>&nbsp;</p>", "parentCommentId": "2QqKihCW8kcfqHDrF", "user": {"username": "dschwarz"}}, {"_id": "wrfvujK7y2qSg5AXG", "postedAt": "2023-05-20T17:54:18.194Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>Nicely done! The college campus forecasting clubs and competition model feels extremely promising to me. Really great to see a dedicated effort start to take off.</p><p>I'm especially happy to see an <a href=\"https://manifund.org/rounds/acx-mini-grants\">ACX Manifund mini-grant</a> get realized so quickly. I admit I was skeptical of these grants.</p><p>Excited to see the next iteration of this, and hopefully many more to come on college campuses all over!</p>", "parentCommentId": null, "user": {"username": "dschwarz"}}, {"_id": "Y7wCmb4RRt7TvvBme", "postedAt": "2023-05-23T14:36:04.573Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>yeah, i agree — i think we'll probably rely more heavily on questions in that style for the next iteration of OPTIC. i don't think we relied enough on existing questions/tournaments (see <a href=\"https://forum.effectivealtruism.org/posts/4p8RpK2fYKFmEcA9w/optic-forecasting-comp-pilot-postmortem#:~:text=The%20questions%20were%20built%20pretty%20last%20minute%2C%20which%20left%20little%20time%20to%20edit/improve/ask%20for%20feedback.\">here</a>).</p>", "parentCommentId": "3KtZhfvxcA6yzAQBk", "user": {"username": "Saul"}}, {"_id": "rZtz3bELDzrCZ2jJv", "postedAt": "2023-05-23T14:39:12.543Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>thanks for the kind words — and thanks for helping OPTIC become a reality! :)</p>", "parentCommentId": "wrfvujK7y2qSg5AXG", "user": {"username": "Saul"}}, {"_id": "rNBvmKvjeJgRqT6rR", "postedAt": "2023-05-28T02:48:25.045Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>I was also going to recommend this, but I’ll just add an implementation idea (which IDK if I fully endorse): you could try to recruit a few superforecasters or subject-matter experts (SMEs) in given field to provide forecasts on the questions at the same time, then have a reciprocal scoring element (I.e., who came closest to the superforecasters’/SMEs’ forecasts). This is basically what was done in the 2022 Existential Risk Persuasion/Forecasting Tournament (XPT), which Philip Tetlock ran (and I participated in). IDK when the study results for that tournament will be out, and maybe it won’t recommend reciprocal scoring, but it definitely seems worth considering.</p>\n<p>A separate idea (which again IDK if I fully endorse but was also in the XPT): have people provide dense rationales for a few big forecasts, then you can rate them on the merits of their rationales. (Yes, this involves subjectivity, but it’s not very different from speech and debate tournaments; the bigger problem could be the time required to review the rationales, but even this definitely seems manageable, especially if you provide a clear rubric, as is common in some competitive speech leagues.)</p>\n", "parentCommentId": "SHFL3G9ioeBGk4F7D", "user": {"username": "Harrison D"}}, {"_id": "dakhDLmDLDiZRnsuQ", "postedAt": "2023-05-28T18:33:54.693Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>A trial of #2 would have some information value -- you could discern how strong the correlation was between the rationale scores and final standings to decide if rationales were a good way to produce a same-week result.</p>\n<p>Maybe you could also use idea #1 with only the top-scoring teams making it to the rationale round, to cut down on time spent scoring rationales?</p>\n", "parentCommentId": "rNBvmKvjeJgRqT6rR", "user": {"username": "Jason"}}, {"_id": "bLxtQ8Trtain65A8R", "postedAt": "2023-05-28T21:35:41.970Z", "postId": "4p8RpK2fYKFmEcA9w", "htmlBody": "<p>TBH, I think that the time spent scoring rationales is probably quite manageable: I don’t think it should take longer than 30 person-minutes to decently judge each rationale (e.g., have three judges each spend 10 minutes evaluating each), maybe less? It might be difficult to have results within 1-2 hours if you don’t have that many judges, but probably it should be available by the end of the day.</p>\n<p>To be clear, I was thinking that only a small number (no more than three, maybe just two) of the total questions should be “rationale questions.”</p>\n<p>But definitely the information value of “do rationale scores correlate with performance” would be interesting! I’m not sure if the literature has ever done this (I don’t think I’ve encountered anything like that, but I haven’t actively searched for it)</p>\n", "parentCommentId": "dakhDLmDLDiZRnsuQ", "user": {"username": "Harrison D"}}]