[{"_id": "veR8FcZagPQ2BKkga", "postedAt": "2024-02-05T11:27:19.504Z", "postId": "4pnr37kpDKTDvuuur", "htmlBody": "<p>This is a very interesting and timely proposal. &nbsp;Well done!</p><p>I am particularly interested in the idea of the meeting spaces. Given the nature of some policy conversations, it can often be difficult to schedule meetings on-site for locations - particularly if those locations have licensing requirements for visitors. It's also handy for centralising socio-legal research, since the amount of times I've had to travel to London then visit 4 or 5 locations in a day or so is a lot of wasted travel, when one could just schedule all the meetings at a purpose-made location. Booking venues can be a roll of the dice, as a bad venue can negatively impact a stakeholder meeting months in the making.&nbsp;</p><p>The spaces I mostly use for the more minor policy meetings in London are difficult to book and lack easy access which is something LISA seems to solve. If the registration postcode for LISA is the same as its physical location, then the location is also quite good for the policy end of things.</p><p>That is if it is possible for researchers to have visitors on site, and I'm not sure what the rules would be for that, but for those in frontline AI policymaking that would be a huge advantage, and would help attract that kind of specialism.<br><br>The talks in the events section also seem really good, with nice variation.<br><br>One piece of mixed feedback is that it's good that it's not just technical focused and that there's a 70/30 split technical and non-technical, but if you actually want to achieve the policy-maker reach you mention in the post it may make sense to expand that 30% a bit given that socio-legal and political researchers are a vital piece of actually pitching technical findings in a realistic way. The 70/30 split is still good and I can see the reason for it, but hopefully it'll be a flexible goal rather than a rigid limit. It also seems like there's an effort made to network people between specialisms via the co-working space which is a really great touch, and something that most other spaces struggle to do effectively.<br><br>All in all looks great, and quite excited to see what comes out of it!<br>&nbsp;</p><p><br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "PFBJsFzT6j6KkAmsx", "postedAt": "2024-02-05T13:25:55.235Z", "postId": "4pnr37kpDKTDvuuur", "htmlBody": "<p><strong>Executive summary</strong>: The London Initiative for Safe AI (LISA) aims to become a premier AI safety research hub by cultivating a supportive environment for individual researchers and small organizations to advance impactful work and novel agendas, while strengthening the broader London ecosystem.</p><p><strong>Key points</strong>:</p><ol><li>LISA provides financial stability, operational support, and a collaborative research environment tailored to the needs of AI safety researchers and organizations.</li><li>Over 2 years, LISA plans to mature member organizations, influence alumni career trajectories, uncover new agendas, and nurture future AI safety leaders.</li><li>LISA has made early progress housing impactful papers, developing new agendas via MATS, and seeing residents hired by top groups since opening in September 2023.</li><li>Risks like researcher underperformance or retention will be mitigated through diversification, expert evaluation, regular impact reviews, and an adaptive approach.</li><li>LISA's theory of change focuses on empowering high-potential, epistemically diverse AI safety talent to produce influential work.</li><li>Attracting top researchers is facilitated by an advisory board, evolving to meet needs, an appealing proposition, facilitating industry roles, and viewing the effort as complementary to government initiatives.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "Fn7hPHAKtfrNmBcZY", "postedAt": "2024-02-08T05:15:11.575Z", "postId": "4pnr37kpDKTDvuuur", "htmlBody": "<p>Thanks for the kind words.&nbsp;<br><br>We agree that LISA can be a focal point for meetings between all types of AI safety experts (technical, socio-legal, and political) you mention. We believe that enormous value comes from facilitating exchanges of ideas between those with different expertise in a common venue dedicated to AI safety.<br><br>The location of LISA's office is likely to change to Old Street/Shoreditch in the coming months. This location is good for policy experts and technical researchers (near the Kings Cross tech offices). It also places it close to important transport links (Kings Cross &amp; St Pancras, for travel to Cambridge and the continent; Paddington, for travel to Oxford; and Liverpool St, for many other locations).<br><br>Resident researchers can host visitors.<br><br>We also agree with your assertion that `socio-legal and political researchers are a vital piece of actually pitching technical findings'. There is certainly no rigid split between technical and non-technical. Each member application will be evaluated according&nbsp;to the criteria outlined in our<a href=\"https://astonishing-monarch-1ea.notion.site/LISA-membership-overview-97035f1209164f949b3e66c3fb46147e?pvs=4\"> membership overview document</a>. Also, note that we expect many member applications to be (I) visiting researchers, often based in the US (or Europe), who want to work from an AI safety hub in London only for a short period, (ii) experts based in the UK (even London) who might only want to use the LISA office space once or twice a week.<br><br><br><br><br><br>&nbsp;</p>", "parentCommentId": "veR8FcZagPQ2BKkga", "user": {"username": "JamesFox"}}]