[{"_id": "fKujFetjsnBgwuiF9", "postedAt": "2023-02-24T18:25:29.135Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Just a note, but if you're trying to facilitate object-level discussion it might be better not to drop this right as Ozzie dropped a very similar post? <a href=\"https://forum.effectivealtruism.org/posts/hAHNtAYLidmSJK7bs/who-is-uncomfortable-critiquing-who-around-ea\">https://forum.effectivealtruism.org/posts/hAHNtAYLidmSJK7bs/who-is-uncomfortable-critiquing-who-around-ea</a></p>", "parentCommentId": null, "user": {"username": "Wil Perkins"}}, {"_id": "8SLXT6EdFgh87cjET", "postedAt": "2023-02-24T18:34:11.018Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I appreciate the thought, but personally really don't see this as a mistake on <a href=\"https://forum.effectivealtruism.org/users/concernedeas\">ConcernedEAs</a>.&nbsp;<br><br>I actually pushed that post a few days back so that it wouldn't conflict with Owen's, trying to catch some narrow window when there aren't any new scandals. (I'm trying not to overlap closely with scandals, mainly so it doesn't seem like I'm directly addressing any scandal, and to not seem disrespectful).<br><br>I think if we all tried timing posts to be after both scandals and related posts, then we'd develop a long backlog of posts that would be annoying to manage.&nbsp;</p><p>I'm happy promoting norms where it's totally fine to post things sooner than later.&nbsp;<br><br>It's a bit frustrating that the Community frontpage section just shows 3 items, but that's not any of our faults. (And I get why the EA Forum team did this)</p>", "parentCommentId": "fKujFetjsnBgwuiF9", "user": {"username": "oagr"}}, {"_id": "BR9xgWmw45dmSgFLK", "postedAt": "2023-02-24T18:38:40.973Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Much of this might be true and I agree with most of the reforms - I hope many &nbsp;EA groups and orgs might be shifting slowly in those directions even while not necessarily announcing it. I especially like the stuff around epistemic modesty, understanding what we really mean by value alignment and some of the Karma reworking. Obviously the voting weight system has pros and cons in both directions, but I still do feel uncomfortable about a space where one person's opinion is worth more than another</p><p>I would be interested though to hear if you know of another community which is more open to criticism, either shallow or deep than EA. I don't have a wide spectrum of communities, but I can tell you in the NGO world and in specific fields of academia, my experience has been that people get far pricklier far faster than in the one EA group I was part of and on this forum. It is difficult for any group to truly gaze into its own abyss to acknowledge flaws and weaknesses. I still feel that even though we might struggle with deep self criticism, perhaps we are still better at it than others.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "bzk6o8PYYrb3JbEFH", "postedAt": "2023-02-24T18:56:18.629Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Hah, fair point. I guess I just am hoping to drive more discussion about this type of thing on the forum and it is definitely frustrating to see how broken up conversations are.</p><p>I am also pushing to promote things quicker and not get delayed in drafting forever. I did that for a while and basically never posted anything - I wish more people would be willing to post things on the community side that aren't extremely high quality and polished.</p>", "parentCommentId": "8SLXT6EdFgh87cjET", "user": {"username": "Wil Perkins"}}, {"_id": "2T4osQZFgrttYp5hN", "postedAt": "2023-02-24T20:20:20.369Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p><strong>The paradox of open-mindedness</strong></p><p>We want to be open-minded, but not <i>so</i> open-minded that our brains fall out. &nbsp;So we should be open to <i>high-quality</i> critiques, but not waste our time on <i>low quality</i> ones. &nbsp;My general worry with this post is that it doesn't distinguish between the two. &nbsp;There seems a background assumption that EAs dismiss anti-capitalist or post-colonial critiques because we're just closed-minded, rather than because those critiques are bad. &nbsp;I'm not so sure that you can just assume this!</p><p><strong>Doing EA Lefter?</strong></p><p>Another general worry I have about \"Doing EA Better\", and perhaps especially this post, is the extent to which it seems to be implicitly pushing an agenda of \"be more generically leftist, and less analytical\". &nbsp;If my impression here is mistaken, feel free to clarify this (and maybe add more political diversity to your list of recommended \"deep critiques\" -- should we be as open to Hanania's \"anti-woke\" stuff as to Crary et al?).</p><p>Insofar as the general message is, in effect, \"<i>think in ways that are less distinctive of EA</i>\", whether this is good or bad advice will obviously depend on whether EA-style thinking is better or worse than the alternatives. Presumably most of us are here because we think it's better. &nbsp;So that makes \"be less distinctively EA\" a hard sell, especially without firm evidence that the alternatives are better.</p><p>Some of this feels to me like, \"Stop being you! &nbsp;Be this other person instead.\" I don't like this advice at all.</p><p>I wonder if it's possible to separate out some of the more neutral advice/suggestions from the distracting \"stop thinking in traditional analytic style\" advice?</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "FhwgChhnmpHvNTknk", "postedAt": "2023-02-24T20:58:13.522Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I don't want to write this, but I wonder if it might be helpful for this post to lay out why being open to a broader set of critiques is important. I agree with this post for the record.</p>\n", "parentCommentId": null, "user": {"username": "Masha Winchell"}}, {"_id": "ieQycQBDdPCxYdJop", "postedAt": "2023-02-24T21:20:24.836Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Yeah I mean your intuition isn't wrong, one of the parts is literally \"ways of knowing\" and links to a mid-tier breadtuber. It's this weird left-wing envy I don't get in EA. If we want to reduce conflict and infighting I don't understand &nbsp;why looking towards the Left of all places. This portion of the OP is the worst written but I feel like EAs upvote it and say they like it because it reads of epistemically virtuous to be open to it. Also the authors are a bit dishonest as last time they received the partisan criticism they just pretended it was not left-leaning at all<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefsiggv4b1czc\"><sup><a href=\"#fnsiggv4b1czc\">[1]</a></sup></span>.&nbsp;</p><p>Honestly, I wanted to write a left-wing critique<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefzj58340eiej\"><sup><a href=\"#fnzj58340eiej\">[2]</a></sup></span>&nbsp;but reading the ConcernedEAs stuff made me realise it'd just get lumped in and also bad faith actors just use criticism as a cudgel. I also don't understand the deep criticism argument co-existing with the pseudonym argument because left-wing movements already exist and you can join them? You don't need to stay in EA! You can also just split your time up? &nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnsiggv4b1czc\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefsiggv4b1czc\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://forum.effectivealtruism.org/posts/54vAiSFkYszTWWWv4/doing-ea-better-1?commentId=mdkzyA7H82a5rvjrA#comments</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnzj58340eiej\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefzj58340eiej\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I already wrote it and it's about solidarity and the reactionary attitudes towards polyamory and circular firing squads in EA but I'm definitely not releasing it in the current climate. If anything I'm most tempted to write a post in the opposite direction against the Left at this point.&nbsp;</p></div></li></ol>", "parentCommentId": "2T4osQZFgrttYp5hN", "user": {"username": "zichenghuang"}}, {"_id": "ZDFw3jvTLmN9quDyK", "postedAt": "2023-02-24T21:26:02.824Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Dear authors - could you please provide at least one concrete example of a high-quality \"deep critique\" of Effective Altruism which you think was given inadequate consideration?</p>", "parentCommentId": null, "user": {"username": "Xavier_ORourke"}}, {"_id": "ZTDvdDexMgoQkxCZK", "postedAt": "2023-02-24T21:46:18.254Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Can you suggest deep critiques of EA from an ideologically moderate or conservative standpoint?</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "ZHFz4TtBtXJwv3i2K", "postedAt": "2023-02-24T21:48:08.998Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>(trying to focus my comments on particular thing here, instead of a long comment<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefm0so818fkvb\"><sup><a href=\"#fnm0so818fkvb\">[1]</a></sup></span>&nbsp;trying to cover everything. Also, I again want to thank the authors for breaking down the original post and continuing the object-level discussion)</p><p><strong>EA and Leftist Philosophy: Détente or Decimation?</strong></p><p>As noted <a href=\"https://forum.effectivealtruism.org/posts/4pwCb6c8zvq6susov/ea-is-very-open-to-some-kinds-of-critique-and-very-not-open?commentId=2T4osQZFgrttYp5hN\">by others</a>, while this particular section of DEAB suggests that EA would be institutionally and epistemically improved by accepting more 'deep critiques', it does not suggest EA accept these critiques from any direction. I'd be very surprised if the authors thought that EA would be improved by seriously considering and updating on the thoughts of our right-wing critiques.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref3k9eykm6sfg\"><sup><a href=\"#fn3k9eykm6sfg\">[2]</a></sup></span></p><p>&nbsp;In this post in particular, the relevant claims are:</p><ul><li>EA is more likely to listen to a critique that is not critical of capitalism</li><li>The main approach to politics in EA is 'liberal-technocratic'</li><li>It suggets \"The &nbsp;Good it Promises, the Harm it Does\" as an example of 'deep critique' that EA should engage with. Most, if not all perspectives in said book, criticise EA from an anti-capitalist perspecitve.</li><li>EA should \"seriously engage with critiques of capitalist modernity\"</li><li>EA funders should \"enthusiastically fund deep critiques\" (which I would assume take the form of the anticapitalist approaches above)</li></ul><p>So where I agree with this line of thinking is that I think there is a strong ideological divide between modern leftism and current EA (because I think <a href=\"https://forum.effectivealtruism.org/posts/uxFvTnzSgw8uakNBp/effective-altruism-is-an-ideology-not-just-a-question\">EA is an ideology</a> is some respects, not just a question, and that's ok). I think intellectual and public leftism is probably the largest source of criticism at the moment, and likely to be so in the future, and it is definitely worth EA investigating why that is, finding the key cruxes of disagreement, and making it clear where we think we can learn and where we reject leftist arguments and the key reasons why.</p><p>However, one of the reasons why I have ended up as an EA is that I find modern leftist epistemology and theodicy to be lacking. In disputes between, say, <a href=\"https://twitter.com/MaxCRoser/status/1378730932308471809\">Hickel and Roser</a> or <a href=\"https://noahpinion.substack.com/p/against-hickelism\">Hickel and Smith</a>, I'm not on the former's side - I think his arguments (as far as I understand them) are lacking. The same go for anticapitalist critics who <a href=\"https://forum.effectivealtruism.org/posts/xWFhD6uQuZehrDKeY/capitalism-power-and-epistemology-a-critique-of-ea\">do post</a> on the Forum.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2p6iadiq96p\"><sup><a href=\"#fn2p6iadiq96p\">[3]</a></sup></span>&nbsp;I think this is because their arguments are bad, not because I'm pattern-matching or hiding behind 'bad-epistemics'.</p><p>Take Crary's <a href=\"https://www.radicalphilosophy.com/article/against-effective-altruism\">\"Against Effective Altruism\"</a> - an example I think ConcernedEAs would agree is a 'deep critique'. Here's an example of what she has to say about EA:</p><blockquote><p>EA as a movement benefits from its embrace of those who ‘earn to give’, accumulating wealth in the economic arena that it leaves critically untouched. It is a textbook case of moral corruption.</p></blockquote><p>Firstly, In terms of the institutional reforms suggested, I can't think of any movement than would give 'enthusiastic funding' to critics who call the movement morally corrupt. Secondly, I don't think Crary really argues for rejecting EA in the piece. She frames the critiques as 'institutional', 'philosophical', and 'composite' - but doesn't really argue for it that much. Plenty of other authors are mentioned and referenced, but the article seems to me to assume that the anticapitalist critiques are correct and proceeding from there. Finally, I don't think there's much middle ground to be had between the worldviews of Crary and, say, MacAskill or Singer. Indeed, she ends the article by saying that for EA to accept the critiques she believes in, EA would cease to exist. And here I do agree. What EA <i>should </i>do, in my opinion, is explain clearly and convincingly why Crary is completely wrong.</p><p>In conclusion, I do agree that there is a lot of value in exploring the leftist critiques of EA, and I think there has been good EA work to reach out to leftist critics.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefbigr38n0que\"><sup><a href=\"#fnbigr38n0que\">[4]</a></sup></span>&nbsp;But I think the ConcernedEAs &nbsp;authors who are strongly sympathetic to these leftist critiques have the responsibility to spark the object-level debates rather than suggesting they be adopted for meta-level concerns, and those in EA who disagree with them should provide good reasons for doing so, and not hide behind accusations of 'bad epistemics' or 'wokeness run amok'.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnm0so818fkvb\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefm0so818fkvb\">^</a></strong></sup></span><div class=\"footnote-content\"><p><strong>Edit: </strong>It still became a long comment 😭 I'm trying my best ok!</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn3k9eykm6sfg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref3k9eykm6sfg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I especially have in mind Richard Hanania's <a href=\"https://forum.effectivealtruism.org/posts/bBJmZp3oQhF6PDQjw/why-ea-will-be-anti-woke-or-die\">recent critique</a>, which I thoroughly disagreed with</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2p6iadiq96p\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2p6iadiq96p\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I actually think that last post is really well-written, even if I do disagree with it</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnbigr38n0que\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefbigr38n0que\">^</a></strong></sup></span><div class=\"footnote-content\"><p>See <a href=\"https://www.listennotes.com/podcasts/the-most/33-habiba-islam-on-the-left-dkyEMLzNTHi/\">this podcast</a> from Garrison Lovely, and also <a href=\"https://rabbithole.simplecast.com/episodes/is-effective-altruism-right\">this one</a> by Rabbithole</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "HrMLpJzoiFRnYdBx5", "postedAt": "2023-02-24T21:50:32.752Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I think <a href=\"https://forum.effectivealtruism.org/posts/NdZPQxc74zNdg8Mvm/tyler-cowen-on-effective-altruism-december-2022\">Tyler's Cowen's critique</a> might be the best in this space imo.</p>", "parentCommentId": "ZTDvdDexMgoQkxCZK", "user": {"username": "JWS"}}, {"_id": "nZfg67NAkf47td6rs", "postedAt": "2023-02-24T21:59:15.077Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I consider my recent <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1\">critical post </a>to be a deep criticism (it criticises an aspect of EA culture that is emotional/intimate and it could impact the relative statuses of people within EA including prominent figures) and I wrote it under pseudonym, so I'll add my personal perspective. I don't think this post captures why I wrote my post under pseudonym and I don't think decentralising EA would have caused me to post it under my real name.</p><p>I'm also not sure exactly what message we should take from many people using pseudonyms. Here are some possibilities:</p><ol><li>People are rightly worried about retaliation</li><li>People are wrongly worried about retaliation</li><li>The community is unusually open to criticism and will seriously consider criticisms made even under pseudonym, so people feel more comfortable using pseudonyms for various other reasons including personal ones</li><li>Other possibilities I haven't thought of</li></ol><p>There's probably a combination but I don't know how we could determine how much is of each. On a positive note I think most other communities would simply disregard deep criticisms made under pseudonym or would try to dox the authors of such pieces, which is not something I worry about here.</p>", "parentCommentId": null, "user": {"username": "Patrick Sue Domin"}}, {"_id": "9eDjzbwZfKuJ6uu4A", "postedAt": "2023-02-24T22:03:51.883Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Thanks - I should have been clearer that I was asking the ConcernedEAs specifically. I'm trying to test the allegation that they are interested in only leftward critiques by asking for a different recommendation.</p>\n", "parentCommentId": "HrMLpJzoiFRnYdBx5", "user": {"username": "Jason"}}, {"_id": "S8uvhSmw8pcKr9bkg", "postedAt": "2023-02-25T02:54:26.623Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Well Rich, some of us here are leftists.</p><blockquote><p>There seems a background assumption that EAs dismiss anti-capitalist or post-colonial critiques because we're just closed-minded</p></blockquote><p>So of course, no, not all of us EAs dismiss these critiques, because a few us champion these critiques ourselves.</p><blockquote><p>rather than because those critiques are bad.</p></blockquote><p>Ouch, this hurt. But I shall recover 😢. But suffice to say, libertarian EAs shouldn't assume these critiques are bad either.</p><p>I will point out that to-date, all the major EA scandals have been caused by libertarians (cryptocurrency, race science, sexual abuse in polyarmorous community), and I do think the more reckless libertarians in EA have done more to hurt this movement than anyone else.</p><p>If EA became more left-wing, in my leftist opinion, it would be more \"EA\", if you get what I mean.</p>", "parentCommentId": "2T4osQZFgrttYp5hN", "user": {"username": "AnonEALeftist"}}, {"_id": "XsqiWH2iaEkCEo7zo", "postedAt": "2023-02-25T03:23:50.878Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I'm not the author, but there was a very prescient critique submitted to the <a href=\"https://forum.effectivealtruism.org/posts/8hvmvrgcxJJ2pYR4X/announcing-a-contest-ea-criticism-and-red-teaming\">EA criticism contest</a>, that went underappreciated. <a href=\"https://medium.com/@sven_rone/the-effective-altruism-movement-is-not-above-conflicts-of-interest-25f7125220a5\">https://medium.com/@sven_rone/the-effective-altruism-movement-is-not-above-conflicts-of-interest-25f7125220a5</a></p><p>UPDATE: actually I realised did specifically mention this critique as an example.</p>", "parentCommentId": "ZDFw3jvTLmN9quDyK", "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "7BsQouHxoAD4y87ts", "postedAt": "2023-02-25T12:19:23.076Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Hello AnonEALeftist - thanks for sharing your thoughts, and I'm sorry if you felt like you had to post anonymously because of being leftist.</p><p>I think what Richard is perhaps getting at here<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref5ett6f0wnwa\"><sup><a href=\"#fn5ett6f0wnwa\">[1]</a></sup></span>&nbsp;is not to say that <i>all </i>leftist critiques of EA are bad, but instead that EAs have come across them and have considered them lacking, and that this DEAB section is trying to get EA to consider these ideas while not actually arguing for them on the object level first. You may find this unfair, and I think the (alleged) ideological clash between EA and the Left has been danced around &nbsp;a bit by the community. I'm very much in favour of more constructive debate between the Left and EA though, and I hope you fellow lefty EAs can help contribute to that :)</p><blockquote><p>I will point out that to-date, all the major EA scandals have been caused by libertarians</p></blockquote><p>I don't think this is fully below-the-belt, but I think libertarian EAs would push back that libertarianism would necessarily be related, or causally responsible, for these harms.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefrgax7bkxx2\"><sup><a href=\"#fnrgax7bkxx2\">[2]</a></sup></span></p><blockquote><p>If EA became more left-wing, in my leftist opinion, it would be more \"EA\", if you get what I mean.</p></blockquote><p>I definitely get you mean, and I'd like to see the community explore it more in good faith. Are there any articles/resources that you think would be helpful for non-leftist EAs trying to explore this point of view? One thing I find fairly off-putting about some<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefljmvijpkrui\"><sup><a href=\"#fnljmvijpkrui\">[3]</a></sup></span>&nbsp;leftist criticism is how relentlessly hostile it is. For example, I find it very difficult to see <a href=\"https://www.radicalphilosophy.com/article/against-effective-altruism\">Crary's criticism</a> of EA as being in good faith, and I don't think this is just because she's not framing her arguments in EA language/terms, but even when EA is critical of the Left, I don't think we call Leftism \"a straightforward case of moral corruption\".</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn5ett6f0wnwa\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref5ett6f0wnwa\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Or at least, one interpretation</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnrgax7bkxx2\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefrgax7bkxx2\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Not really wanting to dive fully into this - but it's somewhat analogous to being against all of EA because of SBF</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnljmvijpkrui\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefljmvijpkrui\">^</a></strong></sup></span><div class=\"footnote-content\"><p>But not all!</p></div></li></ol>", "parentCommentId": "S8uvhSmw8pcKr9bkg", "user": {"username": "JWS"}}, {"_id": "4wxj9wKq9LnKKxkxE", "postedAt": "2023-02-25T13:07:57.009Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<blockquote><p>I will point out that to-date, all the major EA scandals have been caused by libertarians (cryptocurrency, race science, sexual abuse in polyarmorous community).</p></blockquote><p>Hmm this seems patently false to me?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreft3bvb3xsc4j\"><sup><a href=\"#fnt3bvb3xsc4j\">[1]</a></sup></span>. Am I misunderstanding something? If not, I'd appreciate it if people don't assert false things on the forum.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnt3bvb3xsc4j\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreft3bvb3xsc4j\">^</a></strong></sup></span><div class=\"footnote-content\"><p>SBF was a major Democratic donor with parents who are Democratic donors. I doubt he ever identified as libertarian. Among the biggest critiques of Bostrom's academic views is that he seems too open to authoritarian survelliance (cf Vulnerable World Hypothesis), hardly a libertarian position. I don't know which incidences of \"sexual abuse in polyarmorous community\" you're referring to, but I suspect you're wrong there too.</p></div></li></ol>", "parentCommentId": "S8uvhSmw8pcKr9bkg", "user": {"username": "Linch"}}, {"_id": "EnStzGrFqWuuBWHjM", "postedAt": "2023-02-25T14:46:11.516Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>This is a strange and unhelpful-seeming comment. Obviously nothing I wrote should be read as denying that EAs are politically diverse (generic references to \"EAs\" should always be read as implicitly preceded by the word \"many\").</p><p>I'd like to see more folks from across the political spectrum be happily involved in EA.</p><p>Things I don't like so much:*</p><ul><li>Gratuitous disrespect, e.g. through deliberately mis-naming your interlocutors.</li><li>The apparent assumption than anyone not a leftist must be a libertarian. (Is Joe Biden a libertarian too?)</li><li>Employing guilt-by-association tactics, and trying to pick a fight about which subgroups are collectively the worst.</li></ul><p>The latter is the worst offense, IMO, and illustrates precisely the kind of tribal/politicized thinking that I strongly hope is never accepted in EA. I'd much prefer a \"big tent\" where folks with different views respectfully offer object-level arguments to try to persuade each other to change their minds, rather than this kind of rhetorical sniping. (Seriously, what good do you imagine the latter will achieve?)</p><p>Note that my complaint about \"Doing EA Lefter\" is <i>not</i> that I've anything against people trying to argue for views further left than mine -- by all means, feel free! &nbsp;My concern was that their recommendations seemed to be <i>presupposing</i> leftism, and brutely <i>commanding</i> others to agree, rather than providing object-level <i>arguments </i>that might persuade the rest of us.</p><p>* = (I guess I also think it's bad form to create a burner account for the sole purpose of writing a comment with those other bad features.)</p>", "parentCommentId": "S8uvhSmw8pcKr9bkg", "user": {"username": "RYC"}}, {"_id": "kRWoaEf5xgYKNLsoB", "postedAt": "2023-02-26T03:12:38.335Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Sorry &nbsp;Richard, I meant no disrepsect. And I appreciate you acknowledging that there are leftsist EAs.</p><p>Without wanting to do guilt-by-association, I simply wanted to express that there would have been a clear benefit to having a more left-wing EA, since leftists are more critical of cryptocurrencies etc. There were many EAs who did the right thing warning about cryptocurrency/SBF, but they were smaller in number, and overlooked by the community. So apologies I went too far maligning all libertarians/non-leftists.</p>", "parentCommentId": "EnStzGrFqWuuBWHjM", "user": {"username": "AnonEALeftist"}}, {"_id": "8P8Fzw5iSynmojBqw", "postedAt": "2023-02-26T03:41:59.225Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Thank you JWS. Really appreciate your comments.</p><blockquote><p>For example, I find it very difficult to see <a href=\"https://www.radicalphilosophy.com/article/against-effective-altruism\">Crary's criticism</a> of EA as being in good faith, and I don't think this is just because she's not framing her arguments in EA language/terms, but even when EA is critical of the Left, I don't think we call Leftism \"a straightforward case of moral corruption\".</p></blockquote><p>I have seen some EA's accuse certain critiques as bad faith where I found them the opposite, and have seen attacks on Leftists (e.g. leftmism would make EA less analytical in the above comment). So I think a lot of this is due to differences in worldview/perspective.</p><p>But I certainly agree that there are some critiques of EA that are genuinely poorly done.</p><p>In terms of critiques I like:</p><ul><li>Kemp makes great points about EAs being captured by wealthy interests &nbsp;<ul><li><a href=\"https://renewal.org.uk/effective-altruism-longtermism-and-democracy-an-interview-with-dr-luke-kemp/\">https://renewal.org.uk/effective-altruism-longtermism-and-democracy-an-interview-with-dr-luke-kemp/</a></li></ul></li><li>McGoey makes good points about EA culture, e.g. EAs generally being ignorant of the role the IMF/WTO have played in exacerbating global poverty<ul><li>&nbsp; <a href=\"https://jacobin.com/2023/01/effective-altruism-longtermism-nick-bostrom-racism\">https://jacobin.com/2023/01/effective-altruism-longtermism-nick-bostrom-racism</a></li></ul></li></ul><p>But also in terms of left wing EA support, Garrison Lovely, Rutger Bregman, &amp; Habiba of 80K.</p>", "parentCommentId": "7BsQouHxoAD4y87ts", "user": {"username": "AnonEALeftist"}}, {"_id": "DEMQcynJGARLq6prD", "postedAt": "2023-02-26T03:55:33.792Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Hi Linch, sorry for the confusion. I that comment was not spceifically about certain people, and I never named SBF, Bostrom etc.</p><p>I was more referring to the general communities of people who are interested in those respective areas as being libertarians. Example, there are many EAs working in cryptocurrency and they tend to be libertarian. Many EAs have expressed interest in Race-IQ differences &nbsp;on the forum, not just Bostrom. Cryptocurrency, Race-IQ differences, and polyamory tend to be libertarian dominated areas of fascination.</p><p>I do believe SBF donated large sums to Republicans. And Bostrom's views seem to accord well with right-libertarians like Peter Thiel. I bring this up because Thiel has not been shy of using surveillance, having founded Palantir. Bostrom was also a member of Extropians with known libertarian links.</p><p>But I don't really want to be speculating on these specific individuals political views, but make the broader point that those areas of itnerest are assosciated with libertarians.</p>", "parentCommentId": "4wxj9wKq9LnKKxkxE", "user": {"username": "AnonEALeftist"}}, {"_id": "RBKhNaqszNsoddDNS", "postedAt": "2023-02-26T04:31:37.870Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I think we're maybe talking past each other. E.g. I would not classify Thiel's political views as libertarian (I think he might have been at one point, but certainly not in the last 10+ years), and I'll be surprised if the median American or libertarian would. Some specific points:</p><blockquote><p>Example, there are many EAs working in cryptocurrency and they tend to be libertarian</p></blockquote><p>To be clear, the problem with SBF is that he stole billions of dollars. Theft is no less of a problem if it was in the traditional financial system.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefgaevazirdjv\"><sup><a href=\"#fngaevazirdjv\">[1]</a></sup></span></p><blockquote><p>I do believe SBF donated large sums to Republicans.</p></blockquote><p>Notably, not to the Libertarian Party!</p><blockquote><p>Cryptocurrency, Race-IQ differences, and polyamory tend to be libertarian dominated areas of fascination.</p></blockquote><p>Seems pretty unfalsifiable to me. Also kinda irrelevant.&nbsp;</p><blockquote><p>But I don't really want to be speculating on these specific individuals political views, but make the broader point that those areas of itnerest are assosciated with libertarians.</p></blockquote><p>Seems like an unusual framing of \"to-date, all the major EA scandals have been caused by libertarians.\" Usually when I think (paraphrased)\"X group of people caused Y\" I don't think \"X group of people have areas of interests in the vicinity of Y.\"</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fngaevazirdjv\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefgaevazirdjv\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;If anything, non-consensual redistribution is much more of a leftist thing than that of any other modern political strand?&nbsp;</p></div></li></ol>", "parentCommentId": "DEMQcynJGARLq6prD", "user": {"username": "Linch"}}, {"_id": "qEMdHTnN9oQL8eMfX", "postedAt": "2023-02-26T07:19:13.932Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I see where you're coming form, but I do see libertarianism as the thread that unerpins all these scandals together.</p><p>Thiel has described himself as a conservative libertarian in the past, but yes his politics are more conservative overall now. But I make the point that surveillance/authoritarianism is not incompatible with libertarian view, and Bostrom was a an Extropian&nbsp;</p><p>SBF's \"problem\" also includes his activities for cryptocurrency adoption, which if embraced, could have caused widespread problems in the financial system. And I want to stress, cryptocurrency scandals in EA have been broader than just SBF (e.g. Ben Delo, Avraham Eisenberg). I want to stress that the cryptocurrency scandal in EA is not just SBF, but more systematic.</p>", "parentCommentId": "RBKhNaqszNsoddDNS", "user": {"username": "AnonEALeftist"}}, {"_id": "dqLuFD8RxKXrrmPhs", "postedAt": "2023-02-26T08:49:31.382Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I do agree that some EAs have labelled certain critiques as 'bad faith' or 'bad epistemics' without backing it up with clear reasoning, I just think there hasn't been much vitriol of the level Crary engages with in her article, and I think that can be a barrier to good-faith dialogue on both sides.</p><p>The Kemp piece looks really good! I've bookmarked it and will make sure to read. I'm aware of Garrison and Habiba but will look into what Rutger has said. Thanks for sharing these people and their perspectives, I think these are exactly the kind of perspectives that EA should be listening to and engaging with.</p><p>The McGoey piece seems (at first glance) like it's a bit in between the two. EAs having a blindspot about the policies of the IMF/WTO (especially in the postwar 20th century and the ascendance of the \"Washington Consensus\")<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref5a67w0nynzp\"><sup><a href=\"#fn5a67w0nynzp\">[1]</a></sup></span>&nbsp;and how they may have harmed the world's poorest people seems like a very valid critique that EAs could explore for sure. But the article subheading calls EA <i>\"the Dumbest Idea of the Century\". </i>Now, of course, EA critiques shouldn't have to obey <i>Marquess of Queensberry</i> rules in order to be listened to be EAs. But I think it's probably a psychological fact that if a group of critics keeps calling your ideas some combination of \"moral corruption\", \"the dumbest idea\", \"excuses for the rich\" and \"white supremacist/fascist\"<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefnymzaa02mc\"><sup><a href=\"#fnnymzaa02mc\">[2]</a></sup></span>, then you'll probably just stop responding to their work.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn5a67w0nynzp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref5a67w0nynzp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>If any EAs want to look into this, I'd recommend starting with <a href=\"https://en.wikipedia.org/wiki/Globalization_and_Its_Discontents\">Globalization and Its Discontents</a>, by noted leftie firebrand *checks notes* Joseph Stiglitz, Nobel laureate in economics and former Chief Economist of the World bank</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnnymzaa02mc\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefnymzaa02mc\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Torres &amp; Gebru especially deploy the rhetoric of the last 2</p></div></li></ol>", "parentCommentId": "8P8Fzw5iSynmojBqw", "user": {"username": "JWS"}}, {"_id": "swN8esL2zdCJwrEyx", "postedAt": "2023-02-26T11:58:58.440Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Glad to hear it.</p><blockquote><p>But I think it's probably a psychological fact that if a group of critics keeps calling your ideas some combination of \"moral corruption\", \"the dumbest idea\", \"excuses for the rich\" and \"white supremacist/fascist\"<a href=\"https://forum.effectivealtruism.org/posts/4pwCb6c8zvq6susov/ea-is-very-open-to-some-kinds-of-critique-and-very-not-open?commentId=dqLuFD8RxKXrrmPhs#fnnymzaa02mc\"><sup>[2]</sup></a>, then you'll probably just stop responding to their work.</p></blockquote><p>I understand. I never take this stuff personally myself. I even think it's more important to engage with criticism (provided you are headstrong for it - at that time and place) if it's espescially disagreeable/ hostile.</p><p>I haven't read Crary but it's on my list. The headline for McGoey's piece is quite harsh, but there's no real nice way to say some of these things (e.g. \"excuses for the rich\" isn't that much nicer from what Kemp says about EA being captured by billionaire interests). These critics sincerely hold these positions - whilst it's head for us to hear - it wouldn't be right for them to water down their criticisms either.</p><p>And ultimately, doesn't EA deserve harsh criticism, with the spate of scandals that have emerged &amp; emerging? If it's ultimately good for EA in the end - bring it on! More critcism is good.</p>", "parentCommentId": "dqLuFD8RxKXrrmPhs", "user": {"username": "AnonEALeftist"}}, {"_id": "A5REPdBPrzMQgJxcP", "postedAt": "2023-02-26T14:30:17.279Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Thanks, I appreciate the clarification. (I agree that a general advantage of having a more diverse/\"big tent\" coalition is that different ppl/perspectives may be more or less likely to pick up on different potential problems.)</p>", "parentCommentId": "kRWoaEf5xgYKNLsoB", "user": {"username": "RYC"}}, {"_id": "4eQvcMiGkKw9KpFLx", "postedAt": "2023-02-26T15:28:43.978Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<blockquote>\n<p>my recent critical post [Consider not sleeping around within the community]</p>\n</blockquote>\n<p>This doesn't really seem like a criticism of EA to me, more of a community health suggestion. I think when ConcernedEAs are saying we're not receptive to deep critiques, they're claiming we're willing to listen to people suggesting we spend 1% less on bednets and 1% more on vitamin supplements, but not people suggesting we should switch from working on AI alignment to ending wealth inequality.</p>\n", "parentCommentId": "nZfg67NAkf47td6rs", "user": {"username": "robirahman"}}, {"_id": "grtFsamCADYRBpLRA", "postedAt": "2023-02-26T22:33:11.869Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>Thanks! Now that SBF has been disavowed do you think EA still has a big problem with under-emphasising conflicts of interest?<br><br>I still think the best critiques benefit from being extremely concrete and that article could have had more impact if it spent less time on the high-level concept of \"conflicts of interest\" and more time explicitely saying \"crypto is bad and it's a problem that so many in the community don't see this\"</p>", "parentCommentId": "XsqiWH2iaEkCEo7zo", "user": {"username": "Xavier_ORourke"}}, {"_id": "89iPmrXDDiHrncKtL", "postedAt": "2023-02-27T00:20:48.250Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": "<p>I felt the article was pretty concrete in saying exactly that,\"crypto is bad ...\".\nIt didn't strike me as high level/ abstract at all.</p>\n", "parentCommentId": "grtFsamCADYRBpLRA", "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "L2LEpwsCLefHivszZ", "postedAt": "2023-02-26T03:26:05.449Z", "postId": "4pwCb6c8zvq6susov", "htmlBody": null, "parentCommentId": "7BsQouHxoAD4y87ts", "user": null}]