[{"_id": "o9429MMESb8djWE96", "postedAt": "2023-09-15T12:14:17.936Z", "postId": "4qMC5c4Y7g3yJQJe8", "htmlBody": "<p><strong>Executive summary:</strong> The author emphasizes the importance of managing up, a practice of proactively helping managers achieve their goals, and shares three key delegation practices: accepting and prioritizing delegated tasks, understanding the level of support and direction needed from the manager, and seeking advice from experienced individuals when the manager lacks relevant expertise.</p><p><strong>Key points:&nbsp;</strong></p><ol><li>The author encourages managing up as a way to demonstrate management skills, meet personal needs, and fulfill certain job roles.&nbsp;</li><li>When a task is delegated from a manager to an employee, it becomes significantly larger and more complex for the employee, requiring more time, support, and possibly additional tools.</li><li>The author introduces the concept of situational leadership, which includes four categories of tasks: Directing, Coaching, Supporting, and Delegating. These categories represent different levels of involvement and decision-making by the manager and the employee.</li><li>It's crucial for the manager and the employee to have a shared understanding of the category a project falls under, to manage expectations and ensure effective collaboration.&nbsp;</li><li>If a manager lacks expertise in a delegated task, the employee should seek support from others with relevant experience. Various resources, such as online courses, books, podcasts, and mentors, can be helpful.&nbsp;</li><li>The author finds these practices useful for managing up, making complex tasks manageable, and understanding the dynamics of delegation and support within an organization.</li></ol><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]