[{"_id": "tCJ9d69eq2qus2pyA", "postedAt": "2022-09-11T19:23:38.403Z", "postId": "4S2qdMwNqksZhnJ9y", "htmlBody": "<p>Thank you for doing this. This is sort of like what I had in mind for the <a href=\"https://forum.effectivealtruism.org/posts/kxrMaeTSiH8QJCT97/a-corporate-skills-bake-sale\">corporate skills bake</a> sale, but more direct.&nbsp;</p>", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "cpT4S5LfKh8y982Ma", "postedAt": "2022-09-11T21:51:48.385Z", "postId": "4S2qdMwNqksZhnJ9y", "htmlBody": "<p>Thanks David.</p>\n<p>I have been interested in how altruists can use the economy to do good for a while. It would be really great if we could have lawyers, realtors, life insurance sales people, etc. using a commitment to direct fresh and commissions to charities to get a competitive advantage in generating business.</p>\n<p>I like your corporate skills bake sale idea... Why not just have professionals do the work they're good at and explicitly donate the fees generated? This model is an example of what I call Guided Consumption. I know you commented on one of my more recent posts laying out Guided Consumption from the perspective of various agents, and thanks for helping me clarify a point in my formulas. I like this earlier one a bit better as an introduction if you hadn't had a chance to read it yet.</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the\">https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the</a></p>\n<p>As I can see you're someone interested in using your economic insights toward altruistic ends, I'd really appreciate the opportunity to discuss the broader project of my nonprofit with you sometime. I think it would be well worth the time you direct towards it.</p>\n<p><a href=\"mailto:Brad@consumerpowerinitiative.org\">Brad@consumerpowerinitiative.org</a></p>\n", "parentCommentId": "tCJ9d69eq2qus2pyA", "user": {"username": "Brad West"}}, {"_id": "L53GzdnfHMCDidGzk", "postedAt": "2022-09-12T00:20:49.684Z", "postId": "4S2qdMwNqksZhnJ9y", "htmlBody": "<p>I'd also like to mention that if any EAs are doing something like this, I'd like to know. The Consumer Power Initiative website is going to be done soon, and we'd like to list individuals and companies that are working for effective charities rather than themselves or traditional investors.</p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "2Kvi2RByvB23xrkXT", "postedAt": "2022-09-12T12:53:19.422Z", "postId": "4S2qdMwNqksZhnJ9y", "htmlBody": "<p>I don't know how I feel about this. On the one hand, I see a clear connection to EA; on the other hand, it feels like you're using the EA Forum to advertise an unrelated business. I'm not sure if I really would want a lot of other people to do this too.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "9Yj94xS3KJGSiBFZF", "postedAt": "2022-09-12T13:00:44.489Z", "postId": "4S2qdMwNqksZhnJ9y", "htmlBody": "<p>The Consumer Power Initiative will be providing a platform through its website under development for businesses that help charities. We wouldn't want the EA forum to become flooded with stuff like this. If the business generated is supporting effective charities, we want people to know how they can do business in a way that helps them.</p>\n<p>But this post here doesn't simply generate money for effective charities if I get leads, it also provides a model that others can follow.</p>\n", "parentCommentId": "2Kvi2RByvB23xrkXT", "user": {"username": "Brad West"}}, {"_id": "8kyGHYWAKAirZLjoC", "postedAt": "2022-09-22T19:13:27.745Z", "postId": "4S2qdMwNqksZhnJ9y", "htmlBody": "<blockquote>\n<p>Why not just have professionals do the work they're good at and explicitly donate the fees generated?</p>\n</blockquote>\n<p>Essentially that’s what I was  proposing but</p>\n<ol>\n<li>\n<p>making the donations direct/public to generate goodwill from “clients” and overcome their reluctance to pay for things/companies they might otherwise find a bit repugnant</p>\n</li>\n<li>\n<p>Leveraging existing corporate pro bono initiatives and incentives</p>\n</li>\n</ol>\n<p>And for both of these points I see a benefit in focusing on “noncore” business. For 1, for the reasons above, and for 2, bc the employer/firm might be reluctant to have its regular income diverted to charity</p>\n", "parentCommentId": "cpT4S5LfKh8y982Ma", "user": {"username": "david_reinstein"}}, {"_id": "KjCJdWbtEye6uJdaL", "postedAt": "2022-09-22T19:24:15.489Z", "postId": "4S2qdMwNqksZhnJ9y", "htmlBody": "<p>I know you were proposing it... I was paraphrasing it with agreement .</p>\n<p>Yeah, it's a great idea to come up with ways in which business resources can be used to serve worthy ends consistently with traditional shareholder and stakeholder interests.</p>\n<p>Of course, I'd rather go much further and just get equity in the hands of charities than have to do all the skating around nonaligned stakeholders. I think if the relevant counterparties are aware of this fact, in many contexts it will, at the very least, be worth the acquisition cost. In some contexts, it could be revolutionary.</p>\n", "parentCommentId": "8kyGHYWAKAirZLjoC", "user": {"username": "Brad West"}}]