[{"_id": "e9a3TswnWx3AYoE7S", "postedAt": "2023-04-28T21:23:47.638Z", "postId": "4SFgv9iSaBWikriYj", "htmlBody": "<p>Super interesting, thanks! Any clue why accuracy declined for the tropics over 2004-2006 in figure 4? Just an anomaly?<br><br>And out of curiousity, do any authors or experts have a sense for how likely it is that machine learning will significantly change the situation? (I would expect rich countries to drive this innovation so I doubt it's of philanthropic interest)</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "gxC8qdBxuzfQ5ByDB", "postedAt": "2023-05-02T10:55:31.665Z", "postId": "4SFgv9iSaBWikriYj", "htmlBody": "<p>Hey Ben - thanks for your question. Unfortunately we didn't come across anything in our research that would quickly explain the decrease for 2004-2006 (or the increase in 2012-2016). It could have been differences in the atmospheric conditions at that time that the model was less able to handle, or changes to the ECMWF forecasting methods.</p><p>Re. machine learning, it does seem likely that there's scope for that here. While we didn't look into this in detail, we mention two ideas briefly in <a href=\"https://docs.google.com/spreadsheets/d/14lVqkqsaHLHk41YEuEYqNUt3K93bM8reC-_6CzNFlA4/edit#gid=0\">this spreadsheet of potential interventions</a>.&nbsp;</p><ol><li>Use machine learning to downscale (i.e. get better resolution) of existing forecasts: Tim Palmer at Oxford is a proponent of this.</li><li>Use machine learning to improve forecasts: this seems plausible and interesting, and I don't know that we should expect that rich countries will drive improvements that close the gap in forecast quality between the tropics and NH. It also seems likely that the quality/ quantity of data from the tropics will put some limits on how successful ML can be for some locations.</li></ol><p>Would be interested to hear if you have any further thoughts on either topic!</p>", "parentCommentId": "e9a3TswnWx3AYoE7S", "user": {"username": "Aisling Leow"}}, {"_id": "6mm6ZhayZBiZAXpN6", "postedAt": "2023-05-02T12:47:45.602Z", "postId": "4SFgv9iSaBWikriYj", "htmlBody": "<p>Thanks! That all makes sense. I think I was imagining ML-based improvements to drive accuracy in absolute terms - so it wouldn't close the NH-tropic gap, but could raise tropic accuracy overall. But provided there are incentives for improved accuracy in the NH, I'd expect private investment to pursue it.&nbsp;<br><br>I agree - the data quality/quantity seems like larger bottlenecks to improving tropic accuracy. It seems possible that ML-approaches that work better with poor quality/quantity data may be sufficiently different to NH problems such that the expected private investment <i>wouldn't</i> translate into improvements for the tropics, maybe opening up potential for philanthropy to have an impact... but that's a long chain and I don't anywhere near enough about ML/weather forecasting to make a good guess.</p>", "parentCommentId": "gxC8qdBxuzfQ5ByDB", "user": {"username": "BenStewart"}}, {"_id": "9o3HgDNYtxLBEQARo", "postedAt": "2023-05-04T16:28:12.967Z", "postId": "4SFgv9iSaBWikriYj", "htmlBody": "<p>Hi,</p><p>This is a little tangential to the topic you have researched, but I wonder whether improving forecasting capacity with an eye on abrupt sunlight reduction scenarios (like nuclear winter) would be cost-effective. I have heard that the current models are good to predict global variations (e.g. of temperature), but not so much to get the local variations right (apart from relatively large local phenomena like monsoons). I suppose it would be quite important to figure out in the 1st few months after the nuclear war how the wheather would evolve in the next few years in order to minitigate the food shortfall.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "ZuxzRaLwehktnTi5n", "postedAt": "2023-05-19T10:14:48.191Z", "postId": "4SFgv9iSaBWikriYj", "htmlBody": "<p>Hi Vasco - sorry for the slow response! I don't think I have a particularly satisfactory answer for you on this topic, but I think my instinctive response is that the potential could be limited, depending on whether we think the patterns that underly the algorithms for forecasting now will be the same/ be able to be quickly adapted for these scenarios. My understanding is that forecasting depends on predicting the physics in the atmosphere (which may not change), as well as interactions with the land/oceans (which may be affected, e.g. changing landscapes due to death of flora/fauna). If this scenario is one that we haven't experienced before, maybe we could simply update the parameters based on new observations and the models would work, but maybe we would need to do research to improve the methods that are in use, which could take time. Another limitation could be that I'm not sure how well models could predict the evolution over several years, as you mention - our focus was on &lt;6 months and we found limited accuracy.</p><p>Perhaps just one other thing to flag is that doing forecasting at somewhere like ECMWF uses a huge amount of energy, so we'd want to think about the trade-offs with other needs!</p>", "parentCommentId": "9o3HgDNYtxLBEQARo", "user": {"username": "Aisling Leow"}}, {"_id": "ByM2oApyodgjDT5yt", "postedAt": "2023-05-19T13:41:45.628Z", "postId": "4SFgv9iSaBWikriYj", "htmlBody": "<p>Thanks for the feedback!</p>", "parentCommentId": "ZuxzRaLwehktnTi5n", "user": {"username": "vascoamaralgrilo"}}]