[{"_id": "fbHSnfAKxBxAxZJLK", "postedAt": "2023-07-10T11:36:06.286Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>I really like this org. When I play board games, I play faster when I know I'm allowed to take moves back. Similarly I can imagine that if I know I can get money back if I am in hardship, I can imagine I might give more.</p><p>Conceivably in a better world, many people might have \"charity accounts\" where the difference between some baseline and the invested money goes to charity but you can pull it out at any time. Many people wouldn't and so orgs would get the interest as donations.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "KDrprRLP5cjtLwHAy", "postedAt": "2023-07-10T15:10:45.785Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Consider hardcore volunteers as well; some EAs unironically volunteer 30 or 40 hours a week while working part-time to support themselves. I did that for 3.5H years or so.</p>", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "y9KBgF5BaSHcTv4dK", "postedAt": "2023-07-11T00:54:47.241Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>(The link to the form produces a 404 error on mobile for me.)</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "9Goax8DETbfxrjGy5", "postedAt": "2023-07-11T01:23:21.219Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>A few random questions:</p>\n<ol>\n<li>Is a more operationalized definition of \"financial hardship\" envisioned at some point?</li>\n</ol>\n<p>(Totally agree with leaving it undefined during the trial phase, and can see arguments for leaving it undefined in an operational phase too. On the other hand, I think transparency is particularly important for charities whose most direct benefit is to EA or EA-adjacent people, and given Basefund's purpose that transparency probably needs to be at a policy level rather than an individual-application level).</p>\n<ol start=\"2\">\n<li>\n<p>Could you explain the rationale for possibly extending the eligibility period backward to 2012? If the theory of change is to encourage people to donate boldly because they can get a partial refund if they experience future financial trouble, it seems that theory would only work prospectively.</p>\n</li>\n<li>\n<p>One policy quirk to consider in the future: Should an intervening bankruptcy filing disqualify a significant payout?</p>\n</li>\n</ol>\n<p>There are some potential scenarios in which the effect would -- in my view -- be inequitable toward the donor's creditors. It doesn't seem appropriate to me to give a payout to someone based on pre-petition donations if they saddled their creditors with pre-petition losses.</p>\n<p>Because the potential payout would fully be within Basefund's control, that asset could potentially evade the equitable principles of the Bankruptcy Code. This would be particularly problematic if the donor were insolvent when the donation was made, but the creditors couldn't recover the donation under fraudulent conveyance law because of 11 USC § 548(a)(2)'s protection for certain charitable contributions by individuals.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "b28AKiLbJaNKLwLag", "postedAt": "2023-07-11T08:51:50.499Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Thanks for letting us know, fixed!</p>\n", "parentCommentId": "y9KBgF5BaSHcTv4dK", "user": {"username": "bob"}}, {"_id": "XRES9NFhxbjHxMRuk", "postedAt": "2023-07-11T08:58:25.882Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>This is something we'd like to expand to, but it's much harder to define \"EA volunteer\" than \"donor to effective charities\". Once donor assistance is running smoothly, we'll likely give volunteer assistance a try.</p>\n", "parentCommentId": "KDrprRLP5cjtLwHAy", "user": {"username": "bob"}}, {"_id": "NJqR8G78bTfDJ4XhE", "postedAt": "2023-07-11T13:17:01.241Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Two comments on the form:</p>\n<p>Website says only donations made in 2022/2023 can be considered, but form asks about those made after Jan 1 2021. Is this intentional data collection about an ineligible year, or an out of date form?</p>\n<p>I'd encourage a more secure means of collecting banking info than what appears to be unencrypted email.</p>\n", "parentCommentId": "b28AKiLbJaNKLwLag", "user": {"username": "Jason"}}, {"_id": "YsgXwAXEfmfcKtWtL", "postedAt": "2023-07-11T22:37:45.169Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Yeah, huge fan of this concept; I'm eager to see that people are trying it out!</p>", "parentCommentId": "fbHSnfAKxBxAxZJLK", "user": {"username": "Jackson Wagner"}}, {"_id": "aBzNPp9MmtGFXto2Y", "postedAt": "2023-07-12T09:03:45.544Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>As a charity operator, I love this idea.</p>\n<p>Also I would hope (although I think it's unlikely) that if donors feel upon hard times then they felt they could ask us as OneDay health for their money back - this would be a rare scenario and we would be very happy to return it!</p>\n<p>I wonder if there could be a way for charities to specifically sign up to a refund agreement through something like basefund,  and then basefund could almost be an \"underwriter\" for situations where the charity couldn't manage paying the money back.</p>\n<p>Maybe this is impractical but it makes some sense to me at this point.</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "azXaT8qxM9uwFgGzm", "postedAt": "2023-07-12T09:08:07.942Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>The form was indeed outdated, and I agree that moving away from email would be a good thing.</p>\n", "parentCommentId": "NJqR8G78bTfDJ4XhE", "user": {"username": "bob"}}, {"_id": "oLar7GfMMiiYyiu9p", "postedAt": "2023-07-12T10:00:52.118Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<ol>\n<li>The US legal definition of hardship is more stringent than ours, and we can only assist people who experience US-level hardship because we operate under a US charity. No choice there. I think pointing people to legal definitions won't help.</li>\n<li>Extending the eligibility period is less of a utilitarian choice than something deontological/oriented at community building. We believe we have a duty to help EAs who'd be able to support themselves if they hadn't given away their money. Besides that, we hope current and potential EAs will see that we're looking out for each other, which will make the EA community a more attractive place to be in. There's also an argument to be made that getting donors back on their feet might get them to donate again, and it could stop them from leaving EA altogether.</li>\n<li>Interesting point</li>\n</ol>\n", "parentCommentId": "9Goax8DETbfxrjGy5", "user": {"username": "bob"}}, {"_id": "CNALDaiCHYCjDBayg", "postedAt": "2023-07-12T13:37:56.172Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<blockquote><p>Also I would hope (although I think it's unlikely) that if donors feel upon hard times then they felt they could ask us as OneDay health for their money back - this would be a rare scenario and we would be very happy to return it!</p></blockquote><p>Are you legally able to do this? I thought that once a donation had been made you were obliged to use it to advance your charitable objectives, and giving money to donors in the US does not seem likely to promote health in rural Uganda.&nbsp;</p>", "parentCommentId": "aBzNPp9MmtGFXto2Y", "user": {"username": "Larks"}}, {"_id": "hKCpdKTRdBvjdz3DN", "postedAt": "2023-07-12T14:57:44.737Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>One should check applicable law before returning a donation, which could vary from jurisdiction to jurisdiction. <a href=\"https://www.pkftexas.com/tax-and-accounting-desk/when-to-return-donations-back-to-donors/\">This </a>article by a CPA suggests that \"if a donor asks for a smaller donation back, it’s usually best to return it. Larger donations may be harder to return. In this circumstance, talk to your legal and financial advisors — and possibly your state’s not-for-profit agency.\" The rationale isn't stated, but I suspect the business-judgment rule might apply here. In other words, it may be possible for the charity to decide that furtherance of good donor relations justifies refunds under certain circumstances as a means of achieving the charity's objectives.</p>", "parentCommentId": "CNALDaiCHYCjDBayg", "user": {"username": "Jason"}}, {"_id": "uj7FzjtiJYWdisuFd", "postedAt": "2023-07-12T15:13:05.460Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "hKCpdKTRdBvjdz3DN", "user": {"username": "Larks"}}, {"_id": "yENnsmfEybW4Zz8kF", "postedAt": "2023-07-12T20:07:35.362Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Thanks you might well right, I never would have figured something like this! Us doctors arent always the great at legal stuff!</p>\n<p>Seems awfully sad to me though. Donations are done volunteraly and generously, so it seems a bit sad not to be able to give them back in a very rare case. I can't imagine anyone would ever sue a charity for this.</p>\n", "parentCommentId": "CNALDaiCHYCjDBayg", "user": {"username": "NickLaing"}}, {"_id": "baCczwmaqH6M8G3BQ", "postedAt": "2023-07-19T14:50:30.270Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<blockquote>\n<p>I can't imagine anyone would ever sue a charity for this.</p>\n</blockquote>\n<p>I think the main issue isn't the charity being sued, but loss of 501c3 status?</p>\n<p>Here's an example of a situation the IRS might be worried about: I give $100k to charity in 2023, the charity gives me a \"no goods and services\" receipt, and I deduct $100k from my income in figuring taxes, and I save, say $30k.  Then in 2024 I tell the charity \"I'm sorry, I lost my job, I'm in danger of losing my house, and I need the money back\".  They give me the money back, and I don't tell the IRS.</p>\n", "parentCommentId": "yENnsmfEybW4Zz8kF", "user": {"username": "Jeff_Kaufman"}}, {"_id": "6fYJQf7f2QR4ngy2t", "postedAt": "2023-07-19T15:07:30.683Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Or problems with the state charity regulator.</p><p>My checklist would probably go something like this:</p><ul><li>tax issues (as you described)</li><li>concerns about potential preferential treatment of an insider&nbsp;</li><li>concerns about whether a refund could materially impair the charity's operations (and be seen as a breach of the public trust or a fiduciary duty)</li><li>checking to confirm that the refund wouldn't make the charity close-to-insolvent (this is the only scenario I see in which a suit by a non-governmental actor seems plausible -- if the charity ended up unable to pay other obligations, the refund could be a constructive fraudulent conveyance)</li><li>donor bankruptcy issues (as described in my top-level comment)</li></ul>", "parentCommentId": "baCczwmaqH6M8G3BQ", "user": {"username": "Jason"}}, {"_id": "7BttgC8dg7w9ktaRs", "postedAt": "2023-07-19T16:34:57.575Z", "postId": "4TJpwmGmdgv7R6nGZ", "htmlBody": "<p>Yeah thanks, given all these concerns, I think my idea is bad unfortunately. Seemed nice at first but not practical.</p>\n", "parentCommentId": "baCczwmaqH6M8G3BQ", "user": {"username": "NickLaing"}}]