[{"_id": "NjotghmwqcfZmvmZM", "postedAt": "2023-08-28T22:11:37.137Z", "postId": "4TwrfMrijEemF9EwS", "htmlBody": "<p>tl;dr [edited mainly for tone] - although in general buying out lobbyists can work, the proposal doesn't use the right numbers in calculating its costs.</p><p><br>Hi, in your first paragraph you implicitly identify that there are two important and distinct numbers at play here:<br>1) the maximum amount the \"sugar lobby\" is <strong>willing to pay </strong>to stop sugar laws being introduced - this is the amount you call $X, and is (as you say) equal to the total discounted profits that would be lost if a tax were introduced.<br>2) the amount the lobby <strong>actually</strong> pays. Assuming I read you correctly, this stands at $50m in 2009.<br><br>As you say, (1) is higher than (2), but not just because of externalities and uncertainties: there's also the fact that (1) is determined by <i>total </i>costs and benefits, and (2) by <i>marginal </i>costs and benefits in terms of how much additional lobbying money translates into reducing the probability of a tax being introduced (this is a generally important distinction, but I'll ignore it for now)<br><br>What we primarily care about is a <u>third number</u>, which is the <strong>minimum cost of buying out</strong> the sugar lobby. In a \"certain\" world (where lobbyists can knowingly guarantee a policy does or doesn't get passed by spending certain amounts) I think this corresponds the difference in these numbers, i.e. $(X-50m). That is, a philanthropist could go to the sugar lobby and say, we'll give you $(X-49.9999m), you the lobbyist save $50m that you would have spent on lobbying, and you lose $X in profits because of the tax. Therefore, you're made very slightly better off by this deal. Note that for a given X, the higher the spending on lobbying, the <i>easier</i> it is to pay off the lobbyist.<br>[In reality, the sugar lobby could play hardball and bargain up the buy-out price, hence <i>minimum</i> cost, but that's not really the point]<br><br>The point is we don't know what $X is - you'd probably need to look at total sugar consumption multiplied by proposed per unit tax minus the deadweight loss due to falling consumption. This in turn requires you to know the shape of the beverage industry's marginal cost curve.<br><br>I <i>think </i>you've conflated all three numbers at various points, having seen the lobby spends $50m, and then taken that as the cost to a philanthropist of getting a tax introduced.<br><br>I haven't checked the rest of your numbers, or thought about practical/political challenges, but I think the main stumbling block is the fact that it'll cost way more than $50m to buy out the sugar lobby.<br><br>The alternative that neither of us consider is the cost of <strong>counter-lobbying lawmakers </strong>to ignore the sugar lobby and introduce the tax - that's a whole different question and may well be cost-effective.<br><br>If I'm misrepresenting or misunderstanding what you're saying, I do apologise! I also wouldn't be surprised if a political economist spotted some errors in my analysis, but I'd still expect the $50m figure you quote to be misleading and a significant underestimate.</p>", "parentCommentId": null, "user": {"username": "James Lester"}}, {"_id": "de3YAcKmveAwPKQnR", "postedAt": "2023-08-29T09:43:42.057Z", "postId": "4TwrfMrijEemF9EwS", "htmlBody": "<p>This is directionally correct and is a known result in the political economy literature. Analogous techniques have been used in a range of contexts to overcome <a href=\"https://www.britannica.com/topic/collective-action-problem-1917157/Incentives-and-disincentives-of-collective-action\">collective action problems</a>. There is more detail in e.g. <a href=\"https://global.oup.com/academic/product/dealing-with-losers-9780190456948?cc=gb&amp;lang=en&amp;#:~:text=Dealing%20with%20Losers%3A%20The%20Political,societal%20welfare%20beyond%20mere%20compensation.\">this book</a> and my general overview here: <a href=\"https://forum.effectivealtruism.org/posts/o8TfAbYgDGKbeu6Da/vetocracy-reduction-and-other-coordination-problems-as\">https://forum.effectivealtruism.org/posts/o8TfAbYgDGKbeu6Da/vetocracy-reduction-and-other-coordination-problems-as</a></p>", "parentCommentId": null, "user": {"username": "John_Myers"}}]