[{"_id": "ynQKDE6zgZMPrxYLY", "postedAt": "2022-12-17T17:43:44.458Z", "postId": "4uAto9ohsNEW4M7zM", "htmlBody": "<p>Interesting post.&nbsp;</p><p><strong>I have three points/thoughts in response:</strong></p><p><strong>1)</strong> Could it be useful to distinguish between \"causal uncertainty\" and \"non-causal uncertainty\" about who (and how many) will exist?</p><p>Causal uncertainty would be uncertainty resulting from the fact that you as a decision maker have not yet decided what to do, yet where your actions will impact who will exist--a strange concept to wrap my around. Non-causal uncertainty would be uncertainty (about who will exist) that stems from uncertainty about how other forces will play out that are largely independent of your actions.&nbsp;</p><p>Getting to your post, I can see why one might discount based on non-causal uncertainty (see next point for more on this), but discounting based on causal uncertainty seems rather more bizarre and almost makes my head explode (though see this <a href=\"https://philpapers.org/rec/HARSAS-15\">paper</a>). &nbsp;</p><p><strong>&nbsp;2) </strong>You claim in your first sentence that discounting based on space and time should be treated similarly to each other, and in particular that discounting based on either should be avoided. Thus it appears you claim that absent uncertainty, we should treat the present and future similarly; [if that last part didn't quite follow see point 3 below]. If so, one can ask should we also treat uncertainty about who <i>will &nbsp;</i>eventually come into existence similarly to how we treat uncertainty about who <i>currently</i> exists? &nbsp;For an example of the latter, suppose there are an uncertain number of people trapped in a well: either 2 or 10 with 50-50 odds and we can take costly actions to save them. I think we would weight the possible 10 people with only 50% (and similarly the possible 2 people), so in that sense I think we would and should discount on uncertainty about who currently exists. If so and if we answer yes to the third sentence in this paragraph, we should also discount future people based on non-causal uncertainty. &nbsp;</p><p><strong>3)</strong> Another possibility is to discount not based on time <i>per se &nbsp;</i>(which you reject) but rather on current existence, so that future people will be discounting or ignored until they exist at which point they get full value. A potential difficulty with this approach is that you could be sure that 1 billion people are going to be born in a barren desert next year and you would, then, have no (or at discounted) reason to bring food to that desert until they were born, at which point you would suddenly have a humanitarian crisis on your hands which you quite foreseeably failed to prepare for. [Admittedly people come into existence through a gradual process (e.g. 9 months) so it wouldn't be quite a split-second change of priorities about whether to bring food, which might attenuate the force of this objection a bit.]</p>", "parentCommentId": null, "user": {"username": "Lixiang"}}, {"_id": "9H87XZk8darco6YAo", "postedAt": "2022-12-18T02:31:59.609Z", "postId": "4uAto9ohsNEW4M7zM", "htmlBody": "<p>Yes, you should absolutely discount future people in proportion to their probability of not existing. This is still totally fair to those future people because, to the extent that they exist, you treat them as just as important as present people.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "9yWAnqSHy5AXzpQe4", "postedAt": "2022-12-20T01:48:25.801Z", "postId": "4uAto9ohsNEW4M7zM", "htmlBody": "<p>I haven't read this post very carefully, but at a glance, you might be interested in the gist of this post: <a href=\"https://forum.effectivealtruism.org/posts/N6hcw8CxK7D3FCD5v/existential-risk-pessimism-and-the-time-of-perils-4\">Existential risk pessimism and the time of perils</a> (note: see also <a href=\"https://forum.effectivealtruism.org/posts/N6hcw8CxK7D3FCD5v/existential-risk-pessimism-and-the-time-of-perils-4?commentId=MCZTKWjuec4GTuzBx\">the top comment</a>, which I think makes really excellent points).&nbsp;</p><p>Here's ChatGPT's summary of the post (after I cut a bunch out of it):&nbsp;</p><ol><li>Many effective altruists (EAs) believe that existential risk (the risk of human extinction) is currently high and that efforts to mitigate this risk have extremely high expected value.</li><li>However, the relationship between these two beliefs is not straightforward. Using a series of models, it is shown that across a range of assumptions, the belief in high existential risk (Existential Risk Pessimism) tends to hinder, rather than support, the belief in the high expected value of risk mitigation efforts (the Astronomical Value Thesis).</li><li>The most plausible way to combine Existential Risk Pessimism with the Astronomical Value Thesis is through the Time of Perils Hypothesis, which posits that we are currently in a period of high risk, but this risk will decrease significantly in the future.</li><li>For the Time of Perils Hypothesis to support the Astronomical Value Thesis, it must involve a relatively short period of high risk and a very low level of risk thereafter.</li><li>Arguments for the Time of Perils Hypothesis that do not involve the development of artificial intelligence (AI) are not sufficient to justify the necessary form of the hypothesis.</li><li>It is suggested that the most likely way to ground a strong enough Time of Perils Hypothesis is through the development of superintelligent AI, which could radically and permanently lower the level of existential risk.</li><li>This has implications for the prioritization of existential risk mitigation as a cause area within effective altruism.</li></ol><p>Here's its lightly edited summary of (a part of) <a href=\"https://forum.effectivealtruism.org/posts/N6hcw8CxK7D3FCD5v/existential-risk-pessimism-and-the-time-of-perils-4#comments\">the comment I linked</a>:&nbsp;</p><ol><li>[Replaced with a direct quote] \"I think this model is kind of misleading, and that the original astronomical waste argument is still strong. It seems to me that a ton of the work in this model is being done by the assumption of constant risk, even in post-peril worlds. I think this is pretty strange.\"</li><li>The model makes the assumption of constant risk, which may be unrealistic.</li><li>The probability of existential risk may be inversely proportional to the current estimated value at stake, if it is assumed that civilization acts as a value maximizer and is able to effectively reduce risk.</li></ol>", "parentCommentId": null, "user": {"username": "Lizka"}}]