[{"_id": "36JgApbyfox8MDE7m", "postedAt": "2024-01-10T10:03:08.428Z", "postId": "4v45j5fuDfRru5kQ9", "htmlBody": "<p>Thank you for doing this!</p><p>I have a question about the translation of \"utilitarianism\" to \"功利主義\". I have been thinking for very long that this is a bad translation in both the Japanese and Chinese contexts (for those who don't know these languages: \"功利主義\" is the most popular translation for \"utilitarianism\" in both Japanese and Chinese). The bad thing seems to be that the words \"功利\" has a bad connotation, and one that is almost the reverse of utlitarianism, therefore causing people to misunderstand utilitarianism, or have bad impression against it.&nbsp;</p><p>My question is then: <strong>Do you think \"功利主義\" is a bad translation?&nbsp;</strong> (not bad as in it is bad that you, or any translator chose this as the translation. But bad that it was, historically speaking, chosen and established as the popular translation.)</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "cXxjRfjz3JfukdR5c", "postedAt": "2024-01-10T12:51:49.973Z", "postId": "4v45j5fuDfRru5kQ9", "htmlBody": "<p>Thank you, Fai. I'm Masashi. Long time no see!</p><p>Instead of Hayate, I answer your question (I have collaborative research on EA with him).</p><p>Do you remember our discussion on this topic at Princeton University?<br>After coming back to Japan, I read the paper written by Daisuke Arie.<br><a href=\"https://journals.openedition.org/etudes-benthamiennes/5678?lang=en\">https://journals.openedition.org/etudes-benthamiennes/5678?lang=en</a><br>(I read the Japanese version one.)<br>What do you think about this paper?</p><p>I agree that 功利 is a bad impression for the Japanese (and Chinese). Arie agrees in the paper, too. And I think, for education, this translation may lead people to misunderstand utilitarianism.</p><p>However, I think this is not a bad translation. Even if we change this translation with, e.g., 大福主義 and people understand utilitarianism as not egoism but maximizing overall well-being, people probably think utilitarianism leads to a counter-intuitive conclusion and also think it is a wrong moral theory. The problem is not in translation but in their understanding of utilitarianism itself.</p>", "parentCommentId": "36JgApbyfox8MDE7m", "user": {"username": "Masashi Takeshita"}}]