[{"_id": "5t4NFKXotsocDDaLm", "postedAt": "2023-11-21T00:18:49.752Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<blockquote><p>Therefore, I expect marginal funding that we raise from other donors (i.e. you) to most likely go to the following:</p><ul><li>Community Building Grants [...] $110,000</li><li>Travel grants&nbsp;for EA conference attendees [...] $295,000</li><li>EA Forum [...] [Nuño: note no mention of the cost in the EA forum paragraph]</li></ul></blockquote><p>You don't mention the cost of the EA forum, but per <a href=\"https://forum.effectivealtruism.org/posts/auhi3JoiqGhi5PqnQ/ama-we-re-the-forum-team-and-we-re-hiring-ask-us-anything?commentId=tjTkjLpBD59ybtcuX\">this comment</a>, which gives more details, and per your own table, the \"online team\", of which the EA Forum was a large part, was spending ~$2M per year.</p><p>As such I think that your BOTECs are uninformative and might be \"hiding the ask\":</p><blockquote><ol><li><a href=\"https://squigglehub.org/models/angelinahli/ltff-bio-comparison\"><u>This model</u></a>&nbsp;compares a <a href=\"https://forum.effectivealtruism.org/posts/7RrjXQhGgAJiDLWYR/what-does-a-marginal-grant-at-ltff-look-like-funding%23If_LTFF_raises__100_000\"><u>hypothetical LTFF grant</u></a>&nbsp;to a biosecurity workshop with the labor that CEA staff spent on a similar event. It finds that the CEA expenditure is a bit more cost-effective.</li><li><a href=\"https://squigglehub.org/models/angelinahli/digest-vs-summaries\"><u>This model</u></a>&nbsp;compares CEA's cost of producing Forum Digests to a <a href=\"https://funds.effectivealtruism.org/grants?search%3Drethink%2Bpriorities%26fund%3DEA%252520Infrastructure%252520Fund%26sort%3Dround\"><u>grant</u></a>&nbsp;that the EA Infrastructure Fund gave for creating Forum + LW summaries. It finds that CEA expenditure is more cost-effective.</li></ol></blockquote><hr><p>&nbsp;</p><blockquote><p>we will be doing a follow-up post solely devoted to Forum fundraising</p></blockquote><p>I look forward to this. In the meantime, readers can see my own take on this <a href=\"https://nunosempere.com/blog/2023/10/15/ea-forum-stewardship/\">here</a>: in short, I think that the value of the forum is high but the marginal value of having a massive, $2M/year, online team is very low, possibly negative.&nbsp;</p><p>As an illustration of the marginal value point, I don't think that this point goes through because I think that the forum is equally capable of hosting criticism at $500k a year than at $2M/year.&nbsp;</p><blockquote><p>I would particularly like the Forum to have diverse funding since some of its value comes from hosting <a href=\"https://forum.effectivealtruism.org/topics/criticism-of-work-in-effective-altruism\"><u>criticism</u></a>&nbsp;of \"powerful\" people/organizations. I'm not aware of any instances of donors e.g. pressuring CEA to remove a post that's critical of them, but \"hey can you please be a predominant funder of this thing which is critical of you\" feels like an uncomfortable pitch to have to make.</p></blockquote><p>As a result, I don't think EA community members should be donating to CEA at this time.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "5yjo5BuT5hxkppjBg", "postedAt": "2023-11-21T00:56:33.866Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Huh, this feels like a somewhat weird post without mentioning the FTX settlement for $22.5M that EV just signed: <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DocketInfo\">https://restructuring.ra.kroll.com/FTX/Home-DocketInfo</a> (Memo number 3745).&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/zdcn8zkzc3x6onfuseli\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/p9jtznbrh992f1xyl9bk 150w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/urbvyxvjzuczibbjiob7 300w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/gpif0704ozdy5pejfzlp 450w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/tistjm46cchcynznrepd 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/o3d008ajg98yarkduyvx 750w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/hinjf5iknl84zrt50m3x 900w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/uej6etpwi2banybmeesc 1050w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/ylc2tdrkauzmssjvgflw 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/nkkghk294z3ew28kc5e7 1350w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5yjo5BuT5hxkppjBg/g24443rfvkmdfkla6usa 1482w\"></figure><p>My guess is Open Phil is covering this, but my guess is there is a bunch of additional risk that funds you receive right now would become part of this settlement that donors should be able to model.</p><p>My guess is you can't talk about this for legal reasons in a post like this (though that does seem sad and my guess is you've been too risk-averse in the domain of sharing any information in this space publicly), but seems important for people to know when someone is assessing what is going on with EV and CEA.</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "3GfWR89Qxy4BGGro4", "postedAt": "2023-11-21T01:24:18.433Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Some quick thoughts:<br>- I'm continue to be thankful to the staff at CEA and hope the team good luck going forward, especially around the new ED and whatever direction that might bring.<br>- I think it's unhealthy for the ecosystem for CEA to get such a high ratio of funding from OP. When this happens, I assume that CEA adjusts to represent the interests of OP more than I'm comfortable with. As such, I'm excited by other donors becoming involved here.<br>- At this point, I'm probably most excited about \"long term institutional health\" improving than anything else. Between FTX, some of this OpenAI fiasco, and other issues, I think that the \"EA Bureacracy\" has some maturing to do. If there are ways that CEA could help here (maybe by reinforcing/helping the community health team, or with some project like [these](https://forum.effectivealtruism.org/s/jxBRTDWZZYBbknuGK/p/Cvn6fwzdoLNLgTJif), I'd be most optimistic, though I realize these are tough to do well.<br>- It seems tricky to raise money while waiting on a new ED, but so it goes.<br>- I'm happy you provided BOTECs, but these strike me a bit like toy examples. Also, of course, happy to see Squiggle used! (I'm biased, of course). I'm not sold on the use of Shapley values for the first one - I'm personally not a big fan of Shapley values for these things - but this is a smaller point.<br><br>&gt; we think that a more detailed model would obscure more than enlighten<br><br>I realize this might be controversial, but I'd be excited about a world where CEA posts generic costs+benefits of all of the big programs. I wouldn't fault CEA, as no one else does this yet, but I think some of this would be very useful, though perhaps too confrontational.&nbsp;</p><p>Anyway, again, I'd really like to see CEA do well in the future, and would encourage motivated donors to ideally work with them to help make that happen. I'd be most excited about active donors who could really help give feedback on initiatives and help provide a contrasting viewpoint to OP.</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "sDnxXwkkXtfAy4GJE", "postedAt": "2023-11-21T01:53:16.729Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>EV US just signed this; EV UK is a separate legal entity and presumably is not party to this agreement. But perhaps EV UK never received any money?</p>", "parentCommentId": "5yjo5BuT5hxkppjBg", "user": {"username": "Larks"}}, {"_id": "t6ewwpze5E8RWKsP8", "postedAt": "2023-11-21T02:47:01.715Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>For tax reasons, it would likely make sense to funnel donations from a US corporation to the US organization. So EV UK not receiving any money directly wouldn't surprise me at all. The US org could presumably re-grant it to the UK org if needed, following the usual rules for international grantmaking by 501(c)(3)s.</p>", "parentCommentId": "sDnxXwkkXtfAy4GJE", "user": {"username": "Jason"}}, {"_id": "enrsBYQYdwSdTs6zt", "postedAt": "2023-11-21T02:53:39.173Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>On the last paragraph, I would note that the settlement isn't effective unless and until approved by the court (although such approval is extremely likely). Most likely, the lawyers will urge radio silence until the time to appeal the bankruptcy judge's order to the district judge has passed (generally 14 days, see <a href=\"https://www.law.cornell.edu/rules/frbp/rule_8002\">Bankruptcy Rule 8002</a> for exceptions). An appeal would be very unlikely in my opinion.</p>", "parentCommentId": "5yjo5BuT5hxkppjBg", "user": {"username": "Jason"}}, {"_id": "j4iowLKr4iTNeWmKN", "postedAt": "2023-11-21T04:21:22.002Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<blockquote><p>If you disagree with the priorities of major EA donors (notably, if you want CEA to be less GCR-focused than OP’s GCRCB team), you may wish to donate to CEA to preserve funder diversity.</p></blockquote><p>In most scenarios, the benefits of a marginal increase in funder diversity seem rather modest in comparison to the opportunity costs. At present, OP would be ~ $22.6MM of a $28.2MM budget, with other established donors at ~ $2MM and a funding gap of ~ $3.6MM. In other words, depending on how much of the gap was filled, OP would be funding somewhere between 80 and 92% of the budget. &nbsp;Where the actual percentage is within that range has ~ zero impact on my assessment of COI risk, and not too much more impact on my assessment of its potential influence on CEA more generally. (Of course, some of the \"other\" donors are also GCR-focused, and so do not contribute to funder diversity from a cause-area perspective.)&nbsp;</p><p>Stated metaphorically, this feels like rearranging deck chairs on the Titanic. I think the effect of funder diversity may be very roughly exponential between 0% and ~50%,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref7ahp7f549t9\"><sup><a href=\"#fn7ahp7f549t9\">[1]</a></sup></span>&nbsp;but in the sense that the effect may be \"almost imperceptable\" at 8% and \"very modest\" at 20%.</p><p>Moreover, it's not clear that if I hypothetically had $1MM to donate this year (I don't!), that doing so while identifying strongly as a non-GCR donor would generate any appreciable shift in the focus of CEA's work as a result of marginally increasing funder diversity. I'm sure hypothetical me could earmark those funds, but money is fungible. I'm not sure I am getting much \"vote\" for my $1MM.&nbsp;</p><p>On the other hand -- given that non-GCR meta seems much more thinly funded than GCR and GCR-leaning meta -- $1MM could have a pretty significant effect if the donor figured out a way to counterfactually increase non-GCR meta spending by other organizations by most of $1MM. So the opportunity cost of improving CEA's funder diversity to a donor interested in non-GCR meta seems fairly high. This may be even more so at the $100K point, which would still be a pretty significant donation to (e.g.) Probably Good.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn7ahp7f549t9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref7ahp7f549t9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>50% is a stand-in for the point at which the organization could perceive itself as substantially continuing to exist without the predominant donor's support. I'm hazy on what <i>substantially</i> means here; obviously, it would involve a lot of downsizing but would be significantly more than the minimum viable organization.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "dehLnCGcdSfyjnnZK", "postedAt": "2023-11-21T08:47:41.231Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<blockquote><p>\"The past few years seem to have proven the value of the EA community\"&nbsp;</p></blockquote><p>This is the second CEA post to make claims like this without mentioning the FTX fraud.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "yvxQkpbgwLiSHLv3F", "postedAt": "2023-11-21T09:16:42.353Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Perhaps the thinking was that FTX is not <i>directly</i> relevant to this specific post?<br><br>But I agree, clearly FTX is on the minds of many people reading this, so avoiding the elephant in the room is not working.</p>", "parentCommentId": "dehLnCGcdSfyjnnZK", "user": {"username": "Minh Nguyen"}}, {"_id": "PACufzvxRAYCBo5Fn", "postedAt": "2023-11-21T09:34:05.095Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>I have no idea what to make of this legal speak, but just the next memo (number 3746) mentions EV UK and some settlement for $4MM<br><br><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/y3unqpguune16igpwqxw\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/qtdhs5m9b11xw3wgtxlz 150w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/qmmh5mmup99nr9p8kgqh 300w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/p60rnfrhtusmgen0str6 450w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/w1wjio7xlhfzbfososy9 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/gn4gzsclmact1dwfogdk 750w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/dcg8bopmuycqyvai2f4d 900w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/tfy6x1jnymxqw3fojrl8 1050w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/gxahndossiirwu2fbscd 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/pgpvfr9yngplfs0hbtqk 1350w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PACufzvxRAYCBo5Fn/ngbtael2ogipfnbfrkt3 1432w\"><br><br>If anyone can explain what this means that would be great</p>", "parentCommentId": "t6ewwpze5E8RWKsP8", "user": {"username": "m(E)t(A)"}}, {"_id": "7Rzjj2JNiriuyDy4G", "postedAt": "2023-11-21T09:38:44.087Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>FTX is highly relevant to this post in all sorts of ways. Aside from that, sentences like the one I quoted are profoundly weird.&nbsp;</p>", "parentCommentId": "yvxQkpbgwLiSHLv3F", "user": null}, {"_id": "rwkbpo2NtGtYj3MAz", "postedAt": "2023-11-21T12:17:01.705Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Leaving all other pro or con arguments for this funding opportunity aside for the purpose of this comment, I think the opportunity cost argument here is really strong.&nbsp;<br>$3.6m is about the amount it would take to cover 100% of Charity Entrepreneurship and 100% of Probably Good's yearly budget, as well as 50% of Giving What We Can's yearly budget.&nbsp;<br>Comparing that to the effects of adding donor diversity to a 80-90% longtermist supported org, it seems really hard to make the case for this being the best investment if the main reason you are interested in this opportunity is to diminish EAs focus on longtermism.</p>", "parentCommentId": null, "user": {"username": "Mm"}}, {"_id": "k6cKdmDdksZmcfLna", "postedAt": "2023-11-21T12:26:08.797Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Good catch! Yes, that's a notice of proposed settlement. At that dollar value, the parties have to give notice of the proposed settlement (but not a copy thereof) and a short period for anyone to object. If no one does, they can execute the settlement -- I believe without further public notice.</p>\n<p>Here, it looks like the proposed settlement is for about 90 percent of the high end of the potential claim value listed.</p>\n", "parentCommentId": "PACufzvxRAYCBo5Fn", "user": {"username": "Jason"}}, {"_id": "puB6HqBHCELxBHAbJ", "postedAt": "2023-11-21T14:29:49.335Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Ah yeah, I would be surprised if this was the main motivation of many donors. I expect that most of our donors donate because they like our work and want to see more of it, e.g. they want Boston to have a paid organizer, and that currently seems like a thing that would not happen without further donations.</p>", "parentCommentId": "rwkbpo2NtGtYj3MAz", "user": {"username": "Ben_West"}}, {"_id": "e4saQ6PHKtjFs82mt", "postedAt": "2023-11-21T14:37:24.004Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Yep, I ~agree – I think people should mostly be donating because they want to fund things like what was listed as the counterfactual projects (e.g. an organizer in Boston).</p>", "parentCommentId": "j4iowLKr4iTNeWmKN", "user": {"username": "Ben_West"}}, {"_id": "HbRsAT7rs9iebEodq", "postedAt": "2023-11-21T15:27:05.440Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<blockquote><p>I'd be excited about a world where CEA posts generic costs+benefits of all of the big programs. I wouldn't fault CEA, as no one else does this yet, but I think some of this would be very useful, though perhaps too confrontational.&nbsp;</p></blockquote><p>&nbsp;</p><p>Agreed that this could be very useful. It could also (as I argued <a href=\"https://forum.effectivealtruism.org/posts/hDNpHEA2Kn4xBoS8r/impact-evaluation-in-ea?commentId=LzxtKedsye2J7syt3\">here</a>) be useful to have more such models produced by <i>independent</i> evaluators.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0qtlvwihj3z\"><sup><a href=\"#fn0qtlvwihj3z\">[1]</a></sup></span></p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0qtlvwihj3z\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0qtlvwihj3z\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Although, I also think there is value in seeing models from the orgs themselves for ~ reasoning transparency purposes.</p></div></li></ol>", "parentCommentId": "3GfWR89Qxy4BGGro4", "user": {"username": "David_Moss"}}, {"_id": "f2bCyndoH8N9k5PPB", "postedAt": "2023-11-21T16:43:30.219Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Has CEA ever solicited funding from Open Phil's Global Health and Wellbeing team and/or does CEA have plans to do so? If not, why not?&nbsp;</p><p>IMO a world where CEA got e.g. 50% of its funding from OpenPhil's GCR team and 35% of its funding from OpenPhil's GHW team would be vastly preferable (due to incentives being better aligned with the broader community) to CEA getting 80% of its funding from OpenPhil GCR. &nbsp;</p>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "tmayu3vqJpdL4znby", "postedAt": "2023-11-21T17:50:37.674Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>$110,000 for a single community builder in Boston seems awfully high?&nbsp;<br><br>I'm guessing this is meant to include budget for event delivery on so on, but I think it would be worth being explicit in that given the perception at times of very liberal spending within community-building and that this is cited as an example of a marginal donation to CEA.</p>", "parentCommentId": null, "user": {"username": "ben3536"}}, {"_id": "7xDvTBGaMRkAH6DEp", "postedAt": "2023-11-21T18:54:43.858Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Thanks for flagging! New donations won’t be used for this settlement. The funding for the settlements has already been secured, and none of EV’s projects will need to allocate any additional funding. Besides funding that came from FTX, no funds that have previously been donated to a specific project will be used as part of this settlement.</p><p><a href=\"https://forum.effectivealtruism.org/posts/4wNDqRPJWhoe8SnoG/cea-is-fundraising-and-funding-constrained?commentId=enrsBYQYdwSdTs6zt\"><u>As noted by Jason</u></a>, the EV US settlement remains subject to court approval, and we won’t be commenting on it further while the settlement process is still underway. With that being said, we didn’t want any misunderstandings to disrupt CEA’s fundraising efforts in the meantime.&nbsp;</p>", "parentCommentId": "5yjo5BuT5hxkppjBg", "user": {"username": "Zachary Robinson"}}, {"_id": "4tcECCSdmHEir3GDP", "postedAt": "2023-11-21T19:08:21.407Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Presumably the line item includes not just what we would think of as salary but at least tax contributions, cost of health , insurance, and other benefits, possibly event etc. costs, and possibly an internal charge for operations overhead. The latter is common in many contexts -- e.g., if you're a professor, your university may \"charge\" you a 10 percent overhead contribution.</p>\n<p>Agree that it would be good to see a little more breakdown.</p>\n", "parentCommentId": "tmayu3vqJpdL4znby", "user": {"username": "Jason"}}, {"_id": "pKDXDs9qZ3ZNLHJBS", "postedAt": "2023-11-21T19:19:53.583Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>For sure! Though my rough take would this would add up to maybe $60-70k all in? (perhaps I'm undershooting average salary estimates based on UK numbers)</p>", "parentCommentId": "4tcECCSdmHEir3GDP", "user": {"username": "ben3536"}}, {"_id": "56AMNEkEhzDx2BcnN", "postedAt": "2023-11-21T19:57:16.918Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>That's a reasonable estimate to me, though I was guessing lower end of that.</p>\n<p>The qualifications/experience of the candidate, whether they'd have dependents who need health insurance, etc. are unknown so I assume we'd use expected value.</p>\n<p>I think my family's health insurance is ~28K for three people, mostly paid by my wife's employer. Would be slightly less if we used my employer's plan. About 40% of that for a solo. Dental and vision extra.</p>\n", "parentCommentId": "pKDXDs9qZ3ZNLHJBS", "user": {"username": "Jason"}}, {"_id": "95pFDpeXhKvz9xJue", "postedAt": "2023-11-21T23:52:37.586Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Yeah, this post is pretty heavily premised on the assumption that EA community building is good. If you do not share that assumption (e.g. because you think FTX makes EA net negative in expectation) then donating to CEA seems unwise. (Maybe it would have been clearer if I’d made that premise explicit, but I’ll leave it as-is now.)</p><p>My honest experience is that there is a set of donors who basically buy the \"talent is valuable, and if you ask people doing impactful work what influenced them, CEA is high on the list, so CEA is impactful\" argument, and for some of them FTX was an update but not enough to change whether CEA was above their funding bar. And there is another set who just entirely disagree with this line of reasoning, and for them CEA was never above the funding bar. I'm having difficulty thinking of many of the donors we interact with directly for whom FTX moved CEA from being above to below the funding bar, but if this describes someone reading this comment I would be&nbsp;<a href=\"mailto:ben.west@centreforeffectivealtruism.org\"><u>interested to hear from you</u></a>.</p><p>(Note that CEA staff have written a bunch of things about FTX, including&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/5YKx6xGg8qz6jLKvF/some-comments-on-the-recent-ftx-time-article\"><u>multiple</u></a>&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/SFAMvCxnEzaQHNeSL/how-has-ftx-s-collapse-affected-public-perception-of-ea\"><u>posts</u></a>&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/5mghcxCabxuaK4WTs/ycombinator-fraud-rates\"><u>from</u></a> me personally. Readers may also be interested in&nbsp;<a href=\"https://forum.effectivealtruism.org/s/jxBRTDWZZYBbknuGK\"><u>this investigation into EA reforms</u></a>.)</p>", "parentCommentId": "dehLnCGcdSfyjnnZK", "user": {"username": "Ben_West"}}, {"_id": "SGTEffuTLuK4g6fty", "postedAt": "2023-11-21T23:55:52.881Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>&gt;&nbsp;As such I think that your BOTECs are uninformative and might be \"hiding the ask\"</p><p>Thanks for the comment. Just to clarify right away: the Forum doesn’t have $2M room for more funding (it’s not the case that a huge portion of marginal donations would go to the Forum).</p><p>Responding in more detail:</p><p>I'm not sure I'm interpreting you correctly, but I think you are saying something like:</p><ol><li>I (Ben) give three examples of where marginal funding is likely to go</li><li>The first two of these total ~$400k, whereas the total cost of the forum is ~$2M</li><li>Therefore, we should expect that 2/2.4 = 83% of marginal funding will go to the forum</li><li>But only one of the two BOTECs was evaluating the cost-effectiveness of a forum project</li><li>This is 50% of the BOTECs covering 83% of the expenses, which is off (since 50% &lt; 83%)</li></ol><p>I think (3) (if that’s what you’re saying) has a few confusions:</p><ol><li>I expect the Forum to continue to get substantial funding from existing donors; it doesn't have $2M room for more funding</li><li>My three examples are not intended to be exhaustive, and the BOTEC-ed projects were chosen mainly because they seemed to have an EA Funds grant we could easily compare them to</li></ol><p>So I would expect that much less than 83% of marginal funding will go to the Forum.&nbsp;</p><p>I mostly want to delay a discussion about this until the post fully dedicated to the Forum, but as mentioned in this post, I'm interested in donors expressing a preference for their donations, and if you would like to donate to \"everything except the forum\" or something I would be interested to hear that.</p>", "parentCommentId": "5t4NFKXotsocDDaLm", "user": {"username": "Ben_West"}}, {"_id": "zDjj3kSSDmxmh54Kd", "postedAt": "2023-11-22T14:03:09.553Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Thanks Ozzie!</p><blockquote><p>I'd be excited about a world where CEA posts generic costs+benefits of all of the big programs</p></blockquote><p>Could you say more about what this looks like? In particular: are you suggesting that we pull together information that is already publicly available but spread out (e.g. metrics of how much we impact people are spread across various EA survey and OP LTist survey posts) versus publishing something which doesn't already exist (e.g. our internal estimates of the dollar value we should assign to those survey results)?</p>", "parentCommentId": "3GfWR89Qxy4BGGro4", "user": {"username": "Ben_West"}}, {"_id": "v8PKm3rR7qWZsHtqN", "postedAt": "2023-11-22T14:07:23.568Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Yep! We have solicited and received funding from Open Philanthropy’s Effective Altruism (Global Health and Wellbeing) program. We most recently worked together with them on an Effective Giving Summit earlier this year (funded by them and organized by our Partner Events team).&nbsp;</p><p>We have discussed whether they or other OP teams (other than GCRCB) would be interested in funding CEA. While I don’t want to speak for them, my (briefly summarized) understanding of why we have had more success with GCRCB is because they have a higher willingness to pay for talent.</p>", "parentCommentId": "f2bCyndoH8N9k5PPB", "user": {"username": "Ben_West"}}, {"_id": "hxYE4hcFCaLtsb9yZ", "postedAt": "2023-11-22T15:21:16.682Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Many of CEAs projects seem nicely split up. (Events, Community Health, Groups).</p><p><strong>Costs</strong></p><p>I could imagine a list of the money / counterfactual costs spent on each. A bit tricky, but doable. You'd have to include overhead, of course.<br><br><strong>Benefits</strong><br><br>Very simple models of the value of each project. These could be in some kind of relative value, so we could at least tell things like, \"Project X seems to be more valuable in total than Project Y, though less efficient\"<br><br>Even relatively simple versions of this could be illuminating and help for making consensus.&nbsp;<br><br>I'd be happy to put together a simple potential version of this if that could be useful. It could make sense for it to be private (within the org) for a while, maybe a long time, if you don't have internal accounting like this already.&nbsp;</p>", "parentCommentId": "zDjj3kSSDmxmh54Kd", "user": {"username": "oagr"}}, {"_id": "7FxeSDzFztXQSFbgh", "postedAt": "2023-11-22T16:22:36.129Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>My objection was specifically to the claim that \"the last few years have proven the value of the EA community\" which is an absurd thing to say given the FTX debacle.&nbsp;</p><p>It's also odd to ask for money without explaining why you have a funding gap, what role CEA played in FTX, whether it could have done better, what has changed etc</p>", "parentCommentId": "95pFDpeXhKvz9xJue", "user": null}, {"_id": "RvQiAaLkb5tFzY525", "postedAt": "2023-11-24T10:33:16.467Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Hi, I’m the CBG manager at CEA and happy to explain how we came to this amount.&nbsp;</p><p>This&nbsp;$110,000 does indeed include a block grant of $20,000 that is intended to cover all non-salary costs, such as event costs and general operating expenses. Some non-salary costs in the past have included: venue rent, retreat costs, travel compensation for volunteers, and small regrants to local (student) groups.&nbsp;</p><p>The remaining $90,000 is intended to cover the personal grant and should fund all employment related costs, such as taxes, social security contributions, and other benefits. And the gross salary itself of course, which will be lower than the personal grant because of all the other employment costs.&nbsp;</p><p>We adjust the personal grant based on cost of living and $90,000 is our upper bound, defined as the CoL of San Francisco. Boston has a lower CoL than San Francisco so the personal grant will likely be lower than $90,000. We generally follow our personal grant formula, but infrequently make exceptions for exceptional candidates so I have included the upper bound in this ask.&nbsp;&nbsp;</p><p>I don’t know exactly how much would be deducted from the personal grant for employment related costs and other benefits in Boston, but taking the cost of living adjustment into account I would guess the actual gross salary would be on the lower end (or slightly below) the shared range above.&nbsp;</p><p>We have come to these policies as we think CBG’s work is really impactful and often people who would do the best job have high opportunity costs. It’s probably worth noting that salaries in the US are generally higher than in the UK/Europe and we would like to compensate our grantees decently.&nbsp;</p><p>We have re-evaluated the granting formula this spring and decided to neither increase nor decrease the personal salary grant. Grantees can decide to take a voluntary salary reduction and some have done this but I prefer this to stay a personal choice.&nbsp;</p>", "parentCommentId": "56AMNEkEhzDx2BcnN", "user": {"username": "Naomi N"}}, {"_id": "h6kP5CG78HujyQobF", "postedAt": "2023-11-24T14:00:28.775Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Yes this would be amazing! We're trying to do something similar with EA Netherlands.&nbsp;</p>", "parentCommentId": "hxYE4hcFCaLtsb9yZ", "user": {"username": "James Herbert"}}, {"_id": "iwssjoK6urNdqJhWo", "postedAt": "2023-11-24T14:22:51.587Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>For extra info, here's my personal situation.</p><p>In Feb this year, CEA granted me EUR 89,905 as part of the CBG programme. USD 20,000 of that is for 'operational costs'. At EAN we treat this 20k as 'money we can freely spend without having to apply for a grant' — for example, software tools, organiser retreats, etc.&nbsp;<br><br>Once taxes are paid, I get EUR 3,167.75 in my account every month. And then in May I also get my <a href=\"https://business.gov.nl/regulation/holiday-allowance/\">holiday allowance</a>.<br><br>I need to pay my pension from that 3.1k. I haven't set this up yet (I know, I know, very bad) but, if I remember correctly, this should be around EUR 600 every month.&nbsp;<br><br>For context, at my previous job (well paid but I wasn't optimising for income), I received EUR 3,533.25 every month, I didn't have to pay anything towards an additional pension, I worked 4 days a week, and I had 34 days of holiday per year (I now have 25). This was a very good deal. For further context, according to a <a href=\"https://talentup.io/blog/average-salary-netherlands/#:~:text=In%202023%2C%20the%20average%20salary,education%2C%20experience%2C%20and%20location.\">quick google</a>, the median net monthly income in NL is EUR 2,152.<br><br>P.S. Until I started writing this I'd forgotten how good my old job was... I hope this doesn't come across as me complaining, I'm more than happy with my compensation, I just wanted to give an idea of what a CBG gets in return for their work.</p>", "parentCommentId": "RvQiAaLkb5tFzY525", "user": {"username": "James Herbert"}}, {"_id": "BsEZntzoNxPfqFJEt", "postedAt": "2023-11-24T16:13:57.351Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Can you say why you think it's absurd? A lot of people doing seemingly impactful work say that the EA community substantially helped them (<a href=\"https://forum.effectivealtruism.org/posts/4wNDqRPJWhoe8SnoG/cea-is-fundraising-and-funding-constrained#The_basic_case_for_CEA\">see above</a>). The arguments I know of which claim that the harms from FTX outweigh this deny the assumption that EA work is actually impactful (specifically: they usually say something like 1. AI is the only thing that matters, and 2. EA work on RLHF etc. sped up capabilities more than safety, making the average impact small/negative).</p><p>If this is your view than fair enough, but it's not one that I (or, I think, most people) share.</p>", "parentCommentId": "7FxeSDzFztXQSFbgh", "user": {"username": "Ben_West"}}, {"_id": "jMfTJ4uMG59QfdgmA", "postedAt": "2023-11-25T00:59:24.497Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Yeah, good catch, my argument has a bunch of unstated assumptions.</p><p>I think I'm saying something with an additional twist, which is: because I think that the marginal value forum funding is <strong>so</strong> low, I think the correct move is to not support CEA at all.</p><p>Consider CEA as having (numbers here are arbitrary), a core of $15M in valuable projects and $20M in \"cruft\"; projects that made sense when there was unlimited FTX money around but not so much now. Open Phil, seeing this, reduces funding from $35M/year to $30M, to force CEA to cull some of that cruft.</p><p>In response, CEA could protect that cruft by committing to using a \"<a href=\"https://wikiless.nunosempere.com/wiki/Washington_Monument_syndrome?lang=en\">Washington monument strategy</a>\", i.e., putting more valuable projects on the chopping block first, and asking the community for an additional $5M to save them.&nbsp;</p><p>Note that this here is an \"<a href=\"https://www.lesswrong.com/posts/PrCmeuBPC4XLDQz8C/unconscious-economics#comments\">unconscious economics</a>\" type argument, i.e., I am not saying that you are twirling your mustache saying \"oh yes, we will do a Washington monument strategy\". I merely think that you are just failing to cut cruft, in a way which is understandable because letting go of people, and having people lose reports is hard. But by asking people for funding when you have some projects whose value is less than the value of marginal funding of projects outside of CEA, and not putting them on the chopping block, you do end up doing something functionally similar to a Washington monument strategy.</p><p>I think the answer to a Washington monument strategy is to call the bluff, and then iteratively converge to a funding amount for CEA that makes sense, and a scenario where CEA becomes smaller. This could involve other people taking over projects that CEA doesn't fund, and Open Phil looking at the remaining projects and reducing its funding further, etc.&nbsp;</p><p>Some stuff which would really change my mind:</p><ul><li>Comparing the number of CEA employees before and after FTX, and seeing that it's the same or lower</li><li>Comparing the budget of CEA before and after FTX and seeing that it's actually the same or lower</li></ul><p>Taking a step back, I am suggesting that you fire a bunch of people. Might be all well and good in abstract terms but these are real people who have invested a bunch of their career capital at CEA. Maybe one way to make this less painful would be to give them exit grants with which they could attempt some altruistic project of their own, or get some runway before finding another place to work at.</p>", "parentCommentId": "SGTEffuTLuK4g6fty", "user": {"username": "NunoSempere"}}, {"_id": "RzzAL2v5akb3gBibE", "postedAt": "2023-11-25T01:12:47.808Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Thanks for the clarification, but I'm still not sure I understand. I think your argument is:</p><ol><li>CEA has projects that are worth funding (say, arbitrarily, our comms team)</li><li>Additionally, we have projects that are not worth funding (in particular: the Forum)</li><li>However to make the case for marginal funding stronger we are presenting the stuff that's worth funding as \"marginal\", and stating that the stuff that's not worth funding isn't \"marginal\".</li></ol><p>Is that correct?</p><p>If so, I'm confused because the Forum is included in the list of marginal projects, which seems to violate (3).</p><p>Maybe alternatively you are saying:</p><p>3'. To make the case for marginal funding stronger we are presenting BOTECs about projects other than the Forum</p><p>But again this doesn't seem right to me because one of the BOTECs was about the forum.</p>", "parentCommentId": "jMfTJ4uMG59QfdgmA", "user": {"username": "Ben_West"}}, {"_id": "Tgddw3FScpRjy2s5s", "postedAt": "2023-11-27T11:46:07.607Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<blockquote><p>one of the BOTECs was about the forum</p></blockquote><p>I don't think you can justify a $2M/year expenditure with an $11k/year BOTEC ($38/hour * 6 hours/week * 52 weeks), because I think that the correct level at which expenditure in the forum should be considered marginal is closer to $1M/year than $10k/year.</p>", "parentCommentId": "RzzAL2v5akb3gBibE", "user": {"username": "NunoSempere"}}, {"_id": "jmG3r3CyBrxP63jpG", "postedAt": "2023-11-27T23:40:33.940Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>I feel like you're comparing the marginal benefit of CEA, to the total benefits the other groups.<br><br>I'd guess that much of CE's and GWWC's core needs will be met, so the more relevant ask might be the remaining parts where there's some uncertainty.&nbsp;<br><br>(Not saying this change is enough to change one's decision, but flagging that I think the default comparison is unfair)&nbsp;</p>", "parentCommentId": "rwkbpo2NtGtYj3MAz", "user": {"username": "oagr"}}, {"_id": "DGhugrf6gRPE9zET7", "postedAt": "2023-11-28T10:37:08.596Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>CEA’s spending in 2023 is substantially lower than in 2022: down by $4.8 - 5.8 million.</p><p>The graph below shows our budget as it stood early in the year, reflecting our pre-FTX plans, and compares that to how our plans and spending have evolved as we’ve adapted to the new funding environment. This has happened during an Interim period in which we’ve tried where possible not to make hard-to-reverse changes that constrain the options of a new CEO.</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DGhugrf6gRPE9zET7/wngac4y6zau7cnnzzpkd\"></p><p>We currently have the same number of Core staff that we did at the end of 2022 (37), but staff costs are a relatively small proportion of our overall spending (around 20% in 2023).</p><ul><li>For example,&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/n5GJEP3tMrzdfYPGG/how-much-do-eags-cost-and-why\"><u>we spend a lot on events, and have cut a lot of event spending</u></a>, but largely by reducing passthrough costs rather than by firing people from what is already a small team relative to the scale of its activities.</li><li>In contrast, the costs of the Online team responsible for the Forum are much more staff-heavy, and we don’t have plans to replace several people who left the team this year. We did recently hire&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/tAkjzibNFaFYLHAMA/hello-from-the-new-content-manager-at-cea\"><u>one new person</u></a> to work on Forum content.</li><li>It’s also worth noting that we postponed as much hiring as we could during our ongoing Interim period, so we expect our total number of staff to increase in 2024 relative to today’s benchmark. We expect that increasing staff costs as a proportion of our spending will increase the quality and cost-effectiveness of our programs.</li></ul>", "parentCommentId": "jMfTJ4uMG59QfdgmA", "user": {"username": "Oscar Howie"}}, {"_id": "eux6uTeYKYgQAmvsv", "postedAt": "2023-11-28T23:02:04.988Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Nice, do you have your costs and staff numbers for 2021?</p>", "parentCommentId": "DGhugrf6gRPE9zET7", "user": {"username": "NunoSempere"}}, {"_id": "MYakTKrjZkm8CdnR3", "postedAt": "2023-11-30T16:09:11.226Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>In 2021, we spent $6.9m and ended the year with 29 staff. This is not an apples-to-apples comparison, because those staff include five members of what was then the CEA ops team, and is now the EV Ops team, so the more direct comparison is with 24 staff at that time.</p><p>You can see on our&nbsp;<a href=\"https://data.centreforeffectivealtruism.org/\"><u>dashboard</u></a> some of the ways our programs have changed since 2021 (three in-person EAG events compared to one, nine EAGx events compared to zero, etc).</p>", "parentCommentId": "eux6uTeYKYgQAmvsv", "user": {"username": "Oscar Howie"}}, {"_id": "5Pj3pSqNDk4TuYMji", "postedAt": "2023-11-30T17:41:45.099Z", "postId": "4wNDqRPJWhoe8SnoG", "htmlBody": "<p>Thanks for clarifying this! I agree with <a href=\"https://forum.effectivealtruism.org/posts/4wNDqRPJWhoe8SnoG/cea-is-fundraising-and-funding-constrained?commentId=j4iowLKr4iTNeWmKN\">Jason’s point</a> that the percentage of CEA’s funding coming from OP’s GCRCB team is high enough that the exact figure doesn’t really change the incentives much. But I’m very glad that CEA has made the effort to try and diversify OP’s funding.</p><p>I do want to flag that if your understanding is correct, it seems quite bad/weird that the incentives/priorities/strategies of the most important EA community building organization are significantly (mainly?) influenced by differences in “willingness to pay for talent” between OP’s GCRCB and GHWCR teams.</p>", "parentCommentId": "v8PKm3rR7qWZsHtqN", "user": {"username": "AnonymousEAForumAccount"}}]