[{"_id": "XsAXkTqAnCG3B3s4H", "postedAt": "2023-09-19T14:09:55.076Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>Disclaimer: I sometimes work with Brad and I founded a PFG so I am biased towards thinking PFG's can work.&nbsp;<br><br>There's some more red teaming in the comments of a quick take I did about the fundraising round that the PFG I founded is going through. That's <a href=\"https://forum.effectivealtruism.org/posts/ufmRBzscMnBkyYxSc/vincent-van-der-holst-s-quick-takes?commentId=vit94vtX43CizeCjS\">here.</a><br><br>We also did a red teaming session on Profit for Good at EAGxRotterdam. This was filmed but unfortunately never released (I think the video person literally said they lost the recording :/).&nbsp;<br><br>Generally the biggest reasons against Profit for Good, based on my experience of founding one called BOAS:<br>- Raising capital is (at least currently) harder. It's hard for me to put a number on it but I'd say it's at least 3 times less likely you'll receive funding.&nbsp;<br>- You will raise less capital and slower than the competition so they might outcompete.&nbsp;<br>- Legal issues. Depending on the country there's not set company structure for this.&nbsp;<br>- Lack of capital means you cannot retain talent (based on my experience getting talent is easier as a PFG) as easily as having deep venture capital funded pockets.&nbsp;<br>- Lack of understanding of stakeholders: generally a lot of people assume PFG's cannot scale because they donate profits. It's important people understand PFG's can reinvest profits just like regular for-profits.&nbsp;<br>- Status quo bias: just because people think it hasn't been done (it has, but people don't generally know that) they assume it cannot be done, even when presented with arguments (e.g. the successful PFG's already out there and the research on them).&nbsp;<br>- Some people argue that people are selfish and founders start companies to get rich, so they wouldn't want to start/run PFG's. Based on our founder pipeline it suggests the opposite. It was full of people who could make more money doing less work, and many applied <strong>because </strong>we were a PFG, not in spite of.&nbsp;</p>", "parentCommentId": null, "user": {"username": "BOAS"}}, {"_id": "KiC63xjx6rhY7eNLe", "postedAt": "2023-09-19T14:19:16.904Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>Please note that the arguments from the quick take are in the document under appropriate headings.</p>\n", "parentCommentId": "XsAXkTqAnCG3B3s4H", "user": {"username": "Brad West"}}, {"_id": "xG5ZdMNYiqT5zqhog", "postedAt": "2023-09-19T14:35:17.858Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>I just saw they are. For those interested, I provided comments to the red teaming working document.&nbsp;</p>", "parentCommentId": "KiC63xjx6rhY7eNLe", "user": {"username": "BOAS"}}, {"_id": "DpuJGtXxZpByFS8ud", "postedAt": "2023-09-19T17:59:19.883Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>The response partially addresses what was intended by my comment. Perhaps I was not complete enough in the original comment.</p>\n<blockquote>\n<p>Note that If the big companies are differentiated in some way (like 'monopolistic competition' suggests, there could be a substantial cost to consumers (and to efficiency) to choosing the 'charity supporting brand'</p>\n</blockquote>\n<p>With monopolistic competition, consumers have different tastes or 'locations' and firms enter with differentiated products (or in 'different locations'). Each firm ends up with some market power and thus charges a price that is ex-post, too high. However, there is a cost of entry, so firms enter until the final firm gets 0 economic profit.</p>\n<p>My thinking was that for those who favor the charitable firm, that charitable firm might not be the one 'closest to me' ... so I might end up travelling further to reap the 'charitable benefit', but with a transportation cost (or analogously, a 'product differs from my preference') cost that might counteract that benefit.</p>\n<p>The response was ~that some products are basically undifferentiated and have no or low entry costs/fixed operating costs.  But if there is free entry, why should we expect there to still be profits in such industries?  (You can come up with some reasons, but it might be hard to do this without a 'differentiated product' after all.)</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "LAeH7ch4WDLjE6Cgn", "postedAt": "2023-09-19T18:01:24.668Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>I think some of my other critiques and suggestions (note I am fairly positive on this idea, just trying to red team in a helpful way) were not addressed.  Will list in separate comments to enable discussion.</p>\n<ol>\n<li>Low-lying-er fruit: Why not (first) target billionaires who are <em>already</em> philanthropists and who own consumer facing companies, and encourage them to market their products in such a way? Seems easier, higher value, less risky, quicker than trying to start new companies?</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "qd2qnACXd8q4GP4fw", "postedAt": "2023-09-19T18:02:42.444Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<ol start=\"2\">\n<li>Shouldn't we be concerned that consumers who think they are 'donating' through these product purchases will reduce their other charitable giving?</li>\n</ol>\n<p>[I think there's a good response to this, but it seems worth addressing explicitly.]</p>\n", "parentCommentId": "LAeH7ch4WDLjE6Cgn", "user": {"username": "david_reinstein"}}, {"_id": "veDGfmohfPqfzkxhT", "postedAt": "2023-09-19T18:06:44.112Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>Was this not argument #7? I think the giving by proxy research addresses it and I don't see much reason to believe the net effect on other giving would be negative rather than positive.</p>\n", "parentCommentId": "qd2qnACXd8q4GP4fw", "user": {"username": "Brad West"}}, {"_id": "g7duAkXis85LNErYy", "postedAt": "2023-09-20T00:30:36.097Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>To be clear, the Patagonia method of a PFG coming to exist (the founder and vast majority shareholder donating stock to a charitable trust or foundation) would be excellent.</p><p>We would certainly encourage any very rich, philanthropic people to turn their businesses into PFGs. For instance, if <a href=\"https://forum.effectivealtruism.org/users/dustin-moskovitz-1?mention=user\">@Dustin Moskovitz</a> wanted to buy back sufficient Asana stock and put an amount above 90% into a philanthropic trust benefiting EA charities, that would be great.</p>", "parentCommentId": "LAeH7ch4WDLjE6Cgn", "user": {"username": "Brad West"}}, {"_id": "dWB26nMPkrE2YKewt", "postedAt": "2023-09-20T18:37:54.508Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>👋 just the same one I <a href=\"https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the?commentId=jvijkn4qKCi4o72fX\">brought up previously</a>, which is that being for-profit probably provides a massive fitness benefit in the Darwinian world of business. I have some theories about what that fitness advantage is -- I favor the advantages brought by the opportunity to raise startup capital by offering early investors potential outsized rewards -- but the truth is I don't know, because I've never run a business, and I've never been part of a massively growing business. Have you?&nbsp;</p><p>Elsewhere, <a href=\"https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the?commentId=p8FpRiJcNeREoMAQx\">you say</a> \"The only thing keeping such firms from thriving and offering a huge multiplier opportunity is that we haven't created an environment of public awareness of the opportunity.\" I am afraid that this is not so self-evident to me as it is to you. The only credible way to prove this point is to go out and do it, until then, it makes sense to presume a fitness advantage for companies doing things the traditional way.&nbsp;</p>", "parentCommentId": null, "user": {"username": "setgree"}}, {"_id": "H8jYbwBsKcmpxespP", "postedAt": "2023-09-20T19:12:57.715Z", "postId": "4wqZeJfDhwvkLLm4a", "htmlBody": "<p>Currently many successful firms exist where large ownership stakes are separate from involvement in management.</p>\n<p>Sure, incentives derived from high equity by founders/early employees is a factor in some contexts, like startups. It isn't clear that PFGs couldn't offer similar incentives, for instance by offering high money buyout provisions.</p>\n<p>You refer to an ostensibly indispensable \"fitness advantage\" without considering that it isn't present in <em>existing</em> firms and similar incentives couldn't be replicated in a PFG context.</p>\n", "parentCommentId": "dWB26nMPkrE2YKewt", "user": {"username": "Brad West"}}]