[{"_id": "SAqsTifBuWMFcqrRF", "postedAt": "2023-05-15T10:54:59.599Z", "postId": "4xd2EPXZ8GeAoCQSi", "htmlBody": "<p>Wonderful initiative!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jia Tu"}}, {"_id": "WbLvQTZHhyG3bjjyv", "postedAt": "2023-05-15T11:33:28.077Z", "postId": "4xd2EPXZ8GeAoCQSi", "htmlBody": "<p>Awesome initiative, excited to read some of the entries. I hope this can be a springboard for higher levels of involvement and activate individuals and writers or writers to be in Africa.</p><p>Also, I think what could also go far in getting more African and other less represented individuals (in EA) to participate and engage more in the international EA space would be a funding pool/assistance specifically for getting individuals to conferences, there can often be issues with visas and funding.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Cameron.K"}}, {"_id": "Ho4TznDLE5zqyKkN6", "postedAt": "2023-05-16T03:56:26.526Z", "postId": "4xd2EPXZ8GeAoCQSi", "htmlBody": "<p>I strongly agree.&nbsp;</p><p>Funding seems quite tractable - there could be a fund specifically for assisting EAs from Africa to go to conferences.</p><p>On the visa assistance thing I'm not sure what would be very tractable - maybe there is some way these conferences could position themselves that would make it easier for Africans to get \"education\"-related visas rather than tourist visas (e.g., if EAG positioned itself as an academic conference somehow, would that enable people to apply under more lenient visa categories)?</p>", "parentCommentId": "WbLvQTZHhyG3bjjyv", "user": {"username": "Luke Eure"}}, {"_id": "LBsC7m9DEzxAcfZtf", "postedAt": "2023-05-16T13:55:38.482Z", "postId": "4xd2EPXZ8GeAoCQSi", "htmlBody": "<p>Very insightful</p>\n", "parentCommentId": "Ho4TznDLE5zqyKkN6", "user": {"username": "saline_A"}}, {"_id": "WnFFKS7fmAYq5NsHn", "postedAt": "2023-05-18T12:14:53.492Z", "postId": "4xd2EPXZ8GeAoCQSi", "htmlBody": "<p>This is insightful.. and would really go a long way in enhancing the participation of Africans and other less represented regions in EA activities if well implemented.</p>\n", "parentCommentId": "Ho4TznDLE5zqyKkN6", "user": {"username": "Chris Lah"}}]