[{"_id": "oWM9A3FRPcgX8MZkp", "postedAt": "2022-11-30T05:27:46.991Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>I just want to flag that I'm particularly excited about the paid board member positions. I think that having a designated board member or two be formally responsible to spend a solid chunk of time each month going through a list of check-ups, maintenance, and other sorts of duties, could be really promising. I look forward to working with whoever takes these roles to try to figure out how we think strong nonprofit boards should really work, when assisted with regular ongoing work.&nbsp;<br><br>There clearly is a lot to figure out in how to make charity boards go very well. If we can make this happen, I'd feel more confident in the future of RP. We could also take some of the lessons learned and recommend them to other EA organizations.&nbsp;</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "Ds5XkH6BHWxitKas7", "postedAt": "2022-11-30T06:06:34.101Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>In the past, I spoke to a Rethink Priorities board member about a project idea that nominally competed with RP (it was a certain kind of think tank). The board member and I then discussed the idea. This project idea was actually given by a respected Rethink staff member prior to this meeting.</p><p>The above seems good and seems like what we want. I think it is possible because we believe we are aligned in goals, and share trust and values.&nbsp;</p><p>As many know, board members are nominally legally obligated to maximize the interests of the non-profits they are working in, not the interests of EA or the EA cause area the organization works in.&nbsp;</p><p>In theory, changing the board could result in people who see things differently and act differently. It's not impossible a very impressive and strong board would change norms.</p><p>&nbsp;</p><p>I think written above is understood already. In the case of RP, I don't think this is a real danger. I wanted to say the above. Not everything in EA is unexceptional.</p>", "parentCommentId": null, "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "7cHvepd3Fy55v5gMP", "postedAt": "2022-11-30T07:18:06.340Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>I don't have a lot of experience with non-profit boards but I have been involved with boards of C corps so that's my bias in my suggestion / question: Is there an accounting firm that RP works with? Some modern accounting firms provide monthly financial reviews, partial CFO hours for budgeting and financial forecasting, HR, tax &amp; compliance support and their fee structure would work well with the paid board member type compensation. So maybe one thing to consider is adding an unpaid board member that can interface with professional external help that is compensated. Maybe there's already something like this in place so maybe this suggestion doesn't add much to help with what you might need. Just wanted to put it out there in case it's helpful.</p>\n", "parentCommentId": null, "user": {"username": "Sameer Halai"}}, {"_id": "EwKnPAsBwKG2QjMEJ", "postedAt": "2022-11-30T14:02:08.136Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>There's an academic literature (and caselaw) concerning what interests a board can/should consider when making decisions, and this may vary to some extent on state law. It can get tricky, but the scope isn't as narrow as some people may assume.</p>\n<p>Don't want to derail this thread, but I did feel I should flag the complexity on this topic for benefit of those who serve as board members.</p>\n<p>Hopefully organizations are offering good training / onboarding for board members, but I don't think that always happens. Maybe the community could think about funding webinars on nonprofit corporate governance and encouraging orgs to send new (or current) board members. Should be pretty cheap; the main cost would likely be the members' time.</p>\n", "parentCommentId": "Ds5XkH6BHWxitKas7", "user": {"username": "Jason"}}, {"_id": "hrwuAMBErfTr3ToEA", "postedAt": "2022-11-30T14:14:05.835Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>Strong upvote. I'd add that organizations should aim to have at least one -- preferably two or even three -- board members who are not \"full-time\" EAs. Diversity of perspectives is important -- for instance, a tech company's board should include people outside tech. It's an important way to mitigate the risk of groupthink that is inevitable in any tightly-knit community.</p>\n", "parentCommentId": "oWM9A3FRPcgX8MZkp", "user": {"username": "Jason"}}, {"_id": "XuqvxZCeWvSXyh3zc", "postedAt": "2022-11-30T19:17:36.411Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>One suggestion (which I offer as a general matter and not specifically to RP): At least in some jurisdictions, boards can delegate many of their powers and duties to committees of the board that can include some non-board members. (The board members should be a majority of the committee.) So if you have a board candidate who is really strong in one area -- say, they have tons of experience conducting performance evaluation of senior staff -- but isn't the best choice overall, you may be able to ask them to serve on a board committee that handles the thing they excel at.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "cRpYPtDHqbTKac3qH", "postedAt": "2022-11-30T21:40:51.023Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>This seems great and I appreciate your contributions.</p><p>It seems tough, but it would be useful if you or someone else shared information about this. This content could be academic legal content, or just as importantly public articles or statements from senior people working on non-profit boards that confirms this</p><p>Respectfully, I’ve talked with many lawyers of great quality, including on the board I was involved in. Overall, I’m worried of the substance or practicalities about this thread. I expect that most board members and officers and will just \"round down\" and obey the instructions in the documents they signed, which seemed quite unequivocal to me about conflicts.&nbsp;</p><p>On the object level, one complication is that like many, my non-profit was registered as both a 401k in the US, and also a charity in the UK. Things like layering on jurisdictions or other things probably increase the issues in practice, and seem impractical to attend to.&nbsp;</p><p>Other issues involve board dynamics (that increases with the activity of the board, that you principledly aim to increase). Based on my experiences, I think principled but \"de jure\" violations can be weaponized by opposing factions on a board.</p><p>The board member I spoke to at Rethink Priorities, was not at all the most junior board member, and clearly expressed concern about the conflict themselves. As mentioned above, the issue with advising was because the idea involved the creation of a new think tank, which seems like a clear conflict. This could be under the umbrella of Rethink Priorities, or not. The considerations about which way to do this are immensely complicated, and probably only understood by a small group of people with an enormous amount of context.&nbsp;</p>", "parentCommentId": "EwKnPAsBwKG2QjMEJ", "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "sYKHvvWdGt36qTW2W", "postedAt": "2022-11-30T21:41:18.007Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>(Not necessarily on the above project) I believe in theory, if it was net positive for impact, Peter, Marcus and Abraham would agree, and even use resources that don't directly improve Rethink Priorities, to help start a new think tank or other entity. In fact, as an EA, I would feel obligated to do so, if on balance it made sense.&nbsp;</p><p>I could easily see such actions being opposed by an outside, muscular, board member who has other visions for Rethink Priorities, who won't understand or care about the considerations. This might not be absolutely wrong, but would alter the EA landscape in complicated ways.&nbsp;</p>", "parentCommentId": "cRpYPtDHqbTKac3qH", "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "8jWT9aHLDL76AfRhp", "postedAt": "2022-11-30T21:52:06.374Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>I trust your intentions and your ideas seem extremely valuable</p><p>It would be good to get a description with deep understanding or causal relationships for how a larger board, board quality, or governance in general would have prevented the FTX collapse, especially in a deceptive environment, like FTX, where low quality efforts can be coopted. Famously, such <a href=\"https://www.washingtonpost.com/business/theranos-directors-pay-no-price-for-holmess-fraud/2022/01/04/858bc27c-6d95-11ec-b1e2-0539da8f4451_story.html\">cooption probably happened at Theranos</a>.&nbsp;</p><blockquote><p>I'd add that organizations should aim to have at least one -- preferably two or even three -- board members who are not \"full-time\" EAs.</p></blockquote><p>Just as importantly, it would be good to have a detailed understanding of how boards would be involved in improving EA org operation.&nbsp;</p><blockquote><p>Diversity of perspectives is important</p></blockquote><blockquote><p>It's an important way to mitigate the risk of groupthink that is inevitable in any tightly-knit community.</p></blockquote><p>Frankly, this recent governance thread on the forum, has traits that, from the outside, seem to reflect local online trends instead of substance. This can produce \"the wrong hill to climb\", wasting effort, disillusioning people, or be coopted.</p><p>To give a concrete sense of this issue, there is currently a post on the EA forum from an EA org looking for board members.&nbsp;</p><p>One of the commentators does object level work orthogonal to EA efforts, and seems to be one of the few people who understood to some degree the risks of FTX, and did not seek FTX funding or associations. Another commentor is a longtime EA, associated with the org, and like almost everyone else, did less to avoid FTX funding.</p><p>The person who avoided FTX gave a detailed comment that added in depth considerations to changing governance, and mentioned creating a novel new think tank.&nbsp;</p><p>On the other hand, the person more associated with the organization, gave a fairly generic positive comment. This is the response to the two comments.</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_116 116w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_196 196w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_276 276w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_356 356w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_436 436w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_516 516w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_596 596w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_676 676w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8b447bfd3d5b92c1250266f813f0582221fc76d941c9ad8d.png/w_756 756w\"></figure><p>In the past, I’m lucky to have had to chance to speak to Ozzie, who is one of the strongest and most principled people in EA, about his view of increasing board activity. If I understood and recall correctly, like him I imagined using boards as a device to seat and empower talent and provide institutional governance.&nbsp;</p><p>However, much of the response to these ideas about boards was negative from other people, including senior people. The general view is that boards can be negative and easy to poorly executed. I think I now agree with both views.</p>", "parentCommentId": "hrwuAMBErfTr3ToEA", "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "Gq24FWg4kwnugm4qM", "postedAt": "2022-11-30T22:06:52.338Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>Thanks for the thoughts here. (And the kind words!)<br><br>There's a lot going on here. I'm finding it a bit terse and subtle.<br><br>Maybe it would help to discuss some of this privately? (That might help with directness a bit). Feel free to send me a PM to chat there, or have a call, if that could be useful.</p>", "parentCommentId": "8jWT9aHLDL76AfRhp", "user": {"username": "oagr"}}, {"_id": "EWG3ChrvwKeFhztap", "postedAt": "2022-11-30T22:14:01.646Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>Quick things:<br><br>&gt; &nbsp;It would be good to get a description with deep understanding or causal relationships for how a larger board, board quality, or governance in general would have prevented the FTX collapse, especially in a deceptive environment, like FTX, where low quality efforts can be coopted.<br><br>I think it would have been tough for a non-FTX board to have fixed the issue. However, if the boards of EA orgs that heavily interacted with FTX were really on their game, maybe they could have realized that EA should have been more cautious around FTX, and taken corresponding actions. I think FTX itself basically didn't have a board, and if it did, it could have been much better too.&nbsp;<br><br>&gt; Just as importantly, it would be good to have a detailed understanding of how boards would be involved in improving EA org operation.&nbsp;<br><br>I think of the board as the ED's boss. If the org isn't doing a great job, it's kind of the ED's &nbsp;responsibility. If the ED isn't doing a good job, it's sort of the board's responsibility. Boards do have limited abilities in practice (it's a huge pain to actually fire an ED), but I they definitely have some power. I think good boards help prevent corruption, align incentives from EDs, and help choose new EDs when needed.<br><br>&gt; Frankly, this recent governance thread on the forum, has traits that, from the outside, seem to reflect local online trends instead of substance. This can produce \"the wrong hill to climb\", wasting effort, disillusioning people, or be coopted.<br><br>I see it a bit more like a \"window of opportunity/interest\". My hunch is that a lot of EA orgs have struggled a bit with middle/upper management (this is very common for orgs!), and the board seems like a good place to help improve things.&nbsp;</p>", "parentCommentId": "8jWT9aHLDL76AfRhp", "user": {"username": "oagr"}}, {"_id": "2GkEjLEubvy6izfE5", "postedAt": "2022-12-01T00:20:51.250Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>I sense that you are referring to a specific past situation that I don't think it is helpful to attempt to hash out here (although I have no idea what the backstory is). A brief discussion of various constitutencies the board &nbsp;needs to consider can be found at <a href=\"https://corpgov.law.harvard.edu/2012/04/15/nonprofit-corporate-governance-the-boards-role/,\">https://corpgov.law.harvard.edu/2012/04/15/nonprofit-corporate-governance-the-boards-role/,</a> but I'm sure someone could do better with more Google searches.</p><p>If an organization's management is dictating to the a board what its job is, or is controlling the onboarding process, I think that organization has a board problem. I don't tell my supervisor at work how to do his job.</p>", "parentCommentId": "cRpYPtDHqbTKac3qH", "user": {"username": "Jason"}}, {"_id": "A34imPQzR3QzMLwA5", "postedAt": "2022-12-01T01:29:45.956Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>Hi Jason,</p><p>I think my example gives intuition well for why conflict of interest and de jure constraints can be bad. There is no further subtext.</p><p>As an aside, because of where we are, and the ideas in your other comments, I want to say, on the subject of lawyers <s>or other ideas about institutions</s>, I do not share anything like<a href=\"https://forum.effectivealtruism.org/posts/eWYQwbX895HnyuhhY/the-relative-silence-on-ftx-sbf-is-likely-the-result-of?commentId=ZbukTLHL3rvHs32mj\">&nbsp;<u>Habryka's aesthetics</u></a> which you spent a lot of time <a href=\"https://forum.effectivealtruism.org/posts/eWYQwbX895HnyuhhY/the-relative-silence-on-ftx-sbf-is-likely-the-result-of?commentId=uurpbrafBfNDeHzpc\">pushing back on</a>. I am not from California and I did not come through an EA club at some HYPS school. I’m grateful for your discussions on this and other legal matters.&nbsp;</p>", "parentCommentId": "2GkEjLEubvy6izfE5", "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "qrvKWz9uZphkmRXaK", "postedAt": "2022-12-01T01:34:59.201Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p><strong>Writing to onlookers:</strong></p><p>What Jason <a href=\"https://forum.effectivealtruism.org/posts/4Y3NKH37S9hvrXLCF/apply-to-join-rethink-priorities-board-of-directors?commentId=hrwuAMBErfTr3ToEA\">said about EA orgs adding or changing </a>its board to have 2-3 non-EA board members, especially to an organization with 4 directors, is something you might do to an organization after a major crisis such as misconduct by the management, or a major pivot, maybe after a massive funding change.&nbsp;</p><p>To calibrate and give intuition, if we were talking about an employee, not an organization, the magnitude of this change would be like being put on a PIP, being demoted, or moved to another department involuntarily. If you were changing the board this way and done poorly (or sometimes well) many executives or staff would consider leaving.<br>&nbsp;</p><p>The issue at hand is changing board, from the close network containing the CEO and often close friends.&nbsp;<strong>Yes, independent governance is often nil and the CEO often dominates decisions in the modal (almost all really) start-up as well as most small nonprofits.</strong> This happens everywhere, including smaller organizations in EA.&nbsp;I'm 80% sure this was how GiveWell was built.</p><p>Nil governance could be bad or good, but the advice being discussed here is far too basic. If there actually was misconduct on the level of FTX fraud, this advice be easily co-opted. For example, Tyler Shultz was the relative of a Theranos board member and extensively explained the outright fraud to his board member relative, and was ignored. SBF could have constructed a performative board to dominate as well.</p><p>The level of discussion being given to this on the EA forum is low and risks cargo culting (wasting time working on processes that need true management ability to be effective), or create systemic issues, e.g. \"Matthew effects\" ( board members become a currency, orgs that can attract them to win the game of funding).</p><p>There is unlikely to be unusually high base rate of fraud in current respected EA organizations. Ultimately, the limiting issue in EA is management and talent, and people have worked on this for a long time. Some reactions can be counterproductive.&nbsp;</p>", "parentCommentId": "A34imPQzR3QzMLwA5", "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "PiBgyeZYC5QfET7xC", "postedAt": "2022-12-01T02:34:43.098Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>&nbsp;To clarify, I said that \"organizations\" should \"aim\" for \"at least one -- preferably two or even three -- board members who are not 'full-time' EAs.\" That statement did not refer to RP, and was not intended to suggest that an organization with four directors should immediately jump to adding 2-3 board members in the category I indicated. I also didn't specify a board size -- &nbsp;\"even 3\" makes more sense for a 9+ member board than for a smaller one.</p>", "parentCommentId": "qrvKWz9uZphkmRXaK", "user": {"username": "Jason"}}, {"_id": "3KTzfAQAAXxTEEDHe", "postedAt": "2022-12-01T09:27:43.850Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>I think this is a great initiative. It is great to see what you are looking for and why and try to bring on more relevant professional expertise. I hope more EA organisations follow your example.</p>\n", "parentCommentId": null, "user": {"username": "LukeDing"}}, {"_id": "xtBmESzNCwLMbLNu9", "postedAt": "2022-12-01T16:34:37.676Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>I also think that advisory board could be a good way to get advice from experienced people who may not have the time or want to take the responsibility of being a trustee.</p>", "parentCommentId": "3KTzfAQAAXxTEEDHe", "user": {"username": "LukeDing"}}, {"_id": "ABJci2pgJDdzrjKyb", "postedAt": "2023-01-15T16:59:30.171Z", "postId": "4Y3NKH37S9hvrXLCF", "htmlBody": "<p>If you're still interested in joining Rethink Priorities' board, we've extended the deadline to submit an application to January 20th. We'd love to hear from you by then! <a href=\"https://careers.rethinkpriorities.org/en/jobs/78036\">Apply today.</a></p>", "parentCommentId": null, "user": {"username": "abrahamrowe"}}]