[{"_id": "v2YRyttp68Kmcirid", "postedAt": "2015-05-19T21:38:02.794Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>I can think of a few key dystopias (brave new world, the rise of meritocracy 1870-2033, We) that have utilitarian reasoning taken to a drastic conclusion in some way. Many of them point to this dynamic and the implicit critique is that to think about human value in this was is base. But we have this kind of comparative social destruction permeating our society anyway at the moment, its just more general than EA points. Nice article and great to explore - another risk of the movement we should register ! :) </p>\n<p>Perhaps its the virtue of decision-theoretically consistent behaviour we should be praising and celebrating as well as the big splash results?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "xeWkhvTEKmLExBEw8", "postedAt": "2015-05-19T22:02:31.110Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>Life's not all a competition, Greg! ;)</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "8r7DpzLPzBFtrpLuu", "postedAt": "2015-05-20T03:40:06.371Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>What Ryan said. There’s a lot of academic produce in the movement that I’m in awe of, but since we’re working toward a common goal, it doesn’t irk me ego-wise in the least. Rather it motivates me to learn to produce such output myself. It also makes me want to hug the authors a lot.</p>\n<p>What I do find worrying is the prospect of having one’s own work displaced by superior work that didn’t built upon the first. That’s a pity, and I don’t know of any perfect way to avoid it. Publishing quickly and incrementally could help, and in some areas it may be possible to coordinate such things with all others. But surely that doesn’t solve the problem in general.</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "e2WJSYeiinNDgtkGN", "postedAt": "2015-05-20T13:12:57.967Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>I've often found the EAs around me to be</p>\n<p>(i) very supportive of taking on things that are <em>ex ante</em> good ideas, but carry significant risk of failing altogether, and</p>\n<p>(ii) good at praising these decisions after they have turned out to fail.</p>\n<p>It doesn't totally remove the sting to have those around you say &quot;Great job taking that risk, it was the right decision and the EV was good!&quot; and <em>really mean it</em>, but I do find that it helps, and it's a habit I'm trying to build to praise these kinds of things after the fact as much as I praise big successes.</p>\n<p>Of course there is some tension; often, if a thing fails to produce value, it's useful to figure out how we could have anticipated that failure, and why it might not have been the right decision <em>ex ante</em>. Balance, I guess.</p>\n", "parentCommentId": "v2YRyttp68Kmcirid", "user": {"username": "Daniel_Dewey"}}, {"_id": "j7kiKc3BrDsfPrnM4", "postedAt": "2015-05-20T22:28:47.228Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>Thanks for writing this. I often feel quite similar - I can find being in contact with so many amazing people either inspiring or oddly demotivating!</p>\n<p>That's the old status-conscious monkey brain talking (everyone's grasping vaingloriousness), and we shouldn't feed it, but it's good to acknowledge that it's there from time to time.</p>\n<p>Overall, I think the EA movement is pretty good at being positive. I've found such criticism as there is is usually self-criticism - if anything, I find people to be unusually generous with praise, which is lovely. I think you hit the nail on the head with your four sources of ego-damage. And yeah, I think the right thing to do is to try and not be bothered. For bonus points, remember to praise people when they do good things!</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "qqYq4qZgc4uatzJmY", "postedAt": "2015-05-21T23:48:29.289Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>If anyone is ever at a point where they are significantly discouraged by thoughts along these lines (as I've been at times), there's an Effective Altruist self-help group where you can find other EAs to talk to about how you're feeling (and it really does help!). The group is hidden, but if you message me, I can point you in the right direction (or you can find information about it on the sidebar of the Effective Altruist facebook group).</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "m4R738TsgZHn3S6Tz", "postedAt": "2015-05-21T23:54:50.139Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>Maybe the status issues in the &quot;lottery ticket&quot; fields could be partially alleviated by having a formal mechanism of redistributing credit for success according to the ex-ante probabilities - for the malaria vaccine example, you could create something like impact certificates covering the output of all EAs working in the area, and distribute them according to an ex-ante estimate of each researcher's usefulness, or some other agreed on distribution. In that case, you would end up with a certificate saying you own x% of the discovery of the malaria vaccine, which would be pretty cool to have (and valuable to have, if a the impact certificate market takes off).</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "CMADWsA5Pg7psEKTs", "postedAt": "2015-05-22T00:19:04.743Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>One approach to this could be tying your self-esteem into something other than your personal impact. You might try setting your goal to &quot;be an effective altruist&quot; or &quot;be a member of the effective altruist tribe&quot;. There are reasonable and achievable criteria (ie. the GWWC pledge) for this, and performance of people on the tail in no way effects your ability to pass these criteria. And, while trying to improve one's own impact is a thing that effective altruists do, it's not necessary to do or to achieve any specific criteria of success to meet the self-esteem criteria.\nA useful supplement to this attitude is a feeling of excitement about where effective altruism is going, which is a feeling that is actually enhanced by the achievements of the long tail. (&quot;I can't wait to see what these amazing people are going to accomplish!&quot;)</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "shB22gRYRqvYSeYn6", "postedAt": "2015-05-22T00:26:17.883Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>I wonder if there's a large amount of impact to be had in people outside of the tail trying to enhance the effectiveness of people in the tail (these might look like being someone's personal assistant or sidekick, introducing someone in the tail to someone cool outside of the EA movement, being a solid employee for someone who founds an EA startup, etc.)? Being able to improve impact of someone in the tail (even if you can't quantify what you accomplished) might avert the social comparison aspect, as one would feel like they'd be able to at least take partial credit for the accomplishments of the EA superstars.</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "c3Pw6qWjvbW5JEhas", "postedAt": "2015-05-30T01:09:48.181Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>If this was a solution to some of the issues which the OP raised, it would only be a solution for a small number of us. All the same, I think you're right that having 'sidekick' roles could be very valuable!</p>\n<p>It would be worth checking out this discussion:\n<a href=\"http://effective-altruism.com/ea/dl/i_am_samwise_link/\">http://effective-altruism.com/ea/dl/i_am_samwise_link/</a></p>\n", "parentCommentId": "shB22gRYRqvYSeYn6", "user": null}, {"_id": "Nn29YCzMkhMyMrtCu", "postedAt": "2015-07-21T19:47:34.131Z", "postId": "54QW6uBjWXJzR7c4E", "htmlBody": "<p>I've had an epiphany about Altruism itself, and I hope you'll bear with me through this explanation.</p>\n<p>Do you know of Maslow's Hierarchy of Motivation?  I learned about this only a couple years ago, but it changed everything in how I view people.</p>\n<p>Basically, there are 4 levels of &quot;deficiency&quot; needs that motivate people: 1) Physiological needs (food, shelter, etc); 2) Safety needs (physical safety, economic safety, mental safety, etc); 3) Love/acceptance (loved and cared for, and not being rejected by others); 4) Esteem (being respected, which is different from love.  This is tied to self confidence.)</p>\n<p>These needs are hierarchical in nature -- generally speaking, but not exclusively.</p>\n<p>When these needs are met -- and not just met, but <em>mastered</em> according to Maslow himself -- then the person moves into Self-Actualization.  This is the point where the person strives to reach their full potential.  This can be an athlete, or a programmer, or a teacher, or someone really pulling all the stops out and being the best they can be at whatever they love to do.</p>\n<p>Self-Actualization is the place of passion.</p>\n<p>Maslow believed there's a place beyond even that.  He called it Self Transcendence.  This is the more spiritual place of <em>altruism</em> -- when you want to give back to your society.</p>\n<p>Self-Transcendence is the place of altruism.</p>\n<p>This is probably where many members here are.</p>\n<p>There is nothing special about us, according to this hierarchy.  It just means we have gotten all of our needs met early, and we have had time to really devote ourselves to reaching our potential.  This doesn't mean we're gifted.  It means we have had some success in reaching that potential.</p>\n<p>That's important: we are not special.  We have merely had our needs met.</p>\n<p>(Note: this is the core of my own secret project: how to have everyone in the world get their needs met.  Imagine that: what if all people reached Self Actualization and most people reached Self Transcendence?  How powerful the human race would be then!)</p>\n<p>(I believe the Human Potential is the greatest untapped resource on the Earth right now.  But I digress. :) )</p>\n<p>ESTEEM:</p>\n<p>I want to point out in particular the Esteem need -- which, to me, reads as the whole point of your post.</p>\n<p>The difference between esteem and love is subtle, but important.  I'm realizing this because I've realized I've been deficient in this need.</p>\n<p>I've needed people to praise me and say I'm awesome.  Sounds silly, but it's a real need.  It drives me to work hard and do amazing things.  Without that need fulfilled, I've sunk into a life of mediocrity.  (Currently I'm a housewife when I used to work at Pixar.)</p>\n<p>Recently, I've regained my esteem, and now I'm plunging forward on some Big Ideas that I want to see through.  I feel like I've regained my &quot;old self&quot; that strived hard for impossible things.</p>\n<p>So the answer to your problem is to make sure you're getting that need met.</p>\n<p>The answer is for all of us to make sure we're encouraging each other.  Because it <em>is</em> hard being in a crowd of amazing people.  (I had some depressing days at Pixar...until a friend said, &quot;don't see the single great thing about each person here, and think each person does <em>all</em> of those things.  You are making it.  You're just as good as everyone else here.&quot;  That helped me keep perspective, and realize I had my own single great thing. :) )</p>\n<p>If Esteem is, indeed, important to Self Actualization and Transcendence, then feeding each other esteem as we go along could be key to keeping the energy high in this group.</p>\n", "parentCommentId": null, "user": {"username": "kikiorg"}}]