[{"_id": "bJeXbGtRnRzsNzBbC", "postedAt": "2017-04-05T17:24:40.432Z", "postId": "55giwB2Pmv5YM6JuQ", "htmlBody": "<p>I've done a <a href=\"http://danwahl.net/ace-vs-givewell\">little work</a> on this, using techniques from <a href=\"https://en.wikipedia.org/wiki/Modern_portfolio_theory\">modern portfolio theory</a>, and uncertainty estimates from GiveWell and ACE to generate optimal charity portfolios. See <a href=\"http://danwahl.net/stochastic-altruism\">here</a> for a background post, and <a href=\"http://danwahl.net/stochastic-altruism-2016\">here</a> for my 2016 update.</p>\n", "parentCommentId": null, "user": {"username": "drwahl"}}, {"_id": "Ws5MaiNPFcc4dEy5e", "postedAt": "2017-04-05T17:31:50.541Z", "postId": "55giwB2Pmv5YM6JuQ", "htmlBody": "<p>Thanks, this is actually highly relevant to another piece I'm working on!</p>\n", "parentCommentId": "bJeXbGtRnRzsNzBbC", "user": {"username": "Peter_Hurford"}}, {"_id": "HWBxEXjHfrcuqTmrw", "postedAt": "2017-04-11T03:31:09.929Z", "postId": "55giwB2Pmv5YM6JuQ", "htmlBody": "<p>That’s interesting!  I worked on <a href=\"https://github.com/psthomas/efficient-frontier/blob/master/efficient_frontier.ipynb\">something similar</a>, but it only allows for normal distributions and requires pre-calculated returns and variances.  Using the GiveWell estimates to create your own probability distributions is an interesting idea -- I spent some time looking through sources like the DCP2 and Copenhagen Consensus data but couldn’t find a source that did a good job of quantifying their uncertainty (although DCP2 does at least include the spread of their point estimates that I used for an analysis <a href=\"https://docs.google.com/spreadsheets/d/1-58LNxpCRQky7eCBr4AN1TAGWtCyCm4XiNnLEvYZ8r8/edit?usp=sharing\">here</a> ).</p>\n<p>One thing I wondered about while working on this was whether it made sense to choose the tangency portfolio, or just keep moving up the risk curve to the portfolio with the highest expected value (In the end, I think this would mean just putting all your money in the single charity with the highest expected value).  I guess the answer depends on how much risk an individual wants to take with their donations, so a nice feature of this approach is that it allows people to select a portfolio according to their risk preference.  Overall, this seems like a good way to communicate the tradeoffs involved in philanthropy.</p>\n", "parentCommentId": "bJeXbGtRnRzsNzBbC", "user": {"username": "Phil_Thomas"}}]