[{"_id": "BKNmpsJtehCyALsHj", "postedAt": "2022-02-23T11:48:30.268Z", "postId": "56nPm7cjns4tyMumm", "htmlBody": "<p>Transcript:<br><br>(00:00):<br>Good afternoon. I'm going to talk about embracing the intellectual challenge of effective altruism. This has been a theme of the conference, so I don't think this will come as a surprise to many of you, but I think it's an important direction for us to think about. So I think of it as being a dirty secret of effective altruism: that it's hard. And I'm going to say a bit more about what I mean by hard in a second, because I'm using that term in a somewhat unconventional way.<br>&nbsp;</p><p>(00:31):<br>Now being hard could be concerning. One concern is, if effective altruism is perceived of as hard, it might be less appealing. I call this the liability framing. I don't think the liability framing is necessary or correct. My view is that the qualities of effective altruism that make it hard, also provide a rich source of opportunity. I call this the opportunity framing. But to take advantage of the opportunity framing, we have to build a community that aggressively embraces the intellectual challenge.<br>&nbsp;</p><p>(01:10):<br>Okay. What do I mean by hard? Again, I'm using this term a bit unconventionally. I mean three basic things. One, we have a lot to learn about how to do the most good. Two, making progress on that question is intellectually demanding work. And three, because of those first two our views about how to change the world for the better are likely to change, probably quite a lot, even in the short term.<br>&nbsp;</p><p>(01:41):<br>Effective altruism is hard for two primary reasons. One, it's new. It hasn't been around for very long and comparatively few resources have been devoted to understanding its implications. Here are a few dates just to give you some perspective. Even within these organizations, much of the research has gone to thinking about how to do the most good within a particular domain on a particular problem. Many of the questions that transcend problems, that transcend cause areas are only beginning to be explored even today.<br>&nbsp;</p><p>(02:17):<br>A second reason why effective altruism is hard: its scope is enormous. To answer the question, what is the best action we can undertake, we need to know all of the following. One, the way the entire world is. This question is breathtakingly large in scope. It includes everything from the impact of distributing bed nets in Africa, to how different sentient beings experience pleasure and pain, to the timeline that certain technological advancements will follow.<br>&nbsp;</p><p>(02:58):<br>The actions available to us. Well, what can we do to make the world a better place? We can donate today to a charity. We can put money in a donor-advised fund, let it collect interest and donate one year from now or five years from now or 30 years from now. We can go work for a charity. We can do research to help others know where they should donate or where they should work. Maybe we can go into politics and try to move vast sums to address the most important problems in the world.<br>&nbsp;</p><p>(03:30):<br>Third, what everyone else is doing and will do. We don't act in a vacuum. The decisions we make about where to donate or where to work, impact the decisions of those around us. What might seem most impactful if we consider just our own impact might not be when we consider this broader perspective.<br>&nbsp;</p><p>(03:52):<br>And lastly, what we should value. How do we compare the interests of different species? How do we think about the interests of people alive today versus people that will be alive or might be alive in the future? What do we do with ideals like justice, democracy, equality? Do those have intrinsic value or are those rules of thumb for how we can make others generally better off? To understate the point, this is complicated.<br>&nbsp;</p><p>(04:25):<br>A couple implications of the fact that effective altruism is hard: one, we should expect disagreement. Now, disagreement is often unproductive because somebody is uninformed or maybe self-interested, but because of the scope of effective altruism there's an incredible amount of space for informed legitimate, we'll call it 'disagreement', where people who generally share the same values are reaching quite different conclusions about how to make the world a better place. And this is good. Informed disagreement staves off intellectual stagnation. The hope is that the better ideas will rise to the top. And by experimenting with different ideas, we can get information about those ideas that will allow us to update our beliefs going forward.<br>&nbsp;</p><p>(05:18):<br>A second implication of the fact that effective altruism is hard is that we should expect to be wrong. And by wrong, I don't mean subjectively wrong. It could be that when you made a certain choice, given the information available to you, you made the right choice. But then the world changes in unexpected ways and with the benefit of hindsight, maybe we would've done more good if we'd made a different choice. And this is often a difficult pill to swallow because it means, again, with the benefit of hindsight, the decision we made in the past, wasn't the optimal decision.<br>&nbsp;</p><p>(05:54):<br>So imagine if you'd known five years ago, about development in meat substitution research, or AlphaGo, or the establishment of Good Ventures, or CRISPR, or the success of the effective altruism movement. I expect many of us would've made pretty different decisions. I'd actually like to take a minute and if everybody could just, this is silly, but indulge me, literally think about something that has happened in the world that if you had known it one year ago or three years ago, whenever it makes sense for you, you would've made different decisions about how to make the world a better place. Please actually do this. I think it'll be interesting.<br>&nbsp;</p><p>(07:14):<br>Okay. I know I didn't give you very much time. Obviously we can't change the past, but I think indulging in exercises like that do allow us to think about how new information can change our decisions. And that will give us better processes for changing our mind going forward.<br>&nbsp;</p><p>(07:34):<br>Okay. What is the point? The crux of the issue is the fact that effective altruism is hard a good thing or a bad thing. One framing, what I'm calling the liability framing is that it's a bad thing. It's bad because highlighting the intellectual challenge might make effective altruism less appealing, and this could happen in a couple ways. It could happen because it negatively impacts growth. People hear about how difficult it is to know what will actually help the world, and they don't engage. It could also happen because of decision paralysis. People who've already nominally signed up for effective altruism might be paralyzed by the number of choices before them, by the complexity of the world and not even act.<br>&nbsp;</p><p>(08:27):<br>Here's a couple examples or one example of the way the message could be tweaked. If you donate $3,500 to the Against Malaria Foundation, you can save a child's life. It's a pretty compelling message. Now contrast that with this message. If you donate $3,500 to the Against Malaria Foundation, you can save a child's life, but you can't take these numbers literally, there might more cost-effective ways to save lives from malaria, malaria might not be the most important problem in the world, and the long-run effects of saving lives from malaria are potentially significant and are poorly understood. One might be concerned that the second message would be off-putting and therefore would be tempted to gloss over everything after the 'but'. So the liability framing creates an incentive to oversimplify.<br>&nbsp;</p><p>(09:27):<br>I don't think the liability framing is necessary or correct. I believe the liability framing misses two of effective altruism's most powerful qualities. And I'm going to put these in the context of what I'm calling the opportunity framing. And by the way, bear in mind, all of this is a gross oversimplification. So it's a bit ironic, but hopefully there's some useful message here. And if not, my apologies.<br>&nbsp;</p><p>(09:54):<br>Opportunity framing: First quality - Effective altruism is cause and means neutral, meaning we strive to do the most good period. We don't strive to do the most good within a particular domain or to solve a particular problem. We don't strive to do the most good with a particular tool or method. Two - we're truth-seeking. We take it upon ourselves to figure out how to do the most good. And lastly, because effective altruism is new, because it's so big in scope, because our minds are so likely to change going forward, it's likely that the problems and interventions we've already identified are just the tip of the iceberg.<br>&nbsp;</p><p>(10:44):<br>All right, let's consider how the two framings actually interact in a couple concrete contexts. One example is long-run or indirect effects. So the problem: an action might look promising, but its longterm effects are unknown. And I'll give you a simplified example, maybe cash transfers to a poor family in Uganda. And let's assume we know that that cash transfer will help this family. Let's also assume we know nothing about the longer term effects of that cash transfer. It could be good for the local economy, for example, it could be bad for the local economy, but we know nothing.<br>&nbsp;</p><p>(11:22):<br>The liability framing: you might say \"if I can't know whether I'll do good, why act?\". Under the opportunity framing you look at what you know. Giving money to this family will help them. Fantastic. That's it. You act based upon that information. Meanwhile, you do research, you do experiments, you run trials. You figure out what the longer term effects would be. You figure out what type of cash transfer programs actually help the local economy, which ones might harm the local economy. Maybe cash transfer programs aren't a good idea in the first place. You look into that. You then design the programs going forward in a way that's more likely to help the local economy or have positive long-run effects. In so doing you're turning unknowns into knowns, and that allows you to substantially increase the amount of good we can do.<br>&nbsp;</p><p>(12:20):<br>Another example: new problems or cause areas. So here's a silly example. You've spent the last few years earning to give, so you can donate to movement building organizations. And then at this conference, you meet somebody who tells you about this incredible opportunity to work on emerging technologies, policy, and government. And it would be more impactful. You're convinced. All right. So under one framing, liability framing, you just wasted years of your life working on the wrong problem. Under the opportunity framing: \"wow, I can do even more good than I previously thought\". And it sounds hokey, but the first framing is pretty natural.<br>&nbsp;</p><p>(13:06):<br>Okay. Quick sidebar on decision paralysis. And I'm going to really oversimplify this. The landscape is complex. The number of decisions before you are numerous, what do you actually do? So this is a rough and ready taxonomy of some options. Don't quote me on any of this. Okay. And what category you think we're in is going to depend on where you come down on the way the world is and what values you have in other areas of legitimate disagreement. So one category, known knowns, problems we can effectively address now. This might include eradicating certain tropical diseases or factory farming. What can you do? Do or fund direct work now.<br>&nbsp;</p><p>(13:54):<br>Another category, known unknowns. These might include problems that are on our radar, but where we think the most effective way to address them will be available several years from now. Perhaps we need more research to actually have the technology to address this problem. So what can you do? You can do or fund problem-specific research now. You can donate to a donor-advised fund and then fund that direct work a few years from now, when the research is ready. Or you can develop useful skills, maybe develop the research skills you need to be able to work on that problem.<br>&nbsp;</p><p>(14:30):<br>And the third category: unknown unknowns. These are important problems that aren't even on our radar yet. The Cause X that I believe Will mentioned in the introduction. If you think this is the most important problem, the one we don't even know about, well, you can do or fund foundational research to try to identify new problems, to completely reorient the way we think about these problems. Or you can put yourself in a position to develop the skills, to work on these problems in the future. Or you can maybe strengthen the effective altruism community, believing that is one of the more robust strategies to create a world in which people are ready and able to work on these problems in the future.<br>&nbsp;</p><p>(15:22):<br>Okay. For the opportunity framing to actually be useful, we need to develop a community that can actually make progress on these problems, what I'm calling generally a truth-seeking community. And there are two general components to this. One is social norms. We need to be informed. That means everybody needs to be informed. If you're not informed, you talk about effective altruism in an oversimplified way. And that creates a community that's not well suited to make progress on these problems. So read, read widely, discuss. I also want to plug effectivealtruism.org, a website that we launched a few days ago. This is the seed of a much bigger project, but it's going to be a great repository for information that will help you stay informed.<br>&nbsp;</p><p>(16:15):<br>Calibrate your confidence; meaning don't be overconfident, don't oversimplify, but also don't be underconfident. Contribute to the marketplace of ideas. If you see perspectives that are being underrepresented, speak up, know when you add value. And embrace disagreement and criticism. It's hard, but recall that there's an enormous legitimate space for disagreement and criticism is one of the most useful ways to improve your beliefs.<br>&nbsp;</p><p>(16:51):<br>The other component to developing an effective truth-seeking community is to develop the body of knowledge that's relevant to making the world a better place. One way of doing this is to make effective altruism an academic discipline. Some of my colleagues are actually working on developing an institute at Oxford tentatively called the Institute for Effective Altruism or the Oxford Institute for Effective Altruism.<br>&nbsp;</p><p>(17:21):<br>So to develop the body of knowledge that's relevant to doing good, better, we need to invest in foundational research. Foundational research is a broad label that I think can include anything that is likely to show that we're wrong in a significant way. So foundational research might be looking for new problems or looking for information that might mean we are way undervaluing one problem relative to another, or that there's an entire way of thinking about addressing certain problems that we've neglected or that we've overinvested in.<br>&nbsp;</p><p>(18:00):<br>Identify and draw upon research in other fields. Other established disciplines like statistics, economics, psychology have a lot to say about how to make the world a better place. And there's no need for us to reinvent the wheel. And organize and build on our own research. Much of the best research on how to make the world a better place has appeared on someone's blog and then been forgotten. We need to find a way to organize this research so we can develop the idea going forward.<br>&nbsp;</p><p>(18:33):<br>All right, I want to close with a shameless plug. The Center for Effective Altruism is looking for highly talented, highly motivated people to work on some of these foundational problems. If you think you might be a candidate, send me an email. Thank you.</p><p><br>Transcript by <a href=\"https://www.rev.com\"><u>Rev.com</u></a></p>", "parentCommentId": null, "user": {"username": "james_aung"}}]