[{"_id": "YrahzBphBQRZ6RRhs", "postedAt": "2014-12-23T17:06:26.988Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>&quot;I think it would have been smart to do the week before my fundraiser and the week after.&quot; - Do you mean the week before &amp; after your birthday?</p>\n", "parentCommentId": null, "user": {"username": "Gina_Stuessy"}}, {"_id": "Q6DhAGC99Zbivqbv9", "postedAt": "2014-12-23T17:18:00.856Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Great job! I'm going to encourage Ben to do this for his birthday in February (and then I'll try it again in August). Mind if we use your wording for the part about the bed nets? I wonder if Charity Science will always match bday fundraisers or if that's something just for the end of this year?</p>\n", "parentCommentId": null, "user": {"username": "Gina_Stuessy"}}, {"_id": "ErADxheLgDrPhHi7h", "postedAt": "2014-12-23T17:25:34.556Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Yes, we should always be able to match.</p>\n", "parentCommentId": "Q6DhAGC99Zbivqbv9", "user": {"username": "Tom_Ash"}}, {"_id": "4JXoKN5XQL7gZksPQ", "postedAt": "2014-12-23T17:42:09.350Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<blockquote>\n<p>Mind if we use your wording for the part about the bed nets?</p>\n</blockquote>\n<p>Go for it!</p>\n", "parentCommentId": "Q6DhAGC99Zbivqbv9", "user": {"username": "Peter_Hurford"}}, {"_id": "PnteXYZxMabPhZ6Ft", "postedAt": "2014-12-23T17:42:23.032Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Awesome you're going to do more fundraisers!</p>\n", "parentCommentId": "Q6DhAGC99Zbivqbv9", "user": {"username": "Peter_Hurford"}}, {"_id": "rs6J4kgv6P9ESaovG", "postedAt": "2014-12-23T17:42:59.045Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Haha, yes!  Fixed.</p>\n", "parentCommentId": "YrahzBphBQRZ6RRhs", "user": {"username": "Peter_Hurford"}}, {"_id": "mXCDqjwaP9tjEZJAB", "postedAt": "2014-12-24T12:12:34.197Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Great with all the tips for a successful birthday fundraiser! But I've got a couple of questions that I would like to see your thoughts on.</p>\n<p>I) People you meet on a regular basis, like your best friends of nearest family, do you include them on the email list? Isn't it like texting people while you talk to them? A bit weird and too formal?</p>\n<p>II) I imagine you want to do this again next year, but could you send the same email again? Do you think people will think differently about the email and you contacting them with a fundraising call every year? </p>\n", "parentCommentId": null, "user": {"username": "Jorgen_Ljones"}}, {"_id": "tyYm55AWPoY9Kt4us", "postedAt": "2014-12-24T15:23:00.718Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<blockquote>\n<p>People you meet on a regular basis, like your best friends of nearest family, do you include them on the email list? Isn't it like texting people while you talk to them? A bit weird and too formal?</p>\n</blockquote>\n<p>I did email them as well.  It never really came up in casual conversation, and I was more intimidated to do in-person sales.</p>\n<p>-</p>\n<blockquote>\n<p>I imagine you want to do this again next year, but could you send the same email again? Do you think people will think differently about the email and you contacting them with a fundraising call every year?</p>\n</blockquote>\n<p>I do imagine the message, and strategy, will need to be changed for when I do this again.  Taking into account who gave last year would be important, for starters.</p>\n", "parentCommentId": "mXCDqjwaP9tjEZJAB", "user": {"username": "Peter_Hurford"}}, {"_id": "63RhNSibkHLWE3ohe", "postedAt": "2014-12-24T19:20:34.860Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Giles followed the advice in this post and his fundraiser has already gone from being stuck at around $160 to flying past $530 with continued momentum!  Congrats Giles!</p>\n<p>P.S. Don't forget to thank your donors as I did and as Giles did.  I somehow forgot to mention that... :(</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "RJM5CsbQjkgbFm2Fc", "postedAt": "2014-12-25T19:12:52.258Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<blockquote>\n<p>Again, the point of this is to make genuine connections and re-connections, not just to use your friends as a means to an end of fundraising.</p>\n</blockquote>\n<p>If this whole &quot;fundraising&quot; thing is just a clever ruse to get EA people to reconnect with their extended network of friends, I heartily approve!</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "XH6D8fcQAv974C8Zr", "postedAt": "2014-12-25T20:12:42.123Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>I enjoyed the personal calls with friends more than I enjoyed moving lots of money.</p>\n", "parentCommentId": "RJM5CsbQjkgbFm2Fc", "user": {"username": "Peter_Hurford"}}, {"_id": "Q3v6x8EpYyFuWmzFc", "postedAt": "2014-12-27T23:05:22.118Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<blockquote>\n<p>But what about the people who don't respond? Ideally you should wait a few days and then follow-up.</p>\n</blockquote>\n<p>...</p>\n<blockquote>\n<p>I actually only followed up with people who replied to me</p>\n</blockquote>\n<p>I'm confused by this - should I follow up with people who I email and who don't respond, or not?</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "ENhmWba9hnXXqAQYM", "postedAt": "2014-12-28T02:29:38.537Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Case by case basis, I'd say. If you haven't spoken to this person in years and they didn't respond, then a second email is pretty much spam. If it's someone you know better, a second email might be worth it.</p>\n", "parentCommentId": "Q3v6x8EpYyFuWmzFc", "user": {"username": "Bitton"}}, {"_id": "t7XZKGb9Dku6vJjK9", "postedAt": "2014-12-28T03:17:40.157Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>The generous folks at Charity Science seem hesitant to match some of my donations. Anyone else having this problem? Or know what's going on?</p>\n<p><a href=\"http://christmas.causevox.com/giles\">http://christmas.causevox.com/giles</a></p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "Ae5hbtKMavB6hAjGT", "postedAt": "2014-12-28T08:12:25.936Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>There's humans behind the matching, and humans are slow sometimes.  I'll ask them to get on it.</p>\n", "parentCommentId": "t7XZKGb9Dku6vJjK9", "user": {"username": "Peter_Hurford"}}, {"_id": "dpw5SCJm5DzhM5byv", "postedAt": "2014-12-28T08:13:16.056Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>I approve this message.</p>\n<p>To clarify, I followed up solely with people who said they would donate plus people I was nearly certain I was sure would donate.</p>\n", "parentCommentId": "ENhmWba9hnXXqAQYM", "user": {"username": "Peter_Hurford"}}, {"_id": "5A4BjNBsZtCjifb2X", "postedAt": "2014-12-29T02:10:07.127Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>An idea if your personal network isn't extensive or if you want to do more fundraising:</p>\n<p>I went door-to-door today in my neighborhood for four hours fundraising. I drafted the following pdf and put it in a laminated paper sleeve: <a href=\"http://www.evenkind.org/door2door.pdf\">http://www.evenkind.org/door2door.pdf</a> (I didn't include GiveDirectly since I thought cash transfers would be a harder sell). I also printed out a bunch of strips of paper (sort of like the tabs you would pull off an advertisement, e.g. a tutoring sign) with my Charity Science URL and a &quot;thank you&quot; message in case anyone wanted to pay via credit card.</p>\n<p>The result was $70 ($17.50/hour), which was matched to $140. It seems possible that doing this earlier in the giving season would have been more fruitful (people often cited having made charitable contributions already).</p>\n<p>If anyone is interested in doing this, my opener was: &quot;Hi &lt;Sir/Ma'am&gt;, how are you? [...] I'm talking with people about three effective health charities.&quot; </p>\n<p>While I don't have a lot of experience doing this, feel free to ask me any questions about my experience.</p>\n", "parentCommentId": null, "user": {"username": "dneylon"}}, {"_id": "iNt9hYEkbruRHaBEo", "postedAt": "2014-12-29T03:57:46.572Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Hey, this is really neat!  Big kudos for doing this!  I'd be excited for follow ups.</p>\n<p>Why three charities?  Do you think just one might be more successful?</p>\n<p>If enough people do this, it could be an excellent opportunity to A-B test.</p>\n", "parentCommentId": "5A4BjNBsZtCjifb2X", "user": {"username": "Peter_Hurford"}}, {"_id": "LNSMAmrpNRHsouKSz", "postedAt": "2014-12-30T12:24:22.775Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Thanks. I had no reason for picking three charities other than that it just seemed natural to me (I made the PDF quickly without much thought). </p>\n<p>I don't know if just one charity would be more successful. The three people who donated in this case didn't seem particular about the causes.</p>\n<p>I'd be willing to do it again as part of a test.</p>\n", "parentCommentId": "iNt9hYEkbruRHaBEo", "user": {"username": "dneylon"}}, {"_id": "s6NKJuf9NCDBd2vdh", "postedAt": "2014-12-30T16:22:20.027Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Sure!  When Charity Science gets around to testing door-to-door, we'll definitely be in touch.</p>\n", "parentCommentId": "LNSMAmrpNRHsouKSz", "user": {"username": "Peter_Hurford"}}, {"_id": "5XahdLdPKu7r9vfxn", "postedAt": "2015-01-22T17:00:43.382Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>2 adults + baby for 2.5 hours raised £280 (GBP) - so £56/hr if you have a baby. One thing to mention was that the cause was perhaps more appealing. Caveat: it was the early days of the Ebola crisis and we thought that it was a risky but potentially high value philanthropic opportunity to give to UN/charities with exclusive funding for the more promising means of ebola prevention. So that might have appealed to people more - but I think people were mainly giving because they felt pressured. In my head I conservatively budget for at least £10 of that £56/hr disappearing because we used up some of their goodwill in getting them to give a little, and they will be less generous in other areas of their life. Even though we're in Oxford, we also heard a lot of &quot;I've given some already&quot; or &quot;I give regularly&quot; or &quot;I have already given to that one&quot; as people walked by.</p>\n", "parentCommentId": "iNt9hYEkbruRHaBEo", "user": {"username": "tomstocker"}}, {"_id": "3rwi7hJhjj2kH2qyo", "postedAt": "2015-01-22T17:29:46.214Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Thanks for sharing! What were you doing? Going door-to-door?</p>\n", "parentCommentId": "5XahdLdPKu7r9vfxn", "user": {"username": "Tom_Ash"}}, {"_id": "3AwfZoAguxoYHsEbw", "postedAt": "2015-01-23T10:27:47.789Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Street pouncing on cornmarket with buckets. Opposite gender same age seemed to be most generous (occasional £20 notes - male for Abbie, female for me - not sure what's going on there, and only 4 data points so probably chance).</p>\n", "parentCommentId": "3rwi7hJhjj2kH2qyo", "user": {"username": "tomstocker"}}, {"_id": "q2oWG2YD5QsAu2mqg", "postedAt": "2015-02-13T14:40:24.204Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>It's worth adding that ideally you'd start these steps a couple of weeks before your birthday or so, though doing them later or even after the fact could totally work too.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "gNQACiBEA6aFiQTmi", "postedAt": "2015-02-14T19:23:45.037Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>I started planning three weeks before my birthday and started acting about two weeks before.  I wish I had started earlier.</p>\n", "parentCommentId": "q2oWG2YD5QsAu2mqg", "user": {"username": "Peter_Hurford"}}, {"_id": "ZXJodG5sve5gEhKwZ", "postedAt": "2015-04-30T01:18:59.272Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Thanks so much for writing this guide! I was able to use many of your suggestions to run a successful fundraiser, raising $2,680 for SCI. I really liked the overall idea of using this as an opportunity to connect with people. It was great reconnecting with people I hadn't talked to in a while.</p>\n", "parentCommentId": null, "user": {"username": "Andy_Schultz"}}, {"_id": "89NHEn576cYZAsXAg", "postedAt": "2015-04-30T13:53:16.861Z", "postId": "59KBJXSeZvTt6fB6u", "htmlBody": "<p>Congrats!</p>\n", "parentCommentId": "ZXJodG5sve5gEhKwZ", "user": {"username": "Peter_Hurford"}}]