[{"_id": "biDMcnoCWkPHEZ3eC", "postedAt": "2020-10-30T07:45:49.199Z", "postId": "5Chut58EATH8JH85u", "htmlBody": "<p>Thanks! After so long I finally understood moral uncertainity :P</p>", "parentCommentId": null, "user": {"username": "Prabhat Soni"}}, {"_id": "rDE2DNZikwNvWAiz2", "postedAt": "2021-01-07T12:38:08.450Z", "postId": "5Chut58EATH8JH85u", "htmlBody": "<p>A number of links in this article are broken - would it be possible to fix them? Specifically the links from 1. and 2. \"in the same ballpark as murder\"</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "47qpcqRRPQZw3A9RC", "postedAt": "2021-01-08T10:59:47.004Z", "postId": "5Chut58EATH8JH85u", "htmlBody": "<p>The second is <a href=\"https://www.jstor.org/stable/2026961?seq=1#metadata_info_tab_contents\">here</a> (paywalled) and I am not sure what was the first. If you find it I can use the moderator privileges and edit the post to fix the links.</p>", "parentCommentId": "rDE2DNZikwNvWAiz2", "user": {"username": "edoarad"}}, {"_id": "EDqzGfBJmo4EBJBF9", "postedAt": "2021-05-30T09:10:08.882Z", "postId": "5Chut58EATH8JH85u", "htmlBody": "<p>From 1. \"the same ballpark as murder\" the Internet Archive has it saved <a href=\"https://web.archive.org/web/20120805192414/http://www.animal-rights-library.com/texts-m/singer02.htm\">here</a><br>The link in 3 \"in the same ballpark as walking past a child drowning in a shallow pond\" is also dead, but &nbsp;is in the Internet archive <a href=\"https://web.archive.org/web/20210113100558/https://www.utilitarian.net/singer/by/1972----.htm\">here</a></p><p>Edit: the link in 2 is also archived <a href=\"https://web.archive.org/web/20120617043702/https://rci.rutgers.edu/~tripmcc/phil/cmsi/csmi-abortion/marquis-whyabortionisimmoral.pdf\">here</a></p>", "parentCommentId": "47qpcqRRPQZw3A9RC", "user": {"username": "Tristan Cook"}}, {"_id": "Xiqqncry3kxPAttk4", "postedAt": "2022-04-11T11:23:22.687Z", "postId": "5Chut58EATH8JH85u", "htmlBody": "<p>This blog, written in 2012, is outdated and inaccurate with regard to its statements on climate change and provides dangerous fodder to the arguments of climate denialists or even those who just wish to equivocate and obscure the issues. It should therefore be edited or deleted.</p>\n<p>It says, “For example, we don’t currently know exactly to what extent the earth’s temperature will rise, if we are to continue to emit CO2 at the rate we have been emitting so far.” This is categorically not true. Because we do know to what extent the earth’s temperature will rise if we continue on our current (April 2022) trajectory of CO2 emissions: 2.7°C.</p>\n<p>See:  World On Course For 2.7°C Temperature Rise By 2100 – Even If All Current Climate Commitments Are Met - Health Policy Watch</p>\n<p>The blog post goes on to say, “The temperature rise might be small, in which case the consequences would not be dire. Or the temperature rise might be very great, in which case the consequences could be catastrophic.” Again, for a given amount of CO2, the rise in temperature is relatively predictable. Uncertainty only kicks in with regard to positive feedback loops - e.g. when melting of the permafrost causes methane to be released, which increases the temperature, which causes more methane to be emitted, then permafrost to melt further etc. But there is no uncertainty regarding the link between emissions and temperature rise per se.</p>\n<p>Next, the blog says, “To what extent we ought to mitigate our CO2 emissions depends crucially on this factual question. But it’s of course not true that we are unable to offer any practical advice in absence of knowledge concerning this factual question. It’s just that our advice will concern what one ought to do in light of uncertainty about the facts.”</p>\n<p>Again, no. These statements are wildly fuzzy and inaccurate. There is no uncertainty about this aspect of the science and facts of climate change. For any given amount of CO2 emissions, we can predict within a relatively high degree of accuracy, what temperature rise will ensue, and what the planet will then look like. Yet climate denialists can point to this blog post by a well-known philosopher and say, hey, look people, this guy at the University of Oxford, no less, is in doubt about the climate change science, he says the facts are uncertain.</p>\n<p>Philosophers should beware of straying into fields in which they have no clear understanding, and regarding which they cannot communicate in a scrupulously clear manner. The consequences could be downright dangerous.</p>\n<p><a href=\"https://report.ipcc.ch/ar6wg2/pdf/IPCC_AR6_WGII_SummaryForPolicymakers.pdf\">https://report.ipcc.ch/ar6wg2/pdf/IPCC_AR6_WGII_SummaryForPolicymakers.pdf</a></p>\n", "parentCommentId": null, "user": {"username": "Hedgie"}}]