[{"_id": "w95AfgBrRyqRXyjMT", "postedAt": "2024-03-08T07:39:17.340Z", "postId": "5czbdxxsDaDQCHoWG", "htmlBody": "<p>Nice! This is open to people in Europe, right?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Forumite"}}, {"_id": "bMmCyGkcAteJciwcE", "postedAt": "2024-03-08T20:35:20.647Z", "postId": "5czbdxxsDaDQCHoWG", "htmlBody": "<p>Yes! It depends on the specifics, but we can hire in most European countries, and (if needed) in some cases can try to help with relocation, etc.</p>", "parentCommentId": "w95AfgBrRyqRXyjMT", "user": {"username": "Dustin Crummett"}}, {"_id": "9YbbtKbDk3Xj8k9vs", "postedAt": "2024-03-13T13:43:42.989Z", "postId": "5czbdxxsDaDQCHoWG", "htmlBody": "<p>This new organization looks very interesting, but I think that it would be good to provide more information about it. I expect applicants might want answers to questions such as:</p><ul><li>What is the Insect Institute's general strategy? What is it hoping to achieve?</li><li>(Expanding on the above) does the Insect Institute aim to improve insect welfare, or to oppose insect farming, or just to provide information (as the website text states)? This question was asked on <a href=\"https://forum.effectivealtruism.org/posts/Bsdq5wK63vLEB3Gqg/announcing-the-launch-of-the-insect-institute\">a separate forum post</a>, and I think it would be better if the answer was given to anyone reading the forum.</li><li>Does it take a particular position on the sentience of insects?</li><li>How does the organization intend to achieve its goals? Is it planning to scale up, or work with others in the animal welfare space?</li></ul><p>I hope this is of some help in finding a good candidate!</p>", "parentCommentId": null, "user": {"username": "Tristan"}}, {"_id": "adLZEuMEQYju6m69P", "postedAt": "2024-03-14T02:18:33.757Z", "postId": "5czbdxxsDaDQCHoWG", "htmlBody": "<p>Exciting opportunity! What sort of formal education is preferred for this position? Is it okay to apply just with an undergrad in life sciences, or more advanced degrees are required?&nbsp;</p>", "parentCommentId": null, "user": {"username": "sulfadiazineportkey"}}, {"_id": "CeXZLzwaudo36zygc", "postedAt": "2024-03-14T20:02:13.086Z", "postId": "5czbdxxsDaDQCHoWG", "htmlBody": "<p>Hi! There are no specific formal education requirements, though relevant qualifications are desirable, as mentioned in the \"preferred\" section.</p>", "parentCommentId": "adLZEuMEQYju6m69P", "user": {"username": "Dustin Crummett"}}]