[{"_id": "8WnEaXZeDruS56vEC", "postedAt": "2014-09-17T03:43:23.062Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>Peter Singer has written significantly about this. I think he gives it a chapter in The Life You Can Save. Here are some snapshots from comments he's made online:</p>\n<ul>\n<li>&quot;We need to get over our reluctance to speak openly about the good we do. Silent giving will not change a culture that deems it sensible to spend all your money on yourself and your family, rather than to help those in greater need – even though helping others is likely to bring more fulfilment in the long run.&quot;</li>\n<li>&quot;“Research shows that when people know that others are giving, they are themselves more likely to give. So publicly pledging to give will encourage others to give. This holds true for billionaires and for those of us who aren't anywhere near that level of wealth. We can all make a difference, and play our part in making the world a better place.&quot;</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "wvqqiKiQDKLR2AXnW", "postedAt": "2014-09-17T09:08:43.838Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>Thanks Peter, great post! With regard to why people don't feel they should tell others they give, I was wondering whether the reason is a bit different than calling their motives into question. If that were the case, it would seem crazy to ever have buildings / hospital wings / park benches named after you. I wonder if telling people how much you donate is considered too directly bragging. In the same way, we never tell people what we earn, yet go out of our way to have status markers like expensive cars to show that we earn a lot. In that case, maybe you wouldn't want to advertise your giving until you can give an impressive amount, and then you're happy for the fact you've given, but not the amount, to be known. </p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "eGAEaQwbLrniwLeYq", "postedAt": "2014-09-17T09:59:46.213Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>Peter - thank you for another excellent post.   I would completely agree that for some people telling others how much you donate will be an effective way of transforming their behaviour, and may well work with younger groups or for particularly influential speakers - what might work for Peter Singer may not work for others - the answer is for individuals to try it and see.  </p>\n<p>I have some experience on this particular issue, having tried at some length to do exactly this.  I invested in two communities in Uganda and the Philippines on the edge of extreme poverty and created sustainable businesses that could generate returns for reinvestment in those communities which were transformational on the lives of perhaps 50 individuals, and which provided immense personal satisfaction.  On relating to my peer group how I was able to achieve all this &quot;for the cost of a new kitchen we didn't really need&quot; and would they like to have a try too there was a sense of incomprehension, an unspoken sense that I was perhaps having a mid life crisis and a firm request domestically for the new kitchen!   </p>\n<p>The main cause of this failure I suspect was the lack of social status being attached in the mainstream to unusually large giving (as opposed to new kitchens), and this is a learning point I take forwards.  But the point is people's motivations and behaviours are really complex and appear to vary wildly from situation to situation despite apparently similar inputs on a particular dimension.  </p>\n<p>I think this gap that can occur between practise and theory, as the real world will not conform to any particular theory is a real challenge for effective altruism as it continues to try to grow, potentially leading to paralysis as better theories are sought before any further actions are taken.  The challenge effective altruism will face at it tries to outreach more broadly is a rare case of &quot;science meets the real world&quot;.  </p>\n<p>Many of us from a business background have wondered why the academic community appears to lock itself away, and I am starting to understand why - the approaches adopted are quite different at a fundamental level. Working within scientific fields necessarily requires looking at the world through a highly selective lens - progress in healthcare requires absolute focus on the structure of the cell, DNA etc. for example - and then creating theories that can then be applied from the evidence - the behaviour of the Islamic State for example is completely irrelevant.  </p>\n<p>In seeking to outreach into the mainstream all factors can potentially be relevant - including elements like personal feelings towards the Islamic State in certain circumstances.   There is no general theory that can be applied within the grasp of ordinary human level of complexity - the problem is simply too complex to model.  </p>\n<p>Does this mean that there is no logical way to proceed?  Not at all - but it does require controlled experimentation of trying things to see what works - a clear bias to action.  To highlight the difference I would recommend Richard Branson's &quot;Screw it Lets do it&quot; alongside the work of Peter Singer.  Richard Branson has dyslexia so will therefore never write an academic paper (and uses ghost writers for all his Facebook and social media outreach) but he has nevertheless been hugely successful in impacting the real world in trying many things, failing quickly and building on his successes.  That many of Richard's initiatives could benefit from the application of evidence and reason is definitely true, but even without it his success is undeniable. </p>\n<p>I would also highlight Ian Goldin's book &quot;The Butterfly Defect&quot; in this regard.  Ian Goldin is the Director of the Oxford Martin School of Future Studies of which the Future of Humanity Institute is a part.  In the book he highlights the challenges of operating in a highly complex world, and the risks and challenges of trying to create complex theories and rules when all things are linked. </p>\n<p> In his book he highlights a speech from Andrew G Haldane, Executive Director, Financial Stability and member of the Financial Policy Committee  &quot;So what is the secret of the dog’s success? The answer, as in many other areas of complex decision-making, is simple. Or rather, it is to keep it simple. For studies have shown that the frisbee-catching dog follows the simplest of rules of thumb: run at a speed so that the angle of gaze to the frisbee remains roughly constant&quot; - or to keep your eyes on the frisbee and go there - &quot;Humans follow an identical rule of thumb.&quot; </p>\n<p>The Effective Altruism movement has the potential to become hugely influential if it can collectively understand the differences between the academic rational approach and the business rational approach and understand when and how to use each.  However, as I have found it hard to understand the &quot;base level coding&quot; of the scientific approach I understand it will likely be challenging for those grounded in the academic approach to understand the &quot;business rational&quot; approach.</p>\n<p>I realised the fundamental gap between business rational and academic rational when it was suggested by an EA I read Elizer Yodkowsky's core sequences (in order to look at things &quot;the right way&quot;) - in particular &quot;Map and Territory&quot; and realised that in my business life I had mainly focussed really hard on studying the territory and spent only a very small amount of time trying to compose a map (nobody in effective businesses has lots of time for map making - you would be sacked for time wasting long before you had made a decent map).  That this is step 1 of the core sequences shows that the difference in approach is really quite fundamental.</p>\n<p>In terms of marketing and outreach (I use the two interchangeably) there are basic and effective processes for marketing something (here a movement that is trying to do the most good it can through the use of evidence and reason), which are well proven to succeed:  </p>\n<ul>\n<li><p>using market research to gain an insight how different groups of people view the world and different presentations of your proposition or product, testing for a variety of hypotheses on a well sampled and statistically signficant and representative sample group;</p>\n</li>\n<li><p>segment your market and create different approaches to each segment based on your understanding of what might work as identified in the market research;</p>\n</li>\n<li><p>&quot;test marketing&quot; those approaches, using the 4P marketing dimensions of product, price, place, promotion;</p>\n</li>\n<li><p>scaling up those that succeed and trying again with those that fail, learning what you can from those failures (you learn far more from your failures);</p>\n</li>\n<li><p>being open to alternative approaches to outreach and market as new evidence presents itself, and testing them in a controlled and objective fashion.</p>\n</li>\n</ul>\n<p>In all of this there is a focus on the goal of trying to outreach as effectively as possible, using the simple approach of the dog and the frisbee of just trying to do it, modifying the directions as necessary.  Some lessons and thoughts can be learned along the way, but the main focus is to do, with learning from doing a spin off benefit.</p>\n<p>To me the creation of a business rational based &quot;evolutionary marketing and outreach ecosystem&quot; in which different marketing and outreach approaches can be tried out will provide a compelling ROI to the Effective Altruism movement, that sits comfortably with its ethos.  It will however probably require bringing different skill sets into the movement more along the &quot;screw it lets do it&quot; mentality - the challenge of course will be mutual respect which will require a genuine understanding for different approaches.  </p>\n<p>None of which is to say that highlighting the amount you give to others should not be attempted as a way to increase giving - it absolutely should.  But many different things need to be attempted in a controlled fashion and the results widely shared, the collective successes built upon, and the collective failures learnt from.</p>\n<p>That I will probably get zero karma points for writing this to me simply highlights the difficulty of the task!</p>\n", "parentCommentId": null, "user": {"username": "DavidRooke"}}, {"_id": "fcawvJeEv4Eq92534", "postedAt": "2014-09-17T12:35:57.500Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>As an effective altruist, I personally find it difficult to emotionally feel up to the task of donating publicly, even though part of me feels is the better thing to do. Public giving still requires courage. There are a few skills taught at CFAR workshops that might apply to this, such as:</p>\n<ul>\n<li>Social Comfort Zone Expansion</li>\n<li>Aversion Calibration and Factoring</li>\n<li>Propagating Urges</li>\n</ul>\n<p>I don't know if I would need to ask for permission from CFAR, but I would like to write a post, or perhaps organize a challenge, using these cognitive habits, to keep us to a commitment of public giving. For example, over the course of a few weeks, or months, a group of effective altruists could make public their giving every week, or month, as a exercise in learning to take calculated risks. This could imbue within some of us the courage to make our giving public going forward. Also, a dynamic trial might cultivate the habit of public giving more than a less vocal pledge like Giving What We Can's.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "DbqkuXkMTjwDvvAk8", "postedAt": "2014-09-17T12:43:00.513Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<ul>\n<li><p>Feedback: this essay seems a bit academic than need be for an introductory explanation, if that is indeed what this essay is, but there are others covering public giving that can be referred to people who want an even lighter read. What I like about this essay is that it's the first one on public giving that covers all the bases, explanations, and reasons why people don't, and why people should, publicly give.</p>\n</li>\n<li><p>Apparently Jeff Kaufman tried publicly broadcasting his donations, but it wasn't too well received each time he did it, so now he makes his donations public by listing all of them on his own website, and providing a link for people to read it in passing. Additionally, it seems like he mentions his donations as a matter of fact, or in passing, letting it pique the interests of others as it may[1].</p>\n</li>\n</ul>\n<p>[1] I acquired this information from Jeff Kaufman himself in a discussion I initiated in the Effective Altruists Facebook page in August 2014.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "DfQrgwbFETsdJoMax", "postedAt": "2014-09-17T15:54:09.753Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<blockquote>\n<p>But let's assume that giving was really just a giant fight for status... would that be so bad?</p>\n</blockquote>\n<p>If there were a social norm of giving to the most effective charities to achieve high status, this sounds like the concept of <a href=\"http://meteuphoric.wordpress.com/2013/12/22/pretend-to-really-really-try/\">pretending to really try</a>, i.e. pretending to try in a way that's more or less indistinguishable from actually trying. This is probably a good thing.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "Eh3GZJDd6W3RGNvuG", "postedAt": "2014-09-17T16:01:46.572Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<blockquote>\n<p>Apparently Jeff Kaufman tried publicly broadcasting his donations, but it wasn't too well received each time he did it</p>\n</blockquote>\n<p>Thanks for the insight.  Can you clarify how this public broadcasting was done?</p>\n", "parentCommentId": "DbqkuXkMTjwDvvAk8", "user": {"username": "Peter_Hurford"}}, {"_id": "bupgHTdLHudnmmEzw", "postedAt": "2014-09-18T11:44:15.062Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>Nice post, Peter!</p>\n<p>Asides from seeming boastful, I think the other risk of talking publicly about giving is that it <em>can</em> risk seeming critical, or alienating people. I've definitely found some people respond to me talking about giving defensively - if I say I donate x%, they might look for reasons why I'm being unreasonable, or why my situation is very different from theirs. I think this is because they feel threatened - talking about giving can make some people feel like you are judging them for <em>not</em> giving, which provokes a defensive reaction.</p>\n<p>Of course, in a lot of cases it may be that this risk is outweighed by the benefit of making giving seem more commonplace. And the more people talk about giving, the more of a &quot;social proof&quot; effect you get, and so the less likely this is to be an issue. But I think it's something worth bearing in mind, especially in one-on-one interactions.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "s5AZMAzybWm32Ru3W", "postedAt": "2014-09-18T17:38:59.285Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>Definitely.  I think it takes a good amount of social awareness to decide when and where to announce oneself.  Perhaps a better title for this post is &quot;To Inspire People to Give, Don't Be Overly Anonymous About Your Giving&quot;...</p>\n", "parentCommentId": "bupgHTdLHudnmmEzw", "user": {"username": "Peter_Hurford"}}, {"_id": "HDjhENe7FaZ9q4H7j", "postedAt": "2014-09-19T07:36:12.360Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>I don't recall. Somebody asked this question in the Facebook group, and I tagged people who I believe had more experience in public giving to share their thoughts. Jeff Kaufman wrote he would just tell people that he was donating lots to charities, which charities, and/or why. I'm guessing this was through a combination of in-person conversations, and social media. Apparently the reaction was lukewarm, in that people didn't know how to respond, but it wasn't as if most feedback was negative.</p>\n<p>Ask Jeff something like '<em>why did you switch from actively telling people about your donations to just listing them on your website for people to check on their own?</em>'</p>\n", "parentCommentId": "Eh3GZJDd6W3RGNvuG", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "RsDdibCyyvq8DHTNh", "postedAt": "2014-09-20T19:00:03.903Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>Evan, I feel the same shyness about my giving behaviour. Ironically, is the social standard of being open about giving within the EA community that helps to overcome this.</p>\n", "parentCommentId": "fcawvJeEv4Eq92534", "user": {"username": "ImmaSix"}}, {"_id": "FN7wpJJCCXpwrevpo", "postedAt": "2014-09-20T19:47:32.456Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>To what extent would people turn off if I told them that I give an amount that is unreasonable in their point of view? Or that I sometimes choose to deny myself something because I think I can do much more good to people far away. Making priorities that are not optimal for your own happy and comfortable lifestyle seems to be socially undesirable even if the people near to you don't suffer from it. E.g. I tell I give $x per month, which they would not expect from any sensible person with a modest income and would definitely not see themselves doing. Would it be better if I did not mention any number?</p>\n", "parentCommentId": "bupgHTdLHudnmmEzw", "user": {"username": "ImmaSix"}}, {"_id": "DNBJSRwEsB6yCvp3e", "postedAt": "2014-10-19T17:10:18.366Z", "postId": "5d3td2YpuCiE8L7yr", "htmlBody": "<p>Peter, I agree that more people will be educated, better sooner than later, into giving by example. The main obstacle is that today’s public education systems do not recognize relevance of  effective teaching, in rational-meaningful ways, basic priorities/ values of  social harmony and peace. \nCrucial to any advancement of effective giving is creating sustainable flourishing connectivity among individuals who acknowledge primacy of altruistic inclination for survival and happiness of humanity.  I believe that at this time the focus of our efforts has to be on building connectivity network that will be near-optimal to “receive” all potential participants. \n It seems to me that currently  most adherents of EA ideas, and I am one of them, do not clearly understand,  or has not yet internalized,  what it means to be effectively interconnected as a cohesive pro-altruistic organization.  I wish you, and/or other EA leaders, address the EA group connectivity problem in a separate post or essay. Thank you!</p>\n", "parentCommentId": null, "user": {"username": "Ilya"}}]