[{"_id": "YboLR6muBffqSNhXr", "postedAt": "2014-06-26T05:43:00.000Z", "postId": "5dgFWods87kkE9TpZ", "htmlBody": "<p>I'm curious if you've considered the conjunction fallacy.</p><p>From what I see, there are seven events that could go wrong, for different reasons:</p><p><em> We will never develop the resolve to colonize space\n</em> We cannot fit everything we need to build a civilization into a spaceship\n<em> We cannot get the spaceship going fast enough\n</em> We cannot have enough civilization-building materials remain intact during the voyage\n<em> We cannot slow the spaceship down when we're close to the target\n</em> We cannot build the civilization even after arriving at the target for some reason</p><p>* Some unknown unknown will go wrong</p><p>\nAs you know, even if you claim all seven individual events are unlikely (say 10%), collectively something still could go wrong with probability 52%.</p><p>Thoughts?</p><p>-</p><p>Also, another idea i wanted to ask if you've considered is space cities -- rather than making the long journey to a far flung habitable planet, we just continue to exist in constructed facilities in space, using non-habitable planets for construction materials. Though I haven't thought about it that much...</p>", "parentCommentId": null, "user": {"username": "peterhurford"}}, {"_id": "ZApbgbZCsQ5DgwWM7", "postedAt": "2014-06-26T14:28:00.000Z", "postId": "5dgFWods87kkE9TpZ", "htmlBody": "<p>I haven't done a calculation on that, but I agree it's important to consider. Regarding your calculation, a few of these factors are non-independent in a way that favors space colonization. Specifically:</p><p>\n<em> Speeding up and slowing down are basically the same, so you should just treat that as one issue.\n</em> Fitting everything you need into the spaceship and being able to build a civilization when you arrive are very closely related.\n<em> Having your stuff survive the voyage and being able to build a civilization in a hostile environment are closely related. I would expect that if you can build a civilization when you get there, you can make sure your equipment functions during your voyage.\n</em> Having the capacity to overcome the above problems and the non-existence of a presently unknown fatal obstacle is related to people later deciding whether to do this.</p><p>I also think they're positively related in a more subtle way. There are people who know more about this than you or me who are saying that all these obstacles can be overcome. Conditional on one of these obstacles being possible to overcome (as they say), I have more confidence in their judgment, which makes me more confident that the other obstacles can be overcome.</p><p>Re: space cities, I haven't looked into it much personally. Much of the discussion seems to assume building your civilization on a planet. My intuition is that space cities are probably easier.</p>", "parentCommentId": "YboLR6muBffqSNhXr", "user": {"username": "Nick_Beckstead"}}, {"_id": "CqQATyLHE4JbbF98d", "postedAt": "2014-07-03T16:05:02.000Z", "postId": "5dgFWods87kkE9TpZ", "htmlBody": "<p>[…] How much of humanity’s cosmic endowment can we plausibly make productive use of given AGI? One way to explore this question is via various follow-ups to Armstrong &amp; Sandberg (2013). Sandberg lists several potential follow-up studies in this interview, for example (1) get more precise measurements of the distribution of large particles in interstellar and intergalactic space, and (2) analyze how well different long-term storable energy sources scale. See Beckstead (2014). […]</p>\n", "parentCommentId": null, "user": {"username": "Some_studies_which_could_improve_our_strategic_picture_of_superintelligence"}}, {"_id": "x5YrnRgcwmrQBBSCd", "postedAt": "2014-09-02T07:17:14.000Z", "postId": "5dgFWods87kkE9TpZ", "htmlBody": "<p>[…] Will we eventually be able to colonize the stars? “My impression is that the most informed people thinking about these issues believe that space colonization will eventually be possible, and that they believe this for reasons that make sense to me.” […]</p>\n", "parentCommentId": null, "user": {"username": "Web_Roundup:_Links_For_July_-_My_blog"}}, {"_id": "aQv92KGhAxxqkWWaN", "postedAt": "2015-04-20T22:33:07.252Z", "postId": "5dgFWods87kkE9TpZ", "htmlBody": "<p>Very nice article. Could you please give a link to Carl Shulman's blog post on the economics of space colonization?</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "sLpLGCuFj4Rmk6vqo", "postedAt": "2019-05-18T08:35:19.890Z", "postId": "5dgFWods87kkE9TpZ", "htmlBody": "<p>[I know this post is extremely old but] check this out for some more skeptic points. <a href=\"https://www.antipope.org/charlie/blog-static/2018/07/canned-monkeys-dont-ship-well-.html\">https://www.antipope.org/charlie/blog-static/2018/07/canned-monkeys-dont-ship-well-.html</a> </p>", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "s7vAJmtCj8BbGFmWp", "postedAt": "2022-01-09T10:45:01.448Z", "postId": "5dgFWods87kkE9TpZ", "htmlBody": "<p>[I'm doing a bunch of low-effort reviews of posts I read a while ago and think are important. Unfortunately, I don't have time to re-read them or say very nuanced things about them.]</p><p>I think this still might be the best analysis of an important question for longtermism? But it is also a bit in-the-weeds.</p>", "parentCommentId": null, "user": {"username": "Maxdalton"}}]