[{"_id": "mJ4wtvKcmtkqJMLmg", "postedAt": "2023-08-05T11:25:27.215Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>This is a great write up! Thanks so much for sharing. More orgs would benefit from this level of reflection in their hiring processes.<br><br>I'm especially impressed by:&nbsp;</p><blockquote><ul><li><strong>We processed applications quickly: 16 days from the application deadline to sending out offer letters</strong>.</li><li>We provided feedback on their application to 19/23 people who requested it, from fairly short written feedback to applicants rejected at the first stage, to occasional calls with rejected interviewees.<ul><li>We also passed on some candidates to other fellowships and programs, which may have been quite valuable.</li></ul></li></ul></blockquote><p>A herculean effort! And so so so so useful for applicants to know your decision (and why) super fast. Nicely done!<br>&nbsp;</p><blockquote><p><br>For some applicants, their actual career plans and aspirations differ from the cause area they are in for the fellowship (sometimes people applied to multiple causes but were only accepted in one). We are unsure how best to handle this.&nbsp;</p></blockquote><p>Weird, but is this a product of working on something that specifically targets junior people who are still in career/life exploration mode? Maybe it's not something to worry about too much if so.</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}, {"_id": "NdEPBJcsfjdC322cr", "postedAt": "2023-08-05T11:43:55.645Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Thanks :)\nYes, I think that is right, relatedly some people have more experience in one cause area and so got in there, but were rejected from something they are more interested in or excited by.</p>\n", "parentCommentId": "mJ4wtvKcmtkqJMLmg", "user": {"username": "Oscar Delaney"}}, {"_id": "iuwCjNYqfH69v3wKw", "postedAt": "2023-08-06T16:34:58.907Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<blockquote><p>Even though only the people who did best on the initial application were invited to interviews, there was some positive correlation between initial application and interview scores. If this correlation was very strong, that would be some reason not to do an interview at all and just select people based on their application. This was not the case: the interview changed our ordering of applicants considerably.</p></blockquote><p>You might want to look into <a href=\"https://freddiedeboer.substack.com/p/restriction-of-range-what-it-is-and-why-it-matters\">range restriction</a>. You can dive deep into via <a href=\"https://drive.google.com/file/d/1GQHvy5aK_Nn64ACIQcOb012cg-JDZS9o/view?usp=sharing\">Range Restriction in employment interviews: An influence too big to ignore</a>. But if you just want the simple explanation: correlation is artificially lowered when you only sample the people that pass the initial screen, making the interview appear less effective than it really is. So it is possible (likely?) that you could reasonably not do an interview at all.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "pemaJQJwntMC6uTth", "postedAt": "2023-08-06T16:53:43.312Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Great writeup!</p><p>I especially like that you shared key takeaways, and I strongly approve of \"Evaluate applications one question at a time (rather than one applicant at a time),\" \"Conduct a mock interview with another team member before the real interviews start,\" and \"Use a form that prevents people from submitting answers longer than the word limit.\"</p><p>Regarding feedback, one idea I've been considering is to simply include a checkbox in the application form to allow people to opt in to feedback. It would include some phrasing indicating that feedback isn't guaranteed as a result of ticking the box, so that it is an indication of request rather than a formal agreement. But it also can be a spot for some phrasing about how they agree not to escalate or take legal action.</p><p>The other thing that I've found useful regarding feedback is to have something standardized with examples of what you are looking for. Sofia Balderson at Animal Advocacy Careers has done that really nicely, and it allows a lot more people to get useful feedback without a proportionally increased burden from the hiring team.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "kim2EKJyCkZbWrQvi", "postedAt": "2023-08-06T17:14:34.020Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>\"Evaluate applications one question at a time (rather than one applicant at a time)... This would require marking all applications after the deadline, rather than on a rolling basis.\"</p>\n<p>Super minor comment but I thought I'd highlight that you don't need to do this! It's easy enough to pause and restart evaluating a single question; that's what I do in the programme I run, which had 750 applications this year. (It's true it might introduce a tiny bit more inconsistency, but this is likely minor if you have a clear rubric and potentially worth it for various reasons. Also these downside apply similarly if you're evaluating while applications at a time)</p>\n<p>\"Use a form that prevents people from submitting answers longer than the word limit\"</p>\n<p>Was surprised by this one! Very easy on Google Forms, Paperform and probably most platforms. (Maybe you just meant you forgot to add?)</p>\n<p>PS feel free to reach out next time if you want some external feedback on your application process before you launch! (Forum or jamie@leaf.courses)</p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "oWRx2JhkLDTk6YGmH", "postedAt": "2023-08-07T22:00:53.275Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>When applicants requested feedback, did they do that in the application or by reaching out after receiving a rejection?</p>", "parentCommentId": "pemaJQJwntMC6uTth", "user": {"username": "Rocket"}}, {"_id": "QfsgZbYsW6LPBPuq7", "postedAt": "2023-08-07T22:30:23.324Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Thanks Jamie!\nYes, makes sense that some time lag between batches of marking a particular question is OK.\nHmm good point, I'm not actually sure (I didn't build the application form itself). Our applications were via Rethink Priorities using Pinpoint. But yes I meant that we should have done this not necessarily that we couldn't.\nOK thanks, I'll let the team know of your nice offer!</p>\n", "parentCommentId": "kim2EKJyCkZbWrQvi", "user": {"username": "Oscar Delaney"}}, {"_id": "4hgQBHt6z6ZH7p4fK", "postedAt": "2023-08-07T22:33:33.291Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Thanks!\nOK interesting idea - to your question utilistrutil they did that by reaching out after they were rejected.\nHmm yes perhaps having a more standardised feedback process would work well, though I'm not sure how much of the value would be lost by it not being personalised (or being less personalised). Certainyl something to keep in mind for next time.</p>\n", "parentCommentId": "pemaJQJwntMC6uTth", "user": {"username": "Oscar Delaney"}}, {"_id": "HsaqFqyAWeox79Djb", "postedAt": "2023-08-08T12:28:27.604Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Interesting! I wasn't familiar with this literature, but makes sense now that I see it.</p>\n", "parentCommentId": "iuwCjNYqfH69v3wKw", "user": {"username": "Oscar Delaney"}}, {"_id": "bhcEbCBauJzvTNvHc", "postedAt": "2023-08-09T15:47:29.965Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Can I check my understanding here? It sounds like:</p>\n<p>In a hiring process, later screens are less correlated with applicant future performance than earlier screens (because in general, applicants who do well in your first form screen will do more similarly in the interviews than your applicant pool overall). This does seem like an interesting phenomenon that I hadn't thought about before, thanks :)</p>\n<p>I guess I'm confused what hiring managers are supposed to do about this effect, though. I skimmed the chapter you link but it seemed more relevant for correcting for this when e.g. trying to correct for this when measuring the effectiveness of different interview tools in the wild.</p>\n<p>Would be curious for your off the cuff thoughts (but this is mostly just for my curiosity so no worries if you're busy :) )</p>\n", "parentCommentId": "iuwCjNYqfH69v3wKw", "user": {"username": "Angelina Li"}}, {"_id": "uq53P78dvyHdWLbiq", "postedAt": "2023-08-09T18:22:07.269Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>I think you are roughly correct: the chapter is mainly about using statistics to correct for range restriction.</p><p>My interpretation/takeaway (and my memory from reading this paper a while back) is that many selection methods are less predictive than we think due to using a pre-selected sample (the people that passed some other screen/test). I wish I had some easy actions that a hiring manager could take, but I'm afraid that I don't. I only have vague concepts, like \"be more humble about your methods\" and \"try not to have too much confidence that you have a good system,\" which are not very actionable.</p><p>I've barely started to touch this type of topic and consider myself quite a novice, but there are some people in/connected EA that (I'm guessing) know more about it than I do if you ever want to get more context on it within an EA context. I'm guessing that Bret at Charity Entrepreneurship and Veronica at Rethink Priorities both know more about range restriction than I do, and would have more context of the research and how to apply it. You could also reach out to Brennan Wilkerson; he studied some related stuff as part of his master's degree in Management. Let me know if you want intros to any of these people.</p>", "parentCommentId": "bhcEbCBauJzvTNvHc", "user": {"username": "jlemien"}}, {"_id": "feag8pvdmJZLsWspz", "postedAt": "2023-08-09T18:29:38.197Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>If you like, I could ask Sofia Balderson about sharing her method/model so that you could see how it works, and possibly adapt it. Let me know if you want me to put you in touch with her.</p>", "parentCommentId": "4hgQBHt6z6ZH7p4fK", "user": {"username": "jlemien"}}, {"_id": "MCg6WPxHRdTchwyHe", "postedAt": "2023-08-09T18:40:42.213Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>For the Animal Advocacy Careers scenario, I think the feedback was provided to everyone who was rejected, but I'm not sure about that. I'd estimate maybe a 30% chance that I am wrong.</p><p>For my idea about including a checkbox that allows applicants to opt in to feedback, I haven't put much thought into the specifics about how giving feedback would work. These are rough an unpolished ideas, but I'll do some spitballing:</p><ul><li>Everyone who fills out an application form is prompted to select whether they would like feedback in case of rejection.</li><li>People who are rejected and then reach out to request feedback are usually given feedback, unless we have some specific reason to not give the feedback.</li><li>The feedback itself should lean toward being useful for the applicant. Thus, rather than saying \"you didn't demonstrate strong excel skills in the interview,\" something more like \"you didn't demonstrate strong excel skills in the interview, and here are some links for resources that are good for learning how to do excel at an intermediate/advanced level.\"</li><li>People who reach the later stages of the application process and then &nbsp;are rejected are actively asked if they would like to get feedback from the organization.</li><li>The farther someone gets in the process the more likely they are to get feedback.</li><li>The farther someone gets in the process the more detailed and useful the feedback is.</li><li>I haven't thought much about legal risk, which is a very big area that I want addressed before implementing this.</li></ul>", "parentCommentId": "oWRx2JhkLDTk6YGmH", "user": {"username": "jlemien"}}, {"_id": "sPY4cbzixnEsvefvA", "postedAt": "2023-08-09T21:33:40.552Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Thanks for such a thorough response! I am also curious to hear Oscar's answer :)</p>", "parentCommentId": "MCg6WPxHRdTchwyHe", "user": {"username": "Rocket"}}, {"_id": "c7zo3XxLB6Co8s59g", "postedAt": "2023-08-09T22:31:13.542Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Thanks, I think hold off for now as I am not sure whether this will run next year (quite likely it will) and who will be running it, how it will be structured etc.</p>\n", "parentCommentId": "feag8pvdmJZLsWspz", "user": {"username": "Oscar Delaney"}}, {"_id": "Y7G3wdMPbNRfvACKM", "postedAt": "2023-08-09T22:33:10.632Z", "postId": "5DR89AbnjGjEcYvu8", "htmlBody": "<p>Ah sorry I replied to the parent comment - we only gave feedback to people who requested it. From memory people rejected at the interview stage were told they could request feedback if they wanted, while people rejected before the interview stage were not told this, but sometimes requested and were given short feedback anyway.</p>\n", "parentCommentId": "sPY4cbzixnEsvefvA", "user": {"username": "Oscar Delaney"}}]