[{"_id": "zPdvJDH6B7EDnB5Ld", "postedAt": "2023-09-15T23:45:15.738Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote>\n<p>[libel discussion] ... CEA is in a bad position to take on legal risk.</p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p>My current impression is that many people in the EA ecosystem feel a false sense of safety from the existence of CEA Community Health, hoping that it will pursue justice for them, when (to a first approximation) it will not. While I respect many people on the team and consider some of them friends, my current sense is that the world would probably be better if the CEA Community Health team was disbanded and it was transparent that there is little-to-no institutional protection from bullies in the EA ecosystem, and more people do not get burned by assuming or hoping that it will play that role.</p>\n</blockquote>\n<p>There was a <a href=\"https://forum.effectivealtruism.org/posts/y6BGJGgDDCfospuXE/difficult-to-get-a-job-in-ea-not-living-in-the-west-animal\">recent post</a> about how depending on the country you live, working in animal advocacy could be your comparative advantage as an EA.  I wonder what country has creating a competitor to CEA Community Health as a comparative advantage?</p>\n", "parentCommentId": null, "user": {"username": "chinscratch"}}, {"_id": "65XkPc2QcR97NkxLo", "postedAt": "2023-09-15T23:56:43.996Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Thank you for all your efforts in this endeavor Ben, you’ve performed a very valuable service to the community.</p><p>Your comments about CEA’s Community Health team in this post seem particularly important to me. If CEA’s CH team had in depth knowledge of how Alice and Chloe described their experiences, had found no reason to doubt those accounts, and still declined to make any kind of public statement, that’s incredibly damning. I'm open to hearing CH's take on things, but if that’s actually the case I agree with your view that “the world would probably be better if the CEA Community Health team was disbanded and it was transparent that there is little-to-no institutional protection from bullies in the EA ecosystem.” That’s definitely a new position for me; while I’ve <a href=\"https://forum.effectivealtruism.org/posts/hbejbRBpd6quqnTAB/red-teaming-cea-s-community-building-work-2#Community_Health__2017_present_\">criticized CH work before</a> my prior assumption was that the team could be fixed.</p>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "SwnmyprRXFcseZwtx", "postedAt": "2023-09-16T00:02:27.398Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote><p>four interviewees who gave me some pretty helpful info would only talk to me on the condition that I not share my info with the CEA Community Health team. They didn't trust (what I'm calling) the \"institutionalized whisper network\" to respect them, and some expected that it would hurt their ability to get funding to share any info.</p></blockquote><p>Does the Community Health team have any concerns about this? Do they have a plan to regain trust?&nbsp;</p><p>Because otherwise I don't see what the point of a Community Health team that inspires so much mistrust is. Even if the team was 100% competent, they could not do their jobs effectively without people trusting them.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "8qPZSuj7CmxWtXyEP", "postedAt": "2023-09-16T00:33:27.635Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Thank you for your incredibly hard work here, I know I argued it was a mistake an additional week, but I want to emphasise that I’m nonetheless really glad that you published this post.</p>\n<p>In particular, there are certain claims that I think it was very important for the EA community to have been made aware of and to have the opportunity to deal with. I also hope that the publishing of these claims allows Alice and Chloe to move forward without fear.</p>\n<p>Disclaimer: Previously interned at Non-Linear.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "TXugDDQ2BPKeaB3hT", "postedAt": "2023-09-16T00:33:30.709Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Thank you for doing this Ben. Thank you for navigating a way through all of these issues that have prevented others from doing this.</p>\n", "parentCommentId": null, "user": {"username": "JJ Hepburn"}}, {"_id": "PA7LxKdQCTQCAHuAK", "postedAt": "2023-09-16T00:37:38.330Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Ex remote non-linear intern here: I wasn’t interviewed by Ben, but if I had been, then there’s information I would have shared with Ben, but not community health.</p>\n<p>(Though I have less faith in Ben than before after seeing him publish without waiting a week)</p>\n<p>(I don’t have any direct knowledge of the claims in the post as I was remote and had already finished my internship)</p>\n", "parentCommentId": "SwnmyprRXFcseZwtx", "user": {"username": "casebash"}}, {"_id": "km4NRiyrdPxkkacue", "postedAt": "2023-09-16T01:27:38.967Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>While I think I disagree pretty strongly with the idea CEA CH should be disbanded, I would like to see an updated post from the team on what the community should and should not expect from them, with the caveat that they may be somewhat limited in what they can say legally about their scope.</p>\n<p>Correct me if I'm wrong but I believe CEA was operating without in-house legal counsel until about a year ago. This was while engaging in many situations that could have easily led to a defamation suit should they have investigated someone sufficiently resourced and litigious. I think it makes sense their risk tolerance will have shifted while EVF is under Charity Commission investigation post-FTX and with the hiring of attorneys who are making risk assessments and recommendations across programs.</p>\n<p>The issue for me is less \"are they doing everything I'd like them to do\" and more \"does the community have appropriate expectations for them,\" which is in keeping with the general idea EA projects should make their scopes transparent.</p>\n", "parentCommentId": "65XkPc2QcR97NkxLo", "user": {"username": "Rockwell Schwartz"}}, {"_id": "XzkdZRhsqS2J5uoxj", "postedAt": "2023-09-16T01:43:00.066Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote><p>Though I have less faith in Ben than before after seeing him publish without waiting a week</p></blockquote><p>It seems to me like by publishing it when he did, he acted according to Alice and Chloe's interested who were protected by an earlier publication at a cost to other parties.</p><p>If I were in the position of someone like Alice or Chloe and think about whether or not to talk to Ben, that would make me more likely to talk to Ben not less.&nbsp;</p>", "parentCommentId": "PA7LxKdQCTQCAHuAK", "user": {"username": "ChristianKleineidam"}}, {"_id": "FpKog8qoEzSroQtgv", "postedAt": "2023-09-16T02:08:24.341Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>It seems that a major problem of a competitor to CEA Community Health is that it's harder for someone outside of the US to have the connection to get the necessary information.&nbsp;</p><p>The Wikileaks strategy against defamation suits was to have the spokesperson of the organization be a digital nomad, so there's no address to which you can easily serve papers for lawsuits.&nbsp;</p><p>Otherwise, maybe Scandinavian countries or some Eastern European ones could have a good combination of low legal costs of lawsuits and strong free speech laws.</p><p>Maybe you can do all the money movement for the org in crypto and have no clear country to which the org belongs.&nbsp;</p>", "parentCommentId": "zPdvJDH6B7EDnB5Ld", "user": {"username": "ChristianKleineidam"}}, {"_id": "N44BRWHsucvGyT7KJ", "postedAt": "2023-09-16T02:28:22.567Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote>\n<p>It seems that a major problem of a competitor to CEA Community Health is that it's harder for someone outside of the US to have the connection to get the necessary information.</p>\n</blockquote>\n<p>My assumption was that Community Health work can be done remotely.  Indeed, I suspect the current Community Health team works remotely?</p>\n<p>Living in a convenient time zone (or having a weird sleep schedule) could be important.</p>\n<p>Lack of connections could be a <em>good</em> thing if it helps objectivity.  (Recalling the controversy over the connection between Owen C-B and Julia Wise)</p>\n<p>I assume most people will volunteer information if someone contacts them and says \"we are concerned about your behavior and we are thinking of writing a post about it, but we want to hear from you first\".</p>\n<p>I imagine the best way to gain the community's trust would be to produce detailed writeups like the one Ben produced.  Once the new org has gained trust from producing good writeups, perhaps they can manage a list of people who they suggest to ban from conferences etc.</p>\n<blockquote>\n<p>Maybe you can do all the money movement for the org in crypto and have no clear country to which the org belongs.</p>\n</blockquote>\n<p>Also having minimal assets seems potentially good, so the incentive for a lawsuit is low.</p>\n<p>(Side note: It seems fairly likely to me that the current Community Health team actually does a lot of great work and we just don't hear about it.)</p>\n", "parentCommentId": "FpKog8qoEzSroQtgv", "user": {"username": "chinscratch"}}, {"_id": "qgNDsqe5B2JW6RdPd", "postedAt": "2023-09-16T02:43:41.119Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Another thought regarding building trust for a new org.  (This is a bit of a tangent.)</p>\n<p>In a different subthread, Chris Leong said \"there’s information I would have shared with Ben, but not community health.\"</p>\n<p>Community health work involves both making <em>factual</em> judgments about what occurred, and also <em>value</em> judgments about what constitutes a misdeed or what constitutes an appropriate punishment.</p>\n<p>Insofar as people mistrust CEA Community Health, my guess would be that it's because of disagreements re: the value judgments that CEA Community Health has made.  That's hard to avoid, because value judgments will often be controversial.</p>\n<p>If I was to start an org competing with CEA Community Health, I think I would make it a priority to firewall factual judgments from value judgments.  Focus first on gaining a reputation for making accurate factual judgments, then if you do make value judgments, keep them separate from the factual judgments.  (E.g. \"Our opinion is that...\" or \"Our random polling procedure suggests the median EA thinks that...\" or even \"If you have X values, you are likely to feel Y about this situation\" for various different values of X.)</p>\n", "parentCommentId": "N44BRWHsucvGyT7KJ", "user": {"username": "chinscratch"}}, {"_id": "7EXrGnfFXq6wLzPYo", "postedAt": "2023-09-16T04:37:34.538Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Appreciate the comment. I sadly decided to edit out a few bullets on that to check in on what's okay to share. That's my fault, I will make sure to leave a new comment when I am able to add them back in, probably in a day or two (but might be longer).</p>", "parentCommentId": "65XkPc2QcR97NkxLo", "user": {"username": "Ben Pace"}}, {"_id": "uEmgREudnpWt7sbJn", "postedAt": "2023-09-16T05:54:42.656Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Thanks this reflection was really useful and demonstrated the extent of how d complicated and messy this kind of investigative work is practically and emotionally.</p>\n<p>It might just be a personal thing, but this line near the end jarred with me a bit.</p>\n<p>\"i'm open to trades, and my guess is that if you wanted to pay Lightcone around $800k/year, it would be worth it to continue having someone (e.g. me) do this kind of work full-time.\"</p>\n<p>I'm not completely sure why this jarred, but maybe it's that bringing in even tangentially an odd fundraising option for your org on the back of a messy and hard situation didn't seem right. I'm also not sure trading a lot of money to do a job which you \"don't really want to do\" is the best idea either.</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "JerpWbmoqkEtoEjhi", "postedAt": "2023-09-16T06:01:44.353Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I guess there’s a difference between being the person who was hurt vs. someone on the sidelines who has general information about how someone is like as a boss.</p>\n<p>If you’ve been hurt, then you would probably want someone to fight for your side. If you’re on the sidelines, you might want someone who’s trying their best to form a fair picture overall. You might not want to share anything that could be used to paint an unfairly negative picture.</p>\n", "parentCommentId": "XzkdZRhsqS2J5uoxj", "user": {"username": "casebash"}}, {"_id": "Jg6FnWmDgtjrJsaob", "postedAt": "2023-09-16T07:14:05.661Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Is community health UK or USA based? UK has laws that make winning libel cases easy (at least historically, I think there's been some movement), but USA has very strong protecting for speech. I doubt there's many countries that would be much better than USA, unless the comparative advantage is a non-functional legal system. Perhaps a state with stronger anti-SLAP laws could work though?</p>\n", "parentCommentId": "zPdvJDH6B7EDnB5Ld", "user": {"username": "jooke"}}, {"_id": "KY2fum7G59pzhZrkS", "postedAt": "2023-09-16T07:19:23.725Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I'd like to see more of an analysis of where we are now with what people want from CH, what they think it does, and what it actually does, and to what extent and why gaps exist between these things, before we go too deep into what alternative structures could exist. Currently I don't feel like we really understand the problem well enough to solve it.</p>\n", "parentCommentId": "qgNDsqe5B2JW6RdPd", "user": {"username": "BenMillwood"}}, {"_id": "NogvzxJwYjSPmv2ZC", "postedAt": "2023-09-16T07:21:46.409Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Thanks for all your work Ben.&nbsp;</p><p>But a glum aphorism comes to mind: the frame control you can expose is not the true frame control.</p>", "parentCommentId": null, "user": {"username": "technicalities"}}, {"_id": "yWeFom5djBmwHyMXp", "postedAt": "2023-09-16T07:36:29.656Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>The closing remarks about CH seem off to me.&nbsp;</p><ol><li>Justice is incredibly hard; doing justice while also being part of a community, while trying to filter false accusations and thereby not let the community turn on itself, is one of the hardest tasks I can think of.&nbsp;<br>So I don't expect disbanding CH to improve justice, particularly since you yourself have shown the job to be exhausting and ambiguous at best.&nbsp;<br>You have, though, rightly received gratitude and praise - which they don't often, maybe just because we don't often praise people for doing their jobs. I hope the net effect of your work is to inspire people to speak up.<br>&nbsp;</li><li>The data on their performance is profoundly censored. You simply will not hear about all the times CH satisfied a complainant, judged risk correctly, detected a confabulator, or pre-empted a scandal through warnings or bans. What denominator are you using? What standard should we hold them to? You seem to have chosen \"being above suspicion\" and \"catching all bullies\".<br>&nbsp;</li><li>It makes sense for people who have been hurt to be distrustful of nearby authorities, and obviously a CH team which isn't trusted can't do its job. But just to generate some further common knowledge and meliorate a distrust cascade: I trust CH quite a lot. Every time I've reported something to them they've surprised me with the amount of skill they put in, hours per case. (EDIT: Clarified that I've seen them work actual cases.)</li></ol>", "parentCommentId": null, "user": {"username": "technicalities"}}, {"_id": "NMpBQvh9yCmwNQZFc", "postedAt": "2023-09-16T07:40:17.214Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I appreciate you doing this Ben. I had some very vague concerns, as did several acquaintances I spoke to over the last couple years. My default move would be to share concerns with a charity's trustees, so I tried to look up Nonlinear's in case I or someone else would need to contact them, but I found out they weren't registered as a charity and I didn't have any other way of finding out if there was anyone overseeing Kat and Emerson in any meaningful sense.</p>\n<p>I do think that the majority of EA organisations have either a non-profit or for-profit board, or are being incubated inside of a larger org with one of those things, so that should give most organisations a bit clearer  accountability. I think Nonlinear was uniquely difficult.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "6EcsFjdrPtvr4TdGm", "postedAt": "2023-09-16T08:17:46.118Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>With regards to 2: There is some information CH has made public about how many cases they handle and what actions they take. In a 12 month period around 2021, they handled 19 cases of interpersonal harm. Anonymized summaries of the cases and actions taken are available in the appendix of <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in\">this post</a>. They ranged from serious:</p><blockquote><p>A person applied to EA Global who had previously been reported for deliberately physically endangering another community member, sending them threatening messages, and more. Written correspondence between the people appears to confirm this. I discussed with both of them separately, and told the person they cannot come to CEA events including EA Global.</p></blockquote><p>to out of scope:</p><blockquote><p>A community member asked for help in publicly documenting various bad things people outside EA have done to them. I explained I don’t have capacity to help with this.</p></blockquote>", "parentCommentId": "yWeFom5djBmwHyMXp", "user": null}, {"_id": "PnLMqh4P9e64auh3o", "postedAt": "2023-09-16T08:24:30.814Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Oh great, thanks. I would guess that these discrete cases form a minority of their work, but hopefully someone with actual knowledge can confirm.</p>", "parentCommentId": "6EcsFjdrPtvr4TdGm", "user": {"username": "technicalities"}}, {"_id": "vb4DTCpud64jfLwK6", "postedAt": "2023-09-16T14:43:36.171Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Let me know if you'd like me to remove my comment while this gets sorted out.</p>", "parentCommentId": "7EXrGnfFXq6wLzPYo", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "JyzKkDRr3LhxnTK5o", "postedAt": "2023-09-16T14:46:09.816Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Whether or not CEA/EV had in-house counsel, I’d like to think they had an ability to access legal advice. If not, that seems like a poorly thought out setup.</p><p>I agree it makes sense for EV to have a lower risk tolerance in light of the Charity Commission investigation. However, I’m making the following assumptions (it would be great if a lawyer could opine on whether they are accurate):</p><ol><li>There are simple steps CH could have taken that would carry very little risk of a defamation suit. For instance, I find it hard to believe CH would be liable if they’d issued a public statement along the lines of “Alice and Chloe report XYZ about Nonlinear; Nonlinear disputes these claims. CH is not publicly picking a side but wants to make people aware of the dispute.” Maybe Alice and Chloe would have objected to that kind of statement, but it seems like it wouldn’t have material defamation risk (though again, I’m not a lawyer).</li><li>Inaction by CH could also carry legal risk. For example, if CH hears credible complaints against an org that is still allowed to come to EAG (an event run by CH's CEA colleagues), and then someone joins that org at EAG and subsequently suffers the same treatment that CH was aware of, I imagine CEA/CV could in some cases have liability if that person wanted to sue.&nbsp;</li></ol>", "parentCommentId": "km4NRiyrdPxkkacue", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "ezpv2NDCKXEtCDBor", "postedAt": "2023-09-16T14:55:12.409Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote><p>I would like to see an updated post from the team on what the community should and should not expect from them, with the caveat that they may be somewhat limited in what they can say legally about their scope.</p></blockquote><p>Agree this would be helpful. In addition to clarifying what community expectations should be, I’d like to know whether the Nonlinear affair will be included either or both of the <a href=\"https://forum.effectivealtruism.org/posts/CAC8zn292C9T5aopw/community-health-and-special-projects-updates-and-contacting-1#External_investigation_and_internal_review\">internal and external reviews</a> that are (were?) being conducted. And if so, would that inclusion have taken place if Ben hadn’t published his post?</p>", "parentCommentId": "km4NRiyrdPxkkacue", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "aMiodW2mumjEAXrJC", "postedAt": "2023-09-16T17:25:59.230Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote>\n<p>I find it hard to believe CH would be liable if they’d issued a public statement along the lines of “Alice and Chloe report XYZ about Nonlinear; Nonlinear disputes these claims. CH is not publicly picking a side but wants to make people aware of the dispute.”</p>\n</blockquote>\n<p>In that example, what would CH be adding relative to Alice and Chloe making the public statement themselves? For example, if the idea is that people will give the report greater weight because it comes via CH and people know that CH wouldn't host a report like this if they didn't give it some credence, then that sounds (not a lawyer) potentially libelous, especially with how strict the UK is in this area.</p>\n<p>(Disclosure: married to a CH team member)</p>\n", "parentCommentId": "JyzKkDRr3LhxnTK5o", "user": {"username": "Jeff_Kaufman"}}, {"_id": "iWJg8z78HLDtcsHCh", "postedAt": "2023-09-16T17:55:53.434Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote><p>But a glum aphorism comes to mind: the frame control you can expose is not the true frame control.</p></blockquote><p>I think it's true that frame control (or, manipulation in general) tends to be designed to make it hard to expose, but, I think the actual issue here is more like \"manipulation is generally harder to expose than it is to execute, so, people trying to expose manipulation have to do a lot of disproportionate work.\"</p>", "parentCommentId": "NogvzxJwYjSPmv2ZC", "user": {"username": "Raemon"}}, {"_id": "4TeFavqgHgdfmFbW8", "postedAt": "2023-09-16T18:15:41.609Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>First, CEA definitely have access to legal counsel.</p>\n<p>Second, I don’t think these issues are that relevant, after reading Ben’s posts.</p>\n<p>Regardless of legal risk, the reasons for not making claims public are clear -</p>\n<p>(A) It took Ben hundreds of hours to feel confident and clear enough to make a useful public statement while also balancing the potential harms to Alice and Chloe. This is not uncommon in such situations and I think people should not expect CH to be able to do this in most cases.</p>\n<p>(B) CEA is not in charge of Nonlinear or most other EA orgs. Just like Ben tried to be responsible for behavior in his offices and ended up down a rabbit hole, CEA tries to be responsible for behavior at their events, and has to choose which rabbit holes to go down. As Ben has said, they are not the EA police.</p>\n<p>I agree it would be good to be clear about what jobs they are not doing, but think it would absolutely be worse to have no people in EA paid to work on similar issues rather than 2-3 people who still cannot do all of the work people might ask of them.</p>\n", "parentCommentId": "JyzKkDRr3LhxnTK5o", "user": {"username": "nananana.nananana.heyhey.anon"}}, {"_id": "azYeAD5RKrCWsEBm9", "postedAt": "2023-09-16T18:25:09.354Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>The comments/arguments about the community health team mostly make me think something more like \"it should change its name\" than be disbanded. I think it's good to have a default whisper network to report things to and surreptitiously check in with, even if they don't really enforce/police things. If the problem is that people have a false sense of security, I think there are better ways to avoid that problem.</p><p>Just maintaining the network is probably a fair chunk of work.</p><p>That said – I think one problem is that the comm-health team has multiple roles. I'm honestly not sure I understand all the roles they consider themselves to have taken on. But it seems likely to me that at least some of those roles are \"try to help individuals\" and at least some of those roles are more like \"protect the ecosystem as whole\" and \"protect the interests of CEA in particular\", and those might come into conflict with the \"help individuals\" one. And it's hard to tell from the outside how those tradeoffs get made.</p><p>I know a person who maintained a whisper network in a local community, who I'd overall trust more than CEA in that role, because basically their <i>only </i>motivation was \"I want to help my friends and have my community locally be safe.\" And in some sense this is more trustworthy than \"also, I want to help the world as a whole flourish\", because there's fewer ways for them to end up conflicted or weighing multiple tradeoffs.</p><p>But, I don't think the solution can necessarily be \"well, give the Whisper Network Maintenance role to less ambitious people, so that their motives are pure\", because, well, less ambitious people don't have as high a profile and a newcomer won't know where to find them.&nbsp;</p><p>In my mind this adds up to \"it makes sense for CEA to keep a public-node of a whisper network running, but it should be clearer about it's limitations, and they should be upfront that there are some limits as to what people can/should trust/expect from it.\" (and, ideally there should maybe be a couple different overlapping networks, so in situations where people don't trust CEA, they have alternatives. i.e. <a href=\"https://forum.effectivealtruism.org/posts/HB2zD5mu7ynXnD63u/healthy-competition\">Healthy Competition</a> is good, etc)</p>", "parentCommentId": null, "user": {"username": "Raemon"}}, {"_id": "QJF4f6jet5M6ftAta", "postedAt": "2023-09-16T18:58:50.945Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I assume this trust difference is due to perceived or real value differences among different EAs, not rampant mistrust of CH among all EAs. Trust would only be shifted around rather than “solved” by having different people in CH roles.</p>\n<p>I was not interviewed or involved in this situation but I have asked Julia and Catherine for support on other issues and felt supported. While Chris would share more things with Ben than he would share with CH, I would share more things with the current CH team than I would share with Ben. Chris trusts Ben more; I trust CH more.</p>\n<p>I respect many things about Ben based on his writing (and I would be more willing to talk to him now after reading about his experiences with Alice and Chloe), but I would still reach out to CH team members first. It’s not a critique of Ben, it’s just a fact based on our different views and experiences. I assume there are plenty of people like me and plenty of people like Chris, though I don’t know the distribution.</p>\n<p>Because EA includes people with a variety of values, uniformity of trust in just 2-3  individuals should not to be expected. That said, if someone could hire Ben to be a more trusted CH rep to the people who do trust him more, I’m sure they would. If we could do that for all the sub-communities in EA, we likely would. But Ben, and most others!, don’t want that job as he’s said.</p>\n<p>Maybe Chris also prefers Ben’s independence from CEA. I do wonder if there’s an argument for making a CH investigative team more independent from CEA but that has pros and cons.</p>\n<p>I don’t see a reason to think that dismantling a team that others do indeed trust will make things better.</p>\n", "parentCommentId": "SwnmyprRXFcseZwtx", "user": {"username": "nananana.nananana.heyhey.anon"}}, {"_id": "nsh2Nf6AjG3FoCuJZ", "postedAt": "2023-09-16T19:53:53.405Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Noted. FYI <a href=\"https://www.lesswrong.com/posts/4EGYhyyJXSnE7xJ9H/in-my-culture\">in my culture</a> it's considered pro-social to let people know what trades you'd be up for and what price.&nbsp;</p><p>Also, and there's a good chance that this isn't the main thing you're responding to, but FWIW we're not doing active fundraising any more (as we were successful at getting our basic needs met for continuing), so this isn't like me trying to get my salary fundraised or anything like that.</p>", "parentCommentId": "uEmgREudnpWt7sbJn", "user": {"username": "Ben Pace"}}, {"_id": "Ki5revNLg9CEMAK5r", "postedAt": "2023-09-16T20:13:27.434Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I did some more research and 20 complaints a year of varying severity is typical, according to what Julia Wise told TIME magazine for their <a href=\"https://time.com/6252617/effective-altruism-sexual-harassment/\">article</a>:</p><blockquote><p>Wise, whose role at CEA involves overseeing community well-being, tells TIME she has fielded <strong>roughly 20 complaints per year in her seven years on the job, ranging from uncomfortable comments to more serious allegations of harassment and more</strong>. But with no official leadership structure, no roster of who is and isn’t in the movement, and no formal process for dealing with complaints, Wise argues, it’s hard to gauge how common such issues are within EA compared to broader society.</p></blockquote>", "parentCommentId": "PnLMqh4P9e64auh3o", "user": null}, {"_id": "TZhWM6wgRdbaRwTgZ", "postedAt": "2023-09-16T23:19:50.594Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Julia here from the community health team. As you might guess, we have a pretty different view on some of Ben's takes about our team. There are a variety of things that make this difficult to discuss publicly; we'll see if we can say more at some point. For now, we wanted to say that we're following the conversation and thinking a lot about these questions.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "hBbN6bBcPEpABAejK", "postedAt": "2023-09-17T01:02:58.409Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Some brief reactions:</p><ol><li>I mostly don't like the 'justice' process involved in other cases insofar as it is primarily secret and hidden. I don't think it's much of a justice system where you often don't know the accusations against you or why you're being punished.</li><li>The data on negative performance is also profoundly censored! I am not sure why you think this makes this more likely to make me update positively on the process involved.</li><li>I am pro having some surveys of people's general attitudes toward CEA Community Health. Questions like \"Have you ever reported an issue to them\" and \"To your knowledge have you been investigated by the CEA Community Health team\" and \"How much do you trust CEA Community Health team to protect the EA ecosystem from bad behavior\" and \"How much do you trust CEA Community Health team to respect you if you go to them\" and \"For how many years have you been involved in the EA ecosystem\". I think that would clear up this question substantially.</li></ol>", "parentCommentId": "yWeFom5djBmwHyMXp", "user": {"username": "Ben Pace"}}, {"_id": "o58nYFntzTW8dts6f", "postedAt": "2023-09-17T01:04:16.474Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Thanks for saying that, but no request from me. (And my guess is it'll be fine and I'll add my bullets back in a day or so.)</p>", "parentCommentId": "vb4DTCpud64jfLwK6", "user": {"username": "Ben Pace"}}, {"_id": "C9hN8bFHoPca3pHtp", "postedAt": "2023-09-17T01:56:17.046Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I wouldn't surprise me if active Less Wrong members were more favourable disposed towards Ben than other people.</p>", "parentCommentId": "QJF4f6jet5M6ftAta", "user": {"username": "casebash"}}, {"_id": "K4NXsemXgdwyT34NK", "postedAt": "2023-09-17T02:28:22.579Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Fwiw, seems like the positive performance is more censored in expectation than the negative performance: while a case that CH handled poorly could either be widely discussed or never heard about again, I'm struggling to think of how we'd all hear about a case that they handled well, since part of handling it well likely involves the thing not escalating into a big deal and respecting people's requests for anonymity and privacy.</p><p>It does seem like a big drawback that the accused don't know the details of the accusations, but it also seems like there are obvious tradeoffs here, and it would make sense for this to be very different from the criminal justice system given the difference in punishments (loss of professional and financial opportunities and social status vs. actual prison time).</p><p>Agreed that a survey seems really good.</p>", "parentCommentId": "hBbN6bBcPEpABAejK", "user": {"username": "levin"}}, {"_id": "ELoDCiiwG84WMbhqG", "postedAt": "2023-09-17T06:08:01.712Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Thanks, appreciate the response and that makes sense.</p>\n", "parentCommentId": "nsh2Nf6AjG3FoCuJZ", "user": {"username": "NickLaing"}}, {"_id": "gfLxTqFJQTQCvbFsJ", "postedAt": "2023-09-17T08:00:22.175Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I really appreciate what you said about the community health team. I reported what I viewed as serious misconduct that they had jurisdiction over, and very little was done about it.&nbsp;</p><p>I trusted them based on what I understood to be their reputation. So it really broke me when, despite them saying they took my allegation seriously, they did not treat it as if they took it seriously. Their non-response was a massive contributor to what were some of the worst months of my life. I am still recovering.</p><p>That's not to say anyone should completely write them off based on my account. I'm posting this anonymously with no details, and so there is absolutely no reason to trust my account of things. There is no reason to believe that I am perceiving the situation accurately/reasonably.&nbsp;</p><p>One piece of detail I'll provide is that the nature of the misconduct involved repeated threats.</p><p>But I do wish people trusted them less. I think it could have saved me a lot of pain if I knew going in that they had a mixed reputation. If I had gone in with some uncertainty about how much I should have relied on them. I could have set better expectations.</p>", "parentCommentId": null, "user": {"username": "KnitKnack"}}, {"_id": "JWk7ToaBjXkwJkibg", "postedAt": "2023-09-17T16:07:33.135Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>If initial due diligence conducted by an independent third party didn’t uncover obvious evidence about which side is correct, IMO that’s very helpful info for the broader community and it really seems like there should be a way of expressing that in a way that doesn’t introduce legal liability.</p>", "parentCommentId": "aMiodW2mumjEAXrJC", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "rRhxW4WJr6FECndMm", "postedAt": "2023-09-17T16:37:52.079Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>So would you say that although you have less faith in Ben than before, Alice and Chloe should have more faith in him? That seems wrong to me; I feel like \"faith\" in context should cash out as something less interpersonal than that? Like it should be a prediction about how Ben will act in future situations. Then \"Alice should have more faith in Ben than me\" sounds like a prediction that in future Ben will favor team Alice over team Chris; but that's not a prediction I'd make and I don't think it's a prediction you'd make.</p>\n<p>(It does seem reasonable to predict something like \"in future, Ben will favor team person-who-was-hurt over team person-on-sidelines-who...\". But I don't think that's where you're going with this either?)</p>\n", "parentCommentId": "JerpWbmoqkEtoEjhi", "user": {"username": "philh"}}, {"_id": "yhmPufYSckeNXxTeb", "postedAt": "2023-09-18T17:40:21.037Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Hi KnitKnack - I’m really sorry to hear you had a bad experience with the CH team, and that it contributed to some especially bad moments in your life. I totally endorse that people should have accurate expectations, which means that they should not expect we’ll always be able to resolve each issue to everyone’s satisfaction. I think that even in worlds where we did everything quote-unquote “right” (in terms of fair treatment of each of the people involved, and the overall safety and functioning of the community), some people would be disappointed in how much we acted or what we did, and all the more so in worlds where we made mistakes. If you’d like to talk about the situation you were in, feel free to contact me as the manager of the team members handling situations like this; I’d be interested to hear your feedback (happy to do this anonymously, such as through the forum). Entirely understandable if you’d rather not, though, and I wish you all the best.</p>", "parentCommentId": "gfLxTqFJQTQCvbFsJ", "user": {"username": "ChanaMessinger"}}, {"_id": "NXE4DvJTBvLtZ8toG", "postedAt": "2023-09-18T23:23:14.606Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Pre-committing to not elaborating further, but I wanted to echo what is said in this comment and give a non-anonymous account as someone who (due to personal experience with reporting misconduct) also has similar feelings as KnitKnack.</p><p><strong>Edit</strong>: I think <a href=\"https://forum.effectivealtruism.org/posts/5dW9p5EahtfhdiSKF/closing-notes-on-nonlinear-investigation?commentId=sHef5SbFEMwsGifoE\">Chana's comment</a> is helpful context i.e. it seems good if people's expectations going in are calibrated to CEA CH's position is that it is there to \"address problems that could prevent the effective altruism community from fulfilling its potential for impact\".</p><p>In particular, they \"don’t see pursuing justice as [their] mission\" and \"protecting people from bullies is sometimes a part of [their] work, and something [they'd] always like to be able to do, but it’s not [their] primary goal\".</p><p>On a personal note, my advice to people who are considering going to CEA CH is to keep this in mind. To the extent to which there is a trade-off between impact and justice, it may not resolve in a way that is \"just\" from your POV, and their work on interpersonal harm does <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in\">take the talent bottleneck seriously</a> e.g. you should probably think about what they perceive the potential impact of the perpetrator to be.</p>", "parentCommentId": "gfLxTqFJQTQCvbFsJ", "user": {"username": "tmychow"}}, {"_id": "fuzhgfsiRRTcwka3L", "postedAt": "2023-09-19T14:39:03.068Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Yeah, I think it is actually incredibly easy to undervalue CH, particularly if people don't regularly interact with it or make use of them rather than just having a single anecdata to go off of. So much of what I do in the community (everything from therapy to mediation to teaching at the camps) is made easier by Community Health, and no one knows about any of it because why would they? I guess I should make a post to highlight this.</p>", "parentCommentId": "yWeFom5djBmwHyMXp", "user": {"username": "Daystar Eld"}}, {"_id": "sHef5SbFEMwsGifoE", "postedAt": "2023-09-19T16:10:03.192Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>I’m Chana, a manager on the Community Health team. This comment is meant to address some of the things Ben says in the post above as well as things other commenters have mentioned, though very likely I won’t have answered all the questions or concerns.&nbsp;</p><p><i>High level</i></p><p>I agree with some of those commenters that our role is not always clear, and I’m sorry for the difficulties that this causes. Some of this ambiguity is intrinsic to our work, but some is not, and I would like people to have a better sense of what to expect from us, especially as our&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/CAC8zn292C9T5aopw/community-health-and-special-projects-updates-and-contacting-1\"><u>strategy develops</u></a>. I'd like to give some thoughts here that hopefully give some clarity, and we might communicate more about how we see our role in the future.</p><p>For a high level description of our work: We aim to address problems that could prevent the effective altruism community from fulfilling its potential for impact. That looks like: taking seriously problems with the culture, and problems from individuals or organizations; hearing and addressing concerns about interpersonal or organizational issues (primarily done by our&nbsp;<a href=\"https://www.centreforeffectivealtruism.org/community-health/contact-us\"><u>community liaisons</u></a>); thinking about community-wide problems and gaps and occasionally trying to fill those; and advising various actors in the EA space based on the information and expertise we have. This work allows us to address specific problems, be aware of concerning actors, and give advice to help the community do its best work.&nbsp;</p><p><i>Context on our responses</i></p><p>Sometimes we have significant constraints on what we can do and say that result in us being unable to share our complete perspective (or any perspective at all). Sometimes that is because people have requested that we keep some or all information about them confidential, including what actions our team has taken. Sometimes it is because us weighing in will increase public discussion that could be harmful to some or all of the people involved. This information asymmetry can be particularly tricky when someone else in the community shares some information about a situation that we think is inaccurate or is only a small part of the picture, but we’re not in a position to correct it. I’m sorry for how frustrating this can be.<br><br>I imagine this might end up being relevant to responses to this comment (and which and how and when we respond to them), so I think it’s useful to highlight.&nbsp;</p><p>I’ll also flag that many of our staff are at events for the next two weeks, so it might be an especially slow time for Community Health responses.</p><p><i>About what to expect</i></p><ol><li>I think some of the disagreements here come from different understanding of what the Community Health team’s mission is or should be. We want to hear and (where possible) address problems in the community, at the interpersonal, organizational, and community levels. But we often won’t resolve a situation to the satisfaction of everyone involved, or do everything that would be helpful for individuals who were harmed. Ben mentions people “hoping that it [Community Health] will pursue justice for them.” I want to be totally upfront that we don’t see pursuing justice as our mission (and I don’t think we’ve claimed to). In the same vein, protecting people from bullies is sometimes a part of our work, and something we’d always like to be able to do, but it’s not our primary goal and sadly, we won’t always be able to do it.<br>&nbsp;</li><li>We don’t want people to have a false impression of what they can expect from talking to us.<ul><li>Sometimes people come to us with a picture of what they’d like to happen, but we won’t always take the steps they hope we’ll take, either because 1) we don’t agree that those steps are the right call, 2) we’re not willing to take the steps based on the information we have (for example if we don’t have their permission to ask for the other person’s side of the story), or 3) the costs (time, legal risk etc) are too great. We generally explain our considerations to the people involved, but could probably communicate better about this publicly, and as we continue thinking about strategic changes, we’ll want to give people an accurate picture of what to expect.&nbsp;</li><li>(At other times people come to us without specific steps they’d like us to take. Sometimes they think something should be done, but don’t know what is feasible, other times they share information as “I don’t think this is very bad and don’t want much to be done, but I thought you should know and be able to look for patterns”, which can be quite helpful.)</li><li>We talk about confidentiality and what actions we might be able to take by default in calls. Typically this results in people deciding to go forward with working with us, but some people might decide that what we’re likely to be able to provide isn’t a good match for their situation.</li></ul></li><li>I don't think the downside of a false sense of security people might get from our team's existence is strong enough to counteract the benefits.</li><li>It’s true that we rarely write up our findings publicly. I don’t take that as damning since I don’t think that is or should be the default expectation. I think public writeups can be a valuable tool in some cases, but often there are good reasons to use other tools instead.&nbsp;<ul><li>One main reason is the large amount of time they take — Ben pointed out that he didn’t necessarily endorse how much time this project took him, but that it was really hard to do less.</li></ul></li><li>I agree with Ben that we aren’t the EA police. We have some levers we can pull related to advising on a number of decisions, and we do our best to use these to address problems and concerns. I think describing occasions that we use the information we have as “rare” is very much not reflective of the reality of our day-to-day work.&nbsp;&nbsp;</li><li>I’m sad to read in some comments that we didn’t satisfy people’s needs or wants in those situations. I’m very open to receiving feedback, concerns or complaints in my capacity as a manager on the team - feel free to message me on the forum or email&nbsp;<a href=\"mailto:chana.messinger@centreforeffectivealtruism.org\"><u>me</u></a> (including&nbsp;<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdLnp5LVp0WwCOVKDHEZwh-5NPHz-ZwJEqsMe_Z38MPO8tUEg/viewform\"><u>anonymously</u></a>). I recognize someone not wanting to talk to the Community Health team might not want to share feedback with that same team, but I want the offer available for anyone who might. You can also send feedback to CEA interim CEO Ben West&nbsp;<a href=\"https://admonymous.co/xodarap\"><u>here</u></a>.&nbsp;<ul><li>I also think not feeling satisfied with our actions is plausibly a normal outcome even if everything is going well - sometimes the best available choice won’t make everyone (or anyone) happy. I definitely want people to come in expecting that they might not end up happy with our choices (though I think in many cases they are).&nbsp;</li><li>Again, if people think we’re making wrong calls, I’m interested to hear about it. Under some circumstances we can also re-review cases.</li></ul></li></ol><p><i>Regarding trust</i></p><ol><li>We're aware that some people might feel hesitant to talk to us (and of course, it’s entirely up to them). There are many understandable reasons for this (even if our team was flawless). Our team isn’t flawless, though, which means there are likely additional cases where people don’t want to talk to us, which I’m sad about. I don’t know how much of a problem this is.</li><li>In particular, we are worried to hear that some people didn’t feel that they’d be treated with respect (I can’t tell if they mean by our team or the general institutional network we’re a part of, or something else). In this case, it sounds like potentially they aren’t confident we’d handle their information well or treat them respectfully. If that is what they meant, that sounds like a bad (and potentially stressful) situation and I’m really sorry to hear about it. I could imagine there being a concerning pattern around this that we should prioritize learning about and working on. If at any point people wanted to share information on the reasons they wouldn’t talk to us, I’m interested (including anonymously -&nbsp;<a href=\"https://www.centreforeffectivealtruism.org/community-health/contact-us\"><u>here for the community liaisons</u></a>,&nbsp;<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdLnp5LVp0WwCOVKDHEZwh-5NPHz-ZwJEqsMe_Z38MPO8tUEg/viewform\"><u>here</u></a> for me personally and&nbsp;<a href=\"https://admonymous.co/xodarap%20Away\"><u>here</u></a> for Ben West, interim CEO of CEA).</li><li>People might also worry that we’d negatively update our perception of them if they were implicated in something. (This is one of the reasons people might not want to speak to us that might be implied by this post, though I am not at all sure this is what was meant). I don’t currently think we should have a strict policy of amnesty for any concerning information people provide about themselves, though we in fact try hard to not make people regret talking to us. (Strict amnesty of that kind would probably result in less of us doing things about issues we hear about and make Ben’s concerns worse rather than better, though I haven’t gone and researched this question.)</li><li>In general, we care a lot about not making people regret speaking to us and not pressuring people to do or share more than they're comfortable with. These are big elements of why we sometimes do less than we’d like, since we don’t want to take actions they’re not comfortable with, or push them to stay involved in a situation they’d like to be done with, or to do anything that would cause them to be worried we might inadvertently deanonymize them.</li><li>My general sense (though of course there are selection effects here) is that people who talk to our team in person or on calls about our decision making often end up happier and finding us largely reasonable. I haven’t figured out how to do that at scale e.g. in public writing.<br>&nbsp;</li></ol><p>Thanks all for your thoughts and feedback.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "Jzvwj8ibH364NW7Rd", "postedAt": "2023-09-20T20:08:27.747Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>In case you missed it, and you're interested. I've put some updates relating to the the <a href=\"https://www.centreforeffectivealtruism.org/community-health\">Community Health and Special Projects Team</a>&nbsp;thinking and actions about concerns about Nonlinear on <a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear\">Ben's initial post</a>.&nbsp;</p><ul><li><a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear?commentId=zjiZYrW96tqFkhMLM\"><u>General statement</u></a> (10th Sept)</li><li><a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear?commentId=o8ro4fdAikNmqHKvZ\"><u>An incomplete list of actions we’ve taken</u></a> to reduce risk of other people ending up in similarly bad situations (11th Sept)</li><li><a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear?commentId=PyyPM7TxZ9hfEj36w\">Rough timeline and thinking</a> (New - 20th Sept)</li></ul>", "parentCommentId": null, "user": {"username": "cafelow"}}, {"_id": "2NLGqBsWDMaxdQTd2", "postedAt": "2023-09-22T21:23:42.381Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote><p>But we often won’t resolve a situation to the satisfaction of everyone involved, or do everything that would be helpful for individuals who were harmed. Ben mentions people “hoping that it [Community Health] will pursue justice for them.” I want to be totally upfront that we don’t see pursuing justice as our mission (and I don’t think we’ve claimed to). In the same vein, protecting people from bullies is sometimes a part of our work, and something we’d always like to be able to do, but it’s not our primary goal and sadly, we won’t always be able to do it.</p></blockquote><p>A design decision to not have \"justice\" or \"countering bullies\" seems sort of big and touches on deep subjects.&nbsp;</p><p>I guess this viewpoint above could be valid and deep, (but I'm slightly skeptical the comm. health team has that depth).</p><p>It seems possible that, basically, just pursuing justice or countering bullies in a straightforward way might be robustly good and support other objectives. Honestly, it doesn't seem that complicated, and its slightly a yellow flag if it is hard in EA.</p><p>I think writing on this (like Julia W's writing on on her considerations, not going to search it up but it was good). Such a piece would (ideally) show wisdom and considerations that is illuminating.</p><p>I'll try to produce something, maybe not under this name or an obvious form.</p>", "parentCommentId": "sHef5SbFEMwsGifoE", "user": {"username": "Defacto"}}, {"_id": "fWrjHDr5MKyXBu5bE", "postedAt": "2023-09-22T22:05:01.954Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>This seems extremely uncharitable. It's impossible for every good thing to be the top priority, and I really dislike the rhetorical move of criticising someone who says their top priority is X for not caring at all about Y.&nbsp;<br><br>In the post you're replying to Chana makes the (in my view) virtuous move of actually being transparent about what CH's top priorities are, a move which I think is unfortunately rare because of dynamics like this. You've chosen to interpret this as 'a decision not to have' [other nice things that you want], apparently realised that it's possible the thinking here isn't actually extremely shallow, but then dismissed the possibility of anyone on the team being capable of non-shallow thinking anyway for currently unspecified reasons.</p><p>&nbsp;</p><p>editing this in rather than continuing a thread as I don't feel able to do protracted discussion at the moment:</p><ul><li>Chana is a friend. We haven't talked about this post, but that's going to be affecting my thinking.</li><li>She's also, in my view (which you can discount if you like), unusually capable of deep thinking about difficult tradeoffs, which made the comment expressing skepticism about CH's depth particularly grating.</li><li>More generally, I've seen several people I consider friends recently put substantial effort into publicly communicating their reasoning about difficult decisions, and be rewarded for this effort with unhelpful criticism.</li><li>All that is to say that I'm probably not best placed to impartially evaluate comments like this, but at the end of the day I re-read it and it still feels like what happened is someone responded to Chana saying \"our top priority is X\" with \"it seems possible that Y might be good\", and I called that uncharitable because I'm really, <i>really</i> sure that that possibility has not escaped her notice.</li></ul><p><br><br><br><br>&nbsp;</p>", "parentCommentId": "2NLGqBsWDMaxdQTd2", "user": {"username": "alexrjl"}}, {"_id": "aPWyi6JXrXa5nryoH", "postedAt": "2023-09-22T22:47:17.312Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Your reply contains a very strong and in my view, highly incorrect read, and says I am far too judgemental and critical.&nbsp;<br>&nbsp;</p><blockquote><p>rhetorical move of criticising someone who says their top priority is X for not caring at all about Y.&nbsp;<br>&nbsp;</p></blockquote><p>Please review my comment again.</p><ol><li>I'm simply pointing to a practice or principle common in many orgs, companies, startups &nbsp;and teams to have principles and flow from them, in addition to \"maximizing EV\" or \"maximizing profits\". This may be wrong or right.</li><li>I'm genuinely not judging but keeping it open, like, I literally said this. I specifically suggest writing.</li></ol><p>While this wasn't the focus, I haven't thought about it, but I probably do think Chana's writing is virtuous. I actually have very specific reasons to think why the work is shallow, but this is a distinct thing from the principle or choice I've talked about. Community health is hard and the team is sort of given an awkward ball to catch.</p><p>An actual uncharitable opinion: I understand this is the EA forum, so as one of the challenges of true communication, critiques and devastating things written by \"critics\" are often masked or coached as insinuations, but I don't feel like this happened and I kind of resent having to put my comments through these lenses.&nbsp;</p>", "parentCommentId": "fWrjHDr5MKyXBu5bE", "user": {"username": "Defacto"}}, {"_id": "vRXs2d5hPqN6WE6Kv", "postedAt": "2023-09-22T22:55:03.785Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>BTW, I kind of see Alex L as one of the \"best EAs\" and I sort of attribute this issue to the forum, and now sort of reinforces my distrust of EA discourse (like, I think there's an ongoing 50 comment thread or something because a grantmaker asked someone if english was their second language, come on).</p>", "parentCommentId": "aPWyi6JXrXa5nryoH", "user": {"username": "Defacto"}}, {"_id": "r6FhqzNkAqFytuQgq", "postedAt": "2023-09-23T01:16:09.217Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<blockquote>\n<p>Julia W's writing on on her considerations, not going to search it up but it was good</p>\n</blockquote>\n<p><a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in\">The community health team’s work on interpersonal harm in the community</a></p>\n", "parentCommentId": "2NLGqBsWDMaxdQTd2", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Fms7MjmzeQgfn83dB", "postedAt": "2023-12-20T18:45:37.790Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>$800k per year? For one person to do investigative journalism? What would all that money be spent on?&nbsp;</p>", "parentCommentId": "uEmgREudnpWt7sbJn", "user": {"username": "Stuart Buck"}}, {"_id": "kKEtwStGS8ZY6d5k5", "postedAt": "2024-02-21T03:51:00.503Z", "postId": "5dW9p5EahtfhdiSKF", "htmlBody": "<p>Compensating the person sufficiently that they're willing to do the work (because, ex, they don't enjoy it, or it displaces other work they see as much more valuable).</p><p>I read this as coming from a culture of listing \"<a href=\"https://www.lesswrong.com/posts/MzKKi7niyEqkBPnyu/your-cheerful-price\">happy/cheerful prices</a>\".</p>", "parentCommentId": "Fms7MjmzeQgfn83dB", "user": {"username": "Jeff_Kaufman"}}]