[{"_id": "oiy3o9WY3ypkRBPCM", "postedAt": "2024-01-08T14:34:54.237Z", "postId": "5FFQRsGBcFxwjxtxe", "htmlBody": "<p><strong>Executive summary</strong>: In the 1960s, the US government went to great lengths to guard against hypothetical moon microbes, spending millions on a quarantine facility and protocols to contain unproven threats.</p><p><strong>Key points</strong>:</p><ol><li>Concern emerged from debates on panspermia and protecting future research, then expanded to possible back contamination of earth.</li><li>Scientists, politicians, and agencies like NASA, CDC, and military biolabs gradually invested in reducing the risk.</li><li>Strict quarantine of astronauts and samples was enacted alongside moon landing plans, culminating in a $81 million lunar receiving laboratory.</li><li>Robust containment procedures were ready by 1969 but proved unnecessary when the moon was found sterile.</li><li>Planetary protection efforts now focus more on forward contamination, but precautions for sample return missions continue.</li><li>Though flawed, the response shows earnestness in handling speculative but potentially catastrophic risks.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "gSAdgZAZADcwdDpeN", "postedAt": "2024-01-09T12:22:57.272Z", "postId": "5FFQRsGBcFxwjxtxe", "htmlBody": "<p>Thanks for writing this up <i>so </i>nicely. The framing in terms of EA relevance is perfect.<br><br>Here's another question I have that would be relevant to EA. Do you think that currently the risks from Back Contamination and Forward Contamination receive too <i>much</i> attention (relative to other risks)? In other words: is there some <strong>inertia</strong> in the sense that once a novel catastrophic risk does get recognized as a serious issue, it then doesn't easily get out of people's minds &amp; institutional processes again?<br><br>(The background for my question is this: I read quite a bit about space ethics and sustainability in recent months. At times, I was astonished to see how often back &amp; forward contamination come up as one of the \"big topics\" in space ethics/sustainability discussions. According to my -- extremely unreliable -- intuition, I found it hard to see why planetary protection should be such a central topic given that space exploration comes with many other major risks &amp; opportunities. This was just my vague, subjective impression...) &nbsp;&nbsp;</p>", "parentCommentId": null, "user": {"username": "dominicroser"}}, {"_id": "DQzBHNaGnbAE6YpSy", "postedAt": "2024-01-10T18:48:16.419Z", "postId": "5FFQRsGBcFxwjxtxe", "htmlBody": "<p>Great post, G. Ray!</p><blockquote><p><i>[Header image: </i><a href=\"https://history.nasa.gov/ap11ann/kippsphotos/5961.jpg\"><i>Photo</i></a><i> of the lunar lander taken during Apollo 11.]</i></p></blockquote><p>There is no image in the post.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]