[{"_id": "DRSdvjbHzNt7B6ps8", "postedAt": "2023-01-13T11:25:32.976Z", "postId": "5FHRcuD2eSmHhrS4s", "htmlBody": "<blockquote><p>If something causes me to leave EA entirely, it may well be sexism. I simply don’t have to do as much extra work to prove myself in other spaces (including ones where people are every bit as smart), and having to do this work saps me of my energy, confidence, and time; in short, of my ability to be an effective altruist.</p></blockquote><p>This was a powerful paragraph, thank you for sharing this.</p>", "parentCommentId": null, "user": {"username": "bruce"}}, {"_id": "rvQP2ahARkvirk9Fa", "postedAt": "2023-01-13T16:14:53.636Z", "postId": "5FHRcuD2eSmHhrS4s", "htmlBody": "<p>I'm sorry to hear that you've experienced sexism both within and outside EA.</p><p>Just to clarify your view, you said that:</p><blockquote><p>there is data to suggest the variability hypothesis may be true in some places and for certain kinds of intelligence.</p></blockquote><p>But an implication of the hypothesis is that men will make up a greater proportion of the \"intelligent\" people in those places for those kinds of intelligence.</p><p>Do you think it would be fine to use this information as a prior in those contexts?</p>", "parentCommentId": null, "user": {"username": "nathan98000"}}, {"_id": "2mDuqkmRMtbxjyuZP", "postedAt": "2023-01-13T17:47:55.815Z", "postId": "5FHRcuD2eSmHhrS4s", "htmlBody": "<p>IMO, I agree with this. I think that a lot of the defenses of Bostrom's comment are bad, and I don't really like many of the defenses shown here.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "WQS29kj2HQADKnX7p", "postedAt": "2023-01-15T18:40:00.811Z", "postId": "5FHRcuD2eSmHhrS4s", "htmlBody": "<p>Even if there are cases in which it would theoretically be reasonable to employ different priors for men vs. women, I doubt people will be able to reliably identify these cases, choose appropriate priors, and correctly apply the priors they've chosen. When you couple these challenges with the fact that there are significant downsides associated with trying to discriminate in a principled way (e.g., harming people, alienating people, creating self-fulfilling prophesies, making it harder for members of an already disadvantaged group to succeed, etc), it seems like a bad idea to base priors on the variability hypothesis in basically any context.</p>", "parentCommentId": "rvQP2ahARkvirk9Fa", "user": {"username": "hobbes"}}, {"_id": "weBheFcLmeiZpJQoK", "postedAt": "2023-02-18T03:37:07.345Z", "postId": "5FHRcuD2eSmHhrS4s", "htmlBody": "<p>So you firstly admit there is reasonable evidence to support the \"variability hypothesis.\"</p><p>Three paragraphs later, you describe the implications of this reasonable hypothesis as \"sexist.\"</p><p>But if someone believes this \"reasonable\" hypothesis, and assumes you are, on average, (very) marginally less likely to be of 97%+ IQ, well that is no more sexist than assuming you're likely to be much shorter than a man having never met you.</p><p>I mean, I guess some dude with a 97% percentile IQ assumes he's smarter than &nbsp;97% of people he meets. &nbsp;More likely he interacts with smarter people, so this is like 10% of the people he's meeting. &nbsp;So he thinks some dude has a 10% chance of being smarter than him but you have only an 8.5% chance, and this discrepancy causes you mental anguish?</p><p>Brah, imagine being a white guy who <i>can</i> jump.</p><p>Alternatively, walk into a car dealership. If you have a 97% iq, 100% of people will underestimate your intelligence, whether male of female.</p>", "parentCommentId": null, "user": {"username": "Jgray"}}]