[{"_id": "gNHjsoLMMWdQhLyKL", "postedAt": "2023-01-02T16:35:00.162Z", "postId": "5h8bNTFHkrNNzrrJf", "htmlBody": "<p>Great stuff! Thanks for running this!<br><br>Minor point: The Discovering Latent Knowledge Github appears empty.<br><br>Also, regarding the data poisoning benchmark, This Is Fine, I'm curious if this is actually a good benchmark for resistance to data poisoning. The actual thing we seem to be measuring here is speed of transfer learning, and declaring that slower is better. While slower speed of learning does increase resistance to data poisoning, it also seems bad for everything else we might want our AI to do. To me, this is basically a fine-tuning benchmark that we've then inverted. (After all, if a neural network always outputted the number 42 no matter what, it would score the maximum on TIF - there is no sequence of wrong prompts that can cause it to elicit the number 38 instead, because it is incapable of learning anything. Nevertheless, this is not where we want LLM's to go in the future.)<br><br>A better benchmark would probably be to take data poisoned examples and real fine-tuning, fine-tune the model on each, and compare how much it learns in both cases. With current capabilities, it might not be possible to score above baseline on this benchmark since I don't know if we actually have ways for the model to filter out data poisoned examples - nevertheless, this would bring awareness to the problem and actually measure what we want to measure more accurately.</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "xFEjDhALbMiGt6NFa", "postedAt": "2023-01-02T22:32:49.518Z", "postId": "5h8bNTFHkrNNzrrJf", "htmlBody": "<p>Minor nitpick:&nbsp;<br><br>I would've found it more helpful to see Haydn's and Esben's judgments listed separately.</p>", "parentCommentId": null, "user": {"username": "Mathieu Putz"}}, {"_id": "MC3HfcyZA333SYSWW", "postedAt": "2023-01-03T11:04:51.158Z", "postId": "5h8bNTFHkrNNzrrJf", "htmlBody": "<p>We came up with our rankings seperately, but when we compared it turned out we agreed on the top 4 + honourable mention. We then worked on the texts together.&nbsp;</p>", "parentCommentId": "xFEjDhALbMiGt6NFa", "user": {"username": "HaydnBelfield"}}, {"_id": "kwpL5wstMqTzxscb2", "postedAt": "2023-01-03T12:00:11.857Z", "postId": "5h8bNTFHkrNNzrrJf", "htmlBody": "<p>That's helpful, thanks!</p>", "parentCommentId": "MC3HfcyZA333SYSWW", "user": {"username": "Mathieu Putz"}}]