[{"_id": "8idgPhKai4de3JmoC", "postedAt": "2022-08-26T22:25:49.835Z", "postId": "5JaKAuRtxcbxjeLfD", "htmlBody": "<p>Strongly upvoted. This kind of post is extremely valuable and I would encourage anyone to write more of these kinds of posts: It helps us as a community to coordinate much better. Thanks Anya and Katie for all your efforts and research putting this together and sharing it.</p><p>Reg. \"<i>There are probably more efforts we’re not aware of\" &nbsp;</i>There are &nbsp;EA-aligned newsletters including job openings relevant to that newsletter's scope, e.g. <a href=\"https://impactfulanimal.substack.com/p/july-editionimpactful-animal-advocacy\">like this</a>.</p><p>Reg. \"<i>We’re not sure what the optimal level of coordination between hiring organizations in the EA community is</i>\": I guess the different points of the spectrum is something like&nbsp;</p><p>1. Fully uncoordinated hiring agents (uncoordinated &amp; decentralized)&nbsp;</p><p>2. Well coordinated network of hiring agents (coordinated &amp; decentralized) &nbsp;</p><p>3. Having one big \"EA hiring agent\" (centralized)&nbsp;</p><p>Ideally we would be at 2. (I'm uncertain whether it's better to tend towards 1. or tend towards 3.)</p><p>3. Has many downsides (incl. the ones you've mentioned) whereas the prototype for 2. could look something like this:</p><ul><li>There are different \"EA hiring agents\" (orgs, individual headhunters, CRMs, hiring/vetting projects etc.) that coordinate among each other (*) incl. supporting projects/org you mention (such as the \"value-vetting\" service)</li><li>The coordination of these hiring agents is incentivized by some type of \"EA Hiring Hub\" (which focus isn't to store the candidates' data), but that could take over activities such as<ul><li>Developing centralized statistics about overall candidate pool (imagine Our World in Data but just for hiring)</li><li>Developing a secure, compliant system for the different agents to share candidates among each other</li><li>Developing a system that incentivizes coordination among these agents over the long-term</li></ul></li></ul><p>*I'm less certain about what the hiring scope of each agent ought to be, but it seems best for different agents to optimize for different hiring scopes (cause area, specific org, anything that the EA community might need in the future...)&nbsp;</p><p>Please see this comment as unstructured, half-baked thoughts I had after reading this post and wrote in a couple of minutes vs. a well-thought idea.</p>", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "XopKyNPmn9sHwaqkt", "postedAt": "2022-08-30T09:51:35.401Z", "postId": "5JaKAuRtxcbxjeLfD", "htmlBody": "<p>I know a senior hiring manager who I'd like to pull into EA, who wants to help me with that, for example getting them to fill roles for your org, or opening an EA hiring agency?</p><p>This is a person who can own and run the hiring of a medium (100+ people) tech org unusually well, and could probably do the same for other orgs too (for example, hire researchers).</p><p>For more info, please DM/<a href=\"mailto:yonatan@effectivedevelopers.org\">email</a> me.</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "6QAftwCwMoBsTTFd5", "postedAt": "2022-08-30T14:06:29.612Z", "postId": "5JaKAuRtxcbxjeLfD", "htmlBody": "<p>Thanks for the kind feedback, Christina and for sharing your thoughts!&nbsp;</p><p>And I think I generally agree that the optimal place is somewhere around 2, with some centralized provision of certain goods and services that are valuable to lots of decentralized hiring agents.&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "8idgPhKai4de3JmoC", "user": {"username": "Anya Hunt"}}, {"_id": "nA4vNmHavCAyvCeHb", "postedAt": "2022-09-12T02:29:09.422Z", "postId": "5JaKAuRtxcbxjeLfD", "htmlBody": "<p>Finally got the time to read this post - thank you both for putting this together, it's really helpful! This resonates with my observations &amp; experiences of the ecosystem, and it was helpful to get a sense of who is working on which problems (and who isn't).&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "HfNkQQZnCMERGKCDF", "postedAt": "2022-11-07T19:47:24.402Z", "postId": "5JaKAuRtxcbxjeLfD", "htmlBody": "<p>Thank you for the very in depth post! I've had a lot of conversations about the subject myself over the past several months and considered writing a similarly themed post, but it's always nice to find that some very talented people have already done a fantastic job carefully considering the topic and organizing the ideas into a coherent piece :)&nbsp;<br><br>On that note, I'm currently conducting a thesis on effective hiring / selection methods in social-mission startups with the hopes of creating a free toolkit to help facilitate recruitment in EA (and other impact-driven) orgs. If you have any bandwidth I'd love to learn more about your experience regarding the talent ecosystem in EA and see if I could better tailor my project to help address some of the gaps/opportunities you've identified</p>", "parentCommentId": null, "user": {"username": "Brennan.W"}}]