[{"_id": "yYa8BHJqKehLR7yC7", "postedAt": "2023-02-20T19:54:02.064Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>I would recommend, when making a startup, you have a clear idea of what your startup would actually <em>do</em>, which takes into account your own &amp; your company’s strengths &amp; weaknesses &amp; comparative advantage. Many want to make money, those who succeed usually have some understanding of how (even if later they end up radically pivoting to something else).</p>\n", "parentCommentId": null, "user": {"username": "D0TheMath"}}, {"_id": "uEgroQB3L4nHtTTYL", "postedAt": "2023-02-20T20:27:21.522Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>Wow this is a lot to take in.</p><p>Seems you have really put in a lot of thought into this. Will take a while to fully process it all but from a quick read, it looks quite interesting and you just might be on to something...</p><p>Apparently it appears to solve or provide concrete pathways towards solving &nbsp;many of the items on <a href=\"https://docs.google.com/document/d/1Y9opezUk9_JNQBYCAmHoERiqlaf2HmashQQ_ydGwyRY/edit\">Carla Zoe Cremer's list of recommendations</a>.</p><p>Hmmm, now you have my full attention. Looking forward to your next update.</p>", "parentCommentId": null, "user": {"username": "Joyce Alvino"}}, {"_id": "spkFswzoB9BtwSy7e", "postedAt": "2023-02-20T20:41:47.174Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>People are being very polite to you and asking substantive questions. Others, please correct me if I'm wrong, but let me say what I think most readers here are really thinking:</p><ol><li>You should stop what you are doing. This comes across as a scam (I'll give some more details about that below) or at least as poorly organized. If this were to be successful, even in any small way, it would damage the reputation of EA because of the way in which it is presented.</li><li>You need to have a little humility. Yes, EA is a space where people can and do have a big impact when they are new. But teams of the smartest people here have been trying to raise big money for years and it is simply not that easy. The good news about EA is that you do not need to raise 1 billion to have an impact. We are here to focus on the most effective things around, which means you can make a huge difference with just a few thousand dollars.</li></ol><p>Here is why this seems like a scam to me:</p><ol><li>\"Your organization\", EffectiveCauses, doesn't have a website or any other public-facing information. However, there are a bunch of accounts.<ol><li>The \"EffectiveCauses\" Quora account is pushing crypto stuff that is unrelated to your DAO.</li></ol></li><li>The one person commenting in support of you looks a bit like an astroturf account (created recently, fake name/PFP).</li><li>The Twitter account you linked to is also quite shallow (few posts/no substantive posts, no followers, etc.), as is your EA Forums account.</li></ol>", "parentCommentId": null, "user": {"username": "Erin"}}, {"_id": "7hsRvoumzczLJPJP5", "postedAt": "2023-02-20T21:08:16.743Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>I’m not assuming its a scam, and seems unlikely it’d damage the reputation of EA. Seems like a person who got super enthusiastic about a particular governance idea they had, and had a few too many conversations about how to pitch well.</p>\n", "parentCommentId": "spkFswzoB9BtwSy7e", "user": {"username": "D0TheMath"}}, {"_id": "YZnS7d5s6KWpZdHq7", "postedAt": "2023-02-20T21:22:11.053Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>First of all let me sincerely apologize if this comes accros as poorly organized or scammy. It is definitely not my intention to do anything that would bring any more negative publicity to EA at this time.</p><p>I will immediately stop posting here and try other EA communities if I am asked to stop further updates by the mods.</p><p>But I am very hesitant to kill the project completely and I probably will not because I don't really think its success will make EA look bad, but again I'm new so maybe I dont fully understand it all.</p><p>I was (and strongly still) under the impression that this would be a good thing for EA and since it deals with a core EA matter then I felt I could / should post it here if only to gather some feedback and get the word out.</p><p>Especially since we have been encouraged to post on EA forum, I figured I could post them here.</p><p>Maybe the title or the $1B figure seems too sensational but I very much think its doable. Most of the push back on the other post seem to do with a DAO not being necessary for something like this and I tried my best to present my own arguments.&nbsp;</p><p>I have put in a lot of work into this - since Nov 2022 to be precise and Istrongly believe in the possibility of success so I don't want to be discouraged by the negativity so far. I have tried my best to provide as much detail as I can explaining how I expect this to work (especially in this very post). If there is any information I'm leaving out I will gladly provide it.</p><p>I have watched people in the community bickering and dillydallying these past months over those EA issues but most seem to be just kicking the tires and nobody seems to be going further to do do anything or even ready to do anything concrete about this stuff.</p><p>And its eating me deep inside because I can clearly see how much greater this movement can be.</p><p>I agree that I'm new to EA (and maybe a bit overzealous in my thinking) and I would love to receive constructive advice on how to go about doing this properly instead of killing the whole idea.</p><p>To &nbsp;the best of my knowledge I have tried to answer every question on the first post and I will continue to try and do so with this one.</p><h2><strong>If my identity is an issue to contend with then I don't mind revealing it if I have to, or if anybody cares they could DM me for that.</strong></h2><p>Regarding your \"scammy list\"</p><blockquote><p>\"Your organization\", EffectiveCauses, doesn't have a website or any other public-facing information. However, there are a bunch of accounts.</p><ol><li>The \"EffectiveCauses\" Quora account is pushing crypto stuff that is unrelated to your DAO.</li></ol></blockquote><p><br>1. Effective Causes is new and mostly not set up formally yet. It is literally still just an idea in my head and rough blueprints. One of the reasons I'm fundraising for that is to setup formally. &nbsp;The quora and every effectiveDAO link you find were all created by me so that when the project kicks off I will already have those names instead of some cybersquatter hijacking the name. when the actual project begins they will all be cleaned up and readied for use.<br><br>Nothing much else by way of formality is going on, I just meet with a couple of students from a nearby university talking to them about EA and we meet a few times to brainstorm and share ideas. The effectivedao.org domain has been registered by me pending when the website is setup. EffectiveCauses and the DAO and everything are really in a pre-launch state, nothing at all is setup.&nbsp;<br>&nbsp;</p><blockquote><p>The one person commenting in support of you looks a bit like an astroturf account (created recently, fake name/PFP).</p></blockquote><p>2. Not sure which person you are referring to, there were quite a number of comments on the other post and a few of them seemed supportive. But I have only one EA Forum account and I don't know and haven't asked &nbsp;any other person to comment in support of me, I have nothing to do with them. None of the people in EA who actually know my identity have commented so far. But I've shared the post in some communities where I'm active. I've been sharing it. &nbsp;</p><blockquote><p>The Twitter account you linked to is also quite shallow (few posts/no substantive posts, no followers, etc.), as is your EA Forums account.</p></blockquote><p>The twitter is sparse because: The project is new. This post is my first major post about it in the public. The actual Twitter accounts are all rather new. Everything is new because its still literally an idea in my head. Only now do I plan to start tweeting more regularly.&nbsp;</p><p>I already created new twitter accounts for Effectivecauses and for the DAO but like I explained in the post, I've been having issues completing the registration due to twitter's phone verification issues so I had to use another twitter account of mine and delete all the previous posts so that I would have a twitter to use, albeit temporarily.</p><p>For my EA Forum account. I'm new to EA, joined in September or so and posted and commented a couple of times. That's the best I could do. I comment on posts that interest me and I am knowledgeable about.</p><p>But again,</p><p>If my identity is an issue, I dont mind going through KYC right now, but not publicly.</p><h1><strong>If you care to spare some of your time I dont mind doing anything you like me to do to verify my identity.</strong></h1><p>And most importantly, I will like your guidance on how to do this properly. But please don't ask me to kill the idea.</p>", "parentCommentId": "spkFswzoB9BtwSy7e", "user": {"username": "DAOMaxi"}}, {"_id": "uPuv7Wf9YJcTpJDGA", "postedAt": "2023-02-20T21:42:13.151Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>I was referring to Joyce Alvino - not sure if that account is controlled by you, but it is almost certainly a fake name/PFP and it is the only account that is quite supportive of your idea here.</p><p>There is no point sharing your identity with me - I'm not looking to contribute financially to your organization. Any anonymity is going to be unacceptable to most donors, and use of multiple fake names (Sally Atkins, Degen Chadwick) comes off as as particularly sketchy.</p><p>From this comment it does seem like your heart is in the right place - I was perhaps a bit too extreme in saying that this could damage the reputation of EA. I do really think you should take a step back and reconsider this work. Is your biggest impact going to be in creating something new, or could you work more effectively by leveraging the organizations that already exist in EA?</p><p>If you really want to launch a new org, that is not going to happen quickly. &nbsp;You need a business plan, a clear and concise pitch, a website, information about who you are and what your track-record is, etc.</p>", "parentCommentId": "YZnS7d5s6KWpZdHq7", "user": {"username": "Erin"}}, {"_id": "LndK28v4qcs7cxivt", "postedAt": "2023-02-20T21:53:33.400Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>LOL thanks, that should be sometime tomorrow. Its night time here, will need to go to bed soon.</p>", "parentCommentId": "uEgroQB3L4nHtTTYL", "user": {"username": "DAOMaxi"}}, {"_id": "XgKnksx6FC5cLQpBu", "postedAt": "2023-02-20T21:58:37.602Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>Thank you for the recommendation. I always try to improve and I find this input valuable.</p><p>I did try my best to explain what the whole thing is about and tried to be as clear as possible but maybe I didn't communicate it clearly enough.</p><p>Nonetheless, everything I'm doing, both in the DAO and for my EffectiveCauses all center around what I believe are my/our greatest strengths which is community building and managing online communities for which I have many years experience.</p><p>But I will sure try to make my points clearer in the future. Thank you very much. Would also love to hear any other recommendations you might have.</p>", "parentCommentId": "yYa8BHJqKehLR7yC7", "user": {"username": "DAOMaxi"}}, {"_id": "6pHddigMS2nmqeu82", "postedAt": "2023-02-20T22:01:20.603Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>This effectively reads as “I think EA is good at being a company, so my company is going to be a company”. Nobody gives you $1B for being a company. People generally give you money for doing economically valuable things. What economically valuable thing do you imagine doing?</p>\n", "parentCommentId": "XgKnksx6FC5cLQpBu", "user": {"username": "D0TheMath"}}, {"_id": "HPsJjm9ZyfaYPy2JZ", "postedAt": "2023-02-20T22:10:25.796Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>For one let me separate EffectiveCauses (my organization) from the DAO (which is an idea from my organization).</p><p>The DAO is/will be a separate entity not under my control and &nbsp;members are supposed to work together to collectively raise the $1 B using various methods which I listed in the above post. 80% of this is meant to give out as grants for EA projects. 20% covers other things including 4% for EffectiveCauses and 8% for admin costs for the DAO. I'm not actually asking anyone to hand over one billion to me! &nbsp;</p><p>Regarding the [economic] importance, for the DAO, the importance is giving out grants to impactful projects selected democratically by DAO members under the guidance of experts.<br><br>For my EffectiveCauses organization, the value is as described in the post which is to think up impactful ideas (like this DAO idea) and source for funds to execute and incubate them. Also to serve as a base for setting up &nbsp;EA communities in countries in Africa (most of which there's little or no EA activity)</p>", "parentCommentId": "6pHddigMS2nmqeu82", "user": {"username": "DAOMaxi"}}, {"_id": "toG33CMbBmRQN4DA9", "postedAt": "2023-02-20T22:17:52.982Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>Reasons I'm suspicious of this:</p><ol><li>No clarity about:<ol><li>identity of the author</li><li>identities of the team</li></ol></li><li>No evidence that the author/team have the expertise to:<ol><li>set up this community</li><li>responsibly manage the funds</li></ol></li><li>In general where large amounts of money are involved, it is better to work with well-established systems and people, as this is lower-risk in terms of \"unknown unknowns\" etc.</li></ol><p>While I'm not persuaded this is a scam, the problem is that even well-intentioned ideas can go wrong if the people leading them don't have the expertise to do so.</p><p>I have personally influenced decisions involving billions of dollars before, and despite this, I don't think I would have anywhere near the expertise to lead this kind of organization. I certainly would not want to call it \"my idea\" - I would want to get a team of financial experts involved, so that it would truly be \"our idea.\"</p>", "parentCommentId": null, "user": {"username": "Tom Henry"}}, {"_id": "t7tW8XaPY2xXtCPmv", "postedAt": "2023-02-20T22:35:04.103Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>Thanks again for the time to offer feedback. I really appreciate.</p><p>About the Joyce Alvino I've seen their comments but I don't think I know them, but if they are being supportive then that indeed makes me glad.</p><p>I agree that the multiple <s>fake names</s> pseudonyms may seem sketchy. That is why I was upfront about the fact that I use pseudonyms a lot online &nbsp;(mostly because I'm also a digital marketer so using pseudonymous accounts are a common aspect of the trade). &nbsp;But I will understand if funders don't like that although I believe some won't mind and I believe that when I get my few collaborators all of that will be sorted out.<br><br>Thanks for the advice about the organisational setup. I did opt do do this the \"crypto way\" where anonymity/pseudonyms is almost normal but I understand that this is not exactly a crypto community so I need to do things the \"proper\" way. Perhaps if this doesn't work out as planned I would pivot to a more traditional process.</p><p>I understand that getting a new org is not going to happen quickly and I'm not really expecting it to. This is why I want to first get a handful of people to work with me for 2 to 3 months to do all those proper things and also to advise and chip in ideas. One of the &nbsp;purposes of the NFT auction I mentioned is to get a handful of collaborators so that we can set things up properly.</p><p>I know it may not be quick or easy but I'm just trying to take the first tentative steps towards building the big organization. I'll rather fail than not try at all.</p>", "parentCommentId": "uPuv7Wf9YJcTpJDGA", "user": {"username": "DAOMaxi"}}, {"_id": "wu6cjHXd9nJPw3SEW", "postedAt": "2023-02-20T22:53:14.229Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>Your points are very valid.</p><p>For my identity, I did explain in my other post why I have not used my real name and have actually offered to doxx myself to anybody that cares, just send me a DM.</p><p>On the team aspect , I used \"my idea\" because what I would call a \"team\" right now wouldn't really pass &nbsp;as one because the only person with relevant knowledge and &nbsp;experience &nbsp;at this time is me. I have interns working with me but they mostly do low level work and brainstorming.&nbsp;</p><p>What I'm actually trying to do with this auction of 172 NFTs is to build a formidable team of collaborators from the EA community who will collab with me in the first stage to set everything up properly.&nbsp;</p><p>I expect / hope those who decide to support and collaborate with me would have the nice-to-have characteristics I listed in my post which includes experts and experienced people in almost every relevant area required for such a project.</p><p>With this team I intend to work out all the kinks in the first 2 to 3 months and then launch officially.&nbsp;</p><p>On the matter of well established systems, even though DAOs are still experimental, there are DAOs that successfully control billions of dollars so it is not impossible, but just like you said, it has to be the right team with relevant experience. I do have experience with DAOs and I hope to onboard members who have the relevant experience to properly manage those large sums.&nbsp;</p><p>Many of these things are vastly simplified by using Blockchain.</p>", "parentCommentId": "toG33CMbBmRQN4DA9", "user": {"username": "DAOMaxi"}}, {"_id": "82ofkDpkYt9sjyS2b", "postedAt": "2023-02-21T13:40:42.559Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>We've had <s>two </s>three reports that this might be a scam.<br>Please be aware of the high base rates of scams in the crypto ecosystem and note that the EA Forum is a place where anyone can post and posts are not vetted.</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "9dQqTrSZNRboJHZwM", "postedAt": "2023-02-21T14:02:37.622Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>Hello Lorenzo</p><p>It is great that this notice is being given but I believe those reports are not proven although I'm not sure of their content.</p><p><br>it would only be fair if I at least am given an opportunity to redeem my self, given that these \"reports\" are obviously just assumptions and not proven facts.</p><p>There were a couple of issues raised in the comments which I tried to address and in places where I fell short, especially in the area of my identity, I offered to do KYC if need me to prove my authenticity.</p><p>Putting out such a notice without concrete verification already biases opinion against me. So even if the reports are unproven suspicions, some people might lean towards them being correct.</p><p>If anybody cares, I would love to prove my authenticity in any way required. Perhaps the mod that posted this could investigate further.</p><p>All I've wanted to do since I joined this community was to contribute meaningfully but every where I turn I seem to be met with lots of push back and vitriol and its not fair receiving this sort of treatment. The fact that I use a pseudonym doesn't equate to being a scam. This is very disheartening to say the least.</p><p>I still have some updates but I wonder how I can keep posting with this sort of notice hanging over my reputation.</p>", "parentCommentId": "82ofkDpkYt9sjyS2b", "user": {"username": "DAOMaxi"}}, {"_id": "D9JGQa37DvYjJyQ2t", "postedAt": "2023-02-21T14:41:39.234Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>You seem like a thoughtful person who is willing to listen to feedback, which I really appreciate, but I think there is something that you are missing here. Spending time trying to raise a billion dollars takes your time away from doing other things that have a higher chance of success.</p>", "parentCommentId": "t7tW8XaPY2xXtCPmv", "user": {"username": "Erin"}}, {"_id": "YpekpQy4QY9Q8YXzE", "postedAt": "2023-02-21T15:06:16.724Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>I understand why this note would be discouraging. But there are reasons for concern other than your insistence on remaining anonymous and that would not be addressed by verification of your identity alone. You're not established in this community, but are asking people to spend up to $8,000 on a NFT for your project in a week or so. You state there are \"people in EA who actually know my identity\" but you haven't provided any references of people respected in the community who could vouch for your skills, experience, trustworthiness, and suitability for this project. There does not seem to be a corporation with other accountable people behind this project.</p><p>I can't determine if this is a scam or if you simply do not know how to engage and build trust with the community. If it is legitimate, you need a period of sustained engagement with the community about topics that do not involve providing you money. You need to convince people trusted within the community to handle the money during the early stages of the project, rather than asking the community to trust you with ~ six figures. Etc.</p><p>Finally, it is not the mods' job to vet whether you are a fit and suitable person for members of the community to be entrusting $400-$8000 to, nor are they really qualified to do that. It is your task to convince the community you are trustworthy and suitable.</p>", "parentCommentId": "9dQqTrSZNRboJHZwM", "user": {"username": "Jason"}}, {"_id": "kJ2yX2GKbooZDHxAR", "postedAt": "2023-02-21T15:29:56.432Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>Hello DAOmaximalist, thanks for the reply.</p><p>Even if this wasn't posted anonymously, or if you verified your identity to me and I did some kind of investigation, I lack the expertise to conclusively prove whether this is or isn't a scam.</p><blockquote><p>Putting out such a notice without concrete verification already biases opinion against me. So even if the reports are unproven suspicions, some people might lean towards them being correct.</p></blockquote><p>I agree that's the case, and just to clarify, I have no proof that this project is or isn't a scam. But I think it's important for readers to know that other readers have strong suspicions, and to keep in mind that the <a href=\"https://en.wikipedia.org/wiki/Base_rate\">base rate</a> for crypto projects being scams is high.</p><blockquote><p>I still have some updates but I wonder how I can keep posting with this sort of notice hanging over my reputation.</p></blockquote><p>I think it might be a better fit for the forum if you integrate feedback from the comments and reports in your eventual next posts, and would definitely understand if you decide that this is not the right forum to discuss this project.</p>", "parentCommentId": "9dQqTrSZNRboJHZwM", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "iSx92uXzWyqMyP2cm", "postedAt": "2023-02-21T18:31:54.526Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>I actually consider every mistake as an opportunity to learn and I value every kind of feedback because it helps me to improve.</p><p>Also nobody knows everything or as someone once said \"I know a lot of things about a lot of things. But I don't know as much about a lot of other things that I wish I knew a lot of things about.\"</p><p>I always take every opportunity to learn from others because I believe it's the fastest way to improve.</p><p>Wish I could have someone with your kind of insights on this team, that would really be useful.</p><p>All the same I very much appreciate the time you took to read the article and offer your feedback.</p><p>If my attempt at this DAO fails, I'll probably come crawling to you for some tips on how to do it <s>differently</s> better.</p><p>But right now the ball is already rolling, I'm already promoting the NFT auction everywhere and the outcome of the auction will determine my next move.</p><p>Fingers crossed...</p>", "parentCommentId": "D9JGQa37DvYjJyQ2t", "user": {"username": "DAOMaxi"}}, {"_id": "ePwioJN3t4DQt5tf8", "postedAt": "2023-02-21T18:32:09.457Z", "postId": "5JESNsWwuDq3i9obC", "htmlBody": "<p>To me this seems like either a scam or an example of the <a href=\"https://forum.effectivealtruism.org/topics/unilateralist-s-curse\">unilateralist curse</a>. I would urge people not to invest in this. For something like this to have any potential, it has to be started by a team of people 1) with lots of relevant experience / a good public track record and 2) that have been actively involved in the EA community for at least a while (a year or more). Even then I would be skeptical as this seems like something way too complex for a broad audience and as a strong prior I would not touch anything blockchain/crypto/NFT related with a 10 foot pole.</p>", "parentCommentId": null, "user": {"username": "Jeroen_W"}}]