[{"_id": "48Rbxu9JxKuEtD2cn", "postedAt": "2024-03-04T09:09:55.760Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>Do you think food is a big issue if you are resourceful? I have read some books on past famines and it seems people with lots of social capital, money and/or firepower always manage to get enough food, even in really bad famines. Famines seem to almost always strike the poor/younger/older much harder. So conditional on one having resources, do you think one should weigh heavily the local production of food?</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "3puoCZGkucryjE6kQ", "postedAt": "2024-03-04T09:14:47.148Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>Making another comment as I am asking another question (I hope that is ok, I am super interested in this topic!): Would you also consider \"staying mobile\"? I am just noticing that people in current crises really want to move to locations with better conditions (e.g. the current immigration to higher income/more peaceful countries). I have not studied it in detail, but sailboats seem potentially super helpful, especially if your friends also have some in your general area and these are of the type that can stay at sea for a long time/cross vast distances.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "EvDzCafcSh68j7HtC", "postedAt": "2024-03-04T11:30:19.828Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>I think the kinds of famine that would happen in the scenarios that I describe would be quite different to the ones of the past when it comes to the scale. If there is just no food locally where you are, it does not really matter how resourceful you are. Also, I think that cooperation is quite important in such events. My own research, as well as the conclusions I took from reading a lot on this is that when cooperation breaks down, things will get much much worse. Therefore, I think the main thing you should be concerned about is not trying to get as many resources as possible, but work on maintaining cooperation. If you fail at that, the overall food security will drop so hard, it just become unlikely that you will be one of the few \"lucky\" people who still find something.&nbsp;</p>", "parentCommentId": "48Rbxu9JxKuEtD2cn", "user": {"username": "FJehn"}}, {"_id": "q2cZkjmaZQFttnNmS", "postedAt": "2024-03-04T11:32:36.582Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>As hinted on in the other comment I made to your separate question, I think it makes more sense to stay in one reasonably good place and try to keep societal structures there intact as much as possible. Staying mobile only makes more sense if everything has broken down and you are just a scavenger. However, you will want to avoid this kind of outcome as much as possible, as everything will be so much harder.&nbsp;</p>", "parentCommentId": "3puoCZGkucryjE6kQ", "user": {"username": "FJehn"}}, {"_id": "CJhtXtGC6AF34e7uh", "postedAt": "2024-03-04T14:02:55.568Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p><strong>Executive summary</strong>: The post discusses the best locations to survive various types of global catastrophes that could lead to societal collapse, considering factors like latitude, income level, geography, and food production.</p><p><strong>Key points</strong>:</p><ol><li>For abrupt sunlight reduction scenarios (e.g., nuclear war, volcanic eruptions), the Southern Hemisphere, especially islands, would fare better due to more ocean area mitigating temperature drops.</li><li>For global catastrophic infrastructure loss (e.g., electromagnetic pulses, pandemics), high-income food-exporting nations that rely less on imports for agriculture may be more resilient.</li><li>Rural areas are preferable to urban areas, which lack local food production capabilities.</li><li>Islands like New Zealand, Australia, and Indonesia show relative resilience, though each has trade dependencies or other caveats.</li><li>The catastrophe type significantly influences the optimal location, with no single place being ideal for all scenarios.</li><li>More research is needed on comparing islands versus continents for catastrophic infrastructure loss resilience.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "bnp43RdFdnuAt7ji8", "postedAt": "2024-03-04T21:03:06.757Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>People should probably just got to New Zealand regardless, its a pretty great place ;).</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "jvE4cgCzcTCme5ATS", "postedAt": "2024-03-04T22:13:35.595Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>Great piece. In terms of potential scenarios, I think <a href=\"https://www.youtube.com/watch?v=LrIRuqr_Ozg\">this video</a> also covers some good points.</p>", "parentCommentId": null, "user": {"username": "Mayank Modi"}}, {"_id": "yx4ceDWE99esCHTyj", "postedAt": "2024-03-05T05:16:07.290Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>What does this have to do with effective altruism?</p>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "Kg7wMwRHFjJNAq88W", "postedAt": "2024-03-05T05:45:53.333Z", "postId": "5jsM8WQD6ZqGFdmuy", "htmlBody": "<p>In general I see this post as part of work around civilizational resilience (similar to ALLFED) and in particular this post is part of a blog series which is meant to help us understand societal collapse better: https://existentialcrunch.substack.com/p/introducing-a-living-literature-review</p>", "parentCommentId": "yx4ceDWE99esCHTyj", "user": {"username": "FJehn"}}]