[{"_id": "XzEvT7nL3bpHBi28z", "postedAt": "2014-10-03T23:27:54.864Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Thanks for your hard work on putting this together!  It's so inspiring to see everyone's profiles!</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "XtyPJuMuEA4oWEvJL", "postedAt": "2014-10-03T23:40:31.785Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Yes, they make for very interesting browsing!</p>\n", "parentCommentId": "XzEvT7nL3bpHBi28z", "user": {"username": "toron"}}, {"_id": "iw83zYubgd6B7GWH7", "postedAt": "2014-10-04T00:03:47.680Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Many thanks for help on this project to Peter Hurford, Xio Kikauka, Joey Savoie, George O'Neill and everyone else who pitched in, commented and suggested features :) Thanks also to Pablo Stafforini for creating the original version of the map of EAs, and to Patrick Brinich-Langlois and Sören Mindermann for further help on this.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "NBSaCh8RfCc8s29kp", "postedAt": "2014-10-04T23:42:13.543Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Also, thanks to Ted Suzman, who I learnt made an earlier version of an EA profiles base at <a href=\"http://eaprofiles.com\">eaprofiles.com</a> (before dropping the project due to lack of time), and has kindly redirected that domain name to our version.</p>\n", "parentCommentId": "iw83zYubgd6B7GWH7", "user": {"username": "Tom_Ash"}}, {"_id": "zukhh7Cj6HhBWMiGo", "postedAt": "2014-10-09T07:30:47.977Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>A few people have commented elsewhere or emailed me asking about a discussion section, as that's clearly key to a strong community, so I'll repeat what I said:</p>\n<p>&quot;Thanks! We link to the EA forum and Facebook group for discussion as it makes sense to concentrate discussion in a few venues rather than creating a new place for it, for its own sake. The EA forum's been quite active so far, and the Facebook group recently passed 4,000 members, and seems to have had several threads a day for over a year. (It's the most successful analogous Facebook group I know of - does anyone know of others, and what features they have?)&quot;</p>\n<p>Does that sound sensible? Can anyone think of other helpful integrations or synergies?</p>\n<p>People may also be interested in Ozzie Gooen's discussion document on the <a href=\"https://impact.hackpad.com/Advantages-and-Disadvantages-of-a-Monolith-Application-ZlrQRl3LHCg\">Advantages and Disadvantages of a Monolith Application</a>. I'm conscious of the disadvantages, and am a believer in decentralisation. </p>\n<p>As Niel Bowerman commented there, profiles bases sometime do evolve into monoliths. The ever-growing list of things you can do on Facebook is an example, although that's partly because Facebook is a platform for independent applications; in the same way, people can build independent applications either on top of the Profiles or leveraging them somewhere else, through .impact.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "pFAzQ3vaWDhKsiJ4P", "postedAt": "2014-10-10T00:32:50.962Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<blockquote>\n<p>Facebook group recently passed 4,000 members</p>\n</blockquote>\n<p>Many of those are spam accounts. A very large number of 'members' have profile set in either Africa, Arabic countries or Pakistan, and most of them seem to be fake accounts. </p>\n<ul>\n<li>They typically have no or few interests in common with flesh-and-blood EAs</li>\n<li>Their profiles will show little activity, except for frequent changes of profile picture.</li>\n<li>Their profile pictures will frequently not depict the same person.</li>\n<li>If they post statuses, they will be extremely generic, feel-good statuses with little personalisation.</li>\n<li>They will be a member of many many facebook groups.</li>\n<li>Often their profile contains no english language content.</li>\n<li>They never comment in the group, except to occasionally try to sell sunglasses.</li>\n<li>They have 0 mutual friends, and 0 friends in the group.</li>\n</ul>\n", "parentCommentId": "zukhh7Cj6HhBWMiGo", "user": {"username": "Larks"}}, {"_id": "inBhFMaCmLvHsq3js", "postedAt": "2014-10-10T09:12:57.514Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Ah, that's interesting, and important as I've often heard people cite the Facebook group as evidence of EA's growth. Do you have a rough sense of how many of them are spam accounts? How many of them actually try spamming? I make a point of staying off Facebook for long periods, but I never noticed a period in which there was a lot of spam - but perhaps this is a sign that there was more moderation going on than I noticed. Is frequent spam the reason we've switched to requiring FB posts to go through pre-moderation before appearing?</p>\n", "parentCommentId": "pFAzQ3vaWDhKsiJ4P", "user": {"username": "Tom_Ash"}}, {"_id": "uPNg6KRtsggSZ93um", "postedAt": "2014-10-10T22:32:33.316Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<blockquote>\n<p>Do you have a rough sense of how many of them are spam accounts? </p>\n</blockquote>\n<p>Unfortunately I don't know of any tool that would allow us to easily judge this; FB doesn't make it easy to look at the properties of your group's members. I would guess over half. Most of them are not active - if one posts spam, and I'm on my laptop, I'll block them from the group - unfortunately this option is not available on my phone. Similarly, maybe 50% of all posts to the group are spam of some kind.</p>\n<blockquote>\n<p>Is frequent spam the reason we've switched to requiring FB posts to go through pre-moderation before appearing?</p>\n</blockquote>\n<p>Yes</p>\n", "parentCommentId": "inBhFMaCmLvHsq3js", "user": {"username": "Larks"}}, {"_id": "FAeoDdZtuJfHeRroL", "postedAt": "2014-10-11T09:14:00.395Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Interesting, though you'd expect most users to not be active. When you say 50% of posts are spam, do you mean they're &quot;I'm a spambot selling viagra&quot; posts, or &quot;I'm a real person who came across EA and used this group to promote my tangentially related cause/group/etc.&quot;?</p>\n", "parentCommentId": "uPNg6KRtsggSZ93um", "user": {"username": "Tom_Ash"}}, {"_id": "xP2u7caD53WbMbZsr", "postedAt": "2014-10-11T21:52:18.899Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Mainly product adverts - tends to be sunglasses rather than viagra though.</p>\n", "parentCommentId": "FAeoDdZtuJfHeRroL", "user": {"username": "Larks"}}, {"_id": "opjxwizhpjeaQeNtp", "postedAt": "2014-10-21T07:10:55.917Z", "postId": "5kFwcwDawAHZx6Tqd", "htmlBody": "<p>Great project!!! Cannot wait to see the results for the annual survey.</p>\n", "parentCommentId": null, "user": {"username": "Joey"}}]