[{"_id": "ELfSLL6QKdLhJZ5zv", "postedAt": "2023-02-26T00:23:07.702Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>Commenting briefly to endorse the description of my course as an MVP. I'd love for someone to make a better produced version, and am happy for people to use any ideas from it that they think would be useful in producing the better version</p>\n", "parentCommentId": null, "user": {"username": "alexrjl"}}, {"_id": "gX7pHda4vutyuzP8i", "postedAt": "2023-02-26T00:23:54.516Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>(I'm excited to think more about the rest of the ideas in this post and might have further comments when I do)</p>\n", "parentCommentId": "ELfSLL6QKdLhJZ5zv", "user": {"username": "alexrjl"}}, {"_id": "QKC74wjj7zufgxWzD", "postedAt": "2023-02-26T06:06:45.190Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>re: \"Short stories about AI futures\" -- you might be heartened to know that the Future of Life institute has commissioned some additional examples of this genre, via their \"<a href=\"https://forum.effectivealtruism.org/posts/LjExZCPCHnNNTFDfq/fli-launches-worldbuilding-contest-with-usd100-000-in-prizes\">AI Worldbuilding Competition</a>\"! &nbsp;Contestants had to submit two 1000-word short stories describing an \"aspirational\" future where AI development goes well, plus artwork and short answers to questions about the detailed impacts of AI on different parts of society from 2022 - 2045. &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/HEszzR4Am7PxN3hBG/here-are-the-finalists-from-fli-s-usd100k-worldbuilding\">Here's my summary of some of the top entries</a>, and some extra detail on the motivation behind <a href=\"https://www.lesswrong.com/posts/qo2hqf2ha7rfgCdjY/a-bridge-to-dath-ilan-improved-governance-on-the-critical\">my own, 2nd-place-winning submission</a> (which is heavily themed around how prediction markets and other improvements to institutional decisionmaking could help mitigate AI risk). &nbsp;The Future of Life institute plans to release podcast interviews about some of the winning worldbuilding scenarios, and I think they're also trying to promote the stories in a few other ways.<br><img src=\"https://res.cloudinary.com/cea/image/upload/v1677391606/mirroredImages/QKC74wjj7zufgxWzD/heellgbnjuvoh8tr7beq.jpg\"></p><p>But putting aside FLI's project- (and its focus on optimistic/utopian scenarios), I <a href=\"https://forum.effectivealtruism.org/posts/jsqTCrixFHEQsSTTj/13-ideas-for-new-existential-risk-movies-and-tv-shows-what?commentId=Fx2Y59gFg9xpmbWdp\">totally agree</a> that a documentary-style movie trying to tell a realistic story of AI catastrophe could be very informative and very influential, following in the footsteps of nuclear-war \"documentaries\" like you mentioned. &nbsp;Take the framework of something like gwern's \"<a href=\"https://gwern.net/fiction/clippy\">Clippy</a>\" story, add in some side-plots about how the relevant companies / government agencies / etc behave in the lead-up to the disaster, and weave in a little bit of human drama -- done right, it could be an incredible tool for <a href=\"https://forum.effectivealtruism.org/posts/CcJsh4JcxEqYDaSte/spreading-messages-to-help-with-the-most-important-century\">spreading important AI safety concepts</a> in a responsible, high-bandwidth way.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "8hLwfCSuks83uu8ts", "postedAt": "2023-02-26T12:28:46.497Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>re: Forecasting Guide: &nbsp;Juan Cambeiro and Michael Hewlett are launching a <a href=\"https://forecasting.notion.site/Forecasting-Predict-the-Odds-of-Future-Events-acba326fa6c345c993ffca74e1f3933c\">class</a> on forecasting that is expected to have a pilot round in March 2023</p>", "parentCommentId": null, "user": {"username": "Irene Hulsen"}}, {"_id": "n7iymm3gGko36cosj", "postedAt": "2023-02-26T21:31:43.581Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>Great ideas, Fin!</p><p>On the BOTEC tools, regarding:</p><blockquote><p>Making probabilistic estimates involves different kinds of distributions over variables, then sometimes combining those distributions, doing sensitivity analysis, visualising your new distribution, and so on. The thought is that it’s very clumsy to do this with e.g. Python plus a bunch of data viz libraries.</p></blockquote><p>Note there is <a href=\"https://pypi.org/project/squigglepy/\">Squigglepy</a>, which was announced <a href=\"https://forum.effectivealtruism.org/posts/nj9FLkifyb3s6Eijx/announcing-squigglepy-a-python-package-for-squiggle\">here</a> by Peter Wildeford. It \"implements many Squiggle-like functionalities in Python\".</p><p>On the billionaire impact list, there is <a href=\"https://forum.effectivealtruism.org/posts/LCJa4AAi7YBcyro2H/proposal-impact-list-like-the-forbes-list-except-for-impact\">this</a> proposal from Elliot Olds (and <a href=\"https://forum.effectivealtruism.org/posts/wPz7iQizzaxtvc4bX/brief-evaluations-of-top-10-billionnaires\">this</a> shallow analysis of the top 10 richest people from Nuño Sempere, and <a href=\"https://forum.effectivealtruism.org/posts/nqJDGjccGLDKdGnXE/social-impact-of-the-donations-of-the-10-richest-people-in\">this</a> very shallow one from me).</p><p>On the forecasting guide, there is <a href=\"http://www.stat157.com/calendar/\">this</a> great hands-on online course. The lead instructor is Jacob Steinhardt.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "AtZkJnvoL8eMEGvbr", "postedAt": "2023-03-01T03:51:16.953Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<blockquote><p>[P]eople also talk about ‘belief-mapping’ software as if it’s a well-established micro-genre. I’m still not exactly sure what this is, but here’s something that sounds to me like ‘belief-mapping’: I’d love a way to log my credences in different things, as well as richer kinds of beliefs like confidence intervals and distributional forecasts. A combination of a spreadsheet plus <a href=\"https://www.foretold.io/\">Foretold.io</a> can do all of this so far. But it could also be neat to express how beliefs must relate. For instance, if I update my credence in (A), and I’ve already expressed my credence in (B|A), then the software can tell me what my new credence in (B) should be, and update it if it seems reasonable. I could also say things like: “my credence in the disjunction <i>A or B or C</i> is 80% — so when I change one of A or B or C, please adjust the other two to add back up to 80%”. Or suppose I give some probability distribution over time for a “when will…” question, and then time passes and the event doesn’t happen.</p></blockquote><p>&nbsp;</p><p>I wrote a forum post about what I call \"<a href=\"https://forum.effectivealtruism.org/posts/s33LLoR6vbwiyRpTm/epistemic-maps-for-ai-debates-or-for-other-issues\">epistemic mapping</a>\" as well as a related post on \"<a href=\"https://forum.effectivealtruism.org/posts/9RCFq976d9YXBbZyq/research-reality-graphing-to-support-ai-policy-and-more\">Research graphing</a>\" to support AI policy research (and other endeavors). I've begun working on a <a href=\"https://kumu.io/hmdurland/ai-gps-research-graphing-v1-sc-export-controls-focus#test-map-1\">new, more-focused demo</a> (although I'm still skeptical that it will get any traction/interest). I also <a href=\"https://www.lesswrong.com/posts/kYDgKsyzFEWogzDEE/harrisondurland-s-shortform?commentId=STQRsXdAJ2t8G8Cwd\">just wrote up a shortform response</a> to Leverage's report on \"argument mapping\" (which multiple people have directed me towards, with at least one of those people citing it as a reason to be skeptical about \"argument mapping\"). I've even published a relevant article on this topic (\"<a href=\"https://georgetownsecuritystudiesreview.org/2022/11/30/complexity-demands-adaptation-two-proposals-for-facilitating-better-debate-in-international-relations-and-conflict-research/\">Complexity Demands Adaptation...</a>\").</p><p>In short, I'm a big advocate for trying new research and analysis methods under the umbrella of what you <i>might broadly</i> call \"belief-mapping.\"</p><p><strong>Despite my enthusiasm for some of this, I am honestly quite skeptical of attempts to create end-to-end calculations for analyses which feature very interconnected, dynamic, hard-to-evaluate, and hard-to-explicate variables</strong>—which applies to most of the world beyond a few disciplines. At least, I'm skeptical of tools which try to do much more than Squiggle/Excel can already do (e.g., mapping the relationships between a lot of credences). <strong>In my view, the more important and/or fixable failure modes are \"I can't remember all the reasons—and sub-reasons—I had for believing X,\" and \"I don't know other people's arguments (or responses to my counterarguments) for believing X.\"</strong><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefciz117k3hc7\"><sup><a href=\"#fnciz117k3hc7\">[1]</a></sup></span></p><p>I've been meaning to write up my thoughts on this kind of proposal for a few weeks (perhaps as part of a \"Why most prior attempts at 'argument mapping' have failed, and why that doesn't spell doom for all such methods\" post series), but am also skeptical that it will reach a sufficiently large audience to make it worthwhile. If someone were actually interested, I might try to organize my thoughts more quickly and neatly, but otherwise IDK.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnciz117k3hc7\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefciz117k3hc7\">^</a></strong></sup></span><div class=\"footnote-content\"><p>While paragraphs and bullet points can and do mitigate this to some extent, it really struggles to deal with complex debates (for a variety of reasons I have listed on various Notion pages but have yet to write a published post/comment on).</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "umuftgytcR2GpG4nA", "postedAt": "2023-03-01T11:42:11.827Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>Great list, thanks for sharing! I'm grateful for the inspiration you've given me — I created <a href=\"https://quizmanity.org/\">Quizmanity.org</a> by working on one of your ideas ;)</p><p>By the way, a cousin of the achievements ledger is the <a href=\"https://aisafety.world/\">AI Safety world map</a>, which shows all the organizations working to reduce existential risk from AI.</p><p>'The Humanity Times' is a brilliant name! I've previously designed a front page that reflects a similar concept:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/v1677670932/mirroredImages/umuftgytcR2GpG4nA/wdvwgxr74tpkbn3qvzpy.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1677670934/mirroredImages/umuftgytcR2GpG4nA/hoi18zhxy4bee7hos3fo.png 120w, https://res.cloudinary.com/cea/image/upload/v1677670934/mirroredImages/umuftgytcR2GpG4nA/mfdzxr7rtmemmmxu65bh.png 240w, https://res.cloudinary.com/cea/image/upload/v1677670933/mirroredImages/umuftgytcR2GpG4nA/krfgqdmt9iw3dcrozzg8.png 360w, https://res.cloudinary.com/cea/image/upload/v1677670934/mirroredImages/umuftgytcR2GpG4nA/xxhffr79trhqy0x8pnea.png 480w, https://res.cloudinary.com/cea/image/upload/v1677670933/mirroredImages/umuftgytcR2GpG4nA/ymk7mjys1nsg64x2n5og.png 600w, https://res.cloudinary.com/cea/image/upload/v1677670933/mirroredImages/umuftgytcR2GpG4nA/nz07eewa1xunx4sskks8.png 720w, https://res.cloudinary.com/cea/image/upload/v1677670932/mirroredImages/umuftgytcR2GpG4nA/o9tkg3jr0oaubyhrowf8.png 840w, https://res.cloudinary.com/cea/image/upload/v1677670933/mirroredImages/umuftgytcR2GpG4nA/yqkndze7ji6xcxkbnjrp.png 960w, https://res.cloudinary.com/cea/image/upload/v1677670933/mirroredImages/umuftgytcR2GpG4nA/jwua9kzscse8fegq4zta.png 1080w, https://res.cloudinary.com/cea/image/upload/v1677670932/mirroredImages/umuftgytcR2GpG4nA/g4x9u6nv5jw7pksom5d4.png 1156w\"></figure>", "parentCommentId": null, "user": {"username": "andreferretti"}}, {"_id": "aLWtzGpPpeukjXgHD", "postedAt": "2023-03-02T09:10:32.143Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>With regard to BOTEC tools, if Excel interoperability seems important (and I agree that it does seem important), I'd encourage anyone interested in working on this to check out <a href=\"https://www.probabilitymanagement.org/excel-tools\">SIPmath</a> (an Excel-plugin for Monte Carlo simulation). &nbsp;Creating a SIPmath model requires the plugin, but once the model is created, it will run for anyone who has Excel (even if they don't have the plugin). <a href=\"https://www.probabilitymanagement.org/sipmath\">SIPs</a> (Stochastic Information Packets) are also platform agnostic which seems like it could be useful.</p>", "parentCommentId": null, "user": {"username": "Tess Hegarty"}}, {"_id": "GNMuMinfnRkR8hn7g", "postedAt": "2023-03-14T15:56:45.329Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>Thanks for the Possible Worlds Tree shout-out!</p>\n<p>I haven't had capacity to improve it (and won't for a long time), but I agree that a dashboard would be excellent. I think it could be quite valuable even if the number choice isn't perfect.</p>\n", "parentCommentId": null, "user": {"username": "Ideopunk"}}, {"_id": "WviHJM3WgFF3iYmBy", "postedAt": "2023-04-20T10:28:27.993Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>Thank you for a cool list of ideas! On the BOTEC-tool idea I want to note that there are many ongoing projects related to this that you should check out (if you haven't already). I have listed serious efforts that I have found so far in <a href=\"https://forum.effectivealtruism.org/posts/dsG5SYjhPqnxhystM/two-directions-for-research-on-forecasting-and-decision#Barriers_to_effect___rigour_relevance\">this section of this post</a>. Also, I'm curious about how far you and Tom have come in working on this. Are you just starting out, or are you making this now?</p>", "parentCommentId": null, "user": {"username": "paal-fredrik-skjorten-kvarberg"}}, {"_id": "EB3sQWTx9fkNJD6FH", "postedAt": "2023-04-20T13:42:59.629Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>Thanks for that link! Since writing this post I have become aware of a bunch of exciting BOTEC-adjacent projects, especially from speaking with <a href=\"https://adambinks.me/\">Adam Binks</a> from Sage / <a href=\"https://www.quantifiedintuitions.org/\">Quantified Intuitions</a>.</p><blockquote><p>I'm curious about how far you and Tom have come in working on this.</p></blockquote><p>I'm not actively working with Tom on this project, but I could put you in touch.</p>", "parentCommentId": "WviHJM3WgFF3iYmBy", "user": {"username": "finm"}}, {"_id": "oWGyWSSnNs2DioqLF", "postedAt": "2023-04-28T00:56:57.117Z", "postId": "5KsrEWEbc4mwzMTLp", "htmlBody": "<p>I just started a project along similar lines called Actually Relevant. You can see a first prototype at <a href=\"https://actuallyrelevant.news/\">https://actuallyrelevant.news/</a>. Would love to be in touch with both you and @finm to discuss it! Please send a PM if you're interested.</p>\n", "parentCommentId": "umuftgytcR2GpG4nA", "user": {"username": "OdinMB"}}]