[{"_id": "kMrnmuxf5bSz28eLj", "postedAt": "2022-12-25T18:53:58.718Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>Off-topic but I thought the 'Company', 'Valuation' and 'Severity' columns were too narrow. They're hard to read on mobile.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AryanYadav"}}, {"_id": "7ho5wTJdnR8RNJSKC", "postedAt": "2022-12-25T20:05:18.341Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>Thanks! How does it look now?</p>", "parentCommentId": "kMrnmuxf5bSz28eLj", "user": {"username": "Ben_West"}}, {"_id": "iw9ohuXTyaebFJ4de", "postedAt": "2022-12-25T20:22:12.541Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>Looks good, thanks!</p>\n", "parentCommentId": "7ho5wTJdnR8RNJSKC", "user": {"username": "AryanYadav"}}, {"_id": "heye4gyCWyFJowL64", "postedAt": "2022-12-25T22:49:03.772Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>I think it's worth noting that fraud can be a grey thing. Which of the following are fraud:<br>A) Two founders raise $2M at a $20M valuation. They pay themselves $500k each for two years (a bit higher than their previous FAANG salaries), don't work that hard, write a bit of code but not enough for the product. They ultimately try to raise more but fail to do so and dissolve the company giving investors nothing back (all the money is spent).<br>B) Companies collect credit card details on a 7 day free trial of their product where only shipping needs to be paid. Immediately after 7 days, they charge the credit cards $1000 and send product saying that in the fine print they had to cancel within 7 days or they would be sent the product. The customers would never pay for the product, comparable products cost $100 for what was sent and the company refuses to provide any refund. They spent a lot on the advertisement and got 5000 people to take the 7-day free trial, 4500 of whom did not cancel.<br>C) Medical startup administers more tests than is necessary charging health insurance providers (Medicare and private insurance). Rarely a test finds something that otherwise would have been missed but was definitely not required given symptoms.<br>D) Company X raises $500k at a $5M valuation. They spend $250k reasonably on product development. They then need $500k for a mold for manufacturing. They look for financing in the form of bridge loans, raising additional capital, going back to investors telling them they need another $250k, etc. and don't manage to do so. CEO of Company X decides that this mold is pivotal for the company and is a good poker player.&nbsp;<br>i) He takes the $250k to the poker table and doubles the money.<br>ii) He loses $150k and then decides to save the other $100k<br>iii) He loses the $250k<br>E) Company X raises a seed round and builds an MVP. They then go on to raise a series A, showing investors a beautiful exponential curve of new users. The company allows the first use of an account to be for free and subsequent use costs $5. Founders purposely make signing up for new accounts very easy such that they know multiple people are making several accounts to use the product for free.<br>F) Company X gets funded by YC and takes the $125k and $375k cheques for 7% and the MFN safe. They never intend to raise another round since they are already profitable but they need to in order to satisfy the MFN clause. They get a family friend to invest $100k at a $1B valuation forcing YC to take those terms. Maybe they later buy out the friend for $105k a few months later.<br><br>I don't know which of the above legally qualifies as fraud but I sure think all of them are at the very least wrong. I'd probably call all of them fraud since they are deliberately deceiving people for financial gain by being credited with false accomplishments/qualities. I also think reasonable people can disagree with me.</p>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "spdGPyMQGxXuttKCs", "postedAt": "2022-12-26T00:40:22.387Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>I’m probably being daft.. but what does this have to do with effective altruism?</p>\n", "parentCommentId": null, "user": {"username": "Aidan Alexander"}}, {"_id": "aCsz3wzg5JecBEwo2", "postedAt": "2022-12-26T01:57:00.933Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>It’s interesting to me, because many entrepreneurs like myself get into entrepreneurship with (we sincerely believe) a goal of making the world a better place. Some are seemingly frauds. It is good to read this, to gain perspective on what not to do.</p>\n", "parentCommentId": "spdGPyMQGxXuttKCs", "user": {"username": "lincolnq"}}, {"_id": "bmrMvPN4eWX8JB8QX", "postedAt": "2022-12-26T04:47:21.012Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>My thought was: base rates for FTX-style disasters?</p>\n", "parentCommentId": "spdGPyMQGxXuttKCs", "user": {"username": "joel_bkr"}}, {"_id": "bCnPWGjKrKFfhBSLh", "postedAt": "2022-12-26T08:53:19.877Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>Got it. FTX wasn't Y-combinator incubated right? (A quick google doesn't seem to suggest it was). Not that that nullifies your point - I'm just clarifying</p>", "parentCommentId": "bmrMvPN4eWX8JB8QX", "user": {"username": "Aidan Alexander"}}, {"_id": "mgt6DRLKvfvbtZvic", "postedAt": "2022-12-26T16:29:29.104Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>That's correct. YCombinator is a convenience sample for rapid-growth companies. I would find it helpful of people repeated this for other samples; the next one on my mind currently is Sequoia-backed companies.</p>", "parentCommentId": "bCnPWGjKrKFfhBSLh", "user": {"username": "Ben_West"}}, {"_id": "qu7oDKxeeMKAvKoNu", "postedAt": "2022-12-28T18:25:59.953Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>Don't forget <a href=\"https://en.wikipedia.org/wiki/TriNet_Zenefits\">Zenefits</a>!</p><blockquote><p>In 2016 an internal legal investigation at Zenefits found the company's licensing was out of compliance and that Conrad had created a <a href=\"https://en.wikipedia.org/wiki/Browser_extension\">browser extension</a> to skirt training requirements for selling insurance in California.<a href=\"https://en.wikipedia.org/wiki/TriNet_Zenefits#cite_note-Buzzfeed.com-15\"><sup>[15]</sup></a> After self-reporting these issues, Zenefits hired an independent third party to do an internal audit of its licensing controls and sent the report to all 50 states.<a href=\"https://en.wikipedia.org/wiki/TriNet_Zenefits#cite_note-CNNMoney-16\"><sup>[16]</sup></a> The <a href=\"https://en.wikipedia.org/wiki/California_Department_of_Insurance\">California Department of Insurance</a> as well as the Massachusetts Division of Insurance began investigations of their own based on Zenefits' report.<a href=\"https://en.wikipedia.org/wiki/TriNet_Zenefits#cite_note-BusinessWeek-Zenefits-17\"><sup>[17]</sup></a><a href=\"https://en.wikipedia.org/wiki/TriNet_Zenefits#cite_note-18\"><sup>[18]</sup></a> Parker Conrad resigned as CEO and director in February and COO <a href=\"https://en.wikipedia.org/wiki/David_O._Sacks\">David O. Sacks</a> was named as his replacement.</p></blockquote><p>Zenefits was valued at $4.5b in 2015 and was all downhill after the incident; they did three rounds of layoffs in four years and were eventually acquired by a no-name company for an undisclosed price in 2022. It's unclear how much of that decline was directly a result of the fraud, vs. the founder's departure, vs. them always having had poor fundamentals and being overvalued at $4.5b due to hype.</p>", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "qshQMEvXvCwZ85G5L", "postedAt": "2022-12-28T20:26:36.433Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>Thanks! I don't really understand if this technically qualifies as fraud, but seems spiritually similar – I added it to the table and cited you.</p>", "parentCommentId": "qu7oDKxeeMKAvKoNu", "user": {"username": "Ben_West"}}, {"_id": "FtPAjMjxhmrX8Jndn", "postedAt": "2022-12-29T07:27:31.712Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>The Aaron Swartz thing is not really the same kind of thing as the others, on various levels. See: <a href=\"https://en.wikipedia.org/wiki/United_States_v._Swartz\">https://en.wikipedia.org/wiki/United_States_v._Swartz</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Miles_Brundage"}}, {"_id": "7NyoEGyG5h7sefiBY", "postedAt": "2022-12-29T08:12:28.942Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<p>If a VC isn't investing in some frauds they're being overly conservative IMO given the extreme power laws that govern the returns to VC investing. &nbsp;Of course you need to do some due diligence, but ultimately it's going to be way too much time and effort to flush out every potential fraudster that wants your money, and you only have so much time to find good investment opportunities.&nbsp;</p><p>Obviously that piece &nbsp;on Sequioa's website about how amazing SBF is looks terrible in hindsight, but I thought a lot of the commentary surrounding it betrayed a fundamental misunderstanding of how early-stage investing actually works vs late-stage investing. &nbsp;Perhaps fair enough to criticize the people who invested in FTX in late 2021 or 2022 (they did their Series C only in Jan 2022!), but even then it's probably not always easy to distinguish between a hypergrowth company &amp; an unsustainable fraud from the outside. And ofc SBF had told a lot of lies to everyone, his investors included. The better argument might be that any VC that touches crypto is an idiot because the whole space is ultimately going to zero (I don't actually believe that but it's not far off, certainly most currrent projects will fail including BTC), but then again, through token sales crypto offers amazing ways for VCs to make money even on failed investments.&nbsp;<br><br>Ultimately VC is just very different to most other forms of investing, including investing the reputational capital of your movement on a high-profile billionaire. Then you really should do some DD.</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "xoXmx9vctmrPpFocb", "postedAt": "2022-12-29T20:48:29.285Z", "postId": "5mghcxCabxuaK4WTs", "htmlBody": "<blockquote>\n<p>Ultimately VC is just very different to most other forms of investing, including investing the reputational capital of your movement on a high-profile billionaire. Then you really should do some DD.</p>\n</blockquote>\n<p>This. We forgot that our movement runs on reputation, and reputation is easy to lose, and hard to gain (And rightly so.)</p>\n", "parentCommentId": "7NyoEGyG5h7sefiBY", "user": {"username": "Sharmake"}}]