[{"_id": "w5GgksiixgmmEHHFo", "postedAt": "2015-06-18T19:12:44.862Z", "postId": "5myr8o8XoLFg3H2hb", "htmlBody": "<p>Not an expert by any means but I did work on a research project looking at financial regulation in the UK and the EU (the Treating Consumers Fairly agenda at the FCA and in the EC) and values-based regulation in general, if anything you are looking at ever happens to overlap with those topics!</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "vwDSjD84KXpdHnYzS", "postedAt": "2015-06-18T20:20:57.417Z", "postId": "5myr8o8XoLFg3H2hb", "htmlBody": "<p>What does the &quot;assessment&quot; column mean?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "NxQthhJxFN9RPa7P9", "postedAt": "2015-06-18T23:35:28.845Z", "postId": "5myr8o8XoLFg3H2hb", "htmlBody": "<p>There are lots of ways you could improve policy making, for example:</p>\n<ul>\n<li>campaigning for more better regulation policy</li>\n<li>campaigning for increased transparency of policy decisions</li>\n<li>going into politics</li>\n<li>choosing a particular well evidenced policy and campaigning for it.</li>\n<li>a global focus encouraging particular policies to be introduced, rather than a US focus.</li>\n</ul>\n<p>What you are doing looks great. Yet I am curious as to why and how you settled on the the path you are going down, of commenting on regulations in US policy making. </p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "ELxrBodtE5u8Rpk6s", "postedAt": "2015-06-20T22:58:09.750Z", "postId": "5myr8o8XoLFg3H2hb", "htmlBody": "<p>In an early version of the sheet we had multiple columns subjectively assessing things like the replaceability of comments, how high impact an influential comment could be, and our sense of how probable influence was. Each person on the team had their own column for ranking importance. </p>\n<p>In the current sheet, these were merged together to make a rough prioritization and remove clutter from the sheet for those who help us. That being said, this prioritization did not take into account our current team ability to produce comments, or the fact that easier comments may be good for feedback. This is why we submitted a low importance comment as a feedback test.</p>\n", "parentCommentId": "vwDSjD84KXpdHnYzS", "user": {"username": "Gentzel"}}, {"_id": "FKTT3dWBxWA9ADeYt", "postedAt": "2015-06-28T02:21:04.407Z", "postId": "5myr8o8XoLFg3H2hb", "htmlBody": "<p>I've been looking for EA projects to fund - what's your budget for this year, and is it funded?</p>\n", "parentCommentId": null, "user": {"username": "Ervin"}}, {"_id": "7jXnXNhQXNz3Fs2F3", "postedAt": "2015-06-29T14:36:17.810Z", "postId": "5myr8o8XoLFg3H2hb", "htmlBody": "<p>I just spent the last 4 1/2 years as an energy efficiency consultant where we primarily wrote comment letters to influence the national energy efficiency mandatory standards, national voluntary (ENERGY STAR), and California mandatory standards. I do think that we had significant impact on the stringency of the standards. Without an energy efficiency advocate voice, regulators will trust what manufacturers say. We worked on the neglected smaller products like battery chargers, clothes dryers, lighting, computers, small network equipment, TVs, etc. There is a lot of interest in the big products like cars and heating ventilating and air conditioning, so it is harder to make an impact. But in the smaller products, there was a study that showed that the national government estimated incremental cost of meeting the standard was an order of magnitude greater than what it actually cost manufacturers to meet. And my experience is that manufacturers claim that the incremental cost would be an order of magnitude greater than what the national government said. And the advocates claimed an order of magnitude less than the regulators, so we were closest to the truth. Even though the work was high impact, it did cost hundreds of thousands of dollars, because in order to convince the regulators, we needed to do not only writing, but also testing products and in some cases tearing them down and making them more efficient to show what could be done.\nThe broader picture here is that even though this work was high impact by US standards, the cause of climate change is not high impact (see next collective action post comments, and my own calculations indicated that global poverty was about two orders of magnitude more cost effective at helping the present generation than climate change, though it could possibly be high impact when concerning future generations). So I would say this type of work would be good if you can target the four effective altruism areas of global poverty, animal welfare, global catastrophic risk, and meta-charities. But otherwise, I think there is higher priority work to do. And that's why I left my job to do global catastrophic risk work.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}]