[{"_id": "S8Je9xxFLQkBuBKfs", "postedAt": "2023-06-02T17:19:21.330Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Thanks for this post Jenn! I think it's great to share perspectives from traditional non-profits! I think we should absolutely be trying our best to adopt what works really well at traditional non-profits. I think all the lessons you've raised make a lot of sense, and I'm especially passionate about the power of great customer service in all interactions!&nbsp;</p>", "parentCommentId": null, "user": {"username": "GraceAdams"}}, {"_id": "3YpvduZbbAvDiebMj", "postedAt": "2023-06-02T17:40:29.539Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Offtopic: This post was a joy to read. Would love to read if you have any thoughts to share about writing in general, but no worries if not. :) Welcome to the forum.</p>\n", "parentCommentId": null, "user": {"username": "Teo Ajantaival"}}, {"_id": "CSLrGai4Yyc3552Zr", "postedAt": "2023-06-02T20:03:14.221Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Do you have any suggestions or takes about ways to move towards the sketches for EA integration for points 1 and 4?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sam Robinson"}}, {"_id": "hgmew6y7xCMYc5D9X", "postedAt": "2023-06-02T21:19:45.427Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Great post! I love the scout / open mindset you display in this post. It was very interesting to learn more about possible areas of improvement for EA orgs.</p>\n", "parentCommentId": null, "user": {"username": "DaneelO"}}, {"_id": "Ji5n4rd83GMESeur7", "postedAt": "2023-06-03T01:28:00.390Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Thank you! Honestly, I think all of the advice that I could give has been said better by Scott here: <a href=\"https://slatestarcodex.com/2016/02/20/writing-advice/\">https://slatestarcodex.com/2016/02/20/writing-advice/</a></p><p>He's been a really big influence on the way that I think, and also my writing style :)</p>", "parentCommentId": "3YpvduZbbAvDiebMj", "user": {"username": "jenn"}}, {"_id": "zHAMRG3MkQvzbxdh8", "postedAt": "2023-06-03T02:55:27.137Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>I really appreciate that you wrote this post. I think these are some extremely valuable lessons and a good reminder that EA orgs are not always more enlightened than traditional charities.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "pcJkSv2sQQZ3yW9nj", "postedAt": "2023-06-03T03:56:08.529Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Thanks for writing this, I found it really interesting.</p>", "parentCommentId": null, "user": {"username": "Sam Glover"}}, {"_id": "KNCg8LHn7sPpQPcR2", "postedAt": "2023-06-03T21:38:01.490Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>I think point one is simultaneously really important and also a really risky thing for EA to pursue. I think a lot of the current discussion around EA's reputation has been really defensive/reactive. Part of that is because we're trying to put out controversy fires, but I also think that EAs are much more comfortable not interacting at all with illegible, traditional systems and undervalue what playing the game well could get us.</p><p>As a dramatic example, the UN spent <a href=\"https://unsceb.org/expenses-sdg\">$47 billion in 2021</a> on a hilariously imbalanced set of <a href=\"https://en.wikipedia.org/wiki/Sustainable_Development_Goals#Listing_of_17_goals_with_their_targets_and_indicators\">17 development goals</a>. These goals are revised every 15 years. We can try to grab a seat at the table in 2030 or 2045 and align the new goals with EA principles - that could mean billions dollars per year diverted to EA causes assuming current funding levels. (This is a very very conservative assumption btw - funding appears to be increasing steadily YoY)</p><p>But on the flipside, would an organization that can get a seat at the UN table still be recognizably EA? Or will we have destroyed the heart of it to get there?</p><p>EA has some essential weirdnesses that will mean that it'll always be a black sheep in the nonprofit industrial complex, and I really don't want to see us lose those weird things for the sake of increasing reputation/funding. So it'll be a delicate balancing act.</p><p>I personally think that the ideal (but very difficult) way forward is to try to be (and also seem<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref5dhlvbe4c8i\"><sup><a href=\"#fn5dhlvbe4c8i\">[1]</a></sup></span>) so staunchly ethical that it warps public opinion away from the rest of the nonprofit ecosystem and towards us, instead of trying to become part of the trad nonprofit in-group. I think the <a href=\"https://thingofthings.substack.com/p/fun-facts-from-what-we-owe-the-future\">anti-slavery activist and quaker, Benjamin Lay</a>, is an inspirational figure for this path.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn5dhlvbe4c8i\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref5dhlvbe4c8i\">^</a></strong></sup></span><div class=\"footnote-content\"><p>To be explicit, this means stopping or setting much higher bars for doing things that are effective and <i>actually are the rational things to do</i> in a social vacuum but burn social capital. Buying castles, having really nice office spaces, paying above market rates for employees at EA charities, overly enthusiastic and conspicuously well funded university groups, etc.</p><p>My sense is that a lot of EAs think that trading off reputation to do these effective things is worth it, but my claim is that they think so because they don't realize how good the upside of having a good reputation is. I certainly didn't think of positive reputation as having any value before I started working at Samaritans; my model was that reputation is something that you strive to keep non-negative and then you're basically good.</p><p>I also do want to state explicitly that even <i>with</i> the correct model of the upside of having a stellar reputation, it could still be more optimal in the long run to continue to do things that are slightly offputting. \"Reputation is priceless\" is not literally true; it could be more effort than it's worth to pursue for EA considering that we have a pretty deep stock of like, google softengs who feel very alienated from the trad nonprofit world etc</p></div></li></ol>", "parentCommentId": "CSLrGai4Yyc3552Zr", "user": {"username": "jenn"}}, {"_id": "W89eMSpuAh3REsomY", "postedAt": "2023-06-03T21:45:04.116Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Man, I really wish I had more to say about point 4! It's so deeply counter-intuitive that people would literally risk eviction or starvation than go to places that treat them kind of crappily, but that's honestly the extent of the observation.</p>", "parentCommentId": "CSLrGai4Yyc3552Zr", "user": {"username": "jenn"}}, {"_id": "gFdsXqkeSkwiAozyF", "postedAt": "2023-06-04T00:34:51.054Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Could it be that these places actually told them that they couldn't help them, or tried to help but weren't able to solve their issues, rather than they decided to leave because they weren't being spoken to nicely enough or something? I too would predict that they would prioritise solving their urgent issues over feeling comfortable. It could also be that showing a lot of care indicates that you are correctly understanding their issues and needs and are better equipped to give helpful advice, so their avoidance of places that treat them badly does not necessarily signify distorted priorities.&nbsp;<br><br>Great post btw!</p>", "parentCommentId": "W89eMSpuAh3REsomY", "user": {"username": "AnnieAB"}}, {"_id": "Km5rB7YpLdry4L5D5", "postedAt": "2023-06-05T05:40:16.293Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>\"Don't throw the baby out with the bathwater\" is a really great piece of wisdom...just because you have some new useful take on an old process, doesn't mean the old one doesn't have some really good stuff in it already.&nbsp;<br><br>EA brings the scientific process to charity...charity was long overdue for this...but the collective wisdom of hundreds of years or more of charitable work is rich with effectiveness of it's own, it didn't come from testing, but it did come from evolutionary processes.</p><p>This is just another support for my thesis that EA needs more veteran's, sprinkling their evolutionary wisdom in our midst. I'm so glad Jenn that you got this huge amount of experience and were able to translate it back to us...how about a bunch more like Jenn around?</p>", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "y6JyioydRa2jJbCay", "postedAt": "2023-06-05T10:13:51.037Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Thanks for this! I feel like I have a bunch of thoughts swirling in my head as a result of reading this :)</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "L3C8QrkQjEfTsS75n", "postedAt": "2023-06-05T15:23:27.067Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Thanks for posting this! Definitely agree that reputational dynamics are \"hard to overcome with brute cash\" -- and that they are <i>particularly </i>hard to overcome with brute cash in a relatively short period of time.</p><p>Looking at its resources, EA is in many ways much more capable of handling surge/emergency/opportunity needs than other social movements. If the necessity or advantage were compelling enough, it could deploy billions of dollars in fairly short order. Its surge capacity is somewhat less, but still considerable, for stuff that can be acquired with money even if non-readily. The limiting factor on EA's surge capacity is likely the stuff that can't be bought with money, or can't be bought in a matter of months to a few years. Given that various resources often work together in a synergistic manner, that's a considerable argument to me for investing in non-purchaseable resources for option value even if nothing else.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "Anhsy7hYsfQW2jdH9", "postedAt": "2023-06-05T18:49:56.114Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Thank you!</p><p>To go into the weeds a little, a lot of this goes back to funding restrictions. As an example, if you're helping people find employment, you generally operate using funding for that from the state, and the funding generally comes with stringent quotas and reporting requirements.</p><p>The expectation is, and what organizations generally do, is deal with the reporting requirements by requiring people to fill out a 3+ page intake form before they will book an appointment to talk to a person<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefica2g9uhkq\"><sup><a href=\"#fnica2g9uhkq\">[1]</a></sup></span>. Samaritans chooses to talk to people right away, subtly probing for answers during the meeting (since it's all stuff they need to know to help with the job search anyways) and have their staff fill out the forms themselves afterwards. This truly creates a lot more work on their end; you can maybe intuit that by choosing to internalize filling out the intake forms, Samaritans are spending 30% more time per client for the same amount of funding.</p><p>This sort of \"internalization\" is standard across Samaritans ventures. It is a giant pain, but they do it because it removes barriers for so many people to access much needed services.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnica2g9uhkq\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefica2g9uhkq\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In a truly unfortunate number of cases too, the forms are only available in English and the clients are new immigrants/refugees with limited English skills.</p></div></li></ol>", "parentCommentId": "gFdsXqkeSkwiAozyF", "user": {"username": "jenn"}}, {"_id": "CRrDjSF4JmMF3yCtZ", "postedAt": "2023-06-05T19:06:30.874Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>This also then loops right back to point 1; one reason they can afford to spend more time per client is that people are willing to be paid under market rate to work at Samaritans, because of its well deserved great reputation.</p><p>One more tactic for reputation management: they have a salary policy where everyone in the entire org has salaries that are within 15% of each other, and the founders, who work regular 60 hour weeks, earn around 55k a year (CAD). The messaging around this is that they both want more of their funding to go towards helping others, and that they want to pay around the Canadian median salary, and it helps with increasing solidarity between Samaritans workers and the people they help. Donors love this.</p><p>EAs have this take that you should pay people well, and it's a good take. It unfortunately also burns reputation.</p>", "parentCommentId": "Anhsy7hYsfQW2jdH9", "user": {"username": "jenn"}}, {"_id": "DMxYFZf9MoGmNpWZd", "postedAt": "2023-06-05T22:34:44.534Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Very interesting! I would want to see more evidence before concluding that EA salary practices affirmatively burn reputation, though. GiveWell and Open Phil look a bit higher than U.S. federal government to me, even after accounting for the fact that the feds don't adjust salaries enough in very high COL areas. But I sense that most other orgs pay at a somewhat lower scale . . . so on the whole EA pay may be roughly similar to US Government employee pay? It's not obvious to me how that rate of pay would affirmatively <em>burn</em> reputation.</p>\n", "parentCommentId": "CRrDjSF4JmMF3yCtZ", "user": {"username": "Jason"}}, {"_id": "osNSd2uahbPKy3D6H", "postedAt": "2023-06-05T23:02:22.560Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Many, many people think of government workers as lazy parasites who are overpaid and hard to fire for no reason, so I'm not sure that's a super useful comparison lol. I worked in the federal public service for a bit and experienced some of this firsthand :')</p>", "parentCommentId": "DMxYFZf9MoGmNpWZd", "user": {"username": "jenn"}}, {"_id": "yz6JD9Wy6swLNjsH9", "postedAt": "2023-06-06T00:11:04.928Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Fair enough, although I think thats a function of their perception of employee quality and about of effort than the rates per se. I used it as a comparison point because the USG underpays at the high end of the talent market (so it's under market rate for good talent) and because the pay scale is more uniform than the private sector and thus easier to compare with.</p>\n", "parentCommentId": "osNSd2uahbPKy3D6H", "user": {"username": "Jason"}}, {"_id": "w2dFA3Recv5SvdHLE", "postedAt": "2023-06-06T04:39:07.419Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<blockquote><p>I think another useful question to ask could be something like, “what is your fantasy partner/complement organization?”</p></blockquote><p><br>This part here is where my eyes widened. Adding this as standard question on EA grants is, in hindsight, so obviously a good idea to me that I am kinda in shock we don't do so already.</p><blockquote><p>Creating a group of EA free agents that can be allocated/rented to EA-aligned non-profits?</p></blockquote><p>Actually, this already exists I believe! I know there is a website called \"EA Services\" that allows you to sign up to basically be allocated around EA/EA-aligned orgs. Can anyone link the website? I've lost the URL.</p>", "parentCommentId": null, "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "sQYEu3ZYzxnsbAKSm", "postedAt": "2023-06-08T06:39:10.426Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Thank you for this post Jenn.  As someone who has worked in UK charities for my whole career (32 years) I am lurking with fascination around EA wondering whether it is amazing or damning my whole career choice and life purpose.  It was great to read this piece and your perspective.</p>\n", "parentCommentId": null, "user": {"username": "Jo Cohen"}}, {"_id": "DXxgLsLNAJKueTzeT", "postedAt": "2023-06-08T10:45:41.693Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>Having worked in the traditional, local non-profit setting for nearly a decade before joining the EA world last year, I appreciated the thought you put into this article particularly surrounding hospitality and partnerships!</p><p>I also think that EA organizations can get SO bogged down with data, that we forget that we're still human and that we are wired to resonate with stories. I think we could glean some aspects of storytelling from traditional non-profits—the story of one individual served brings context and power to our impressive numbers.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Liz Hixson"}}, {"_id": "ymrBwZPZSmHnpt4yC", "postedAt": "2023-06-09T18:12:05.068Z", "postId": "5oTr4ExwpvhjrSgFi", "htmlBody": "<p>What a brilliant post! Thanks for writing this, Jenn!<br><br>I know that my own passion to help others came from seeing my father work in charities like the one you describe here, especially the St. Vincent de Paul, in Dublin. Good people devoting their time to help others is great.&nbsp;<br><br>We need to keep in mind that the vast majority of people spend the vast majority of their time and money doing activities whose primary purpose is not altruistic at all. So when we see people doing something altruistic, and doing it well, and getting very good at it, this is wonderful. And I think it's wonderful that you spent 5,000 hours doing this.&nbsp;<br><br>Regarding the Samaritans, at no point did you say or suggest that anything these charities did was misguided or wrong. We're not talking about people spending vast amounts of money on frivolous or vanity-driven projects. We're not talking about a billionaire making a charity donation of $100m for a new stadium named after him. Your EA mind was asking \"could we do even more?\" - but really, the Samaritans were already doing pretty well. They had got very good and efficient at what they do, they were passionate about that, people depended on them providing that - not just the people they helped, but also the public officials whose failures they were helping to cover up (really, there should not be homeless people in a rich country). I'm not sure I would want them to change. As you perfectly observed, they certainly should not change the humanity with which they approach their role and the people they help.&nbsp;<br><br>There may be some explanation of the push-back you experienced in personality-tools like Myers-Briggs. In MBTI, there is a spectrum from \"Thinking\" to \"Feeling\". EA is very much on the thinking (T) end of that. It does NOT mean that EA people are less feeling - it means that EA people care, and so they think about how best to help as many people as possible. Feeling (F) people tend to be more focused on the emotional, less logical approach - they see someone who is unhappy, they want to help. They don't analyse, they just feel and act. What is potentially interesting is how the two extremes often fail to understand each other - the extreme T's maybe get frustrated at the apparently irrational, non-optimised approach of the F's, but maybe also they don't understand the value that the emotional, feeling connection has for the people. Meanwhile, the extreme F's tend to view T's as unfeeling and even cynical, because it's just not how their brain works - while the EA person in you wanted to help even more people, they may have seen your idea as being less caring, more calculating ...&nbsp;<br><br>Which is why your post is so great. You clearly manage to bridge the divide - your thinking side understands the EA mentality, but your feeling side sees how individual people react to being treated like people.&nbsp;<br><br>I don't have some magical solution to propose. I'm just sharing some thoughts that were inspired by reading this great post.&nbsp;<br><br>And one final point: we must never forget that when a person interacts with an organisation like the Samaritans, it can be transformational for them personally, it can be the moment when they decide that they too will devote more time, energy or money to charitable work. And some people impacted in this way will eventually find themselves in the EA community. It's hard to calculate the impact of this, but I'll bet a lot of us, like myself, first encountered charity at home and then broadened our horizons.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}]