[{"_id": "LLasfD2sJ5CxEuFpg", "postedAt": "2023-09-07T21:37:24.385Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>IMHO, the burden of proof was on Ben Pace to fact-check these kinds of claims before publishing them in a public forum like EA Forum -- by interviewing all the relevant people, rather than just reporting the claims of his two main anonymous informants.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "PXL4JepFwntgcsWdh", "postedAt": "2023-09-07T21:45:25.598Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>He did interview the team at non-linear</p>\n", "parentCommentId": "LLasfD2sJ5CxEuFpg", "user": {"username": "Khorton"}}, {"_id": "28awmtkf8bbb9apxH", "postedAt": "2023-09-07T22:07:57.058Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Did he interview them about the specific claims he was making, and give them the opportunity to present counter-evidence? That's the issue.&nbsp;</p><p>A generic interview, without the Nonlinear people knowing the details of his allegations, isn't relevant, and doesn't count as 'fact-checking'. (If that's what he did)</p>", "parentCommentId": "PXL4JepFwntgcsWdh", "user": {"username": "geoffreymiller"}}, {"_id": "KaJM2bArcihJnNiBW", "postedAt": "2023-09-07T22:08:46.242Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Yes, he did, as part of a three hour call which he describes in his post</p>\n", "parentCommentId": "28awmtkf8bbb9apxH", "user": {"username": "Khorton"}}, {"_id": "TELhbqmrQqpmgLupN", "postedAt": "2023-09-07T23:05:43.282Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>It was not remotely enough time to actually rebut all of the false claims and we told him so. We assumed that would be the first of many calls - it would take at least a week to clear things up - and then he just surprised us by posting.</p>", "parentCommentId": "KaJM2bArcihJnNiBW", "user": {"username": "EmersonSpartz"}}, {"_id": "ioyyaMLhdrfNj3str", "postedAt": "2023-09-08T01:42:35.284Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Since this is now a standalone post, I'm reposting my comment from the subthread of Ben's post:<br><br>I think it's telling, that Kat thinks that the texts speak in their favor. Reading them was quite triggering for me because I see a scared person, who asks for basic things, from the only people she has around her, to help her in a really difficult situation, and is made to feel like she is asking for too much, has to repeatedly advocate for herself (while sick) and still doesn't get her needs met. On one hand, she is encouraged by Kat to ask for help but practically it's not happening. Especially Emerson and Drew in that second thread sounded like she is difficult and constantly pushed to ask for less or for something else than what she asked for. Seriously, it took 2.5 hours the first day to get a salad, which she didn't want in the first place?! And the second day it's a vegetarian, not vegan, burger.&nbsp;<br><br>The way Alice constantly mentioned that she doesn't want to bother them and says that things are fine when they are clearly not, is very upsetting. I can't speak to how Alice felt but it's no wonder she reports this as not being helped/fed when she was sick. To me, this is accurate, whether or not she got a salad and a vegetarian burger the next day. &nbsp;<br><br>Honestly, the burger-gate is a bit ridiculous. Ben did report in the original article that you disputed these claims (with quite a lot of detail) so he reported it accurately. To me, that was enough to not update too much based on this. I don't think it warranted the strongly worded letter to the Lightcone team and the subsequent dramatic claims about evidence that you want to provide to clear your name.</p>", "parentCommentId": null, "user": {"username": "IrenaK"}}, {"_id": "BtnmgfJynFFRuhNWJ", "postedAt": "2023-09-08T11:07:18.424Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I understand that you are using this as an example of something you think is untrue and to demonstrate the asymmetrical burden of refuting a lot of claims.</p>\n<p>However, if you're prioritising, I would be most interested in whether it is true that you a) encouraged someone who you had financial and professional power over to drive without a driving licence; and b) encouraged someone in the same situation to smuggle drugs across international borders for you.</p>\n<p>Whether or not they are formally an employee, encouraging people you have financial and professional power over to commit crimes unconnected to your mission is deeply unethical (and encouraging them to do this for crimes connected to your mission is also, at best, extremely ethically fraught).</p>\n", "parentCommentId": null, "user": {"username": "jlewars"}}, {"_id": "oEqZQHqPyJa2AELzy", "postedAt": "2023-09-08T11:12:04.579Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Hmmm I guess I don't consider this to shift me much since your account seems compatible with what ben wrote:</p><blockquote><p>Alice quit being vegan while working there. She was sick with covid in a foreign country, with only the three Nonlinear cofounders around, but nobody in the house was willing to go out and get her vegan food, so she barely ate for 2 days. Alice eventually gave in and ate non-vegan food in the house. She also said that the Nonlinear cofounders marked her quitting veganism as a ‘win’, as they thad been arguing that she should not be vegan.</p></blockquote><blockquote><p>(Nonlinear disputes this, and says that they did go out and buy her some vegan burgers food and had some vegan food in the house. They agree that she quit being vegan at this time, and say it was because being vegan was unusually hard due to being in Puerto Rico. Alice disputes that she received any vegan burgers.)</p></blockquote><p>I agree that if Alice said otherwise that could be bad but I'm unsure how much I care <i>if</i> she originally loosely complained about you to friends but has since walked it back. Maybe if she told loads of people and has since walked it back then that's bad. And I can understand how unfair this feels. But it sort of doesn't update me on ben being a poor judge since his account was compatible from the get go</p><p><i>edited</i></p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "YAeWGwfvQEXgKrnXr", "postedAt": "2023-09-08T13:18:04.018Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>My guess is it was enough time to say which claims you objected to and sketch out the kind of evidence you planned to bring. And Ben judged that your response didn't indicate you were going to bring anything that would change his mind enough that the info he had was worth sharing. E.g. you seemed to focus on showing that Alice couldn't be trusted, but Ben felt that this would not refute enough of the other info he had collected / the kinds of refutation (e.g. only a $50 for driving without a license, she brought back illegal substances anyway) were not compelling enough to change that the info was worth sharing.</p>\n<p>I do think one can make judgments from the meta info, and 3 hours is enough to get a lot of that.</p>\n<p>I consider something of a missing mood on your part to be quite damning. From what I hear and see (Ben's report of your call with him, how you're responding public, threat to Lightcone/Ben), you are overwhelmingly concerned with defending yourself and don't seem contrite at all that people you employed feel so extremely hurt by their time with you. I haven't heard you dispute their claims of hurt (do you think those are lies for some reason?), instead focusing on the veracity of reasons for being hurt. But do you think you're causally entangled with them feeling hurt? If so, where is the apology or contrition and horror at yourself that they think being with you resulted in the worst months of their lives?</p>\n<p>I'd understand a lack of that if your position was \"they're definitely lying about how they felt probably for motivation X, give us time and can prove that\", but this hasn't been the nature of your response.</p>\n<p>I actually would expect more \"competent\" uncompassionate people concerned only with their own reputation to have acted contrite, because it'd make the audience more sympathetic, suggesting that you all aren't very good at modeling people. Which makes it more likely you weren't modeling your employees experience very well either, perhaps resulting in a lot of harm from negligence more than malice (which still warrants sharing this info about you).</p>\n", "parentCommentId": "TELhbqmrQqpmgLupN", "user": {"username": "Ruby"}}, {"_id": "LzzuPb67fJEn4GmLY", "postedAt": "2023-09-08T14:24:07.277Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I'm surprised to see many comments that treat something other than this (particularly the request to transport drugs across a country border) as the crux.</p><p>From my read of Ben Pace's post, Nonlinear admits that this is true.</p>", "parentCommentId": "BtnmgfJynFFRuhNWJ", "user": {"username": "Tyrone Barugh"}}, {"_id": "BBm4j2Dwxw5mLb6Mw", "postedAt": "2023-09-08T14:58:07.512Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I don't know if this is at the level of moderator intervention, so I'm just going to flag that saying Alice \"bitched\" about something to her friends feels potentially derogatory or dismissive to me. I know people use the word with different levels of seriousness and with different connotations. In this context, though, it read to me like minimizing the value of what Alice might have said to her friends.</p><p>If in fact Alice was mistreated, \"bitching\" to her friends would be a way of notifying people of a harmful situation—and therefore potentially closer to informing, sharing, or raising serious concerns to her friends.</p><p>Regardless of that, I often wonder when I see men use bitch or bitching when describing a woman and her actions whether they'd use the same language to describe the actions of a man. Maybe you would, and maybe I'd read your use of the word here differently then. But I would generally caution anyone to think about the negative connotations those words can have and the sexism they can perpetrate when used to describe women.</p>", "parentCommentId": "oEqZQHqPyJa2AELzy", "user": {"username": "pinkfrog"}}, {"_id": "9uxKpfaa9aoeHyvWx", "postedAt": "2023-09-08T15:43:42.307Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Leaving aside for a moment the much bigger question of how you end up living overseas with someone when you can't work out whether they are an employee or not and then suggesting they act as a drug mule (very happy to be corrected on any of those points, these seem unaddressed to date). &nbsp;</p><p>Having read the linked texts in the google doc I am extremely confused how anyone would post them thinking they were exculpatory for the Nonlinear team?&nbsp;</p><p>A sick person explains (a) they are starving, (b) don't have any food, (c) can't get delivery and (d) are home w presumed C-19.&nbsp;</p><p>They ask clearly and repeatedly for a vegan burger and fries from burger king. Their request is painfully clear.</p><p>Over the course of 2 hours and 32 mins (based on time stamps) Emerson and Drew manage to:<br>i) not do that,&nbsp;<br>ii) choose a restaurant with no consideration for whether there is any vegan food&nbsp;<br>iii) tell them they should not go outside to find food themselves&nbsp;<br>iv) manage to eventually find a side salad, and<br>v) all of this takes a lot of asking on the sick person's behalf.&nbsp;</p><p>And this is meant to show how reasonable the Nonlinear team are? They seem to have done far less than the minimum.&nbsp;</p><p>My main takeaway, besides sadness at Alice's experience in that moment, is that we really need to improve EA governance. All power to the Nonlinear team if they want to change the world with a nontraditional 'family' dynamic but we can't be granting EA funds to these orgs with such terrible governance or encouraging early career professionals to work there.</p><p>Apologies if this isn't in line with the forum rules and norms, first time poster, driven by the visceral response of reading those texts.&nbsp;</p><p>Priors: Had met Kat at EAG events, found her to be impressive and really likable. Don't believe I know anyone else.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JoshMcCann"}}, {"_id": "LpR6ah8GKaNFDaT5Z", "postedAt": "2023-09-08T16:52:47.711Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I'll change it, it's kind of a useful word though. <i>As evidenced by being used 2 other times on the forum already.&nbsp;</i></p><p>Not wild about this interaction, glad you raised that you don't like the word, but are we really doing accusations of sexism based on single words now. <i>sigh.</i></p><p>I think Alice herself has walked back the claim - my point is that I support Alice's right to complain offhandedly about something but to give a more accurate account when pushed. Do i sometimes complain in company in ways I wouldn't entirely endorse. Sure. Aren't we allowed to give loose accounts to friends.</p><p><i>Edit Okay seems like the consensus is this wasn't accusatory. I'm sorry </i><a href=\"https://forum.effectivealtruism.org/users/pinkfrog?mention=user\"><i>@pinkfrog</i></a><i>, my error. I can be sensitive about this stuff, but that's not your fault.&nbsp;</i></p>", "parentCommentId": "BBm4j2Dwxw5mLb6Mw", "user": {"username": "nathan"}}, {"_id": "nE8GzRCun9sH3RxME", "postedAt": "2023-09-08T16:59:40.963Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I'd be curious to hear why you find it a useful word in this context. Also happy to hear what you didn't like about my comment, either here or over a message.</p>", "parentCommentId": "LpR6ah8GKaNFDaT5Z", "user": {"username": "pinkfrog"}}, {"_id": "DcbQtoTW7PCt3Efy2", "postedAt": "2023-09-08T17:00:06.075Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>The claim in the post was “Alice claims she was sick with covid in a foreign country, with only the three Nonlinear cofounders around, but<strong> nobody in the house was willing to go out and get her vegan food</strong>, so she barely ate for 2 days.”. (Bolding added)</p><p>If you look at the chat messages, you’ll see we have screenshots demonstrating that:</p><p>1. There was vegan food in the house, which we offered her.&nbsp;</p><p><img style=\"width:50.48%\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DcbQtoTW7PCt3Efy2/hp7iczvdryrxd4g6qv9i\"></p><p>2. I personally went out, while I was sick myself, to buy vegan food for her (mashed potatoes) and cooked it for her and brought it to her.</p><p><img style=\"width:50.35%\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DcbQtoTW7PCt3Efy2/olioaex2hy1ce6gjmqfc\"></p><p>I would be fine if she told people that she was hungry when she was sick, and she felt sad and stressed. Or that she was hungry but wasn’t interested in any of the food we had in the house and we didn't get her Burger King.&nbsp;</p><p>But I think that there's a big difference between telling everyone \"I didn't get the food I wanted, but they did get/offer to cook me vegan food, and I told them it was ok!\" and \"they refused to get me vegan food and I barely ate for 2 days\"</p><p>I have sympathy for Alice. She was hungry (because of her fighting with a boyfriend [not Drew] in the morning and having a light breakfast) and she was sick. That sucks, and I feel for her. And that’s why I tried (and succeeded) in getting her vegan food.&nbsp;</p><p><strong>In summary</strong>. “Alice claims she was sick with covid in a foreign country, with only the three Nonlinear cofounders around, but&nbsp;<strong>nobody in the house was willing to go out and get her vegan food, so she barely ate for 2 days</strong>.”. (Bolding added) This makes us sound like terrible people.&nbsp;</p><p><strong>What actually happened</strong>: she was sick and hungry, and we offered to cook or bring over the vegan options in the house, then went out and bought and cooked her vegan food. We tried to take care of our sick friend (she wasn't working for us at the time), and we fed her while she was sick.&nbsp;</p>", "parentCommentId": "ioyyaMLhdrfNj3str", "user": {"username": "katherinesavoie"}}, {"_id": "xA7SNHqWavufaeyKi", "postedAt": "2023-09-08T17:02:26.932Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>The claim in the post was “Alice claims she was sick with covid in a foreign country, with only the three Nonlinear cofounders around, but<strong> nobody in the house was willing to go out and get her vegan food</strong>, so she barely ate for 2 days.”. (Bolding added)</p><p>If you look at the chat messages, you’ll see we have screenshots demonstrating that:</p><p>1. There was vegan food in the house, which we offered her.&nbsp;</p><p><img style=\"width:343.939px\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DcbQtoTW7PCt3Efy2/hp7iczvdryrxd4g6qv9i\"></p><p>2. I personally went out, while I was sick myself, to buy vegan food for her (mashed potatoes) and cooked it for her and brought it to her.</p><p><img style=\"width:343.053px\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DcbQtoTW7PCt3Efy2/olioaex2hy1ce6gjmqfc\"></p><p>I would be fine if she told people that she was hungry when she was sick, and she felt sad and stressed. Or that she was hungry but wasn’t interested in any of the food we had in the house and we didn't get her Burger King.&nbsp;</p><p>But I think that there's a big difference between telling everyone \"I didn't get the food I wanted, but they did get/offer to cook me vegan food, and I told them it was ok!\" and \"they refused to get me vegan food and I barely ate for 2 days\"</p><p>I have sympathy for Alice. She was hungry (because of her fighting with a boyfriend [not Drew] in the morning and having a light breakfast) and she was sick. That sucks, and I feel for her. And that’s why I tried (and succeeded) in getting her vegan food.&nbsp;</p><p><strong>In summary</strong>. “Alice claims she was sick with covid in a foreign country, with only the three Nonlinear cofounders around, but&nbsp;<strong>nobody in the house was willing to go out and get her vegan food, so she barely ate for 2 days</strong>.”. (Bolding added) This makes us sound like terrible people.&nbsp;</p><p><strong>What actually happened</strong>: she was sick and hungry, and we offered to cook or bring over the vegan options in the house, then went out and bought and cooked her vegan food. We tried to take care of our sick friend (she wasn't working for us at the time), and we fed her while she was sick.</p>", "parentCommentId": "9uxKpfaa9aoeHyvWx", "user": {"username": "katherinesavoie"}}, {"_id": "CbzxC2dx37Z9YzkcC", "postedAt": "2023-09-08T17:04:08.705Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>The claim in the post was “Alice claims she was sick with covid in a foreign country, with only the three Nonlinear cofounders around, but<strong> nobody in the house was willing to go out and get her vegan food</strong>, so she barely ate for 2 days.”. (Bolding added)</p><p>If you look at the chat messages, you’ll see we have screenshots demonstrating that:</p><p>1. There was vegan food in the house, which we offered her.&nbsp;</p><p><img style=\"width:343.939px\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DcbQtoTW7PCt3Efy2/hp7iczvdryrxd4g6qv9i\"></p><p>2. I personally went out, while I was sick myself, to buy vegan food for her (mashed potatoes) and cooked it for her and brought it to her.</p><p><img style=\"width:343.053px\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DcbQtoTW7PCt3Efy2/olioaex2hy1ce6gjmqfc\"></p><p>I would be fine if she told people that she was hungry when she was sick, and she felt sad and stressed. Or that she was hungry but wasn’t interested in any of the food we had in the house and we didn't get her Burger King.&nbsp;</p><p>But I think that there's a big difference between telling everyone \"I didn't get the food I wanted, but they did get/offer to cook me vegan food, and I told them it was ok!\" and \"they refused to get me vegan food and I barely ate for 2 days\"</p><p>I have sympathy for Alice. She was hungry (because of her fighting with a boyfriend [not Drew] in the morning and having a light breakfast) and she was sick. That sucks, and I feel for her. And that’s why I tried (and succeeded) in getting her vegan food.&nbsp;</p><p><strong>In summary</strong>. “Alice claims she was sick with covid in a foreign country, with only the three Nonlinear cofounders around, but&nbsp;<strong>nobody in the house was willing to go out and get her vegan food, so she barely ate for 2 days</strong>.”. (Bolding added) This makes us sound like terrible people.&nbsp;</p><p><strong>What actually happened</strong>: she was sick and hungry, and we offered to cook or bring over the vegan options in the house, then went out and bought and cooked her vegan food. We tried to take care of our sick friend (she wasn't working for us at the time), and we fed her while she was sick.</p>", "parentCommentId": "oEqZQHqPyJa2AELzy", "user": {"username": "katherinesavoie"}}, {"_id": "xnJv5giHzg5PopiML", "postedAt": "2023-09-08T17:08:18.653Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/kqn401xambi5zmereahp\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/ecfzvyba4uegrovobsbd 121w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/jdlhj4vp1yhmex9hgzsx 201w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/dethdzlmdk1qd7nzcmtf 281w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/pm7pnrrhlztn4qotxdcz 361w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/jgohk1xte9zjk664mwfd 441w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/cyvty3qvmn3mys0a0gzc 521w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/o9kdl1gd5dm0bd6lzkfi 601w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xnJv5giHzg5PopiML/ckmu2btow0aaji4oao63 681w\"></p><p>None of these words really did what I wanted and I was typing at speed. Was happy to change it if it caused confusion.</p><p>It has a whole paragraph of implicit accusation of sexism for use of a relatively commonly used word. If I only used that word about women then that would be bad behaviour. It seems like a lot to assume from a single use. I would have preferred \"I read that as derogative did you intend that\", though you are free to do as you wish. I hope you are well.</p>", "parentCommentId": "nE8GzRCun9sH3RxME", "user": {"username": "nathan"}}, {"_id": "fRkA6BQsCjrXb2acK", "postedAt": "2023-09-08T17:30:47.741Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>(Some responses based on the edits you made to your original comment)</p><p>To be clear, I didn't accuse you of sexism in my comment. And I do like the word in certain uses, actually. Like I said in my comment, I know it can be used in different ways and with different connotations.</p><p>I wanted to point out that it's a loaded word that can cause harm if used in certain ways, and you're using it within a specific, loaded context. I didn't make a statement on the veracity of Alice's claims but imagined if they were true (as I said, \"if in fact Alice was mistreated\") how it might feel for her to have someone describe her as just bitching about the situation (which could be a potentially hurtful feeling). And as I flagged, I wasn't sure how you were using it—which means both that I don't assume it was in a sexist way and that I also didn't feel clear that it wasn't in a sexist way.&nbsp;</p><p>I consider swear words or words that have a history of derogatory use/use as slurs as words to be extra thoughtful about using. My comment was an appeal to be extra thoughtful, or a little flag to think through the connotations of the word and the impact or implications it can have—especially given the context here. That's all, that's the argument!<br><br>As for opening an interaction, I guess I feel confused by that concern. I think of substantive, honest disagreement as a form of respect and a norm of the Forum. I indicated my uncertainties and was holding space for other possibilities. Maybe I don't see my comment as opening an interaction in the way you do—I can't quite say.</p>", "parentCommentId": "xnJv5giHzg5PopiML", "user": {"username": "pinkfrog"}}, {"_id": "jCBh8vdKqLEWvYu9y", "postedAt": "2023-09-08T17:49:19.626Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>(Just a flag that it feels a bit weird to edit your comments after I'd replied to them without flagging the edits you're making. I am trying to respond to the substance of what you're saying.)</p><p>Yeah, I take the feedback that I could have framed it more as \"using this word in this way could come off as derogatory, even if you didn't intend it that way\" and emphasize that I wasn't making an accusation or assumption. That was my intention, so I'm sorry if it didn't come across that way.</p>", "parentCommentId": "fRkA6BQsCjrXb2acK", "user": {"username": "pinkfrog"}}, {"_id": "39qrXEtcAeZBtepoe", "postedAt": "2023-09-08T18:22:41.687Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I'll let someone else judge. To me it felt like an accusation that my use of the word was sexist.&nbsp;</p><p>If others don't think so I'm happy to defer.&nbsp;</p>", "parentCommentId": "fRkA6BQsCjrXb2acK", "user": {"username": "nathan"}}, {"_id": "b9xr8Wwi37NJFe9rJ", "postedAt": "2023-09-08T18:50:18.272Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I usually edit them after I post them because I don't like how they read to me. But I can see how that would look like I was editing them after your replies. Not sure how I could flag that better.</p><p>Well I appreciate you flagging. It wasn't my intention to demean Alice and I wouldn't have wanted people to think so.</p>", "parentCommentId": "jCBh8vdKqLEWvYu9y", "user": {"username": "nathan"}}, {"_id": "343CenrnBYvtvvmzZ", "postedAt": "2023-09-08T19:25:09.609Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Speaking as an advisor to the mod team who ran this past some active mods:&nbsp;</p><p>This isn't something we'd issue a warning for in this context (describing a third party's actions in a way that doesn't seem aggressive or dismissive). In the context of a direct attack (e.g. \"why are you bitching to us about something that doesn't matter?\"), it could make a comment seem more aggressive and might (weakly) push us toward more substantial action.</p><p>*****</p><p>Taking my advisor hat off, I generally prefer for the Forum to be less coarse, and I do see \"bitching\" as gendered (similar to e.g. \"pussy\"), so on balance I'd rather see \"complaining\".&nbsp;</p><p>This is relatively minor in the grand scheme of my personal preferences for Forum comments, but I recognize that other people might (justifiably!) be more offended by the word than I am. As a cis male, I've seldom been accused of \"bitching\" about things; I'd guess that certain other Forum users aren't so lucky.</p>", "parentCommentId": "BBm4j2Dwxw5mLb6Mw", "user": {"username": "aarongertler"}}, {"_id": "skMnyZDDL6ifmBj4R", "postedAt": "2023-09-08T21:31:47.582Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>We chose this example not because it’s the most important (although it certainly paints us in a very negative and misleading light) but simply because it was the fastest claim to explain where we had extremely clear evidence without having to add a lot of context, explanation, find more evidence, etc.&nbsp;</p><p>Even so, it took us hours to put together and share. Both because we had to track down all of the old conversations, make sure we weren’t getting anything wrong, anonymize Alice, format the screenshots (they kept getting blurry), and importantly, write it up.&nbsp;</p><p>Writing for the EA Forum/LessWrong is already quite a difficult thing, with it being a reasonable assumption that people will point out any little detail you get wrong. I ask you to please empathize with how it must be for us now, given that so many people currently see everything we post through the lens of being unethical people.</p><p>If you’ve ever spent a long time trying to get a post just right for the EA Forum/LessWrong, I ask you to empathize with what we’re going through here.</p><p>We also had to spend time dealing with all of the other comments while trying to pull this together. My inbox is completely swamped. Not to mention trying to deal with my own emotional reactions to this incredibly difficult situation.&nbsp;</p><p>We intend to address the points you are describing as soon as we can. We're all working full-time on this and will get back to you as soon as we can. This was simply meant as a quick example of the evidence we'll be providing, not a comprehensive rebuttal, which we're working on.&nbsp;</p>", "parentCommentId": "BtnmgfJynFFRuhNWJ", "user": {"username": "katherinesavoie"}}, {"_id": "f5cCrGpTn5Xep4uXR", "postedAt": "2023-09-08T21:47:21.009Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Kat just added context below, but I'll also note that the 'transport drugs across a country border' story is wildly distorted and we will provide evidence in the forthcoming post that we're working hard on.</p>", "parentCommentId": "LzzuPb67fJEn4GmLY", "user": {"username": "EmersonSpartz"}}, {"_id": "fceXJkKnjiWgK3ibn", "postedAt": "2023-09-09T01:04:04.323Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>This is my main question, since it appears that in your conversation with Ben, you a) essentially agreed that you asked employees to break the law, b) didn't seem to think it was a big deal?</p>", "parentCommentId": "skMnyZDDL6ifmBj4R", "user": {"username": "freedomandutility"}}, {"_id": "q4Gbwthmxaxw9CGM9", "postedAt": "2023-09-09T04:47:23.500Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Was Ben Pace shown these screenshots before he published his post?</p>\n", "parentCommentId": null, "user": {"username": "Rubi"}}, {"_id": "SkztCKpZRj2KM52xp", "postedAt": "2023-09-09T07:04:36.634Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>We chose this example not because it’s the most important (although it certainly paints us in a very negative and misleading light) but simply because it was the fastest claim to explain where we had extremely clear evidence without having to add a lot of context, explanation, find more evidence, etc.&nbsp;</p><p>Even so, it took us hours to put together and share. Both because we had to track down all of the old conversations, make sure we weren’t getting anything wrong, anonymize Alice, format the screenshots (they kept getting blurry), and importantly, write it up.&nbsp;</p><p>Writing for the EA Forum/LessWrong is already quite a difficult thing, with it being a reasonable assumption that people will point out any little detail you get wrong. I ask you to please empathize with how it must be for us now, given that so many people currently see everything we post through the lens of being unethical people.</p><p>If you’ve ever spent a long time trying to get a post just right for the EA Forum/LessWrong, I ask you to empathize with what we’re going through here.</p><p>We also had to spend time dealing with all of the other comments while trying to pull this together. My inbox is completely swamped. Not to mention trying to deal with my own emotional reactions to this incredibly difficult situation.&nbsp;</p><p>We intend to address the point you are describing as soon as we can. We're all working full-time on this and will get back to you as soon as we can. This was simply meant as a quick example of the evidence we'll be providing, not a comprehensive rebuttal, which we're working on.&nbsp;</p>", "parentCommentId": "LzzuPb67fJEn4GmLY", "user": {"username": "katherinesavoie"}}, {"_id": "gDsAFK6tDodvKXtcp", "postedAt": "2023-09-09T07:15:22.111Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Yes he was</p><p>Not all of them. He was shown the first set of screenshots, showing clearly that we said we were going to get her food.&nbsp;</p><p>To be fair, we didn't show the screenshots about the mashed potatoes yet, which was proof we went out to get her vegan food.&nbsp;</p><p>But we did show him there was vegan food in the house, which I think is an extremely important detail.&nbsp;</p><p>Not feeding a sick friend (she was not working for us at the time) when she didn't have any food is cruel and uncaring.&nbsp;</p><p>Offering to cook a sick friend vegan food in the house and her preferring us to go out and get her a burger is extremely different.&nbsp;</p><p>And we asked him for more time to send him all the rest, to show that not only was there vegan food in the house, but that we brought her food. We have more that's not included in this post too. We're working full time on gathering the evidence, but even just this 2 line claim has taken us hours and hours to gather, anonymize, format, write, and handle comments. He decided he wanted to post the post anyways, without waiting to see all the evidence. &nbsp;</p>", "parentCommentId": "q4Gbwthmxaxw9CGM9", "user": {"username": "katherinesavoie"}}, {"_id": "RNAPgyuDAenkpzCTj", "postedAt": "2023-09-09T10:16:15.729Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<blockquote><p>and then he just surprised us by posting.</p></blockquote><p>Judging from the email in <a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear?commentId=jABdTFqKMxengGNWH\">this</a> comment, it seems like you were aware that Ben intended to post some time before the post appeared on the Forum and LW, which seemingly contradicts what you are saying here.</p>", "parentCommentId": "TELhbqmrQqpmgLupN", "user": {"username": "Sylvester Kollin"}}, {"_id": "D9AyS6sXqar6CmYds", "postedAt": "2023-09-10T03:03:33.134Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Just a slightly sideways comment.&nbsp;</p><p>But I think it's kind of sad that we now have (3?) highly driven, smart and capable people working full time, not on making the world a better place, but on a forum post to defend their reputations. &nbsp;</p><p>I feel like regardless of the outcome of the 'he said she said', we've got something wrong as a community here. &nbsp;</p><p>Sad reacts only.</p>", "parentCommentId": null, "user": {"username": "thisisntrob"}}, {"_id": "z4iwmZc8zhHCAC5sg", "postedAt": "2023-09-12T16:52:52.878Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>I don't have a dog in this fight, I'm just intrigued that people have the time to send that many WhatsApp messages about food.</p>\n", "parentCommentId": null, "user": {"username": "Stuart Buck"}}, {"_id": "6bcbMbXKkASAoNaXb", "postedAt": "2023-09-17T13:10:02.988Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>When might we see a more detailed response from Nonlinear?</p>\n", "parentCommentId": null, "user": {"username": "tswizzle96"}}, {"_id": "8d6KdhHxhkffubPrB", "postedAt": "2023-10-18T17:37:02.831Z", "postId": "5pksH3SbQzaniX96b", "htmlBody": "<p>Downvoting because you’ve already posted this exact comment several times in this thread. Just post it once and link to it.</p>\n", "parentCommentId": "CbzxC2dx37Z9YzkcC", "user": {"username": "HenryStanley"}}]