[{"_id": "jBpq3zxGhy7rpY6F3", "postedAt": "2017-11-13T19:33:48.346Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>Thank you for writing this! The images under 'What are you going to search for?' are not loading.</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "tXj2i8zQkS8gyY5i8", "postedAt": "2017-11-13T21:02:32.626Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>This looks great! Looking forward to doing a more detailed read when I have more time, but I already see some resources and techniques I wasn&#x27;t aware of or have failed to fully implement thus far, so this will serve as added motivation and a nice reference.</p><p>I find that the archive of Data Is Plural is a great source for data on a wide variety of topics: <a href=\"http://bit.ly/2h3bNzQ\">http://bit.ly/2h3bNzQ</a></p>", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "GRCceZHHLyZ2TYGv2", "postedAt": "2017-11-14T01:41:21.410Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>Thanks for writing this. I agree that reference management is really useful for paper-writing, and I have come across a bunch of these resources repeatedly. I get the impression people vary a bunch in how much they use subject-specific databases and the structured queries. I usually get by pretty well with Google Scholar. I don't encounter too much noise with the machine learning and biology work that I tend to read, although I can imagine they would be super useful if I was publishing a literature review.</p>\n<p>The video at the start is a cool blog post structure. I wonder if anyone else will try it...</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "4ijAX4J3gMbYp9JmR", "postedAt": "2017-11-14T10:45:41.020Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>Thanks for flagging this up - I think I've fixed that now.</p>\n", "parentCommentId": "jBpq3zxGhy7rpY6F3", "user": {"username": "kastrel"}}, {"_id": "6qdqBupA5QFEpEfRm", "postedAt": "2017-11-14T10:47:53.690Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>Thanks! I really didn't want it to be boring and dry, and I'm not on here a lot so I though having a face to put to the blog would help.</p>\n<p>How thorough you need to be absolutely depends on what you're working on - obviously if you're writing a literature review for publication you need to do a bit more due diligence than if you're just looking for the next thing to read. I would recommend Semantic Scholar as a more finely-tuned alternative to Google Scholar while still having a lot of free content.</p>\n", "parentCommentId": "GRCceZHHLyZ2TYGv2", "user": {"username": "kastrel"}}, {"_id": "xAg3Dr8qqn6Kx8KZp", "postedAt": "2017-11-14T10:49:39.740Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>Thanks! I can't recommend Sci-Hub or I might have my librarianship license revoked! But that archive looks really interesting.</p>\n", "parentCommentId": "tXj2i8zQkS8gyY5i8", "user": {"username": "kastrel"}}, {"_id": "xuJmvbZjrx9AaxG6C", "postedAt": "2017-11-15T03:24:41.075Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>&quot;I would recommend Semantic Scholar as a more finely-tuned alternative to Google Scholar while still having a lot of free content&quot; - any specific ways in which it works better?</p>\n", "parentCommentId": "6qdqBupA5QFEpEfRm", "user": {"username": "casebash"}}, {"_id": "PvREyqnkPemj3mAjL", "postedAt": "2017-11-16T09:49:34.670Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>I haven't used it in anger yet, but I think Semantic Scholar only searches databases that give you free access to the PDFs - so if you want to know you'll actually be able to click through and read the article, that's an advantage over Google Scholar, which will bring citations which are paywalled or unavailable online as results.</p>\n<p>I believe also only searches (fairly) respectable databases like ArXiv and PubMed Central, so you are less likely to get poor-quality results.</p>\n", "parentCommentId": "xuJmvbZjrx9AaxG6C", "user": {"username": "kastrel"}}, {"_id": "5NMejw7PrvKPb7vcg", "postedAt": "2022-10-26T14:20:55.366Z", "postId": "5pXzuJ3qYJ79jpwLy", "htmlBody": "<p>People reading this post: If you find work that seems relevant for evaluation by The Unjournal, please suggest it <a href=\"https://airtable.com/shrdHHI0zK7rkJCP3\">here</a>.</p>\n<p>Atm we are focusing on global priorities work that economists and business/social science quants could evaluate and that academics would also appreciate (aiming for rigor)… but we may pivot as the project evolves.</p>\n<p>See <a href=\"https://forum.effectivealtruism.org/posts/kftzYdmZf4nj2ExN7/what-pivotal-and-useful-research-would-you-like-to-see\">this</a> early question. (Note: the bounty prize is not active atm but if we put one back in we will try to make it retroactive.)</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}]