[{"_id": "CmeYvgpDHGcCdRgAM", "postedAt": "2022-08-24T21:30:31.641Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>I've tried to intelligently discuss issues like genetic engineering concerns with leaders and experts in the field. &nbsp; As example, I spent a month posting every day on Jennifer Doudna's team on Facebook. &nbsp; I ended this attempt at dialog only when they deleted all my posts without warning or explanation.</p><p>What I've learned from this experience is that anyone who has reached the level of expert in a field like genetic engineering has too large of a personal investment in that field to be objective and detached regarding the question of whether that field should exist.</p><p>Given how quickly technologies like CRISPR are becoming ever easier, ever cheaper and ever more accessible, I've come to the conclusion that bio-security will soon no longer be possible. &nbsp; &nbsp;Revolutionary technologies like genetic engineering are being deliberately released in to the wild of the broad public (Doudna is clear and explicit about this goal) and as these powers spread throughout the population they will escape the reach of any attempts at effective management.</p><p>We can't control drugs, guns, or even reckless driving. &nbsp;It puzzles me why we think we'll be able to control genetic engineering. &nbsp; Bio-security seems a form of science clergy mythology to me honestly. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "MJLkbvCTsw2FfQyDz", "postedAt": "2022-08-25T10:02:41.109Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>You say \"we can't control drugs, guns, or even reckless driving\". I don't think that's entirely true. For example, the RAND meta-analysis <a href=\"https://www.rand.org/research/gun-policy/key-findings/what-science-tells-us-about-the-effects-of-gun-policies.html\">What Science Tells Us About the Effects of Gun Policies</a> shows moderate evidence that violence crime can be reduced by prohibitions associated with domestic violence, background checks, waiting periods, and stand-your-ground laws. Similarly, I believe that <a href=\"https://www.popularmechanics.com/cars/a11201/why-cars-are-safer-than-theyve-ever-been-17194116/\">progress in car safety engineering</a> has radically reduced the human suffering caused by reckless driving. I have heard biosecurity professionals use cars as an example of a technology that was deliberately and successfully engineered to be safer.</p>\n<p>I also suspect the learning you describe (\"anyone who has reached the level of expert in a field like genetic engineering has too large of a personal investment\") is too strong a conclusion to draw from your experience. People infer a lot about what it might be like to engage with someone from how they attempt dialogue; I don't know what the content of your posts was, but posting similar content every day seems likely to cause observers to conclude that you have very strongly-held beliefs and are willing to violate social norms to attempt to spread those beliefs, which might lead them to decide that engaging in dialogue with you would be unpleasant or unproductive.</p>\n<p>(I will note that I hesitated to write this reply because of the tone of your comment, but then didn't want the only comment on a post targeted towards people interested in the field of biosecurity to be so despairing about its prospects; I personally believe there is a lot of useful work that can be done to reduce risks from pandemics.)</p>\n", "parentCommentId": "CmeYvgpDHGcCdRgAM", "user": {"username": "tessa"}}, {"_id": "h3B7MRAorosyikkRK", "postedAt": "2022-08-25T11:02:48.014Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>Hi Tessa,</p><p>Thanks for your feedback. &nbsp;I agree that my comment was imprecise, and too sweeping, a common failure here.</p><p>It's true that we've had some success managing drugs, guns and traffic safety. &nbsp; Some success is acceptable with these factors because drugs, guns and reckless driving are limited forces which don't have the power to threaten the system as a whole. &nbsp; So we make mistakes, try to learn the lessons, improve upon past efforts, and continue forward. &nbsp; &nbsp;This is the pattern of progress which has characterized human history to date.</p><p>My contention is that such limited management success is not adequate with vast powers such as genetic engineering, because such technologies do pose a risk to the system as a whole. &nbsp; Starting with, say, Hiroshima, we've entered a new era where the traditional \"mistakes&gt;fixes&gt;more progress\" paradigm is becoming obsolete, a relic of the past. &nbsp;&nbsp;</p><p>I'm willing to learn, and agree that I obviously don't know every genetic engineering professional. &nbsp; Can you introduce us to any genetic engineering PhD who is publicly questioning whether the field of genetic engineering should exist? &nbsp;I would very much like to meet such a brave soul.</p><p>I'm not willing to violate social norms in the sense of being personally rude, engaging in food fights etc, as that is a waste of everyone's time, mine included. &nbsp;</p><p>I am however willing to violate social norms by posting similar content, expressing strong beliefs (which I'm entirely willing to have challenged) and &nbsp;by being as inconvenient as possible to those claiming that expertise on some narrow technical topic also makes them experts on the &nbsp;human condition which will ultimately decide the fate of our civilization. &nbsp;&nbsp;</p><p>Yes, lots of useful work can be done in the field of genetics, agreed of course. &nbsp;But none of that good work is going to matter if evil doers or stupid people, or just unintended mistakes crash the system as a whole.</p><p>Jennifer Doudna is a good person who wants to make CRISPR available to everyone. &nbsp; She is well intended, and a technical expert, but very naive about the human condition. &nbsp;While one person is curing cancer with technologies like CRISPR, somebody else is going to be engineering a bio-weapon which brings the house down. &nbsp;\"Experts\" seem unwilling to grasp this, and I believe that's primarily because they have too big of an investment in the status quo to be detached and objective.</p><p>Sorry for the too many words, another common failing here. &nbsp;As you've correctly observed, I do have strong feelings on this subject. &nbsp;</p><p>PS: &nbsp;I just found your website, like it! &nbsp;You seem like very much the kind of person I hope to dialog with, so I'm hoping that I can put enough on the table to make that worth your while. &nbsp;&nbsp;</p>", "parentCommentId": "MJLkbvCTsw2FfQyDz", "user": {"username": "Phil Tanny"}}, {"_id": "ZWaDAnNGFpXRmB9k8", "postedAt": "2022-08-25T11:46:40.978Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>I don't know how much of her time Jennifer Doudna spends thinking about bioweapons, but I do think she spends a lot of time thinking about the ethical implications of CRISPR. If you read things like <a href=\"https://www.nytimes.com/interactive/2022/08/15/magazine/jennifer-doudna-crispr-interview.html\">this NYT interview with her from last week</a> she's saying things like:</p>\n<blockquote>\n<p><strong>Interviewer: It’s also easy to imagine two different countries, let alone two different people, having competing ideas about what would constitute ethical gene editing. In an optimal world, would there be some sort of global body or institution to help govern and adjudicate these decisions?</strong> In an optimal world? This is clearly a fantasy.</p>\n<p><strong>OK, how about a suboptimal one?</strong> The short answer is: I don’t know. I could imagine that given the complexities of using genome editing in different settings, it’s possible that you might decide to use it differently in different parts of the world. Let’s say an area where a mosquito-borne disease is endemic, and it’s dangerous and high risk for the population. You might say the risk of using genome editing and the gene drive to control the mosquito population is worth it. Whereas doing it somewhere else where you don’t face the same public-health issue, you might say the risk isn’t worth it. So I don’t know. The other thing is, as you indicated with the way you asked the question, having any global regulation and enforcing it — hard to imagine how that would be achieved. It’s probably more realistic to have, as we currently do, scientific entities that are global that study these complex issues and make formal recommendations, work with government agencies in different countries to evaluate risks and benefits of technologies.</p>\n</blockquote>\n<p>This doesn't seem like a person who is just arguing \"CRISPR should be everywhere, for everyone\". I also think she is <em>not</em> claiming to be an expert at making bioethical determinations of what technology should be deployed, and my sense from hearing her public speaking is that she is reluctantly taking on a mantle of going around and saying that we all need to have a very sober and open discussion about where and how CRISPR should be used, but that she doesn't feel particularly qualified to make those determinations herself. The <a href=\"https://innovativegenomics.org/programs/public-impact/\">Innovative Genomics Institute</a>, which she co-founded, has an entire research area dedicated to Public Impact, including initiatives like the <a href=\"https://innovativegenomics.org/bergit/\">Berkeley Ethics and Regulation Group for Innovative Technologies</a>. You can argue that these actions are poorly targeted, but I don't think it's accurate to frame Doudna as a naively pro-technology actor.</p>\n", "parentCommentId": "h3B7MRAorosyikkRK", "user": {"username": "tessa"}}, {"_id": "JhazvT86ebgy5CyWo", "postedAt": "2022-08-25T12:36:04.017Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>The article suggests, \"This service is for anyone who is seriously interested in working on mitigating <a href=\"https://forum.effectivealtruism.org/topics/global-catastrophic-biological-risk\"><u>catastrophic biological risks</u></a>, like the risk of an engineered pandemic.\"</p><p>It's great that there are skilled people addressing this threat, and it seems very likely they will be able to make a constructive contribution which reduces the risk of an engineered pandemic which threatens civilization itself. &nbsp;The question I hope we are asking would be, is reducing the risk of an an engineered pandemic sufficient? &nbsp;</p><p>The key issue with genetic engineering, or any technology, seems to be the scale of the power involved. &nbsp; A simple example can help illustrate the issue of scale...</p><p>In WWII we threw conventional explosives at each other with &nbsp;wild abandon all over the planet. &nbsp; But because conventional explosives are of limited scale, and don't have the power to collapse the system as a whole, we could make this mistake, clean up the mess, try to learn the lessons, and continue on with further progress. &nbsp;This is the paradigm which defines the past.</p><p>If we have a WWIII with nuclear weapons then cleaning up the mess, learning the lessons, and continuing with progress will take place, if it happens at all, over much longer time frames. &nbsp;Nobody alive at the time of such a war will live to see any recovery that might eventually occur. &nbsp;This is the paradigm which defines the future.</p><p>SUCCESS: &nbsp;Imperfect management worked with conventional explosives because the scale of these weapons is limited, incapable of crashing the systems which are required for recovery.&nbsp;</p><p>FAILURE: &nbsp;Imperfect management will not work with nuclear weapons, because the scale of these powers is vastly greater, and can be credibly proposed capable of destroying the systems required for recovery.</p><p>If the power of genetic engineering is of existential scale such as is the case with nuclear weapons, then it would seem to follow that reducing the risk of a genetic global catastrophe is not sufficient. &nbsp; Instead, mitigating the risk seems more like a game of Russian roulette where one gets away with repeatedly pulling the trigger, until the one bad day when one doesn't.</p><p>A simple rule governs much of human history. &nbsp; If it's possible for something to go wrong, sooner or later it likely will.</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "H5NyG3BSDptWA8dHR", "postedAt": "2022-08-25T13:06:21.895Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>Hi again Tessa,</p><p>Doudna wants to \"democratize\" CRISPR, as she &nbsp;puts it. &nbsp;But whatever her perspective, it doesn't really matter, because genetic engineering will inevitably follow a path similar to computing where it becomes easier and easier, cheaper and cheaper, and more and more accessible to more and more people over time. &nbsp;</p><p>Doudna and other technical experts appear to still be laboring under the illusion that they will remain in control of this process, which is why they continually reference governing bodies and so on. &nbsp;My reply to that is, tell it to the North Korean regime. &nbsp;</p><p>Even if we rule out evil doers, which we can not do, the fact still remains that over some period of time literally millions of people will be fiddling with technologies like CRISPR and whatever is to come next. &nbsp;There are already CRISPR kits on Amazon, and bio-hacking groups of amateurs on Reddit. &nbsp;Only God knows what such amateurs will be releasing in to the environment. &nbsp; Yes, genetic change in the natural world is a given, but never before at such a pace.</p><p>Yes, it was the IGI Facebook page where I invested a month attempting to engage. &nbsp; Yes, Doudna does make the points you've credited to her, agreed. &nbsp;But none of that really matters, because the technical experts are rapidly losing control of the genie they have let out of the bottle. &nbsp; I see their talk of governance systems etc as basically a way to pacify the public while this technology continues it's rapid march past the point of no return.</p><p>Please feel free to rip any of this to shreds. &nbsp;I have strong views, that's true, but I'm also very receptive to challenge. &nbsp;</p><p>My real concern is not genetic engineering in particular so much as it is the ever accelerating knowledge explosion as a whole. &nbsp;</p>", "parentCommentId": "ZWaDAnNGFpXRmB9k8", "user": {"username": "Phil Tanny"}}, {"_id": "MuJ4xqsPxQe48fn3R", "postedAt": "2022-08-25T13:14:52.500Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>Not that important, but I'm curious, is the IGI &nbsp;(Jennifer Doudna's team) Facebook page closed to all comments? &nbsp; Or just closed to my comments? &nbsp;&nbsp;</p><p><a href=\"https://www.facebook.com/igisci/\">https://www.facebook.com/igisci/</a></p><p>If it's just me, that makes sense. &nbsp; &nbsp;If it's closed to all comments, one might wonders why one would use a social networking platform to prohibit social networking? &nbsp;&nbsp;</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "6q2kNcrmeMG7tJwZu", "postedAt": "2022-10-04T07:38:59.306Z", "postId": "5rdwbfEAPoXtukvk3", "htmlBody": "<p>Let's say you're right, and biosecurity is close to impossible to control and is almost certainly going to destroy us all. Doesn't that just make it even more urgent to work on it?</p>\n", "parentCommentId": "H5NyG3BSDptWA8dHR", "user": {"username": "shinybeetle"}}]