[{"_id": "bhXbpvPpKrK8pvWmv", "postedAt": "2021-11-10T17:04:31.812Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>This post says \"EA orgs\" but the linked page specifically says \"charities\". I assume this offer is restricted to non-profits, but I am commenting to check that was your actual intent!</p>\n", "parentCommentId": null, "user": {"username": "lincolnq"}}, {"_id": "8aAhckhy2hTKergGA", "postedAt": "2021-11-11T01:55:06.630Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>Thank you for sharing this resource! I'll include it in this month's EA Newsletter, which goes out to a really large audience — I hope it helps you pick up a &nbsp;client or two.</p>", "parentCommentId": null, "user": {"username": "aarongertler"}}, {"_id": "cstjqWEzW4bDfLTAw", "postedAt": "2021-11-11T12:07:37.446Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>I'm interested in applying this to EA Entrepreneurs. Let's talk: <a href=\"https://www.linkedin.com/in/alex-barnes-toronto\">https://www.linkedin.com/in/alex-barnes-toronto</a></p>\n", "parentCommentId": null, "user": {"username": "--alex--"}}, {"_id": "SxznnbTFHasss2uPx", "postedAt": "2021-11-11T17:19:22.044Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>Your idea of connecting coaches with EA organizations is great. I've had similar ideas about connecting executive coaches (from business) and mental performance consultants (with a performance psychology background) with a broader audience of anyone working in jobs aimed to \"tackle the most pressing problems in the world\" (a la 80,000 hours). &nbsp;I think there are a lot of people in the executive coach and mental performance consultant occupations that would want to contribute to EA through \"donating\" their services to those working in occupations more directly connected to EA. &nbsp;I'd enjoy a chance to trade thoughts or talk more about your effort. Thank you. Best, Pete</p>", "parentCommentId": null, "user": {"username": "PeterJensen"}}, {"_id": "BpxtiWC5WCxL8Hzaf", "postedAt": "2021-11-12T08:37:20.240Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>Nice, thanks for this offer! Seems worth me / my org seriously considering.</p><p>Do you have data on feedback/impact along the lines of systematically gathered anonymous feedback from clients on what benefits (if any) they feel coaching had for them? (I see there's a <a href=\"https://thebusinessgrowthagency.actioncoach.co.uk/business-coaching-results/\">Results</a> page, but that's non-anonymous testimonials and case studies that seem written by the agency itself, which seems useful but still leaves room for other types of data to be useful.)</p>", "parentCommentId": null, "user": {"username": "MichaelA"}}, {"_id": "jvEeeZ8BHuPKKZT8R", "postedAt": "2021-11-12T14:24:45.618Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>I was imagining non-profits but I guess if there are people where the product or service they're working on is something clearly EA driven and a for-profit model is actually the best way to do that - I'd be keen to hear from them.</p><p>If you're unsure and you've got 5mins to fill in the application form, I'd encourage you to go for it.</p>", "parentCommentId": "bhXbpvPpKrK8pvWmv", "user": {"username": "TheBusinessGrowthAgency"}}, {"_id": "cELXjHFyY7cQuWDjb", "postedAt": "2021-11-12T14:26:16.649Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>Thanks so much Aaron!</p><p>I'm not sure if the newsletter has already gone out but we've received some great applications already.</p>", "parentCommentId": "8aAhckhy2hTKergGA", "user": {"username": "TheBusinessGrowthAgency"}}, {"_id": "4Z9cY7HSKDyQ9HBKu", "postedAt": "2021-11-12T14:41:42.487Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>Yes, good question.</p><p>The best I can offer is...</p><ul><li>Our <a href=\"https://www.google.com/maps/search/?api=1&amp;query=Google&amp;query_place_id=ChIJdw09klUDdkgROe1ix1HsQU0\">Google Reviews page</a>. It's not anonymous but we can't control who reviews us or what they say</li><li>On several of our coaching programmes we ask clients when they start and 12 months later how various metrics like revenue, profit, number of employees, hours worked etc. have changed. I did a bit of analysis on those numbers a while back <a href=\"https://thebusinessgrowthagency.actioncoach.co.uk/wp-content/uploads/2018/04/Client-Stats-Explanation-PDF.pdf\">here</a>. Admittedly, it's still a marketing piece though.</li></ul><p>Not exactly what you were asking for but I hope that's some help.</p>", "parentCommentId": "BpxtiWC5WCxL8Hzaf", "user": {"username": "TheBusinessGrowthAgency"}}, {"_id": "SLCLJyQTABbAk2uCA", "postedAt": "2021-11-14T19:14:57.459Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>I fall under this category - have applied. &nbsp;:)</p>", "parentCommentId": "jvEeeZ8BHuPKKZT8R", "user": {"username": "samstowers"}}, {"_id": "BWvyfgnZrhejwKFdv", "postedAt": "2021-11-17T15:07:07.916Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>A number of effective animal advocacy nonprofits have listed \"Pro bono management or leadership individual coaching/mentoring\" as one of their top 3 most urgent needs in terms of pro bono support from skilled professionals. See the \"leadership or senior management\" section of our (Animal Advocacy Careers') <a href=\"https://www.animaladvocacycareers.org/skilled-volunteering\">skilled volunteering board</a>.</p><p>(5 out of about 20 participating orgs selected as one of the top 3 priorities out of the more than 100 options they were given. And 5 others selected it as important and useful but not one of their top 3 priorities.)</p><p>So it's fantastic that you're offering this service! Please do use the above linked skilled volunteering board and the instructions there to connect with orgs if you're still looking for additional partners to work with. Thank you!</p>", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "FFzkM3qrc46jmnmbv", "postedAt": "2022-04-11T07:55:41.691Z", "postId": "5T9eJWdSo6XwLrENC", "htmlBody": "<p>Great initiative! The time is definitely ripe for something like this and it's wonderful that you're pivoting your business in this way.&nbsp;</p><p>I have one concern, namely that the things you and your clients appear to be optimizing for are growth and revenue/profit. Of course, there's nothing inherently wrong with this but I worry that the expertise and skills of your coaches might deviate considerably from what EA leaders want to be optimizing for (e.g., different measures of impact over very long timelines and in epistemic terrain that's very messy). But ultimately, this is an empirical question and I wouldn't be surprised if what you offer is already valuable and my concerns are more important slightly down the line. Did you have any leaders sign up and do you collect feedback from them?</p>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}]