[{"_id": "qyXfsyiRCjAHduv5Y", "postedAt": "2022-12-16T17:02:33.836Z", "postId": "5teCKpwdZL7FXSmiu", "htmlBody": "<p>Two other posts(+comments) on this paper:</p>\n<ol>\n<li><a href=\"https://forum.effectivealtruism.org/posts/hY7FvgNAaEf8PjcDp/mogensen-and-macaskill-the-paralysis-argument\">https://forum.effectivealtruism.org/posts/hY7FvgNAaEf8PjcDp/mogensen-and-macaskill-the-paralysis-argument</a></li>\n<li><a href=\"https://forum.effectivealtruism.org/posts/DKe5eQhJoLNMWgaQv/deontology-the-paralysis-argument-and-altruistic-longtermism\">https://forum.effectivealtruism.org/posts/DKe5eQhJoLNMWgaQv/deontology-the-paralysis-argument-and-altruistic-longtermism</a></li>\n</ol>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "dGEhxinZPsRNab9Cs", "postedAt": "2022-12-16T17:57:37.713Z", "postId": "5teCKpwdZL7FXSmiu", "htmlBody": "<p>Can non-consequentialists try to posit metrics of the directness of causation? Then the doing-allowing asymmetry (or loss aversion) would be weighted according to how directly the harm was caused. [A lot of details to fill in there.]</p><p>This would need to be extended to account for uncertainty, using a mixture of notions of both ex-ante and ex-post harm. Perhaps some ideas from <a href=\"https://www.cambridge.org/core/books/foundations-of-causal-decision-theory/068BC033D4D8245FCF607904CC4DB730\">Causal Decision Theory</a> and modal logic could be used here. Certainly, such an account won't be well-fleshed-out anytime soon, but may be at least a vaguely coherent framework.&nbsp;</p><p>FWIW, I'll note that the doing-allowing distinction is only one of a loose family of related distinctions important to deontology/non-consequentialism. For example, there is also the doctrine of double effect about intending vs. forseeing. Phillipa Foote also had a nice example that shows that one can harm people by abstaining from doing something: failing to show up for a theatrical performance in which you are an actor. Further, a key commitment of non-consequentialist ideology is belief in the importance of intuition (in particular cases but also at higher levels of abstraction), so these principles and distinctions don't need to be fully fleshed out, though the more fleshed out the better.</p><p>&nbsp;</p><p>Finally, I suspect the following sentence is a typo in the post:</p><p>\"They argue that non-consequentialists must either join consequentialists in improving the long-run future, alter some core aspects of their understanding of morality… or they must die.\"</p><p>Shouldn't it be \"altering\" not \"alter\"? As is, it suggests a trilemma, rather than a dilemma.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lixiang"}}, {"_id": "GyFbQauGgFwQvHPeF", "postedAt": "2022-12-16T18:07:27.915Z", "postId": "5teCKpwdZL7FXSmiu", "htmlBody": "<p>I think this paper needs a stronger reply to the consideration that when we cause the births of different people and they do harm, that harm is traceable to another moral agent. There is a plausible morally significant difference between \"selling arms to a person who kills someone\" vs. &nbsp;\"causing the birth of a person who ends up being a murderer\".</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}]