[{"_id": "dSn6ugJdsz5P4uy5R", "postedAt": "2018-08-05T11:10:54.634Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Farhan, I'm so so sorry this is happening, this is horrific. I've reached out to a couple of organisations who may be in a position to help and will let you know if that's the case. But I expect many other people here will have better ideas and I hope they can offer useful advice. Much love to you for trying to mobilise more support on this (and for reining in what must be a heartbreaking urge to just scrawl &quot;THIS IS AWFUL AARGHH HELP??!!&quot; in order to put together such an informative post).</p>\n", "parentCommentId": null, "user": null}, {"_id": "tvTXL2RuwM4yzp4kH", "postedAt": "2018-08-05T13:46:15.731Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Thank you so much Holly. It just feels so relieving to know there are people who care. Hearing you say you've contacted some organisations gives me so much hope. Please don't hesitate to contact me if you need more details or footage over the crisis. I'm so eager to start a brainstorming session here, because I'm at a loss for ideas on how to act as productively as possible. We're emailing international news outlets but I'm unsure over how effective it proves to be. Violence is continuing here and there does not seem to be any signs of it subsiding. I'm dreading that Dhaka may be becoming a war zone. As far as solutions go, I can't think much further than international intervention.  I hope more people see this post so that there is more to discuss. I believe this place is brilliant for constructive thinking. </p>\n<p>Best regards.</p>\n", "parentCommentId": "dSn6ugJdsz5P4uy5R", "user": {"username": "Farhan"}}, {"_id": "gEZEENGyn6PM3n5z2", "postedAt": "2018-08-05T16:47:36.336Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Thanks for sharing this with us, Farhan. Like Holly, my heart goes out to you and the people of Dhaka. </p>\n<p>I wish I was in a better position to help. This feels a bit feeble, but I'm sharing it just because there's a small probability that it helps. The EA community has done a <a href=\"https://www.openphilanthropy.org/research/cause-reports/traffic-safety\">little work on traffic safety</a>. Obviously, this is quite different from the root problem of political corruption. However, given the entanglement of the corruption/violence with the traffic safety catalyst here, perhaps some of the listed organizations would amplify the concerns being voiced and bring more attention to Bangladesh—both the traffic issue and the resulting protests/crackdown.</p>\n", "parentCommentId": null, "user": {"username": "Cullen_OKeefe"}}, {"_id": "6bycoeTqG8cQeTAeB", "postedAt": "2018-08-05T23:30:35.546Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Emailing international news outlets sounds like a good start to me but I expect you know a lot more than me about the most useful action to take here. For all the strengths of this community, rapid response to crises is generally not one of them, and while I hope that some of the other readers are able to offer useful expertise/networks, I want to set realistic expectations of how we might be able to help and I encourage you to continue reaching out to other communities and organisations (e.g. perhaps Amnesty International...I would be very surprised if they haven't caught it on the news by now, but perhaps it helps them to be in contact with more locals who are keen to work with international support?) I'm struggling to think of the right words here but basically I just want to say: ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️</p>\n", "parentCommentId": "tvTXL2RuwM4yzp4kH", "user": null}, {"_id": "WgCrnktXiaeHTqJso", "postedAt": "2018-08-06T02:16:01.578Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Hi Farhan, </p>\n<p>My information here may be outdated. However, when I worked in Bangladesh I worked with Dr. Kamal Hossain and Associates who at the time provided pro bono legal advice and may be able to offer legal support, particularly if you have video evidence of the incidents (<a href=\"mailto:khossain@citechco.net\">khossain@citechco.net</a>, <a href=\"mailto:inquiries@khossain.com\">inquiries@khossain.com</a>). I think the value added of contacting Amnesty International and Human Rights Watch may be fairly low, as incidents like these have already been logged and published, but if you have any further evidence, I would definitely get in touch with them.  </p>\n<p>Above all and my reason for posting here, I am sure you are already aware, but please be very careful when contacting any of these organizations or publishing material on these incidents to take measures to protect your identity and your safety generally. You may wish to contact the Centre for Social Activism, a Bangladeshi human rights organization who supports activists in Bangladesh for advice before proceeding with contacting external organizations (including the ones I recommend) as they will have much more information on the current political, civil landscape than I do). I am fairly confident on CSA as they are one of the peer reviewers in the United Nations UPR process (although I still urge caution). You may contact me at <a href=\"mailto:kathryn.mecrow@gmail.com\">kathryn.mecrow@gmail.com</a> if you wish for me to submit materials on your behalf so as to remain anonymous (as I am not currently working or living in Bangladesh).</p>\n<p>On a personal level, thank you for posting here and I am terribly sorry to hear of these incidents. The thoughts of my family are with yours and your loved ones during these difficult times.       </p>\n", "parentCommentId": null, "user": {"username": "KathrynMecrow"}}, {"_id": "CKR7XcScxAGhBhchD", "postedAt": "2018-08-06T18:43:59.727Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Heyy Cullen</p>\n<p>Your sharing this is not feeble at all. Your empathy and concern goes a very long way. Thank you so much. For now maybe reaching out for more international coverage is the best we can do. The conflict has become political. I'm afraid this may have to be resolved internally as a nation. Watching helplessly is just so difficult at this point. I hope with more searching more solutions will emerge. It's just so annoying that the problems in third world countries are so fundamental, and may take generations to improve in the grand scheme of things.    </p>\n", "parentCommentId": "gEZEENGyn6PM3n5z2", "user": {"username": "Farhan"}}, {"_id": "X5BkjY3yZc7ho7BMk", "postedAt": "2018-08-06T19:25:33.600Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Your support gives us courage Holly. I struggle to find the words to describe my gratitude for your empathy. Let's hope things get better. I'll try my best to seek out the most effective courses of action. Honestly, the responses from this forum exceeded my expectations. I'm grateful. Let's hope more solutions emerge with time.  </p>\n", "parentCommentId": "6bycoeTqG8cQeTAeB", "user": {"username": "Farhan"}}, {"_id": "PQQJELeGeHdC56N8Y", "postedAt": "2018-08-06T19:40:40.226Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Hi Kathryn,</p>\n<p>Your input is extremely valuable. Thank you so much. I will definitely look into the resources you suggested. The whole situation is becoming very complicated, and is hard for a civilian without inside information to understand all that is happening now, as it is no longer a non partisan protest. It seems the best thing I can to is learn as much as I can about the current circumstances. Thank you for your email, if it's okay, I will contact you and give you updates on my progress and the developments regarding the events. I'll also take proper measures to ensure safety as you mentioned, it is very important indeed, also for us to have a more effective impact on helping to improve the situation.  </p>\n<p>Your support means so much to us. Again, thank you so much. </p>\n", "parentCommentId": "WgCrnktXiaeHTqJso", "user": {"username": "Farhan"}}, {"_id": "5Gsu3S4gSHfxRwKPN", "postedAt": "2018-08-06T21:47:59.348Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>All that I have to add is, welcome to EA, we're happy to have another person around, stay safe out there.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "st2s9XMeWSypujWRa", "postedAt": "2018-08-07T10:20:42.911Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Thank you. I'm happy to have found this community. I'll try my best. </p>\n<p>Best wishes. </p>\n", "parentCommentId": "5Gsu3S4gSHfxRwKPN", "user": {"username": "Farhan"}}, {"_id": "HKXyBiuH9kj8yvaTx", "postedAt": "2018-08-07T17:43:48.363Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Man, sounds like a tough situation, I'm so sorry you are going through this.</p>\n<p>In addition to all the other stuff in this thread, it might be valuable to read some history in order to try &amp; acquire perspective.  I don't know very much history myself, but perhaps a good analogy would be the recent Arab Spring protests.  My vague understanding is that a lot of the Arab Spring countries ended up worse off than they were to start with, despite the good intentions of the people protesting.  &quot;Color revolutions&quot; in the former Soviet Union could be another analogy--<a href=\"https://foreignpolicy.com/2013/03/18/why-the-color-revolutions-failed/\">here</a> is an article I found on Google.  Perhaps you could gather examples of countries which did/did not succeed in peacefully reforming their government, and try to understand which separates the successful countries from the unsuccessful ones.  (Or see if some academic has already attempted this.)</p>\n<p><a href=\"https://www.youtube.com/watch?v=rStL7niR7gs\">This</a> is a really fascinating video which attempts to show that the bad behavior of autocratic governments is simply a matter of all the individuals involved following their incentives.  Maybe the <a href=\"https://smile.amazon.com/Dictators-Handbook-Behavior-Almost-Politics/dp/1610391845\">book that inspired the video</a> has some solutions to the problem?  <a href=\"https://www.lesswrong.com/posts/2G8j8D5auZKKAjSfY/inadequate-equilibria-vs-governance-of-the-commons\">This post</a> might have ideas?  Chapter 14 of <a href=\"https://smile.amazon.com/Why-Nations-Fail-Origins-Prosperity/dp/0307719227/\">this book</a>?  <a href=\"http://www.slate.com/articles/news_and_politics/politics/2013/04/congressional_salaries_senators_representatives_and_their_staff_all_deserve.html\">Paying higher salaries</a> is another interesting idea for tackling corruption.  If getting books is hard, you might try <a href=\"https://www.mruniversity.com/courses/development-economics\">this</a> free online course created by some prominent economists.  The sections on corruption &amp; democracy could be relevant, and maybe the &quot;people&quot; section?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "tyogb9PHfDMu89dDj", "postedAt": "2018-08-08T17:32:48.418Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>Hi John,</p>\n<p>I'll definitely look into all that you've suggested. You're absolutely right in trying to acquire perspective about these events in order to understand better how to react if these things happen again in the future, which it very well might. I value your input and hope to give you  some feedback on it one day. I'd like to message you and maybe have a chat about the contents of the material you've advised.</p>\n", "parentCommentId": "HKXyBiuH9kj8yvaTx", "user": {"username": "Farhan"}}, {"_id": "fGTHeCW5WtRcBsSCf", "postedAt": "2018-08-09T00:04:16.372Z", "postId": "5uWX6iNhaMp6Gnz7q", "htmlBody": "<p>You're welcome to message me, but I don't feel like I have much to offer beyond what I wrote in my comment.  Maybe try emailing some researchers in this field asking for advice?</p>\n", "parentCommentId": "tyogb9PHfDMu89dDj", "user": {"username": "John_Maxwell_IV"}}]