[{"_id": "x6nLdpvGJCBSA2Xqb", "postedAt": "2023-02-23T15:31:06.564Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Ok, I mostly agree with you, but let's reframe as a devil's advocate: what if \"EA\" is a shaky concept in the first place (doesn't carve reality at joints)? Would you then agree that borders should be redrawn to have a more coherent mission, even if that ends up cutting out some bits of the \"old EA\"?</p>\n", "parentCommentId": null, "user": {"username": "lincolnq"}}, {"_id": "RoWACAwq7xCvYaXkT", "postedAt": "2023-02-23T16:07:40.107Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>If a sub-faction of EA thinks that the movement as a whole is unwelcoming to them or no longer represents their beliefs/values, it could make sense for them to schism into a movement that does represent them rather than to just leave slowly over time and form nothing.&nbsp;</p><p>Avoiding a schism requires active work by the community to ensure that everyone feels welcome, valued, and respected.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "sbjkojrfqkNMkRAWC", "postedAt": "2023-02-23T16:46:48.512Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Wil - this is perfectly reasonable, and generally true. 'Avoid schisms' is prudent for movement-building.</p><p>However, let me try to steel-man a possible counter-argument. In modern culture, we see many examples of woke activists taking over movements and organizations from the inside, by making ideologically motivated demands, playing various victim cards, demanding more 'diversity and inclusion', and trying to nudge the movement/organization in partisan political directions. Ever since the '<a href=\"https://en.wikipedia.org/wiki/Long_march_through_the_institutions\">long march through institutions</a>' (1967) and <a href=\"https://en.wikipedia.org/wiki/Rules_for_Radicals\">Rules for Radicals</a> (1971), this has been refined into an extremely &nbsp;common and effective tactic, and it has arguably had very negative effects in academia, media, corporations, and governments.&nbsp;</p><p>Movements and organizations often find it difficult to protect themselves from woke takeover, because they don't understand what's happening, they don't have good counter-arguments, they're too guilt-prone and easily shamed, and they're too conflict-averse. &nbsp;All too often, the movement/organization feels like they face a dilemma: either (1) give in to the woke activists, submit to all their demands, and take the movement in partisan politicized directions, or (2) accept a schism in which the woke get to take over the larger portion of the original movement, and a minority of anti-woke, ornery, heterodox contrarians go off and start their own movement (which is what we're currently seeing in American academia, media, corporations, and state governments).</p><p>I hope EAs see what's happening here, and understand the clear and present dangers of a woke takeover of the EA movement. We need to find a third option between accepting a woke takeover, and falling into a woke-versus-antiwoke schism. IMHO, that third option needs to be grounded in a radically honest discussion of what's really been happening in the EA movement over the last few months. &nbsp; I don't know what the optimal solution would be. But it <i>might</i> involve making it clear to the minority of woke activists in EA that their ideological values are simply not consistent with EA ethical and epistemic values -- just as many other kinds of political, religious, and ideological values are not consistent with EA values.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "BHfv9dt8BTfgiTy5Q", "postedAt": "2023-02-23T17:12:15.529Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I feel like discussions about what we'd like social norms to be &nbsp;and (relatedly) how to react to \"scandals\" have an inherent dynamic that increases polarization. This often goes like this:<br><br>There's a scandal or the possibility of a scandal and there's a tradeoff to make with respect to several things of importance. (E.g., creating a welcoming and safe environment vs. fear that this devolves into a culture where 99% of people will end up cancelled eventually with no chance of redemption for increasingly less severe transgressions.) Many people have some opinion on where they would set this tradeoff, but different people would set the weights in different places. (And some people may just say things that they expect will be received well, increasing the momentum that the pendulum is currently swinging.) Moreover, people operate in different parts of the EA community and have widely different day-to-day experiences filtered by their personality, standing in the movement, preferred ways of socializing, things like gender or ethnicity, and so on. So, even if two people in some sense agreed that the ideal norms for the movement would set the tradeoff in one specific way, they may disagree, based on the different glimpses of the movement they catch, &nbsp;about where the pendulum is currently at.</p><p>Now, since people often care really strongly about what the norms should be, it can be quite distressing if someone wants the pendulum to be at a 60 degree angle and thinks it's currently at a 120 degree angle, and then a person who wants it to be at the 120 angle comes and talks as though it's <i>already</i> at the 60 degree angle. While these two people only differ by 60 degrees (one wants it at 60, the other at 120), it seems to them as though they differ by 120 degrees (they both think the pendulum is currently far away from them). This impression of vast differences will cause them to argue their case even more vehemently, which further amplifies the <i>perceived</i> difference until it feels like 180 degrees – total opposition.<br><br>I'm not sure what to do about this. One option could be to debate less where the pendulum is exactly in a <i>movement-wide sense</i> (since that's impossible to begin with, given that the answer will be different for different parts of EA – both geographically and in terms of more subtle differences to what people see and experience – and also because no one should be confident about it given the limited glimpses that they catch). Instead, we could say things like \"I think the pendulum is too far to the left in such and such situations (e.g., Bay area community house x).\" Or, alternatively, we could focus more on what the movement should ideally look like. (E.g., maybe write down the reaction you'd like to see instead of focusing on why you don't like other people's reactions.) People will still disagree on these things, but maybe the disagreements will feel more like the 60 degrees rather than the doubled 120 degrees?<br><br>To make clear that one is making statements about where one wants the pendulum to be instead of where it's currently at, I think it's &nbsp;also useful to simply <i>acknowledge all the values at stake in the tradeoff</i>. This makes clear to others that you at least see where they're coming from. It also makes clear that you're not engaged in frantic pendulum-pushing where you think the pendulum has to move in a specific direction at all costs without worrying about how far it already went in some places.</p><p>Lastly, maybe it would be good if people thought about what sort of viewpoints they disagree with but still find \"defensible.\" I think it makes total sense to regard some viewpoints as indefensible and try to combat them and so on, but if we resort to that sort of reaction too quickly, then it becomes really difficult to coordinate on anything. Therefore, I often find it refreshing when people disagree in a way that makes clear that other perspectives are still heard and respected.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "bHib3AKqsBZJFhXz2", "postedAt": "2023-02-23T17:12:51.557Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>BTW, it's interesting that there seems to be a cadre of EAs who get notifications whenever I post something, and they immediately disagree-vote on it, within a few minutes, if it involves any criticism of wokeness. But they don't actually reply with any concrete reasons for disagreement. Then later the other EAs who come across the post naturally tend to agree-vote more often with it.&nbsp;</p><p>Yet another tactic of woke takeover?&nbsp;</p>", "parentCommentId": "sbjkojrfqkNMkRAWC", "user": {"username": "geoffreymiller"}}, {"_id": "tW3czmgkDEjJAcobF", "postedAt": "2023-02-23T17:15:37.594Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Agreed! I suppose what I’m saying is that we make sure to do that active work now before things get too far out of hand.</p>\n<p>I’m curious how other movements have managed this issue - do you know of any examples of success here?</p>\n", "parentCommentId": "RoWACAwq7xCvYaXkT", "user": {"username": "Wil Perkins"}}, {"_id": "AhkpqBPkKqTSgBw9D", "postedAt": "2023-02-23T17:21:57.753Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I don’t get notifications for your posts, I saw it when I read the comments on this post and disagreed with it because I personally dislike the use of the word “woke” and see it as divisive in itself. It would be helpful for me if you could define what you mean by woke and explain what it means to EA. I know it is a common term used in the US and in twitter conversations about American politics, but I would prefer to not see US political discourse language in EA unless it’s really illuminating any real issues or threats. You seem\nto be making a lot of general claims like “Movements and organizations often find it difficult to protect themselves from woke takeover, because they don't understand what's happening, they don't have good counter-arguments, they're too guilt-prone and easily shamed, and they're too conflict-averse. ”, but it’s not clear to me what you’re referring to.</p>\n", "parentCommentId": "bHib3AKqsBZJFhXz2", "user": {"username": "Lauren Maria"}}, {"_id": "jfC7yoeHqnbcEpDgx", "postedAt": "2023-02-23T17:22:41.443Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Hey Geoffrey, thanks for pointing this out. I agree it seems like you immediately got downvoted hard - I’ve strong agreed to try and correct that a bit.</p>\n<p>I broadly agree with you on this, and I’m glad we’re having this conversation. However I think framing it this way is problematic and leads to tribalism. The way I see it the ‘woke takeover’ is really just movements growing up and learning to regulate some of their sharper edges in exchange for more social acceptance and political power.</p>\n<p>Different movements do better or worse - New Atheism is an example that was ruined by this modulation. I’m optimistic that EA can learn to become more welcoming and palatable to normal folks on the left and right, while keeping the old guard, if we play our cards right.</p>\n<p>The largest divide seems to be the older folks who prize unconventional dating and social norms like polyamory, radical honesty, etc, versus a lot of the more “normal” folks that may be turned off by that sort of thing. For instance leading a local group in Raleigh NC, we have a large number of people that have relatively standard intuitions about sex and relationships.</p>\n<p>My biggest goal is learning how to increase their involvement and engagement in EA without turning them off - something we’ve already dealt with a bit from SBF.</p>\n<p>Building that middle ground framework will be tough, do you have any ideas here as to where we can start?</p>\n", "parentCommentId": "sbjkojrfqkNMkRAWC", "user": {"username": "Wil Perkins"}}, {"_id": "itip4rfbhzjNhHkNZ", "postedAt": "2023-02-23T17:24:38.504Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I think we can manage to have different enclaves of EA with different norms, that still broadly agree and play nicely with each other. As a community organizer I hope to get a better idea of what different groups value so I can navigate these situations better.</p>\n<p>Could you explain a bit more as to what you’re proposing?</p>\n", "parentCommentId": "x6nLdpvGJCBSA2Xqb", "user": {"username": "Wil Perkins"}}, {"_id": "J3GEqTLAtKuuSHEf2", "postedAt": "2023-02-23T17:25:33.808Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Wil - thanks for the constructive reply. That's all reasonable. I've got to teach soon, but will try to respond properly later.</p>", "parentCommentId": "jfC7yoeHqnbcEpDgx", "user": {"username": "geoffreymiller"}}, {"_id": "Rw2hyaWZC5rYctiKx", "postedAt": "2023-02-23T17:26:19.722Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I would also be interested in what you mean by wokeness - I haven't downvoted you but I don't think I follow your point, largely because I don't know what you mean by \"woke takeover\" or \"woke-versus-antiwoke.\"</p>", "parentCommentId": "bHib3AKqsBZJFhXz2", "user": {"username": "britomart"}}, {"_id": "JCE4fsztajmjZHC6Y", "postedAt": "2023-02-23T17:28:25.687Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Great comment. I agree that the best way forward is acknowledging that different parts of EA have different values, and making sure community organizers/high status people in the movement are aware and sensitive of that sort of thing.</p>\n<p>For instance in my local group, I think if an EA from SF came and started propositioning people for dates/discussing polyamory, that would seriously break our norms. Perhaps having more intentional communication between group organizers could help?</p>\n<p>For instance maybe a mandatory meeting once or twice a year for all paid organizers in a nation where people can get and idea of what is kosher where. What are your thoughts here?</p>\n", "parentCommentId": "BHfv9dt8BTfgiTy5Q", "user": {"username": "Wil Perkins"}}, {"_id": "SmPfaMQe9TaepATcW", "postedAt": "2023-02-23T17:28:29.966Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>If it makes you feel any better, there also seems to be a cadre who downvotes certain critical posts soon after they are made.</p>\n<p>(I do not get an alert on anyone's posts, by the way)</p>\n", "parentCommentId": "bHib3AKqsBZJFhXz2", "user": {"username": "Jason"}}, {"_id": "ac3SSb7wXPugqrpwv", "postedAt": "2023-02-23T17:32:40.535Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I agree with much of your underlying frustration, Geoffrey, but I worry that explicitly anti-woke sentiment could encourage the perception that the woke are \"not welcome here\".</p><p>So many people find and contribute to EA from woke/woke-adjacent circles like climate change activism, welfare capitalism, and animal welfare. Even if you and I disagree with their ideological views, they're still trying to improve the world, the same way as you or I.&nbsp;</p><p>I hope that much the same way that EA is influenced by wokism, woke EAs are influenced by EA refine the ethics and epistemics of their ideology. I'd like to throw in a (perhaps naive) vote for not explicitly alienating woke EAs if at all possible.</p>", "parentCommentId": "sbjkojrfqkNMkRAWC", "user": {"username": "Ariel Simnegar"}}, {"_id": "9S8bFqegMLAoqFKzG", "postedAt": "2023-02-23T17:37:18.456Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Strong agree! The basic framework of EA, using utilitarian EV calculus to have more impact, can be adopted by folks on the left or right. People who are more into social justice and climate change can learn to have better feedback mechanisms to increase impact.</p>\n<p>At the same time, conservative religious groups that do a ton of charity could also be led to using more effective interventions. I don’t think the EA framework needs to be politicized.</p>\n", "parentCommentId": "ac3SSb7wXPugqrpwv", "user": {"username": "Wil Perkins"}}, {"_id": "CCSexgvwekKcxMJvd", "postedAt": "2023-02-23T17:41:59.238Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I'm grateful for this comment, because it's an exemplar of the kind of comment that makes me feel most disappointed by the EA community.</p><p>It's bad enough that influential EAs have caused a lot of damage to other individuals, and to the good work that might be done by the community. But it's really upsetting that a lot of the community (at least as exemplified by the comments on the forum; I know this isn't fully representative) doesn't seem to take it seriously enough. We're talking about really horrible examples of racism and sexual harassment here, not 'woke activism' gone too far. It hurts people directly, it repels others from the community, and it also makes it harder to further important causes.</p><p>It's also couched in the terms of 'rationalism' and academic integrity (\"let me try to steel-man a possible counter-argument...\"), rather than just coming out and saying what it is. I don't think you're (merely) trying to make a hypothetical argument. Similarly the \"I hope EAs see what's [really]* happening here, and understand the clear and present dangers...\" sounds alarmist to me.</p><p>*I included the [really], because it seems to me like the author of the comment is trying to lend weight to their argument by implying they are revealing something most people would otherwise miss.</p>", "parentCommentId": "sbjkojrfqkNMkRAWC", "user": {"username": "tomrowlands"}}, {"_id": "uBh5nsPuoyoojgw6Q", "postedAt": "2023-02-23T17:41:59.821Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Ariel -- thanks for your calm &amp; constructive comment. I take your point that many people in those movements such as animal welfare and climate change activism tend to be woke-adjacent. I also accept that everybody <i>thinks</i> they're trying to improve the world, given their own values and beliefs.</p><p>It's worth having a discussion about whether EA should be explicitly anti-woke, or woke-neutral, or pro-woke (which often includes pretending not to know what 'woke' means). However, there's a variant of <a href=\"https://www.urbandictionary.com/define.php?term=O%E2%80%99Sullivan%E2%80%99s%20Law\">O'Sullivan's Law</a> that seem to operate in modern culture, such that any organization that is not explicitly anti-woke tends to become woke.</p>", "parentCommentId": "ac3SSb7wXPugqrpwv", "user": {"username": "geoffreymiller"}}, {"_id": "8tgdCkcv9GxLoT2h5", "postedAt": "2023-02-23T17:56:32.302Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>One thing I'd really like to see is more experimentation <em>inside</em> the community.</p>\n<p>For example, there was some discussion about democratic control of funding decisions. This isn't something we need to centrally decide, you can just... start doing it. Start a fund that makes decisions democratically! I bet you'd get funding from the EAIF even.</p>\n<p>Got a great idea for how to set up codes of conduct to make diverse people feel welcome? Try them in your local group and report back on how they work!</p>\n<p>I wish people felt more empowered to do this kind of thing. That's how we got our existing organisations and institutions: someone just went ahead and started doing it. They weren't created when Dustin Moskovitz arose out of the sea on a shell. Maybe e.g. the EAIF could explicitly call out experimentation as something it wants to fund.</p>\n<p>Of course, this argument only applies to stuff <em>you</em> can do differently. If you don't like the way <em>other</em> people behave and just don't want to be associated with them, that's harder to reconcile.</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "vhMgWCayJyuhGRuwo", "postedAt": "2023-02-23T18:02:06.695Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I agree with this - it is also why I disagree-voted, and no, I don't have notifications set up for Geoffrey (as mentioned in another comment by them).&nbsp;</p><p>The comment felt to me like it was undermining a lot of the recent criticism regarding people in powerful positions, AT THE VERY LEAST, showing very bad judgement. The comment makes me very sad and angry.&nbsp;</p>", "parentCommentId": "CCSexgvwekKcxMJvd", "user": {"username": "laurapomarius"}}, {"_id": "PEg6yvrmbovWXjyTn", "postedAt": "2023-02-23T18:03:40.630Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>As someone who is a funded community builder part time, it's extremely difficult to do this kind of work. Community building is extremely competitive to get funding, and running a local group takes a lot out of you. Plus the career/funding situation is precarious and not exactly great for setting up a lucrative career path, so unfortunately I think a lot of people see community building as a temporary position or a means to getting more clout in EA.</p><p>This is especially true of university organizers since by the nature of their position, they will only be organizing temporarily.</p><p>I'd like the community building movement, especially the paid organizers, to coordinate more. I think that if we could have an annual meetup country by country, perhaps people could coordinate and piece out larger projects - for example a group of 5 paid organizers could pool some funds or work on building an ethics framework together.&nbsp;</p><p>EA generally has an issue where people say \"if this is a problem, why don't you go do it?\" I think if we focused more on coordinating and letting people solve problems as a group, we could get a lot more done.&nbsp;</p>", "parentCommentId": "8tgdCkcv9GxLoT2h5", "user": {"username": "Wil Perkins"}}, {"_id": "kTHNTN7gSCnHSB9xp", "postedAt": "2023-02-23T18:05:42.120Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Hi Geoffrey, I commented earlier asking what you mean by woke, and would like to clarify that I'm not \"pretending not to know what 'woke' means.\" It's a word that I only ever see employed derisively and I am truly not sure what it's supposed to mean beyond \"views that the speaker holds in contempt.\" So if you are able to give a sense of what \"woke\" means to you I would appreciate it, as that would help me understand your viewpoint.</p>", "parentCommentId": "uBh5nsPuoyoojgw6Q", "user": {"username": "britomart"}}, {"_id": "TcmfCoLSzMuLLYD59", "postedAt": "2023-02-23T18:05:54.902Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>You're welcome! I agree that the discussion is worth having, and won't pretend to know the right answer. Your point that the de-facto choice may be between anti-woke and (eventually) pro-woke is legitimate.</p><p>One consideration which we might be underestimating (I'm not just saying this; I mean it :P) is the impact of ways EA could influence woke ideology:</p><ul><li>Expose woke people to <a href=\"https://en.wikipedia.org/wiki/Prioritarianism\">prioritarianism</a>, which incorporates their perception of the effects of oppression between groups of people, while often resulting in de-facto EA conclusions.</li><li>Expose woke people to the possible moral significance of disenfranchised groups which are typically ignored in the public eye, such as future people and wild animals.</li><li>Encourage woke people to quantify their perceptions of how oppressed different groups are, and how to make tradeoffs between interventions which help different groups. This also often leads to EA conclusions. For example, under most plausible assumptions of the sentience of farmed animals, it seems likely that a given intervention in farmed animal welfare will reduce more suffering than a given anti-racist intervention.</li></ul>", "parentCommentId": "uBh5nsPuoyoojgw6Q", "user": {"username": "Ariel Simnegar"}}, {"_id": "Nuh84DarxihmepeyR", "postedAt": "2023-02-23T18:06:07.067Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Thanks for a post that I disagree with! I want to see more heretical factions form splinter groups, \"EA is wrong about xyz and here's how we're going to fix it\", etc. Barring a long discussion of the reference classes of social change and whether EA is closer to \"feminism\"/\"environmentalism\" or \"the rockefeller foundation\", I think it's deeply plausible that cohesion is actually a threat to our goals.&nbsp;</p><ul><li>Institutions like to preserve themselves at the expense of their goals (I halfway tongue in cheek invoke \"the soviet union\" to reason about this, sometimes)&nbsp;</li><li>Groupthink. In AI alignment, researchers who don't deep down understand the threatmodels they're ostensibly trying to solve make bad research outputs, but social pressures might pressure them to try working in areas they don't really believe in.&nbsp;</li><li><a href=\"https://forum.effectivealtruism.org/posts/J3gZxFqsCFmzNosNa/ea-risks-falling-into-a-meta-trap-but-we-can-avoid-it\">Peter Wildeford crushed it 7 years ago with a post about \"the meta trap\"</a>, I think cohesion exacerbates the meta trap.&nbsp;</li><li>A wider attack surface for more <a href=\"https://forum.effectivealtruism.org/posts/W8ii8DyTa5jn8By7H/the-vultures-are-circling\">vulture</a>-related problems.&nbsp;</li><li>To me, a corollary of <a href=\"https://80000hours.org/podcast/episodes/holden-karnofsky-building-aptitudes-kicking-ass/\">Holden's emphasis on asskicking </a>is that we want to cultivate uncorrelated skillsets. We want to make bets on expertises that could come in handy in unpredictable ways. (CoI: I'm making one such bet myself as we speak!). I think cohesion could lead to underemphasizing this.&nbsp;</li></ul><p>Related: I think some EAs target <a href=\"https://forum.effectivealtruism.org/posts/qpuaYNrKfgZapm4QA/effective-altruism-deconfusion-part-2-causes-philosophy-and?commentId=r822Ttz5Td6YnKqKZ\">massive conversion rates, which I think is wrong.</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "mj7Dj8PdBAppaHS5R", "postedAt": "2023-02-23T18:17:09.942Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<blockquote><p>We are playing for the future, for the survival of the human race. We can't afford to let relatively petty squabbles divide us too much!</p></blockquote><p>I think this is the sort of reasoning that has a) possibly contributed to some of the recent damaging behaviour by EAs and b) almost certainly contributed to the failure to take that behaviour seriously enough.</p><p>Everything is \"relatively petty\" when compared to the survival of the human race, but I don't think that's the relevant comparison here.</p>", "parentCommentId": null, "user": {"username": "tomrowlands"}}, {"_id": "APn6cqryKSDxbWwNz", "postedAt": "2023-02-23T18:20:07.359Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I understand the frustrations you and others are voicing, but to me I think it's more a lack of competence and understanding of management/power differentials/social skills from some of the higher level EAs. I highly doubt that the upper echelons of EA are full of malicious sociopaths who are intentionally harming people.</p><p>EA has done a lot of good, and people make mistakes often. I do think we need to rectify them and punish bad behavior, but we should try and make sure we don't alienate the old guard of EA for making mistakes in the socializing/dating world. A lot of people struggle to understand what is okay and what isn't - I'd rather try and reconcile or educate them than attack each other. That's the point of this post.</p><p>Does that framing make sense to you?</p>", "parentCommentId": "CCSexgvwekKcxMJvd", "user": {"username": "Wil Perkins"}}, {"_id": "fJFCjuJrovDZixXBc", "postedAt": "2023-02-23T18:23:54.785Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>It's also the sort of reasoning that has let us get billions of dollars into funding for effective solutions, saved tens of thousands of lives, and created a broad social movement with tremendous impact and impact potential down the road.</p><p>The totalizing reasoning of EA does have negative aspects, but I don't think we should throw out the baby with the bathwater! It is possible to salvage the good parts of the EA framework while maturing the movement. To do that we have to make sure to reduce tribal tensions and work towards understanding.&nbsp;</p><p><a href=\"https://slatestarcodex.com/2014/12/03/framing-for-light-instead-of-heat/\">Optimize for light, rather than heat.&nbsp;</a></p>", "parentCommentId": "mj7Dj8PdBAppaHS5R", "user": {"username": "Wil Perkins"}}, {"_id": "wE6CAuE2idXRLhm2d", "postedAt": "2023-02-23T18:24:12.951Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I don't mean to discount your experience, but from my experience something like running a small democratically allocated fund seems pretty doable by a single person as a fun side project with some spreadsheets (probably less work than writing a 20000 word critical essay...). If you want to get serious, sure, the work ramps up. But the point is to find out whether people are interested in a low cost way.</p>\n<blockquote>\n<p>EA generally has an issue where people say \"if this is a problem, why don't you go do it?\"</p>\n</blockquote>\n<p>I think we are probably sensitive to different things :) I feel like I see a lot more people saying \"why doesn't Someone (usually 'the EA movement', which isn't, you know, an agent) just implement my pet idea?\". Probably people say both :upside-down-smile:</p>\n", "parentCommentId": "PEg6yvrmbovWXjyTn", "user": {"username": "Michael_PJ"}}, {"_id": "bg8HzAcsaPXSXc6fL", "postedAt": "2023-02-23T18:26:32.232Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I organize part time while also working full time as the head of sales at a tech startup. I really don't have time to coordinate this type of thing, but if I could contribute a few hours a month here or there I'd be happy to do it.</p><p>The problem is most people don't have the skillset to do sales, build spreadsheets, and identify funds. It takes either an incredibly talented person with a lot of time, or a group with different skills complementing each other.&nbsp;</p>", "parentCommentId": "wE6CAuE2idXRLhm2d", "user": {"username": "Wil Perkins"}}, {"_id": "fKv6HakchGFxEN9nu", "postedAt": "2023-02-23T18:42:54.037Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Adding a +1 - historical analysis of institutions and movements that have grown and succeeded in their goal, versus those that have stangated, suffered schisms, and split, would be highly valuable. I can't remember the website but maybe there should be an EA Forum post bounty on this?</p>", "parentCommentId": "tW3czmgkDEjJAcobF", "user": {"username": "JWS"}}, {"_id": "qSRwoc92xafwtrmHX", "postedAt": "2023-02-23T19:00:52.452Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>This comment implies the only relevant division is over wokery. I'm not sure why you focused only on that, but there are other ways people can practically disagree about what to do...</p>\n", "parentCommentId": "sbjkojrfqkNMkRAWC", "user": {"username": "MichaelPlant"}}, {"_id": "47tSbKd8DgN2xtrXy", "postedAt": "2023-02-23T19:02:55.195Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>And what specific, significant \"woke\" pressures are being put on EA?</p>\n<p>(I would categorize some of the ConcernedEA platform as \"woke,\" but I don't get the sense that those parts of the platform are getting much support.)</p>\n", "parentCommentId": "kTHNTN7gSCnHSB9xp", "user": {"username": "Jason"}}, {"_id": "FC8T3CBjqmPFe4aZp", "postedAt": "2023-02-23T19:06:43.584Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Hi Wil,</p><p>My comment here was about Geoffrey Miller's <a href=\"https://forum.effectivealtruism.org/posts/5uZiBK4h5WcccjA2R/ea-is-too-new-and-important-to-schism?commentId=sbjkojrfqkNMkRAWC\">comment</a>, rather than your original post as a whole (albeit I separately took issue with your use of \"relatively petty...\"), so I'm not sure I follow where you're going here.</p><p>FWIW, if you're referring to recently-come-to-light examples of sexual harassment and racism when you say \"it's more a lack of competence...\", then I would disagree with your characterisation. I think by saying that the likes of Owen Cotton-Barratt and Nick Bostrom aren't \"malicious sociopaths\", and that they didn't do it 'intentionally' you fail to acknowledge the harm they've done. It's a similar line of argument to your original post when you compare the harm done with \"the survival of the human race\". I think it's missing the point, it's insensitive, and implies that they're not <i>soooo</i> bad.</p><p>I also worry when the initial reaction to someone's misdeeds is \"let's make sure we don't punish them too harshly, or we'll alienate them\", rather than \"this is really wrong, and our first priority should be to make sure it doesn't happen again\". My initial response isn't to shed a tear for the damage to the career of the person who did the wrong thing.</p><p>I disagree with your framing this as \"attacking\" the people that have done wrong. If anything, it's the people on the end of the sexual harassment that have been attacked.</p><p>I find it distasteful when people point to things like \"EA has done a lot of good\" or \"EA has saved a lot of lives\" in the context of revelations of sexual harassment etc. While it might be factually correct, I think it gives the sense that people think it's OK to do horrible personal things as long as you donate enough to Givewell (I very much disagree).</p><p>And one final point: I don't think \"the old guard of EA\" is the right frame (although I'm somewhat biased as I was involved in EA in 2011-12). &nbsp;I don't believe the majority of wrongdoers are from this group, nor do I believe the majority of this group are wrongdoers.</p><p>So no, that framing does not make sense to me.</p>", "parentCommentId": "APn6cqryKSDxbWwNz", "user": {"username": "tomrowlands"}}, {"_id": "7D2kKLRWKxf3RLoYi", "postedAt": "2023-02-23T19:16:48.058Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Please see my other comment for why I disagree with this comment (and also downvoted it, as I want to see fewer comments like this).</p><p>I'm also sick of the referencing Scott Alexander - without any explanatory comment for how the article relates to the point in question - as some sort of knockdown argument.</p>", "parentCommentId": "fJFCjuJrovDZixXBc", "user": {"username": "tomrowlands"}}, {"_id": "B6oceqmddRyKHFdvG", "postedAt": "2023-02-23T19:20:40.616Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<blockquote><p>having a major schism is one of the worst things we could do for our impact</p></blockquote><p>I definitely agree. For EA to follow the lifecycle of 'New Atheism' would be one of the worse outcomes for the movement. Thinking about some reasons why there would be a schism:</p><ol><li>Irreconcilable differences in belief between members of the EA Community and a zero-sum mentality about the resources that ought to go to different subgroups/causes in EA</li><li>A breakdown of trust / perceived legitimacy between EAs leaders / institutionals / power holders and a significant section of the EA Community - especially if the latter holds little formal power</li><li>Lack of belief by the community that EA can achieve its goals, or that its goals are wrong</li><li>The emergence of a new powerful social movement that appeals to similar demographics as EA does</li></ol><p>Of these 4, I think that 2 is clearly the biggest threat. I think 1 can be overcome with a commitment to pluralism, though obviously some beliefs will fall outside of EA.</p><p>In order to avoid 2, I think EA needs to take these questions of community power seriously. The positive impact of EA is a function of its ideas and people yes, but it is also a function of its organisations and institutions - be they formal or informal. Personally, I see a lot of real value in Carla Cremer's suggestion that EA have an <a href=\"https://www.vox.com/future-perfect/23569519/effective-altrusim-sam-bankman-fried-will-macaskill-ea-risk-decentralization-philanthropy\">institutional turn</a> - and not only think about improving the institutional decision-making in EA cause areas, but also within EA itself!</p><p>(As a historical aside, I think the Sunni-Shia split is actually an interesting counterexample to what you raise here. Despite the initial series of battles and conflicts around succession from the Prophet, this didn't stop the Umayyad Caliphate from becoming one of the world's largest empires afterwards, and Islam becoming the world's second largest religion!)&nbsp;</p>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "YkfKfZinsRf4zMyy5", "postedAt": "2023-02-23T19:26:30.339Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I'm not \"pretending to not know what woke means\", I genuinely think it would be constructive for you to define what it is you mean by using it, and by explaining why you think it is a threat to EA.&nbsp;<br><br>Some things I think you could mean:<br>-People who talk a lot about \"positionality\"<br>-People who look at white men distrustfully and assume they have bad intentions<br>-People who talk about diversity and inclusion and virtue signal about said things<br>-People who are part of the \"culture wars\" in the United States&nbsp;<br><br>The problem is that, I genuinely do not know how you define it, and how you think this applies to EA or is some sort of threat to EA.&nbsp;<br><br>Another problem is that you seem to assume you can identify whether or not someone is \"woke\" without actually defining what that means or really knowing the person. I don't think that's fair. I also think you are doing what I notice people on twitter do, which is look at really superficial things like how someone talks or presents themselves online, and think you can categorize them as \"woke\" or \"not-woke\". It's just very polarizing. I actually think you and I agree on a lot more than you would assume but because I disagree with you using \"woke\" language you assume I am \"pro-woke\".&nbsp;</p>", "parentCommentId": "uBh5nsPuoyoojgw6Q", "user": {"username": "Lauren Maria"}}, {"_id": "GtbbFaBmmgmu5uD56", "postedAt": "2023-02-23T19:35:01.776Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>“ The way I see it the ‘woke takeover’ is really just movements growing up and learning to regulate some of their sharper edges in exchange for more social acceptance and political power.”</p>\n<p>I think there is some truth in movements often “growing up” over time and I agree that in some circumstances people can confuse this with “woke takeover”, but I think it’s important to have a notion of some takeover/entryism as well.</p>\n<p>In terms of the difference: to what extent did people in the movement naturally change their views vs. to what extent was it compelled?</p>\n<p>I suppose protest can have its place in fixing a system, but at a certain hard-to-identify point, it essentially becomes blackmail.</p>\n", "parentCommentId": "jfC7yoeHqnbcEpDgx", "user": {"username": "casebash"}}, {"_id": "zbgNC8bosEzJsvvvC", "postedAt": "2023-02-23T19:40:26.949Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>When I think about being part of the movement or not, I'm not asking whether I feel welcomed, valued, or respected. I want to feel confident that it's a group of people who have the values, culture, models, beliefs, epistemics, etc that means being part of the group will help me accomplish more of my values than if I didn't join the group.<br><br>Or in other words, I'd rather push uphill to join an unwelcoming group (perhaps very insular) that I have confidence in their ability to do good, than join a group that is all open arms and validation, but I don't think will get anything done (or get negative things done).<br><br>And to be more bold, I think if a group is trying to be <i>very</i> &nbsp;welcoming, they will end up with a lot of members that I am doubtful share my particular nuanced approach to doing good, and with whom I'm skeptical I can build trust and collaborate because our worldviews and assumptions are just too different.</p>", "parentCommentId": "RoWACAwq7xCvYaXkT", "user": {"username": "Ruby"}}, {"_id": "BNhREExkay3Phw7KP", "postedAt": "2023-02-23T19:44:30.406Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I will admit to having strong downvoted a number of critical posts, while having upvoted others, in order to create an incentive gradient to produce better criticism.</p>\n<p>If we start getting less criticism, then I’ll default towards overvoting criticism more.</p>\n", "parentCommentId": "SmPfaMQe9TaepATcW", "user": {"username": "casebash"}}, {"_id": "gzKq63mit8qCTi2gd", "postedAt": "2023-02-23T19:58:14.151Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I see your point and upvoted, but <em>schism</em> is a pretty loaded word. Not all breakups are schisms, and it's plausible that an amicable parting would allow people to work in a movement where they will be more effective. Sometimes the kids are happier in a fairly good divorce than in a turbulent marriage.</p>\n<p>There are costs to a unified movement. Given the most likely fault lines for a split, what would people would need to compromise on, and do you think they are willing?</p>\n<p>To me, some kind of federalism seems worth thinking about as a way to take stress off some of the fault lines. You can choose to live in Alabama or California while still being American. You can be Baptist or Catholic and still be Christian.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "HsBdpqkksvsbBSqmY", "postedAt": "2023-02-23T20:56:17.996Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I found parts of this 3-month old <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=jWixx3JEurXKPx4eH\">comment</a> by a non-Western trans man writing about the masculinity-femininity divide to be really insightful and prescient.</p><p>Just as many people point to 'toxic masculinity' (which can also be present in women), I think they should also acknowledge the existence of 'toxic femininity' (which can also be present in men). FWIW, I think a lot of activists raised in (somewhat-functioning) democracies are underestimating the dangers of limiting free expression, the dangers of marginalizing people whose features were historically associated with having more power, and the possibility that they might be becoming more sensitive to things that they can otherwise overcome.</p>", "parentCommentId": "sbjkojrfqkNMkRAWC", "user": {"username": "Timothy Chan"}}, {"_id": "GYps7vDw9tRn5LoZC", "postedAt": "2023-02-23T21:50:22.904Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Interesting discussion, but I suggest in part going back to basics. I feel it would be helpful to mentally divide the nature of what is being discussed and at times hastily tossed into this forum into three general &nbsp;topics:</p><p>A. intellectual diversity and an interesting debate space , which helps us all look deeper into &nbsp;the real issues EA was initiated to try to address.</p><p>B. Governance failures and personnel misconduct : financial and legal red cards and suspicions, personnel scandals, examples of bad and very bad behaviour within or on the fringes of a work environment , paid or unpaid.. &nbsp;</p><p>C. Your very personal lives, &nbsp;and your emotional state today and particularly the minute before you hit the Submit button.</p><p>Subject A. &nbsp;is tricky to simultaneously encourage and keep manageable. Approaches (to vigorous debate, intellectual diversity etc..) that have a good track record are group facilitation, membership guidelines, ethics committees etc.</p><p>Subject B is addressed routinely in the rest of the world, through fairly replicable governance measures: rules, sanctions and behavioural norms. Equally applicable to &nbsp;a thinktank or a construction site. &nbsp;This approach is needed even more, and legally required, when it comes to managing money. &nbsp;So for example, having a clear and real separation of roles to avoid a financial conflict of interest in spending donor funds &nbsp;is not a schism - it is an obligation.</p><p>Subject C, in my opinion, does not really belong on a publicly accessible forum, now probably being regularly mined for journalistic content and ammunition for spoilers. Maybe it is needed, but just take it offline into a private forum with the relevant people.</p><p>The author is right to point the trend and risk of schism. &nbsp;We should all be allowed to contribute in territory A - the bigger and more diverse the group the better. Debates on fundamental direction and strategy etc..can improve the outcomes. &nbsp;It would be a pity if a break up happens simply because of insufficient understanding of the rationale for separation of the three topics noted above. In summary, A is what we are all here for, an investment in B enables this to continue, and C is possibly not really forum business.....</p>", "parentCommentId": null, "user": {"username": "Andrew Morton"}}, {"_id": "msaBGt3wyY4Dx2qzA", "postedAt": "2023-02-23T22:08:14.856Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<blockquote><p>The way I see it the ‘woke takeover’ is really just movements growing up and learning to regulate some of their sharper edges in exchange for more social acceptance and political power.</p></blockquote><p>I don't agree with this part of the comment, but am aware that you may not have the particular context that <i>may </i>be informing Geoffrey's view (I say may because I don't want to claim to speak for Geoffrey).&nbsp;</p><p>These two podcasts, one by <a href=\"https://www.nytimes.com/2022/07/08/podcasts/transcript-ezra-klein-interviews-michelle-goldberg.html\">Ezra Klein with Michelle Goldberg</a> and one by the <a href=\"https://www.nytimes.com/2023/01/26/opinion/the-left-purity-politics.html\">NY Times</a>, point to the impact of what is roughly referred to in these podcasts as \"identity politics\" or \"purity politics\" (which other people may refer to as \"woke politics\"). The impact, according to those interviewed, on these movements and nonprofits, has been to significantly diminish their impact on the outside world.&nbsp;</p><p>I also think that it would be naïve to claim that these movements were \"growing up\" considering how long feminism and the civil rights movement have been around. The views expressed in these podcasts also strongly disagree with your claim that they are gaining more political power.</p><p>I think these experiences, from those within nonprofits and movements on the left no less, lend support to what Geoffrey is arguing. Especially considering that the EA movement is ultimately about having the most (positive) impact on the outside world.</p>", "parentCommentId": "jfC7yoeHqnbcEpDgx", "user": {"username": "AndyMorgan"}}, {"_id": "D3aXRiNYgaa9CJdAh", "postedAt": "2023-02-23T23:11:26.519Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<blockquote><p>Effective Altruism as a movement is relatively brand new - we can't afford major schisms or we may not continue as a relevant cultural force in 10-20 years.</p></blockquote><p>If the next year looks anything like the last six months, I do not feel bullish about EA being a relevant (and positive) cultural force in 2033. I hate to say that, but I think it's important for us to be clear-eyed about the current status of the movement—and its likely trajectory—in figuring out how to move forward.</p><p>Sometimes when playing chess, it becomes clear you can't win, and your goal shifts from winning to avoiding a loss. So when you say \"we can't afford major schisms,\" my reaction is that we may not be in a place where we can afford the best option (i.e., not schisming), or to put this in more EA terms, sometimes the most cost-effective interventions are<a href=\"https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1002397\"> unaffordable</a>.</p><p>Since reading this <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/?commentId=PysuQzfdzSBzhBSwm\">comment</a>, I've been thinking about what it would look like for EA to be dying. After all, billions of dollars are committed to EA, many people consider themselves to be EAs, and there are lots of organizations aligned with the movement. Given that, how could EA die? To me, EA dying might look like: (1) limited new funding being committed to EA (or funding that was committed disappearing), (2) the number of people who identify as EAs decreasing, and (3) EA organizations failing. I think we have some <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1\">evidence</a> <a href=\"https://forum.effectivealtruism.org/posts/C89mZ5T5MTYBu8ZFR/regulatory-inquiry-into-effective-ventures-foundation-uk\">for</a><a href=\"https://forum.effectivealtruism.org/posts/5zgxdpNaByWDMjgam/?commentId=EiQ2JgXhrN2tWSpjP\"> 3;</a> from conversations with people, I am guessing we'll start to see (2); and I'm worried that EA is going to have an increasingly hard time finding new funding (plus the demise of FTX alone constitutes (1)). So I'm really worried that EA (as we know it) is dying.</p><p>To perhaps bend this metaphor to its breaking point, unless you think EA definitely <i>isn't</i> dying, it's still sensible to have an <a href=\"https://en.wikipedia.org/wiki/Advance_healthcare_directive\">advanced directive</a> and organ donation plan in place. In other words, I think it's worth considering what a productive schism would look like—and what the likely trajectory of EA sans-schism is—before we rule out the \"divide and conquer\" approach, even if schisming is an outcome we could ideally avoid.</p><p>One thing I remain steadfastly optimistic about is the creativity, brilliance, and motivation of EAs. People in this community really want to improve the world, and I believe we can, but we should take a really hard look at whether our current approach—one of being unified under the EA umbrella—will be the best one going forward.</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "NvJ8KQM4yDWBiAFsj", "postedAt": "2023-02-23T23:20:22.707Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>What is making things non-federal today? There already are, e.g. groups for Christians in EA which have some quite different ideas to the rest of the movement but coexist pretty peacefully. Is there something more that you would want there?</p>\n", "parentCommentId": "gzKq63mit8qCTi2gd", "user": {"username": "Michael_PJ"}}, {"_id": "tFDFokh4c3y8KrhL2", "postedAt": "2023-02-23T23:27:28.375Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Just to add a note of optimism: a) people always take recent news too seriously; and b) many people don't read the forum. It's easy to think that everything is gloom if you spend too much time reading the drama on the forum, but most of reality hasn't changed. We still have thousands of people deeply engaged in doing good and their projects are still going as well as they were before. There are problems, sure, but announcing death is extremely premature IMO.</p>\n", "parentCommentId": "D3aXRiNYgaa9CJdAh", "user": {"username": "Michael_PJ"}}, {"_id": "6kxMXCwkyjvM8a6hk", "postedAt": "2023-02-23T23:49:24.683Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I appreciate your point, but this isn't consistent with my experience. I find that the Forum seems to be more bullish on EA than both EAs and non-EAs I talk to elsewhere/privately.</p><p>[Edit: If you feel like it, I’d also appreciate a response to my substantive points. Is it that:</p><p>(1) Your framework for what it’d look like for EA to be dying is different from mine?</p><p>(2) You accept my framework, but don’t think EA currently meets the criteria I’ve delineated?</p><p>And, separately, do you disagree with my point that even if EA dying is unlikely, we should still make a contingency plan?]</p>", "parentCommentId": "tFDFokh4c3y8KrhL2", "user": {"username": "hobbes"}}, {"_id": "wbs3dAsz5tdds8BHs", "postedAt": "2023-02-24T00:05:27.809Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I think finding out the true state of play here is really important. What signs would we look for a sign of EA movements health that follow the 3 stages you suggested above? Perhaps the rate of sign-ups to the GWWC pledge, or total EAG applications, or people signing up to EA virtual courses? Funding might be easier to track, but the numbers are always going to be skewed by Open Philanthropy, and I don't think that Dustin and Cari are going to go anywhere soon (which might update you slightly toward EA robustness?).</p><p>I guess there might be more failure modes than EA 'collapse', though we ought to watch out for it. This could be a bit of a retrenchment for the movement, where hopefully we can learn from our mistakes, improve institutions, and keep doing good in 2023 and beyond.</p>", "parentCommentId": "6kxMXCwkyjvM8a6hk", "user": {"username": "JWS"}}, {"_id": "Rja3rZcjXCfC6bbAu", "postedAt": "2023-02-24T00:11:48.068Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Thanks for responding. For what it’s worth I personally think OCB should be permanently resigned from a powerful position in EA, and possibly socially distanced. Strong incentives against that type of behavior, especially right now, are extremely important. I’m disappointed with the response from EVF and think it should be far harsher.</p>\n<p>The distinction I’m trying to make is that we shouldn’t assume all powerful people in EA are bad apples as a result of this scandal breaking.</p>\n", "parentCommentId": "FC8T3CBjqmPFe4aZp", "user": {"username": "Wil Perkins"}}, {"_id": "YxtoKfwbvnzXikG6y", "postedAt": "2023-02-24T00:23:57.350Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>In (US-style) federalism, the subunits (US states) have quite a bit of power and autonomy. I don't have to worry myself about what Alabama decides about abortion or education. Being a South Carolinian or a Oregonian is a significant part of one's political identity in a sense.</p>\n<p>So, if for instance, if the \"edgy\" /  \"normie\" divide became a critical fault line, under federalism you might see substantial meta groups focusing on one side of the line or the other with for example their own high-end conferences and internal networking. It's not a rupture because central EA orgs would still exist, but it would do somewhat less.</p>\n<p>It's still a germ of an idea; the basic thought is that there has to be some way to let some steam out of the kettle -- creating some degree of separation -- before the kettle blows up and ruptures.</p>\n", "parentCommentId": "NvJ8KQM4yDWBiAFsj", "user": {"username": "Jason"}}, {"_id": "diooDBdugpuzABMuT", "postedAt": "2023-02-24T00:52:43.020Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>If you indicate to X group, directly or otherwise, that they're not welcome in your community, then most people who identify with X are probably gonna take you at your word and stop showing up. Some people might be like you and be willing to push past the unwelcomeness for the greater good, but these people are rare, and are not numerous enough to prevent a schism.&nbsp;</p><p>Ultimately, you can't make a place welcoming for every single identity without sacrificing things. If the X is \"neo-nazis\", then trying to make the place welcoming for them is a mistake that would drive out everyone else. But if X is like, \"Belgians\", then all you have to do is not be racist towards Belgians. &nbsp;</p>", "parentCommentId": "zbgNC8bosEzJsvvvC", "user": {"username": "titotal"}}, {"_id": "e5m2jusvRsBcmtzfs", "postedAt": "2023-02-24T01:20:11.271Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I'd suggest unrelenting, near-uniform public hatred as a potential failure mode (which != having many enemies or being merely unpopular).  Some degree of other actors being willing to cooperate can be awfully important to effectiveness.</p>\n", "parentCommentId": "wbs3dAsz5tdds8BHs", "user": {"username": "Jason"}}, {"_id": "xs7zu6G8yqtqWgSXo", "postedAt": "2023-02-24T01:21:04.354Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Thanks Wil. I can agree with that.</p>", "parentCommentId": "Rja3rZcjXCfC6bbAu", "user": {"username": "tomrowlands"}}, {"_id": "XtYPoQTozrrnqSrt9", "postedAt": "2023-02-24T02:44:11.749Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I think this post falls short of arguing compellingly for the conclusion.</p><ul><li>It brings 1 positive example of a successful movement that didn't schism early one, and 2 examples of large movements that did schism and then had trouble.<ul><li>I don't think it's illegitimate to bring suggestive examples vs a system review of movement trajectories, but I think it should be admitted that cherry-picking isn't hard for three examples.</li></ul></li><li>There's no effort expended to establish equivalence between EA and its goals and Christianity, Islam, or Atheism at the gears level of what they're trying to do. I could argue that they're pretty different.</li><li>I seriously do not expect that an EA schism would result in bloodshed for centuries. Instead, it might save thousands of hours spent debating online.</li><li>The argument that \"EA is too important\" proves too much. I could just as easily say that because the stakes are so high, we can't afford to have a movement containing people with harmful beliefs, and therefore it's crucial that we schism and focus fresh with people who have True Spirit of EA or whatever.&nbsp;</li></ul><p>This is not something I fault this post for not arguing about , but I'm personally inclined to think that \"longtermist\" EA should not have tried to become a mass movement (which is what the examples described are), and instead should have stayed relatively small and grown extremely slowly. I suspect many people are starting to wonder whether that's true, and if so, people who want a smaller, more focused, weirder, \"extreme\" group of people collaborating should withdraw from the people who aspire for a welcoming, broadly palatable mass-movement, and each group will get out each other's way.&nbsp;<br><br>There are historical reasons for why things developed the way that did, but I think it is clear there are some distinct cultural/wordlview clusters in EA that have different models and values, and aren't united by enough to overcome that. I think that splitting might allow both groups to continue rather than what would likely happen is one group just dissolving, or both groups dissolving except for a core of people who want to argue indefinitely.<br><br>What would convince me against splitting is if no, really, everyone here is united very strongly by some underlying core values and world beliefs, and we can make enough progress on the differences en masse. I'm skeptical, but it's good to say what might convince you.<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ruby"}}, {"_id": "Q5E4XNt4w5atngHnb", "postedAt": "2023-02-24T03:46:25.391Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Wokeism has been a on/off discussion topic in EA for about as long as I can remember.  My woke friends complain that EA is hopelessly anti-woke, and my anti-woke friends complain that EA is hopelessly woke.  The predictions of political schism or ideological takeover keep being made, and keep being false.</p>\n<p>In my opinion, we've already found a \"third option\" which works: the empathy to seek mutual understanding, the philosophical sophistication to critique fashionable ideas, and the willingness to share our perspective even when it seems unpopular.</p>\n", "parentCommentId": "sbjkojrfqkNMkRAWC", "user": {"username": "Aptdell"}}, {"_id": "GAiPLfvqk4S6QsrcG", "postedAt": "2023-02-24T04:45:27.728Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I like this :)</p><p>&nbsp;</p><blockquote><p>In my opinion, we've already found a \"third option\" which works: the empathy to seek mutual understanding, the philosophical sophistication to critique fashionable ideas, and the willingness to share our perspective even when it seems unpopular.<br><br>&nbsp;</p></blockquote>", "parentCommentId": "Q5E4XNt4w5atngHnb", "user": {"username": "Lauren Maria"}}, {"_id": "etC745hLKLjaHtQgT", "postedAt": "2023-02-24T07:20:08.588Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<blockquote><p>Something which I think is sometimes lost in community building discussions is that <i>the stakes we're playing for are extremely high.</i> My motivation to join EA was primarily because I saw major problems in the world, and people that were extremely dedicated to solving them. We are playing for the future, for the survival of the human race.&nbsp;</p></blockquote><p>&nbsp;</p><p>Yeah, thanks for this post. I got a bit invested in some of the recent discussions here. Then I looked on my \"EA to do list\" (which is long, has very little to do with the recent situation, and certainly nothing to do with sh*tstorming on the forum) and I realized I lost focus.&nbsp;</p><p>So I don't know if we are going to split or not, I'm leaving it to community builders, it's not my focus area. Yes or no, my \"to do list\" stays the same.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Liv"}}, {"_id": "jmkooAmYrcse6ZEkz", "postedAt": "2023-02-24T08:02:48.947Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Thanks for this Lauren I was thinking the same thing. Using labels to 'us and them' people isn't useful, and I think that the word \"woke\" can mean so many different things that I think it's not particularly useful.</p><p>I think it's better to name the specific things that you are concerned about, rather than use vague labels like \"woke\"</p>", "parentCommentId": "AhkpqBPkKqTSgBw9D", "user": {"username": "NickLaing"}}, {"_id": "XwkWqX4kn9yCyTALy", "postedAt": "2023-02-24T08:53:32.731Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I don't agree with any of your criteria for \"death\". All of those sound totally survivable. \"EA exits its recent high-growth phase\" is very different from dying.</p>\n<p>I would modify them to:</p>\n<ol>\n<li>Significant <em>year-on-year</em> decreases in funding</li>\n<li>Significant <em>year-on-year</em> decreases in self-identifying EAs</li>\n</ol>\n<p>i.e. we transition to a negative growth regime and stay there.</p>\n<p>And I think we could survive a lot of organizational collapse so I wouldn't even include that.</p>\n", "parentCommentId": "6kxMXCwkyjvM8a6hk", "user": {"username": "Michael_PJ"}}, {"_id": "97tWPDgcrumF9DJAk", "postedAt": "2023-02-24T08:59:52.233Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Okay, but different groups and orgs can already have different norms today, right? Nobody is enforcing conformity. The worst that can happen is that CEA can ban you from EAG, so I guess yes it would be nice to have someone else running conferences so you could go to those?</p>\n<p>I'm not playing dumb here, I genuinely find it confusing in what ways people feel they are being coerced by a central power in EA.</p>\n", "parentCommentId": "YxtoKfwbvnzXikG6y", "user": {"username": "Michael_PJ"}}, {"_id": "2xQ6MmWSbC9a7R2Hx", "postedAt": "2023-02-24T10:55:12.322Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>As far as I can tell, you can't actually set up notifications for someone's comments, only posts. Are you suggesting that people are using some external browser extension specific to your comments? I find your notifications theory to be extremely unlikely and borderline conspiratorial.&nbsp;</p><p>A more likely explanation is that a lot of people don't agree with your opinions.&nbsp;</p>", "parentCommentId": "bHib3AKqsBZJFhXz2", "user": {"username": "titotal"}}, {"_id": "MBGzAexnWC9HmgqSq", "postedAt": "2023-02-24T11:53:09.195Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Geoffrey, or anyone really, can you please define wokeness?&nbsp;</p><p>I fail to see how EA‘s vague opposition to being anti-woke in partisan culture wars are anything more than internecine <a href=\"https://consilienceproject.org/the-endgames-of-bad-faith-communication/#open-society/\">credible threats</a> to open society. As a neurodivergent <s>and self-identified Black American</s> EA who was moved by and still respects your article on viewpoint <a href=\"https://quillette.com/2017/07/18/neurodiversity-case-free-speech/\">and</a> neurodiversity but pragmatically votes on the left as a transpartisan because I don't see another middle way that isn't omnicidal?</p><p>With genuine respect, I find the blanket dismissals of wokenness to be extremely inflammatory and ineffective in eliciting the calm and respectful pushback from people who &nbsp;want to break new ground that you/EA/we(?) are looking for.&nbsp;</p><p>Also, thank you, Lauren, Nick and others for bringing attention to this.&nbsp;</p>", "parentCommentId": "jmkooAmYrcse6ZEkz", "user": {"username": "Chris Gatewood"}}, {"_id": "NprbmS9cjGgxniHaE", "postedAt": "2023-02-24T13:38:22.044Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Glad to hear that. I noticed myself losing focus too - a big part of why I wrote this post.</p>\n<p>I wish you luck on your to do list, and as a community builder well… we’ll do our best. :)</p>\n", "parentCommentId": "etC745hLKLjaHtQgT", "user": {"username": "Wil Perkins"}}, {"_id": "Eu2EgpEqzJejdjmcF", "postedAt": "2023-02-24T23:30:38.121Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>synonyms might be \"SJW\" or \"DEI\".</p>\n", "parentCommentId": "kTHNTN7gSCnHSB9xp", "user": {"username": "River"}}, {"_id": "uuYNuSK2goQ2GqG2Q", "postedAt": "2023-02-25T19:37:12.638Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>Thanks, but that doesn't actually help me engage with the objections of those who are afraid of wokism (or SJW, or DEI) weakening the movement, because each of those terms can mean so many different things.&nbsp;</p><p>A sampling of ideas that seem like they could be included under the umbrella of \"wokism\" in an EA context:</p><ul><li>\"Catering at EA events should be vegan\"</li><li>\"EA spaces should be welcoming for trans people\"</li><li>\"EA would be stronger if EAs were less homogenous\"&nbsp;</li><li>\"Reports of sexual assault and harassment should be taken seriously\"</li><li>\"Racism, including so-called 'scientific' racism, is a scourge\"</li></ul><p>As is probably evident from my comment history, I do happen to agree with all of these assertions. But I would be interested in engaging respectfully with someone who didn't. What I can't do is meaningfully respond to the idea that wokism, undefined, is threatening EA.</p><p>(edited to add - &nbsp;if anyone disagree voting would be willing to tell me what they disagree with, I would appreciate it)</p>", "parentCommentId": "Eu2EgpEqzJejdjmcF", "user": {"username": "britomart"}}, {"_id": "qq8oGdLS4E8GjXSGk", "postedAt": "2023-02-26T01:52:28.710Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I think part of the difficulty here is that \"wokism\" seems to refer to a cluster of ideas and practices that seem to be a genuine cluster, but don't have especially clear boundaries or a singular easy definition.</p>\n<p>What I do notice is that none of the ideas you listed, at least at the level of abstraction at which you listed them, are things that anyone, woke or anti-woke or anywhere in between, will disagree with. But I'll try to give some analysis of what I would understand to be woke in the general vicinity of these ideas. Note that I am not asserting any normative position myself, just trying to describe what I understand these words to mean.</p>\n<p>I don't think veganism really has much to do with wokism. Whatever you think about EA event catering, it just seems like an orthogonal issue.</p>\n<p>I suspect everyone would prefer that EA spaces be welcoming of trans people, but there may be disagreement on what exactly that requires on a very concrete level, or how to trade it off against other values. Should we start meetings by having everyone go around and give their pronouns? Wokism might say yes, other people (including some trans people) might say no. Should we kick people out of EA spaces for using the \"wrong\" pronouns? Wokism might say yes, other might say no as that is a bad tradeoff against free speech and epistemic health.</p>\n<p>I suspect everyone thinks reports of assault and harassment should be taken seriously. Does that mean that we believe all women? Wokism might say yes, others might so no. Does that mean that people accused should be confronted with the particular accusations against them, and allowed to present evidence in response? Wokism might say no, others might say yes, good epistemics requires that.</p>\n<p>I'm honestly not sure what specifically you mean by \"so-called 'scientific' racism\" or \"scourge\", and I'm not sure if that's a road worth going down.</p>\n<p>Again, I'm not asserting any position myself here, just trying to help clarify what I think people mean by \"wokism\", in the hopes that the rest of you can have a productive conversation.</p>\n", "parentCommentId": "uuYNuSK2goQ2GqG2Q", "user": {"username": "River"}}, {"_id": "r9tuzBhSpshhtkSrE", "postedAt": "2023-02-27T07:13:50.505Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I consider myself an active EA, but you provide very little factual information in your introduction, to me almost zero anchoring as to what proto-schisms are you referring to..?\nSome candidates seems long termism vs. confidently/obviously good charity operations;\ns-risks × x-risks or hierarchical vs. decentalized ops. I have no clue if/which of those you find painstaking or risky for the continuation of the community.–?</p>\n", "parentCommentId": null, "user": {"username": "Martin (Huge)  Vlach"}}, {"_id": "cFC8xriqCwiQnYejJ", "postedAt": "2023-02-27T15:06:05.511Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<blockquote>\n<blockquote>\n<p>\"Catering at EA events should be vegan\"</p>\n</blockquote>\n<p>none of the ideas you listed, at least at the level of abstraction at which you listed them, are things that anyone, woke or anti-woke or anywhere in between, will disagree with</p>\n</blockquote>\n<p>This is a tangent, but raising my hand as someone who does disagree that EA events should generally have only vegan food.  I think having good vegan food available is very important, and think you can make a <a href=\"https://web.archive.org/web/20150812062856/http://theunitofcaring.tumblr.com/post/126310876481/preference-accommodation-problems\">good case</a> for excluding meat, but the more you constrain the menu the harder it is for people to find the food they need.  This is especially a problem for longer or residential events, where the downsides of a limited diet compound and going out to get different food can be logistically challenging.</p>\n", "parentCommentId": "qq8oGdLS4E8GjXSGk", "user": {"username": "Jeff_Kaufman"}}, {"_id": "BpePtNESpEGv53buE", "postedAt": "2023-02-27T21:34:48.536Z", "postId": "5uZiBK4h5WcccjA2R", "htmlBody": "<p>I agree on food. I was careless with my qualifications, sorry about that.</p>\n", "parentCommentId": "cFC8xriqCwiQnYejJ", "user": {"username": "River"}}]