[{"_id": "4oHtGdMPjjL8gi47L", "postedAt": "2023-01-13T13:06:17.787Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p><strong><u>Update:</u></strong></p><p>FLI have released a full statement on their website <a href=\"https://futureoflife.org/rejection_statement/\">here</a>, and there is an <a href=\"https://forum.effectivealtruism.org/posts/LvwihGYgFEzjGDhBt/fli-faq-on-the-rejected-grant-proposal-controversy\">FAQ post</a> on that statement where discussion has mostly moved to on the Forum. I will respond to these updates there, and otherwise leave this post as-is (for now).</p><p>However, it looks like an 'ignorance-based' defence is the correct interpretation of what happened here. I don't regret this post - I still think it was important, and got valuable information out there. I also think that <a href=\"https://forum.effectivealtruism.org/posts/dPmdkjaNGFQHfWhxQ/linkpost-nick-bostrom-s-apology-for-an-old-email?commentId=Ti5djfYsKdr9KqeCJ\">emotional responses should not be seen as 'wrong'</a>. Nevertheless, I do have some updating to do, and I thank all commenters in the thread below.</p><p>I have also made some retractions, with explanations in the footnotes</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><i><strong>Epistemic Status: </strong>Unclear, but without much reason to dispute the factual case presented by Expo. As I wrote this comment, an ignorance-based defence seemed less and less convincing, and consequently my anger rose. I apologise if this means the post is of a lower tone than the forum is used to. I will also happily correct or retract this post partially or fully if better evidence is provided.</i></p><p>[<strong>Clarity Edit:</strong> FLI refers to the <a href=\"https://futureoflife.org/\">Future of Life Institute</a> (FLI) not the <a href=\"https://www.fhi.ox.ac.uk/\">Future for Humanity Institute</a> (FHI) which has caused some confusion below. Max Tegmark is President of the former, Nick Bostrom is Director of the latter. The two dramas today are not related, other than longtermist organisations needing better acronyms]</p><p><strong>Some other things noted for further detail from the article:</strong></p><ul><li>I have no reason to dispute the claim of <i>Nya Dagbladet </i>to be a 'pro-nazi' site<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefsdu5fext56o\"><sup><a href=\"#fnsdu5fext56o\">[1]</a></sup></span>&nbsp;(<i>clarifying edit/correction in footnote)&nbsp;</i> - users with a bigger knowledge of the Swedish media ecosphere might be able to clarify, but this claim seems to be trustworthy.</li><li>Expo claims that a promise from FLI for a grant is in a written application to the County Administration of Dalarna in Sweden with a signature by Tergmark, despite Tegmark initially denying the claim - they now have a picture of Tegmark sending a letter of intent, which unless forged, looks 100% genuine.</li><li>A response from Dentons (a US law-firm representing FLI) <s>seems to confirm the decision to fund </s><i><s>Nya Dagbladet&nbsp;</s></i><s> had been made, but there is now no promise from FLI and not likely to be</s>&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefigbz81lkzoi\"><sup><a href=\"#fnigbz81lkzoi\">[2]</a></sup></span>. They have not responded to Expo since the initial email exchange. It is unclear why FLI decided to make the grant initially, and later change their minds.</li><li>Tegmark's brother, Per, seems to be affiliated with the Populist, anti-vax right in Sweden (note,this is only after a very cursory Google search). The reasons this seems to be relevant is that Per has been a contributing writer for <i>Nya Dagbladet </i>in recent years.</li></ul><p><strong>My understanding:</strong></p><ul><li>In August/September, FLI promised funding in a letter of intent for $100k to <i>Nya Dagbladet&nbsp;</i> so they could set up their foundation.&nbsp;</li><li>In October, the promise of funds seems to have been secure enough for the Dalarna County Administrative Board to register the foundation.</li><li>In December, Expo (presumably investigating the new <i>Nya Dagbladet</i> Foundation) follow the money back to FLI and question Tegmark</li><li>Tegmark initially denies having done so, &nbsp;but Expo have the signed letter. Eventually Dentons, a law firm, respond for FLI and deny that any funds had been released to <i>Nya Dagbladet</i>, and that this decision had been made before Expo got in contact with Tegmark/FLI. They have not responded since.</li></ul><p>I cannot speak to any legal questions here, or liability that FLI might face, though I'm not sure why there would be.</p><p>There are, however, massive reputational issues at stake. The EA movement is under intense scrutiny right now, and this seems to be another case of <s>a major actor</s> a well-known actor in our movement doing something that has massively poor consequences for the public perception of EA unless they can explain why. Critically, <i>Nya Dagbladet</i> &nbsp;while small seems to be <s>openly</s><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefpfq43y94oke\"><sup><a href=\"#fnpfq43y94oke\">[3]</a></sup></span>&nbsp;far-right, supporting anti-vaccination sentiment and holocaust denial. I am struggling to charitably interpret how funding them would improve the future of humanity, or do the most good for the world right now.</p><p>I think it would be prudent for someone from FLI to explain what happened here.</p><p>If not, people both inside and outside the EA movement, be they supporters or critics, may <s>correctly</s>&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefbscsaik06y\"><sup><a href=\"#fnbscsaik06y\">[4]</a></sup></span>&nbsp;be led to infer that <s>a major organisation in</s> a well-known organisation aligned with EA promised funds to an openly politically far-right organisation, knowing what they stand for. <strong><u>That is not what EA should stand for, and to the extent that it does, I would want no part in it.</u></strong></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnsdu5fext56o\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefsdu5fext56o\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Many seem to be taking the 'pro-nazi' as a crux. That was the characterisation Expo gave, and I went with their framing as default. Depending on your definition of 'pro-nazi' this might be false, <i>Nya Dagbladet</i> don't seem to openly support the persecution of Jews or a white ethnostate openly that I could see - but it'd be very difficult for any publication to do so openly. In the Expo article, there's a sidebar with two of the most damning pieces of content.&nbsp;</p><p>I would at least characterise them as far-right/populist reactionary/ethno-nationalist, which even if not as morally horrifying as openly 'pro-nazi', is something which I believe to be strongly antithetical to what EA is and should stand for. But I think I will elaborate on my thoughts on EA/politics in a future post, rather than here. In any case, I think the issue is why this grant was considered in the first place given the political affiliation of the recipients, rather than whether those political affiliations are less far-right than the Expo article implies.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnigbz81lkzoi\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefigbz81lkzoi\">^</a></strong></sup></span><div class=\"footnote-content\"><p>[<strong>Edit:</strong> I think that this claim is false. No grant was ever confirmed, and the FAQ states that the 'letter of intent' was a specific request by <i>Nya Dagbladet &nbsp;</i>and not part of FLI's usual grant-making process]</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnpfq43y94oke\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefpfq43y94oke\">^</a></strong></sup></span><div class=\"footnote-content\"><p>[<strong>Edit:</strong> I retract the use of 'openly' here, they seem to openly be populist right, but don't make their far-rights leanings immediately obvious]</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnbscsaik06y\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefbscsaik06y\">^</a></strong></sup></span><div class=\"footnote-content\"><p>[<strong>Edit:</strong> I retract the use of 'correctly' here - I meant it to refer to a counterfactual case where the worst possible case was true, but I think it is probably more confusing than useful]</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "ukS6CbSiyMGvWBo4z", "postedAt": "2023-01-13T14:42:03.372Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks for flagging this! I agree it looks quite concerning, on several fronts.</p><p>Minor nit: I read the title as saying that <i>FLI</i> <i>has claimed</i> to have offered funding to a far-right org, whereas in fact what has happened is that <i>someone else has claimed</i> that FLI has done this. I think replacing \"claimed\" with \"alleged\" or similar in the title would help with this.</p>", "parentCommentId": null, "user": {"username": "willbradshaw"}}, {"_id": "3jy3fXKcDvztEEgub", "postedAt": "2023-01-13T14:42:19.835Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote><p>and this seems to be another case of a major actor in our movement doing something that has massively poor consequences for the public perception of EA unless they can explain why</p></blockquote><p>My only substantive disagreement with this comment (which I upvoted) is that I don't think FLI is a major actor in EA; they've always kind of done their own thing, and haven't been a core player within the EA community. I view them more as an independent actor with somewhat aligned goals.</p>", "parentCommentId": "4oHtGdMPjjL8gi47L", "user": {"username": "willbradshaw"}}, {"_id": "CnZibgrC4DLqbdCQB", "postedAt": "2023-01-13T14:46:11.576Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p><i>The following is my personal opinion, not CEA's.</i></p><p>If this is true it's absolutely horrifying. &nbsp;FLI needs to give a full explanation of what exactly happened here and I don't understand why they haven't. If FLI <i>did</i> knowingly agree to give money to a neo-Nazi group, that’s despicable. &nbsp;I don't think people who would do something like that ought to have any place in this community.</p>", "parentCommentId": null, "user": {"username": "Shakeel Hashim"}}, {"_id": "fqajgySDyeZLavcwM", "postedAt": "2023-01-13T14:49:13.584Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Yes, that seems better.</p>", "parentCommentId": "ukS6CbSiyMGvWBo4z", "user": {"username": "Jens Nordmark"}}, {"_id": "3cXuEspuNDXDXHW9m", "postedAt": "2023-01-13T15:13:57.085Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I just realized that I had confused them with FHI.</p>", "parentCommentId": "3jy3fXKcDvztEEgub", "user": {"username": "timunderwood"}}, {"_id": "cbeEnzbx5ttNCaKiD", "postedAt": "2023-01-13T15:18:53.287Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This comment is a community service.</p>", "parentCommentId": "4oHtGdMPjjL8gi47L", "user": {"username": "jpaddison"}}, {"_id": "4N2bfpJKCSJyeyzqX", "postedAt": "2023-01-13T15:28:57.532Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I would be helpful for OP to write out something like \"Future of Life Institute, run by MIT professor Max Tegmark\" in the original post.</p>", "parentCommentId": "3cXuEspuNDXDXHW9m", "user": {"username": "Jason"}}, {"_id": "YBoxa5S3CuNQgYAFs", "postedAt": "2023-01-13T15:29:44.634Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>On that note, I just realised nobody has actually written the full name of the organization anywhere on this page!</p><p>For anyone who's confused or unsure: we're talking about the <a href=\"https://futureoflife.org/\">Future of Life Institute</a>.</p>", "parentCommentId": "3cXuEspuNDXDXHW9m", "user": {"username": "willbradshaw"}}, {"_id": "NCZX6Ac72rNbDAz2L", "postedAt": "2023-01-13T15:38:38.239Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Done</p>", "parentCommentId": "4N2bfpJKCSJyeyzqX", "user": {"username": "Jens Nordmark"}}, {"_id": "BKPijscdchJenzaMR", "postedAt": "2023-01-13T15:43:41.283Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks Will, Jason, tim.</p><p>I've added an edit to the top of my comment to clarify we're talking about FLI, not FHI (cause X - better EA acronyms). I've also tweaked the language around FLI being a \"major actor\" in the EA space, though I feel there are arguments on the other side, given:</p><ul><li>Tegmark being on a <a href=\"https://80000hours.org/podcast/episodes/max-tegmark-ai-and-algorithmic-news-selection/\">recent 80k podcast</a></li><li>The FLI <a href=\"https://jobs.80000hours.org/?refinementList%5Borg_data%5D%5B0%5D=Future%20of%20Life%20Institute\">is advertised</a> on the 80k job board</li><li>I remember seeing an FLI booth at EAG 2022 London</li><li>There is <a href=\"https://forum.effectivealtruism.org/topics/future-of-life-institute\">an FLI topic</a> on the EA Forum Wiki, which notes funding they received from OpenPhil</li></ul><p>one could perhaps be forgiven for viewing them as closely involved in the EA movement directly, though I see they're probably more independent with some highly aligned goals.&nbsp;</p><p>I also want to say, if people from FLI are reading this, I don't want to be read as attacking any of you directly though I can accept I might be read that way. Emotions are running high on the forum right now, incuding my own, and I would welcome your thoughts either as a reply in this post or as a private message.</p>", "parentCommentId": "YBoxa5S3CuNQgYAFs", "user": {"username": "JWS"}}, {"_id": "wLkaFGwvPbFmM9uvK", "postedAt": "2023-01-13T16:31:52.733Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I had a look at the Nya Dagbladet website. My quick impression is that it looks like a somewhat milder and less sensationalist version of Breitbart News. The top stories were (and I only read the headlines and leads): (1) the newspaper itself being close to bankruptcy due to its bank account having been frozen, (2) an ex-CEO of Barclays' being connected to Jeffrey Epstein, (3) high levels of shoplifting in Sweden, (4) record number of calls to a national child abuse hotline in Sweden, (5) a Swedish pediatrician's having been subjected to hate due to a study of his which suggested that the risk of children needing emergency care for COVID-19 was low, (6) more on the frozen bank account, (7) Kiersten Hening getting a $100K settlement after BLM kneeling controversy and (8) EU and NATO collaborating more closely.</p>\n<p>I can't imagine a good rationale for giving a grant to Nya Dagbladet or associated ventures, and can only assume that FLI agreed to give the grant based either on material provided by Nya Dagbladet itself and/or other people (but without doing any independent review).</p>\n<blockquote>\n<p>Tegmark's brother, Per, seems to be affiliated with the Populist, anti-vax right in Sweden (note,this is only after a very cursory Google search). The reasons this seems to be relevant is that Per has been a contributing writer for Nya Dagbladet in recent years.</p>\n</blockquote>\n<p>Do you have a source for this? I wasn't able to find anything myself with a quick search.</p>\n", "parentCommentId": "4oHtGdMPjjL8gi47L", "user": {"username": "Erich_Grunewald"}}, {"_id": "her2Cft2GL3iW4JZC", "postedAt": "2023-01-13T17:37:24.698Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Yeah, to be clear I also don't think EA can just say \"nothing to do with us\" here, there's clearly enough overlap and cross-pollination to be relevant. I just think this is significantly different from if this happened with, say, CEA or OpenPhil.</p><p>I think something like your modified language is about right.</p>", "parentCommentId": "BKPijscdchJenzaMR", "user": {"username": "willbradshaw"}}, {"_id": "9SAqvL3bTotDhpRoZ", "postedAt": "2023-01-13T17:38:48.587Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote><p>Do you have a source for this? I wasn't able to find anything myself with a quick search.</p></blockquote><p>One source is the Expo article itself:</p><blockquote><p>The only connection that Expo has been able to establish between Max Tegmark and the extreme right-wing media platform Nya Dagbladet is in the form of Tegmark’s brother, the journalist Per Shapiro, who for the past few years has been a recurring writer for Nya Dagbladet. Shapiro also runs the conspiracy theory-promoting podcast Folkets radio, whose episodes are presented on Nya Dagbladet’s website under the heading “radio reports”. Max Tegmark has, himself, appeared on his brother’s podcast. Whether this connection is significant with regards to the promise of funding from Max Tegmark and the Future of Life Institute to Nya Dagbladet is one of the questions we have been trying to put to them, but neither Max Tegmark nor his brother Per Shapiro have commented.</p><p>Shapiro told Expo that he is happy to answer questions concerning his journalism, but that he does not want to answer questions concerning whether he has been involved in contacts between Nya Dagbladet and FLI.</p></blockquote>", "parentCommentId": "wLkaFGwvPbFmM9uvK", "user": {"username": "willbradshaw"}}, {"_id": "ZXWF3peLNXBhuqNiq", "postedAt": "2023-01-13T17:46:57.725Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "9SAqvL3bTotDhpRoZ", "user": {"username": "Erich_Grunewald"}}, {"_id": "aQHKF5YJ7EukAtTtp", "postedAt": "2023-01-13T18:34:58.747Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote><p>Tegmark initially denies having done so, &nbsp;but Expo have the signed letter.</p></blockquote><p>Is this sentence what you intended to type, &nbsp;JWS? I'm confused as to what letter Expo signed.</p>", "parentCommentId": "4oHtGdMPjjL8gi47L", "user": null}, {"_id": "haS2gNBn3ckdeoCJQ", "postedAt": "2023-01-13T18:40:10.289Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Expo <i>possess</i> the signed letter.</p>", "parentCommentId": "aQHKF5YJ7EukAtTtp", "user": {"username": "willbradshaw"}}, {"_id": "Y5r8EcrCnwuhfMBYP", "postedAt": "2023-01-13T22:53:01.651Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Agree.</p>", "parentCommentId": "CnZibgrC4DLqbdCQB", "user": {"username": "Daniel_Eth"}}, {"_id": "fSKg9n4P4YFyi282k", "postedAt": "2023-01-13T23:11:46.000Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>With a little generosity/trust in Expo's article and reading between the lines, it’s good to flag the squalid character of Tegmark’s choices:</p><ol><li>It seems hard not to guess that (&gt;50%?) Tegmark rescinded his offer to the fascists, because Expo reached out and discovered it.&nbsp;</li><li>With more certainty, Tegmark probably distributed $100K in funds solely because of his brother and family, this is terrible for all sorts of reasons, and undermines and is dangerous for the longtermist funding environment and EA overall.</li><li>The squalid, low integrity interactions, where Tegmark flat out lies when confronted, is then immediately caught, and then there's a wobbly game of back and forth between his board, and ultimately pays a lawyer—why? It's clownish, teenage-like.</li></ol><p>This is important because, in a deep sense, the various side hustles and influencers currently entrenching themselves in the EA culture, can't be dislodged with this sort of behavior.</p>", "parentCommentId": null, "user": {"username": "Two riders were approaching"}}, {"_id": "WorDxPJyRuGuLTA45", "postedAt": "2023-01-13T23:32:10.389Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>As for point one, I suppose it might be that FLIs board would not allow the transaction. I don't know about FLIs governance but the org is presumably not supposed to be his personal wallet.</p>\n", "parentCommentId": "fSKg9n4P4YFyi282k", "user": {"username": "Jens Nordmark"}}, {"_id": "sDMKq8tRqvjwA6ozj", "postedAt": "2023-01-13T23:41:58.765Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>(Sort of starting another thread here), based on my knowledge of how effective, reasonable boards function, I think there is a good chance there would be no governance you are describing for a number of reasons, and such governance when it occurs is usually performative. More subtly, this is not a defect, this is what should be done and how things are done in practice.</p><p>My guess is that this would have gone through (80%). In this case, having a strong singular founder and a billionaire donor increases the chances this goes through. Tegmark's other communications choices, add to my sense this (I don't have time to elaborate, they aren't severe, but suggest a low sense of discipline and a sense of personal esteem).</p><p>I could be wrong (contrary evidence that would change my mind would be past actions or an unusually strong board member).</p>", "parentCommentId": "WorDxPJyRuGuLTA45", "user": {"username": "Two riders were approaching"}}, {"_id": "8qdu6nCwuYDDfGFEm", "postedAt": "2023-01-13T23:46:38.208Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Yeah, I moved to 95% of \"no governance action that would stop a high effort by Tegmark to execute this grant\", after checking the website.&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/dyboijtx7gzuezhafi2r.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/pzwvhzjx41nyeqzpm2fm.png 180w, https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/ivkmnbxfmtanr0dvfev9.png 360w, https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/g2hanre40svoiozfmwlw.png 540w, https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/lklsdehzyqxfmtexzhsr.png 720w, https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/ec3zuqm2awcas9rpjow9.png 900w, https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/kr9rpdwni4ntmod0lrxz.png 1080w, https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/zs1wnunjns1n564it2hf.png 1260w, https://res.cloudinary.com/cea/image/upload/v1673653601/mirroredImages/8qdu6nCwuYDDfGFEm/dop7n2nzd9daravzomq6.png 1440w, https://res.cloudinary.com/cea/image/upload/v1673653601/mirroredImages/8qdu6nCwuYDDfGFEm/dfe8geaaoccxao2dhffy.png 1620w, https://res.cloudinary.com/cea/image/upload/v1673653600/mirroredImages/8qdu6nCwuYDDfGFEm/ghhlsakgocrusaacm6ay.png 1725w\"></figure>", "parentCommentId": "sDMKq8tRqvjwA6ozj", "user": {"username": "Two riders were approaching"}}, {"_id": "AsBKNRrh6TKksQfwa", "postedAt": "2023-01-14T01:11:09.224Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I wonder if anyone at FLI was ever planning to actually make the grant, or whether the intent was to simulate an intent to grant in order to deceive the Dalarna County Administrative Board into register the Nya Dagbladet Foundation. Not that either would be remotely acceptable.</p>\n<p>If a nonprofit is associated in any way with Elon Musk, some journalist is probably digging into that organization's 990. I wonder what the plan on that front was if the grantmaking intent was actually there...</p>\n", "parentCommentId": "4oHtGdMPjjL8gi47L", "user": {"username": "Jason"}}, {"_id": "wZxBFd5tjzEyQpuT9", "postedAt": "2023-01-14T01:21:22.267Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Governance pro tip: Husband and wife should <em>not</em> have two seats on a five-member board of any org that solicits donations from the public. Even if you disclose it on your 990, as FLI did.</p>\n<p>Even worse, it appears to be the president and treasurer!</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "qKHvsuSYfLwExxGbL", "postedAt": "2023-01-14T01:37:34.263Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Hi Shakeel,</p>\n<p>Thanks for this. I agree with your post and upvoted it.</p>\n<p>However, I do also wonder if they are following what seems to be a common theme in EA crisis comms recently, which is to say as little as possible (presumably on the basis of legal advice). You wrote about this here: <a href=\"https://forum.effectivealtruism.org/posts/Et7oPMu6czhEd8ExW/why-you-re-not-hearing-as-much-from-ea-orgs-as-you-d-like\">https://forum.effectivealtruism.org/posts/Et7oPMu6czhEd8ExW/why-you-re-not-hearing-as-much-from-ea-orgs-as-you-d-like</a></p>\n<p>I agree with you that just about any comment or explanation from FLI would seem to help, and that passing the email exchange with Max over to Denton's seems to make the situation worse (slower responses, less full responses, bad optics etc.).</p>\n<p>As an outsider (i.e. with no access to the legal advice or internal discussions at any of these orgs), I wonder how the legal risk is being weighed against the reputational risk in EA crisis comms at the moment. It seems like there is almost no communication coming out from EA orgs and leaders, which presumably is very legally safe but can have very damaging reputational consequences.</p>\n<p>I expect you're constrained in what you can say in response to this but, candidly, I think it's important to note that CEA itself is choosing public silence, albeit about a different issue. Accordingly, I was surprised to see you posting (in a personal capacity) about another org needing to give a full explanation and you not understanding why they haven't, and especially in such strong terms. CEA's example probably influences a lot of other orgs within EA.</p>\n<p>Is there something I am missing on this? Maybe that the FTX situation is sui generis?</p>\n", "parentCommentId": "CnZibgrC4DLqbdCQB", "user": {"username": "jlewars"}}, {"_id": "RvJadJ3MSSQxc2jJF", "postedAt": "2023-01-14T01:51:07.842Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This scenario crossed my mind as well. Seems weird how Tegmark appears to have expected this to not attract attention, regardless of intent to carry out the transaction. This story is almost as weird as it's bad.</p>", "parentCommentId": "AsBKNRrh6TKksQfwa", "user": {"username": "Jens Nordmark"}}, {"_id": "c99jdJ2B9M7wyxmt2", "postedAt": "2023-01-14T01:55:55.393Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This seems like a well-informed take, thanks.</p>", "parentCommentId": "sDMKq8tRqvjwA6ozj", "user": {"username": "Jens Nordmark"}}, {"_id": "fvi2PmnAsw6uKB3EK", "postedAt": "2023-01-14T02:53:06.675Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Good to know what the typical spread is like.</p><p>These are some of the incidents that article cites as being representative of Nya Dagbladet's problems, are they as described?</p><blockquote><p>On its website, Nya Dagbladet publishes right-wing extremist content such as the racist myth of an ongoing “population replacement”, Holocaust revisionism, claims that Muslims are attempting to conquer Europe, and conspiracy theories <a href=\"https://expo.se/2021/03/mobiliseringen-infor-coronaprotesten\">related to the covid-19</a> pandemic.</p></blockquote><blockquote><p>For several years, Nya Dagbladet has also had a <a href=\"https://expo.se/2022/03/alternativmedier-sprider-kremls-logner\">pro-Russian orientation</a>. In September, the platform <a href=\"https://www.logically.ai/articles/double-check-nya-dagbladet-publishes-fake-rand-document-about-ukraine\">published an article</a> based on a fake report incorrectly said to have been produced by an American think tank. The article became notorious after it was shared by the Embassy of Russia in Sweden.</p></blockquote>", "parentCommentId": "wLkaFGwvPbFmM9uvK", "user": {"username": "MakoYass"}}, {"_id": "3CQAZR2j9GrsaNNq7", "postedAt": "2023-01-14T05:18:13.822Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Hi Jack — reasonable question! When I wrote this post I just didn't see what the legal problems might be for FLI. With FTX, there are a ton of complications, most notably with regards to bankruptcy/clawbacks, and the fact that actual crimes were (seemingly) committed. This FLI situation, on face value, didn't seem to have any similar complications — it seemed that something deeply <i>immoral</i> was done, but nothing more than that. <a href=\"https://forum.effectivealtruism.org/posts/5vFmMXWsh6PaYjqab/linkpost-fli-alleged-to-have-offered-funding-to-far-right?commentId=AsBKNRrh6TKksQfwa\">Jason's comment</a> has made me realise there might be something else going on here, though; &nbsp;if that is the case then that would make the silence make more sense. I do still think it's very weird that FLI hasn't condemned Nya Dagbladet though — CEA did, after all, make it very clear very quickly what our <a href=\"https://www.centreforeffectivealtruism.org/blog/statement-on-recent-events\">stance on SBF</a> was.</p>", "parentCommentId": "qKHvsuSYfLwExxGbL", "user": {"username": "Shakeel Hashim"}}, {"_id": "JG4xB8xtwaQhgvLZ4", "postedAt": "2023-01-14T05:54:48.815Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Yeah, no, this story is not overall plausible and I would bet at better than 50-50 odds that there's a major misrepresentation here regarding what happened. Option 1 is that a grant was approved pending due diligence, then pulled during the due diligence process. That would be mildly embarrassing, and would probably imply a grant evaluator somewhere didn't do their job, but it wouldn't be the scandal that this purports to be. Option 2 is that the letter of intent is an outright forgery.</p>", "parentCommentId": null, "user": {"username": "jimrandomh"}}, {"_id": "4G5DjjFizjhHcjqR9", "postedAt": "2023-01-14T10:26:30.953Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Edit: I missed Jason's phrase about soliciting donations from the public. I don't think that it matters personally, and I wasn't aware that OpenPhil <em>isn't</em> doing this, but it's at least not what Jason meant.</p>\n<p><a href=\"https://www.openphilanthropy.org/governance/\">Oops</a>:</p>\n<blockquote>\n<p>The Open Philanthropy 501(c)(3) is governed by a Board of Directors currently consisting of Dustin Moskovitz (Chair), Cari Tuna, Divesh Makan, Holden Karnofsky, and Alexander Berger. Open Philanthropy LLC is governed by a Board of Managers currently consisting of Dustin Moskovitz, Cari Tuna, Elie Hassenfeld, Holden Karnofsky, and Alexander Berger.</p>\n</blockquote>\n", "parentCommentId": "wZxBFd5tjzEyQpuT9", "user": {"username": "Guy Raveh"}}, {"_id": "Wk77iYctCMzRYTYM7", "postedAt": "2023-01-14T10:43:06.370Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>As a Swede who is somewhat familiar with the publication Expo, I would maybe put the risk of forgery of that document at &lt;5%. They are specifically known for their digging journalism, and I would be very surprised if they screwed up something basic like that.<br><br>Also, wouldn't it be extremely strange behavior from FLI if that document actually was a forgery? Would be the go-to defense rather than what they are doing now.</p>", "parentCommentId": "JG4xB8xtwaQhgvLZ4", "user": {"username": "henrith"}}, {"_id": "JqcaeoSn3aKgSi2P9", "postedAt": "2023-01-14T11:06:48.194Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Does Open Philanthropy solicit donations from the public?</p>", "parentCommentId": "4G5DjjFizjhHcjqR9", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "HLETwxEcsx3jjgxBF", "postedAt": "2023-01-14T11:43:35.360Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote><p>Option 1 is that a grant was approved pending due diligence, then pulled during the due diligence process. That would be mildly embarrassing, and would probably imply a grant evaluator somewhere didn't do their job</p></blockquote><p>&nbsp;</p><p>I think this would be a lot more than \"mildly embarassing\". It's an <i>effective altruism</i> <i>organisation</i>. They should not have had to wait for the \"due diligence\" phase to understand why donating a hundred grand to a far-right newspaper is not an effective cause.&nbsp;</p><p>Either someone is approving grants (and telling the grantees they have funding) without so much as doing a cursory google search on the grantees, or someone knew it was a nazi newspaper and still thought it was a worthy effective cause. It really doesn't help the case that Tegmarcks brother apparently wrote stories for the newspaper in question, so he at least could be expected to know what it is.&nbsp;</p><p>If the letter is genuine (and they have never denied that it is), then someone at FLI is either grossly incompetent or malicious. They need to address this ASAP.&nbsp;</p>", "parentCommentId": "JG4xB8xtwaQhgvLZ4", "user": {"username": "titotal"}}, {"_id": "mgJrdjW2aPFudovFe", "postedAt": "2023-01-14T11:50:51.085Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I'm not an authority here, but from scanning the front page yesterday and today I see quite a lot of anti-vax/covid-19 conspiracy sentiment, some pro-Russian/anti-Ukraine sentiment, some anti-immigration/anti-globalism sentiment, and I didn't see anything suggestive of Holocaust denial, neo-Nazism or replacement theory but that doesn't mean it doesn't exist. (There was one article <a href=\"https://nyadagbladet.se/utrikes/netanyahu-lovar-att-expandera-illegala-bosattningar/\">critical of the Israeli government</a> but I don't think that counts as anti-Semitic.) There's also a lot of culture war and freedom of speech stuff. There was <a href=\"https://nyadagbladet.se/utrikes/experter-kontrollerad-demolering-bakom-world-trade-centers-kollaps/\">a 9/11 truther article</a> on the front page though it's 6 years old. (I didn't read any opinion pieces.)</p>\n<p>As a counterpoint, there's one <a href=\"https://nyadagbladet.se/utrikes/tusentals-stormade-presidentpalatset-i-brasilien/\">mostly sane article about the invasion of the Brazilian Congress</a> (except for referring to the Capitol Hill attack as happening under \"mysterious circumstances\", which sounds pretty conspiratorial). There are also a bunch of articles that seem basically harmless, like <a href=\"https://nyadagbladet.se/inrikes/salmonella-hos-aggproducent-165-000-hons-avlivas/\">this one about 165K chicken being killed due to risk of salmonella</a>.</p>\n", "parentCommentId": "fvi2PmnAsw6uKB3EK", "user": {"username": "Erich_Grunewald"}}, {"_id": "beBqegypjrjKxZQLu", "postedAt": "2023-01-14T14:46:08.355Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>\"  . . . . that solicits donations from the public.\" I didn't see any such solicitation on Open Phil's website.</p>\n<p>Open Phil makes recommendations to some entities not controlled by Moskovitz and Tuna, but in addition to them being recommendations, I don't really consider other megadonors to be \"the public.\" They know they are something like free-riding on  Moskovitz and Tuna's research arm. In contrast, FLI is soliciting donations from ordinary people, including by asking them to designate FLI via the Amazon Smile program.</p>\n", "parentCommentId": "4G5DjjFizjhHcjqR9", "user": {"username": "Jason"}}, {"_id": "ZtwymWyDaWf4cAFG6", "postedAt": "2023-01-14T16:16:12.742Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p><a href=\"https://nyadagbladet-se.translate.goog/tag/per-shapiro/?_x_tr_sl=sv&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=sc\">The claim from Expo is easily verified</a></p>\n", "parentCommentId": "9SAqvL3bTotDhpRoZ", "user": {"username": "jooke"}}, {"_id": "oKBEGgSf6WvXnRzmK", "postedAt": "2023-01-14T16:16:45.831Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I think it very likely that FLI would have made a statement here if there were an innocent or merely negligent explanation (e.g., the document is a forgery, or they got duped somehow into believing the grantee was related to FLI's stated charitable purposes and not pro-Nazi). So, unless there is a satisfactory explanation forthcoming, the stonewalling strongly points to a more sinister one.</p><p>On the other hand, U.S. state charity regulators and the Internal Revenue Service's exempt-organizations staff are badly underfunded. Supporting neo-Nazis is constitutionally protected in the U.S. and poses no discernable legal risk. Using charitable resources to promote ends unrelated to the charity is, however, not protected. By making a case much easier to prove with minimal investigation, a written confession would significantly increase the odds of action against the organization and/or personal action against those responsible. In particular, the allegations here if true would support an inference that FLI used charitable resources to further the interests of a family member of the president and treasurer.</p><p>As far as PR strategy, do you think FLI could even survive a confession in anything close to its current form? I think the first rule of running a charity is not to embarass your megadonors by bringing them into public scorn by associating them in any way with neo-Nazis. FLI could have felt that this could blow over and remain mostly limited to a foreign publication, while an admission to supporting this organization would be a death knell for FLI.&nbsp;</p><p>I'm not attempting to <i>justify </i>their PR decisions as correct, of course. There are higher moral priorities than protecting one's organization. But the PR decisions don't seem irrational on their face if the main/only priority is protecting FLI.</p>", "parentCommentId": "qKHvsuSYfLwExxGbL", "user": {"username": "Jason"}}, {"_id": "FtM9MYpubZgyhePJ5", "postedAt": "2023-01-14T16:56:21.298Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I was under the impression that they do, but I might have been mistaken.</p>\n", "parentCommentId": "JqcaeoSn3aKgSi2P9", "user": {"username": "Guy Raveh"}}, {"_id": "aHZCqxvLXGmDFAvKZ", "postedAt": "2023-01-14T17:09:31.365Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Machine translation usually works pretty well between Swedish and English in my experience. They are quite similar, both germanic languages.<br><br>There are a bunch of op-eds claiming that the last US election was stolen, a news story about \"Ukraine refuses to accept the Russian offer of ceasefire\", one about \"Serbian army goes on high alert due to increased aggression from Kosovo\" (context: Serbia is a russian ally with a similar history of losing control of areas with other ethnic groups they previously subjugated). An Op-ed titled \"The image of slavery needs nuance\". An editorial titled \"Why civilians are not the targets of &nbsp;russian shelling\".<br><br>The sane articles do not stand out on their own but the selection of topics is quite narrowly focused on those subjects that conspiracist like to read about such as electronic surveillance and covid policy.</p>", "parentCommentId": "fvi2PmnAsw6uKB3EK", "user": {"username": "Jens Nordmark"}}, {"_id": "sRLzEWKu2HoQxJieY", "postedAt": "2023-01-14T18:50:13.491Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote>\n<p>I think it very likely that FLI would have made a statement here if there were an innocent or merely negligent explanation</p>\n</blockquote>\n<p>I think this sort of reasoning is helpful and generally underutilized. But one thing to keep in mind is that organizations can take weirdly long times to make even super obvious public statements relative to the value of getting clarification public, mostly for silly internal reasons.</p>\n<p>(Ex: not clear who needs to approve, someone who would normally look at it is traveling, someone misses that this is urgent, ...)</p>\n", "parentCommentId": "oKBEGgSf6WvXnRzmK", "user": {"username": "Jeff_Kaufman"}}, {"_id": "C7XNTkQ5iTdxCtz6m", "postedAt": "2023-01-14T19:18:38.759Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Good point. Bureaucratic inertia just doesn't seem likely at all in this case. A decision was made to send a response -- that sounds vaguely threatening/intimidating to my ears -- through FLI's lawyer within days.</p>\n", "parentCommentId": "sRLzEWKu2HoQxJieY", "user": {"username": "Jason"}}, {"_id": "TrqkHFTTAxDz24pXe", "postedAt": "2023-01-14T23:31:53.257Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Just perusing <a href=\"https://nyadagbladet.se/\">the front page of Nya Dagbladet</a>, it looks like their business's main bank account has been cut off (perhaps similar to how Visa or Paypal will routinely freeze the accounts of grey-area or politically unpalatable businesses here in the US), and now they are scrambling to try and get funds where they can:<br><img src=\"https://res.cloudinary.com/cea/image/upload/v1673739115/mirroredImages/TrqkHFTTAxDz24pXe/mlnoy21z4oa4sc8lpcu5.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/dnplkhfvhhbr1b9eicik.png 130w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/dtrszwercark9k8p1vly.png 260w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/tyhmkv6wef5me5zcyh0u.png 390w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/pgjvlmgaumyjeytmrx5t.png 520w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/aihtzmgsnynckb8sdkxv.png 650w, https://res.cloudinary.com/cea/image/upload/v1673739115/mirroredImages/TrqkHFTTAxDz24pXe/dtfm8uxxf2cm3xc3sdwu.png 780w, https://res.cloudinary.com/cea/image/upload/v1673739115/mirroredImages/TrqkHFTTAxDz24pXe/j71vhzekgaak71yjcs6o.png 910w, https://res.cloudinary.com/cea/image/upload/v1673739115/mirroredImages/TrqkHFTTAxDz24pXe/txmimdyfslxl2fujwoun.png 1040w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/hsgezqcxhxywet88ozpc.png 1170w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/tdnwsidlxxvde5lnspzl.png 1298w\"></p><p>It's possible that this is the context in which Tegmark made the (very poor) decision to attempt to rush a 100K grant to a \"foundation\" set up in equal haste by Nya Dagbladet. &nbsp;Which would come off less as \"funding a neo-nazi foundation to pursue shadowy neo-nazi projects\" and more as nepotistic misuse of FLI's funds to keep the newspaper Nya Dagbladet afloat, perhaps as a way of helping out Tegmark's brother?</p><p>I would also note that, <a href=\"https://forum.effectivealtruism.org/posts/5vFmMXWsh6PaYjqab/linkpost-fli-alleged-to-have-offered-funding-to-far-right?commentId=wLkaFGwvPbFmM9uvK\">as Erich_Grunewald describes</a> in his comments, the paper clearly does come across as populist / right-wing, but seems only a bit more sensationalized and extreme than something like the Washington Examiner or NY Post, and less so than things like Breitbart, the Drudge Report, Infowars, etc. &nbsp;It definitely does not come across as the homepage of a neo-Nazi organization:<br><img src=\"https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/jklx5su1fhzajw0xuza7.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/jrnngnddwdvxpcf0c0w6.png 140w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/mb400tighrtu4mpbb9ld.png 280w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/whmoy3lnke4xhrhtxlge.png 420w, https://res.cloudinary.com/cea/image/upload/v1673739115/mirroredImages/TrqkHFTTAxDz24pXe/uj4ha17cj3gnhuhyhpxn.png 560w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/zr444qjtbzysaacxgq2b.png 700w, https://res.cloudinary.com/cea/image/upload/v1673739115/mirroredImages/TrqkHFTTAxDz24pXe/pcvxopbxbfbawbmz61cj.png 840w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/ahs860zfm9numxr3kpcf.png 980w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/qyjb4uca408nhr3tsrxf.png 1120w, https://res.cloudinary.com/cea/image/upload/v1673739116/mirroredImages/TrqkHFTTAxDz24pXe/wbwhzdffv36fp8da4yzd.png 1260w, https://res.cloudinary.com/cea/image/upload/v1673739115/mirroredImages/TrqkHFTTAxDz24pXe/qwn9k56pxnjqljvlp6iy.png 1310w\"></p><p>Still seems like an extremely dubious use of FLI's funds to make a sketchy grant to a random populist newspaper with bad moral values and bad epistemics! &nbsp;But \"pro-nazi\" seems like it might be an exaggeration on the part of Expo.</p>", "parentCommentId": "4oHtGdMPjjL8gi47L", "user": {"username": "Jackson Wagner"}}, {"_id": "DAYTMCsCvCBabPFjN", "postedAt": "2023-01-15T00:51:01.571Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I don't know about Sweden, but it takes a lot more than being \"a bit more sensationalized and extreme than something like the Washington Examiner or NY Post\" to get your access to banking cut off in most liberal democracies. The content they posted with an imminent threat of a banking cutoff may not be representative of their historic content.</p>\n<p>The FLI activity started several months before the alleged bank freeze. For the \"grant\" to be motivated by the bank threat, one would need to conclude that ND knew of the risk of freezing yet couldn't get a bank account anywhere . . . yet somehow they are still able to take donations via PayPal. Seems  less likely they are on some sort of global or even national blacklist given that datum. So basically I don't believe their assertion of a banking blacklist against them in the first place.</p>\n<p>If I had to guess, they were probably financially failing because they were too toxic for ad networks or for other reasons.</p>\n", "parentCommentId": "TrqkHFTTAxDz24pXe", "user": {"username": "Jason"}}, {"_id": "Dn88oPPMdDK9dpmjh", "postedAt": "2023-01-15T02:39:28.388Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p><strong>(Jan 16 text added at the end)</strong></p><p>Here's an official statement from FLI on rejecting the Nya Dagbladet Foundation grant proposal:&nbsp;</p><p>For those of you unfamiliar with the &nbsp;Future of Life Institute (FLI), we are a nonprofit charitable organization that works to reduce global catastrophic and existential risks facing humanity, particularly those from nuclear war and future advanced artificial intelligence.&nbsp;&nbsp;These risks are growing.&nbsp;&nbsp;Last year, FLI received scores of grant applications from across the globe for the millions of dollars in funding we distributed to support research, outreach and other important work in furtherance of FLI’s mission. One of these grant proposals came from the Nya Dagbladet Foundation&nbsp;(NDF, not to be confused with the eponymous newspaper)&nbsp;for a media project directly related to FLI's goals.&nbsp;&nbsp;Although&nbsp;we were initially positive about the proposal and its prospects,&nbsp;we ultimately decided to reject it because of what our subsequent due diligence uncovered.&nbsp;We have given Nya Dagbladet and their affiliates zero funding and zero support of any kind, and will not fund them in the future.&nbsp;These final decisions were made by FLI’s leadership independently of any outside influence&nbsp;and well before any inquiry regarding the NDF proposal by members of the media.</p><p>On December 15, after we had informed NDF that their proposal was rejected, <a href=\"http://expo.se/\">Expo.se</a> contacted FLI with questions regarding the NDF proposal.&nbsp;We&nbsp;responded the same day that FLI had decided not to fund the project now or at any later time.</p><p>On January 13 <a href=\"http://expo.se/\">Expo.se</a> nonetheless ran&nbsp;<a href=\"https://expo.se/2023/01/elon-musk-funded-nonprofit-run-mit-professor-offered-finance-swedish-pro-nazi-group\">their piece</a>&nbsp;with a clickbait title combining \"Musk\" and “pro-nazi”.&nbsp;&nbsp;Among other issues we have with their article, we consider this headline reference to \"Musk\" to be unfair and misleading.&nbsp;&nbsp;He is only one of many prominent members of the worldwide science and tech communities to have supported the Future of Life Institute over the years, and plays no role in our grantmaking decisions. We also point out that the claim by <a href=\"http://expo.se/\">Expo.se</a> that NDF is \"pro-Nazi\" [the lede in the article] is apparently not shared by the (center-left) former Swedish government, which not only certified the Foundation as charitable but granted $30,000 in government funding and support to Nya Dagbladet in 2021. This is exactly $30,000 more than the zero dollars FLI granted to them.</p><p>The Future of Life Institute makes no apologies for engaging with many people across the immensely diverse political spectrum, because our mission is so important that it needs broad support from all sectors of society.&nbsp;&nbsp;&nbsp;We will continue to engage the broadest sample of humankind, whether or not we are criticized by anyone who questions our motives, or who may have their own agendas.&nbsp;&nbsp;And in this effort, the Future of Life Institute stands and will always stand emphatically against racism, bigotry, bias, injustice and discrimination at all times and in all forms.&nbsp;&nbsp;They are antithetical to our mission to safeguard the future of life and to advance human flourishing.</p><p><strong>Added Jan 16: </strong>Just to be absolutely unambiguous: FLI finds Nazi, neo-Nazi or pro-Nazi groups or ideologies&nbsp;despicable and would never knowingly support them. In case FLI’s past work, its website and the lifetime work, writing, and talks by FLI leadership left any doubt about that, we included this final sentence in our statement above just to be 100% clear:&nbsp;<i>“the Future of Life Institute stands and will always stand emphatically against racism, bigotry, bias, injustice and discrimination at all times and in all forms.&nbsp;&nbsp;They are antithetical to our mission to safeguard the future of life and to advance human flourishing.” &nbsp;</i>In terms of Nya Dagbladet, further investigation of them has only further validated our November decision to reject their proposal, and we regret that we did not understand their organization and history better sooner, so as to reject them earlier in the process. We will be improving our processes to reduce the risk of anything like this ever happening again.</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Tegmark"}}, {"_id": "qpkFMAyydmkXQ5mzK", "postedAt": "2023-01-15T02:47:49.537Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Jeff is right: I just returned from my mom's memorial service, which delayed the just-posted FLI statement.</p>", "parentCommentId": "C7XNTkQ5iTdxCtz6m", "user": {"username": "Tegmark"}}, {"_id": "BrdFqNSwQPf7CYixD", "postedAt": "2023-01-15T03:27:00.223Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Edit: I've decided to retract this as not conveying the nuances of my views, in particular:</p>\n<ul>\n<li>This comment was really poorly and hastily worded.</li>\n<li>I currently endorse the specific questions people are asking of Tegmark; I particularly like harfe's.</li>\n<li>I don't support and respect Max's actions regardless of how bad they were. That was a miscommunication on my part. To use an absurd hypothetical, if he murdered someone, I would unequivocally condemn that.</li>\n<li>Insofar as Max's actions have been good, I offer support, and insofar as they've been harmful, I wish he'd apologize and make amends. There is a longer comment below in the chain that lays out more of my thoughts, in response to a comment responding to this one. I wrote it a couple hours ago. The edit on this comment supersedes that comment. I would really like it if people don't nitpick the particulars of it.</li>\n<li>I basically agree with the comment responding to this one, by David Mears.</li>\n<li>Nazis are bad.</li>\n<li>I retract my involvement in this discussion.</li>\n</ul>\n<p>My previous comment:</p>\n<p>\"However questionable your actions may have been, which I know little enough about right now to understand the true situation and its intricacies as a bystander, I really respect you're not caving under pressure from the inquisition.\"</p>\n", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "DonyChristie"}}, {"_id": "ky2HZawNktnNBwENQ", "postedAt": "2023-01-15T03:35:11.991Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Someone should make a prediction market on how true the core claim (that FLI offered a grant to a pro-nazi publication) will turn out to be.</p>", "parentCommentId": null, "user": {"username": "temp_"}}, {"_id": "SnGrdzvNSkCFcHv9h", "postedAt": "2023-01-15T03:56:03.341Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>It seems like the paper's dispute with their bank has been going on for a while before the recent drama, perhaps long enough to make the timelines match up.  But yes, it's confusing to me why they couldn't just switch to another bank.  Definitely possible that they are basically just out of money  and their bank is trying to cut them off, but the paper is hyping this up as political persecution in order to buy time / gain some negotiating advantage.\n(Of course, regardless of what the actual story turns out to be, there is seemingly zero reason for FLI money to be involved in this BS .)</p>\n", "parentCommentId": "DAYTMCsCvCBabPFjN", "user": {"username": "Jackson Wagner"}}, {"_id": "qGPqHaxaHJDXbvGvp", "postedAt": "2023-01-15T04:32:42.226Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote><p>is apparently not shared by the (center-left) former Swedish government, which not only certified the Foundation as charitable but granted $30,000 in government funding and support to Nya Dagbladet in 2021</p></blockquote><p><i>Disclaimer: I previously knew nothing about the Swedish press; I still know almost nothing. I just thought this seemed weird and spent about 20 minutes looking into it.</i></p><p>Some context which I think would be useful to evaluate this claim.</p><p>It <a href=\"https://en.wikipedia.org/wiki/Mass_media_in_Sweden\">appears</a> that in Sweden the government subsidizes newspapers in the form of \"press support.\" From reading the <a href=\"https://en.wikipedia.org/wiki/Press_support\">Wikipedia page on press support</a>, which is mostly actually about Norway not Sweden, it seems like support does not really constitute a government endorsement, but rather is provided to a lot of different newspapers and is mostly to ensure a healthy press. It's possible this differs between Norway and Sweden though.</p><p>The $30,000 figure comes from the <a href=\"https://expo.se/2023/01/elon-musk-funded-nonprofit-run-mit-professor-offered-finance-swedish-pro-nazi-group\">expo.se</a> piece, which says:</p><blockquote><p>Nya Dagbladet applied to the Swedish Press and Broadcasting Authority for public funding in 2020, but was turned down. The platform reacted angrily to the decision, and published a series of articles where specific officials at the agency were named and pictured. The publications caused distress among employees at the agency who felt menaced and pressured, as <a href=\"https://www.dn.se/kultur/anstallda-pa-myndighet-pressade-av-hogerextrema-medier/\"><i><u>Dagens Nyheter</u></i></a> reported at the time. The following year, Nya Dagbladet made another application for public funding; this time they were successful and received about $30,000 in various grants.</p></blockquote><p>The article linked (archive <a href=\"https://archive.ph/7nZb7\">here</a>) Google translates the article as referring to the Norwegian press. I thought that was pretty weird, but from googling the Swedish (Myndigheten för press, radio och tv), I think the Google translate is wrong and it is indeed about the Swedish press (<a href=\"https://www.mprt.se/\">here</a> is the website of the Swedish press agency). The expo.se piece might seem to imply that the government officials may have been intimidated into making the later grant, but I think that's a bit less clear if press support is supposed to be widely distributed to newspapers in any case.</p><p>Regardless, to me it does not seem like the reception of this grant really indicates that the organization is not pro-Nazi, and certainly it doesn't seem to imply endorsement of that claim from the Swedish government, at least as far as I can tell. A good understanding would require a better understanding of the Swedish press support system, which I neither I or presumably the vast majority of readers of this comment have.</p>", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "ThomasWoodside"}}, {"_id": "dozSgSgeiPdSxoxyo", "postedAt": "2023-01-15T05:30:29.603Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Sorry is there anything in that link that suggests Per Shapiro and Tegmark are brothers?&nbsp;</p>", "parentCommentId": "ZtwymWyDaWf4cAFG6", "user": {"username": "Linch"}}, {"_id": "zHaipyGyauXRwjhZg", "postedAt": "2023-01-15T05:34:55.472Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote><p>Although&nbsp;we were initially positive about the proposal and its prospects,&nbsp;we ultimately decided to reject it because of what our subsequent due diligence uncovered.&nbsp;We have given Nya Dagbladet and their affiliates zero funding and zero support of any kind, and will not fund them in the future.&nbsp;These final decisions were made by FLI’s leadership independently of any outside influence&nbsp;and well before any inquiry regarding the NDF proposal by members of the media.</p></blockquote><blockquote><p>On December 15, after we had informed NDF that their proposal was rejected, <a href=\"http://expo.se/\">Expo.se</a> contacted FLI with questions regarding the NDF proposal.</p></blockquote><p>Is there and/or can you get independent verification of this? I understand the desire to not publicly reveal grantee/grantseeker details so I'm not necessarily saying you should make your emails to NDF public. However, it'd be helpful confirmation for an independent third party to verify that FLI did inform NDF of the rejection before the Expo.se inquiry, and/or some confirmation that the description of the FLI leadership decisions are roughly as you described them.&nbsp;</p>", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "Linch"}}, {"_id": "6iK3GYTkzeAfbwp4v", "postedAt": "2023-01-15T05:50:53.445Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>My sincere sympathies for your loss.&nbsp;</p>", "parentCommentId": "qpkFMAyydmkXQ5mzK", "user": {"username": "Linch"}}, {"_id": "abQBcbReL5yu2AeFy", "postedAt": "2023-01-15T08:22:10.193Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I believe Joshua was talking about the claim that Per Shapiro was a contributing writer for <i>Nya Dagbladet</i>.</p><p>There's no direct evidence in the Expo article as far as I could tell for the fraternal link, but there's definitely external evidence. For example, <a href=\"https://twitter.com/tegmark/status/1364570922221469704\">here's a tweet from Max himself</a>, linking to &nbsp;Per's podcast and calling him 'my brother Per' (subject to accuracy of Google Translate).</p>", "parentCommentId": "dozSgSgeiPdSxoxyo", "user": {"username": "JWS"}}, {"_id": "dtZgKHm8JvWZpiDjy", "postedAt": "2023-01-15T10:48:46.262Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I'm very sorry for your loss and apologise for jumping to conclusions about why there wasn't an immediate statement.</p>", "parentCommentId": "qpkFMAyydmkXQ5mzK", "user": {"username": "Shakeel Hashim"}}, {"_id": "6dAnNixTgPHWwhNex", "postedAt": "2023-01-15T10:50:49.457Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Calling this an ‘inquisition’ is hyperbolic. What I see is a small number of people expressing critical views and feelings, and seeking answers from FLI. I would far prefer a world in which people feel entitled to do that, than one where it’s discouraged. When I imagine the alternative, I imagine a world in which we automatically assume good intent on the part of any authority figure alleged to have done something bad, or one in which people are too polite or timid to speak out, etc.</p>\n<p>It seems as if you find outrage in response to misdeeds more offensive than the misdeeds themselves, because you offer support without conditionalising on how bad the misdeeds are (“however questionable” they are).</p>\n<p>In fact, there is a point beyond which the badness of believing one is in the right vastly overshadows anything respectable about sticking to one’s convictions. When someone has done something clearly bad, let’s say corruption, and doesn’t agree one has done anything wrong, the lack of apology, while technically virtuous, deserves far less praise than the disagreement deserves censure. So my position is “depending on how bad the actions were, FLI should apologise or not apologise, and we should criticise or punish them in proportion to how bad they were”.</p>\n", "parentCommentId": "BrdFqNSwQPf7CYixD", "user": {"username": "David Mears"}}, {"_id": "r3D6jer5AGNPHFtB2", "postedAt": "2023-01-15T10:52:26.641Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks for sharing this. However it doesn't really answer the core question of why FLI <i>ever</i> thought this was okay. \"We ultimately decided to reject it because of what our subsequent due diligence uncovered\" — given that your brother is a writer there, did you not know beforehand that Nya Dagbladet publishes horrific, racist content? I find it hard to believe this was not known until the due diligence stage.</p>", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "Shakeel Hashim"}}, {"_id": "uQbe8Geytf5nGvz6d", "postedAt": "2023-01-15T10:58:27.423Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks, this is pretty convincing to me.</p>", "parentCommentId": "abQBcbReL5yu2AeFy", "user": {"username": "Linch"}}, {"_id": "Hvzsdtdj2wyPeoGY3", "postedAt": "2023-01-15T11:22:56.624Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>The Swedish press support is for quite obvious reasons designed to be politically impartial, which means that one can't draw conclusions about a publications ideology from the fact that it receives press support. This is an issue that is sometimes debated in Sweden because blatantly antidemocratic media may be entitled to the money.</p>\n", "parentCommentId": "qGPqHaxaHJDXbvGvp", "user": {"username": "Jens Nordmark"}}, {"_id": "CmtPExgWpa8K3JCtd", "postedAt": "2023-01-15T11:33:41.936Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This statement doesn’t disavow the idea of funding neo-Nazism, and the lacuna is worrying: by convention (pragmatics), omitting to comment on the salient thing is taken as a comment in itself. Have you sought advice from communications specalists? If not, it would be well worth it to avoid unnecessary misinterpretation, if you want to disavow the main allegation.</p>\n<p>Here are the main bits that stood out to me as suboptimal communication.</p>\n<ol>\n<li>\n<p>I would like to understand why you decided to reject the grant proposal after doing due diligence. Was it because of their far-right politics, or a conflict of interest, reputational hazard, or something else?</p>\n</li>\n<li></li>\n</ol>\n<blockquote>\n<p>The Future of Life Institute makes no apologies for engaging with many people across the immensely diverse political spectrum</p>\n</blockquote>\n<p>I wish you would not imply your critics are politically narrow-minded for being worried FLI is alleged to have considered supporting a neo-Nazi outlet. I would like to understand if there are any limits here - are there any political views you are not willing to support?</p>\n", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "David Mears"}}, {"_id": "QzEx7FE8Tr9heGz6j", "postedAt": "2023-01-15T13:38:34.976Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Some related markets (one being mine):&nbsp;<br><br><a href=\"https://manifold.markets/harfe/will-max-tegmark-or-fli-issue-a-sta?referrer=ElliotDavies\">Will Max Tegmark or FLI issue a statement (before Feb 14th) that the letter of intent (to the swedish right-wing media org) was fake?</a></p><p><br><a href=\"https://manifold.markets/ElliotDavies/will-flis-grant-approval-to-nya-dag?referrer=ElliotDavies\">Will FLI's grant approval to Nya DagBladet appear reprehensible on 31 March 2023</a>.</p>", "parentCommentId": "ky2HZawNktnNBwENQ", "user": {"username": "ElliotJDavies"}}, {"_id": "4o9Ev4GeeA67rAHJG", "postedAt": "2023-01-15T13:39:01.846Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>My brother never worked there. &nbsp;He published some articles there, but they've never paid him anything.&nbsp;</p>", "parentCommentId": "r3D6jer5AGNPHFtB2", "user": {"username": "Tegmark"}}, {"_id": "sgG6zWLwgSJ7x9mBZ", "postedAt": "2023-01-15T13:41:59.709Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Brother is used as a term of affection in a fair few languages (including Swedish), so I wouldn't just trust a tweet.&nbsp;<br>The Swedish wikipedia article on Per, however, confirms more definitively that they are brothers: https://sv.wikipedia.org/wiki/Per_Shapiro</p>", "parentCommentId": "uQbe8Geytf5nGvz6d", "user": {"username": "Marzhin"}}, {"_id": "Cpt4jCfAMBT2fzP9g", "postedAt": "2023-01-15T15:03:42.187Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>He's confirmed it himself now too: https://forum.effectivealtruism.org/posts/5vFmMXWsh6PaYjqab/linkpost-fli-alleged-to-have-offered-funding-to-far-right?commentId=4o9Ev4GeeA67rAHJG</p>", "parentCommentId": "sgG6zWLwgSJ7x9mBZ", "user": {"username": "Jeroen_W"}}, {"_id": "LnDLfaiZG4M23KaEQ", "postedAt": "2023-01-15T15:50:19.959Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I'm curious as to what kind of potentially existentially relevant proposal the NDF would have submitted? What did they think they had to offer?</p><p><i>(registering a tentative guess: sha256sum ..52ca22c6cd32)</i></p>", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "MakoYass"}}, {"_id": "bWpvvLFhfmFbbAnRW", "postedAt": "2023-01-15T15:53:10.902Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This response is highly concerning and alarming. &nbsp;Some followup questions:</p><ul><li>Are you confirming that the grant approval letter shown by expose is entirely genuine?</li><li>What was the nature of the media project you intended to fund?</li><li>Why was Nya Bagdlet chosen as the foundation, and not some other more reputable news source?</li><li>How aware were you of the political leaning of Nya Bagdlet when you approved this grant initially? In particular the publishing of articles promoting holocaust revisionism, vaccine denial, and the campaign to \"defend ethnic rights\"?&nbsp;</li><li>&nbsp;Is it normal to hand out grant approval letters before conducting due diligence on a project?</li><li>How long did it take for the organisation to reject the project after initially approving it?</li><li>Do you specifically condemn the Nya Bagdlet newspaper, right now?&nbsp;</li></ul>", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "titotal"}}, {"_id": "aD3iffyb4Pt2xrofu", "postedAt": "2023-01-15T16:07:26.240Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>It is not  uncommon, and I will even say usual, that Nazi sympathisers are at least somewhat subtle about it.</p>\n<p>This is not particularly subtle. Here's their section on the Holocaust:\n<a href=\"https://nyadagbladet.se/tag/forintelsen/\">https://nyadagbladet.se/tag/forintelsen/</a></p>\n<p>Here's an editorial written for Holocaust Remembrance Day. Their central claim is that the way to prevent antisemitism it to stop \"lying\" about how many Jews were killed.\n<a href=\"https://nyadagbladet.se/ledare/sa-forebygger-vi-den-verkliga-antisemitismen/\">https://nyadagbladet.se/ledare/sa-forebygger-vi-den-verkliga-antisemitismen/</a></p>\n<p>This is very classic Holocaust denialism. I don't think it's unreasonable to call a website that actively promotes ethnonationalism and Holocaust denialism \"pro-Nazi\", unless you think that the literal words \"pro-Nazi\" must appear somewhere in order to qualify.</p>\n", "parentCommentId": "TrqkHFTTAxDz24pXe", "user": {"username": "mvolz"}}, {"_id": "HkzoHt2tnKExGgxJ8", "postedAt": "2023-01-15T18:44:30.853Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>How does that address Shakeel's concern? I would've thought someone submitting articles to a far-right website would know it's a far-right website regardless of payment.&nbsp;</p>", "parentCommentId": "4o9Ev4GeeA67rAHJG", "user": {"username": "elephantower"}}, {"_id": "GYpBx6ETSbTx9h6Zy", "postedAt": "2023-01-15T18:54:30.211Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This reply is disappointingly short and again does not address the core question raised by Shakeel.</p>\n<ul>\n<li>The letter of intent states that the grant was approved. Why doesn't FLI do more due diligence before approving a grant? Since you havent stated the opposite, I assume that the latter is genuine (that would be nice to clarify, too). Is that a usual process? How often, by percentage, does it happen that you approve a grant and then later reject it?</li>\n<li>Has anyone at FLI looked at the <a href=\"https://sv-m-wikipedia-org.translate.goog/wiki/Nya_Dagbladet_(svensk_tidning)?_x_tr_sl=auto&amp;_x_tr_tl=en&amp;_x_tr_hl=de&amp;_x_tr_pto=wapp\">swedish wikipedia page</a> of the org?</li>\n<li>If you see the wikipedia page now, do you think, as a first guess, it would be ok to give $100k to such an organization?</li>\n<li>Where you aware of Nya Dagbladet before?</li>\n<li>Were you aware that Nya Dagbladet publishes horrific, racist content, or do you disagree with the characterization that they publish horrific, racist content?</li>\n<li>what kind of media project was it that you initially wanted to fund?</li>\n</ul>\n", "parentCommentId": "4o9Ev4GeeA67rAHJG", "user": {"username": "harfe"}}, {"_id": "NoZXzP7sdDrfXQJai", "postedAt": "2023-01-15T19:33:50.265Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>But would he describe the paper that way to his brother, who he knows is left-center? He'd likely want to tell Max that it isn't an extreme paper, and if he were a right-winger, he'd likely believe it.</p><p>It's also possible that Max wasn't cognisant that his brother had published in that paper and so they may have not thought to talk about it, from what I can tell, Per has worked for a lot of more prominent publications than that.</p>", "parentCommentId": "HkzoHt2tnKExGgxJ8", "user": {"username": "MakoYass"}}, {"_id": "WRYmBc8epbdf9YJwb", "postedAt": "2023-01-15T19:40:54.015Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>For Max and anyone else who thinks they might not be neo-Nazis, I assure you that they are. As an example, here's a Google-translated quote from an <a href=\"https://nyadagbladet.se/analys/ar-alternativ-for-sverige-verkligen-ett-alternativ-for-nationalister/\">article</a> they published:</p>\n<blockquote>\n<p>Jewish interest groups have been and still are the most driving force behind the transformation of Western societies into multicultural and multi-ethnic societies. It is a controversial but well-documented fact, not only in countries like the USA but also in Sweden . Through media influence and a strong position in the international banking system, they have enormous influence over culture and politics, and have largely undisturbed been able to reshape Western societies according to their own will in a number of different areas also beyond immigration policy, completely contrary to the interests of the indigenous peoples and rights.</p>\n</blockquote>\n<p>*I took this from another discussion of the topic; I think JWS is the one who found it?</p>\n", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "Guy Raveh"}}, {"_id": "NoxtQn3i3shrY2Jte", "postedAt": "2023-01-15T19:57:15.083Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>In that one they also recommend voting for the Nordic Resistance Movement (Nordiska Motståndsrörelsen), which is an explicitly national socialist party. They have a website in english, but I won't link from here. Instead I recommend the wikipedia article that describes pretty well how charming they are. Apparently there is an ongoing effort in the US to classify them as terrorists.<br><br><a href=\"https://en.wikipedia.org/wiki/Nordic_Resistance_Movement\">https://en.wikipedia.org/wiki/Nordic_Resistance_Movement</a></p>", "parentCommentId": "WRYmBc8epbdf9YJwb", "user": {"username": "Jens Nordmark"}}, {"_id": "QBAvWGsumKCYbYEEs", "postedAt": "2023-01-15T20:53:36.249Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Minor meta-question: what is the 2 axis voting supposed to represent here? People feel this was a good contribution to the discussion but disagree with the claim that Per Shapiro was never paid by <i>Nya Dagbladet?&nbsp;</i> I would've expected the opposite -- the factual claim is probably true but not very relevant.</p>", "parentCommentId": "4o9Ev4GeeA67rAHJG", "user": {"username": "elephantower"}}, {"_id": "PtJpMm2JugkZQrpoc", "postedAt": "2023-01-15T21:24:32.154Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>It doesn't seem that hard to believe that someone could see a far-right website and not notice that they occasionally publish crazy anti-semitic content (e.g. if I look at <a href=\"https://nyadagbladet-se.translate.goog/?_x_tr_sl=sv&amp;_x_tr_tl=en&amp;_x_tr_hl=en-US&amp;_x_tr_pto=wapp\">their front page</a>, many of the articles seem kooky to me, but none seem racist). To be honest, given that the last name <a href=\"https://en.wikipedia.org/wiki/Shapiro\">Shapiro</a> seems to mostly be used by people with Jewish ancestry, I'd be kind of surprised if his brother knew about that content before submitting (altho I suppose anything is possible).</p>\n", "parentCommentId": "HkzoHt2tnKExGgxJ8", "user": {"username": "DanielFilan"}}, {"_id": "9LKg7RLcr6QFFdBgS", "postedAt": "2023-01-15T21:29:41.307Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thank you, my prior was it would be something along this line but it needed someone to check</p>\n", "parentCommentId": "qGPqHaxaHJDXbvGvp", "user": {"username": "jooke"}}, {"_id": "Hj5akJLyoCQdQ2bdi", "postedAt": "2023-01-15T22:00:15.945Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I do suspect neither knew initially about the explicit support for a bona fide nazi terror org (NRM), I only found it out in an article JWS dug up. Pretty clear it's a pro-Russian site though.</p>", "parentCommentId": "PtJpMm2JugkZQrpoc", "user": {"username": "Jens Nordmark"}}, {"_id": "HRn6BgwjLthrwdAeX", "postedAt": "2023-01-15T22:15:03.352Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks for responding Shakeel.</p>\n", "parentCommentId": "3CQAZR2j9GrsaNNq7", "user": {"username": "jlewars"}}, {"_id": "53P3RKozKQpo3CBah", "postedAt": "2023-01-15T23:43:35.227Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>(Fyi a hash of only 12 hex digits (48 bits) is not long enough to prevent retroactively composing a message that matches the hash-fragment, if the message is long enough that you can find 48 bits of irrelevant entropy in it.)</p>", "parentCommentId": "LnDLfaiZG4M23KaEQ", "user": {"username": "jimrandomh"}}, {"_id": "NBiwDrgBZxM6WFygK", "postedAt": "2023-01-16T00:07:03.413Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>they do not</p>\n", "parentCommentId": "FtM9MYpubZgyhePJ5", "user": {"username": "Peter_Hurford"}}, {"_id": "6w9S854FJjdp4eLDz", "postedAt": "2023-01-16T00:26:54.526Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I would expect Tegmark to know more about the paper if his brother had worked there than if his brother had published some articles there (especially if his brother had published in a bunch of other places as well). However, it may also be that his brother has only published to that one site.</p>", "parentCommentId": "HkzoHt2tnKExGgxJ8", "user": {"username": "casebash"}}, {"_id": "HvvLadotucJXbFucz", "postedAt": "2023-01-16T01:06:46.252Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>(Well I declare that the message is very short.<br>What would 48bits of entropy, in grammatically and semantically correct text, look like? Edit: I guess, if I could assume I could think of 4 synonyms for every word in the paragraph, the paragraph would only have to be a bit over 24 words long for me to be able to find something. Fortunately, it's only 11 words long.)</p>", "parentCommentId": "53P3RKozKQpo3CBah", "user": {"username": "MakoYass"}}, {"_id": "jBXkr9ntod2dKRTgR", "postedAt": "2023-01-16T01:34:20.787Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>To be clear, from what it looks like this newspaper (that I have not looked at) looks like it <i>has</i> platformed what looks like neo-Nazi views. If Max knew that and held an intention to fund it before deciding against, I find that stupid &nbsp;and harmful that he would even consider it. Neo-Nazism is bad.</p><blockquote><p>because you offer support without conditionalising on how bad the misdeeds are (“however questionable” they are).</p></blockquote><p>I think I may be giving a wrong impression here. I don't offer unconditional support for someone who's, say, funneling millions of dollars to neo-Nazis. Max clearly has not done that, and given the evidence at hand, I support him standing up for himself. That means I am conditioning on having some sense of the evidence, which contradicts my wording. I meant to hedge my words by saying something to the effect of, 'well I'm offering this support even though I don't know very much of the specifics, so don't like judge me if this turns out to be really horrible'. But this is a bit cowardly given that, well, my support <i>is</i> somewhat conditional on having read some about this and seeing his comment, and reflects some anticipation that he has a good chance (50%?) of having not been really in the wrong. That said, yes I think something wrong or really wrong may have happened here, and don't want to be construed as not allowing for that reality.</p><p>This is a technicality, but \"seeking answers\" is describable as inquisitiveness and inquisitional, so &nbsp;I stand by my wording, in that I think it both technically true and carries the vibe I want it to convey, even if it's actually justified on people's part to ask those questions. I meant it to have that double-meaning. Given the karma amounts going on, I don't consider the connotative usage at all hyperbolic, and I'm not including social media discourse that almost certainly exists but which I have not seen.</p><blockquote><p><i>noun &nbsp;</i>1. a period of <u>prolonged</u> and intensive questioning or investigation.</p></blockquote><p>I think people's questioning is very valid in this circumstance. I also think Max has a right to stand up for himself if he believes he hasn't done wrong. The fact that he didn't pay out money after investigating seems <i>pretty important</i> to me. But I don't know what that process was with the paperwork and some letter I forget the exact name of, because I am unvirtuously not looking at the actual empirical details very closely. I think Max will provide more details of his intentions, and questioning is a process that will help with that. The fact that his brother was involved strikes me as a conflict-of-interest that should provide pause, though I also know there are many conflicts-of-interest in EA-land. I would guess that it would be pretty hard for someone investigating the newspaper to not catch some whiff that it was problematic early on, if they hadn't heard of the newspaper already (I don't know how well-known it is there). That determines whether a \"positive initial impression\" on his part would make sense or not, as that's the only wrong thing I have seen so far based on what he said, an initial mistake in doing due diligence fast enough. I think a crux we maybe have here is that I'm basically taking him at his word on that, and assuming he doesn't have like corrupt ties or fascist leanings, which for all I know could be false. My best guess is that the latter is not the case (I hear something about him being center-left?) and that leaves the problem of maybe his brother came pleading to him to save this newspaper and that they would do some longtermist programming in exchange for saving it, I don't know!</p><blockquote><p>It seems as if you find outrage in response to misdeeds more offensive than the misdeeds themselves</p></blockquote><p>If FLI loses hundreds of thousands in funding, or more, for what turns out to have been a mistake in due diligence, that would indeed be a sad consequence to me. Though I agree that it's <i>more</i> important to question institutions if they are acting out of integrity than what the results are (see more below).</p><p>&nbsp;</p><blockquote><p>“depending on how bad the actions were, FLI should apologise or not apologise, and we should criticise or punish them in proportion to how bad they were”</p></blockquote><p>I agree. I think it's not obvious to me yet that they have besides fucking up on due diligence speed. Again, I will hedge by saying I am not combing carefully over the evidence like others are.</p><blockquote><p>\"I would far prefer a world in which people feel entitled to do that, than one where it’s discouraged. When I imagine the alternative, I imagine a world in which we automatically assume good intent on the part of any authority figure alleged to have done something bad, or one in which people are too polite or timid to speak out, etc.\"</p></blockquote><p>Given what happened with SBF, and the extent to which this type of questioning might have uncovered that sooner, I simply have to agree, even if the results make me uncomfortable. It is extremely important we do more of this (in a sustainable way?).</p><p>Edit 1: I really like <a href=\"https://forum.effectivealtruism.org/posts/5vFmMXWsh6PaYjqab/linkpost-fli-alleged-to-have-offered-funding-to-far-right?commentId=GYpBx6ETSbTx9h6Zy\">harfe's questions</a> for Max, and I should also add my original comment was not referring to any specific comments that were made in response to Max's top-level comment, since mine was the first response afaik, though I think I was anticipating him receiving a ton of skepticism, and wanted to express support for what looks like someone in a really hard place right now who likely had mostly good intentions going into this.</p>", "parentCommentId": "6dAnNixTgPHWwhNex", "user": {"username": "DonyChristie"}}, {"_id": "GzMd2qWG6qvHtojHK", "postedAt": "2023-01-16T01:43:20.845Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This statement really doesn't answer most of the questions raised by the Expo report. Indeed, it spends about as much time criticizing Expo as providing specific factual information about FLI's&nbsp;questioned conduct.</p><p>The approval of this grant seems bizarre enough that justification beyond the bare characterization of a positive impression is needed here. What was the grant proposal about? How did funding it further FLI's mission? Why was it assessed positively?</p><p>What vetting of the grant proposal did FLI conduct before issuing the letter declaring that it had \"approved a grant\" to NDF? (I'm quoting from the September 7 letter published by Expo. FLI hasn't repudiated that letter as false or misleading at the time it was written, so I'm going to take it at face value.). It does not seem responsible that one would \"approve[]\" a six-figure grant without having some idea about who the proposed grantee was and their ability to carry out the purposes of the grant. Nor does it seem reasonable that FLI would determine that making a grant to a proposed foundation associated with a far-right, anti-science, Holocaust-denying media outlet was an effective way to get \"research, outreach and other important work in furtherance of FLI’s mission\" done.&nbsp;</p><p>As far as the press statement's attempt to mainstream the people associated with NDF, Expo quoted from a Holocaust-denial editorial by the lead editor of the media outlet (chair of NDF) and exhortations by another ND editor to vote for a neo-Nazi political party (as characterized by the Anti-Defamation League). NDF's \"board of directors consists of the senior editors of\" ND, which means those editors stood by while ND published advocacy for a neo-Nazi political party. See also other comments on this thread.</p><p>Your brother told&nbsp;Expo that he did \"not want to answer questions concerning whether he has been involved in contacts between Nya Dagbladet and FLI.\" Are you in a position to state whether (and if so, how) he was involved in any way with the grant, with NDF, or with any contact between the prospective grantees and FLI? If there was involvement, can you state whether you and your wife recused yourself from any consideration of the grant proposal due to an involvement of an immediate family member?</p><p>What information did FLI find -- and not know earlier -- that caused it to rescind the grant \"approv[al]\"? Why was this information not found earlier?</p><p>Do you want to comment on your response to Expo asserting that FLI had not \"approved grants to any person or organization in Scandinavia\"? Unless there is more context, that statement isn't consistent with the September 7 letter or the media statement above. Especially when combined with a statement suggesting that Expo had no reasonable factual basis for having such a belief: \"Where did you get this incorrect information about Future of Life Institute?\"&nbsp;</p><p>Basically, I am finding it hard to find a way in which none of the following three following statements are true: (1) FLI approved a six-figure grant to NDF without looking to see what kind of work the proposed grantees did; (2) FLI was on notice of their extremist views and approved the grant anyway; or (3) FLI made a false or misleading statement about approving the grant when it knew or should have known that statement would be relied on by third parties. If FLI had not yet considered whether NDF was an appropriate grantee (but was planning to do so later), it was simply not appropriate to characterize this as an approved grant. (In contrast, I think it was OK that the letter did not list certain legally-required and technical preconditions.) One problem with issuing a vague response is that it leaves the reader to determine which of these three statements is true. I think all are problematic, but some more so than others.</p><p>The final paragraph of the statement is the most alarming. The statements that you will \"continue to engage the broadest sample of humankind\" and make \"no apologies for engaging with many people across the immensely diverse political spectrum\" have been made in the specific context of criticism for approving a grant to an organization whose board is significantly linked to Holocaust denial (and <i>at the very least</i> extremely tolerant of neo-Nazism). If you did not intend to include such organizations in your statements of non-apology and future intent, you really should say so and define the bounds of who FLI is willing to work with.</p>", "parentCommentId": "Dn88oPPMdDK9dpmjh", "user": {"username": "Jason"}}, {"_id": "3CbtZJSGAkc64c97K", "postedAt": "2023-01-16T05:37:55.464Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>\"I would normally angrily downvote you, but I do want to indicate support for you continuing to engage here and think it is good for other people to be able to see your response so I will vote up and disagree\"</p>\n", "parentCommentId": "QBAvWGsumKCYbYEEs", "user": {"username": "Jeff_Kaufman"}}, {"_id": "HywF7bnQknjxwhHDY", "postedAt": "2023-01-16T06:03:07.766Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>&nbsp;Overall I think any reasonable person should have an intuition that the site is dodgy after skimming a few articles, and the Nazi articles are just irrefutable proof if you want to question that initial impression. &nbsp;<br><br>&gt; To be honest, given that the last name <a href=\"https://en.wikipedia.org/wiki/Shapiro\">Shapiro</a> seems to mostly be used by people with Jewish ancestry, I'd be kind of surprised if his brother knew about that content before submitting</p><p>I'd guess Shapiro knows he has some strange bedfellows but cares more about pushing anti-vax and right-wing populist view points than avoiding Nazis (unclear if he knows about that specific editorial ofc)&nbsp;</p>", "parentCommentId": "PtJpMm2JugkZQrpoc", "user": {"username": "elephantower"}}, {"_id": "2Lo9rs4tK3radDNxc", "postedAt": "2023-01-16T08:38:07.245Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote>\n<p>Overall I think any reasonable person should have an intuition that the site is dodgy after skimming a few articles</p>\n</blockquote>\n<p>Eh I agree tbh but there's a gap between \"dodgy\" and \"horrific[ally] racist\", which was \"Shakeel's concern\" that you mentioned.</p>\n", "parentCommentId": "HywF7bnQknjxwhHDY", "user": {"username": "DanielFilan"}}, {"_id": "CSJmcQaXkvoG7ebuz", "postedAt": "2023-01-16T10:41:34.188Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Not totally sure, but IIRC characters like 'a' or 'z' are about 8 bits each, depending how the text is encoded. So 48 bits would give you 6 characters.</p>", "parentCommentId": "HvvLadotucJXbFucz", "user": {"username": "David Mears"}}, {"_id": "cuGD9GirJqb4nc6q3", "postedAt": "2023-01-16T16:39:32.803Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I think <a href=\"https://folketsradio.podbean.com/e/du-skona-nya-varld/\">this</a> is the podcast Tegmark appeared on with his brother, if you're interested in telling us about it.</p>\n", "parentCommentId": "wLkaFGwvPbFmM9uvK", "user": {"username": "Aptdell"}}, {"_id": "6qbzLFtQXhaab2ptP", "postedAt": "2023-01-16T19:29:54.243Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>I guess if we you saw a lot of noise in the prediction, random misspellings, tortured grammar, you'd reject.</p>", "parentCommentId": "CSJmcQaXkvoG7ebuz", "user": {"username": "MakoYass"}}, {"_id": "LiQe9RKjz4rDnAuwX", "postedAt": "2023-01-16T22:56:34.659Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Is there a reason you can’t post the full hash</p>\n", "parentCommentId": "6qbzLFtQXhaab2ptP", "user": {"username": "David Mears"}}, {"_id": "snc6qfKAzWzHtKnif", "postedAt": "2023-01-17T00:01:44.746Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>not really, just didn't want to draw too much attention to it.</p>", "parentCommentId": "LiQe9RKjz4rDnAuwX", "user": {"username": "MakoYass"}}, {"_id": "9jn6Myvcq3n3KJDmo", "postedAt": "2023-01-17T01:20:07.046Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Suppose there's a spot in a sentence where either of two synonyms would be effectively the same. That's 1 bit of available entropy. Then a spot where either a period or a comma would both work; that's another bit of entropy. &nbsp;If you compose a message and annotate it with 48 two-way branches like this, using a notation like spintax, then you can programmatically create 2^48 effectively-identical messages. Then if you check the hash of each, you have good odds of finding one which matches the 48-bit hash fragment.</p>", "parentCommentId": "HvvLadotucJXbFucz", "user": {"username": "jimrandomh"}}, {"_id": "gzcqcbtwJhT7s5Xuy", "postedAt": "2023-01-18T23:30:24.055Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>With respect to the last question I think it is perhaps a bit unfair. I think they have clearly stated they unconditionally condemn racism, and I have a strong prior that they mean it. Why wouldn’t they, after all?</p>\n", "parentCommentId": "bWpvvLFhfmFbbAnRW", "user": {"username": "PabloAMC"}}, {"_id": "ojpmxCEtkAaT9cedt", "postedAt": "2023-01-19T01:25:48.902Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Tegmark wrongly alluded that the newspaper does not have and advocate the pro-Nazi views that they have been demonstrated to.</p>\n", "parentCommentId": "gzcqcbtwJhT7s5Xuy", "user": {"username": "Guy Raveh"}}, {"_id": "YZqoNCJbanXrWti8x", "postedAt": "2023-01-19T12:09:53.937Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Listened to it while doing other stuff so might not be 100 % accurate.<br><br>To my understanding Tegmark appears for 10 minutes, doing a normal AI-risk spiel. I think the angle relevant to the podcast is the risk of concentration of power in the hands of a few. So some accusations of big tech capturing AI conferences etc.<br><br>There's a small segue talking about covid where Tegmark states he felt it was such an infected discussion that he couldn't talk about it openly in some work environments for fear of repercussions.</p>", "parentCommentId": "cuGD9GirJqb4nc6q3", "user": {"username": "henrith"}}, {"_id": "dzsz2MNsNMg8gc4tM", "postedAt": "2023-01-19T18:47:06.509Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>You may want to update the post with a link to <a href=\"https://futureoflife.org/rejection_statement/\">FLI's statement</a>.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "Kj7nigLf9hvNzjrsP", "postedAt": "2023-01-19T21:07:03.282Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks, updated.</p>\n", "parentCommentId": "dzsz2MNsNMg8gc4tM", "user": {"username": "Jens Nordmark"}}, {"_id": "jvA9HmqjyS7mD35NM", "postedAt": "2023-01-19T21:33:21.342Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "Kj7nigLf9hvNzjrsP", "user": {"username": "Pablo_Stafforini"}}, {"_id": "kvCyoBLkbhD6kMWAh", "postedAt": "2023-01-20T02:13:51.396Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>This comment turned out to be entirely correct.</p>", "parentCommentId": "JG4xB8xtwaQhgvLZ4", "user": {"username": "lc"}}, {"_id": "qQ94ugE5mSqjfsbLK", "postedAt": "2023-01-20T03:02:23.410Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>Yep, seems right. I guess I am glad the comment itself didn't get downvoted, but all the people who disagree-voted it sure should do some updating.</p>", "parentCommentId": "kvCyoBLkbhD6kMWAh", "user": {"username": "Habryka"}}, {"_id": "Xhvyc7Pte5CZttAg7", "postedAt": "2023-01-20T05:05:23.965Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<p>At the time of my writing this comment, the parent was at 25 karma and -31 agreement karma.&nbsp;</p><p>Seeing as Jim was absolutely correct, I think that the people who dismissed them out of hand should reflect on what manner of reasoning led them to do so.</p><p>EDIT: posted this before I saw that Ic had already made the same point.</p>", "parentCommentId": "JG4xB8xtwaQhgvLZ4", "user": {"username": "Lumpyproletariat"}}, {"_id": "oJHM3MRbeAYTwwaqu", "postedAt": "2023-06-26T09:54:28.842Z", "postId": "5vFmMXWsh6PaYjqab", "htmlBody": "<blockquote><p>I do still think it's very weird that FLI hasn't condemned Nya Dagbladet though — CEA did, after all, make it very clear very quickly what our <a href=\"https://www.centreforeffectivealtruism.org/blog/statement-on-recent-events\">stance on SBF</a> was.</p></blockquote><p>Please don't do this.</p><p>I think it's very unfair to act like there are clear standards in a gray area where those standards are just enough to cover your own ass.</p><p>The example I often think of is an adult brother and sister keeping in touch with their parents, where the brother decides the standard is to call them daily and does so, the sister decides the standard is to call them weekly and does so, and then the brother chastises the sister for not doing enough. (And perhaps it's easier for the brother to call daily, and perhaps the sister knows their parents find it annoying how often the brother calls, and perhaps the sister is doing other nice things for their parents etc.)</p><p>I feel a bit bad about singling you out because I think other orgs do this too (<a href=\"https://forum.effectivealtruism.org/posts/mzzPMrBjGpra2JSDw/ea-organizations-should-have-a-transparent-scope\">CE</a> being a recent example), but I guess I'd come to expect more from CEA as I generally consider them to be one of the more professional EA orgs.</p><p>I'm thankful that I haven't seen any more comments from you like this one or the <a href=\"https://forum.effectivealtruism.org/posts/5vFmMXWsh6PaYjqab/linkpost-fli-alleged-to-have-offered-funding-to-far-right?commentId=CnZibgrC4DLqbdCQB\">one above</a> in recent months, but I thought someone should say something about this comment too.</p>", "parentCommentId": "3CQAZR2j9GrsaNNq7", "user": null}]