[{"_id": "khiQfrCTxmmHjNWCj", "postedAt": "2023-07-26T19:30:54.127Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Great to see more independent actors moving into this space! Is there any interaction between MCF and Non-Linear Network?</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "TYbkngGTNqjwAquom", "postedAt": "2023-07-27T03:59:11.543Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>This is really great to see. Obviously, Open Phil and EA Infra have funded awesome projects, but it's true that having so many important decisions made by a small number of grant makers at those orgs can lead to group biases and echo chambers that may lead them to neglect other high-potential opportunities. I'd be curious to to see how a more decentralized group of less committed (in terms of time) grant makers fairs against a few full-time grant makers, but of course it's not a competition. Ultimately, we're all winners here, and more diversity and extra perspectives is almost universally a good thing.</p>", "parentCommentId": null, "user": {"username": "aaronmayer"}}, {"_id": "NPNdw9kXZoWJ5qHRn", "postedAt": "2023-07-27T05:15:01.580Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Just fyi the EA Infrastructure fund grantmakers are all part-time and have full-time jobs with some doing 'meta' work and others doing &nbsp;'object level' work. You can see who is on the team <a href=\"https://funds.effectivealtruism.org/team \">here</a>.</p>", "parentCommentId": "TYbkngGTNqjwAquom", "user": {"username": "calebp"}}, {"_id": "vcqifJzi8LiboM5FC", "postedAt": "2023-07-27T07:36:58.021Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>I continue to be impressed by the breadth and depth of stuff you and the rest of the CE team pump out, seemingly on a monthly basis!</p>", "parentCommentId": null, "user": {"username": "DevonFritz"}}, {"_id": "rdZDQdNnQCNEmPHNs", "postedAt": "2023-07-27T08:54:09.851Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>I was just thinking this</p>", "parentCommentId": "vcqifJzi8LiboM5FC", "user": {"username": "Tee"}}, {"_id": "2nmiHe5K5iPsPfk2w", "postedAt": "2023-07-27T09:16:26.187Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Just applied for <a href=\"https://forum.effectivealtruism.org/posts/MrLeZJDqghqM5cTXC/coaching-matchmaking-is-now-open-invest-in-community\">TBCT</a>! Incredibly happy to see this get set up. What a gift for this community it could be</p>", "parentCommentId": null, "user": {"username": "Tee"}}, {"_id": "9zuhEDGZYHXcfsQGx", "postedAt": "2023-07-27T16:55:05.022Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Really happy to see a more diversified funding landscape and I think this is very important. EA funds and Open Phil do a great job, but only a dozen people making most significant grants is likely going to lead to biases and knowledge gaps. It's good the group of people evaluating projects will expand and I like the strategy to focus on what's not being funded by EA funds and Open Phil.&nbsp;</p><p>I want to apply with our organisation (declined by EAIF multiple times, likely too small for Open Phil funding), but I also want to contribute as a member and evaluate projects where I might have some knowledge, especially in marketing, (for-profit) entrepreneurship and economy (areas where I believe I can bring most value comparative to current grantmakers).</p><p>Would that be a possible conflict of interest?&nbsp;</p><p>I'm going to apply in the upcoming week to be a member and apply with our org, but please decline my membership if you think there could be a conflict of interest. FYI I obviously don't want a part in our own grant process.&nbsp;</p><p>I also know organisations that were not funded by current EA grantmakers where I thought they should. What's your policy on being a member and encouraging these orgs to apply? Part of me would argue I would be above average in evaluating these projects because I know their work and founders, but I could also argue I might be too biased and should refrain from evaluating (but encouraging applications and independent evaluations). Like many on this forum, I'm concerned by the amount of people/orgs getting funded by current grant makers that are (in)directly linked to these organisations and people, but in some cases I do see that might lead to better decisions. I'm very interested to know what people think and your policies on potential conflicts of interest.&nbsp;<br><br>[EDIT]: I now see that there is a minimum of '$100,000 per year minimum of expected donations'. But in this post I see 'and philanthropic advisors each moving $100,000 or more per year to meta charities'. Just to confirm, do you need to donate 100K a year to the fund to be an advisor or do you need to <i>move </i>(of other people's money) 100K a year?</p>", "parentCommentId": null, "user": {"username": "BOAS"}}, {"_id": "xvAwTNWdB8tMdWWWP", "postedAt": "2023-07-27T18:16:51.546Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Thank you for doing this! I have been working in increasing funding diversity myself via Lightspeed Grants and SFF work, but my sense is there continues to be a huge amount of value in further increasing funding diversity and increasing evaluation capacity (Lightspeed sure ended up somewhat overwhelmed by the 600+ applications we got, and we won't be able to evaluate many of them to the level that I think would be best).</p><p>I also applied on behalf of Lightcone. Hope the funding round goes well!</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "B2ymWvpvsoS3v7Bgn", "postedAt": "2023-07-27T18:58:58.327Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Thanks for doing this Joey, Gage and Vilhelm, and thanks to all of the anonymous donors who are participating!</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "aC2EAuFusRQrtqNFK", "postedAt": "2023-07-28T11:17:45.881Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>We are connected to Nonlinear Network, but there is currently no interaction with them at least for this first round. We may interact with them in the future after our first round and depending on how well-aligned our goals end up being.</p>", "parentCommentId": "khiQfrCTxmmHjNWCj", "user": {"username": "gagemweston@gmail.com"}}, {"_id": "qDyNjZg2wenur2kMm", "postedAt": "2023-07-29T04:56:36.768Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Thanks for pulling this together! It's great to see more funders in the space</p>", "parentCommentId": null, "user": {"username": "JamesSnowden"}}, {"_id": "qHpeRr25LHpF5Zx3m", "postedAt": "2023-07-29T18:47:50.168Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>re conflict of interest concerns: I'd go ahead and apply for both membership as a donor and for funding for your project. Others may do the same. We are still considering how to weigh COI concerns against potential value of allowing those applications in, and plan to arrive at a more conclusive policy before deciding whether or not to admit members/applications.&nbsp;</p><p>Re referring other applications: similar to above, though I think there's less conflict here and would perhaps unfairly limit many good applications if we excluded merely because you are well acquainted with an applicant, so I would encourage them to apply and encourage you to encourage them too :)</p><p>Re $100K minimum: you do not need to donate $100K+ yourself, as long as you are in one way or another influencing $100K+ that could reasonably be expected to go toward applications from our circle. So advisors or grant-makers moving money to meta things are okay, although we prefer to maintain more distance from OP and EA Funds grant-makers. It is also ok if you expect to move slightly below $100K/year or you are uncertain how much it'll be – it'll be more of a judgement call from our circle there as to who we admit.</p><p>Since we're just getting started, we expect much of our plans and policies will change, though.</p>", "parentCommentId": "9zuhEDGZYHXcfsQGx", "user": {"username": "gagemweston@gmail.com"}}, {"_id": "MrxavZYAF8XDHd2kH", "postedAt": "2023-07-30T12:50:51.418Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>All clear Gage, thanks! Our application is in and I'll send the opportunity to some who I think should apply. I'll also apply as a member. I believe I'll have poor judgement on some areas (and be clear about that) but might add something meaningful to others like business models, economic viability and marketing.</p>\n", "parentCommentId": "qHpeRr25LHpF5Zx3m", "user": {"username": "BOAS"}}, {"_id": "qoYreTwTJE6Xrfu2Y", "postedAt": "2023-07-31T14:53:26.597Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Happy to see this. I've been concerned about the meta space not getting attention, hope this helps there.&nbsp;</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "QfgdxtBRtukhQhxzr", "postedAt": "2023-08-03T15:05:55.607Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Oh wow! I didn't know that! That makes their work even more impressive! 🙏</p>", "parentCommentId": "NPNdw9kXZoWJ5qHRn", "user": {"username": "aaronmayer"}}, {"_id": "qCeuqhnRMsZ9H4EZj", "postedAt": "2023-08-08T22:51:11.740Z", "postId": "5WLGmCg7vSfXeqSWC", "htmlBody": "<p>Very cool, I will definitely apply on behalf of <a href=\"https://forum.effectivealtruism.org/posts/EAiwxZN4Jiyup8d9G/glo-dollar-an-ethical-stablecoin-model-potential-impact-and\">my company</a>.&nbsp;</p><p>Incidentally, I asked in a <a href=\"https://forum.effectivealtruism.org/posts/7qzjdpBgBR8hBv2bN/what-is-the-right-number-of-ea-aligned-donation-advisors\">previous post</a>: \"Has there been meta-evaluator work to establish which of the evaluators/advisors qualifies as an effective charity?\" So I'm happy to see this initiative &nbsp;&nbsp;</p>", "parentCommentId": null, "user": {"username": "setgree"}}]