[{"_id": "QH7BzNc7TBABxmXD7", "postedAt": "2023-07-26T08:31:19.387Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<p>It is hard to advise on this without knowing your current situation. Both becoming a professor and becoming an influencer are career paths that are not easy to tread, and recommending one over the other will hinge on where you are in life currently - what is your age, educational background, subject interest (important re: professor), marketable hobbies or content niches (important re: influencer) etc.&nbsp;</p>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "XgxKGvyfHjTgi2nfJ", "postedAt": "2023-07-26T21:11:44.512Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<ul><li>Age: 19 years old</li><li>Education: 2 academic years left to complete undergraduate degree (in Education)</li><li>Subject interest: Emotional intelligence (relates to effective altruism, promoting positive values, mental health, etc.)</li><li>Content niche: Emotional intelligence (i.e., self-improvement, wellbeing, health, grit, motivation, empathy, passion, etc.)</li></ul>", "parentCommentId": "QH7BzNc7TBABxmXD7", "user": {"username": "Cole123"}}, {"_id": "LfBwZyFedg4zF7vnY", "postedAt": "2023-07-28T08:33:51.166Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<p>I cannot speak to the career of influencers, but if you were to opt for taking a shot at becoming a professor, the #1 priority should be to excel academically and take active steps towards getting into an as high-ranked program as you can for your grad studies.</p>", "parentCommentId": "XgxKGvyfHjTgi2nfJ", "user": {"username": "mhendric"}}, {"_id": "kAjRsmnBA5rv8skqW", "postedAt": "2023-07-28T17:07:27.410Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<p>Thank you! I have been looking into the Harvard Graduate School of Education.</p>", "parentCommentId": "LfBwZyFedg4zF7vnY", "user": {"username": "Cole123"}}, {"_id": "DhPyFPahMMxEpurpt", "postedAt": "2023-07-28T19:23:41.034Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<p>I am interested in becoming a professor of Education at an Ivy League institution. I looked at the faculty profiles of professors at Ivy League institutions and most of them have degrees from Ivy League institutions (i.e., high-ranked programs).</p>", "parentCommentId": "LfBwZyFedg4zF7vnY", "user": {"username": "Cole123"}}, {"_id": "x6vwrhwdwNGjRdRkn", "postedAt": "2023-07-30T18:52:17.083Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<p>Yes, if you intend to become an Ivy League professor, you need to get a degree from a top 5 institution of your field. Note that \"becoming an Ivy League professor in my field\" is somewhat akin to \"becoming a top athlete in my sport\", and similarly competitive - just like most folks wont break into the NFL or NBA, most academics (even super smart or diligent ones) will not make it into an Ivy League professorship. That is not meant to discourage you from trying, but you should realize that chances are slim even if you are really good.</p><p>Anyways, if that were your career path, you should try to<br>1. Excel in each course (4.0 GPA)</p><p>2. Make regular contact with your teachers (go to office hours to discuss material and questions etc). Try to find mentors, and try to heed their advice often.</p><p>3. Scour the web for resources on how grad applications in your chosen discipline work, and maximize what they'll require.&nbsp;</p><p>A challenge is to do all this while not losing the passion for your subject - which you should explore, love and enjoy while studying. So I would strongly recommend against this career path unless you feel very distinctly passionate about the subject.</p>", "parentCommentId": "kAjRsmnBA5rv8skqW", "user": {"username": "mhendric"}}, {"_id": "6Ee7ir9gnemqRzXmF", "postedAt": "2023-07-30T18:54:11.264Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<p>Unless education differs starkly from other disciplines, note that you will apply to <i>all</i> top programs, not one top program. Applying to one program would be foolish as the chance of getting accepted, even if you are a top candidate, is rather on the low end.</p>", "parentCommentId": "kAjRsmnBA5rv8skqW", "user": {"username": "mhendric"}}, {"_id": "HouGHfvnqHyKCXyMr", "postedAt": "2023-08-01T18:02:23.128Z", "postId": "5XetJFRqT5ajd5si6", "htmlBody": "<p>Based on my interests (problem areas, etc.) which career paths might you recommend that I check out other than professor/public intellectual?</p>", "parentCommentId": null, "user": {"username": "Cole123"}}]