[{"_id": "uB2Gcenv64vfZ6aHT", "postedAt": "2022-09-16T09:39:47.034Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>This poem really made me smile; thanks for writing it Luke :)</p>\n", "parentCommentId": null, "user": {"username": "Evie Cottrell"}}, {"_id": "vSyDGnKwDKP5nre3B", "postedAt": "2022-09-16T09:48:58.749Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>Thanks for letting me know 😀</p>\n", "parentCommentId": "uB2Gcenv64vfZ6aHT", "user": {"username": "Luke Freeman"}}, {"_id": "ERHq5Wd4CyJMnFcEa", "postedAt": "2022-09-16T13:40:09.620Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>Hey, I think an important question is, \"is it better for [the person asking this question] to donate or work directly\", and I think it's not healthy to try solving this question by trying to think if EA is more talent constrained or money constrained (approaching this as a complicated research question), but rather <a href=\"https://forum.effectivealtruism.org/posts/n7vQwzM2gdmCJbQaF/earn-to-give-usd1m-year-or-work-directly\">asking specific orgs what they prefer</a>. What do you think?</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "g9vgnFzQDbhxnuobc", "postedAt": "2022-09-16T15:58:12.765Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>I always appreciate reading your thoughts on the EA community; you are genuinely one of my favorite writers on meta-EA!</p>\n", "parentCommentId": null, "user": {"username": "starmz12345@gmail.com"}}, {"_id": "KHogftZdkNpW2am5w", "postedAt": "2022-09-16T22:47:59.413Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>Yep, absolutely!</p>\n<p>A lot will come down to comparative advantage and context and that’s not a bad way of finding out. That being said the organisation might not know well enough on many edge cases to say it to someone and it could fall prey to the social desirability bias etc. However, not hiring someone is sometimes a signal that the money is more valuable than the labour they’d get.</p>\n<p>Anyways, we are constrained on many fronts but also growing in many fronts. Sometimes there are cases where there are fewer constraints (eg lots of money earmarked but not enough talent) but those are narrow cases and don’t apply to “EA”.</p>\n<p>My main concern is how often I’ve seen people publicly write and say in person things along the lines that EA is overfunded (eg the examples I gave in my postscript ). It baffles me, concerns me, and I think does a lot of damage.</p>\n", "parentCommentId": "ERHq5Wd4CyJMnFcEa", "user": {"username": "Luke Freeman"}}, {"_id": "BvkJCEddHoyc2NBPp", "postedAt": "2022-09-16T22:48:59.338Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>Thanks Miranda, that is very kind of you to say!</p>\n", "parentCommentId": "g9vgnFzQDbhxnuobc", "user": {"username": "Luke Freeman"}}, {"_id": "8w7Y5jLRnaaQhJaL5", "postedAt": "2022-09-17T04:58:46.898Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>It seems worth it to me for EA to direct at least a fraction of its current reserves toward accomplishing smallish, tangible goals, to help create an image of legitimacy to the general public and increase the chances of continuing to attract funding in the future.</p>", "parentCommentId": null, "user": {"username": "TerracottaKleinBottle"}}, {"_id": "2sjHmvmPpW39g5BME", "postedAt": "2022-09-17T06:51:02.214Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>I agree we are still funding constrained. Minor point:</p><blockquote><p>Our spendthrift community dug into the data. We made money go further, we made things go better.</p></blockquote><p>Spendthrift: a person who spends money in an extravagant, irresponsible way. But do you mean the opposite? I've always thought the definition was confusing.</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "ep9jyCEBKaArRbWPw", "postedAt": "2022-09-17T17:42:18.156Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>I love this!</p>\n", "parentCommentId": null, "user": {"username": "NickFitz"}}, {"_id": "YgmJm7nZRQbp7bDwy", "postedAt": "2022-09-18T08:20:04.730Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>Ahah, TIL! That is confusing. Have changed to \"thrifty\".</p><p>Thanks for pointing that out 😀&nbsp;</p>", "parentCommentId": "2sjHmvmPpW39g5BME", "user": {"username": "Luke Freeman"}}, {"_id": "JKQiAhwA2C6fFARYm", "postedAt": "2022-10-04T12:29:09.667Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>Why can't someone donate and work directly?&nbsp;</p>", "parentCommentId": "ERHq5Wd4CyJMnFcEa", "user": {"username": "jlewars"}}, {"_id": "kGJYtLvXXg8NqAK78", "postedAt": "2022-10-04T22:08:56.441Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>I think Yonatan may have been talking about additionally donating the difference in salary from a higher paying job, but otherwise, yes – of course – a lot of people do both (ourselves included!).</p>", "parentCommentId": "JKQiAhwA2C6fFARYm", "user": {"username": "Luke Freeman"}}, {"_id": "PsSbD4wKB8ac9cKb9", "postedAt": "2022-10-05T06:11:34.438Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>+1 to Luke's answer</p><p>&nbsp;</p><p>I mainly want to push the EA away from \"is EtG cool or is working directly cool [for everyone]\" to \"have each person consider what's better for their specific case (probably by talking to orgs they could work for)\"</p>", "parentCommentId": "kGJYtLvXXg8NqAK78", "user": {"username": "hibukki"}}, {"_id": "WuTf5oFrnnB6LALja", "postedAt": "2022-10-05T06:19:56.811Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>[Mainly to <strong>Jack</strong>,] I also do have a prior that if you're both working directly and also donating, then the vast majority of your impact is probably coming from one of them.</p><p>I think so because:</p><ol><li>It would be an unlikely coincidence, I think, if they'd both have a similar amount of impact</li><li>Priors from <a href=\"https://www.lesswrong.com/posts/3p3CYauiX8oLjmwRF/purchase-fuzzies-and-utilons-separately\">Purchase Fuzzies and Utilons Separately</a> (I found this very convincing)</li><li>Priors from EA analyzing charities that improve the world in many ways, but we usually try picking only one of those \"ways\" to quantify the impact of the entire charity (which seems correct to me)</li></ol><p>Got thoughts about this?</p><p>(This is kind of off topic to the rest of my post but I think it's interesting)</p>", "parentCommentId": "PsSbD4wKB8ac9cKb9", "user": {"username": "hibukki"}}, {"_id": "j9EfybsNugqKmPWMS", "postedAt": "2022-10-05T08:04:02.636Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>Thanks for clarifying, both.</p>\n<p>Yes Yonatan, I think that's correct. It just surprises me how often people seem to say 'most of impact comes from my direct work <em>so I shouldn't donate at all</em>'.</p>\n<p>In almost all cases, direct work + donating &gt; direct work only</p>\n", "parentCommentId": "WuTf5oFrnnB6LALja", "user": {"username": "jlewars"}}, {"_id": "m4ZsqjyZxgYcpPwR3", "postedAt": "2022-10-05T11:01:40.229Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>While that is probably mostly true (afaik), note that (in my opinion) many direct workers aren't being paid enough (in the current situation, maybe it will change), so I'd hesitate \"pushing\" them to donate some of what they're getting</p>\n", "parentCommentId": "j9EfybsNugqKmPWMS", "user": {"username": "hibukki"}}, {"_id": "huEotixcHjbD8TH7G", "postedAt": "2022-10-06T09:20:13.306Z", "postId": "5Xio8uECTH3GqYARc", "htmlBody": "<p>So I guess this hinges on what we mean by \"enough\". If your position is \"most people in direct work are paid below their potential market value\" - yes, absolutely. But I don't really see that as relevant to \"are they paid enough to donate a %.\" If we considered those things to be the same, we could end up doing endorsing some strange ideas, e.g. \"I'm a consultant at Accenture paid $200k/year but I could be a consultant at McKinsey paid $400k/year, so I shouldn't have to donate.\"</p>\n<p>If we consider those questions separately, then \"enough\" looks different. Clearly most people in direct work are paid enough to survive in a high cost of living city in a high income country; many are paid enough to be comfortable; some are paid enough to be considered rich by any reasonable standard (top few % in their own country, let alone globally).</p>\n<p>One bit of signal here is that so many people in direct work do seem to be donating and don't seem to be making large sacrifices to do that.</p>\n<p>It sort of comes back to one of the original EA arguments - what is that extra worth to you versus someone else?</p>\n", "parentCommentId": "m4ZsqjyZxgYcpPwR3", "user": {"username": "jlewars"}}]