[{"_id": "rkdAs4AtXnLB3eCkF", "postedAt": "2022-12-18T22:22:28.540Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Wow! Just skimmed this, it looks pretty great -- nice thinking!</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "PdnT7njPo6qiidTKc", "postedAt": "2022-12-18T22:33:11.434Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>This is a really great idea, thanks for sharing it and I'm excited to hear about progress if you continue to pursue it.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "5k5BpaoywMqyRqKRM", "postedAt": "2022-12-18T23:10:13.506Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>🐥❤️ So excited by all this!!</p>\n", "parentCommentId": null, "user": {"username": "alene"}}, {"_id": "48SmyEFPfsBWg7yxr", "postedAt": "2022-12-18T23:51:00.235Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Fantastic, out-of-box thinking!</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "sjB3JWB3Xep7AqFPB", "postedAt": "2022-12-19T14:20:15.524Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Personally, I think the arguments put forth make sense. However, I'd simply like to caution whoever tries this that they might alienate far more potential allies purely by association with the meat industry. The benefit provided - an alliance of convenience with beef producers - will go away the moment the beef producers no longer consider it expedient, while a past association with the beef producers could be a major reputation risk for a very long time.<br><br>Not to say that such reputation risks are rational, but they exist.</p>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "HJ32DyfreyMHxTtGj", "postedAt": "2022-12-19T15:15:28.028Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Welp, this is it, this is my FTX , this is the thing that permanently makes me lose all faith In the EA movement. I am deleting my account on here after this message.</p>\n<p>I value the work of other groups in the EA community shining a light on exploited animals like fish and invertebrates , that have been largely abandoned by traditional animal rights organizations.</p>\n<p>But Every-time you gaze your eyes on “ coventional livestock” It feels like internal sabotage</p>\n<p>Wether it’s advocating for changes that Increase Chicken mortality <a href=\"https://docs.google.com/document/d/1mEoaEm9xRuVkX3nWggRPz700RU7_Z_QgRuEtQMWiMbM/edit\">https://docs.google.com/document/d/1mEoaEm9xRuVkX3nWggRPz700RU7_Z_QgRuEtQMWiMbM/edit</a></p>\n<p>Or wanting everyone to stop advocating for animals and being vegan because meat eaters find it annoying\n<a href=\"https://www.amazon.com/How-Create-Vegan-World-Pragmatic/dp/1590565703/ref=mp_s_a_1_1?adgrpid=55616130466&amp;gclid=Cj0KCQiAtICdBhCLARIsALUBFcHXj_Cq2z0IDy0Hgl82a5MGcaDZkhu9PtV4oc1NbhPRPeui0BhaRBwaAjT2EALw_wcB&amp;hvadid=409977028744&amp;hvdev=m&amp;hvlocphy=9007235&amp;hvnetw=g&amp;hvqmt=e&amp;hvrand=10492759388869879236&amp;hvtargid=kwd-335443252748&amp;hydadcr=12157_11118205&amp;keywords=how+to+create+a+vegan+world&amp;qid=1671462334&amp;sr=8-1\">https://www.amazon.com/How-Create-Vegan-World-Pragmatic/dp/1590565703/ref=mp_s_a_1_1?adgrpid=55616130466&amp;gclid=Cj0KCQiAtICdBhCLARIsALUBFcHXj_Cq2z0IDy0Hgl82a5MGcaDZkhu9PtV4oc1NbhPRPeui0BhaRBwaAjT2EALw_wcB&amp;hvadid=409977028744&amp;hvdev=m&amp;hvlocphy=9007235&amp;hvnetw=g&amp;hvqmt=e&amp;hvrand=10492759388869879236&amp;hvtargid=kwd-335443252748&amp;hydadcr=12157_11118205&amp;keywords=how+to+create+a+vegan+world&amp;qid=1671462334&amp;sr=8-1</a></p>\n<p>Or giving our money to junk food lobby groups that research suggests don’t help animals at all <a href=\"https://gfi.org/\">https://gfi.org/</a></p>\n<p><a href=\"https://www.cambridge.org/core/journals/public-health-nutrition/article/does-promoting-plantbased-products-in-veganuary-lead-to-increased-sales-and-a-reduction-in-meat-sales-a-natural-experiment-in-a-supermarket-setting/CB44968AAD1E86856D01CA47A7BC884\">https://www.cambridge.org/core/journals/public-health-nutrition/article/does-promoting-plantbased-products-in-veganuary-lead-to-increased-sales-and-a-reduction-in-meat-sales-a-natural-experiment-in-a-supermarket-setting/CB44968AAD1E86856D01CA47A7BC884</a></p>\n<p>And now straight up advocating for a world in which animals are still bred and slaughtered as commodities</p>\n<p>If I wanted to support groups in bed with the meat industry I would still be giving  money to the HSUS</p>\n<p>Next time i see the label “Effective Altruism” attached to anything , I’ ll interpret it as the warning colors it is.</p>\n", "parentCommentId": null, "user": {"username": "Vgvt"}}, {"_id": "mfHFJG6TMYTH8E3h3", "postedAt": "2022-12-19T15:55:56.795Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>My first impression is that this is a really exciting strategy to explore! Thanks for doing this, and please post updates :)</p><p>FWIW, I don't expect it to be that hard to find common ground with a cattle rancher about chicken welfare standards even with disagreement over the end goal, for all the great reasons you laid out in this post. (Though, it makes me wonder why ranchers wouldn't have already started this sort of lobbying without the nudge you're hoping to provide -- given how straightforward your points were, someone in the beef industry must have thought of this?)</p>", "parentCommentId": null, "user": {"username": "Kevin Kuruc"}}, {"_id": "mvYKwkaJaRYQWiDZA", "postedAt": "2022-12-19T16:09:36.402Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>I upvoted this despite not personally agreeing with it because I think it's a good demonstration of the reputational risks associated with this strategy.&nbsp;</p>", "parentCommentId": "HJ32DyfreyMHxTtGj", "user": {"username": "MHR"}}, {"_id": "PwDgek8kddNWTnydz", "postedAt": "2022-12-19T20:53:37.479Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>An interesting idea indeed!&nbsp;<br><br>But I think it is very difficult to achieve results this way, for several reasons:<br><br>1- Even if the beef industry wanted to push for welfare reforms for chickens, it would still be very hard. Almost all state-level animal welfare reform legislations in the US resulted from referendums allowed by those states' constitutions. For the other states and federal level, I think it would require a tremendous push to achieve legislative progress.&nbsp;<br><br>2- Although the beef industry might indirectly gain \"something\" from broiler welfare reforms (higher prices for broilers --&gt; beef being somewhat more price competitive). The poultry industry would directly lose \"a lot\" from broiler welfare reforms (higher costs). For that reason, even if the beef industry might consider pushing for broiler welfare reforms, they would immediately foresee that the poultry industry would be ready to die on this hill. So, since the beef industry (and its members) would not be willing to invest so much to achieve a slightly better price competition, it wouldn't take long before they realize that their rival (the poultry industry) would be more willing to fight, thus will almost surely win the legislative battle through more lobbying and more resource channeling (and some other counter moves such as you pointed out). As a result of these game theory stages (?), it would be more rational for the beef industry not to even try to fight against the poultry industry.&nbsp;<br><br>But I agree that the most important thing to consider in farmed animal advocacy is the impact on chicken and fish. I had written another <a href=\"https://forum.effectivealtruism.org/posts/rXBTE5tA5D34QooiS/mitigating-chicken-and-fish-suffering-by-closing-the-dairy-2\">forum post</a> arguing that increasing the supply of dairy in Asia and Africa (where dairy is scarce) might decrease the consumption of chicken, eggs, and fish in those populous and developing regions. I would be curious about what you think about it.</p>", "parentCommentId": null, "user": {"username": "Engin Arıkan"}}, {"_id": "4uPioQqCAsHEtn7Cp", "postedAt": "2022-12-19T22:20:59.612Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>I like the philosophy behind this--in order to win in politics we need to build coalitions. A good example of aligning opposing sides behind one bill is the recent Inflation Reduction Act, which was our nation's largest climate bill in history, but also had provisions that advanced fossil fuel interests.&nbsp;</p><p>I do have questions about practicality--how would somebody work with beef? Call them? Is there enough trust between animal welfare and beef to collaborate? Given that the big picture is to have the beef industry stop hurting/killing cows, would they want to work with a community that believes in its abolition? Are we talking Big Beef or small scale ranchers? If the latter, are local ranchers powerful enough to advance law?&nbsp;</p><p>I understand that we are not giving beef a free pass, but instead finding a meeting of \"strange bedfellows\" with mutually aligned interests. &nbsp;I like the concept: support from the beef industry immediately neutralizes any stigma associated with a bill being a \"vegan agenda\". There may be a need to test this on a local level before working on a national campaign.</p>", "parentCommentId": null, "user": {"username": "minthin"}}, {"_id": "AXK9M5AJeHCKJZBjA", "postedAt": "2022-12-19T22:49:38.693Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Thanks Kevin! You pose a great question, and I'm not sure about the answer. I'm hoping to learn more as I get further along with this. A few hypotheses come to mind:</p><ul><li>The large meat companies are the most powerful voices in the sector, and they have interest across all types of animal products. In particular, they have a lot of influence in the NCBA, which is the main group that one might think would be interested in these arguments.&nbsp;</li><li>Cultural factors that define the space of possible things that one could do to help ranchers. Similar to why I haven't really heard about this strategy from the animal welfare side of things, despite it being (as you say) pretty straightfoward.</li></ul>", "parentCommentId": "mfHFJG6TMYTH8E3h3", "user": {"username": "reyeahman0920"}}, {"_id": "QHJBdn8YJtPCDQcpw", "postedAt": "2022-12-20T01:57:24.589Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>I am going to disagree that \"the gains in animal welfare are likely to outweigh the sustainability cost.\" IMO, its very uncertain.<br><br>I think it's important to note that the EA Forum post you cite on this topic didn't take into account wild animal suffering, and it's calculations on human life loss from climate change rely on one study so the analysis could change if another study has a very different variable.</p><p>But I do commend the creatively in the political strategy, I think EA needs a lot more of that.</p>", "parentCommentId": null, "user": {"username": "Yelnats T.J."}}, {"_id": "TwvjJDHe7k9RdGm2i", "postedAt": "2022-12-20T03:04:13.340Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>I think this is a good idea.</p>\n<p>As a physician, I see health reasons to eat meat - B12 and other micronutrient deficiencies, and sufficient protein intake to keep and build muscle. During their rehabilitation, I often encourage my patients to eat more protein, and there is evidence for this. I have seen lots of anecdotal evidence of carnivore/ruminant diets helping with metabolic and inflammatory disease, and mental health (ref: <a href=\"http://diagnosisdiet.com\">diagnosisdiet.com</a>).</p>\n<p>I also understand the animal welfare arguments, I want the animals I eat to have a good life.</p>\n<p>In our family, we have settled  this discordance by buying whole or large fractions of a grass fed cow from a local farmer (Dobson Farm),  and that happy cow can feed our family for months (requires a large freezer). The farmer has proudly invited us to come visit the cows and see how happy they are in their field.</p>\n<p>Grass fed beef is not as tasty,  and this is known in the industry. The other things is that marrow bones and organ meats are quite nutritious, we also sometimes get ground beef with liver ground into it. Eating these parts of the animal is cheaper, and means that potentially fewer animals can feed us, as it is likely most beef cattle is produced for steak. Marketing the health and animal welfare benefits of grass fed and ‘non-steak’ cuts  may lead to better animal health and efficiency of the industry.</p>\n<p>Also -  I’ve heard of a farm in Ontario, Canada, which posts videos on their social media to show their happy chicks, if I lived closer, I would buy from this farm. Maybe more farms should live-stream their happy animals?</p>\n", "parentCommentId": null, "user": {"username": "Lauren Reid"}}, {"_id": "AHYXRMpN74JHkGr9A", "postedAt": "2022-12-22T00:40:47.560Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Same. I'll reiterate what I said above: EAs may be at risk of seriously underestimating the friction that exists between animal work within and outside of EA. My worry is that if even the <i>mention</i> of the idea is enough to get this sort of reaction, I suspect things could get even more heated if EAs, in large numbers, were to enthusiastically support an open alliance with an industry that has a mediocre reputation. Not to mention the ways this may plausibly undermine EA's credibility with environmentalists.&nbsp;</p><p>Another point (although something else that I need to sit with more) is that I'm not sure EA has anything interesting to offer the beef industry. That is, they <i>don't need EA </i>to accomplish their goals, and we don't have <i>any leverage whatsoever </i>from their perspective.&nbsp;</p>", "parentCommentId": "mvYKwkaJaRYQWiDZA", "user": {"username": "GreenByrdhouse"}}, {"_id": "8MDmwDcQhw5qxrzDw", "postedAt": "2022-12-22T13:16:59.442Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Brian Tomasik (2018) claims that <a href=\"https://reducing-suffering.org/how-much-direct-suffering-is-caused-by-various-animal-foods/\">pork, beef and meat cause far less animal suffering per meal than farmed fish, eggs, and chicken</a>.</p>\n<p>If he’s right, then even if we hold the total consumption of animal protein constant, it’d be good to shift consumption towards beef (or pork), and away from chicken (or farmed fish).</p>\n<p>Working with beef producers to improve regulations around chicken welfare—and presumably raise the price of chicken—would probably lead people to reduce some chicken meals with beef meals (e.g. “this chicken burger is expensive… I’ll have a beef burger instead”). This could be another important mechanism for reducing total harm—in addition to reducing average suffering per chicken meal, and somewhat reducing total meat consumption.</p>\n<p>(I’m only considering animal welfare here. An all-things-considered take would factor in environmental issues, public health, and so on…)</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "pYTpjNTwdYjzY9NLs", "postedAt": "2022-12-22T14:20:46.449Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Here are the 2022 numbers from faunalitics that broadly agree: <a href=\"https://faunalytics.org/animal-product-impact-scales/\">https://faunalytics.org/animal-product-impact-scales/</a>&nbsp;</p>", "parentCommentId": "8MDmwDcQhw5qxrzDw", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "5krkycjPCALGZD9tt", "postedAt": "2022-12-24T15:12:17.182Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": "<p>Thanks for the post, and I mostly agree with it; I don't see it as \"out of box\" at all. I think there's nothing more effective in farmed animals welfare than increasing animal products prices in relation to the prices of vegetables, and the trends in beef and chicken prices and consumption in the last few years support your premises.\nHowever, I wonder if you're considering this obstacle: The beef industry has a lot more in common with the chicken industry than with vegans. My prior is that they're more likely to support legislation with incentives for animal farming in general than to encourage enhancing regulation increasing the price of chicken products. And an increase in beef production might make vegetables more expensive, precisely because beef requires so much resources.\nYou may well end up with more than you asked for.</p>\n", "parentCommentId": null, "user": {"username": "Ramiro"}}, {"_id": "6rEoqAjBWcesqdA6B", "postedAt": "2022-12-19T17:14:41.599Z", "postId": "5XKAsEBMuxiycTHL7", "htmlBody": null, "parentCommentId": "sjB3JWB3Xep7AqFPB", "user": null}]