[{"_id": "KrZrsJ6dqwqnKJ6Qd", "postedAt": "2023-03-20T19:41:47.544Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Thanks for sharing your first-hand experience!</p>\n<blockquote>\n<p>FTX’s new CEO has slammed their accounting practices, and I don’t understand why he would be incentivized to lie here</p>\n</blockquote>\n<p>This is minor, but the more he paints a picture of FTX as a mess the harder a job it looks like he's taken on, the more slack people give him, and the better his efforts are likely to be judged in hindsight.  I doubt he would lie as in \"say things he knows are untrue\" but it's very common for people to end up with somewhat self-serving beliefs.</p>\n<p>EDIT: not saying their accounting practices were good!  Just that I expect them to be less bad than if I took the CEO's statements literally.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "7kJ2n53WhpgFxTZvy", "postedAt": "2023-03-21T00:54:51.519Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<blockquote><p>Somehow they were doing this while having audited financials, passing due diligence from major investors, etc.? And Sam was supposedly a great fundraiser but was circulating a balance sheet <a href=\"https://fullcrypto.substack.com/p/the-ftx-balance-sheet\"><u>with a $8B line item</u></a>&nbsp;for “hidden poorly labeled account”? I would find it pretty helpful for someone to explain what actually happened here because this violates my models of how the world works.</p></blockquote><p>Mine too, so I went digging. All in all, one can argue (<a href=\"https://news.bloomberglaw.com/business-and-practice/ftx-customers-take-enron-worldcom-path-in-legal-fight-for-cash\">and lawyers are</a>) that there were a lot of enablers. Certainly, people trying to actively dodge being noticed as they violate standard models, is a predictable (but not necessarily pin-pointable at the time) way our models end up failing us.&nbsp;</p><p><strong>For talk about audits specifically</strong>, there's <a href=\"https://news.bloombergtax.com/financial-accounting/ftx-collapse-puts-auditors-in-crosshairs-of-clients-regulators\">this</a> and <a href=\"https://markets.businessinsider.com/news/currencies/ftx-bankruptcy-sam-bankman-fried-fraud-auditor-armanino-fraud-2022-12\">this</a>. Essentially, \"the firm's auditors weren't tapped to look into internal controls at FTX, and auditing the internal workings of a company isn't a [legal] requisite for private corporations.\"&nbsp;Of course plenty of people feel that doesn't hold water, and a lawsuit by FTX customers is pending.<br>[Edit: A suit may be reasonable because audit firms know well they are commissioned to literally prove financial safety, and the audit was used in <a href=\"https://twitter.com/SBF_FTX/status/1421354721911115776?lang=en\">FTX's self-promotion</a>. That FTX was still very unsafe might prove there is negligence in the firm's business model. <strong>If I try to make this fit my model of the world, </strong>I get a thought like \"corporate greed incentivizes taking on clients that want useless/partial audits that end up being no better than shams, and you look the other way as you assist them in their likely sham\". I reflect more on this in the footnote which you don't have to read but&gt;&gt;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefx8h7zio3j5f\"><sup><a href=\"#fnx8h7zio3j5f\">[1]</a></sup></span><strong>]</strong></p><p><strong>For talk about investors</strong>, there is <a href=\"https://www.businesswire.com/news/home/20230223006026/en/Fishman-Haygood-Files-Most-Comprehensive-Suit-Yet-to-Recover-Funds-on-Behalf-of-Victims-of-FTX-Fallout\">this Feb 23rd piece</a> on a major lawsuit against a few different VC banks who helped out FTX. That piece is frickin nuts just by virtue of the amount of info they fit into a mere 5 paragraphs. Here's one quote to inspire a read:</p><blockquote><p>The suit alleges that some of world’s largest venture capital firms, including Sequoia Capital, SoftBank Group, and Thoma Bravo, learned through due diligence that FTX was a fraudulent scheme, but nevertheless incited the Fraud with billions in necessary capital, provided guidance and other support critical to the Fraud, and publicly promoted Bankman-Fried and FTX to keep the Fraud concealed until FTX could go public or cash out in a private sale</p></blockquote><p><strong>And of course there was </strong><a href=\"https://www.nytimes.com/2023/02/28/technology/ftx-guilty-plea-fraud.html\"><strong>internal assistance</strong></a>. I'd bet there were both (1) employees who knew what they were doing and (2) employees just following direction without realizing they were committing crimes or aiding in them.&nbsp;</p><p><strong>When it comes to improving models of how the world works</strong>, <a href=\"https://forum.effectivealtruism.org/posts/f9rFsbsd4rGLQfpQg/sadly-ftx\">Zvi's piece</a> had some good discussion of this (and much more!). It's long, but very worth reading even months later. Here's a section on VC:</p><blockquote><p>If you are a VC investor or taking VC money, the optimal amount of fraud, from your perspective, <i>is not zero. </i>You are <i>more excited </i>to invest if you <i>suspect </i>a fraud, those kinds of founders make good and make dreams real for you. So what if sometimes it all blows up? This is a game of hits for you, and you are much more worried about being asked why you <i>didn’t </i>invest in FTX than you should worry about people asking why you <i>were. </i>This goes double for crypto.&nbsp;</p><p><a href=\"https://twitter.com/diviacaroline/status/1592648452240216065\">Notice this VC <i>ready to invest in SBF again if he asked</i></a><i>. </i>Which, from a pure EV perspective, sure why not, same as they invested in Adam Neumann.&nbsp;</p><p>Therefore, I do not view ‘the VCs didn’t catch this’ as much of a justification. They are not supposed to catch it. It is not their job to catch it. I mean, they are supposed to do <i>some </i>things to catch <i>this level </i>of fraud, demanding voting shares and a company board in which they have a seat and doing proper audits, <strong>but they got </strong><i><strong>none </strong></i><strong>of that, because [SBF] needed to not allow it and the pitch was so good otherwise they went along (or, they took this to mean ‘this is a fraud’ and invested anyway thinking </strong><i><strong>they</strong></i><strong> were not the sucker, also plausible). [If] SBF said ‘you can’t check for fraud, invest or don’t’ then they are doing what they do, as much as we might hate that.</strong> <strong>Better to make that common knowledge. </strong>[emphasis mine]</p><p>The institutional traders are different. They face a different risk profile. If the exchange blows up in 10% of years that is a real drag on returns, whereas a VC expects 80% or more of their investments to go to zero, fraud or otherwise. Why did they trade?</p><p>Some of them Did Not Do the Research, no doubt. Others likely decided it was worth the risk. If FTX is an easy place to make money, because trading is very good against Alameda and generally they treat customers great, and they pay interest on USD and BTC, it is not difficult to imagine a decision that the blowup risk is worth taking, at least for some portion of one’s bankroll. Or one can say that if FTX goes down everything is terrible anyway, it’s already systemic risk, so assume it won’t fail.&nbsp;</p><p>Another play is to hedge the risk with a short position elsewhere, and put your leveraged longs at FTX since if FTX goes broke you would have gotten liquidated at Binance anyway.</p></blockquote><p>[Note: <strong>There could also be a section about lack of regulation here</strong>. As commented on <a href=\"https://forum.effectivealtruism.org/posts/5YKx6xGg8qz6jLKvF/some-comments-on-the-recent-ftx-time-article?commentId=EuxFYwKqZjGoQ8skf\">here. </a>From a \"how the world works\" POV, it is the mother of all permissiveness that allowed the rest, especially the useless audits. Global heuristic = Pretty nuts how much can go wrong with a regulation gap. But FTX also maybe would have found &nbsp;away around/already did break regulations so idk]&nbsp;</p><p>Anyway, just thought that all might interest you. Thank you for sharing your insights. Really useful stuff.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnx8h7zio3j5f\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefx8h7zio3j5f\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Interestingly, now the company has <a href=\"https://www.forbes.com/sites/emilymason/2022/12/15/ftx-accounting-firm-armanino-ends-crypto-audit-practice/?sh=6ba84dea362f\">stopped offering</a> crypto audits due to \"changing market conditions\". And I was going to say \"good of them to notice that the bare legal minimum is not enough for one of the most volatile, least regulated assets the world has ever seen, <i>eyeroll.</i>\" But actually that auditor firm is starting up crypto audits <a href=\"https://www.coindesk.com/tech/2023/03/01/former-accounting-team-of-ftx-us-auditor-armanino-sets-up-shop-as-the-network-firm/\">again under a different name</a>, sigh. It appears that they only stopped offering crypto audits because some non-crypto clients of the audit firm put pressure on them to do so. Those non-crypto clients felt that the auditor being known to audit crypto, might reduce the trust their potential clients/users end up having in their own commissioned audits. So it appears that, to make sure they can catch the most non-crypto and crypto audit contracts without one segment compromising the other, the auditors are just splitting them under two companies. I didn't see any mention of raising the crypto audit standards.</p><p>Additionally, through this process. I found mention a couple times that there are other auditing firms who do a much better job, \"The big 4\", and it is sort-of business wisdom to downgrade trust in audits that aren't from them. I was very surprised at this! There are auditors that business-people know to trust less? Then why do they exist? I guess because most consumers don't know enough to downgrade trust? One has to wonder if the big 4 would have put their stamp of approval on FTX or even many of this audit firm's non-FTX-clients. Probably not, right? And it makes you wonder why companies would go to these known-worse-auditors, especially if they can afford the best auditing like FTX should have been able to, if they <i>don't </i>have something to hide. If the goal is consumer trust, and a company doesn't have something to hide, that company should go to the best auditors, those that in-the-know-consumers trust the most, right? And surely a \"worse\" audit firm like this one would realize that is how the selection effect cookie crumbles. So lesser-known auditors should <i>expect</i> they will likely get a slew of clients who are nowhere near as reputable as those who hire the big 4 audit firms.&nbsp;</p><p>Sooo I think it's easy to argue that the minor audit firm(s) are negligent or intentionally turning a blind eye somewhere in their business model. But it's more a problem of incentives of corporate America and <i>low federal standards for private corporations allowing those incentives to play out in auditing contracts</i>, than it is a problem of a single actor. Even though the single actor/auditor might know damn well that they <i>will</i> end up giving a scammer cover eventually, maybe even frequently among their really wealthy clients like FTX who could have afforded better-known services. It appears to be part of the business model, chronic not acute. And as long as the private corporation and auditor are following the law in reviewing the bare minimum, oh well?</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "uAjhCvnA9iWyh7nys", "postedAt": "2023-03-21T01:21:31.052Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Eh, I still agree with Ben here. He said they are the worst financial documents he has ever seen, including Enron. And given he's the guy who steered Enron after bankruptcy, that's a concrete claim. And as the documents will surely all be submitted, he'd be putting his neck on the line to say such things if it weren't clearly like the most egregious thing you could imagine. <i>shrugs</i> :/</p>", "parentCommentId": "KrZrsJ6dqwqnKJ6Qd", "user": {"username": "Ivy_Mazzola"}}, {"_id": "BorxgX8RhgkhrdbeC", "postedAt": "2023-03-21T01:34:47.083Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Thanks for sharing this. I skimmed the relevant portions of the underlying lawsuit referenced in the press release, and my overall impression is \"fishing expedition.\" (Maybe more than that against the banks . . . but those banks just went bust and I doubt will have any money to pay a judgment, so I didn't bother skimming that). Not that there aren't reasonable grounds for a class-action law firm to engage in a fishing expedition, but they won't have any real evidence until they (possibly) survive motions to dismiss and get to discovery.</p>", "parentCommentId": "7kJ2n53WhpgFxTZvy", "user": {"username": "Jason"}}, {"_id": "nFoR7n2i3jiGtYK4o", "postedAt": "2023-03-21T02:05:41.892Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Glad you liked it. Perhaps I wasn't clear in purpose though. My point was not to talk about payouts, but to explain how things like this can happen. Because it \"violates model of how the world works\". [Edit: I cut stuff from here and expanded on it in footnote above]<br><br>I'm just saying there are systemic reasons why the fiasco got as far as it did.<br><br>[Edit: Ah this is one of those times I might be being dramatic, but I may as well say] I'm a bit sad to hear \"fishing expedition\" to this. But [so many EAs didn't feel similarly] about EA leaders taking some of the blame. I didn't want to bring EA into this particular comment, but gee. The actors I've named here had like 1000x the likelihood of knowing what was going on and being negligent or otherwise at fault somehow than non-Alameda EAs did. It's a bit flippant to call it a fishing expedition to go after others, if it is worth doing, and when our community has just spent so much time talking about EA fault. <i><s>dies a bit inside on behalf of EA</s> &nbsp;</i>Tbh they seem like reasonable suits to me in general, and I hope disincentivize something like this from happening again :/</p>", "parentCommentId": "BorxgX8RhgkhrdbeC", "user": {"username": "Ivy_Mazzola"}}, {"_id": "HvBjtBo3qs4P8iZE2", "postedAt": "2023-03-21T02:21:44.060Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>There are a lot of degrees of freedom in \"worst\".  I'm not that familiar with Enron's accounting, but my impression is their finances were careful and relatively normal looking, just intentionally over-complex and with 'aggressive' choices that made things look <em>much</em> better than they actually were?  So if you think sloppiness is a very serious issue in this business (a sensible position to hold!) then you might not need very much before the state of documentation can be 'worse' than Enron?</p>\n", "parentCommentId": "uAjhCvnA9iWyh7nys", "user": {"username": "Jeff_Kaufman"}}, {"_id": "8MHLGqxzo6Mgz76fN", "postedAt": "2023-03-21T02:38:41.505Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Yeah, turns out there was not only sloppiness here though. Like Enron, things were labelled to look much better than they really were. Like, stocks of coins held in such volumes and accounted as their current exchange price such that it looked like billions in net worth, IIRC, but of course if they would have sold the coins, the value of the coins would have plummeted far before they got through their sale order, so there is no way they could have expected to gather that much USD for the coins they held. This might be normal for stocks valuation? But my impression from the tone is that it was handled differently/worse. Maybe there were other things too, tbh I didn't look very closely. Plus there was SBF's backdoor (that was real right?) and I'd bet other weird money movements I assume he has noticed by now.</p>", "parentCommentId": "HvBjtBo3qs4P8iZE2", "user": {"username": "Ivy_Mazzola"}}, {"_id": "9i3DkmeireJmBnizQ", "postedAt": "2023-03-21T03:11:23.708Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Ben - thanks for this helpful information. It adds useful context to some of the FTX news.</p><p>One clarification question: in your Background section 5c, you suggested that '“EA leaders”... did not take enough preventative action and are therefore (partly) responsible for FTX’s collapse'</p><p>I agree that EA leaders might, in hindsight, have done a better job of distancing the EA movement from FTX and SBF, to protect EA's public reputation. However, I'm not sure how much leverage EA leaders could have had in preventing or delaying FTX's collapse.&nbsp;</p><p>If EA leaders had privately challenged Sam's bad accounting, fraudulent behavior, etc, back before fall2022, would he really have listened and behaved any differently? &nbsp;Would other FTX leaders or employees have behaved differently?</p><p>If a few EAs had come out as public whistleblowers questioning FTX's legitimacy, would any VCs, crypto influencers, crypto investors, major FTX depositors, or regulators have paid any attention? (Bearing in mind all crypto exchanges, protocols, and companies are subject to a relentless barrage of strategic or tactical 'fear, uncertainty, &amp; doubt' (FUD) from rival organizations, short-sellers, 'mainstream' (anti-crypto) financial journalism, and 'legacy' (anti-crypto) financial institutions.)</p><p>These are honest questions; I really don't know the answers, and I'd value any comments from people with more insider knowledge than I have.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "BeTFbLjnLQXxsfFMa", "postedAt": "2023-03-21T09:33:13.101Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>I want to emphasise that Background section 5 is the OP saying, \"The recent TIME article doesn’t make a very precise argument; here is my attempt at steelmanning/clarifying a major argument made in that article, which I will then respond to ... “EA leaders” ... did not take enough preventative action and are therefore (partly) responsible for FTX’s collapse\".</p><p>In other words, I don't think Ben is \"suggesting\" EA leaders are partly responsible. I think Ben is saying \"I think TIME is claiming they are? Well, &nbsp;here's my response...\"</p>", "parentCommentId": "9i3DkmeireJmBnizQ", "user": null}, {"_id": "tSQfaXEEyPphSoB3t", "postedAt": "2023-03-21T10:10:51.740Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>(But I'm glad you ask these questions; the apparent prevalence and persistence of hindsight bias in the EA movement today has been one of the biggest updates for me in recent months. I wondered if it might be because EA had generally been selecting for something like 'smart' but not 'rationalist,' but I'm not sure that the rationalists have fared much better and I think people outside both communities <i>do</i> tend to fare better in relation to EA events. My latest theory is just that I'd underestimated the allure of gossip, public shaming, witch hunts etc, and how easy it is to stir things up in an online world. Maybe I should read some of your work - could be a grounding counterweight to the lofty rationalist and altruistic ideals I have for myself and this community!)</p>", "parentCommentId": "BeTFbLjnLQXxsfFMa", "user": null}, {"_id": "REuEyxBicBokmaxEQ", "postedAt": "2023-03-21T15:36:43.619Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Ubuntu - thanks for the correction; you're right; I misread that section as reflecting Ben's views, rather than as his steel-manning of TIME's views. Oops.</p><p>So, please take my reply as a critique of TIME's view, rather than as a critique of Ben's view.</p>", "parentCommentId": "BeTFbLjnLQXxsfFMa", "user": {"username": "geoffreymiller"}}, {"_id": "q76CHXWF6EucYwHpJ", "postedAt": "2023-03-21T15:44:01.397Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Ubuntu - yes, regarding the underestimated 'allure of gossip, public shaming, witch hunts, etc', I think the moral psychology at work in these things runs so deep that even the most rationalist &amp; clever EAs can be prone to them -- and then we can sometimes deceive ourselves about what's really going on.</p><p>However, the moral psychology around public shaming evolved for some good adaptive reasons, to help deter bad actors, solve coordination problems, enforce social norms, virtue-signal our values, internalize self-control heuristics, etc. So I don't think we should dismiss them entirely. (My 2019 book 'Virtue Signaling' addresses some of these issues.)</p><p>Indeed, leveraging the power of these 'darker' facets of moral psychology (e.g. public shaming) has arguably been crucial in many effective moral crusades throughout history, e.g. against torture, slavery, sexism, racism, nuclear brinksmanship, chemical weapons, etc. They may still prove useful in fighting against AI X-risk...</p>", "parentCommentId": "tSQfaXEEyPphSoB3t", "user": {"username": "geoffreymiller"}}, {"_id": "ETh6xXmoqBaNYXPJK", "postedAt": "2023-03-21T15:55:39.358Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Thanks! I appreciate the link round up; the boundaries of what exactly was audited does seem helpful to know, and the claim that VCs have a preference for fraudulent founders is interesting. This is exactly the kind of comment I was hoping to get from my post.</p>", "parentCommentId": "7kJ2n53WhpgFxTZvy", "user": {"username": "Ben_West"}}, {"_id": "mK8h6WEKFHJbHQbYY", "postedAt": "2023-03-21T16:27:03.792Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Yeah that's a fair point to raise. I guess I'm just lamenting that these facets aren't refined enough to catch less false positives by this point.</p>", "parentCommentId": "q76CHXWF6EucYwHpJ", "user": null}, {"_id": "FArS5A4fh9vXkqBCf", "postedAt": "2023-03-21T17:24:59.760Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>In a universe where EA leaders had a sufficiently high index of suspicion, they could have at least started publicly distancing themselves from SBF and done one of two things: (1) stop working with FTXFF or encouraging people to apply, and/or (2) obtain \"insurance\" against fraudlent collapse by enlisting some megadonors who privately agreed in advance to immediately commit to repay all monies paid out to EA-aligned grantees if fraud ended up being discovered that inflicted relevant losses.</p>\n<p>Public whistleblowing would likely have been terrible . . .if the evidence were strong enough (which I really doubt it was) then it should have been communicated to the US Department of Justice or another appropriate government agency.</p>\n", "parentCommentId": "9i3DkmeireJmBnizQ", "user": {"username": "Jason"}}, {"_id": "Lh3KMcz4Rg9FjRriE", "postedAt": "2023-03-21T17:37:38.344Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<blockquote>\n<p>There are auditors that business-people know to trust less? Then why do they exist? I guess because most consumers don't know enough to downgrade trust?</p>\n</blockquote>\n<p>Maybe the big 4 are enough more expensive that it's common for people to go with other firms for reasons other than \"we're doing fraudulent stuff and hope to sneak it past auditors\"?  And so even if you would be able to afford one of the big 4 it doesn't send a strong signal by going with someone else?</p>\n", "parentCommentId": "7kJ2n53WhpgFxTZvy", "user": {"username": "Jeff_Kaufman"}}, {"_id": "bxY4o6xsnZyDmnANm", "postedAt": "2023-03-21T17:47:58.984Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Yeah my thoughts exactly. Or, it doesn't send a big signal to non-finance people. But like, I think it should send a signal to people in finance, eg the auditors. That FTX should have been able to afford a different service and yet didn't. Or maybe, idk, should have revealed their internals for different certification (better than GAAP cert idk, I know nothing). I just think it should have raised flags for the auditor. If someone is enlisting you for purposes of increasing trust but they are clearly not doing their damnedest, according to their abilities, to ensure that trust is accurate. The US consumers can't be expected to know the difference, but the auditor should. I think.</p>", "parentCommentId": "Lh3KMcz4Rg9FjRriE", "user": {"username": "Ivy_Mazzola"}}, {"_id": "EuxFYwKqZjGoQ8skf", "postedAt": "2023-03-21T18:20:24.154Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>In general, standard corporate audits aren't intended to be intelligible by consumers but instead by investors and regulators. It's shocking that FTX's regulator in the Bahamas apparently did not require a clean audit opinion addressing internal controls, and maybe no US regulator required it for FTX US either.</p>\n<p>At present, my #2 on who to blame (after FTX insiders in the know) is the regulators. It's plausible the auditors did what they were hired to do and issued opinion letters making it clear what their scope of work was in ways that were legible to their intended audience. I can't find any plausible excuse for the regulators.</p>\n", "parentCommentId": "bxY4o6xsnZyDmnANm", "user": {"username": "Jason"}}, {"_id": "rthrFmrcZEbEsRe8o", "postedAt": "2023-03-21T18:37:24.795Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>That makes sense. It is really shocking. I agree on blaming regulators [although I don't give others a pass].</p>\n<p>[I think a section on regulations def belongs from the POV of improving world models too. Before I added my long thinking-out-loud footnote, I didn't realize just how much it all points at regulators as the  original permissiveness break.]</p>\n", "parentCommentId": "EuxFYwKqZjGoQ8skf", "user": {"username": "Ivy_Mazzola"}}, {"_id": "dNodt6CBDpff92dkc", "postedAt": "2023-03-21T22:38:24.518Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Your summary of the article's thesis doesn't seem right to me:</p><blockquote><p>b. Even though those EAs (including myself) quit before FTX was founded&nbsp;and therefore could not have had any first-hand knowledge of this improper relationship between AR and FTX, they knew things (like information about Sam’s character) which would have enabled them to predict that something bad would happen</p><p>c. This information was passed on to “EA leaders”, who did not take enough preventative action and are therefore (partly) responsible for FTX’s collapse</p></blockquote><p>I interpreted the article as arguing more that EA leaders should not have promoted FTX / Sam as a model to look up to, or aligned themselves with him, rather than that they should have somehow prevented the fraud.</p><p>The article has this to say about the knowledge and responsibility of early employees:</p><blockquote><p>None of the early Alameda employees who witnessed Bankman-Fried’s behavior years earlier say they anticipated this level of alleged criminal fraud. There was no “smoking gun,” as one put it, that revealed specific examples of lawbreaking. Even if they knew Bankman-Fried was dishonest and unethical, they say, none of them could have foreseen a fraud of this scope.</p></blockquote><p>... which really doesn't sound to me like it's blaming those early employees for what happened. If anything, they come across as the heroes of the story!</p><p>In contrast, what seems to be particularly highlighted in the article is Will MacAskill's association with Sam:</p><blockquote><p>Even after Bankman-Fried left the board of CEA, he retained MacAskill’s support, both in public and private. In a 2022 interview on the 80,000 Hours podcast, MacAskill describes himself as “remarkably aligned with Sam,” and said the FTX Future Fund could be a “an enormous inflection point for EA.” FTX advertisements used the language of effective altruism. “I’m on crypto because I want to make the biggest global impact for good,” read one FTX ad, which featured a photo of Bankman-Fried.</p></blockquote><p>So the thesis of the article seems to me more like, \"EA leaders (esp. Will) should have known this guy was sketchy and stayed away.\" rather than \"EA leaders should have prevented the FTX fraud.\"</p>", "parentCommentId": null, "user": {"username": "ESRogs"}}, {"_id": "NMZKaeXCuFeYWkt4Y", "postedAt": "2023-03-21T22:55:12.247Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<blockquote><p>Sam was fine with me telling prospective AR employees why I thought they shouldn’t join (and in fact I did do this)</p></blockquote><p>Didn't quite follow this part. Is this referring to while you were still at AR or subsequently?</p><p>If it was while you were still working there, that seems pretty normal. Not every candidate should be sold on the job. Some should be encouraged not to join if it's not going to be a good fit for them. Why would this even be controversial with Sam? Or were you telling them not to join specifically because of criticisms you had of the CEO?</p><p>If it was subsequent, how do you know he was fine with it? What would he have done if he wasn't fine with it?</p>", "parentCommentId": null, "user": {"username": "ESRogs"}}, {"_id": "gatjkSsGhfbL3op9c", "postedAt": "2023-03-21T23:22:05.941Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>The article reads to me like it's trying to get away with insinuating that EA leaders somehow knew about or at least suspected the fraud, based on what they were told by employees who had no such suspicions.</p><p>They take pains to emphasise the innocence of their sources, of course - I agree that they're painted as the heroes of the story (emphasis mine):&nbsp;</p><blockquote><p>None of the <strong>early Alameda employees</strong> who witnessed Bankman-Fried’s behavior years earlier say they anticipated this level of alleged criminal fraud. There was no “smoking gun,” as one put it, that revealed specific examples of lawbreaking. Even if they knew Bankman-Fried was dishonest and unethical, they say, <strong>none of them</strong> could have foreseen a fraud of this scope.</p></blockquote><p>While suggesting that despite this, EA leaders somehow knew (emphasis mine):</p><blockquote><p>When Alameda and Bankman-Fried’s cryptocurrency exchange FTX imploded in late 2022, these same effective altruist (EA) leaders <strong>professed</strong> outrage and ignorance.</p><p>...</p><p>Multiple EA leaders knew about the <strong>red flags</strong> surrounding Bankman-Fried</p><p>...</p><p>“I was shocked at how much of <strong>what came out about FTX rhymed with the concerns we raised </strong>in the early days ... <strong>It was the same thing</strong>. All of the same problems.”</p><p>...</p><p>In a planning document prepared for that confrontation and reviewed exclusively by TIME, they accuse him of “gross negligence,” “willful and wanton conduct that is reasonably considered to cause injury,” and “willful and knowing violations of agreements or obligations, particularly with regards to creditors”—all <strong>language that echoes the U.S. criminal code.</strong></p></blockquote><p>So I don't think the thesis of the article is simply, \"EA leaders (esp. Will) should have known this guy was sketchy and stayed away.\"</p><p>And let's be honest, \"These people said some positive things about a sketchy rich guy and gave him philanthropic advice\" is not a story - they wouldn't be writing it if that was what they were trying to convey.</p><p>\"These people knew about one of the biggest financial frauds in U.S. history but didn't try to stop it\" - now that's a story.</p>", "parentCommentId": "dNodt6CBDpff92dkc", "user": null}, {"_id": "2ZLzwcsQr2kba2hGC", "postedAt": "2023-03-21T23:56:55.086Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<blockquote><p>These people knew about one of the biggest financial frauds in U.S. history but didn't try to stop it</p></blockquote><p>I think you're stretching here. Nowhere in the article does it suggest that the EA leaders actually knew about ongoing fraud.</p><p>It just says (as in the quotes you cited), that they'd been warned Sam was shady. That's very different from having actual knowledge of ongoing fraud. If the article wanted to make that claim, I think it would have been more direct about it.</p>", "parentCommentId": "gatjkSsGhfbL3op9c", "user": {"username": "ESRogs"}}, {"_id": "RafDmFbSv685GrhXe", "postedAt": "2023-03-21T23:58:46.190Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>I characterized the lawsuit is a fishing expedition because I saw no specific <i>evidence</i> in the complaint about what the VC firms actually knew -- only assumptions based on rather general public statements from the VCs. And the complaints allege -- and I think probably have to allege -- <i>actual knowledge</i> of the fraudulent scheme against the depositors. The reason is that, as a general rule, the plaintiff has to establish that the defendant owed them a duty to do or refrain from doing something before negligence liability will attach.&nbsp;</p><p>Of course, you have to file the lawsuit in order to potentially get to discovery and start subpoenaing documents and deposing witnesses. It's not an unreasonable fishing expedition to undertake, but I think the narrative that the VCs were sloppy, rushed, or underinvested on their due dilligence is much more likely than the complaint's theory that they knew about the depositor fraud and actively worked to conceal it until FTX did an IPO and they unloaded their shares.</p><p>(I certainly do not think anyone in EA knew about the fraudulent scheme against depositors either.)</p>", "parentCommentId": "nFoR7n2i3jiGtYK4o", "user": {"username": "Jason"}}, {"_id": "2HZznLR7quqysKfNi", "postedAt": "2023-03-22T01:18:53.408Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>I think it would be problematic if a society heaped full adoration on risk-takers when their risks worked out, but doled out negative social consequences (which I'll call \"shame\" to track your comment) only based on ex ante expected-value analysis when things went awry. That would overincentivize risktaking.&nbsp;</p><p>To maintain proper incentives, one could argue that society should map the amount of public shame/adoration to the <i>expected value</i> of the decision(s) made in cases like this, whether the risk works out or not. However, it would be both difficult and burdensome to figure out all the decisions someone made, assign an EV to each, and then sum to determine how much public shame or adoration the person should get.&nbsp;</p><p>By assigning shame or adoration primarily based on the observed outcome, society administers the shame/adoration incentives in a way that at least makes the <i>EV</i> of public shame/adoration at least somewhat related to the EV of the decision(s) made. Unfortunately, that approach means that people whose risks don't pan out often end up with shame that may not be morally justified.</p>", "parentCommentId": "q76CHXWF6EucYwHpJ", "user": {"username": "Jason"}}, {"_id": "aqjmBdycrnESLjMBi", "postedAt": "2023-03-22T03:40:19.512Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>I'm surprised by all the disagree votes on a comment that is primarily a <i>question</i>.</p><p>Do all the people who disagreed think it's obvious whether Ben meant while he was working at AR or subsequently? If so, which one?</p><p>(I'm guessing the disagree votes were meant to register disagreement with my claim that it's relatively normal for interviewers / employers to tell candidates reasons a job might not be a good for them. Is that it, or something else?)</p>", "parentCommentId": "NMZKaeXCuFeYWkt4Y", "user": {"username": "ESRogs"}}, {"_id": "MXXHiQLBJSGXpGWtG", "postedAt": "2023-03-22T13:47:36.302Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>It was both.</p><p>And yeah, the article reports Sam telling someone that he would \"destroy them\", but I don't fully understand the threat model. I guess the idea is that Sam would tell a bunch of people that I was bad, and then I wouldn't be able to get a job or opportunities in EA?</p><p>I guess I don't know for sure that Sam never attempted this, but I can't recall evidence of it.&nbsp;</p>", "parentCommentId": "NMZKaeXCuFeYWkt4Y", "user": {"username": "Ben_West"}}, {"_id": "eLqZp4aYCMMmxf4f5", "postedAt": "2023-03-23T17:12:00.835Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Got it, thanks!</p>", "parentCommentId": "MXXHiQLBJSGXpGWtG", "user": {"username": "ESRogs"}}, {"_id": "Gthy7rzMP2d5TkL7n", "postedAt": "2023-03-25T15:18:37.178Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>FWIW the former CEO of FTX US <a href=\"https://twitter.com/BrettHarrison88/status/1614373850950828032\">also claimed</a> this:</p><blockquote><p>In early April 2022, my eleventh month, I made one last try. I made a written formal complaint about what I saw to be the largest organizational problems inhibiting FTX’s future success. I wrote that I would resign if the problems weren’t addressed.</p><p>29/49 In response, I was threatened on Sam’s behalf that I would be fired and that Sam would destroy my professional reputation. I was instructed to formally retract what I’d written and to deliver an apology to Sam that had been drafted for me.</p></blockquote><p>The threat model is still unclear, but this is at least somewhat corroborating evidence that Sam is not above using threats in such situations.</p>", "parentCommentId": "MXXHiQLBJSGXpGWtG", "user": {"username": "Linch"}}, {"_id": "aFdjuopaqpvpCXbE7", "postedAt": "2023-03-25T23:12:57.781Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>He gives more details in this recent interview: <a href=\"https://youtu.be/yXgDlIlB93A?t=5625\">https://youtu.be/yXgDlIlB93A?t=5625</a></p><p>He also briefly talks about what he heard about what happened at Alameda: <a href=\"https://youtu.be/yXgDlIlB93A?t=2859\">https://youtu.be/yXgDlIlB93A?t=2859</a></p>", "parentCommentId": "Gthy7rzMP2d5TkL7n", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "ASmtRXeMhawaP6tAo", "postedAt": "2023-03-26T11:37:54.735Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<blockquote>\n<p>The threat model is still unclear</p>\n</blockquote>\n<p>Maybe the threat was via Sam being influential and people checking in with him about past employees?</p>\n<blockquote>\n<p>41/49 After I left FTX US and up until November, nearly every conversation I had with a venture capitalist about my new company eventually came around to the same kind of question: “Is FTX investing? Is Sam okay with you doing this? Do you mind if we confirm with him?”</p>\n</blockquote>\n", "parentCommentId": "Gthy7rzMP2d5TkL7n", "user": {"username": "Jeff_Kaufman"}}, {"_id": "8psNJzyBaTskr2Mku", "postedAt": "2023-03-26T13:21:08.672Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>And as a general rule most people try to avoid making enemies out of people who they perceive to have lots of power/influence when possible. So their threat model doesn't necessarily have to be terribly well-defined to be effective at accomplishing the powerful/influential person's objective.</p>\n", "parentCommentId": "ASmtRXeMhawaP6tAo", "user": {"username": "Jason"}}, {"_id": "FXpu3D5QW4rq3Amfd", "postedAt": "2023-05-03T19:42:18.933Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<blockquote><p>And it makes you wonder why companies would go to these known-worse-auditors, especially if they can afford the best auditing like FTX should have been able to, if they <i>don't </i>have something to hide.</p></blockquote><p>Complying with an audit is expensive, and not just in money.</p><p>A thorough audit in progress is going to disrupt the workflow of all or most of your company in order to look at their daily operations more closely. This reduces productivity and slows down the ability to change anything, even if nothing improper is happening. It is expensive and disruptive.</p><p>A thorough audit is also going to recommend changes. Not just changes required to be technically in compliance, but ones which will make it easier to audit for compliance in the future and ones which remove something that could potentially be mistaken for bad behavior in a dim light. Making those changes is expensive and disruptive.&nbsp;</p><p>If you don't need extremely high levels of trust from your customers and partners, choosing to receive a thorough audit means you're paying a bunch of unnecessary costs. Much better to get a more lax audit, which is less disruptive to have ongoing and less disruptive to handle once the results are in. Better still if it also costs less money.&nbsp;</p><p>The correct audit is the one that provides your customers and clients - and/or your own management - with exactly as much trust and reassurance as you need them to get and no more. Anything less and you lose business that doesn't trust you; anything more and you're paying a cost for a benefit you don't actually benefit from.</p>", "parentCommentId": "7kJ2n53WhpgFxTZvy", "user": {"username": "Czynski"}}, {"_id": "cjKA4voJhqdoqzBx6", "postedAt": "2023-05-03T23:35:35.539Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Corporations have their own legal personhood; it's difficult to see how the corporation's interest could be served by such a shoddy audit that failed to detect apparently unsophisticated, and certainly massive, raids on the corporate fisc by insiders.</p>\n", "parentCommentId": "FXpu3D5QW4rq3Amfd", "user": {"username": "Jason"}}, {"_id": "hMfFvJxDaN6GoyHX7", "postedAt": "2023-05-03T23:44:41.746Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>That wasn't the question. The question was why <i>any</i> company would go to less-than-maximally-trustworthy auditors.</p>", "parentCommentId": "cjKA4voJhqdoqzBx6", "user": {"username": "Czynski"}}, {"_id": "Yw4pjRW3Ek6wjmZ9G", "postedAt": "2023-05-03T23:46:07.173Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Also, the only <i>known </i>raids on the corporate assets happened post-crash and therefore long post-audit. Under the espoused worldview of the management, everything before that was plausibly 'good for the company'. In that it benefitted the company in raw EV across all possible worlds with no discount rate for higher gains or for massive losses.</p>", "parentCommentId": "cjKA4voJhqdoqzBx6", "user": {"username": "Czynski"}}, {"_id": "oixFqcaNHL6fzB2Ri", "postedAt": "2024-01-17T07:02:15.300Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>I'm sorry to hear to join Alameda under the impression that it would be the opposite of what it became to be, like happened to so many others, is the reason you quit the company you had founded. I didn't know you stopped working at the company you founded to work at Alameda.</p>\n<p>At the time, I thought you had maybe sold your stake in it or something so you'd have a lot of cash to donate while moving onto an opportunity to do way more good in some other job at the advice of 80k or whoever.\nI thought it seemed strange you had left the company you founded then, given that it seemed unlikely you could find that much of a higher-impact job that would outweigh the value of the money you could gain to donate if you stuck at Health eFilings for a while longer. I was sad you left the company at that point because it seemed to me you could've gotten more good done there. I was glad to hear you were hired at the CEA, though I felt like it was strange to learn about your exciting new job a few months after you stopped working at Health eFilings, when I thought it's something you'd want to tell the rest of us about right away.</p>\n<p>In a way, I was right about all of that. I wish I had read this post when you first published it last year, though it's still interesting to be someone who has also participated in the EA community for that long and to know the fuller story now.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "qnxr48LKrC6hv7nKR", "postedAt": "2024-01-18T18:35:51.823Z", "postId": "5YKx6xGg8qz6jLKvF", "htmlBody": "<p>Thanks Evan, I appreciate the kind words!</p><p>And yeah, in retrospect staying at HeF would almost certainly have been more valuable, but oh well...</p>", "parentCommentId": "oixFqcaNHL6fzB2Ri", "user": {"username": "Ben_West"}}]