[{"_id": "RgeYJecmYconFsSis", "postedAt": "2022-09-27T23:05:09.489Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>Interestingly enough, I sort of want to say that your movement examples are interesting mostly in their failure modes, albeit the anti-vax movement was probably the closest to success. However AGI is a new problem, so sustained backlash could plausibly slow or stop AGI as long as it's bipartisan.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "DK7Qz7mRpoYpDhzPA", "postedAt": "2022-09-27T23:32:39.010Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>What do imagine \"anti-AI backlash\" would look like? &nbsp;Comparing it to BLM also seems a bit odd to me, especially by you saying that BLM \"stigmatized some previously accepted behaviors and values\". &nbsp;What behaviours and values were stigmatized by BLM? and what behaviours and values do you see as having the potential to be stigmatized with regards to AI?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lauren Maria"}}, {"_id": "6rHe4ttsGTPAZHrKF", "postedAt": "2022-09-28T00:54:09.216Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>More importantly, BLM backfired on it's goals.</p>\n", "parentCommentId": "DK7Qz7mRpoYpDhzPA", "user": {"username": "Sharmake"}}, {"_id": "fNeyGijHntBaJhyKf", "postedAt": "2022-09-28T01:38:33.013Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<blockquote><p>What behaviours and values were stigmatized by BLM?</p></blockquote><p>Behaviours like police traffic stops, disputing people of colour's lived experiences, or <a href=\"https://dontcallthepolice.com/about/\">calling the cops</a> in response to disturbances or crimes, and values like support for the police or fear of crime.</p>", "parentCommentId": "DK7Qz7mRpoYpDhzPA", "user": {"username": "Larks"}}, {"_id": "NodYEFcxptns5YisN", "postedAt": "2022-09-28T04:14:14.221Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>I think the results being surprising are indicative of EAs underestimating how likely this is. &nbsp;AI has many bad effects; social media, bias + discrimination, unemployment, deepfakes, etc. &nbsp;Plus I think sufficiently competent AI will seem scary to people; a lot of people aren't really aware of recent developments but I think would be freaked out if they were. &nbsp;I think &nbsp;we should position ourselves to utilize this backlash if it happens.</p>", "parentCommentId": null, "user": {"username": "NickGabs"}}, {"_id": "azyy7MsZ5Rmp43tsM", "postedAt": "2022-09-28T06:56:21.949Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>I think if there is major labor displacement by AI there will be a backlash just based on historical precedent. I think it would be much weirder if people were happy or even neutral about being replaced. I think the idea that massive amounts of people will be able to be retrained especially if they are middle aged is unrealistic. Especially since most of the jobs that are prone to replacement are those that are low or middle skill and retraining to a higher skill job requires quite a bit of effort. The other side of the coin is that the demographic shift that will happen in the coming decades will keep the labor market tight enough to prevent automation having such a huge impact. The increased automation may just make up for the lower labor force participation.</p>\n", "parentCommentId": null, "user": null}, {"_id": "FYK94xxgqitCsNvN2", "postedAt": "2022-09-28T18:23:47.874Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>Yes, I think that once AI systems start communicating with ordinary people through ordinary language, simulated facial expressions, and robot bodies, there will be a lot of 'uncanny valley' effects, spookiness, unease, and moral disgust in response.&nbsp;</p><p>And once technological unemployment from AI really starts to bite into blue collar and white collar jobs, people will not just say 'Oh well! Life is meaningless now, and I have no status or self-respect, and my wife/husband thinks I'm a loser, but universal basic income makes everything OK!'</p>", "parentCommentId": "NodYEFcxptns5YisN", "user": {"username": "geoffreymiller"}}, {"_id": "7phpwgeoPnZZytTxu", "postedAt": "2022-09-28T18:26:10.057Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>Good points. Collapsing birth rates and changing demographics might slightly soften the technological unemployment problem for younger people. But older people who have been doing the same job for 20-30 years will not be keen to 'retrain', start their careers over, and make an entry-level income in a job that, in turn, might be automated out of existence within another few years.</p>", "parentCommentId": "azyy7MsZ5Rmp43tsM", "user": {"username": "geoffreymiller"}}, {"_id": "kswcGGpiB8w2Lciiz", "postedAt": "2022-09-28T18:28:33.468Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>Yes; it might also happen that AGI attitudes get politically polarized and become a highly partisan issue, just as crypto almost became (with Republicans generally pro-crypto, and Democrats generally anti-crypto). Hard to predict which direction this could go -- Leftist economic populists like AOC might be anti-AI for the unemployment and inequality effects; religious conservatives might be anti-AI based more on moral disgust at simulated souls.</p>", "parentCommentId": "RgeYJecmYconFsSis", "user": {"username": "geoffreymiller"}}, {"_id": "YoEJJDDaqS9tvM8Ak", "postedAt": "2022-09-28T18:31:51.840Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>Lauren - I was thinking of how BLM stigmatized certain policing methods such as chokeholds, rough restraint tactics, etc (that had been previously accepted).</p><p>The analogy would be, an anti-AI movement could stigmatize previously accepted behavior such as doing AI research without any significant public buy-in or oversight, which would be re-framed as 'summoning the demon', 'recklessly endangering all of humanity', 'soulless necromancy', 'playing Dr. Frankenstein', etc.</p>", "parentCommentId": "DK7Qz7mRpoYpDhzPA", "user": {"username": "geoffreymiller"}}, {"_id": "PzwEfk34kmp3qf82s", "postedAt": "2022-09-29T16:41:37.475Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>Thanks, that’s helpful.</p>\n", "parentCommentId": "YoEJJDDaqS9tvM8Ak", "user": {"username": "Lauren Maria"}}, {"_id": "n9fWnpBJDHKxuJtii", "postedAt": "2022-09-29T20:36:01.878Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>I agree, but with a caveat: EA should be willing to ditch any group that makes it a partisan issue, rather than a bipartisan consensus. Because I can easily see a version of this where it gets politicized, and AI safety starts to be viewed as a curse word similar to words like globalist, anti-racist, etc.</p>\n", "parentCommentId": "NodYEFcxptns5YisN", "user": {"username": "Sharmake"}}, {"_id": "ZX3jJAqGe9ep9QxFA", "postedAt": "2022-09-29T20:51:11.604Z", "postId": "5ZyLZjgJzyZdDLFrh", "htmlBody": "<p>Tricky thing is, everything we can imagine tends to become a partisan, polarized issue, if it's even slightly associated with any existing partisan, polarized positions, and if any political groups can gain any benefit from polarizing it.&nbsp;</p><p>I have trouble imagining a future in which AI and AI safety issues don't become partisanized and polarized. The political incentives for doing so -- in one direction or another -- would just be too strong.</p>", "parentCommentId": "n9fWnpBJDHKxuJtii", "user": {"username": "geoffreymiller"}}]