[{"_id": "aQ3kgNmuzdvJ53zHa", "postedAt": "2023-01-17T00:18:24.208Z", "postId": "63pYakESGrQpfNw25", "htmlBody": "<p>I overall feel I learnt nothing new from the generated answers and could recognize existing inspiration. ChatGPT is valuable at coming up with a bunch of stuff fast, but I'm not impressed by the quality itself.&nbsp;<br>Specifically in the first 20 examples, I'd say over half of them are mostly false (ie. I would not follow its advice and think there are good reasons to not follow the advice) : 2 3 4 6 7 8 10 11 13 16&nbsp;<br>Others are uninteresting.&nbsp;<br>Just 2 I found both mostly true and mostly novel (\"If you've never had a cold, you're not exposing yourself to enough germs\" and \"If you've never received a parking ticket, you're not driving in enough unfamiliar places.\")</p><p>I found the Robin Hanson versions mostly uninteresting.&nbsp;<br>I found the historical accident versions mostly uninteresting.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jonathan Claybrough"}}, {"_id": "khciSGPqwDL8GSAJg", "postedAt": "2023-01-17T00:40:00.904Z", "postId": "63pYakESGrQpfNw25", "htmlBody": "<p>If you want uncensored and creative outputs I recommend using code-davinci-002, the GPT-3.5 base model. It has helped me develop <a href=\"https://www.lesswrong.com/posts/vPsupipfyeDoSAirY/language-ex-machina\">many original ideas</a>. Because it's a base model you'll have to be more creative with prompting and curation, though.</p>", "parentCommentId": null, "user": {"username": "janus"}}, {"_id": "nNWt9xMyeFoSJWrxj", "postedAt": "2023-01-17T12:16:18.583Z", "postId": "63pYakESGrQpfNw25", "htmlBody": "<p>Thanks. Did you arrive at this independently, or are you mirroring <a href=\"https://nostalgebraist.tumblr.com/post/706390430653267968/weve-been-talking-about-the-blandness-of\">nostalgebraist's recommendation</a>? I'm guessing independently, but wanted to confirm.</p>", "parentCommentId": "khciSGPqwDL8GSAJg", "user": {"username": "NunoSempere"}}, {"_id": "cyL6zPzAYuubhcwPs", "postedAt": "2023-01-17T15:26:40.658Z", "postId": "63pYakESGrQpfNw25", "htmlBody": "<p>Coming into this, I expected GPT to write clear, grammatically-correct &nbsp;responses that were neither conceptually cohesive nor logically consistent.</p><p>Following this idea, the first thing I analyzed was the logical connections between the topics chosen in GPT's responses.</p><p>Overall, I think GPT3 performs the best at the Robin-Hanson-esq task 2, followed by task 1, then the historical accident task 3. While most of the responses for task 2 were logically inconsistent or nonsensical, a few examples were consistent and even a little insightful. &nbsp;The three I think best, in ascending order, are:</p><blockquote><p>We pretend that the education system is about preparing students for the future, but it's more about preparing them for standardized tests. If we cared about student success, we would focus more on experiential learning and critical thinking skills.</p><p>We pretend that the beauty industry is about helping people feel good about themselves, but it's more about promoting unrealistic beauty standards. If we cared about self-esteem, we would focus more on inner beauty and self-acceptance.</p><p>We pretend that the economy is about providing for people's needs, but it's more about maximizing profits for corporations. If we cared about people's well-being, we would prioritize a more equitable distribution of wealth and resources.</p></blockquote><p>Each of these responses seems to have a logical base point, but the lack of further specificity leads to un-insightful answers. &nbsp;The response on the education system, while common knowledge and not novel, seems somewhat insightful in mentioning critical thinking. The rest of the responses were quite poor, with the notable reasons being: choosing an alternative path (A) that didn't relate to Y (e.g., providing rehabilitation as a way of finding justice), mismatching the subject of the clause experiencing Y and the subject of the clause experiencing Z (e.g., mentioning consumers' goals, then mentioning companies' goals), and general vagueness (e.g., \"use social media differently\").</p><p>Task 1 seems hit and miss.</p><blockquote><p>&nbsp;If you've never had a disagreement with a friend, you're not expressing your opinions honestly.</p><p>If you've never had a flat tire, you're not driving enough.</p></blockquote><p>Some are good but obvious, some novel but useless, and others nonsensical.</p><p>For task 3, the main issue seems to be lack of specificity. So while the connections between chosen topics are existent, the broader point made in a response is weak. The distinction between culture and non-culture seems lost upon GPT3. Making \"data-driven decisions\" isn't a unicultural phenomenon.&nbsp;</p><p>Overall, I was surprised by GPT3's logically consistent responses. Then again, given enough tries, monkeys on typewriters... GPT3 still doesn't have any conceptual understanding of words, exemplified in the incohesive content behind its reasonably clear grammatical form.</p><p>These are impressive responses from GPT3 in the sense that many people would find a number of the responses insightful on first reading. It's unclear whether it could come up with completely original ideas, but with further advancements, that could soon be a possibility.</p>", "parentCommentId": null, "user": {"username": "Jared Winslow"}}, {"_id": "oKQu3cnPZ2G7My2wr", "postedAt": "2023-01-18T12:29:27.135Z", "postId": "63pYakESGrQpfNw25", "htmlBody": "<p>I expected 5% of the answers to be newish and useful, which I'd interpret as \"yeah it could be mildly useful to ask for such insights and spend the time to scan through them. not crazy-low nor crazy-high productivity\".</p><p>&nbsp;</p><p>In practice, this one was new and maybe useful for me:</p><blockquote><p>If you've never had a disagreement with a family member, you're not expressing your thoughts and feelings openly.</p></blockquote><p>(I remembered it as \"if you've never had a fight\", funny to quote it now and see my memory wasn't accurate)</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "EHgLzf9yZv2xRiENP", "postedAt": "2023-01-18T12:30:14.716Z", "postId": "63pYakESGrQpfNw25", "htmlBody": "<p>I also started reading \"The Elephant in the Brain\" following this post :)</p>", "parentCommentId": "oKQu3cnPZ2G7My2wr", "user": {"username": "hibukki"}}]