[{"_id": "uSuXbQ7nHhakrcoSB", "postedAt": "2023-11-13T16:29:55.497Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Why should someone donate to The Humane League UK (THL UK) instead of The Humane League (THL)?</p>", "parentCommentId": null, "user": {"username": "AllisonA"}}, {"_id": "BgymayFsLZYeuvvdz", "postedAt": "2023-11-13T16:45:40.401Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Considering it’s EAF's <a href=\"https://forum.effectivealtruism.org/posts/hAzhyikPnLnMXweXG/participate-in-the-donation-election-and-the-first-weekly#Marginal_Funding_Week\">marginal funding week</a> (starting tomorrow!), I’m curious on how you plan to use additional donations. It's nice to see that you've started thinking about the rest of the FY and listed 3 points of focus -- but will those happen with or without my donation? And what would happen if you don't reach the £280k shortfall fundraising target?&nbsp;</p>", "parentCommentId": null, "user": {"username": "AllisonA"}}, {"_id": "SFgHiWrAcg9Wz2PmQ", "postedAt": "2023-11-14T06:55:13.763Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>What is the likely counterfactual for the matching funds? Is this part of a wider matching campaign by Founders Pledge donors? How does it stack up against the usual concerns about matching campaigns? (See for example <a href=\"https://forum.effectivealtruism.org/posts/53dn64Y86rnmKrecH/givewell-donation-matching\">here</a>.)</p>\n", "parentCommentId": null, "user": {"username": "Andrew Gimber"}}, {"_id": "6AkYrckb7PMi7PPnD", "postedAt": "2023-11-14T07:32:11.248Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Have you thougth on the development of your own certification system for animal welfare?</p><p><a href=\"https://forum.effectivealtruism.org/posts/txQJcvTGdsWyXuZLr/effective-altruism-and-the-trust-business\">https://forum.effectivealtruism.org/posts/txQJcvTGdsWyXuZLr/effective-altruism-and-the-trust-business</a></p><p>\"Therefore, if we had a credible certification of the level of animal suffering in each product, omnivorous diets could be reshuffled to have a lower impact in terms of animal welfare. But there is a large institutional vacuum: the meat industry has no interest nor credibility, and the animalist organizations are vegan, and in the best of cases only willing to fight for animal welfare measures imposed by governments.\"</p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "GjJGdjGyYpXr5RGje", "postedAt": "2023-11-14T19:31:25.189Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Does the £280k shortfall already account for any expected funding from the ACE Recommended Charities Fund or Open Philanthropy?</p>\n", "parentCommentId": null, "user": {"username": "Andrew Gimber"}}, {"_id": "FGXjFzPoPMB7TYqKB", "postedAt": "2023-11-17T12:31:55.245Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>You might be interested in this<a href=\"https://forum.effectivealtruism.org/posts/fFNAcQBDkBHxPXuJJ/why-certify-aquatic-life-institute-s-impact-implementation\"> link</a> to some recent forum discussion on seafood certification.</p>", "parentCommentId": "6AkYrckb7PMi7PPnD", "user": {"username": "tobytrem"}}, {"_id": "zqcvLG8mKHdFqZ9ud", "postedAt": "2023-11-17T14:09:16.780Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>It is really incredible. How many do they think care for seafood welfare? To be even modestly effective you shall certify popular animals.&nbsp;</p><p>Humane eggs or dairy for vegetarians is the first natural step. Free range ruminants, and perhaps, after that, free range pork or chickens. Seafood is probably the most intractable case.</p>", "parentCommentId": "FGXjFzPoPMB7TYqKB", "user": {"username": "Arturo Macias"}}, {"_id": "aT2JeGXH5QizgTfLY", "postedAt": "2023-11-17T14:31:50.678Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Are there any interventions you can think of which would only become possible if THL had 10x the funding? Or would you run more/ bigger versions of the same kinds of programmes?&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "fnig9ey2TzBxw7mFK", "postedAt": "2023-11-17T16:25:32.733Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thank you for your question.&nbsp;</p><p>THL and THL UK are two independent organisations.&nbsp;</p><p>THL (the global organisation, legally based in the US) is the primary funder of THL UK. So a donation to THL will fund THL and THL UK, as well as the Open Wing Alliance. If, therefore, someone is interested in funding work globally then a donation to THL may be most suitable.&nbsp;</p><p>However, if you are a UK based donor then your gift may be eligible for Gift Aid, which can increase the value of your donation to 125%, thus maximising its impact. In this instance, we would recommend a donation directly to THL UK.&nbsp;</p><p>THL UK does not just work within the boundaries of the UK, it is also responsible for many of our gains for animals across Europe.&nbsp;<br><br>If you are interested in fish welfare, then we would also suggest donating to THL UK. We have brought together a coalition of NGO’s, and have industry backing our calls, as well as support across the political spectrum, as we push for the introduction of UK legislation to protect fish at the time of slaughter.&nbsp;</p><p>Regardless of how a donation is directed, a donation to THL or THL UK will have an enormous impact and help to end the abuse of animals raised for food.&nbsp;</p><p>This question has been answered in collaboration with THL.&nbsp;</p>", "parentCommentId": "uSuXbQ7nHhakrcoSB", "user": {"username": "Gavin Chappell-Bates"}}, {"_id": "4CLoqnMRJY9iKkcH6", "postedAt": "2023-11-17T16:30:09.801Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thank you for your question Andrew.&nbsp;</p><p>Yes it does. That is because funding from the ACE Recommended Charities Fund and Open Philanthropy goes directly to THL (please see the answer to the question about giving to THL vs. THL UK). This is then re-granted to us in the form of a fixed annual grant from THL. This has already been confirmed for this financial year, and our current £280k shortfall sits outside this based on our own fundraising targets.&nbsp;</p>", "parentCommentId": "GjJGdjGyYpXr5RGje", "user": {"username": "Gavin Chappell-Bates"}}, {"_id": "iLwEDQjEXTuypXK7m", "postedAt": "2023-11-17T17:33:56.770Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thank you for your question.</p><p>As you’ve mentioned, we have planned our activities for this financial year. We are committed to proceeding with our plans. However, if we do not receive the funding budgeted for those activities, we would need to either scale back some of our activities or draw on our reserves. Whilst we have a healthy level of reserves currently, they are designed to protect THL UK and its activities in case of an emergency. Reducing our level of reserves would limit our ability to respond in the case of an unplanned event or emergency, and put us in a potentially difficult situation in 2024-2025 if our fundraising plans don’t go as well as we hoped for 2023-2024. Therefore, we are reliant on donations to make sure these activities can go ahead as planned, and not have a detrimental long-term impact on the organisation.&nbsp;</p><p>Extra funding would be used to fund our legal case against the Department for Environment, Food &amp; Rural Affairs (Defra).&nbsp;</p><p>In May 2023 we had a High Court hearing where we challenged the legality of fast-growing breeds of chicken. Although we did not win the initial case, our appeal has been granted and we will have a further hearing in spring 2024.&nbsp;</p><p>This is a once-in-a-generation opportunity to force the Government, with one decision from an appeals court judge, to transform one billion innocent lives per year.&nbsp;</p><p>We have been able to secure a cost cap from the court, which means, if we lose the case, we are only liable to pay Defra’s legal costs up to £30k. Without this cost cap we would likely have not been able to continue with our appeal as Defra’s legal fees could be in excess of £300,000.</p><p>Regardless, £30k is still a significant sum. We will also have our other legal fees, which have been estimated at £26k (even with one of the two Barristers&nbsp; working on the case being fully pro bono) meaning we will need £56k in total to fund the appeal.&nbsp;</p><p>Because our appeal was granted only recently, we have not budgeted for a second court battle to happen in this financial year. In order to proceed with this second day in court, we need to raise these funds to be able to move ahead.&nbsp;</p>", "parentCommentId": "BgymayFsLZYeuvvdz", "user": {"username": "Klara Schmidt"}}, {"_id": "C9ALvsj45sduhYth3", "postedAt": "2023-11-17T17:42:57.162Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thank you for your question.<br><br>Because having 10x the funding we currently have is not a realistic prospect, especially in the near or mid-term future, it is difficult to say exactly how we would allocate this kind of funding.&nbsp;&nbsp;</p><p>We can also say that with an unanticipated spike in funding, we would also be able to work on new initiatives that, at this time, we do not have the funds for.&nbsp;<br><br>Expansion into corporate fish welfare work is an extremely impactful field that has the potential of positively influencing welfare changes for a large number of fish. Our core grant from THL does not cover any work for fishes, and so if we came into significant unexpected funding, this would move up on our agenda.<br><br>We also intend to use our institutional campaigning expertise to undertake corporate plant-based advocacy - asking companies to commit to increasing their plant-based offerings - at some point&nbsp; in the future. As with corporate fish work, there are currently question marks around resourcing this, and unanticipated additional funding would remove those.<br><br>First and foremost, however, THL UK would allocate more resources to our existing corporate and legislative approaches if we came into large sums of unexpected funding. Our Corporate Relations and Campaigns Teams are relatively small (5 employees in total) and significant new funding would allow us to bring in extra capacity, enabling us to bring more varied, and intense, pressure to a larger number of corporate targets.&nbsp;&nbsp;</p><p>While there are multiple approaches that have the potential to impact farmed animal welfare in meaningful ways, there are also multiple organisations working in the UK and beyond within their specific area of knowledge, skill and focus. For us, this area is securing meaningful welfare changes for animals raised for food, and thanks to our campaigning expertise, we are able to impact the lives of exponentially more animals, and reduce more suffering, by investing our energy in winning institutional campaigns.</p>", "parentCommentId": "aT2JeGXH5QizgTfLY", "user": {"username": "Klara Schmidt"}}, {"_id": "ynLnTkPJgpK76L9yW", "postedAt": "2023-11-17T17:57:29.233Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thanks for this question! And hi Klara, thanks for your answer on behalf of THL UK! I also wanted to chime in from the perspective of THL.&nbsp;</p><p>If THL were to receive more significant additional funding, we have developed a robust&nbsp;<strong>expansion plan for the OWA through 2030</strong>. The goal of this expansion is to free one billion hens from cages by 2030 and achieve a critical tipping point in the OWA’s mission to eliminate battery cages from the planet.&nbsp;Campaigns against global companies have worked well, but to phase out battery cages across the globe, we must have a robust and high-functioning alliance in every major country.&nbsp;</p><p>Our success in building an effective global alliance is outpacing the operational support THL is able to provide, given our own resource constraints. Our current model of having a single regional OWA coordinator to support upwards of 20 member groups with differing needs across an entire continent is no longer sustainable. As the OWA is one of the only international movement building resources available, our constraints mean that groups are unable to get the training and support that they need, alongside the strategic guidance and leadership development. We also see a huge appetite from groups to expand what the OWA is offering so that we can be an even more effective global coalition.&nbsp;</p><p>To achieve the current need and anticipated growth, we need to create small teams in key regions around the world that can then support the differing needs of groups in their respective regions. To scale this up, we estimate this will cost a minimum of $2.5M in 2024, with capacity to increase our OWA grants by an additional $1M, and closer to $8.5M in 2025.</p><p>Another program that is primed for expansion is the&nbsp;<strong>Animal Policy Alliance</strong>—already 14 member groups strong, and we have a goal to reach at least 30 active alliance members by 2025.&nbsp;THL launched the APA in 2022 to organize, unite, and empower local and state-level animal advocacy groups that are involved in issue-based advocacy and implementing legislative strategies for animals with policy agendas that include animals raised for food. These groups harness and channel the grassroots power of a significant base of animal protection advocates in the United States that they then use to create relationships with legislators at the city, state and federal level, and advocate for policies that benefit animals. Over time, through its leadership role in this alliance and through its grant-making capacity, THL will also influence local groups to focus more on farmed animal and food system issues.&nbsp;</p><p>THL could effectively use up to $2M to expand the APA team and provide grants to member organizations in 2024.&nbsp;We distributed $500K in grants in 2022 and were unable to continue the grants program in 2023 due to funding constraints. But through this process, we know the need for funding policy work in the US is strong, and that there are dozens of groups eager to expand their advocacy for farmed animals.</p><p>Both of these alliances have significant room to scale. We have detailed plans to use 2-3x funding for these programs, but we could scale even further and achieve our desired impact more quickly with additional funding.</p><p>For full details of THL’s room for more funding, check out&nbsp;<a href=\"https://forum.effectivealtruism.org/s/xourt4HttDM5QcHsk/p/gGBtgScdfLxsodhzg\"><u>this post!</u></a></p>", "parentCommentId": "C9ALvsj45sduhYth3", "user": {"username": "carolinemills"}}, {"_id": "CZeaz7wag47GM8cND", "postedAt": "2023-11-17T18:00:29.606Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thank you for your question Andrew.&nbsp;</p><p>Our match funders for our end of year appeal also supported our end of year appeal last year with a similar match. It was likely that these Major Donors would give again, but not certain, and certainly not expected in terms of the amount they have provided for match funding this appeal.&nbsp;In conversations with the Major Donors, it was clear that the match element of their donation–and the extra reach and impact that match brought into THL UK–was a large part of their reason for their gift.&nbsp;</p><p>In assessing our current fundraising performance and developing a strategy for the next 3 years, one of our key focusses will be converting existing supporters into donors. We currently have a large supporter database, but a lower than average percentage who are donating to THL UK. As such, our focus for this campaign is really on utilising the match funding to, not only secure vital funds to close our funding gap, but to convert those who would not otherwise have given into donors.&nbsp;</p><p>Our match funders are also not just providing funds, they are lending their voice and backing to our campaign, sharing their motivations for giving, to help influence others to support the work of THL UK and become donors or increase their giving.&nbsp;</p>", "parentCommentId": "SFgHiWrAcg9Wz2PmQ", "user": {"username": "Gavin Chappell-Bates"}}, {"_id": "KDvQQqBnhMbjtpq29", "postedAt": "2023-11-20T13:41:49.499Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thanks for the response Klara- this is really interesting. Am I right in reading you as saying that the provision of your core funding is conditional on it being used for land-based farm animals?&nbsp;</p>", "parentCommentId": "C9ALvsj45sduhYth3", "user": {"username": "tobytrem"}}, {"_id": "qiNK8W2QbGyajieLz", "postedAt": "2023-11-20T13:45:42.286Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>That's really exciting to hear- thank you!</p>", "parentCommentId": "ynLnTkPJgpK76L9yW", "user": {"username": "tobytrem"}}, {"_id": "CsSHXndeSqqDSTPhW", "postedAt": "2023-11-21T10:19:29.602Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thank you for the follow up question.&nbsp;</p><p>There are no restrictions on our core funding based on type or breed of animal, whether land-based or otherwise.&nbsp;</p><p>The only restriction is due to the fact the grant comes from a US 501(c)(3) organisation (THL) and is, therefore, subject to&nbsp;<a href=\"https://www.irs.gov/charities-non-profits/lobbying\"><u>US laws regarding lobbying</u></a>. As such, this funding cannot be used for lobbying or legislative work, such as our legal case challenging the legality of fast growing breeds of chicken and our fish work, which, up until now, has been solely focussed on legislative action.&nbsp;</p>", "parentCommentId": "KDvQQqBnhMbjtpq29", "user": {"username": "Klara Schmidt"}}, {"_id": "esMkKDQNkTKjE2KGy", "postedAt": "2023-11-21T10:30:12.368Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thanks Klara, I didn't realise that legal campaigns had to be funded separately, this is very useful info.&nbsp;</p>", "parentCommentId": "CsSHXndeSqqDSTPhW", "user": {"username": "tobytrem"}}, {"_id": "Dr5cAECKCt4A3fkRD", "postedAt": "2023-11-21T14:12:13.886Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Thank you for your question.&nbsp;<br><br>Through negotiation and hard-hitting public pressure campaigns, THL UK is able to secure corporate commitments to improve animal welfare standards.&nbsp; We choose not to run certification schemes because those schemes, like RSPCA Assured, usually involve having financial ties to the producers or retailers themselves (a certain percentage of sales going to the scheme administrator). Because THL UK wants to expose and hold corporations aggressively to account for poor animal welfare, being fully independent gives us the autonomy to speak critically and openly–and our approach gets results: As a result of our corporate campaigns and collaboration with other organisations, 130 UK companies (610 companies globally) have now signed up to the Better Chicken Commitment. If you would like to get an overview of the companies that made a commitment, all broiler welfare and cage-free commitments globally can be tracked via&nbsp;<a href=\"https://chickenwatch.org/progress-tracker/\"><u>Chicken Watch</u></a>, a website by THL.</p><p>We of course agree that the current labelling of meat and dairy products is unclear and often misleading. Images of idyllic animals on green farmland, or labels claiming animals live in ‘comfortable’ settings, are a far cry from the deprivation and suffering they experience on factory farms. And we hold retailers to account when we see them using these tactics–just recently, Lidl UK removed misleading imagery of free range outdoor chickens&nbsp;from their website after we submitted a complaint to the Advertising Standards Authority.&nbsp;&nbsp;</p>", "parentCommentId": "6AkYrckb7PMi7PPnD", "user": {"username": "Klara Schmidt"}}, {"_id": "Ejo2HcJwiTfNE54NG", "postedAt": "2023-11-21T14:48:43.495Z", "postId": "69F8ytzr9665WAjXs", "htmlBody": "<p>Dear Klara, the information about Chicken Watch is very useful, and I completely understand your specialization.&nbsp;</p><p>I am trying to spread the idea of taking animal welfare certification \"in our own hands\", because I see it both possible and even financially self sustainable. So perhaps, somebody in the EA space will try to develop the idea.</p><p>Thank you very much for the good work,</p><p>Arturo</p>", "parentCommentId": "Dr5cAECKCt4A3fkRD", "user": {"username": "Arturo Macias"}}]