[{"_id": "z9EHeFuFrzkEe9Exp", "postedAt": "2024-01-03T11:36:57.011Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Hey Silas, really glad you wrote this up. I also recently donated bone marrow (after donating blood many times and being a bit torn on kidney donations). My experience was equally positive and probably even easier logistically (from London, UK).</p><p>Some hard-nosed calculations for those who might be interested (that I will write up in a full post one day): I lost about 1 full day of work and would expect the average person to lose between 1-3 days of work if they wanted to lose as few workdays as possible. My best estimate is this saved between 4-12 years of life for the person who received the donation. Overall, I think it fits quite well with my <a href=\"https://forum.effectivealtruism.org/posts/DBcDZJhTDgig9QNHR/altruism-sharpens-altruism\">altruism sharpens altruism</a> concept and is likely worth many EAs signing up for.<strong>&nbsp;</strong></p>", "parentCommentId": null, "user": {"username": "Joey"}}, {"_id": "d4X4gn48Ep8Bv5xBH", "postedAt": "2024-01-04T06:10:08.528Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>There's a similar post on this forum from a few years back, I believe, with some probably valuable discussion.</p>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "sbHXsojPZrBPGzqxj", "postedAt": "2024-01-04T14:16:15.304Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Thanks so much for sharing this! I've been on the <a href=\"https://www.anthonynolan.org/?_gl=1*cw4xw4*_up*MQ..&amp;gclid=Cj0KCQiAy9msBhD0ARIsANbk0A-Vvmxjx3ALuZ_7TdXr-8hdo7xzz6O4_42YpcYhKiTLGxhiQouYyqgaAl9AEALw_wcB\">Anthony Nolan</a> register in the UK for a long time so was interested to hear about how the donation process was for you.&nbsp;</p>", "parentCommentId": null, "user": {"username": "gbraithwaite"}}, {"_id": "6ufyaosTLmzpSc47c", "postedAt": "2024-01-04T16:17:44.215Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>In the UK at least, they are especially desperate for donors who are male and/or from an ethnic minority background</p>\n<p><a href=\"https://www.anthonynolan.org/help-save-a-life/join-stem-cell-register\">https://www.anthonynolan.org/help-save-a-life/join-stem-cell-register</a></p>\n", "parentCommentId": null, "user": {"username": "Rasool"}}, {"_id": "HxanPr9ahjPksCqed", "postedAt": "2024-01-05T00:57:19.887Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Thanks for sharing this! I donated with Be The Match as well, in March of 2020, which was interesting timing. They actually had to send me to a sister organization called Gift of Life, whose staff was amazing as well. I had preciously started the process to donate a kidney and then let the ball drop and forgotten about it. The call from Be The Match was such a specific call to action:<br>\"You’ve been identified as a possible marrow match for a 57-year-old Male in need of a transplant. The patient’s doctor is trying to determine treatment options as quickly as possible.\" My reaction was basically \"oh my god, of course!\" versus the kidney donation which was more like \"eh this is mildly annoying right now I'll just not\" since there was no single individual being called to my attention.</p><p>Interestingly enough, my experience donating stem cells was so rewarding that it reminded me of my previous attempt at kidney donation, and I restarted that process and donated my kidney later that year. I bet if you compared kidney donation rates between people in the bone marrow registry and people who have been matched and donated stem cells, you'd find a significant increase in the latter population.</p>", "parentCommentId": null, "user": {"username": "James Montavon"}}, {"_id": "bG8roewvkzAmiKtEk", "postedAt": "2024-01-05T02:54:49.371Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Thanks for providing this! I've just added it to the TLDR &amp; end section</p>", "parentCommentId": "6ufyaosTLmzpSc47c", "user": {"username": "Silas Strawn"}}, {"_id": "EfBJ3MuwfD2JuboCC", "postedAt": "2024-01-05T02:56:10.176Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Thanks for the kind words! I just added the UK registry to the post as well, thank you for sharing&nbsp;</p>", "parentCommentId": "sbHXsojPZrBPGzqxj", "user": {"username": "Silas Strawn"}}, {"_id": "BcTzJf2oxrfpJfsLQ", "postedAt": "2024-01-05T03:04:42.103Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Hey, glad to hear you had a good experience with it as well. Your post really resonated with me - I certainly feel more inclined to donate in other ways since I donated PBSC. Most notably, it pushed me more towards kidney donation, although I'm still on the fence about it too.&nbsp;</p>", "parentCommentId": "z9EHeFuFrzkEe9Exp", "user": {"username": "Silas Strawn"}}, {"_id": "sBJKvwkFaTQ2m6ada", "postedAt": "2024-01-05T03:17:33.916Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Yeah, looks like there's an older post about Be The Match, with some more conventional EA cost-benefit analysis: <a href=\"https://forum.effectivealtruism.org/posts/dnXPjagqyKKtYSrWv/be-the-match-a-volunteer-list-for-bone-marrow-donation\">https://forum.effectivealtruism.org/posts/dnXPjagqyKKtYSrWv/be-the-match-a-volunteer-list-for-bone-marrow-donation</a>&nbsp;<br><br>I did some back-of-the-envelope type calculation as well and found it to be quite cost-effective per QALY, imho. (I can post my reasoning if there's interest, but I'm new to that sort of analysis so I left it out of the post.) <a href=\"https://forum.effectivealtruism.org/users/joey?mention=user\">@Joey</a> has a favorable cost-effectiveness breakdown in his <a href=\"https://forum.effectivealtruism.org/posts/69kYhMjGnvgHqHP9r/my-experience-donating-blood-stem-cells-or-why-you-should?commentId=z9EHeFuFrzkEe9Exp\">comment</a> as well. It looks like there were some disagreements in the comments of the old post on the cost-effectiveness&nbsp;</p>", "parentCommentId": "d4X4gn48Ep8Bv5xBH", "user": {"username": "Silas Strawn"}}, {"_id": "94LyAhAWJ7aJWNfMS", "postedAt": "2024-01-05T03:35:06.213Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Yeah the call out of the blue with someone effectively saying \"we need your help ASAP for someone in dire straits with a blood cancer\" was extremely morally clarifying. My reaction was essentially the same as yours. That was one of the reasons I felt uncomfortable trying do a traditional EA cost-effectiveness breakdown for this (although I have it in a private google doc) -- why wouldn't you just try to help save the other person's life?&nbsp;</p><p>Donating right around the start of COVID lockdowns sounds like it would have been crazy! I'm very glad to hear your donation went well and you took the leap with kidney donation - I hope you had a positive experience with that one too.&nbsp;</p><p>Some folks in the comments on<a href=\"https://www.astralcodexten.com/p/my-left-kidney\"> Scott Alexander's piece</a> on kidney donation were speculating that you would have an easier time getting kidney donations if there was some sort of similar matching process like for bone marrow (although it would have to be mostly artificial of course)</p>", "parentCommentId": "HxanPr9ahjPksCqed", "user": {"username": "Silas Strawn"}}, {"_id": "v8aoqhKpDY8gRurh3", "postedAt": "2024-01-05T10:02:18.293Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>I signed up because of this post :) (I thought the time out from work was higher/GA was the only option)</p>\n", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "42PsFCpTnpjNToojS", "postedAt": "2024-01-05T18:47:59.463Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Thank you, I'm very happy to hear that!</p>", "parentCommentId": "v8aoqhKpDY8gRurh3", "user": {"username": "Silas Strawn"}}, {"_id": "pyKuBs6X4jNheKwMj", "postedAt": "2024-01-16T15:24:38.585Z", "postId": "69kYhMjGnvgHqHP9r", "htmlBody": "<p>Great post! I also donated stem cells 2 months after you in April, 2021 in Sweden, I recognize many of the positive aspects you mention and it was a well worth experience overall.<br><br>Also wanted to share the <a href=\"https://wmda.info/find-your-registry/\">World Marrow Donor Associations (WMDA) list/map of registries</a> in other countries for those of us not in the US/UK.</p>", "parentCommentId": null, "user": {"username": "Johan Täng"}}]