[{"_id": "N3N4DHq8b2zLyorap", "postedAt": "2015-01-03T20:52:38.922Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>During freshman year of college ('09-'10), I decided to donate some money to charity on a whim.  After some reflection on how much to donate, I decided that the morally correct option was to live on as little money as possible and donate the remainder.  (Extremism is very attractive to college freshmen.)  I lived as ascetically as I could and gave away the possessions and money that I thought I didn't need.  I looked like a homeless person, with my feet sticking through the ends of my falling apart sneakers, and I sewed patches over the holes in my clothes rather than buy new stuff.  (In retrospect, these things weren't worth the time and reputation costs.  Basic clothes and shoes are cheap.)  I drank 7 cups of tea a day to avoid hunger and also would scrounge whatever half-eaten food I could find around my dorm.  (Some of the &quot;candy&quot; I ate was actually psychedelic drugs, I think.) </p>\n<p>As a coincidence, a few months after I began this endeavor, I met Jason (Gaverick) Matheny.  My mom was working as an assistant for him, though neither of my parents are EAs.  He came over for dinner one night, and we talked about our shared interest in altruism.  (The term &quot;effective altruism&quot; didn't exist at the time.)  </p>\n<p>Jason has been a valuable mentor for me over the years.  I had the altruism part down, but he's helped me think a lot more about effectiveness.  He eventually introduced me to 80K, and from there I connected with the rest of the EA community. </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "kBCNtrEAHqbXRXNdG", "postedAt": "2015-01-03T20:54:23.177Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>It might be good to disclaim that you don't think that the survey is such a representative sample of anything in particular. We've caught maybe a quarter or a half of EAs, but we've probably caught a lot more LessWrongers and users of the Facebook groups at the neglect of some in-person meetups. (The methodology was to try to get as many people as possible to complete the survey by posting it to LW and relevant facebook groups, emailing it via group leaders, etc.)</p>\n<p>So probably fewer people came to EA from LW than are represented here. Still, it could be a lot. So it's interesting to think that maybe a lot of EAs had started out by reading HPMOR or other stuff by Eliezer Yudkowsky and speaks to the fact that a bunch of EAs owe LW a bunch of big ideas.</p>\n<p>Oh, as for my personal origin story, I met people who helped start the EA movement by discussing Peter Singer's ideas online.</p>\n<p>Thanks for this post!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "nNMr5AgRcz3YztDZ4", "postedAt": "2015-01-03T22:49:51.884Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Yes that's right, it's best to take these numbers as count data: absolute numbers of people who fit these categories, providing a lower bound for the numbers of EAs in the world who fit them, but likely not in the same proportions as all EAs in the world would be. In particular, they probably do as you say include disproportionately many people who frequent online venues like the Facebook group and LessWrong. </p>\n<p>However I still would have expected more survey respondents to have picked out local groups. Many of the groups shared the survey with their members, so it's not like we didn't reach these people, and I know that many people who took the survey do attend local groups.</p>\n", "parentCommentId": "kBCNtrEAHqbXRXNdG", "user": {"username": "Tom_Ash"}}, {"_id": "EtS8HWZpGyTbrTXdY", "postedAt": "2015-01-04T08:03:52.584Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Wow, I didn't know Gaverick had played this role in your life. He is a true pioneer, and one of my favorite living people.  (As you probably know, he did some pretty extreme things too upon first encountering Singer's ideas, though eventually realized that <a href=\"http://www.jefftk.com/p/altruism-isnt-about-sacrifice\">altruism is not about sacrifice</a>.)</p>\n", "parentCommentId": "N3N4DHq8b2zLyorap", "user": {"username": "Pablo_Stafforini"}}, {"_id": "bCmrpYtawAcqmehC9", "postedAt": "2015-01-05T06:35:52.707Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Do you think maybe this data would be more usefully presented as percentages of survey respondents rather than raw numbers?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "okxJuSZzHxqTo87yu", "postedAt": "2015-01-05T15:25:48.274Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>I'm unsure, and would appreciate others' perspectives. I presented it as I did to avoid any misreading of percentages as implying that these were representative of all EAs in the world, as explained in my reply to Ryan. Perhaps that was overcautious, as we could clearly state that these are percentages of survey respondents rather than all EAs in the world, who'll have somewhat different proportions. The absolute numbers of people reporting different answers are &quot;count data&quot;, and hard to misinterpret.</p>\n", "parentCommentId": "bCmrpYtawAcqmehC9", "user": {"username": "Tom_Ash"}}, {"_id": "z46HpQNorrcsdcRHj", "postedAt": "2015-01-05T15:59:52.042Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Yeah just so long as you're clear that these are proportions of your sample and not all EAs, it's fine.</p>\n", "parentCommentId": "okxJuSZzHxqTo87yu", "user": {"username": "RyanCarey"}}, {"_id": "3qoEoLkHotStCzkwu", "postedAt": "2015-01-12T20:36:43.119Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Typo in Local Groups section? Showing 2 different numbers for TLYCS.</p>\n<p>&quot;78 through The Life You Can Save, 41 through 80,000 Hours, and 38 through The Life You Can Save&quot;</p>\n", "parentCommentId": null, "user": {"username": "Gina_Stuessy"}}, {"_id": "Hw6JisJuKS9Sz6sBN", "postedAt": "2015-01-13T10:29:14.427Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Good catch, fixed - the first figure should have been &quot;42 through GiveWell&quot;.</p>\n", "parentCommentId": "3qoEoLkHotStCzkwu", "user": {"username": "Tom_Ash"}}, {"_id": "tgp34bcCJzJM6tDXJ", "postedAt": "2015-01-17T09:22:57.863Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Personally, I read Singer's <em>Practical Ethics</em> in 2005, which convinced me that I ought to donate a share of my income to charities. I can't say that notion was new to me then, but I found his argument particularly persuasive. The article <a href=\"http://www.economist.com/node/17461445\">Faith, hope and charities</a> in the 13 November 2010 issue of <em>The Economist</em> convinced me that donors often do not exercise due diligence before deciding where to give. Despite this, it wasn't until several years later that I came into contact with the website of Giving What We Can.</p>\n<p>I'm curious, what is the typical length of time between when people were convinced of EA ideas and when they first heard about the term or the community? Did the survey cover this?</p>\n", "parentCommentId": null, "user": {"username": "GabrielEhrnstGrundin"}}, {"_id": "JscuDohb8L82pC5AS", "postedAt": "2015-01-29T14:28:12.612Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>Likewise, I think this survey will make your beliefs more accurate if you treat it as a survey of EAs on LessWrong. But it may make your beliefs less accurate if you view it as a survey of EAs as a whole.</p>\n", "parentCommentId": "kBCNtrEAHqbXRXNdG", "user": {"username": "Robert_Wiblin"}}, {"_id": "vruntDHjpfj7oWced", "postedAt": "2015-02-02T22:09:37.745Z", "postId": "69wvx9vBmfpaovWTs", "htmlBody": "<p>This isn't right, as a significant majority of survey-takers came from places other than LessWrong - to get a picture of those people, you'd instead look at the breakdown for them, which Peter includes in his draft analysis.</p>\n", "parentCommentId": "JscuDohb8L82pC5AS", "user": {"username": "Tom_Ash"}}]