[{"_id": "6croMfNuHmFjJ9vDj", "postedAt": "2023-10-19T14:30:40.818Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>The methodology for this article appears to be:</p><ol><li>Listen to 14 podcast episodes</li><li>Take some quotes</li><li>One episode is enough to define a 5 year era</li><li>Build a narrative around this</li><li>Call it a \"discursive analytic method\"</li></ol>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "jd9iPhtYQrsb4dZPi", "postedAt": "2023-10-19T14:53:56.354Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>Was about to write this! Deeply unserious that something of this poor quality can make it through peer review.</p>", "parentCommentId": "6croMfNuHmFjJ9vDj", "user": {"username": "MathiasKirkBonde"}}, {"_id": "hcFpBjBTqJwepdiZJ", "postedAt": "2023-10-19T15:08:17.863Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>I was about to debunk some arguments then decided it was a waste of time, as the quality of methodology, and argument is too low to even bother poking holes in.</p>\n<p>Sentences like this belong in a blog post or opinion piece, not in the methodology section of a peer reviewed paper.</p>\n<p>\"we painstakingly pored through hundreds of hours of podcasts content, dozens of pages of various content including blog posts/articles and career review.\"</p>\n<p>How a piece like this ends up in the frontiers of psychology journal, which had a decent impact factor, I do not know</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "daadxdg8DS7KqKCk4", "postedAt": "2023-10-19T15:14:53.523Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>It's probably not an accident that the article was published during the SBF trial. My guess is that the journal editors are willing to overlook some methodological flaws in favor of getting a piece out while the topic was more prone to draw public opinion. I don't know the relevant literature base -- but I also surmise that if the \"debate on dark personality traits in entrepreneurship\" is indeed as \"nascent\" as claimed, then editors are relatively more likely to let pieces lacking in design rigor through.</p>", "parentCommentId": "hcFpBjBTqJwepdiZJ", "user": {"username": "Jason"}}, {"_id": "xsmWbj2k7im48gXKM", "postedAt": "2023-10-19T19:01:14.678Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<blockquote><p>It particularly highlighted the reasons taking big risks with entrepreneurship might be the biggest way to make an impact on the lives of others. The main rationale for this is that <strong>even failing on a startup can potentially earn the entrepreneur a lot of money</strong>.</p></blockquote><p><a href=\"https://80000hours.org/2012/01/salary-or-startup-how-do-gooders-can-gain-more-from-risky-careers/\">The source</a> they cite says:</p><blockquote><p>Over 90% of the wealth gained by founders came from the top 10% of firms, those which returned over $10 million, and almost half the wealth came from the top 2% of firms, returning over $100 million.</p></blockquote><p>Kind of remarkable that they got the explanation exactly backwards.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "APL54DWckAgugFbYh", "postedAt": "2023-10-19T20:28:45.867Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>Alas, poor reading comprehension is common everywhere.&nbsp;</p><p>My guess is that it wouldn't work, but I've been trying to figure out a technological solution.&nbsp;</p>", "parentCommentId": "xsmWbj2k7im48gXKM", "user": {"username": "Linch"}}, {"_id": "fQfLaRQ2KjfoXwRZK", "postedAt": "2023-10-19T21:18:14.636Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>Fortunately science is self-correcting; I'm sure that the authors will reverse their conclusion once they realize that they got the evidence backwards. I look forward to \"the light side of EA entrepreneurship\" in a forthcoming edition of Frontiers in Psychology.</p>", "parentCommentId": "APL54DWckAgugFbYh", "user": {"username": "Ben_West"}}, {"_id": "otq8vpAEnzsR2GkKK", "postedAt": "2023-10-20T08:32:31.657Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>Haha love this, always appreciate the sparse morsels of banter on the forum ;)</p>", "parentCommentId": "fQfLaRQ2KjfoXwRZK", "user": {"username": "NickLaing"}}, {"_id": "LkrdghXuYFE7JHwQN", "postedAt": "2023-10-23T13:47:23.673Z", "postId": "6AqhjqJrbApSDwDfc", "htmlBody": "<p>Ha, if only!</p><p>Unfortunately, this methodology of \"collect some texts; extract themes that we say are salient\" seems very common in the social sciences. &nbsp;Fixing the method is unlikely, but pointing out concrete errors still seems prosocial.</p><p>I'd give you 100 epistemic hygiene points to contact the authors and point out this error.&nbsp;</p>", "parentCommentId": "fQfLaRQ2KjfoXwRZK", "user": {"username": "spoonbillvoice"}}]