[{"_id": "EcanaHNjgNDNyDLKL", "postedAt": "2022-11-10T03:37:33.078Z", "postId": "6ASCLT7HDMDy8rptE", "htmlBody": "<p>Is there a plan to run this program virtually anytime soon? I would love to see this as part of EA Virtual Programs.</p>", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "fg6ufWLru5sspnQ5b", "postedAt": "2022-11-10T04:00:31.256Z", "postId": "6ASCLT7HDMDy8rptE", "htmlBody": "<p>I might be missing some context here, but could you expand on how you tested the 8 week program and how the workshops you ran at the conferences differ from the program ? e.g. I'd assume you could only cover part of the content in a workshop vs a 8 week program, and the quality of the program might drop if it's not run by your team (even if the purpose is to facilitate peer-to-peer learning).&nbsp;</p><p>I'd also be curious to know how you evaluated your pilot workshops e.g. how many participants went through the workshop, what kind of positive feedback participants gave, and how long after the workshop they gave it - and whether you did any follow-up surveys.<br><br>Finally a small clarification:</p><blockquote><p>We had many EA members subscribed to our newsletter (around 100 people in total)</p></blockquote><p>Was this for the mental health navigator in general or specifically for the mental health programme?</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "4Ec5p37bLS9Wx4FZe", "postedAt": "2022-11-10T07:10:39.482Z", "postId": "6ASCLT7HDMDy8rptE", "htmlBody": "<p>I found this episode of Erza Klein Show very helpful in dealing with anxiety -- <a href=\"https://www.nytimes.com/2021/04/20/opinion/ezra-klein-podcast-judson-brewer.html\">https://www.nytimes.com/2021/04/20/opinion/ezra-klein-podcast-judson-brewer.html</a></p>\n", "parentCommentId": null, "user": {"username": "newptcai"}}, {"_id": "ZGPidsnm7R9mBipHh", "postedAt": "2022-11-10T08:55:22.655Z", "postId": "6ASCLT7HDMDy8rptE", "htmlBody": "<p>What was the actionable advice?</p>\n", "parentCommentId": "4Ec5p37bLS9Wx4FZe", "user": {"username": "Dr. David Mathers"}}, {"_id": "boXm3u9usjaqoizxL", "postedAt": "2022-11-11T00:58:23.883Z", "postId": "6ASCLT7HDMDy8rptE", "htmlBody": "<p>The two main things that I found useful --</p>\n<ol>\n<li>A wandering mind is an unhappy mind. The staring point to reduce anxiety, is to pay attention to what we actually feel what it actually feel like when we do things or thinking of things that make us anxious.</li>\n<li>Being anxious has it's reward. We may feel like we are trying to solve an issue. The way to break it, is to give  a yourself \"big better offer\" -- curiosity about your feelings and self-love.</li>\n</ol>\n<p>I am reading The Craving Mind: From Cigarettes to Smartphones to Love—Why We Get Hooked and How We Can Break Bad Habits by Judson Brewer (the guest in the show). I think chronicle anxiety is very similar to addictions and the books offers some helpful suggestion in dealing with it using mindfulness.</p>\n", "parentCommentId": "ZGPidsnm7R9mBipHh", "user": {"username": "newptcai"}}, {"_id": "qAF2cKyXqpQ9uBCnw", "postedAt": "2022-11-14T08:07:34.558Z", "postId": "6ASCLT7HDMDy8rptE", "htmlBody": "<p>Hi Vaidehi, thanks for all your questions.</p><p>When designing the programme, we tested each pilot workshop individually at least twice: once offline with participants from the CZEA and once online with participants from our testing group (on average, we had 8 participants per workshop). Evaluating the programme as a whole turned out to be a challenge due to the nature of the product and the interventions, as well as the size of the groups. We hired a methodology expert and decided to evaluate it qualitatively, mainly via:</p><ul><li>A focus group.</li><li>In-depth interviews after the programme.</li><li>Feedback form after each of the workshops.</li></ul><p>&nbsp;</p><p>We plan to do in-depth follow-up interviews with the participants 8-10 months after the programme ended (both interviews and focus groups were conducted by our methodologist).<br>&nbsp;</p><p>The participants especially liked and found helpful the following aspects of the programme:&nbsp;&nbsp;</p><ul><li>The workbooks and the recommended readings introduce many relevant foundational theories and research on the topics.</li><li>The community aspect and peer-to-peer support. This was an opportunity to discuss the topics relevant to the participants safely and with like-minded people. Being able to open up about experiencing difficulties and discussing these in an informed way.</li><li>The resources and exercises helped the participants to gain insights into the topics.</li><li>Techniques to deal with issues affecting one's mental health (many of the participants aimed to integrate the techniques into their lives).<br>&nbsp;</li></ul><p>At the conferences, we have facilitated the following workshops (with around 70 participants in total):&nbsp;</p><ul><li>Self-Compassion workshop at EAGx Prague&nbsp;</li><li>Preventing Burnout and Sustainable Motivation workshop for the SERI fellowship</li><li>Preventing Burnout and Sustainable motivation workshop at the CARE conference&nbsp;</li></ul><p><br>We chose workshops that do not need much preparation before the workshop, and the workshops were not changed from those from the programme. The 8-week programme consists of eight topics (one per week), so the workshops can also be given individually without having to change the content significantly (although we do recommend sticking to the 8-week form).&nbsp;</p><p>&nbsp;</p><p>You are right; the workshop quality might drop if our team does not run it. However, it may also go up if facilitated by someone who does it very well. The programme is designed in such a way that it is not too difficult to facilitate, and the quality does not stand or fall with the facilitator.&nbsp;</p><p>As we mentioned in the post, there are improvements to be made, and we hope that our effort will serve as a starting point from which others will continue.</p><p><br>The&nbsp;<a href=\"https://mental-health-program-for-eas.mailchimpsites.com/\"><u>newsletter</u></a> was specifically for this programme (not EA Mental Health Navigator).</p><p><br>&nbsp;</p>", "parentCommentId": "fg6ufWLru5sspnQ5b", "user": {"username": "tereziekosik"}}, {"_id": "bFc9prFAr4EaHcssR", "postedAt": "2022-11-14T08:28:33.536Z", "postId": "6ASCLT7HDMDy8rptE", "htmlBody": "<p>Hi Augustín, many thanks for your message; we are happy to hear that. We are in contact with EA Virtual Programs. There are already several facilitators who would like to run it virtually out of their own initiative. We have also created&nbsp;<a href=\"https://docs.google.com/spreadsheets/d/12DLNorqukYshbkd2_OS-kdIngQRi0yonE0opC6XM478/edit#gid=0\"><u>a google sheet&nbsp;</u></a>so people can add their contact if interested in participating.&nbsp;</p>", "parentCommentId": "EcanaHNjgNDNyDLKL", "user": {"username": "tereziekosik"}}]