[{"_id": "mCxJDzASpqjj9ce2k", "postedAt": "2022-11-20T02:34:03.726Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>I don't know anything about this area, but it sounds like something that I'd expect people have looked at before if it's so technically simple. Do you have a sense of whether this has been trialed, or why it isn't already being done at scale?</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "iCfFooJKaQfHSMswh", "postedAt": "2022-11-20T18:37:04.218Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>I expect most experts are scared of the political difficulties. Also, many people have been slow to update on the declining costs of solar. I think there's still significant aversion to big energy-intensive projects.\nStill, it does seem quite possible that experts are rejecting it for good reasons, and it's just hard to find descriptions of their analysis.</p>\n", "parentCommentId": "mCxJDzASpqjj9ce2k", "user": {"username": "PeterMcCluskey"}}, {"_id": "qCBEvnBw6AD69mzwm", "postedAt": "2022-11-21T06:20:15.152Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>We have repeated evidence of good designs being ignored for a decade or more; hence the Silicon Valley axiom: \"10 years ahead of time is as good as wrong.\" Similarly, good designs can be appallingly simple, and go unnoticed - for example, <a href=\"https://www.youtube.com/watch?v=umfvm8I9_oU\">Torggler's swinging-door</a> design (watch on YouTube; there is no way to explain it properly, because it is so bizarrely <i>simple</i>).</p><p>Another example is the original river-clean-up buoy-net system, debuted decades ago, and promptly ignored, despite grabbing all the plastic <i>before</i> it entered the ocean. We continued to hope for 'something to clean up the plastic' and grasped, later, at the Ocean Clean-Up guy who gave a TED talk. He got millions of dollars, and eventually he <i>heard</i> about the river-scooping buoy bot, and he began promoting it. Without that TED-talker's promotion, it's likely we'd all <i>still</i> not know about the more-effective and simpler and safer river-bot. This happens all the time.</p><p>Similarly, in 2007, Leapfrog licensed from Anoto a unique dot-pattern, to print on regular paper (<i>tiny</i> dots, you can't see) such that an optic on a 'pen' could read the coordinates, and use an on-board computer and audio to output based upon what it saw you writing. So, you could draw a drum set, and tap each drum to hear it play. Leapfrog was making kid's workbooks and tailored software. I told them to put the dots on clear adhesive plastic, to convert any existing computer screen into a touchscreen. I faxed them my details, granted them license (they held all the others, and I didn't want to compete), and they proceeded to ignore me for six years. Leapfrog spun-off the pen and dots, to Livescribe, who was still stuck on how 'paper is the answer'. By 2013, they'd licensed my touchscreen to Panasonic, who bottled it up inside their $400 tablet that wowed the Germany Electronics Expo with its artistic precision. Artistic precision you could have had in 2007, and you still can't, because Panasonic is camping on the license.</p><p>Don't pretend that every simple idea must have already been discovered, or must obviously come into use, if it is known. Human reticence to new ideas is often the bigger barrier.</p><p>The primary reason no one already mentioned such a solution is: you can't <i>capture</i> the water. Just like Tesla's hope for free energy, rain from the sky is difficult to market. Yet, I propose it for the <i>governments</i> who have viable lands; they would see tax returns which would make it valuable, as long as it rained in some of the desert.</p>", "parentCommentId": "mCxJDzASpqjj9ce2k", "user": {"username": "Anthony Repetto"}}, {"_id": "FYYz4XpPttKuNT6PE", "postedAt": "2022-11-21T08:43:46.426Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>These details might help see the complexities</p><p>[[a cross-post of my comment from the Lesswrong cross-post of the original post, in that thread of comments!]]</p><p>Let's start at a more practical scale: make the Negev Bloom.</p><p>The Negev is 12,000 km2, which, if we want grasslands, needs some 300mm extra rain or more each year. That's 3.6 billion tons per year, or just 10Mt a day. With 20g/m3 humidity, we'll need passage of 500 billion m3 of air-flow each day. With convection driven by solar concentrators (those same which drive the pumps) to increase wind velocity during the day to 4m/s, across trays stacked 12.5m high, provides 50m3/sec, 4.32 million m3 per day across each meter of intake.</p><p>Next, we pump rows inland, as each humid layer rises, to capture drier air as they mix and move-past. Additional solar concentrators power these, and conveniently, the concentrators' intense heat pushes humid air higher than it would during gentle billowing convection, rising to cool &amp; enter the cloud-cycle faster. We would only be prevented from extending more rows if the elevation rises too high, or we create so much humidity and cloud-cover that our solar concentrators cease. Let's just say we have four rows.</p><p>With 4.32 million m3 per meter of intake width, we'll need 116,000 meters... that's only 72 miles. With our four rows, that's a length of coast 18 miles long. The Gaza Strip is enough to water the Negev.</p><p>And, as I mentioned in an earlier response to you, the vast majority of the humidity released by the Persian Gulf, Dead Sea, Red Sea, Mediterranean, is being used to fight-against the immense downdraft of adiabatically-heated and ultra-dry upper atmosphere, which is descending because of the boundary between Hadley and Ferrel cells. So, yes, there are billions of tons of water evaporating, and no rain!</p><p>Yet, we know from geological records as recent as 9,000 bc, the Sahara was wet, with vast lakes - because of a slight increase in humidity <i>above</i> the threshold for accumulation. The deserts are not 'infinitely' dry, such that all water never results in rain. Rather, they are just below a 'threshold', with water added by evaporation in huge amounts, and a <i>slightly</i> huger amount being taken away by adiabatic downdraft. If we add just a portion of humidity, we are doing exactly what occurred across the Sahara repeatedly, and it led to accumulation, because it was enough to cross the desiccation threshold. Our own soil records prove that the desert can be green, with just a little <i>more</i> water than it currently evaporates.</p>", "parentCommentId": "mCxJDzASpqjj9ce2k", "user": {"username": "Anthony Repetto"}}, {"_id": "JRBm6uS6z6DWiKRFv", "postedAt": "2022-11-21T11:12:11.574Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>Another cross-post from Lesswrong about a detailed example, the entire Sahara:</p><p>Thank you for diving into the details with me, and continuing to ask probing questions!</p><p>The water brought-in by the Sahara doesn't depend upon the area of the source; it's the humidity times the m3 per second arriving. Humidity is low on arrival, reaching only 50% right now in Tunisia, their winter drizzles! The wind speed is roughly 2m/sec coming in from the sea, which is only 172,800m/day of drift. Yet! That sea-breeze is a wall of air a half kilometer high - that is why it can hold quite a bit.</p><p>If we need +10% of a 500m tall drift, that's 50m; if we can use solar concentrators to accelerate convection, we can get away with less. And, we're allowed to do an initial row that follows the shoreline closely, while a second row is a quarter kilometer inland, running parallel to the shore, where mixing of air lets you add another round of evaporate. So, we could have four rows across the northern edge of the Sahara, each row as thick as it needs to be to hit high humidity, and 10m tall, to send +10% moisture over the entire 9 million km2 of the Sahara.</p><p>How much water would we be pumping? The Sahara carries 172,800m/day flow per m2 intake surface x 500m tall x 4,000km coastline at 10g h2o per m3 = 3.5 billion tons per day, a thousand or so dead seas. (About 1.25 Trillion tons a year, enough to cover the 9 Million km2 with 139mm of rain, on average, if it had fallen instead of being sopped-up by adiabatic heat.)</p><p>We need 10% of that, or a hundred and eighty dead seas. It seems monstrous, but much of the coastline there is low for miles, so pumping 1 ton to the top of 10m at even just 20% efficiency costs 500kJ. If you want to pump that in a day, using solar, you'll need 1/4th of a square foot of solar. That 1 ton, if we cross the threshold and it becomes surplus rain, will water 3 square meters their annual budget... and the solar is paying for that amount of irrigation <i>every</i> day; 1,000 m2 of rains from a dinner plate of solar, each year. It's that energy efficiency, combined with dead simple capital expenditures, which would make something so insane <i>potentially</i> feasible. I'd pick California to try, first!</p><p>500kJ per ton, for 350Mil tons per day - that's 175TJ per day, or 2 GW. That's a nuclear power plant. To pump enough water, continuously, to irrigate 9 million km2, potentially feeding a billion people, once we dig swales! (Check out Africa's better-than-trees plan: \"<a href=\"https://www.climatelinks.org/sites/default/files/asset/document/AGR%2002-03%20AG%20Management%20Practices_CLEARED.pdf\">Demi-Lune</a>\" swales that catch sparse, seasonal rain, to seep into the ground, with minimal tools and labor!)</p>", "parentCommentId": "mCxJDzASpqjj9ce2k", "user": {"username": "Anthony Repetto"}}, {"_id": "cWAi2XqaHDJL8cdTW", "postedAt": "2022-11-21T12:25:36.779Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>Whoo. Last cross-post for the night, I think I've responded to the major points... and I hope this shows a bit more of the complexity underneath my simplistic presentation!</p><p>How quickly it rains down depends on a few factors, and we can tip those in our favor:</p><p>--&gt; Humid Rise - humidity (just the h2o molecule) is only 18g/mol, while oxygen molecules are 32g/mol, so humid air is <i>quite</i> buoyant! Especially considering that water vapor reflects heat (infrared) back to the ground, creating a heat bulge beneath it. The result is that, once humidity begins to rise, it naturally pulls air in from all around it, along the ground. It begins to drive convection. Yet! That humid rise is normally billowy and easily dispersed by cross-breezes, which means that the humidity cannot rise high quickly; it mostly travels far overland, or stays in place. Your rain wanders to an unexpected location! We want to form rain clouds nearby, instead, so we need that humidity to rise really high, quickly, without being torn apart by cross-breezes. That's where the solar concentrators help, with their tall tower at 1200C and radiant, they blast infrared into all the water vapor around them, pummeling a plume high up, carrying that vapor. Up high enough, the air <i>pressure</i> drops, which is key for causing a rapid cooling, and the formation of nice heavy clouds. The faster we take air from the ground up to a few kilometers, the more water it'll still be holding. [[Only a fraction of one gram per m3 is needed for the thinnest clouds, but we could toss a few grams up and it'll come down soon. We want the water to rain, evaporate, and rain down again, in as many cycles as it can. That gives plants time to grab it, in numerous locations, as well as time for the ground to catch some.]] When we look at water-demand for plants in the wild vs. water-resilient greenhouses, we can drop water demand ten-fold because nine-tenths of the water was lost in the leaves to evapotranspiration! As a result, if that leaf-sweat keeps rising and falling as rain as it travels further South, then the same bucket of water ends up getting ten times the use (assuming ground water is eventually used, as well).</p><p>--&gt; Albedo - the desert rock is pretty bright, so the addition of vegetation and especially any water-bodies (!) will multiply the solar absorption, which will drive that heat-bulge and evaporation for humidity-buoyancy, to help loft water vapor and form clouds. This is how the Amazon does it - most of her clouds are her armpit fog, caused by solar-to-thermal foliage!</p><p>--&gt; Vortices - the solar concentrators themselves can be rigged with a few flanges, to nudge their inflowing convection as it quickens toward the center, to spin that up-draft, helping it stay coherent and push higher, for rains nearby. Any Youtube video on Rocket Stoves by Robert Murray-Smith is best for enjoying such a vortex!</p><p>--&gt; Swales - I love swales. I've been preaching swales since 2010. I heard, almost immediately, when Sepp Holzer started pitching his \"crater gardens\" ... which were dug by an excavator, four feet deep. I was aghast - my favorite swales are micro-swales, a few inches deep, in flakey soils that rain seasonally, to catch it as it dribbles. That's what they're doing in the Sahel, south of Sahara, to stop the deserts. By halting the flow of water along the ground, keeping it for seep, roots, and another evaporation, you prolong the <i>residence-time</i> of each ton of water, leading to a greater <i>equilibrium stock</i> - that is, a high normal lake line, because each ton of water rarely ever leaves.</p><p>And, as to infrastructure before success - California could probably boost rains enough to help farmers and forests, here, without needing to conquer an entire desert the size of Europe!</p>", "parentCommentId": "mCxJDzASpqjj9ce2k", "user": {"username": "Anthony Repetto"}}, {"_id": "vKAEzmpyuazzaZLA9", "postedAt": "2022-11-22T10:42:55.619Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>Highly suggest producing some diagrams&nbsp;</p>", "parentCommentId": null, "user": {"username": "Darren_Tindall"}}, {"_id": "N6CN8dEhGSstgyGau", "postedAt": "2023-02-18T22:14:12.690Z", "postId": "6aXfG57FvbcrKf9Qd", "htmlBody": "<p>Another wonderful example of \"so simple, why didn't anyone try it before\" just this week:</p><p>Robert Murray-Smith's wind generators seem to have a Levelized Cost comparable to the big turbines, yet simple and cheap, redundant:&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=7BE3FWBXuHQ\"><div><iframe src=\"https://www.youtube.com/embed/7BE3FWBXuHQ\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure>", "parentCommentId": "mCxJDzASpqjj9ce2k", "user": {"username": "Anthony Repetto"}}]