[{"_id": "XRTdn4bpsZJZWo4kC", "postedAt": "2022-12-06T19:48:18.472Z", "postId": "6CFt2swzcZqHspgbM", "htmlBody": "<blockquote><p>Ecomodernists are more meliorist, while effective altruists are more longtermist.</p></blockquote><p>Admittedly, \"meliorism\" is a new concept for me, but I'm confused how it is in conflict with longtermism. Aren't most EA-proposed solutions to longtermist problems based on human technological/social progress?</p>", "parentCommentId": null, "user": {"username": "Jasper Meyer"}}, {"_id": "mjA4hkTEExvqYmKZq", "postedAt": "2022-12-06T20:09:36.977Z", "postId": "6CFt2swzcZqHspgbM", "htmlBody": "<p>I wrote this as a reply to the author, as I thought there were a couple of misunderstandings in the piece , sharing here as it might be useful for others (lightly edited). I was at Breakthrough , where the author works, in 2012:<br><br>\"<br>* <strong>The point on prioritizing animals v biodiversity/valuing nature is indeed a key difference between ecomodernists and many effective altruists.</strong><br>* The <strong>other distinctions seem less fitting.&nbsp;</strong><br><br>* (1) Will's <i>What We Owe The Future </i>is just one particular perspective within effective altruism, <strong>there are many effective altruists that are skeptical of the ability to shape the long-term future</strong>, see e.g. Kelsey Piper<a href=\"https://asteriskmag.com/issues/1/review-what-we-owe-the-future\"> here&nbsp;</a></p><p>*<strong> (2) Effective altruists do not have a commitment to crypto as an institutional form of social organization</strong> -- so the move from \"SBF was a crypto guy and an EA\" to \"EA is anti-institutionalist\" seems wrong. SBF was excited about crypto because he wanted to get really rich fast, not because he believes in decentralized anti-institutionalism in the way that many crypto ideologues do.<br><br>* (3)<strong> Insofar as effective altruists work on climate</strong>, <strong>it is </strong><i><strong>all </strong></i><strong>about fixing institutions</strong> -- the primacy of policy and improving policy through funding advocacy charities (see e.g. <a href=\"http://founderspledge.com/climate\">here</a>,<a href=\"https://www.volts.wtf/p/volts-podcast-johannes-ackva-on-effective\"> here</a>).<br><br>* (4) <strong>A lot of other EA work is institutionalist also</strong>, such as work to ensure governments take risks from engineered pandemics and advanced artificial intelligence more seriously.\"</p>", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "rJtSFHhHaxa8gWHaR", "postedAt": "2022-12-11T14:19:03.151Z", "postId": "6CFt2swzcZqHspgbM", "htmlBody": "<p>I am writing an invited reply to be published on the site hopefully published later this week.&nbsp;</p>", "parentCommentId": null, "user": {"username": "jackva"}}]