[{"_id": "A2F8PGHJ5FbLuFdRK", "postedAt": "2022-08-25T16:26:06.682Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>I think exercises like this are incredibly underrated and that the quantitative updates to the cost-effectiveness of each charity are the most important contribution of this post. But I do think that this would benefit a lot from putting the spreadsheet correction details in a technical appendix and dedicating more of the body to a substantive review of uncertainty analysis. You flag it as the most important disadvantage of GiveWell's framework and then only promise to talk about it in a future post - the result is that this post does not have that much substance for people to discuss or think about, and most of the 45 minute read is spreadsheet details. So I wish I could engage in a critical discussion but I don't think there's much to engage with, except that AMF is looking pretty juicy right now.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "mbtoDKxhxgYtDamzx", "postedAt": "2022-08-26T11:18:03.107Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Thanks so much. This is a tour de force! I have one more suggestion about this model. I know that GiveWell has strong reasons to use its own metrics rather than DALYs or QALYs. The problem is that DALYs and QALYs are much more widely used in the academic literature.</p><p>My suggestion is the model should report estimated $/DALY averted <i>in addition to</i> &nbsp;(not instead of) the preferred units of cost-effectiveness as a multiple of cash transfers. This would:</p><ul><li>Provide up-to-date benchmarks to catalyze shallow investigations of new cause areas. &nbsp;There's no need to do a lot of modeling to quickly evaluate a new intervention that reports in units of $/DALY averted.</li><li>Allow for a quick \"reality check\" of these models. Do they lead to results that are in the same ballpark as published estimates from the literature?</li></ul><p>Even if the EA cost-effectiveness units are indisputably better, the benefits of being able to engage more directly with the research community seem to outweigh the costs of adding a few rows to the model.</p>", "parentCommentId": null, "user": {"username": "mpt7"}}, {"_id": "MdCgBJreSqgZYGBGe", "postedAt": "2022-08-26T15:40:48.953Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Thanks so much for putting this together. I’d love to put you in touch with our team, can you follow up with me at ben.bateman@givewell.org?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ben Bateman"}}, {"_id": "mkgqNHjCcZzYwnLCf", "postedAt": "2022-08-26T16:07:38.263Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>This is really fascinating and in-depth work, and seems very valuable. You might want to consider working for GiveWell or Open Phil given your skillset and clear passion for this topic!&nbsp;</p><p>I did want to comment about one particular item you mentioned. You said:&nbsp;</p><blockquote><p>New Incentives includes an ‘<a href=\"https://www.givewell.org/international/technical/programs/new-incentives#Skeptical_prior\">adjustment towards skeptical prior’</a>, while no other charity does</p></blockquote><p>I think this is not actually correct? Deworming charities have a \"replicability adjustment for deworming\" applied to the cost-effectiveness number (see e.g. <a href=\"https://docs.google.com/spreadsheets/d/1tytvmV_32H8XGGRJlUzRDTKTHrdevPIYmb_uc6aLeas/edit#gid=472531943\">line 11 of the Deworm the World sheet</a>), which is arrived at via a <a href=\"https://docs.google.com/document/d/1TLbeSws1PcIQ6RpzG-iGZYfTLc98cmm0K4zWNhqaQoQ/edit\">similar kind of Bayesian framework</a>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "sMtGbfhqWQpMXcRRv", "postedAt": "2022-08-27T10:54:17.970Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>I had the same thought. I enjoyed this, and I super appreciate the author writing it all up! Fascinating stuff.  But it sort of felt like a home inspector telling me, “So your foundation is definitely going to crack and cause your house to fall into a sinkhole. I might tell you how to fix that in a few weeks. In the meantime, here’s an incredibly detailed analysis showing your roof is in good shape!”</p>\n", "parentCommentId": "A2F8PGHJ5FbLuFdRK", "user": {"username": "Drew Housman"}}, {"_id": "XcTtFXGr7gGp4xxcx", "postedAt": "2022-08-28T06:59:34.103Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>This was fascinating. Thanks so much for writing it, and for including your refactored model for public viewing. I'm especially looking forward to the future post on uncertainty analysis.&nbsp;<br><br>As of now, I'm fairly optimistic about the potential of recent projects like Squiggle and Causal to help take uncertainty analysis beyond the pessimistic-to-optimistic interval presented in some of GiveWell's older CEAs. I'd be interested in learning, from your future post, about the tools that health economists currently use to analyse uncertainty, and your views on how EAs should carry out uncertainty analysis going forward.</p>", "parentCommentId": null, "user": {"username": "Tanae"}}, {"_id": "te6GAM6yhJ4zu9m9z", "postedAt": "2022-08-28T11:51:30.499Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>I haven't read this through and don't know to what extent the criticisms are valid, but it certainly looks impressive.</p><p>My concern is, if some or many of these criticisms are valid, how a key player in the Effective Altruism movement could have been blind to them or at least not have addressed them, for so long. GiveWell and its cost-effectiveness model has been directing large amounts of money over the past 15 years. I would have hoped that somewhere along the road they would have opened up their model to scrutiny from world-leading experts in cost-effectiveness. I see in a comment that a GiveWell representative is very keen to chat to Froolow which raises the question - why has it taken so long for that chat to happen?</p><p>Perhaps other EA orgs are also neglecting opening up their analysis to world-leading experts?</p>", "parentCommentId": null, "user": {"username": "jackmalde"}}, {"_id": "xc2NQBQ7LDxKhknrD", "postedAt": "2022-08-28T12:40:45.973Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Thanks, this is a very substantial and interesting post.</p>\n<blockquote>\n<p>I accept GiveWell have a robust defence of their approach. They say they prefer to use cost-effectiveness estimates only as one input in their thinking about charities (with ‘track record’ and ‘certainty of results’ being two other important but hard-to-quantify inputs), and therefore (I infer) don’t want to compare charities head-to-head because the 21.2x of AMF is not the same sort of ‘thing’ as the 9.8x of Malaria Consortium. For sure, Health Economists would agree that there may be factors beyond pure cost-effectiveness to consider when making a decision (e.g. equity considerations, commercial negotiation strategies that companies might employ and so on), but typically this consideration happens after the cost-effectiveness modelling, to avoid falling into the trap I mentioned above where you implicitly state that you are working with two different kinds of ‘thing’ even though they actually compete for the same resources [4].</p>\n<p>[...] I really do want to stress how jarring it is to see a cost-effectiveness model which doesn’t actually deliver on the promise of guiding resource utilisation at the margin. An economic model is the most transparent and democratic method we have of determining which of a given set of charities will do the most good, and any attempt to use intuition to plug gaps rather than trying to formalise that intuition undoes a lot of the benefit of creating a model in the first place.</p>\n</blockquote>\n<p>Could you clarify (to a layperson) what the disagreement is here?</p>\n<p>My understanding: Say we need to choose between interventions A and B, where A and B have outputs of different types. In order to make a choice, we need to make some assumptions -- either explicit or implicit -- about how to compare those different types of outputs. Either we can make those assumptions explicitly and bake them into the model, or we can model the interventions with separate units, and then make the assumptions (either explicitly or implicitly).</p>\n<p>I take it that your fertility analysis did not do this, but that GiveWell does do some of this (e.g. comparing lives saved to increased consumption), only they then take other things -- like track record and strength of evidence -- into account in addition to the model's output. Is the disagreement that you think GiveWell should also include these additional considerations in the cost-effectiveness analysis?</p>\n", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "Zx7jx8fmMmweoj382", "postedAt": "2022-08-28T15:02:01.494Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Thanks for doing this (I've skimmed, hope to read carefully). I've been trying to encourage GW a bit in this direction myself, particularly more careful data and calculation processes and  pipelines, and  using of Monte-Carlo explicit uncertainty modeling.  There may be some inertia issues at GW that need some encouragement to get past.</p>\n<p>On the explicit uncertainty, I'm trying to keep track of and encourage projects <a href=\"https://effective-giving-marketing.gitbook.io/innovations-in-givewell-esque-ceas/\">HERE</a> in this Gitbook. The work of Sam Nolan (QURI) and Joe; McGuire (HLI) seem particular relevant.</p>\n<p>I'll integrate your essay/refactoring here into that, and would love your involvement in that gitbook/project if you are interested. (Let's chat?)</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "HhoiRtjxugfti7z6v", "postedAt": "2022-08-28T19:31:50.215Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>I want to <a href=\"https://forum.effectivealtruism.org/posts/6dtwkwBrHBGtc3xes/a-critical-review-of-givewell-s-2022-cost-effectiveness?commentId=te6GAM6yhJ4zu9m9z\">link to my comment below</a> because I'm slightly concerned if any non-negligible number of the criticisms in Froolow's post are actually valid.</p>", "parentCommentId": "MdCgBJreSqgZYGBGe", "user": {"username": "jackmalde"}}, {"_id": "q9vGgciBrvsaPFvgd", "postedAt": "2022-08-29T00:10:54.291Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>I don't think this works to achieve the same end, because $/DALY is specific to measuring health benefits - it doesn't provide any way to capture increased income, consumption, etc. Nonetheless, evaluations like \"AMF saves a life for $4,000\" must have been derived from a $/DALY estimate at some point in the pipeline so I suspect it is being calculated somewhere already.</p>\n", "parentCommentId": "mbtoDKxhxgYtDamzx", "user": {"username": "therealslimkt"}}, {"_id": "H893fF6Ccs3fo89wB", "postedAt": "2022-08-29T09:08:36.162Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Ah sorry, I think I might have confused the issue a bit with my footnote. I think I've managed to conflate two issues in your mind.</p><p>The first is exactly as you say; any intervention worth doing has some effects which are easy to model and some which are difficult (maybe impossible) to model. What GiveWell has done is completely reasonable here; modelling what it can and then making assumptions about how important the other things, like track record, are in comparison to the main cost-effectiveness results.</p><p>The second issue is the more subtle one that I was driving at. Imagine you are going to buy a new car, and your friend (who knows about cars) says that modern cars are 10x more fuel efficient than the car you currently drive. Speaking very roughly, there are two strategies you could pick from to choose your next car:</p><ul><li>&nbsp;Completely ignore your friend, and pick the car that has the best MPG regardless of any other feature. This would be a good strategy if <strong>literally all you care about </strong>is fuel efficiency, but a bad strategy otherwise (because it is unlikely the most fuel efficient car is also the most comfortable to drive - especially if fuel efficiency and comfort are sort-of tradeoffs)</li><li>Treat your friend as having offered a useful rule of thumb, and so have an idea in your head about what 'good' fuel efficiency looks like. &nbsp;This is a good strategy if cars aren't really directly comparable along a straightforward scale - a Ford F-150 isn't 'better' or 'worse' than a Prius, it is just a different kind of thing.</li></ul><p>Both GiveWell (implicitly) and me in my fertility days (explicitly) argue that QALYs are like cars - you can end up in a situation where you can generate different kinds of QALYs and your best bet is to compare them with a rule of thumb like GiveWell's 10x multiplier. However I don't think GiveWell is correct in making this assumption about charities - there is in fact a single measure like MPG which we want to ruthlessly optimise, and therefore we do actually want to it the F-150 and Prius directly against each other.</p><p>However my point in the essay is that GiveWell don't actually have to choose - they can build their model as if they are in the first world and directly compare charities together, and then make their final decision as though they are in the second world and different charities will offer different profiles of benefit on top of their cost-effectiveness. This is pretty much the commonsense way of choosing a car too - you would look at MPG and directly compare cars in this way, but you might then consider other factors. It would be weird to lump all cars together in your head as 'better than 10x my previous efficiency' or 'worse than 10x my previous efficiency'.</p>", "parentCommentId": "xc2NQBQ7LDxKhknrD", "user": {"username": "Froolow"}}, {"_id": "hak67KhacqAGAM4q9", "postedAt": "2022-08-29T09:20:10.415Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>One of the key takeaways in the body of the text which perhaps I should have brought out more in the summary is that the GiveWell model is basically as reliable as highly professionalised bodies like pharma companies have figured out how to make a cost-effectiveness model. A small number of minor errors are unexceptional for a model of this complexity, even models that we submit to pharma regulators that have had several million dollars of development behind them.&nbsp;</p><p>I would say that while the errors are uninteresting and unexceptional, the unusual model design decisions are worth commenting on. The GiveWell team are admirably transparent with their model, and anybody who wants to review it can have access to almost everything at the click of a button (some assumptions are gated to GiveWell staff, but these aren't central). Given this, it is remarkable the EA community didn't manage to surface anyone who knew enough about models to flag to GiveWell that there were optimisations in design to be made - the essay above is not really arcane modelling lore but rather something anyone with a few years' experience in pharma HEOR could have told you. Is this because there are too few quant actors in the EA space? Is it because they don't think their contributions would be valued so don't speak up? Is it because criticism of GiveWell makes you unemployable in EA spaces so is heavily incentivised against? Etc etc. That is to say - I think asking why GiveWell missed the improvements is missing the important point, which is that <strong>everyone</strong> missed these improvements so there's probably changes that can be made to expert knowledge synthesis in EA right across the board.</p><p>Just to add that I think outreach efforts like the Red Team contest are a really good way of doing this - I wouldn't have heard about the EA Forums had it not been for the plug Scott Alexander gave the contest on Astral Codex Ten (which I read mostly for the stuff on prediction markets).</p>", "parentCommentId": "te6GAM6yhJ4zu9m9z", "user": {"username": "Froolow"}}, {"_id": "HFA5PEmZXDf38JgKv", "postedAt": "2022-08-29T09:25:54.105Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Please do use the Refactor however you would like, although please also add enough of a disclaimer to keep the context from this essay that the Refactor is an academic exercise which tries to stay roughly true to GiveWell's design philosophy and assumptions while improving architecture and calculation conventions. I don't think as a standalone piece of modelling it is the cutting edge of what EA could aspire to, whereas Nolan / McGuire really do seem to be operating at that level.</p><p>But yes, really happy to contribute if I can be of any help - drop me a message!</p>", "parentCommentId": "Zx7jx8fmMmweoj382", "user": {"username": "Froolow"}}, {"_id": "vgHfrbMywzLPoXRTe", "postedAt": "2022-08-29T09:28:35.943Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>This looks like you are probably right - I'm really sorry I haven't had time to go through both sets of calculations in detail but they do seem to be getting at the same sort of adjustment so that's an excellent spot. I suppose regardless, if it isn't obvious to a user that the same adjustment is being made to two different numbers then this is reason enough to make it more explicit!</p>", "parentCommentId": "mkgqNHjCcZzYwnLCf", "user": {"username": "Froolow"}}, {"_id": "dFEnGiWkT3GcLhb3k", "postedAt": "2022-08-30T17:07:29.100Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>That's not true – GW's <a href=\"https://docs.google.com/spreadsheets/d/1tytvmV_32H8XGGRJlUzRDTKTHrdevPIYmb_uc6aLeas/edit#gid=1364064522\">AMF CEA</a> goes straight to mortality reduction, no $/DALY intermediate step. None of the other GW CEAs use D/QALY either; if they don't use mortality reduction they use <a href=\"https://docs.google.com/spreadsheets/d/1tytvmV_32H8XGGRJlUzRDTKTHrdevPIYmb_uc6aLeas/edit#gid=1362437801&amp;range=A5\">2x income</a>.&nbsp;</p>", "parentCommentId": "q9vGgciBrvsaPFvgd", "user": {"username": "Mo Nastri"}}, {"_id": "Eo4zix5AbBmeE4KSi", "postedAt": "2022-09-01T06:10:02.650Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Note that there have been some independent uncertainty and sensitivity analyses in the past:</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/gMxTEMvh8RttX9Nt4/uncertainty-and-sensitivity-analyses-of-givewell-s-cost\">Uncertainty and sensitivity analyses of GiveWell's cost-effectiveness analyses</a> (from me)</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/ycLhq4Bmep8ssr4wR/quantifying-uncertainty-in-givewell-s-givedirectly-cost\">https://forum.effectivealtruism.org/posts/ycLhq4Bmep8ssr4wR/quantifying-uncertainty-in-givewell-s-givedirectly-cost</a> (from hazelfire)</p>\n", "parentCommentId": null, "user": {"username": "cole_haus"}}, {"_id": "vJfvG49o7qgkD5B6v", "postedAt": "2022-09-29T07:10:17.147Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>This was an entertaining, informative, and very well presented read (that also plays well to my love for systems and processes). Thanks for putting it together.</p>\n", "parentCommentId": null, "user": {"username": "TJPHutton"}}, {"_id": "THB8hpW3HxzBseALa", "postedAt": "2023-10-17T23:50:03.471Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Hi Froolow,</p>\n<p>Thank you so much for this thoughtful review!</p>\n<p>We've looked through the issues you identify as errors, and we believe that each of those is either not an error or is something we've deprioritized because addressing it would not change our grantmaking decisions. You can see our analysis <a href=\"https://docs.google.com/document/d/18K5kzgUqq4at8UiG1Dd5-UZRRl5Dy2Qx4Mhb7hlmj54/edit\">here</a>.</p>\n<p>This only applies to the potential errors you pointed out, not your higher-level feedback or judgment calls. We're grateful for your engagement here, and we are working on improving the architecture of our CEAs, in line with your higher-level feedback. We also recognize that the interpretability of our cost-effectiveness analysis is an area we need to improve, and we're working on that as well.</p>\n<p>Since the linked document was written for internal use, it hasn't been fully vetted in the same way that what we publish on our website is. However, we thought it may be useful to share in its current form.</p>\n<p>Best,</p>\n<p>Andrew (GiveWell)</p>\n", "parentCommentId": null, "user": {"username": "GiveWell"}}, {"_id": "nRE667cWB4y9HWxRN", "postedAt": "2023-10-22T11:42:57.791Z", "postId": "6dtwkwBrHBGtc3xes", "htmlBody": "<p>Really happy you found the critique valuable. I agree with everywhere you've said the issue is too small to be worth addressing, and also with the correction that because AMF and SMC used different data sources it was legitimate not to explicitly model indirect deaths for the AMF (I'm also pleased you've standardised your methodology in the updated model, because this was quite a big discrepancy between approaches).</p><p>I don't totally agree with the other areas where you've said you're confident there is no error at all. I think a better interpretation might be that you've got a reasonable simplifying assumption that isn't worth adjusting. For example, you say that it is appropriate to use different methodologies to account for the spillover effects of cash transfer vs income increase from deworming, which results in larger effective household sizes for cash transfer than for deworming. This is because deworming increases income via improving the earning potential of one member of the household, so there needs to be an adjustment for multi-earner households. Obviously you're the topic area experts so I'd defer to you on whether or not this is reasonable, but the way you've implemented this seems contestable to me in the abstract; around 40% of the benefits of GiveDirectly are assumed to be accrued in the form of dividends on a long-term capital investment, but those benefits are distributed across the entire family of 4.7 for the entire ten-year period of the intervention, whereas in the deworming models you explicitly downweight family size to account for dependents leaving the household over time and the possibility of having two earners in a household. It seems more defensible to me to use a constant family size over the two interventions, and instead adjust the number of consumption doublings the deworming intervention provides to account for some families having two wage earners (so a doubling in individual income from the intervention doesn't translate to a doubling in household income in the model). That is to say; either approach seems completely reasonable in isolation, but using a different approach in the two interventions favours GiveDirectly (because a given transfer spread across more people results in more utility overall, due to utility being a function of log income increase). In hindsight it is probably a bit harsh to describe this as an 'error' by GiveWell because it is a good-faith effort to capture the most important part of the model dynamics, but I also don't think it is unambiguously correct as you've indicated in your review document; there's a genuine inconsistency here. Overall I feel the same about most of the other areas you've highlighted - I was probably a bit over-harsh describing them as 'errors', but nevertheless they are potentially risky methodological steps which seem to have simpler and less risky alternative implementations.</p><p>Also on a small point of clarification - your comments in the linked document suggest that you are not worried about the hard-coded cells because they don't have any impact on calculations. Sorry if I wasn't clear in the text, but the main impact of hard coded cells is that the model becomes really hard to maintain - you won't have an intuitive sense about whether you can make certain changes or not, because certain calculations you might expect to take place actually won't happen because of the hard coding.</p>", "parentCommentId": "THB8hpW3HxzBseALa", "user": {"username": "Froolow"}}]