[{"_id": "rj4SHfjobQmyf5e2G", "postedAt": "2024-01-29T03:02:36.895Z", "postId": "6iFuEoZMvREut9Boa", "htmlBody": "<p>Nice post. I also have been exploring reasoning by analogy. I like some of the ones in your sheet, like \"An international AI regulatory agency\" --&gt; \"The International Atomic Energy Agency\".<br><br>I think this effort could be a lot more concrete. The \"AGI\" section could have a lot more about specific AI capabilities (math, coding, writing) and compare them to recent technological capabilities (e.g. Google Maps, Microsoft Office) or human professions (accountant, analyst).<br><br>The more concrete it is, the more inferential power. I think the super abstract ones like \"AGI\" --&gt; \"Harnessing fire\" don't give much more than a poetic flair to the nature of AGI.</p>", "parentCommentId": null, "user": {"username": "dschwarz"}}, {"_id": "JME9p48o7RnPoaTwQ", "postedAt": "2024-01-29T19:00:06.518Z", "postId": "6iFuEoZMvREut9Boa", "htmlBody": "<p>Please submit more concrete ones! I added \"poetic\" and \"super abstract\" as an advantage and disadvantage for fire.</p>", "parentCommentId": "rj4SHfjobQmyf5e2G", "user": {"username": "Rocket"}}, {"_id": "JeYEJNQc2nQdAAoMJ", "postedAt": "2024-01-29T21:29:53.620Z", "postId": "6iFuEoZMvREut9Boa", "htmlBody": "<p>This is great! I've publicly spoken about AI Safety a couple of times, and I've found some analogies to be tremendously useful. There's one (which I've just submitted), that I particularly like:</p><blockquote><p>I find myself thinking back to the early days of Covid. There were weeks when it was clear that lockdowns were coming, that the world was tilting into crisis, and yet normalcy reigned, and you sounded like a loon telling your family to stock up on toilet paper. There was the difficulty of living in exponential time, the impossible task of speeding policy and social change to match the rate of viral replication. I suspect that some of the political and social damage we still carry from the pandemic reflects that impossible acceleration. There is a natural pace to human deliberation. A lot breaks when we are denied the luxury of time.</p><p>But that is the kind of moment I believe we are in now. We do not have the luxury of moving this slowly in response, at least not if the technology is going to move this fast.</p></blockquote><p>From <a href=\"https://www.nytimes.com/2023/03/12/opinion/chatbots-artificial-intelligence-future-weirdness.html\">this op-ed</a> by Ezra Klein.</p>", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "g4mQ6nSHs4GPtfF2H", "postedAt": "2024-01-30T05:41:45.846Z", "postId": "6iFuEoZMvREut9Boa", "htmlBody": "<p>Thanks, Agustín! This is great.</p>", "parentCommentId": "JeYEJNQc2nQdAAoMJ", "user": {"username": "Rocket"}}, {"_id": "fDvsozzWr3dEgFhRz", "postedAt": "2024-01-30T13:35:02.182Z", "postId": "6iFuEoZMvREut9Boa", "htmlBody": "<p><strong>Executive summary:</strong> Analogies can be useful for explaining AI safety concepts, but they should be chosen carefully to avoid misrepresenting key ideas or distracting from the main arguments.</p><p><strong>Key points:</strong></p><ol><li>Analogies highlight certain aspects of a concept while obscuring others, so analogies for AI safety should minimize lost nuance.</li><li>Simple comparisons stating two things share some property often add little, but arguments drawing unintuitive conclusions via analogy can be insightful.</li><li>Analogies serve purposes like providing evidence, aiding intuition, saving time, and consistency checking.</li><li>Common attacks on analogies question if the base conceptimplies the conclusion, if the analogues are sufficiently similar, or the conclusion itself.</li><li>Entrenched analogies can mislead policymakers, so new analogies should be scrutinized, especially if expressing AI safety skepticism.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]