[{"_id": "itsc4pQtxuvXoorAm", "postedAt": "2022-09-19T16:27:38.606Z", "postId": "6iuh7i2XeuEBq2emx", "htmlBody": "<p>You might be interested in some of what we're doing with the Consumer Power Initiative.</p>\n<p>One approach is by using company equity to cause the company to engage in pro-social or displacement antisocial corporate activity.</p>\n<p>Another, perhaps complementary, approach is to advertisement pro-social use of profits (even 100%) to get an advantage with consumers. The below essay goes into it. Feel free to reach out for potential collaboration opportunities (pro-social economic behavior +pro-social use of profits and advertising of it) : <a href=\"mailto:Brad@consumerpowerinitiative.org\">Brad@consumerpowerinitiative.org</a></p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the\">https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the</a></p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "4qAEqcL99NJGjghs8", "postedAt": "2022-12-11T15:22:24.252Z", "postId": "6iuh7i2XeuEBq2emx", "htmlBody": "<p>(Background:  I work in PE and have previously worked in public equities aka asset management)\nThere are quite a few good articles here:  <a href=\"https://forum.effectivealtruism.org/topics/socially-responsible-investing\">https://forum.effectivealtruism.org/topics/socially-responsible-investing</a>.\nIn general, I would say that ESG is hard - hard to do right, hard to measure the impact, hard to communicate.\nIf you owned 100% of a slaughterhouse, it's not obvious what you should do.  As Lewis has implicitly acknowledged, you can't simply shut it down (because another one would simply open up down the road and you've just blown a load of money).  The smartest idea is probably to run it with basic ethical improvements.  However, if you deviate too much from standard practice, you will quickly become uneconomical.  If you're uneconomical, you will either go out of business or will need ongoing subsidy in the form of donations.  The second-order effects are difficult to quantify.  If EA started buying up slaughterhouses, then theoretically this would lead to more demand for slaughterhouses, a lower cost of capital, a lower cost for meat and ultimately more meat consumption!\nI'm not intending to get into a debate about this specific example here.  I'm sure some very smart people will point out the errors of my comments above.  However, I do hope it shows how even a simple example can end up being quite complex.</p>\n", "parentCommentId": null, "user": {"username": "Grayden"}}]