[{"_id": "ajp5qdXk6BKYZfzXR", "postedAt": "2023-08-21T04:57:41.893Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>Upvoted. This is what longtermism is already doing (relying heavily on non-quantitative, non-objective evidence) and the approach can make sense for more standard local causes as well.</p>", "parentCommentId": null, "user": {"username": "michaelchen"}}, {"_id": "kmafEAinuqTFX7gBt", "postedAt": "2023-08-22T12:41:47.241Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>Strong upvote I love this, and agree with the central thesis. In general I agree with taking whatever clear opportunities arise to increase the good done in the world, even if it isn't our primary thing.</p><p>Unfortunately <i><strong>where there are </strong></i>quantitative models available even when very poor, I find them to seem (with great uncertainty) more convincing than community leader opinion</p><p>\"Community leaders in small, old, tight-knit communities (whether it's Indigenous communities in Canada like my colleague interfaces with, or rural communities in the US, or villages in Uganda like <a href=\"https://twitter.com/KaluluAnthony\">Anthony Kalulu</a> supports) have not only their own lifetime of experience to draw from, but also the experience passed down from generations of community leaders before them, perhaps for centuries or millennia. If you ask them what works, they could give you a <strong>better, more reliable answer than a quantitative model</strong> -- if the only quantitative model they have access to has but a few months' worth of data collected under questionable conditions.\"</p><p>My experience (unfortunately) in Uganda doesn't corroborate this. I agree its possible that they \"could\" give you a better answer than a quantitive model, but I don't think they usually do. <i><strong>It hurts me a little</strong></i> to confess that BOL fermi-ish quantitive models (where possible) - done by experienced people with expertise in the field, seem in my limited experience usually better than the thoughts of an experienced community leader.&nbsp;</p><p>But your general point still stands - that influencing non-EA people, usually with non-quantatitve data to give and focus on better local causes could have great impact, and often wit little effort. There s also the chance of swinging people slowly towards more mainstream EA causes with this lighter touch approach.&nbsp;</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "3bB5qJvsWK7bT8egS", "postedAt": "2023-08-22T16:46:27.408Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>Thanks for writing this, Spencer!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Tori"}}, {"_id": "om6iEcrmyQRBnbi7s", "postedAt": "2023-08-22T19:29:06.578Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>This consideration is already \"priced in\" to givedirectly's worldview, the whole \"reforming paternalistic versions of charity by transferring cash / they know what they need better than we do\" is well-established and remains held in high regard to this day.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "6PYgQMtfYKGq4DFM9", "postedAt": "2023-08-22T20:35:07.166Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>GiveDirectly is a great option for people who put a high value on beneficiary autonomy and are open to giving anywhere in the world! This post is more about including people in the effective giving conversation who want to give back to their own community -- maybe because they already live in one of the communities in the world with extreme poverty, or maybe because they're not all the way EA and that's just how they prefer to give.</p>", "parentCommentId": "om6iEcrmyQRBnbi7s", "user": {"username": "Spencer Ericson"}}, {"_id": "n7Fp6JpfokTcxzeqR", "postedAt": "2023-08-22T20:45:47.311Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>(Can't say enough how much I appreciate it when people take my words of uncertainty like \"could\" literally!) Indeed, in most situations I can think of, I'd prefer a quantitative model. Especially by an experienced expert! Would that it were always available. Thanks for your comment!</p>", "parentCommentId": "kmafEAinuqTFX7gBt", "user": {"username": "Spencer Ericson"}}, {"_id": "rDvBJ4RMJMbycZp3Q", "postedAt": "2023-09-05T14:37:42.247Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>strong upvoted, I think it's good to encourage non-EAs to give more effectively and I think it's good to broaden what we think of as \"evidence\" and consider its pros and cons.</p><p>I work with a community in my city that gives primarily locally (leaving aside my judgment on that), and I find that many people <i>think</i> that they're not giving based on any idea of effectiveness: e.g. they'll say they're giving based on community need, or trust in a relationship they have, or values-alignment. But usually there's an implicit sense of \"what is effective\" underneath that, and it's helpful to push people to make that explicit: if you're giving because you trust the relationship you have with this organization, how good of a signal is that about the organization's work? Is it a better signal than other evidence you have access to?</p><p>(Aside: Quite often with small grassroots organizations, I think a strong relationship with the right people honestly is one of the best available signals! In particular, I find that the organizations that community leaders consider important/tractable/neglected - though not using those words - are not always the ones that gain a lot of media attention, external funding, etc.)</p>", "parentCommentId": null, "user": {"username": "Emily Thai"}}, {"_id": "Wtec7YKGJq3YcsDMb", "postedAt": "2023-10-07T01:56:00.186Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>Interesting perspective I had not thought about in this way before. It links very well with more common views of highly valuing the input (and needs) from your target communities.&nbsp;<br><br>Blake Hannagan and I are currently piloting a MEL training and coaching program for animal and vegan advocacy charities. Part of it is to investigate up to what level organizations can and should collect quantitative data, and when they'd better rely on more qualitative information; realizing the MEL in the animal space might be a bit different from MEL in global health or poverty.<br><br>Thanks for writing this!</p>", "parentCommentId": null, "user": {"username": "Nicoll Peracha"}}, {"_id": "muTarxjWc3iCTDbCe", "postedAt": "2023-10-30T20:29:05.736Z", "postId": "6ixPKHj6ucRSzL8o7", "htmlBody": "<p>Thanks for writing, and great meeting you back in August.</p>", "parentCommentId": null, "user": {"username": "dlipsitz@gmail.com"}}]