[{"_id": "v6XpxyP9eq8cByzKx", "postedAt": "2024-03-14T14:49:34.191Z", "postId": "6JMzDv58sg9QtGbPw", "htmlBody": "<p>This is a very interesting idea. I'd love to see if someone could make it work.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "uvrC46ZqdWDxQpbs6", "postedAt": "2024-03-15T00:53:38.597Z", "postId": "6JMzDv58sg9QtGbPw", "htmlBody": "<p>I like this idea. I do wonder to what extent EA is implemented more as a field-building exercise, getting others to act on their previously determined conclusions, rather than promoting the self-determination of individuals through education on rationality, epistemics, and philosophy to guide action.</p>", "parentCommentId": null, "user": {"username": "Sgt.Chuckles"}}, {"_id": "pPcLZyu5HhYjuyqQb", "postedAt": "2024-03-15T05:04:40.090Z", "postId": "6JMzDv58sg9QtGbPw", "htmlBody": "<p>As someone who has first-hand experience with many points mentioned in the post: I can say that the current state of college-level EA groups is fairly limited to theoretical conduct rather than actions. I can guess that there might be multiple reasons, but I can mention some that I have personally observed:</p><p>&nbsp;</p><ul><li>IRL College studies sometimes hardly align with EA values, especially for students in technical and business institutions.</li><li>Most scholars prefer studying <i>doing good</i> for an extended period. The rest of the time is saved for studying their original streams.</li><li>The common and foremost goal<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"lx721wkjqri\" role=\"doc-noteref\" id=\"fnreflx721wkjqri\"><sup><a href=\"#fnlx721wkjqri\">[1]</a></sup></span>&nbsp;for college EA groups is organizing events for reading and discussion of just resources(posts and blogs). IRL EA college groups are typical Whatsapp groups serving as crossposting events, that's all. There may be opportunities present locally, but typically. college students can't afford to get involved at the student level.</li><li>College students are often surrounded by substantially large groups of non-EA people.</li></ul><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"lx721wkjqri\" role=\"doc-endnote\" id=\"fnlx721wkjqri\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"lx721wkjqri\"><sup><strong><a href=\"#fnreflx721wkjqri\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>First-hand experience.&nbsp;</p></div></li></ol>", "parentCommentId": "uvrC46ZqdWDxQpbs6", "user": {"username": "Mayank Modi"}}, {"_id": "Jtbw3fpxaLGvQptbe", "postedAt": "2024-03-15T06:26:31.273Z", "postId": "6JMzDv58sg9QtGbPw", "htmlBody": "<p>I'm not entirely sure whether your point here is in agreement or disagreement with my previous statement. Correct me if I am wrong, but I think you're saying something along the lines of:</p>\n<p>\"students aren't taking immediate action and are only going over theory, thus the community building efforts focused on theory must be open-minded and don't represent field building\"</p>\n<p>If that's the case, I don't see the complete logic of how because it 'can' work out that way that it 'must', and the ambiguity is what I'm focused on and would like more evidence on. Success metrics in my experience or uni groups particularly focus on participation rather than depth/retention of engagement.</p>\n", "parentCommentId": "pPcLZyu5HhYjuyqQb", "user": {"username": "Sgt.Chuckles"}}, {"_id": "bHGfFDpE6EBridoLZ", "postedAt": "2024-03-15T07:36:30.213Z", "postId": "6JMzDv58sg9QtGbPw", "htmlBody": "<p>I agree with the proposal of <a href=\"https://forum.effectivealtruism.org/posts/6JMzDv58sg9QtGbPw/university-groups-as-impact-driven-truth-seeking-teams\">University groups as impact-driven truth-seeking teams</a> and mentioned a few of my observations corresponding to your comment. Of course, it can work out. I tried to think about some of the reasons behind the same ambiguity you mentioned. It is just my two cents. I, too, consider the importance of participation above all.&nbsp;</p>", "parentCommentId": "Jtbw3fpxaLGvQptbe", "user": {"username": "Mayank Modi"}}, {"_id": "Pqo4HMXPjJ8azA2jM", "postedAt": "2024-03-27T16:15:00.699Z", "postId": "6JMzDv58sg9QtGbPw", "htmlBody": "<p>[Opinion exclusively my own]</p><p>I think this framing has a lot of value. Funnily enough, I've heard <i>tales</i> of groups like this from the early days of EA groups, when people were just figuring things out, and this pattern would sometimes pop up.</p><p>I do want to push back a little bit on this:</p><blockquote><p>But <i>before</i> deferring, I think it's important to realize that you're deferring, and to make sure that you understand and trust who or what you're deferring to (and perhaps to first have an <a href=\"https://forum.effectivealtruism.org/posts/2WS3i7eY4CdLH99eg/independent-impressions\">independent impression</a>). Many intro fellowship curricula (eg the EA handbook) come across more as manifestos than research agendas—and are often presented as an ideology, not as evidence that we can use to make progress on our research question.</p></blockquote><p>The EA handbook (which nowadays is what the vast majority of groups use for their intro fellowships) includes three “principles-first” weeks (weeks 1, 2, and 7), which are meant to help participants develop their own opinions with the help of only the basic EA tools or concepts.</p><p>Furthermore, week 7 (“What do you think”) includes a reading of <a href=\"https://forum.effectivealtruism.org/s/32FKXByGNgHLPaHnj/p/2WS3i7eY4CdLH99eg\">independent impressions</a>, and learning that concept (and discussing where EA might be wrong) is one of <a href=\"https://forum.effectivealtruism.org/s/32FKXByGNgHLPaHnj/p/zGavnmS5hCC4mDHS8\">the key objectives of the week</a>:</p><blockquote><p>A key concept for this session is the importance of&nbsp;<strong>forming independent impressions</strong>. In the long run, you’re likely to gain a deeper understanding of important issues if you think through the arguments for yourself. But (since you can’t reason through everything) it can still sometimes make sense to defer to others when you’re making decisions.</p></blockquote><p>In the past, a lot of work has been put in trying to calibrate how “principles-based” or “cause-oriented” intro fellowships should be, and I think the tradeoff can be steep for university groups since people can get rapidly disenchanted by abstract philosophical discussion about cause prioritization (as you mention). This can also lead to people treating EA as a purely intellectual exercise, instead of thinking of concrete ways in which EA ideas should (for example) change their career plans.</p><p>That said, I think there are other ways in which we could push groups further along in this direction, for example:</p><ul><li>We could create programming (like fellowships or workshops) around cause prioritization, exploring different frameworks and tools in the field. Not just giving a taste of these frameworks (like the handbook does), but also teaching hands-on skills that participants can use for actual cause prioritization research.</li><li>We could push for more discussion centered around exploratory cause research, for example, by creating socials or events in which participants try to come up with cause candidates and do some preliminary research on how promising they are (i.e. a “cause exploration hackathon”).</li></ul><p>I know there has been some previous work in this direction. For example, there's <a href=\"https://resources.eagroups.org/workshops-talks-ideas/ea-research-methods-workshop#block-3fda755fc2cb45999c21399ec172a260\">this workshop template</a>, or <a href=\"https://docs.google.com/document/d/1A-AJLTbukninH_enX0Ex_w-8S4dWj8TB4_-Qi1KGPvQ/edit#heading=h.jb2z0ni66pez\">this fellowship on global priorities research.</a> But I think we don't yet have a killer demo, and I would be excited about groups experimenting with something like this.</p>", "parentCommentId": null, "user": {"username": "agucova"}}]