[{"_id": "M4YiciMopZJ5XGFzE", "postedAt": "2018-02-23T03:35:54.004Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>Out of curiosity, how many local groups already have paid organisers and how do you think this compares with an additional employee at a non-local EA org?</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "tbgdAEdS3Hx3obeMz", "postedAt": "2018-02-23T03:38:14.963Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>Please know, I am not being critical, just genuinely curious. </p>\n<p>&quot;We expect to have a particular emphasis on funding groups aiming to transition from being run by volunteers to being run by full-time, paid organizers.&quot; Why? What more can a paid organizer do? </p>\n<p>I'm thinking about myself, and I don't see how paying me would significantly increase my time related to EA advocacy. For example, I plan to put up college student tailored posters in the academic buildings. After that, speaking to several large lecture halls before class starts (given permission from each prof). Although, in retrospect, I am more of an average joe EA (E2G on the brink of going from the GWWC 1% student minimum to the professional donation, 10%, and investing the rest). </p>\n<p>$5k for renting out a facility? $100k for a group for what? A bigger facility? Or is it more like those fancy $500-a-plate dinners? Is there an EA organizer who's put on a benefit-type dinner before? I mean, I presume that putting on such events need money to start with...</p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "NKxLSZcGvsFes5yvc", "postedAt": "2018-02-23T07:13:52.054Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>I think the idea is more targeted at groups which try to do more than putting up posters or give EA pitches. Organising high-quality talks, discussion meetups and doing long 1 on 1 conversations (career planning etc.), can be very time-consuming. In our local group, the biggest obstacle to improve further and to develop long-term projects is the fact that everyone has other things to do, like earn money to pay the rent. So in these cases, a grant could enable one or two highly motivated people to focus on EA community building full-time and increase the impact of the group substantially. </p>\n", "parentCommentId": "tbgdAEdS3Hx3obeMz", "user": {"username": "olekV"}}, {"_id": "E68XwwsF3DFB5Zbkf", "postedAt": "2018-02-23T08:07:29.582Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>The org's I can remember off the top of my head are: EA Sweden (that's me), EA Geneva, EA London, EA China, EA Netherlands (used to have full-time staff, but don't anymore) and EA Australia.</p>\n<p>I'm excluding CEA, EAF and Rethink Charity here.</p>\n", "parentCommentId": "M4YiciMopZJ5XGFzE", "user": {"username": "MarkusAnderljung"}}, {"_id": "bFH3WtrhNhjTmEr7N", "postedAt": "2018-02-23T12:02:16.084Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>On EA Netherlands: a major reason why we chose to switch part-time is because we had to look for other income sources (i.e. two of us were working full-time and didn't manage to raise enough funding to cover our basic living costs). </p>\n", "parentCommentId": "E68XwwsF3DFB5Zbkf", "user": {"username": "remmelt"}}, {"_id": "RRfueXKKMdef7zXb8", "postedAt": "2018-02-23T16:40:41.850Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<blockquote>\n<p>What more can a paid organizer do?</p>\n</blockquote>\n<p>It may be that paid organisers simply increases the scale of the things they do already - eg. putting on more discussion groups, talks, workshops etc. though it could also be that having increased capacity enables groups to test promising strategies that they wouldn't have previously been able to. </p>\n<p>One reason for thinking that it should be possible for organisers to increase the scale of their activities (and for this to result in an increase in the value that the group produces) is that even the largest groups seem to reach a fraction of their target audience. If groups aren't limited by the available target audience, and the grants process means that groups aren't limited by organiser time or funding, it seems that groups are likely to be able to increase the value they produce. </p>\n", "parentCommentId": "tbgdAEdS3Hx3obeMz", "user": {"username": "hbesceli"}}, {"_id": "QTsEeLcLpB6e6FFeR", "postedAt": "2018-02-23T21:32:47.941Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>My understanding is that EA Australia is hiring, but they don't have anyone yet.</p>\n", "parentCommentId": "E68XwwsF3DFB5Zbkf", "user": {"username": "casebash"}}, {"_id": "qMERNFnyaxkcR2m2j", "postedAt": "2018-02-24T07:14:37.939Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>Did you consider giving the grants to several organizers working part-time with one group?</p>\n<p>Some arguments against: </p>\n<ul>\n<li><p>It's more difficult to coordinate with multiple people </p>\n</li>\n<li><p>Organizers need to coordinate with each other</p>\n</li>\n<li><p>The required skillset is very rare, assuming each organizer needs to perform well w.r.t all of the skills listed. </p>\n</li>\n</ul>\n<p>Some arguments in favor:</p>\n<ul>\n<li><p>Low transferable career capital (outside the EA community). Some potential candidates expressed concerns that working full time would require them to interrupt their studies. Working part time would mostly just mean they would quit their student jobs (e.g. as tutors at the university), which has significantly lower opportunity costs. Offering part-time positions might therefore result in more high-quality applications.</p>\n</li>\n<li><p>Tax considerations (In Germany and likely even more in Scandinavian Countries). In Germany, with an income of 35000€ per year you'll have to pay about 5000€ in taxes. Three incomes of ~11650€ result in 0€ in tax payments. The average income of a student in Germany is 918*12=11016 (according to the German social suvey 2016 -<a href=\"http://www.sozialerhebung.de/index_html/documents/englisch)\">http://www.sozialerhebung.de/index_html/documents/englisch)</a>.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Jan_Sz"}}, {"_id": "hzWbAHtFMr9tePm9W", "postedAt": "2018-02-24T11:01:02.500Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>Yep, EA Australia currently has no paid employees. But we are hiring for an Accounting and Administration Manager, with that wage funded by private donations from within Australia.That role won't be targeted towards community building, it will primarily be ensuring EA Australia meets its accounting and reporting obligations as a charity. </p>\n<p>However, after recent discussions with Australian local EA group organisers, and in line with planned changes to our org structure, EA Australia is considering recruiting a person to serve as a central coordination point for Australian local group organisers. Yes, meta. </p>\n<p>I'm interested to know if there is any similar model for this in other regions. That is - are there any situations where one person acts as a central resource point and support for local groups in their country/region and as an interface between their country/region's local groups and the rest of the global EA community?</p>\n<p>Ps. If you have any Australian based friends who might be good for EA Australia's Accounting and Administration Manager position please let them know about the role: <a href=\"https://www.seek.com.au/job/35533240?type=standard&amp;userqueryid=ccec30d92e7aa652b9d1f30349919d04-7905238\">https://www.seek.com.au/job/35533240?type=standard&amp;userqueryid=ccec30d92e7aa652b9d1f30349919d04-7905238</a>. </p>\n", "parentCommentId": "QTsEeLcLpB6e6FFeR", "user": {"username": "Bridget_Williams"}}, {"_id": "MdiLQcTuiDqBT858N", "postedAt": "2018-02-25T12:23:26.540Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<blockquote>\n<p>how do you think this compares with an additional employee at a non-local EA org?</p>\n</blockquote>\n<p>EA London estimated with it's first year of a paid staff it had about 50% of the impact of a more established EA organisation such as GWWC or 80K per £ invested.</p>\n<p>It is also worth bearing in mind that the non-monetary costs of ' an additional employee' are higher than the non-monetary costs of a grant (eg, training, management time, overheads, risks, opportunity costs) </p>\n", "parentCommentId": "M4YiciMopZJ5XGFzE", "user": {"username": "weeatquince"}}, {"_id": "roYTCQwQ5drFG4N6a", "postedAt": "2018-02-25T12:55:52.574Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<blockquote>\n<p>EA London estimated with it's first year of a paid staff it had about 50% of the impact of a more established EA organisation such as GWWC or 80K per £ invested.</p>\n</blockquote>\n<p>Are they mostly counting impact on Givewell-recommended charities? I'd imagine that for donors who are mostly interested in the long-term cause area, there'd be a perceived large difference between GWWC and 80k, which is why this sounds like a weird reference class to me. (Though maybe the difference is not huge because GWWC has become more cause neutral over the years?) </p>\n", "parentCommentId": "MdiLQcTuiDqBT858N", "user": {"username": "Lukas_Gloor"}}, {"_id": "ZdpBLBmtcZKLQdcme", "postedAt": "2018-02-25T14:14:34.770Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>This sounds like a good idea - I think in-person contact could counteract attrition. Could you clarify how this interacts with the next round of the more general EA grants (e.g. allocated money amounts and timing)?</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "3DRiCSRHTDkikjxb9", "postedAt": "2018-02-26T19:14:05.320Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>Yes, we're open to accepting both for either for grants covering project in which people either intend to work full-time or part-time, and for either joint or individual applications. We don't have a strong preference for receiving any particular type of application within this. </p>\n", "parentCommentId": "qMERNFnyaxkcR2m2j", "user": {"username": "hbesceli"}}, {"_id": "D9HTPLf4LBuMEHx8z", "postedAt": "2018-03-11T22:21:09.642Z", "postId": "6kFcr6L2jZhcsZnao", "htmlBody": "<p>EA London estitated counterfactual &quot;large behaviour changes&quot; taken by community members. This includes taking the GWWC pledges and large career shifts (although a change to future career plans probably wouldn't cut it)</p>\n<p><a href=\"http://effective-altruism.com/ea/1fh/lessons_from_a_fulltime_community_builder_part_1/\">http://effective-altruism.com/ea/1fh/lessons_from_a_fulltime_community_builder_part_1/</a>  </p>\n", "parentCommentId": "roYTCQwQ5drFG4N6a", "user": {"username": "weeatquince"}}]