[{"_id": "AnMBgNkDyR4XBN8Dc", "postedAt": "2024-03-12T15:30:51.306Z", "postId": "6Ku4KeCoRzoN4BiEd", "htmlBody": "<p><strong>Executive summary:</strong> Pre-slaughter mortality rates of farmed shrimp are high, with around 53% dying before slaughter age, but it is unclear if reducing this mortality should be a key focus for improving shrimp welfare.</p><p><strong>Key points:</strong></p><ol><li>Survival curve modeling and literature review suggest over 50% of farmed shrimp die before slaughter, with most deaths in the larval stage.</li><li>Mortality rates are higher for Macrobrachium rosenbergii and Penaeus monodon compared to Penaeus vannamei.</li><li>Shrimp mortality rates are high compared to broiler chickens but in the middle of the range for other farmed aquatic animals.</li><li>Causes of mortality likely include sensitivity to environmental conditions in early life stages, transportation, disease, and possibly artificial selection for growth over survival.</li><li>Reducing mortality may not improve aggregate welfare if surviving shrimp still suffer, and could lead to industry growth. More research on shrimp sentience development is needed.</li><li>Advocates should focus on improving ongrowing stage conditions rather than explicitly aiming to reduce mortality, especially in the larval stage.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "LJKbNtwWEC25KuByR", "postedAt": "2024-03-12T21:43:44.426Z", "postId": "6Ku4KeCoRzoN4BiEd", "htmlBody": "<p>Fantastic and important work (as always)!&nbsp;</p><p>Figure 3 is somewhat concerning - if I squint I can sort of see some vague agreement between the different sources, but it's pretty all over the place. Do you have a sense of whether this is an area where funding additional field research would be a good idea, or do you think this is lower-priority than other potential research questions related to shrimp welfare?</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "WnRjQ78nQ5DY9jchf", "postedAt": "2024-03-13T13:29:31.040Z", "postId": "6Ku4KeCoRzoN4BiEd", "htmlBody": "<p>I personally would not make mortality the focus of the marginal research project, but I do think you would get it 'for free' in the sort of project I would prioritize. In my view, the main considerations are:&nbsp;<br><br>1. A lot of uncertainty is an artifact of inconsistent reporting practices. An article arguing for a standardized methodology in an aquaculture magazine signed by a bunch of prestigious researchers (or a presentation at an aquaculture industry event) might do more to reduce uncertainty than more data per se. &nbsp;</p><p>2. A lot of the basic trends are robust to the uncertainty. Cumulative mortality is probably around ~50% even in ideal circumstances, more intensive farms have less mortality, larval mortality is steeper than juvenile mortality, and wild shrimp have higher mortality rates than farmed shrimp.&nbsp;</p><p>3. Hannah's upcoming report, a Monte Carlo model of which welfare issues cause the most harm in aggregate while shrimp are still alive, contains enormous uncertainty due to limitations in the surveys of farms that have been conducted. As a result, the rank-order of the badness of many issues is not robust, an issue that new, higher-quality data could address. Improved surveys would presumably also measure survival, so we would gain clarity on premature mortality even though it was not the main focus.&nbsp;<br><br>4. It would probably be at least as valuable to get larval mortality estimates for the farmed fish species to which we compared farmed shrimp in Figure 4.&nbsp;</p>", "parentCommentId": "LJKbNtwWEC25KuByR", "user": {"username": "Will M"}}, {"_id": "J3mqoL3rGMoQAjMdi", "postedAt": "2024-03-13T15:02:28.847Z", "postId": "6Ku4KeCoRzoN4BiEd", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "WnRjQ78nQ5DY9jchf", "user": {"username": "MHR"}}]