[{"_id": "kM3Qdm7JW8uMgBux3", "postedAt": "2024-01-24T15:07:20.818Z", "postId": "6KZApAHng6yAcXTTd", "htmlBody": "<p>Thanks for this report. It'll be quite useful.<br>I'd like to share some critical remarks I had previously sent RCG by e-mail:</p><ol><li>Definition of “RCG”</li></ol><p>&lt;Los RCG se definen como aquellos con el potencial de infligir un daño grave al bienestar humano a escala global.&nbsp;&gt; (p.2; cf. p. 6)</p><p>This definition might be too wide – it could include the global financial crisis of 2008, for instance.&nbsp;It is constrained, though, by the subsequent sentence: &lt;Si bien se han identificado diversos riesgos que cumplen con esta definición, el presente trabajo se enfoca en los riesgos asociados a la inteligencia artificial, los riesgos biológicos y los escenarios de reducción abrupta de la luz solar.&gt;</p><p>However, afterwards, a lot of the material is based on scientific diplomacy, and preparedness for local disasters and insurance that is not directly related to these types of events. But then, it’s not clear why other risks are not considered, such as the threat of conflict, extreme global warming, or other risks with cascading effects. They provide historical examples of catastrophes; an ERALs like the Tambora eruption (1815-16) caused “the year without summer”, but didn’t kill more than 250k people; the ENSO event of 1876-79 killed around 30-50 million people (s. <a href=\"Our%20World%20in%20Data\">Our World in Data</a>; <a href=\"https://doi.org/10.1175/JCLI-D-18-0159.1\">https://doi.org/10.1175/JCLI-D-18-0159.1</a>).</p><p>Also, I don’t get what you mean by “seguros por riesgos catastróficos” (p. 8); if you mean insurance for local disasters, sure, people should buy it more often, there’s probably a market failure… on the other hand, there is also significant moral hazard here: people will often fail to avoid risky regions because they are insured. However, if you mean RCG insurance… I really don’t know this could work, as no current insurance system could be expected to survive such a loss in global output – but it would interesting to explore some possible arrangements in depth<a href=\"#_ftn1\">[1]</a>.</p><p>&nbsp;</p><p>2.Things I missed most:</p><p>a) More emphasis on geographical and economic aspects of Latin America</p><p>According to <a href=\"https://en.wikipedia.org/wiki/Latin_America\">Wikipedia</a>, Latin America has 656 million people, 20,000 km2, and a combined nominal GDP of US$5.188 trillion and a GDP PPP of US$10.285 trillion; but more than half of it is in <a href=\"https://en.wikipedia.org/wiki/Mexico\">Mexico</a> and <a href=\"https://en.wikipedia.org/wiki/Brazil\">Brazil</a>, which amount to 350 million people, 10,500 km2, and a combined GDP of aprox. US$4 trillion. And yet, they barely show up in the assessment; Brazilian policies are totally <strong>absent</strong> from appendix II.</p><p>Also, I think the report would have greatly benefitted from an assessment of the state capacity and fiscal space in Latin American countries (perhaps you considered it unnecessary, as it is taken into account by the INFORM index and by Dahl’s GCR Index?)&nbsp;</p><p>b) Historical examples of relevant disasters:<br>Such as <a href=\"https://en.wikipedia.org/wiki/Grande_Seca\">Grande Seca - Wikipedia</a> (included in the ENSO event of 1876-79), Haiti’s earthquake and cholera epidemics, Andean seismic and volcanic events, etc.&nbsp;</p><p>3. Outdated reference?</p><p>“Se estima que los daños por desastres en América Latina y el Caribe han ascendido a unos US$20.000 millones anuales en una década, con más de 45.000 muertes y 40 millones de personas afectadas (Kiepi e Tayson, 2002)”.<br>Could we find a source more up to date? This is from more than twenty years ago, when the region's GDP and population was quite smaller. By way of comparison, the National Confederation of Municipalities in Brazil estimates that natural disasters have caused losses of R$ 400 billion (US$S80 billion) in the last decade in <i>Brazil alone&nbsp;</i>(more conservative estimates put that value around half of this). If that sounds like a lot, consider that <a href=\"https://www.nature.com/articles/s41467-023-41888-1\">Newman and Noy</a> (2023) estimate that global warming alone causes US$143 billion in damage per year in the world (of which 63% refers to the value of deaths), and that Latin America accounts for <a href=\"https://www.statista.com/topics/3287/latin-america/#editorsPicks\">8.4% of the world's population&nbsp;</a>&nbsp;and <a href=\"https://ourworldindata.org/grapher/gdp-world-regions-stacked-area\">7.5% of GDP</a> – from which we could expect at least US$7 billion to US$13 billion of annual damage in the region just because of global warming.</p><p><br>&nbsp;</p><hr><p><a href=\"#_ftnref1\">[1]</a> What one usually wants from an insurance scheme is: a) pool the risk between different agents, and b) internalize <i>ex ante&nbsp;</i>the costs of risks, and c) hedge or protection against uncertain events. There are some proposed mechanisms along these lines: i) World Climate Bank (Broome &amp; Foley, 2016); (ii) the Glasgow Loss and Damage Mechanism; iii) Cotton-Barratt’s proposal of insurance for dual-use pathogen research; etc.</p>", "parentCommentId": null, "user": {"username": "Ramiro"}}]