[{"_id": "xxnP88sjZ2pPNyo35", "postedAt": "2015-01-27T23:46:17.541Z", "postId": "6LruduxDH92d8vJKs", "htmlBody": "<p>Making a multi-year commitment is pretty close to borrowing from your future self in order to donate more now.</p>\n<p>It's not exactly that, since the funds can't be spent immediately (and the recipients will have less than absolute confidence that you will follow through). But if the recipient charities are constrained by the size of their financial buffer then the effect to the charity may be very close to a larger donation up-front. And relative to actually borrowing money to do this you get a better interest rate.</p>\n<p>If this reasoning would push you to preferring a multi-year commitment, I don't see why that would change with the size of donation.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "jcfv9qRyBrNB5pB2o", "postedAt": "2015-01-29T13:02:58.396Z", "postId": "6LruduxDH92d8vJKs", "htmlBody": "<p>How could we measure the impact of this extra certainty on planning and effectiveness? Ask the charities in question? GWWC? Can't really think of how to resolve this until this question is answered, then to compare it against the expected difference between the current best charity and the future charity, which would be a (partially bounded?) guestimation..</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "B54qQ92i2ZXo5aLcR", "postedAt": "2015-01-30T00:29:31.619Z", "postId": "6LruduxDH92d8vJKs", "htmlBody": "<p>Good point about how the optimal charity can change. I think there's even more to it than this though: not only does charity estimated cost-effectiveness change exogenously over time, but making multi-year commitments can make it worse. If charities can rely on long-term funding, they have less incentive to act in accordance with donor's wishes. Conversely, by instead providing repeated short-term finances, donors can ensure the charity does not stray too far from their intentions.</p>\n<p>In markets this is not required because shareholders do actually have control over the corporation through their right to elect the board of directors. But donors rarely have this right, so need to rely on other mechanisms to ensure their capital isn't wasted.</p>\n<p>This might not seem to be a huge issue with some charities that basically just do one thing, but other charities have changed their focus considerably over time, in many times against the wishes of some prior donors, whose funds are thereby expropriated. </p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "2CRtDCnuh8MS7Yds2", "postedAt": "2015-02-03T02:15:59.421Z", "postId": "6LruduxDH92d8vJKs", "htmlBody": "<p>Below points don't rebut your claims. Rather, they're a clarification.</p>\n<p>By &quot;commitment&quot;, I meant either making public an intention of multi-year donations, and/or notifying the charity in question of this intention. For regular donations of sufficiently small amounts, the impact on the organization's budget would be negligible. e.g., If I donate ten dollars each month to an organization receiving several million dollars each year, I'm sure they appreciate it appreciates that, but it's hardly something to contact one of their directors about. If one intends to donate relatively large sums to an organization monthly or yearly, informing them for their own sake seems wise. Knowing what capacity they can operate for the next year when making a budget helps organizations, and if a single donor provides 10% of the funds, a heads-up would be nice.</p>\n<p>I'm assuming donors associated with effective altruism may be funding smaller organizations, e.g., the AMF rather than UNICEF. Also, they may want a closer relationship with the organization they're funding to track effectiveness over time. So, we as donors may have more special relationships with effective charities, impacting how we communicate our intentions to them.</p>\n", "parentCommentId": "xxnP88sjZ2pPNyo35", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "uSWtMrbAZWDcJa2r2", "postedAt": "2015-02-03T02:19:13.924Z", "postId": "6LruduxDH92d8vJKs", "htmlBody": "<p>I appreciate these points. In the future, I intend to post to this blog guides for how donors can maintain good relations with charities, and visa-versa. I'll try remembering to include your points in that guide. For the record, the guide(s) will probably not be up for at least a month.</p>\n", "parentCommentId": "B54qQ92i2ZXo5aLcR", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "87m9MNtkQutquweQp", "postedAt": "2015-02-03T02:21:11.287Z", "postId": "6LruduxDH92d8vJKs", "htmlBody": "<p>I'm not adept at quantitative analysis, so I'm not prepared to model this problem. So I'm unsure of <em>how</em> that impact would be measured. However, based on how rather abstract notions seem quantified well by Givewell, 80,000 Hours, and Giving What We Can, I think <em>someone</em> we know could figure it out. It seems important.</p>\n", "parentCommentId": "jcfv9qRyBrNB5pB2o", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "jJqMbrzWjgkgiz5YZ", "postedAt": "2015-02-03T03:27:33.363Z", "postId": "6LruduxDH92d8vJKs", "htmlBody": "<p>Sounds like a good topic for a post; I look forward to it.</p>\n", "parentCommentId": "uSWtMrbAZWDcJa2r2", "user": {"username": "Larks"}}]