[{"_id": "Tqu2yebvvgbMvKbZy", "postedAt": "2023-03-07T12:41:02.877Z", "postId": "6LwxzbiqNcXfXeb7K", "htmlBody": "<p>Great post, thanks for sharing. To provide a bit of context could you sketch out what an increased emphasis on long-term brand marketing might look like for EA orgs?</p><p>For example, what might it look like for:</p><ul><li>A research org looking to get more from small donations in response to the withdrawal of a major donor</li><li>A startup charity embarking on a 5-year expansion plan in which talent acquisition will be a major bottleneck</li><li>A \"shopfront\" EA org that counts inducting new people to EA ideas among its goals.</li></ul>", "parentCommentId": null, "user": {"username": "Stan Pinsent"}}, {"_id": "xZMNwBeJgs22Ftb9o", "postedAt": "2023-03-07T13:12:06.589Z", "postId": "6LwxzbiqNcXfXeb7K", "htmlBody": "<p>This is a great post!<br><br>I assume that you are, but better safe than sorry: Are you discussing this with Chris Lloyd at Good Impressions who's currently \" investigating whether paid ads can be an effective fundraising tool\" &nbsp;for EA organizations?</p>", "parentCommentId": null, "user": {"username": "henrith"}}, {"_id": "BJvRSN5FH4cLmbjn8", "postedAt": "2023-03-07T13:59:33.430Z", "postId": "6LwxzbiqNcXfXeb7K", "htmlBody": "<p>Hey! Thanks.</p><p>We are in close contact with GI and talk regularly :)</p>", "parentCommentId": "xZMNwBeJgs22Ftb9o", "user": {"username": "J_Odene_UF"}}, {"_id": "FpCmPzEwjyKbMFLjC", "postedAt": "2023-03-07T15:37:16.646Z", "postId": "6LwxzbiqNcXfXeb7K", "htmlBody": "<p>Thanks for commenting.</p><p>Sure, I'd be happy to.</p><p>This first example of a research org is needing short-term action, so long-term branding for them would have ideally predated this need and built a bigger audience that knows their brand and would be likely to support. For this current need, they are using short-term activation marketing, but would get much greater success if they'd already committed to building their audience over a longer time. So the current ads for this purpose wouldn't be long-term, but would be support by past long-term marketing.</p><p>The startup charity aiming to acquire talent has 5 years to imbed their brand into the minds of likely future candidates. This long-term marketing could be relevant sponsorships, attending conferences, ads that are focused on making their brand memorable.</p><p>The \"shopfront\" EA org should be generating ads that are purely designed to capture peoples attention, impart the brand and some credibility. These could be 6 sec YouTube ads, social ads, sponsorships...</p><p>Broadly speaking, all long-term marketing has one major focus, and that is to be interesting enough to be remembered. It should therefore hone into emotions, humour, surprise - something that will leave an impression on the audience so that they are effectively warmer to the brand for when they (in the future) might come to want to engage.</p><p>If you consider <a href=\"https://www.youtube.com/watch?v=a_zQiRDXXDc\">this Rightmove ad</a>, it's entire remit is to make you feel something, which you then associate with the brand. And it has no call to action. It's about logging the brand into your mind for whenever you might come to need to look for a place to live.</p>", "parentCommentId": "Tqu2yebvvgbMvKbZy", "user": {"username": "J_Odene_UF"}}]