[{"_id": "vGb4xMpCWtCW2iqSu", "postedAt": "2022-12-20T13:46:12.606Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>From a perspective where embryos are moral patients, I think preventing otherwise healthy\nembryos from failing to implant or otherwise make it to term looks pretty promising, especially since these are generally wanted pregnancies.  A few years ago I took some time with a med student thinking through some options:</p>\n<ul>\n<li>\n<p>Reduce pelvic inflammatory disease. This causes uterine scarring, which leads to implantation failure, and the main causes are STIs like gonorrhea and chlamydia. Cervical cancer is also an issue, and we do have the HPV vaccine for this. These are already bad things we'd like to prevent, but this raises the stakes a lot.</p>\n</li>\n<li>\n<p>Decrease the C-section rate. Abdominal surgery is another thing that gives uterine scarring. The US C-section rate is much higher than the rest of the world, for reasons that seem to be more about how we allocate medical providers and less about people's health, and there are already good options here like providing doulas for <a href=\"http://www.jefftk.com/p/doulas-would-save-insurers-money\">anyone who wants one</a>. C-sections are worse than other abdominal surgeries from this perspective because the embryo can implant into the surgical scar, which gives you an ectopic pregnancy and generally requires an abortion to save the life of the mother. Appendectomies might be another good candidate here, because outside the US people have way fewer of them. Though some of that is that different health systems respond differently to appendicitis: it recurs about 20% of the time, so different places have made different calls about whether removing it the first time it happens is worth it.</p>\n</li>\n<li>\n<p>Come up with better detection methods for fibroids. These are benign tumors in the uterus that grow with estrogen, and compete with the fetus for space. This is more of a problem later in the pregnancy when space is tighter. This one might make sense if you don't think embryos matter but do think second or third trimester fetuses matter. This also disproportionately affects black mothers, so it may be underfunded.</p>\n</li>\n<li>\n<p>Encourage people to switch to methods of birth control that prevent ovulation or fertilization instead of implantation. For example, estrogen over progesterone. This one is the odd one out, in that it's one where you're not just more highly prioritizing something people already think would be good. IUDs, for example, are really good in many ways, but they work by preventing implantation. This is at least less tractable socially than the others, because you'd get a huge fight.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "pjH5sZcGtvWK2kXKp", "postedAt": "2022-12-20T14:00:25.898Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Jeff, thanks for your comment!</p><p>The first three medical interventions you pointed out would have been excellent for me to include in this post's Community Actions section, as the possible moral patienthood of embryos would indeed update their significance. Thanks for bringing them to my attention.</p><p>On the fourth, I agree, with the following caveats:</p><ul><li>In the case that embryos have moral patienthood and we hold non-person-affecting / deprivationist views, there shouldn't be much difference between preventing fertilization and preventing implantation, because the outcome in terms of (adjusted) life years is the same.</li><li>Replaceability seems to become a much more compelling objection at that stage. If a couple is trying for a baby and an embryo fails to implant, they likely won't even notice and will keep trying until they get one.</li></ul>", "parentCommentId": "vGb4xMpCWtCW2iqSu", "user": {"username": "Ariel Simnegar"}}, {"_id": "WvgeMySA9KcM4v4mp", "postedAt": "2022-12-20T14:20:33.949Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>It's for posts like these being able to disagree vote without downvoting the main post would be particularly helpful...</p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "5uPXJeFymJ8CRSMjA", "postedAt": "2022-12-20T14:29:49.395Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you for writing. I had question about this come up a few times when I was community building so it is helpful to see an effective altruism discussion on the topic.</p><p>&nbsp;</p><p>– –&nbsp;</p><p>One area of your post that confuses me, where (intuitively) I disagree with you is on your push back against family planning charities.</p><p>My understanding is that the charities you mention, <a href=\"https://www.familyempowermentmedia.org/about\"><u>Family Empowerment Media</u></a> and <a href=\"https://maternalhealthinitiative.org/what-we-do/\"><u>Maternal Health Initiative</u></a><u>,</u> are trying to empower women with knowledge about and access to contraception. This supports women's autonomy and right to decide on their family, and is good for maternal health and childhood health (due to more spaced out births). Neither charity has that I know of made a stance for or against abortion and they do not work on abortions, but my assumption would be that more deliberate use of contraception would mean less unwanted pregnancies and less abortions. So, if you care about the moral value of embryos then supporting access to contraception could be among the most effective places to donate.&nbsp;</p><p>So, I would have expected you to advocate people donate more to these charities not less.<br><br>(I can see a case for not donating to such charities out of moral uncertainty reasons but I could also see a case for avoiding working at all on abortion reduction for moral uncertainty reasons so not really sure where to take that line of argument).</p><p>&nbsp;</p><p><i>Disclaimer: I work for Charity Entrepreneurship, the organisation that incubated both of the above charities. All views are my own and do not represent Charity Entrepreneurship or anyone else.</i></p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "kfjnNSQjPZB2tcyae", "postedAt": "2022-12-20T14:39:30.311Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Kudos for writing this, seems both valuable to explore but also like it takes some guts.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "77Seq3rLYSruAJPDR", "postedAt": "2022-12-20T14:51:14.662Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote>\n<p>If a couple is trying for a baby and an embryo fails to implant, they likely won't even notice and will keep trying until they get one.</p>\n</blockquote>\n<p>I think this doesn't belong as a caveat on #4, but instead as an objection to the whole idea of trying to reduce implantation failures?  In #4 we're talking about people who are trying to avoid pregnancy, not people trying for one.</p>\n", "parentCommentId": "pjH5sZcGtvWK2kXKp", "user": {"username": "Jeff_Kaufman"}}, {"_id": "zFzysshthfohH5mJZ", "postedAt": "2022-12-20T14:55:50.468Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I tentatively agree with you. Without a distinction between upvotes/downvotes and agree-votes/disagree-votes, high quality posts which provoke important but difficult community conversations may have their visibility systematically reduced. (I endeavored to write this post to fit that description.)</p><p>However, since we already have that distinction for comments, there must have been a specific decision to enable the distinction for comments but not for posts, and there was presumably a good reason.</p>", "parentCommentId": "WvgeMySA9KcM4v4mp", "user": {"username": "Ariel Simnegar"}}, {"_id": "ex6HTASprnrfaNcbc", "postedAt": "2022-12-20T14:57:10.873Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Yep, you're right about that! It's a greater caveat than I pointed out.</p>", "parentCommentId": "77Seq3rLYSruAJPDR", "user": {"username": "Ariel Simnegar"}}, {"_id": "4sXwkvhj5DNznzLdx", "postedAt": "2022-12-20T15:02:16.562Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks! I've been thinking about this issue for a long time, and it was a substantial undertaking to try to tackle it in a way which adds value to the community and enables a productive conversation. Most of the people who helped me write these drafts strongly disagreed with me, and working together with them in pursuit of these goals was an enlightening and fulfilling experience.</p>", "parentCommentId": "kfjnNSQjPZB2tcyae", "user": {"username": "Ariel Simnegar"}}, {"_id": "dEmQ5ibjudaFh9PGv", "postedAt": "2022-12-20T15:08:45.242Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote>\n<p>In the case that embryos have moral patienthood and we hold non-person-affecting / deprivationist views, there shouldn't be much difference between preventing fertilization and preventing implantation, because the outcome in terms of (adjusted) life years is the same.</p>\n</blockquote>\n<p>I think that's not right? Preventing fertilization does not cause any deaths, and my understanding of your argument here is that it is relies on abortion causing moral patients to die?</p>\n<p>Otherwise, interventions that increased how many babies people wanted to have would be roughly interchangeable with interventions that decrease abortions.</p>\n", "parentCommentId": "pjH5sZcGtvWK2kXKp", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Lka4fZBrxGrhL8mhd", "postedAt": "2022-12-20T15:23:37.790Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Your understanding is right, but it's not the only reason why it seems to me that abortion may be wrong. I sketch out the generalization in the \"Increasing the Amount of Near-Term Future People\" section, but it's probably not sufficiently explicit. Many of the arguments for why abortion may be wrong generalize to arguments for why preventing a future person from coming into being is wrong:</p><ul><li>If abortion is wrong because we shouldn't hold person-affecting views (i.e. we should care about possible people, and fetuses are possible people, even if they might not be considered living persons), then any action which prevents a future person from coming into being is similarly wrong, as we're violating the preferences they counterfactually would have had.</li><li>If abortion is wrong because of deprivationism (i.e. it prevents the (adjusted) life years of the child from being lived), then any action which prevents a future person from coming into being and living out their (adjusted) life years is wrong.</li></ul><p>Richard Chappell sketches the implications of these views quite well <a href=\"https://rychappell.substack.com/p/killing-vs-failing-to-create\">here</a>. It seems to me that he generally holds these views, but includes a factor to strongly discount the value of adding a future person versus saving a life now. This enables him to believe abortion is morally OK (since his discount factor applies), but longtermism is still an imperative (since heavily discounting 10^whatever possible future people still means they're extremely important in aggregate).</p><blockquote><p>Otherwise, interventions that increased how many babies people wanted to have would be roughly interchangeable with interventions that decrease abortions.</p></blockquote><p>Under non-person-affecting/deprivationist views, I would argue that that's correct.</p>", "parentCommentId": "dEmQ5ibjudaFh9PGv", "user": {"username": "Ariel Simnegar"}}, {"_id": "PDCgcmFJ3jWKG6YFp", "postedAt": "2022-12-20T15:34:02.118Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote>\n<p>Under non-person-affecting/deprivationist views, I would argue that that's correct.</p>\n</blockquote>\n<p>If you think that's correct, then my (very rough) guess is that promoting having children gives more future lives for the amount of time/resources than voluntary abortion reduction.  For example, there are lots of \"don't have kids for climate change reasons\" arguments going around that are pretty misguided, and not much effort on countering them.  There are also policies that would likely lead to more kids, like making childcare cheaper.</p>\n<p>But then if what you care about is maximizing the number of future people, trying to increase near term births is probably not what gives the most impact: reducing existential risk is.  (Happy to argue more for this if you like.)</p>\n", "parentCommentId": "Lka4fZBrxGrhL8mhd", "user": {"username": "Jeff_Kaufman"}}, {"_id": "PSfNAS3aGAxXp686d", "postedAt": "2022-12-20T15:45:25.865Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I hope the reason is \"they haven't got around to it yet\". I think the upvote-agreement split has been an incredible success for comments, and it would be a shame if it wasn't extended to posts as well.&nbsp;</p><p>Right now, you have to pick between rewarding effort and rewarding what is correct, and I think it clearly disadvantages more controversial posts.&nbsp;</p>", "parentCommentId": "zFzysshthfohH5mJZ", "user": {"username": "titotal"}}, {"_id": "urWBnmoxEmxeFzZ7X", "postedAt": "2022-12-20T15:52:11.172Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>My understanding was as well that improved contraceptive access in poor countries is one of the best things we can do to lower abortions.</p>\n", "parentCommentId": "5uPXJeFymJ8CRSMjA", "user": {"username": "Denise_Melchin"}}, {"_id": "toEpMuuAsj4uJHviq", "postedAt": "2022-12-20T15:59:40.273Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi, thanks for your comment! You make a fair point that my essay isn't precise enough about the potential moral caveats of these charities, and I'll try to elaborate on that here.</p><p>It looks like one common source of confusion is what the precise reasons are for why abortion may be wrong. If abortion were wrong <i>only</i> because embryos could have personhood, then you'd be absolutely correct that we should donate <i>more</i> to family planning charities which reduce the number of abortions rather than less.</p><p>However, it seems to me that a stronger reason why abortion may be wrong is for the same reason longtermists oppose x-risk: It reduces the expected amount of future people. I briefly sketch the argument in the <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction#Increasing_the_Amount_of_Near_Term_Future_People\">\"Increasing the Amount of Near-Term Future People\"</a> section, but I could have done a better job of it, and elaborate some more in <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=Lka4fZBrxGrhL8mhd#comments\">this comment</a>. The magnitude of the difference between adding a future person and saving a living person is <a href=\"https://rychappell.substack.com/p/killing-vs-failing-to-create\">debated</a>, but it seems that many prominent EAs consider it to be close to as good as saving a living person today. <i>What we Owe the Future</i>'s \"Is it Good to Make Happy People?\" (Chapter 8) does a great job of making that case, though <a href=\"https://forum.effectivealtruism.org/posts/vZ4kB8gpvkfHLfz8d/critique-of-macaskill-s-is-it-good-to-make-happy-people\">some disagree</a>.</p><p>For an example of where this consideration could be relevant, consider <a href=\"https://forum.effectivealtruism.org/posts/zgBmSgyWECJcbhmpc/family-planning-a-significant-opportunity-for-impact\">this statement</a> from Family Empowerment Media (FEM)'s founders:</p><blockquote><p>A commitment of $7 million would fund FEM’s scaling plans over the next four years, preventing ∼3100 maternal deaths and ∼340,000 unintended pregnancies.</p></blockquote><p>Let's assume 10% of those unintended pregnancies would have been carried to term and not counterfactually replaced (to avoid child replaceability <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction#Child_Replaceability_Shouldn_t_Preclude_Intervention\">concerns</a>). In that case, this intervention would prevent 34,000 lives from being lived, far more than the 3100 maternal lives saved. If we're sympathetic to the above arguments (as many longtermists are), then this well-meaning intervention could arguably be doing much more harm than good.</p><p>It's critical to note that supporting women's autonomy, maternal health, and economic outcomes is a deeply important cause, and CE's family planning charities absolutely contribute to those good outcomes. However, it seems to me that the</p><blockquote><p>case for not donating to such charities out of moral uncertainty reasons</p></blockquote><p>you pointed to could be quite strong, and that there are many other interventions which support <a href=\"https://fistulafoundation.org/\">women's empowerment</a> and <a href=\"https://www.thelifeyoucansave.org/best-charities/global-alliance-for-improved-nutrition/\">maternal health</a> without this possible serious negative externality.</p><p>I'd also like to note that I'm <i>not</i> saying EAs should never donate to FEM or its related charities. <strong>I only believe that the moral considerations are serious enough that we should temporarily suspend our support for these charities until we've systematically reviewed the effect of these considerations</strong>.</p><p>It could be that a systematic review uses randomized controlled trials to verify that FEM's interventions don't reduce the expected amount of future people at all and only space out births. The review could also show that replaceability should be accorded much higher credence than <a href=\"https://benthams.substack.com/p/utilitarianism-wins-outright-part-67f\">many actually accord it</a>, and argue that even with these moral considerations, the absolute effect of FEM's interventions is good. In that case, the suspension of support for FEM should be reversed.</p>", "parentCommentId": "5uPXJeFymJ8CRSMjA", "user": {"username": "Ariel Simnegar"}}, {"_id": "QGmSQKNCcYR6Q6Qex", "postedAt": "2022-12-20T16:11:03.379Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you, I agree with a lot of the underlying motive (once upon a time I wrote a research proposal about this, but never got into it). Where I disagree:</p>\n<p>This is already mentioned in the comments, but my understanding was that improved contraceptive access is one of the best ways to lower abortions so moral concerns about abortions drive me towards supporting family planning charities.</p>\n<p>Women will often not want to have children - so we should ensure they don't conceive in the first place instead of terminating their pregnancies.</p>\n<p>What I would add:\nSomething I find lacking in your description is how much more fetuses matter morally over time in my view at least. Merely terminating an unwanted pregnancy faster already has a lot of value. Many people seem to be oblivious to the drastic changes an embryo undergoes in the first trimester. Terminating at 4 weeks would mean aborting a being which is less than 1mm big and does not appear particularly  human. At 12 weeks you have 5cm big little one (not counting the legs!) which very much looks like human baby.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "4sKBSmPkXKpnHJXzo", "postedAt": "2022-12-20T16:16:56.135Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>If you think the moral concerns about abortion is more about the prevention of future people instead of the value of the lives of the embryos, you should probably try to optimise for women having more children in the near term. It is not clear to me why you think preventing abortions is the best way to do so.</p>\n", "parentCommentId": "toEpMuuAsj4uJHviq", "user": {"username": "Denise_Melchin"}}, {"_id": "6AThpgvJcypkuR69b", "postedAt": "2022-12-20T16:20:43.513Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks very much for writing this insightful and sensitive post on such an important topic.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "ernADdAQRCSAbe36g", "postedAt": "2022-12-20T16:22:54.760Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I think it's important to also take into account the moral risks of refusing funding for family planning <i>specifically because you want others to have more unintended pregnancies</i>. &nbsp;On broadly Kantian-inspired views, for example, this would plausibly qualify as objectionably treating people as mere means.</p><p>FWIW, I favour interventions that give people more control over their lives, including reproductive autonomy, along with making it easier for people to have more kids <i>when they're ready and they positively want this</i>.</p>", "parentCommentId": "toEpMuuAsj4uJHviq", "user": {"username": "RYC"}}, {"_id": "rvnzS2Gwtm8rJ8ccW", "postedAt": "2022-12-20T16:25:34.097Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I don't think we actually disagree :)</p><p>I think voluntary abortion reduction is just one of many ways to increase the amount of near-term future people. The post's <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction#In_Our_Personal_Lives\">\"In Our Personal Lives\"</a> section includes the suggestions you gave and more, which I agree are arguably more effective than voluntary abortion reduction in accomplishing that goal. I also agree with you that reducing x-risk is (probably) much more important than directly increasing the amount of near-term future people, and I think far more EA resources should be devoted to the former than the latter.</p><p>So why did I care enough about voluntary abortion reduction to write this post?</p><ol><li>I do believe that adding one future person is close to as good as saving a life, so it still seems to me that when measured against other concerns which occupy the minds of the general public, voluntary abortion reduction is very important indeed, especially given abortion's <a href=\"https://www.guttmacher.org/fact-sheet/induced-abortion-worldwide\">staggering scale</a>.</li><li>I think bringing up ideas which provoke conversations and challenge preconceptions within the community is <a href=\"https://forum.effectivealtruism.org/topics/red-teaming\">good for its own sake</a>.&nbsp;</li><li>This concern is more debatable, but I'm personally deeply receptive to the idea that our values should cause us to make mini-interventions in our personal lives. Being a vegan is a drop in the bucket of animal suffering, but making a real change in a personal life in response to my moral principles is very important to me. With apologies to those who disagree, I think about voluntarily choosing to not have abortions in the exact same way.</li></ol>", "parentCommentId": "PDCgcmFJ3jWKG6YFp", "user": {"username": "Ariel Simnegar"}}, {"_id": "mNw9joDYkGNo8Q3rd", "postedAt": "2022-12-20T16:28:30.616Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank YOU, Larks! That's very kind of you to say.</p>", "parentCommentId": "6AThpgvJcypkuR69b", "user": {"username": "Ariel Simnegar"}}, {"_id": "qW4JScfrSjPBzveJw", "postedAt": "2022-12-20T16:29:24.742Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>My only disagreements with this post is that</p>\n<blockquote>\n<p>Suspend our support for charities which reduce the amount of near-term future people until we can systematically review the effect of the above moral considerations on the morality of the charities' interventions.</p>\n</blockquote>\n<p>Would involve involuntary abortion reduction.</p>\n<p>I also agree with Denise that if you cared about reducing voluntary abortion or just unwanted pregnancies generally, long acting contraceptives seem the most effective way to do that. But it seems that you're not sure if unwanted pregnancies are a bad thing.</p>\n<p>Finally I know there's a greater demand for baby adoption than supply in high income countries but I would guess that this isn't true in low income countries.</p>\n<p>I would like to see much more discussion on how the burden of having kids could be spread better over more people (not just mothers but fathers, grandparents, professional caregivers) and also society generally. As it stands, an unwanted pregnancy, and especially a decision to keep the baby, places outsized burden on the mother, and I think that's part of why this is such a difficult issue. As examples,</p>\n<ul>\n<li>Matt Yglesias' book one billion Americans has lots of ideas on how everything from housing supply to public transportation could be made better to support more people.</li>\n<li>I also really like this piece from 99% invisible about how Japan's city infrastructure is made safe enough that toddlers can run errands by themselves. <a href=\"https://99percentinvisible.org/episode/first-errand/\">https://99percentinvisible.org/episode/first-errand/</a></li>\n<li>this piece explaining why universal child payments is better than universal childcare is also pretty good. <a href=\"https://criticalscience.medium.com/on-the-science-of-daycare-4d1ab4c2efb4\">https://criticalscience.medium.com/on-the-science-of-daycare-4d1ab4c2efb4</a></li>\n</ul>\n", "parentCommentId": null, "user": {"username": "ruthgrace"}}, {"_id": "KXXHcmz9YR2Tqp7PK", "postedAt": "2022-12-20T16:35:04.897Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>It seems likely to me that some of the family planning charities you discuss are having a net effect of reducing abortions, through promotion of contraception. It also seems like promoting contraception would be a good intervention for reducing abortions.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "LvsFm8BjYnoFyEypZ", "postedAt": "2022-12-20T16:35:24.150Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Denise! I agree that optimizing for increasing the amount of children that families want and are able to happily have is probably better than voluntary abortion reduction as a means of increasing the amount of near-term future people. I apologize if I wrote anything which could give the implication that I \"think preventing abortions is the <i>best </i>way to do so\" (emphasis mine), as that is not my opinion.</p><p>As for why I decided to write a whole post on abortion reduction, <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=rvnzS2Gwtm8rJ8ccW\">here </a>are some of my reasons.</p>", "parentCommentId": "4sKBSmPkXKpnHJXzo", "user": {"username": "Ariel Simnegar"}}, {"_id": "nJvGupnzKYwWX4wsb", "postedAt": "2022-12-20T16:41:44.270Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi! You're right that promoting contraception does reduce abortions on net. However, that's not the only moral consideration at play, and I explain the others in much more detail <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=toEpMuuAsj4uJHviq#comments\">here</a>.</p>", "parentCommentId": "KXXHcmz9YR2Tqp7PK", "user": {"username": "Ariel Simnegar"}}, {"_id": "FCPvXT82gtH6hxckT", "postedAt": "2022-12-20T16:46:04.342Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I also want to note that there are wide-reaching societal effects of abortion access; this paper makes the case that the legalization of Roe V Wade in the 70s accounted for a 10% decrease in crime in the 90s (a quarter of the total crime decrease that happened in the 90s) <a href=\"https://pricetheory.uchicago.edu/levitt/Papers/LevittUnderstandingWhyCrime2004.pdf\">https://pricetheory.uchicago.edu/levitt/Papers/LevittUnderstandingWhyCrime2004.pdf</a></p>\n", "parentCommentId": "qW4JScfrSjPBzveJw", "user": {"username": "ruthgrace"}}, {"_id": "AvrL7bHGNXRDr6fSY", "postedAt": "2022-12-20T16:53:35.532Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Denise, thank you for your thoughtful comment!</p><p>On family planning, I explain the moral considerations behind the proposal to temporarily suspend support for family planning charities in more detail <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=toEpMuuAsj4uJHviq#comments\">here</a>.</p><blockquote><p>Women will often not want to have children - so we should ensure they don't conceive in the first place instead of terminating their pregnancies.</p></blockquote><p>I agree with you completely that preventing a person from being born through contraception is much better than through abortion, because the former is much better for the woman's physical, mental, and economic health. However, the loss of a future person is common in both cases, and I elaborate on why I think that's a moral concern <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=Lka4fZBrxGrhL8mhd\">here</a>.</p><blockquote><p>Something I find lacking in your description is how much more fetuses matter morally over time in my view at least.</p></blockquote><p>Your observation is very fair. Your description of the disvalue of fetal death best matches the time-relative interest account (TRIA), which you can read more about&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/JgqEqsa6iAtqGLYmw/the-elephant-in-the-bednet-the-importance-of-philosophy-when-1\"><u>here</u></a>. I do bring this measure up in a footnote, but you're right that it could have warranted a more thorough treatment in the post. TRIA best matches our intuition that the fetus's moral significance increases through the pregnancy, and through moral uncertainty, I would justify the same intuition. However, I personally find the deprivationist approach of purely measuring the disvalue of death through the amount of (adjusted) life years prevented to be more intuitive.</p>", "parentCommentId": "QGmSQKNCcYR6Q6Qex", "user": {"username": "Ariel Simnegar"}}, {"_id": "Gy5Et5sJNCRMAByqT", "postedAt": "2022-12-20T17:39:49.249Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>The cognitive and experiential capacities of an organism are important for us in determining how they treat them. So any consideration about fetuses as moral patients needs to consider their capacities. 38-week old fetuses have a very different set of cognitive and experiential capacities compared to 24-week old fetuses, and even more so to 14-week old fetuses. Because <a href=\"https://www.cdc.gov/reproductivehealth/data_stats/abortion.htm\">90% of abortions in the US occur prior to 14 weeks</a>, and 99% before 22 weeks, the relevant questions about capacity are probably about experience in that time. At least prior to 12 weeks it seems unlikely fetuses could consciously experience pain, and unlikely they experience anything at all <i>(EDIT: I've updated against this somewhat--see Callum's comment below)</i>. As a result, and considering negative consequences for women's autonomy in cutting abortion funding, I caution against recommendations that involve cutting any funding for abortion prior to that time.</p><p>I worry that some folks will get a little bit queasy about me launching into comparisons with animal suffering, but I think that is unavoidable, and ultimately justifiable. But when we try to determine how we should <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw/p/tnSg6o7crcHFLc395\">treat pigs, chickens, and shrimp</a>, we look to their capacity to suffer, and their overall capacity to experience things. This is important because if we want to know whether it is net positive to farm animals, we need to know if farming them is net positive, i.e., if the positive experiences they have and we have as a result of farming them outweigh the suffering they experience, compared to the counterfactual of having not existed. If a particular animal doesn't have any capacity for suffering or any kind of conscious experience, arguably they are, as an individual creature, no more a moral patient than a rock or stone. That raises the question: do fetuses have the capacity to consciously suffer or experience, and if so what sort of experience do they have?</p><p>Conscious experience is not the only consideration one would have when considering a fetus as a moral patient. There are other reasons that have been explored in more general abortion debates over the last few decades about various social factors that lead us to assign fetuses more or less personhood, which I acknowledge. But in this comment I'll focus on the issue of conscious experience.</p><p>The conventional medical advice has been that \"<a href=\"https://the cortex and intact thalamocortical tracts are necessary for pain experience\">the cortex and intact thalamocortical tracts are necessary for pain experience</a>\", and because these don't develop until after 24 weeks of pregnancy, we can rule out any kind of fetal pain until that point. This is a based on a theory of human conscious pain that posits that something about the neocortex is what gives humans many or even all of our conscious experiences. Whether this is true is not clearly known but it would seem to follow from <a href=\"https://library.oapen.org/bitstream/handle/20.500.12657/47279/9783030541736.pdf?sequence=1#page=48\">leading theories of human consciousness</a>. The evidence that experience of pain in particular arises from the neocortex--let's call it the \"thalamo-cortical pain theory\" is somewhat stronger. The neocortex contains the somatosensory cortices; it also contains the amygdala and the anterior cingulate cortex, which at least until recently have been <a href=\"https://www.sciencedirect.com/science/article/pii/S109038010400148X\">inseparable</a> from the conscious experience of pain in normal humans. Because those features don't develop until some time after 24 weeks, it seems plausible fetuses don't have conscious experience of pain until after that time.</p><p>On the other hand, there's <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw/p/tnSg6o7crcHFLc395\">mounting evidence</a> that animals without these advanced cognitive structures also have some experience of pain. I am sceptical this implies <i>humans</i> have experiences of conscious pain before they develop a neocortex, because those animals could have evolved other features giving them the experience of pain that humans do not have.&nbsp;</p><p>What's more important is the thalamo-cortical pain theory I described in the previous paragraph is under question, specifically with respect to fetuses, raising the possibility that <a href=\"https://jme.bmj.com/content/46/1/3?fbclid=IwAR0gdShqtwr8dnRMfm1XqKLsoUn7BI05Pi8hYeyyhEFfTlZWMji4RtJL-Wg\">fetuses before 24 weeks</a> could feel some sort of conscious pain, though it would almost certainly not reach the full expression and intensity that fully-formed humans can experience. This is based on evidence in adult human patients, including patients with disabled cortices and patients who were born insensitive to pain. On this theory of fetal pain would place development at <a href=\"https://jme.bmj.com/content/46/1/3?fbclid=IwAR0gdShqtwr8dnRMfm1XqKLsoUn7BI05Pi8hYeyyhEFfTlZWMji4RtJL-Wg\">closer to 12 weeks</a>. This is based on the fact the \"<a href=\"https://jme.bmj.com/content/46/1/3?fbclid=IwAR0gdShqtwr8dnRMfm1XqKLsoUn7BI05Pi8hYeyyhEFfTlZWMji4RtJL-Wg\">first projections from the thalamus into the cortical subplate</a>\" occur around that time. [<i>This paragraph edited slightly to update in favor of the 12-week theory]</i></p><p>Overall I am somewhat convinced by the recent work that pain processing doesn't require the neocortex<s>, but less sure that </s><i><s>conscious experience of pain</s></i><s> can be had without it</s>. However, at least in the United States, <a href=\"https://www.cdc.gov/reproductivehealth/data_stats/abortion.htm\">over 90% of abortions occured before 13 weeks</a>. Less than 1% occur after 21 weeks. Prior to 13 weeks, there doesn't seem to be a viable theory of conscious experience of fetal pain. I should acknowledge that in this context, we're not only concerned about pain--we're concerned about personhood more broadly. But one can infer, from the debate about pain, it seems unlikely that there are conscious experiences <i>in general</i> at the very least prior to 12 weeks. Consequently, any concern about the moral patienthood of fetuses at the time when most are aborted (spontaneously or otherwise) should be &nbsp;order of magnitude or two less than concern we might have about a fetus at that 38-week period which Peter Singer points out seems to be minimally distinguishable from an infant child.</p><p>Finally--I can't help but spell out some of my own motivation for this comment. Although it is very clear that it advocates only for voluntary abortion reduction, the original post does recommend defunding of abortion services for which funding may have previously been provided. I have less of a unique contribution to make in this area, than in the neuroscience, so I won't say too much about it. But it does seem to me that even defunding services could have tangible negative consequences for pregnant women's autonomy and control over their pregnancy. That probably motivates my caution against such a recommendation, and it needs to be considered alongside the discussion about fetal personhood, and within that discussion, fetal consciousness, which is the primary topic of this post.</p>", "parentCommentId": null, "user": {"username": "ben.smith"}}, {"_id": "QrBjc32Da3v6BA3KG", "postedAt": "2022-12-20T17:47:22.169Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you for writing this. It was the effective altruism which (unintentionally, I guess) got me into abortion research (as my main area of research) and anti-abortion advocacy in the first place, for these kinds of reasons. I'll probably upload my own thoughts on an EA case for anti-abortion advocacy in the relatively near future.</p><p>One major research gap which is particularly relevant to your emphasis on voluntary abortion reduction is: we have very little idea of what it would take, in practice, for women seeking abortion to change their minds. We know that most women seeking abortion do want another child in the future, and we know the broad reasons women cite for having abortions. But we have almost no research about what it would concretely take for them to choose otherwise (as an illustration of the point, we know that a large minority - in some countries a majority - of women cite financial concerns. But a) most of those women cite multiple reasons, so helping financially may not help that much; and b) there is some evidence that many such women do not want to know what financial support might be available). So that seems like a fruitful area for future primary research by EAs. Part of the problem is that the relevant population can usually only be accessed by abortion providers, who are less inclined to do this research.</p><p>I myself would go further and support involuntary abortion reduction (for reasons briefly explained here: <a href=\"https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572\">https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572</a><a href=\"https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572).\"> ).</a> But of course voluntary abortion reduction is even better to the extent that it can be achieved. I know that it is not always pleasant to talk about this topic in public, so thanks for your courage.</p>", "parentCommentId": null, "user": {"username": "Calum Miller"}}, {"_id": "Fek5GYJTPxgLFukut", "postedAt": "2022-12-20T17:54:46.843Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>There's no doubt that the considerations you pointed out are deeply relevant. When considering this issue, women's autonomy and physical, mental, and economic health are of paramount importance. One way to support these values is through FEM and its related charities. Another way is through charities like the <a href=\"https://fistulafoundation.org/\">Fistula Foundation</a> and <a href=\"https://www.thelifeyoucansave.org/best-charities/global-alliance-for-improved-nutrition/\">GAIN's Salt Iodization program</a>. It seems that the second way also achieves the aims we want—women's health and autonomy—while avoiding the possible serious negative externality.</p><p>As an analogy, many Ethiopians suffer from malnutrition. Let's say well-meaning EAs sponsored an \"EA steakhouse\" in Ethiopia, as steak can provide crucial nutrients to people in extreme poverty. There seem to be other interventions, including GAIN's Salt Iodization program, which also target malnutrition, without the possible serious negative externality of animal suffering. In that case, I think we should temporarily suspend our support for the steakhouse while we evaluate the relevant moral considerations. In the meanwhile, Ethiopians can still eat steak at non-EA steakhouses if they'd like (as other well-meaning altruists have sponsored steakhouses of their own), or acquire steak through other means—we wouldn't be reducing their ability to voluntarily eat steak if they so choose. Our goal—combating malnutrition—remains the same, but we choose the intervention to accomplish that goal without the possible negative externality.</p>", "parentCommentId": "ernADdAQRCSAbe36g", "user": {"username": "Ariel Simnegar"}}, {"_id": "LggsjbH2tqvSPK9yC", "postedAt": "2022-12-20T17:57:17.355Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Part of the problem, I think, will be that this is such a highly politicised area that vague terms are often used so that it is not clear whether a charity is promoting abortion or not. I have seen a lot of this in developing countries in particular - family planning is promoted and contraception is the only element of this publicised - but abortion is promoted behind the scenes as well (because it is less glamorous and often illegal). All sorts of charities support abortion (in a variety of different ways) without many people realising - MSF, Oxfam, Water Aid, plausibly even groups like Christian Aid when you dig deep enough.</p><p>Of course none of this is specific evidence that FEM and MHI do so - but in general there is a pretty high prior probability that any given family planning organisation supports abortion in some way, and probably the presumption for anyone who opposes abortion is that family planning organisations have the burden of proving otherwise, given the prior probabilities. This may be unfair on those family planning organisations which genuinely don't in any way support abortion - but unfortunately given the way the world is sometimes people have unfair burdens of proof.</p>", "parentCommentId": "5uPXJeFymJ8CRSMjA", "user": {"username": "Calum Miller"}}, {"_id": "hqg5cqaaBkHCa58fK", "postedAt": "2022-12-20T17:59:12.250Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>From the perspective of total utilitarianism and longtermism, two things will plausibly dominate the direct value of additional near-term people:</p><ul><li>The impact of additional near-term people on animal suffering. This seems very likely to be net negative.</li><li>The impact of additional near-term people on the risk of extinction/longtermist issues. I'm very uncertain about this. &nbsp;A larger population could result in faster economic growth - which would likely be net positive. But intuitively a population that is growing too quickly - particularly in countries where women would prefer to have fewer children - could also face social issues that contribute to social and political instability (think mass unemployment/poverty of young people, mass migration into other countries), which could have consequences that increase the risk of longterm harm.</li></ul>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "GoTAdivEoWeurn5Fv", "postedAt": "2022-12-20T17:59:24.827Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I think the evidence for this is surprisingly slim. Generally in developing countries contraception promotion has both positive and negative effects on abortions - it reduces the chance of a pregnancy in any given case of sexual intercourse, but a) increases sexual intercourse, disproportionately in 'risky' situations; and b) potentially increases the unwantedness of any given pregnancy as well. Moreover, the unmet need for contraception in developing countries is also pretty low, and the proportion of this which is due to lack of access is very small - so the number of women not using contraception because they lack access to it is pretty miniscule.</p>", "parentCommentId": "urWBnmoxEmxeFzZ7X", "user": {"username": "Calum Miller"}}, {"_id": "feonwwLutkMHym9qC", "postedAt": "2022-12-20T18:15:32.247Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Agree entirely on the last part and I think these suggestions are very helpful. If you know of any other more in-depth discussions on these issues I'd be very grateful to see them.</p>", "parentCommentId": "qW4JScfrSjPBzveJw", "user": {"username": "Calum Miller"}}, {"_id": "gHcEyZfysMwykodtZ", "postedAt": "2022-12-20T18:20:26.354Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I disagree more on this, though. Of course there are wide-reaching societal effects, but I think the link re: crime was pretty decisively debunked by various economists - I found Lott and Whitley's response particularly compelling: <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/j.1465-7295.2006.00040.x.\">https://onlinelibrary.wiley.com/doi/10.1111/j.1465-7295.2006.00040.x.</a> I would argue that most of the other negative effects of limiting abortion access have also been highly exaggerated (I have a paper in the International Family Law Journal on this topic and happy to send to anyone interested by email).</p><p>Then in addition there are considerable negative societal effects - e.g. increased STD transmission rates, increased family breakdown (and hence poverty), etc. Even aside from any consideration of the moral value of the embryo or fetus, I think there's a decent consequentialist case against abortion access.</p>", "parentCommentId": "FCPvXT82gtH6hxckT", "user": {"username": "Calum Miller"}}, {"_id": "tuuZpznCcatLtSou4", "postedAt": "2022-12-20T18:25:28.858Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I think most people who oppose abortion (and I guess probably many who don't) would say that the morphology or size of the embryo isn't going to have a big impact (if any) on its moral status.</p><p>I do (respectfully, I hope) disagree regarding contraception as well - I tried to give some reasons for that here: <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=GoTAdivEoWeurn5Fv\">https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=GoTAdivEoWeurn5Fv</a> (forgive me for being basic and not knowing how to link to comments properly)</p>", "parentCommentId": "QGmSQKNCcYR6Q6Qex", "user": {"username": "Calum Miller"}}, {"_id": "Pp6dv6akvgsC275Lg", "postedAt": "2022-12-20T18:26:09.685Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I'm pretty sure that in the way that increasing sentence lengths isn't effective for deterring crime, reducing access to abortion isn't effective for reducing STD transmission. And I'm pretty sure less family planning is related to more poverty, not less.</p>\n", "parentCommentId": "gHcEyZfysMwykodtZ", "user": {"username": "ruthgrace"}}, {"_id": "k6EMGcyRJZtxonE2e", "postedAt": "2022-12-20T18:27:12.965Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Ruth, great to hear from you!</p><blockquote><p>Would involve involuntary abortion reduction.</p></blockquote><p><a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=Fek5GYJTPxgLFukut\">Here's</a> an explanation of why I wouldn't characterize it that way.</p><blockquote><p>But it seems that you're not sure if unwanted pregnancies are a bad thing.</p></blockquote><p>I think it's a more nuanced discussion than most give it credit for! On the one hand, pregnancy exerts a substantial cost on a woman, especially when it's unwanted. On the other hand, the child stands to live or lose an entire life's worth of hopes, joys, pains, and regrets. In an unwanted pregnancy, someone's going to have a sad outcome either way—even when giving the child up for adoption, the mother mourns the child she'll never be able to raise. The <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction#Personal_Autonomy_Shouldn_t_Preclude_Intervention\">\"Personal Autonomy Shouldn't Preclude Intervention\"</a> section summarizes my thoughts.</p><blockquote><p>I would like to see much more discussion on how the burden of having kids could be spread better over more people (not just mothers but fathers, grandparents, professional caregivers) and also society generally.</p></blockquote><p>On your point, I couldn't agree more, and that's why I include both of your links in the <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction#In_Our_Personal_Lives\">\"In Our Personal Lives\"</a> section. On having more discussion of spreading the cost of children over more people than just the mother, my weakness of not yet being a parent comes through—I've always felt unqualified to talk about it! I'd love to listen to and understand more about your lived experience as a mother.</p>", "parentCommentId": "qW4JScfrSjPBzveJw", "user": {"username": "Ariel Simnegar"}}, {"_id": "Pfb6k7EfBKPkpfoP3", "postedAt": "2022-12-20T18:27:37.656Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote>\n<p>Being a vegan is a drop in the bucket of animal suffering, but making a real change in a personal life in response to my moral principles is very important to me. With apologies to those who disagree, I think about voluntarily choosing to not have abortions in the exact same way.</p>\n</blockquote>\n<p>Changing our personal lives in response to a view that it's very good for more people to exist (and with approximate indifference between ending the lives of fetuses and something that prevents those lives from ever starting) doesn't seem like it primarily would give avoiding abortion (typically using birth control, non-impregnatable sex, or abstinence) to avoiding starting pregnancies).  Instead, it would primarily push towards having kids earlier in life and having a large number of them, no?</p>\n", "parentCommentId": "rvnzS2Gwtm8rJ8ccW", "user": {"username": "Jeff_Kaufman"}}, {"_id": "mbnnEdX3HWSgEKxcs", "postedAt": "2022-12-20T18:29:25.627Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Do you have a source for the claim that providing contraception disproportionately increases risky sex + the unwantedness of a pregnancy?</p><p>&nbsp;</p><blockquote><p>the unmet need for contraception in developing countries is also pretty low - so the number of women not using contraception because they lack access to it is pretty miniscule.</p></blockquote><p>Also, can you quantify this? Not sure what your source is, but a brief google search <a href=\"https://www.healthdata.org/news-release/lancet-160-million-women-worldwide-have-unmet-contraception-needs-new-study-reveals#:~:text=whereas%20sub%2DSaharan%20Africa%20had%20the%20lowest%20use%20of%20modern%20contraceptives%20(24%25)%20and%20demand%20satisfied%20(52%25).\">suggests </a>that \"sub-Saharan Africa had the lowest use of modern contraceptives (24%) and demand satisfied (52%).\"</p><p>The same source <a href=\"https://www.healthdata.org/news-release/lancet-160-million-women-worldwide-have-unmet-contraception-needs-new-study-reveals#:~:text=%E2%80%9CThe%20study%20noted%20a%20total%20of%201.176%20billion%20women%20with%20a%20need%20for%20contraception%3B%20of%20these%2C%20162.9%20million%20had%20the%20unmet%20need%2C%20and%20of%20those%20with%20an%20unmet%20need%2C%2056.5%25%20reside%20in%20sub%2DSaharan%20Africa%20and%20South%20Asia%2C%20and%2026.5%25%20were%20aged%2015%2D24%20years%20in%202019.\">suggests</a> that ~10% of women globally with a need for contraception do not have it met (for a total of ~160million women with unmet need), and ~half of these women live in sub-Saharan Africa and South Asia. &nbsp;I haven't checked the methodology personally, but probably &nbsp;not the number I'd consider \"pretty miniscule\".</p>", "parentCommentId": "GoTAdivEoWeurn5Fv", "user": {"username": "bruce"}}, {"_id": "tGntLu3XciQSqqWgZ", "postedAt": "2022-12-20T18:30:19.011Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Though Calum brings some evidence in the other direction, I'd like to make it clear that I'm willing to bite the bullet on this one. I think the scale of abortion completely dominates concerns about crime rates.</p>", "parentCommentId": "FCPvXT82gtH6hxckT", "user": {"username": "Ariel Simnegar"}}, {"_id": "qNAZwGrXBiKJ4LGLE", "postedAt": "2022-12-20T18:31:53.906Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I'm not sure I see the connection. The economic evidence that I've seen suggests that, pretty consistently in a wide variety of settings, increased abortion access has been responsible for pretty large increases in STI transmission (https://academic.oup.com/aler/article-abstract/14/2/457/162853). I'm not aware of any counterevidence, though there may be some.</p><p>&nbsp;</p><p>I'm also not persuaded re: family planning. Yes, family planning can help relieve poverty in some cases. But on a wide-reaching societal level, I think the poverty that has resulted (especially among women) from family breakdown has probably more than compensated for any potential financial benefits: https://www.jstor.org/stable/2946680</p>", "parentCommentId": "Pp6dv6akvgsC275Lg", "user": {"username": "Calum Miller"}}, {"_id": "DWi3vbDKKEBzFWkAt", "postedAt": "2022-12-20T18:35:21.135Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I think it should push towards both of those values, and I plan on fulfilling both ;)</p>", "parentCommentId": "Pfb6k7EfBKPkpfoP3", "user": {"username": "Ariel Simnegar"}}, {"_id": "mhQJztrpsQHQszvKm", "postedAt": "2022-12-20T18:48:53.091Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for clarifying!</p>\n<p>I think maybe a goal of maximizing how many kids you have is doing all the work here?  Almost all of the cases I can think of where someone who is trying to have as many kids as possible would have an abortion if not for a no-voluntary-abortion goal (risk to life of mother,  accidental pregnancy early enough in life that it would limit ability to have more other kids later, prenatal test shows serious issues, etc) are cases where I think your reasoning above would lead to having the abortion and then going on to have more other kids.</p>\n", "parentCommentId": "DWi3vbDKKEBzFWkAt", "user": {"username": "Jeff_Kaufman"}}, {"_id": "aNm84m7hht6s9u65n", "postedAt": "2022-12-20T18:50:42.967Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for asking, Bruce. Yes, regarding contraception increasing risky sex, it's been a while since I looked at this literature but here are some of the references from my notes on it:</p><p><a href=\"https://www.tandfonline.com/doi/abs/10.1080/07350015.2011.652052\">https://www.tandfonline.com/doi/abs/10.1080/07350015.2011.652052</a></p><p><a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/ecin.12757\">https://onlinelibrary.wiley.com/doi/full/10.1111/ecin.12757</a></p><p><a href=\"https://www.amazon.co.uk/AIDS-Behavior-Culture-Questions-Anthropology/dp/1598744798\">https://www.amazon.co.uk/AIDS-Behavior-Culture-Questions-Anthropology/dp/1598744798</a></p><p><a href=\"https://pubmed.ncbi.nlm.nih.gov/11939239/\">https://pubmed.ncbi.nlm.nih.gov/11939239/</a></p><p><a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140673606697870/fulltext\">https://www.thelancet.com/journals/lancet/article/PIIS0140673606697870/fulltext</a></p><p>On unwantedness of pregnancy: <a href=\"https://pubmed.ncbi.nlm.nih.gov/31196674/\">https://pubmed.ncbi.nlm.nih.gov/31196674/</a> and <a href=\"https://www.guttmacher.org/sites/default/files/article_files/2900603.pdf\">Relationships Between Contraception and Abortion: A Review of the Evidence (guttmacher.org)</a></p><p>For low unmet need for contraception in developing countries: <a href=\"https://pubmed.ncbi.nlm.nih.gov/23489750/\">https://pubmed.ncbi.nlm.nih.gov/23489750/</a></p><p>And for low proportion of unmet need attributable to lack of access: <a href=\"https://www.guttmacher.org/sites/default/files/pdfs/pubs/Contraceptive-Technologies.pdf\">https://www.guttmacher.org/sites/default/files/pdfs/pubs/Contraceptive-Technologies.pdf</a> and <a href=\"https://pubmed.ncbi.nlm.nih.gov/24931073/\">https://pubmed.ncbi.nlm.nih.gov/24931073/</a></p>", "parentCommentId": "mbnnEdX3HWSgEKxcs", "user": {"username": "Calum Miller"}}, {"_id": "79vgkghyA78GhEXSn", "postedAt": "2022-12-20T18:52:12.303Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Of course, Calum!</p><blockquote><p>It was the effective altruism which (unintentionally, I guess) got me into abortion research (as my main area of research) and anti-abortion advocacy in the first place, for these kinds of reasons. I'll probably upload my own thoughts on an EA case for anti-abortion advocacy in the relatively near future.</p></blockquote><p>That's a fascinating and deeply unusual story. I'd love to read a post from you about it, and I think your case would add significant value to the forum. For my part, I was raised as an Orthodox Jew, and Orthodox Jews are typically quite anti-abortion but allow it early in the pregnancy. As a teenager, I couldn't come up with a coherent deontological schema which could make abortion permissible, so I became completely anti-abortion. EA helped draw me to the scale of the issue, and longtermist principles seemed to make an even stronger case against abortion than the deontological arguments I had previously considered.</p><blockquote><p>we have very little idea of what it would take, in practice, for women seeking abortion to change their minds.&nbsp;</p></blockquote><p>I like this idea and would encourage this research as well. It would also help inform policymakers about what parents need in order to raise thriving children.</p><blockquote><p>I myself would go further and support involuntary abortion reduction (for reasons briefly explained here: <a href=\"https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572\">https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572</a><a href=\"https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572).\"> ).</a> But of course voluntary abortion reduction is even better to the extent that it can be achieved.</p></blockquote><p>Restricting this post's scope to voluntary abortion reduction seemed to me like an effective way to promote a much-needed conversation and find interventions which people across the aisle can pragmatically support in good conscience.</p><blockquote><p>I know that it is not always pleasant to talk about this topic in public, so thanks for your courage.</p></blockquote><p><img src=\"https://live.staticflickr.com/8012/7486666658_0fc3cba542_b.jpg\" alt=\"Unless someone like you cares a whole awful lot, nothing … | Flickr\"></p><p>(<a href=\"https://www.flickr.com/photos/jcapaldi/7486666658\">Source</a>)</p>", "parentCommentId": "QrBjc32Da3v6BA3KG", "user": {"username": "Ariel Simnegar"}}, {"_id": "PmF8AukfdTJgpPLJc", "postedAt": "2022-12-20T19:11:35.244Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Your <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction#:~:text=I%20wholeheartedly%20apologize.-,Disclaimer,-%3A%C2%A0This%20essay\">disclaimer </a>says this post is specifically about voluntary abortion reduction. But claims such as \"the possible serious negative externality\" of women not having kids because they get access to information or contraception or family planning, combined with recommendations that \"support for these charities should be suspended\" make this sound less about voluntary abortion reduction than you might intend, given family planning interventions are usually targeted at women who don't want to become pregnant in the first place.</p><p>It sounds like you go further than recommending people to voluntarily consider not having abortions. For example, you recommend that charities should have their support suspended because of population size / longtermist arguments. <strong>This sounds like you are making the case that actions which limits access to contraception / family planning (because doing so results in this \"possibl[y] serious negative externality\") are justifiable for purposes of increasing population size. </strong>Can you clarify if this is what you mean?</p><p>Given the post is specifically about voluntary abortion reduction, it's not clear to me that interventions focussing on women who have unmet needs (i.e. women who don't want to be pregnant) for contraception are a relevant consideration? Sorry if I've missed something, only briefly skimmed.</p>", "parentCommentId": "Fek5GYJTPxgLFukut", "user": {"username": "bruce"}}, {"_id": "nRwD7qJeiNdkbSJcg", "postedAt": "2022-12-20T19:21:30.150Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>You're making the understandable assumption given your family's history in EA that I too am a saint, and that does run into the conclusion you gave. Most likely, I'll marry someone who'd also like to have many children, and we'll have as many children as we agree to. However, if there's a happy accident, I'd prefer to keep that happy accident. If there were a happy accident who for whatever reason we weren't able to support, we should give up for adoption rather than abort.</p>", "parentCommentId": "mhQJztrpsQHQszvKm", "user": {"username": "Ariel Simnegar"}}, {"_id": "HBQnJkKj3PiL23GA7", "postedAt": "2022-12-20T19:28:39.157Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>(edited to remove the part about miscarriages since I see you put in the appendix a section on \"spontaneous abortion\")</p><p>&nbsp;I'd like to point out that there is <a href=\"https://apps.who.int/iris/bitstream/handle/10665/75174/WHO_RHR_12.02_eng.pdf;jsessionid=972E42F3B47A92BFE3FB3FDCF04A26D9?sequence=1\">strong evidence</a> that women who don't get access to \"safe\" abortion will give themselves \"unsafe\" abortions, leading to a higher potential for <i>their own</i> premature death or health complications, as well as the death of the fetus. Roughly half of induced abortions are considered to be \"unsafe\" due to lack of access to \"safe\" abortions in developing countries. There is a lot of research that supports this, I can provide more if necessary but I think the WHO information sheet does a decent job of summarizing it.&nbsp;<br>&nbsp;</p><p>From the WHO information sheet linked above:&nbsp;<br>&nbsp;</p><blockquote><p><br>Where abortions are highly restricted, abortions are usually unsafe and carry high risk, especially among poor women; causing serious consequences for the women and a major financial and service burden on the families and on national health systems</p></blockquote>", "parentCommentId": null, "user": {"username": "Lauren Maria"}}, {"_id": "9QM4MnLJ378iNzrsx", "postedAt": "2022-12-20T19:35:22.233Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Bruce, I think your concern boils down to a semantic disagreement on the definition of \"voluntary\" in this case. If we are one among many providers of service X, and we decide to stop providing, is that an intervention which <i>involuntarily</i> prevents people's access to that service?</p>", "parentCommentId": "PmF8AukfdTJgpPLJc", "user": {"username": "Ariel Simnegar"}}, {"_id": "YzzADisPyTrsZqvkt", "postedAt": "2022-12-20T19:42:37.597Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I think the relevant semantic disagreement is:<br>My view is that if provider of service X is targeted at women who do not want children, then changes to provision of service X is irrelevant to \"a case for <strong>voluntary </strong>abortion reduction\", because by decreasing provision of service X, you haven't made it so these women are voluntarily wanting more children / less abortions, you've just made it so they have less of a choice, whereas it seems like you disagree.</p><p>It sounds like I'm misunderstanding you though, so perhaps it's more useful if you clarify / define what you mean by \"voluntary abortion reduction\".</p>", "parentCommentId": "9QM4MnLJ378iNzrsx", "user": {"username": "bruce"}}, {"_id": "RPosrbxtWnzrS8K5L", "postedAt": "2022-12-20T19:44:18.925Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>To be clear, this is in response to your conclusion:</p><blockquote><p><br><br><br><strong>we should suspend our support for charities which decrease the amount of near-term future people</strong><br><br>&nbsp;</p></blockquote><p>Which I disagree with, for the reason I listed above.&nbsp;</p>", "parentCommentId": "HBQnJkKj3PiL23GA7", "user": {"username": "Lauren Maria"}}, {"_id": "3paNxTaNxXWt4LS5D", "postedAt": "2022-12-20T19:50:14.136Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks, I clarified in another comment to my own comment, that your suggestion that \"<strong>we should suspend our support for charities which decrease the amount of near-term future people\"</strong> seems to suggest otherwise? Or am I misunderstanding something?&nbsp;</p>", "parentCommentId": "monYnfZh382mbPtoj", "user": {"username": "Lauren Maria"}}, {"_id": "jFvm25eEbhvwjgr8o", "postedAt": "2022-12-20T19:51:01.307Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p><strong>Many of this essay's moral arguments for voluntary abortion reduction can be generalized to arguments for&nbsp;</strong><i><strong>voluntarily&nbsp;</strong></i><strong>increasing the amount future people in the near term</strong>.</p></blockquote><p>Here, I'm going to make a counterargument from a purely practical consequentialist perspective, without addressing your moral argument about the potential moral patienthood of the fetus or the moral urgency of increasing population growth.</p><p>I doubt that voluntary abortion reduction is a particularly tractable and neglected way to increase short-term population growth. <a href=\"https://www.pewresearch.org/fact-tank/2016/06/21/where-major-religious-groups-stand-on-abortion/\">Pew Research</a> has a chart on the stances of major world religions on abortion, and most Christian churches, as well as Hinduism, are against. In other words, there's already a lot of \"abortion reduction\" activity, using stronger measures than nice, voluntary persuasion.</p><p><a href=\"https://www.guttmacher.org/journals/psrh/2005/reasons-us-women-have-abortions-quantitative-and-qualitative-perspectives\">Guttmacher Institute</a> gives reasons why US women have abortions:</p><blockquote><p>The reasons most frequently cited were that having a child would interfere with a woman's education, work or ability to care for dependents (74%); that she could not afford a baby now (73%); and that she did not want to be a single mother or was having relationship problems (48%).</p></blockquote><p>This is also true <a href=\"https://www.sciencedirect.com/science/article/pii/S0010782417301889\">globally</a>:</p><blockquote><p>In most countries, the most frequently cited reasons for having an abortion were socioeconomic concerns or limiting childbearing. With some exceptions, little variation existed in the reasons given by women's sociodemographic characteristics.</p></blockquote><p>So with abortion reduction, the pregnant women you're targeting are:</p><ul><li>Already facing the cost of carrying a pregnancy they don't want to term</li><li>Don't want the baby</li><li>Won't realize any substantial benefit from having the baby</li><li>Are probably in a pretty fraught position in their lives in many cases</li></ul><p>And you are trying to somehow convince them to carry that baby to term voluntarily so that someone else can enjoy the benefit. That sounds intractable. On top of that, we have to point out that this is an enormously politically charged issue. Those who are against abortion already have massive resources aimed at abortion reduction. Among pro-choice people, arguing for the moral urgency of reducing abortions is going to create a lot of political friction. I think that's something we have to take into account from a sheer, practical tractability standpoint.&nbsp;</p><p>With 73 million abortions, only about <a href=\"http://archive.boston.com/news/world/articles/2007/07/08/child_adoptions_worldwide/#:~:text=What%20is%20the%20annual%20number%20of%20child%20adoptions%20worldwide%3F&amp;text=40%2C000-,B.,undertaken%20within%20the%20same%20country.\">250,000 children</a> are adopted annually worldwide, even though <a href=\"https://adoption.org/international-adoption-statistics-know\">globally, 10 million children live in institutions, and 60 million on the streets.</a> There are about 2 million people waiting to adopt in the USA. I'm not sure how many people want to adopt globally, but my guess is that overall, there's only enough potential adoptive parents to provide homes for a small fraction of the children who'd be born if more parents chose adoption rather than abortion. What fraction of voluntary abortion reduction resulting in the child being raised in an institution or on the street would we consider an acceptable outcome?</p><p>I'd be tentatively more comfortable with measures taken to facilitate increasing the number of wanted pregnancies, including legalizing paid surrogacy services and subsidizing childcare and adoption of older children. Bans on paid surrogacy are connected to a broader, and in my opinion, deeply unethical and massively impactful ban on the voluntary sale, or in this case rental, of one's own organs.</p><p>I've focused on this topic more in the context of kidney sales. There, the public is generally quite supportive of a government-paid option for kidney sales, and most healthcare providers support a trial of a compensation mechanism. You'd never know it from media coverage, though, because a small group of sophisticated political and religious operatives have managed to create a false impression of an ethical consensus against kidney sales. I would not be surprised if legalizing paid surrogacy has even higher levels of public support. That is what I'd lean into if this was my issue.</p>", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "mGuFxGg9rdoutBcLv", "postedAt": "2022-12-20T19:57:26.646Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I don't think there is strong evidence that legalisation of abortion reduces overall maternal deaths from abortion mortality or morbidity - in some cases, it can even increase it (as it has done in e.g. Netherlands, Ethiopia, Rwanda, and some others). Morbidity and mortality from unsafe abortion are mostly related to the overall state of a healthcare system rather than the legal status of abortion - e.g. Malta and Poland have pretty much entirely anti-abortion laws but have the lowest maternal mortality ratios in the world and deaths from unsafe abortion are unheard of. By contrast India, Ghana, Zambia, Ethiopia, Bangladesh and a host of other countries have liberal laws but have plenty of unsafe abortion and resultant morbidity/mortality.</p><p>&nbsp;</p><p>We do know that the WHO misrepresent the data on this, too - e.g. here <a href=\"https://www.who.int/news-room/fact-sheets/detail/abortion\">https://www.who.int/news-room/fact-sheets/detail/abortion</a> they claim that 4.7-13.2% of maternal deaths are due to abortion - but their reference clearly states that this includes deaths from miscarriage and ectopic pregnancies. They have been corrected about this but refuse to change it - so I don't consider them the most trustworthy authorities on this question.</p>", "parentCommentId": "HBQnJkKj3PiL23GA7", "user": {"username": "Calum Miller"}}, {"_id": "PgMqLbytsy5dTdfgf", "postedAt": "2022-12-20T20:01:29.828Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Sorry, I should have emphasized that it's not so much about laws, but <i>access</i> to safe abortions, which the charities mentioned in the original post would help with. I appreciate you pointing out issues with the WHO though, I didn't know that.&nbsp;</p>", "parentCommentId": "mGuFxGg9rdoutBcLv", "user": {"username": "Lauren Maria"}}, {"_id": "5z3ap4koGJ8ctYGoN", "postedAt": "2022-12-20T20:09:56.486Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Lauren, thanks for your clarification! Here are a few considerations which might affect the applicability of the point you brought up:</p><ul><li>Calum Miller <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=GoTAdivEoWeurn5Fv\">argues </a>that the impact of contraceptive access on abortion rates is more unclear than typically claimed. I haven't looked enough into his sources to endorse his claim, but you might find it of interest.</li><li>Although it's deeply unfortunate that \"unsafe\" abortions have worse health outcomes for women, the health outcome for future children is the same either way. It seems to me that in absolute scale, the moral difference between \"safe\" and \"unsafe\" abortions is dominated by other factors. &nbsp;As a result, I don't think the difference between \"safe\" and \"unsafe\" abortions is sufficient in and of itself to invalidate the argument (which I lay out in further detail <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=toEpMuuAsj4uJHviq\">here</a>) for suspending support for charities which decrease the amount of near-term future people.</li></ul>", "parentCommentId": "RPosrbxtWnzrS8K5L", "user": {"username": "Ariel Simnegar"}}, {"_id": "NPEgaXgAdzRhgRb6q", "postedAt": "2022-12-20T20:19:06.928Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>increasing sentence lengths isn't effective for deterring crime</p></blockquote><p>The main argument is that increasing sentence length reduces crime through incapacitation, not deterrence. Even if no-one is ever deterred, if criminals are imprisoned after their first assault you have prevented the subsequent crimes. (see for example discussion <a href=\"https://forum.effectivealtruism.org/posts/cPDptuFTiCLr8XXkL/cause-exploration-prizes-crime-reduction\">here</a>).</p>", "parentCommentId": "Pp6dv6akvgsC275Lg", "user": {"username": "Larks"}}, {"_id": "otmZvEzDDBvYqTtcT", "postedAt": "2022-12-20T20:28:35.499Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>The final 3 links seem to suggest the opposite of what you're claiming (though I guess it depends what you mean by 'low'):</p><ol><li>Firstly, \"for low unmet need for contraception in developing countries: <a href=\"https://pubmed.ncbi.nlm.nih.gov/23489750/\">https://pubmed.ncbi.nlm.nih.gov/23489750/</a>\"</li></ol><p>From the abstract of that paper:</p><blockquote><p>\"In 2010, <strong>146 million (130-166 million) women worldwide aged 15-49 years who were married or in a union had an unmet need for family planning</strong>. The absolute number of married women who either use contraception or who have an unmet need for family planning is projected to grow from 900 million (876-922 million) in 2010 to 962 million (927-992 million) in 2015, and will increase in most developing countries.</p><p><strong>Interpretation: </strong>Trends in contraceptive prevalence and unmet need for family planning, and the projected growth in the number of potential contraceptive users indicate that increased investment is necessary to meet demand for contraceptive methods and improve reproductive health worldwide.\"</p></blockquote><p>2. Secondly \"And for low proportion of unmet need attributable to lack of access: <a href=\"https://www.guttmacher.org/sites/default/files/pdfs/pubs/Contraceptive-Technologies.pdf\">https://www.guttmacher.org/sites/default/files/pdfs/pubs/Contraceptive-Technologies.pdf</a>\"</p><p>From the Highlights section of that paper:</p><blockquote><ul><li><strong>Seven in 10 women with unmet need in the three regions cite reasons for nonuse that could be rectified with appropriate methods</strong>: Twenty-three percent are concerned about health risks or method side effects; 21% have sex infrequently; 17% are postpartum or breast-feeding; and 10% face opposition from their partners or others.&nbsp;</li><li>In these three regions, the typical woman with reasons for unmet need that could be addressed with appropriate methods is married, is 25 or older, has at least one child and lives in a rural area.&nbsp;</li><li>In the short term, women and couples need more information about pregnancy risk and contraceptive methods,<strong> as well as better access to high-quality contraceptive services and supplies</strong>.&nbsp;</li><li>In the medium term, adaptations of current methods can make these contraceptives more acceptable and easier to use.&nbsp;</li><li>Investment in longer-term work is needed to discover and develop new modes of contraceptive action that do not cause systemic side effects, can be used on demand, and do not require partner participation or knowledge.&nbsp;</li><li><strong>Overcoming method-related reasons for nonuse of modern contraceptives could reduce unintended pregnancy and its consequences by as much as 59% in these regions</strong>.</li></ul></blockquote><p>3. Thirdly: <a href=\"https://pubmed.ncbi.nlm.nih.gov/24931073/\">https://pubmed.ncbi.nlm.nih.gov/24931073/</a></p><blockquote><p>Our findings suggest that access to services that provide a range of methods from which to choose, and information and counseling to help women select and effectively use an appropriate method, can be critical in helping women having unmet need overcome obstacles to contraceptive use</p></blockquote><p>I'd also note that because demand for contraception tends to increase with better education, we would expect demand to increase over time. If supply does not increase to meet this demand, then unmet need will increase.</p>", "parentCommentId": "aNm84m7hht6s9u65n", "user": {"username": "Matt_Sharp"}}, {"_id": "GmYXRcCmtW8W6n4ty", "postedAt": "2022-12-20T20:32:44.595Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>you haven't made it so these women are voluntarily wanting more children / less abortions, you've just made it so they have less of a choice, whereas it seems like you disagree.</p></blockquote><p>That's a compelling distinction! I'm better understanding what you mean now. We can narrow the set of interventions which affect a service down to three types:</p><ol><li>Voluntary: The service remains the same, but users of the service are incentivized to change their behavior.</li><li><i>Voluntary?</i>: Some providers stop offering the service, but the service remains available with other providers.</li><li>Involuntary: All providers stop offering the service.</li></ol><p>I'm keeping the situation abstract as a service to try to show why I think the \"<i>Voluntary?</i>\" type is distinct from the involuntary type.</p><ul><li>Would advocating for a platform to reduce hate speech impressions be an <i>involuntary </i>imposition on free speech? They can always use a different platform.</li><li>Would a doctor personally deciding to not perform abortions be an <i>involuntary</i> imposition on abortion seekers? They can always find another doctor.</li><li>Would a wedding planning company deciding to not plan weddings for homophobes be an <i>involuntary</i> imposition on homophobe weddings? They can always find another wedding planner.</li></ul><p>What you have convinced me on is that the \"<i>Voluntary?</i>\" type is more gray area than I thought. However, I still don't think any of the situations I enumerated should count as involuntary impositions.</p>", "parentCommentId": "YzzADisPyTrsZqvkt", "user": {"username": "Ariel Simnegar"}}, {"_id": "wHncfxC4YgehTxBdi", "postedAt": "2022-12-20T20:37:18.652Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>Neither charity has that I know of made a stance for or against abortion and they do not work on abortions</p></blockquote><p>Have they explicitly said they do not work on abortion? My assumption is that many places which did would not advertise the fact, precisely because they know many people would be concerned.</p>", "parentCommentId": "5uPXJeFymJ8CRSMjA", "user": {"username": "Larks"}}, {"_id": "vEL5F9E3BWm8YX87w", "postedAt": "2022-12-20T20:48:44.966Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I don't agree that the conclusions regarding low unmet need for contraception in developing countries, and this being due to access, is correct based on the sources that you have linked (although thanks for providing sources).</p>\n<p>I just had a very quick (&lt;5 minute) look at some of the sources regarding the low unmet needs for contraception in developing countries, largely because it goes against what I would expect (lower resource settings having proportionally higher resources in this area than high resource settings). Because I looked very quickly I've so far only looked at the abstract/highlights, however I expect that nothing in the main text would contradict this.</p>\n<p>The source you gave for 'low unmet need for contraception in developing countries': <a href=\"https://pubmed.ncbi.nlm.nih.gov/23489750/\">https://pubmed.ncbi.nlm.nih.gov/23489750/</a>\nIt does say that generally contraceptive prevalence has gone up and unmet needs have gone down (this is a good thing, i.e. progress), unless this was already high or low respectively (not surprising, a low unmet need can only decrease by a lesser degree than a high unmet need).</p>\n<p>However: \"The absolute number of married women who either use contraception or who have an unmet need for family planning is projected to grow from 900 million (876-922 million) in 2010 to 962 million (927-992 million) in 2015, and will increase in most developing countries.\"\nThis suggests that the unmet need is projected to increase <em>more</em> in developing countries compared to others.</p>\n<p>The sources on access: <a href=\"https://www.guttmacher.org/sites/default/files/pdfs/pubs/Contraceptive-Technologies.pdf\">https://www.guttmacher.org/sites/default/files/pdfs/pubs/Contraceptive-Technologies.pdf</a>\nIt does suggest that 7 in 10 cases access may not be main the issue: \"Seven in 10 women with unmet need in the three regions cite reasons for nonuse that could be rectified with appropriate methods: Twenty-three percent are concerned about health risks or method side effects; 21% have sex infrequently; 17% are postpartum or breast-feeding; and 10% face opposition from their partners or others.\" But: \"In the short term, women and couples need more information about pregnancy risk and contraceptive methods, as well as better access to high-quality contraceptive services and supplies.\"\nIt also says that a quarter of women in developing countries have an unmet need: \"In developing countries, one in four sexually active women who want to avoid becoming pregnant have an unmet need for modern contraception.\" I would not call that low, and I think this is one of those cases of it being important to put number on it otherwise people may have different definitions of what is/isn't low.</p>\n<p>(A very quick estimate using the first links that come up on Google: 152 developing countries, population approx 6.69 billion total, say therefore around 3.35 billion who are female.</p>\n<p>Turns out a quick Google does not bring up the proportion of women who are of childbearing age (15-49), but an interesting 2019 UN source on the need for family planning <em>does</em> come up which breaks down the unmet needs by region and is consistent with saying around 1/4 of women in developing countries have unmet needs: <a href=\"https://www.un.org/en/development/desa/population/publications/pdf/popfacts/PopFacts_2019-3.pdf\">https://www.un.org/en/development/desa/population/publications/pdf/popfacts/PopFacts_2019-3.pdf</a> That UN source has a quote: \"In 2019, 42 countries, including 23 in sub-Saharan Africa, still had levels of demand satisfied by modern methods below 50 per cent, including three countries of sub-Saharan Africa with levels below 25 per cent \"</p>\n<p>Back to that raw numbers estimate I was attempting: 1/4 of 3.35 billion is around 840 million for the unmet needs part. Maybe classing 1/3 of those women being of childbearing age/benefiting from contraceptives. That's around 280 million people.)</p>\n<p>The second source of access: <a href=\"https://pubmed.ncbi.nlm.nih.gov/24931073/\">https://pubmed.ncbi.nlm.nih.gov/24931073/</a>\nThis has less information than the others as I can by default only see the abstract\n\"Our findings suggest that access to services that provide a range of methods from which to choose, and information and counseling to help women select and effectively use an appropriate method, can be critical in helping women having unmet need overcome obstacles to contraceptive use. \" Suggesting that access is critical, and might imply that this is at least in part a reason for the unmet needs.</p>\n<p>Edit: me reading the sources took about 5 minutes, the above writeup including me looking some stuff up (perhaps unsurprisingly)  took a bit longer than that. I see having posted that Matt Sharp has also made a reply which says something very similar to what I am, would recommend reading that as well.</p>\n", "parentCommentId": "aNm84m7hht6s9u65n", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "togEBrXqoErpc3D5m", "postedAt": "2022-12-20T20:56:59.688Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Great counterpoints! I don't disagree with many of your conclusions, although I have a few nitpicks.</p><ul><li>I think voluntary abortion reduction may be more neglected than you seem to imply, if we define neglected as \"neglected by effective interventionists.\" Since there remain more abortions per annum than deaths by all causes put together, it seems that \"abortion reduction interventionists\" aren't doing a very good job. Similarly, there are many \"global poverty interventionists\" who don't seem to be very effective, given that GiveWell has found interventions which are many times more effective than the mean, so we might call global poverty neglected the same way. So I think there's an important sense in which voluntary abortion reduction <i>is</i> neglected--by effective interventionists.</li><li>On adoption, I agree with you that there's only so many children the world's adoption infrastructure can absorb, let alone deliver them to good parents who would lead them to thriving lives. However, it seems like improving this system's efficiency (would-be adopters in the US probably shouldn't have to <a href=\"https://adoptionnetwork.com/types-of-adoption-options/domestic-vs-international-adoption/\">wait as long or pay as much</a> as they do to adopt) and improving the culture around adoption would be a good idea even if it would be unrealistic for the infrastructure to ultimately scale enough to efficiently handle every child in need.</li></ul><p>I agree completely with your policy recommendations on surrogacy and organs.</p>", "parentCommentId": "jFvm25eEbhvwjgr8o", "user": {"username": "Ariel Simnegar"}}, {"_id": "uFh7C2wgrRdKCe8n6", "postedAt": "2022-12-20T21:43:24.202Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Ben! Thanks for a well-researched and balanced description of the competing theories of fetal pain development.</p><p>I don't have much to add on fetal pain (since you covered it so thoroughly!), but I am curious about your opinion on <a href=\"https://en.wikipedia.org/wiki/Person-affecting_view\">person-affecting versus non-person-affecting views</a> in population ethics. It seems that your moral opinion on abortion stems from a belief that a person must already be conscious/able to suffer in order to be a moral patient--i.e. a person-affecting view. In that regard, you posit that the time at which a fetus's capacity to experience pain begins is a critical juncture. However, many EAs hold relatively non-person-affecting views, which often compels them to act in the interests of people who will live in the far future, and have no hope of experiencing pain right now. Those EAs would be less likely to consider the point at which a fetus begins to experience pain to be a critical juncture.</p>", "parentCommentId": "Gy5Et5sJNCRMAByqT", "user": {"username": "Ariel Simnegar"}}, {"_id": "CW7XA936drcWamrLw", "postedAt": "2022-12-20T21:50:32.366Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I agree with you that those concerns will dominate the value of adding near-term future people. However, I think that even when those concerns are accounted for, adding near-term future people remains a good thing, as argued <a href=\"https://forum.effectivealtruism.org/posts/6uwAXinuaxyssofBB/assessing-the-case-for-population-growth-as-a-priority\">here</a>.</p>", "parentCommentId": "hqg5cqaaBkHCa58fK", "user": {"username": "Ariel Simnegar"}}, {"_id": "sMCa8utd7LGj8bdg3", "postedAt": "2022-12-20T22:03:24.422Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>Since there remain more abortions per annum than deaths by all causes put together, it seems that \"abortion reduction interventionists\" aren't doing a very good job.</p></blockquote><p>We can't measure the success of an intervention by measuring the scale of the remaining problem. We need a reason to think that abortion activists are either ineffective or under-resourced, and given that the legality of abortion is trending downward both in the United States and globally despite rising trends in secularization, that just doesn't seem plausible on its face. Furthermore, unlike many other charitable donors, anti-abortion activists really <i>are</i> primarily concerned with decreasing the number of abortions - and they're willing to embrace all methods for doing so, including politics and even terrorism. \"Voluntary abortion reduction,\" honestly, sounds like one of the <i>least</i> effective means for achieving the aim of reducing abortions, although I could certainly be persuaded that I'm wrong on that point with data.</p><blockquote><p>However, it seems like improving this system's efficiency (would-be adopters in the US probably shouldn't have to <a href=\"https://adoptionnetwork.com/types-of-adoption-options/domestic-vs-international-adoption/\">wait as long or pay as much</a> as they do to adopt) and improving the culture around adoption would be a good idea even if it would be unrealistic for the infrastructure to ultimately scale enough to efficiently handle every child in need.</p></blockquote><p>I want to point out that in the short run, we should actually have would-be adopters pay more and wait longer, because right now, the waiting list is enormous, and it never makes sense to address a shortage by subsidizing demand. It would probably be best if the money they pay went to the women who are having the children, even if by an indirect mechanism.&nbsp;</p><p>In the long run, if you did manage to eliminate the waiting list by increasing the production of children for adoption then yes, you would eventually run into the opposite need, to subsidize childrearing. But that cuts against your abortion-reduction cause.</p><p>Effectively, my model from a population-growth standpoint is this:</p><ol><li>We have an acute child-supply shortage due mainly to paid surrogacy bans. There is no real difference between paying a woman to be a surrogate and paying a woman to carry an otherwise unwanted pregnancy to term in order to allow the child to be adopted. Both should be legal. And it's likely to be hard to increase people's willingness to <i>donate</i> this service, as we see in other cases of banned compensation for organ exchange, such as in the case of kidney donation. In combination with extracorporeal pregnancy technologies, I expect this would largely address the supply shortage.</li><li>Once the acute supply shortage is addressed by creating a \"pregnancy profession,\" you are faced with the problem of increasing the desire to rear children.</li></ol><p>It's not at all clear to me how supply and demand would scale with various subsidy measures and technological improvements, but one thing I am pretty confident about is that, on its face and by empirical analogy with the case of kidney donation, <i>voluntary</i> abortion reduction sounds like about the least tractable approach for achieving the aim of scaling up the supply of children available to be adopted. But that's a strictly epistemic disagreement, and if hard data, or a convincing mechanism, were available, I'd absolutely change my mind on this point.</p><p>Edit:&nbsp;</p><p>One further point is that if you’re trying to convince people to carry pregnancies they don’t want out of an altruistic spirit, then a natural next move is to encourage women in EA to have babies in order to give them up for adoption (if they don’t want to raise the babies themselves). We find it charming when EAs donate kidneys to strangers, and this seems no different - indeed, a donated kidney will not generate nearly as many QALYs as a newborn baby. I find myself uncomfortable even articulating this idea, but it does seem consistent with your proposal, and more tractable than trying to convince people not to terminate pregnancies they don’t want when they’re not ideologically subscribed to EA-style altruism. All aboard, next stop Crazytown!</p>", "parentCommentId": "togEBrXqoErpc3D5m", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "hiic8todPu8qxKEic", "postedAt": "2022-12-20T22:32:16.668Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Is there a specific part of that article you're referring to? It mostly seems to be saying there isn't a particularly strong case for near-term population growth.</p><p>In terms of animals, they state:</p><blockquote><p>The negative effects of animal consumption alone may arguably make the net effect of additional human lives negative. However, animal consumption most likely will only continue for a couple of centuries, while&nbsp;the benefits of population growth that we consider would purportedly last much longer.</p></blockquote><p>But this doesn't seem to be addressing the marginal impact of additional near-term future people on animals. &nbsp;I don't think they've tried to estimate that. They simply seem to be dismissing it as relatively unimportant beyond the next few centuries.</p>", "parentCommentId": "CW7XA936drcWamrLw", "user": {"username": "Matt_Sharp"}}, {"_id": "92fe7bRQtcuWLenBF", "postedAt": "2022-12-20T22:50:21.793Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I am not the best person to answer this question, but will do my best:</p><p>My understanding is that FEM only works through large public radio information raising campaigns. There is no behind the scenes where they would / could promote abortion that I know of. So I think it highly unlikely that they have done any work on abortion.&nbsp;</p><p>Maternal Health Initiative is a few months old. They are still at the scoping and research stage so I cannot comment on their plans.</p><p>I hope that helps</p>", "parentCommentId": "wHncfxC4YgehTxBdi", "user": {"username": "weeatquince"}}, {"_id": "TiSZLy3HJYDrZs2mj", "postedAt": "2022-12-20T22:51:22.529Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>In case helpful note I comment below <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=92fe7bRQtcuWLenBF#comments\">here</a>:</p><blockquote><p>I am not the best person to answer this question, but will do my best:</p><p>My understanding is that FEM only works through large public radio information raising campaigns. There is no behind the scenes where they would / could promote abortion that I know of. So I think it highly unlikely that they have done any work on abortion.&nbsp;</p><p>Maternal Health Initiative is a few months old. They are still at the scoping and research stage so I cannot comment on their plans.</p><p>I hope that helps</p></blockquote>", "parentCommentId": "LggsjbH2tqvSPK9yC", "user": {"username": "weeatquince"}}, {"_id": "9DF4k5gJFKtwYCCvy", "postedAt": "2022-12-20T23:10:59.687Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>In my opinion, I think the best solution here is incentivizing people to voluntarily have more children—e.g. child tax credits, maternity/paternity leave, etc. If you don't think fetuses are moral patients, then the  pro-natalist, longtermist, total utilitarian view doesn't distinguish between having an abortion and just choosing not to have a child, so I don't really see the reason to focus on abortion specifically in that case.</p>\n", "parentCommentId": null, "user": {"username": "evhub"}}, {"_id": "vNa8KP7Deic4NFFox", "postedAt": "2022-12-21T00:01:04.434Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks, Matt. Sorry I was heading out earlier so didn't have time to elaborate as much as I would have liked. When I say unmet need for contraception (UMC) is low, I meant proportionally - by 2010 it was just over 10%, and I would guess is significantly lower still now. Of course, 10% globally is still a lot of people, but these are presumably the hardest people to reach and it is not clear how cost-effective doing so would be - moreover, it seems clear that even if we did manage to reach those 10%, the abortion rate would hardly decline by that much - so it is a pretty limited strategy for reducing abortions, if it is effective at all.<br><br>Regarding the second paper, table 5 indicates that only 8% of women with UMC globally lacked access (including because of cost). Table 3 in the third paper shows similar. So it still seems that only a very small proportion of women globally - perhaps 1% in 2010 - have a UMC because of lack of access to contraception.</p><p>There probably are interventions which could increase contraceptive uptake - but I don't think they are by any means simple, and they are not generally solving lack of access per se. The access is there, even if the relevant education or empowerment of women is not. As indicated in the rest of my previous post, even if this were solved, it is still not clear to me that it would reduce abortions, given the counterbalancing effects contraception promotion has on sexual behaviour and desired family size. It seems particularly doubtful that it would reduce abortions by a large amount.</p><p>You are right that as education increases, desired family size generally falls, and contraception demand will grow. But I don't see that there is a significant risk of contraception supply failing anytime soon. Even under the Mexico City Policy, which was widely held to significantly impede access to contraception, contraceptive use in the affected countries (turquoise - unaffected countries in orange) rapidly increased: <img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/20de95f3136235595175654616c744dfe69966f724ae67a9.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/20de95f3136235595175654616c744dfe69966f724ae67a9.png/w_141 141w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/20de95f3136235595175654616c744dfe69966f724ae67a9.png/w_221 221w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/20de95f3136235595175654616c744dfe69966f724ae67a9.png/w_301 301w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/20de95f3136235595175654616c744dfe69966f724ae67a9.png/w_381 381w\"></p><p>This, I suppose, is relevant to the EA discourse on neglectedness - with the emphasis on contraception in international development circles, it seems unlikely that slightly trimmed down support for it is going to significantly impede it or significantly increase abortion rates. But I confess I am only really on the peripheries of EA so I might be outdated with the neglectedness stuff.</p>", "parentCommentId": "otmZvEzDDBvYqTtcT", "user": {"username": "Calum Miller"}}, {"_id": "yNLaT5Gtt2iSiNuky", "postedAt": "2022-12-21T00:03:52.993Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you Lin for your thoughtful comment. I gave some further thoughts to Matt above, and it felt rude to copy and paste that comment again here. But if you have a particular hesitation which I haven't addressed to Matt above please do let me know and I'll do my best to come back to you on it.</p>", "parentCommentId": "vEL5F9E3BWm8YX87w", "user": {"username": "Calum Miller"}}, {"_id": "kra89iAxAdqQkMZ5z", "postedAt": "2022-12-21T00:12:02.340Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you for a very thoughtful comment. I did just want to add that there are some who do place the possibility of fetal pain earlier - namely, if the cortex is not in fact necessary for conscious experience or pain (https://journals.sagepub.com/doi/full/10.1177/00243639211059245). I realise this is a minority view, but I do think it has some things to commend it (e.g. experiences of pain in those with anencephaly/hydranencephaly).</p><p>It's probably worth noting as well that the sheer number of abortions makes even small percentages significant - if only 10% of abortions take place after 12 weeks, that is still 5-7 million or so a year, so plausibly still worth addressing from an EA perspective.</p><p>&nbsp;</p><p>(DOI: I don't take a view of moral status that relies on conscious experiences so would be opposed to abortion even before that)</p>", "parentCommentId": "Gy5Et5sJNCRMAByqT", "user": {"username": "Calum Miller"}}, {"_id": "rwPRyxr9daEP8Hhon", "postedAt": "2022-12-21T00:17:54.504Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Should have mentioned earlier that in terms of tractability, Hungary might offer the most interesting case study: abortion has not been restricted significantly there at all, but they have reduced the abortion rate from 90,000 in 1990 to just over 20,000 today. This resulted from quite a costly set of pro-family policies which have been widely lauded in pro-family circles, but it is possible that other factors contributed as well (as a nuance to my earlier post, there is good evidence that contraception reduced abortion rates specifically in ex-Soviet countries, probably because sexual behaviour had already changed but abortion had been legalised and was being used as birth control - so contraception substituted more equivalently for it). Hungary abortion numbers: https://www.ksh.hu/stadat_files/nep/hu/nep0013.html</p>", "parentCommentId": null, "user": {"username": "Calum Miller"}}, {"_id": "aHbPdTNRtLFem7PGX", "postedAt": "2022-12-21T00:21:58.263Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you, Ariel. I was raised as a liberal Christian for whom pretty much anything broadly deemed progressive (including abortion) was permissible, but changed my convictions at medical school :-)</p><p>I don't blame you for sticking to voluntary abortion reduction - I think it is a perfectly worthy topic of discussion in itself!</p><p>I will do my best to write something up after all. I've always found EA people to be more open-minded and thoughtful than most in philosophy, and I've been encouraged to see the thoughtful and cordial comments among even those who disagree here.</p>", "parentCommentId": "79vgkghyA78GhEXSn", "user": {"username": "Calum Miller"}}, {"_id": "fyFwfneCic4LyNwyN", "postedAt": "2022-12-21T00:28:10.923Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your response. &nbsp;Just to clarify, part of my concern is with the possible disrespect inherent in regarding <i>the avoidance of unwanted pregnancies</i> as a \"possible serious negative externality\". I don't think that's a good (or respectful) way to think about it, and accordingly I don't think the \"steakhouse\" analogy works (because, to be clear, the moral reasons we have to defer to individual women about the desirability of <i>them personally</i> <i>becoming pregnant</i> have no analogue in the steak case -- individuals do not have the moral authority to determine whether <i>them personally eating meat</i> is morally good or bad).</p><p>Of course, you might disagree about whether respect for individual women calls for this kind of deference or granting of moral authority over whether it's good or bad for them personally to become pregnant. &nbsp;But I think it's sufficiently credible that you should give it significant weight in moral uncertainty. &nbsp;And that means that there's a significant moral risk to the kind of argument that you're putting forward here, which involves depriving them of that moral authority.</p><p>(Note that there is no such risk to the alternative many are urging here, of supporting pro-fertility policies in a way that's fully co-operative with -- rather than potentially adversarial towards -- the wishes and choices of individual women.)</p>", "parentCommentId": "Fek5GYJTPxgLFukut", "user": {"username": "RYC"}}, {"_id": "syBim7XZbzSnb4xfd", "postedAt": "2022-12-21T03:49:34.953Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>I don't think the \"steakhouse\" analogy works (because, to be clear, the moral reasons we have to defer to individual women about the desirability of <i>them personally</i> <i>becoming pregnant</i> have no analogue in the steak case -- individuals do not have the moral authority to determine whether <i>them personally eating meat</i> is morally good or bad).</p></blockquote><p>The two situations seem pretty analogous to me. In both cases there is some <i>prima facie</i> plausible personal autonomy case on one side (it certainly seems plausible people have the right to choose what food they eat!) and a <i>prima facie</i> harm to third parties on the other (with debate about whether those third parties are morally relevant). In both cases the person has some moral authority (to decide if eating meat is good <i>for them</i>) but not complete (they can't decide if eating meat is bad <i>for the animals).</i></p>", "parentCommentId": "fyFwfneCic4LyNwyN", "user": {"username": "Larks"}}, {"_id": "sY4sQ2xycquW9mnE8", "postedAt": "2022-12-21T04:11:38.739Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Yes... it would be great if the criminal justice system could actually rehabilitate people rather than mostly just punishing them.</p>\n", "parentCommentId": "NPEgaXgAdzRhgRb6q", "user": {"username": "ruthgrace"}}, {"_id": "7vpky5LWHLTZjYevb", "postedAt": "2022-12-21T05:05:08.822Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>There's a few people in the comments here openly supporting involuntary abortion reduction. I'm curious how far that kind of philosophy goes? If this is you, do you also support involuntary meat consumption reduction in low income countries? How about involuntary appropriation of people's crypto investments for EA grants...?</p>\n", "parentCommentId": null, "user": {"username": "ruthgrace"}}, {"_id": "ff3rAJGRtLFsbCYkk", "postedAt": "2022-12-21T05:15:24.621Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>It's not too crazy; being a pregnancy surrogate is something women can get paid to do and doesn't really require any altruism. This is for an IVF baby generally, not carrying a baby with your own genetic material. The demand for babies is real. Selling eggs or sperm to gay couples trying to conceive is similar.</p>\n<p>Edit for numbers: I think in California people pay surrogacy agencies $70,000 for everything and the women who carry the babies get about half that amount.</p>\n", "parentCommentId": "sMCa8utd7LGj8bdg3", "user": {"username": "ruthgrace"}}, {"_id": "nmRszMdaFEmFgvXjp", "postedAt": "2022-12-21T05:21:19.130Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>The two commonsense relevant definitions of “voluntary”  you’ll find in the dictionary are “of one’s own free will” and “in the absence of payment.”</p>\n<p>Reducing funding for abortion services may in some cases cause people to choose to carry a pregnancy to term when could have still obtained an abortion, perhaps by exerting more effort or taking on more risk. Since they were not paid to not have an abortion, I suppose it is technically “voluntarily” in the second sense, in the same way that criminalizing homosexuality caused people to “voluntarily” have less homosexual sex.</p>\n<p>While I grant you the benefit of the doubt, I tend to see this kind of subtle misuse of language in a native English speaker (as I assume you are?) as a deliberate obfuscating move rather than a slip-up, so you may want to reconsider your linguistic choices in the future to avoid creating that impression.</p>\n<p>I think more to your point, there is a difference between “freedom from” and “freedom to,” or positive and negative rights. Many people feel people should have freedom <em>from</em> being legally prevented from seeking an abortion, but not necessarily that we should subsidize their ability <em>to</em> have an abortion. I read your post as about eliminating subsidies for family planning, as well as encouraging voluntary increased child rearing.</p>\n", "parentCommentId": "GmYXRcCmtW8W6n4ty", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "Rm7nab8zKckCCSYoG", "postedAt": "2022-12-21T05:30:17.463Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>That is a fair point actually! I retract my crazytown comment.</p>\n", "parentCommentId": "ff3rAJGRtLFsbCYkk", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "jF3eJxBHjiGiD8pzr", "postedAt": "2022-12-21T05:30:48.465Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I think this is a useful clarification, thanks.</p><blockquote><p>Would a doctor personally deciding to not perform abortions be an <i>involuntary</i> imposition on abortion seekers? They can always find another doctor.</p></blockquote><p>It sounds like the crux here is the extent to which these women have many options RE: access to safe abortion services - this could be an involuntary imposition if they're the only doctor in a 100km radius, for example, or if other doctors are so busy they don't have time to look after additional patients.&nbsp;</p><p>It's also not all-or-nothing, it could be the case that there are many other doctors, but only one doctor with the skill to perform abortions, or many other doctors accessible by car but not by foot etc, or doctors available but are less affordable.</p><p>Unfortunately, the bar is much higher on your end, because if only a minority of women who previously were using service X now no longer have an alternative, this would be an involuntary imposition on this small minority, so if you're suggesting that \"any involuntary intervention is out of scope\", then you'd also have to show that all users of service X have similar access to a functional equivalent. I don't know if this is the case personally, but it would surprise me if the charity's nonexistence did not change the number of women with access to family planning / abortion. Presumably if this were the case, these charities would be working in a fairly non-neglected context, and thus not worth funding purely on cost-effectiveness / neglectedness considerations.</p>", "parentCommentId": "GmYXRcCmtW8W6n4ty", "user": {"username": "bruce"}}, {"_id": "Bt3emdwjeJFz6X27T", "postedAt": "2022-12-21T12:19:21.575Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>There's no prima facie harm from contraception. There's a possible foregone benefit, but one it would be arguably illicit to obtain by treating the provider as a mere means.</p>\n<p>A better analogy would be to stop supporting medical treatment for car accident victims, because if we let them die we could use their organs to save more others.</p>\n<p>You're not talking about averting negative externalities, but about promoting exploitation of others without their consent. I don't think EA should countenance such reasoning.</p>\n", "parentCommentId": "syBim7XZbzSnb4xfd", "user": {"username": "RYC"}}, {"_id": "26q3mPCb5CThHYas3", "postedAt": "2022-12-21T14:20:46.538Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your reply!</p><p>I should have elaborated more upon why abortion's scale implies that those who have intervened to reduce it thus far aren't going about it very effectively, but I'll let Toby Ord do it instead:</p><blockquote><p>Cancer, in all its forms, kills 7.6 million per year, while spontaneous abortion kills 30 times this number (World Health Organization 2005). In 6 years, the Second World War killed approximately 60 million people, whereas spontaneous abortion kills more than 3 times this number every year. For supporters of the Claim there is little choice but to see it as one of the world's greatest problems, if not <i>the</i> greatest problem.</p><p>The introduction to the Scourge ended with a practical conclusion:</p><p>&gt; There was an overwhelming obligation on society to fight it. Other projects had to be put on hold and a major international effort dedicated to loosening the Scourge's grip on humanity.&nbsp;</p><p>For supporters of the Claim, it is difficult to resist a similar conclusion. Finding a means of saving even 5% of embryos from spontaneous abortion would save more lives than a cure for cancer. If we see one of these as requiring an immense international collaboration, then why not the other?</p></blockquote><p>Toby's <a href=\"https://doi.org/10.1080/15265160802248146\">argument </a>is about <i>spontaneous </i>abortion's neglectedness, not <i>induced</i> abortion, but it's easy to divide the number by 3 (200 million -&gt; 73 million) and draw the same conclusion.</p><p>I don't have strong disagreements with your policy prescriptions on adoption. Though you've retracted the crazytown comment, I'd also like to note that if (hypothetically) people who donated kidneys took 9 months to regenerate a new donateable kidney, then we'd see posts on the EA forum about how EAs should consider donating a kidney every year or so, and I'd largely agree with those posts.</p><p>On <i>voluntary</i> abortion reduction's tractability, I think it's worth pointing out that other problems of moral circle expansion including slavery, women's rights, and hopefully animal welfare all began with voluntarily convincing people to do what was right, even in a time when few agreed. 150 years ago, slavery was widely practiced by many \"civilized\" countries. I don't think it's impossible that in 150 years, abortion will be widely regarded as the worst moral catastrophe in history between human beings. If that day ever comes, it'll because people were convinced to take a stand, one person at a time.</p>", "parentCommentId": "sMCa8utd7LGj8bdg3", "user": {"username": "Ariel Simnegar"}}, {"_id": "mMFdnnELscDoLg7AH", "postedAt": "2022-12-21T14:31:04.347Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I strongly disagree with the comparison between (a) proposals to suspend EA funding for services which reduce the amount of future people and (b) criminalizing homosexuality.</p><p>I don't think there's any \"subtle misuse of language\" which causes one to be anywhere near the other. Isn't the comparison between (a) and any of the analogues I gave in my above comment far more natural? How are any of <i>those</i> anywhere near criminalizing homosexuality? If anything, comparing (a) to criminalizing homosexuality could constitute a \"deliberate obfuscating move.\"</p><p>I think we're both acting in good faith here, and I'm willing to admit a passion for this cause which can affect the impartiality with which I react to comments. All I can say is that I <i>really </i>don't see things that way, and I don't think there's anything unreasonable about recognizing (a) and (b) as fundamentally different.</p>", "parentCommentId": "nmRszMdaFEmFgvXjp", "user": {"username": "Ariel Simnegar"}}, {"_id": "XsarSqBbgWzhtiKNr", "postedAt": "2022-12-21T14:36:27.364Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Sorry if this a dumb question, but there are so many comments (and I'm on my phone) that I got confused: you, Lauren, removed your remark regarding spontaneous abortions, because they were met by the appendix.\nHowever, while Ariel does \"bite the bullet\" of Ord's Scourge paper, I don't see it making any difference. I'd expect that interventions on reducing miscarriages to be probably more tractable and scalable, and way less costly - so more effective than reducing intentional abortions. We don't have to save all of the 200m embryos; just like there's no way of saving all those lost in voluntary abortions.\nSo, Ariel, the disclaimer that the research only focuses on voluntary abortion reduction sounds ad hoc; as if  AMF said they were only focuses on saving lives through bednets, which is not accurate: instead, they think that such projects are the best way, for them, to save lives.\nOr perhaps there's a way to rephrase and clarify the disclaimer to account for this; e g., you're less concerned about abortion as a cause area and more about a moral constraint regarding projects - i.e., just like we shouldn't fund projects leading to work abuse, we shouldn't fund projects leading to abortion. Sometimes, I think that's your point.\nOr is there a particular moral difference between preventing a (statistically predictable) spontaneous abortion and preventing an intentional one, per se?</p>\n<p>Second, if we bite that bullet, and actually you see abortion reduction as a cause area, there's another Scourge unmet by the appendix: discarded frozen embryos. It would be even easier to proscribe that, or (if you think that discarding per se is the issue, instead of just keeping them) to demand they are keeping frozen indeterminately. What do you think about it, Ariel?\nPlease, sorry if I'm missing something here</p>\n", "parentCommentId": "HBQnJkKj3PiL23GA7", "user": {"username": "Ramiro"}}, {"_id": "Y8dwEcSSxHjpXZj2E", "postedAt": "2022-12-21T14:38:44.112Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I feel confused about how you're balancing different aims against each other. Several times in the comments someone points out that your proposed interventions sometimes oppose your stated goal of \"voluntary abortion reduction\" (by increasing abortions or by not being voluntary.) Then you say there's some other consideration. This makes me feel the goals are constantly shifting, and I can't tell how much you really value each of them.<br><br>I'm no expert on cause prioritization, but I'd think a useful step would be to think about how you value each of the different things (not causing pain to moral patients, not cutting short someone's life, more people being alive, wellbeing of parents/potential parents, etc) and the scale of those things. This might lead to a more coherent list of priorities.</p>", "parentCommentId": "nJvGupnzKYwWX4wsb", "user": {"username": "Julia_Wise"}}, {"_id": "48nfkaQ5eig65ws42", "postedAt": "2022-12-21T14:39:33.411Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>It sounds like the crux here is the extent to which these women have many options RE: access to safe abortion services</p></blockquote><p>Yes, I think this is close to the consensus on definition we're reaching. The only quibble I have with this is that I think the level of \"obligation\" on the service provider to provide a service is also relevant.</p><ul><li>The publishing platform has no obligation to host content it considers hate speech.</li><li>The anti-abortion doctor has no obligation to perform abortions.</li><li>The homophobe-phobic wedding planning company has no obligation to plan any particular person's wedding.</li></ul><p>Similarly, I don't think EA can be said to have an \"obligation\" to provide funding for any particular cause, unless that cause is clearly and unambiguously more important than EA's erstwhile top priorities. In that regard, I don't think that a proposal to withdraw EA funding for some service constitutes an involuntary imposition on the service's recipients, <s>especially given</s> conditional on the option that the recipients can procure the service in other ways.</p><p>Edit: Altered incorrect language</p>", "parentCommentId": "jF3eJxBHjiGiD8pzr", "user": {"username": "Ariel Simnegar"}}, {"_id": "RkWQ3H5ttjuKJenYk", "postedAt": "2022-12-21T15:29:15.943Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your comment, Julia! I think my mistake (which began with the post's structure and tricked down into the conversation in the comments) was muddying the distinction between my actual <i>conclusion </i>(adding/removing one future person is close to as important as saving/ending a life) and one <i>implication </i>which I feel strongly about (abortion is morally wrong).&nbsp;</p><p>Though it's too late for most readers, I'll try to spell the structure of the argument I should have given here:</p><ol><li><strong>Premise</strong>: Longtermist EAs are sympathetic to total/low critical level views in population ethics and non-person-affecting views.</li><li><strong>Corollary</strong>: These views, along with a sufficiently rosy image of the expected future person's happiness, imply that we should consider <i>adding a future person to be as good as saving a life.</i></li><li><strong>Conclusion</strong>: Longtermists use (2) to argue that reducing the probability of x-risks is morally equivalent to saving innumerable lives. However, it also seems true that (2) implies that adding one future person, <i>even in the near term</i>, could also be as good as saving a life, whether or not it's ultimately as important a priority as reducing x-risk. Similarly (since we're assuming consequentialism), <strong>removing one future person</strong>, <i>even in the near term</i>, <strong>could be as bad as ending a life</strong>.</li><li><strong>Implications</strong>:<ol><li>EA-relevant:<ol><li>An intervention <i>increasing</i> the amount of future people might be an additional reason to support it.<ol><li>e.g. if children saved by AMF go on to have more children, etc, that could update AMF's actual effectiveness relative to interventions which \"only\" <i>improve</i> lives, like GiveDirectly.</li><li>Or perhaps GiveDirectly gives families the resources they need to create more children, and we should care about <i>that</i>, etc. Either way, we should take these downstream effects into account when evaluating which causes to fund.</li></ol></li><li>An intervention <i>decreasing</i> the amount of future people should give us substantial pause, and we should think about whether or not we should ultimately support it, and probably suspend our support of it for now until we can research the issue further.<ol><li>e.g. well-meaning family planning charities like DMI, MHI, etc could be causing significant harm, and we should care about that, and suspend our support until we can evaluate the possible serious negative externality.</li></ol></li></ol></li><li>Much less EA-relevant:<ol><li>Abortion is morally wrong because it prevents a future person, which is as bad as ending a life.</li><li>We should support policies which incentivize people to have more children and raise happy families.</li></ol></li></ol></li></ol><p>The actual important EA-relevant parts here are (3) and (4)(a). However, (4)(b)(i) (abortion) has been on my mind for a <i>long</i> time, because it has always seemed to me like a blind spot in EA, and there are many, many other EA-style arguments for reaching the conclusion that abortion is morally wrong.</p><p>In retrospect, it's now easy to see that in this post, I tried to have my cake and eat it too. Because I felt strongly about implication (4)(b)(i), I made it the banner of my post, and phrased this whole argument in terms of (4)(b)(i).</p><p>Because I still believed in the much more important and EA-actionable implications from (4)(a), I tried to shoehorn them in under the banner of \"further implications\" of (4)(b)(i) -- \"voluntary abortion reduction\". In doing so, I muddled and poisoned the discussion by causing a semantic debate which distracted from what I was actually trying to say.</p><p>I'd love to hear your advice on how to approach this. Perhaps I should include an edit in the post which explains this line of thought, to fix the mistake of how I arranged the post. Perhaps I should write a post on \"Near-Term Implications of Longtermism\" where I don't bring abortion up at all. What do you think?</p>", "parentCommentId": "Y8dwEcSSxHjpXZj2E", "user": {"username": "Ariel Simnegar"}}, {"_id": "iQyyBo4JKhaDoGyon", "postedAt": "2022-12-21T16:32:49.069Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for the engagement! There's a lot going on here. Responding first to:</p><blockquote><p>especially given that the recipients can procure the service in other ways.</p></blockquote><p>I'm just noting that your comment on the recipients being able to procure services elsewhere is prefaced with the word \"especially\", and not something like \"conditional on\". This implies that the ability of the recipients being able to procure services elsewhere is not a <strong>necessary </strong>factor of determining whether this constitutes a voluntary or involuntary imposition.</p><p>So if you're saying something like \"Because EAs don't have an obligation to provide funding to any cause, no withdrawal for funding can constitute an involuntary imposition on the service's recipients, irrespective of whether these women have other options available\" then this is something I <strong>pretty strongly disagree </strong>with. It seems to me that what EA funders' moral obligations are here are either irrelevant or vastly dominated by the experience of the recipient when deciding whether this action contributes to a voluntary reduction in abortion or an involuntary reduction?</p><p>From the perspective of a pregnant woman seeking abortion, they don't care about what the EA funder's obligation are. All she knows is that last year her friend had access to affordable abortion services, and this year she doesn't have the same choice. I don't really understand how this could be really considered meaningfully voluntary, even if she decides to keep the baby instead of try a dangerous DIY method at home (though clearly, many women will do this).</p><p>======</p><blockquote><p>In that regard, I don't think that a proposal to withdraw EA funding for some service constitutes an involuntary imposition on the service's recipients, especially given that the recipients can procure the service in other ways.</p></blockquote><p>More generally, it might be true that recipients can procure the services in other ways, but I'd like to see this claim actually justified for the charities that you are suggesting should have their funding suspended, or added as a caveat above (\"conditional on these recipients being able to access the same quality of care elsewhere at no meaningful cost...etc), alongside the other philosophical caveats you've <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=rvnzS2Gwtm8rJ8ccW#:~:text=Longtermist%20philosophical%20views\">provided</a>.</p><p>Otherwise it's an open Q whether the recipients can in fact procure the services in other ways, what costs they may have to bear in order to do so (also see <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=9DF4k5gJFKtwYCCvy#48nfkaQ5eig65ws42:~:text=Unfortunately%2C%20the%20bar,a%20functional%20equivalent.\">above </a>RE: the bar being higher on your end in terms of showing that such recommendations for suspensions result in no involuntary impositions), and whether this harm is worth the benefits it brings, especially considering 2nd order considerations such as <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=ernADdAQRCSAbe36g#comments\">those raised by a commentor above</a>.&nbsp;</p><p>I'm pretty hesitant to update in your direction until I see at least an attempt at quantifying this.</p><p>======</p><p>For what it's worth, most of this message above and an earlier <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=jF3eJxBHjiGiD8pzr#comments\">comment</a> was me going along with your usage of the terms voluntary / involuntary, but I think this is actually quite a misleading use of these terms. (Mainly in response to your comment RE: \"consensus on definition\", as I don't want to give the impression I am endorsing this definition, but just that I am trying to understand it more clearly). That being said - I'm not suggesting you are being intentionally misleading!</p><p>Hypothetical analogy: suppose you think higher homelessness rates are better. Suppose you know that there's a subset of researchers who applied for funding from EA sources because they wanted a way to pay rent. Would you say that because EA funders have no obligation to provide funding for any cause, that such a withdrawal of funding, for the purpose of increasing homelessness rates (and against your best guess for what the researcher would want for themselves), would be appropriately classified as \"increasing voluntary homelessness\"?</p><p>By your <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=GmYXRcCmtW8W6n4ty#comments\">usage </a>of voluntary and involuntary, this would depend on whether or not they could find a source of $ elsewhere. But I think my <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=PmF8AukfdTJgpPLJc#comments\">original interpretation</a> is that even if you showed me that these researchers could find $ elsewhere for rent, it would still be inaccurate for this suspension of funding to be classified as \"increasing voluntary homelessness\", because the mechanism by which this increases homelessness is decreased access to alternatives, not because it is empowering people to make the choice of becoming homeless because they wish to be for their own reasons. (This doesn't at all interact with the possibility that suspension of funding is the right call for other reasons, e.g. if their research isn't adding a lot of value, or if this isn't neglected because they have many other funding options available).</p><p>I hope this illustrates my concern with the \"suspending funding\" recommendation based on \"voluntary abortion reduction\" arguments. (i.e. I think the definitions you use are contrary to my best guess of what most people would interpret as \"voluntary abortion reduction\", but even by your own definition, you provide pretty limited support for the extent to which other options are available). &nbsp;</p><p><strong>I think that the main relevant question in determining whether the abortion reduction is voluntary or not should be: \"Are the women in question making a well-informed, uncoerced choice that keeping the baby is preferable to a safe abortion, or are the women in question 'choosing' to keep the baby because there are limited alternatives available to them?\"</strong></p><p>======</p><blockquote><p>The anti-abortion doctor has no obligation to perform abortions.</p></blockquote><p>Minor nitpick: I'm not sure if you're talking about a moral or legal obligation here, and I guess it may vary by jurisdiction, but it's not as clear cut as written here. When a doctor conscientiously objects to providing a service (i.e. refuse to provide a service that is against their personal values), there's a clear case to be made that it is the doctor's professional obligation to let the patients know what options they have available and how they can access this care from other doctors who can provide this service, such that their personal values do not not meaningfully impact their patients' health outcomes and access to treatment. And if there are no other options available, and conscientious objection will compromise healthcare delivery then this may be unacceptable.</p><p>I agree that a charity / EA funding may not be held to the same standard as a medical doctor in terms of moral obligations, but the same thought process is relevant in terms of taking into account how much harm you may be contributing to in expectation. To reiterate though, the extent to which EA funders or doctors are obligated to provide this service is (imo) not particularly relevant to whether or not the women in question are now voluntarily choosing not to have abortions.<br><br>(btw the disagree votes on your comments in this thread aren't coming from me)</p>", "parentCommentId": "48nfkaQ5eig65ws42", "user": {"username": "bruce"}}, {"_id": "g4m85iExCL3AzAJMR", "postedAt": "2022-12-21T17:13:20.214Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Ramiro, I removed my comment because I claimed that Ariel didn’t even mention miscarriages (which I later realized they did).</p>\n<p>I do wonder what Ariel’s reply to this comment of yours would be though:</p>\n<p>“Or is there a particular moral difference between preventing a (statistically predictable) spontaneous abortion and preventing an intentional one, per se?”</p>\n", "parentCommentId": "XsarSqBbgWzhtiKNr", "user": {"username": "Lauren Maria"}}, {"_id": "eCGBPnmBFiocrB4K3", "postedAt": "2022-12-21T17:54:22.368Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your question, Ruth. I confess to being a sucker for the liberal democracy post-WW2 human rights deontological framework, according to which involuntary abortion reduction follows from a fairly simple premise: human embryos/foetuses are human beings. If so, then according to the standard human rights framework (specifically ICCPR Article 6) they have a right to life which must be protected in law - i.e. they cannot be killed.</p><p>I don't see how a comparable case can be made for the interventions you mention. I know less than nothing about crypto so really couldn't say anything at all about that. Regarding involuntary meat consumption reduction, I don't think non-human animals have a right to life so consuming meat would not be wrong for the same reasons.</p><p>Whether meat consumption could reasonably/permissibly be involuntary reduced (I'm not sure why it would be specifically limited to poor countries) for other reasons depends on the facts of the case, I think. I certainly wouldn't have an in principle/absolute objection to doing so if the case for doing so (either from &nbsp;climate concerns, animal suffering, or scarcity) were sufficiently strong. We rationed meat in the war and I don't think that violated any sort of inviolable right to bodily autonomy, for example.</p>", "parentCommentId": "7vpky5LWHLTZjYevb", "user": {"username": "Calum Miller"}}, {"_id": "EWSMnwywByiJKjKE7", "postedAt": "2022-12-21T17:54:54.618Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>On \"especially,\" yep, that was an incorrect use of words, and I've edited my comment accordingly. Thanks for pointing that out!</p><p>Based on your considerations, and after thinking about it some more, I retract the \"obligation\" point, and now agree that the fact that we're not \"obligated\" to fund this cause doesn't make the downstream effects of the funding redirection \"voluntary\" or \"involuntary\" for the recipients.</p><blockquote><p>it might be true that recipients can procure the services in other ways, but I'd like to see this claim actually justified for the charities that you are suggesting should have their funding suspended</p></blockquote><p>Of the charities I mentioned, to the best of my knowledge, only <a href=\"https://www.psi.org/practice-area/safe-abortion/\">PSI </a>actually provides abortions. <a href=\"https://www.developmentmedia.net/what-we-do/focus-areas/family-planning/\">DMI</a> &nbsp;and <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=92fe7bRQtcuWLenBF\">FEM</a> run media campaigns encouraging contraception. <a href=\"https://maternalhealthinitiative.org/what-we-do/\">MHI</a> connects women with contraception access. On DMI, FEM, and MHI, Calum <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=aNm84m7hht6s9u65n\">suggests </a>that the unmet need for contraception due to lack of access is quite low, and supports his suggestion pretty well IMO.</p><p>I think PSI is where your point is strongest, since it seems very difficult to rule out the possibility that there exists some place where PSI is the only abortion provider. However, PSI is not an EA charity, and it seems very unlikely that removing its recommendation from The Life You Can Save's website would cause it to stop being able to offer its services where there's the greatest unredirectable demand.</p><p>As for whether or not the intervention's harm is worth the benefits it brings, I'd like to point out that this concern is orthogonal to the question of whether or not the intervention could be considered \"voluntary.\" That said, I would say yes, and that's the <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=toEpMuuAsj4uJHviq\">reasoning</a> I use to recommend it.</p><blockquote><p>[homelessness analogy]...the definitions you use are misleading and contrary to my best guess to what most people would interpret as \"voluntary abortion reduction\"</p></blockquote><p>Your homelessness analogy is a good one, and it <i>does</i> accurately show how my use of the term \"voluntary\" could have been misleading. I have some regrets about the whole structure of my post in that regard. I reply to Julia Wise's similar concern <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=RkWQ3H5ttjuKJenYk#Y8dwEcSSxHjpXZj2E\">here</a>, which might help explain much more about my thought process.</p><blockquote><p>(btw the disagree votes aren't coming from me)</p></blockquote><p>No worries! I used to go on Reddit often, and as you can imagine from our interactions, I was prone to getting heavily downvoted :P To avoid motivated/emotion-driven \"reasoning\", I made a personal rule to never downvote anyone on Reddit for any reason. I'm off Reddit now, but I've always maintained the rule that I never downvote respectful discourse. I think engagement is better than a disagree-vote, and strive to avoid the latter in favor of the former.</p><p>To close (as frankly, there's only so much brainpower I'm willing to extend on this semantic consideration), I maintain that the interventions I suggest would be the right thing to do. However, there's a sensible case that there are reasonable definitions of \"voluntary\" which readers understandably presuppose when reading the post for which the interventions <i>don't </i>qualify. Though I maintain that there are senses in which they <i>do </i>qualify, I think you've made an excellent case that there's substantial ambiguity there which can blindside readers. I'd appreciate if you read my <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=RkWQ3H5ttjuKJenYk#Y8dwEcSSxHjpXZj2E\">reply </a>to Julia Wise's similar concern (which helps to spell my actual intention behind the post), and let me know what you think would be the best way to disambiguate while staying true to the post's scope.</p>", "parentCommentId": "iQyyBo4JKhaDoGyon", "user": {"username": "Ariel Simnegar"}}, {"_id": "FAGCojKzrTCs8fEnE", "postedAt": "2022-12-21T17:57:02.274Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I do take a non-person-affecting view, but with a sort of deontological barrier around doing things that could cause substantial harm to a large number of currently-existing people, particularly in areas I regard as \"human rights\". This is not the only area I'd endorse this sort of deontological barrier. I also endorse one against committing dishonesty or fraud in the name of things that might harm the long term future, and recent events have strengthened my view on that.</p><p>There are a couple of justifications for this. First, we should have a certain amount of epistemic humility, where at some point it's just really hard to understand what effects of current acts on the long term future will be, and we better be <i>really sure</i> if we cause present harm for the sake of far-future good. I have a certain amount of loss aversion when it comes to working out what sort of acts I should do. Second, we might want certain values to be sustained into the long term future, like honesty and respect for human rights, because sustaining those values will be good for future society. That might be a reason that doing things in the name of honesty or human rights that might, on the balance, have negative direct effects for the long-term future, could actually end up having long-term positive effects.</p><p>On this particular issue, I'm at least moderately pro-natalist. I think the vast majority of possible good we can do in the present to improve the long term future is just to avoid existential risk, so I don't hugely emphasize pro-natalism. One reason is it's not clear whether a larger population now will lead to a large population in 200 years, since future generations might compensate for higher fertility now with less fertility in their time, as long as there are resource constraints given current technologies. But on balance I do support pro-natalism, not just because of the long term future, but also because more <i>present</i> people enjoying the <i>present</i> is good. Having said that, I think the restriction on womens' autonomy is a high cost to pay, and we might be able to get equivalent boosts in fertility through other policies, like <a href=\"https://www.vox.com/future-perfect/2019/9/10/20835327/voting-age-youth-rights-kids-vote\">letting children vote</a>, providing much more financial support for parents at low incomes, and more favorable tax treatment for parents at all income levels, by, for instance, allowing not just spouses to file jointly but allowing parents to also file jointly with their children.</p><p>I worry I wasn't actually fair enough to the \"12 week fetal pain\" theory--the more I think about the paper I read yesterday, the more I actually prefer it, all things considered, to its alternative, and I'll update my post on that basis.&nbsp;</p>", "parentCommentId": "uFh7C2wgrRdKCe8n6", "user": {"username": "ben.smith"}}, {"_id": "jS29gTKLYayEDgGJn", "postedAt": "2022-12-21T17:58:56.125Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you! That's a reasonably significant update for me.</p>", "parentCommentId": "kra89iAxAdqQkMZ5z", "user": {"username": "ben.smith"}}, {"_id": "A4dgqKwjT7EdSCGe8", "postedAt": "2022-12-21T18:15:48.726Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your questions, Ramiro!</p><blockquote><p>I'd expect that interventions on reducing miscarriages to be probably more tractable and scalable, and way less costly - so more effective than reducing intentional abortions.</p></blockquote><p>That may well be true. I'll confess on being quite ignorant on the subject. Jeff Kaufman gave a great <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=vGb4xMpCWtCW2iqSu\">laundry list</a> of interventions in that regard, and I think analyzing their effectiveness is worth taking a poke at.</p><blockquote><p>perhaps there's a way to rephrase and clarify the disclaimer to account for this; e g., you're less concerned about abortion as a cause area and more about a moral constraint regarding projects - i.e., just like we shouldn't fund projects leading to work abuse, we shouldn't fund projects leading to abortion</p></blockquote><p>This is a very fair point. There's been a bunch of very understandable discussion of how I shoehorn certain interventions to fit a very tight mold - \"voluntary abortion reduction\" - when there are either broader/less divisive lessons to take from this, and/or the lesson isn't even wide enough. In retrospect, there was much I could have arranged/emphasized differently in this post. My <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=RkWQ3H5ttjuKJenYk#Y8dwEcSSxHjpXZj2E\">reply </a>to Julia's similar concern here is the best clarification I've been able to give on what I was actually trying to say.</p><blockquote><p>is there a particular moral difference between preventing a (statistically predictable) spontaneous abortion and preventing an intentional one, per se?</p></blockquote><p>If in both cases, the outcome is one more child being born and living a happy life than otherwise, then I don't see a moral difference.</p><blockquote><p>there's another Scourge unmet by the appendix: discarded frozen embryos</p></blockquote><p>There it is! I actually think this is a pretty compelling pro-embryo-abortion objection in the deontological case. However, in my personal opinion, abortion is morally wrong specifically because it prevents a child from being born and living a happy life. If we had some process through which we could thaw out frozen embryos, place them in artificial wombs, and give them happy lives, then I would agree that destroying a frozen embryo when the counterfactual is putting them through this process and having one more happy person would be morally wrong. However, we seem to be well off from doing that. To needlessly speculate, I think it's much more likely aligned AGI teaches us to simulate arbitrarily happy people before we ever get to that point. In that case, I would even argue that diverting computational power from the AGI such that it loses the ability to simulate one person would be morally wrong the same way. I basically see all of these cases as just other ways to add (or not add) one more happy person.</p>", "parentCommentId": "XsarSqBbgWzhtiKNr", "user": {"username": "Ariel Simnegar"}}, {"_id": "jRi4bCffNYyy9AB2H", "postedAt": "2022-12-21T18:16:57.585Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I replied to Ramiro <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=A4dgqKwjT7EdSCGe8\">here </a>if you'd like to read the elaboration, but my answer is no :)</p>", "parentCommentId": "g4m85iExCL3AzAJMR", "user": {"username": "Ariel Simnegar"}}, {"_id": "t7QqFCefyr5mxJYbg", "postedAt": "2022-12-21T18:34:09.956Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>(Edited to add: I'm speaking only in a personal capacity here, and not on behalf of my employer.)</p><p>If you try to account broadly for indirect effects and externalities, it's not clear you've arrived at the right stance on abortion and population reduction. There are many effects to consider:</p><ol><li>Withdrawing support for (or actively opposing) abortion and the reasoning here to do so could have impacts on norms/values around exploitation and treating others like mere means (or allowing them to be treated like mere means), like Richard suggests, so (EDIT) to make explicit, have other negative effects for women and girls (or others) in the near term. Norms more permissive of exploitation and treating others like mere means may make us more prone to conflict and less cooperative in general, and so more prone to catastrophic conflicts and missing opportunities for positive sum trades. Values in general via value lock-in and such effects on conflict and cooperation in particular could even have far-future effects.</li><li>Abortion and population reduction (for humans) could go either way for nonhuman animals. I'd guess they're good for farmed animals by reducing animal farming and because I think farmed animals mostly have bad lives (even on symmetric ethical views, although my views are suffering-focused), and the sign for wild animals (whose populations would plausibly increase) will depend on your expectations about their average welfare. I'd guess this would be limited to impacts on Earth, but humans might colonize space themselves and bring nonhuman animals with them, and more humans colonizing space could mean more nonhuman animals brought with them.</li><li>Abortion and population reduction could mitigate climate change, which may have near-term effects on humans and nonhuman animals, as well as far-future effects.</li><li>Moral circle expansion towards fetuses could transfer to MCE for other (far future) minds with limited cognitive capacities or agency, or otherwise in situations similar to fetuses.</li><li>Economic and technological effects from increased population or reducing costs on children (in time or money), which could possibly even compound into the far future.</li></ol><p>&nbsp;</p><p>There are a few broad practical responses to all of this that I can think of:</p><ol><li>Try harder to quantify and compare these effects (EDIT: in some cases, rough bounds can be useful enough), and try to ensure you're capturing a relatively unbiased subset of indirect effects, and especially the largest ones. Use this information to<ol><li>come to an overall stance on specific interventions and support them accordingly, and/or&nbsp;</li><li><a href=\"https://forum.effectivealtruism.org/posts/Mig4y9Duu6pzuw3H4/hedging-against-deep-and-moral-uncertainty\">hedge with a portfolio of interventions</a> or do some other kind of worldview diversification/portfolio approach.</li></ol></li><li>Cluelessness, and look for interventions that are more robustly positive to support and promote instead. This would also mean withdrawing support for human life-saving interventions (except possibly those that reduce existential risk overall, possibly). Possibly <i>promote the withdrawal of support</i> for abortion-affecting and human population-affecting interventions, including family planning interventions, interventions that incentivize people to have more children, life-saving interventions, and abortion reduction interventions.</li></ol>", "parentCommentId": "Fek5GYJTPxgLFukut", "user": {"username": "MichaelStJules"}}, {"_id": "FBZsMkx4ZXhnfMNXh", "postedAt": "2022-12-21T18:56:27.630Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>There's no prima facie harm from contraception.&nbsp;</p></blockquote><p>Sorry, I think we may have been talking past each other. I was referring to abortion, which presumably you would agree does have a <i>prima facie</i> harm, and hence is comparable to the steakhouse situation.</p>", "parentCommentId": "Bt3emdwjeJFz6X27T", "user": {"username": "Larks"}}, {"_id": "eKM638pm8fuBk7KLk", "postedAt": "2022-12-21T19:26:00.439Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi Michael, great to hear from you!</p><ol><li>Yes, that's absolutely a relevant consideration. I think there are similar considerations regarding the effect of <i>supporting </i>abortion on the permissiveness of bad societal norms:<ol><li>The dehumanization of those outside one's moral circle (\"it's just a clump of cells/parasite\", \"it's just a beast\", \"they won't even exist for millions of years\")</li><li>The callous treatment of moral patients whose existence is inconvenient (\"it's my body; I'll do whatever I want with that fetus\", \"who cares? meat tastes good\")</li><li>The masking of disenfranchisement of unrecognized moral patients as \"rights\" of recognized moral patients (\"reproductive rights\", \"the right to eat whatever I want\")</li></ol></li><li>Yes, animal welfare considerations likely weigh in favor of abortion. I'd go even further than your statement and say they plausibly dominate the welfare concerns of both the woman and the fetus. Of course, this consideration plausibly dominates the purpose of many human-centric interventions, and the implications are scary. (That doesn't mean I won't think them through, but there's only so fast I can overturn my worldview!) I know you have strong opinions on this, and would love to get any recommendations on reads you think would be enlightening on the subject.</li><li>Yep! That should also weigh in favor of abortion, though I personally think other concerns substantially dominate it.</li><li>100%</li><li>Yes. I could be persuaded either way on the sign of this consideration, because abortion does increase economic output per capita, but having more people should increase gross economic output on the margin.</li></ol><p>On your responses:</p><ol><li>Very cool! I wasn't aware of research on this, and it makes perfect sense, including avoiding \"sector risk\" (e.g. a portfolio of human-centered interventions could be totally dominated by farmed animal welfare considerations).</li><li>I'm still making up my mind on the implications of cluelessness, but I agree that it updates towards not taking much concrete action on abortion as an EA cause area.</li></ol>", "parentCommentId": "t7QqFCefyr5mxJYbg", "user": {"username": "Ariel Simnegar"}}, {"_id": "LBJpPqHKupcmFstHC", "postedAt": "2022-12-21T22:22:57.856Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks! Happy to see real-time updates on the internet.</p><p>I did see Calum's papers - I didn't reply because I didn't have time to meaningfully engage with all those sources, and it looked like others replied first. There were some info that surprised me, but on a very brief skim, I don't know if those sources actually bring me to the conclusion of:</p><blockquote><p>Moreover, the unmet need for contraception in developing countries is also pretty low, and the proportion of this which is due to lack of access is very small - so the number of women not using contraception because they lack access to it is pretty miniscule.</p></blockquote><p>RE: harm vs benefit tradeoff, I agree that this is basically irrelevant in terms of whether this is voluntary or not, though it is relevant in terms of deciding whether or not I should accept the suggestion at face value.</p><blockquote><p>To close (as frankly, there's only so much brainpower I'm willing to extend on this semantic consideration), I maintain that the interventions I suggest would be the right thing to do.&nbsp;</p></blockquote><p>Makes sense RE: capacity. Yeah, I'm not engaging with whether this is the right thing to do, all things considered - you could make a case for example that money spent on these charities could plausibly be better spent elsewhere, though to be clear, I would personally find it pretty aversive to justify this <strong>primarily because we wanted higher rates of unwanted pregnancies to increase population size. </strong>I'm mainly suggesting that even if you think this is the right thing to do, it shouldn't be considered \"voluntary abortion reduction\" for the reasons I illustrate above.</p><p>RE: your response to Julia's, I'll add a quick comment in that thread.</p>", "parentCommentId": "EWSMnwywByiJKjKE7", "user": {"username": "bruce"}}, {"_id": "Afiwooar7hupLBaPP", "postedAt": "2022-12-21T22:40:43.262Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your thorough and clear writeup!</p>", "parentCommentId": "FAGCojKzrTCs8fEnE", "user": {"username": "Ariel Simnegar"}}, {"_id": "wWF6ztPATu98dReFc", "postedAt": "2022-12-21T23:12:07.461Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>On animal effects, I would recommend:</p><ol><li>For farmed animal and wild animal effects and population sizes, with some emphasis on those related to human diets:<ol><li>Many essays in <a href=\"https://reducing-suffering.org/#animals\">https://reducing-suffering.org/#animals</a> (although note that these are primarily from a suffering-focused and basically negative utilitarian perspective)<ol><li>Maybe especially <a href=\"https://reducing-suffering.org/#humanitys_impact\">https://reducing-suffering.org/#humanitys_impact</a> , <a href=\"https://reducing-suffering.org/vegetarianism-and-wild-animals/\">https://reducing-suffering.org/vegetarianism-and-wild-animals/</a>, <a href=\"https://reducing-suffering.org/trophic-cascades-caused-fishing/\">https://reducing-suffering.org/trophic-cascades-caused-fishing/</a> (and others in <a href=\"https://reducing-suffering.org/#fishing\">https://reducing-suffering.org/#fishing</a> ) and <a href=\"https://reducing-suffering.org/how-many-wild-animals-are-there/\">https://reducing-suffering.org/how-many-wild-animals-are-there/</a></li></ol></li><li><a href=\"http://reflectivedisequilibrium.blogspot.com/2013/07/vegan-advocacy-and-pessimism-about-wild.html\">http://reflectivedisequilibrium.blogspot.com/2013/07/vegan-advocacy-and-pessimism-about-wild.html</a></li><li><a href=\"https://docs.google.com/document/d/1wMIa6bAn4rfCAzBAsKlHBH9X3gmo8pjn/edit\">https://docs.google.com/document/d/1wMIa6bAn4rfCAzBAsKlHBH9X3gmo8pjn/edit</a> from <a href=\"https://www.invinciblewellbeing.com/research\">https://www.invinciblewellbeing.com/research</a></li><li>Various posts at <a href=\"https://forum.effectivealtruism.org/topics/meat-eater-problem\">https://forum.effectivealtruism.org/topics/meat-eater-problem</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/SvbZtETGenTkZni8C/where-does-most-of-the-suffering-from-eating-meat-come-from\">https://forum.effectivealtruism.org/posts/SvbZtETGenTkZni8C/where-does-most-of-the-suffering-from-eating-meat-come-from</a></li><li>I think the human impacts on wild animals are primarily through agricultural land use, fishing and climate change, and most of these are largely affected by human diets (although climate change possibly dominated by fossil fuel use). Maybe also environmental pollutants/contaminants/toxins and forestry (I haven't really looked into these). I'd guess the effects from the land humans take up in cities, towns, villages, etc., is not significant compared to these, based on <a href=\"https://ourworldindata.org/land-use#half-of-the-world-s-habitable-land-is-used-for-agriculture\">Our World in Data</a>.</li></ol></li><li>For moral weights across animals (including humans):<ol><li><a href=\"https://reducing-suffering.org/two-envelopes-problem-for-brain-size-and-moral-uncertainty/\">https://reducing-suffering.org/two-envelopes-problem-for-brain-size-and-moral-uncertainty/</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/848SgRAKpjbuBWkW7/why-might-one-value-animals-far-less-than-humans\">https://forum.effectivealtruism.org/posts/848SgRAKpjbuBWkW7/why-might-one-value-animals-far-less-than-humans</a></li><li><a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw\">RP's moral weight sequence</a> (disclaimer: I work at RP, but am not speaking for them here), some posts are still coming out.</li><li><a href=\"https://reducing-suffering.org/is-brain-size-morally-relevant/\">https://reducing-suffering.org/is-brain-size-morally-relevant/</a></li><li><a href=\"https://www.lesswrong.com/posts/2jTQTxYNwo6zb3Kyp/preliminary-thoughts-on-moral-weight\">https://www.lesswrong.com/posts/2jTQTxYNwo6zb3Kyp/preliminary-thoughts-on-moral-weight</a></li><li>I don't know if the above covers all the strongest arguments for humans mattering substantially more than nonhuman animals, and I'd guess it doesn't cover many such arguments in much detail. I don't know off the top of my head what to recommend.</li></ol></li></ol>", "parentCommentId": "eKM638pm8fuBk7KLk", "user": {"username": "MichaelStJules"}}, {"_id": "TJuexkffhpSQzN9Pi", "postedAt": "2022-12-22T00:09:36.796Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Yes, that's right -- thanks for clarifying. (For context, note that upthread Ariel wrote: \"If abortion were wrong <i>only</i> because embryos could have personhood, then you'd be absolutely correct that we should donate <i>more</i> to family planning charities which reduce the number of abortions rather than less. However...\" &nbsp;So our dispute was about whether <i>preventing</i> &nbsp;unwanted pregnancies should count as a \"possible negative externality\".)</p>", "parentCommentId": "FBZsMkx4ZXhnfMNXh", "user": {"username": "RYC"}}, {"_id": "AFMEKpF7FJCwgiFCm", "postedAt": "2022-12-22T00:27:11.358Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Also, another possible response is 3. ignoring indirect effects, but this seems pretty unprincipled/unjustified and prone to systematic error to me. Ignoring <i>cross-worldview</i> or <i>cross-cause</i> indirect effects may be okay as an approximation to the portfolio approach if it's done within a portfolio of interventions across causes/worldviews, because it's plausible negative indirect effects can be made up for through more targeted/leveraged interventions for those causes/worldviews in the portfolios.</p><p>However, when I think of the current total EA portfolio of interventions, I think it's pretty plausible we aren't making up for possibly negative wild animal effects because agricultural land use is huge and fishing has huge population effects, and (although I'm much less informed on the issue) I also worry about s-risks being increased.</p>", "parentCommentId": "t7QqFCefyr5mxJYbg", "user": {"username": "MichaelStJules"}}, {"_id": "hoLbuNio6gn5GvqeE", "postedAt": "2022-12-22T04:46:14.643Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>This is a very detailed and fairly well thought out post, an I think it's a very important discussion to have as EA and longtermism in particular leans further towards policy as a goal. However, I strongly disagree with the argument and the framing of the conclusions, even as I agree with a number of the policy suggestions.</p><p>While I am a strong proponent of abortion being freely and easily accessible to people who want to have an abortion, I'm also very strongly in favor of people who don't want to have one being able to access the resources and social security nets that would allow them to carry their pregnancies to term and either raise or give their children up for adoption, which seems to be a large part of what you're suggesting. However, I don't think the reduction of abortion is a useful or productive framing for these kinds of policies or interventions.&nbsp;</p><ul><li>Goals obviously shape policies and interventions. If the goal of a policy is to reduce abortion rather than raise the quality of life for pregnant people, families and their children regardless of potentially averted abortions, this creates perverse incentives to form policies that are only focused on the pre-natal or immediately post-natal portions of the life cycle. This post outlines some suggestions for more encompassing policies, like daycare or family tax credits, but I believe that these policies should not be closely tied to a goal of reducing abortion in order to avoid these perverse incentives and distortion down the line, and that abortion reduction should at best be seen as a tertiary goal or byproduct.&nbsp;</li></ul><blockquote><p>Instead of spotlighting family planning, we should shift our family-focused interventions to spotlight mothers' physical and mental health, and support adoption as an option.</p></blockquote><ul><li>I whole heartedly believe that supporting and facilitating adoption is an important and very valuable goal, but I don't think it acts as a replacement to family planning. Family planning and access to abortion and conctraceptives are interventions that serve a different purpose than adoption services. Ideally, they allow families and individuals to make informed and well considered choices about their future and goals, which can and should be include access to abortion and conctraceptives if one does not want to be pregnant or carry a child to term. Even if adoption is easy and unstigmatized, being pregnant and giving birth can cause long-term (and sometimes catastrophic) physical and mental health effects and significant disruptions to the career of pregnant people, even in developed nations with excellent health care and social security systems in place. Being able to avoid this is an important mechanism for empowering people, including in being the best parents they can be when they choose to have children, and this should not be minimized or written off.&nbsp;</li></ul><blockquote><p>we should suspend our support for charities which decrease the amount of near-term future people, until we can systematically review the effect of the above moral considerations on the morality of the charities' interventions</p></blockquote><ul><li>The extension of longtermist thinking to abortion in this way is one reason I've never felt comfortable with longtermism as a prevalent moral framework without a strong countervailing focus on the rights of already existing people. Interventions offering access to abortion and family planning play an important role in ensuring the <i>right </i>to bodily autonomy and self-determination, particularly in places where these services are not offered otherwise. While you can argue that people should be choosing to not exercise their right, arguing for the suspension of support for charities that offer these services comes off to me as implicitly arguing for a decrease in access to the tools that allow for the realization of these rights. While I'm not arguing that EAs or charities should be tasked with undergirding rights, I do think that this is an important thing to consider. I personally think that the natural conclusion to this line of argument in the abstract is that longtermists should be anti-abortion, which is something that blurs the line between reduction of \"voluntary\" abortion and abortion altogether, but I realize that there are different ways to interpret it and don't at all mean to say this is what you're arguing for.&nbsp;</li><li>This consideration is also important for the discussion around personal autonomy. The post argues:</li></ul><blockquote><p>The consequentialists among us would say that it would be morally wrong for us to&nbsp;<i>not</i> help our fellow people in poverty, even if helping them reduces our personal autonomy by preventing us from enjoying some of the amenities of the wealthy countries we typically reside in.</p></blockquote><ul><li>I don't understand this conceptualization of personal autonomy. Choosing to donate your income instead of spending it is an exercise of personal autonomy, not a diminishment of it. In the same way, choosing to have a child or to have an abortion is an exercise of personal autonomy. Both interventions that increase people's access to abortion and contraceptives and their access to infrastructure and resources that allow for them to carry pregnancies to term and then raise or put children up for adoption <i>increase </i>and allow for the exercise of personal autonomy. The point at which personal autonomy becomes an important consideration is when access to resources that allow for either choice is cut off, either by defunding these services or making them illegal or harder to access. Concerns about personal autonomy should not (and do not) &nbsp;preclude interventions providing support to people who need resources to have a safe, healthy and happy pregnancy and recovery, but they do preclude interventions that would make access to contraceptives or abortions harder.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "tugbazsen"}}, {"_id": "BTsPAL3HcCFDTDxF8", "postedAt": "2022-12-22T05:26:15.482Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Brief comments here, on request of the OP. Low confidence - these are just quick thoughts that came to mind / not well considered.</p><ol><li>I agree with Julia RE: giving the impression of shifting goalposts. (I think this is possibly exacerbated by the semantic debate). I think the pushback by commentors is in part because of object-level disagreements, but also in part because of some lack of clarity around what your justifications for claims and suggestions are.</li><li>I think it's worth being mindful of motivated reasoning here - I'm not suggesting this is the case, but it would be important for yourself to know how you might meaningfully distinguish to an outsider who has less understanding of the true reasons for your justifications. One thing that might help (alongside Julia's suggestion above), is to figure out what would need to be true / assumed for your preferred conclusions to be false / for you to meaningfully update against it and be upfront about the key assumptions and cruxes that underpin your views. (Fwiw, someone pointed me to this post with a comment along the lines of \"this reads like someone who already supports defunding abortion for other reasons who is trying to justify it on longtermist grounds.\" n=1 on this specific claim though)</li><li>If you think the most important points are 3 / 4a, I think the title doesn't accurately reflect this, since the main claim based on your suggestions listed here sounds more like \"effects on population sizes of neartermist interventions may be underrated in cause prioritisation\".</li><li>I don't think it's wrong to bring up abortion, and I think it may be a relevant consideration, though I think the case for abortion reduction in this post is weakened by the disclaimer and idea that this post is about voluntary abortion reduction (i.e. if your personal views in 3 and 4a leads to a position that abortion is wrong on consequentialist grounds irrespective of whether this is voluntary, then it would be more accurate to state this clearly. If you prefer not to talk about non-voluntary abortion reduction for any other reason, then you should focus on interventions that support higher fertility rates without interacting with the subset of women who don't wish to have children. I could be wrong, but I don't think you've made a compelling case that interventions on this subset should be considered \"voluntary abortion reduction\". (Linking this <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=iQyyBo4JKhaDoGyon#:~:text=Hypothetical%20analogy%3A%20suppose,funding%20options%20available).\">comment thread </a>here as context for other readers / for others to decide).</li><li>Accordingly, I disagree that the semantic debate is distracting you from what you were trying to say. I think it is acting to <strong>clarify </strong>what you are trying to say. As stated, neither 3 nor 4 as written actually exclude non-voluntary abortion reduction, (if anything, they may be interpreted that nonvoluntary abortion reduction is justified or preferable, due to the \"lives saved\" as a result). But clearly the extent to which you believe nonvoluntary abortion reduction is morally preferable (and why), and the extent to which readers agree with this line of reasoning are relevant considerations when taking into account your recommendations. For example, if you suggest \"we should put more $ into AMF\" and \"we should suspend funding for family planning services\" primarily for population growth arguments, then people who think involuntary abortion reduction is worth the harms might agree with both claims, but people who only agree with voluntary abortion reduction might plausibly accept the first claim but not the second.&nbsp;</li><li>I generally feel good about edits on the post that suggest any meaningful updates or are clarifying some misunderstandings etc</li><li>I think the value of a new post would depend on the content of the post itself, so find this hard to comment on.</li></ol><p>Hope this is useful, can't promise further engagement though!</p>", "parentCommentId": "RkWQ3H5ttjuKJenYk", "user": {"username": "bruce"}}, {"_id": "Hzyby4hTHTqgpkqtE", "postedAt": "2022-12-22T06:23:12.119Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>I think it's worth being mindful of motivated reasoning here - I'm not suggesting this is the case, but it would be important for yourself to know how you might meaningfully distinguish to an outsider who has less understanding of the true reasons for your justifications. One thing that might help (alongside Julia's suggestion above), is to figure out what would need to be true / assumed for your preferred conclusions to be false / for you to meaningfully update against it and be upfront about the key assumptions and cruxes that underpin your views. (Fwiw, someone pointed me to this post with a comment along the lines of \"this reads like someone who already supports defunding abortion for other reasons who is trying to justify it on longtermist grounds.\" n=1 on this specific claim though)</p></blockquote><p>For what it's worth, this does read to me as at least somewhat motivated reasoning - I was more charitable when reading the post and figured it might be because of some confused argumentation or somethings being not expressed as well as they could have been, but reading the comments (particularly the one you're responding to me) makes me lean more towards motivated reasoning clouding the reasoning and expression of ideas.</p><p><br>&nbsp;</p>", "parentCommentId": "BTsPAL3HcCFDTDxF8", "user": {"username": "tugbazsen"}}, {"_id": "otnii54dJd5fgu7SH", "postedAt": "2022-12-22T06:37:37.790Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Ah, so your perspective is not about increasing the number of future people but fighting for rights for people who you would say already exist. Just to be clear: you would support interventions that reduced unintended pregnancy before conception, such as long-acting contraceptives? The OP seems unsure on this point.</p>\n", "parentCommentId": "eCGBPnmBFiocrB4K3", "user": {"username": "ruthgrace"}}, {"_id": "iLGipTeD8uyopN7ZK", "postedAt": "2022-12-22T11:41:26.577Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>While those against abortion have many resources in the US, I don't think that's true in much of the rest of the world. Maybe some parts of Latin America would be another exception, but outside the US the anti-abortion movement is pretty severely underfunded. So I think there is a lot of room for improvement (from an anti-abortion perspective) there.</p><p>Regarding adoption, it seems to me that voluntary abortion reduction is not likely to increase the number of people placed for adoption by very much. Even with involuntary abortion denial, the best research we have seems to indicate that most women denied abortions go on to raise the child themselves rather than placing it for adoption. I would guess that this would be even more so if they are voluntarily choosing to continue the pregnancy. Most of these children have perfectly reasonable mental health outcomes. So it seems implausible that this would significantly counterbalance or outweigh the value of the extra lives preserved by voluntary abortion reduction interventions.</p>", "parentCommentId": "jFvm25eEbhvwjgr8o", "user": {"username": "Calum Miller"}}, {"_id": "3GY9kx9ZmkH3wQSWX", "postedAt": "2022-12-22T11:51:19.295Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Yes - I don't want to speak for Ariel, but my sense is that we have pretty different perspectives on why abortion is bad. I have a fairly traditional pro-life position unrelated to population ethics or utilitarian considerations. I generally think children are a good thing for various reasons, but I'm not into maximising population for population ethics reasons or anything like that.</p><p>Even for LARCs I'm pretty sceptical that their promotion significantly reduces abortions except in exceptional circumstances (e.g. former soviet states where abortion was used as birth control). But I would support other interventions which, for example, hardcore pronatalists might well oppose (e.g. education encouraging delay of sexual debut, discouragement of multiple sexual partners, bans on surrogacy, etc.).</p>", "parentCommentId": "otnii54dJd5fgu7SH", "user": {"username": "Calum Miller"}}, {"_id": "huGoqw6uGofHH6ha7", "postedAt": "2022-12-22T14:56:19.093Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Hi, thanks for your thoughtful comment! You bring up some great points which hadn't been raised yet.</p><blockquote><p>This post outlines some suggestions for more encompassing policies, like daycare or family tax credits, but I believe that these policies should not be closely tied to a goal of reducing abortion in order to avoid these perverse incentives and distortion down the line, and that abortion reduction should at best be seen as a tertiary goal or byproduct.&nbsp;</p></blockquote><p>I've updated from \"neutral\" to \"agree\" with this over the conversation. While reducing abortion has emotional significance for me, it was an awful framing of my post's policy proposals. I can imagine that even the suggestion of diverting funding from charities which reduce the amount of near-term future people to charities which accomplish similar object-level goals without that externality would have been met far more charitably without the priming on \"voluntary abortion reduction\" as a goal.</p><blockquote><p>I don't think it acts as a replacement to family planning.</p></blockquote><p>Good points here which offer some idiosyncratic benefits of family planning which are difficult to impossible to adequately replace with other interventions.</p><blockquote><p>I personally think that the natural conclusion to this line of argument in the abstract is that longtermists should be anti-abortion, which is something that blurs the line between reduction of \"voluntary\" abortion and abortion altogether, but I realize that there are different ways to interpret it and don't at all mean to say this is what you're arguing for.&nbsp;</p></blockquote><p>Yes, this is also the conclusion I reach from the post. Interestingly, it seems that we don't actually disagree on the object-level implications of philosophical views, but just have different philosophical views. For example, it seems that my weighting of longtermism versus the deontological considerations you outlined lean more towards longtermism than your weighting, which explains our object-level disagreement quite well.</p><blockquote><p>Concerns about personal autonomy should not (and do not) &nbsp;preclude interventions providing support to people who need resources to have a safe, healthy and happy pregnancy and recovery, but they do preclude interventions that would make access to contraceptives or abortions harder.&nbsp;</p></blockquote><p>Yep, this is a good argument, and you've convinced me that my choice of section title \"Personal Autonomy Shouldn't Preclude Intervention\" incorrectly claims that the section's argument shows more than it actually shows. The section's argument only shows that EAs should be sympathetic to the idea that we have a moral duty to exercise our personal autonomy in a particular way, but not that this (in and of itself) justifies the interventions I later argued for.</p><p>How about I change the section title to \"Exercising Personal Autonomy to Help Others\"?</p>", "parentCommentId": "hoLbuNio6gn5GvqeE", "user": {"username": "Ariel Simnegar"}}, {"_id": "pfJzbuGbWzs4tpY7e", "postedAt": "2022-12-22T15:19:40.433Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks, this helps me understand your views better.<br><br>Yes, perhaps linking to this outline in the post would help address confusion.</p>", "parentCommentId": "RkWQ3H5ttjuKJenYk", "user": {"username": "Julia_Wise"}}, {"_id": "BTucaZtL3sWwohghq", "postedAt": "2022-12-22T16:15:02.298Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks so much for all of your effort and engagement, Bruce! This has been extremely helpful. I'll include an \"updates\" edit with the following:</p><ul><li>On the lack of clarity: Link to my <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=RkWQ3H5ttjuKJenYk\">reply </a>to Julia which is a more accurate summary of what I was trying to say, including the far-better-specified main claim of \"effects on population sizes of neartermist interventions may be underrated in cause prioritisation.\"</li><li>On the definition of voluntary: Be clear that the defunding intervention <i>wouldn't </i>satisfy some reasonable definitions of voluntary, and link to the <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=iQyyBo4JKhaDoGyon#:~:text=Hypothetical%20analogy%3A%20suppose,funding%20options%20available).\">comment thread</a> discussing that.</li><li>With your permission, crediting you as a particularly helpful person for realizing these updates.</li></ul><blockquote><p>the pushback by commentors is in part because of object-level disagreements...the case for abortion reduction in this post is weakened by the disclaimer and idea that this post is about voluntary abortion reduction (i.e. if your personal views in 3 and 4a leads to a position that abortion is wrong on consequentialist grounds irrespective of whether this is voluntary, then it would be more accurate to state this clearly...neither 3 nor 4 as written actually exclude non-voluntary abortion reduction, (if anything, they may be interpreted that nonvoluntary abortion reduction is justified or preferable, due to the \"lives saved\" as a result)</p></blockquote><p>When I passed around drafts of this post, the overwhelming feedback I received was that people would be completely unreceptive to and unwilling to engage with even the slightest suggestion of involuntary abortion reduction. The impression I received from the feedback was that in publishing this post, I would be like a hardcore vegan entering a KFC with a megaphone.</p><p>There's a Venn diagram of policies regarding animal suffering endorsed by hardcore vegans versus by KFC patrons. The shared part of the Venn diagram includes policies like convincing people to voluntarily go vegan, and on the edge of the shared part, there might be the proposal of suspending subsidies for KFC because there's a chance that animal suffering actually matters. The hardcore vegan tries to identify some aspect of the shared part of the Venn diagram to restrict their speech and the ensuing conversation's scope to, so that the KFC patrons will actually take seriously and engage with what they have to say. They settle on \"voluntary animal suffering reduction,\" and make that the headline of their speech.</p><p>Then patrons point out that suspending subsidies for KFC could cause some KFCs to shut down, so people who live in communities where those KFCs shut down won't be able to access their sweet, sweet fried chicken. Therefore, the patrons argue, the hardcore vegan's proposal constitutes <i>involuntary</i> animal suffering reduction, because <i>those</i> people didn't voluntarily choose to go vegan. Now the hardcore vegan is in a bind, because on the one hand, suspending KFC subsidies seems to them like obviously the morally right thing to do. On the other hand, they're the one who chose to restrict the conversation to \"voluntary animal suffering reduction,\" and there's a reasonable argument that suspending KFC subsidies would indeed constitute <i>involuntary </i>animal suffering reduction. So they can either drop the \"voluntary\" part, and be socially ostracized and have everything they have to say duly ignored, or they can enter the semantic debate about which definitions of \"voluntary\" their proposed intervention might fall under.</p><p>The hardcore vegan, having been passionate about animal suffering for years, chooses the latter, in spite of it being pretty motivated reasoning in retrospect. Bruce, a kindly and patient KFC patron, pulls the vegan aside and convinces them that their reasoning was motivated, and here we are.</p><blockquote><p>clearly the extent to which you believe nonvoluntary abortion reduction is morally preferable (and why), and the extent to which readers agree with this line of reasoning are relevant considerations when taking into account your recommendations</p></blockquote><p>I'll just drop a relevant quote from Scott Alexander's <a href=\"https://slatestarcodex.com/2013/05/30/fetal-attraction-abortion-and-the-principle-of-charity/\">\"Fetal Attraction: Abortion and the Principle of Charity\"</a> and leave it at that:</p><blockquote><p>There are quite a few pro-choice people who believe that abortion is morally wrong, but that the government should not ban it. Is it that hard to believe that, given an action many people think is morally wrong but should not be banned, other people with different views on the role of government might say that since it is morally wrong it <i>should</i> be banned? In fact, isn’t the person who says “This is murder, so let’s not do it” a whole lot <i>more</i> honest than the person who says “This is murder, but I think we should continue to permit it anyway”?</p></blockquote>", "parentCommentId": "BTsPAL3HcCFDTDxF8", "user": {"username": "Ariel Simnegar"}}, {"_id": "pSR6xwev8aLCwFkey", "postedAt": "2022-12-22T18:06:59.413Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Again, I really don’t think you can draw conclusions about “effectiveness,” at least as defined as “seizing the lowest-hanging fruit,” by articulating the scale of the problem.</p>\n<p>But one other way you might find leverage is by moving the medical ethics community to include miscarriages in mortality statistics. 50% of miscarriages are due to chromosomal abnormalities and occur during the first few months of pregnancy.</p>\n<p>Right now, we have all kinds of med ethics concerns around the idea that it’s somehow unethical to give an “advantage” by genetic modification or selection of embryos. But if we viewed that embryo as a person, or a medical patient, it is consensus unethical to make medical decisions on behalf of the welfare of anyone except that patient. So you can then only consider the health of the embryo. As a happy consequence, you not only get moral grounds for embryo engineering for health, you also (from a population growth and maternal health perspective) get ~75% fewer  miscarriages if this became a common practice.</p>\n", "parentCommentId": "26q3mPCb5CThHYas3", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "Kju4ihwpikTXgZ67g", "postedAt": "2022-12-22T20:42:30.524Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Interesting points! Thanks for taking the time to respond and clarify.</p>", "parentCommentId": "vNa8KP7Deic4NFFox", "user": {"username": "Matt_Sharp"}}, {"_id": "rHSjkCTBf6kWYrLTt", "postedAt": "2022-12-22T23:17:25.833Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>That's right, and after reading about the impact of marginal people on animal suffering some more, I'm now much more unsure that adding near-term people is a good thing, purely because of the domination of animal suffering concerns. I retract my previous comment. Thanks for the update!</p>", "parentCommentId": "hiic8todPu8qxKEic", "user": {"username": "Ariel Simnegar"}}, {"_id": "s7RDsfRuJfRfwpKou", "postedAt": "2022-12-23T05:16:14.179Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>On the definition of voluntary: Be clear that the defunding intervention <i>wouldn't </i>satisfy some reasonable definitions of voluntary, and link to the <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=iQyyBo4JKhaDoGyon#:~:text=Hypothetical%20analogy%3A%20suppose,funding%20options%20available).\">comment thread</a> discussing that.</p></blockquote><p>minor, and I don't have anything against you linking the thread, but presumably if you just clearly summarise your definition and usage of voluntary that will spare readers from trying to figure it out by going through that thread.</p><p>Happy to defer to you RE: acknowledgement, I don't feel strongly either way.</p><p>I appreciate the kindly and patient statement! I don't think the KFC analogy is great<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref71wc40lcudd\"><sup><a href=\"#fn71wc40lcudd\">[1]</a></sup></span>&nbsp;but I'll run with it - clearly if the vegan is choosing to \"settle on voluntary animal suffering reduction,\", then the vegan only gets benefits of doing this to the extent that the proposed interventions are actually voluntary.</p><p>While I think much of my pushback would have not existed if you had either bit the bullet and justified claims around involuntary abortion (if these are your true views), or if you were clearer about your use of voluntary, there are clearly many more considerations than just this one point I raised, and I think the feedback you were given seems reasonable! And I don't have a strong sense of whether the EA forum is a place where people would actually incur costs like \"socially ostracized and have everything they have to say duly ignored\". But I do think this could be an important consideration and I don't want to suggest that I think you should ignore this feedback. I'm largely speaking for myself when I push back on the usage of voluntary, and I'm not suggesting that you should prefer biting the bullet over say, focussing only on the subset of voluntary (by my definition) abortion reduction.&nbsp;</p><p>It's also worth considering the reasons for the feedback RE: predicted pushback - is the expected pushback because the audience is tribal and unwilling to consider anything that isn't coming from its ingroup? Is there a significant value difference? Is it a legitimate criticism?&nbsp;</p><p>RE: motivated reasoning - just to clarify, my intention personally wasn't to convince you that your reasoning was motivated, only to suggest that it could be perceived as such.</p><p>RE: Scott's quote you linked: my guess is that the majority of people who are pro-choice do so not because they think “[abortion] is murder, but I think we should continue to permit it anyway”, but because either 1) they don't believe abortion is morally equivalent to murder or 2) even in cases where it is morally equivalent to murder, preserving the foetus's life doesn't trump other considerations (such as preserving the mother's life, e.g. in a perimortem caesarean).</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn71wc40lcudd\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref71wc40lcudd\">^</a></strong></sup></span><div class=\"footnote-content\"><p>A better analogy might be going to a subset of very poor coastal West African fishermen who are highly dependent on fish for their food / income, and telling them that it's morally wrong to eat fish. Comparing pregnant women seeking abortions to people having KFC seems like it doesn't really capture the tradeoffs going on here.</p></div></li></ol>", "parentCommentId": "BTucaZtL3sWwohghq", "user": {"username": "bruce"}}, {"_id": "sJ6L6SWSR67HGYNiK", "postedAt": "2022-12-23T06:54:37.883Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>I can imagine that even the suggestion of diverting funding from charities which reduce the amount of near-term future people to charities which accomplish similar object-level goals without that externality would have been met far more charitably without the priming on \"voluntary abortion reduction\" as a goal.</p></blockquote><p>To be fair, I don't think your post has been met uncharitably - in fact, I'd argue that the response has been extremely charitable despite the mismatch between stated goals and policy suggestions.&nbsp;</p><blockquote><p>How about I change the section title to \"Exercising Personal Autonomy to Help Others\"?</p></blockquote><p>I'm honestly quite opposed to the use of personal autonomy in this context. This is very related to the extant debates about abortion and public debates in general, where personal autonomy is broadly framed in terms of rights rather than as a synonym for \"choosing to do something\". Your section starts with \"When discussing abortion, it is crucial for us to emphasize the importance of personal autonomy\", and I think that it is at best poorly worded and misleading to use personal autonomy in that way because of the way the term is generally used and understood in public and political debate. <strong>The reason personal autonomy is important to discussions about abortion is because there are a lot of external forces, most importantly legal ones, that prevent people from exercising their personal autonomy to get an abortion. </strong>The opposite of this isn't true for choosing to have a child. There is an argument to be made that the positive social right to have a child and to have the state subsidize the care of that child in one way or another is not being met and that diminishes the capacity of individuals to have as many children as they want because they don't have the means to care them, and that this is a question of personal autonomy, but I disagree with that argument and find it a stretch at best, and in any case that argument isn't being made. In it's current form, using personal autonomy in that section reads like either a result of a poor understanding of the role of personal autonomy in debates about abortion or like a semantic maneuver the preemptively undermine objections on the ground of personal autonomy, which is particularly problematic because of suggestions to defund charities and intervention providing family planning and abortion services.</p>", "parentCommentId": "huGoqw6uGofHH6ha7", "user": {"username": "tugbazsen"}}, {"_id": "PkgJ3FYFbHcundJbA", "postedAt": "2022-12-23T08:40:34.010Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I have a million arguments against this post and maybe in the past I'd have engaged with each of your points and arguments more thoroughly but I lost my patience for these things. I'll just say this: know that this post (as well as the comments), how they are completely ignorant of the emotional and economic ramifications of unplanned pregnancies, how they completely ignore self-autonomy, are the last straw. I've been in this movement for seven years, modeled my career after it, but especially in light of recent events it made me realize I just can't keep justifying the direction it's taking. This is the tip of the iceberg of why this movement is so male-dominated. And no, I am not outraged of this because it's not 'woke' to discuss these things, or because it's taboo. These things never bothered me. It's because by adopting &nbsp;this perspective you consider to be more encompassing you're really just falling to the same pitfall as the majority of people in human history and ignoring half of us, whether we currently live or will live in the future. Signing off.</p>", "parentCommentId": null, "user": {"username": "nongiga"}}, {"_id": "XCEZwPgtyyRrtvDHJ", "postedAt": "2022-12-23T17:00:55.950Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>My understanding of your objection is that in the public discussion, personal autonomy is framed as a <strong>right</strong>, but in my post, it's framed more as <strong>the ability to make choices which affect one's personal life</strong>. You believe that the latter framing insufficiently addresses the external forces which prevent some from exercising their personal autonomy, which you view as fundamental to the discussion of personal autonomy with respect to abortion. <i>(Please let me know if anything about my characterization of your objection is incorrect, since this is the characterization I'll be responding to.)</i></p><p>I think there are two reasons why we're not seeing eye-to-eye on your objection:</p><ol><li><strong>Credence in utilitarianism versus deontology</strong>:<ul><li>I hold much higher credence in utilitarianism than deontology, so I normally wouldn't speak of a \"right\" to free speech, or a \"right\" to personal autonomy, etc. Instead, I would frame free speech and personal autonomy as important norms--the ability to choose what to say and the ability to choose what happens in one's personal life--which are instrumentally useful in realizing the utilitarian goal.</li><li>Your higher weighing of deontology seems like a factor in the greater focus you place on rights, which affects the insistence with which you believe external forces should have been addressed in the post.</li></ul></li><li><strong>Scope considerations</strong>:<ul><li>In a post on voluntary hate speech reduction, I could write a section entitled &nbsp;\"Exercising Free Speech to Help Others\" where I argue that even though free speech is a very important norm, we <i>shouldn't </i>make the choice to use our free speech to spread hate. Because the post's scope specifically concerns <i>voluntary </i>interventions, I wouldn't feel it pressing to address external forces which prevent some from exercising their free speech (hate speech laws in Europe, repression in North Korea, etc) as they're out of scope.</li><li>As for your perspective, I'm not sure whether your opinion is (a) that this post's scope should be broader or (b) that even given this post's stated scope, it's still worth it to address the external forces you brought up.</li></ul></li></ol>", "parentCommentId": "sJ6L6SWSR67HGYNiK", "user": {"username": "Ariel Simnegar"}}, {"_id": "tdcset4p9o6xDHEzS", "postedAt": "2022-12-23T18:28:38.212Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I think your comment is important, and I think your frustration is valid. &nbsp;I'm very sensitive to how EA is/can be received by non-EA folks since I've spent time in a lot of non-EA circles. Especially now that EA is in more of the public eye than it ever has been, I think there should be a real question if posts like this are worth alienating possible allies and, more broadly, contributing to an internal culture that could alienate people who can become pregnant. For probably pretty low benefit--<strong>I mean, what really are the chances that effective altruism, a largely liberal, left-of-center (i.e., pro-choice) community would broadly endorse the view that terminating a pregnancy is morally wrong? </strong>And yes, sometimes arguments should be made even if they have a low chance of being persuasive/successful, but I highly doubt this is one of those cases.&nbsp;</p><p>I think the movement for reproductive health, freedom, and autonomy has been one of the most important social movements of the last half-century. <strong>I don't think that work should be undermined because of a shiny new utilitarian argument</strong> (OK, that comment was a little snarky, but it's legitimately how I feel). EA (I think) can and should be an ally to other justice movements.&nbsp;</p>", "parentCommentId": "PkgJ3FYFbHcundJbA", "user": {"username": "GreenByrdhouse"}}, {"_id": "pQFf5ksSzr4QNCtmA", "postedAt": "2022-12-24T03:38:30.145Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>(On mobile and can't do quotes)</p>\n<p>Re: your characterization of my argument, framng personally autonomy as a right or an ability is a distinction without much difference here unless you argue that external forces that would change your right to have a child or an abortion doesn't effect your ability to have one, which is obviously untrue. If someone wants to have an abortion where it's illegal, their ability to get an abortion is seriously constrained. Of someone wants to have a child where having children is illegal, their ability to have a child is seriously constrained as well. Ignoring this is either a myopic oversight or ignorant of the way political, economic, legal and social systems impact people's choices and ability to make choices in the world. This also applies to your point on \"Credence in deontology vs. utilitarianism\" - I don't see how a utilitarian or deontological framework changes this at all.</p>\n<p>More importantly, the framing of voluntary abortion reduction means that people should choose to not do a certain thing, not they should or should be able to choose it.  This doesn't immediately clash with personal autonomy as either of us have defined it when your proposition is formed as \"people who want to have children should be able to have them\", but when you form it as \"people who are pregnant should have their children\" (which seems to me to be the actual argument of the post, based on the post and your comments) it is no longer a question of ability but of choice.</p>\n<p>The reason I find the use of personal autonomy in the post objectionable is because using a term that is central to extant debates in a way that is disconnected from and unrelated to its use in those debates implies that it is response to those arguments without actually engaging with them.  This was a bigger problem when the title was personal autonomy does not preclude intervention, but i still think the bidyif the section itself reads as disingenuous in a similar way. Debates around personal autonomy in relation to abortion are not about how one should exersize their personal autonomy, they are about whether or not pregnant people should have the right to exercise their personal autonomy. These are two different arguments and the language functions as semantic tool to separate them. Treating them as if they are the same is unproductive and incorrect,  so differentiating between them is necessary.</p>\n<p>\"where I argue that even though free speech is a very important norm, we shouldn't make the choice to use our free speech to spread hate.\"</p>\n<p>I think this comparison fails because, although personal autonomy is a very important norm, the right to personal autonomy if pregnant people is being weakened or completely stripped away in many places in the world. Additionally,  you are ostensibly making an argument in favor of personal autonomy (people should be able to have and raise ot adopt children if they want to), not against it (people should not be able to have abortions). This, to me, makes personal autonomy irrelevant to your proposal because you are arguing for a moral prescription because it is a prescription on how one should choose to act not on how they have the ability to act.</p>\n<p>\"As for your perspective, I'm not sure whether your opinion is (a) that this post's scope should be broader or (b) that even given this post's stated scope, it's still worth it to address the external forces you brought up.\"</p>\n<p>I think that arguing against abortion without bringing up these external forces and the realities of pregnancy is deeply flawed. Although you make a passing concession to the costs of pregnancy in your post, I do think that these costs are severely minimized. Being pregnant and giving birth to a child, particular particularly an unwanted one, is extremely  burdensome for women economically, socially, mentally and physically. Somewhere in a comment thread you argued that if kidneys were regenerative, EAs would be arguing that everyone should donate kidneys once a year. I think this comparison makes it clear how much these costs are being minimized; having a child once a year, even if they didn't raise the children themselves, would likely have disastrous effects for the women doing it very quickly. Likewise, arguing that personal autonomy should be using in a certain way without recognizing that many women do not have the personal autonomy to make a choice at all feels callous at best.</p>\n", "parentCommentId": "XCEZwPgtyyRrtvDHJ", "user": {"username": "tugbazsen"}}, {"_id": "nggDpknEcHGK6kab4", "postedAt": "2022-12-24T04:51:33.394Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I mean, what really are the chances that effective altruism, a largely liberal, left-of-center (i.e., pro-choice) community would broadly endorse the view that terminating a pregnancy is morally wrong?</p>\n<p>For me the problem is, without explicit countervailing frameworks prioritizing the rights and needs of already existing people baked into it, abortion is morally wrong is a direct logical extension of a longtermist view that highly values maximizing the number of people on assumption that the average existing persons life will have positive value. This is deeply disturbing to me and a reasons I've been growing increasingly distant from EA despite, like the commentor you're replying to, being involved in it for close to 8 years.</p>\n", "parentCommentId": "tdcset4p9o6xDHEzS", "user": {"username": "tugbazsen"}}, {"_id": "wW4ij7sfEobtmtETS", "postedAt": "2022-12-24T08:05:12.133Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I can only speak for myself, but while I would have disagreed with you even more if you’d lead with advocacy for involuntary abortion reduction, I’d have been more supportive of your efforts in making that argument.</p>\n<p>In the future, you might consider dealing with this challenge by making a sock puppet account. That way, you can air your views without risking social blowback. If the conversation turns out better than you expect, you can open up about your identity if you choose.</p>\n<p>I understand your hesitancy. However, I find it frustrating when I intuit that my debate partner is making the argument they think I might accept rather than the one they actually believe. Time and energy I put into arguing against them is wasted - I don’t know what your true cruxes are, and not even you truly hold the beliefs you’re putting forth in your OP.</p>\n", "parentCommentId": "BTucaZtL3sWwohghq", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "GArsHRsac9w8Snrob", "postedAt": "2022-12-24T15:49:01.402Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your advice, and for all of your value-adding comments! I genuinely apologize for making you feel that way. In hindsight, it's much easier to see where and how one's structural choices can damage the conversation, and I regret those choices all the more because of that.</p><p>On making a sock puppet account, I was always taught that \"if it's worth saying in public, you should be willing to attach your name to it.\" Perhaps that belief was too simplistic, but it's why I chose to write this under my true identity.</p><p>I do truly hold the beliefs I'm putting forth. As in the KFC analogy, I chose to focus on voluntary interventions because the feedback I received was that anything else would land on deaf ears. However, I do believe that voluntary interventions, especially broadly agreeable policies which help parents, would be a great thing to do.</p><p>Regarding crux(es), I hold total and non-person-affecting views in population ethics, and I think a child will live a life of positive value in expectation. Ignoring replaceability, I don't see the moral distinction between preventing an abortion and adding a future person who will live a life of positive value (in expectation). So even if x-risks are much more important, or animal welfare considerations completely dominate, etc, it still seems to me that preventing an abortion (ignoring replaceability) is as good as saving a human life today. Given the scale of abortion, it seems to me that if none of the abortions occurring today occurred, even with replaceability, that would still be as good as saving millions of lives, which I think dominates concerns of personal autonomy.</p>", "parentCommentId": "wW4ij7sfEobtmtETS", "user": {"username": "Ariel Simnegar"}}, {"_id": "ERePeLfsWpgBqSzcR", "postedAt": "2022-12-24T15:56:06.866Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Done on both of the concerns you raised. RE: acknowledgement, I believe people who update others should be celebrated :)</p><p>Agreed that the West African fishermen analogy would have been better than the KFC.</p><blockquote><p>is the expected pushback because the audience is tribal and unwilling to consider anything that isn't coming from its ingroup?</p></blockquote><p>As far as tribalism goes, EAs and rationalists are miles better than every other group I've ever come across, but that doesn't mean we're not immune to it, especially with deeply divisive issues such as this post's subject.</p><p>RE: Scott's quote, most pro-choice people don't think that way, but I've met many anecdotally who do. Like you said, they more commonly consider abortion to not be equivalent to murder, with the <a href=\"https://en.wikipedia.org/wiki/A_Defense_of_Abortion#The_violinist\">violinist analogy</a> as a backup in case it were equivalent.</p>", "parentCommentId": "s7RDsfRuJfRfwpKou", "user": {"username": "Ariel Simnegar"}}, {"_id": "AncRfRhJge8eQ55tG", "postedAt": "2022-12-24T16:37:26.063Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>abortion is morally wrong is a direct logical extension of a longtermist view that highly values maximizing the number of people on assumption that the average existing persons life will have positive value</p></blockquote><p>Regardless of whether we're for or against abortion, I think it's meaningful that there was no attempt to debate this assertion in the comments. Here it is stated precisely in a single sentence:</p><blockquote><p>If we have (1a) total/low critical level and (1b) non-person-affecting views in population ethics, and (2) believe that a child today will live a life above the critical level (in expectation), then (3) ignoring replaceability, preventing an abortion seems to be as good as saving a life today.</p></blockquote><p>If you find this disturbing, there are a few philosophical outs:</p><ul><li><a href=\"https://forum.effectivealtruism.org/posts/vZ4kB8gpvkfHLfz8d/critique-of-macaskill-s-is-it-good-to-make-happy-people\">Reject (1a)</a>.</li><li>Reject (1b): Richard Chappell <a href=\"https://rychappell.substack.com/p/killing-vs-failing-to-create\">does this</a>, embracing a hybrid person-affecting and non-person-affecting view.</li><li>Reject (2): Some suffering-focused utilitarians / anti-natalists would be sympathetic to this.</li><li>Accept (3), but argue that saving lives today is bad. For example, you could use the <a href=\"https://forum.effectivealtruism.org/topics/meat-eater-problem\">meat-eater problem</a>, or argue that adding a person today makes us more susceptible to the <a href=\"https://forum.effectivealtruism.org/topics/unilateralist-s-curse\">unilateralist's curse</a>, which could expose us to greater x-risks or s-risks.</li></ul><p>Although it seems that this will fall upon deaf ears, if you really find this argument compelling and think you have to choose between (a) abortion is morally wrong and (b) distancing yourself from EA, why are you choosing (b)?&nbsp;</p><p>Even if abortion is morally wrong, it seems that virtually every EA cause is more important than abortion. People in extreme poverty don't stop mattering. Neither do animals in factory farms, or people/animals/sentient AIs who may exist in the far future. Compared to the scale of these issues, abortion is comparatively small.</p><p>Partisanship and tribalism likely explain a majority of why it consumes so much of the public attention, including why <i>you and I</i> care about it so much. Instead of distancing yourself from EA, what's preventing you from advocating for more \"explicit countervailing frameworks prioritizing the rights and needs of already existing people?\" It seems that many EAs already <a href=\"https://rychappell.substack.com/p/utilitarianism-and-abortion\">agree with you</a>.</p>", "parentCommentId": "nggDpknEcHGK6kab4", "user": {"username": "Ariel Simnegar"}}, {"_id": "oL5uJGCednLBEwbB7", "postedAt": "2022-12-24T19:01:17.522Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I'll add this, now that you've confirmed your views RE: voluntary vs nonvoluntary abortion reduction (mainly referring to \"that would still be as good as saving millions of lives, which I think dominates concerns of personal autonomy\")</p><p>Taking your analogy from this <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=Fek5GYJTPxgLFukut\">comment</a>, which you use to argue against family planning despite \"the aims we want - women's health + autonomy\"</p><blockquote><p>As an analogy, many Ethiopians suffer from malnutrition. Let's say well-meaning EAs sponsored an \"EA steakhouse\" in Ethiopia, as steak can provide crucial nutrients to people in extreme poverty. There seem to be other interventions, including GAIN's Salt Iodization program, which also target malnutrition, without the possible serious negative externality of animal suffering. In that case, I think we should temporarily suspend our support for the steakhouse while we evaluate the relevant moral considerations. In the meanwhile, Ethiopians can still eat steak at non-EA steakhouses if they'd like (as other well-meaning altruists have sponsored steakhouses of their own), or acquire steak through other means—we wouldn't be reducing their ability to voluntarily eat steak if they so choose. Our goal—combating malnutrition—remains the same, but we choose the intervention to accomplish that goal without the possible negative externality.</p></blockquote><p>If I apply this same logic to your goal of increasing population size, you could plausibly say that interventions that empower women who want to have more children or reduce barriers that they face are equivalent to GAIN's salt iodisation programme, and interventions that reduce the ability for women who don't want children to have abortions are equivalent to the steakhouse? If so, shouldn't you choose the intervention to accomplish the goal of increasing population size that didn't have the negative externality?</p><p>I'm not actually endorsing using this argument generally for all cause prioritisation considerations, but just pointing out that if you're happy to use this analogy to argue against family planning, it seems like it could now be also used to argue against interventions that reduce access to abortion, if your goal is to \"increase future humans\"? So am curious about the inconsistency there and what other considerations you're taking into account.</p><p>And I guess this makes me update towards your your goal of pushing against abortion being higher than I previously had in mind. May be misinterpreting you though!</p>", "parentCommentId": "GArsHRsac9w8Snrob", "user": {"username": "bruce"}}, {"_id": "QqKwFdhfssnYKswyu", "postedAt": "2022-12-24T20:58:21.287Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>My aim is to increase the amount of happy future people. Reducing abortion is one way to do that, but I've been clear in a few comments that I would endorse other interventions over reducing abortions:</p><ul><li>\"optimizing for increasing the amount of children that families want and are able to happily have is probably better than voluntary abortion reduction as a means of increasing the amount of near-term future people\" (<a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=LvsFm8BjYnoFyEypZ\">source</a>)</li><li>\"I think voluntary abortion reduction is just one of many ways to increase the amount of near-term future people. The post's <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction#In_Our_Personal_Lives\">\"In Our Personal Lives\"</a> section includes the suggestions you gave and more, which I agree are arguably more effective than voluntary abortion reduction in accomplishing that goal.\" (<a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=rvnzS2Gwtm8rJ8ccW\">source</a>)</li></ul><p>You weren't able to see this, but I also agree-voted the following comments by others:</p><ul><li>\"the best solution here is incentivizing people to voluntarily have more children—e.g. child tax credits, maternity/paternity leave, etc\" (<a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=9DF4k5gJFKtwYCCvy\">source</a>)</li><li>\"I'd be tentatively more comfortable with measures taken to facilitate increasing the number of wanted pregnancies, including legalizing paid surrogacy services and subsidizing childcare and adoption of older children.\" (<a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=jFvm25eEbhvwjgr8o\">source</a>)</li></ul><p>Everything I wrote about prioritizing other causes over voluntary abortion reduction goes double for involuntary abortion reduction, because of personal autonomy concerns. So yes, I endorse applying the same argument here in favor of prioritizing EA intervention without a negative externality regarding personal autonomy. I don't think there's an inconsistency here, because I've made it clear that I <i>would </i>prioritize \"interventions that empower women who want to have more children or reduce barriers that they face.\"</p>", "parentCommentId": "oL5uJGCednLBEwbB7", "user": {"username": "Ariel Simnegar"}}, {"_id": "dNA6shmPP6fmixzny", "postedAt": "2022-12-24T21:22:44.096Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>Partisanship and tribalism likely explain a majority of why it consumes so much of the public attention</p></blockquote><p>My guess is that women who wish to have the option of having an abortion and not live with the stresses of feeling like they have no choice but to have a child they don't want will probably disagree that they feel strongly about it because of \"tribalism\".</p><blockquote><p>Instead of distancing yourself from EA, what's preventing you from advocating for more \"explicit countervailing frameworks prioritizing the rights and needs of already existing people?\"</p></blockquote><p>One plausible reason is that this is not something they actually want to spend their time on.</p><p>Lets say you want to spend your time in the EA community discussing whether or not abortion is morally acceptable on longtermist grounds. But in the EA community, you frequently hear discussions around whether or not [insert your ethnicity here] can actually be capable of high quality intellectual contributions, or potentially whether people like you even deserve basic human rights!</p><p>You think this is clearly wrong by any moral framework you deem acceptable, and don't particularly enjoy discussing this (because you want to focus on the more important discussion of whether abortion is morally acceptable or not), and find it surprising that so many people in this otherwise like-minded community have somehow come to a conclusion that you feel is so unintuitive and morally unacceptable, and have done so under what you believe to be the views of the community (or at least parts of it). You think to yourself, \"Maybe these people aren't as like-minded as I thought they were, maybe we don't quite share the same values.\" And when you express your dissatisfaction and desire to distance yourself, one of the people who were vocally against [your people]'s rights say, \"Well, why don't you stay in the community so you can make a case for your position and argue for it?\"</p><p>I'm not claiming <strong>at all</strong> that this is the reason for lastmistborn's distancing from the EA community, but just illustrating one plausible reason, mainly to indicate that they should have no obligation or expectation placed on them to stay, nor to argue against views they find disturbing before they choose to distance themselves (I recognise you're not explicitly doing this!). But basically the costs of engagement here are asymmetrical because it's much less (e.g. emotionally) costly for people to come up with a discussion point that is perceived to be against someone else's rights than for those who perceive to have their rights challenged to engage and justify why they think they deserve this right.</p>", "parentCommentId": "AncRfRhJge8eQ55tG", "user": {"username": "bruce"}}, {"_id": "5EMYPGmo8hzEzxna9", "postedAt": "2022-12-25T02:26:52.520Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Yes, this seems accurate. I've spent some time in liberal/left spaces &nbsp;talking about EA with folks who highly prioritize pro-choice policy in their politics (say that 5 times fast!). &nbsp;If they viewed OP's arguments as being roughly synonymous with EA as a whole (it's not, but that doesn't mean the impression couldn't exist) it would be totally understandable, I think, for them to dismiss the rest of EA. \"This community doesn't share my values,\" they might say, as bruce alludes to.</p><p>Personally, I think EA is very, very compatible with mainstream left-of-center liberalism/leftism, and, in my view, a pro-choice ethic is probably a very significant part of that. Not to say that OP's view is indefensible; it's just that I think there is a tension between their stated arguments and the broader values and politics that are the foundation of most EA's actually-existing political views.&nbsp;</p><p>Tentatively, I'm imagining there are a number of EAs who identify as longtermist <i>first</i>, and, to them, OP's argument would have some purchase. Then there's a second group who may find longtermism interesting, but they still have other commitments that they're prioritizing (liberalism, rights, leftism, social justice, global health, and so on), and they're unlikely to forsake those views in favor of a longtermist proposal that is, in a sense, pretty radical. I suspect the second group is larger than the first, but the <i>impression that the former group is central to EA</i> could lead to people viewing EA as not worth the time.&nbsp;</p>", "parentCommentId": "dNA6shmPP6fmixzny", "user": {"username": "GreenByrdhouse"}}, {"_id": "4RDWM3eyQhuEHsjeD", "postedAt": "2022-12-25T07:04:55.957Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>This pretty much hits the nail on the head, thank you for articulating it so well.</p>\n", "parentCommentId": "dNA6shmPP6fmixzny", "user": {"username": "tugbazsen"}}, {"_id": "GAA4gPDWPG55hKAeo", "postedAt": "2022-12-25T07:58:40.291Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>If you find this disturbing, there are a few philosophical outs:</p></blockquote><p>I would like to object to framing these as \"outs\": I disagree with several assumptions that aren't stated here (that possibly existing people or fetuses have equivalent moral value to currently existing people, that we have equal moral duties to safeguard the well being of both groups, that allowing a life to come into existence is equally as good as saving a life), but it isn't because I'm looking for an out from an inconvenient conclusion. I believe we have a duty to try and make the world a better place for future generations, and that we must avoid making it a worse one, but I don't consider myself a longtermist and I strongly disagree that maximising the total number of people who are happier than the critical level is a worthwhile goal, as opposed to trying to maximise the median or average happiness of a smaller number of people. These are normative disagreements, and they are why I don't find this argument compelling. Your case isn't falling on deaf ears, I understand it and I simply disagree.&nbsp;</p><blockquote><p>Partisanship and tribalism likely explain a majority of why it consumes so much of the public attention, including why <i>you and I</i> care about it so much.</p></blockquote><p>I also strongly disagree with this. I did not grow up somewhere where abortion was a hot-button or partisan issue the way it is in the US, and &nbsp;I don't believe that it's a partisan or tribal issue. This may be the case for you, but I care about this issue because a) as bruce points out below, the right to have abortions is an issue that deeply affects an enormous number of people and I would very much like them, and myself, to have option to exercise my free will and bodily autonomy on issues that have huge impacts on my life, and b) I highly value rights, particularly social and positive rights, as a moral good, and this is one among many that are vitally important.</p><blockquote><p>Instead of distancing yourself from EA, what's preventing you from advocating for more \"explicit countervailing frameworks prioritizing the rights and needs of already existing people?\"</p></blockquote><p>Again, <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=dNA6shmPP6fmixzny\">bruce's comment</a> articulates my feelings on this very well. This is not the only problem I have with EA as it currently operates, but this is a major ideological one. I want to make it clear that the problem for me isn't only \"longtermist EA might be anti-abortion\", it's how longtermist EA can be extended to reach this conclusion and the further implications of that. &nbsp;Overlooking or writing off the needs and rights of currently existing people in service of creating more future people is, overall, a stance that I find morally unacceptable and actively harmful. While I know that there are longtermist EAs who feel and think similarly, longtermist EA in general seems likely to tend towards (or in fact may actively be tending towards) this direction unless this is addressed in some way. That this issue exists in the first place is, to me, either indicative of willful oversight and disregard (which is possible and also obviously perfectly fine, if that is what longtermist EAs believe, but in my opinion morally bad), or a serious blindspot that is so enormous in size and implications that it lowers my regard of the intellectual rigor of longtermist EA. I'd also like to add that, in addition to asymmetrical costs and time issues, one reason why I'm not writing advocating for \"maybe we should care about the human rights of currently existing people, and maybe we should care about it more than creating more people in the future\" is that having to argue for caring about human rights in a social movement that is about doing the most good possible is, to me, a clear indicator that that movement is not the right place for me.</p>", "parentCommentId": "AncRfRhJge8eQ55tG", "user": {"username": "tugbazsen"}}, {"_id": "cDfie9KaS9haab7c3", "postedAt": "2022-12-25T11:26:25.278Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you for explaining how you feel. For what it's worth, is there anything I or others who believe this is an implication of longtermism can do which would help you or others who share your perspective or feelings about EA to feel more welcome?</p><p>(No need to answer if you feel like it would take asymmetric effort, or wouldn't be worth it, or for any other reason.)</p>", "parentCommentId": "GAA4gPDWPG55hKAeo", "user": {"username": "Ariel Simnegar"}}, {"_id": "r6TfrEm6ehFo7kfMG", "postedAt": "2022-12-25T11:39:55.574Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote><p>the <i>impression that the former group is central to EA</i> could lead to people viewing EA as not worth the time.</p></blockquote><p>You're completely right that EA should strive to be a big tent and alienate as few people as possible. Do you think it's possible that the impression that EA is \"very, very compatible with mainstream left-of-center liberalism/leftism\" could contribute to less than 1% of EAs identifying as politically \"right\"?</p><figure class=\"image\"><img src=\"http://res.cloudinary.com/cea/image/upload/v1667996147/mirroredImages/wtQ3XCL35uxjXpwjE/ztbzkb95h5aotyupcwd7.png\"></figure><p>(<a href=\"https://forum.effectivealtruism.org/posts/wtQ3XCL35uxjXpwjE/ea-survey-2019-series-community-demographics-and\">source</a>)</p><p>Given this information, how do you think we should prioritize between appeals to one political group which could alienate a different political group?</p><p>(Note that I'm not arguing here that this particular post <i>helps </i>avoid alienating potential EAs on net--just that there are other groups we should consider too when thinking about what EA can do to help more people feel we're compatible with their values.)</p>", "parentCommentId": "5EMYPGmo8hzEzxna9", "user": {"username": "Ariel Simnegar"}}, {"_id": "evTPE4oZcHJjuG6aN", "postedAt": "2022-12-26T16:36:31.196Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>https://www.commonwealthfund.org/publications/issue-briefs/2022/dec/us-maternal-health-divide-limited-services-worse-outcomes</p>", "parentCommentId": null, "user": {"username": "Paula Amato"}}, {"_id": "Awq5eJaetCMhmdzhA", "postedAt": "2022-12-27T01:35:15.116Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<blockquote>\n<p>abortion is morally wrong is a direct logical extension of a longtermist view that highly values maximizing the number of people on assumption that the average existing persons life will have positive value</p>\n</blockquote>\n<p>I'm a bit confused by this statement.  Is a world where people don't have access to abortion likely to have more aggregate well-being in the very long run?  Naively, it feels like the opposite to me</p>\n<p>To be clear I don't think it's worth discussing abortion at length, especially considering bruce's comment.  But I really don't think the number of people currently existing says much about well-being in the very long run (arguably negatively correlated).  And even if you wanted to increase near-term population, reducing access to abortion is a very bad way to that, with lots of negative knock-on effects.</p>\n", "parentCommentId": "nggDpknEcHGK6kab4", "user": {"username": "nonn"}}, {"_id": "ocmS45JcLHpMWPTet", "postedAt": "2022-12-27T01:41:51.420Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>One could hypothetically believe that abortion is morally wrong, but that intervening to involuntarily reduce it is either:</p><ul><li>Bad on net, because it damages the norm of personal autonomy, or</li><li>Insufficiently good on net, because there are better ways to increase the near-term population than by reducing abortion access</li></ul><p>So rejecting the implications you outlined don't necessarily mean rejecting the idea that abortion is intrinsically morally wrong.</p>", "parentCommentId": "Awq5eJaetCMhmdzhA", "user": {"username": "Ariel Simnegar"}}, {"_id": "Rn4hN3m3aP2SpPaEf", "postedAt": "2022-12-27T02:57:47.397Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I agree with everything you've said here.</p>\n<p>What I was saying is that, for the type of longtermism that assumes that the average persons life will be of positive value, and that it is morally good to maximize the total number of people to maximize total happiness, and assumes that allowing a life to come into existence is as good as saving a life, abortion seems to be morally bad, unless you argue that abortion being banned will have enough of a negative effect to outweigh all the lives that would not have existed if it were banned (which I think one could definitely argue). I say type of longtermism because there are definitely different approaches to longtermism and these assumptions are not representative of all, and I disagree with many of the assumptions here. I particularly disagree that total value or wellbeing, as opposed to aggregate as you mention in your comment, is a meaningful metric, but I realize there are different views on that.</p>\n", "parentCommentId": "Awq5eJaetCMhmdzhA", "user": {"username": "tugbazsen"}}, {"_id": "RisWHhh9HZ5MSs7Kw", "postedAt": "2022-12-27T03:40:00.533Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thank you as well, it definitely is worth something. I've been thinking about this for the past couple of days and I can't come up with a very satisfying answer, and this will likely be a bit of a digression so I apologize for that.&nbsp;</p><p>I think the short answer is perhaps not very much. (There may be others who are more imaginative than I who can come up with actual actionable things here.) The EA Forum in particular tends to value evidence based, well sourced and impartially argued posts. This is a good thing in many cases, but it does create trades offs in terms of being \"welcoming\"<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefuz1tcdbg5pq\"><sup><a href=\"#fnuz1tcdbg5pq\">[1]</a></sup></span>, and I think this is one of them: I recognize and respect that many people who oppose abortion do it from a place of believing that a fetus is a person and caring very deeply about the lives of unborn children, but the corollary to that is a reduction to the rights of bodily autonomy and self-determination of a huge number of people. It's very challenging for me personally to find the desire and follow through to sit down and spend hours putting together a post that argues for respect for my rights because, to put it simply, the idea that I need to argue that my rights and the rights of roughly half the worlds population should be valued and respected in this type of format (or at all, even) in the context of a movement that values doing good is extremely disheartening and demotivating, particularly when those rights are already being eroded across the world. I imagine that there are people who are invested enough in EA and/or longtermism that the emotional and time costs of doing that will be worth it, but I don't think I am.</p><p>Also, this is a relatively minor point and I only mention because you do seem to care about this and I in no way mean to come off as accusatory as I sincerely believe it was without malice or bad intent, but writing off people's sincerely held beliefs and priorities as a result of partisanship or tribalism or assuming that a question will fall on deaf ears does have a chilling effect, at least for me. I have done my best to engage with this post respectfully and in good faith, even when I strongly disagree with many parts of it, and these comments make me feel like my disagreements are being treated as incorrect received knowledge rather than considered and examined beliefs that are treated with respect.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnuz1tcdbg5pq\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefuz1tcdbg5pq\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I put this in quotes because it doesn't quite sit well with me, but I'm not sure what would work better - it's not that I feel that a post that is of \"lower quality\" by these standard wouldn't be welcome, necessarily, but that it would probably be met with a lot of questions and demands to have it conform more to those standards - which is, to some extent, fair enough, as every space is obviously allowed to have its own discursive norms, but it does come with costs in some cases.</p></div></li></ol>", "parentCommentId": "cDfie9KaS9haab7c3", "user": {"username": "tugbazsen"}}, {"_id": "QDtAoe4keer3rBCcN", "postedAt": "2022-12-27T14:21:58.312Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for your reply. No worries if you feel like you weren't able to come up with a satisfying answer--given that you're engaging in a dialogue where you reasonably perceive your counterpart to be going after your rights, your reaction has been very understandable.</p><p>I'd like to apologize for the characterization of your sincerely held views as tribalism. It wasn't empathetic or helpful to our dialogue.</p>", "parentCommentId": "RisWHhh9HZ5MSs7Kw", "user": {"username": "Ariel Simnegar"}}, {"_id": "n8JZqGCGLs8BRMC9v", "postedAt": "2022-12-27T21:51:17.874Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I guess I did mean aggregate in the 'total' well-being sense.  I just feel <a href=\"https://joecarlsmith.com/2021/03/14/against-neutrality-about-creating-happy-lives/\">pretty far from neutral about creating people who will live wonderful lives</a>, and also pretty strongly disagree with the belief that restricting abortion will create more total well-being in the long run (or short tbh).</p>\n<p>For total-view longtermism, I think the most important things are ~civilization is on a good trajectory, people are prudent/careful with powerful new technology,  the world is lower conflict, investments are made to improve resilience to large catastrophes, etc.  Restricting abortion seems kinda bad for several of those things, and positive for none.  So it seems like total-view longtermism, even ignoring all other reasons to think this, says abortion-restriction is bad.</p>\n<p>I guess part of this is a belief that in the long-run, the number  of morally-valuable lives &amp; total wellbeing (e.g. in a 10 million years) is very uncorrelated or anti-correlated with near-term world population.  (though I also think restricting abortion is one of the worst ways to go about increasing near-term population, even for those who do think near-term &amp; very-long-term are pretty positively correlated)</p>\n", "parentCommentId": "Rn4hN3m3aP2SpPaEf", "user": {"username": "nonn"}}, {"_id": "XzRiBjJbdkbhN6AaQ", "postedAt": "2022-12-27T22:04:46.042Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>I don't think near-term population is helpful for long-term population or wellbeing, e.g. in &gt;10,000 years from now.  More likely negative effect than positive effect imo, especially if the mechanism of trying to increase near-term population is to restrict abortion (this is not a random sample of lives!)</p>\n<p>I also think it seems bad for general civilization trajectory (partially norm-damaging, but mostly just direct effects on women &amp; children), probably bad for ability to make investments in resilience &amp; be careful with powerful new technology.   These seem like the most important effects from a longtermist perspective, so I think abortion-restriction is bad from a total-longtermist perspective.</p>\n", "parentCommentId": "ocmS45JcLHpMWPTet", "user": {"username": "nonn"}}, {"_id": "bQd5JAHHFFgyTtzA3", "postedAt": "2022-12-27T22:09:15.680Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Understandable! Would you still say, though, that abortion is <i>intrinsically</i> morally bad? (As in the above, that doesn't at all mean you have to endorse involuntary methods of reducing it.)</p>", "parentCommentId": "XzRiBjJbdkbhN6AaQ", "user": {"username": "Ariel Simnegar"}}, {"_id": "ontvyXhHpJ8i7C8Ja", "postedAt": "2022-12-27T23:37:29.850Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>No, though maybe you're using the word \"intrinsically\" differently?  For the (majority) consequentialist part of my moral portfolio:  The main intrinsic bad is suffering, and wellbeing (somewhat broader) is intrinsically good.</p>\n<p>I think any argument about creating people/etc is instrumental - will they or won't they increase wellbeing?  They can both potentially contain suffering/wellbeing themselves, and affect the world in ways that affect wellbeing/suffering now &amp; in the future.  This includes effects before they are born (e.g. on women's lives).  TBH given your above arguments, I'm confused about the focus on abortion - it seems like you should be just as opposed to people choosing not to have children, and focus on encouraging/supporting people having kids.</p>\n<p>For now, I think the ~main thing that matters is from a total-view longtermist perspective is making it through \"the technological precipice\", where risks of permanent loss of sentient life/our values is somewhat likely, so other total-view longtermist arguments flow through effects on this + influencing for good trajectory arguably.  Since abortion access seems good for civilization trajectory (women can have children when the want, don't have their lives &amp; health derailed, etc), more women involved in the development of powerful technology probably makes these fields more cautious/less rash, fewer 'unwanted children' [probably worse life outcomes], etc.  Then abortion access seems good.</p>\n<p>Maybe related: in general when maximizing, I think it's probably best to finding the most important 1-3 things, then focus on those things. (e.g. for temp of my house, focus on temp of thermostat + temp of outside + insulation quality, ignore body heat &amp; similar small things)</p>\n", "parentCommentId": "bQd5JAHHFFgyTtzA3", "user": {"username": "nonn"}}, {"_id": "rkpv3Gwdj9oyLRS8z", "postedAt": "2022-12-28T01:36:24.367Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p>Thanks for this detail! Yeah, I agree that encouraging/supporting people having kids is a more effective approach, and that other things matter more from a total longtermist perspective. (In particular, if human extinction does occur in the near term, then factory farming plausibly outweighs everything good we've ever done. Either way, we have much to catch up on.)</p><p>To be more precise on the question, do you think that with all else equal, choosing to have a child is better than choosing to abort, assuming that the child will live a net good life (in expectation)? (This is what I was trying to capture with the word \"intrinsic\"--without accounting for concerns of norms, opportunity costs, other interventions dominating, etc i.e. as a unitary yes-or-no decision.)</p><p>Your advice on optimization is definitely correct, and I have many regrets about the framing of this post, some of which I enumerate <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=RkWQ3H5ttjuKJenYk#BTsPAL3HcCFDTDxF8\">here</a>.</p>", "parentCommentId": "ontvyXhHpJ8i7C8Ja", "user": {"username": "Ariel Simnegar"}}, {"_id": "4kiYEk3QoQJK2d92P", "postedAt": "2024-02-22T22:58:32.315Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/ariel-simnegar?mention=user\">@Ariel Simnegar</a> air pollution's another significant factor in pregnancy loss:<br><a href=\"https://www.thelancet.com/journals/lanplh/article/PIIS2542-5196(20)30268-0/fulltext\">https://www.thelancet.com/journals/lanplh/article/PIIS2542-5196(20)30268-0/fulltext</a></p><blockquote><p>\"exposure contributed to 29.2% of total annual pregnancy loss in this region\"</p></blockquote>", "parentCommentId": "vGb4xMpCWtCW2iqSu", "user": {"username": "Pat Myron"}}, {"_id": "monYnfZh382mbPtoj", "postedAt": "2022-12-20T19:47:16.214Z", "postId": "6ma8rxrfYs3njyQZn", "htmlBody": null, "parentCommentId": "HBQnJkKj3PiL23GA7", "user": null}]