[{"_id": "dL7Ge9rCnrhQz6EsR", "postedAt": "2022-11-23T20:03:54.295Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Great post! Quick note: clicking on the carets takes me to that same section rather than the longer intervention descriptions under 'List of prioritized interventions'.</p>", "parentCommentId": null, "user": {"username": "Dave Canberra"}}, {"_id": "5twAgf5x37FJvfhPg", "postedAt": "2022-11-23T20:20:53.358Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Thanks for the feedback! I don’t have access to my computer right now but I’ll try to  fix that when I do.</p>\n", "parentCommentId": "dL7Ge9rCnrhQz6EsR", "user": {"username": "taoburga"}}, {"_id": "Go7qp66mMQLT4TrRd", "postedAt": "2022-11-23T21:37:30.277Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Wow! Amazing job! Thank you, I can't wait to find more time and dive into some of the resources you mentioned. &nbsp;I will certainly refer more to your post after that!</p>", "parentCommentId": null, "user": {"username": "Daniel_Polak"}}, {"_id": "BJCBuEGWkMromENf7", "postedAt": "2022-11-23T21:51:05.723Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Seems like great work, and I'll engage with it more in the future! But I wanted to push back a little on this excerpt:</p><blockquote><p>According to Tonn (2021), only two of the 100 national constitutions he analyzed included specific provisions advocating for future generations. Constitutions could also be amended to establish new institutions, like Tonn’s proposed national anticipatory institutions (NAI), the World Court of Generations (WCG), the InterGenerational Panel on Perpetual Obligations (IPPO), or others. Please refer to his aforementioned book for more information.</p></blockquote><p>You can check a paper I co-authored on <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3933683\">the constitutionalization of future generations</a> to see that 81 out of 196 constitutions (41%) explicitly mention future generations, with varied levels of legal protection. In short, one of our takeaways is that constitutions don't seem like a quite tractable way of protecting future generations, since many of these <i>de jure</i> protections don't translate into <i>de facto</i> actions – the latter seem to mostly be a product of other factors. I haven't read Tonn's work.</p>", "parentCommentId": null, "user": {"username": "renanaraujo"}}, {"_id": "BgeJiHb2DKEHXyhBW", "postedAt": "2022-11-23T22:29:56.784Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Thank you for the update! I will add this to the post as soon as I can.\nI find it very exciting that so many constitutions have included legal protections for future generations. Even if it hasn’t influenced policy yet, it could serve as a means of justifying longtermist policy once  enough momentum has built up.</p>\n<p>Edit: changes made.</p>\n", "parentCommentId": "BJCBuEGWkMromENf7", "user": {"username": "taoburga"}}, {"_id": "5Skvuk4GnjZtSbKsa", "postedAt": "2022-11-23T22:32:35.091Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>I’m glad you found it valuable!</p>\n", "parentCommentId": "Go7qp66mMQLT4TrRd", "user": {"username": "taoburga"}}, {"_id": "c4dwgKkMcGK9g7CoJ", "postedAt": "2022-11-24T05:56:34.011Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Excellent post, learned many useful techniques I did not know about!<br><br>One interrogation I have -it would seem that most of these decisions &nbsp;seek to reduce variance / promote convergence towards outcomes broadly seen as reasonable. Accordingly, they seem to be highly bureaucratic, often adding new layers of processes before any decision is made. The overriding principle seems to be to avoid any major foreseeable mistake for which the institution could be blamed.&nbsp;</p><p>However, as evidenced by the success of startups in competitive markets dominated by large actors, there are also areas in which you want to instead increase variance, action, and iniative. &nbsp; Some best practices in this space include various forms of individual empowerment and accountability (putting just one individual in charge of a particular area and tracking their performance through OKRs) and a tolerance for experimentation.</p><p>The reason this works is that, &nbsp;in practice, the <i>best</i> action you could take may not make it past a committee - especially if it involves innovation - whereas an <i>average</i>, reasonable sounding action will.&nbsp;</p><p>It is not just a question of missing out on positive opportunities, however. By only ever taking average and reasonable sounding actions, bureaucracies atrophy and lose their ability to respond to changing threats quickly and decisively enough. For years, Putin, a destructive - but nimble - actor was able to run circles around slow moving institutions like the EU and its member states by taking advantage of this weakness. Slowness in approving effective vaccines against a raging pandemic killing millions is another recent example of this.</p><p>Meanwhile, we know a culture of experimentation can arise in the public sector. This gets very Progress Studies-y and I am sure many are familiar with works such as The Entrepreneurial State by Mariana Mazzucato and so on, but there is something to this literature. &nbsp;Some of the biggest successes of the United States government in modern times have been achieved through this - the &nbsp;New Deal (\"it is common sense to take a method and try it; if it fails, try another\"), DARPA, putting humans on the moon, Operation Warp Speed...&nbsp;</p><p>This is not to say all institutions should work like this all the time. There seem to be very good reasons to build consensus and raise the threshold of evidence before certain decisions are made - perhaps when you claim to be acting on behald of the community and/or the risk of your own action (VS risk of inaction) is high.</p><p>My question rather is which types of institutions/decisions would benefit from more from a culture of caution and consensus VS experimentation and accountability. Perhaps there is literature on this topic I'm not aware of - if so I would love to know about it, if not it would be a promising area to explore.</p>", "parentCommentId": null, "user": null}, {"_id": "McWdk5mdNSTaSSyZJ", "postedAt": "2022-11-24T06:17:38.225Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>By the way, the link to using post-analytic techniques on the group dynamics section is broken (it's a link to your Docs).</p>", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "cWvW2vSg3SYt9pQT6", "postedAt": "2022-11-24T06:47:19.270Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Thanks. None of the internal links transferred from Google doc so I missed a few when manually creating them here.</p>", "parentCommentId": "McWdk5mdNSTaSSyZJ", "user": {"username": "taoburga"}}, {"_id": "8tuuN6M23zKfDuRJg", "postedAt": "2022-11-24T16:40:57.686Z", "postId": "6miasxvmrGZChosBc", "htmlBody": "<p>Thank you for writing this. This is a really useful insight that I’ll be thinking more about as I engage more with IIDM — I have definitely focused disproportionately more on adding good processes than eliminating bad ones. This could be because I’m not very familiar in general with common processes within institutions, as my studies have really only focused on individual decision-making/rationality so far.</p><p>Below are a few quick thoughts on that.</p><p>Following your Putin-EU example, I wonder how much of Russia’s nimbleness is enabled by one man having so much decision-making power, which might <strong>both</strong> enable quick decision-making as well as democratic backsliding.</p><p>Although you could argue that quicker experimentation might pay off in the long run, I would worry that modern states having too few checks and balances might increase the risk of solo actors making catastrophically bad decisions. At the same time, I worry about vast bureaucracies failing to make important decisions, and that being equally catastrophic.</p><p>I agree, as you say, that the need for “caution and consensus vs. experimentation and accountability” depends on the institution and the decision to be made. I’m also not aware of attempts to describe when exactly you would want more of the former vs. the latter.</p><p>If you (or others) have good resources on eliminating bad processes/bureaucracy, I’d love to see them.</p>", "parentCommentId": "c4dwgKkMcGK9g7CoJ", "user": {"username": "taoburga"}}]