[{"_id": "33NQBtBds9QmYKzEB", "postedAt": "2014-12-24T13:24:44.239Z", "postId": "6mmACsHiFB7Qajgnh", "htmlBody": "<p>I laugh a bit inside when I hear 'make a difference (to the world)'. A lot of very bad people have 'made a difference'!</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "LtLpAz97PBrihWmxJ", "postedAt": "2014-12-24T13:36:38.318Z", "postId": "6mmACsHiFB7Qajgnh", "htmlBody": "<p>Other bad phrases: &quot;Saving the world&quot; or &quot;saving the planet&quot;. They are usually used in a context where the impact could not possibly match up with actual world-saving or planet-saving (with some exceptions).</p>\n<p>But I also think &quot;doing good&quot; is problematic. It also lacks a sense of scope, and it also suffers from philosophical disagreements about the nature of the good.</p>\n<p>Problem is, if you want to create emotional impact in an audience that is diverse in its philosophical goals, ideas about strategy and willingness to accept costs, then you have to use language that doesn't alienate too many and yet has the emotional appeal. This only leaves you with phrases that are ultimately empty marketing terms. But if you cut them out, you lose the motivational hook as a common denominator. Marketing matters.</p>\n", "parentCommentId": null, "user": {"username": "Nicholas_Bregan"}}, {"_id": "85BraPZGWpoAuvMcF", "postedAt": "2014-12-24T15:20:52.701Z", "postId": "6mmACsHiFB7Qajgnh", "htmlBody": "<p>Slightly off-topic, but this:</p>\n<p>&quot;I believe that ‘Changing the World’ is promoted by TED, but internally acts mostly as a shelling point.  Agreeing on the importance of ‘changing the world’ is a good way of coming to a consensus without having to decide on moral philosophy.&quot;</p>\n<p>reminded me of a video I found amusing recently:</p>\n<p><a href=\"https://www.youtube.com/watch?v=4IsO8y-4AmU\">https://www.youtube.com/watch?v=4IsO8y-4AmU</a></p>\n", "parentCommentId": null, "user": {"username": "AGB"}}, {"_id": "743NYxRWgdpSnKYCT", "postedAt": "2014-12-24T21:15:10.812Z", "postId": "6mmACsHiFB7Qajgnh", "htmlBody": "<p>That is a fantastic video.</p>\n", "parentCommentId": "85BraPZGWpoAuvMcF", "user": {"username": "oagr"}}, {"_id": "mHaTmN3SNiZJrhNFF", "postedAt": "2015-01-02T18:02:53.824Z", "postId": "6mmACsHiFB7Qajgnh", "htmlBody": "<p>I agree with this. The problem is coming up with an alternative phrase that doesn't require some kind of in-group buy-in. I find myself often using phrases like &quot;saving the world&quot; or &quot;creating a flourishing world&quot; because I can't come up with better alternatives.</p>\n", "parentCommentId": "LtLpAz97PBrihWmxJ", "user": {"username": "Kerry_Vaughan"}}]