[{"_id": "n5gSmDYypusiPRdCi", "postedAt": "2022-10-27T23:34:35.792Z", "postId": "6NnnPvzCzxWpWzAb8", "htmlBody": "<p>Another <a href=\"https://rabbithole.simplecast.com/episodes/is-effective-altruism-right-1-joshua-kissel\">podcast episode on a similar topic</a> came out yesterday, from <a href=\"https://rabbithole.simplecast.com/\">Rabbithole Investigations</a> (hosted by former Current Affairs podcasts hosts Pete Davis, Sparky Abraham, and Dan Thorn). They had Joshua Kissel on to talk about the premises of EA and his paper <a href=\"https://core.ac.uk/download/pdf/81665058.pdf\">\"Effective Altruism and Anti-Capitalism: An Attempt at Reconciliation.\"</a></p><p>This is the first interview (and second episode) in a new series dedicated to the question \"Is EA Right?\". The premise of the show is that the hosts are interested laypeople who interview many guests with different perspectives, in the hopes of answering their question by the end of the series.&nbsp;</p><p>I'm optimistic about this podcast as another productive bridge between the EA and lefty worlds; their intro episode gave me a lot of hope that they're approaching this with real curiosity.</p><p>(I'm posting this more to recommend / mention the series rather than the particular episode though; the episode itself spent most of its runtime covering intro-EA topics in what I felt was a pretty standard way, which most people here probably don't need. That said, it did a good job of what it was aiming for, and I'm looking forward to the real heavy-hitting critiques and responses as the series continues.)</p>", "parentCommentId": null, "user": {"username": "Alex Semendinger"}}, {"_id": "xQjYCFTZFCbDky4iJ", "postedAt": "2022-10-30T11:10:41.590Z", "postId": "6NnnPvzCzxWpWzAb8", "htmlBody": "<p>Thank you for sharing such an honest, balanced and constructive discussion of these communities by people familiar with both :-) It can be very tempting to do <a href=\"https://www.youtube.com/watch?v=a0BpfwazhUA&amp;ab_channel=LeopoldoDrago\">the opposite</a> and I'd love to see more of this kind of thing regarding adjacent communities!</p>", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "96JH4uYNX4p6PJrHB", "postedAt": "2022-11-04T18:49:37.314Z", "postId": "6NnnPvzCzxWpWzAb8", "htmlBody": "<p>Interesting guests! I look forward to listening to some of these interviews!</p><p><br>However, \"I think there's a real gap in the EA media-verse on the intersection of left-wing politics and EA.\" is somewhat untrue. After all, EA has made headlines in many left-wing media such as Vox, the New York Times, The Washington Post, the New Yorker, etc. The vast majority of EAs I've met are politically on the left. But I do hope this podcast could help get more people, who happen to be leftists, into EA.<br><br>Although I hate labels, I consider myself left of center on the political spectrum but would be very interested if someone had a similar podcast platform but for conservatives and libertarian EAs. Some of the most interesting EAs I've met happen to be libertarians. I'm all for diversity of thought in good faith.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jeffrey Arana"}}, {"_id": "kqEcaqr7ShsRqNJsG", "postedAt": "2022-12-02T15:05:35.187Z", "postId": "6NnnPvzCzxWpWzAb8", "htmlBody": "<p>excited to give this a listen.&nbsp;</p><p>Anyone else listen to this podcast? I love this podcast but this episode was a though listen. Really made me think.&nbsp;</p><p>https://www.iheart.com/podcast/1119-it-could-happen-here-30717896/episode/the-effective-altruism-scam-104557455/?cmp=web_share&amp;embed=true&nbsp;</p>", "parentCommentId": null, "user": {"username": "Catsoncatsoncats"}}, {"_id": "YiBH4Gn5W5fGi6DFQ", "postedAt": "2023-04-29T10:26:36.282Z", "postId": "6NnnPvzCzxWpWzAb8", "htmlBody": "<p>This podcast episode feels like something out of a different timeline after the rough time EA has gone through since then. Would be very curious to hear if the opinions of the things said in the podcast are considerably different now?</p>\n", "parentCommentId": null, "user": {"username": "FJehn"}}]