[{"_id": "WuTDifRtEL4jcjDp2", "postedAt": "2018-04-26T12:59:48.681Z", "postId": "6NWMo9MgAsTW288uG", "htmlBody": "<p>This is an excellent resource. Majoring in a tradition field and minoring in a 'problem' and students working in a cross-functional team are creative approaches to effective instruction. I think those experiences will be life-changers for many students. \nTerri Lyon </p>\n", "parentCommentId": null, "user": {"username": "lunalyon"}}, {"_id": "B54Zxiv4nRKyuFbun", "postedAt": "2018-04-26T21:06:00.499Z", "postId": "6NWMo9MgAsTW288uG", "htmlBody": "<p>This is great, thanks a lot for sharing! One thing I'd add would be criticism voiced against (certain aspects) of EA as well as disagreements between different approaches to EA (e.g. short-term vs. long-term prioritization - an example being the idea that one should purchase cheap clothes made in sweatshops and save more to donate vs. the idea that such an action would have negative economic and social long-term consequences, etc.). As an academic syllabus, I think it's important to add critical views, which would nicely fit the content of the course in any case :) </p>\n", "parentCommentId": null, "user": {"username": "Dunja"}}, {"_id": "LYgtcgTr9PSZBJupk", "postedAt": "2018-05-02T22:21:36.949Z", "postId": "6NWMo9MgAsTW288uG", "htmlBody": "<p>Hmm... I think that providing sweatshop jobs has positive economic and social long-term consequences, because it brings people out of extreme poverty. I think the main drawback is the non-utilitarian criticism of sweatshops as &quot;exploiting&quot; people. Most people do not recognize that sweatshops are orders of magnitude safer than living in extreme poverty where something like 20% of your children die. But even if people were aware of that, they could still say that since sweatshops do not have the same safety standards is the developed country factories, it is somehow unfair to those workers - they are not getting justice.</p>\n", "parentCommentId": "B54Zxiv4nRKyuFbun", "user": {"username": "Denkenberger"}}, {"_id": "WAprz3u3J28kbMybW", "postedAt": "2018-05-03T20:46:59.676Z", "postId": "6NWMo9MgAsTW288uG", "htmlBody": "<p>The problem with this kind of reasoning is that in the same way one could attempt to justify slavery: just because sweatshops/slavery provide living conditions better than none, it doesn't mean we shouldn't strive to abolish them. Hence, by boycotting sweatshops one gives an important message to corporations that use them. As a result, under sufficient pressure, companies will change their rules and take care to provide better working conditions. The goal here is long-term structural improvement of social/economic practices rather than short-term help.</p>\n", "parentCommentId": "LYgtcgTr9PSZBJupk", "user": {"username": "Dunja"}}, {"_id": "zhykhag22BgMuk8Kb", "postedAt": "2018-05-05T12:29:06.098Z", "postId": "6NWMo9MgAsTW288uG", "htmlBody": "<p>First let me clarify that I only support people voluntarily taking sweatshop jobs-I do not support anything involuntary. I think it is good to consider the long-term implications of present actions. But by taking a sweatshop job, not only can people afford life-saving interventions, but they can also afford things like elementary education, which has massive long-term benefits. Saying something is better does not imply that it is good. Starting with sweatshop jobs, the <a href=\"https://en.wikipedia.org/wiki/Four_Asian_Tigers\">four Asian Tigers</a> have made a dramatic rise, where according to <a href=\"https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(PPP\">purchasing power parity</a>_per_capita) South Korea and Taiwan are richer than Spain, and Singapore and Hong Kong are richer than the US!</p>\n", "parentCommentId": "WAprz3u3J28kbMybW", "user": {"username": "Denkenberger"}}, {"_id": "H8hzq8GQcDnrSP2gi", "postedAt": "2018-05-05T17:27:44.242Z", "postId": "6NWMo9MgAsTW288uG", "htmlBody": "<p>Sure, but can we really speak of &quot;choice&quot; for those who have no other options? Again: your argument can be used to defend any form of slavery, as long as slaves became slaves &quot;out of choice&quot;. If otherwise they wouldn't have survived, what kind of choice is that?! Imagine the alternative: there is consumers-driven pressure on companies to introduce serious control of working conditions. As a result, current sweatshops eventually become much safer for work. It's a long-term win-win scenario.</p>\n", "parentCommentId": "zhykhag22BgMuk8Kb", "user": {"username": "Dunja"}}, {"_id": "tps3Fnb3SDpgqJShP", "postedAt": "2018-05-09T09:06:01.020Z", "postId": "6NWMo9MgAsTW288uG", "htmlBody": "<p>I think on balance there's a strong chance you're right, but there IS a lose-lose outcome, where the consumer pressure drives the companies to fire all their sweatshop employees and move to a place where they can get people from a different, less needy origin (that maybe has different labour laws, or in some other ways pacifies many of the consumer activists).</p>\n", "parentCommentId": "H8hzq8GQcDnrSP2gi", "user": {"username": "BenMillwood"}}]