[{"_id": "kzHpEEQXkkLRbrJok", "postedAt": "2022-08-31T18:22:07.114Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>Oh my, I didn't realize how bad things ended up as. I hope you have a good rest of your life.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "wbeAYcGjDu6bJdnRD", "postedAt": "2022-09-02T11:38:07.755Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>This sounds terrible! Especially considering that this operation is used to treat problems that are seemingly relatively mild: (wiki)</p><blockquote><p>ETS is used to treat excessive sweating in certain parts of the body (<a href=\"https://en.wikipedia.org/wiki/Focal_hyperhidrosis\">focal hyperhidrosis</a>), facial <a href=\"https://en.wikipedia.org/wiki/Blushing\">blushing</a>, <a href=\"https://en.wikipedia.org/wiki/Raynaud%27s_disease\">Raynaud's disease</a> and <a href=\"https://en.wikipedia.org/wiki/Reflex_sympathetic_dystrophy\">reflex sympathetic dystrophy</a>.</p></blockquote><p>Also, note</p><blockquote><p>In 2003, ETS was banned in its birthplace, Sweden, due to inherent risks, and complaints by disabled patients. In 2004, Taiwanese health authorities banned the procedure on people under 20 years of age.<a href=\"https://en.wikipedia.org/wiki/Endoscopic_thoracic_sympathectomy#cite_note-38\"><sup>[38]</sup></a></p></blockquote><p>However, I've also searched online a bit, and this process seemed to be endorsed in the literature (say, <a href=\"https://www.sciencedirect.com/science/article/pii/S0741521411018830\">here</a>, or more recently <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6329233/\">here</a>) for people with excessive sweating. Not sure what to make of it except one of</p><ol><li>excessive sweating is a much worse &nbsp;condition than I realized</li><li>the papers seem to address the number of people whose condition and overall quality of life was improved, but maybe they don't take into account the severity of the harms from this operation's potential side effects.&nbsp;</li><li>maybe there are other methodological issues with the studies</li><li>maybe the operation is safe and beneficial when conducted in particular way but more risky otherwise</li><li>&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "arTyx7gtuaNCr8Ymf", "postedAt": "2022-09-05T04:45:28.620Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>Unfortunately, I really can't have a good rest of life, on my current trajectory. My default state of consciousness is now one of discomfort, and I don't have any time of relief. I do appreciate your kind wishes however. One thing I am trying to do is raise awareness, as not many people know of Sympathectomies and their harms.</p>", "parentCommentId": "kzHpEEQXkkLRbrJok", "user": {"username": "handoftheenemy"}}, {"_id": "8tenM4xtmvXvc3fJM", "postedAt": "2022-09-05T20:52:41.869Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>Thank you for being interested enough to research the subject!</p><p><br>Yes, ETS has been banned in Sweden. I am part of a growing body of people who are trying to get Sympathectomies banned elsewhere, with not much success in drawing attention of medical authorities.<br><br>Thank you for the links! You provided content that I believe I &nbsp;have not found before, despite extensive search.&nbsp; One thing I will note is that the first link you presented only focuses on compensatory sweating as a side effect. I myself listed it as a side effect in my above post, but it is so minor in comparison with the other negative effects.&nbsp; I understand how a large percentage of patients can report positive results, if the only things being compared are the compensatory sweating with the original sweating. All other effects, such as chronic fatigue, are not presented to many patients pre-surgery, and some patients thus fail to relate negative side effects with the surgery itself.&nbsp; The doctors who performed my surgery, for example, have only ever acknowledged compensatory sweating as a side effect, but ignore all of my other complaints, which are so many orders of magnitude worse.&nbsp;<br><br>Also, both of the studies you cite do not include Endoscopic Lumbar Sympathectomy, which is a less-commonly performed surgery, and cuts nerves in the lumbar region, instead of the thoracic region. The surgery in the lumbar region is what caused some of my severe side effects such as impotence, loss of sexual pleasure, and disruptions to my digestive system, all of which presumably would not be prevalent in thoracic surgery.<br><br>Regarding your list of potential options for why some studies indicate Sympathectomies as being successful: I agree that it is somewhat puzzling, and I don't claim to have a perfect answer. I will say a few things, however. I know for a fact that Dr. Rafael Reisfeld, who is a prolific Sympathectomy surgeon, and is also quite prolific in publishing, has been publishing false or at least misleading results. Also, some studies performed that indicate negative results, such as those conducted by Dr. Goldstein of the NIH, are hard or impossible to locate on the web. There are also several doctors on the Facebook group who acknowledge that Sympathectomies leave many patients worse off. One doctor even is in the process of creating a Youtube documentary.<br><br>I would like to address your second option in the list: \"the papers seem to address the number of people whose condition and overall quality of life was improved, but maybe they don't take into account the severity of the harms from this operation's potential side effects.\" I think this may be true, that the people who were negatively affected don't get properly weighted, as some effects are so horrible that they would outweigh many positive self-reported results. There is also the case of a woman who bled to death after surgery in Sweden. This case probably was not given proper weight nor the case of the young man who took his own life shortly after surgery, and whose story was reported by his mother to the ETS Facebook group. There are forum posts going back considerable time that tell similar tales, and many Youtube videos made by people to document their extremely negative results. I also think it is possible that the studies only had compensatory sweating in mind, and didn't take into account other effects of messing with the nervous system, such as changes to emotional processing and changes to cognition and qualia? The wiki page for ETS also notes a loss of capacity for pleasure, which is a negative side effect that some patients may not have realized took place, but would nonetheless be bad.<br><br>You also mention \"maybe the operation is safe and beneficial when conducted in particular way but more risky otherwise.\" I think some ways of performing Sympathectomies may be less risky than others, as there are different nerves that are cut by different doctors, for example. But I do not think that any method of severing anatomically functional nerves from a human nervous system could be considered safe, especially when the sympathetic nervous system controls so many functions, and acts in coordination with the parasympathetic nervous system.<br><br>Thanks for responding to my post, and I hope we can continue to correspond! Maybe you can even help me raise awareness. I also have other potential goals with this project; one may include an attempt at reversal with a doctor in Taiwan, who has started nerve grafting in response to the many patients who are dissatisfied with their Sympathectomies.</p>", "parentCommentId": "wbeAYcGjDu6bJdnRD", "user": {"username": "handoftheenemy"}}, {"_id": "wfcjGETCahPKEZhuA", "postedAt": "2023-03-27T14:25:12.408Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>I also had an ETS that ruined my life. At my consult I asked for t2 and t3 because I had sweating not only on palms but armpits and groin and feet. I had done research and decided with possible &nbsp;complication that my hands were most important to me. The surgeons removed t2 thru t5 on both sides! I had an effusion and pneumothorax and woke with a collapsed left lung. I had a liter and a half of blood drained from my left chest cavity. I tried to sue in 2005 because I felt they battered me by taking the extra 3 ganglion. I was told it didn't matter, they were doctors and I wasn't. &nbsp;They cauterized veins to stop bleeds they created and put 6 titanium clips in the left side for some reason. When I court ordered all the documents, I could see that the surgery for both sides =1.2 million!!!! They only reason listed was \" Performed a surgery unrelated to the principal diagnosis\"......20 years later, I have extreme sweating, loss of hormone production, chronic fatigue, constant pain. Amongst a slew of other related autonomic anomalies.</p>", "parentCommentId": null, "user": {"username": "Sparechange"}}, {"_id": "4Aorvq68sB3Kgqq4D", "postedAt": "2023-03-29T04:56:29.955Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>Sorry to hear about your experience. Similarly, in my experience, people just trust the judgement of the doctors, who are the ones making money on sympathectomies, of course. &nbsp;What do you mean the surgery for both sides =1.2 million?<br><br>I spend days with less than two hours up from a laying down position. The fatigue is overwhelming. &nbsp;Some people get sympathectomies performed as early as age 14.</p>", "parentCommentId": "wfcjGETCahPKEZhuA", "user": {"username": "handoftheenemy"}}, {"_id": "ctAtbwjbH2rg34PMx", "postedAt": "2023-12-14T05:07:53.596Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>Had my surgeries 2003, 2004 = destroyed my life! Thought I knew a lot but this post from “handofthe enemy” made me feel less isolated in my situation with my cognitive impairments. Thank you for the time, energy you offer in shedding light on this horrendous Medical crime continuously being committed</p>", "parentCommentId": null, "user": {"username": "M F"}}, {"_id": "fq64d6qKBSRjoew6k", "postedAt": "2023-12-26T20:04:25.536Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>I also made a podcast episode on the topic. I will DM you to get in touch.</p>", "parentCommentId": "ctAtbwjbH2rg34PMx", "user": {"username": "handoftheenemy"}}, {"_id": "WrS2hhxY9PDf8tmwr", "postedAt": "2024-01-07T17:25:06.600Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>I have spent 21 years trying desperately to report \"follow-up adverse effects\" to countless Medical professionals - NO ONE will receive them nor document them!! All the attention I receive is from Psychiatrists pushing Meds for my seemingly insanity. My fight for VALIDATION is coming to an end. Neurologists are determined to convince you for surgery by MINIMIZING the invasiveness and falsely reporting positive results.</p>\n<ul>\n<li>if the lives of humans in Sweden are valued as per the BAN - this should be reason enough for those globally to question the integrity of this BARBARIC surgery &amp; the perpetrators practicing it. Btw... where's the Sales Handbook on ETS providing the \"how to convince your patients to follow through this lucrative surgery\". Reports around the world from victims are written so similarly there must be Sales literature to collect from Medical journals to BURN &amp; SAVE LIVES 😊</li>\n</ul>\n", "parentCommentId": "wbeAYcGjDu6bJdnRD", "user": {"username": "M F"}}, {"_id": "fnGTM2NZDnbEC2q5f", "postedAt": "2024-02-08T06:02:19.300Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": "<p>This is horrifying! A friend of the author just shared this along with a Business Insider post that was just published that links to this post:</p>\n<p><a href=\"https://www.businessinsider.com/dangerous-surgery-stop-blushing-side-effects-ruined-life-no-emotions-2024-2\">https://www.businessinsider.com/dangerous-surgery-stop-blushing-side-effects-ruined-life-no-emotions-2024-2</a></p>\n", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "7JGQthFhWyJjStkLM", "postedAt": "2024-01-28T06:21:53.282Z", "postId": "6o7CuxJGcnckTkg49", "htmlBody": null, "parentCommentId": "WrS2hhxY9PDf8tmwr", "user": null}]