[{"_id": "toY5eNCssALJKq6Ls", "postedAt": "2018-08-08T14:14:47.488Z", "postId": "6ojaD4vmxsSrZyBBF", "htmlBody": "<p>Very interesting project! Have you engaged with the work of Rupert Read at all? He's a philosopher in the UK, Green Party politician, think tank chair and sometime critic of EA. He's written a paper (<a href=\"https://www.greenhousethinktank.org/uploads/4/8/3/2/48324387/guardians_inside_final.pdf\">2012</a>) arguing for a body, building on the Hungarian ombudsman example, who would aim to act as a proxy for future generations, review and potentially veto legislation deemed harmful to their interests.</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "Ws5i2wD6dojPBuQuY", "postedAt": "2018-08-09T01:00:23.219Z", "postId": "6ojaD4vmxsSrZyBBF", "htmlBody": "<p>This was a really good, clear write-up; I found it very interesting. Thank you.</p>\n<p>I have a couple of questions. If you want to reply by just telling me to read the full write-up: fair enough.</p>\n<ol>\n<li><p>There seems to be some potential overlap between A, B, and D. Could the Future Commission, or the Ombudsman, be used for oversight on other parliamentary committees, i.e. that part of their remit be to check that other committees discharged their responsibility to take future generations into account?</p>\n</li>\n<li><p>Do you have thoughts on how you would go about pushing for a Future Commission?</p>\n</li>\n<li><p>Do you think there'd be value to do some opinion polling on support for a Future Commission, and an Ombudsman?</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "ole_koksvik"}}, {"_id": "gz4T2KFSGxWkosxN6", "postedAt": "2018-08-09T08:29:57.086Z", "postId": "6ojaD4vmxsSrZyBBF", "htmlBody": "<p>Thanks, Ole!</p>\n<ol>\n<li><p>Yep, I would say there is definitely overlap. At the very least between the Ombudsman and the Future Commission. They would both serve as checks. I think (and am not sure whether the others in the project would agree with this), we do not need to think about all of these as a package. If I could wave a magic wand and implement a set of institutional changes, I would likely be in favour of a different package. Instead, we've recommended things that fit well together where we would be incredibly pleased if one or two would be implemented. </p>\n</li>\n<li><p>One of the main things we're doing now is thinking about how to get to implementation of these recommendations. My view is that we need to keep building a coalition with other organisations (e.g. environment-focused think tanks). On top of this, we need to keep finding allies among the MPs. </p>\n</li>\n<li><p>I think that's a great idea! We'll likely spend the next few months taking a step back and deciding on how we're gonna be pushing for our recommendations. One really simple communications tactic would likely be to do some polling. </p>\n</li>\n</ol>\n", "parentCommentId": "Ws5i2wD6dojPBuQuY", "user": {"username": "MarkusAnderljung"}}, {"_id": "m8cB67qc4HbgnezzX", "postedAt": "2018-08-09T08:47:59.787Z", "postId": "6ojaD4vmxsSrZyBBF", "htmlBody": "<p>Thanks, David! </p>\n<p>I have not, though <a href=\"https://www.researchgate.net/publication/322878298_Representation_of_Future_Generations_in_United_Kingdom_Policy-Making?enrichId=rgreq-79f44f7cfcc10baafa63d26e50543351-XXX&amp;enrichSource=Y292ZXJQYWdlOzMyMjg3ODI5ODtBUzo1OTIxMzA3Mjg4MjA3MzZAMTUxODE4NjM3NTIzMQ%3D%3D&amp;el=1_x_2&amp;_esc=publicationCoverPdf\">Jones et al 2018</a> has (this is the paper written by the same people who worked to set up the APPG in the UK). They say of the Read proposal that &quot;We encountered several ideas which we do not include above, for various reasons. One of these is the proposal for a “third house of parliament”, or “Guardians”, made by Rupert Read (Read 2012). Under Read’s proposal these Guardians, appointed randomly amongst citizens on the same principle as juries, would have the power to (a) veto new legislation that threatened the basic needs and fundamental interests of future people, and (b) force a review of any existing legislation that threatens such needs and interests. He also suggests similar structures within local governments. As we found previously, institutions with veto powers did not last long, and as such we do not think this “third house of parliament” would be workable. In addition, we share concerns raised by Michael Bartlet about the proposed method of selection by lot (Bartlet, 2012).&quot;</p>\n<p>To give some context on veto powers not lasting long, the Hungarian Commissioner was removed with four years and the Israeli commissioner lasted about five years. Both of these had quite strong powers that they actually used, which seems to have made them politically controversial and had them removed after the next election. </p>\n<p>Another crucial point here is what types of policies you think are going to be most impactful to work on. If you want to focus on environmental issues, I can see the allure of institutions that are given a lot of power. The bottleneck is not agenda-setting but rather closer to the right bills not being voted through. If you're more concerned about other GCRs, institutions or tweaks focusing on agenda-setting will be more interesting, such as the APPG. </p>\n", "parentCommentId": "toY5eNCssALJKq6Ls", "user": {"username": "MarkusAnderljung"}}, {"_id": "YcjmKiCT68oFq8XWm", "postedAt": "2018-08-09T23:50:32.857Z", "postId": "6ojaD4vmxsSrZyBBF", "htmlBody": "<p>Thank you for your replies. </p>\n<p>[Warning: musings ahead.]</p>\n<p>Re your reply on 2, I found it interesting that overall you seem focused on working with *insiders8  --- people already quite involved and invested in the political system --- rather than aiming for uptake in the population at large, and then to use that as leverage on politicians (which is what I had been musing about when thinking about how to cause political change). I wonder whether there's data on the effectiveness on the two different approaches. Most likely it's too dependent on context and question.</p>\n", "parentCommentId": "gz4T2KFSGxWkosxN6", "user": {"username": "ole_koksvik"}}, {"_id": "YLe8moKu8xtWRAoRe", "postedAt": "2018-08-14T09:18:31.866Z", "postId": "6ojaD4vmxsSrZyBBF", "htmlBody": "<p>Yeah, I agree that we've gone for quite a top-down rather than bottom-up approach. Though less so than in the UK case. There, my understanding is that the APPG was started only after having arranged 1-on-1 meetings with the relevant MPs. </p>\n<p>My intuition is that it will be difficult to cause change in this area by driving popular opinion, but you might need some public opinion behind it to make it stick. To be crass, I would expect politicians to be able to wrangle very few votes by spear-heading initiatives such as these. </p>\n", "parentCommentId": "YcjmKiCT68oFq8XWm", "user": {"username": "MarkusAnderljung"}}]