[{"_id": "ErYvCqJatdD3b5zv3", "postedAt": "2023-02-21T21:55:33.916Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>I would encourage people who were involved in this to comment. My sense is that this was a huge effort by a bunch of different people, but I'd like to both better understand what happened here and celebrate people for their contributions.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "mxGHdKjjJaHsxkvPw", "postedAt": "2023-02-22T01:00:06.434Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Generally I think the EU is too regulatory. But this is a huge mark in their favour.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "fgDaRqgzrzCTWH6WS", "postedAt": "2023-02-22T01:26:33.891Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>+1 to this. Also, I think it would be great to compile a list of <i>career wins</i>. It's easy to find data on donations and their actual/expected impact, but not so easy to find examples like \"Person A got involved in career or initiative x, spend t years working on it, and then the outcome was z.\"</p>", "parentCommentId": "ErYvCqJatdD3b5zv3", "user": {"username": "satpathyakash"}}, {"_id": "YM7fmjLntagGbAvo6", "postedAt": "2023-02-22T02:44:48.765Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>We should also celebrate the politicians and civil servants at the European Commission and EU Food Agency for doing the right thing. Regardless of who may have talked to them, it was ultimately up to them, and so far they've made the right choices.</p>", "parentCommentId": "ErYvCqJatdD3b5zv3", "user": {"username": "ThomasWoodside"}}, {"_id": "Rac9qhLER4HCLCFDn", "postedAt": "2023-02-22T04:07:58.180Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Agreed! If any civil servants are reading this, I would love to hear your story.</p>", "parentCommentId": "YM7fmjLntagGbAvo6", "user": {"username": "Ben_West"}}, {"_id": "2Qid9tJKJMqL7GSRN", "postedAt": "2023-02-22T05:01:47.704Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Nathan how would you get this kind of change on caged animals without a strong regulatory framework?</p>", "parentCommentId": "mxGHdKjjJaHsxkvPw", "user": {"username": "NickLaing"}}, {"_id": "KRHzCHb69GLR9DHHP", "postedAt": "2023-02-22T06:31:23.173Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Yes, that's the point I'm making.</p>\n", "parentCommentId": "2Qid9tJKJMqL7GSRN", "user": {"username": "nathan"}}, {"_id": "grxdARLfoFZgndXAG", "postedAt": "2023-02-22T07:52:59.508Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>The broiler reforms also seem pretty significant to me, so I probably wouldn't have singled out cages for egg-laying hens in the title. Also, my impression is that we haven't had much recorded progress with breed transitions for broilers (commitments, but not much actual follow-through), and this would force companies to transition, so this could be a bigger win for broilers than it is for egg-laying hens.</p>\n<p>The reforms seem roughly in line with the Better Chicken Commitment, maybe somewhat faster growth rates (50g/day max vs 45-46, compared to 61 with conventional breeds): <a href=\"https://welfarefootprint.org/broilers/\">https://welfarefootprint.org/broilers/</a></p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "e6WFP7d5u3beyyJRS", "postedAt": "2023-02-22T09:49:22.105Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>I disagree! The European institution harmonize (often this means \"take the less constraining requements\") european regulation. Europe is perhaps too regulatory, the EU &nbsp;is not a force for more regulation, only for uniform regulation.&nbsp;</p><p>Never forget that EU directives are approved by a supermajority of the European Council (=the meeting of European governments), &nbsp;plus the EU Parliament (that almost allways accept by majority anything that the Council approves by supermajority).</p>", "parentCommentId": "mxGHdKjjJaHsxkvPw", "user": {"username": "Arturo Macias"}}, {"_id": "fxXQu2wmhRAgyWcuc", "postedAt": "2023-02-22T17:46:04.739Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>What, in your opinion , is an example of overregulation?&nbsp;</p><p>I used to agree with this, but I now think that the usual examples of over-regulation, such as the Ecodesign directive, &nbsp;have actually been extremely successful.&nbsp;</p>", "parentCommentId": "mxGHdKjjJaHsxkvPw", "user": {"username": "86406"}}, {"_id": "EEqPCpnkqH5KYouFw", "postedAt": "2023-02-22T20:13:23.062Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Note: I'm going to exercise my dictatorial powers as author of this post to remove any future comments arguing about the EU/regulation/things unrelated to this post.</p><p>(I know that wasn't your intention with this comment, Nathan, and thank you for not turning this into a demon thread about regulatory reform. Don't mean to call you out.)</p>", "parentCommentId": "mxGHdKjjJaHsxkvPw", "user": {"username": "Ben_West"}}, {"_id": "KucA47KPdWECSAxbQ", "postedAt": "2023-02-22T20:19:25.880Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>The title was intentionally meant to apply to both broilers and layers, but if you have suggestions for an alternate title let me know!</p>", "parentCommentId": "grxdARLfoFZgndXAG", "user": {"username": "Ben_West"}}, {"_id": "uaysao9BKMBvnES4w", "postedAt": "2023-02-22T20:30:25.873Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>I think broilers were probably not caged at significant rates. Maybe just add \"and adopting broiler reforms\" or \"the fastest growing broiler breeds\", but that's getting long.</p>\n<p>Maybe: EU Food Agency Recommends Chicken Welfare Reforms</p>\n", "parentCommentId": "KucA47KPdWECSAxbQ", "user": {"username": "MichaelStJules"}}, {"_id": "iP25Nwf2shNRbvnNo", "postedAt": "2023-02-22T21:28:44.225Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>One interesting question this raises for me: how does this impact the cost-effectiveness of corporate chicken welfare campaigns in the EU? Would this have been likely to happen without those campaigns? If so, then the counterfactual we were trying to beat was much better than we had anticipated, so the impact of corporate campaigns could be much lower.</p>\n<p>On the other hand, if corporate campaigns were instrumental for this, then we should probably treat all of the work and impacts (corporate and regulatory) together in assessing cost-effectiveness.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "eQoSseqbxFbgipzEr", "postedAt": "2023-02-22T22:40:30.575Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Naah, I respect your right as dictator. I think generally underused tbh.</p>", "parentCommentId": "EEqPCpnkqH5KYouFw", "user": {"username": "nathan"}}, {"_id": "dDXEjkb7BfHfMh73w", "postedAt": "2023-02-22T23:26:02.263Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>I think this is a really positive indication that builds on the many other positive indications we've had from the Commission that they will try push for an ambitious animal welfare reform, but I wouldn't want to overplay the EFSA opinion. It's harder to imagine a path to a cage-free transition in a world where EFSA came out against cage-free or was more muted in its support, but the fact that many EFSA opinions are ignored and watered down show that it is low down on the list of necessary but not sufficient factors.<br><br>The two Metaculus questions I set up on the cage-free reform have been pretty steady for a while now (and less optimistic than my median forecast), and I would be slightly surprised if they massively updated based on the EFSA opinion<br><br><a href=\"https://www.metaculus.com/questions/5431/will-the-eu-announce-by-2024-going-cage-free/\">Will the current European Commission make a proposal before the end of its term in November 2024 to phase out remaining hen cages?&nbsp;</a></p><p><a href=\"https://www.metaculus.com/questions/7496/when-will-the-eu-phase-out-cages/\">If the EU bans caged-housing for egg-laying hens, what date will be set as the phase out deadline?</a>.<br><br>Just copy-pasting general comments I made on EFSA opinions from my <a href=\"https://docs.google.com/document/d/1KSCjPlwEj8idIF7LEfJ625saUVv-pacBEYzExp-zxuU/edit#heading=h.uih30kewjin\">long report</a> on the EU farmed animal revision:<br><br>&gt;\"Most of the existing EU farmed animal welfare directives have been preceded by a report from an EU scientific committee (which proposes recommendations based on animal welfare considerations and often includes socio-economic impact assessments).&nbsp;There are certainly many cases of scientific reports that have not led to legislation (see the<a href=\"https://docs.google.com/document/d/1zZW4ae9Cw7LdsS--m2c81_PZPy9Gye95mtHE2lKt1HA/edit#heading=h.qwtt8yd03ncf\"> final section in the case studies</a>), so although they may be necessary, they are not sufficient. My rough estimate is that four to six of the 22 to 59 reports since the 1980s on farmed animals that plausibly had species-specific welfare recommendations were used as the basis for legislation (depending on what you count as a relevant recommendation).&nbsp; On average, when a report was produced and a law proposed by the Commission, then such a proposal came 32 months after the scientific report was completed, but this gap has been as quick as 2 months and as long as 63 months in past animal welfare directives. A baseline might be to expect that with the submission of a scientific report there is a 4%-27% chance it becomes a proposal in the short-term (within 5 years).\"</p><p><br>There have been many instances where EFSA recommendations were ignored or severely &nbsp;watered down. A relevant example being in March 2000, the EU scientific committee produced a report, “<a href=\"https://ec.europa.eu/food/sites/food/files/safety/docs/sci-com_scah_out39_en.pdf\"><u>The Welfare of Chickens Kept for Meat Production (Broilers)</u></a>”, and noted problems when densities exceeded 30kg/m2 [. . .] The Commission’s original May 2005 proposal hewed to the 2000 scientific report setting a maximum of&nbsp;30kg/m2, with exceptional circumstances allowing a limit of 3kg/m2 if the cumulative daily mortality rate was&nbsp; 1%+ 0.06% *<strong>\" </strong>. But the eventual &nbsp;2007 compromise reached was 33kg/m2-39kg/m2 with a bonus up to 42kg/m2 &nbsp;if certain conditions were met.&nbsp;<br><br>This is why I put a lot of attention of <a href=\"https://forum.effectivealtruism.org/posts/JsH7jWaDYRiX8xwZz/strategic-considerations-for-upcoming-eu-farmed-animal\">shaping the political landscape of the reform</a> to increase the odds that any positive EFSA opinion turns into real results for animals.<br><br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Incogneilo18"}}, {"_id": "cnEFkQNYyYzRoDCqo", "postedAt": "2023-02-23T01:36:18.021Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Thanks! This is helpful (though a bit sad).</p>", "parentCommentId": "dDXEjkb7BfHfMh73w", "user": {"username": "Ben_West"}}, {"_id": "bAgfmSL4scNABFLMw", "postedAt": "2023-02-26T14:39:29.609Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>Good point.&nbsp;</p><p>In addition, I would be interested in knowing whether transitioning broilers from conventional to reformed systems, and hens from conventional cages to cage-free aviaries increases the chance of further transitions to net positive systems. I expect this to be the case.</p><p>However, I think the lives of broilers in reformed systems, and of hens in cage-free aviaries are still net negative (search for \"Conditions of broilers (-cQALY/cyear)\" <a href=\"https://forum.effectivealtruism.org/posts/nDgCKwjBKwFvcBsts/corporate-campaigns-for-chicken-welfare-are-10-000-times-as\">here</a>). So, if transitioning broilers and hens directly from very negative to positive systems turns out to be easier than from moderately negative to positive (maybe people will think the cage-free systems are good enough), corporate campaigns may be harmful. To be clear, I think they are beneficial, but I am just wondering whether there has been research on this.</p>", "parentCommentId": "iP25Nwf2shNRbvnNo", "user": {"username": "vascoamaralgrilo"}}, {"_id": "MnsYHTdAfWjFq2LQE", "postedAt": "2023-02-27T11:50:11.258Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>This is awesome. Thanks for the post.<br>However, I'd really like to know more about how this (and the corresponding Brussels effect) could interact wit topics such as:</p><ul><li><a href=\"https://forum.effectivealtruism.org/posts/K8bYdQ5xY923xAbyS/will-eu-esma-financial-regulation-on-esg-fund-names-include\">ESG Financial disclosures regulations regarding animal welfare</a>;&nbsp;</li><li>Countries' resistance in <a href=\"https://forum.effectivealtruism.org/posts/4rtnBHaxHYsEofWH3/do-countries-comply-with-eu-animal-welfare-laws\">complying with EU agencies recommandations</a>;</li><li>Countries' internal laws and practices disregarding animal rights / welfare - e.g., Portugal's <a href=\"https://www.publico.pt/2023/01/18/sociedade/noticia/ministerio-publico-pede-inconstitucionalidade-norma-lei-maus-tratos-animais-2035566\">Supreme Court striking criminal laws regarding torturing animals</a>.</li></ul>", "parentCommentId": null, "user": {"username": "Ramiro"}}, {"_id": "BqcyxHvMNz4ia9dsz", "postedAt": "2023-03-02T07:19:02.968Z", "postId": "6pc8iuDxz8LArWng8", "htmlBody": "<p>I’ve been involved in animal welfare campaigns in Anima International Poland for many years and I need to say that it is amazing to see now EFSA’s report as sort of confirmation of our efforts. We published our first investigation from cage-eggs farm in 2014 and have been doing corporate outreach and policy&nbsp; work since then. In recent years we also started working on improving the welfare of broiler chickens. My colleagues from Anima International Denmark have been running similar campaigns for an even longer time. Of course we’ve been just a part of huge EU-wide pressure created by organizations working nationally and internationally (Compassion in World Farming, Eurogroup For Animals and many others). It could be said that animal welfare groups in the EU campaigned and put a lot of public pressure to make EU institutions improve the welfare of farmed animals in Europe.&nbsp;</p><p>Obviously EFSA’s report is independent scientific research. But I think it is reasonable to say that years of campaigning (especially about cage-eggs) created the circumstances in which the probability of EFSA working on this topic was much higher than without such campaigns. EFSA reports don’t necessarily lead to legislative changes. However, EFSA report appearing in the context of EU-wide campaigns for welfare improvements has in my opinion much bigger chances to influence the legislation. We should think of EFSA report as scientific and objective but still I think organizations in Europe should celebrate how their campaigns lead to this important change for the animals. Moreover, these reports are important tool for organizations to continue their campaigns and increase the chances of achieving the important goals.<br><br>From the point of view of farmed animals welfare organizations in EU and of Anima International, I can say that we wouldn’t be able to run such impactful campaigns without big support from Effective Altruism community, especially from Open Philanthropy and Farm Animal Funders. It is important to recognize here how their financial support brings another step toward real changes.&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Pawel Rawicki"}}]