[{"_id": "sczxjjfu25PyFhaQ6", "postedAt": "2023-09-12T02:15:38.719Z", "postId": "6pgjFRCuBiHoqnmXE", "htmlBody": "<p>I think a lot of the difficulty here is what <i>counts</i> as an EA charity. I mean, CEA and GiveWell surely counts, but what about Against Malaria Foundation? GiveDirectly? UNICEF?&nbsp;<br><br>The broader your definitions are, the more likely it'd look like EA charity funding mostly comes from non-EA sources.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "JbvT3fjinj7MLuodS", "postedAt": "2023-09-12T04:56:49.512Z", "postId": "6pgjFRCuBiHoqnmXE", "htmlBody": "<p>That's a good question. Here's a couple of hot subjective takes.</p>\n<p>Its hard to call any direct action charity an \"EA\" charity, maybe \"EA aligned\" or similar. Those of us who run charities know that effectiveness estimates can constantly change, so it's possible to be an EA hero today, while being zero tomorrow and vice versa. Even charity entrepreneurship charities could potentially fall out of EA favor with changing cost effectiveness estimates or just because they struggle to operationally achieve their potentially cost effective goal.</p>\n<p>EA aligned charities could of course pivot what they are doing or shut down, but once a charity had reached a certain size or gathers momentum, I think it might often be most EV positive to continue to grow even if you are doing good not the most effective charity in the world, but that's a whole nother discussion</p>\n<p>I would put AI safety 'charities' in this same boat as well. I get the feeling the groups working on AI safety don't like to call themselves charities, but I don't really see a fundamental difference between a group of people funded to work on AI safety and a charity like ours providing healthcare in remote places. We are both donor funded orgs trying to help people as cost effectively as possible, through different avenues. The difference is present vs. Future people.</p>\n<p>We can definitely give foundations and effectiveness assessment orgs the EA label, because they are constantly trying to fund cost effective orgs and can stay constant in their vision and EA alignment.</p>\n<p>Many Givewell recommended charities might not even call themselves EA aligned and many probably found themselves there through good ops and good fortune as much as actively trying to do the most good. Even AMF might be in this boat to some extent. I'm not sure if any charity started by someone who would consider thereof a solid EA has reached top Givewell status?</p>\n<p>And UNICEF definitely isn't EA haha.</p>\n", "parentCommentId": "sczxjjfu25PyFhaQ6", "user": {"username": "NickLaing"}}]