[{"_id": "cYT4Tr4nWKHtaa7fR", "postedAt": "2015-07-24T01:00:17.916Z", "postId": "6PHSwNbNaxfoMK88J", "htmlBody": "<p>I'm interested in moving moral economics forward in a different way: by creating some kind of online &quot;moral market&quot; and seeing what your happens.</p>\n<p>There are two possible systems I could implement:</p>\n<ul>\n<li>Something based on certificates of impact (<a href=\"http://rationalaltruist.com/2014/11/15/certificates-of-impact/\">at least one person has asked for this</a>)</li>\n<li>A points-based system</li>\n</ul>\n<p>I'll describe the points-based system here, as it's the one I've thought through a bit more. I presume it theoretically diverges from a certificate of impact system, but I haven't thought through exactly how.</p>\n<p>Users have points. The total number of points in the system is 1 billion.</p>\n<p>At any time, a user with nonzero points can make a request that somebody else donate to a particular charity in exchange for some of those points.</p>\n<p>Fundamentally that's the only mechanic that I'm imagining right now. Other bells and whistles can be added, such as prediction markets, or other goodies that you can purchase with points such as volunteer time.</p>\n<p>The requests stay on the table until someone takes them up, so a (new or existing) user can acquire points by seeing which requests are currently active and donating to one of the relevant charities.</p>\n<p><strong>Why would anyone want points?</strong> Points can be used to influence other people in which charities they give to, how much and when. (Although if everyone agrees that points are worthless then this leverage disappears).</p>\n<p><strong>What are some use cases?</strong> A charity is running a fundraiser, and its supporters all want <em>each other</em> to donate to the fundraiser as soon as possible, so that the charity's staff aren't tearing their hair out. If any of these supporters have points, they can use some of them to encourage other supporters to donate early, by raising the points-per-dollar value of the charity.</p>\n<p><strong>Any other use cases?</strong> Moral trade might be possible - donating to a charity becomes slightly more attractive if you get points in return, and those points are some reflection of how much other people like the charity. I don't know how this would play out in practice though.</p>\n<p><strong>Trading points sounds like a lot of work.</strong> Yes it would be! Possibly enough to wipe out the value gained by moral trading. So the system would need one other major feature: automatic trading.</p>\n<p><strong>How does automatic trading work?</strong> Each user assigns a subjective utilons-per-dollar-donated value to each charity, as well as a value to holding onto the cash themselves. The system calculates a utilon-per-point value somehow. It can then automatically set the donation request price to be (utilon per dollar of charity divided by utilon per point). The system can also make suggestions to the user to donate when utility of charity + utility of points you'd get back &gt; utility of holding onto the money.</p>\n<p><strong>Aren't you glossing over some things here?</strong> Yes, several.</p>\n<ul>\n<li>These prices and valuations are all at-the-margin, and will change as stuff gets bought and sold and spent. The system shouldn't ever suggest that you donate a million dollars to charity X, because your marginal value of holding onto the money would have gone way up in the middle of that.</li>\n<li>The utilons-per-point value is calculated &quot;somehow&quot;, possibly by looking at historical transactions and seeing which is the highest-utility charity whose donations can be bought with points.</li>\n<li>This doesn't actually work though, because if you trade a donation for points, it doesn't mean 100% of that donation is as a consequence of your points. The person may have donated anyway, or someone else may have offered up the points anyway.</li>\n</ul>\n<p><strong>How is this any use to me if I'm not a consequentialist and don't believe in utilons?</strong> I haven't thought about that yet.</p>\n<p><strong>This is all just chit-chat, and we're never going to see this happen, right?</strong> Wrong. I'm working on it here, although it's currently little more than a login page and a couple of database tables. Development help welcome! <a href=\"https://github.com/edkins/moral-market\">https://github.com/edkins/moral-market</a></p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "rSXiiBCfvnde9wqkb", "postedAt": "2015-07-24T01:06:15.358Z", "postId": "6PHSwNbNaxfoMK88J", "htmlBody": "<p>Oh one other thing - I think the trickiest part of this system will be verifying whether someone has actually donated to a charity at the time they said they did. Every charity does it a different way.</p>\n", "parentCommentId": "cYT4Tr4nWKHtaa7fR", "user": {"username": "Giles"}}, {"_id": "qB9YsHaoRukb2wBEo", "postedAt": "2015-07-24T21:41:57.689Z", "postId": "6PHSwNbNaxfoMK88J", "htmlBody": "<p>I've just found out that Paul Christiano and Katja Grace are already <a href=\"http://impactpurchase.org/\">buying certificates of impact</a>.</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}]