[{"_id": "2oJtxq8BubofBt9Mm", "postedAt": "2022-11-10T10:21:39.884Z", "postId": "6QLqnBw3AQgdoF4Bn", "htmlBody": "<p>Interesting post!\nIt sounds like you are doing good, and you also seem to admit that with other interventions you could do more good, according to available data. You are unsure how the values compare due to lack of meaningful measurable quantities on your current intervention.\nDo I have that correct?</p>\n<p>If you want to gain insight into the matter, I would recommend reading into <a href=\"https://forum.effectivealtruism.org/posts/HDAXztEbjJsyHLKP7/outline-of-galef-s-scout-mindset\">Scout mindset</a>\nand rationality.</p>\n<p>To put it bluntly: which sensory experience, if any, would convince you that your current intervention is not the best use of your time and effort?</p>\n<p>EDIT:\nI see I am getting negative points. I guess I am appearing rude, condescending or antisocial. Not my intention, but my culture and personality make this an easy pitfall for me.</p>\n<p>I truly do recognize the friction that OP describes and merely wanted to offer tools that helped me. What we want in life and how we change the world is not an optimization problem but a complex ethical choice. Depending on your preferences, optimization may then be applied within your philosophical direction.</p>\n<p>Can someone please comment and/or confirm my guess? then I will delete this.</p>\n", "parentCommentId": null, "user": {"username": "Freek"}}, {"_id": "NHgW2Ncsi9S29wJpW", "postedAt": "2022-11-10T12:03:58.250Z", "postId": "6QLqnBw3AQgdoF4Bn", "htmlBody": "<p>Thank you for writing and sharing this! I suppose it's being downvoted because it's anti-EA, but I enjoyed reading it and understanding your perspective.</p><p>I had three main reactions to it:</p><ol><li>You obviously care a lot about helping other people and making the world a better place, which I value a lot. You're putting your money where your mouth is and actually taking action to make a difference. That's really admirable.</li><li>You seem to think that effective altruism is all about having an objective, measurable metric of effectiveness, and that any attempt to do good that isn't measurable isn't worthwhile. That's not right - <i>one </i>approach that some people within EA take is to look for things with lots of evidence of excellent outcomes (per £), with GiveWell being the most prominent example of this approach. But more generally, EA is just about achieving the best objective outcomes, even if you can't measure them.</li><li>I think you're probably making a big mistake, because as you say, there are other things you could be doing that could be helping people even more. As grim as it is to deprioritise the people you've been trying to help, there are many millions who are equally deserving of good things, but who we are in a much better position to help. It's much easier to realise how bad things are when they're right in front of you (in the UK), but there are many problems that are less salient but are equally as important. The EA approach in this situation, where we can't help everyone, is to decide what to prioritise based on what will lead to the best outcomes. Yes, that means 'giving up' on some people who really need and deserve support, but grimly <i>so does any approach - </i>for example your current approach isn't helping any of the many people outside the UK (or future generations, etc.).</li></ol><p>I'd be interested in your thoughts!</p>", "parentCommentId": null, "user": {"username": "Isaac_Dunn"}}, {"_id": "nCN8qLTqweS4wZrvv", "postedAt": "2022-11-10T18:07:37.423Z", "postId": "6QLqnBw3AQgdoF4Bn", "htmlBody": "<p>Hi Isaac, appreciate the response. &nbsp;</p><p>Re 2, you capture something important in the phrase 'achieving the best objective outcomes, even if you can't measure them'. &nbsp;That for me is the precise problem, how do you achieve this in the absense of measurement? &nbsp;What are the practical steps I can take to make my charity a better organisation if what I measure doesn't seem to capture the work that is important. &nbsp;I know for instance that our work depends almost entirely on the skill and emotional awareness/warmth of our staff and volunteers. &nbsp; But I can't predict, when hiring, who will be good at this and who wont.&nbsp;</p><p>Re 3, for sure I can help people even more. Theres no doubt that funding a hospital in Sudan which has run out of medical equipent is far more important and valuable, or paying a few hundred dollars to restore sight to a blind person in India is better value for money. &nbsp;Those are the kinds of charity I like to donate to. &nbsp; But for me its important that when trying to do something active, to contribute ones time and skills, that one try &nbsp;at least part of the time to prioritise ones immediate local environment, ones local community, and see where the greatest needs and disparities are there. Suicide prevention &amp; homelessness are local issues all over the wealthy world, and very real. &nbsp;</p><p>I understand your point about any action meaning other action isn't taken, that one is in effect 'giving up' on others, and how that can be an important tool for prioritising where one directs limited resources (this being pretty much what EA is trying to do, and what attracts me to it), and I think that in the real, practical world, its actually not that complicated to get a feel for ones own biases in that direction. &nbsp; There is a ton of really desperate primary survival need in the world today (though less than there was when I was growing up). &nbsp;I'm absolutely not questioning that charities who support this kind of work should not be prioritised. &nbsp;But I still think that there is room for other organisations, such as my own, that do actually save lives (as reported by those using the service) partly by offering an intangible form of caring that makes people feel less alone and perhaps loved.</p>", "parentCommentId": "NHgW2Ncsi9S29wJpW", "user": {"username": "Edward Farrelly"}}, {"_id": "nWf9WsfdvFcxX6djW", "postedAt": "2022-11-10T18:18:40.861Z", "postId": "6QLqnBw3AQgdoF4Bn", "htmlBody": "<p>Hi Freek, thanks for your comment and reading recommendation. I will look into it. I'm not sure I understand what you mean by 'what sensory experience would convince me that my current...effort' . &nbsp;</p><p>Maybe I'm trying to say something along the lines of 'because human experience is complex, often the ethics of compassion can be better captured by literature for instnace rather than by numerical economics. &nbsp;We understand deeply the ethics and compassion behind Dickens' A Christmas Carol' in a way that we might not if the approach to helping people is more rationalistic. After all, Victorian ethical rationalism brought us the poor house, which wasn't much good, at least if one takes Dickens and others descriptions of them at face value....</p>", "parentCommentId": "2oJtxq8BubofBt9Mm", "user": {"username": "Edward Farrelly"}}, {"_id": "ZWyEAF7JqvkT8WJtg", "postedAt": "2022-11-10T18:59:07.593Z", "postId": "6QLqnBw3AQgdoF4Bn", "htmlBody": "<p>Thanks for the thoughtful response!</p><p>I think when it comes to how you would make your charity more effective at helping others, I agree it's not easy. I completely agree with your example about it being difficult to know which possible hires would be good at the job. I think you know much better than I do what is important to make 240Project go well.</p><p>But I think we can use reasoning to identify what plans are more likely to lead to good outcomes, even if we can't measure them to be sure. For example, working to address problems that are particularly large in scale, tractable and have been unfairly neglected seems very likely to lead to better objective outcomes than focusing on a more local and difficult-to-solve problem (read more at <a href=\"https://80000hours.org/articles/your-choice-of-problem-is-crucial/\">https://80000hours.org/articles/your-choice-of-problem-is-crucial/</a>).</p><p>Another relevant idea might be a \"<a href=\"https://www.openphilanthropy.org/research/hits-based-giving/\">hits based</a>\" approach, where there's a smaller chance of success, but the successful outcome would be so good that its expected value is better than (say) the best GiveWell-style measurable approach.</p><p>&nbsp;</p><p>To be completely clear, I'm not saying I think you're making a mistake if the reason for focusing on people struggling in the UK is either that you want to help people but don't mind about how big a difference you make (you clearly are helping!), or if you definitely want to work on something you have an emotional connection to. But if your goal is to help other people <i>as best you can</i>, then that's where the EA approach makes a lot of sense :)</p><p>Put another way, I completely agree that there are serious problems in all places, including in wealthy countries - but I don't prioritise working on helping people in the UK because (a) I want my efforts to help others as much as possible, (b) it's clear that I can help much more by focusing on other problems and (c) I don't see a reason to prioritise helping people just because they happen to live near me. If you disagree with any of those, I think it's perfectly reasonable to keep focusing on people in the UK! But I think on reflection, many people actually do want to help others as best they can<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefpae79i49ax\"><sup><a href=\"#fnpae79i49ax\">[1]</a></sup></span>.</p><p>It is surprisingly emotionally difficult to realise that even though the thing you are working on is hugely important (and EA doesn't at all disagree with that), there are other problems that might deserve your attention even more. It took me a while to come around to that, and I think it is psychologically difficult to deal with the uncertainty of suddenly being open to the possibility of working on something quite different than your old plan.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnpae79i49ax\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefpae79i49ax\">^</a></strong></sup></span><div class=\"footnote-content\"><p>One caveat is that although I mostly want to do the EA thing of making the biggest difference possible, I also do separately sometimes want to do something that makes me really <i>feel</i> like I'm making a difference, like volunteering to address a problem near me, and that's obviously fine too, it's just a different goal! <a href=\"https://forum.effectivealtruism.org/posts/zu28unKfTHoxRWpGn/you-have-more-than-one-goal-and-that-s-fine\">We all have multiple goals.</a></p></div></li></ol>", "parentCommentId": "nCN8qLTqweS4wZrvv", "user": {"username": "Isaac_Dunn"}}, {"_id": "Ac27t96XqagjhvJZv", "postedAt": "2022-11-14T12:41:49.633Z", "postId": "6QLqnBw3AQgdoF4Bn", "htmlBody": "<p>What I mean by the question is: you currently seem convinced that your current intervention, the 240project, is the best use of your time and effort.\nIs there any evidence that would convince you that you would do better to do something else or is that impossible? Is this a matter of faith or are you willing to update your beliefs with evidence or arguments? If so, what could you imagine that would change your mind?</p>\n<p>I don't know what you mean by the Victorian rationalist stuff. Is it just a feeling of aversion to rational arguments when they feel opposed to compassion or do you think EA might be making a similar mistake? How would we avoid doing that?</p>\n<p>I found <a href=\"https://forum.effectivealtruism.org/posts/hkimyETEo76hJ6NpW/on-caring\">this article on caring and multiplying</a> this morning and I think it is a nice addition to what Isaac Dunn has been saying here. It shows how to use feelings and where they fail.</p>\n", "parentCommentId": "nWf9WsfdvFcxX6djW", "user": {"username": "Freek"}}]