[{"_id": "X3A7B5jm4RCejxKJv", "postedAt": "2024-03-11T18:54:13.972Z", "postId": "6SMxBeakbJ4ApQ8A8", "htmlBody": "<p>Thanks for writing this! I like the post a lot. This heuristic is one of the criteria we use to evaluate bio charities at Founders Pledge (see the \"<strong>Prioritize Pathogen- and Threat-Agnostic Approaches</strong>\" section starting on p. 87 of my <a href=\"https://dkqj4hmn5mktp.cloudfront.net/GCBR_Report_Founders_Pledge_7505b1ebe0.pdf\">Founders Pledge bio report</a>).&nbsp;</p><p>One reason that I didn't see listed as one of your premises is just the general point about hedging against uncertainty: we're just very uncertain about what a future pandemic might look like and where it will come from, and the threat landscape only becomes more complex with technological advances and intelligent adversaries. One person I talked to for that report said they're especially worried about \"pandemic Maginot lines\":</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/pthkykvcd91jyvtkbend\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/hspyugztwgjuz5xnkq8y 130w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/sefbdj712ljs4hv73qy4 260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/cvilkuk5j3rw2uikw3c5 390w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/cvazowjsobfj9tis05ab 520w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/pkj92gx4fffh9una8rnk 650w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/uisfshqlcdbpb208790g 780w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/fahj9glyew7tiehc2o4u 910w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/u0hr6xs9hmozxsy13bcj 1040w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/prwxamvp7ah8wwses8k6 1170w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/X3A7B5jm4RCejxKJv/jtlkzijt0di1o1byfvql 1260w\"></figure><p>I also like the deterrence-by-denial argument that you make...&nbsp;</p><blockquote><p>[broad defenses] might also act as a deterrent because malevolent actors might think: \"It doesn't even make sense to try this bioterrorist attack because the broad &amp; passive defense system is so good that it will stop it anyways\"</p></blockquote><p>... though I think for it to work you have to also add a premise about the relative risk of substitution, right? I.e. if you're pushing bad actors away from BW, what are you pushing them towards, and how does the risk of that new choice of weapon compare to the risk of BW? I think most likely substitutions (e.g. chem-for-bio substitution, as with Aum Shinrikyo) do seem like they would decrease overall risk.</p>", "parentCommentId": null, "user": {"username": "christian.r"}}, {"_id": "WdtLjn2W3xfWQy3Ek", "postedAt": "2024-03-12T14:09:52.521Z", "postId": "6SMxBeakbJ4ApQ8A8", "htmlBody": "<p>Very useful comment, thanks!&nbsp;</p><blockquote><p>hedging against uncertainty: we're just very uncertain about what a future pandemic might look like and where it will come from</p></blockquote><p>I fully agree with this; I think this was an implicit premise of mine that I failed to point out explicitly.&nbsp;</p><blockquote><p>... though I think for it to work you have to also add a premise about the relative risk of substitution, right?</p></blockquote><p>Great point that I actually haven't considered so far. I would need to think about this more before giving my opinion. It seems really context-dependent, though, and hard to determine with any confidence.</p><p>Also, the Maginot line analogy is cool; I hadn't seen that before. (I guess I really should read more of your report 🙂)</p>", "parentCommentId": "X3A7B5jm4RCejxKJv", "user": {"username": "MaxG"}}, {"_id": "jc7d4FJ9YWtEiGCbL", "postedAt": "2024-03-13T19:31:13.260Z", "postId": "6SMxBeakbJ4ApQ8A8", "htmlBody": "<p>I'm personally not that worried about substitution risks. Roughly: The deterrence aspect is strongest for low-resource threat actors and—from a tail-risk perspective—bio is probably the most dangerous thing they can utilize, with that pesky self-replication and whatnot.&nbsp;</p>", "parentCommentId": "X3A7B5jm4RCejxKJv", "user": {"username": "JasperGeh"}}, {"_id": "8DxhWiLgWFezZC34C", "postedAt": "2024-03-17T00:42:51.620Z", "postId": "6SMxBeakbJ4ApQ8A8", "htmlBody": "<p>Thanks, Max! One follow-up — you write:</p><blockquote><p>If I were the czar of biosecurity resources, then I would probably only re-distribute them marginally differently and focus slightly more on broad defenses</p></blockquote><p>I'm a bit surprised that this is true, given what seems to me from afar to be inordinately more spending and research on vaccines/MCMs relative to this entire bucket of passive interventions combined.</p><p>When you say \"czar of biosecurity resources,\" are you thinking of the resources of national governments, those of this community, etc.? Or was there some other specific reference group you were thinking of? I'd also be curious if you could be a bit more quantitative about how much you'd prefer to shift to passive/broad mitigations on the margins, or even if you have takes on the relative distribution between items in that bucket (though also get that putting numbers on this is tricky).</p>", "parentCommentId": null, "user": {"username": "Fiona_Pollack"}}]