[{"_id": "usRE7KfDoBFa5JtLp", "postedAt": "2015-06-15T19:33:55.176Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: Ben Kuhn's blog post <a href=\"http://www.benkuhn.net/matching\">Does Donation Matching Work?</a></p>\n<p>At the time of submission the post had been read by about 300 people for a total of 20 hours. It has since been posted to hacker news and read by more like 1500 people for a total of 60 hours.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "Jawsx4McoSxKE47ic", "postedAt": "2015-06-15T19:36:00.678Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Our very crude evaluation:</p>\n<ul>\n<li>We estimate that EAs and other related groups move around $500k annually through donation matching. We are thinking of drives run by MIRI, CFAR, GiveDirectly, Charity Science, Good Ventures, among others.</li>\n<li>We think a full and clear understanding of donation matching would improve this by around $6k, through such drives being better optimized. We lowered this figure to account for the data being less relevant to some matching drives, and costs and inefficiencies in the information being spread.</li>\n<li>We think this work constitutes around 1/30th of a full and clear understanding of donation matching.</li>\n<li>We used a time horizon of three years, though in retrospect it probably should have been longer. This implicitly included some general concerns about the fraction of people who have seen it being smaller in the future, and information accruing from other sources and conditions changing, and so on.</li>\n<li>We get $6,000 * 3 years / 30 = $600 of stimulated EA donations</li>\n</ul>\n<p>In addition to this analysis we did some sanity-checking based on readership and the plausible direct impact of the post on smaller matching drives. Overall this seemed like a plausible estimate to us.</p>\n", "parentCommentId": "usRE7KfDoBFa5JtLp", "user": {"username": "Paul_Christiano"}}, {"_id": "caSyMWcAddho6wX36", "postedAt": "2015-06-15T19:41:23.345Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>We purchased 1/2 of this post in round 1 for $600. We have since sold 1/3 of the post to Owen Cotton-Barratt for $400. Current holdings:</p>\n<ul>\n<li>Ben: 1/2</li>\n<li>Owen: 1/3</li>\n<li>Impact purchase: 1/6</li>\n</ul>\n", "parentCommentId": "usRE7KfDoBFa5JtLp", "user": {"username": "Paul_Christiano"}}, {"_id": "X8xxA7Wa9fmnoJTwZ", "postedAt": "2015-06-15T19:42:36.464Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: Ben Kuhn's blog post <a href=\"http://www.benkuhn.net/impact-purchase\">I just sold half of a blog post</a>, explaining and advertising the impact purchase.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "Tp37CASzXcPLnyr5b", "postedAt": "2015-06-15T19:43:16.339Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>We didn't really want to evaluate or purchase this item ourselves, because it seems too self-serving / meta.</p>\n", "parentCommentId": "X8xxA7Wa9fmnoJTwZ", "user": {"username": "Paul_Christiano"}}, {"_id": "NSdnsneMiHnPWhyeP", "postedAt": "2015-06-15T19:44:34.641Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: a $100 donation by Telofy to GiveDirectly.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "fwhTrgAmuDfxRRqJR", "postedAt": "2015-06-15T19:52:29.026Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>It was most convenient to measure other submissions in terms of a metric like &quot;dollars of EA donations stimulated,&quot; so to make our decision we tried to convert &quot;dollars moved to GiveDirectly&quot; to this metric.</p>\n<p>Even though many EA donations will go to GiveDirectly or other GiveWell charities, there were a few reasons we used a discount:</p>\n<ul>\n<li>&quot;EA donations stimulated&quot; come with other significant advantages. </li>\n<li>Although many EA donations go to development, some of them go to other causes like capacity-building, GCR reduction, or AI. We are significantly more excited about these other donations.</li>\n</ul>\n<p>We're not sure exactly what the multiplier should be, especially in light of positive institutional and cultural effects from funding effective work in development. But we felt comfortable using at least a factor of 5 discount, which we think is large enough that none of the development interventions are likely to be competitive unless they are extremely leveraged. </p>\n<p>We plan to think about the multiplier more if we receive submissions that seem like they might be competitive anyway.</p>\n", "parentCommentId": "NSdnsneMiHnPWhyeP", "user": {"username": "Paul_Christiano"}}, {"_id": "bARmYubzRXGLoxNmu", "postedAt": "2015-06-15T19:54:35.571Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: Gina Stuessy's organization of EA Madison.</p>\n<p>EA Madison has had a handful of meetups with an average of 6-7 attendees. Gina has been responsible for most of the organization. The submission covers the organizational work through the end of April 2015.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "mXzQRpD4aA22yThpi", "postedAt": "2015-06-15T20:04:55.238Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Our very crude evaluation:</p>\n<p>We expect that EA Madison has reached something like 50 person-hours of attention (excluding Gina and Ben), though that could easily be off by a factor of 2 in either direction and we have talked to no one else involved with it.</p>\n<p>Our very rough guess for the stimulated donations per hour was around $20. A lot of this comes in the form of general engagement rather than directly in the form of donations. This gives a value of about $1000 of donations stimulated. </p>\n<p>We expect it to be possible to make a much less noisy evaluation in the future once we can evaluate some of the impact of the group in retrospect. We think our evaluation will predictably rise in expectation over time, reflecting our general preference for purchasing things after their impacts are easier to assess. Our actual expectation for the project's impact obviously can't predictably rise.</p>\n", "parentCommentId": "bARmYubzRXGLoxNmu", "user": {"username": "Paul_Christiano"}}, {"_id": "SNpz9H8sh8MGWP3Qc", "postedAt": "2015-06-15T20:09:49.250Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: Joao Fabiano's research comparing caffeine and modafinil. His description: </p>\n<p>&quot;I did a literature review, cost-benefit analysis, ethical assessment and produced a dissertation, blog posts and gave several talks about it. Most of the research was done at the beginning of 2014 as part of my MPhil dissertation (available <a href=\"http://filosofia.fflch.usp.br/sites/filosofia.fflch.usp.br/files/posgraduacao/defesas/2014_mes/2014_mes_Joao_Fabiano_final.pdf\">here</a> in Portuguese, there's an English abstract on page 5). That research spawned many blog posts and presentations in and outside academia, in Brazil and in the UK. \nSome of these blog posts are available in English here: <a href=\"http://blog.practicalethics.ox.ac.uk/2014/11/cog_enhancement_biases/\">one</a>, <a href=\"http://blog.practicalethics.ox.ac.uk/2015/02/how-people-are-wrong-about-cognitive-enhancement-and-how-to-fix-it/\">two</a>, <a href=\"http://blog.practicalethics.ox.ac.uk/2015/01/the-hypocritical-path-of-human-enhancement/\">three</a>&quot;</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "dnRWfG2sJR2H9uuSt", "postedAt": "2015-06-15T21:00:45.293Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Our very crude evaluation:</p>\n<p>We had a hard time estimating the total impact of this research. It laid out an interesting case that modafinil is a reasonable alternative to caffeine, at least setting aside social factors. It did not seem to credibly address the main empirical questions that would motivate us to adopt either modafinil or caffeine, and we expect that most readers would be similarly skeptical (if they were sufficiently open-minded to plausibly take modafinil on the basis of analysis). We thought about evaluation by considering how hard it would be to produce a similar amount of value by paying for empirical research or critical review that would help clarify the benefits of modafinil and potentially push adoption.</p>\n", "parentCommentId": "SNpz9H8sh8MGWP3Qc", "user": {"username": "Paul_Christiano"}}, {"_id": "vPNguZTdqEJkHvC5C", "postedAt": "2015-06-15T21:02:42.443Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: Oliver Habryka's organization of wrap parties for the conclusion of Harry Potter and the Methods of Rationality, summarized <a href=\"http://lesswrong.com/lw/ltd/hpmor_wrap_parties_resources_information_and/\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "zwjsT4YowwwyoQsvB", "postedAt": "2015-06-15T21:05:08.299Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Our very rough evaluation:</p>\n<ul>\n<li>We estimate that around 1300 people went to wrap parties (adjusted somewhat for how long they were there for). This was based on examining the list of events and their purported attendances, and a few quick checks for verification.</li>\n<li>We estimated Oliver’s impact was 1/4 of the impact of the wrap parties. We estimated that the existence of cental organization doubled the scale of the event, and we attributed half of that credit to the central organization and half of the credit to other local organizers and non-organizational inputs (which also had to scale up).</li>\n<li>We estimated that the attendance of an additional person was worth around $15 of stimulated EA donations. This was a guess based on a few different lines of reasoning. We estimated the value of the EA/LW community in stimulated donations, the value of annual growth, the fraction of that growth that comes from outreach (as opposed to improving the EA product, or natural social contact), and the fraction of outreach that came from the wrap parties. We also guessed what fraction of people were new, would become more involved in the EA/LW community as a result, and how much value that would create. We sanity checked these numbers against the kind of value participants probably got from the celebration individually.</li>\n<li>So we have 1300 * 15 /4 = $4,875 of stimulated EA donations, which we rounded up to $5,000.</li>\n</ul>\n", "parentCommentId": "vPNguZTdqEJkHvC5C", "user": {"username": "Paul_Christiano"}}, {"_id": "AyjFr8fCRY55xxrSg", "postedAt": "2015-06-15T21:07:20.538Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>We purchase 3% in round 1 for $400, which we resold to Larks for $300 in round 3. Larks purchased 6.9% for $700 in round 3.</p>\n<p>Current holdings:</p>\n<ul>\n<li>Oliver: 90.1%</li>\n<li>Larks: 9.9%</li>\n</ul>\n", "parentCommentId": "vPNguZTdqEJkHvC5C", "user": {"username": "Paul_Christiano"}}, {"_id": "jnAJutDFLKoTWRA5s", "postedAt": "2015-06-15T21:08:52.737Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: Alexei Andreev's blog post <a href=\"http://lesswrong.com/lw/hd1/maximizing_your_donations_via_a_job/\">Maximizing donations via a job</a></p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "5AdogzFJLyZsoNwaE", "postedAt": "2015-06-15T21:11:29.165Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Our very rough evaluation:</p>\n<p>We looked at the number of upvotes on LessWrong and the list of people who Alexei thought might have benefited during their own job searches. We contacted a handful of these people and asked about how much the post helped them. The sample was not random, and Alexei's list was clearly not exhaustive.</p>\n<p>Our impression is that the largest benefits were from:</p>\n<ul>\n<li>Gaining confidence and pursuing a career search in a more wholehearted way.</li>\n<li>Increasing the number of interviews that people took, which probably improved their offers and decreased time unemployed.</li>\n<li>Modestly improving people's ability to perform well on interviews</li>\n<li>Modestly improving people's willingness to negotiate.</li>\n</ul>\n<p>Most of these effects have somewhat ambiguous signs, i.e.  people made tradeoffs differently and it's not obvious that they made improvements. Although we have some reservations with some of the advice in this post, the biggest effects seemed to be improving people's understanding of the recruitment process, and we expect that effect to be positive.</p>\n<p>Our extremely rough estimate was that this effect amounted to $200k in total increased (pre-tax) earnings. We guess that on the order of 5-15 people benefited significantly from the post, that the per individual benefits were on the order of $5-10k / year, and that these benefits probably persist anywhere from one to a few years (in many cases the benefit was finding a similarly good job faster, which seems to have a comparably large impact concentrated in one year).  This is the crux of our estimate, but it isn't very well informed.</p>\n<p>Based on the individuals who benefited we'd guess that about 10% of this money is used to cost-effectively make the future better (and probably somewhat more), and we are valuing the intervention at about $20k EA dollars moved.</p>\n<p>We are generally inclined to count financial benefits beyond the fraction that is donated, and our 10% reduction is not motivated entirely by this estimate for donations (which we think is a bit low, and which we haven't adjusted to account for the fact that beneficiaries were disproportionately likely to support causes that we like rather than other EA causes). In this case there are a number of considerations that justify the discount to 10%:</p>\n<ul>\n<li>Much of the salary gains reflect zero sum competition amongst applicants or between applicants and employers, though there are some increases in allocative efficiency.</li>\n<li>Much of the credit for any positive impact of the advice is reserved for the people who actually made changes on its basis.</li>\n<li>Related to both of the above, to the extent that taking more interviews, being more likely to pursue a job, and negotiating more aggressively create value, they also have costs that claw back some of the benefits.</li>\n</ul>\n", "parentCommentId": "jnAJutDFLKoTWRA5s", "user": {"username": "Paul_Christiano"}}, {"_id": "Jx6qhjHzDZDvwKjXF", "postedAt": "2015-06-15T21:17:22.931Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: Ryan Carey and Brayden McLean's organization of EA Melbourne during 2013, summarized <a href=\"http://careyryan.com/end-of-year-review-of-effective-altruism-melbourne/\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "8fieZzhiHbWvGixn9", "postedAt": "2015-06-15T21:18:34.710Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Our crude evaluation:</p>\n<p>We think the EA community in Melbourne has had a significant impact, with many people either making large donations or working on EA projects full time who would not have done so otherwise. We're evaluating this impact at around $100k / year, even considering only donations+replacement costs at EA organizations, which we expect to significantly understate the real impact.</p>\n<p>Many of these effects seem likely to be long-lasting, and we feel comfortable extending the benefits over at least 5 years.</p>\n<p>It is much harder to attribute these impacts to the formal EA Melbourne group, as compared to the informal community, the LW group, TLYCS, the actions of individual EA's in Melbourne, and so on. We had a few conversations to try to get a better sense of this allocation of responsibility. In the end we certainly didn't get a confident answer, but we got a vague intuitive feeling for the situation.</p>\n<p>Based on this impression, we allocated 10% of the responsibility to the formal organization of EA Melbourne. Interpreted narrowly we think this is more likely to be an overestimate than an underestimate.</p>\n<p>But we think that there are other benefits from EA Melbourne that can justify this estimate, and which will tend to be on the same scale as the direct effect. For example, the broader EA community in Melbourne clearly had a positive effect; but EA Melbourne looks like it will have a big impact building and growing a similar community in the future. And to the extent that other organized communities and the online presence of EA played a big role, it seems that EA Melbourne has made similar contributions back to the broader EA community.</p>\n<p>Our estimates concern the impact of EA Melbourne during its first 6 months. We assumed that Brayden and Ryan were almost entirely responsible for the founding of EA Melbourne. People other than Brayden and Ryan were clearly involved with the operation of EA Melbourne over this period. Conversely, EA Melbourne continued to exist after this initial period and it seems likely that its founding will continue to have positive impacts going forward beyond those already mentioned. In the end we called this a wash.</p>\n<p>Overall, we evaluated EA Melbourne at $70k in stimulated EA donations.</p>\n", "parentCommentId": "Jx6qhjHzDZDvwKjXF", "user": {"username": "Paul_Christiano"}}, {"_id": "PCLX8hAGkLgkT8j78", "postedAt": "2015-06-15T21:22:06.424Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>We purchased 1/70th of this in each of rounds 2 and 3 for a total of $2700. Owen Cotton-Barratt purchased 0.4% in round 3 for $200.</p>\n<p>The original certificate was divided evenly between Brayden and Ryan.</p>\n<p>Current holdings:</p>\n<ul>\n<li>Brayden: 48.37%</li>\n<li>Ryan: 48.37%</li>\n<li>Impact purchase: 2.87%</li>\n<li>Owen: 0.4%</li>\n</ul>\n", "parentCommentId": "Jx6qhjHzDZDvwKjXF", "user": {"username": "Paul_Christiano"}}, {"_id": "B9T2qHAAYoYjjxziC", "postedAt": "2015-06-15T21:25:35.078Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission:  &quot;I facilitated and lead Computer Science Education Week activities for 25 5-7 year olds at an elementary school in Santa Monica, CA. The event lasted for approximately 90 minutes. And included roughly an hour of preparation time in advance.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "47TQuoCy3czuyTGmZ", "postedAt": "2015-06-15T21:36:21.856Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Our very crude evaluation:</p>\n<p>This was pretty tough to compare to the direct EA work, and it was a small project. We did a ridiculous evaluation just to see how it turned out.</p>\n<p>We tried to make the comparison by thinking about how many dollars of EA donations would be required to achieve a comparably good outcome (according to our values). To think about this we considered the &quot;scaled up&quot; version of the activity that reached essentially all US youth from a single year and was repeated enough to have a substantial effect on their education and view of computer science, which we imagined was about 2 million times (or 10 such sessions per student). We then compared that impact to the effect of targeted funding in the areas of science with the most leverage and altruistic impact. We guesstimated that the impact would be about 1/100k the impact of an EA grant the size of the annual budget for US R&amp;D and science (and change) which is something like $1T. (The 100k came from multiplying estimates for the impact of marginal STEM education on research quality/enthusiasm/etc., the relative importance of research quality vs. funding, the extra bang-for-your-buck by targeting the best areas and spending money effectively. We chose the annual US budget because the scaled up intervention reached 1 year of students in the US. The impact on marginal STEM education takes into account the fact that the intervention is just 10 sessions.)</p>\n<p>This all suggests a value of something like $5 of stimulated EA donations, which we wouldn't take too seriously :)</p>\n<p>(In case it's not clear, we don't endorse this procedure for prioritizing very different causes.)</p>\n", "parentCommentId": "B9T2qHAAYoYjjxziC", "user": {"username": "Paul_Christiano"}}, {"_id": "7spjuA5rwHXgWc3jq", "postedAt": "2015-06-16T16:52:28.992Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Submission: a chapter of Joao Fabiano's doctoral thesis discussing some consequences of moral enhancement and the complexity of value. Old versions of some of these arguments apper in <a href=\"http://blog.practicalethics.ox.ac.uk/2013/12/emergences-devil-haunts-the-moral-enhancers-kingdom-come/\">this</a> blog post, but the thesis itself is not yet public.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "7XatPmKQuinyDv57R", "postedAt": "2015-06-16T17:13:11.142Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>This was another project that was very hard to evaluate. Overall, we were sufficiently uncertain and skeptical about the content of the chapter that we thought it was very unlikely that we would have a higher (honest) valuation than the author, and we didn't make a more detailed evaluation.</p>\n", "parentCommentId": "7spjuA5rwHXgWc3jq", "user": {"username": "Paul_Christiano"}}, {"_id": "YQoiBBBr3MNwhSENW", "postedAt": "2015-06-17T01:59:37.647Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>I think this case was probably my biggest disagreement with Paul; I thought this project had quite high value. As it happened I didn't end up purchasing any, presumably because the gap between</p>\n<ul>\n<li>My evaluation of the HPMOR wrap parties</li>\n<li>The seller's evaluation of the HPMOR wrap parties</li>\n</ul>\n<p>was larger than the gap between</p>\n<ul>\n<li>My evaluation of the thesis</li>\n<li>The seller's evaluation of the thesis</li>\n</ul>\n<p>but I would like to signal that I am willing in general to bid non-trivial amounts for academic work on X-risk and value drift.</p>\n<p>The technique I used to value it was to estimate how long it would take MIRI to produce such a piece, how valuable it was compared to MIRI's typical output, and how much it costs MIRI to hire researchers.</p>\n<p>The fact it was a doctoral thesis did cause me to assign a significant discount to my valuation. I'm not really sure how to think about this.</p>\n", "parentCommentId": "7spjuA5rwHXgWc3jq", "user": {"username": "Larks"}}, {"_id": "jxPox8zT4nYZv87vJ", "postedAt": "2015-06-17T02:02:20.359Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<blockquote>\n<p>Larks purchased 9.9% of Oliver Habryka's organization of wrap parties, paying us $300 and Oliver $700 (a price of around $10k, <em>somewhat less than we paid</em>)</p>\n</blockquote>\n<p>Boo-yah! The only thing better than accruing moral value is accruing moral value <em>cost-effectively</em>.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "T5YEDbYkaYX5AR2xK", "postedAt": "2015-06-17T02:03:28.417Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Thanks for running this Paul! It's a really interesting idea. Thanks for your hard work. I enjoyed the valuation process.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "tyMEihYRHo9nftyWX", "postedAt": "2015-06-17T02:05:15.627Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Who is &quot;Impact Purchase&quot;? Is that you?</p>\n", "parentCommentId": "caSyMWcAddho6wX36", "user": {"username": "Larks"}}, {"_id": "zeniij8tsYirNbpCG", "postedAt": "2015-06-17T09:47:27.291Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Nice update! :) Just one small suggestion - It might be nice to have either an explanation or a link somewhere to the post introducing the concept of impact purchasing for anyone who is new to the idea.</p>\n", "parentCommentId": null, "user": {"username": "aliwoodman"}}, {"_id": "QJrj2CHnQGf2hiKSB", "postedAt": "2015-06-17T16:07:32.782Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Good idea, done.</p>\n", "parentCommentId": "zeniij8tsYirNbpCG", "user": {"username": "Paul_Christiano"}}, {"_id": "h9yaFojrLyownwDZM", "postedAt": "2015-06-17T16:08:23.528Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Katja and I jointly.</p>\n", "parentCommentId": "tyMEihYRHo9nftyWX", "user": {"username": "Paul_Christiano"}}, {"_id": "CBHNaFsiT66SdBe6e", "postedAt": "2015-06-17T17:48:00.554Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Please post this analysis as a comment on the original article.</p>\n", "parentCommentId": "5AdogzFJLyZsoNwaE", "user": {"username": "curiousepic"}}, {"_id": "rfhSRYcK422mGrkDm", "postedAt": "2015-06-18T17:22:29.646Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>What do you think the average (mean) expected value of an EA group is?</p>\n", "parentCommentId": "mXzQRpD4aA22yThpi", "user": {"username": "Vincent_deB"}}, {"_id": "QbEvhegB2hHFFgpyc", "postedAt": "2015-06-18T17:23:55.755Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Is the number of reads really relevant? How come? I figure people who read content generally don't act on it, and certainly not in high impact ways.</p>\n", "parentCommentId": "usRE7KfDoBFa5JtLp", "user": {"username": "Vincent_deB"}}, {"_id": "3aZEqKv84nZzvRjjo", "postedAt": "2015-06-20T02:39:02.325Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>I don't think it's that important, but I certainly think it's relevant. I expect better and more impactful pieces to be read more often.</p>\n<p>It's cited mostly because it's a relevant fact that you couldn't infer from public info.</p>\n", "parentCommentId": "QbEvhegB2hHFFgpyc", "user": {"username": "Paul_Christiano"}}, {"_id": "Ju3v7XcMiiqY3nGic", "postedAt": "2015-06-20T02:41:38.984Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>The average is very sensitive to how many small groups there are and how many of them we choose to count as an EA group. I don't know the answer, and it doesn't seem very informative about the value of any particular group. Perhaps it would be easier to talk about the average EV per participant-hour, and $20 of EA donations was our guess of that (though it will depend on the kind of participant---there are lots of ways of recruiting participants that I would evaluate lower, and some I would evaluate higher).</p>\n", "parentCommentId": "rfhSRYcK422mGrkDm", "user": {"username": "Paul_Christiano"}}, {"_id": "BKbgeeMhMAJEeJ7JE", "postedAt": "2015-06-26T18:21:01.751Z", "postId": "6SsGAunuDYTntRHKS", "htmlBody": "<p>Done.</p>\n", "parentCommentId": "CBHNaFsiT66SdBe6e", "user": {"username": "Paul_Christiano"}}]