[{"_id": "ZzzDs4jZwSjQHwM4u", "postedAt": "2023-09-08T17:10:30.150Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Love this idea, thanks for organizing this.</p>\n", "parentCommentId": null, "user": {"username": "jaythibs"}}, {"_id": "dvdmPhcBhKkm3zxwJ", "postedAt": "2023-09-08T17:39:11.171Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I think the idea of debates like this is great, good work team!</p><p>Is there any plan to expand this to non-AI cause areas?</p>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "L4PyZSuuSSsRxyQoZ", "postedAt": "2023-09-08T18:42:42.717Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Any thoughts on using <a href=\"https://www.kialo.com/\">https://www.kialo.com/</a> or a similar tool specailized on debate?</p>", "parentCommentId": null, "user": {"username": "igor_krawczuk"}}, {"_id": "ASWvhqJdDHRZfSY7z", "postedAt": "2023-09-08T22:43:04.104Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Regardless of whether a pause has benefits, can someone succinctly explain how a pause could even be possible?  Nuclear arms pauses never meaningfully happened  - SALT treaties were decades later and didn't meaningfully reduce the \"nuclear apocalypse\" doom risk, at least for citizens living in targeted countries.  (Maybe it reduced worldwide risks)</p>\n<p>A nuclear bombardment is a quantifiable, object level thing.  You can use a special tool and draw circles on a paper map of your own cities and wargame out where the enemy will allocate their missiles if their goal is maximum destruction.  Multiply a series probability estimate of how likely the warhead will reach the target and give ful yield and add up the estimated damage.</p>\n<p>The \"we must pause\" threat of AI doom I have seen so far doesn't have any data of any threat.  And a frequent threat model is the \"treacherous turn\" - you wouldn't be able to quantify how risky the current AI systems you have at any point or their capacity for damage in numbers because the AI systems are hiding their motives and capabilities until they see a route to victory.</p>\n<p>With no data of a threat how could any policymakers agree to a pause?</p>\n<p>The other examples of human technologies we did agree to not pursue all exist and the threats are concrete.  The damage from nerve gas, CFCs, bio warfare, and human genetic engineering we have data on.</p>\n<p>As a side note the teacherous turn threat model has an obvious technical mitigation measure : use the least compute on any task by selecting from a pool of models the most efficient one.  This discourages models with the cognitive capacity for sedition or hidden capabilities as they will need more memory and compute to run.</p>\n", "parentCommentId": null, "user": {"username": "Gerald Monroe"}}, {"_id": "krNtZqzZ825B9hLbB", "postedAt": "2023-09-09T00:24:25.617Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Thanks for noticing something you thought should happen (or having it flagged to you) and making it happen!</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "bkdafg5ukyACrfpES", "postedAt": "2023-09-09T02:55:14.469Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I'm really happy to see this happening.<br><br>In fact, I'd like to see more things along these kinds of lines.<br><br>While there's a lot of good discussion on this forum, we aren't always going to end up discussing the most important topics organically. So I think it's often helpful for CEA/the mods to occasionally direct the attention of the forum towards the discussion topics that will move us forward as a community.<br><br>If we wanted to go beyond this, then I think it would be quite valuable to find two people with opposite views to work together in order to produce a high-quality distillation of any such debates.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "e7iNXxb9SH3nCbmB2", "postedAt": "2023-09-09T02:55:52.705Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I wish! I’ve been recommending this for a while but nobody bites, and usually (always?) without explanation. I often don’t take seriously many of these attempts at “debate series” if they’re not going to address some of the basic failure modes that competitive debate addresses, e.g., recording notes in a legible/explorable way to avoid the problem of arguments getting lost under layers of argument branches.</p>", "parentCommentId": "L4PyZSuuSSsRxyQoZ", "user": {"username": "Harrison D"}}, {"_id": "ErrQ86cLuTuYWYAKz", "postedAt": "2023-09-09T02:59:40.537Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Great idea, thanks for organizing!</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "vBbJQpNGdaLBbciyE", "postedAt": "2023-09-09T03:00:43.463Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>This really isn’t the right post for most of those issues/questions, and most of what you mentioned are things you should be able to find via searches on the forum, searches via Google, or maybe even just asking ChatGPT to explain it to you (maybe!). TBH your comment also just comes across quite abrasive and arrogant (especially the last paragraph), without actually appearing to be that insightful/thoughtful. But I’m not going to get into an argument on these issues.</p>\n", "parentCommentId": "ASWvhqJdDHRZfSY7z", "user": {"username": "Harrison D"}}, {"_id": "HST468tRRXmhEZsGi", "postedAt": "2023-09-09T16:14:30.200Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Thanks! I don't have concrete plans, and it seems like <a href=\"https://forum.effectivealtruism.org/posts/Bg6qxLGhsn7pQzHGX/progress-report-on-cea-s-search-for-a-new-ceo\">I might get replaced soon</a>. But I would be interested in seeing a list of other topics you would be excited for people to organize content around.</p><p>As always with these Forum events though I would like to reiterate that it really isn't that hard to email a few people and ask them if they're willing to write something about a given topic, and I would be excited for others to organize a similar things, since I'm skeptical that I will cover all the useful topics. People should feel free to DM me if they are interested in doing so and have questions about how to go about it!</p>", "parentCommentId": "dvdmPhcBhKkm3zxwJ", "user": {"username": "Ben_West"}}, {"_id": "W7C78ZT6YCbcdkSx9", "postedAt": "2023-09-09T17:51:29.290Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>At risk of compounding the hypocrisy here, criticizing a comment for being abrasive and arrogant while also saying: \"Your ideas are neither insightful nor thoughtful, just Google/ ChatGpt it\" might be showing a lack of self-awareness...</p>\n<p>But agreed that this post is probably not the best place for an argument on the feasibility of a pause, especially as the post mentions that David M will make the case for how a pause would work as part of the debate. If your concerns aren't addressed there, Gerald, that post will probably be a better place to discuss.</p>\n", "parentCommentId": "vBbJQpNGdaLBbciyE", "user": {"username": "Dzoldzaya"}}, {"_id": "DTrGNGRcb8KSyGurS", "postedAt": "2023-09-09T18:09:35.093Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Strange, unless the original comment from Gerald has been edited since I responded I think I must have misread most of the comment, as I thought it was making a different point (i.e., \"could someone explain how misalignment could happen\"). I was tired and distracted when I read it, so it wouldn't be surprising. However, the final paragraph in the comment (which I originally thought was reflected in the rest of the comment) still seems out of place and arrogant.</p>\n", "parentCommentId": "W7C78ZT6YCbcdkSx9", "user": {"username": "Harrison D"}}, {"_id": "AjLKNbMrd6oGjijzn", "postedAt": "2023-09-10T05:49:08.079Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Yeah, you should wait for the posts - it's definitely something that is worth discussion.</p>", "parentCommentId": "ASWvhqJdDHRZfSY7z", "user": {"username": "Davidmanheim"}}, {"_id": "yjSq8sLYxZCyZqoiZ", "postedAt": "2023-09-10T08:11:05.270Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>The 'final paragraph' was simply noting that when you try to make concrete AI risks - instead of an abstract machine that is overwhelmingly smarter than human intelligence and randomly aligned, but a real machine that humans have to train and run on their computers - numerous technical mitigation methods are obvious. &nbsp;The one I was alluding to was (1)</p><p>(1) <a href=\"https://www.lesswrong.com/posts/C8XTFtiA5xtje6957/deception-i-ain-t-got-time-for-that\">https://www.lesswrong.com/posts/C8XTFtiA5xtje6957/deception-i-ain-t-got-time-for-that</a></p><p>Sparsity and myopia are general alignment strategies and as it happens are general software engineering practices. &nbsp;Many of the alignment enthusiasts on lesswrong have rediscovered software architectures that already exist. &nbsp;Not just exist, but are core to software systems ranging from avionics software to web hyperscalers. &nbsp;</p><p>Sparsity happens to be TDD.</p><p>Myopia happens to be stateless microservices. &nbsp;</p>", "parentCommentId": "DTrGNGRcb8KSyGurS", "user": {"username": "Gerald Monroe"}}, {"_id": "QThhYiCMzoYgxMZW7", "postedAt": "2023-09-10T13:34:38.748Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>What do such tools offer?</p>\n", "parentCommentId": "L4PyZSuuSSsRxyQoZ", "user": {"username": "David Mears"}}, {"_id": "f2xDe9nqp3LK9iJGE", "postedAt": "2023-09-10T17:33:58.105Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>We should push for a stop to even mentioning AI in these forums. There are exponentially more higher risk issues at stake for humanity... the world is a matchbox and you're all giving it to kids to play with. No matter what you do or say, someone will work on AI somewhere. All it takes is 1 villain, and they have an army of programmers under them, because it's just that easy to be bad today, and to make others be bad.<br><br>If you invested all your time on this subject, and somehow got 75% of the world to stop working on AI, 25% will still do it. And you know for sure more than half of them will be bad actors so what have you gained?<br><br>There is so much corruption in so many other ways imaginable, so much exploitation, where countries get away with it without the UN saying a word. There are still a billion of people living in poverty, tens of thousands dying every day, and you could have stopped it by stopping corruption but you are too busy thinking about AI.</p>", "parentCommentId": null, "user": {"username": "AlanGreenspan"}}, {"_id": "iyjzK6QWakiM7NXEt", "postedAt": "2023-09-11T06:31:11.133Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>So the final post will be released on September 27th?</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "Lbp4XmduZd8g6Sbha", "postedAt": "2023-09-11T14:45:41.747Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I used such tools for a while and didn't feel much connection to them. I guess it often felt like there was no way to quantify arguments. It's not about the number but the value of the arguments before and against a point.</p>", "parentCommentId": "L4PyZSuuSSsRxyQoZ", "user": {"username": "nathan"}}, {"_id": "tBCjeTkL5pxy4KWxz", "postedAt": "2023-09-11T14:48:27.531Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Here are <a href=\"https://worldspiritsockpuppet.substack.com/p/lets-think-about-slowing-down-ai\">some other technologies that got slowed down</a>, cf <a href=\"https://forum.effectivealtruism.org/users/katja_grace?mention=user\">@Katja_Grace</a>&nbsp;</p><blockquote><p>It doesn’t look like it to me. Here are a few technologies which I’d guess have substantial economic value, where research progress or uptake appears to be drastically slower than it could be, for reasons of concern about safety or ethics</p><p>Huge amounts of medical research, including really important medical research e.g. The FDA <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7326309/#:~:text=Nonetheless%2C%20in%201978%20the%20controversy%20resulted%20in%20a%20US%20FDA%20ban%20on%20subsequent%20vaccine%20trials%20which%20was%20eventually%20overturned%2030%20years%20later.\"><u>banned</u></a> human trials of strep A vaccines from the 70s to the 2000s, in spite of <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6474463/#:~:text=Worldwide%2C%20the%20death%20toll%20is%20estimated%20at%20500%20000%20annually\"><u>500,000 global deaths every year</u></a>. A lot of people also died while covid vaccines went through all the proper trials.&nbsp;</p><p>Nuclear energy</p><p>Fracking</p><p>Various genetics things: genetic modification of foods, gene drives, early recombinant DNA researchers famously organized a moratorium and then ongoing research guidelines including prohibition of certain experiments (see the <a href=\"https://en.wikipedia.org/wiki/Asilomar_Conference_on_Recombinant_DNA\"><u>Asilomar Conference</u></a>)</p><p>Nuclear, biological, and maybe chemical weapons (or maybe these just aren’t useful)</p><p>Various human reproductive innovation: cloning of humans, genetic manipulation of humans (a notable example of an economically valuable technology that is to my knowledge barely pursued across different countries, without explicit coordination between those countries, even though it would make those countries more competitive. Someone used CRISPR on babies in China, but was <a href=\"https://www.science.org/content/article/creator-crispr-babies-nears-release-prison-where-does-embryo-editing-stand\"><u>imprisoned</u></a> for it.)</p><p>Recreational drug development</p><p>Geoengineering</p></blockquote>", "parentCommentId": "ASWvhqJdDHRZfSY7z", "user": {"username": "nathan"}}, {"_id": "uvBGNshwwiozLbMim", "postedAt": "2023-09-11T21:31:10.146Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>So do any of these not exist in some form proving the tech is real?</p>\n<p>Do any of these not have real world data of the drawbacks?</p>\n<p>Note for example human genetic engineering, we never tried that but when we edit mammals errors are common and we know the incredible cost of birth defects.  Also since we edit other mammals we know 100 percent this isn't just a possibility down the road, it's real, same tooling that works on rats will work on humans.</p>\n<p>Do any of these, if you researched the tech and developed it to it's full potential, allow you to invade every country on earth and/or threaten to kill every living person within that countrys borders?</p>\n<p>Note those last paragraph.  This is not me being edgy.  If exactly one nation has a large nuclear arsenal they could do exactly that.  Once other powers started to get nukes in the 1950s, every nation had to get their own or have trusted friends with nukes and a treaty protecting them.</p>\n<p>AGI technology if developed to it's full potential, and kept exclusive to one superpower, would allow the same.</p>\n<p>It means any multilateral agreement to stop agi research because of dangers that haven't been shown yet to exist means each party is throwing away all the benefits, like becoming incredibly wealthy, immortal, and having almost limitless automated military hardware.</p>\n<p>So much incentive to cheat it seems like a non starter.</p>\n<p>For an agreement to be even possible I think there would need to be evidence that</p>\n<p>(1) it's too dangerous to even experiment with AGI systems because it could \"break out and kill everyone\".  Break out to where?  What computers can host it?  Where are they?  How does the AGI stop humans cutting the power or bombing the racks of interconnected H100s?</p>\n<p>(2) There's no point in building models, benchmarking them, finding the ones that are safe to use and also AGI, and using them, they will all betray you.</p>\n<p>It's possible that (1,2) are true facts of reality but there is no actual evidence.</p>\n", "parentCommentId": "tBCjeTkL5pxy4KWxz", "user": {"username": "Gerald Monroe"}}, {"_id": "fQPtimzRrhupQnJ6c", "postedAt": "2023-09-12T11:53:51.770Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Re human genetic engineering, I don't think it's data on errors that is preventing it happening, it's moral disgust of eugenics. We could similarly have a taboo against AGI if enough people are scared enough of, and disgusted by, the idea of a digital alien species that doesn't share our values taking over and destroying all biological life.</p>", "parentCommentId": "uvBGNshwwiozLbMim", "user": {"username": "Greg_Colbourn"}}, {"_id": "3HDKTbEsueyukFNPe", "postedAt": "2023-09-12T17:09:45.983Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Perhaps.  I can't really engage on that because \"moral disgust\" doesn't explain multiple distinct nations with slightly different views on morality all refusing to practice it.  My main comment is I think it's helpful to look at the potential gain vs potential risks.</p>\n<p>Potential gain : yes you could identify alleles with promoters associated with the nervous system and statistically correlated with higher IQ.  20-30 years later, if this were done on large scales, people might be marginally smarter.</p>\n<p>But how much gain is this?  How long has it been since humans had the tools to even attempt genetic engineering.  Can you project any gain whatsoever 20-30 years from now?</p>\n<p>I would argue the answers are minimal, less than 10 years since reliable tools existed, and almost no gain, because in 20-30 years any task that \"average or below\" IQ individuals struggle with, AI tools will be able to complete in seconds.</p>\n<p>Potential risks : each editing error undetected in early fetal development saddles the individual human with lifelong birth defects which may require a permanent caretaker or hospitalization.  This can cost many millions, and is essentially so much liability that only a government could afford to practice genetic engineering.</p>\n<p>Governments are slow, remember it's only been about 10 years since it has been even feasible.</p>\n<p>Conclusion: the risk to benefits ratio for human genetic engineering offers minimal gain and even in the best case is slow, which means little annual roi.  The decision to say \"industrialize China\" has generated more wealth than all of humanity had prior to that point, and took only slightly longer than one iteration of human genetic engineering.</p>\n<p>The potential benefits for AI could double the wealth of humanity in a few years, aka 10-100 percent annual ROI.</p>\n", "parentCommentId": "fQPtimzRrhupQnJ6c", "user": {"username": "Gerald Monroe"}}, {"_id": "FTHE4jKWnkQS5r5fK", "postedAt": "2023-09-12T22:43:27.308Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>If everything goes according to schedule, the final debate post would be the 24th, and then it will take some undetermined amount of time after that for Scott to write his summary/conclusion. I wouldn't be that surprised if things fell behind schedule though.</p>", "parentCommentId": "iyjzK6QWakiM7NXEt", "user": {"username": "Ben_West"}}, {"_id": "jkE5xALK9QCWTg3pp", "postedAt": "2023-09-15T13:53:36.489Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I think one of the biggest concerns people have about AI is that it could possibly fake everything, but then the question is, wouldn't that better society because now everyone would assume everything onnline is fake?&nbsp;</p>", "parentCommentId": "bkdafg5ukyACrfpES", "user": {"username": "lemonzerge"}}, {"_id": "rSnL9aLXA3jXcvA8t", "postedAt": "2023-09-15T13:54:03.245Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>What i've been hearing from alot of people is one of the biggest concerns they have about AI is that it could possibly fake everything, but then the question is, wouldn't that better society because now everyone would assume everything onnline is fake?&nbsp;</p>", "parentCommentId": null, "user": {"username": "lemonzerge"}}, {"_id": "SpbuvFrNtaynqPyB3", "postedAt": "2023-09-15T14:32:00.044Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Great initiative!&nbsp;<br><br>Perhaps it'd be good to ask people who are doing some public-facing campaigning to contribute? For example, the team at the <a href=\"https://www.existentialriskobservatory.org/\">Existential Risk Observatory</a> or those behind <a href=\"https://pauseai.info/\">PauseAI</a>. I might be wrong, but I don't think anyone on the list of agreed contributors represents that specific theory of change.&nbsp;<br><br>I think a public-facing campaign is important to think about if we want to reduce the likelihood of articles such as <a href=\"https://www.politico.eu/article/rishi-sunak-artificial-intelligence-pivot-safety-summit-united-kingdom-silicon-valley-effective-altruism/\">'How Silicon Valley doomers are shaping Rishi Sunak’s AI plans'</a> being written.</p>", "parentCommentId": null, "user": {"username": "James Herbert"}}, {"_id": "EKFjgykWhQcCiuhdG", "postedAt": "2023-09-15T17:26:07.962Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Thanks for the suggestion! I expect that <a href=\"https://forum.effectivealtruism.org/users/holly_elmore?mention=user\">@Holly_Elmore</a> will represent that viewpoint. See e.g. <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5saWJzeW4uY29tLzQzODA4MS9yc3M/episode/YjlkM2UzY2YtMzY3Ny00MmZlLTljNGItY2Q0MjJhOGI5ZWUz\">this podcast</a>.</p>", "parentCommentId": "SpbuvFrNtaynqPyB3", "user": {"username": "Ben_West"}}, {"_id": "NHQZANZz6YexxJdMy", "postedAt": "2023-09-15T22:17:32.647Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Yes! My piece is about advocacy and Pause.</p>", "parentCommentId": "EKFjgykWhQcCiuhdG", "user": {"username": "Holly_Elmore"}}, {"_id": "fA7TiwMwdHxEHwS7P", "postedAt": "2023-09-15T23:32:46.523Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>It's definitely good to think about whether a pause is a good idea. Together with Joep from PauseAI, I wrote down my thoughts on the topic <a href=\"https://time.com/6295879/ai-pause-is-humanitys-best-bet-for-preventing-extinction/\">here</a>.</p><p>Since then, I have been thinking a bit on the pause and comparing it to a more <a href=\"https://jack-clark.net/2023/07/05/what-should-the-uks-100-million-foundation-model-taskforce-do/\">frequently mentioned</a> option, namely to apply model evaluations (evals) to see how dangerous a model is after training.</p><p>I think the difference between the supposedly more reasonable approach of evals and the supposedly more radical approach of a pause is actually smaller than it seems. Evals aim to detect dangerous capabilities. What will need to happen when those evals find that, indeed, a model has developed such capabilities? Then we'll need to implement a pause. Evals or a pause is mostly a choice about timing, not a fundamentally different approach.</p><p>With evals, however, we'll move precisely to the brink, look straight into the abyss, and then we plan to halt at the last possible moment. Unfortunately, though, we're in thick mist and we can't see the abyss (this is true even when we apply evals, since we don't know which capabilities will prove existentially dangerous, and since an existential event may already occur before running the evals).</p><p>And even if we would know where to halt: we'll need to make sure that the leading labs will practically succeed in pausing themselves (there may be thousands of people working there), that the models aren't getting leaked, that we'll implement the policy that's needed, that we'll sign international agreements, and that we gain support from the general public. This is all difficult work that will realistically take time.</p><p>Pausing isn't as simple as pressing a button, it's a social process. No one knowns how long that process of getting everyone on the same page will take, but it could be quite a while. Is it wise to start that process at the last possible moment, namely when the evals turn red? I don't think so. The sooner we start, the higher our chance of survival.</p><p>Also, there's a separate point that I think is not sufficiently addressed yet: we don't know how to implement a pause beyond a few years duration. If hardware and algorithms improve, frontier models could democratize. While I believe this problem can be solved by international (peaceful) regulation, I also think this will be hard and we will need good plans (hardware or data regulation proposals) for how to do this in advance. We currently don't have these, so I think working on them should be a much higher priority.</p>", "parentCommentId": null, "user": {"username": "Otto"}}, {"_id": "a6jnwtrKAeFZciWqQ", "postedAt": "2023-09-16T02:00:53.265Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>PSA: the term \"compute overhang\" or \"hardware overhang\" <a href=\"https://www.lesswrong.com/posts/icR53xeAkeuzgzsWP/taboo-compute-overhang\">has been used in many ways</a>. Today it seems to most often (but far from always) mean <i>amount labs can quickly scale up the size of the largest training run (especially because a ban on large training runs ends)</i>. When you see it or use it, make sure everyone knows what it means.</p><p>(It will come up often in this debate.)</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "TcaizZLY4pcyvuozH", "postedAt": "2023-09-16T02:20:30.454Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>PSA: if \"pause\" is not defined but seems to refer to a specific kind of government policy, it most likely means <i>policy regime that stops training runs using compute beyond a certain threshold</i>.</p>", "parentCommentId": "a6jnwtrKAeFZciWqQ", "user": {"username": "zsp"}}, {"_id": "zC8kavcDCJC2WTXqQ", "postedAt": "2023-09-16T03:50:00.701Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>PSA: <a href=\"https://blog.heim.xyz/flop-for-quantity-flop-s-for-performance/\">use \"FLOP\" for compute and \"FLOP/s\" for compute per second.</a> Avoid \"FLOPS\" and \"FLOPs.\"</p>", "parentCommentId": "a6jnwtrKAeFZciWqQ", "user": {"username": "zsp"}}, {"_id": "5G4WmnrajJ2dnRpQ6", "postedAt": "2023-09-16T11:00:37.665Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>My gut reaction is that the eval path is strongly inferior because it relies on a lot more conjunction. People need to still care about it when models get dangerous, it needs to still be relevant when they get dangerous, and the evaluations need to work at all. Compared to that, a pause seems like a more straight-forward good thing, even if it doesn't solve the problem.</p>", "parentCommentId": "fA7TiwMwdHxEHwS7P", "user": {"username": "Rafael Harth"}}, {"_id": "6Tw8sxK4igMgpPfYs", "postedAt": "2023-09-16T11:03:07.587Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>EA people tend to be more concerned about the x-risk aspect of AI, which is distinct from the social problem of fakes or AI generated content.</p>", "parentCommentId": "rSnL9aLXA3jXcvA8t", "user": {"username": "Rafael Harth"}}, {"_id": "ftikDJfQMJ6hpGePz", "postedAt": "2023-09-16T13:34:30.077Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>(Adding to this: \"FLOP\" is the plural of \"FLOP\".)</p>", "parentCommentId": "zC8kavcDCJC2WTXqQ", "user": {"username": "Will Aldred"}}, {"_id": "dBv5ZQ33mpk8H6Tgo", "postedAt": "2023-09-16T21:13:42.409Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>There's an important difference between pausing and evals: evals gets you loads of additional information. We can look at the results of the evals, discuss them and determine in what ways a model might have misuse potential (and thus try to mitigate it) or if the model is simply undeployable. If we're still unsure, we can gather more data and additionally refine our ability to perform and interpret evals.</p><p>If we (i.e. the ML community) repeatedly do this we build up a better picture of where our current capabilities lie, how evals relate to real-world impact and so on. I think this makes evals much better, and the effect will compound over time. Evals also produce concrete data that can convince skeptics (such as me - I am currently pretty skeptical of much regulation but can easily imagine eval results that would convince me). To stick with your analogy, each time we do evals we thin out the fog a bit, with the intention of clearing it before we reach the edge, as well as improving our ability to stop.</p>", "parentCommentId": "fA7TiwMwdHxEHwS7P", "user": {"username": "tommcgrath"}}, {"_id": "FZy9piygWmyXj8uu4", "postedAt": "2023-09-17T12:40:00.823Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I include links to my two old posts arguing for keeping AI development:</p><p>First I argued that AI is a necesary (almost irrepleaceable) tool to deal with the other existential risks (mainly nuclear war):</p><p><a href=\"https://forum.effectivealtruism.org/posts/6j6qgNa3uGmzJEMoN/artificial-intelligence-as-exit-strategy-from-the-age-of\">https://forum.effectivealtruism.org/posts/6j6qgNa3uGmzJEMoN/artificial-intelligence-as-exit-strategy-from-the-age-of</a></p><p>Then, that currently AI risk is simply \"too low to be measured\", and we need to be closer to AGI to develop realistic alignment work:</p><p><a href=\"https://forum.effectivealtruism.org/posts/uHeeE5d96TKowTzjA/world-and-mind-in-artificial-intelligence-arguments-against\">https://forum.effectivealtruism.org/posts/uHeeE5d96TKowTzjA/world-and-mind-in-artificial-intelligence-arguments-against</a></p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "Nf8gJ8Gwxza5L6xrg", "postedAt": "2023-09-17T13:36:28.987Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I’m trying to make “FLOPstacles” happen for things that mean we can’t just take max FLOP per GPU and multiply by number of GPUs, e.g. mem or interconnect bandwidth.</p>\n", "parentCommentId": "zC8kavcDCJC2WTXqQ", "user": {"username": "tommcgrath"}}, {"_id": "EHLdeQ7p2EZqDH7HA", "postedAt": "2023-09-17T15:13:54.445Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Will someone write about the symbolic importance of the ask for a pause?</p>\n<p>Right now, most of what has been written here on this seems focused on the techno-economics as if a pause were only about slowing down a technical process.</p>\n<p>Asking for a pause is also a signal that one is extremely serious about the risk (and by the same token, not asking for a pause but speaking about existential risks seems very hard to communicate to a broader public).</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "qa22HWNkcqwBuXSp7", "postedAt": "2023-09-17T15:57:01.514Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I completely agree, these posts focus only on whether a pause would be good or not, and not ml on whether a campaign for a pause, or a similar campaign with a different purpose could be positive EV considering all outcomes of the campaign</p>\n", "parentCommentId": "EHLdeQ7p2EZqDH7HA", "user": {"username": "NickLaing"}}, {"_id": "9tvHm4DafKXJ3nx9Z", "postedAt": "2023-09-18T08:30:29.716Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Oh I wasn't aware, thanks for correcting me!&nbsp;</p>", "parentCommentId": "EKFjgykWhQcCiuhdG", "user": {"username": "James Herbert"}}, {"_id": "toWe4xKErkZNiheXE", "postedAt": "2023-09-18T11:46:35.731Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I think Holly Elmore will probably address this, at least she did in her Filan podcast appearance:\n<a href=\"https://sites.libsyn.com/438081/12-holly-elmore-on-ai-pause\">https://sites.libsyn.com/438081/12-holly-elmore-on-ai-pause</a>.</p>\n", "parentCommentId": "EHLdeQ7p2EZqDH7HA", "user": {"username": "jackva"}}, {"_id": "bnHcuAPMpYYvZj3mw", "postedAt": "2023-09-18T22:55:54.532Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Longer/ongoing list <a href=\"https://wiki.aiimpacts.org/doku.php?id=responses_to_ai:technological_inevitability:incentivized_technologies_not_pursued:start&amp;s%5B%5D=geoengineering\">here</a>.</p>", "parentCommentId": "tBCjeTkL5pxy4KWxz", "user": {"username": "Katja_Grace"}}, {"_id": "cWri4TdzBurnJCt8Y", "postedAt": "2023-09-19T00:59:58.976Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Yes, my piece will address this and why Pause advocacy can work.</p>", "parentCommentId": "toWe4xKErkZNiheXE", "user": {"username": "Holly_Elmore"}}, {"_id": "CXvws9t8gQEhRMx4z", "postedAt": "2023-09-19T02:14:36.890Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<blockquote><p>To stick with your analogy, each time we do evals we thin out the fog a bit, with the intention of clearing it before we reach the edge, as well as improving our ability to stop.</p></blockquote><p>How does doing evals improve your ability to stop? What concrete actions will you take when an eval shows a dangerous result? Do none of them overlap with pausing?</p>", "parentCommentId": "dBv5ZQ33mpk8H6Tgo", "user": {"username": "Holly_Elmore"}}, {"_id": "sXs23KkxBzxAKYGFq", "postedAt": "2023-09-19T10:37:06.650Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I agree that immediate pause or at least a slowdown (\"moving bright line of a training compute cap\") is better/safer than a strategy that says \"continue until evals find something dangerous, then hit the brakes everywhere.\"</p><p>I also have some reservations to evals in the sense that I think they can easily make things worse if they're implemented poorly (see <a href=\"https://docs.google.com/document/d/1bcyeX1C4ujMGMsRqII7CgmNCLA6gitwpeaMTC6Bfgf0/edit\">my note here</a>).</p><p>That said, evals could complement the pause strategy. For instance:</p><p>(1) The threshold for evals to trigger further slowing could be low. If the evals have to unearth even just rudimentary deception attempts rather than something already fairly dangerous, it may not be too late when they trigger. (2) Evals could be used in combination with a pause (or slowdown) to greenlight new research. For instance, maybe select labs are allowed to go over the training compute cap if they fulfill a bunch of strict safety and safety-culture requirements and if they use the training budget increase for alignment experiments and have evals set up to show that previous models of the same kind are behaving well in all relevant respects.</p><p>So, my point is we shouldn't look at this as \"evals as an idea are inherently in tension with pausing ASAP.\"</p>", "parentCommentId": "5G4WmnrajJ2dnRpQ6", "user": {"username": "Lukas_Gloor"}}, {"_id": "GLpJJ8cwHt6wAn77v", "postedAt": "2023-09-19T10:47:33.022Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Evals showing dangerous capabilities (such as how to build a nuclear weapon) can be used to convince lawmakers that this stuff is real and imminent.</p>\n<p>Of course, you don't need that if lawmakers already agree with you – in that case, it's strictly best to not tinker with anything dangerous.</p>\n<p>But assuming that many lawmakers will remain skeptical, one function of evals could be \"drawing out an AI warning shot, making it happen in a contained and controlled environment where there's no damage.\"</p>\n<p>Of course, we wouldn't want evals teams to come up with AI capability improvements, so evals shouldn't become dangerous AI gain-of-function research. Still, it's a spectrum because even just clever prompting or small tricks can sometimes unearth hidden capabilities that the model had to begin with, and that's the sort of thing that evals should warn us about.</p>\n", "parentCommentId": "CXvws9t8gQEhRMx4z", "user": {"username": "Lukas_Gloor"}}, {"_id": "y2iszgJrNgGaeiQiS", "postedAt": "2023-09-19T10:49:42.414Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Relatedly, there's something like a soft pause or slowdown where you slow training runs using compute beyond a certain threshold, but the threshold is <i>moving</i> every year. This could be a pragmatic tweak because compute will likely get cheaper, so it becomes easier for rogue actors to circumvent the compute cap if it never moves. This soft pause idea has been referred to as \"moving bright line (of a compute cap).\"&nbsp;</p>", "parentCommentId": "TcaizZLY4pcyvuozH", "user": {"username": "Lukas_Gloor"}}, {"_id": "L7eiB7EZoyvS9KRdT", "postedAt": "2023-09-19T21:59:47.028Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I would be excited to see a debate series on the meat eater problem. It is weird to me that there's not more discussion around this in EA, since it (a) seems far from settled, and (b) could plausibly imply that one of the core strands of EA -- global health and development -- is ultimately net negative.</p>", "parentCommentId": "HST468tRRXmhEZsGi", "user": {"username": "Erich_Grunewald"}}, {"_id": "rFrtzA4ab6CmEqYTx", "postedAt": "2023-09-22T17:22:09.568Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>There are universal human psychological adaptations associated with moral disgust, so it's not that hard for 'moral disgust' to explain broad moral consensus across very different cultures. For example, murder and rape within societies are almost always considered morally disgusting, across cultures, according to the anthropological research.</p><p>It's not that big a stretch to imagine that a global consensus could be developed that leverages these moral disgust instincts to stigmatize reckless AI development. As I argued <a href=\"https://forum.effectivealtruism.org/posts/veR4W92bZsTsGgS3D/a-moral-backlash-against-ai-will-probably-slow-down-agi\">here</a>.</p>", "parentCommentId": "3HDKTbEsueyukFNPe", "user": {"username": "geoffreymiller"}}, {"_id": "rwBu4RSXNDw69jn2p", "postedAt": "2023-09-22T17:28:04.819Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>This is a great idea, and I look forward to reading the diverse views on the wisdom of an AI pause.</p><p>I do hope that the authors contributing to this discussion take seriously the idea that an 'AI pause' doesn't need to be fully formalizable at a political, legal, or regulatory level. Rather, its main power can come from promoting an informal social consensus about the serious risks of AGI development, among the general public, journalists, politicians, and the more responsible people in the AI industry.&nbsp;</p><p>In other words, the 'Pause AI' campaign might get most of its <i>actual</i> power and influence from helping to morally stigmatize reckless AI development, as I argued <a href=\"https://forum.effectivealtruism.org/posts/veR4W92bZsTsGgS3D/a-moral-backlash-against-ai-will-probably-slow-down-agi\">here</a>. &nbsp;</p><p>Thus, the people who argue that pausing AI isn't feasible, or realistic, or legal, or practical, may be missing the point. 'Pause AI' can function as a Schelling point, or focal point, or coordination mechanism, or whatever you want to call it, with respect to public discourse about the ethics of AI development.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "4SSsXRiwKjcw4ArvC", "postedAt": "2023-09-22T18:44:18.842Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Ok, so some societies have much higher murder rates than others.  Some locations, the local police de facto make murder between gang members legal, by accepting low bribes and putting minimal effort into investigation.</p>\n<p>The issue is runaway differential utility.  The few examples of human technology not exploited do not have runaway utility.  They have small payoffs delayed far into the future and large costs, and making even a small mistake makes the payoff negative.</p>\n<p>Examples : genetic engineering, human medicine, nuclear power.  Small payoffs and it's negative on the smallest error.</p>\n<p>AI is different.  It appears to have immediate more than 100 percent annual payoff.  OpenAIs revenue on a model they state cost 68 million to train is about 1 billion USD a month.  Assuming 10 percent profit margin (the rest pays for compute) that's over 100 percent annual ROI.</p>\n<p>So a society that has less moral disgust towards AI would get richer.  They spend their profits on buying more AI hardware and more research.  Over time they own a larger and larger fraction of all assets and revenue on earth.  This is why EMH forces companies towards optimal strategies, because over time the ones that fail to do so fail financially. (they fail when their cost of production becomes greater than the market price for a product.  Example: Sear.  Sears failed to modernize its logistics chain so eventually it's cost to deliver retail goods exceeds the market price for those goods).</p>\n<p>Moreover, other societies, forced to compete, have to drop some of their moral disgust and I suspect this scenario ends up like a ratchet, where inevitably a society will lose 100 percent of all disgust in order to compete.</p>\n<p>Pauses, multilateral agreements, etc can slow this down but it depends on how fast the gain is as to how long it buys you.  Unilateral agreements just free tsmc up to manufacture AI chips for the parties not signing the agreement.</p>\n", "parentCommentId": "rFrtzA4ab6CmEqYTx", "user": {"username": "Gerald Monroe"}}, {"_id": "DNjddroDKEi7K7zHk", "postedAt": "2023-09-22T20:15:06.478Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>OK, that sounds somewhat plausible, in the abstract.</p><p>But what would be your proposal to slow down and reduce extinction risk from AI development? Or do you think that risk is so low that it's not worth trying to manage it?</p>", "parentCommentId": "4SSsXRiwKjcw4ArvC", "user": {"username": "geoffreymiller"}}, {"_id": "vHdn9e7wPTTogkGJn", "postedAt": "2023-09-22T20:42:47.688Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>My proposal is to engineer powerful and reliable AI immediately, as fast as feasible.  If this is true endgame - whoever wins the race owns the planet if not the accessible universe - then spending and effort should be proportional.  It's the only way.</p>\n<p>You deal with the dangerous out of control AI by tasking your reliable models with destroying them.</p>\n<p>The core of your approach is to subdivide and validate all the subtasks.  No model is manufacturing the drones used to do this by itself, it's thousands of temporary instances.  You filter the information used to reach the combat solvers that decide how to task each drone to destroy the enemy so any begging from the enemy is never processed.  You design the killer drones with lots of low level interlocks to prevent the obvious misuse and they would use controllers maybe using conventional software so they cannot be convinced not to carry out the mission as they can't understand language.</p>\n<p>The general concept is if 99 percent of the drones are \"safe\" like this then even if escaped models are smart they just can't win.</p>\n<p>Or in more concrete terms, I am saying say a simple reliable combat solver is not going to be a lot worse than a more complex one.  That superintelligence saturates.  Simple and reliable hypersonic stealth drones are still almost as good as whatever a superintelligence cooks up etc.  It's an assumption on available utility relative to compute.</p>\n", "parentCommentId": "DNjddroDKEi7K7zHk", "user": {"username": "Gerald Monroe"}}, {"_id": "sPL6JEB5tET6fn2M4", "postedAt": "2023-09-26T18:38:19.149Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I strongly advocate against pushing for a pause on AI development. AI has immense potential to revolutionize healthcare, transportation, and various industries, enhancing efficiency and improving lives. Instead of halting progress, we should focus on responsible AI development, emphasizing ethical guidelines, transparency, and robust safety measures. A well-regulated AI landscape can address concerns while continuing to harness the countless benefits AI offers, including economic growth and scientific advancement. Let's foster innovation while ensuring AI serves humanity's best interests.</p>", "parentCommentId": null, "user": {"username": "Theiged"}}, {"_id": "vkN4REQg27tmhLoJZ", "postedAt": "2023-10-06T16:17:07.531Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I'm a long-time lurker but I registered to make this comment: While these posts are incredibly high quality, they are legally naive. There is no mention of the First Amendment or Bernstein v. Department of Justice, which is a significant gap. Yes, let's have the discussion about pausing AI and part of that should include its legality.&nbsp;</p>", "parentCommentId": null, "user": {"username": "willrinehart"}}, {"_id": "aBpKvZXpkxuqNv4fs", "postedAt": "2023-10-08T22:02:33.285Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I would be excited for you to write a post about that!</p>\n", "parentCommentId": "vkN4REQg27tmhLoJZ", "user": {"username": "Ben_West"}}, {"_id": "xNjGTe2FzFrmjCRCf", "postedAt": "2023-10-10T19:28:06.269Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>I'm surprised no one commented in response.</p>\n<p>My initial impression is that if 75% of the world was working on stopping AI, that would presumably include government and policy who could very well tell the remaining 25% that they can't work on AI.</p>\n<p>As far the infohazards of thinking about developing AI; I think that's beyond what we can do. Ada Lovelace thought about AI in the 1840's (<a href=\"https://www.nist.gov/blogs/taking-measure/ada-lovelace-worlds-first-computer-programmer-who-predicted-artificial\">https://www.nist.gov/blogs/taking-measure/ada-lovelace-worlds-first-computer-programmer-who-predicted-artificial</a>), and the possibility of massive economic gains is enough to encourage even a small number of people to continue working on it (and if fewer people are thinking about it, the competition is even smaller, thus the rewards much greater).</p>\n<p>I do agree that there are awful things going on in the world, and ideally AI will be able to solve or massively fix those problems (on a scale that humans just aren't able to).</p>\n", "parentCommentId": "f2xDe9nqp3LK9iJGE", "user": {"username": "squanchBrigade"}}, {"_id": "eqLu2c55ZNAuvQLHC", "postedAt": "2023-10-16T18:01:46.642Z", "postId": "6SvZPHAvhT5dtqefF", "htmlBody": "<p>Writing a post about it now. I'll probably crosspost to my Substack as well.&nbsp;</p>", "parentCommentId": "aBpKvZXpkxuqNv4fs", "user": {"username": "willrinehart"}}]