[{"_id": "YipBX9oMpSaJbasFN", "postedAt": "2023-07-25T00:58:30.508Z", "postId": "6sykvCXRC5rjgtoQt", "htmlBody": "<p>I love the analogy and your way of describing it. I'd like to add to the part where you say, \"there are 3 big problems you’ll encounter: 1. You’re at a much greater risk of burnout\"</p><p>I agree that overwork increases risk for burnout and I have also encountered a burnout fallacy. This is the idea that there is a 1 to 1 relationship with overwork and burnout. Our society can oversimplify burnout as a problem with overwork, therefore, take a break and overcome your burnout. Research done by Christina Maslach points to there being feelings of efficacy and cynicism that also play a role in our burnout. See <a href=\"https://forum.effectivealtruism.org/posts/NDszJWMsdLCB4MNoy/burnout-what-is-it-and-how-to-treat-it\">https://forum.effectivealtruism.org/posts/NDszJWMsdLCB4MNoy/burnout-what-is-it-and-how-to-treat-it</a> for a past EA Forum post that does a great job describing it.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Andrew Harron"}}, {"_id": "YbuSWPNrDrNPrfA4s", "postedAt": "2023-07-25T13:38:48.090Z", "postId": "6sykvCXRC5rjgtoQt", "htmlBody": "<p>Another reason you don't want to run at maximum capacity whenever you have the chance to is in order to conserve the ability to 'sprint' when you actually need/want to.<br><br>See also various related thoughts, from <a href=\"https://80000hours.org/after-hours-podcast/episodes/hannah-boettcher-mental-health-challenges/#knowing-your-own-check-engine-lights-005508\">the latest 80k After Hours episode</a> with Luisa Rodriguez interviewing Hannah Boettcher:<br><br>Luisa:</p><blockquote><p>Concretely, I very much have this if it’s the end of a workday, and I have any more energy and I’m not totally spent, I could obviously do a bit more work. Or just money: like, if I have any savings, that feels wrong. And then what do we do?</p></blockquote><p>Hannah:</p><blockquote><p>Like, every time you get a unit of mental health from the wellness factory and you’re like, “Immediately distribute to impact!” then you’re basically almost empty, or like a little bit in the red all of the time. And that’s just very risky and costly. It’s obviously painful, but it’s also going to put you at risk for burnout and for needing to take longer breaks to basically recover and care for yourself. [...] This is a hard one though. It feels <i>so</i> compelling. And the thing I remind myself of is that that feeling of compellingness is simply an incomplete description of what’s true. It does feel really compelling to use 100% of my capacity, and I do really feel that urge to allocate capacity whenever it shows up. But if and when I ever do this — which I do occasionally try versions of it — I end up feeling the effects, and it is not preferable. It’s almost like I have to tell myself, “You’re not well calibrated on this. You think that you want zero slack and ease, but you want an amount.”</p><p>[...] But what I recognise is that at times when I’ve packed my schedule as full as the numbers allow, I end up being, I think, a less thoughtful therapist. I think there is a risk of resenting the work, which I very much do not want to do. I actually genuinely love therapy and being a therapist.</p></blockquote><p>&nbsp;</p><blockquote><p>I feel like it’s probably the case that there are a bunch of examples in other contexts where systems need slack: like businesses that have budgets where they have to build in 10% budget wiggle room so that they don’t overspend or something. I wonder if having those models or those examples closer to hand would help me be like, “This is like an established pattern in the world, where no one thinks that businesses can run at 100% capacity and never have issues. They all choose to do this thing called slack. And maybe we should just trust — including for-profits who want to maximise profit — that they are doing what’s best for the company or for the aim.”</p></blockquote><p>&nbsp;</p><blockquote><p>The other big [indicator of how to know when perfectionist tendencies go from helpful to unhelpful] would be if it’s costing you in ways that are greater than the benefit of the marginal perfecting. The sorts of costs I’m thinking of are around time and opportunity costs, and also particularly losing clarity on what does and doesn’t need to be perfected. An analogy here is frugality: if you find yourself overspending on a lot of things, and you’re like, “I need to make a change,” then the corrective is not “buy nothing going forward”; it’s about conserving your resources so that you can use money to purchase more value, and not use it when it doesn’t purchase more value.</p><p><strong>I think perfectionism or optimising or things in this neighbourhood are the same, where we want to retain the option of judiciously applying the marginal rigour and precision and all the rest — </strong><i><strong>when</strong></i><strong> it is actually going to buy us more value. We have to discern when that is and isn’t the case, because otherwise we’ll run out of resources.</strong></p></blockquote><p>I'm not sure how exactly this would best port across to the computer analogy!</p>", "parentCommentId": null, "user": {"username": "David Mears"}}, {"_id": "rQBi3zxdgcNyciiL7", "postedAt": "2023-07-26T02:19:44.038Z", "postId": "6sykvCXRC5rjgtoQt", "htmlBody": "<p>I think you're quite right - and if we're going to port it over to the analogy, I would venture to say that if you know you're I'm going to need to run a high resource task at some point, you need to conserce capacity to be able to extend the limits as needed. I don't normally need to process and analyze gigabytes of data, but I need the ability to be able to on my device.</p>\n", "parentCommentId": "YbuSWPNrDrNPrfA4s", "user": {"username": "Deena Englander"}}, {"_id": "cq5hmfimNpHBYvDKw", "postedAt": "2023-08-05T06:33:47.898Z", "postId": "6sykvCXRC5rjgtoQt", "htmlBody": "<blockquote>\n<p>why restarting your device works to solve problems, but it does (yes, I did look it up, so no need to explain it</p>\n</blockquote>\n<p>I'm now stuck in \"I think I know a decent metaphor but you don't want me to share it\" land... but then maybe I'll just share it for other people. :P</p>\n<p>Basically it's less about how computers work on any technical level, and more about which state they're in. Imagine you want to walk to your favorite store. If you're at home, you probably know the way by heart and can navigate there reliably. But now imagine you've been up for a while and have been walking around for hours following some semi-random commands from different people. And by following all these unrelated commands, you've now ended up doing a handstand on some hill next to a lake on the opposite end of town, where you've never been before. It can easily happen now that, from that weird state, going to the store close to your home will not work out and you get stuck somewhere.\nRestarting the computer is basically the same as teleporting home. It's in a well defined, clean, predictable state again, where you know that most of the usual day to day actions can be performed reliably. And the longer it's running without restart, the more chances it has to, in one way or another, get into a state that makes it fail at certain tasks you want it to do.</p>\n", "parentCommentId": null, "user": {"username": "markus_over"}}, {"_id": "8NbwdvyGkxyGMisgN", "postedAt": "2023-08-06T17:42:09.326Z", "postId": "6sykvCXRC5rjgtoQt", "htmlBody": "<p>Great post! I've been applying the same metaphor to my life. But I like to think of it more as a phone than a computer since it has a battery that often needs recharging (my laptop is basically always plugged it so I like it less as a metaphor). Also just like not every phone has the same specs and battery, people don't either. So just because one person is able to do a crazy amount of things, don't feel bad that you can't.</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "yjgYDn7YEoYTgwSNe", "postedAt": "2023-08-06T17:54:12.253Z", "postId": "6sykvCXRC5rjgtoQt", "htmlBody": "<p>Great post! Another thing worth pointing out is another advantage of giving yourself capacity. I try to operate at around 80-90% capacity. This allows me time to notice and pursue better opportunities as they arise, and imo this is far more valuable to your long-term output than a flat +10% multiplier. As we know from EA resources, working on the right thing can multiply your effectiveness by 2x, 10x, or more. Giving yourself extra slack makes you less likely to get stuck in local optima.</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "yM8WWuwRR8iKcijcz", "postedAt": "2023-08-08T14:43:40.942Z", "postId": "6sykvCXRC5rjgtoQt", "htmlBody": "<p>I like that phone metaphor better.... I think I'll switch to that! Thanks for the idea.</p>", "parentCommentId": "8NbwdvyGkxyGMisgN", "user": {"username": "Deena Englander"}}]