[{"_id": "6QPuHXvaiEMkvbkRh", "postedAt": "2021-06-22T09:21:40.728Z", "postId": "6T983XLsCa6uBhFf6", "htmlBody": "<p>Hi Ben,</p><p>I really liked your article and I agree with you in what you say, especially in the most important factors: the immediate impact and the building career capital.</p><p>I would like to share with you some <a href=\"https://www.resumecoach.com/top-career-tips-after-graduation/\"><u>career tips</u></a> that I read earlier. I think they are useful for recent graduates to maximize their chances of landing their first job after college.</p><p><strong><u>Career tips for graduated</u></strong></p><p><strong>What do you want to do</strong></p><p>Now that you have finished your studies it’s very important that you are clear about what you like and how you can work on it. Find your strengths and get the most out of them.</p><p><strong>Focus on long-term goals</strong></p><p>You may have to choose a first job that you don't like too much to earn some money and work experience, that's normal. However, it is important to know what you want to be in the future and guide your professional career to achieve it.</p><p><strong>Be patient</strong></p><p>You should not lose your enthusiasm or ambition if you do not find a job quickly. Patience is a great skill and you must learn to use it from the beginning.</p><p>Not everyone gets a job in a week, you may need more. However, if you are patient and keep trying, it is very likely that you will end up finding a job that you like.</p><p><strong>Consider internships</strong></p><p>Although everyone prefers a professional job right out of the box, internships can be a good option in the long run.</p><p>In the end, an internship can be seen as a work experience and could open you the doors for a paid job in the future.</p><p><strong>Keep learning</strong></p><p>Just because you've finished college it doesn't mean you should stop learning.&nbsp; Do courses that help you improve your CV and increase your chances of getting a job.</p><p>Additionally, you may end up finding a half-time job that allows you to gain experience and money while continuing to learn.</p>", "parentCommentId": null, "user": {"username": "paul-lam"}}]