[{"_id": "YvLyobamG42MFhvQK", "postedAt": "2024-03-21T14:07:03.124Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p><strong>Executive summary:</strong> EA Philippines, one of the most active EA groups in Southeast Asia, is seeking funding to sustain its operations and initiatives after its grant recently ended.</p><p><strong>Key points:</strong></p><ol><li>EA Philippines has a strong track record of community building, organizing events, and supporting members in starting EA-aligned projects and organizations.</li><li>The group is seeking $43,000 in funding for 1 year to cover staff salaries, operational expenses, and key projects.</li><li>Planned projects include introductory and in-depth fellowships, a leadership retreat, student group resilience building, and a career planning program.</li><li>EA Philippines aims to introduce diverse new members, build member skills and confidence, provide in-depth EA knowledge, and prepare members for high-impact careers.</li><li>The current co-directors, Zian Bonoan and Sam Ackary, bring experience in EA organizing, operations, research, and advising.</li><li>Potential failure risks include issues in the global EA community deterring engagement, poorly communicating EA ideas, lack of volunteers, and internal disputes.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "cYZDvybEi7y3DZrP5", "postedAt": "2024-03-21T14:12:55.041Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Based on the posts I read, EA Philippines has always struck me as a really vibrant and enthusiastic community. I hope you achieve your funding aim.</p><p>You use manifund to fundraise, and I was wondering why you chose manifund over other platforms. I initially wanted to donate but have not, because it seems it would require me to register an account, and to convert money into some manifund account, both of which seem like a hassle. Maybe others, too, are put off by this.&nbsp;</p><p>Maybe you should add another way of financially supporting EA Philippines. If you do, let me know. I'll gladly make a small donation.</p>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "zo6YF7a2c4DQK49ek", "postedAt": "2024-03-21T18:00:53.086Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>I'd strongly suggest creating a summary and linking to the full post as a Google doc or something. At present, the length will put off potential donors from even reading it.</p>\n<p>Key questions to address in a summary:</p>\n<ol>\n<li>Why are you the BEST opportunity to donate to within this cause area?</li>\n<li>Why has EAIF decided to terminate your funding? If they think it's not cost-effective enough, why are they wrong?</li>\n<li>What are you going to accomplish with the money?</li>\n<li>Why should prospective donors believe you can execute?</li>\n</ol>\n<p>FWIW, my gut tells me that this is likely a good use of funding. The team seems dedicated, willing to work for cheap, and sufficiently proactive to make a good go of it.</p>\n", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "jFDWpPfH9oaHyZMjz", "postedAt": "2024-03-21T23:54:50.127Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Hi there, Austin from Manifund here! I can't speak for the EA Philippines team, but some reasons we think our platform is a good way for raising donations:</p><ul><li>For users like you, registering should be pretty fast, &lt;2min (you can sign up with any email or Google account). And you can easily add money via credit card; we also support bank transfers, DAF, and crypto for larger donation sizes.</li><li>As we're set up as a 501c3, US-based donors can get a tax deduction for donating to projects that we host.</li><li>On Manifund, we have a network of donors who already have their budgets loaded on our site, and sometimes regrantors as well -- last year, our regrantors had $2m to recommend to projects.<ul><li>One comparable project to EA Philippines might be AI Safety Camp, who launched with an EA Forum post like this one, and went on to raise <a href=\"https://manifund.org/projects/10th-edition-of-ai-safety-camp\">$56k on Manifund</a>!</li></ul></li><li>We've established a track record of reliable payouts &amp; operational support; we've paid out <a href=\"https://manifund.org/about\">~$3m to 128 projects</a> over the last year or so.</li></ul><p>I'd love to hear if you have any troubles using the Manifund platform; or if you have experiences with other platforms that you think serve this function better, as we're always trying to improve.</p>", "parentCommentId": "cYZDvybEi7y3DZrP5", "user": {"username": "akrolsmir"}}, {"_id": "KqiqfwPHd7cdTFNuG", "postedAt": "2024-03-22T23:21:46.959Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Great work; I hope you'll succeed with the fundraiser! Do you have blockchain-based donation options like, e.g., Rethink Priorities offers? Ideally one of the major Ethereum layer 2s or Solana? Ty!</p>", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "hwHdkWaKDYHzJxiMu", "postedAt": "2024-03-24T17:27:22.769Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Hey Dawn! At Manifund we support crypto-based donations for adding to your donation balance; USDC over Eth or Solana is preferred but we could potentially process other crypto depending on the size you have in mind. We generally prefer to do this for larger donation sizes (eg $5k+) because of the operational overhead, but I'd be willing to make an exception in this case to help support the EA Philippines folks. More details <a href=\"https://manifoldmarkets.notion.site/Donations-via-DAF-wire-ACH-crypto-02aee92e884a47e49efd4d93242e2080?pvs=4\">here</a>.</p>", "parentCommentId": "KqiqfwPHd7cdTFNuG", "user": {"username": "akrolsmir"}}, {"_id": "u2ogB6BHBFymowSZr", "postedAt": "2024-03-25T00:23:50.911Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Oh, brilliant! USDC would also be my top choice. But I'm basically paying into a DAF, and so can't get a refund if this project doesn't succeed, right? That would have a high cost in option value since I don't know whether my second-best donation opportunity will be on Manifund. Is there a way to donate to Rethink Priorities or the Center on Long-Term Risk through Manifund? That would lower-bound the cost in option value.</p>", "parentCommentId": "hwHdkWaKDYHzJxiMu", "user": {"username": "Telofy"}}, {"_id": "4oEQaLdkjJ93j8F99", "postedAt": "2024-03-25T07:09:31.023Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Hi Dawn, thanks for your interest in donating to EA Philippines! I'm unsure if I understood you correctly, but EA PH's minimum funding goal on Manifund is $500, as the team would appreciate any amount of funding. So I think if your donation is at least $400, then the project would indeed be funded, and you wouldn't need to be refunded. Let me know if this answers your concern!</p>", "parentCommentId": "u2ogB6BHBFymowSZr", "user": {"username": "BrianTan"}}, {"_id": "zJyF4RxjNCwFxMr8t", "postedAt": "2024-03-25T09:14:08.867Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Oh, great! I interpreted “This is an offer to donate this amount to the project on the condition that it eventually becomes active” to mean that the project might not become active for any number of reasons, only one of them being the funding goal.</p>", "parentCommentId": "4oEQaLdkjJ93j8F99", "user": {"username": "Telofy"}}, {"_id": "8h5yFvvWLJEnsvNxg", "postedAt": "2024-03-25T10:23:31.956Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Got it, no problem!</p>", "parentCommentId": "zJyF4RxjNCwFxMr8t", "user": {"username": "BrianTan"}}, {"_id": "FrqjJYctDnKwuBKmb", "postedAt": "2024-03-25T11:11:20.684Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Hello, thanks for dropping a comment on something others would likely want to know more about!</p><p><br>To answer your questions:</p><ol><li>We chose Manifund primarily because:<ol><li>Manifund seems like the only way EA PH can accept donations via credit card/debit card (aside from Paypal, which likely has higher fees)</li><li>Manifund has regrantors and other people that might be willing to donate to EA PH</li></ol></li><li>Considering your (probably) common sentiments, we’ve sourced other platforms people can use to send in their donations.<ol><li><strong>Paypal:</strong> <a href=\"mailto:bonoanzian@gmail.com\">bonoanzian@gmail.com</a></li><li><strong>Wise:</strong> I’ve sent you a direct message for this as it contains sensitive information. <i>I’d also note Wise only allows receiving payments up to $7,100 per month.</i></li></ol></li></ol><p>Hope these are more straightforward! Really appreciate your interest in helping out too. :)</p>", "parentCommentId": "cYZDvybEi7y3DZrP5", "user": {"username": "zianbee"}}, {"_id": "K9Brd4fwyqLXr9bvF", "postedAt": "2024-03-25T11:43:10.867Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Thanks, much appreciated. Sent a donation via Paypal.</p>", "parentCommentId": "FrqjJYctDnKwuBKmb", "user": {"username": "mhendric"}}, {"_id": "PyNggZoyjBeMiTNSg", "postedAt": "2024-03-25T11:49:44.425Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Thanks for this response, Austin. For me, three things that made me hesitant to use Manifund:&nbsp;<br>(1) requires an account<br>(2) when linking via a google account, the supabase address looks scammy as it is just 15 random characters.<br>(3) I have to pay money into an account before pledging. Given not all projects may end up taking place, this makes me nervous about wasting money (i.e. if the project does not take place). Compare this to, e.g., Kickstarter, where you only need to pay if the project takes place, yet you can pledge without loading money into Kickstarter.</p><p>&nbsp;</p><p>I do think of Manifund as a good fundraiser option; I do think that it is good to have multiple options listed for the reasons explained above.</p>", "parentCommentId": "jFDWpPfH9oaHyZMjz", "user": {"username": "mhendric"}}, {"_id": "fR68dEbqvhN2CdfQr", "postedAt": "2024-03-25T23:29:33.818Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Thanks for the feedback!</p><p>(2) hm, we could pay $10/mo for the professional tier to change the supabase URL address, the Scrooge in me didn't think it was worth it but perhaps...</p><p>(3) interesting -- I don't think we've considered an option to let people pledge without funds added yet; will see if that makes sense.</p>", "parentCommentId": "PyNggZoyjBeMiTNSg", "user": {"username": "akrolsmir"}}, {"_id": "R3Ppb5pXvmg2EHjnF", "postedAt": "2024-03-25T23:33:42.192Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>In principle we'd be happy to forward donations to RP, CLTR or other charities (in principle any 501c3, doesn't have to be EA); in practice the operational costs of tracking these things mean that we don't really want to be doing this except for larger donation sizes.</p><p>Although since EA Philippines has set its minimum project threshold at a fairly low $500, I'd 95% expect them to succeed and that this wouldn't come up.</p>", "parentCommentId": "u2ogB6BHBFymowSZr", "user": {"username": "akrolsmir"}}, {"_id": "3hh5HCM4oAzJwv4pb", "postedAt": "2024-03-26T08:44:45.204Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Yep, that makes a lot of sense. I've done donation forwarding for &lt; 10 projects once, and it was already quite time-consuming!</p>", "parentCommentId": "R3Ppb5pXvmg2EHjnF", "user": {"username": "Telofy"}}, {"_id": "W4sdkncnNrcR2YBdD", "postedAt": "2024-03-28T11:26:43.687Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>We received your donation, thank you so much <a href=\"https://forum.effectivealtruism.org/users/mhendric?mention=user\">@mhendric</a>! We sincerely appreciate your support. :) &lt;3</p>", "parentCommentId": "K9Brd4fwyqLXr9bvF", "user": {"username": "Sam Ackary"}}, {"_id": "QyveMfTzzdLjBPhf7", "postedAt": "2024-03-28T11:39:59.393Z", "postId": "6tG4m9SJSwvZfkmX6", "htmlBody": "<p>Hi John,</p><p>Thank you for your suggestion on adding a briefer at the beginning of our post. We’ve incorporated your suggestion. Our briefer can be accessed here <a href=\"https://bit.ly/EAPHStrategyFundraisingBriefer2024\">https://bit.ly/EAPHStrategyFundraisingBriefer2024</a>&nbsp;</p><p>To provide more context on why EAIF decided to terminate our funding:</p><p>EAIF told EA PH in August 2023 that they were very funding-constrained and are unable to fund projects that they would have funded in the past.&nbsp;They said if the funding context were different, they would conduct a deeper evaluation of the work EA PH did over the grant period. However, they didn’t expect to offer an additional grant even after a deeper evaluation, so they did not do a deeper evaluation. Given this and the new funding landscape, EA PH’s co-founders (Brian and Tanya) understood this decision and saw the need to rethink EA PH’s future and hire new directors that could lead and improve EA PH. With our new team and strategy, we expect to do impactful and cost-effective work. Moreover, we’re fundraising for salaries that are 40% lower per hour compared to EA PH’s previous salaries given the new funding landscape.</p><p>To quickly respond to your other points:</p><p>EA Philippines boasts a track record of community growth and tangible impact, including the establishment of student chapters, successful conferences, and numerous EA-aligned projects and organizations. Because of this, EA Philippines has demonstrated our capacity to effectively utilize funding to drive meaningful change and sustain impactful initiatives in both the Philippines and Southeast Asia. We believe we are well-positioned to execute our goals of introducing new members to EA, building skills and confidence, and providing in-depth knowledge and career preparation. We’ve detailed some of our arguments for this in the briefer above.</p><p>Thank you again, John, for your comment—this gave us a meaningful opportunity to reflect on how we can effectively communicate our goals as an organization. :)</p>", "parentCommentId": "zo6YF7a2c4DQK49ek", "user": {"username": "Sam Ackary"}}]