[{"_id": "i4X4FFdeJJ9q9adAZ", "postedAt": "2022-11-16T00:30:19.957Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>Great post, and thank you for looking into this. I have an objection to your analysis, though as you point out, there's a substantial chance that most economic growth in the future will be driven by artificial intelligence or digital people, so this doesn't end up being overly consequential. But your section on the proportion of economic growth from population increases is, I think, a bit insufficiently optimistic on that factor. Economic growth rates are often theorized to be superexponential in terms of population. Increasing population contributes to growing the economy not only because the additional people directly contribute economic activity, but because marginal people also increase the <i>growth rate</i>. The 8,000,000,001st person isn't just another worker or scientist, they're another person all eight billion previous people can bounce ideas off of. One example is prehistoric Australia, which was settled by trans-oceanic explorers, settled into a stable population level in the tens of thousands for an extremely long time, and had stagnant economic and technological growth over this period. Adding another person there wouldn't increase their growth very much, but in the population regime where the world already has ten billion people, it makes a much bigger difference.</p>", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "CAvjpEHeehxFsh4mT", "postedAt": "2022-11-16T10:12:38.587Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>Hi Robi, thanks for your response. Are you referring to the endogenous growth models, where additional people have growth effects rather than level effects as in the semi-endogenous growth model (they increase the future growth rate)? or are you referring to historical trends? I am personally not very convinced of both.</p><p>\"they're another person all eight billion previous people can bounce ideas off of\"</p><p>This seems to depend on whether people actually have more connections. Even if they have more connections AND you think that research is driven by bouncing off ideas, you might think that this positive effect is smaller than the negative effect of research duplication when the population becomes bigger. But I agree it is plausible that the relevant parameter in the semi-endogneous growth model, lambda, is greater than 1.&nbsp;</p>", "parentCommentId": "i4X4FFdeJJ9q9adAZ", "user": null}, {"_id": "PyFfqWjsDEQfF8aSD", "postedAt": "2022-11-18T07:06:45.239Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>I'm sympathetic to Robi's claim that growth rates may be a superexponential function of population. I suspect that the argument around people bouncing ideas off each other might be just one of the mechanisms.</p><p>I don't want to try to articulate all of those mechanisms here, but here's another one:</p><ul><li>Imagine some proportion (e.g. 1%) of the population has some issue which is holding back their productivity (e.g. an illness or way of working which could be improved with a productivity app)</li><li>If the total population is small, then resolving that need may be unfeasible because the addressable market is small</li><li>However in a larger population this issue could be resolved, enabling that proportion of the population to be more productive</li></ul>", "parentCommentId": "CAvjpEHeehxFsh4mT", "user": {"username": "Sanjay"}}, {"_id": "eRdKznyvwiwzFSPLk", "postedAt": "2022-11-18T07:07:20.537Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>I've been interested in seeing more research on this, so thank you for writing it.</p><p><strong>Your main argument</strong></p><p>I'm sympathetic to your claim, namely:</p><p>\"<i>Population growth is unlikely to be the best way of keeping humanity safe from extinction risks</i>\"</p><p>From what I remember of reading WWOTF, &nbsp;I didn't get the impression that MacAskill was claiming that it was the best way. (I might be misremembering) Rather, I thought his argument was:</p><p>\"<i>In a world where many people having fewer children is better for humanity's longterm future, Will thinks the sign is probably the other way round</i>\"</p><p><strong>Your 50% model</strong></p><p>I thought your claim of a 50% chance of artificial people this millennium was interesting. I tried following your guesstimate model but it was a struggle to review it. Perhaps a separate write-up focusing on this would be of value?</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "XGgfG9uPgJsjgcTEH", "postedAt": "2022-12-02T14:32:27.010Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>Population growth is an existential risk. &nbsp;The HANDY model shows many regimes where self organizing systems grow to the point of catastrophic failure. &nbsp;These models attempt to explain the fall of prior isolated civilizations, including the complete loss of population such as Easter Island and the loss or civilization such as the collapse of Teotihuacan. &nbsp;</p><p><a href=\"https://www.sciencedirect.com/science/article/pii/S0921800914000615\">https://www.sciencedirect.com/science/article/pii/S0921800914000615</a></p><p>It would be worthwhile to factor in such risks.</p>", "parentCommentId": null, "user": {"username": "TeddyW"}}, {"_id": "sFALnZpcjmAv8iks5", "postedAt": "2022-12-05T13:03:04.283Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>Charlotte sort of already addresses this, but just to clarify/emphasize: the fact that prehistoric Australia, with its low population, faced long-term economic and technological (near-)stagnation doesn't imply that adding a person to prehistoric Australia would have increased its growth rate by less than adding a person to an interconnected world of 8 billion.</p><p>The historical data on different regions' population sizes and growth rates is entirely compatible with the view that adding a person to prehistoric Australia would have increased its growth rate by more than adding a person to the world today, as implied by a more standard growth model.</p>", "parentCommentId": "i4X4FFdeJJ9q9adAZ", "user": {"username": "trammell"}}, {"_id": "kckRnB67fqJkgnfZD", "postedAt": "2022-12-05T13:18:08.281Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>Thanks for writing this! For all the discussion that population growth/decline has gotten recently in EA(/-adjacent) circles, as a potential top cause area--to the point of PWI being founded and Elon Musk going on about it--there hasn't been much in-depth assessment of the case for it, and I think this goes a fair way toward filling that gap.</p><p>One comment: you write that \"[f]or a rebound [in population growth] to happen, we would only need a single human group satisfying the following two conditions: long-run above-replacement fertility, and a high enough “retention rate”, that is, a large enough fraction of the descendants of this group continues to belong to the group.\" I think that's a good and underappreciated point, but I also think it's a bit weaker than it sounds at first, since something of a converse also holds. I.e. for permanent population decline to happen, we would only need a single human group satisfying the following two conditions: long-run below-replacement fertility, and a high enough \"attraction rate\", that is, a large enough fraction of people born outside the group continue to join the group. \"Western civilization\" has arguably been such a group for the last few generations, and it's not obvious to me that it (or its \"descendants\") won't continue to be for a very long time.</p>", "parentCommentId": null, "user": {"username": "trammell"}}, {"_id": "G5bFvs7gfxYKFAPXe", "postedAt": "2023-05-27T08:49:27.650Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>Thank you for writing this blogpost!&nbsp;<br><br>I wondered whether you also specifically looked at population <i>decline </i>in developed countries? I would have thought that the most interesting question would be along the lines: Could demographic collapse in developed countries lead to decreased civilizational resilience? As <strong>trammell </strong>pointed out: Developed countries seem to be prone to population decline in the next century, particularly if the social trend to have fewer babies continues. I think it is also a bit misleading to talk about changes in <i>total</i> world population when the <i>composition </i>of this population is changing across time too.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Niklas Lehmann"}}, {"_id": "BoHfKyxaxc2Dm7QfS", "postedAt": "2023-06-10T14:29:02.663Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>Interesting post!</p><blockquote><p>Changes to the employment-population ratio account for 0.5 p.p.</p></blockquote><p>I think you meant 0.2 pp.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "zGWq66LuneQeD3eAw", "postedAt": "2023-06-10T15:42:35.106Z", "postId": "6uwAXinuaxyssofBB", "htmlBody": "<p>This is an excellent post, but if I may offer one critique, it would be that it doesn’t answer potential issues of change in population composition. Niklas’ comment mentions this to an extent, but, to be blunt, much of my motivation for worry about population decline and stagnation is a fear of current dysgenic trends, specifically in IQ. The negative correlation between measured IQ and fertility, both within countries and between them, underlies much natalist and transhumanist sentiment.</p>\n", "parentCommentId": null, "user": {"username": "Anon Rationalist"}}]