[{"_id": "Hbh5QQkDzKqSTztqW", "postedAt": "2024-02-02T16:45:24.292Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p><strong>Executive summary</strong>: The report evaluates influencing national subsidy policies to hinder intensification of animal agriculture in Nigeria through lobbying, concluding there is insufficient evidence to recommend the intervention but outlining questions for further research.</p><p><strong>Key points</strong>:</p><ol><li>Growth in animal farming will be highest in sub-Saharan Africa; subsidies may facilitate intensification but evidence is limited and context-specific.</li><li>Evidence is insufficient to recommend lobbying to influence subsidy policies in Nigeria; landscape of animal agriculture not well mapped, policy influence seems very challenging.</li><li>Recommends research to map distribution of farming systems and understand drivers of intensification before designing interventions.</li><li>Questions for research include: mapping animal production systems, nature of intensification, role of subsidies and other drivers, government policies, external influences, farmer motivations and implications of reducing intensification.</li><li>Alternative intervention could be research project to address key knowledge gaps.</li><li>Does not recommend implementing the intervention; recommends further research through questions outlined.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "8YFHyn7gCHFFPP7Es", "postedAt": "2024-02-03T11:36:10.615Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>I haven't spent any meaningful time thinking about this question in the context of Africa. But I have a sense of worry that one of the major drivers of factory farming intensification in Africa in the future is going to be a series of technologies called precision livestock farming technologies, which include AI, robotics, cloud computing, cloud-connected electronic gadgets. In particular, AI is going to be the center of all these.</p><p>AI and robotics used in factory farming are largely still in their R&amp;D to pilot testing stages in developed countries (U.S., Canada, Japan, EU) and China. I don't see a reason why they will not get to a point where most factory farms in their countries can be, economically speaking (there might be political reasons against employing such technologies), largely run by AI and robots. And I think the costs of these AI systems and robots will go down and eventually be promoted to and sold to Africa. Their economic advantage might grow so huge that they will drive out the small holder farmers who cannot afford these systems.&nbsp;</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "PJhuuXRCJTb5Byupz", "postedAt": "2024-02-03T14:53:22.751Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Thanks for writing this! It's a great report. Some quick thoughts:</p><ul><li>Even if the removal of subsidies caused a decrease in the number of local farms, you might worry that it increases the competitiveness of foreign animal products that may have worse welfare standards (of course, removing subsidies would be a notable policy win, and spur removals in other countries).</li><li>I agree that understanding the kinds of systems used and their prevalence seems key. However, I think it's possible that we could define a lower bound of the number of animals in more intensive systems and pencil out whether an intervention seems worth it (there could still be better interventions at other parts of the intensification gradient). Getting better data sounds like it could be expensive is one concern I have.</li></ul><p>On another note, I wonder if a better way to slow the expansion of intensive livestock production in new regions might be to restrict access to critical equipment and inputs. Low/middle income countries might not have the industries to produce cages, crates, slaughter equipment, antibiotics, etc, at scale, and so may import. Influencing policymakers in countries that supply these inputs may be more tractable. For instance, it seems <a href=\"https://www.reuters.com/article/idUSKBN2BO3X5/\">the World Bank has been influenced by high-income countries to limit finance for fossil fuel projects.</a></p><p>Voters in high-income countries want action on moral issues, but often struggle to personally swallow the costs. Imposing the policies on other countries can therefore be an easy policy win for politicians. It wouldn't surprise me if bans on exports of battery cages, gestation crates, antibiotics for use in livestock and such were reasonably tractable (note: not sure antibiotic bans would be good for welfare). Of course all this comes with the complexity of what it may do to wellbeing of humans in affected countries.</p>", "parentCommentId": null, "user": {"username": "squeezy"}}, {"_id": "QQZsobZxCzTNy5naH", "postedAt": "2024-02-07T10:49:42.162Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Have you seen <a href=\"https://forum.effectivealtruism.org/posts/YfJs3ANnmFKpKhquS/the-epidemic-of-second-hand-battery-cages-being-imported\">this post on second-hand battery pages in Africa</a>? Do you think an intervention focusing on this issue would be promising? If so, what kind of intervention? Should this be focused on the exporting or importing countries?</p><p>I would be curious to get your opinion on this, as we (Animal Advocacy Africa) are currently considering different strategies to recommend/pursue.</p><p>Thank you!</p>", "parentCommentId": "PJhuuXRCJTb5Byupz", "user": {"username": "moritz-stumpe"}}, {"_id": "fJAahdcmyn7z6hcEs", "postedAt": "2024-02-07T14:02:54.635Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Thanks for your research on this Aashish! Very relevant for our work at <a href=\"https://forum.effectivealtruism.org/users/animaladvocacyafrica\">Animal Advocacy Africa</a>.<br>I'm getting the sense that policy work / lobbying could be a good idea (since your uncertainty around this has reduced as a result of your evidence review), but it should be targeted at something else than subsidies, since their path to impact is quite long and unclear? For example lobbying for better animal welfare standards might be more promising as it more directly addresses the problem (has a shorter ToC)?<br>Do you have an opinion on this? Or any other interventions you think might be more promising than addressing subsidies?</p>", "parentCommentId": null, "user": {"username": "moritz-stumpe"}}, {"_id": "Yh7iaGH85etn9oK8f", "postedAt": "2024-02-08T21:46:19.819Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Thanks for your questions, Moritz! I hadn't seen that post.&nbsp;</p><p>I don't think I could tell you with confidence that such interventions would be promising. There are a lot of steps in the causal chain that I'm unsure about.</p><ol><li>Looking at the supplementary material of <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/1477-9552.12513\">this study</a>, it seems like a lot of the second-hand cages from the EU's ban may have been sold to countries that already almost only use cage-free systems (cross-referencing with <a href=\"https://ourworldindata.org/grapher/laying-hens-cages-and-cage-free?country=GBR~USA~IND~CHN~BRA~DEU~FRA~NGA~RUS~DZA~ECU~IDN~MYS~MEX~PHL~KOR~ARE~UZB~VEN~VNM~BGD~PAK~ARG~UKR~JPN~CAN~SAU~BLR~AUS~TUR~KAZ~MAR~POL~EGY~THA\">OWID data numbers </a>). So perhaps many of second-hand cages are simply replacing old ones, rather than causing more chickens to end up in them (of course they could be used for new chickens farms ― don't know).<ol><li>Note that the OWID numbers are more recent, so it's possible some of these countries increased their cage share as a result of those sales.</li></ol></li><li>Still, it's possible that more are now being sold to e.g. Nigeria, and that this is placing new chickens in cages. So the question is: how much does the lower cost of second hand cages induce more adoption? I would think some bit, but I find it hard to say.</li><li>How concentrated is the supply of second-hand cages? Would bans in a few exporting countries/companies restrict the supply a lot?&nbsp;</li><li>What systems are they transitioning from, and what are the improvements in benefits?</li></ol><p>It also feels like this would maybe be more of delaying tactic, as producers may upgrade once they are wealthier or new cages are cheaper.<br><br>Also, from the spreadsheet you shared with me, it seems like a lot of the projected growth in chicken consumption is in Nigeria. The more the consumption growth is concentrated in one or a few countries, the more it may make sense to focus on their policies.</p><p>Sorry, I know this isn't really an answer to your questions ― it's hard to think about!</p>", "parentCommentId": "QQZsobZxCzTNy5naH", "user": {"username": "squeezy"}}, {"_id": "vTpqiWLTrJiNcBtsF", "postedAt": "2024-02-14T11:57:39.529Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Thanks for your inputs, this is great. I also didn't expect you to have the perfect answer. It's a very tricky problem.</p><p>I'll incorporate these considerations in our research!</p>", "parentCommentId": "Yh7iaGH85etn9oK8f", "user": {"username": "moritz-stumpe"}}, {"_id": "z9zaD5C7bhDQrpYXk", "postedAt": "2024-02-16T15:57:40.560Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Hi Fai, thanks for raising this consideration and I apologize for the time between your comment and my response. Although I had considered the flow of technology such as enriched cages or battery cages from the Global North to the Global South, I had not yet considered the possibility of precision farming to shape the development of animal agriculture in Africa and speed up intensification.&nbsp;</p><p>I'd be curious to hear your thoughts on the following:</p><ul><li>How concerned are you about the impact of precision agriculture technology on agricultural practices in the Global North? &nbsp;&nbsp;</li><li>Is there currently a unique window of opportunity to prevent the success and/or implementation of these technologies in agricultural systems in the Global North?</li><li>Do you have any suggestions of interventions that could be made to prevent these technologies from being adopted in Sub-Saharan Africa, such as pre-emptive policy interventions to introduce regulations against the implementation of these technologies in developing nations to protect small-holder farmers</li></ul>", "parentCommentId": "8YFHyn7gCHFFPP7Es", "user": {"username": "Aashish Khimasia"}}, {"_id": "TCmX7CQ5aTiFWwmBu", "postedAt": "2024-02-16T16:41:22.820Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Thanks for your thoughts here!&nbsp;</p><p>With regards to the first, I do agree that this would be a concern, and would be important to attempt to mitigate. Advocating for the reallocation of subsidies from animal agriculture to arable agriculture and/or the domestic production of alternative proteins, alongside carrying out public-facing messaging interventions could lead to a reduction in the level of animal production consumption and as such limit the extent to which demand for foreign animal products with poor welfare standards rises. Further, even if this cannot be directly mitigated, there are likely to be efforts to improve welfare standards in systems that are already industrialized, such as through the work of <a href=\"https://www.animalpolicyinternational.org/\">Animal Policy International</a> and the <a href=\"https://openwingalliance.org/\">Open Wing Alliance</a>. Therefore, counterfactually, there may be a net reduction in animal suffering by preventing the industrialization of agriculture in a Sub-Saharan nation like Nigeria, even if this leads to a slight increase in the scale of an already large and industrialized system, where there is more likely to be efforts to improve welfare standards.</p><p>To your second point, this is a very interesting consideration - thank you. I agree that it is worth considering whether interventions at earlier points on the gradient of intensification. A priority would be to understand what drives and facilitates farms to transition along the gradient, and how long they tend to exist at each point, in the hope of identifying particularly significant steps that could be targeted.&nbsp;</p><p>For the last point, I would have suggested you discuss this with <a href=\"https://forum.effectivealtruism.org/users/moritz-stumpe?from=search_autocomplete\">Moritz Stumpe</a>, but I see that he has already got there! My main thought is that it would be critical to determine the distribution supply of battery cages across the nations that export them, to identify whether focusing policy efforts in a few key countries would be effective to meaningfully limit supply.&nbsp;</p>", "parentCommentId": "PJhuuXRCJTb5Byupz", "user": {"username": "Aashish Khimasia"}}, {"_id": "LoHcGtBvez9ydxWWH", "postedAt": "2024-02-16T17:07:49.563Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Hey Moritz, thanks for your comment and question. I agree that the theory of change is long and the feedback loops are weak for a subsidy-focused policy intervention, and there are likely more promising as that are yet to be uncovered.&nbsp;</p><p>Lobbying for higher animal welfare standards seems promising at first glance, particularly for asks that may in practice limit the extent to which smallholder farms can intensify:</p><ul><li>limiting the stocking density of broiler hens</li><li>limiting the use of certain \"low welfare breeds\" of broiler hens</li><li>implementing cage free asks</li><li>implementing pre-slaughter stunning requirements</li></ul><p>Notably, this would require research to determine which welfare would be most tractable and have the biggest limiting effect upon industrialization. Furthermore, identifying \"win-win-win\" asks that benefit the farmer, the government and animal welfare would likely increase the tractability of this.&nbsp;</p><p>Another avenue may be exploring environmental and building regulation asks, to limit the ability to build large animal farming facilities, that may be required for high scale, intensive agriculture.</p><p>I would prioritise research into the key questions outlined in the report, to better understand the process and extent of industrialisation across major producing nations in Sub Saharan Africa, to identify other levers beyond subsidies to prevent or limit the extent of industrialisation, to reduce both the scale and intensity of animal farming. &nbsp;</p><p>I am curious to see what Animal Advocacy Africa uncover from further research into this!&nbsp;</p>", "parentCommentId": "fJAahdcmyn7z6hcEs", "user": {"username": "Aashish Khimasia"}}, {"_id": "QLBbBg2DKShFpS6rC", "postedAt": "2024-02-18T16:36:31.565Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Thanks for your perspective, I'll definitely let you know about our further research :)</p>", "parentCommentId": "LoHcGtBvez9ydxWWH", "user": {"username": "moritz-stumpe"}}, {"_id": "YjjYJdWM6beQGyBKg", "postedAt": "2024-02-19T17:42:11.478Z", "postId": "6we6erMcg4wDgvrkc", "htmlBody": "<p>Hi Aashish, thank you for your reply!</p><p>Re: your first question, I think I am very concerned about the impact of PLF techs in the global north, but it's kind of inevitable already - it will happen anyway. I think the question is how to make it develop into more animal friendly versions.</p><p>Re: your second question, I am starting to discuss with fellow advocates within the momvent on strategies to react to AI/PLF development in factory farming. I think I only have rough ideas that might be worth discussing further, but nothing worth actually implementing yet.</p><p>I think I don't have good answers to your last question because I know close to nothing about factory farming (or anything) in Africa.</p>", "parentCommentId": "z9zaD5C7bhDQrpYXk", "user": {"username": "tseyipfai@gmail.com"}}]