[{"_id": "LMtFoEfn2qLmWR8RJ", "postedAt": "2023-03-29T17:54:43.389Z", "postId": "6wPsRrEbF7qgmxPkf", "htmlBody": "<p>This is really sad news, especially coming recently after the news about plans for the <a href=\"https://www.euronews.com/green/2022/02/24/an-environmental-disaster-europe-will-soon-be-home-to-the-world-s-first-octopus-farm\">Octopus Farm in Spain</a>.</p><p>As far as EA goes, there's a quote from The Good Food Institute in the article - I wonder if anyone from there (or in the know) would be in any position to comment? I wonder if this caught GFI offguard like it did me, or if I shouldn't be surprised that a Populist Right government of a Western European country would propose something like this?</p><p>It would also be interesting to know what the likelihood of this passing is. I have a cursory-at-best knowledge of Italian Politics, but looking at the Composition of the Chamber of Deputies and the Senate<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefh9nomoziz2p\"><sup><a href=\"#fnh9nomoziz2p\">[1]</a></sup></span>, only the three right-most parties of the Parliament (Fratelli d'Italia, Lega, and Forza Italia) are needed for this to pass both chambers, so unfortunately I think this has a decent chance of passing and becoming law, subject to any constitutional challenges at national and EU level being unsuccessful.</p><p>Final point - I can't find any link to the actual name of the Bill itself, or the text, or any other reference documents, which is odd. I summise it's probably passed some internal committee and been leaked to the press before being released publicly? I still find it strange that no article I looked at actually linked to the primary source itself.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnh9nomoziz2p\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefh9nomoziz2p\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Respectively the lower and upper house of the Italian Parliament, you can see the breakdown by party here: <a href=\"https://en.wikipedia.org/wiki/Italian_Parliament\">https://en.wikipedia.org/wiki/Italian_Parliament</a>&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "XB5uiwq7i75oqGKEM", "postedAt": "2023-03-30T17:42:09.299Z", "postId": "6wPsRrEbF7qgmxPkf", "htmlBody": "<blockquote><p>I can't find any link to the actual name of the Bill itself, or the text, or any other reference documents, which is odd.</p></blockquote><p><a href=\"https://www-governo-it.translate.goog/it/articolo/comunicato-stampa-del-consiglio-dei-ministri-n-26/22212?_x_tr_sl=it&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=wapp#:~:text=SICUREZZA%20ALIMENTARE\">Here's</a> a Google Translated version of the press release from the Italian government, and <a href=\"https://www.quotidianosanita.it/allegati/allegato1680089092.pdf\">here's </a>the full draft in Italian. You should be able to copy paste the text in google translate or deepl</p><p><a href=\"https://www-ilpost-it.translate.goog/2023/03/30/carne-sintetica-bioreattori/?_x_tr_sl=it&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=wapp\">Here's</a> an (IMHO) sensible Italian article on the subject.</p><blockquote><p>It would also be interesting to know what the likelihood of this passing is. I have a cursory-at-best knowledge of Italian Politics, but looking at the Composition of the Chamber of Deputies and the Senate</p></blockquote><p>I find it very hard to predict politics, but I think it would probably at the very least need to change a lot before passing.</p>", "parentCommentId": "LMtFoEfn2qLmWR8RJ", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "tx8PnWwGmanwp4buz", "postedAt": "2023-03-30T18:05:08.042Z", "postId": "6wPsRrEbF7qgmxPkf", "htmlBody": "<p>Can you say what makes you make that prediction?</p>", "parentCommentId": "XB5uiwq7i75oqGKEM", "user": {"username": "jpaddison"}}, {"_id": "H78pmncDEeP6iTahQ", "postedAt": "2023-03-31T07:09:32.695Z", "postId": "6wPsRrEbF7qgmxPkf", "htmlBody": "<p>Once lab-grown meat is approved for human consumption in EU, it will be difficult for one country to have such national ban. I'm far from being expert on this but I understand that it would violate the common market of EU. It has to be read as mostly PR political action for current Italian government.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Pawel Rawicki"}}, {"_id": "MAgHjexxfwDb8td6G", "postedAt": "2023-05-03T08:11:22.274Z", "postId": "6wPsRrEbF7qgmxPkf", "htmlBody": "<p>I asked ChatGPT about this:&nbsp;<br>\"In general, a country within the European Union (EU) cannot unilaterally ban a specific type of food that has been approved for sale and consumption in the EU. EU food regulations are set at the EU level and are designed to create a single market for food products, with a high level of protection for human health and consumer interests.</p><p>However, there are some limited circumstances in which a country may be able to restrict or ban certain types of food within its borders. For example, if a specific food product poses a significant risk to human health, a member state may be able to take emergency measures to restrict or ban its sale. In such cases, the country must provide scientific evidence to demonstrate that the measure is necessary and proportionate to address the identified risk.</p><p>Furthermore, countries may impose additional labeling requirements or other restrictions on food products for reasons such as cultural or ethical considerations. For example, some EU countries have banned or restricted the sale of certain types of meat that are produced using particular methods, such as foie gras or halal or kosher meat, for animal welfare or religious reasons.</p><p>In any case, any measures taken by a member state must comply with EU law, and if they are found to be in breach of EU law, the European Commission may take action against the country in question.\"<br><br>I wonder if they can use \"cultural/ethical\" for this. But probably that would be a big stretch?</p>", "parentCommentId": "H78pmncDEeP6iTahQ", "user": {"username": "Ula"}}]