[{"_id": "eAbfyG3NtBrjg6f8e", "postedAt": "2022-09-07T01:14:30.253Z", "postId": "6wwK6Qduxt7mMmj8k", "htmlBody": "<p>Exciting contest! I'd encourage the creation of a tag for this contest, to help people collect and read through entries that are posted on the Forum.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "5E3eoL2B7EGMycSDs", "postedAt": "2022-09-07T20:15:07.813Z", "postId": "6wwK6Qduxt7mMmj8k", "htmlBody": "<p>Thanks, Karthik - good idea, and looks like someone has already done this on our behalf. We'll edit the post to ask people to use the tag.</p>", "parentCommentId": "eAbfyG3NtBrjg6f8e", "user": {"username": "GiveWell"}}, {"_id": "QvYdDKdAS3ADuw9J7", "postedAt": "2022-09-08T18:12:09.151Z", "postId": "6wwK6Qduxt7mMmj8k", "htmlBody": "<p>I'm really pleased to see GiveWell is doing this, and particularly that you singled out<a href=\"https://forum.effectivealtruism.org/posts/MKiqGvijAXfcBHCYJ/deworming-and-decay-replicating-givewell-s-cost\"> <u>HLI's critique of GiveWell's deworming CEA</u></a> as an example of<a href=\"https://www.givewell.org/research/change-our-mind-contest#Strong_entry\"> <u>what you'd like to see</u></a>.&nbsp;</p><p>I am, however, disappointed that the scope of the competition is so narrow and a bit confused by its name.&nbsp; The<a href=\"https://www.givewell.org/research/change-our-mind-contest\"> <u>contest page</u></a> says you <i>do </i>want people to re-analyse your existing interventions but that you <i>don't </i>want them to suggest different interventions or make&nbsp; 'purely subjective arguments' - I'm not sure what the latter bit means, but I guess it rules out any fundamental discussions about ethical worldviews or questions of how best to measure ‘good’. On this basis, it seems like you're asking people <i>not </i>to try to change your mind, but rather to check your working.</p><p>This strikes me as a lost opportunity. After all, rethinking what matters and what the top interventions are could be where we find the biggest gains.</p><p>At the risk of being a noisy, broken record, I, and the team at HLI, have long-advocated measuring impact using self-reports and argued that this could really shake up the priorities (spot the differences between these<a href=\"https://forum.effectivealtruism.org/posts/A278Run59FenZ4kae/is-effective-altruism-overlooking-human-happiness-and-mental\"> <u>2016</u></a>,<a href=\"https://forum.effectivealtruism.org/posts/FvbTKrEQWXwN5A6Tb/a-happiness-manifesto-why-and-how-effective-altruism-should\"> <u>2018</u></a> and<a href=\"https://forum.effectivealtruism.org/posts/dk48Sn6hpbMWeJo4G/to-wellby-or-not-to-wellby-measuring-non-health-non\"> <u>2022</u></a> posts). Our meta-analyses recently found that treating depression via therapy is about 9x more cost-effective than cash transfers (<a href=\"https://forum.effectivealtruism.org/posts/mY4pZSwvFCDsjorJX/donating-money-buying-happiness-new-meta-analyses-comparing\"><u>2021 analysis</u></a>;<a href=\"https://forum.effectivealtruism.org/posts/zCD98wpPt3km8aRGo/happiness-for-the-whole-household-accounting-for-household\"> <u>2022 update</u></a>), we'd previously explored how to compare life-improving to life-saving interventions using the same method and pointed out how various philosophical considerations might really change the picture (<a href=\"https://forum.effectivealtruism.org/posts/xgxzCkpKQsPwrd5W7/using-subjective-well-being-to-estimate-the-moral-weights-of-2\"><u>2020</u></a>).</p><p>I'm still not really sure what GiveWell thinks of any of this. There's been no public response except that,<a href=\"https://forum.effectivealtruism.org/posts/mY4pZSwvFCDsjorJX/donating-money-buying-happiness-new-meta-analyses-comparing?commentId=Lz7u9XDmdwLErNpin#comments\"> <u>9 months ago</u></a>, GiveWell said they were working on their own reports on group therapy and subjective wellbeing and expected to publish those in 3-6 months. It looks like all this work would fall outside this competition but, if GiveWell were open to changing their mind, this would be one good place to look.</p>", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "Zh7uwpXyxyLGQLa65", "postedAt": "2022-09-12T18:58:01.990Z", "postId": "6wwK6Qduxt7mMmj8k", "htmlBody": "<p>Hi Michael—this is Isabel Arjmand, Special Projects Officer at GiveWell. Thank you for the feedback and for HLI's critique of deworming, which played a role in inspiring this contest!</p><p>We designed this contest to incentivize critiques that are relatively straightforward for us to evaluate and particularly likely to change our mind about upcoming allocation decisions. This is our first time running a contest like this, so we wanted to keep the scope manageable. We may run future contests with different or broader prompts.</p><p>A bit more color on why we're keeping the contest's scope to our existing cost-effectiveness analyses:</p><ol><li>We believe critiques of our existing cost-effectiveness analyses will be relatively straightforward for us to review, as opposed to broader critiques, such as those that suggest we take an entirely different approach to recommending giving opportunities. We anticipate that having this well-defined scope will make it easier for us to compare and give due consideration to all entries with our current research capacity (which&nbsp;<a href=\"https://www.givewell.org/about/jobs\"><u>we are hoping to expand</u></a>!).</li><li>We're getting ready to make some large decisions about how to allocate funding across the programs we currently support at the end of the year. This contest is designed to solicit the feedback that we think has the greatest potential to improve those upcoming decisions; excellent entries could meaningfully change how we allocate funds, leading to more lives saved or improved. Broader critiques or proposals for wholly new approaches would be unlikely to influence&nbsp;<i>this year</i>’s decisions, given how much vetting we put into our allocations and how little time remains before they are finalized.</li></ol><p>Outside of this contest, we welcome feedback on all aspects of our work, and we're glad to receive those at any time via email, as blog comments on our open threads, or here on the EA Forum.&nbsp;</p><p>We appreciate your continued engagement on subjective well-being, particularly the useful feedback you provided on our draft reports explaining why we're not as optimistic about subjective well-being measures and Interpersonal Psychotherapy Groups as you are. We're still planning to publish those reports, but we're behind the timeline we originally laid out. Thanks for your patience with this!&nbsp;</p>", "parentCommentId": "QvYdDKdAS3ADuw9J7", "user": {"username": "GiveWell"}}, {"_id": "E2rqDmgXh66ydFjzC", "postedAt": "2023-01-19T23:17:53.631Z", "postId": "6wwK6Qduxt7mMmj8k", "htmlBody": "<p>Update: I overlooked some substantial discussion <a href=\"https://forum.effectivealtruism.org/posts/NFhELFno7ScuCxXMY/the-winners-of-the-change-our-mind-contest-and-some#Appendix__Discussion_of_winning_entries\">here</a></p>\n<p>I'm looking forward to further followup on ...</p>\n<ul>\n<li>how these entries changed your thinking,</li>\n<li>whether and how you incorporate the suggestions into your work, and how you decide on this</li>\n</ul>\n<p>I guess it's always good when you have a suggestion contest to explain your process for responding to the suggestions.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "fDw7Skvo8iCfiYjLJ", "postedAt": "2023-01-24T17:44:59.559Z", "postId": "6wwK6Qduxt7mMmj8k", "htmlBody": "<p>Hey, David - yes, the section of the post you linked to contains our thinking on possible changes that could result from COM Contest critiques. We are still in the process of figuring out what specific changes we might make to our analyses based on these critiques.</p>\n<p>Best,\nMiranda (GiveWell communications associate)</p>\n", "parentCommentId": "E2rqDmgXh66ydFjzC", "user": {"username": "GiveWell"}}]