[{"_id": "QjGz769s4YyejrC5H", "postedAt": "2023-12-18T14:35:04.762Z", "postId": "6wwojjnpjdQG2qeKg", "htmlBody": "<p><strong>Executive summary:</strong> The post covers ways to help people in Palestine and Israel during the war by stopping civilian deaths in Palestine, freeing Israeli hostages, and improving humanitarian conditions in Gaza.</p><p><strong>Key points:</strong></p><ol><li>Pressure U.S. politicians to call for a ceasefire, conditional aid to Israel, hostage release, and more humanitarian aid.</li><li>Protest, call, email, or mail Congress and the White House with these demands.</li><li>Donate to organizations providing medical and connectivity aid in Gaza.</li><li>Reach politicians effectively by personalizing asks, doing research, and following up.</li><li>Main goals are stopping indiscriminate bombing, freeing hostages, and allowing humanitarian aid into Gaza.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "rR59ZKcZbT3CktLpW", "postedAt": "2023-12-18T21:11:11.895Z", "postId": "6wwojjnpjdQG2qeKg", "htmlBody": "<blockquote><p>I think it is worth at least a few hours of every person's time to help people during a war and humanitarian crisis.&nbsp;</p></blockquote><p>&nbsp;</p><p>I don't think this is true, and I don't see an a priori reason to expect cause prioritization research to result in that conclusion. I also find it a little weird how often people make this sort of generalized argument for focusing on this particular conflict, when such a generalized statement should apply equally well to many more conflicts that are much more neglected and lower salience but where people rarely make this sort of argument (it feels like some sort of selective invocation of a generalizable principle).</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "yG2Ei2utDBp9yxfr5", "postedAt": "2023-12-20T16:10:14.682Z", "postId": "6wwojjnpjdQG2qeKg", "htmlBody": "<p>That makes sense, I now think I made this statement too general.</p><p>In the case of the Israel-Hamas war, how would you decide if it's worth a few hours to help?&nbsp;</p>", "parentCommentId": "rR59ZKcZbT3CktLpW", "user": {"username": "bluebird27"}}, {"_id": "7MCdbFxgnWtppnhPg", "postedAt": "2024-01-23T20:53:11.336Z", "postId": "6wwojjnpjdQG2qeKg", "htmlBody": "<p>Thanks for writing this! I always wonder how often to call about the same issue. Did you find anything about this in your research?&nbsp;</p>", "parentCommentId": null, "user": {"username": "AHF"}}]