[{"_id": "pxz7d2coxjtdTXKg4", "postedAt": "2018-04-20T19:24:54.345Z", "postId": "6x4yhyKS7bCEauuZv", "htmlBody": "<p>Okay I'm interested.</p>\n<p>You might want to look into Paul Collier's book The Bottom Billion where he talks about military interventions to stabilize the developing world.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "xRqvqxqpJJ4vbT4qc", "postedAt": "2018-04-20T20:15:03.012Z", "postId": "6x4yhyKS7bCEauuZv", "htmlBody": "<ol>\n<li><p>Why should this be considered tractable? Why should we think your approach is specifically tractable?</p>\n</li>\n<li><p>I find this visualization to be likely deceptive. The 'cost of violence' most often includes a many types of violence (domestic, community, crime, etc.) that are unaddressed by 'peacekeeping' interventions. Is my read, that your visualization is comparing a huge category with a specific part of its spend, correct?</p>\n</li>\n<li><p>Why should we focus on peacekeeping, the effect of which is very difficult to measure, instead of scaling or improving interventions on community violence, some of which already show significant promise in cost-effectiveness?</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "ExHa78aSdtDfAdYEN", "postedAt": "2018-04-22T14:49:55.193Z", "postId": "6x4yhyKS7bCEauuZv", "htmlBody": "<p>Great, feel free to email me, I'm happy to connect.  Frank at worldfaith dot org.</p>\n", "parentCommentId": "pxz7d2coxjtdTXKg4", "user": {"username": "frankfredericks"}}, {"_id": "64WnFuuLJrrrAZoMe", "postedAt": "2018-04-22T15:04:10.798Z", "postId": "6x4yhyKS7bCEauuZv", "htmlBody": "<p>Hi Josh, thank you for your thoughtful questions!  Here's my answers.</p>\n<ol>\n<li><p>We can ignore the proposed process from my article in terms of tractibility (there's a conversation to be had there, but not core to this conversation), but there is compelling evidence that on the inter-personal level, you can use social nudges to change human behaviors (probabilistically).  Danial Kahneman, Eldar Shafir, etc, how shown this in a few ways.  Contact Theory suggest this to be the case too for violence, but we don't have a measured way to turn the concept into probabilities.  I would love to find out if it's possible, so it's merely a hypothesis at this point.  I believe the social payoff would be so large that even if it's unlikely to be found, it's pursuit is worthwhile (high risk high reward in social good terms).</p>\n</li>\n<li><p>Fair enough, and perhaps worth taking up with the Institute of Economics and Peace. Also these numbers are in PPP, which annoys me since interventions would likely be funded from outside sources, so nominal terms would be more helpful.  I think the amount spent on military spending versus peacebuilding is more telling/helpful, which is nominal terms is $1.7T v. $6B respectively.  This is crucial because if a peacebuilding intervention is presented with the scientific rigor of medical interventions, we know the resources exist to scale worthy solutions.  The DoD, USAID, State Dept, and USIP already fund in this space, but increased funding would be possible with more viable solutions (or more scientific backing of existing solutions).</p>\n</li>\n<li><p>I think we're talking of one and the same. I'm speaking of peacebuilding (as opposed to Peacekeeping) My hypothesis is to focus on the science of the individual's response to a peacebuilding intervention, not the wider systems where violence is happening.  Incidentally, there's already several organizations looking at systems modeling and violence, both in predicting when/where violence will happen, and interventions on that level.  I believe if it's possible, those existing initiatives will find it.  However, my invitation here isn't as focused on validated my own hypothesis (I'm working on that elsewhere), but rather to evaluate this problem space from an EA point of view.  </p>\n</li>\n</ol>\n<p>You've asked some great questions here, is this a topic you're interested in digging into?</p>\n", "parentCommentId": "xRqvqxqpJJ4vbT4qc", "user": {"username": "frankfredericks"}}, {"_id": "vFpYnu4gF63qZq66e", "postedAt": "2018-04-24T00:23:45.029Z", "postId": "6x4yhyKS7bCEauuZv", "htmlBody": "<p>I just noticed the article you linked. In the future it's probably best to put all the arguments here on this forum, where you can add more details and EA-specific information.</p>\n<p>Your idea seems to be figuring out a way of assessing individuals' propensity for violence, and then seeing what changes that. But that's not how war happens. It happens at the level of societies and nations as a result of more complicated dynamics.</p>\n<p>Individuals don't have a clear, easy-to-study propensity for violence. It's a complicated thing that depends on the environment. In behavioral economics, we can study consumer choice and come up with descriptive decision theories because everything is about money, which is interchangeable and easy to measure and used for everything. The equivalent of this would be a study of individuals' propensity to go to college or something like that. We can study such things, but not in the same way and not with the same kind of results.</p>\n<p>And only a small proportion of a population will ever become militants. This makes it very hard to study in a statistically rigorous way. If 1% of people will become a militant, then a survey of 1,000 people reaches only ten future militants on average. This creates numerous statistical problems.</p>\n<p>In a very general sense, sure you could say X causes people to engage in violence, let's reduce X, and then violence is reduced in expectation. But that just sounds like normal research that probably already exists.</p>\n<p>Finally, it seems to me that interventions which target the people who actually are violent are likely to be more effective. If 1% of people become militants then generic interventions will have to be 50-100x cheaper.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "KfaBARCdRDGYowxvF", "postedAt": "2018-04-25T21:04:13.733Z", "postId": "6x4yhyKS7bCEauuZv", "htmlBody": "<p>The Pearson Institute for the Study and Resolution of Global Conflicts at the University of Chicago is a relatively new research center working on these types of issues. \n<a href=\"https://thepearsoninstitute.org/research/overview\">https://thepearsoninstitute.org/research/overview</a></p>\n<p>I haven't looked closely at their work but the Director is James Robinson, a top development economist who researches the effects of institutions and the causes of failed states. Chris Blattman, an economist who is particularly thoughtful about the design of RCTs works there, too. Blattman has done a bunch of work with former militants including trials of the effectiveness of CBT and attempts to predict violence and conflict.</p>\n<p>Some of Blattman's current working papers: </p>\n<p>&quot;Pushing crime around the corner? Estimating experimental impacts of large-scale security interventions, with Donald Green, Daniel Ortega, and Santiago Tobón</p>\n<p>“The Limits of Conflict Prediction: Evidence from Colombia and Indonesia” with Samuel Bazzi, Robert Blair, Oeindrila Dube, Matthew Gudgeon, and Richard Peck</p>\n<p>“Engineering informal institutions: Experimental impacts of alternative dispute resolution on violence and property rights in Liberia” with Alexandra Hartman and Robert Blair\n<a href=\"https://chrisblattman.com/research/\">https://chrisblattman.com/research/</a></p>\n", "parentCommentId": null, "user": {"username": "HowieL"}}]