[{"_id": "Hpy59rh6gonXbxzsj", "postedAt": "2022-09-11T12:57:52.770Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>The book, in case anyone is wondering, is <i>The Art of Community</i> by Charles H. Vogl, and is very good. I'm grateful to the CEA.</p>", "parentCommentId": null, "user": {"username": "Sam Brown"}}, {"_id": "kRWdjuZHitRb3uoW5", "postedAt": "2022-09-11T22:52:20.552Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>This was really well-written, thanks.</p>\n", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "FXYhmJxKmtdZBX7nn", "postedAt": "2022-09-11T23:46:26.885Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>Thanks for sharing your experiences here Sam.</p><p>Something that I find quite difficult is the fact that all of these things are true, but hard to 'feel' true at the same time:</p><ol><li>We have increased available funding by an order of magnitude over the past decade and increased the rate at which that funding is being deployed</li><li>We don't want lack of funds to be the reason that people don't do important and ambitious things; and yet</li><li>We are still <i><strong>extremely</strong></i> funding constrained in most cases</li></ol><p>You're experiencing a bit of #1 and #2 right now. And I think that the huge upsides to that is (a) we're have good a shot of doing a <i><strong>lot</strong></i> more good; and (b) EA is less likely to be the pursuit of the already privileged (e.g. those who can afford to fly to a conference in SF or London or quit their job to pursue something that the world doesn't compensate for its value).</p><p>I'm glad that access to funding hasn't been a barrier for your pursuit of doing a lot of good.</p><p>Regarding #3.</p><p>It still stings every time I hear the funding situation talked about as if it's perpetually solved.</p><p>I'm glad that a promising AI safety researcher is likely to find the funding they need to switch careers and some of the top projects are able to absorb that talent without needing to beg for funding from everyday donors...</p><p>But I still feel very deeply the opportunity cost of not funding more bednets while AMF still has a funding gap. I sometimes struggle to sleep based on the fact that we haven't yet transferred at least 1 trillion dollars to the extreme poor to double their income and get them above &nbsp;the extreme poverty line. I still feel very deeply the anxiety of being unprepared for the next superpandemic and that we don't have nearly have enough resources for the kinds of megaprojects needed to build resilience. And I haven't even touched on animals and how far we could go if we had the resources.</p><p>I'm going to write about this soon.</p>", "parentCommentId": null, "user": {"username": "Luke Freeman"}}, {"_id": "w7wJeZncyeKQxr5dp", "postedAt": "2022-09-11T23:48:45.674Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<blockquote><p>people were writing plans on a whiteboard for how we could spend the effectively-infinite amount of money we could ask for.</p></blockquote><p>It's a common exercise when doing ambitious brainstorming to start with the premise of \"if money was no object\" and then later come back through the ideas and think about feasibility. Turning off the critical brain can sometimes help with creativity and this is one way of doing that.&nbsp;</p><p>I've run sessions like this within EA and also within other organisations/communities. However, as a facilitator it's always important to be clear that you're not giving people the impression that there are no constraints, but that you don't want them to think about the constraints while being ambitious and creative.</p>", "parentCommentId": "FXYhmJxKmtdZBX7nn", "user": {"username": "Luke Freeman"}}, {"_id": "osrKjPv8LiuKySCp7", "postedAt": "2022-09-12T00:47:50.650Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>Thanks for writing this. I've had very little in-person interaction with EAs, but even having only read about it on the forum the whole class/wealth/money issue is something that has often made me feel weird, too.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "rbF44dCyj9xGTCu7n", "postedAt": "2022-09-12T01:21:42.465Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>There’s a hunger in EA for personal stories - what life is like outside of forum posts for people doing the work, getting grants, being human. Thank you for sharing.</p>\n<p>(Note: personal feelings below, very proud of / keen to support your work)</p>\n<p>I’m struck by how differently I felt reading about this funding example, coming from my circumstances. I work in private sector with job stability and hope to build a family. The thought of existing on 6-month grants / frequently changing locations, is scary to me. Health insurance (US), planning financial future, kids, etc. I’ve spoken to many EAs who are in a way more transient living situation than I could handle. Suspect that’s true for many, but not all, mid-career folks.</p>\n", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "XtWfG4F5cEziCCGmd", "postedAt": "2022-09-12T02:13:03.897Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>Anyone getting these vibes from Luke's comment? :&gt;&nbsp;<br><a href=\"https://ourworldindata.org/much-better-awful-can-be-better\">https://ourworldindata.org/much-better-awful-can-be-better</a></p>", "parentCommentId": "FXYhmJxKmtdZBX7nn", "user": {"username": "Daryl D'Souza"}}, {"_id": "gjSSDHzQ8KrttsAW7", "postedAt": "2022-09-12T07:57:29.297Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>Thanks for writing this Sam. I think there's a lot of value in hearing people's stories in this way</p>", "parentCommentId": null, "user": {"username": "Jordan Pieters"}}, {"_id": "dADqEeB3HfAauXc7g", "postedAt": "2022-09-12T12:27:12.708Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>You're very welcome, I'm glad you like it :)</p><p>It possibly worth me mentioning that my level of transience is pretty whole-heartedly chosen: I gave up job stability for this (startup was successful). I picked 6 months because that seemed like a good amount of time to explore the possibility of doing this for longer, I considered applying for 12 months (which I don't think would have negatively affected my application) but mainly worried about over-committing. I know people &nbsp;at TH who have 4 year contracts, which I'd consider relatively stable.<br><br>While I live on a boat, the boat doesn't move that fast &amp; I'm planning on Oxford being my UK base for the next decade (with some months abroad). Health insurance is a non-issue here, and since I now own the boat I don't pay rent either. So I feel pretty stable, really, even though my home sways when the rowers come past.</p>", "parentCommentId": "rbF44dCyj9xGTCu7n", "user": {"username": "Sam Brown"}}, {"_id": "6FuoP9xqkGWo7mFfq", "postedAt": "2022-09-12T14:16:00.111Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>What did you state for appropriate \"research need\" when applying for the Bodleian Library of the University of Oxford?</p><p>I am currently looking for working spaces within Oxford, and think I would benefit from access. But the form seems to indicate one needs quite a strong reason for access, such as for a particular book.</p><p>This comment is slightly tangential from the post contents, but I thought it would be better as a comment than a private message where the knowledge is lost forever. Thanks for writing this post - I enjoyed the tone and statement of observations.</p>", "parentCommentId": null, "user": {"username": "an oxford ea"}}, {"_id": "geMaP3BMcdkTX3xbr", "postedAt": "2022-09-12T20:34:03.571Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>I basically told them I was researching AI safety, and could point to a handful of relevant books which I genuinely wanted to read, which were in the Bodleian but not in e.g. the county library. &nbsp;I think you can search their catalogue at <a href=\"https://solo.bodleian.ox.ac.uk\">https://solo.bodleian.ox.ac.uk</a> even without an account, which is quite helpful.</p><p>Common Ground on Little Clarendon Street is a good shout in the meantime, and the Country Library in Westgate is a decent change of scenery.</p>", "parentCommentId": "6FuoP9xqkGWo7mFfq", "user": {"username": "Sam Brown"}}, {"_id": "3fZDPvxww7vMRZb3e", "postedAt": "2022-09-14T06:41:18.511Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>I have the same feeling about the idea of subsisting on short-term grants -- it sounds awesome, but way too transient and unstable for me to really consider.  I wrote a post about this here: <a href=\"https://forum.effectivealtruism.org/posts/KdhEAu6pFnfPwA5hf/grantees-how-do-you-structure-your-finances-and-career\">https://forum.effectivealtruism.org/posts/KdhEAu6pFnfPwA5hf/grantees-how-do-you-structure-your-finances-and-career</a></p>\n", "parentCommentId": "rbF44dCyj9xGTCu7n", "user": {"username": "Jackson Wagner"}}, {"_id": "33wbvbzSBrkSTHG6m", "postedAt": "2022-09-16T05:11:13.132Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/5Xio8uECTH3GqYARc/we-re-still-extremely-funding-constrained-but-don-t-let-fear\">I did write about this</a>, but decided to mostly write it in poem format followed by a postscript.</p>", "parentCommentId": "FXYhmJxKmtdZBX7nn", "user": {"username": "Luke Freeman"}}, {"_id": "goWrD3AAFQEfdfGpc", "postedAt": "2023-01-04T20:19:34.768Z", "postId": "6xX96ZqFtH5n7mchW", "htmlBody": "<p>I'd be interested in an update on this post :)</p>", "parentCommentId": null, "user": {"username": "Jonathan Claybrough"}}]