[{"_id": "5DFQDRX5HCqpuw6ub", "postedAt": "2023-12-20T15:41:13.333Z", "postId": "6y4nS9A6WYiaFS9Kp", "htmlBody": "<p>First, this article is very well articulated, which is quite the feat considering the wide array of topics it covers. Bravo, FalseCogs. And the perspective of increasing entropy as the end-goal of life, instead of a detriment to it, is original.</p>\n<p>I will start with what I agree with in this article. First, organizing society into organ-agent-system levels seems like a good start in organizing a myriad of phenomena that make up life. I agree that each of these levels serve each other, because if they did not, the higher levels would cease to exist. (Examples of this would be heart failure for the organ-agent level or the behaviors of solitary animals, like for the agent-system level. An example for the latter is the jaguar, whom is only social to mate. Because of this, they lack the survival benefits of being in a social group.)</p>\n<p>Now, I have a few questions. Please correct me if these questions misunderstand your article</p>\n<ol>\n<li>Why do you attribute “life” to having a goal? Wouldn’t that be a personification of life, which I think is wrong since science has show us the indifference of matter to everything other than the laws of nature?</li>\n<li>What evidence do you have of strong AI being able to exist?</li>\n<li>Given that the strong AI exists, what if the strong narrow AI determines that life does not want humanity to exist? Should that be the goal of the strong, general AI?</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "TheFlyingEil"}}, {"_id": "qWKTBzkTMrbPMezXu", "postedAt": "2024-03-24T09:42:30.710Z", "postId": "6y4nS9A6WYiaFS9Kp", "htmlBody": "<p>Thanks for the comment. &nbsp;It's nice to see someone getting something out of it.</p><p>On the topic of life having goals, it's not that the universe necessarily has an <i>end </i>goal, but that, like the seasons on Earth, each <i>period </i>(or spacetime region)<i> </i>may have a shared (observably universal) <i>tendency</i>, and those pursuits or actions which follow that tendency should flow most smoothly. &nbsp;Moreover, the goals and aims of human and other life <i>already </i>seem to follow this tendency. &nbsp;And the higher-level emergent aspects of this inter-level tendency seem <i>already </i>the basis for human moral and legal frameworks, though with a certain jitter, or <i>error margin --</i> presumably due to the inherent entropy of human inference, coupled with the limitations of common human intellect and the limited scope of applicable consideration.</p><p>The key here is the inherent <i>transcendence </i>of what we're already doing, where in the long run, it <i>doesn't matter</i> what we may think or feel at a given point along the journey of evolution -- we're already and inescapably serving that tendency. &nbsp;If I or anyone else hadn't said this, someone or something else likely would have. &nbsp;It doesn't belong to me or anyone else, though I don't mean to suggest I have it described accurately. &nbsp;I see myself here as mere observer, though perhaps nothing at all.</p><p>On the topic of strong AI being able to exist, my stance is mostly based on my understandings of neurology and psychology, mixed with my subjective experience of non-doership and object-observer non-separation. &nbsp;Naturally I don't expect everyone to share this belief about AI. &nbsp;And of course it's just an assumption based on one mind's current limited reason and experience. &nbsp;The philosophical basis for the non-duality of qualia is curious, but I'll refrain from going there at the moment, particularly as it too seems at least partly based on assumption.</p><p>On the topic of the prospect of \"anti-human\" tendency being inferred, the answer comes back to that mentioned above, in that <i>if so</i>, then humans are <i>already and inherently</i> of and for that end, even if unknown or seemingly unwanted. &nbsp;Indeed this idea seems fatalist. &nbsp;But that doesn't necessarily make it false. &nbsp;Realistically, humans may be less likely to be determined \"unwanted\" as \"made-to-order\" for a particular purpose -- a purpose perhaps temporary and specific to an occasional or spacetime-regional set of conditions. &nbsp;Some humans, given such prospect, might find comfort in transhumanist or posthumanist ideas, such as mind-uploading, memory-uploading, or slowly merging into something else.</p>", "parentCommentId": "5DFQDRX5HCqpuw6ub", "user": {"username": "FalseCogs"}}]