[{"_id": "RhxkDvypNf83TJfBc", "postedAt": "2023-08-31T06:41:12.552Z", "postId": "6yq9TTJKvJnrgT4E2", "htmlBody": "<p>My conclusion from this, and other situations I've seen, is that you can arrive at a robust modelling or scientific conclusion (eg: under standard assumptions, PEPFAR isn't cost effective). But working out the policy or other action-relevant implications of that conclusion is likely at least as hard as coming to that conclusion.</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "atCH8g3LBLtBe6gxy", "postedAt": "2023-09-01T07:02:52.749Z", "postId": "6yq9TTJKvJnrgT4E2", "htmlBody": "<p>I liked this recent interview with Mark Dybul who worked on PEPFAR from the start: <a href=\"https://www.statecraft.pub/p/saving-twenty-million-lives\">https://www.statecraft.pub/p/saving-twenty-million-lives</a></p>\n<p>One interesting contrast with the conclusion in this post is that Dybul thinks that PEPFAR's success was a direct consequence of how it didn't involve too many people and departments early on — because the negotiations would have been too drawn out and too many parties would have tried to get pieces of control. So maybe a transparent process that embraced complexity wouldn't have achieved much, in practice.</p>\n<p>(At other parts in the process he leaned farther towards transparency than was standard — sharing a ton of information with congress.)</p>\n", "parentCommentId": null, "user": {"username": "Lukas_Finnveden"}}, {"_id": "yraYLdkgqJ7StHBb2", "postedAt": "2023-09-01T17:00:38.994Z", "postId": "6yq9TTJKvJnrgT4E2", "htmlBody": "<p>Thanks for your comment and I agree. Modelling (even rigorous modelling) is just that, a model. It's a simplification of a more complex reality. We should not mistake the map for the territory, but equally, not using a map would be foolish.&nbsp;</p>", "parentCommentId": "RhxkDvypNf83TJfBc", "user": {"username": "TomDrake"}}, {"_id": "zJTcKyir4nA4uuzrx", "postedAt": "2023-09-01T17:13:16.065Z", "postId": "6yq9TTJKvJnrgT4E2", "htmlBody": "<p>Thanks for sharing - it’s an interesting interview. My first reaction is that interdepartmental bureaucracy is quite a different beast to an evidence-to-policy process. I agree that splitting development policy/programmes across multiple government depts causes lots of problems and is generally to be avoided if possible (I’m thinking about the UK system but imagine the challenges are similar in the US and elsewhere).</p><p>Of course you do need some bureaucracy to facilitate evidence-to-policy too, but on the whole I think it’s absolutely worth the time. For public policy we should aim to make a small number of decisions really well. The idea a small efficient group who just know what to do and crack on is appealing; it’s a more heroic narrative than a careful weighing of the evidence. Though I can’t imagine the users of this forum need persuading of the importance of using evidence to do better than our intuitions and overcome our biases.&nbsp;</p><p>Incidentally, I feel this kind of we-know-what-to-do-let’s-crack-on instinct is more acceptable in development policy than domestic, and in my view development policy would benefit from being much more considered. We cause a lot of chaos and harm to systems in LMICs in the way we offer development assistance, even through programmes that are supporting valuable services. I think all of the major GHI’s do great work, but all could benefit from substantial reforms. Though again, this is somewhat separate from the point about interdepartmental bureaucracy.&nbsp;</p>", "parentCommentId": "atCH8g3LBLtBe6gxy", "user": {"username": "TomDrake"}}]