[{"_id": "4NAAe6CxmN5EB7EFD", "postedAt": "2014-12-16T05:11:40.938Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>I think it's a good idea to summarize books like this, and I found it well-executed.</p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "PrAxSuaxqa3S3Qwwm", "postedAt": "2014-12-16T13:16:06.133Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<blockquote>\n<p>In addition to commenting on what you think of the summary, it would be interesting to get feedback on how useful you think these sorts of summaries are. On one hand, I think in reading my summary you can, in a single sitting, get 90+ percent of what you'd get from reading the 200+ page book. The persuasion principles are also applied to animal activism, adding a new angle to the original book. On the other hand, how much is actually being gained here? Will the people that read this summary be people that already know this stuff? Should I bother writing more?</p>\n</blockquote>\n<p>I'd be really keen for people to reflect on these questions, because I've considered contracting people to write more summaries of important books.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "R8WS8soZrvur6fYfE", "postedAt": "2014-12-16T20:47:21.583Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>To give you a datapoint - personally I'd be more likely to read a significantly shorter summary, say 2-5 pages. I guess you'd reach a broader audience. The downside would be that the most interested people, who would read the whole thing, would miss some of the details. With many things I read I would often appreciate having a short version AND a longer, more detailed one actually, so having both would add value. All in all, I think you're doing valuable work. </p>\n<p>Maybe also consider making a summary on Wikipedia or improving it. It may get many more viewers amongst other things (<a href=\"http://reducing-suffering.org/the-value-of-wikipedia-contributions-in-social-sciences)\">http://reducing-suffering.org/the-value-of-wikipedia-contributions-in-social-sciences)</a>. I'm not sure which option is better.</p>\n<p>Btw: There's an Anki-deck for Cialdini's book. It might be somewhat less useful if you've only read the summary though, because you may have skipped some of the examples in it. (<a href=\"https://ankiweb.net/shared/info/2834764538\">https://ankiweb.net/shared/info/2834764538</a>)</p>\n", "parentCommentId": null, "user": null}, {"_id": "oEiMArvQtyi9rENHR", "postedAt": "2014-12-17T02:07:17.144Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>Just for you, I threw together an <a href=\"https://docs.google.com/document/d/1RW9LXaVuzoT8AJehL3L-5PRghSAZwRpSP_IeWkyz2Sg/edit?usp=sharing\">&lt;3 page summary</a> but I think it's a lot less useful. It summarizes the basic idea of the book but has no room for examples.</p>\n", "parentCommentId": "R8WS8soZrvur6fYfE", "user": {"username": "Bitton"}}, {"_id": "kibEnpyT5Sx9pvbHu", "postedAt": "2014-12-17T09:55:36.453Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>Thank you, I liked it!</p>\n", "parentCommentId": "oEiMArvQtyi9rENHR", "user": null}, {"_id": "jzS9mPHfFqrz2Zfff", "postedAt": "2014-12-17T18:10:47.508Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>Thanks, I think the summary of the summary is very useful -- particularly when the longer summary exists, having the shorter summary is great for finding out whether it's worth the time to read the longer summary.</p>\n", "parentCommentId": "kibEnpyT5Sx9pvbHu", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "Ccmhve2tNMHf7qri9", "postedAt": "2014-12-21T01:41:19.919Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>Any suggestions on what would be most useful and practical to summarize? Peter's list was geared toward marketing, outreach, persuasion, and activism. I think that's a good idea. I've started working on a marketing textbook called <a href=\"http://occupytampa.org/files/tristan/tlib/Philip_Kotler,_Gary_Armstrong_Principles_of_Marketing_14th_Edition____2011.pdf\">Principles of Marketing</a> but I can tell that it's going to take me a <em>very</em> long time to do well and I might give up on it after the first chapter.</p>\n", "parentCommentId": "4NAAe6CxmN5EB7EFD", "user": {"username": "Bitton"}}, {"_id": "rneCxhhTrtZihYPAd", "postedAt": "2014-12-21T10:43:13.701Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>Why marketing, outreach, persuasion and activism?</p>\n<p>Personally, I'm currently interested in marketing moreso than those other three. </p>\n<p>I'd also be interested in startups, business development, consulting, politics, the history of academic movements, biographies and anything on Nick Beckstead's <a href=\"http://www.nickbeckstead.com/audiobooks\">reading list</a>! And that's just the general topics.</p>\n<p>Most of all, I'd be interested in summaries of books about technological change, futurism, risk forecasting and attempts at political intervention in risky technologies.</p>\n", "parentCommentId": "Ccmhve2tNMHf7qri9", "user": {"username": "RyanCarey"}}, {"_id": "KQsmqw3m2eLdCnXY4", "postedAt": "2014-12-21T15:49:45.043Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>Hypothetically, how much money, if any, would you pay to have a summary produced of a particular book?</p>\n", "parentCommentId": "rneCxhhTrtZihYPAd", "user": {"username": "Peter_Hurford"}}, {"_id": "qn4sXeBD4g9niuDJg", "postedAt": "2014-12-21T17:44:52.035Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>Personally, I'd pay like 10c to consume particular summaries. Altruistically, I'd want Eliezer's writing summarised, and would pay a few of orders of magnitude more for a summary of a <a href=\"http://wiki.lesswrong.com/wiki/Sequences#Mysterious_Answers_to_Mysterious_Questions\">sequence</a>, depending significantly on the summarising author.</p>\n", "parentCommentId": "KQsmqw3m2eLdCnXY4", "user": {"username": "RyanCarey"}}, {"_id": "2fk8ETN4qaWPRWbNi", "postedAt": "2014-12-21T18:24:05.071Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>I'd consider summarizing a sequence.</p>\n", "parentCommentId": "qn4sXeBD4g9niuDJg", "user": {"username": "Bitton"}}, {"_id": "QfhHHFe59tJR29Kov", "postedAt": "2014-12-22T02:54:55.498Z", "postId": "6YrXuiBxgwsX8HGm8", "htmlBody": "<p>How about co-creating summaries together?</p>\n<p><a href=\"https://docs.google.com/document/d/1kzTvG8cTT67TFf1bcH7xKWw5i3o8nwTD_Q7GUOpO7ro/edit?usp=sharing\">Here</a>’s my summary of Chapter 1 of Principles of Marketing. It took me 4 hours of work. <a href=\"http://occupytampa.org/files/tristan/tlib/Philip_Kotler,_Gary_Armstrong_Principles_of_Marketing_14th_Edition____2011.pdf\">Here</a> is a link to the book.</p>\n<p>Anybody reading this can feel free to edit my writing or work on upcoming chapters. If everybody works on it a little at a time, it could get done several times faster than if I summarize the 600 page book on my own. Summarizing books seems perfectly suited for crowdsourcing.</p>\n", "parentCommentId": "qn4sXeBD4g9niuDJg", "user": {"username": "Bitton"}}]