[{"_id": "rCuB8eKykCw5w3NXG", "postedAt": "2023-09-05T20:34:48.334Z", "postId": "6Z7SShHa5fnadLm3G", "htmlBody": "<p>Thank you for sharing this! Here's a <a href=\"https://docs.google.com/document/d/1qDxzdjKxR3veKioKhsPtMX1N6O68Ym71Hy55JH5nNFs/edit?usp=sharing\">guide</a> that includes links to some other codes of conduct from EA groups.</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "NaqcNzZo7oxAZNyJQ", "postedAt": "2023-09-07T12:22:17.936Z", "postId": "6Z7SShHa5fnadLm3G", "htmlBody": "<p><strong>Executive summary</strong>: The post offers practical steps for EA communities to prevent sexual harassment, including designating responsible personnel, establishing a code of conduct, and training. It shares EA Israel's concise code of conduct based on Israeli law.</p><p><strong>Key points</strong>:</p><ol><li>Community managers should designate responsible personnel for harassment prevention who receive training.</li><li>Establish and publish a clear code of conduct based on local laws.</li><li>The shared code prohibits coercive acts, indecent behavior, unwanted advances, derogatory treatment, unauthorized publication of private material, and retaliation.</li><li>It outlines complaint procedures: internal, criminal, civil.</li><li>Internally, it requires prompt, respectful investigations and recommendations to leadership.</li><li>Leaders must take action to address harm and prevent further harassment.</li><li>Additional steps include training, requiring staff/volunteers to refrain from harassment, and publishing the code.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "6B58wTEiZAq8GnLFm", "postedAt": "2023-09-07T18:54:30.194Z", "postId": "6Z7SShHa5fnadLm3G", "htmlBody": "<p>Hey,</p><p>It sounds to me like you're mainly focusing on</p><ol><li>Nominating a representative (who gets training)</li><li>Filing a complaint</li></ol><p>&nbsp;</p><p>This seems to me (not that I'm an expert, at all) like there's still something missing: having the representative be actually trustworthy. I have no idea how training could accomplish that.</p><p>I know you personally and my sense is that you deeply care about this, your heart is in it, you deeply care about listening and understanding people's needs, and even if you won't know how to do something - I could communicate my needs to you and nothing bad would happen because of it, you'd listen and we'd figure something out.</p><p>This is not at all the vibe I got from \"representatives\" throughout my career. It often seems like an \"annoying extra task\" that someone got and must do, like \"decide who does a shift (שמירה) at what times\". I really doubt a simple training could solve this (not a training that I'd know how to run, anyway) (not a training that those representatives got).</p><p>Also, (again, not an expert) - I don't think that a common thing people would want is to \"file a complaint\" or to have an \"internal disciplinary procedure\". I imagine that more common desires would be \"keep it secret please\" or \"get that person far away from me without them knowing its my fault\" or maybe something simpler like \"believe me\".</p><p>Also (again, not an expert) - I don't think that relying on \"prohibited acts according to the law\" would make many people calm. I sometimes hear about things that are (I hope?) clearly illegal, done publicly, recorded, and the law doesn't seem to help enough. Also - filing a complaint in the police is maybe something worth getting training about, but I hear that filing such complaints come with huge downsides (which annoys me and I won't rant about it, but I would hope the representative won't rely on that solution).</p><p>&nbsp;</p><p>My guess is that much of this comes naturally to you, but if I imagine myself running an EA group or so, and reading this post, these are some things that would be missing for me, things where I'd still feel somewhat lost even with your advice. Maybe you want to write more? Run your own courses? I really have no idea</p><p>&nbsp;</p><p>Congrats on your first post!</p><p>:)</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "xdZMs2fjHJ8ExuG8A", "postedAt": "2023-10-12T09:34:25.086Z", "postId": "6Z7SShHa5fnadLm3G", "htmlBody": "<p>Hey Michal, thanks for sharing this code and also some thoughts on how to take preventative measures depending on your position in the community. I especially like that you included community members, and encouraged people to advocate for what they want!</p>", "parentCommentId": null, "user": {"username": "Milena Canzler"}}]