[{"_id": "dqczpLFYxk2LaJfnn", "postedAt": "2014-09-18T20:45:03.124Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<ol>\n<li><p>So far every comment I've seen has been insightful and thoughtful. I would like to see the karma requirement lowered soon to make it easier to get new users.</p>\n</li>\n<li><p>Feature request: The ability to tag people in posts like on Twitter and Facebook (e.g. @RyanCarey).</p>\n</li>\n<li><p>Feature request: Separate sections for serious in-depth writings and incomplete thoughts or discussion prompts, perhaps like LW's Main/Discussion. Ideally I'd like to see something with an even lower standard of contribution than LW's Discussion, similar to Felicifia. Suppose for example that I have a question related to EA. This doesn't seem right for a top-level post, but it could get lost in an open thread.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "baJcJuxScNuoMq2b2", "postedAt": "2014-09-18T22:17:49.029Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Is there highlighting for new comments?  If so, I haven't noticed it.  If not, could we get some? :)</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "EWRXmDMEyBuQLDNub", "postedAt": "2014-09-18T22:54:51.914Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>FYI: When I log in on my android phone (but not on my chromebook) it sends me to the google search bar page. Then if I navigate back to the forum (but not by hitting the back button) I am logged on. </p>\n", "parentCommentId": null, "user": {"username": "Erica_Edelman"}}, {"_id": "kgEQ7qggCqEd2EksY", "postedAt": "2014-09-19T00:32:32.193Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<blockquote>\n<p>Suppose for example that I have a question related to EA. This doesn't seem right for a top-level post, but it could get lost in an open thread.</p>\n</blockquote>\n<p>Coincidentally, I just had a Hangout with William Saunders where we discussed this issue. Possibilities include having a &quot;sandbox&quot; where newcomers could post without fear of asking dumb questions (as I suggest <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/742584452464581/\">here</a>) and giving such new EAs the option of having a one-to-one conversation with more experienced EAs (who would volunteered for this). I think this is something worth exploring further.</p>\n", "parentCommentId": "dqczpLFYxk2LaJfnn", "user": {"username": "Pablo_Stafforini"}}, {"_id": "AqMtPNJejeKCQWZ8j", "postedAt": "2014-09-19T01:51:50.630Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>How can we submit a draft to be published? I don't see a way to send private messages to individuals, and I don't have your email (I had seen a facebook post where you said we could email you drafts). <a href=\"http://effective-altruism.com/r/Erica_Edelman-drafts/ea/81/should_you_move_to_a_high_cost_of_living_city/\">Here's the draft</a> if it's visible to anyone with a link.</p>\n", "parentCommentId": null, "user": {"username": "Erica_Edelman"}}, {"_id": "gX9jWqzkGtoH8dNiK", "postedAt": "2014-09-19T02:02:03.304Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Hi Erica, thanks for writing this. I should've said that the best way to contact me is ry [dot] duff @gmail.com, and have edited this. For reference, you can also go &quot;Messages&quot; -&gt; &quot;Compose&quot; then type RyanCarey :)</p>\n<p>I can't yet read the draft but it looks like it's on a good and interesting topic!</p>\n", "parentCommentId": "AqMtPNJejeKCQWZ8j", "user": {"username": "RyanCarey"}}, {"_id": "KoCTmpioZYTNjBFuA", "postedAt": "2014-09-19T02:07:23.011Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>When you say highlighting, do you mean a way to see which comments are new? You can click 'subscribe' on any comment to be notified of a reply. When you make a post, you can also check a box to be notified of replies. You can also see recent comments in the sidebar and click the heading 'recent comments' there to get a longer list. :)</p>\n", "parentCommentId": "baJcJuxScNuoMq2b2", "user": {"username": "RyanCarey"}}, {"_id": "zJ77xY59RqvP64rkX", "postedAt": "2014-09-19T02:09:11.393Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Thanks! Sent :)</p>\n", "parentCommentId": "gX9jWqzkGtoH8dNiK", "user": {"username": "Erica_Edelman"}}, {"_id": "WzfcXCsiKTPxGwBBR", "postedAt": "2014-09-19T02:14:02.887Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Hey Erica, thanks for noticing this. The best thing to do is submit the bug <a href=\"https://docs.google.com/forms/d/11TFxAyXJ-epip2SaSbO3tksjHeF-nhn4GA_XRswJmTc/viewform\">here</a> stating the phone and browser, and describing the 'search bar page', so that Trike Apps and I can prioritise it.</p>\n", "parentCommentId": "EWRXmDMEyBuQLDNub", "user": {"username": "RyanCarey"}}, {"_id": "BYjdCzoJmQTcChDDp", "postedAt": "2014-09-19T02:41:52.208Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Thanks for the suggestions, Michael.</p>\n<blockquote>\n<p>So far every comment I've seen has been insightful and thoughtful. I would like to see the karma requirement lowered soon to make it easier to get new users.</p>\n</blockquote>\n<p>I want more users too. In terms of article creation, there are some good ones on the way so we're not yet constrained. In terms of new user-created aricles, we haven't yet had any, and so it might be useful to see some before we make a comparison. Comparing based on comments is a good start, though it's not quite the same. I think it's unlikely that I would need to decrease the karma requirement before the stated timeframe of October 10 but I think it's good to think of creative ways to increase participation.</p>\n<blockquote>\n<p>Feature request: The ability to tag people in posts like on Twitter and Facebook</p>\n</blockquote>\n<p>This would be an interesting feature, and I think I would like it. So far, we've prioritised bugs and I've tried not to impose excessively on the time of Trike Apps (they have made a large and entirely voluntary contribution). So far, they've done an awesome job creating the site with basic functionality. I think that before we install any new features, it would either be necessary for the code to be made public to allow other volunteer contributions, or for the site to demonstrate a lot of usage over a period of months so that we could go to Trike with a case that further development was of high value.</p>\n<blockquote>\n<p>Feature request: Separate sections for serious in-depth writings and incomplete thoughts or discussion prompts.</p>\n</blockquote>\n<p>I lean against creating multiple fora. Even if it was a good idea in the long run, I think that it's better to start with one forum so that it's easier to achieve a critical mass. It's no exaggeration to say that LW's Main/Discussion distinction was one of the most hated features of the site. I also think that fragmenting an online community and decreasing its usability are two of the most damaging things you can do to a budding community website. I think that we can bridge the gap by making main a bit more lenient to short questions. If the open threads are too big, and some high quality comments are being lost, then we can move whichever kinds of posts were most successful in the open threads to the main page to make more space. We could also create more specific open threads e.g. a careers open thread.</p>\n<p>Lastly, for future reference, if you have multiple suggestions, it's often good to post them in separate comments so that users can give feedback on them independently.</p>\n", "parentCommentId": "dqczpLFYxk2LaJfnn", "user": {"username": "RyanCarey"}}, {"_id": "HWcsGwscEZb8dmf4Q", "postedAt": "2014-09-19T06:12:15.123Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<blockquote>\n<p>When you say highlighting, do you mean a way to see which comments are new?</p>\n</blockquote>\n<p>Yes, like how LessWrong highlights new comments.  It should be a pretty easy feature to implement.</p>\n", "parentCommentId": "KoCTmpioZYTNjBFuA", "user": {"username": "Peter_Hurford"}}, {"_id": "woPzYtNd6czERh9LK", "postedAt": "2014-09-19T06:13:12.376Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Subscribing makes it pop up in messages here, yes?  Have you given any thought to email integration?</p>\n<p>Also, is there an RSS feed for posts and/or comments?</p>\n<p>(By the way, I agree as you stated elsewhere that it is good not to impose too much on Trike Apps and instead open the codebase to volunteers to develop.)</p>\n", "parentCommentId": "KoCTmpioZYTNjBFuA", "user": {"username": "Peter_Hurford"}}, {"_id": "hh6LJnLm7Rwy2fzPq", "postedAt": "2014-09-19T06:35:30.081Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>I think I know what you mean but can you send a screenshot?</p>\n", "parentCommentId": "HWcsGwscEZb8dmf4Q", "user": {"username": "RyanCarey"}}, {"_id": "nxkTfnzhXtzXTbCEG", "postedAt": "2014-09-19T06:35:37.367Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>When I click on a user, I cannot see their lifetime or monthly karma. Is this a bug or a feature?</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "7P8chz7t3K7mmQimJ", "postedAt": "2014-09-19T06:40:01.532Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Yes, it appears here. I agree that email subscribing could be good. Having said that, we're not in a position to act on feature requests at the moment. My aim now is to show that the forum has sufficient traction to justify any further development. I would like voluntary development and I've asked Trike about this but can't answer in their behalf.</p>\n<p>Both the front page and your inbox secretly have <a href=\"http://effective-altruism.com/.rss\">RSS</a> <a href=\"http://effective-altruism.com/message/inbox/.rss\">feeds</a>, which could give you the facilities that you need for some description of email notification. (For now, I find it hard to get myself worked up about the fact that these are unliked given that most users don't need RSS, and those that do are often superusers who can deal with this.)</p>\n", "parentCommentId": "woPzYtNd6czERh9LK", "user": {"username": "RyanCarey"}}, {"_id": "TorEdCM6uGXFYQSFh", "postedAt": "2014-09-19T10:20:30.404Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Though ideally not in pink.</p>\n", "parentCommentId": "HWcsGwscEZb8dmf4Q", "user": {"username": "Toby_Ord"}}, {"_id": "eutdEmsiwZMw2vwLy", "postedAt": "2014-09-19T10:51:11.177Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Surely everything is better in pink?!</p>\n", "parentCommentId": "TorEdCM6uGXFYQSFh", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "aQrmxvwuNdW8SM9XX", "postedAt": "2014-09-19T13:18:59.705Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>I noticed this a few days ago and was asking myself the same question. the conclusion I came to was that it would, on balance, be slightly preferable for people to know that their total karma was broadcast to others but it's not something that we need to develop in the short term. I'm happy to hear contrary opinions.</p>\n", "parentCommentId": "nxkTfnzhXtzXTbCEG", "user": {"username": "RyanCarey"}}, {"_id": "MFBKZsnCZcpZjg5hx", "postedAt": "2014-09-19T19:05:12.700Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p><a href=\"http://imgur.com/U52aHt3\">A new comment within a read comment.</a>  Here's <a href=\"https://github.com/bakkot/SlateStarComments\">a script for doing it on SlateStarCodex.</a>.  And <a href=\"http://www.jefftk.com/p/mark-new-comments\">Jeff Kaufman does it too</a>.</p>\n", "parentCommentId": "hh6LJnLm7Rwy2fzPq", "user": {"username": "Peter_Hurford"}}, {"_id": "NH7yYfmmhdeDXTCG2", "postedAt": "2014-09-19T20:40:05.336Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>So the main reason LW's Main/Discussion distinction was criticized is that the Discussion section lacks a critical mass? And would you say this is the main argument against subforums? This would be useful to know I think - when the argument is on the table we can start thinking about solutions ;)</p>\n<p>Also, how can we make main more lenient to short questions, except by lowering the karma requirement?</p>\n<p>Re: Fragmenting the community: Do you think this would also occur if we have subforums like 'career', 'donations', 'causes' etc. or rather if we had 'poverty', 'animals', 'x-risk'?</p>\n<p>And thanks for thinking about this intensively and putting in the time to respond to so many comments!</p>\n", "parentCommentId": "BYjdCzoJmQTcChDDp", "user": null}, {"_id": "tPouA9cZec5GFAcPZ", "postedAt": "2014-09-20T01:32:43.721Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Hey Soeren. My main reasons for having only one forum are critical mass considerations, fragmentation considerations and useability considerations. However, even if we thought this was a desired feature, it would require significant further argumentation to decide that it was more important to develop this feature than, for example, ironing out bugs in the mobile and Firefox versions of the site.</p>\n<p>Apart from the suggestions I made above about making the forum more lenient to short questions (moving mid-length content from the open thread to the main page, making topic-specific open-threads), I can think of a few interesting possibilities: we could have &quot;Ask me anything&quot;-style interviews, where people can ask short questions of a particular users. Another would be a &quot;Ask a silly question&quot; thread. I also think we'll just gradually establish a norm that not everything on the front page needs to be blog-length. An incisive question can fit too.</p>\n<p>I think 'career', 'donations', 'causes' is better than poverty, animals, x-risk. Good suggestion.</p>\n<p>No problem.</p>\n", "parentCommentId": "NH7yYfmmhdeDXTCG2", "user": {"username": "RyanCarey"}}, {"_id": "q2G8WP6CiiTt6C4F8", "postedAt": "2014-09-20T02:37:08.877Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Yes, that would be a very good feature, and was present in LessWrong so I'll look into this.</p>\n", "parentCommentId": "MFBKZsnCZcpZjg5hx", "user": {"username": "RyanCarey"}}, {"_id": "gPdbZcBuMAtQugyA9", "postedAt": "2014-09-20T04:06:29.242Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<blockquote>\n<p>I lean against creating multiple fora. Even if it was a good idea in the long run, I think that it's better to start with one forum so that it's easier to achieve a critical mass. It's no exaggeration to say that LW's Main/Discussion distinction was one of the most hated features of the site. I also think that fragmenting an online community and decreasing its usability are two of the most damaging things you can do to a budding community website.</p>\n</blockquote>\n<p>This was interesting to me.  </p>\n<p>Here's one more idea to throw out there: Divide the posts into &quot;major&quot; and &quot;minor&quot; tags and then include a checkbox for signed-in users that says something like &quot;filter for major posts&quot; that would only show the important/major/fleshed-out posts.  If you wanted to make sure the minor posts didn't get neglected by apathy, you could have that box become unchecked the next time the person visits.  In order to maintain an impressive appearance to visitors, they would only see the major posts.</p>\n<p>This should significantly reduce the chance that minor posts are neglected (except by people who shouldn't or don't want to see them) and would be expandable to a more extensive tagging system in the future.</p>\n", "parentCommentId": "BYjdCzoJmQTcChDDp", "user": {"username": "Jess_Riedel"}}, {"_id": "Jd4fKiHs7xCmhQNrz", "postedAt": "2014-09-20T04:51:34.816Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>This is a fair suggestion. </p>\n<p>I guess my take on this is that most people care about reading good quality material a lot more than they care about length. For example, lots of Wei Dai's <a href=\"http://lesswrong.com/user/Wei_Dai/submitted/?count=34&amp;after=t3_77y\">early posts</a> on LessWrong were short but incisive, so they got upvoted. </p>\n<p>Even a checkbox with tags has disadvantages - Even if posts are categorised in stealth, if half of the posts are hidden a lot of the time, this complicates the experience of a new user. It's hard to get users to add tags and boring to have to tag things myself. This is all to benefit some fraction of users, maybe a quarter, who can then hide short posts. On balance, I lean towards simplicity.</p>\n<p>So if people have great links or questions, I think they should just post them to the front page. If they get 10+ karma and 10+ comments there, then it's an appropriate place for them.</p>\n", "parentCommentId": "gPdbZcBuMAtQugyA9", "user": {"username": "RyanCarey"}}, {"_id": "HwCGujQMQKFw6QLa7", "postedAt": "2014-09-20T06:30:42.484Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>I like the major/minor idea, and tag filters generally. (Side note: I wasn't sure whether upvoting Jess' comment would be sufficient to express this.)</p>\n", "parentCommentId": "gPdbZcBuMAtQugyA9", "user": {"username": "Tom_Ash"}}, {"_id": "3iDuG9yA9LJYoSNBN", "postedAt": "2014-09-22T17:29:12.369Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>&quot;This is all to benefit some fraction of users, maybe a quarter, who can then hide short posts.&quot;</p>\n<p>It's interesting that you view this more from the reader's perspective. Perhaps a good idea since readers are in the majority. To me the main benefit would be for the posters. It can be daunting to post a simple question (perhaps about an issue that confuses you) in a place where everyone will see it among a bunch of thought-out posts. Therefore I would welcome giving posters the ability to check &quot;minor&quot; if their post meets the criteria according to their own judgement. Even in the discussion section of LW some users including myself are literally too shy to post certain kinds of questions/content. I just wanted to bring that too attention.</p>\n<p>Certainly this should wait until after the karma requirement is decreased to see how things develop then. I am assuming that things won't radically change, but that's a judgement call. </p>\n<p>My intuition is that with an option like the one Jess suggested there would be a lot more posts in general, would you agree? If that's the case and the kinds of posts that we currently see should be visible just like they are now, except there's a checkbox &quot;display minor posts&quot; somewhere. This sounds to me like a forum that people would describe as uncomplicated. All in all this approach seems less complicated to me than having dedicated threads titled 'ask a stupid question' etc.</p>\n", "parentCommentId": "Jd4fKiHs7xCmhQNrz", "user": null}, {"_id": "2gPQ9tJ2sF3k7weM4", "postedAt": "2014-09-24T09:37:47.348Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p><strong>How To Hit The 30 Karma Threshold</strong></p>\n<p>If effective altruism is not just a chore to you, but is rewarding, fun, or fascinating, getting karma is easy. At least, it was for me. If you've already spent much time on the Facebook group, or with other effective altruists friends, conversing, just to pass the time, getting 30 karma is the same. This forum is a safe space where upvotes are more readily handed out than they are at Less Wrong, which has had more stringent forum norms since its inception.</p>\n<p>Before anything else, <a href=\"http://www.effective-altruism.com/ea/7r/introduce_yourself/\">introduce yourself</a>. Then, I recommend going to the <a href=\"http://www.effective-altruism.com/ea/7r/introduce_yourself/\">open thread</a>, which is seriously has some of the most fertile, grassroots, and engaging discussions of effective altruism I've ever read. If you join those conversations, it will get you halfway to the article submission threshold. Additionally, don't be afraid to be public with your prior involvement with effective altruism, or other communities committed to altruism at all, really, as this can only receive you appreciation for contributing.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "dERQbu3SbmiKfDLox", "postedAt": "2014-09-24T09:41:43.980Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>One feature on Less Wrong I like is the ability for user accounts to select other distinct users as 'friends'. While we're all friends here, the function is useful to stay updated on the latest forum discussions from particular contributors one has grown to personally appreciate the most. Whenever Trike Apps is next able to make a few updates to the website, I would appreciate if this was one of them.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "ojLmhapFMRnh5FqRp", "postedAt": "2014-09-24T10:23:30.760Z", "postId": "72tsrbeQ2xb9mRYoE", "htmlBody": "<p>Less Wrong has various other <a href=\"http://wiki.lesswrong.com/wiki/Special_threads\">special threads</a>. I want there to keep being open threads, effective altruist quote threads, welcome threads, and meetup announcements on this site. Additionally, we could borrow from Less Wrong:</p>\n<ul>\n<li><p><strong>'What Are You Working On?</strong>: a (bi)monthly thread on which users can showcase their current activities. Of course, such a thread on this forum would be specific activity at least tangential to effective altruism. Still, it could act as a way for effective altruists to find collaborators, and other volunteers, a la <a href=\"dotimpact.im\">.impact</a>, or have their projects funded by other effective altruists, as Diego Caleiro, and Ozzie Gooen, have started doing.</p>\n</li>\n<li><p><strong>'Group Effective Altruism Diary'</strong>: Less Wrong has a group rationality diary. We can do the same for effective altruism. This is a (bi)monthly thread for users to share how they've been doing applying effective altruism in their own lives.</p>\n</li>\n<li><p><strong>'Media Thread'</strong>: posted monthly to collect recommendations/reviews for media (books, movies, articles, etc.)</p>\n</li>\n</ul>\n<p>Ryan Carey wouldn't have to maintain regular threads like these alone. Less Wrong users organize themselves to post these threads on their regularly timed schedule, and we could do the same. I personally volunteer to post the periodic threads I've suggested above. I'll start posting these in October, one per week, and repeat the pattern every (other) month.</p>\n<p>Additionally, Less Wrong users spontaneously created threads which became useful repositories of information. </p>\n<ul>\n<li><p><strong><a href=\"http://lesswrong.com/lw/h2m/solved_problems_repository/\">Solved Problems Repository</a></strong>: this is a thread for 'solved' problems in instrumental rationality. Since instrumental rationality is useful advice for everyone, I recommend checking out that thread on Less Wrong itself. Anyway, we could have such a resource on this forum specific to effective altruism. For example, there could be a resources page for dealing with tax-deductible donations, launching a non-profit organization, etc., for each of the different countries effective altruists are from.</p>\n</li>\n<li><p><strong><a href=\"http://lesswrong.com/lw/hhl/useful_concepts_repository/\">Useful Concepts Respository</a></strong>: a resource for crystallized ideas, and frames of reference, to catch up to speed on what others mean.</p>\n</li>\n<li><p><strong><a href=\"http://lesswrong.com/lw/gx5/boring_advice_repository/\">Helpful Life Advice</a></strong>: this is called something else on Less Wrong, but I figure we can call it 'Helpful Life Advice' here because effective altruism is so much more personal than other activities.</p>\n</li>\n<li><p><strong><a href=\"http://lesswrong.com/lw/i4l/useful_questions_repository/\">Useful Questions Repository</a></strong>: questions that are good, and useful, to keep in mind as an effective altruist. I recommend reading the original thread on Less Wrong as well.</p>\n</li>\n<li><p><strong><a href=\"http://lesswrong.com/lw/htw/bad_concepts_repository/\">Bad Concepts Repository</a></strong>: a body of concepts that effective altruists discover make for bad decision-making. I recommend reading the original thread on Less Wrong as well.</p>\n</li>\n<li><p><strong><a href=\"http://lesswrong.com/lw/h7d/grad_student_advice_repository/\">Grad Student Advice</a></strong>: self-explanatory.</p>\n</li>\n<li><p>*<em>Recommended Reading List</em>: I'm aware Pablo Stafforini created one of these earlier for effective altruists, and I don't know where it is now. Less Wrong has something similar in the <a href=\"http://lesswrong.com/lw/3gu/the_best_textbooks_on_every_subject/\">Best Textbooks on Every Subject</a>, which we can also use.</p>\n</li>\n<li><p><strong><a href=\"http://lesswrong.com/lw/453/procedural_knowledge_gaps/\">Procedural Knowledge Gaps</a></strong>: a thread for knowledge which should be common sense, but is only learned through experience. This seems especially important for effective altruism as it is a lifelong path fraught with difficult decisions, and knowing how to pass them well is important.</p>\n</li>\n<li><p><strong><a href=\"http://lesswrong.com/r/discussion/lw/ikn/mistakes_repository/\">Repository of Mistakes</a></strong>: this could be a thread here for effective altruists to share the life-changing mistakes they've made. Like with procedural knowledge gaps, such a repository seems especially, crucially important for effective altruists, due to the specific and demanding lifestyle choices some of us may make. </p>\n</li>\n</ul>\n<p>If this forum never develops its own wiki as Less Wrong did for itself, or the existing effective altruism wiki remains stagnant, then I believe repository threads such as these should be linked from the home page of this forum. I believe it will make more sense to start these repository threads later, when this forum gains more users.</p>\n<p>Overall, between periodic threads, repositories, and other special threads, specifically labeled as such when they're posted, I believe fragmenting this thread as Ryan cautions against isn't necessary.</p>\n", "parentCommentId": "BYjdCzoJmQTcChDDp", "user": {"username": "Evan_Gaensbauer"}}]