[{"_id": "HW2CmaFnhj7Yc4Fhb", "postedAt": "2023-03-28T21:06:49.343Z", "postId": "72Ya3vqouY9HHTwMt", "htmlBody": "<blockquote><p>I think that focusing too much on refining the application process is hubris. I don’t believe anyone is good at this. The best we can do is to give as many people as possible the opportunity to participate and contribute.<i> If you disagree and if you know how to set up a great application process, then please message me and teach me your magic.</i></p></blockquote><p>Hi there! I think I disagree with you. :) I have some broad ideas about setting up a great application process. I guess a high-level summary would be something like:</p><ul><li>know what you are looking for</li><li>know what criteria/traits/characteristics/skill/etc. predict what you are looking for</li><li>have methods you can use to assess/measure those criteria</li><li>assess the applicants using those methods</li></ul><p>The implementation of it can be quite complicated and the details will vary massively depending on circumstances, but at a basic level that is what it is: know what you are looking for, and measure it. I think this is a lot harder in a small organization, but there are still aspects that can be used.</p><p>I don't want anyone to think that I am an expert who knows everything about applications. I'm just a guy that reads about this kind of thing and thinks about this kind of thing. Then in early 2023 I started to learn a bit about <a href=\"https://drive.google.com/file/d/1gv3Vjl-xBQNv4NAF4fdeLPdrH8dTc4kM/view?usp=sharing\">organizational behavior</a> and <a href=\"https://www.siop.org/Media-Resources/I-O-Psychology-Explained'\">industrial-organizational psychology</a>. But I'd be happy to bounce around ideas if you'd like to have a call to explore this topic more.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "hHaZqELGt5wL6KwBJ", "postedAt": "2023-03-28T22:20:59.668Z", "postId": "72Ya3vqouY9HHTwMt", "htmlBody": "<p>I think the type of application you have in mind is when you're hiring for a specific role? I think you're right that there are circumstances where good evaluation is possible. Looking at what I wrote, I am making a too strong claim.&nbsp;<br><br>The type of applications I had in mind for that paragraph is things like accepting people to an AI Safety research program, or grants, and stuff like that. Although probably there are some lessens from hiring for specific roles that can be generalised to those situations.&nbsp;</p>", "parentCommentId": "HW2CmaFnhj7Yc4Fhb", "user": {"username": "Linda Linsefors"}}, {"_id": "KzoEaRbdikWAvZJ35", "postedAt": "2023-03-29T00:58:50.912Z", "postId": "72Ya3vqouY9HHTwMt", "htmlBody": "<p>Hmmmm. I'm wondering what part of the \"selecting people for a job\" model is transferrable and applicable to the \"selecting people for a research program, grant, etc.\"</p><p>In those circumstances, I'm guessing that there are specific criteria you are looking for, and it might just be a matter of shifting away from vibes &amp; gut feelings and towards trying to verbalize/clarify what the criteria are. I'm guessing that even if you won't have performance reviews for these people (like you would with employees), you still have an idea as to what counts as success.</p><p>Here is a hypothetical that might be worth exploring (this is very rough and was written in only a few minutes fairly <i>off the top of my head</i>, so don't take t too seriously):</p><blockquote><p>The next cohort for the AI Safety Camp is very large (large enough to be a good sample size for social science research), and X years in the future you look at all the individuals from that cohort to see what they are doing. The goals of AI Safety Camp are to provide people with both the motivation to work on AI safety and the skills to work on AI safety, so let's see A) how many people in the cohort are working on AI safety, and B) how much they are contributing or how much of a positive impact they are having. Then we look at the applications that they submitted X years ago to join AI Safety camp, and see what criteria those applications have that they have.</p></blockquote><p>I'm not good enough at data analysis to be able to pull much info, but there likely would be differences (of course, in reality it would have to be a pretty big sample size in order for any effects to not be overwhelmed by the random noise of life that has happened in the intervening X years). So although this little thought experiment is a bit silly and simplistic, we can still imagine the idea.</p>", "parentCommentId": "hHaZqELGt5wL6KwBJ", "user": {"username": "jlemien"}}, {"_id": "WtXMg6uDPWcb9Nn6e", "postedAt": "2023-04-01T23:01:04.204Z", "postId": "72Ya3vqouY9HHTwMt", "htmlBody": "<p>Thanks for writing this analysis! I agree with a most of it. One other argument I've heard for not providing feedback after job applications is that it carries legal risk. What the risk is specifically, I don't know – perhaps a candidate could sue you for discrimination if you inadvertently choose the wrong words? A way to mitigate this risk is the phrase ‘You didn't demonstrate… [mastery of Python, facility in calming down angry customers, whatever]’. It avoids making statements about the candidate in general and instead focuses on their behaviour during the application process, which you've observed. [1] It can be addition to your points about how to give feedback.</p>\n<p>[1] <a href=\"https://www.manager-tools.com/2013/07/you-did-not-demonstrate-part-1-hall-fame-guidance\">https://www.manager-tools.com/2013/07/you-did-not-demonstrate-part-1-hall-fame-guidance</a></p>\n", "parentCommentId": null, "user": {"username": "rmoehn"}}, {"_id": "SDtuj24AtGPwopRCo", "postedAt": "2023-05-03T23:04:13.941Z", "postId": "72Ya3vqouY9HHTwMt", "htmlBody": "<p>One thing that I think is present here but perhaps not stated forcefully enough is that there should always been a better way to message than a bare bones \"sorry, you were not accepted\" rejection. I'm not entirely sure if I agree with your analysis, but given my lack of experience on the other side I wish to bunt on that to say that <strong>the least you can do is provide general feedback. </strong>It really sucks to not get any feedback on a rejection for an application you thought might make it somewhere. Here's a few things that have made for good rejections in my experience:</p><ul><li>Listing the number of spots and number of applicants</li><li>Providing general characteristics of applications that were successful, and noting trends in those that were unsuccessful if possible</li><li>Giving resources one can engage with to possibly become a competitive applicant in the future (i.e. sending someone who got rejected from a role in Nuclear research to <a href=\"https://forum.effectivealtruism.org/posts/N4oG4jMZRkbaKuPZF/nuclear-risk-research-ideas-summary-and-introduction\">Aird's compilation of nuclear research questions</a>, and encouraging them to engage with them)</li></ul><p>Post forthcoming on my thoughts on this from an extensive end user side, but thanks for opening up dialogue, much appreciated.</p>", "parentCommentId": null, "user": {"username": "tswizzle96"}}]