[{"_id": "8tzTnpBFYTu6uvs4g", "postedAt": "2014-09-24T11:21:49.731Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<blockquote>\n<p>There are already has open threads</p>\n</blockquote>\n<p>Think you've got an extra word in here :)</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "udkNWkCdaPpDZ2avH", "postedAt": "2014-09-24T16:08:57.532Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>I would like to caution against a Media Thread since the assumption of there being one in the first place is that it is desirable for particular videos, or essays etc... to be read by most EA's. Media is very time consuming. Frequently people would post out of excitement with this new idea that is either old for others, or irrelevant. </p>\n<p>On the other hand, I find the Bragging thread on Lesswrong a very commendable and fruitful endeavour for the EA forum. It puts feeling good about yourself, motivated, and being public about your giving all in one bucket. So I'd suggest perhaps changing the &quot;What are you working on&quot; for &quot;bragging thread&quot;. Later if the need is still there, then reinstate a &quot;What are you working on&quot;</p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "QjmijhSaWa8xKnxWp", "postedAt": "2014-09-24T16:58:48.332Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Regarding <a href=\"https://gratipay.com/for/effective-altruists/\">Gratipay Effective Altruism</a> and <a href=\"http://dotimpact.im/\">.impact</a> and <a href=\"http://skillshare.im/\">Skillshare Effective Altruism</a> which are networks of EA's exchanging resources, it would be desirable to have them appear in the forum's initial page. In the same way that Lesswrong currently opens a page with many choices on it. </p>\n<p>Gratipay is about donating and receiving donations from other EA's. It is a direct channel of donation, which avoids institutional costs of donating through an EA institution, and makes sure that even if only one donor and one project builder want to work on a cause, it still gets done. </p>\n<p>Skillshare is about donating time and ability between EA's, offer skills there, and request for help from those who have the skills you need. </p>\n<p> and \n.impact is about projects. Creating projects, reframing projects, looking for other collaborators. It's the EA equivalent of an incubator. </p>\n<p>Seems clear to me that all of these are important and distinct part of the EA life, and they should all be one click away from the initial EA page. </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "Pgzb5EEHeKSwrfD6h", "postedAt": "2014-09-24T19:23:41.134Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Many forums have a concept of a &quot;stickied thread&quot;, which is one that stays at the top of the list of topics permanently. I don't know how good a fit that is for a forum designed like this, where there are very few visible topics, and also few subdivisions, but it does work well. It would be a good fit for things like the introductions thread.</p>\n<p>I think LessWrong suffered from a lack of stickies - almost all the useful topics you posted saw extremely rapid declines in visibility as they dropped off the front page, which makes them effectively useless. The ones people liked - open threads, media threads, introduction threads - had to be reposted regularly for this reason. There's no reason why a stickied introduction thread can't last for a very long time (i.e. until it becomes unreasonably large).</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "qCCTbyuFvhCkJtcag", "postedAt": "2014-09-24T19:38:10.866Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Plans for greater integration between this forum and other pages (like Skillshare) are in the works.</p>\n", "parentCommentId": "QjmijhSaWa8xKnxWp", "user": {"username": "Peter_Hurford"}}, {"_id": "nCdsj6FgzekWyrLqC", "postedAt": "2014-09-25T02:16:59.067Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>I very much agree with your second point.  I think it would be especially useful to encourage EAs to announce recent donations they have made, so we can celebrate those donations, evoke warm fuzzies, and maybe even get some subtly competitive giving going.  </p>\n", "parentCommentId": "udkNWkCdaPpDZ2avH", "user": {"username": "ClaireZabel"}}, {"_id": "QnThhDR3Z92CqLMfp", "postedAt": "2014-09-25T05:27:32.822Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>I'm in favour of having recurring threads making up 5-20% of the site's content. I think that the most uncontroversially useful are open threads and meetup announcements. Of the rest, the repository of mistakes seems to me like it would be really good, and could have a different character on this site compared to LessWrong. I think a 'what I'm working on' or 'bragging' thread might work well, as could a 'career advice' thread but I'm less certain about these. I'm unconvinced about the useful concepts repository, the useful questions repository and the bad concepts repository, where it seems like we can more easily just use the threads on LessWrong.</p>\n<p>On the meta-level, thanks for making this post. It's good to see users are invested in finding ways to deliver useful content for the forum software that currently exists. Content improvements often require more creativity than feature requests, can be implemented sooner and their implementation often has an impact that is more clearly positive. Props to you, Evan!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "3zMujMMDEXAnpheEL", "postedAt": "2014-09-25T06:24:11.595Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>We are planning some integration, as peter says. Expect a thread that relies on the ea hub in the next few days.</p>\n<p>Yes, we should link more EA projects and organisations. It's just a question of which projects, and where to add the links. I think I'll start by adding a page full of links to the Introduction to Effective Altruism. For the homepage, it's important to keep a simple UI. (Some people found LessWrong's main page to be difficult to penetrate.) Currently, there are just two links for people to &quot;Get Started&quot;, which I'm content with: </p>\n<ul>\n<li>The Effective Altruism landing page: this links to lots of projects, like GiveWell and AMF. It's getting a glossy redesign, which Kerry Vaughan is involved with</li>\n<li>The Introduction to Effective Altruism: on-site reading materials.</li>\n</ul>\n<p>If I was going to add external links on the frontpage, although some people think that Skillshare and Gratipay have potential, from a coldly objective point of view, there's little evidence that they will realise it. In the past three months, no new skills or requests have been submitted to Skillshare. Gratipay is doing relatively well with over $100 of weekly donations, although it's still early days. If we were adding outbound links in the sidebar, the first might be GiveWell or LessWrong.</p>\n", "parentCommentId": "QjmijhSaWa8xKnxWp", "user": {"username": "RyanCarey"}}, {"_id": "zQwGFiNhRbkGKKneL", "postedAt": "2014-09-25T15:31:56.403Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>That would be great, but I feel as if a thread isn't the best venue for it - it would get samey, and people would feel inhibited by the bragginess of it.</p>\n", "parentCommentId": "nCdsj6FgzekWyrLqC", "user": {"username": "arrowind"}}, {"_id": "APMpoGdc5RQuZZZH8", "postedAt": "2014-09-25T23:45:54.781Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Where do you think would be a good place? The points you brought up are concerning, but I think it works decently on LW (although the samey-ness potential is higher here...) and I'm not sure where a better place for it would be.</p>\n", "parentCommentId": "zQwGFiNhRbkGKKneL", "user": {"username": "ClaireZabel"}}, {"_id": "AGhvBgPtECF7zrr79", "postedAt": "2014-09-26T01:01:47.773Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>People are creative, they'll find new, non-same things to brag about. Trust them. </p>\n", "parentCommentId": "APMpoGdc5RQuZZZH8", "user": {"username": "Diego_Caleiro"}}, {"_id": "xQK3M2mKGeWB8i8AX", "postedAt": "2014-09-26T01:05:58.902Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>That seems the reverse of what is logical. Both Gratipay and Skillshare have frequency dependent value. If people visit them frequently enough, they become valuable resources. \nThey are mutual-knowledge dependent technologies. </p>\n<p>Which is exactly why, if this forum ends up being the conventional place EA's go to explore what's new, that is where the link for them should be. </p>\n<p>Lesswrong and Givewell, in contrast, are both well established in these regards. Lesswrong already is a conventional place for many to go in search for news. Givewell actually is not frequency dependent. </p>\n<p>So your argument (that they have not been much used in the last three months) is actually the reason why they should be given prominence. </p>\n", "parentCommentId": "3zMujMMDEXAnpheEL", "user": {"username": "Diego_Caleiro"}}, {"_id": "HkW8GnKsW5JY46PgC", "postedAt": "2014-09-26T07:50:29.642Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Thanks.</p>\n", "parentCommentId": "QnThhDR3Z92CqLMfp", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "6NtoDyYbHg5WZL4Cn", "postedAt": "2014-09-26T07:52:41.704Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>In addition to what I consider some of the most valuable threads on Less Wrong for an individual, they're an excellent example for newcomers to that site exactly how rewarding, and immediately useful, applying rationality can be to the average individual. I agree with you that whatever online resources this website compiles over time, if their value is timeless, they should be posted to the front webpage for ease of access, and reference.</p>\n", "parentCommentId": "Pgzb5EEHeKSwrfD6h", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "qF5idrdJDviTxatsa", "postedAt": "2014-09-26T07:55:15.378Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Some of us could collaborate on writing our own introductions to various parts of effective altruism, and linking articles in that fashion to newcomers as they start asking question. Such a task will be much easier using this forum than it would have been using only the Facebook group before, because we won't have to repeatedly write responses.</p>\n", "parentCommentId": "3zMujMMDEXAnpheEL", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Lu3GZ3JWPz6SaQ4Lb", "postedAt": "2014-09-26T07:58:32.930Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>I agree on both counts. I hadn't thought of that, re: media threads. Really, if individual effective altruists want updates on media, there are plenty of organizations, and webpages, such as THINK, and the Centre for Effective Altruism, that regularly share news updates relevant to effective altruists. So, some of us can just follow those.</p>\n", "parentCommentId": "udkNWkCdaPpDZ2avH", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "5RSZGJZjsLNK5uFPo", "postedAt": "2014-09-26T07:59:16.902Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Noted, and fixed. Thanks.</p>\n", "parentCommentId": "8tzTnpBFYTu6uvs4g", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "nbgMHGsmjvxKanNrL", "postedAt": "2014-09-26T13:18:14.972Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>Yes, I think this is very valuable. Whether we write them here, on the Effective Altruism Wiki, or on the LessWrong wiki, I think we should be banking up some introductions to key ideas in effective altruism. The advantage of putting the introductions here is that they will receive criticism but the disadvantage is that the edit history is not recorded in the same way that it would be for a wiki.</p>\n", "parentCommentId": "qF5idrdJDviTxatsa", "user": {"username": "RyanCarey"}}, {"_id": "GgDS6TpqFvwxg7XLN", "postedAt": "2014-09-27T00:38:19.325Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>For threads like that it might also be helpful to have &quot;sort by new&quot; as the default option. Right now I don't believe there is an option to change default sorting on a per-thread basis.</p>\n", "parentCommentId": "nCdsj6FgzekWyrLqC", "user": {"username": "MichaelDickens"}}, {"_id": "HnSChSvqZHotZ9AAB", "postedAt": "2014-09-27T11:24:34.276Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>If I myself end up writing some introductions, I was thinking on writing them on the existing effective altruism wiki, which isn't going anywhere. From there, we can port them to another source, or still link them from this site.</p>\n", "parentCommentId": "nbgMHGsmjvxKanNrL", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Fq4myFSofZSMybGDn", "postedAt": "2015-05-31T17:37:05.635Z", "postId": "73hurnFXE9BHWC6hR", "htmlBody": "<p>I don't have any good suggestions in particular, so maybe donation-announcement threads would work. Can you think of any possible alternatives?</p>\n", "parentCommentId": "APMpoGdc5RQuZZZH8", "user": {"username": "arrowind"}}]