[{"_id": "xbqh43nFuGh58rFeM", "postedAt": "2017-09-15T10:04:41.179Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>I don't way to be too harsh, but this is the apotheosis of obtuse Oxford-style analytic philosophy. You can make whatever <em>conceptual</em> distinctions you like, but you should really be starting from the historical and sociological reality of capitalism. The case for why capitalism generates selfish motivations is not obscure.</p>\n<p>Capitalism is a set of property relations that emerged in early modern England because its weak feudal aristocracy had no centralised apparatus by which to extract value from peasants, and so turned to renting out land to the unusually large number of tenants in the country - generating (a) competitive market pressures to maximise productivity; (b) landless peasants that were suddenly deprived of the means of subsistence farming. The peasants were forced to sell their labour - the labour they had heretofore been performing for themselves, on their own terms - to the emerging class of agrarian capitalists, who extracted a portion of their product to re-invest in their holdings.</p>\n<p>The capitalists have to maximise productivity through technological innovation, wage repression, and so forth, or they are run into the ground and bankrupted by market competition. There is, as such, a set of self-interested motivations which one acquires if one wants to be a successful and lasting capitalist. It is a condition of the role within the structure of the market. The worker has to, on the other hand, sell themselves to those with a monopoly of the means of subsistence or face starvation. To do so they have to acquire the skills, comport and obedience to be attractive to the capitalist class. Again, one has to acquire certain self-interested motivations as a condition of the role within the market. Finally, capitalism requires a sufficiently self-interested culture such that it can sustain compounding capital accumulation through the sale of ever-greater commodities.</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "csS7PrZX8KxSTRznw", "postedAt": "2017-09-15T10:11:44.286Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>&quot;This does not mean that capitalism is bad because capitalism is not conceptually tied to selfishness. The question of which system of economic ownership we ought to have is entirely separate to the question of which ethos we ought to follow.&quot;</p>\n<p>This is almost solipsistic - it sounds like you're denying that a complex social world exists out there with powerful and entrenched system of causation. Only for the most remote, cerebral idealist are these two things possibly separate. What's the point of this kind of philosophy?</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "v7svvtwDZ335vM5DX", "postedAt": "2017-09-15T12:16:21.867Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>Thanks for the comment. </p>\n<ol>\n<li>In the first paragraph you suggest that I have argued that it is not the case that capitalism generates selfish motives. I have not argued for this or against it. I have just argued that capitalism is not <em>defined as</em> a system in which people are selfish. This is entirely separate to the question of whether capitalism causally produces more selfishness than socialism. If you accept that it is an empirical question whether capitalism or socialism causally produces more selfishness, then you agree with my argument since you don't need to do empirical work to find out whether a conceptual claim is true. </li>\n</ol>\n<p>General point: conceptual distinctions are very useful. It is difficult to have debates about things when the concepts are not clearly defined. And conceptual distinctions are not, nor did they pretend to be in my piece, to the exclusion of history and sociology. Actually, they make historical and sociological arguments better because more precise. </p>\n<ol>\n<li>I'm not sure whether capitalism causally produces more selfishness than socialism. In 'Why Not Capitalism?' and in the blog I linked to, Brennan argues that market societies actually produce more virtuous people than socialist societies, though I haven't looked into this very deeply. Studies of traditional (hunter gatherer and other societies) show that people in market societies are nicer in ultimatum games and that kind of thing, though I'm not sure how much weight to put on this. </li>\n</ol>\n<p>You have presented an abstract argument showing that capitalism creates incentives for selfishness. But we really want to know whether capitalism creates greater incentives for virtuous conduct than socialism. To answer that question, we'd need to look at actual socialist societies and compare them to how people are in actual capitalist ones. e.g. You could look at how nice people are in capitalist countries and compare that to how nice people are/were in Venezuela now, during the Cultural Revolution, in communist Russia or Cambodia etc. </p>\n", "parentCommentId": "xbqh43nFuGh58rFeM", "user": null}, {"_id": "KZbEnsmsofF3a59Mu", "postedAt": "2017-09-15T12:25:03.596Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>I'm not making a claim about what capitalism causally produces. I think that is fairly clear from the fact that I say that I am making a conceptual distinction. These are separate questions:</p>\n<ol>\n<li>Capitalism is <em>defined as</em> a system in which people are selfish. </li>\n<li>Capitalism causally makes people more selfish than socialism. </li>\n<li>Capitalism is all-things-considered the best system.</li>\n</ol>\n<p>I am arguing for 1, and saying that we need different information to evaluate its truth to both 2 and 3. I'm not denying anything about social systems causing different motivations in people; it is obviously true that they do.</p>\n<p>The point: you don't get to argue against capitalism by suggesting that it is all about selfishness, as a conceptual matter. Rather, you'd need to show that it makes people more selfish than socialism does or that it produces less good outcomes overall than socialism. So, you'd need to present empirical evidence. </p>\n", "parentCommentId": "csS7PrZX8KxSTRznw", "user": null}, {"_id": "dLMxzxRqoaDTS4si3", "postedAt": "2017-09-16T03:17:54.292Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<blockquote>\n<p>Finally, capitalism requires a sufficiently self-interested culture such that it can sustain compounding capital accumulation through the sale of ever-greater commodities.</p>\n</blockquote>\n<p>This is a common claim, but seems completely wrong. An economy of perfectly patient agents will accumulate capital much faster than a community that consumes 50% of its output. The patient agents will invest in infrastructure and technology and machines and so on to increase their future wealth.</p>\n<blockquote>\n<p>The capitalists have to maximise productivity through technological innovation, wage repression, and so forth, or they are run into the ground and bankrupted by market competition</p>\n</blockquote>\n<p>In an efficient market, the capitalists earn rents on their capital whatever they do.</p>\n", "parentCommentId": "xbqh43nFuGh58rFeM", "user": {"username": "Paul_Christiano"}}, {"_id": "i7RWp5aKCsLpdwLXD", "postedAt": "2017-09-16T12:18:59.861Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>I found this helpful. It make clear an implicit distinction I think I'd held but hadn't made explicit. It certainly explains the motivations of many people I know who argue against capitalism when/because they are really against selfishness. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "SEorLwXjRrebFwEhd", "postedAt": "2017-09-17T10:35:49.996Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>I'm having trouble seeing how an individual benevolent person would hold ownership of a company (unless they were the only benevolent person). It would require the owner to think that they knew the best about how to distribute the fruits of the company. </p>\n<p>This seems unlikely, as they are trying to help lots of people they need lots of data about what people need to meet their interests. This data collection seems like it would be best be done in a collective manner (as getting more data from more people about what is needed should give a more accurate view of the needs, and this data should be shared for efficiency). </p>\n<p>So why wouldn't the benevolent individual give their share of the company to whatever collective system that determined the needs of the world? They could still be ceo, so that they could manage the company better (as they have good data about that). It seems like the capitalist system would morph into either socialism or charity-sector owned means of production, if everyone were benevolent.</p>\n<p>I do however agree that socialism is not inherently selfless (nor is the system where charities own the means of production).</p>\n<p>There are lots of other potential systems as well apart from the charity-ism I described above. I'm interested in what happens when sufficiently advanced micro-manufacturing enables everyone to own the means of production (this is also not inherently self-less or selfish).  You could look at systems where people only rent the means of production from the state.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "Ewp5uX7pfZwcQJckq", "postedAt": "2017-09-18T14:33:43.725Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>In general, I like the conceptual distinction you make here. Few comments:</p>\n<p>&quot;Capitalism = The private ownership of the means of production.\nSocialism = The collective ownership of the means of production.&quot;\nI find this still a bit problematic. One could argue companies and other possible legal entities are collective means of ownership. Alternative definition that socialism = State ownership of the means of production?</p>\n<p>I like the the way you phrase the relationship between system of ownership and ethos of selfishness/benevolence as an empirical question. My question is though: what is the relevance of ethos of selfishness - isn't that a process goal? Should we focus on individual well-being instead which is a outcome goal (i.e. ethos of benevolence is valuable because it is seen to cause well-being). </p>\n", "parentCommentId": null, "user": {"username": "tuukkasarvi"}}, {"_id": "nFforjhaaGopDPKbG", "postedAt": "2017-09-18T14:48:53.745Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>&quot;So why wouldn't the benevolent individual give their share of the company to whatever collective system that determined the needs of the world? They could still be ceo, so that they could manage the company better (as they have good data about that). It seems like the capitalist system would morph into either socialism or charity-sector owned means of production, if everyone were benevolent.&quot;</p>\n<p>I don't understand this. Do you suggest that all companies should be trying to fulfill (all) the needs of some collective. It is very useful for companies to specialize.</p>\n<p>I think charityism and capitalism can work well together. The question of how to best produce something (1) is separate from what to produce (2), and these are in turn separate from the question how to best donate (3).</p>\n<p>Basically, in a market economy,  investors (capital owners) are making bets on how to answer the first two questions. Consumers (which includes also capital owners) are collectively affecting and largely determining (2) and also (3) (to the extent they decide to donate). If you are a large investor (own a lot of capital) you can donate all your returns if you wish, EA-style.</p>\n<p>&quot;So why wouldn't the benevolent individual give their share of the company to whatever collective system that determined the needs of the world?&quot;</p>\n<blockquote>\n<p>My short answer: because they are experts in organizing how to best produce a valued good or service X. While doing this they can still donate all the returns EA-style (e.g to maximize social impact)</p>\n</blockquote>\n", "parentCommentId": "SEorLwXjRrebFwEhd", "user": {"username": "tuukkasarvi"}}, {"_id": "xjAJWZhX3C6FnpQGH", "postedAt": "2017-09-18T15:45:20.643Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>Good that you write this document, but in my opinion we're dismissing the important question, which you clarify your post doesn't address:</p>\n<p>&quot;I am not arguing for or against the proposition that capitalism creates incentives for people to be selfish, or makes people more selfish than the socialist alternative. This is a distinct empirical question.&quot;</p>\n<p>Gathering empirical data for this topic is difficult, but I would like to see a discussion on how people's selfishness are transformed in either communism or capitalism -- and most importantly, whether it's possible to expect these selfish agents to eventually make benevolent actions despite their previous (or still present) selfish actions.</p>\n", "parentCommentId": null, "user": {"username": "jvican"}}, {"_id": "vWDTgRyEAKjSaXjF3", "postedAt": "2017-09-19T19:50:25.342Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<blockquote>\n<p>I don't understand this. Do you suggest that all companies should be trying to fulfill (all) the needs of some collective. It is very useful for companies to specialize.</p>\n</blockquote>\n<p>I expect all benevolent companies to fulfil the needs of others with their profits (if they are not reinvesting them in expansion). For that is the definition of benevolence right? People have an ethos of benevolence insofar as they pursue the interests of others.</p>\n<p>There are two aspects of ownership of the means of production</p>\n<ol>\n<li>Control over the operations</li>\n<li>Control of the profits</li>\n</ol>\n<p>I would expect that a benevolent person/company would give away the control of the profit to an external entity. Why? Comparative advantage, it is unlikely that the person who specialises in control over operations of a company  will be better than some group that specializes in getting the maximum charitable return (as long as the external groups is also benevolent). So you'd expect all the profits to go to something like open phil, directly so as to reduce costs from friction.</p>\n<p>So who owns the company in this case? The people that controls operations or the group that controls profits?</p>\n<p>I can't see a benevolent person arguing for needing private control over the profits (this might not mean public control, it might mean charitable control).</p>\n<p>So I was trying to break down the concept of ownership some more and arguing that in a benevolent world private ownership might only mean keeping control over operations.</p>\n<p>We don't live in a world of complete benevolence, so it is almost irrelevant. But it struck me as interesting as thought about how benevolence and capitalism would interact and look a lot different.</p>\n", "parentCommentId": "nFforjhaaGopDPKbG", "user": {"username": "WillPearson"}}, {"_id": "MEeMEyuH5kRaXHSfq", "postedAt": "2017-09-20T18:09:32.873Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>In general, I think this is correct and a very useful distinction. I hear people make sloppy arguments on this all the time. It's clear that capitalism and socialism do not at least obviously or superficially entail selfishness or selflessness on a conceptual level.</p>\n<p>I do think that on a deeper conceptual level, though, there may be more connections. I took a socialist philosophy class in college taught by an &quot;analytic Marxist&quot; (John Roemer) who used the tools of neoclassical economics to model a more reasonable and precise version of Marxist theory. He was best friends with G.A. Cohen, one of the greatest analytic political philosophers of the 20th century (in my opinion the greatest). Both of them held the view that understandings of selfishness and selflessness were pretty key to the conceptual cases for capitalism and socialism: capitalists took selfish motives for granted, both underestimating the extent of selflessness and utterly neglecting the possibility of changing the extent of selflessness and selfishness in human beings. Socialists, in contrast, recognized that it is possible to foster different ethics and that the ethic of socialism, being more selfless than the ethic of capitalism, would feed on itself.</p>\n<p>Interestingly, G.A. Cohen argued that socialists should abide by very similar principles to EAs in his book &quot;If You're an Egalitarian, How Come You're So Rich?&quot;</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "2aWDJ2RPuhJYyvJTS", "postedAt": "2017-09-21T17:20:51.245Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>I think I have now a better understanding of what you meant.</p>\n<p>I think there are at least three optimization problems here: 1) what to produce? (investment decision) 2) how to produce? (organization of operations) and 3) how to use the returns , for EA-minded, how to donate? </p>\n<p>Company traditionally optimizes 2) and 1) in a more restricted manner (within their field of business or local opportunities)</p>\n<p>I think there might be some problems with a hypothetical &quot;benevolent&quot; company that also commits to donate all the profits to an charity or portfolio of charities. Firstly, it would decrease the possible investor base because only strictly altruistic investors would be interested and thus it would not likely able to raise as much funding as a &quot;non-benevolent&quot; company (altruistic investors are also interested in &quot;non-benevolent&quot; companies because they can freely donate any profits they make). Secondly, there is disagreement among altruists of how to best donate. Thus, if profits are given to investors, each altruist can choose personally how to donate. So even altruistic investors might be hesitant to invest in a &quot;benevolent&quot; company I outlined here.</p>\n<p>&quot;So I was trying to break down the concept of ownership some more and arguing that in a benevolent world private ownership might only mean keeping control over operations.&quot; </p>\n<blockquote>\n<p>There is still disagreement about how to best donate (to do most good) among individuals which gives support to the argument that profits should be paid out even among altruistic investor base</p>\n</blockquote>\n", "parentCommentId": "vWDTgRyEAKjSaXjF3", "user": {"username": "tuukkasarvi"}}, {"_id": "a5BBuDmHFzQYpcF7y", "postedAt": "2017-09-26T13:11:21.765Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<blockquote>\n<p>There is still disagreement about how to best donate (to do most good) among individuals which gives support to the argument that profits should be paid out even among altruistic investor base</p>\n</blockquote>\n<p>True, but to if I put myself in the perfect altruist company owner shoes I would really want to delegate the allocation of the my charitable giving, because I am too busy running my company to have much good information about who to donate to.</p>\n<p>If I come happen to come in to some information about what good charitable giving is, I should be able to take the information to whoever I have delegated it too and they should incorporate it (being altruists wanting to do the most good as well).</p>\n<p>It seems only when you distrust other agents, either morally, or their ability to update on information should you allocate it yourself.</p>\n<p>Does that explain my intuitions?</p>\n", "parentCommentId": "2aWDJ2RPuhJYyvJTS", "user": {"username": "WillPearson"}}, {"_id": "6L8fFdX6KLvkBkSKC", "postedAt": "2017-10-10T13:01:53.950Z", "postId": "744omz9Q72hLqNCKj", "htmlBody": "<p>Hi! Apologies for response delay.</p>\n<p>&quot;True, but to if I put myself in the perfect altruist company owner shoes I would really want to delegate the allocation of the my charitable giving, because I am too busy running my company to have much good information about who to donate to.&quot;</p>\n<p>I agree with that usually it is not efficient for same person to take care and optimize 1) (for-profit private) company operations 2) allocation of charitable giving. So person doing 1) would do well to delegate 2) to someone who she trusts.</p>\n<p>In any case, I reiterate my previous point: I don't think having &quot;benevolent&quot; companies would be something I support (benevolent in the sense that the company commits to donate all profits) because: Firstly, it would decrease the possible investor base because only strictly altruistic investors would be interested and thus it would not likely able to raise as much funding as a &quot;non-benevolent&quot; company (altruistic investors are also interested in &quot;non-benevolent&quot; companies because they can freely donate any profits they make). Secondly, there is disagreement among altruists of how to best donate. Thus, if profits are given to investors, each altruist can choose personally how to donate. So even altruistic investors might be hesitant to invest in a &quot;benevolent&quot; company I outlined here.</p>\n<p>As far as I am tell, it's best to have a for-profit company optimizing production and maximizing profits which are distributed to investors some of which can be efficient altruists who in turn donate them as they see fit. Charitable givers can delegate their giving to a fund of charities of which I think OpenPhil is an example of.</p>\n", "parentCommentId": "a5BBuDmHFzQYpcF7y", "user": {"username": "tuukkasarvi"}}]