[{"_id": "i7nbZWuKfzPbMF6tk", "postedAt": "2023-01-10T18:59:10.194Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I understand that it's been at most 9 months since this purchase occurred.<br><br>As I've said in other contexts, requiring immediate public disclosure of decisions is a standard not applied anywhere else - banks and public companies have to report some things quarterly, as the linked comment suggests CEA should do, but that's not a reasonable standard anywhere else, given the amount of extra accounting and other work needed. The charitable groups that score highly on transparency report yearly, and all of the groups involved in this do, in fact, regularly report their grants. I'd be shocked if any charity issued quarterly reconciliations publicly. It's incredibly expensive in terms of personnel and time to report things immediately, and both CEA and OpenPhil are actually amazingly transparent - both formally, with their reports, and informally, with many senior people responding to questions and criticism on the forum, on facebook, and on twitter.&nbsp;</p><p>Given that, I think it's especially weird to say EVF hasn't said anything <i>while linking to an explanation by the board member who was most involved</i>. &nbsp; (If you want to criticize CEA for failing on transparency, people could ask why they haven't done an annual review post in 2 years, as I did in earlier discussions. But it seems they just<a href=\"https://forum.effectivealtruism.org/posts/DajpFcaMrHv4fPLTy/cea-s-work-in-2022\"> fixed that</a>.)<br><br>I am still concerned that EVF seems to have lots of less transparent pieces, and it's unclear what gets reported where, since this isn't part of CEA, so it wasn't reported by them - but in the case of Wytham Abbey, I think OpenPhil, as the actual donor, is the one that needs to talk about why it made that decision - and no, it still isn't on their grants page.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "BJmQsqsnYopx3JBuq", "postedAt": "2023-01-10T19:16:49.962Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Most transparency in charitable endeavours is donor-driven, right? People want to see what you're doing with their money. But that doesn't apply here because it's basically all just one guy's money and he clearly DGAF what OpenPhil do with it. So all the usual stuff about conflicts of interest etc doesn't really apply because Dustin knowns full well he's giving his money to a small group of closely connected people to dispense with as they see fit. So I assume no one thought there would be any problems until FTX blew up and suddenly EA was under loads of additional scrutiny.&nbsp;<br><br>The purchase itself seem fairly reasonable, fwiw, although I don't know much about the volatility in the super-prime property market. But assuming it gets used a lot for conferences etc, country houses are pretty great things and very useful.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "kAW3hLXxDgpD9RGAt", "postedAt": "2023-01-10T21:04:11.694Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>How much does Moskovitz trust the OpenPhil team? Well, he only found out the money came from OpenPhil after the whole thing blew out on the forum. And that's despite being <em>the chair of the board</em> of OpenPhil. So it seems that both OpenPhil staff don't think it's important to update (at least) the board on decisions of this magnitude, and the board doesn't push for such updates.</p>\n", "parentCommentId": "BJmQsqsnYopx3JBuq", "user": {"username": "Guy Raveh"}}, {"_id": "qdAuXJY5PkhfdDA5z", "postedAt": "2023-01-10T21:11:47.170Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Right. The board doesn't push for updates presumably because Dustin doesn't care! (I assume this is what you're saying?) He was joking about it on twitter &amp; seemed to think it all pretty funny.&nbsp;</p>", "parentCommentId": "kAW3hLXxDgpD9RGAt", "user": {"username": "Sabs"}}, {"_id": "2vWxZf6F2CBsCoqu3", "postedAt": "2023-01-10T21:32:23.827Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>For me, unfortunately, the discourse surrounding Wytham Abbey, seems like a sign of epistemic decline of the community, or at least on the EA forum.<br>&nbsp;</p><ul><li>The amount of attentions spent on this seems to be a textbook example of <a href=\"https://en.wikipedia.org/wiki/Law_of_triviality\">bikeshedding</a>.&nbsp;<br><br>Quoting Parkinson :\"The time spent on any item of the agenda will be in inverse proportion to the sum [of money] involved.\" A reactor is so vastly expensive and complicated that an average person cannot understand it (see ambiguity aversion), so one assumes that those who work on it understand it. However, everyone can visualize a cheap, simple bicycle shed, so planning one can result in endless discussions because everyone involved wants to implement their own proposal and demonstrate personal contribution.<br><br>In case of EAs, there are complicated, high-stakes things, for example what R&amp;D efforts to support around AI. This has scale of <a href=\"https://www.reuters.com/technology/microsoft-talks-invest-10-bln-chatgpt-owner-semafor-2023-01-10/\">billions of dollars now</a>, much higher stakes in the future, and there is a lot to understand.<br><br>In contrast, absolutely anyone can easily form opinions about appropriateness of a manor house purchase, based on reading a few tweets.&nbsp;<br>&nbsp;</li><li>Repeatedly, the tone of the discussion is a bit like \"I've read a tweet by Émile Torres, I got upset, and I'm writing on EA forum\". &nbsp;Well, tweets by &nbsp;Émile Torres are known to be an unreliable source of information, and &nbsp;in contrast &nbsp;are often optimized to create negative emotional response. (To not single out Torres, this is also true for many other tweets.)<br>&nbsp;</li><li>The discussion often almost completely misses the direct, object-level, even if just at back-of-the-envelope estimate way. On this level venue purchases were sensible:&nbsp;<ul><li>the amount of EA x-risk-reduction money per person in early 2022 was pretty high</li><li>organising events and setting up venues is labour intensive, often more difficult to delegate than people assume, and often constrained on time of people who have high opportunity costs</li><li>on the margin, you can often trade money, time, work ... this trade seems to make sense</li><li>apparently, multiple people reached similar conclusion; apart from Wytham, there was for example a different venue purchased in the Bay area, and &nbsp;other near Prague (note: I'm leading the org fiscally sponsoring the later project)<br>&nbsp;</li></ul></li><li>In contrast, large fraction attention in the discussion seems spent on topics which are both two steps removed from the actual thing , and very open to opinions. Where by one step removed I mean e.g. \"how was this announced\" or \"how was this decided\", and two steps removed is e.g. \"what will be the impact of how was this announced on the sentiment of the twitter discussion\". While I do agree such considerations can have large effect, driving decisions by this type of reasoning in my view moves people and orgs into the sphere of pure PR, spin and appearance.&nbsp;<br>&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "ia3vAS9brNn47aGk5", "postedAt": "2023-01-10T21:51:39.251Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Not sure why this is getting negative votes or w/e, it's basically correct. And even in the PR stakes, the cost of the Abbey on the most pessimistic assumptions is absolutely peanuts compared to FTX! No one will remember, no one will care (whereas they absolutely will remember FTX, that's a real reputational long-term hit).&nbsp;</p>", "parentCommentId": "2vWxZf6F2CBsCoqu3", "user": {"username": "Sabs"}}, {"_id": "HhBpPtcegYNKLox6K", "postedAt": "2023-01-10T22:27:05.723Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>There's also a strong possibility Dustin was told, (i.e. it was mentioned in a team meeting ect.) and it was just forgotten.  That is pretty common (depending on personality type).</p>\n", "parentCommentId": "kAW3hLXxDgpD9RGAt", "user": {"username": "ElliotJDavies"}}, {"_id": "rHZBP6zAjc3JtPCfC", "postedAt": "2023-01-10T22:33:45.974Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote>\n<p>No one will remember, no one will care (whereas they absolutely will remember FTX, that's a real reputational long-term hit).</p>\n</blockquote>\n<p>I suspect this may not be true, because the magnitude of a problem doesn't seem to correlate with magnitude of coverage (perhaps even the opposite) . To make a claim here, I imagine the really awful PR disasters will be over some trivial (but person focused) issues.</p>\n", "parentCommentId": "ia3vAS9brNn47aGk5", "user": {"username": "ElliotJDavies"}}, {"_id": "vEf6G4ypu2Chwnfph", "postedAt": "2023-01-10T22:39:42.867Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Discussion around Wytham Abbey is almost certainly bikeshedding.</p>\n<p>However, don't throw the baby out with the bathwater, it's absolutely flagged an important issue with poor communications and PR.</p>\n", "parentCommentId": "2vWxZf6F2CBsCoqu3", "user": {"username": "ElliotJDavies"}}, {"_id": "zRkSCwkY8PQ3ePEkL", "postedAt": "2023-01-11T00:21:30.215Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I find the discourse on this quite confusing.</p><p>In the thread you linked to defending the purchase of Wytham Abbey, it's suggested that CEA shouldn't be criticized for the Wytham Abbey purchase as it was carried out by a separate organization in EVF. It's then suggested EVF shouldn't be criticized because EVF merely accepted a gift from a third party organization.</p><p>My understanding of the the sequence of events is:</p><p>Owen, a trustee of EVF, acting in his capacity as an advisor to the CEA (an organization under the control of EVF), asked fellow EVF Trustee Claire Zabel to fund the purchase of Wytham Abbey through Open Phil. Once funding was secured, Owen brought the purchase to the other three EVF Trustees of for approval.</p><p>In response to commentary on Wytham Abbey, Owen provides: \"So EVF made two decisions here: they approved fiscal sponsorship, agreeing to take funds for this new project; and they then followed through and bought the property with the funds that had been earmarked for that. The second of these is technically a decision to buy the building (and was done by a legal entity at the time called CEA), but at that point it was fulfilling an obligation to the donor, <strong>so it would have been wild to decide anything else</strong>.\"</p><p>Separate from any analysis of if Wytham Abbey was a worthwhile investment, &nbsp;the organizational concerns the Wytham Abbey purchase highlighted seem important to discuss.</p><p>Between the organizational conflation of CEA and EVF, and multiple EVF Trustees working in multiple capacities, I don't even understand <i>who</i> is supposed to be subject to criticism.</p>", "parentCommentId": null, "user": {"username": "DMMF"}}, {"_id": "4ahF6C6YbLEgvYzN2", "postedAt": "2023-01-11T01:09:53.285Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>The first point in the parent comment can be hard to make without coming off as chiding the original poster and others for what they choose to spend their free time thinking and writing about.</p>\n<p>I don't have any votes either way on the parent comment. Clear chiding would get a downvote from me, since people aren't on the clock here, obviously this issue has struck a nerve with some people (doubtless amplified by other recent issues), it's quite easy for those who want to move on to just ignore the thread, and telling people they should spend their free time on something one thinks is more important is poor form in my book.</p>\n", "parentCommentId": "ia3vAS9brNn47aGk5", "user": {"username": "Jason"}}, {"_id": "mfTBNuoPb7WHfk4t9", "postedAt": "2023-01-11T09:49:32.802Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I think your criticism of bikeshedding somewhat misses the point people are raising. Of course the amount of money spent on WA is tiny compared to other things. The reason it's worth talking about it is that it tells you something about EA culture and how EA operates.&nbsp;</p><p>This is in large parts a discussion about what culture the movement should have, what EA wants to be and how it wants to communicate to the world. The reason you care about how someone builds a bike shed is because that carries information about what kind of person they are, how trustworthy they are and how they might approach building a reactor.&nbsp;</p><p>The discussion is 1-2 steps away from the actual decision precisely because&nbsp;<br>a) we don't have the information necessary to have a discussion on the actual decision (i.e. the numbers) and<br>b) things like decision processes &nbsp;are important.&nbsp;</p><p>There is a PR element to my original post - I think CEA/EVF could have communicated smarter and it's important to point that out. But what is at heart of all this is not at all about PR, spin and appearance. Not about <i>appearing</i> virtuous, but about <i>being</i> virtuous. It's about processes, what culture EA should foster and the value of transparency.&nbsp;</p>", "parentCommentId": "2vWxZf6F2CBsCoqu3", "user": {"username": "nikos"}}, {"_id": "Dx5R9f5Nmk3zuBTmG", "postedAt": "2023-01-11T11:24:08.845Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>The magnitude of the problem is that OpenPhil chose to spend an amount of money that could literally save thousands of lives on buying a fancy building for EVF.</p>\n", "parentCommentId": "rHZBP6zAjc3JtPCfC", "user": {"username": "Guy Raveh"}}, {"_id": "sQXC5XX6WfHjstxjZ", "postedAt": "2023-01-11T11:50:21.094Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>It seems extremely uncharitable to call this bikeshedding.</p><p>It's just not that small an amount of money, relatively to one-off projects and grants in the EA world. It seems perfectly reasonable to expect that projects above a certain size have increased transparency, and it's hard to imagine this wouldn't qualify as big enough.&nbsp;</p><p>These things are relative to money in EA space - if a high proportion of the actual money moving around EVF space is going to projects like this, it doesn't help to observe that billions of dollars are going from other sources to other causes. The question is what EVF does with the slice of the pie they have access to, and what that implies about what they might do with a bigger slice.</p><blockquote><p>The discussion often almost completely misses the direct, object-level</p></blockquote><p>It doesn't <i>miss</i> it, it focuses on something other than direct object level cost benefit analysis. You can argue that the latter is all that matters, but a) that position seems less popular in the last few months, and b) you need to actually argue it. On the topic...</p><blockquote><p>'this trade seems to make sense'</p></blockquote><p>Per my response to Owen in the original thread, this is totally unclear from his reply, which is still all we have to go on. All we have is an assurance that in the long run it will be a money saver, with no explanation of what the numbers were. The same argument could have been used verbatim for a £150k or £150million purchase. Indeed, I &nbsp;and others said as much in that thread and no-one replied with further explanation - so the situation so far is the critics <i>want</i> the direct object level analysis and EVF haven't supplied it.</p><blockquote><p>Repeatedly, the tone of the discussion is a bit like \"I've read a tweet by Émile Torres, I got upset, and I'm writing on EA forum\"</p></blockquote><p>This seems like an unhelpful remark, written in bad faith.&nbsp;</p><p>And the discussion comes at a time where people have been given other reasons to question the epistemics of EVF, so to take it out of that context as an example of getting worked up over something irrelevant to the broader picture of EA seems not to recognise the actual concerns it's playing into (despite the OP &nbsp;directly referring to them).</p>", "parentCommentId": "2vWxZf6F2CBsCoqu3", "user": {"username": "Arepo"}}, {"_id": "zsKrun3Tm72M8aBta", "postedAt": "2023-01-11T11:57:31.638Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Agreed. Effective Altruism embodies a set of values. I agree with these values. I was incredibly worried that CEA/EVF was making a big decision (15 million remains a large amount! It's millions of bednets!) that didn't embody <a href=\"https://www.effectivealtruism.org/articles/introduction-to-effective-altruism#what-values-unite-effective-altruism\">these values</a>. This is why I made the \"Why did CEA purchase Wytham Abbey?\" post. We shouldn't put <em>too</em> much weight on PR, spin and appearance. But we should care a lot about not losing track of what EA is all about. How EVF went about purchasing Wytham Abbey might translate to how they spend money in other areas as well, including high-stakes things like what R&amp;D efforts to support around AI. So I don't think it's crazy that it's a discussion point. Because let's say we did end up concluding Wytham Abbey was an awful purchase (I don't think it is, no strong opinion), what would it say about the rest of EVF's/OpenPhil's  spending decisions?</p>\n", "parentCommentId": "mfTBNuoPb7WHfk4t9", "user": {"username": "Jeroen_W"}}, {"_id": "6n5QAfAesCi3GTiqM", "postedAt": "2023-01-11T12:18:57.033Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I &nbsp;will try to paraphrase, please correct me if I'm wrong about this: the argument is, this particular bikeshed is important because it provides important evidence about how EA works, how trustworthy the people are, or what are the levels of transparency. I think this is a fair argument.<br><br>At the same time I don't think it works in this case, because while I think EA has important issues, this purchase does not really illuminate them.<br><br>Specifically, object level facts about this bikeshed</p><ul><li>do not provide that that much evidence, beyond basic facts like \"people involved in this have access to money\"</li><li>the things they tell you are mostly boring</li><li>they provide some weak positive evidence about the people involved being sane and reasonable</li><li>it is unclear how much evidence provided by this generalizes to nuclear reactors<br>&nbsp;</li></ul><p>Object level, you don't need precise numbers and long spreadsheets to roughly evaluate it. As I gestured to, in late 2021, the \"x-risk-reduction\" area had billions of dollars committed to &nbsp;it, less than a thousand people working on it, and good experience with progress made on in person events. Given the ~ low millions pound effective cost of the purchase and the marginal costs of time and money, it seems like a sensible decision. In my view this conclusion does <i>not</i> &nbsp;strongly depend on priors about EA, but you can reach it by doing a quick calculation and a few google searches.<br><br>Things about the process seem mostly boring. &nbsp;How it went seems:<br>1. some people thought an events venue near Oxford is a sensible, even if uncertain, bet<br>2. they searched for venues<br>3. selected a candidate<br>4. got funding<br>5. EVF decided to fiscally sponsor this<br>6. the venue was bought<br>7. this was not announced with a fanfare<br>8. boring things like reconstructing some things started?<br><br>(Disclosure about step 2: I had seen the list of candidate venues, and actually visited one other place on the list. The process was in my view competent and sensible, for example in the aspect it involved talking with potential users of the venue)<br><br>What this tells us about the people involved seems ...not much, but mostly weakly positive?<br><br>1. it seems the decision process involved some willingness to <a href=\"https://forum.effectivealtruism.org/posts/8Ban7AnoqwdzQphsK/we-can-do-better-than-argmax\">explore and do uncertain things</a>; this is better than EA strawman of comparing every option to bednets<br>2. it seems based on understanding of real-world events organization<br>3. the decision to not announce it with fanfare seems sensible<br>4. my impression is the counterfactual PR impacts, if this <i>was</i> announced with a fanfare, pre-FTX, would have been worse<br><br>In contrast, some of the things critiques of the decision ask for seem pretty unreasonable to me. For example<br>1. discussing property purchases before they are made<br>2. creating a splash of publicity immediately after it was purchased<br>3. getting EA forum users somehow involved in the process<br>4. semi-formal numerical estimates of impact<br><br>I do think that what it does illuminate is a tension between</p><ul><li>global poverty reduction EA memes, which includes stuff like comparing purchases to lives saved, and moral duty to do something about it</li><li>x-risk-reduction EA memes, which includes stuff like willingness to spend a lot of money to influence something important</li><li>rationality memes, which emphasize than spending $1000 to save 1h of time in the morning , and spending 1h to save $30 in the afternoon, is perhaps not an optimal decision pattern</li></ul><p>And I do think it is something between <i>really PR tricky</i> &nbsp;and <i>PR nightmare</i> to have all of this under one brand. &nbsp;If this is the main point, than yes, Wytham is a piece of evidence, but this seemed clear much sooner.<br><br>With nuclear reactors, I don't see a strong case how this evidence generalizes, in either direction.<br><br>&nbsp;</p>", "parentCommentId": "mfTBNuoPb7WHfk4t9", "user": {"username": "Jan_Kulveit"}}, {"_id": "osnbyPY7pcYCAaHp5", "postedAt": "2023-01-11T12:45:10.524Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I don't think it makes sense to compare buying real estate to grant funding. Grant money gets spent and goes away. Real estate you can still sell, and of course rent it out in the meantime when you yourself aren't running event. The super-prime English property market may be very volatile (I don't actually know) but even in the very worst market conditions I would expect CEA to get at least half their money back if they decided they want to sell.&nbsp;</p>", "parentCommentId": "sQXC5XX6WfHjstxjZ", "user": {"username": "Sabs"}}, {"_id": "5cbFMujnXjBvkJjwF", "postedAt": "2023-01-11T12:45:27.836Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<ol><li>Although I understand the sentiment, I don't think this is a slamdunk textbook example of \"bikeshedding\". &nbsp;This has many features of being important, non-trivial issue (although I have low certainty). It might not be complicated <i><strong>technically,</strong> </i>but there is plenty of <i><strong>social complexity </strong></i>that could have big implications. This purchase is a complex issue that raises &nbsp;questions about both the identity and practical outworkings of the EA community. There could be a lot at stake in terms of community engagement and futre donations. Essays (or at least long posts) could reasonable be written on the pros and cons and issues around this purchase, which like the OP has said include<br><br>- How important transparency is or isn't within the community<br>- How promptly and comprehensively big decisions should be communicated within the EA community<br>- Whether the purchase is actually worth the money (taking into consideration value vs renting facilities, optics, counterfactuals etc.)<br>- How important optics should or shouldn't be in EA decision making (I'd love to see more serious maths around this)<br>&nbsp;</li></ol><p>On a related note, I personally have not found this easy to form a clear opinion on. You are right in that this is easier to analyse on than a lot of AI related stuff, but it's not easy to form an integrated opinion which considers all the issues and pros and cons. I still haven't clearly decided what I think after probably too much (maybe you're a bit right ;) ) consideration.</p><p>2. I haven't noticed the tone to be &nbsp;like \"<i>I've read a tweet by Émile Torres, I got upset, and I'm writing on EA forum\"</i>. That seems unfair on the well written and thought out post, and also very few of the comments I've read about this on the original post have been as shallow or emotive as this seems to insinuate. There has been plenty of intelligent, useful discussion and reflection.</p><p>Perhaps this discussion could even be part of epistemic growth, as the community learns, reflects and matures around this kind of discussion.</p>", "parentCommentId": "2vWxZf6F2CBsCoqu3", "user": {"username": "NickLaing"}}, {"_id": "Y62QrTntozH3tnNJA", "postedAt": "2023-01-11T13:13:05.307Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Personal view: the Wytham project is good. The lack of announcement and other proactive comms about it was a significant unforced error.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "tbHK4oTTX8Fw8NzRP", "postedAt": "2023-01-11T13:19:48.470Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I think it's more complex than that, but if you want to make that assumption then that consideration can be worked into the calculations - but that still requires we have actual numbers to work with.</p>", "parentCommentId": "osnbyPY7pcYCAaHp5", "user": {"username": "Arepo"}}, {"_id": "kkS4WwtGhHG8v7CoA", "postedAt": "2023-01-11T14:18:56.111Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote>\n<p>(Disclosure about step 2: I had seen the list of candidate venues, and actually visited one other place on the list. The process was in my view competent and sensible, for example in the aspect it involved talking with potential users of the venue)</p>\n</blockquote>\n<p>Was there no less luxurious option available?</p>\n<p>In previous discussion, Geoffrey Miller mentioned the benefits of a luxurious venue.  In my opinion, the benefits of a <em>non-luxurious</em> venue equal or outweigh those of a luxurious venue -- for example, as a method to deter grifters.  The fact that a luxurious venue was chosen leaves me concerned that the people involved were falling prey to standard self-serving biases.</p>\n<p>Another point: People mentioned that the venue could be resold.  But I suspect that the market for less luxurious properties is more liquid, and a luxurious venue has a greater risk of finding no buyer at the original purchase price.  Additionally, a more expensive venue means the organization's assets are less diversified.</p>\n<p>If someone finds it much easier and more natural to think of reasons in <em>favor</em> of buying their organization a luxurious venue, as opposed to reasons <em>against</em>, I would guess that is probably a result of self-serving bias.  So a quick check for self-serving bias would be to recall whether the considerations I mentioned came up during the purchase decision process.</p>\n", "parentCommentId": "6n5QAfAesCi3GTiqM", "user": null}, {"_id": "aWc5tmux93qifTPSN", "postedAt": "2023-01-11T14:32:57.848Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>BTW, I think the EA decisionmakers involved with Wytham Abbey are basically OK people, who most likely just made a very human mistake here.</p>\n<p>Because I have faith in the decisionmakers involved, I'm going to suggest an exercise: <a href=\"https://www.lesswrong.com/posts/3XgYbghWruBMrPTAL/leave-a-line-of-retreat\">leave a line of retreat</a>, take out a piece of paper, and write out a plan for what they can do next, in a hypothetical world where they knew for a fact that this choice of venue was a result of their own self-serving bias.</p>\n<p>I think if they go through with this exercise, they will realize that their options in this hypothetical are actually quite good -- e.g. offering a public apology and selling the venue would probably result in a very good outcome for multiple reasons.  And once they've internalized that, it will be easier to think clearly about whether the hypothetical is, in fact, true.</p>\n", "parentCommentId": "kkS4WwtGhHG8v7CoA", "user": null}, {"_id": "v523ibmdNkwHgkNer", "postedAt": "2023-01-11T14:34:54.195Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>How much extra effort do you think those responsible should have gone to to find a non-luxurious venue, if the luxurious-looking one seemed better along most practical axes (e.g. size, location)?</p>", "parentCommentId": "kkS4WwtGhHG8v7CoA", "user": {"username": "willbradshaw"}}, {"_id": "hRpv6wjFbE7cbLdQZ", "postedAt": "2023-01-11T14:50:04.318Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Let's see... Wikipedia says Wytham Abbey is 5 km away from Oxford.  I feel fairly comfortable claiming that if a 50% cheaper and 50% less luxurious venue of identical or greater size was available within 30 km from Oxford, it should've been chosen.</p>\n", "parentCommentId": "v523ibmdNkwHgkNer", "user": null}, {"_id": "qfdSHAHj8zavwnm7C", "postedAt": "2023-01-11T15:13:24.369Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I acknowledge that transparency is complex, that there are trade-offs and that it isn't clear what the correct amount of transparency is. I also acknowledge that it is normal that regular grants are published with a delay. So I'm not making a general claim or demand that everything needs to be public (I even explicitly say that). What I say is that&nbsp;<br>a) I'm in favour of valuing transparency highly by default.&nbsp;<br>b) I feel in this specific case more communication would have helped</p><p>My intuition is that Open Phil overall is quite transparent. I was less sure about EVF, given that there are a relevant number of comments and posts on the forum criticising them for lack of transparency. But my data point is mostly this one where I feel more openness would have been helpful plus reading other people's comments.&nbsp;</p><blockquote><p>Given that, I think it's especially weird to say EVF hasn't said anything <i>while linking to an explanation by the board member who was most involved</i>.</p></blockquote><p>I feel that characterisation is a bit uncharitable. I said&nbsp;</p><blockquote><p>So far CEA/EVF hasn't come out explaining their rationale in detail (albeit <a href=\"https://forum.effectivealtruism.org/posts/xof7iFB3uh8Kc53bG/why-did-cea-buy-wytham-abbey?commentId=u3yJfbm2pes8TFpYX\">some</a> of those <a href=\"https://forum.effectivealtruism.org/posts/xof7iFB3uh8Kc53bG/why-did-cea-buy-wytham-abbey?commentId=3cLRAk98q8jMwhrEc\">involved</a> in the decision have commented under an <a href=\"https://forum.effectivealtruism.org/posts/xof7iFB3uh8Kc53bG/why-did-cea-buy-wytham-abbey?commentId=rihLCJsSXL6cotCDv\">EA Forum Post asking about the decision</a> and shared their perspectives)</p></blockquote><p>At the time when Émile posted on Twitter, this was definitely true. And even today I find it fair to say that Owen's response was not a detailed explanation by CEA/EVF (maybe you're right and it's Open Phil that should do the explaining, but that is not the main point). Owen's comment was a response to a question / criticism by someone else, was a comment under a post by someone else and felt mostly like a personal account to me. And he doesn't give much information on the assumptions involved, from his post it wasn't even clear where the money came from. To be clear: I'm glad he posted his thoughts. But I think it's also fair to say that this isn't the kind of official announcement or detailed explanation targeted to convince someone who isn't already mostly convinced that the decision was reasonable.&nbsp;</p>", "parentCommentId": "i7nbZWuKfzPbMF6tk", "user": {"username": "nikos"}}, {"_id": "np94PfDgP2Cr55mbF", "postedAt": "2023-01-11T15:32:35.695Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote><p>In previous discussion, Geoffrey Miller mentioned the benefits of a luxurious venue. In my opinion, the benefits of a <i>non-luxurious</i> venue equal or outweigh those of a luxurious venue -- for example, as a method to deter grifters.&nbsp;</p></blockquote><p>It's notoriously hard to place a value on aesthetics, which is one problem here: it's a disagreement over what that value should be. You seem to be placing that value near-zero?&nbsp;</p><p>A much smaller example and anecdote springs to my mind, from college. For logistical reasons, two adjacent dorms were administratively treated as one staff, but the buildings weren't very similar. One had been built in the late 1800s, beautiful brick building, nice hallways, etc etc. The other was built as an Army training barracks in the... 1930s, as I recall. It was supposed to be temporary but then sold to the university, renovated a couple times, and somehow (barely) still stood 80 years later. Want to take a guess which one students spent more time in, which one had the nice lounges always full, and which one students avoided as much as they could?</p><p>I've sort of come around on Wytham after my initial, reflexive revulsion. I'm still baffled that (supposedly) smart people can make what is to me such an obvious disaster in communication,but I do think aesthetics are an underrated (and perhaps deliberately ignored) aspect of a healthy movement that EA might finally be coming around on a bit. A non-luxurious venue could, in theory, be cheaper and maybe because it's plain as dry toast everyone focuses on work instead- or perhaps no one wants to go there because it's the aesthetic equivalent of an overgrown cubicle.&nbsp;</p>", "parentCommentId": "kkS4WwtGhHG8v7CoA", "user": {"username": "RobertJMoore"}}, {"_id": "35WqPbTv5DXSkcHg9", "postedAt": "2023-01-11T15:44:59.474Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>The same is true of any overhead costs, right? Should they be running conferences at all? How much should CEOs of EA organizations be paid?&nbsp;</p><p>I think this decision was poorly communicated and helps highlight the potential for schism in EA, but it's not a unique issue, either. It also highlights that, while they often fund EA causes, it's ridiculous at this point for anyone to consider OpenPhil an effective altruism organization itself or even one strongly influenced by effective altruism (it might be petty, but capital-EA versus lowercase is a simple way to highlight one distinction, too).&nbsp;</p><p>Edit: I'm apparently insufficiently familiar with discussion norms here, and would appreciate a reply on the strength of disagreement with this comment.</p>", "parentCommentId": "Dx5R9f5Nmk3zuBTmG", "user": {"username": "RobertJMoore"}}, {"_id": "ExAEYhM2LioCEyLoe", "postedAt": "2023-01-11T15:56:18.819Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote><p>The same argument could have been used verbatim for a £150k or £150million purchase.&nbsp;</p></blockquote><p>If they could have acquired &nbsp;a conference venue for £150k that would have been an amazing deal (too good to be true!) and if they paid £150m for an equivalent venue they would have been totally ripped off.</p>", "parentCommentId": "sQXC5XX6WfHjstxjZ", "user": {"username": "Larks"}}, {"_id": "oonLHzvgfCszh2MyX", "postedAt": "2023-01-11T17:02:55.817Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote>\n<p>A much smaller example and anecdote springs to my mind, from college. For logistical reasons, two adjacent dorms were administratively treated as one staff, but the buildings weren't very similar. One had been built in the late 1800s, beautiful brick building, nice hallways, etc etc. The other was built as an Army training barracks in the... 1930s, as I recall. It was supposed to be temporary but then sold to the university, renovated a couple times, and somehow (barely) still stood 80 years later. Want to take a guess which one students spent more time in, which one had the nice lounges always full, and which one students avoided as much as they could?</p>\n</blockquote>\n<p>There's actually a famous story about a building at MIT, \"<a href=\"https://web.mit.edu/fnl/vol/104/Bldg20.html\">Building 20</a>\", a building similar to your training barracks which was known for generating <a href=\"https://qz.com/emails/quartz-obsession/1237342/mits-building-20\">breakthroughs</a> in part due to its freewheeling nature.</p>\n<p>It's not that I think aesthetics have zero value.  It's that I think the low-budget aesthetic is superior.</p>\n", "parentCommentId": "np94PfDgP2Cr55mbF", "user": null}, {"_id": "eihY3ay7tTJPBkJfq", "postedAt": "2023-01-11T17:20:58.820Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Half their money is still 8 million pounds. &nbsp;Even if they sold it today at the same price they would be down 2 million pounds in stamp duty. &nbsp;</p><p>I would also find it bad if they allocated a 2 million grant to something I found &nbsp;dubious, like highly expensive vacation retreats for CEA members or something. If you take the \"$5000 to save a life\" figure &nbsp;seriously, that's money could have saved hundreds of lives. It's still the kind of money that requires thorough justification, at the very least.&nbsp;</p>", "parentCommentId": "osnbyPY7pcYCAaHp5", "user": {"username": "titotal"}}, {"_id": "cS8injnKeZh8F6NW7", "postedAt": "2023-01-11T18:15:30.945Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote><p>It's that I think the low-budget aesthetic is superior.</p></blockquote><p><i>Despite</i>, or <i>because</i>? Culture has an immense effect, and MIT is pulling from a very different crowd than the state school I'm referring to. Sometimes, as with Building 20, the ramshackle nature of the building gives room for experiments not allowed elsewhere; other times, like the crumbling edifice next door to my dorm, it's just depressing, because MIT geniuses didn't go there. The kind of EA activities presumably planned for Wytham aren't going to be drilling through walls to run wire for some quirky experiment.&nbsp;</p><p>And they replaced Building 20 with a Gehry eyesore. Sad!</p>", "parentCommentId": "oonLHzvgfCszh2MyX", "user": {"username": "RobertJMoore"}}, {"_id": "9L3YrTugqsKmXYMqz", "postedAt": "2023-01-11T18:42:10.300Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>MIT has had lots of buildings, but Building 20 is probably the most famous.  Building 20 suggests that if you hold the \"MIT crowd\" factor constant, the low-budget aesthetic wins.</p>\n<blockquote>\n<p>The kind of EA activities presumably planned for Wytham aren't going to be drilling through walls to run wire for some quirky experiment.</p>\n</blockquote>\n<p>I suspect that a place like Wytham will have the opposite effect of Building 20, making attendees feel stuffy and self-important, and that is harmful.</p>\n<blockquote>\n<p>I believe that the role of Building 20 as a incubator is really the right word, because people got together and shared ideas and words without really worrying about who you were or where you came from. And I think that's the secret.</p>\n</blockquote>\n<p><a href=\"https://infinite.mit.edu/video/mits-building-20-magical-incubator\">https://infinite.mit.edu/video/mits-building-20-magical-incubator</a></p>\n", "parentCommentId": "cS8injnKeZh8F6NW7", "user": null}, {"_id": "ru4xNR9ieR3NmyQY6", "postedAt": "2023-01-11T19:21:18.979Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Disagreevotes don't signal that you broke a discussion norm, just that people disagree. I am one of them, because</p>\n<ol>\n<li>\n<p>The analogy to operating costs is flawed; an organization cannot operate without paying people and wants to attract talented people. It's unlikely that Wytham Abbey is in the same \"existential need\" category. Even supporters of the purchase don't claim that.</p>\n</li>\n<li>\n<p>Why is it ridiculous to consider Open Phil an EA organization?</p>\n</li>\n</ol>\n", "parentCommentId": "35WqPbTv5DXSkcHg9", "user": {"username": "therealslimkt"}}, {"_id": "eBqKwjxgTqu7QyqKb", "postedAt": "2023-01-11T19:22:43.830Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Note that if they sell, the money stays in EVF, and doesn't go back to OpenPhil. So you could look at this as OpenPhil making a £15M grant to EVF, earmarked for the purchase but with an unrestricted fallback option. Where's the justification for the grant in that scenario?</p>\n", "parentCommentId": "osnbyPY7pcYCAaHp5", "user": {"username": "Guy Raveh"}}, {"_id": "Twzdy27HjZTz4yGWo", "postedAt": "2023-01-11T20:20:18.838Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote><p>Disagreevotes don't signal that you broke a discussion norm, just that people disagree.</p></blockquote><p>I see the appeal for the separate voting values, but I haven't noticed a situation where a comment ends up with \"this is a quality comment but I disagree,\" which is what I would think as the valuable quadrant of having the separate scores. While it does take more time I appreciate having elaboration for the disagreement. So, thank you for replying!</p><p>&nbsp;</p><ol><li>Operating costs is flawed, yes, but not entirely inaccurate. Wytham isn't an <i>existential </i>need, but it is intended to attract and (temporarily) house talented people, and part of the justification was long-term savings compared to short-term venue rentals. Defenders in the original posts suggested it would assist in attracting better talent and generate better ideas/discussion/etc. Much discussion has been made over the years on the tradeoffs regarding CEO pay to attract talent versus funding going to the causes instead. It's not <i>existential</i> operating costs, but it's ... optional? Fringe? Preferred? operating costs.&nbsp;<br><br>I likely could have phrased it more clearly; after further reflection, the question I should've asked may have been better put as \"Considering these grounds for disagreement with the purchase, would that also suggest that organized EA should also reduce emphasis on conferences more generally?\"&nbsp;</li><li>Ridiculous is likely a bit strong, and rooted in my old-school considerations of \"effective,\" but it was the criminal justice reform and subsequent spinoff that convinced me that OpenPhil is not an EA organization even though it often funds EA. I agree criminal justice reform is a <i>good</i> cause, a - ha - <i>just</i> cause, but I can't imagine anyone honestly thinking it would be within two or three orders of magnitude of a <i>cost-effective</i> cause. As the 800 pound gorilla in the room, and keeping them under the \"EA umbrella,\" can make it seem like everything they do is \"effective altruism.\"&nbsp;<br><br>That's not to say that OpenPhil shouldn't fund that kind of thing; it's not my money and they can fund what they want. But many of the same people running OpenPhil run the organizations telling EAs which organizations are \"most effective,\" and some of these decisions call into question those other recommendations. &nbsp;How much trust gets spent each time one of these decisions is made, and how long can they coast on reserves before the community gets too skeptical? I imagine it's been discussed here before, but I just recently came upon <a href=\"http://benjaminrosshoffman.com/effective-altruism-is-self-recommending/\">this essay by Benjamin Ross Hoffman</a> raising similar concerns years ago.</li></ol><p>Edit: Laziness is not a virtue; I checked, and yes, that essay <i>was </i><a href=\"https://forum.effectivealtruism.org/posts/rpFjPmCL4tcfBic6a/effective-altruism-is-self-recommending#comments\">cross-posted here</a> around the time it was published.&nbsp;</p>", "parentCommentId": "ru4xNR9ieR3NmyQY6", "user": {"username": "RobertJMoore"}}, {"_id": "xvRbDBqsk33PQq8kg", "postedAt": "2023-01-11T20:32:42.266Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Additional 25km seems very inconvenient if Oxford proximity is important and depending on public transport. Your financial tradeoff still might make sense, I dunno . At 25km though they might as well optimize along other axes like different counties or countries. That's 12 miles... 10-20 minute drive depending? They could hire a full-time driver (with some temp drivers for events?) to create a world-class drive? I'm getting a bit more convinced. But if anything I would argue for getting a place that's even more amenitied but way cheaper real estate plus amazing transport. Proximity is just a really important variable for these decisionmakers, though.</p>\n<p>I think people are underestimating how much the decision was made out of lazy convenience. Most of the bougie vibes are already there just because they're <em>at Oxford</em> to begin with vs some other place. With that in mind, one might ask, \"why don't we move the EA hubs from Berkeley and Oxford to a village in India\", which while sounding absurd to some I would be happy to consider the move, it being a question exemplifying a more extreme version of anti-bougieness (anti-aristocracism?) logic. If people aren't willing to move from first-world countries, that's also relatively kinda privileged and lazy (in a way that is <em>obviously understandable</em> and doesn't translate exactly to the venue tradeoff situation, to be clear).</p>\n", "parentCommentId": "hRpv6wjFbE7cbLdQZ", "user": {"username": "DonyChristie"}}, {"_id": "SgmPvm2je2dLoDeDX", "postedAt": "2023-01-11T20:35:51.010Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>\"OpenPhil has a lot of money &nbsp;from one guy and he doesn't give a shit\"<br><br>Look EA has always been largely a small cabal of people passing money around in a non-transparent fashion. I don't think this is a bad thing! Conspiracies are good and they can achieve an awful lot! But somehow it's news to people on the EA forum???</p>", "parentCommentId": "eBqKwjxgTqu7QyqKb", "user": {"username": "Sabs"}}, {"_id": "B5o9Hj6SoXKhaxYSJ", "postedAt": "2023-01-11T20:38:52.785Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>My headcanon was that part of the purpose of Wytham was to appeal to Important People people who already feel stuffy and important, who wouldn't go to a cubicle venue.</p>\n", "parentCommentId": "9L3YrTugqsKmXYMqz", "user": {"username": "DonyChristie"}}, {"_id": "YNJuY5w7aBDAr7aSB", "postedAt": "2023-01-11T20:44:27.400Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote>\n<p>Building 20 is probably the most famous.</p>\n</blockquote>\n<p>Was it the most famous before the nostalgia burst around its decommissioning?</p>\n<p>I'm also not convinced it's the most famous today.  Above it I'd put at least:</p>\n<ul>\n<li>The dome / Infinite Corridor</li>\n<li>Green Building</li>\n<li>Stata (mostly for being ugly)</li>\n</ul>\n", "parentCommentId": "9L3YrTugqsKmXYMqz", "user": {"username": "Jeff_Kaufman"}}, {"_id": "kSgvSDnoRkAhokB4S", "postedAt": "2023-01-11T20:47:45.686Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Well, as an attempt to appeal to Important People, Wytham seems like a clear failure, given the public relations fallout.</p>\n<p>Also, I think credibility with Important People is enhanced if you can say \"We are renting a fancy venue for this particular event, but in general we work in low-budget accommodations because we want to do as much good as we can with our money\".</p>\n", "parentCommentId": "B5o9Hj6SoXKhaxYSJ", "user": null}, {"_id": "qeowS6pQRB4QKqs86", "postedAt": "2023-01-11T20:55:07.900Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>My basis for the fame claim was (a) as someone outside MIT, it was the MIT building I was most familiar with and (b) a Google search for famous buildings at MIT had Building 20 coming up more as a dedicated search result than any other building.</p>\n<p>It could be that Building 20 was not famous before the nostalgia burst.  But I think the nostalgia burst shows that Building 20's fame is causally downstream of it being an innovation hothouse.  How many other decommissioned university buildings receive a nostalgia burst of similar magnitude &amp; character?</p>\n", "parentCommentId": "YNJuY5w7aBDAr7aSB", "user": null}, {"_id": "ifQFACXTKjjDmXkRp", "postedAt": "2023-01-11T21:07:50.573Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote>\n<p>That's 12 miles... 10-20 minute drive depending? They could hire a full-time driver (with some temp drivers for events?) to create a world-class drive?</p>\n</blockquote>\n<p>Yep, could arrange carpooling for 1-on-1s</p>\n<blockquote>\n<p>With that in mind, one might ask, \"why don't we move the EA hubs from Berkeley and Oxford to a village in India\", which while sounding absurd to some I would be happy to consider the move</p>\n</blockquote>\n<p>Yep, blog post: <a href=\"https://80000hours.org/2014/09/should-you-move-to-thailand/\">https://80000hours.org/2014/09/should-you-move-to-thailand/</a></p>\n<p>Moving to India or Thailand introduces a lot of additional considerations beyond just downgrading from one of the loveliest houses in England, though.</p>\n", "parentCommentId": "xvRbDBqsk33PQq8kg", "user": null}, {"_id": "Cpe4SYpEcoPSqCiyc", "postedAt": "2023-01-11T22:36:57.950Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>If you consider Open Phil, GiveWell, and Good Ventures as one entity: they've had the ability to fill AMF <i>et al</i>'s funding gap for years, but have chosen not to, for reasons they consider good (<a href=\"http://blog.givewell.org/2015/11/25/good-ventures-and-giving-now-vs-later/\">this </a>came out in 2015, I don't know if there are more recent statements). Since they could easily afford both and in fact seem to have a deficit of projects they want to fund, this purchase is irrelevant. Their reasons for not fully funding bed nets should be evaluated on their own merits.</p>", "parentCommentId": "Dx5R9f5Nmk3zuBTmG", "user": {"username": "Elizabeth"}}, {"_id": "D5cqsPE4wKudxG9qN", "postedAt": "2023-01-12T00:01:40.142Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I respectfully disagree. A decision to not help others in a specific way is more or less problematic depending on the actual alternative chosen. When that alternative is something as aimed at making EAs and rich westerners enjoy themselves as <em>buying a \"castle\" to host them in</em>, it puts the funders' judgment in a very different light.</p>\n<p>It's not that I'm convinced that buying a conference venue is actually that terrible a decision. But to justify this, OpenPhil and EVF need to work much harder than saying they'll use it to host a vague collection of conferences and workshops, and explain why they even think all these events are really impactful enough, and how they're sure no self-serving bias came into the decision.</p>\n", "parentCommentId": "Cpe4SYpEcoPSqCiyc", "user": {"username": "Guy Raveh"}}, {"_id": "AhH23A3oaTqkFbRTg", "postedAt": "2023-01-12T00:48:47.296Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote><p>Between the organizational conflation of CEA and EVF, and multiple EVF Trustees working in multiple capacities, I don't even understand <i>who</i> is supposed to be subject to criticism.</p></blockquote><p>I think both Owen and Claire have stuck their necks out on the line, and have opened themselves up to criticisms. I think if you believe their actions have not benefited the good, you should feel encouraged to sharply criticize their professional decisions for it (within typical discussion norms of not being extremely mean, avoiding personal attacks, etc).</p><p>There's also a case to be made for criticizing their funders (Dustin Moskovitz and Cari Tuna). I feel slightly bad about the implied incentive mechanism (\"if you give lots of money to EA stuff, then any time a loud fraction of EAs disagree with the donations made by your team, you'd be loudly criticized for it\"). However, given that insufficient criticism of EA funders was identified as a large, potentially catastrophic, mistake in the past, I tentatively feel better about erring a lot in the direction of more criticism of funders.</p>", "parentCommentId": "zRkSCwkY8PQ3ePEkL", "user": {"username": "Linch"}}, {"_id": "f47WxADup4X2JLdzj", "postedAt": "2023-01-12T01:09:00.417Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<blockquote><p>But that doesn't apply here because it's basically all just one guy's money and he clearly DGAF what OpenPhil do with it.</p></blockquote><p>I don't think this is true, my guess is that Moskovitz cares a lot about serving the good, also has his own idiosyncratic biases, and additionally defers a lot to Open Phil about the most effective ways to benefit the good. I think in many ways this is admirable -- I imagine most rich philanthropists either don't care &nbsp;about serving the good at all (and just to buy PR) or centers their philanthropy on their own idiosyncratic visions of what the good entails.&nbsp;</p><p>Joking on Twitter about the purchase is a fairly positive signal to me; I imagine if he spent on the order of $20m to buy a house in SF or a vacation home for himself instead, very few people will criticize him sharply for it. Being able to take the heat for an altruistic purchase that he's unlikely to use himself (for a decision that he didn't make himself) seems like a good quality to have, given that context in mind.</p><p>(This comment might sound overly positive towards Dustin and since I've been burned re: complimenting very rich people in the past, I should mention I don't know much about him, have never met him in person, and will not be much more surprised than priors if he turned out to be a horrible person either personally or professionally).</p>", "parentCommentId": "BJmQsqsnYopx3JBuq", "user": {"username": "Linch"}}, {"_id": "jCPkyNrnLY9ZezvLQ", "postedAt": "2023-01-12T03:56:26.632Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>I think it's helpful in discussion sometimes not to focus on who is subject to criticism. Even if there are one or two or a handful of people who might have made the critical decision, perhaps in some cases it's better to discuss the pros and cons of the issues at hand, rather than pinpointing who exactly might be responsible.</p>", "parentCommentId": "AhH23A3oaTqkFbRTg", "user": {"username": "NickLaing"}}, {"_id": "pbyzRbgoxJzLnqrB5", "postedAt": "2023-01-12T08:07:54.883Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>this is a complete and total misread of what I was saying, by \"doesn't give a shit\" I obviously meant that he doesn't care about the apparent conflicts of interest wrt how OpenPhil dispense of his money, not that he doesn't care about the eventual outputs.&nbsp;</p>", "parentCommentId": "f47WxADup4X2JLdzj", "user": {"username": "Sabs"}}, {"_id": "hy3xXdfsZEsNPq4HN", "postedAt": "2023-01-12T08:10:54.418Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Thanks for the correction, apologies for misreading!</p>", "parentCommentId": "pbyzRbgoxJzLnqrB5", "user": {"username": "Linch"}}, {"_id": "t6DysLZoDbGkygjCp", "postedAt": "2023-01-12T09:44:49.576Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>Yeah, I think we basically agree on all of the points here, and I apologize that my characterization of your claim was, in fact, uncharitable.</p>", "parentCommentId": "qfdSHAHj8zavwnm7C", "user": {"username": "Davidmanheim"}}, {"_id": "5Hq2wMCztNjYi3xad", "postedAt": "2023-12-02T16:12:32.356Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": "<p>The discussion of the Abbey, er, I mean, 'castle', has been amusing for showing how much people are willing to sound off on topics from a single obviously-untrustworthy photograph. Have you ever seen a photograph of the interior or a layout? No, you merely see the single aerial real estate brochure shot using a telephoto zoom lenses framed as flatteringly as possible to include stuff that isn't even the Abbey - like that turreted 'castle' you see in the photo up above isn't even part of <a href=\"https://maps.app.goo.gl/Lgusqbzc7k8JrFvZA\">the Abbey</a> - because that's an active church, <a href=\"https://www.wytham-church.org.uk/\">All Saints Church</a>!* (Really, apply some critical thinking here: you think some manor house one can buy will just have a bunch of visible graves in it...?)</p>\n<p>Let me ask something: how many of the people debating the Abbey on this page have <em>been there</em>? I don't see anyone directly addressing the core claim of 'luxury', so I will.</p>\n<p>I was there for an AI workshop earlier this year in Spring and stayed for 2 or 3 days, so let me tell you about the 'luxury' of the 'EA castle': it's a big, empty, cold, stone box, with an awkward layout. (People kept getting lost trying to find the bathroom or a specific room.) Most of the furnishings were gone. Much of the layout you can see in Google Maps was nonfunctional, and several wings were off-limits or defunct, so in practice it was maybe a quarter of the size you'd expect from the Google Maps overview. There were clearly extensive needs for repair and remodeling of a lot of ancient construction, and most of the gardens are abandoned as too expensive to maintain. It is, as a real estate agent might say, very 'historical' and a 'good fixer-upper'.</p>\n<p>The kitchen area is pretty nice, but the part of the Abbey I admired most, from the standpoint of 'luxury', was the view of the neighboring farmer's field. (It was extraordinarily green and verdant and picturesque, truly exemplifying \"green and pleasant land\". I tried to take some photos on my phone, but they never capture the wetness &amp; coloring.)</p>\n<p>Otherwise, the best efforts of the hardworking staff at the workshop notwithstanding - and I'm trying not to make this sound like an insult - I would rate the level of 'luxury' as roughly 'student hostel' level. (Which is fully acceptable to me, but anyone expecting 'luxury' or the elite lifestyle of the Western nomenklatura is going to be disappointed. Windsor or Balmoral or a 5-star hotel, this is not.) Indeed, I'm not sure how the place could be in much rougher shape while still being an acceptable setting for a conference. (Once you're down to a big mattress in an empty room, it's hard to go down further without, like, removing electricity and indoor plumbing.)</p>\n<p>The virtue of the Abbey is that it can be relatively easily reached from London/the rest of the world by simple public transit routes that even a first-time foreigner can navigate successfully, and contain a decent number of people without paying extortionate Oxford hotel rates or forcing people to waste hours a day going back &amp; forth between their own lodgings creating lots of overhead in coordination. (\"Oh, you should talk to Jack about that! oh, he just called an Uber for his hotel. Never mind.\")</p>\n<p>Buying it seems entirely reasonable to me assuming adequate utilization in terms of hosting events. (Which may or may not be the case, but no one here or elsewhere is even attempting to make it.) Nor do I see why any sort of public discussion would be <em>so</em> important and so scandalous to not have, because this is a subject on which any sort of 'public discussion' would be pointless - random Internet commenters don't have a better idea of the FHI/EA event calendar or constraints of Oxford hotel booking than the people who were making the decisions here.</p>\n<p>* I don't know if technically it sits on the Abbey parcel or what, because England has lots of weird situations like that, but EA and EA visitors are obviously not getting any good or 'luxury' out of an active church regardless of its <em>de jure</em> status (we made no use of it in any way I saw), and including it in the image is misleading in an ordinary realtor sort of way.</p>\n", "parentCommentId": null, "user": {"username": "gwern"}}, {"_id": "jQkjREgsqZ7p9HfsF", "postedAt": "2023-01-11T11:25:23.501Z", "postId": "76dQ6YfBuLzJDdTgz", "htmlBody": null, "parentCommentId": "mfTBNuoPb7WHfk4t9", "user": null}]