[{"_id": "pfz9kHQK8Tosvf6nf", "postedAt": "2023-09-21T00:07:50.279Z", "postId": "76jggcSWWqirqTzdg", "htmlBody": "<p>I quite like this post. I think though that your conclusion, to use CDT when probabilities aren't affected by your choice and use EDT when they are affected, is slightly strange. As you note, CDT gives the same recommendations EDT in cases where your decision affects the probabilities, so it sounds to me like you would actually follow CDT in all situations (and only trivially follow EDT in the special cases where EDT and CDT make the same recommendations).</p>\n<p>I think there's something to pointing out that CDT in fact recommends one boxing wherever your action can affect what is in the boxes, but I think you should be more explicit about how you prefer CDT.</p>\n<p>I think near the end of the post you want to call it Bayesian decision theory. That's a nice name, but I don't think you need a new name, especially because causal decision theory already captures the same idea, is well known, and points to the distinctive feature of this view: that you care about causal probabilities rather than probabilities that use your own actions as evidence when they make no causal difference.</p>\n<p>When you say \"This would be the kind of decision theory that smokes, one-boxes, and doesn’t pay the biker ex-post, but “chooses to pay the biker ex-ante.” In other words, this would be the kind of decision theory that recommends decisions that maximize expected utility.\" I find this an odd thing to say, and perhaps a bit misleading, because that's what both EDT and CDT already do, they just have different conceptions of what expected utility is.</p>\n", "parentCommentId": null, "user": {"username": "rileyharris"}}, {"_id": "QPtmGmgiaAd5gtFZe", "postedAt": "2023-09-21T00:10:36.455Z", "postId": "76jggcSWWqirqTzdg", "htmlBody": "<p>A quick clarification: I mean that \"maximize expected utility\" is what both CDT and EDT do, so saying \"In other words, this would be the kind of decision theory that recommends decisions that maximize expected utility\" is perhaps misleading</p>\n", "parentCommentId": "pfz9kHQK8Tosvf6nf", "user": {"username": "rileyharris"}}]