[{"_id": "CjdPc5ry6PnSSDpnZ", "postedAt": "2017-10-22T17:48:25.512Z", "postId": "76m7rdty9SdE4wTcB", "htmlBody": "<p>I think the marginal vs. total distinction is confused. Maximizing personal impact, while taking into account externalities (as EAs do), will be equivalent to maximizing collective impact.</p>\n<blockquote>\n<p>An Effective Altruist, by focusing on impact at the margin, may ask questions such as: What impact will my next $100 donation make in this charity vs that charity? </p>\n</blockquote>\n<p>It seems you're trying to set up a distinction between EA focusing on small issues, and systems change focusing on big issues. But this is a strawman. Even if an individual makes a $100 donation, the cause they're donating to can still target a systemic issue. In any case, there are now EAs making <a href=\"https://soundcloud.com/80000-hours/10-nick-beckstead-on-how-to-spend-billions-of-dollars-to-prevent-human-extinction\">enormous donations</a>: &quot;What if you were in a position to give away billions of dollars to improve the world? What would you do with it?&quot;</p>\n<blockquote>\n<p>This approach invites sustained collective tolerance of deep uncertainty, in order to make space for new cultural norms to emerge. Linear, black-and-white thinking risks compromising this creative process before desirable novel realities have fully formed in a self-sustaining way.</p>\n</blockquote>\n<p>This is pretty mystical.</p>\n", "parentCommentId": null, "user": {"username": "Michael_Wiebe"}}, {"_id": "sxd9qYzA2P7dFb7FR", "postedAt": "2017-10-23T15:14:55.386Z", "postId": "76m7rdty9SdE4wTcB", "htmlBody": "<blockquote>\n<p>while taking into account externalities (as EAs do)</p>\n</blockquote>\n<p>I think that the current EA methodology to take into account impact externalities is incomplete. I am not aware of any way to reliably quantify flow-through effects, or to quantify how a particular cause area indirectly affects the impact of other cause areas. </p>\n<p>The concept of total impact, if somehow integrated into our cause prioritisation methodology, may help us to account for impact externalities more accurately. I concede that total impact may be too simplistic a concept...</p>\n<p>For what it's worth, I currently think the solution requires modelling the Earth as a complex system, clarifying top-level metrics to optimise the system for, and a probability weighted theory of change for the system as a whole.</p>\n<hr />\n<blockquote>\n<p>It seems you're trying to set up a distinction between EA focusing on small issues, and systems change focusing on big issues. </p>\n</blockquote>\n<p>I do not mean to say that EA focuses on small issues and systems change focuses on big issues. Rather, I see EA as having a robust (but incomplete) cause prioritisation methodology, and systems change having a methodology that accounts well for complexity (but neglects cause prioritisation in the context of the system of Earth as a whole). </p>\n<hr />\n<blockquote>\n<p>This is pretty mystical.</p>\n</blockquote>\n<p>On reflection, I think that conducting systems change projects in appropriate phases, with clear expectations for each phase, is a viable way to synthesis EA and systems change approaches and culture. Specifically, a substantial research phase would typically be required to understand the system before one can know what interventions to prioritise.</p>\n", "parentCommentId": "CjdPc5ry6PnSSDpnZ", "user": {"username": "oliverbramford"}}, {"_id": "z6aQEwgLmEkQqdjfL", "postedAt": "2017-10-23T16:28:38.408Z", "postId": "76m7rdty9SdE4wTcB", "htmlBody": "<blockquote>\n<p>For what it's worth, I currently think the solution requires modelling the Earth as a complex system, clarifying top-level metrics to optimise the system for, and a probability weighted theory of change for the system as a whole.</p>\n</blockquote>\n<p>I'd be interested in seeing this. Do you have anything written up?</p>\n", "parentCommentId": "sxd9qYzA2P7dFb7FR", "user": {"username": "Michael_Wiebe"}}, {"_id": "j7RvQbWrZ6XyeTPXH", "postedAt": "2017-10-25T13:51:56.217Z", "postId": "76m7rdty9SdE4wTcB", "htmlBody": "<p>Parts 3 and 5 of the article linked below explain this approach is more detail, although my thinking has moved on a bit since writing this. </p>\n<p>There's a good chance that these ideas will be refined and written up collaborative in an applied context as part of GeM Labs' Understanding and Optimising Policy project over the next year. If they are out of scope of this project, I intend to develop them independently and share my progress.</p>\n<p><a href=\"https://docs.google.com/document/d/1DFZ9OAb0g5dtQuZHbAfngwACQkgSpjqrpWWOeMrsq7o/edit?usp=sharing\">https://docs.google.com/document/d/1DFZ9OAb0g5dtQuZHbAfngwACQkgSpjqrpWWOeMrsq7o/edit?usp=sharing</a></p>\n", "parentCommentId": "z6aQEwgLmEkQqdjfL", "user": {"username": "oliverbramford"}}]