[{"_id": "xfRPwrGazYkBvhAzb", "postedAt": "2023-09-19T21:38:25.021Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>I echo the general sentiment -- I find the CHT to work diligently and be in most cases compassionate. I generally look up to the people who make it up, and I think they put a lot of thought into their decisions. From my experience, they helped prevent at least three problematic people from accruing power and access to funding in the Spanish Speaking community, and have invested 100s of hours into steering that sub community towards what they think is a better direction, including being always available for consultations.</p>\n<p>I also think that they undervalue the work and wellbeing of community builders, that they have a lot of unaccountable influence on grant decisions and that they make some decisions that I don't think an experienced HR / conflict mediation team would endorse and that causes very competent community builders to turn away from the job, more below</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/6Ph937BtRGmox2K8y/jsevillamol-s-shortform?commentId=XLdw6FEfKrtPAKD9e\">https://forum.effectivealtruism.org/posts/6Ph937BtRGmox2K8y/jsevillamol-s-shortform?commentId=XLdw6FEfKrtPAKD9e</a></p>\n", "parentCommentId": null, "user": {"username": "Jsevillamol"}}, {"_id": "sCWLcAfYynGccJoxK", "postedAt": "2023-09-20T00:48:18.452Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<blockquote><p>Basically no one knows about any of the times they do things well because why would they?</p></blockquote><p>This line particularly resonated with me. There are some types of work where doing it successfully means nobody ever hears about you: we generally don't pays attention to people who prevent bad things because we don't notice the absence of bad things as anything... well, as anything notable. It is almost like <i>publication bias</i> or some similar <i>I don't see it so I think it doesn't exist</i> situation. I imagine that community health work is often (although not always) a kind of invisible labor.</p><p>I suspect that the culture of EA is a little more likely to acknowledge and respect this kind of work (and I think it does a decent amount better than the broader society), but it still strikes me as less respected than the people doing more active, visible, and promoted things.</p><p>This is also strongly reminiscent of ideas in <a href=\"https://www.goodreads.com/book/show/49255368-the-innovation-delusion\">The Innovation Delusion</a>, which describes how \"maintenance and care workers, including IT helpdesks, nurses, and people who take out the trash both on our streets and on our social media networks, are underpaid and disrespected.\"<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref51400drkyvd\"><sup><a href=\"#fn51400drkyvd\">[1]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn51400drkyvd\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref51400drkyvd\">^</a></strong></sup></span><div class=\"footnote-content\"><p>These are not my words. This is from <a href=\"https://www.goodreads.com/review/show/3912209858\">a book review</a>.&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "voMvtFmAixxuNmnk5", "postedAt": "2023-09-20T14:40:26.436Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>Would love to read some concrete examples of cases where the CHT made a difference, despite the 'if it's invisible it means that it is successful' line of thinking that I fully understand. I also understand why some people say that CHT did not intervene in instances where it would have been necessary because the official line remains 'CHT isn't the EA police/conflict solver' when confronted with these questions.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "ZkiDrtCZ9RgpXzaZo", "postedAt": "2023-09-22T22:08:36.498Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>Mine would too. Thank you for writing this!</p>", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "W5dMggBSByxK5YQqr", "postedAt": "2023-09-23T21:54:50.934Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>Hi, you can read examples in this list of <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in#Appendix__12_months_of_cases\">12 months of cases</a> we handled.</p>", "parentCommentId": "voMvtFmAixxuNmnk5", "user": {"username": "Julia_Wise"}}, {"_id": "axWw3DnytdEnoa7Yp", "postedAt": "2023-09-24T17:01:59.403Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "W5dMggBSByxK5YQqr", "user": {"username": "Vaipan"}}, {"_id": "WgG8NfBKBo8xQPm8H", "postedAt": "2023-09-26T11:31:35.872Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>I really liked this post and agree with much of it.</p><p>I ran the Forum for a while. This involved handling interpersonal conflict. At worst, the conflicts on my plate were things like \"an argument between two people\" or \"someone having a mild breakdown in text form\". These are relatively minor issues on the CH scale, but they were among the most stressful elements of my job; I'd get lost for hours trying to write the perfect moderator response, or arguing with someone in DMs about how I'd resolved a situation.</p><p>I'd find dealing with CH situations <i>much </i>more stressful — because of their severity, and because I wouldn't even <i>get </i>to write a moderator response. I thrive on being able to explain myself, and forced silence/vagueness would drive me crazy. Instead of \"using quotes from a public post to describe why we've banned someone for a week\", I'd have \"using my best judgment about a story with multiple sides to explain why we've made a decision that will have a serious impact on the lives of multiple people, at least one of whom will be unhappy with the decision and possibly share their side on the Forum later\". And I might not even be able to say what the decision <i>was</i>!</p><p>So while I don't know enough about internal CH matters to say that I'd agree with all their decisions, I appreciate that having to make those decisions at all — and face public scrutiny without recourse to transparency — is extremely difficult, and that there is no way to \"win\" every such decision.</p>", "parentCommentId": null, "user": {"username": "aarongertler"}}, {"_id": "4XhpLDy5nwAXAwJzw", "postedAt": "2023-09-27T16:47:14.233Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>Do you think you'll do another of these?</p>", "parentCommentId": "W5dMggBSByxK5YQqr", "user": {"username": "nathan"}}, {"_id": "fQJF7qv8ooTdDJqLa", "postedAt": "2023-09-28T16:11:55.288Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>We don't have immediate plans to do another one, but do think it would be valuable to do at some point.</p>", "parentCommentId": "4XhpLDy5nwAXAwJzw", "user": {"username": "Julia_Wise"}}, {"_id": "cTXtppAvbnZcZriv8", "postedAt": "2023-09-29T10:03:12.241Z", "postId": "78A2NHL3zBS3ESurp", "htmlBody": "<p>I sense making community health more predictable to people would be valuable - <i>what is community health likely to do in this kind of situation? What will happen to me if I talk to communtiy health in this situation? What will happen if I behave like this?</i></p>", "parentCommentId": "fQJF7qv8ooTdDJqLa", "user": {"username": "nathan"}}]