[{"_id": "JkLBvFumR6W5GHhnY", "postedAt": "2023-08-26T17:56:08.848Z", "postId": "7aieQzPcBKxMGn9Xo", "htmlBody": "<p>Hi Ozzie, what’s the ask and intended audience here?</p>\n<p>The problems here seem interesting and maybe even approachable to a dedicated newbie. So I was wondering if my background was any use. I used to work in software engineering with JavaScript and now work in data cleaning research assistance with R.</p>\n<p>But I can’t tell if this is an open call to submit pull requests to an open source library on GitHub, a request for advice, or a request for someone to work part-time / full-time</p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "23AHZxtCmjCs5iCnD", "postedAt": "2023-08-26T18:57:27.077Z", "postId": "7aieQzPcBKxMGn9Xo", "htmlBody": "<p>Good questions!&nbsp;<br><br>I'm imagining hobbyists or people interested in taking on side projects. People interested in getting more involved in this area. If someone is an unusually great fit, for a fairly small project, we might be able to provide funding.</p><p>Almost all of this could be done outside our codebase. Just make an NPM package, or even just get something working in ObservableJS or similar. Post to the EA Forum, or just tell us.&nbsp;</p><p>I think of these as similar to other open EA-related lists of problems. In our case, we can use many of these solutions in Squiggle, but I think even if we don't, they might well be useful for other EA-related JS/probability projects in the future.&nbsp;<br><br>I think the main constraints, for people with some analytical background, is enthusiasm and time. Many of these could be attacked by someone clever and sufficiently motivated - but it would take some time (especially for polish and testing, if you can do that part).&nbsp;<br><br>Again, if you might seriously be interested, I'd be happy to chat. We have a related Slack that could be a good fit, or we could do a video chat - let me know which might interest you.</p>", "parentCommentId": "JkLBvFumR6W5GHhnY", "user": {"username": "oagr"}}, {"_id": "xcCbpDpWQDqBJMsyx", "postedAt": "2023-08-31T18:56:16.347Z", "postId": "7aieQzPcBKxMGn9Xo", "htmlBody": "<blockquote><p>There’s a common use case of wanting to force one distribution of samples to be manually correlated with another. However, there are many ways of doing this; it’s unclear what’s best. It probably makes sense to have several options eventually, but it would be good to have one or two robust recommended options.</p></blockquote><p>I <a href=\"https://github.com/rethinkpriorities/squigglepy/pull/41\">recently implemented this</a> for squigglepy, but using the (somewhat) simpler Iman-Conover Method instead of copulas. Copulas are more flexible, but I imagine IMC would be much easier to implement for Squiggle.</p><p>If anyone wants to implement something similar for Squiggle, I would love to help in any way.</p>", "parentCommentId": null, "user": {"username": "agucova"}}]