[{"_id": "53Cqc9heQHcbroyuE", "postedAt": "2023-05-15T19:47:24.709Z", "postId": "7ajePuRKiCo7fA92B", "htmlBody": "<p>Wonderful article. &nbsp;Although I love the gradual re-entry idea, I think we have to be careful not to impede on the right to be free from too much control after one has served their sentence. &nbsp;I have ideas, and have been fund-raising, to start an NGO that assists ex-felons post-release locate jobs, housing, and even learn how to start a small business. &nbsp;For me, I believe that the answer to promoting crime free lives is in assuring that people have their basic needs met; safe housing, a means to a sustainable income, access to education, etc. &nbsp;Basically a feeling of well-being and belonging to a society that values their contribution. &nbsp;I have started a GoFundMe to help achieve these goals.&nbsp;</p><p>https://gofund.me/1ead8073</p>", "parentCommentId": null, "user": {"username": "AngelaCheap"}}, {"_id": "dLdqEkAGxqi79PeGq", "postedAt": "2023-05-15T20:31:01.692Z", "postId": "7ajePuRKiCo7fA92B", "htmlBody": "<p>I am pleased to have found this site; it seems like a great place to keep up to date with current research from reliable academic sources regarding criminal justice reform. &nbsp;The problem with movements such as Black Lives Matter is that they bring lots of well meaning folks together, that do want change, without the proper information from trusted academic leaders who have spent years doing the research. &nbsp;We need to bridge this divide, and put the information in the hands of organizers on the ground. &nbsp;Otherwise people just stand around wondering what they are supposed to be doing. &nbsp;I will certainly be re-posting links to articles such as this one. &nbsp;Thanks!</p>", "parentCommentId": null, "user": {"username": "AngelaCheap"}}, {"_id": "ZXNia9rixBE2jKhyN", "postedAt": "2023-05-23T07:46:01.372Z", "postId": "7ajePuRKiCo7fA92B", "htmlBody": "<p>In writing this, I drew heavily from a book:\nPrison Break: Why Conservatives Turned Against Mass Incarceration, by David Dagan and Steven M. Teles</p>\n<p>You may find this helpful as a primer on how reform actually gets passed and implemented, in addition to Mark Kleiman's work about what should be done.</p>\n", "parentCommentId": "dLdqEkAGxqi79PeGq", "user": {"username": "ruthgrace"}}]