[{"_id": "cCHgG6xurKe6XiENB", "postedAt": "2023-03-07T21:28:39.802Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Sadly I fear stories like this are lost on the devoted EA crowd here. We're likely to see another round of rationalizing, distancing, downvoting, and flooding the forum with posts to drown out the stories of power being abused at the hands of tech industry elites at the expense of young idealistic women. I fully expect this comment to be downvoted to oblivion, if it is even approved. But I would love to see a real reckoning from this community about its chummy relationship with the powerful (abusers and exploiters of labor), and the cultish single-minded fixation on technological \"solutions\" at the expense of any sense of camaraderie and sympathy for the vulnerable and downtrodden. Not everything is a problem that you can solve on a whiteboard. Most issues require being a human being in the real world that we have right now.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Eugenics-Adjacent"}}, {"_id": "zAGyHFfh84jJRfibG", "postedAt": "2023-03-07T22:19:18.186Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "", "parentCommentId": "cCHgG6xurKe6XiENB", "user": {"username": "ParetoPrinciple"}}, {"_id": "8hfoDgCRdaF2cgKtw", "postedAt": "2023-03-07T23:12:22.178Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Point taken about the frontpage placement, although my comment mostly intended to point at a lost opportunity for meaningful engagement, self-reflection, and stepping outside the internal logic of groupthink, rationalizing, and defensiveness (which are the phenomena I have observed on previous posts of this nature) – not just the house metric of clicks.&nbsp;</p><p>My worry is that the EA mentality is capable of absorbing information publicly revealing increasingly puerile forms of abuse and using the high-level thinking so important to the valorization of the ideology as a tool to obfuscate the real, problematic power dynamics within the ranks of its movement. The article does explicitly address this.&nbsp;<br><br>This seems to be one of the most major pieces yet about EA for a mass audience, so I'm hoping it's taken with a sense of gravity and thoughtfulness. I see no one else has commented, unfortunately. The account I'm replying to has now made accusations of journalistic dishonesty and bias, though, about which I'm interested to hear more.&nbsp;<br><br>I have made no such comment about marginalized groups, so I'm not sure what the warning was for.&nbsp;</p>", "parentCommentId": "zAGyHFfh84jJRfibG", "user": {"username": "Eugenics-Adjacent"}}, {"_id": "vbGEmyB8JtL7RBjrF", "postedAt": "2023-03-07T23:12:33.137Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I feel like you're being unfair here.</p>\n<p>The EA community engages quite a lot with its critics, more than the average movement. Of course reactions will differ in a community of ~10k active members, but the most upvoted posts &amp; reactions I read are usually very empathetic and caring.</p>\n<p>Also this post is about the Rationality community, and I think it'd be better to keep the discussion about that and not mix in EA community issues here (there are enough other posts about the EA community).</p>\n", "parentCommentId": "cCHgG6xurKe6XiENB", "user": {"username": "Manuel_Allgaier"}}, {"_id": "u8MzaggK6SoLFjFNc", "postedAt": "2023-03-07T23:28:30.491Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I don't think stories like this are lost on devoted EAs. But I think that many of us have heard of them many times before and you are going to see less and less handwringing the more the same stories get posted as proof of worse and worse systemic problems. <strong>For example</strong> I personally was outspoken about the Brent Dill case mentioned above back in 2018, at the time, even though I was new in the community. You could say I was incensed. I even had a meeting with the leader of CFAR at the time (which actually was good of them tbh). Anyway, witnessing that whole thing left a bad taste in my mouth and I definitely kept caring enough that I steered clear of the rationality community (not &nbsp;EA community, they are different!) for years. <strong>But as shocked as I was when that came out (as many were), that doesn't mean I think that it is right to bring that incident up for the rest of time, (if 5 years later is fine, why not 8? Why not 10 years later?), as proof that EA or even the rationality community has a certain problem </strong><i><strong>today</strong></i><strong>.&nbsp;</strong><br><br>Like yes, for sure, there was a problem there. For sure there are problems in little bubbles elsewhere, well I'd bet so anyway, because that's just life right now until society becomes a bit \"better\" about women. But like, the EA community is huge and diverse and many of us who care about this are frankly tired and are starting to not even be sure that we want to feed a narrative that seems to run away with itself into false, generalized directions? Even if we would like to talk about it...? <strong>A lot of us who care are starting to learn that it seems like there isn't a way to talk about this that doesn't lead to people hijacking the conversation to shame all EAs, including those of us who care..? And like, it's totally reasonable if those us who care don't want to play into generalization of ourselves or the movement we care about, a movement which contains our friends whom we also know don't deserve to be generalized in this way?</strong><br><br>In general I think most EAs are totally cool with people making reports etc, I'd certainly encourage it. 100%. I've done so myself multiple times over the 5 years I've been in EA, whenever there was something that happened at an actual EA or rat space. I think it is important that things be brought to attention and logged and tracked somehow, and retributive action be taken if necessary. I just wish in these articles and discussions that there were timestamps and more details attached and such so we knew what we actually had to be worried about? Once you look at the timestamps and other details in relation to the hugeness of the EA community you can't help but notice how much it looks like either cherrypicking OR beating a dead horse and frankly a little sideeyeing of and flatout ignoring journalists (not the women's primary reports themselves though!) is starting to look very, very fair. &nbsp;For EAs who care enough to want details and stuff, there just isn't a lot to say especially if you have heard the vague story before?&nbsp;<br><br>There are plenty of EAs who want any problems handled, but who also aren't going to voluntarily put on a badge of shame. But like, some people, possibly you are one of them, seem to want the whole community to put on a badge of shame? It's like... if people don't see enough handwringing they think EAs as a group don't care about women? But EA is 1/3 women? Anyway, (constant) shows of handwringing (like again and again in response to stories you have already heard) are not actually what you should care about? You should care about hard numbers and detailed incident reports and <i>what is being done</i>? People making their care evident to you and other lurkers is simply not going to be the priority? Like sorry you can't see that many of us in EA give a damn, but I think you must not be looking and it isn't our priority to shove our care in your face at <i>every single turn</i> (sometimes, sure, but not all the time forever) as the most evident thing we do. It is not the lurking self-appointed judges who matter. It is the actual experiences of women etc. You wouldn't expect to see constant updates from any <i>company</i> that is trying really hard to handle gender-related issues, it has other goals too. So like, maybe don't expect constant updates from EA either, and chill out on trying to drag EAs?&nbsp;<br><br>I hope you can take this comment in full stride. On reflection you can likely realize how it appears you'd want to put EAs in a box. It's not fair given how diverse the EA community is and how many of us were already thinking about these problems and were way before the Time piece? For all the pushing you and other users like you have done these past few months I think you earned a little push*back*</p>", "parentCommentId": "cCHgG6xurKe6XiENB", "user": {"username": "Ivy_Mazzola"}}, {"_id": "rAk5k5rWuRCnjL6ce", "postedAt": "2023-03-07T23:44:18.798Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>To riff off a particularly disturbing line in the article:</p>\n<p>Anyone who as a member of the AI safety community has committed, or is committing, sexual assault is harming the advancement of AI safety, and this Forum poster suggests that an agentic option for those people would be to remove themselves from the community as soon as  possible. (I mean go find a non-AI job at Google or something.)</p>\n<p>Whoever suggested to a survivor that they should consider death by suicide should also leave ASAP.</p>\n<p>[Edit to add: My sentiment is not limited to sexual assault; many forms of sexual misconduct that do not involve assault warrant the same sentiment.]</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "TA6orkpdjGC5EvcdL", "postedAt": "2023-03-08T00:05:56.837Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>These stories are horrifying. I want to thank the victims for speaking up, I know it can't be easy.&nbsp;</p><p>It's worth noting that while some of these allegations overlap with the ones in the times article, a lot of them are new. This article also makes more of an effort to distinguish between the EA and Rationalist communities, which are fairly close but separate. &nbsp;I think most, but not all, of the new allegations &nbsp;are more closely tied to Rationalism than EA, but I could be wrong.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "EgLr33Rv2mYZwesLZ", "postedAt": "2023-03-08T00:07:08.063Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>One of the quotes is:</p><blockquote><p>Effective altruism swung toward AI safety. “There was this pressure,” says a former member of the community, who spoke on condition of anonymity for fear of reprisals. “If you were smart enough or quantitative enough, you would drop everything you were doing and work on AI safety.”</p></blockquote><p>I think the implication here is that if you are working on global poverty or animal welfare, you must not be smart enough or quantitative enough. I'm not deeply involved so I don't know if this quote is accurate or not.</p>", "parentCommentId": null, "user": {"username": "Brian Lui"}}, {"_id": "54auSKkkbCqkdpPTk", "postedAt": "2023-03-08T00:23:37.251Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>The response on the LW forum has been horrifying.</p><p><a href=\"https://www.lesswrong.com/posts/bFHKFoBmcAjiQYgau/article-about-abuse-in-lesswrong-and-rationalist-communities\">https://www.lesswrong.com/posts/bFHKFoBmcAjiQYgau/article-about-abuse-in-lesswrong-and-rationalist-communities</a></p><p>&nbsp;</p><p>Update: there are some now sane commenters in the mix, although those comments came much later.</p>", "parentCommentId": "TA6orkpdjGC5EvcdL", "user": {"username": "whistleblower67"}}, {"_id": "d3uhFQohxFojSx3Ma", "postedAt": "2023-03-08T00:24:05.365Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>This is so much more damning than the Time article. It includes deeply disturbing details instead of references to people's feelings. We need to do so much more more soul searching over this than we did over the Time article. [Edit: I've been very critical of the Time article, and don't have an opinion about whether we should be doing more soul-searching on sexual misconduct overall than we are already]. I found the contrast between the two descriptions of Joseph's dinner with the older man particularly troubling.</p><p>This is the description in the Time article:</p><p><strong>\"In 2018, as she was starting her career in AI research, Joseph recalls being introduced to a prominent man in the field connected to EA. Joseph was 22 and still in college; he was nearly twice her age. As they talked at a Japanese restaurant in New York City, she recalled, the man turned the conversation in a bizarre direction, arguing “that pedophilic relationships between very young women and older men was a good way to transfer knowledge,” Joseph says. “I had a sense that he was grooming me.” (Joseph says she told her roommate about the alleged incident. The roommate confirmed that conversation to TIME.)\"</strong></p><p>This did not indicate that this was possibly a work related event, did not mention the man insisting on staying over, and most importantly, said he was referring to relationships between men and women, meaning that the word pedophilic would have been incorrect in this description.</p><p>I'm glad we have a better data now that indicates how important this issue is.</p>", "parentCommentId": null, "user": {"username": "SoniaAlbrecht"}}, {"_id": "n5PEKbugvxkAbz9Co", "postedAt": "2023-03-08T00:33:35.690Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Edit: This statement is about my personal experience in the biggest EA AI safety hub. It’s not intended to be anything more than anecdotal evidence, and leaves plenty of room for other experiences. Thanks to others for pointing out this wasn’t clear.&nbsp;<br><br>I'm part of the AI-oriented community this part is referring to, and have felt a lot of pressure to abandon work on other cause areas to work on AI safety (which I have rejected). In my experience it is not condescending at all. They definitely do not consider people who work in other cause areas less smart or quantitative. They are passionate about their cause so these conversations come up, but the conversations are very respectful and display deep open-mindedness. A lot of the pressure is also not intentional but just comes from the fact that everyone around you is working on AI.</p>", "parentCommentId": "EgLr33Rv2mYZwesLZ", "user": {"username": "SoniaAlbrecht"}}, {"_id": "sLWD4BSHMrfZYEWxY", "postedAt": "2023-03-08T00:46:18.662Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I suggest a period of talking about feelings and things we agree and then we wait 3 days to actually discuss the object level claims. Often I think we don't get consensus on the easy stuff before we move to the hard stuff.</p>\n<p>I imagine we mostly agree that people being upset is sad and that, in a better world, none of these people would be upset.</p>\n<p>Personally I'm sad and a bit frustrated and a bit defensive.</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "RhYmY738gvtWqWmRW", "postedAt": "2023-03-08T00:46:52.589Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>As an outsider and having read each allegation made by the Victims and seeing past comments made here and elsewhere like LessWrong its astonishing to me that the community it self constantly attempts to deflect and victim blame as is CLEARLY evident among the comments seen here regarding the take down of the heavily downvoted 'Women and Effective Altruism' post here: <a href=\"https://forum.effectivealtruism.org/posts/sD4kdobiRaBpxcL8M/what-happened-to-the-women-and-effective-altruism-post\">https://forum.effectivealtruism.org/posts/sD4kdobiRaBpxcL8M/what-happened-to-the-women-and-effective-altruism-post</a>&nbsp;</p><p>Its disgraceful that people are calling the victim 'bigoted' for talking about the abusive culture around poly relationships in EA, and then to go on and question why she would take the post down when commenters go on to victim blame her even when she says how distressing the comments are. All you see among the comments are excuses attempting to defend the culture by claiming its elsewhere as well or that there will always be such abuse cases. Even when I was in University I didn't see such comments made (in Canada).</p><p>To anyone on the outside the cult like nature of EA is very evident especially when you have such highly influential people attending events that gatekeep the most coveted jobs in the Valley and allow them to freely talk about their sexual lives as if its natural with young adults in their early 20s. It is very evident how this dynamic can lead to cases of abuse and cover up when everybody in the community and at these events wants to put the best impression forward to key people who can dictate their career success. Its not anything specific to EA but the simple power dynamic that exists and was seen with allegations made against people like Brent, add to this a very faulty messiah complex and its easy to see why a lot of bias against victims exist. At least its VERY reassuring to see leaders begin to tackle this issue, but to many outsiders a clear bias among commenters and the community, at least in past, is evident when looking through past posts.</p>", "parentCommentId": null, "user": {"username": "Outsider55"}}, {"_id": "AQPHQDmQuRbmhz3m8", "postedAt": "2023-03-08T01:04:32.103Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>It's definitely important! It's also important to note that this person has likely already been banned from CEA events for 5 years and some other EA spaces: <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=jKJ4kLq8e6RZtTe2P\">https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=jKJ4kLq8e6RZtTe2P</a></p>\n<p>I honestly can't comment on how rationalists feel about it and what they have to learn. But I don't think non-rat EAs necessarily have to do \"so much more soul searching\"[edit: than we are already doing] about this. After all this entire piece is basically about the rationality community.</p>\n", "parentCommentId": "d3uhFQohxFojSx3Ma", "user": {"username": "Ivy_Mazzola"}}, {"_id": "cPkiefYziTfJTi7k5", "postedAt": "2023-03-08T01:08:15.506Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Oh awesome! That's a huge relief that this specific person has likely already been dealt with. It's a shame they didn't mention that in this article either.</p>", "parentCommentId": "AQPHQDmQuRbmhz3m8", "user": {"username": "SoniaAlbrecht"}}, {"_id": "B3xMGiDXtzNApAJum", "postedAt": "2023-03-08T01:39:27.238Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I share this sentiment.</p>\n<p>What you're referring to in the last sentence sounds like evil that doesn't even bother to hide.</p>\n<p>But this other part maybe warrants a bit of engagement:</p>\n<blockquote>\n<p>She says others in the community told her allegations of misconduct harmed the advancement of AI safety,</p>\n</blockquote>\n<p>If the allegations are true and serious, then I think it makes sense even just on deterrence grounds for people to have their pursuits harmed, no matter their entanglement with EA/AI safety or their ability to contribute to important causes. In addition, even if we went with the act utilitarian logic of \"how much good can this person do?,\" I don't buy that interpersonally callous, predatory individuals are a good thing for a research community (no matter how smart or accomplished they seem). Finding out that someone does stuff that warrants their exclusion from the community (and damages its reputation) is really strong evidence that they weren't serious enough about having positive impact. One would have to be scarily good at mental gymnastics to think otherwise, to think that this isn't a bad sign about someone's commitment and orientation to have impact. (It's already suspicious most researchers in EA have worldviews that play to their strengths or make their own work seem particularly important. To some degree, biases in that area are probably unavoidable. Still, at the very least, we can try to select for people who are capable of putting in a half-decent effort to avoid these biases and get it right.)</p>\n<p>Of course, sometimes particular behaviors seem unforgivable to some people but somewhat less bad to others. Therefore, I think it's really important to be clear/precise what an accusation is about. (I acknowledge that it can be tricky to give specifics due to protecting anonymity of accusers.) I can imagine circumstances where specific accusations would have significantly bad consequences on net – but not really if they are precise (also in the sense of not omitting important context) and truthful!</p>\n", "parentCommentId": "rAk5k5rWuRCnjL6ce", "user": {"username": "Lukas_Gloor"}}, {"_id": "FENRPHjJLJe3fykpY", "postedAt": "2023-03-08T01:42:47.128Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>They definitely do not consider people who work in other cause areas less smart or quantitative. They are passionate about their cause so these conversations come up, but the conversations are very respectful and display deep open-mindedness.</p></blockquote><p>I think this is an empirical question, and likely varies between communities, so \"definitely do not...\" seems too strong. For example, here's Gregory Lewis, a fairly senior and well-respected EA, <a href=\"https://forum.effectivealtruism.org/posts/MQWAsdm8MSzYNkD9X/announcing-the-effective-altruism-handbook-2nd-edition?commentId=BSzBCdYYfFcCKoP5P\">commenting</a> on different cause areas (emphasis added):</p><blockquote><p>Yet I think I'd be surprised if it wasn't the case that among those working 'in' EA, the majority work on the far future, and a plurality work on AI. It also agrees with my impression that the most involved in the EA community strongly skew towards the far future cause area in general and AI in particular. <strong>I think they do so, bluntly, because these people have better access to the balance of reason, which in fact favours these being the most important things to work on.</strong></p></blockquote><p>I wouldn't be surprised if other people shared this view.</p>", "parentCommentId": "n5PEKbugvxkAbz9Co", "user": {"username": "pseudonym"}}, {"_id": "irNwNJCmG4aEyyLhr", "postedAt": "2023-03-08T01:47:00.194Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thanks for sharing! Yeah I meant that only to refer to the people I know well enough to know their opinions and the general vibe I've gotten in the biggest EA AI safety hub. Mine &nbsp;is just anecdotal evidence and leaves a lot of room for other perspectives. Sorry I didn’t say that well enough.</p>", "parentCommentId": "FENRPHjJLJe3fykpY", "user": {"username": "SoniaAlbrecht"}}, {"_id": "4b8sDpsn4AKuukojX", "postedAt": "2023-03-08T01:48:04.303Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I think this article paints a fairly misleading picture, in a way that's difficult for me to not construe as deliberate.&nbsp;</p><p>It doesn't provide dates for most of the incidents it describes, despite that many of them happened many years ago, and thereby seems to imply that all the bad stuff brought up is ongoing. &nbsp;To my knowledge, no MIRI researcher has had a psychotic break in ~a decade. Brent Dill is banned from entering the group house I live in. I was told by a friend that Michael Vassar (the person who followed Sonia Joseph home and slept on her floor despite that it made her uncomfortable, also an alleged perpetrator of sexual assault) is barred from Slate Star Codex meetups.&nbsp;</p><p>The article strongly reads to me as if it's saying that these things aren't the case, that the various transgressors didn't face any repercussions and remained esteemed members of the community.</p><p>&nbsp;Obviously it's bad that people were assaulted, harassed, and abused at all, regardless of how long ago it happened. It's probably good for people to know that these things happened. But the article seems to assume that all these things are still happening, and it seems to be drawing conclusions on the basis of those assumptions, e.g. that misogyny is currently ubiquitous in the community, that AI alignment is a toxic field to work in, that people are regularly having psychotic breaks, etc.&nbsp;</p><p>For what it's worth, I think (as someone who has firsthand experience with EA and rationality in the Bay Area) that these things are untrue. But even if they were true, the author has not demonstrated that they possess the evidence to draw these conclusions, and yet they are nonetheless trying to convince the reader of them.</p>", "parentCommentId": null, "user": {"username": "CatGoddess"}}, {"_id": "adqQP2biz33osSCzM", "postedAt": "2023-03-08T01:55:40.181Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Oh I see! My mistake, I misunderstood what you were referring to, thanks for clarifying!</p>", "parentCommentId": "irNwNJCmG4aEyyLhr", "user": {"username": "pseudonym"}}, {"_id": "ruDaGwfbBt8qTrsdh", "postedAt": "2023-03-08T02:37:13.358Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Someone on the LessWrong crosspost linked this relevant thing: <a href=\"https://slatestarcodex.com/2015/09/16/cardiologists-and-chinese-robbers/\">https://slatestarcodex.com/2015/09/16/cardiologists-and-chinese-robbers/</a>&nbsp;</p>", "parentCommentId": "4b8sDpsn4AKuukojX", "user": {"username": "Lumpyproletariat"}}, {"_id": "k7hQwd84hDaurSCDE", "postedAt": "2023-03-08T02:40:54.625Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>It's unsurprising that the people who were willing to allow Bloomberg to print their names or identifying information about the wrongdoers were associated with situations where the community has rallied against the wrongdoer. It's also unsurprising that those who were met with criticism, retailation, and other efforts to protect the wrongdoer were not willing to allow publication of potentially identifying information. Therefore, I don't think it's warranted to draw inferences about community response in the cases without identifying information based on the response in cases with that information.</p><p>It would be helpful if the article mentioned both the status of the wrongdoer at the time of the incident and their current status in the relevant community.</p>", "parentCommentId": "4b8sDpsn4AKuukojX", "user": {"username": "Jason"}}, {"_id": "xnJ9sq4T8RkGWvG4b", "postedAt": "2023-03-08T02:43:14.234Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Mentioning that in the article would have defeated the purpose of writing it, for the person who wrote it.&nbsp;</p>", "parentCommentId": "cPkiefYziTfJTi7k5", "user": {"username": "Lumpyproletariat"}}, {"_id": "WvGqrpuZ9bi8rfrgJ", "postedAt": "2023-03-08T02:50:50.811Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hi Sonia,</p><p>You may not have the whole picture.&nbsp;</p><blockquote><p>In 2019, I was leaked a document circulating at the Centre for Effective Altruism, the central coordinating body of the EA movement. Some people in leadership positions were testing a new measure of value to apply to people: a metric called PELTIV, which stood for “Potential Expected Long-Term Instrumental Value.” It was to be used by CEA staff to score attendees of EA conferences, to generate a “database for tracking leads” and identify individuals who were likely to develop high “dedication” to EA — a list that was to be shared across CEA and the career consultancy <a href=\"https://80000hours.org/\"><strong>80,000 Hours</strong></a>. There were two separate tables, one to assess people who might donate money and one for people who might directly work for EA.</p></blockquote><p>&nbsp;</p><blockquote><p>What I saw was clearly a draft. Under a table titled “crappy uncalibrated talent table,” someone had tried to assign relative scores to these dimensions. For example, a candidate with a normal IQ of 100 would be subtracted PELTIV points, because points could only be earned above an IQ of 120. <strong>Low PELTIV value was assigned to applicants who worked to reduce global poverty or mitigate climate change, while the highest value was assigned to those who directly worked for EA organizations or on artificial intelligence.</strong></p></blockquote><p>Source: https://www.vox.com/future-perfect/23569519/effective-altrusim-sam-bankman-fried-will-macaskill-ea-risk-decentralization-philanthropy</p>", "parentCommentId": "n5PEKbugvxkAbz9Co", "user": {"username": "anoneaforumuser"}}, {"_id": "sNq6wmDyzE9S2i4Am", "postedAt": "2023-03-08T03:01:46.784Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Minor compared to much more important points other people can be making, but highlighting this line:</p><blockquote><p><strong>At dinner the man bragged that Yudkowsky had modeled a core HPMOR professor on him.</strong></p></blockquote><p>Wow, this is an interesting framing on Yudkowsky writing him in as <i>literal Voldemort</i>.&nbsp;</p><p>Maybe there's a lesson about trustworthiness and interpersonal dynamics here somewhere.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "oghZ8Ztctc8RpG7tx", "postedAt": "2023-03-08T03:24:44.059Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thanks for sharing this important information!&nbsp;</p><p>I want to add a couple important points from the Vox article that weren't explicit in your comment.&nbsp;</p><p>-This proposal was discarded</p><p>-The professional field scores were not necessarily supposed to be measuring intelligence. &nbsp;PELTIV was intended to measure many different things. To me professional field fits more into the \"value aligned\" category, although I respect that other interpretations based on other personal experiences with high status EAs could be just as valid.</p><p>I agree that work on AI safety is a higher priority for much of EA leadership than other cause areas now.</p>", "parentCommentId": "WvGqrpuZ9bi8rfrgJ", "user": {"username": "SoniaAlbrecht"}}, {"_id": "ysYE4rnBCC3xi4AKE", "postedAt": "2023-03-08T03:29:29.835Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>To my knowledge, no MIRI researcher has had a psychotic break in ~a decade</p></blockquote><p>It's worth noting that the article was explicit that ex-MIRI researcher Jessica Taylor's psychotic break was in 2017:</p><blockquote><p>In 2017 she was hospitalized for three weeks with delusions that she was “intrinsically evil” and “had destroyed significant parts of the world with my demonic powers,” she wrote in her post.</p></blockquote><p><a href=\"https://www.lesswrong.com/posts/pQGFeKvjydztpgnsY/occupational-infohazards\">She also alleged</a> in December 2021 that at least two other MIRI employees had experienced psychosis in the past few years:&nbsp;</p><blockquote><p>At least two former MIRI employees who were not significantly talking with Vassar or Ziz experienced psychosis in the past few years.</p></blockquote>", "parentCommentId": "4b8sDpsn4AKuukojX", "user": null}, {"_id": "d2a4icJufbi4pR5BR", "postedAt": "2023-03-08T03:41:54.831Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Among various emotions, I'm really sad and disappointed at hearing about the multiple survivor reports that the relevant community's response to their stories was survivor-blaming and/or retaliation. In my view, that speaks to a more widespread pathology that can't be minimized by claiming there were a few bad apples in the past who have been dealt with. It seems to reflect a more widely accepted, yet profoundly disturbing, idea that those with power and skill can trample on others who are expected to not rock the boat.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "BYvgpTxBTCZJQqHCz", "postedAt": "2023-03-08T03:56:05.192Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Following <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=4b8sDpsn4AKuukojX\">CatGoddess</a>, I'm going to share more detail on parts of the article that seemed misleading, or left out important context.&nbsp;</p><p>Caveat: I'm not an active member of the in-person EA community or the Bay scene. If there's hot gossip circulating, it probably didn't circulate to me. But I read a lot.</p><p>This is a long comment, and my last comment was a long comment, because I've been driving myself crazy trying to figure this stuff out. If the community I (digitally) hang out in is full of bad people and their enablers, I want to find a different community!&nbsp;</p><p>But the level of evidence presented in Bloomberg and TIME makes it hard to understand what's actually going on. I'm bothered enough by the weirdness of the epistemic environment that it drove me to stop lurking &nbsp;:-/</p><p>I name Michael Vassar here, even though his name wasn't mentioned in the article. Someone asked me to remove that name <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=gwMixknT76jNryKtt\">the last time I did this</a>, and I complied. But now that I'm seeing the same things repeated in multiple places and used to make misleading points, I no longer think it makes sense to hide info about serial abusers who have been kicked out of the movement, especially when that info is easy to find on other places. <a href=\"https://thingofthings.wordpress.com/2018/10/30/brent-dill-is-an-abuser/\">I prefer the Thing of Things approach</a>.</p><p>&nbsp;</p><p><strong>Summary of my comments + my conclusions:</strong></p><ul><li>There are some allegations of sexual assault or misconduct. Bloomberg mentions five, so those are the ones I discuss, though there are doubtless other accusations out there.</li><li>In at least two cases (assuming Michael Vassar and Brent Dill count), the alleged perpetrators have been officially shunned to the point of being banned from community spaces.</li><li>I would be unsurprised if some of the other cases show up in <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in#Appendix__12_months_of_cases\">this list</a> of stories, some of which end with official bans from EA events or other penalties.</li><li>In cases outside those categories, it isn't clear what anyone could or should have done, aside from socially shunning the alleged perpetrators. It isn't mentioned whether they had jobs at EA orgs, positions of community leadership, etc.</li><li>In some cases, it sounds like friends of the alleged perpetrators were jerks to their accusers. I don't have the full story on any of this, but my best guess is that those friends suck and should consider finding other places to hang out. Ostracizing accusers is common enough that I assume my communities have some people who do this common awful thing.</li><li>The EA and rationality communities have thousands of people in them and have existed for over a decade. Now that there have been two articles focused on us, I'm unconvinced that the actual sum of all these reported incidents points to anything particularly bad, aside from \"humans are gonna human\". I can think of many other communities that seem to be in much worse shape.</li></ul><p>&nbsp;</p><p><strong>A brief note before we go all TL;DR:</strong></p><p>On the subject of whether alleged perpetrators have been fired or defunded: <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScJooJD0Sm2csCYgd0Is6FkpyQa3ket8IIcFzd_FcTRU7avRg/viewform\">CEA</a> and <a href=\"https://twitter.com/albrgr/status/1622997976330440704\">Open Philanthropy</a> both have anonymous forms you can use to report allegations of sexual misconduct.&nbsp;</p><p>As far as I can tell, both orgs take these seriously, though the ambiguous and worrisome <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation\">Owen Cotton-Barratt case</a> left me more confident in Open Philanthropy than CEA. For example, it seems like a long time since I've heard of <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology\">Jacy Reese</a> getting EA funding.</p><p>If you've been abused by someone in the EA/rationalist orbit, please consider reporting it!</p><p>&nbsp;</p><p><strong>Detailed comments:</strong></p><ul><li><i>Eventually, she began dating an AI researcher in the community. She alleges that he committed sexual misconduct against her, and she filed a report with the San Francisco police.</i><ul><li>No idea what this refers to, and I hope the police took appropriate action. Would be nice if the article said more about what others in the community knew — who did Joseph talk to about this? Did she actually share a name at the time? Was the researcher employed by an org that chose not to fire him, or funded by someone who continued to do so after hearing about the allegations? What actions could anyone have actually taken?</li></ul></li><li><i>In 2013, Thiel, still a fixture on the edges of the rationalist scene, gave a </i><a href=\"https://www.youtube.com/watch?v=h8KkXcBwHec\"><i>keynote address</i></a><i> at an annual EA summit, hosted at a Bay Area rationalist group house.</i><ul><li>Thiel is more an opponent than a friend of rationality/EA at this point. I don't think he's funded rat/EA things for many years, and he specifically attacked AI safety as a \"Luddite\" field in &nbsp;a <a href=\"https://www.youtube.com/watch?v=fQ4rc7npiXQ\">recent speech</a> (starting at around 20:45).</li></ul></li><li><i>Although [Jessica Taylor] acknowledged taking psychedelics for therapeutic reasons, she also attributed the delusions to her job’s blurring of nightmare scenarios and real life [...] Several people in Taylor’s sphere had similar psychotic episodes. One died by suicide in 2018 and another in 2021.</i><ul><li>The circle of people I associate with \"jailbreaking\" are known as the Zizians, and they, like Thiel, seem like determined opponents of EA/rationality whose \"jailbreaking\" happened during a process of leaving the rationality community / looking for another way to live.</li><li>Various EA and rationality orgs are hiring extra event security in case these people show up. They are as isolated from the community as it is possible to be. See this <a href=\"https://medium.com/@sefashapiro/a-community-warning-about-ziz-76c100180509\">Medium post</a>.</li><li>It's also worth reading the <a href=\"https://www.lesswrong.com/posts/MnFqyPLqbiKL8nSR7/my-experience-at-and-around-miri-and-cfar-inspired-by-zoe?commentId=4j2GS4yWu6stGvZWs\">Scott Alexander comment</a> about this matter (Jessica's <a href=\"https://www.lesswrong.com/posts/pQGFeKvjydztpgnsY/occupational-infohazards\">post</a>, linked in Bloomberg, is largely a response to that comment).</li></ul></li><li><i>Within the subculture of rationalists, EAs and AI safety researchers, sexual harassment and abuse are distressingly common, according to interviews with eight women at all levels of the community.</i><ul><li>I believe, and I think the author would agree, that <i>any</i> amount of harassment and abuse would be distressing. This makes it hard to know what the author actually found.&nbsp;</li><li>Did the eight women all agree? Did some of them disagree, and not show up in the article as a result? How were the eight women chosen? Was there ever a chance that the reporter would talk to, or quote, someone like <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=u8MzaggK6SoLFjFNc\">Ivy</a>?</li></ul></li><li><i>Bryk, the rationalist-adjacent writer, says a prominent rationalist once told her condescendingly that she was a “5-year-old in a hot 20-year-old’s body.”</i><ul><li><a href=\"https://ibb.co/C9t0Q8F\">This was Michael Vassar</a>.</li></ul></li><li><i>Joseph says he also argued that it was normal for a 12-year-old girl to have sexual relationships with adult men and that such relationships were a noble way of transferring knowledge to a younger generation. Then, she says, he followed her home and insisted on staying over. She says he slept on the floor of her living room and that she felt unsafe until he left in the morning.</i><ul><li>This was also Michael Vassar.<ul><li><a href=\"https://twitter.com/techdominatrix/status/1593515557332348928\">This seems like a pattern for him</a>.</li></ul></li><li>I know this because of a line from the <a href=\"https://time.com/6252617/effective-altruism-sexual-harassment/\">TIME article</a>:<ul><li>\"Another woman, who dated the same man [the one who talked about pedophilia with Joseph] several years earlier in a polyamorous relationship, alleges that he had once attempted to put his penis in her mouth while she was sleeping.\"<ul><li>And \"the same man\" was, of course, <a href=\"https://ibb.co/Hr829j6\">Michael Vassar</a>.</li></ul></li></ul></li><li>Jax talks about other people in <a href=\"https://twitter.com/RuffleJax/status/1633123336514314240\">public threads</a>, but I think Vassar is the only one whose alleged behavior was illegal physical abuse rather than rudeness or weird vibes.</li></ul></li><li><i>On the extreme end, five women, some of whom spoke on condition of anonymity because they fear retribution, say men in the community committed sexual assault or misconduct against them [...] &nbsp;Women who reported sexual abuse, either to the police or community mediators, say they were branded as trouble and ostracized while the men were protected.</i><ul><li>At least one of these is Vassar (possibly multiple, given how consistent he seems to be).</li><li>Vassar has been banned from EA events for many years, and SlateStarCodex &nbsp;meetups for at least a few years.</li></ul></li><li><i>In 2018 two people accused Brent Dill, a rationalist who volunteered and worked for CFAR, of abusing them while they were in relationships with him.</i><ul><li>This happened, and CFAR's initial reaction was <a href=\"https://web.archive.org/web/20200106132144/https://deluks917.wordpress.com/2019/09/20/private-post/\">very bad</a>.</li><li>But the rest of the community, from what I remember, rallied in support of Brent's victims and drove him out. This seems like a healthy reaction to me, exactly what I'd hope for.<ul><li><a href=\"https://thingofthings.wordpress.com/2018/10/30/brent-dill-is-an-abuser/\">Response from the Thing of Things blog</a></li><li><a href=\"https://www.tumblr.com/theunitofcaring/178254267151/today-two-people-i-know-came-forward-about-abuse\">Response from Kelsey Piper</a></li></ul></li></ul></li><li><i>Rochelle Shen, a startup founder who used to run a rationalist-adjacent group house, heard the same justification from a woman in the community who mediated a sexual misconduct allegation.</i><ul><li>This is probably Aurora Quinn-Elmore, a mediator mentioned in the <a href=\"https://time.com/6252617/effective-altruism-sexual-harassment/\">TIME article</a>.</li><li>Aurora seems to be an independent person who does volunteer mediation for acquaintances. She is not employed by an org to do this. I am not surprised to see that volunteer mediators who mediate accusations against their romantic partners do a poor job of it. I'm not sure how much this says about any part of the EA or rationalist community outside Aurora's circle of acquaintances.</li></ul></li><li><i>[Angela Pang] says she was assaulted by someone in the community who at first acknowledged having done wrong but later denied it. That backpedaling left her feeling doubly violated. “Everyone believed me, but them believing it wasn’t enough,” she says. “You need people who care a lot about abuse.”</i><ul><li>As with Joseph's story, it's very unclear from this what actions anyone could or should have taken. Is this abuser still in the community? Are they employed or funded by anyone who knows about the allegations?</li></ul></li></ul>", "parentCommentId": null, "user": {"username": "fenneko"}}, {"_id": "oDN8pKjiqLDYeznkJ", "postedAt": "2023-03-08T04:10:04.378Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Re: the MIRI employees, it seems relevant that they're \"former\" rather than current employees, given that you'd expect there to be more former than current employees, and former employees presumably don't have MIRI as a major figure in their lives.</p>\n", "parentCommentId": "ysYE4rnBCC3xi4AKE", "user": {"username": "DanielFilan"}}, {"_id": "u5nkQrNxx9k9oEAjq", "postedAt": "2023-03-08T05:17:56.648Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Okay so you have noted 2 possible types of victims:</p>\n<ol>\n<li>People who reported and were met with community support (who you expect would feel comfortable using names)</li>\n<li>People who reported and were met with criticism  (who you expect would not use names)</li>\n</ol>\n<p>I just want to (respectfully) flag that there is a <em>possible</em> third and fourth group of victims (and likely more possibilities too tbh)</p>\n<ol start=\"3\">\n<li>\n<p>People who reported and were met with support, but who now want to continue to use a handled incident as proof of problems. These people would avoid using names to avoid claims of dishonestly controlling the narrative.</p>\n</li>\n<li>\n<p>People who never reported their incidents to the community at all, and therefore could not be met with either support or criticism. If I were in this third group of people who didn't report, I would also not use my name when talking to a journalist, to avoid upset about taking a complaint public before allowing the community to actually handle something they might absolutely have wanted to handle.</p>\n</li>\n</ol>\n<p>I'm not saying what's going on, like it definitely looks like at least one person from group 2 is present. But I just want  to note for readers that you also can't simplify the possibility sphere of name-redacted victims <em>in general</em> into only 1 group</p>\n", "parentCommentId": "k7hQwd84hDaurSCDE", "user": {"username": "Ivy_Mazzola"}}, {"_id": "gxwtiiotP3iMNq8Qu", "postedAt": "2023-03-08T07:01:06.667Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>&nbsp;I think journalists are often imprecise and I wouldn't read too much into the particular synonym of \"said\" that was chosen.</p>", "parentCommentId": "sNq6wmDyzE9S2i4Am", "user": {"username": "David Johnston"}}, {"_id": "zcYmtcuYTfQ8bxnTv", "postedAt": "2023-03-08T08:22:21.581Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>&nbsp;In my experience it is <strong>not condescending at all.</strong> They definitely<strong> do not consider people who work in other cause areas less smart </strong>or quantitative. They are passionate about their cause so these conversations come up, but the <strong>conversations are very respectful</strong> and display deep open-mindedness.</p></blockquote><p>Absolutely true that it was ultimately not used and AI safety is higher priority for leadership. &nbsp;But proposals like this, especially by organizers of CEA, are definitely condescending and non-respectful and is not an appropriate way to treat fellow EAs working on climate change / poverty / animal welfare or other important cause areas.</p><p>The recent fixation of certain EAs on AI/ longtermism renders everything else less valuable in comparison and treating EAs not working on AI safety as \"NPCs\" (people who don't ultimately matter) is completely unacceptable.</p>", "parentCommentId": "oghZ8Ztctc8RpG7tx", "user": {"username": "anoneaforumuser"}}, {"_id": "hAJnSmpDwxRHqBfJ5", "postedAt": "2023-03-08T11:23:35.266Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>was told by a friend that Michael Vassar is barred from Slate Star Codex meetups.&nbsp;</p></blockquote><p>He was banned, but still managed to slip through the cracks enough to be invited to an <a href=\"https://www.lesswrong.com/posts/iWWjq5BioRkjxxNKq/michael-vassar-at-the-slatestarcodex-online-meetup\">SSC online meetup</a> in 2020. &nbsp;(To be very clear, this was not organised or endorsed by Scott alexander, who <i>did</i> ban Vasser from his events).&nbsp;</p><p>You can read the &nbsp;mea culpa from the organiser <a href=\"https://www.lesswrong.com/posts/MnFqyPLqbiKL8nSR7/my-experience-at-and-around-miri-and-cfar-inspired-by-zoe?commentId=EcjEBtBRMBCsAZwmR#EcjEBtBRMBCsAZwmR\">here</a>. &nbsp;It really looks to me like Vasser has been treated with a <a href=\"https://en.wikipedia.org/wiki/Missing_stair\">missing stair</a> approach until very recently, where those in the know quietly disinvite him to things but others, even within the community, are unaware. &nbsp;Even in the comments <a href=\"https://www.lesswrong.com/posts/MnFqyPLqbiKL8nSR7/my-experience-at-and-around-miri-and-cfar-inspired-by-zoe\">here</a> where some very harsh allegations are made against him, people are still being urged not to \"ostracise\" him, which to me seems like an entirely appropriate action.&nbsp;</p>", "parentCommentId": "4b8sDpsn4AKuukojX", "user": {"username": "titotal"}}, {"_id": "qy9fx7J4dcC23Brwu", "postedAt": "2023-03-08T11:33:08.659Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>With the exception of Brent, who is fully ostracized afaik, I think you seriously understate how much support these abusers still have. My model is sadly that a decent number of important rationalists and EAs just dont care that much about the sort of behavior in the article. CFAR investigated Brent and stood by him until there was public outcry! I will repost what Anna Salomon wrote a year ago, long after his misdeeds were well known. Lots of people have been updating TOWARD Vassar:</p><blockquote><p>I hereby apologize for the role I played in X's ostracism from the community, which AFAICT was both unjust and harmful to both the community and X. There's more to say here, and I don't yet know how to say it well. But the shortest version is that in the years leading up to my original comment X was criticizing me and many in the rationality and EA communities intensely, and, despite our alleged desire to aspire to rationality, I and I think many others did not like having our political foundations criticized/eroded, nor did I and I think various others like having the story I told myself to keep stably “doing my work” criticized/eroded. This, despite the fact that attempting to share reasoning and disagreements is in fact a furthering of our alleged goals and our alleged culture. The specific voiced accusations about X were not “but he keeps criticizing us and hurting our feelings and/or our political support” — and nevertheless I’m sure this was part of what led to me making the comment I made above (though it was not my conscious reason), and I’m sure it led to some of the rest of the ostracism he experienced as well. This isn’t the whole of the story, but it ought to have been disclosed clearly in the same way that conflicts of interest ought to be disclosed clearly. And, separately but relatedly, it is my current view that it would be all things considered much better to have X around talking to people in these communities, though this will bring friction.</p><p>There’s broader context I don’t know how to discuss well, which I’ll at least discuss poorly:</p><p>Should the aspiring rationality community, or any community, attempt to protect its adult members from misleading reasoning, allegedly manipulative conversational tactics, etc., via cautioning them not to talk to some people? My view at the time of my original (Feb 2019) comment was “yes”. My current view is more or less “heck no!”; protecting people from allegedly manipulative tactics, or allegedly misleading arguments, is good — but it should be done via sharing additional info, not via discouraging people from encountering info/conversations. The reason is that more info tends to be broadly helpful (and this is a relatively fool-resistant heuristic even if implemented by people who are deluded in various ways), and trusting who can figure out who ought to restrict their info-intake how seems like a doomed endeavor (and does not degrade gracefully with deludedness/corruption in the leadership). (Watching the CDC on covid helped drive this home for me. Belatedly noticing how much something-like-doublethink I had in my original beliefs about X and related matters also helped drive this home for me.)</p><p>Should some organizations/people within the rationality and EA communities create simplified narratives that allow many people to pull in the same direction, to feel good about each others’ donations to the same organizations, etc.? My view at the time of my original (Feb 2019) comment was “yes”; my current view is “no — and especially not via implicit or explicit pressures to restrict information-flow.” Reasons for updates same as above.</p><p>It is nevertheless the case that X has had a tendency to e.g. yell rather more than I would like. For an aspiring rationality community’s general “who is worth ever talking to?” list, this ought to matter much less than the above. Insofar as a given person is trying to create contexts where people reliably don’t yell or something, they’ll want to do whatever they want to do; but insofar as we’re creating a community-wide include/exclude list (as in e.g. this comment on whether to let X speak at SSC meetups), it is my opinion that X ought to be on the “include” list.</p><p>Thoughts/comments welcome, and probably helpful for getting to shared accurate pictures about any of what's above.</p></blockquote>", "parentCommentId": "4b8sDpsn4AKuukojX", "user": {"username": "deluks917"}}, {"_id": "BP3jz3NN8AJjrhYGo", "postedAt": "2023-03-08T11:40:56.993Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote>\n<p>Her post was strongly downvoted, and she eventually removed it.</p>\n</blockquote>\n<p>This claim seems misleading at best</p>\n<ul>\n<li>\n<p><a href=\"https://web.archive.org/web/20221112235135/https://forum.effectivealtruism.org/posts/NacFjEJGoFFWRqsc8/women-and-effective-altruism\">12 Nov</a>: +24 post score</p>\n</li>\n<li>\n<p><a href=\"https://archive.ph/zdgRB\">14 Nov</a>: +61 post score</p>\n</li>\n</ul>\n<p>Edit: That's not to say I disagree with the central thrust of the article -- I find it plausible, and I wish the community health team was able to handle this problem more effectively.  I hope they are trying to figure out want went wrong in cases like Angela Pang's.</p>\n", "parentCommentId": null, "user": {"username": "Aptdell"}}, {"_id": "a9qLWwY8mheJ3prcw", "postedAt": "2023-03-08T11:48:22.634Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I find the comments there to be rather poorly reasoned. Kicking out two abusive people from your community does not mean there is no problem, especially when both cases were terribly handled. &nbsp;And just because a newspaper has a slant, it doesn't mean that allegations are not real.&nbsp;</p>", "parentCommentId": "54auSKkkbCqkdpPTk", "user": {"username": "titotal"}}, {"_id": "Sq72EgqipQExBaPNo", "postedAt": "2023-03-08T12:31:34.864Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote>\n<p>the heavily downvoted 'Women and Effective Altruism' post</p>\n</blockquote>\n<p>There's a classic male/female dilemma where <a href=\"https://www.psychologytoday.com/us/blog/skills-healthy-relationships/201606/stop-trying-fix-things-just-listen\">women mention problems, men attempt to solve them, but women feel unsatisfied because they are actually seeking emotional support</a>.</p>\n<p>I often feel like that's what's going on in these discussions.  E.g. if I was to mention that the post <a href=\"https://archive.ph/zdgRB\">was not exactly heavily downvoted</a>, from a problem-solving perspective, that makes sense because the first step for solving a problem is usually to understand it accurately.  From an emotional-support perspective, it <em>could</em> be helpful as a reminder that people are actually pretty concerned about these issues (and willing to upvote posts about them).  Or it could be taken as an \"attempt to defend the culture\".</p>\n<p>I think people in EA are often problem-solvers by nature.  From my perspective, working to understand and solve a problem is generally an expression that I care about something.  For whatever that's worth.</p>\n", "parentCommentId": "RhYmY738gvtWqWmRW", "user": {"username": "Aptdell"}}, {"_id": "ohmSqrhmSfFQemcTH", "postedAt": "2023-03-08T12:33:37.083Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I hope a fair read of the subtext of your comment is: <i>available evidence points towards &nbsp;community health concerns being dealt with properly, &nbsp;</i>and<i>: there's not much more the community could do</i>.<strong> I want to try to &nbsp;steelman an argument in response to this:</strong><br><br>I am not very well connected in \"hubs\" like London and the Bay area, but despite a lack of on the ground information, &nbsp;I have found examples of poor conduct that go largely unpunished.&nbsp;<br><br>Take the example of Kat Woods and Emerson Spartz. <a href=\"https://forum.effectivealtruism.org/posts/L4S2NCysoJxgCBuB6/announcing-nonlinear-emergency-funding?commentId=5P75dFuKLo894MQFf\">Allegations of toxic and abusive behaviour towards employees were made 4 months ago</a> (months after being reported to CEA). Despite Kat Woods <a href=\"https://forum.effectivealtruism.org/posts/L4S2NCysoJxgCBuB6/announcing-nonlinear-emergency-funding?commentId=pne7gpffwEbWvWeBu\">denying these concerns and attempting to dismiss and discredit those who attest to their abusive behaviour</a>, both Kat Woods and Emerson Spartz continue to: <a href=\"https://forum.effectivealtruism.org/users/katherinesavoie\">post in the EA-forum</a> and get largely upvotes ; employ EA's; &nbsp;be listed on the <a href=\"https://ea-internships.pory.app/orgs\">EA opportunity board</a>; and &nbsp;control $100,000s in funding. As far as I can tell, nonlinear incubated projects (which they largely control) also continue to be largely supported by the community.&nbsp;<br><br>&nbsp;I've accounted further evidence of similar levels of misconduct &nbsp;by different actors, largely continuing without impediment (I'm currently working on resolving these). And (if I understand correctly) <a href=\"https://forum.effectivealtruism.org/users/habryka?from=search_page\">Oliver Habryka</a>, who knows both rationalist and EA communities well, seems to be surprised by<a href=\"https://forum.effectivealtruism.org/posts/2y9eSkMAkdPQeXWMf/podcast-with-oli-habryka-on-lesswrong-lightcone\"> low levels of integrity in these communities </a>(though he's not attempting to benchmark off of larger society).&nbsp;<br><br>The argument would go: <strong>the reason cases in the article seem to be dealt with sufficiently, is that these are the only women who are willing to risk their reputation in rationalist/EA spaces by calling attention to bad actors</strong>. They were, after generating sufficient amounts of alarm, able to catalyse the problems to be fixed. However, they recognise in most cases this will not happen, and <strong>point to risk factors that make misconduct more likely </strong>(lack of social norms, polyamory ect.).&nbsp;</p>", "parentCommentId": "BYvgpTxBTCZJQqHCz", "user": {"username": "ElliotJDavies"}}, {"_id": "ZedzMmhYEoprFc3ca", "postedAt": "2023-03-08T13:17:51.447Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>For example, it seems like a long time since I've heard of <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology\">Jacy Reese</a> getting EA funding.</p></blockquote><p>Jacy's org received <a href=\"https://survivalandflourishing.fund/sff-2022-h1-recommendations#:~:text=Jaan%20Tallinn-,Sentience%20Institute,-%2450%2C000\">funding </a>from the SFF in 2022, if you consider that EA funding. More weakly, his organization is also advertised on the 80,000 hours job board. He also recently tried to <a href=\"https://web.archive.org/web/20230306201801/https://forum.effectivealtruism.org/posts/NJwqKSbnAgFHogaL2/key-questions-for-digital-minds#How_can_I_work_on_digital_minds__DM__research_:~:text=We%20have%C2%A0substantial%20room%20for%20more%20funding%3B%20we%20are%20eager%20to%20establish%20a%20network%20of%20DM%20research%20collaborators%20and%20advisors%20(get%20in%20touch)%3B%20and%20we%20are%20accepting%C2%A0researcher%20applications%20on%20a%20rolling%20basis!\">seek funding and recruit</a> on the forum (until he deleted his post, plausibly due to <a href=\"https://forum.effectivealtruism.org/posts/DzweXxBQctopjsnGy/pseudonym-s-shortform?commentId=pZzdqnRXTthwsQBW7\">pushback</a>), and thus still benefits from EA institutions and infrastructure even if that doesn't look like direct funding.</p>", "parentCommentId": "BYvgpTxBTCZJQqHCz", "user": {"username": "pseudonym"}}, {"_id": "JAADLw9wqgaEeZsZr", "postedAt": "2023-03-08T14:07:48.101Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>The article paints a disturbing picture of systematic abuse.</p>\n<p>Sections of your comment like</p>\n<blockquote>\n<p>I'm unconvinced that the actual sum of all these reported incidents points to anything particularly bad, aside from \"humans are gonna human\". I can think of many other communities that seem to be in much worse shape.</p>\n</blockquote>\n<p>come off as incredibly trivializing and is further evidence of the dismissive attitude toward these serious problems that the community prefers to downplay and ignore.</p>\n", "parentCommentId": "BYvgpTxBTCZJQqHCz", "user": {"username": "MorganLawless"}}, {"_id": "XupGjx5hfveHjcLTH", "postedAt": "2023-03-08T14:29:03.371Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I agree with the above comment but a minor correction (I think):</p><ul><li>I think Jacy is no longer involved with the org officially but unofficially he is very involved.&nbsp;</li></ul><p>I am unsure what ought to happen here, but agree the status quo is misleading.</p>", "parentCommentId": "ZedzMmhYEoprFc3ca", "user": {"username": "nathan"}}, {"_id": "hZRsBAwKf6CRpQdLJ", "postedAt": "2023-03-08T14:50:11.910Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Seems to me worth discussing needs a bit here. Like there seem to be different parties in this discusion. So what are their needs?</p><p>Accusers - I guess these people want to feel safe and secure and to think they will be taken seriously and that their need for personal safety won't be ignored again. Perhaps want to not to feel insulted, as some discussion of this might leave them feeling, even if they are no longer part of the community. They also seem to want to feel safe and so to have the names in the article to stay anonymous.</p><p>Those worried about these events - I guess these people desire to feel safe and secure in EA and confident that their friends will be safe and secure in EA. They want to be able to not think about this stuff very much. Perhaps it makes them anxious and disturbs their work.</p><p>Rationalists - Rationalists generally want or events to be discussed accurately and precisely. In particularly, a story that's generally accurate but gets key details wrong seems to upset them. They desire clarity on who has been kicked out of the community and when these events happened. In short, to be able to judge if the community performed well or badly here.</p><p>[Rough group] - I sense a group of people want the names of those who we are confident have done bad things to be named publicly so we can avoid having them at events in future.</p><p>Sex positive EAs - I sense these people want to feel comfortable that they aren't gonna be shamed for their behaviour. They like being part of this community which has been welcoming to them .</p><p>&nbsp;</p><p>Discussing needs isn't to say how we tradeoff these needs, but to acknowledge that different groups have different needs.</p><p><i>I find the frame of Non-Violent Communication</i> <i>pretty useful in mediating discussion between groups. I sense we can come up with good answers here.&nbsp;</i></p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "mr9qHexCKXoB5Takq", "postedAt": "2023-03-08T14:57:55.265Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>I have made no such comment about marginalized groups, so I'm not sure what the warning was for.&nbsp;</p></blockquote><p>I guess it was because your username is \"eugenics-adjacent\" though I guess that is sarcastic.</p>", "parentCommentId": "8hfoDgCRdaF2cgKtw", "user": {"username": "nathan"}}, {"_id": "7PzJxYuw8xXEiqczx", "postedAt": "2023-03-08T15:01:54.232Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Some of the behaviour described here happened solely in the rationalist community. This isn't a rationalist forum. While we can discuss it, we don't <i>need</i> to defend the rationalists (and I'd say I am one). They can look after themselves and there is a reason that EA and rationalism are separate. I think at times we want to take responsibility for everything, but some of this just didn't happen in EA community spaces.&nbsp;</p><p>Some of this behaviour is in EA spaces and that's different.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "zYnyQhxvHCHJpDxCd", "postedAt": "2023-03-08T15:06:13.838Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Forgive me for using an anonymous account, but I'm in the process of applying for SFF funding and I don't want to risk any uncomfortable consequences. However, I can't stay silent any longer – it's painfully obvious that the SFF has little regard for combating sexual harassment. The fact that Jacy was awarded funding is a blatant example, but what's more concerning is that Michael Vassar, a known EA antagonist, still appears to be involved with the SFF to this day.</p>", "parentCommentId": "ZedzMmhYEoprFc3ca", "user": {"username": "burneraccountman"}}, {"_id": "amSPCDThuhfkyjPRc", "postedAt": "2023-03-08T15:31:48.967Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Furthermore, if a community wants to command billions of dollars and exert major influence on one of the world's most important industries, it is both totally predictable and appropriate that society will scrutinize that community more rigorously and hold it to a higher standard than a group of \"NPCs\".</p>\n<p>edit: typo</p>\n", "parentCommentId": "JAADLw9wqgaEeZsZr", "user": {"username": "Jason"}}, {"_id": "cDwjCSn3eth9sfaAF", "postedAt": "2023-03-08T16:07:43.226Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Yes, my guess is that ParetoPrinciple was adorably kind in that they didn't realize that EugenicsAdjacent was actually just making an extremely rude dig at EAs. Frankly it is unacceptable to come onto a free forum made available &nbsp;for the benefit of all and maintained through the sweat off the brows of wellmeaning EAs, and use one of the features (username) to <s>shit on</s> insult and typecast this large, diverse, wellmeaning community in such an empistemically sneaky way (because usernames aren't even a topic of conversation, the dig was hard to address. <s><strong>It's basically</strong></s><strong> In my mind it is akin to anti-EA grafitti now being permanently hosted on the EA Forum</strong>). <s>Absolutely unconscionable and monstrously illmannered.</s> Again, I claim it is unthinkably rude, and I hope to set precedent that we should not stand for it. <s>Can't believe someone like that</s> I'm also aghast that someone likely doing that would presume to write as though they have the upper hand in judging civilized behavior, and I encourage them to think more carefully about their own behavior before trying to take the moral high ground.&nbsp;</p>", "parentCommentId": "mr9qHexCKXoB5Takq", "user": {"username": "Ivy_Mazzola"}}, {"_id": "ha8punfrz4YTFKma2", "postedAt": "2023-03-08T16:20:13.076Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>That's reasonable. But :</p><ol><li>Let's make sure we are addressing problems that still exist in the EA community (if you would like to discuss the rationality community you can join their <a href=\"https://www.lesswrong.com/posts/bFHKFoBmcAjiQYgau/?commentId=DuLFKJ25ixvitoM8d\">discussion on LW</a>)</li><li>If we decide problems do still exist, let's make sure we are attaching them to the right community, even microcosm of community, as both the EA and rationality community are huge and those not involved don't deserve to be punished for things they handled well or would have handled well</li><li>If issues remain, let's be fair in who we give the responsibility to handle those remaining issues, eg whatever bad actors remain and whatever issues still exist in whatever community microcosm.</li></ol>", "parentCommentId": "amSPCDThuhfkyjPRc", "user": {"username": "Ivy_Mazzola"}}, {"_id": "PCGFBAdeijp9JvihW", "postedAt": "2023-03-08T16:31:13.001Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I also think many commenters are missing a likely iceberg effect here. The base rate of survivors reporting sexual assault to any kind of authority or external watchdog is low. Thus, an assumption that the journalists at Time and Bloomberg identified all, most, or even a sizable fraction of survivors is not warranted on available information.</p>\n<p>We would expect the journalists to significantly underidentify potential cases because:</p>\n<ul>\n<li>\n<p>Some survivors choose to tell no one, only professional supporters like therapists, or only people they can trust to keep the info confidential. Journalists will almost never find these survivors even with tons of resources.</p>\n</li>\n<li>\n<p>Some survivors could probably be identified by a more extensive journalistic investigation, but journalism isn't a cash cow anymore. The news org has to balance the value of additional investigation that it internalized against the cost of a deeper investigation. (This also explains why news articles likely have a much higher percentage of publicly-known stories than the true percentage of all stories that are publicly known.)</p>\n</li>\n</ul>\n<p>There are also many reasons a survivor known to a journalist may decide not to agree to be a source, like:</p>\n<ul>\n<li>\n<p>Deciding it is best for their mental well-being not to reopen past trauma by being interviewed about it;</p>\n</li>\n<li>\n<p>Not wanting the story of what happened to them broadcast in public, even anonymously, and possibly dissected on this Forum among other places;</p>\n</li>\n<li>\n<p>Feeling that sharing their story would harm EA's object-level work, and deciding not to do so on that basis;</p>\n</li>\n<li>\n<p>Concern that their anonymity could be unmasked;</p>\n</li>\n<li>\n<p>Concern that the abuser could recognize them and retaliate, even if the general public can't;</p>\n</li>\n<li>\n<p>Other reasons.</p>\n</li>\n</ul>\n<p>Thus, my prediction of the actual scope of a problem vs. how many people have come forward is something vaguely like an S curve.</p>\n<p>An analogous inference from my field of work would be dealing with people caught drunk/drink driving. A very low percentage of episodes come to the authorities' attention. On the first arrest, it's plausible that the driver made a poor isolated choice and has only driven drunk once or a few times. On the second arrest, it's rather unlikely that the problem is isolated but it's plausible that it hasn't happened several dozens of times. On the third arrest . . . absent a reason to think the base rate of detection is way off for this person, there is an extremely high probability the person is drunk/drink driving an awful lot.</p>\n<p>So based on the number of stories journalists found in which survivors were willing to speak to the journalists, what is the true number of stories and perpetrators? I don't have a good estimate, in part because I don't know how many of the stories in the news articles involve the same perpetrators.</p>\n<p>I think good answers could be obtained by professional, independent, neutral researchers . . . but that won't be quick and won't be cheap. So someone would have to be willing to pay and pre-commit to publishing certain types of de-identified data.</p>\n", "parentCommentId": "ohmSqrhmSfFQemcTH", "user": {"username": "Jason"}}, {"_id": "ckxEMJhz8ECTSruPF", "postedAt": "2023-03-08T16:55:56.608Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>[EDIT: Okay I guess the current top comment is enough. FWIW I never meant to imply that the discussion already happening was not of good quality but just that I don't want to see people's time and energy wasted, nor do I want to see people's concern spiked for little reason. I still hope, if this not a job for forum mods, that the community health team chimes in much like they did <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=jKJ4kLq8e6RZtTe2P\">here on the crossposted Time piece </a>but yes perhaps this is not the job for mods and maybe I should weakly hold that it is not necesssary anyway]<br><br><s>Mods, can you please write a comment and pin it? A short one commenting that this post is more to do with the rationality community and they can </s><a href=\"https://www.lesswrong.com/posts/bFHKFoBmcAjiQYgau/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg\"><s>join the conversation on LW</s></a><s> [edit: if they know the rationality community enough that they have reason to engage with rationalist-gender discussion]? It seems that despite the title of this post, people are thinking that, by simple virtue of it being posted here on the EA Forum, means that the EA community has something to do with any of the claims the forum has not heard before (and the ones the forum has heard before have been handled). You could also link some comments that have been made here that summarize the discussion and address the concern well.</s><br><br><s>You might also note that \"pace of conversation\" on this forum post is not necessarily a relevant signal for how important this post should be to the EA community. I fear there might be a cascade where people are taking commenting as proof that this is a noteworthy case having to do with EA in ways we didn't already know, and that just isn't so. Let the rationalists take care of themselves, but also please ensure we EAs don't have to pay penance for things that have little if anything to do with us. The things in here that have to do with EA have already been addressed and so I think it would be &nbsp;helpful for new visitors &nbsp;if a short point to that effect is &nbsp;linked prominently, pinned at the top of discussion </s><a href=\"https://forum.effectivealtruism.org/users/lizka?mention=user\"><s>@Lizka</s></a><s>&nbsp;</s></p>", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "5bsyWyCfFgc3cE5LC", "postedAt": "2023-03-08T17:28:50.138Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>[Edit: If you want a visual analogy about discovery, but one that doesn't overweight any one perspective, might I suggest the parable of the blind men and the elephant? <a href=\"https://en.wikipedia.org/wiki/Blind_men_and_an_elephant\">https://en.wikipedia.org/wiki/Blind_men_and_an_elephant</a> ]</p>\n<p>First of all, its a bit patronizing that you imply that people who aren't updating and handwringing on the Bloomberg piece haven't considered iceberg effect and uncounted victims. Iceberg effect has been mentioned in discussion before many times, and to any of us who care about sexual misconduct it was already an obvious possibility.</p>\n<p>Second, the opinions of those of us who don't have problems with the EA community any worse than anywhere else (in fact some of us think it is better than other places!), also matter. Frankly I'm tired of current positive reports from women being downgraded and salacious reports (even if very old) being given all the publicity. So it's a bit of a tangent, but I'll say it here:  I'm a woman and I enjoy the EA community and support how gender-related experiences are handled when they are reported. [I've been all the way down my side of the iceberg and I have not experienced anything in EA that implies that things are worse here than other \"communities\". I say this not to discredit reports women do put forward, but to balance the narrative]</p>\n<p>Third, CEA is moving forward on getting data: <a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\">https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of</a></p>\n<p>Next, please people, try to keep in mind other hypotheses and stop jumping the gun about EA til that community wide data does come out. I never ever wanted to post this and perhaps be <em>mistakenly</em> seen as minimizing victim experiences but now that iceberg effect is being discussed, some of you need to read this piece as the other possible side of the coin (the opposite hypothesis) before you make conclusions about EA or <em>even</em> rationality. Read here: <a href=\"https://slatestarcodex.com/2015/09/16/cardiologists-and-chinese-robbers/\">https://slatestarcodex.com/2015/09/16/cardiologists-and-chinese-robbers/</a></p>\n<p>While we wait for better community-wide data over these coming months, please realize that these reports in the Bloomberg piece are (1) from years ago and (2) have to do much more with the rationality community than EA (<em>they are different! If you remember one line from this comment remember that!!</em>) and (3) just because they are new to you doesn't mean they are new to others of us here. Relatedly, you hearing about these reports right now doesn't mean EAs don't care and don't want to fix issues or aren't trying hard to make out the base of the iceberg 🧐, (4) the journalist did not do a good job of providing details that the community should care about like how these cases have already been handled, some over 5 years ago. (5) relatedly, please realize that it was not the journalist's goal here to help the EA community decide if it is safe or not. So don't read the piece like the journalist had you in mind and gave everything someone in your position with your goals to engage the EA community might need. You will have to decide safety for yourself, but realize you were not the Bloomberg journalist's intended audience. Their goal was to inform the non-rat public of things in rationalist history. You have to fill in the gaps for you, an EA, yourself, and be diligent in ways the journalist was not</p>\n<p>General heuristics about reality like \"iceberg effect\" are fine to mention but they are also conjecture. I hope they are not enough to fully sway anyone that the EA community has a problem right now today. Especially because,  again the Bloomberg piece is not even really about EA!</p>\n", "parentCommentId": "PCGFBAdeijp9JvihW", "user": {"username": "Ivy_Mazzola"}}, {"_id": "uuwGGEPaBh54WNKNQ", "postedAt": "2023-03-08T17:47:18.138Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>[Deleting the earlier part of my comment because it involved an anonymized allegation of misconduct I made, that upon reflection, I feel uncomfortable making public.]</p><p>I also want to state, in response to Ivy's comment, that I am a woman in EA who has been demoralized by my experience of casual sexism within it. I've not experience sexual harassment. But the way the Bloomberg piece describes the way EA/rats talk about women feels very familiar to me (as someone who interacts only with EAs and not rats). E.g., \"5 year old in a hot 20 year old's body\" or introducing a woman as \"ratbait.\"&nbsp;</p>", "parentCommentId": "ohmSqrhmSfFQemcTH", "user": {"username": "Masha Winchell"}}, {"_id": "kGohgf9SquooW3j6d", "postedAt": "2023-03-08T17:55:08.197Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote>\n<p>Take the example of Kat Woods and Emerson Spartz. Allegations of toxic and abusive behaviour towards employees were made 4 months ago (months after being reported to CEA). Despite Kat Woods denying these concerns and attempting to dismiss and discredit those who attest to their abusive behaviour, both Kat Woods and Emerson Spartz continue to: post in the EA-forum and get largely upvotes ; employ EA's;  be listed on the EA opportunity board; and  control $100,000s in funding. As far as I can tell, nonlinear incubated projects (which they largely control) also continue to be largely supported by the community.</p>\n</blockquote>\n<p>I know of multiple people who are currently investigating this. I expect appropriate consequences to be taken, though it's not super clear to me yet how to make that happen (like, there is no governing body that could currently force nonlinear to do anything, but I think there will be a lot of pressure if the accusations turn out correct).</p>\n<blockquote>\n<p>I've accounted further evidence of similar levels of misconduct  by different actors, largely continuing without impediment (I'm currently working on resolving these). And (if I understand correctly) Oliver Habryka, who knows both rationalist and EA communities well, seems to be surprised by low levels of integrity in these communities (though he's not attempting to benchmark off of larger society).</p>\n</blockquote>\n<p>Just to be clear, I am pretty happy with the levels of integrity in the core rationality community (though it's definitely also not perfect). The broader EA community has pretty big problems on this dimensions, but I also want to be clear that the EA community is still far above average for communities around the world here, it's just that reality doesn't grade on a curve and we tend to take much more ambitious and unconstrained actions in the world, so that failures of integrity and coordination can have much worse consequences. I do think people have historically been massively over-trusting both EA and Rationality and this has caused a lot of hurt, and I would like people to recalibrate to the high but not overwhelmingly high level of adequate trust.</p>\n", "parentCommentId": "ohmSqrhmSfFQemcTH", "user": {"username": "Habryka"}}, {"_id": "RNHdLZc4nQ3kpyg8q", "postedAt": "2023-03-08T17:59:37.722Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Just to be clear, $50k really isn't a lot of money and the SFF is not \"EA funding\" in the sense that many recommenders who participate in the process have little connection to the EA community and that any recommender can unilaterally make grants to organizations.</p>\n<p>I wouldn't update much on this. The SFF process funds a lot of stuff that is quite controversial, but this does not reflect nor convert into broad community support (and I personally think this is better than the decision that both the LTFF and Open Phil face where a grant is also seen as an endorsement of the org, which frequently muddles people just trying to think about marginal cost-effectiveness).</p>\n", "parentCommentId": "ZedzMmhYEoprFc3ca", "user": {"username": "Habryka"}}, {"_id": "xmjhmNyWAiM7t82Wt", "postedAt": "2023-03-08T18:01:24.884Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote>\n<p>but what's more concerning is that Michael Vassar, a known EA antagonist, still appears to be involved with the SFF to this day.</p>\n</blockquote>\n<p>Sorry, can you say more? I've been very closely involved with a lot of SFF operations in the last 3-4 years and I have never interfaced with Michael in that context.</p>\n<p>My guess is you just totally made this up or heard a rumor from someone that did since I can't think of an interpretation under which this is true (edit: I was indeed confused and you were referring to his work as a speculation grantor, which makes more sense. <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=rtfWJ6Gyeep2TGkYZ\">See here</a> for more followup)</p>\n<p>Also, for the record, I find talking to Michael pretty helpful from time to time and wouldn't judge someone else for doing that. I do think it's not a good idea currently to put him into positions of power for various reasons, and like him having some distance from the broader community, but he is pretty smart and I learned a lot from him and some of his surrounding friend group.</p>\n", "parentCommentId": "zYnyQhxvHCHJpDxCd", "user": {"username": "Habryka"}}, {"_id": "P3drAXNugLgmwi7Yf", "postedAt": "2023-03-08T18:23:09.904Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hey can I just check a thing? Do people really think that someone asking other people out [Edit: okay thinking this is all he did has problems, because it requires taking his apology at face value despite how serious CEA took the claims] means that they should never be allowed to return to impactful work and request (and receive) funding? So treat this comment as a poll</p>\n<p>Case details: (and agreevote directions below those)</p>\n<p>[EDIT: Apologies, I wrote this hastily and it might be that he never did as much as I first implied, but then others feel he might have done worse. I recommend you make your own conclusions about Jacy by (1) reading pseudonym's comment below this one and (2) visiting Jacy's apology yourself:\n<a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology\">https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology</a> ]</p>\n<p>The rest has been edited:]</p>\n<p>I don't know that much about the case but IIRC Jacy was apologizing for asking some women out on dates, clumsily. He did this online on FB messenger. I think before that apology he [was alleged to have done some inappropriate things] in the animal advocacy community somehow related to him, but had sworn to not do so again (a promise it looks like he probably kept). Anyway, he was apologizing for clumsy online flirting toward people who were not attached to the animal advocacy movement. There were no complaints from  people who had worked for or with him. Jacy's accusers stayed anonymous so he couldn't address the complaints well, but he did apologize and take ownership to the best of his abilities and state that he would take time away to reflect and would be more considerate in future. IIRC he was never (publicly or maybe not at all?) alleged to have done sexual assault or even something most would consider harassment (which legally has a demeaning or disprespectful element, although come to think of it repeated asking out might be harassment) but more clumsy (perhaps overbearing?) flirting that (fairly!) women wanted addressed. It was 3 years after his apology for this repeated behavior that he got funding. The actual behaviors (not the apology) themselves were 3 years or older as well (one was even 7 years before the apology, so 10 years before he got 2022 funding).</p>\n<p>So what do you guys think? Was 3 years long enough to mandate a period of reflection and pause of financial support? Answer via:</p>\n<p><em>agreevote my comment to signal that you think after 3 years (given what he did and that he has had no issue since) (1) that it was okay that he be given funding for a competitive grant application or (2) that it would be okay that he be otherwise employed in animal welfare with EA dollars</em></p>\n<p>Or:</p>\n<p><em>disagreevote my comment to signal that you think he should not get EA funding again, period, or that 3 years later was much too soon for what he did</em></p>\n<p>I'd be very interested if there is any woman who had one of those troubling incidents with Jacy who could chime in and say what she thinks about him getting funding 3 years after his apology.</p>\n<p><em>I acknowledge that perhaps this question is also related to how much funding overhang there is (like I'd not like to see promising young women passed over for funding in favor of him) but back in 2022 I think there was more funding. For now please agreevote this question as though it is just a question of whether he should get funding ever at all, in some world where there is plenty of funding to go around.</em></p>\n<p>[Edit: For posterity, I'll note that this poll was at -7 (5 votes) when I edited it. There is some margin of error I can figure out later based on that and how responses here change.]</p>\n", "parentCommentId": "ZedzMmhYEoprFc3ca", "user": {"username": "Ivy_Mazzola"}}, {"_id": "iCPLEs6SngrdKabCb", "postedAt": "2023-03-08T18:34:29.764Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>$50k really isn't a lot of money and the SFF is not \"EA funding\"</p></blockquote><p>What's an acceptable amount of money, and what's an unacceptable amount of money?</p><p>I didn't make a claim personally that SFF was EA funding, which is why I said \"if\", though I think many people would consider SFF a funder that was EA-aligned. They have an <a href=\"https://forum.effectivealtruism.org/topics/survival-and-flourishing\">EA forum page</a>, their description is \"Our goal is to bring financial support to organizations working to improve humanity’s long-term prospects for survival and flourishing.\" which sounds pretty EA, and they were included in a <a href=\"https://forum.effectivealtruism.org/posts/DqwxrdyQxcMQ8P2rD/list-of-ea-funding-opportunities\">List of EA funding opportunities</a>, with no pushback about their inclusion as a \"funder that is part of the EA community\" (OTOH, they are not included in the <a href=\"https://airtable.com/shrAhiA5DZqkgpwh1/tblXkLQ2WqPI8au1M\">airtable</a> by Effective Thesis)</p><blockquote><p>I personally think this is better than the decision that both the LTFF and Open Phil face where a grant is also seen as an endorsement of the org</p></blockquote><p>I don't really understand what you mean by a process that gives an organization $ that isn't seen as endorsement of the organization. Can you clarify what you mean here?</p>", "parentCommentId": "RNHdLZc4nQ3kpyg8q", "user": {"username": "pseudonym"}}, {"_id": "5ehuS3kLvx8fy25E4", "postedAt": "2023-03-08T18:37:16.862Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>He's currently listed on the website as &nbsp;co-founder, and he was the one who shared the post that included the call for funding and job application on the EA forum.&nbsp;<span><span class=\"mjpage\"><span class=\"mjx-chtml\"><span class=\"mjx-math\" aria-label=\"\"><span class=\"mjx-mrow\" aria-hidden=\"true\"></span></span><style>.mjx-chtml {display: inline-block; line-height: 0; text-indent: 0; text-align: left; text-transform: none; font-style: normal; font-weight: normal; font-size: 100%; font-size-adjust: none; letter-spacing: normal; word-wrap: normal; word-spacing: normal; white-space: nowrap; float: none; direction: ltr; max-width: none; max-height: none; min-width: 0; min-height: 0; border: 0; margin: 0; padding: 1px 0}\n.MJXc-display {display: block; text-align: center; margin: 1em 0; padding: 0}\n.mjx-chtml[tabindex]:focus, body :focus .mjx-chtml[tabindex] {display: inline-table}\n.mjx-full-width {text-align: center; display: table-cell!important; width: 10000em}\n.mjx-math {display: inline-block; border-collapse: separate; border-spacing: 0}\n.mjx-math * {display: inline-block; -webkit-box-sizing: content-box!important; -moz-box-sizing: content-box!important; box-sizing: content-box!important; text-align: left}\n.mjx-numerator {display: block; text-align: center}\n.mjx-denominator {display: block; text-align: center}\n.MJXc-stacked {height: 0; position: relative}\n.MJXc-stacked > * {position: absolute}\n.MJXc-bevelled > * {display: inline-block}\n.mjx-stack {display: inline-block}\n.mjx-op {display: block}\n.mjx-under {display: table-cell}\n.mjx-over {display: block}\n.mjx-over > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-under > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-stack > .mjx-sup {display: block}\n.mjx-stack > .mjx-sub {display: block}\n.mjx-prestack > .mjx-presup {display: block}\n.mjx-prestack > .mjx-presub {display: block}\n.mjx-delim-h > .mjx-char {display: inline-block}\n.mjx-surd {vertical-align: top}\n.mjx-surd + .mjx-box {display: inline-flex}\n.mjx-mphantom * {visibility: hidden}\n.mjx-merror {background-color: #FFFF88; color: #CC0000; border: 1px solid #CC0000; padding: 2px 3px; font-style: normal; font-size: 90%}\n.mjx-annotation-xml {line-height: normal}\n.mjx-menclose > svg {fill: none; stroke: currentColor; overflow: visible}\n.mjx-mtr {display: table-row}\n.mjx-mlabeledtr {display: table-row}\n.mjx-mtd {display: table-cell; text-align: center}\n.mjx-label {display: table-row}\n.mjx-box {display: inline-block}\n.mjx-block {display: block}\n.mjx-span {display: inline}\n.mjx-char {display: block; white-space: pre}\n.mjx-itable {display: inline-table; width: auto}\n.mjx-row {display: table-row}\n.mjx-cell {display: table-cell}\n.mjx-table {display: table; width: 100%}\n.mjx-line {display: block; height: 0}\n.mjx-strut {width: 0; padding-top: 1em}\n.mjx-vsize {width: 0}\n.MJXc-space1 {margin-left: .167em}\n.MJXc-space2 {margin-left: .222em}\n.MJXc-space3 {margin-left: .278em}\n.mjx-test.mjx-test-display {display: table!important}\n.mjx-test.mjx-test-inline {display: inline!important; margin-right: -1px}\n.mjx-test.mjx-test-default {display: block!important; clear: both}\n.mjx-ex-box {display: inline-block!important; position: absolute; overflow: hidden; min-height: 0; max-height: none; padding: 0; border: 0; margin: 0; width: 1px; height: 60ex}\n.mjx-test-inline .mjx-left-box {display: inline-block; width: 0; float: left}\n.mjx-test-inline .mjx-right-box {display: inline-block; width: 0; float: right}\n.mjx-test-display .mjx-right-box {display: table-cell!important; width: 10000em!important; min-width: 0; max-width: none; padding: 0; border: 0; margin: 0}\n.MJXc-TeX-unknown-R {font-family: monospace; font-style: normal; font-weight: normal}\n.MJXc-TeX-unknown-I {font-family: monospace; font-style: italic; font-weight: normal}\n.MJXc-TeX-unknown-B {font-family: monospace; font-style: normal; font-weight: bold}\n.MJXc-TeX-unknown-BI {font-family: monospace; font-style: italic; font-weight: bold}\n.MJXc-TeX-ams-R {font-family: MJXc-TeX-ams-R,MJXc-TeX-ams-Rw}\n.MJXc-TeX-cal-B {font-family: MJXc-TeX-cal-B,MJXc-TeX-cal-Bx,MJXc-TeX-cal-Bw}\n.MJXc-TeX-frak-R {font-family: MJXc-TeX-frak-R,MJXc-TeX-frak-Rw}\n.MJXc-TeX-frak-B {font-family: MJXc-TeX-frak-B,MJXc-TeX-frak-Bx,MJXc-TeX-frak-Bw}\n.MJXc-TeX-math-BI {font-family: MJXc-TeX-math-BI,MJXc-TeX-math-BIx,MJXc-TeX-math-BIw}\n.MJXc-TeX-sans-R {font-family: MJXc-TeX-sans-R,MJXc-TeX-sans-Rw}\n.MJXc-TeX-sans-B {font-family: MJXc-TeX-sans-B,MJXc-TeX-sans-Bx,MJXc-TeX-sans-Bw}\n.MJXc-TeX-sans-I {font-family: MJXc-TeX-sans-I,MJXc-TeX-sans-Ix,MJXc-TeX-sans-Iw}\n.MJXc-TeX-script-R {font-family: MJXc-TeX-script-R,MJXc-TeX-script-Rw}\n.MJXc-TeX-type-R {font-family: MJXc-TeX-type-R,MJXc-TeX-type-Rw}\n.MJXc-TeX-cal-R {font-family: MJXc-TeX-cal-R,MJXc-TeX-cal-Rw}\n.MJXc-TeX-main-B {font-family: MJXc-TeX-main-B,MJXc-TeX-main-Bx,MJXc-TeX-main-Bw}\n.MJXc-TeX-main-I {font-family: MJXc-TeX-main-I,MJXc-TeX-main-Ix,MJXc-TeX-main-Iw}\n.MJXc-TeX-main-R {font-family: MJXc-TeX-main-R,MJXc-TeX-main-Rw}\n.MJXc-TeX-math-I {font-family: MJXc-TeX-math-I,MJXc-TeX-math-Ix,MJXc-TeX-math-Iw}\n.MJXc-TeX-size1-R {font-family: MJXc-TeX-size1-R,MJXc-TeX-size1-Rw}\n.MJXc-TeX-size2-R {font-family: MJXc-TeX-size2-R,MJXc-TeX-size2-Rw}\n.MJXc-TeX-size3-R {font-family: MJXc-TeX-size3-R,MJXc-TeX-size3-Rw}\n.MJXc-TeX-size4-R {font-family: MJXc-TeX-size4-R,MJXc-TeX-size4-Rw}\n.MJXc-TeX-vec-R {font-family: MJXc-TeX-vec-R,MJXc-TeX-vec-Rw}\n.MJXc-TeX-vec-B {font-family: MJXc-TeX-vec-B,MJXc-TeX-vec-Bx,MJXc-TeX-vec-Bw}\n@font-face {font-family: MJXc-TeX-ams-R; src: local('MathJax_AMS'), local('MathJax_AMS-Regular')}\n@font-face {font-family: MJXc-TeX-ams-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_AMS-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_AMS-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_AMS-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-B; src: local('MathJax_Caligraphic Bold'), local('MathJax_Caligraphic-Bold')}\n@font-face {font-family: MJXc-TeX-cal-Bx; src: local('MathJax_Caligraphic'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-cal-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-R; src: local('MathJax_Fraktur'), local('MathJax_Fraktur-Regular')}\n@font-face {font-family: MJXc-TeX-frak-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-B; src: local('MathJax_Fraktur Bold'), local('MathJax_Fraktur-Bold')}\n@font-face {font-family: MJXc-TeX-frak-Bx; src: local('MathJax_Fraktur'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-frak-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-BI; src: local('MathJax_Math BoldItalic'), local('MathJax_Math-BoldItalic')}\n@font-face {font-family: MJXc-TeX-math-BIx; src: local('MathJax_Math'); font-weight: bold; font-style: italic}\n@font-face {font-family: MJXc-TeX-math-BIw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-BoldItalic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-BoldItalic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-BoldItalic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-R; src: local('MathJax_SansSerif'), local('MathJax_SansSerif-Regular')}\n@font-face {font-family: MJXc-TeX-sans-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-B; src: local('MathJax_SansSerif Bold'), local('MathJax_SansSerif-Bold')}\n@font-face {font-family: MJXc-TeX-sans-Bx; src: local('MathJax_SansSerif'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-sans-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-I; src: local('MathJax_SansSerif Italic'), local('MathJax_SansSerif-Italic')}\n@font-face {font-family: MJXc-TeX-sans-Ix; src: local('MathJax_SansSerif'); font-style: italic}\n@font-face {font-family: MJXc-TeX-sans-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-script-R; src: local('MathJax_Script'), local('MathJax_Script-Regular')}\n@font-face {font-family: MJXc-TeX-script-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Script-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Script-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Script-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-type-R; src: local('MathJax_Typewriter'), local('MathJax_Typewriter-Regular')}\n@font-face {font-family: MJXc-TeX-type-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Typewriter-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Typewriter-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Typewriter-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-R; src: local('MathJax_Caligraphic'), local('MathJax_Caligraphic-Regular')}\n@font-face {font-family: MJXc-TeX-cal-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-B; src: local('MathJax_Main Bold'), local('MathJax_Main-Bold')}\n@font-face {font-family: MJXc-TeX-main-Bx; src: local('MathJax_Main'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-main-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-I; src: local('MathJax_Main Italic'), local('MathJax_Main-Italic')}\n@font-face {font-family: MJXc-TeX-main-Ix; src: local('MathJax_Main'); font-style: italic}\n@font-face {font-family: MJXc-TeX-main-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-R; src: local('MathJax_Main'), local('MathJax_Main-Regular')}\n@font-face {font-family: MJXc-TeX-main-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-I; src: local('MathJax_Math Italic'), local('MathJax_Math-Italic')}\n@font-face {font-family: MJXc-TeX-math-Ix; src: local('MathJax_Math'); font-style: italic}\n@font-face {font-family: MJXc-TeX-math-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size1-R; src: local('MathJax_Size1'), local('MathJax_Size1-Regular')}\n@font-face {font-family: MJXc-TeX-size1-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size1-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size1-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size1-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size2-R; src: local('MathJax_Size2'), local('MathJax_Size2-Regular')}\n@font-face {font-family: MJXc-TeX-size2-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size2-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size2-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size2-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size3-R; src: local('MathJax_Size3'), local('MathJax_Size3-Regular')}\n@font-face {font-family: MJXc-TeX-size3-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size3-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size3-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size3-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size4-R; src: local('MathJax_Size4'), local('MathJax_Size4-Regular')}\n@font-face {font-family: MJXc-TeX-size4-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size4-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size4-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size4-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-R; src: local('MathJax_Vector'), local('MathJax_Vector-Regular')}\n@font-face {font-family: MJXc-TeX-vec-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-B; src: local('MathJax_Vector Bold'), local('MathJax_Vector-Bold')}\n@font-face {font-family: MJXc-TeX-vec-Bx; src: local('MathJax_Vector'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-vec-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Bold.otf') format('opentype')}\n</style></span></span></span><span><span class=\"mjpage\"><span class=\"mjx-chtml\"><span class=\"mjx-math\" aria-label=\"\"><span class=\"mjx-mrow\" aria-hidden=\"true\"></span></span></span></span></span>His bio says \"<a href=\"https://twitter.com/SentienceInst\">@SentienceInst </a>researching AI safety\".</p><p>What gives you the impression that he is no longer officially involved?</p>", "parentCommentId": "XupGjx5hfveHjcLTH", "user": {"username": "pseudonym"}}, {"_id": "xNAbJD9Jkz8bNpAip", "postedAt": "2023-03-08T18:57:23.976Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hi to reply to your last paragraph, I am sorry you have been on the recieving end of such comments. You say they are not \"sexual harassment\" but I want to help provide clarity and a path to resolution by suggesting that, depending on context, comments you have recieved may indeed be sexual harassment. Sorry I don't have US/CA law on hand to share but I'd guess it would be similar to the&nbsp;<a href=\"https://www.legislation.gov.uk/ukpga/2010/15/section/26/2010-10-01\"><u>UK law on harassment</u></a> (it's very short and worth reading!). I recommend readers pay close attention to sections 1.b. and section 4.&nbsp;Also, intention to harass is not a relevant factor usually<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefkhm4fn0ooio\"><sup><a href=\"#fnkhm4fn0ooio\">[1]</a></sup></span><br><br>While I recommend people try to keep in mind cultural differences as <a href=\"https://forum.effectivealtruism.org/posts/xvfS8RiKsth2cp9KS/soniaalbrecht-s-shortform?commentId=mkg9YtufgxHge669f\">discussed here</a> rather than always assuming bad intent (I've been on the receiving end of some ribbing from <i>actual</i> <i>friends</i> <i>of mine</i> for being \"hot\" in EA, which I dish back in different ways), it looks to me like you are already being very careful of what you report (as most women are). So I'd like to <strong>also</strong> encourage you and other women to look closely and consider whether comment you might receive might <i>actually be harassment, intended or even on technicality</i>. If the comment feels demeaning including assuming too much familiarity, please look twice. Either way, &nbsp;whether you feel reasonably sure it is classed as harassment or not, if you are bothered by a comment, please bring it up. Please have a conversation with the person <i>or</i> report (perhaps even to a mutual friend of you and the speaker) if you don't want to have the conversation yourself. I hope we can quell problems as a community, but to do that these things must be named at the time or else people doing troubling things keep doing them.&nbsp;<br><br>I understand it can be hard or feel overreactive to address comments like that. It isn't black and white and it's hard to see where they &nbsp;fall and you might not want to get people in trouble. But legal systems (for example like that law I posted) can provide us good precedent for how and why to address such comments anyway, and what aspects we should focus on, namely your feelings about the matter. If comments bother you I really encourage you to bring them up somehow (to the person <i>or others you trust to handle it</i>), and I hope this comment gives you the cultural context and social sanctioning to do so.<br><br>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnkhm4fn0ooio\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefkhm4fn0ooio\">^</a></strong></sup></span><div class=\"footnote-content\"><p>It is important to note when using the term harassment, that <i>intention to harrass</i> is not a deciding factor, <i><strong>legally</strong></i>. &nbsp;(other aspects of context may be though) But of course intention to harrass, or lack thereof, &nbsp;will likely make a difference in how much you are willing to discuss with the person themselves vs opting to report to someone else for them to handle, so I acknowledge that intention to harass is still good for us to keep in mind</p></div></li></ol>", "parentCommentId": "uuwGGEPaBh54WNKNQ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "M8QxKxWpWARQiffPg", "postedAt": "2023-03-08T19:05:37.003Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Props for saying what is kind of a hard thing to say here. I agree there are people I listen to who I would not want in the community.&nbsp;</p>", "parentCommentId": "xmjhmNyWAiM7t82Wt", "user": {"username": "nathan"}}, {"_id": "myBJwQGdZjYxTERFg", "postedAt": "2023-03-08T19:05:57.966Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Oh yeah I'm wrong.</p>", "parentCommentId": "5ehuS3kLvx8fy25E4", "user": {"username": "nathan"}}, {"_id": "23ceNK9koDhfEWRNs", "postedAt": "2023-03-08T19:11:45.412Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>Also, for the record, I find talking to Michael pretty helpful from time to time and wouldn't judge someone else for doing that. I do think it's not a good idea currently to put him into positions of power for various reasons, and like him having some distance from the broader community, but he is pretty smart and I learned a lot from him and some of his surrounding friend group.</p></blockquote><p><br>Are you aware of the various allegations about his behavior? Is there a level of harm that you think merits rejecting someone entirely, rather than just from the broader community?&nbsp;</p>", "parentCommentId": "xmjhmNyWAiM7t82Wt", "user": {"username": "titotal"}}, {"_id": "bpJSMwQCXtuBvykFJ", "postedAt": "2023-03-08T19:11:46.327Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I may chime back about the object level question around the case soon, but I do want to flag in the interim that this <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology?commentId=te2HDPqKXGfRzGSRa\">comment</a> that suggests \"Jacy had asked some women out on dates\" is likely to be a misleading interpretation of the actual events. See also this <a href=\"https://forum.effectivealtruism.org/posts/WebLP36BYDbMAKoa5/the-future-might-not-be-so-great?commentId=9pnWvAbjF4DfAxpYZ#comments\">thread</a>, and this <a href=\"https://forum.effectivealtruism.org/posts/DzweXxBQctopjsnGy/pseudonym-s-shortform?commentId=pZzdqnRXTthwsQBW7\">comment</a>.</p><p>My view is that whether someone receives funding depends on the kind of work they are doing, as well as the level of risk they present to the community. On replaceability - he is pivoting to AI safety work. Would you say his difficult-to-replace nature in the animal space, to whatever extent this is true, translates to his AI safety work? His latest post was about establishing \"a network of DM research collaborators and advisors\". Is he difficult to replace in this context also?</p><p>I think it's fine for him to independently do research, but whether he should be associated with the EA community, receive EA funding for his work, or be in a position where he can be exposed to more victims (recruiting researchers) is less clear to me and depends on the details of what happened.</p><p>There has been no additional communication from CEA or Jacy acknowledging what actually happened, or why we can trust that Jacy has taken accountability for his actions, and is no longer a risk to members of this community, apart from the passage of time. Until then, I will point out the tension here that Jacy is someone who is barred from CEA events, but encouraged by 80,000 hours as a place to work at and is able to recruit from EAs without EAs having this knowledge, and will continue to raise this as a consideration so people can make better-informed decisions about potential risks in associating or working with Jacy.</p><p>Because of this lack of clarity, and because his organization's current plan does seem to involve exposure to new potential victims, I've disagree-voted. But I don't have a way of disagree-voting as 1 vote (it automatically gives 2), so take that into consideration also.</p><p>&nbsp;</p><blockquote><p>It was 2 years after his apology for this repeated troubling behavior that he got funding.</p></blockquote><p>I will note that if you know about events that have happened 2 years prior to the SFF funding in 2022, this suggests there were incidents in 2020, which is after CEA's ban in 2019. If this is what you mean, this should update you negatively about whether Jacy has taken sufficient steps to make positive changes in this regard.</p>", "parentCommentId": "P3drAXNugLgmwi7Yf", "user": {"username": "pseudonym"}}, {"_id": "CuCZ7Y9qabEcPz2LH", "postedAt": "2023-03-08T19:59:23.748Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Yes, as I shared below, I intended my statement to be anecdotal evidence that leaves a lot of room for other perspectives.</p><p>Although the only NPCs quote I noticed was referring to something else. Can you share the NPCs quote that referred to what we are discussing?</p>", "parentCommentId": "zcYmtcuYTfQ8bxnTv", "user": {"username": "SoniaAlbrecht"}}, {"_id": "mT5fDKFZpnYnvt2jn", "postedAt": "2023-03-08T20:33:45.006Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Neither Scotts banning of Vassar nor the REACH banning was quiet. It's just that there's no process by which those people who organize Slate Star Codex meetups are made aware.&nbsp;</p><p>It turns out that plenty of people who organize Slate Star Codex meetups are not in touch with Bay Area community drama. &nbsp;The person who organized that SSC online meetup was from Israel.&nbsp;</p><blockquote><p>Even in the comments here where some very harsh allegations are made against him</p></blockquote><p>That's because some of the harsh allegations don't seem to hold up. Scott Alexander spent a significant amount of time investigating and came <a href=\"https://www.lesswrong.com/posts/pQGFeKvjydztpgnsY/occupational-infohazards?commentId=8Sbx5xnGWHddaqb5e\">up </a>with:</p><blockquote><p>While I disagree with Jessica's interpretations of a lot of things, I generally agree with her facts (about the Vassar stuff which I have been researching; I know nothing about the climate at MIRI). I think this post gives most of the relevant information mine would give. I agree with (my model of) Jessica that proximity to Michael's ideas (and psychedelics) was not the single unique cause of her problems but may have contributed.</p></blockquote>", "parentCommentId": "hAJnSmpDwxRHqBfJ5", "user": {"username": "ChristianKleineidam"}}, {"_id": "D5yX7K5XnDaPQ2Dww", "postedAt": "2023-03-08T20:39:57.376Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Sorry I should have written 3 years. I think I was rounding down due to lack of clarity on months but clarifying months makes it look like it should have been 3 years or even slightly over 3 years. Sorry about that</p>", "parentCommentId": "bpJSMwQCXtuBvykFJ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "GmRLhbsyLhCMkGE5L", "postedAt": "2023-03-08T20:40:22.167Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Good points about AI, I just deleted the animal section</p>", "parentCommentId": "bpJSMwQCXtuBvykFJ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "PPnqTvG57frvk5rkt", "postedAt": "2023-03-08T21:24:59.231Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>What do you mean by rejecting someone entirely, and why does it entail not talking to them when you'd find this helpful?\nIs this about</p>\n<ul>\n<li>punishment through the psychological effects of social isolation?</li>\n<li>punishment through some other effect of social isolation?</li>\n<li>concern about being manipulated?</li>\n<li>a \"good guy\" talking to a \"bad guy\" may be helpful, but a \"bad guy\" talking to another \"bad guy\" lets them coordinate to do bad things, therefore we apply social pressure to prevent anyone from talking to someone we've identified as a \"bad guy\"?</li>\n<li>some other consideration / model I'm missing?</li>\n</ul>\n", "parentCommentId": "23ceNK9koDhfEWRNs", "user": {"username": "orellanin"}}, {"_id": "3qkYwc46SRysk7n7z", "postedAt": "2023-03-08T22:08:53.497Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I agree with the sentiment here.</p>", "parentCommentId": "ckxEMJhz8ECTSruPF", "user": {"username": "Lumpyproletariat"}}, {"_id": "FCcEMhiwtkmr7wS84", "postedAt": "2023-03-08T23:16:22.427Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hi Habryka,</p><p>I found this comment disappointing to read.</p><p><a href=\"https://web.archive.org/web/20230203024435/https://survivalandflourishing.fund/speculation-grants\">https://web.archive.org/web/20230203024435/https://survivalandflourishing.fund/speculation-grants</a><br><br>I don't know Michael, nor how SFF works, but a &lt;1minute google search suggests that Michael Vassar was serving as a grantor as of Feb 2022. His name has since been removed, but it is unclear whether this is because he is no longer involved, or because he has rescinded consent to have his name listed, or because SFF no longer wish to list his name. It is reasonable to think that Michael Vassar may still be involved with SFF if you take either of the latter two interpretations.&nbsp;</p><blockquote><p>My guess is you just totally made this up or heard a rumor from someone that did since I can't think of an interpretation under which this is true.</p></blockquote><p>This came across unnecessarily defensive to me, and I'm surprised that you missed this interpretation for someone \"very closely involved with basically all SFF operations in the last 3-4 years\", given how easy this information was to find.</p><p>Additionally, did you know that Michael was involved in 2022, or had his name listed on the website? If you knew he was involved in 2022, but made the claim that you \"can't think of an interpretation that this is true\" because he's no longer involved in 2023, and accused burneraccountman of just totally making this up just because of that, this feels highly uncharitable to me (I would have expected you to clarify that you knew he was involved last year but this is no longer the case). If you did not know, then I suspect this is may be an update to how much you think you knew about \"basically all SFF operations\", and how well calibrated you are about confident claims going forward.</p>", "parentCommentId": "xmjhmNyWAiM7t82Wt", "user": {"username": "pseudonym"}}, {"_id": "eLjkdJnfNJadwqhaJ", "postedAt": "2023-03-08T23:43:49.682Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Yes! I was someone who upvoted the comments pointing out the problems with the article, because I think understanding the details of the problem is essential for solving it. However, I definitely don’t want any known or unknown victims to get the impression we are dismissing their experiences. Any sexual misconduct is far too much, and truly terrible things have happened.</p>\n", "parentCommentId": "hZRsBAwKf6CRpQdLJ", "user": {"username": "SoniaAlbrecht"}}, {"_id": "rtfWJ6Gyeep2TGkYZ", "postedAt": "2023-03-08T23:50:01.460Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Oops, yep, sorry, I fucked up.&nbsp;</p><p>There is a largish number of people who are involved as speculation grantors who have a pretty small unilateral budget to make grants with, and I had in my mind totally not cached them as \"being involved in SFF\" (and do also think that's a kind of inaccurate summary, though one that I think is reasonable to have from the outside).</p><p>I agree that I should have remembered the speculation grant program, and am sorry for the blunt response.</p><p>I do think giving Michael a small speculation grant budget ($200k initially) seems reasonable, and the speculation grant program includes a lot of people including a lot of people who I wouldn't think of as being involved in the EA community at all. I was definitely interpreting the above as \"had served as a recommender\" or \"has been institutionally involved with SFF\", which I was confident was wrong, but missed important interpretations of the original comment, which totally was a miscommunication that's on me, especially given my confident response.</p><p>I also have access to an internal spreadsheet of speculation grantors and Michael is not listed on that, which does make me more sympathetic to my misunderstanding since I have looked at this spreadsheet a bunch more recently, and so was quite confident that he wasn't listed on that one. My current best model is that he is no longer a speculation grantor (maybe because his budget went to zero), though I find him being listed on the website but not on the internal spreadsheet confusing enough that I might be missing something.</p>", "parentCommentId": "FCcEMhiwtkmr7wS84", "user": {"username": "Habryka"}}, {"_id": "PJzJJCPyTteputC6z", "postedAt": "2023-03-09T00:02:24.913Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>Is there a level of harm that you think merits rejecting someone entirely, rather than just from the broader community?&nbsp;</p></blockquote><p>Feels quite extreme to me. Like, I would still be interested in talking to SBF for example, even though I think he deserves to spend the rest of his life in prison, since he also seems clearly extremely smart and might totally see things that I fail to see. I think Sam is the kind of person I am probably most hesitant to engage with though, since he is very charismatic and I would be slightly worried about my own sanity when engaging with him, though I can still definitely imagine situations where I would talk to him.&nbsp;</p><p>In-general I am not a huge fan of total punishment. I think even very bad people deserve to have some basic support and friends, as long as we actually really take seriously the obligation to limit the harm they can cause other people (I am also not categorically opposed to retribution as a component of a justice system, I just think isolation is a particularly bad dimension of punishment for various reasons).</p><p>For Michael, I think in my mind he has crossed many lines that make me really not want him to be part of the EA or Rationality community, and currently feel quite strongly about that.&nbsp;</p>", "parentCommentId": "23ceNK9koDhfEWRNs", "user": {"username": "Habryka"}}, {"_id": "zongD4MbKHuRGvyNd", "postedAt": "2023-03-09T00:02:58.996Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>No worries, thanks for the response.</p><blockquote><p>though I find him being listed on the website but not on the internal spreadsheet confusing enough that I might be missing something.</p></blockquote><p>He is no longer on the website, which might explain the discrepancy, unless you meant he wasn't on the internal spreadsheet even back in Feb 2022 or earlier?</p>", "parentCommentId": "rtfWJ6Gyeep2TGkYZ", "user": {"username": "pseudonym"}}, {"_id": "6hz68yiEfj7DrqvXR", "postedAt": "2023-03-09T00:04:36.792Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Ooh, that's a webarchive link, I somehow completely missed that. Cool, yeah, looks like he was removed around the same time from the spreadsheet and from the public list, so I am now quite confident that he is no longer involved as a speculation grantor.</p>", "parentCommentId": "zongD4MbKHuRGvyNd", "user": {"username": "Habryka"}}, {"_id": "CasZu7wcr5MmMfR9K", "postedAt": "2023-03-09T00:56:22.095Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I'm actually confused about why this got so many downvotes, as I didn't think I was saying anything controversial. Can someone explain?</p>", "parentCommentId": "eLjkdJnfNJadwqhaJ", "user": {"username": "SoniaAlbrecht"}}, {"_id": "oZpjNEEwGfpwyyiAv", "postedAt": "2023-03-09T02:02:18.729Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>This comment is gold. I believe there is an iceberg effect here-- EA cannot measure the number of times an accuser attempted to say something but got shut down or retaliated against by the community.</p><p>Personally, I would like to see discussion shift toward how to create a safe environment for all genders, and how to respond to accusers appropriately.</p><p>One book that I recommend is <a href=\"https://www.amazon.ca/Citadels-Pride-Sexual-Accountability-Reconciliation/dp/1324004118\"><i>Citadels of Pride</i></a>, which goes into institutional abuse in Hollywood and the arts scene. The patterns are similar: lack of clear boundaries between work/life, men in positions of power commanding capital, high costs to say anything, lack of feedback mechanisms in reporting. I am thankful that CEA is upping its efforts here; however, I also see that the amorphous nature (especially in the Bay Area) of these subcultures makes things difficult. It seems that most of the toxicity comes from the rationalist community, where there are virtually no mechanisms of feedback.</p><p>I am in touch with some of the women in the article, and they tell me that they feel safe speaking up now that they're no longer associated with these circles and have built separate networks. However, I agree that EA is very heterogeneous and diffuse, so it's important to understand which subnetworks they're talking about. Unfortunately, that trades off between identifiability, and these women may not want to be identified due to having tried to speak up before, then being shut down in a traumatizing manner.</p><p>There is an extremely high cost in <i>some</i> of these subnetworks to naming an accuser. These subnetworks are usually male-dominated, and view any form of speaking up as malicious \"cancellation.\"&nbsp;</p><p>This is also why I find the LW response to be inappropriate. While many of these claims are \"old news\" to those communities, many of these claims are fresh, and the LW community responded with a high level of dismissal. There was some poor reasoning about \"baseline rates\" (i.e. the people in this article are power law anomalies), but this reasoning is flawed because a) sexual assault remains the most underreported crime, so there is likely instead an iceberg effect, and b) women who were harassed/assaulted have left the movement which changes your distribution, and c) women who would enter your movement otherwise now stay away due to whisper networks and bad vibes.</p><p>Finally, I want to note that there is a distinction between EA/LW as official \"movements,\" and the ideology. Most of these comments focus on the movement (e.g. governance structures, mechanisms of feedback). That's great to scrutinize, but we also need to examine the ideology given that it comingles with Bay Area ideology, rationalists, etc.&nbsp;</p><p>Personally, when I was a teenager in EA (I am a woman), I found that there was little discussion about boundaries, emotional intelligence, healthy relationships, non-abusive dynamics, listening to your gut, and etc. I think a lack of focus on these areas makes can make subnetworks in these communities systemically unequipped to deal with these issues.</p>", "parentCommentId": "k7hQwd84hDaurSCDE", "user": {"username": "whistleblower67"}}, {"_id": "yocSmGKLnh75B7j3b", "postedAt": "2023-03-09T02:07:39.014Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Michael Vassar is still active in the EA community as a grant giver at SFF. &nbsp;He recently initiated a grant to the new president of AOI after the death of the founder Peter Eckersley, which casts a bad mark on his successor.&nbsp;</p><p>Peter Eckersley had a strong moral compass and stayed far away from Vassar. The new president, Deger Turan, was either clueless or careless when he sold out Peter's legacy.&nbsp;</p>", "parentCommentId": "BYvgpTxBTCZJQqHCz", "user": {"username": "Arbo"}}, {"_id": "pasvQpCvNDQz85Su6", "postedAt": "2023-03-09T02:12:22.075Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>It's alarming how Vassar uses his grant-making powers to build alliances in the EA community. He initiated a grant to Peter Eckersley's organization AOI after Peter's death. Peter was strongly against Vassar. Vassar seemed pleased that Peter's successor Deger Turan doesn't have the same moral compass.</p>", "parentCommentId": "zYnyQhxvHCHJpDxCd", "user": {"username": "Arbo"}}, {"_id": "28fSqpiWGyJf5gm8o", "postedAt": "2023-03-09T03:08:37.961Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Makes sense, thanks again. One small nitpick on re-reading your last message:</p><blockquote><p>I do think giving Michael a small speculation grant budget ($200k initially) seems reasonable, and the speculation grant program includes a lot of people and I think includes a lot of people who I wouldn't think of as being involved in the EA community at all.</p></blockquote><p>&nbsp;I think I'd appreciate some clarification around your thought process around what kind of monetary value is acceptable for Michael (similar question for Jacy <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=iCPLEs6SngrdKabCb#comments\">here</a>).<br><br>I guess I get the sense that letting Michael act as a grantor is bad e.g. because of the signaling effects that SFF is willing to overlook someone's history of sexual harassment/assault etc, and not because the money will necessarily be poorly spent. Whereas you think 50k to Jacy is reasonable and 200k to Michael as a grantor is reasonable because it's sufficiently small that this effect doesn't matter? I basically don't follow, and I'd be interested in hearing more about your reasoning, if you're happy to clarify!</p>", "parentCommentId": "6hz68yiEfj7DrqvXR", "user": {"username": "pseudonym"}}, {"_id": "hwjTD5uRAbYrad3Nh", "postedAt": "2023-03-09T15:17:45.865Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>It's just that there's no process by which those people who organize Slate Star Codex meetups are made aware.&nbsp;</p></blockquote><p>This definitely indicates a mishandling of the situation, that leaves room for improvement. In a better world, somebody would have spotted the talk before it went ahead. As it is now, it made it (falsely) look like he was endorsed by SSC, which I hope we can agree is not something we want. &nbsp;We already know he's been using his connection with Yud (via HPMOR) to try and seduce people.&nbsp;</p><p>With regards to the latter, if someone was triggering psychotic breaks in my community, I would feel no shame in kicking them out, even if it was unintentional. There is no democratic right to participate in one particular subculture. Ostracism is an appropriate response for far less than this.&nbsp;</p><p>I'm particularly concerned with the Anna Salamon statement that sapphire posted above, where she <i>apologises to him</i> for the ostracisation, and says she recommends inviting him to future SSC meetups. This is going in the exact wrong direction, and seems like an indicator that the rationalists are poorly handling abuse.&nbsp;</p>", "parentCommentId": "mT5fDKFZpnYnvt2jn", "user": {"username": "titotal"}}, {"_id": "fdv86KTSBrvJb9ZoN", "postedAt": "2023-03-09T16:13:28.215Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I’m also curious about the thinking on this. By having Michael act as a grantor, SFF isn’t just overlooking his history of sexual misconduct. It is also potentially enabling further misconduct, since it is giving him power and he has a track record of abusing power. &nbsp;</p>", "parentCommentId": "28fSqpiWGyJf5gm8o", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "joYhg5RqvqrajnLhE", "postedAt": "2023-03-09T17:07:43.992Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>This definitely indicates a mishandling of the situation, that leaves room for improvement.</p></blockquote><p>I agree with that and do think that having a better system to share information would be good.&nbsp;</p><blockquote><p>With regards to the latter, if someone was triggering psychotic breaks in my community, I would feel no shame in kicking them out, even if it was unintentional.&nbsp;</p></blockquote><p>If Vassar tells someone about how the organization for which they are working is corrupt and the person Vassar is talking with considers his arguments persuasive, that's going to be bad for their mental health.&nbsp;</p><p>Anna Salamon wrote that post because she believes that some arguments made about how CFAR was corrupt were reasonable arguments.&nbsp;</p><p>To the extent that the rationalist ideal makes sense, it includes not ostracising people for speaking out uncomfortable truths even if those uncomfortable truths are bad for the mental health of some people.&nbsp;</p><blockquote><p>&nbsp;We already know he's been using his connection with Yud (via HPMOR) to try and seduce people.&nbsp;</p></blockquote><p>The seduction here is \"Look, I'm bad in a way that I served as a template for the evil villain\".&nbsp;</p><p>While \"X is a bad boy\" can be attractive to some women, it should be a very clear sign that he's poor relationship material. It also shouldn't be surprising for anyone when he's actually a bad boy in that relationship.&nbsp;</p><p>A woman who wants a relationship with a bad boy can find that and it feels a bit paternalistic to say that a woman who wants that shouldn't get any opportunity to get that.&nbsp;</p><p>I do think there are good reasons not to have him at meetups but it's a complex decision.&nbsp;</p>", "parentCommentId": "hwjTD5uRAbYrad3Nh", "user": {"username": "ChristianKleineidam"}}, {"_id": "KEvuhP3LoBdjn5Zzh", "postedAt": "2023-03-09T17:53:58.011Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p><strong>A few notes: (</strong><i><strong>epistemic status: thinking out loud</strong></i><strong>)</strong></p><p><strong>Replaceability of his Digital Minds entrepreneurship: </strong>I'll note that I think it is always hard to replace someone who will act as founder of something. Getting something off the ground (going from zero to one) is something very few people are willing, interested, or think of to do. <i>Good </i>entrepreneurs are a scarce breed, or, at least they are when you want more projects and have a funding overhang (we still do for stuff like this). And whenever you narrow it down to any domain, they become even scarcer, and I think if you narrow it down in to a domain that is new (like digital minds research), they become even scarcer than that.<br><br>If there were job listings for founders for ideas which are already exciting to funders, the zero to one problem could be easier solved eg \"Funding has been secured for forming a network of digital mind research collaborators and advisors. Seeking suitable founder, apply here.\" Maybe Jacy and a dozen other people would apply and then we would know just how replaceable he is. But there are not and no one is doing this (this requires its own entrepreneur). Also there are certain implications of this I'd find very disrespectful to the people who had the key idea in the first place.. it's a bit dehumanizing like everyone is just a cog in the machine.&nbsp;</p><blockquote><p>My view is that whether someone receives funding depends on the kind of work they are doing, as well as the level of risk they present to the community.</p></blockquote><p>I think I'll note that usually grantmakers are going to measure this. And maybe we should trust them to, idk, if they are EA anyway, at least until further details are given. Like I think it's fine to ask for details but not fine to assume that the grantmakers made an egregious or community-harming decision (Now I think I <a href=\"https://forum.effectivealtruism.org/posts/zuqpqqFoue5LyutTv/the-ea-community-does-not-own-its-donors-money\">have to obligate drop this thing</a> although it's a tangent and I realize it complicates things and goes against my above poll intent).&nbsp;<br><br><strong>We still don't know enough: </strong>I agree this is weird. If I were him, given the intense community backlash, I'd have next done a detailed writeup of everything I'd done with clarification of every relevant detail and what was going on in my mind at the time, then said I'd step back and would be receiving voluntary therapy, treatment, and/or social skills coaching until further notice, depending on what the writeup indicated. But expecting a pre-Gen-Z man to even think of doing this is like, a big ask. No insult to such men but society does not exactly set most of us up to think of that kind of solution, let alone pre-zoomer men. Also I think expecting a lot of details when the complainants remained anonymous might be an impossible ask (thought I think he could probably give more). I also wonder if having a norm where people are forced to bare open every embarrassing incident is good for EA morale... If they are akin to embarrassing incidents it would be better if he showed full details to the Community Health Team and they did a summary for potential grantmakers, employers etc of Jacy when requested (actually this has likely already been done, but I doubt that SFF looked at it in the case of the recent grant because they aren't exactly community-related in that way. Would be interesting and worth knowing if they did though and why they'd have decided to move forward anyway <i>if </i>they did). I'll also note that Jacy has already pushed back a lot on the expulsion from Brown for sexual misconduct and his insistence and <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology?commentId=ELHW3Y4ePbjB8qpXk\">other details </a>give good reason to doubt the school made the right decision. And either way, if he did do something egregious, that was ~10 years ago from now (I think) which puts it outside of the statute of limitations and I think we should take our cue from that societal norm. He was punished (possibly quite overpunished) via expulsion and it is not our job to do so further. I would like to focus on rehabilitation and recent cases. It might be that without names Jacy can never address the cases to onlooker satisfaction, but perhaps proof of rehabilitation and actions taken to learn would help, and I don't really know why he didn't at least come back and talk about that.<br><br><strong>CEA Events:</strong> I'm not sure that CEA would still hold their ban 3 years later, or if they haven't gotten around to lifting it, would be good if they'd comment if it ever seems relevant to know. I also remember [edit: IIRC but it looks like I likely didn't] reading that CEA felt that the Brown incident kind of tipped them to be more concerned, but if you are very unsure what to think about the brown incident, you might not want to decide as CEA did which was a risk-reduction standpoint rather than a serving justice (either clearing someone's name or convicting them) standpoint. <strong>Relatedly</strong> I'll note, attending EA events (a prime place for asking people out) might have a higher bar of entry for Jacy than getting funding. &nbsp;Events are prime places to interface with women (bigger con for Jacy attending) and they are not that important for people settled into doing their direct work already (smaller pro for Jacy attending). Events are helpful, sure, but they aren't going to be <i>key </i>to effectiveness for someone like Jacy. If CEA evaluated the risk as low but still just don't want him at events because there aren't enough pros to take any risks, that's their right and pretty reasonable. But using funding to do important work, granted by a fund which has a high bar for effectiveness is, by definition, just simply \"important\". The pros and cons scale here is going to tip way differently if he is a minimal risk.</p><p><strong>Conjecture on exposure to \"victims\":</strong></p><blockquote><p>whether he should... be in a position where he can be exposed to more victims (recruiting researchers) is less clear to me</p></blockquote><ol><li>It isn't clear he ever did anything toward any woman he worked with?</li><li>Troubling men can do troubling things to women anywhere [so I'm just not so sure this holds as a qualifier]. I note that it might even actually be better to have him in EA where people are primed to call him on things and he knows he is treading on thin ice. I know this sentence will gross people out but I'm just saying that EA women are not worth more than other EA women. Sure I don't want him in the community <i><strong>if there is a notable risk</strong> </i>[edit: and I acknowledge that it isn't EA's job to take him on], but <i><strong>if we could establish that risk is pretty low</strong></i>, then it is seems reasonable to also infer that it would be better for women overall to have him in the community. [All I'm trying to do here is point out that EAs arent necessarily exposing men \"to <i>more </i>victims\" by working with them or funding them. Unless the counterfactual is that they are going to jail, men are going to get other jobs and work with women so it seems illfitting to bring up that he will be exposed to more women as a morally-relevant or ction-relevant point. If he is that much of a risk he should be in jail or under house arrest or something? At the very least he should have a formal charge so when people do a background check on him it comes up? If we have a problem that notable with him we are just <i>passing him on as a missing stair to the rest of the world.</i>]</li><li>I kind of think the terminology \"victims\" might be a bit strong here for recent cases. Maybe \"accusers\" or \"complainants\" is better if speaking from women's perspective, and \"targets\" better if speaking from Jacy's perspective? I say this as a woman that I find the term a bit disrespectful here or something, to both those women and to people who have experienced worse sexual misconduct... I can definitely imagine situations where I report someone doing some stuff like Jacy did, repeatedly asking out or something related to that, which might indeed be harassment. But I would not ever call myself a victim in regards to that sort of thing and I would not presume to call other women victims about it. And I think saying Jacy might \"victimize\" women who come across him, implies that people should expect or be fearful of worse treatment than we have sound (publicized?) reason to expect.&nbsp;</li></ol>", "parentCommentId": "bpJSMwQCXtuBvykFJ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "RbxEQ7JHeB2ot2ke8", "postedAt": "2023-03-09T19:04:04.689Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>Also there are certain implications of this I'd find very disrespectful to the people who had the key idea in the first place.</p></blockquote><p>Sorry, are you referring to Jacy here? what key idea did he come up with?</p><blockquote><p>He was punished (possibly quite overpunished) via expulsion and it is not our job to do so further.</p></blockquote><p>Agree that it is not CEA's job to punish Jacy for his actions at Brown, but this was largely not <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology?commentId=vGHdav2i6kv2LH95G\">what happened</a>.</p><blockquote><p>perhaps proof of rehabilitation and actions taken to learn would help, and I don't really know why he didn't at least come back and talk about that.</p></blockquote><p>I agree, and lack of this after 3 years should be a reason to update against its existence or the extent Jacy actually cares about this.</p><blockquote><p><strong>Conjecture on exposure to \"victims\"</strong></p><ol><li>It isn't clear he ever did anything toward any woman he worked with?</li></ol></blockquote><p>One quick question-do you think if sexual harassment allegations are true, is the EA community more or less at risk if Jacy is an independent researcher with no interaction to other EA researchers, or if he's actively trying to form a research network, or if he takes a community building role?</p><blockquote><p>Troubling men can do troubling things to women anywhere. It might actually be better to have him in EA where people are primed to call him on things and he knows he is treading on thin ice. I know this sentence will gross people out but I'm just saying that EA women are not worth more than other EA women.&nbsp;</p></blockquote><p>I think in that set of claims, the one doing the most work is \"establish that risk is pretty low\", which in Jacy's case, is an open question. To respond to the other parts-EA women are not cannon fodder for non-EA women. The community health team's job is to protect the EA community and should not be based on the extent adjacent communities are adequately managing the situation. The EA community does not exist primarily to internalize the negative externalities of society, and members of the EA community should not be expected to sacrifice themselves like this.</p><blockquote><p>I can definitely imagine situations where I report someone doing some stuff like Jacy did, repeatedly asking out or something related to that</p></blockquote><p>Do you have nonpublic info on Jacy? Can you be more clear on the kinds of situations you are imagining? How many of these do you think would result in a ban from CEA events? I guess my view here is that in most <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in#Appendix__12_months_of_cases\">situations</a> that would lead to a ban from CEA events, the word \"victim\" is probably appropriate. I think again this points to the issues around lack of clarity here, as some may be indexing the level of severity based on other things that CEA have banned people for, which are much worse than \"Jacy had asked some women out on dates\", while you are basing this off other information or taking Jacy's apology at face value etc, which doesn't seem super well justified.</p>", "parentCommentId": "KEvuhP3LoBdjn5Zzh", "user": {"username": "pseudonym"}}, {"_id": "EtwGswrScazBvf8qD", "postedAt": "2023-03-09T20:30:38.879Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>what key idea did he come up with?</p></blockquote><p>I mean, if we are talking about entrepreneurship replacability, that if it was his idea to form a network of digital mind research collaborators and advisors, and he wanted to lead it and was capable of doing so, it could be seen as disrespectful to push him off the idea of the project and find someone to replace him on an essentially-identical project.&nbsp;</p><blockquote><p>Agree that it is not CEA's job to punish Jacy for his actions at Brown, but this was largely not <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology?commentId=vGHdav2i6kv2LH95G\">what happened</a>.</p></blockquote><p>Okay fair, I'm updating that I am misremembering reading what I thought I did, but if I ever find what I'm thinking of I'll add it.</p><blockquote><p>I agree, and lack of this after 3 years should be a reason to update against its existence or the extent Jacy actually cares about this.</p></blockquote><p>Fair. I mean I kind of wonder if he expected people to get over it (which if it really was minor, he probably would expect), and was recently blindsided by the response to his March post. Maybe we will see a writeup soon (but probably not, you are right)</p><blockquote><p>One quick question-do you think if sexual harassment allegations are true, is the EA community more or less at risk if Jacy is an independent researcher with no interaction to other EA researchers, or if he's actively trying to form a research network, or if he takes a community building role?</p></blockquote><p>I guess I consider it the wrong question? Like obviously the answer is the former has less risk to the EA community, but I don't think minimizing risk is the only thing that matters? &nbsp;The degree of risk is the most important thing? Above a certain threshold of risk I would just want to do the most impactful one. We don't know the risk.</p><blockquote><p>I think in that set of claims, the one doing the most work by far is \"establish that risk is pretty low\", which in Jacy's case, is an open question.</p></blockquote><p>I agree, and I did specifically include that clause for that reason FWIW. I will go back and italicize it to make it clear. I believe that I really did consider this also negates the rest of that paragraph such as thinking of EA woman as cannon fodder etc.</p><blockquote><p>Do you have nonpublic info on Jacy? Can you be more clear on the kinds of situations you are imagining? How many of these do you think would result in a bn from CEA events? I guess my view here is that by most <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in#Appendix__12_months_of_cases\">situations</a> that warrant a ban from CEA events I think the word \"victim\" is appropriate.</p></blockquote><p>No. I can say that &nbsp;relevant thing I was imagining (among other scenarios) was something like repeated asking out after saying no (which is technically harassment) or making sexual or attraction-based comments (also harassment depending on badness of comment and whether the context and relationship implies it is disrespectful or degrading) and a response from CEA something like \"he clearly has a tendency to make women uncomfortable and this seems net negative for the events, so why honestly even allow him to come and possibly make another mistake, even if he is learning? Let's just ban him and be done with it.\". However I acknowledge this is unfounded and these are just some possibilities among other worse possibilities.</p><blockquote><p>I think again this points to the issues around lack of clarity here, as some may be indexing the level of severity based on other things that CEA have banned people for, which are much worse than \"Jacy had asked some women out on dates\", while you are basing this off other information or taking Jacy's apology at face value etc, which doesn't seem super well justified.</p></blockquote><p>I completely agree with you. And yeah I think that's a good point, that my taking the apology at face value is not \"super well justified\". I actually wasn't exactly trying to defend Jacy in particular. But trying to begin some discussion which might be relevant to determining if there is a punishment-over-rehabilitation framework in this community and where that line should be drawn. I can't say anything about Jacy's case in particular, and I also don't claim that CEA made a mistake about him or operated under any problematic framework when making their decision about him. To me it does feel really weird though, that if it was so bad, that CEA didn't make it more public so we could all better trust to steer clear or something. That does seem like it would become a missing stair concern, which actually maybe is what happened with him getting funding, idk. Anyway something bad does seem to be going on here (like maybe an overzealous reaction years later, or, I'm thinking more likely after this and another conversation, a non-transparent-enough culture which might lead to missing stairs. In fact either could be present in EA culture even if not in Jacy's case). And whatever it may be, I am starting to worry it will catch up with EA and at least some of its members eventually, in unpleasant ways (in some sense this whole thread is one of those ways).&nbsp;<br><br>I am now thinking that the root thing,<strong> the meta-thing </strong><i><strong>upstream</strong></i><strong> </strong>of us discussing whether Jacy's funding was okay or not, is more worth addressing than actually answering the question \"how and where did Jacy get funding and was it okay knowing what we know\".&nbsp;</p>", "parentCommentId": "RbxEQ7JHeB2ot2ke8", "user": {"username": "Ivy_Mazzola"}}, {"_id": "iz2ZN77Digpuwp6dy", "postedAt": "2023-03-09T20:36:06.788Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I agree with you, Ivy. I think it's deeply unfortunate that some paint Jacy with the same brush as predators like Michael Vassar. Is it wrong to ask someone out on Facebook Messenger? I don't mean to diminish how unsolicited romantic advances can make people uncomfortable, but it seems difficult to draw a coherent line between Jacy's actions and any time anyone asks anyone else out.</p><p>Jacy's public/influential role complicates his actions, but Jacy's frank apology and years-long lack of recidivism speak to the good faith of his effort to re-earn the community's trust. I don't think it's wrong for Jacy to receive funding from the community today.</p>", "parentCommentId": "P3drAXNugLgmwi7Yf", "user": {"username": "Ariel Simnegar"}}, {"_id": "rofENnHpZb8yyYnt4", "postedAt": "2023-03-10T04:01:00.667Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Given the gender ratio in EA and rationality, it would be surprising if women in EA/rationality didn’t experience more harassment than women in other social settings with more even gender ratios.</p>\n<p>Consider a simplified case: suppose 1% of guys harass women and EA/rationality events are 10% women. Then in a group of 1000 EAs/rationalists there would be 9 harassers targeting 100 women. But if the gender ratio was even, then there would be 5 harassers targeting 500 women. So the probability of each woman being targeted by a harasser is lower in a group with more even gender ratio. For it to be the case that women in EA/rationality experience the same amount of harassment as women in other social settings the men in EA/rationality would need to be less likely to harass women than the average man in other social settings.</p>\n<p>It is also possible that the average man in EA/rationality is more likely to harass women than the average man in other social settings. I can think of some reasons for this (being socially clumsy, open to breaking social norms etc) and some against (being too shy to make advances, aspiring to high moral standards in EA etc).</p>\n<p>(I also posted this comment on LessWrong.)</p>\n", "parentCommentId": null, "user": {"username": "pmk"}}, {"_id": "4tLysYkuEgYXFy4GJ", "postedAt": "2023-03-10T08:08:54.300Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I agree it wouldn't exactly be surprising <i>by default</i> but both communities are very high conscientiousness and EA specifically is meant to be a community of altruists? I know you sort of mentioned that, but honestly I think it should count for quite a lot if we are just doing conjecture here?&nbsp;<br><br>And again the two communities (EA and rationality) are getting tied together here? <strong>On gender ratio: </strong>EA has a 1:2 gender ratio which is honestly not that horrible for a community that grew out tech, philosophy, and econ. <i>Obviously I want to improve it very very much</i> but I kinda wish people would stop saying it is so incredibly uneven in such a way that it is implying that we can expect sexual misconduct to be egregious under the surface? 1:2 is about the gender ratio of the climbing gym I attend and I don't expect sexual misconduct to be egregious under the surface there? (but I do expect there to be <i>some</i> instances women have reported and I would expect that even if it were 1:1) Now compare that 1:2 ratio to the <strong>1:9</strong> gender ratio <i>at best</i> in rationality, well yeah that's probably gonna feel bad as a woman within rationality: even if rationalist conscientiousness bore out so that rat men do 1/3 the misconduct of normies, the rate of misconduct <i>per woman</i> would <i>still</i> be 3x! It wouldn't be a surprise if some extra stuff from rationality has spilled over to EA, association-wise.<br><br>I don't mean to tear apart your point but as <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=5bsyWyCfFgc3cE5LC\">I've said elsewhere</a>... This type of thinking is conjecture and I worry about what this type of public conjecture leads lurkers to assume about the community when such conjecture is repeated place after place. <a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\">It would be better to wait for data</a></p>", "parentCommentId": "rofENnHpZb8yyYnt4", "user": {"username": "Ivy_Mazzola"}}, {"_id": "MP7CatZKWEKuw2dkJ", "postedAt": "2023-03-10T08:29:55.238Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>This is one of those situations where I'd prefer to see the gender and background of the commenter before reading the comment so I can understand and adjust for their bias.</p><p>Because that's what allows you to really estimate the epistemic status of the commentary, and not what seems to be logic/rationality behind it. I imagine it's not that you used to think but I think that's how confirmation bias works in cases like this.&nbsp;</p><p>So: I am a woman, I had experience of abuse of power dynamics and manipulation of the ideas of saving the world + exploitation by high-status men within the rational and EA community. Watched it from the inside (not in the Bay Area even), I can confirm most of the general points in their dynamics.</p><p>Society and its set of dynamics are so varied that you simply cannot make enough adjustments (if you really want to maintain the status quo).</p><p>I see a different power dynamic than you (by you I mean some commenters who say the article is exaggerating) and it's not about a few individual black sheeps, it's about rotten toxic institutions in general that you are doomed to reproduce over and over again until you are completely transparent about your motives, respect the person and her happiness, and start your efforts to save the world more modestly, without a bullshit about the heroic responsibility that turns people into functions. Only from an excess of internal resources, interest and prosperity, we will save the world so that it does not turn into another hell that is not worth saving.</p>", "parentCommentId": null, "user": {"username": "ontologics"}}, {"_id": "eycpjTvwreihAiGaW", "postedAt": "2023-03-10T08:37:53.021Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thank you for sharing this. I'm angry that you've had these experiences, and I'm grateful you were open to talking about them, even in response to a comment that some found unfriendly.</p><p>A lot of the frustration in my initial comment comes from not knowing how to react to things like the Bloomberg article as a mostly-lurker in the community. I don't know whether I'm going to end up chatting or collaborating with someone who makes sexist comments or sends cruel messages to accusers; I wish I knew whose work I could safely share, promote, etc., without contributing to the influence of people who make the community worse.</p><p>While a comment like yours doesn't name names, it at least helps me get a better handle on how much energy I want to put into engaging with these communities.*&nbsp;</p><p>*This is a process that takes the form of thousands of small adjustments; no one comment is decisive, but they all help me figure things out.</p>", "parentCommentId": "uuwGGEPaBh54WNKNQ", "user": {"username": "fenneko"}}, {"_id": "Ea89Rwehr8hyD6uvo", "postedAt": "2023-03-10T08:43:16.034Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thanks for this context!&nbsp;</p><p>My understanding is that SFF regranting is pretty separate from the CEA/Open Phil network, since that I don't hear much about them on the Forum or in other EA spaces. But this is still a useful update about SFF* and a corrective to something I said that could have been misleading.</p><p>*I don't know anything about Jacy outside that post, and I should acknowledge that it's possible he's apologized and reformed to whatever degree was appropriate and should at some point make his way back to good standing in EA — but I haven't seen positive evidence of that either, so he seemed like a fair example to use.</p>", "parentCommentId": "ZedzMmhYEoprFc3ca", "user": {"username": "fenneko"}}, {"_id": "uKjHG7mGz6JkG94P5", "postedAt": "2023-03-10T08:46:04.547Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>That is very concerning; I've now read several separate accounts of his behavior toward others (friends, devotees, partners, strangers), and together they painted a terrible picture.</p><p>I plan on sending a concerned letter to SFF, though I'm not sure I expect it to do much. Others should consider doing the same.</p>", "parentCommentId": "zYnyQhxvHCHJpDxCd", "user": {"username": "fenneko"}}, {"_id": "7Xuus92P4cgdGSeKG", "postedAt": "2023-03-10T09:01:27.021Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I should clarify that \"particularly bad\" should be \"unusually bad\", and by \"unusually\" I mean \"unusual by the standards of human behavior in other professional/intellectual communities\".</p><p>If someone writes an article about the murder epidemic in New York City, and someone else points out that the NYC murder rate is not at all unusual by U.S. standards, and that murder tends to be common throughout human society, is that a trivializing thing to say?</p><p>You can believe a lot of things at once:</p><ul><li>Murder is terrible</li><li><a href=\"https://www.wsj.com/articles/new-york-city-saw-fewer-murders-in-2022-but-major-crimes-overall-rose-11672954714\">433 murders</a> is 433 too many</li><li>Murderers should be removed from society for a long time</li><li>NYC should strongly consider taking further action aimed at preventing murder</li><li>The NYC murder rate doesn't point to NYC being more dangerous than other cities</li><li>People in NYC shouldn't feel especially unsafe</li><li>People who want to get involved in theater should still consider moving to NYC</li><li>Some of the actions NYC could take to try preventing murder would likely be helpful</li><li>Other actions would likely be unhelpful on net, either failing to prevent murder or causing other serious problems</li><li>Focusing on the murder rate as a top-priority issue would have both good and bad impacts for NYC, and there may be other problems that should be prioritized</li><li>People who know about murders should strongly consider informing the police, even if they are at risk of retaliation within their communities; this would be very likely to reduce the murder rate</li><li>And yet, it is highly understandable if people at risk don't want to inform the police about murders, and the police need to be extremely vigilant about protecting informants from retaliation (perhaps more vigilant than they have been...)</li></ul><p>I'm in the position of believing many things at once, and I remain unconvinced that EA and rationality are unusually bad communities to be in, if a person seeks community. But I am reading comments and trying to learn, and I think there are plenty of things EA and rationality could do better on this front.</p>", "parentCommentId": "JAADLw9wqgaEeZsZr", "user": {"username": "fenneko"}}, {"_id": "4R2ooa7hFCpWnBnHC", "postedAt": "2023-03-10T09:06:24.536Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>CFAR investigated Brent and stood by him until there was public outcry!&nbsp;</p></blockquote><p>This says very bad things about the leadership of CFAR, and probably other CFAR staff (to the extent that they either agreed with leadership or failed to push back hard enough, though the latter can be hard to do).</p><p>It seems to say good things about the public that did the outcry, which at the time felt to me like \"almost everyone outside of CFAR\". Everyone* yelled at a venerable and respected org until they stopped doing bad stuff. Is this a negative update against EA/rationality, or a positive one?</p><p>*It's entirely possible that there were private whisper networks supporting Brett/attacking his accusers, or even public posts defending him that I missed. But it felt to me like the overwhelming community sentiment was \"get Brent the hell out of here\".</p>", "parentCommentId": "qy9fx7J4dcC23Brwu", "user": {"username": "fenneko"}}, {"_id": "AxgM2YRmEGTyQjfgt", "postedAt": "2023-03-10T10:35:19.980Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I think negative update since lots of the people with bad judgment remained in positions of power. This remains true even if some people were forced out. AFAIK Mike Valentine was forced out of CFAR for his connections to Brent, in particular greenlighting Brent meeting with a very young person alone. Though I dont have proof of this specific incident. Unsurprisingly, post-brent Anna Salomon defended included Mike Vassar.&nbsp;</p>", "parentCommentId": "4R2ooa7hFCpWnBnHC", "user": {"username": "deluks917"}}, {"_id": "oNxJx73BvLbquSduz", "postedAt": "2023-03-10T11:13:58.969Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>The \"chinese robber fallacy\" is being overstretched, in my opinion. All it says is that having many examples of X behaviour within a group doesn't necessarily prove that X is worse than average within that group. &nbsp;But that doesn't mean it <i>isn't</i> worse than average. I could easily imagine the catholic church throwing this type of link out in response to the first bombshell articles about abuse.&nbsp;</p><p>Most importantly, we shouldn't be aiming for average, we should be aiming for <i>excellence</i>. And I think the &nbsp;poor response to a lot of the incidents described is pretty strong evidence that excellence is not being achieved on this matter.&nbsp;</p>", "parentCommentId": "ruDaGwfbBt8qTrsdh", "user": {"username": "titotal"}}, {"_id": "6S8zrZgAbuGqdpakA", "postedAt": "2023-03-10T15:59:40.870Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I am encouraging you to try to exercise your empathetic muscles and understand the difference for a sexual assault victim to read a top comment that categorically condemns such actions, insisting that we need to do better as a community, compared to one that says “humans are gonna human”.</p>\n<blockquote>\n<p>If someone writes an article about the murder epidemic in New York City, and someone else points out that the NYC murder rate is not at all unusual by U.S. standards, and that murder tends to be common throughout human society, is that a trivializing thing to say?</p>\n</blockquote>\n<p>Your analogy does not share the same relevant features as in this case. We’re not a city, we’re a community. One that should try to be a welcoming space that takes one’s concerns seriously instead of dismissing them because they might not be above the base rate.</p>\n", "parentCommentId": "7Xuus92P4cgdGSeKG", "user": {"username": "MorganLawless"}}, {"_id": "dJQRKcjkJt9z43J8p", "postedAt": "2023-03-10T16:06:59.417Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hey, fenneko literally included:</p><ul><li>Murder is terrible</li><li><a href=\"https://www.wsj.com/articles/new-york-city-saw-fewer-murders-in-2022-but-major-crimes-overall-rose-11672954714\">433 murders</a> is 433 too many</li><li>Murderers should be removed from society for a long time</li><li>NYC should strongly consider taking further action aimed at preventing murder</li></ul><p>And they closed with <strong>\"I am..trying to learn, and I think there are plenty of things EA and rationality could do better on this front.\"</strong><br><br>FYI that your comment reads as unfair, or bad-faith, &nbsp;or possibly even disingenuous.</p><p>It also reads to me as patronizing to women, expecting that they can't follow the nuance of the discussion and see empathy in kenneko's comment. It is clearly there. &nbsp;We can still expect that all our members engage in good faith. I'm a sexual assault victim (and of other types of sexual misconduct) and have reported EA-adjacent men who have done troubling things in the community, and I thought kenneko's comment (this one and the top level one) was great.<br>&nbsp;<br>NOTE: I also believe you have misused the term sexual assault. We aren't just talking about sexual assault. We are talking about all types of sexual harrassment and misconduct. For example, I think only one instance mentioned in Time or Bloomberg was assault. I really am hoping people can keep terminology straight, because the classifications exist for reasons.</p>", "parentCommentId": "6S8zrZgAbuGqdpakA", "user": {"username": "Ivy_Mazzola"}}, {"_id": "oSkoiyZAfEXMpiuYi", "postedAt": "2023-03-10T18:53:15.671Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Personally, I think this article was kind of sloppily written, but I still think the situation it describes is worth spending a lot of time trying to understand.&nbsp;</p><p>My sense is that a lot of people really care about us handling this well so I want to try and do so</p><p>And in the ones where we know the accused, do people think the right thing happened?</p><p>In those where we don't, I'd like to know what outcomes people would have liked to have happened.&nbsp;</p><p>I guess personally I struggle since it feels like there is energy to \"do something\" but I don't understand how it would fix the stories described. And if the question is [an iceberg of hidden cases] which I have time for, I guess there are 10 &nbsp;- 50 other bad stories and 1 - 10 other really bad stories, I want to know what actions we should take, ideally after trying to understand what has actually happened.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "5kTWqWnEvhmADuHzG", "postedAt": "2023-03-10T21:25:37.312Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I agree that we should be aiming for excellence.</p><p>If having many examples of behavior X within a group doesn't show that the group is worse at that or better at that than average - if you <i>expect to see the same thing in either case </i>- then being presented with such a list has given you zero evidence on which to update.&nbsp;</p><p>They would have written the same article whether behavior X was half as common or twice as common or vanishingly rare. They would have written the same article whether things were handled well or poorly, as shown by their <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=4b8sDpsn4AKuukojX\">framing things misleadingly</a> and their <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=cPkiefYziTfJTi7k5\">lies of omission</a>. They had an ax to grind and they've ground it. We should be aiming for excellence but when we get there (or if we've gotten there) it will do absolutely nothing to prevent people from writing these articles.&nbsp;</p><p>When someone goes looking for examples of X behavior, knowing that they'll find a list, <i>with the goal of damaging your reputation</i> among third parties, being presented with the list does not seem to me a good impetus for paroxysms of soul-searching and finger pointing.&nbsp;</p>", "parentCommentId": "oNxJx73BvLbquSduz", "user": {"username": "Lumpyproletariat"}}, {"_id": "7vcgifqGdsksQQJow", "postedAt": "2023-03-10T21:40:13.319Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hi Ivy,</p><p>This comment was reported as needlessly unkind and assuming bad faith, which goes against&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#The_essentials_of_Forum_discussion\">forum norms</a>, and on a second read I agree.</p><p>Accusing someone of \"shitting on\" the community, producing \"anti-EA graffiti\", and being \"unconscionable and monstrously ill-mannered\" is a lot, especially based on a username that might have been intended as sarcastic rather than offensive.</p><p>Especially in particularly sensitive threads, please aim for a much higher standard before accusing someone of bad faith (including in this&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=dJQRKcjkJt9z43J8p\">other comment</a>).</p>", "parentCommentId": "cDwjCSn3eth9sfaAF", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "dQsxyucWDSJ7WtenB", "postedAt": "2023-03-10T22:04:06.767Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>One of the comments Ivy was responding to there began \"I am encouraging you to try to exercise your empathetic muscles and understand...\"&nbsp;</p><p>And the comment thread we are in by someone who named this burner account of theirs \"Eugenics-Adjacent\" began \"Sadly I fear stories like this are lost on the devoted EA crowd here...\"<br>&nbsp;</p><p>I agree that posts on the EA forum should be kind and assume good faith.</p>", "parentCommentId": "7vcgifqGdsksQQJow", "user": {"username": "Lumpyproletariat"}}, {"_id": "E6C9ASQcuNRuY5LNH", "postedAt": "2023-03-10T22:26:00.148Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Okay fair about this comment.&nbsp;<br><br>I want to push back on your linking the other comment though. I said &nbsp;FYI that their comment was reading to me a certain way.... isn't that forum norms?</p>", "parentCommentId": "7vcgifqGdsksQQJow", "user": {"username": "Ivy_Mazzola"}}, {"_id": "oguJMp57Mh2NP6t5C", "postedAt": "2023-03-10T22:51:26.809Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I'm not questioning this decision on a whole regarding Ivy's comment, and accept that this is a sensitive thread so stricter norms will apply, but I think the original user's name - \"Eugenics-Adjacent\", should at least raise some eyebrows.</p><p>I find it unlikely that it would be a coincidence that they happened to choose a name which plays on the \"I'm not an EA, I'm EA-adjacent\" trope, and the \"Eugenics\" seems to relate to the Bostrom letter. Taken together, \"Eugenics-Adjacent\" seems easily interpretable as a shot at the entire EA movement for being exactly this.&nbsp;</p><p>The OP also &nbsp;posted the first comment on this thread iirc, and set the tone off by saying:</p><blockquote><p>...stories like this are lost on the devoted EA crowd here. We're likely to see another round of rationalizing, distancing, downvoting, and flooding the forum with posts to drown out the stories of power being abused</p></blockquote><p>Which includes a direct accusation the EAs will 'flood the forum' with posts after controversial issues like this intentionally in order to bury this issue.</p><p><strong>Tl;dr:</strong> Not commenting on the whole of Ivy's comment being unkind/assuming bad faith, but I think one can also be sceptical of the original poster's motives</p>", "parentCommentId": "7vcgifqGdsksQQJow", "user": {"username": "JWS"}}, {"_id": "BDM3ETcHw5RiACYZp", "postedAt": "2023-03-10T23:23:29.542Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>In the absence of evidence that rationalism is uniquely good at dealing with sexual harrasment (it isn't), then the prior assumption about the level of misconduct should be \"average\", not \"excellent\". &nbsp;Which means that there is room for improvement.&nbsp;</p><p>Even if these stories do not update your beliefs about the <i>level</i> of misconduct in the communities, they do give you information about <i>how</i> misconduct is happening, and point to areas that can be improved. I must admit I am baffled as to why the immediate response seems to be mostly about attacking the media, instead of trying to use this new information to figure out how to protect your community.&nbsp;</p>", "parentCommentId": "5kTWqWnEvhmADuHzG", "user": {"username": "titotal"}}, {"_id": "KpLXvJq9gQT6qd4Bu", "postedAt": "2023-03-10T23:39:46.425Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thank you for noting this.&nbsp;<br><br>I agree with <a href=\"https://forum.effectivealtruism.org/users/lorenzo-buonanno?mention=user\">@Lorenzo Buonanno</a> that people in EA culture should think I addressed it pretty poorly. I think that myself now, and knew that it was far from ideal at the time.&nbsp;<br><br>My explanation here (not excuse) is that I don't always have the energy to call things out in the best way. In those cases it's often best to stay quiet but not always. In this case I honestly did not expect anyone would do the calling out instead? Yet I messed up egregiously. I just find it so incredibly draining to face the fact that people disrespect EA <i>that much and that casually.</i> It really breaks me tbh thinking it's that far gone, unjustly I'd say, so I fight against that reality. Sometimes I <i>do</i> think \"it is so pointless, we will never stem the flow of incorrect misleading criticism\" even if I don't really <i>think</i> that, I feel that. So anger is what helped me get over that feeling to write a clapback I thought was worth trying.<br><br>I wish I could trust that others would also <i>call out</i> bad behavior and make it clear that EAs deserve respect as much as anyone. But I think what I expect more from EAs is ignoring disrespect, explaining it, steelmanning it, or politely requesting for better (which like, we are talking about a proven-rude person here so they can just brush that right off their shoulders?).&nbsp;<br><br><strong>I am very sorry for writing it as harshly worded as I did though. This was a particularly egregious fuckup of mine and I want to do better.</strong> FWIW I considered deleting the comment yesterday but kinda thought that would be epistemically dishonest or something, as I didn't want to retract the whole thing, but again I didnt have the energy to <i><strong>fix</strong></i> it. Now I <strong>will</strong> try to fix it with liberal <s>strikethroughs</s></p>", "parentCommentId": "oguJMp57Mh2NP6t5C", "user": {"username": "Ivy_Mazzola"}}, {"_id": "Fyp9CsNXwH4uKMg8Y", "postedAt": "2023-03-11T00:01:42.021Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>To be clear, I would not have commented on the other comment by itself. Still, I do think there's a general pattern on the forum where some threads by default tend to spiral out by commenters gradually modeling each other as more and more adversarial, unless we make a significant active effort in assuming good faith and being kind<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreffl06qzgsyb5\"><sup><a href=\"#fnfl06qzgsyb5\">[1]</a></sup></span>, and I think that thread might have become an example of that.</p><p>I agree that there's an important difference between calling someone disingenuous and mentioning that a comment reads to you as disingenuous, but I still think that discussing things on the object level (like you mostly do in the rest of the comment) is kinder and helps to prevent such spirals.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnfl06qzgsyb5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreffl06qzgsyb5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Someone wrote somewhere that discussion norms are <i>ectotherms</i>: need to constantly receive energy to survive, I've found it a helpful metaphor.</p></div></li></ol>", "parentCommentId": "E6C9ASQcuNRuY5LNH", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "KMh5nqvWkQDspHhrP", "postedAt": "2023-03-11T00:06:26.977Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thank you for clarifying that. Yeah you are right, and the ectotherm thing is a good analogy.</p>", "parentCommentId": "Fyp9CsNXwH4uKMg8Y", "user": {"username": "Ivy_Mazzola"}}, {"_id": "E6GeAKQFzrCpnxDia", "postedAt": "2023-03-11T00:47:28.240Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I wonder if you both might just believe the same thing here? titotal, do you not think it possible that lumpyproletariat was offering that as one option out of many as a sort of insurance plan that witchhunts against EA not begin? Witchhunts are very easy to start, especially once you know more details and you know you need them, but they are very hard to stop. So I guess I think they agree with you but just want to drop in that reminder for people of that possibility to try to help things go well? Rather than making a claim that base rates is <i>necessarily</i> the case? After all, you both want the community to do better and be \"aiming for excellence\"?&nbsp;<br><br>[I agree it would have been better framed as one reason out of various though. I've been liking the allegory of the blind men and the elephant more for this myself]<br>&nbsp;</p><blockquote><p>baffled as to why the immediate response seems to be mostly about attacking the media, instead of trying to use this new information to figure out how to protect your community.&nbsp;</p></blockquote><p>I don't really want to get involved in this thread other than saying \"I think you guys agree\" so it's okay if you consider it a tangent but... I'll just flag that I think this bit isn't accurate in character. What if the lessons were learned back then and the \"immediate response\" has actually passed? What about this response from the Community Health Team about an <a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\">ongoing project to help clarify problems and reveal avenues for making the community safer</a>, which probably implies that the rest of us don't have much to do quite yet except maybe help people be patient for that? Another option <i>is, </i>if we want to go our own way, actually to try to figure out the veracity of the media and other sources of info, because questioning the importance of various pieces of info would also lilely be the first step in helping determine which potential interventions might do nothing <i>or</i> do amazingly <i>or</i> do net harm. I wouldnt recommend getting stuck on using such selective data, when there should be better to some soon, but you are certainly welcome to try to use this information to protect the community, and let us know if you think of something for us to do!</p>", "parentCommentId": "BDM3ETcHw5RiACYZp", "user": {"username": "Ivy_Mazzola"}}, {"_id": "D2bWmfrXXB8YMaTFK", "postedAt": "2023-03-11T00:48:29.390Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>The Bloomberg piece was not an update on how misconduct has happened in EA to anyone who has been <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=u8MzaggK6SoLFjFNc\">previously paying attention</a>.&nbsp;</p>", "parentCommentId": "BDM3ETcHw5RiACYZp", "user": {"username": "Lumpyproletariat"}}, {"_id": "YePoerw8rgs53bw2K", "postedAt": "2023-03-11T03:19:13.064Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>But... this comment is false as far as I can tell? Like, I didn't express myself ideally in my <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=xmjhmNyWAiM7t82Wt\">comment below</a> (which I think deserves the downvotes and the lower visibility), and it's an understandable misunderstanding to think that Michael still has somehow some kind of speculation grant budget, but at least to me it really looks like he is no longer involved.</p><p>Just to excerpt the relevant sections from the thread below:&nbsp;</p><blockquote><p>There is a largish number of people who are involved as speculation grantors who have a pretty small unilateral budget to make grants with, and I had in my mind totally not cached them as \"being involved in SFF\" (and do also think that's a kind of inaccurate summary, though one that I think is reasonable to have from the outside).</p><p>[...]</p><p>I also have access to an internal spreadsheet of speculation grantors and Michael is not listed on that, which does make me more sympathetic to my misunderstanding since I have looked at this spreadsheet a bunch more recently, and so was quite confident that he wasn't listed on that one. My current best model is that he is no longer a speculation grantor (maybe because his budget went to zero), though I find him being listed on the website but not on the internal spreadsheet confusing enough that I might be missing something.</p><p>[... new comment]</p><p>Cool, yeah, looks like he was removed around the same time from the spreadsheet and from the public list, so I am now quite confident that he is no longer involved as a speculation grantor.</p></blockquote>", "parentCommentId": "uKjHG7mGz6JkG94P5", "user": {"username": "Habryka"}}, {"_id": "pXoqkAohGyCJx3G6G", "postedAt": "2023-03-11T04:05:17.570Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>I guess I get the sense that letting Michael act as a grantor is bad e.g. because of the signaling effects that SFF is willing to overlook someone's history of sexual harassment/assault etc, and not because the money will necessarily be poorly spent. Whereas you think 50k to Jacy is reasonable and 200k to Michael as a grantor is reasonable because it's sufficiently small that this effect doesn't matter? I basically don't follow, and I'd be interested in hearing more about your reasoning, if you're happy to clarify!</p></blockquote><p>I mean, I don't think it makes sense to force everyone even vaguely nearby in the EA social network to defer to some EA consensus about who it is OK to engage with vs. not. I think it's important that people can somehow signal \"I don't want my actions to be taken as an endorsement of the EA community, please don't try to interpret my actions as trying very hard to reflect the EA consensus \". The SFF has tried to do this in a lot of its writing and communications, and I think it's pretty important for people to be able to do that somehow.&nbsp;</p><p>I also think it's really important for grantmakers to somehow communicate that a grant from them is not a broad endorsement of all aspects of a project. This is actually frequently a huge obstacle to good grantmaking and there are all kinds of grants that things like the LTFF and OpenPhil and other grantmakers are averse to making because the grant would somehow inextricably come an endorsement of the whole organization or all individuals involved, and this prevents many good grants from happening.&nbsp;</p><p>Historically I have tried to fix this on the LTFF by just publishing my hesitations and concerns with individuals and organizations when I recommended them a grant, but that is a lot of work. It also stresses a lot of people out and gets you a lot of pushback, so I don't think this is currently a solution that people can just adopt tomorrow (though I would love for more people to do this).</p><p>I do also think that $50k is really not very much, and also the grant isn't \"to Jacy\", but to an organization that Jacy is involved in, which I think reduces potential harm by another factor of 2-3 or so. I personally quite disliked this grant, and think it's a bad grant, but I don't think it's a grant that I feel actually causes much harm. It just seems like a bad use of money that maybe causes a few thousand expected dollars in negative externalities.&nbsp;</p><p>There are grants that I would have paid serious money to prevent (like some historical grants to Leverage Research), but this is not one of them, and I think I would update a bit downwards on the judgement of a process that produces grants like this, but not much more.&nbsp;</p><p>On the other hand, I think the $200k speculation grant budget to Michael is actually a good idea, though definitely a high-variance choice and I could totally be convinced it's a bad idea. $200k as a regrantor is just really not very much (I think substantially less power than $50k of direct funding, for example), and as far as I can tell the grants he recommended were extremely unlikely to cause any problems in terms of weird power dynamics or pressure (I don't feel comfortable going into details since speculation grant info is private, but I do think I can share my overall assessment as these grants having been very unlikely to give rise to any undue pressure).</p><p>I do think this is a reasonable thing to worry about. I also think Michael is exactly the kind of person who has in the past suggested projects and perspectives that have been extremely valuable to me, and I think giving him some money to highlight more of those is totally a worthwhile investment. If I was doing something like giving him a speculation grant budget, I do think I would probably take some kind of precaution and block some grants that look maybe like they would involve weird power-dynamics, but it doesn't look like it ever came to this, so it's hard for me to tell what process might have been in place.</p><p>I also separately just want to iterate my own personal epistemic state, which is that I haven't heard of any credible allegations of sexual abuse for Michael. I personally find being around him quite stressful, I know many people who have had bad experiences with him, and he seems very manipulative in a ton of different ways, but I do want to distinguish this from the specific ground truth of sexual abuse and assault. As I said before, I don't currently want him to be part of my community or the Effective Altruism community more broadly.</p><p>I might totally be missing something, and if Michael was more closely involved in the community and would pose more of a direct risk, I would probably spend the (very considerable) effort investigating this in more detail, and I would currently be happy for someone else to investigate this in more detail and share as much as they can, but I also don't currently have the personal capacity with all my other responsibilities to investigate this much further (and my guess is the community health team also thinks there is no immediate urgent need given that he is really not very involved in community things these days).&nbsp;</p><p>I do want to avoid contributing to an information cascade that somehow updates on there being tons of confirmed evidence of sexual assault for someone, when at least I haven't seen that evidence. The only evidence I know of are these two <a href=\"https://twitter.com/RuffleJax/status/1009632877578018816\">tweet</a> <a href=\"https://twitter.com/RuffleJax/status/1009632877578018816\">threads</a> by a person named Jax (who I don't know), and in that tweet thread they also say a bunch of stuff that seems really extremely likely to be false to me, or extremely likely to lack a ton of relevant crucial context, so that I don't consider those allegations to be sufficient for me to update me very much.</p><p>Again, there is totally a chance I am missing information here, and I have my own evidence (unrelated to any sexual abuse or assault stuff) that makes me not want Michael be involved in the EA and Rationality community more than he currently is, and if other people have additional evidence I would love to see it, since this does seem at least somewhat important.</p>", "parentCommentId": "28fSqpiWGyJf5gm8o", "user": {"username": "Habryka"}}, {"_id": "nz8AhwgXsytjKdtdt", "postedAt": "2023-03-11T11:20:15.325Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I think it's good to both address sexual misconduct and to correct misleading context in media pieces. But if you <i>only</i> mention the latter, it gives the impression that the former doesn't matter. I would highly encourage people who care about both to at least <i>mention</i> that you care about reducing the level of misconduct. It may sound like stating the obvious, but it really does matter.&nbsp;</p><p>While I certainly hope everyone cares about both, I can't honestly say I believe that. Going through the lesswrong thread, it honestly looks to me like a lot of people genuinely don't want to think about the issue at all, and I find this concerning. For example, downvoting the thread to 0 seems completely unwarranted.&nbsp;</p>", "parentCommentId": "E6GeAKQFzrCpnxDia", "user": {"username": "titotal"}}, {"_id": "mYEGJsxz2YJna4Hxu", "postedAt": "2023-03-11T11:50:51.125Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hey! Angela Pang here. I am working on a unified statement with the person who I am referring to in that excerpt, Robert Cordwell: <a href=\"https://www.facebook.com/angela.pang.1337/posts/pfbid034KYHRVRkcqqMaUemV2BHAjEeti98FFqcBeRsPNfHKxdNjRASTt1dDqZehMp1mjxKl?comment_id=1604215313376156&amp;notif_id=1678378897534407&amp;notif_t=feed_comment&amp;ref=notif\">https://www.facebook.com/angela.pang.1337/posts/pfbid034KYHRVRkcqqMaUemV2BHAjEeti98FFqcBeRsPNfHKxdNjRASTt1dDqZehMp1mjxKl?comment_id=1604215313376156&amp;notif_id=1678378897534407&amp;notif_t=feed_comment&amp;ref=notif</a></p>\n<p>I actually wanted to say that I felt like Julia Wise handled my case extremely respectfully, though there still wasn't enough structural support to reach a solution I would've been satisfied with (Julia Wise wanted to ban him, whereas I was hoping for more options), but that can change.</p>\n<p>My complaint lies with the culture and certain parts of the rationalist community much, much more than CEA, since the lack of moderation leads to abusers feeling empowered. Overall, I think CEA did a decent job with my case at least, and I appreciate Julia Wise's help.</p>\n", "parentCommentId": "BP3jz3NN8AJjrhYGo", "user": {"username": "Angel1412kaitou"}}, {"_id": "iiWyE6MhGJgAcf89N", "postedAt": "2023-03-11T13:38:52.158Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Hey! Angela Pang here. I am working on a unified statement with the person who I am referring to in that excerpt, Robert Cordwell: <a href=\"https://www.facebook.com/angela.pang.1337/posts/pfbid034KYHRVRkcqqMaUemV2BHAjEeti98FFqcBeRsPNfHKxdNjRASTt1dDqZehMp1mjxKl?comment_id=1604215313376156&amp;notif_id=1678378897534407&amp;notif_t=feed_comment&amp;ref=notif\">https://www.facebook.com/angela.pang.1337/posts/pfbid034KYHRVRkcqqMaUemV2BHAjEeti98FFqcBeRsPNfHKxdNjRASTt1dDqZehMp1mjxKl?comment_id=1604215313376156&amp;notif_id=1678378897534407&amp;notif_t=feed_comment&amp;ref=notif</a></p>\n<p>I actually wanted to say that I felt like Julia Wise handled my case extremely respectfully, though there still wasn't enough structural support to reach a solution I would've been satisfied with (Julia Wise wanted to ban him, whereas I was hoping for more options, but it seems like other reports came in a few weeks ago so he's banned now), but that can change.</p>\n<p>I consider most of EA quite respectful, though I caught sexual harassment at least once at EAG (which I don't think was reported, since the woman in question called it out quickly and the man apologized). CEA handles reports well, though I've only reported Robert.</p>\n<p>My complaint lies with the rationalist culture and certain parts of the rationalist community much, much more than CEA, since the lack of moderation leads to missing stairs feeling empowered. Overall, I think CEA did a decent job with my case at least, and I appreciate Julia Wise's help!</p>\n<p>If they had more options for victims or if it was clear what is EA vs. rationalist community vs. adjacent communities, I think I would have reported everything far sooner. The structure really just isn't there to make you feel supported enough even if most people in EA are extremely supportive. I'm talking to Julia Wise about some ideas now on how to incentivize reporting before things snowball uncontrollably. There's much more context I'll include later in a unified statement with Robert, so stay tuned!</p>\n", "parentCommentId": "BYvgpTxBTCZJQqHCz", "user": {"username": "Angel1412kaitou"}}, {"_id": "4K7jAodvEyKDtzMnE", "postedAt": "2023-03-11T15:46:20.578Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I strong upvoted this because it's a great comment, with a lot of good info and perspective on grantmaking, but I would push back on the idea that there aren't \"credible allegations of sexual abuse against Michael\". Or, I wonder where you draw the line at defining \"sexual abuse\"? You yourself appear to admit he is troubling, and when in a relationship that can so easily just become sexual abuse, sexual gaslighting, sexually demeaning statements, etc. It's not like \"sexual behavior\" is a protected category. It's just another type of behavior. Sure it's a very special type of behavior that is attached very strongly to the buttons for dopamine, power, self esteem, and pleasure, but that doesn't make it special for an abusive personality type of person such that they would necessarily put a gate up in their minds around it... it makes it more likely they press that button. Especially once in relationship, it's important to remember sexual misconduct is not rare, for some portion of people (and it sounds like vassar is highly likely to be one of these), who suck at relating to others (like suck so hard it becomes abuse), sexual conduct is just another way to relate, and that poor (<i>abusively</i> poor) sexual relating can be very common for such people.&nbsp;<br><br>Whether or not their relationship was even 2-way toxic, it doesn't excuse sexual abuse so I am not sure I can think of a lot of context that makes up for it.<br><br>But anyway I agree with you that he shouldn't be in community anyway. It;s weird that for so many people sexual abuse would be the breaking point they want absolutely confirmed or denied, when actually there are a lot worse things someone can do before that. I do kinda wonder if people near him should run an intervention though, that unless he seek help for anger issues and other personality issues (did you know there are meds to reduce angry outburts? plus of course other treatments you prob know about, CBT, DBT, etc) and make detialed apologies and accountings of his wrngdoings and accusations til that point, they will cut ties. Like, that would be the agentic option if friends with someone like that. I don't get it. He is probably financially privileged so why can't he use his money to try to fix his issues? Red flag he isn't, or if he has he needs to do a public update to that effect, and what issues he is still struggling with (broken brain is real and maybe permanent but like it's better to admit than people think you don't care to try). Given his prominence in these discussions it is just insane that he has not done something like that. I would steer clear even personally tbh, but of course, I'm a woman so I expect he would scoff at me and mistreat me at any slip of mine which is not right.</p>", "parentCommentId": "pXoqkAohGyCJx3G6G", "user": {"username": "Ivy_Mazzola"}}, {"_id": "Rq5pptBBqjGBKDSuk", "postedAt": "2023-03-11T23:10:59.173Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>None of this was news to the people who use LessWrong.&nbsp;</p><p>The time to have a conversation about what went wrong and what a community can do better, is immediately after you learned that the thing happened. If you search for the names of the people involved, you'll see that LessWrong did that at length.</p><p>The <i>worst possible time</i> to bring the topic up again, is when someone writes a misleading article for the express purpose of hurting you, which was not written to be helpful and purposefully lacks the context that it would require in order to be helpful. Why would you give someone a button they can press to make your forum talk for weeks about nothing?&nbsp;</p><p>It was a low-quality article and was downvoted so fewer people saw it. I wish the same had happened here.</p>", "parentCommentId": "nz8AhwgXsytjKdtdt", "user": {"username": "Lumpyproletariat"}}, {"_id": "pdWgBmkxnKMKfDjCB", "postedAt": "2023-03-13T14:46:41.649Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote>\n<p>Neither Scotts banning of Vassar nor the REACH banning was quiet.</p>\n</blockquote>\n<p>I think these were relatively quiet.  The only public thing I can find about REACH is <a href=\"http://benjaminrosshoffman.com/why-i-am-no-longer-supporting-reach/\">this post where Ben objects to it</a>, and Scott's listing was just as <a href=\"https://web.archive.org/web/20190927005116/https://slatestarcodex.com/comments/\">\"Michael A\"</a> and then later <a href=\"https://web.archive.org/web/20200109022004/https://slatestarcodex.com/comments/\">\"Michael V\"</a>.</p>\n", "parentCommentId": "mT5fDKFZpnYnvt2jn", "user": {"username": "Jeff_Kaufman"}}, {"_id": "nCFRegXxZ2jDPE8Eh", "postedAt": "2023-03-14T13:10:47.561Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>IIRC, Jax is Bryk is the one who made up the \"math pets\" allegation against me, which hopefully everyone knows to be false. &nbsp;I don't know anything about the state of the rest of the allegations against Michael, but <i>if </i>I'm recalling correctly that Jax is that particular known-false-accuser, we probably want to subtract anything from Jax and then evaluate the rest of the list.</p>", "parentCommentId": "pXoqkAohGyCJx3G6G", "user": {"username": "EliezerYudkowsky"}}, {"_id": "F9HqdhSniKcc7bhzk", "postedAt": "2023-03-14T13:15:25.409Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>FYI: &nbsp;IIRC/IIUC, Bryk is the one who made up the thing about my having a harem of submissive mathematicians whom I called my \"math pets\". &nbsp; This is false; people sufficiently connected within the community will know that it is false, not least since it'd be widely known and I wouldn't have denied it if it were true. &nbsp;I am not sure what to do about it simply, if someone's own epistemic location is such that my statements there are unknowable to them as being true.</p><p>It is known to me that Bryk has gone on repeating the \"math pets\" allegation, including to journalists, long after it should've been clear to her that it was not true.</p><p>My own understanding of proper procedure subsequent to this would be to treat Bryk as somebody having made a known false allegation, especially since I don't know of any corresponding later-verified/known-true allegations that she was first to bring forth; and that this implies we ought to cross everything alleged by Bryk off any such lists, unless there's independent witnesses for it, in which case we can consider those witnesses and also reconsider the future degree to which Bryk ought to (not) be considered as an evidential source.</p><p>(<i>If</i> I am recalling correctly that Jax started the \"math pets\" thing.)</p>", "parentCommentId": "BYvgpTxBTCZJQqHCz", "user": {"username": "EliezerYudkowsky"}}, {"_id": "xzu8NZkzLyPyzoGLe", "postedAt": "2023-03-15T01:46:21.223Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Separate from the harassment accusations, Jacy (and ACE while he was there, where I expect he had influence but far from unilateral control) had a bunch of criticisms of their work I would also want addressed before I gave money to an org founded and run by Jacy and his spouse.</p>", "parentCommentId": "pXoqkAohGyCJx3G6G", "user": {"username": "Elizabeth"}}, {"_id": "62qwgKjjXH35QGZpJ", "postedAt": "2023-03-15T01:47:54.006Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<blockquote><p>Is it wrong to ask someone out on Facebook Messenger?</p></blockquote><p>&nbsp;</p><p>Is that what happened? It's never been made public, and the accusations against him in college were much &nbsp;more serious.</p>", "parentCommentId": "iz2ZN77Digpuwp6dy", "user": {"username": "Elizabeth"}}, {"_id": "WJKRhrzNoePqabpSY", "postedAt": "2023-03-15T01:49:49.887Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Totally. As I said in another comment, I think the grant was bad, but lots of grants made from the EA community are (in my opinion) pretty bad. It doesn't feel like the kind of decision that makes me go and try to actively stop someone from doing it.</p>", "parentCommentId": "xzu8NZkzLyPyzoGLe", "user": {"username": "Habryka"}}, {"_id": "uQCzixAmWTS8LQYFB", "postedAt": "2023-03-15T05:45:03.027Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>It's all I'm aware of, to the extent of my knowledge. I'm unfamiliar with the accusations against him in college, and could retract my above comment if given sufficient evidence.</p>", "parentCommentId": "62qwgKjjXH35QGZpJ", "user": {"username": "Ariel Simnegar"}}, {"_id": "jhATDsEzp6D3CANP2", "postedAt": "2023-03-15T15:37:04.782Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Do you have details of his college expulsion and accusations? I honestly couldn't find them. After going through the whole discussion of his apology I could only find <a href=\"https://www.browndailyherald.com/article/2012/12/letter-student-alleges-insufficient-evidence-for-possible-expulsion/#comment-868568432\">his own letter about it from 10 years prior </a>saying it was an incorrect expulsion and also someone linked some <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology?commentId=ELHW3Y4ePbjB8qpXk\">other cases of Brown doing a poor job on sexual misconduct cases</a>: IIRC other courts deemed that the brown committee mishandled cases of students accused of sexual misconduct. It appears in one case (not necessarily Jacy's but I've seen this happen myself elsewhere, so I'd actually bet more likely than not that if it was allowed to happen one time it happened in Jacy's case too) that the students had banded together and written letters of unsubstantiated rumors to the Brown committee (eg, assuming what they'd heard in the gossip mill to be true &nbsp;and then trying to make sure the committee \"knew\" the unsubstantiated rumors, perhaps stating them as fact not even relaying how they had heard it), and then the Brown committee actually did use the letters as evidence in the University tribunal. The actual US court said that Brown, in doing this, &nbsp;went against due process. To reiterate, that was another Brown case not Jacy's, but I'd like to hear what actually happened in Jacy's<i> </i>case <i>if</i> we were to count an offense from 10 years ago (which I now think CEA also mostly did not).&nbsp;<br><br>I'm really <i>not</i> trying to defend Jacy here. Actually after reading more and someone even DMed to have a conversation, <i>I do expect he did worse than mentioned in his apology but that any victim won't go public so those of us on the outside will never know for sure. </i>But I'd also like to exhibit why I didn't much discuss the college expulsion, and I still won't jump the gun that, whatever he did, it necessarily deserved expulsion because it looks like Brown at that time may have been both incredibly bad at handling such cases and incredibly rife with rumor mill.&nbsp;</p><p>Plus it was still 10 years ago, and as I said elsewhere he has been punished (possibly overpunished) for that. I know that punishment might not assuage concerns of safety (I've been repeatedly surprised that questions of rehabilitation and self improvement have been so missing from the discussion of him, like no one seems to care that <a href=\"https://forum.effectivealtruism.org/posts/WebLP36BYDbMAKoa5/the-future-might-not-be-so-great?commentId=7tY33jYJQN9qLiTLp\">he also sent apologies directly to the women</a> and also no one has wondered if there is a way he <i>could </i>make it up to the community via self-improvement efforts, although I don't <i>think </i>he has focused on this), but to me <i>safety is the important thing</i>. I guess I'm still unsure what safety level to put Jacy at in my mind <i>today even if I'm becoming more sure he did some troubling things left out of his apology in his past</i>.&nbsp;<br><br>In pushing back on bringing up the college thing, I see myself not as defending Jacy, but as pushing back on an instinct to trust decisions of others, which might lead us into unwarranted disgust reactions and type-casting, which, to me, gets in the way of figuring out <i>what matters about his presence</i>, which, to me, is how <i>safe </i>he is to have around <i>today</i> (10 years after the expulsion).<br><br>I know that some people don't find his work the most worth doing/granting to, but some people do, and if it <i>is </i>worth doing, his actual safety would be worth figuring out and making transparent.&nbsp;<br><br>(That said, as I <a href=\"https://forum.effectivealtruism.org/posts/7b9ZDTAYQY9k6FZHS/abuse-in-lesswrong-and-rationalist-communities-in-bloomberg?commentId=EtwGswrScazBvf8qD\">conclude here</a>, I'm now more interested in what is going on upstream, as to why this is so hard to figure out)<br><br>[Additional Reflection: I wish potential granters or collaborators of Jacy would speak to the women (maybe CEA would put them in contact?), and see what they think. While I don't think their perspectives should be \"the be all end all\", I find myself really wishing I could defer to their thoughts today about concrete actions like grantmaking given the passage of time. There are cases in my own life regarding men who I've had complaints about, where I would continue to have concerns about safety and I'd want others to act as though he is still a risk (forever or for some very long amount of time). But there are also other cases, from my own experience as a victim, where <i>depending on the person's evident growth,</i> I might say, \"I think it's been long enough and it's probably okay now\".&nbsp;<br><br>If I were a potential collaborator with Jacy I'd personally be very reluctant to assume that victims and people in the know feel the former <i>or</i> the latter, which in my case would mean I'd dig deeper<i> </i>with the EA Community Health Team. I'd also feel frustrated and concerned if I couldn't find out more, and probably not grant but feel there was some informational injustice occurring. I hope that CEAs processes allow for <i>thorough</i> understanding by well-meaning parties who need the info, and even potential requests to be put in contact with the victims respectfully. If SFF did not go looking for opportunities to thoroughly check things, I do find that troubling/risky/bad of SFF.&nbsp;<br><br>But if systems are not in place for that, I'm not sure we can expect potential collaborative actors such as SFF to just trust nontransparent decisions for the rest of time. It will depend on the case as to exactly <i>how long</i>, but after <i>some</i> amount of time <i>without more complaints</i> we should expect the scales for actors who would otherwise collaborate with past-accused to sort of tip against trusting the old nontransparent decision. They will at some point put much higher probability that it is not relevant to decisions they are faced with today. There will also, simultaneously, begin a period of time where people who view the old decision with different credences get upset at those whose scales tipped toward disregarding the old decision sooner than their own scales lead them too. This means there will be division and some predictable social unrest, until enough time has passed that basically everyone is ready to make peace with/disregard the nontransparent case (which may take 50 years idk). This is a bug of the world which will occur within communities of good people, because communities of good people still put different credences on things. It is not fully- mitigated by people trying to be \"better\" so it has to be fixed on a system level.<br><br>Since I started this topic of checking in about Jacy, I'm becoming more sure that Jacy did some serious things, but I'm also becoming less sure we can judge actors like SFF for attempting to collaborate anyway <i>in cases of non-transparency</i>. Jeff K just <a href=\"https://www.jefftk.com/p/decentralized-exclusion\">wrote a good and short piece about this</a> a couple days ago. I see 4 <i>possible</i> cases here:</p><ol><li>\"The Community Health Team does not have adequate systems for potential collaborators to doublecheck if actors like Jacy are okay to collaborate with today.\"&nbsp;<ol><li>If this is true it implies that systems should be put in place around crosschecking, because with time we should expect people's will to keep ostracizing to degrade, and this might otherwise mean too-soon reintroduction of the accused.&nbsp;</li><li>IMO this should include asking victims, at time of reporting, if people who might need the info can contact them and noting this.</li><li>I think it would also include ethically informing victims that without coming forward publically OR offering corroboration in private, that after some time has passed their claims may be discounted, not fully-discounted, despite the CH team's best efforts. I would want to be informed of this \"bug of social reality\" when reporting so I can be informed going in of what might happen and make the decision I think is best.</li></ol></li><li>\"The CH Team does have systems for ensuring those who need to crosscheck info and plans can do so, <i>but</i> this isn't well-enough-known, such that SFF didn't use it because they didn't realize they could.\"&nbsp;<ol><li>This would imply more publication of this option is needed</li><li>This should include mandating that \"crosschecking is an option for potential collaborators in need\" be attached to any public apology made after a CH Team investigation, like Jacy's apology.</li></ol></li><li>\"The CH Team does have adequate systems for ensuring those who need to crosscheck info and plans can do so, and SFF knew they could use CH Team systems for doublechecking Jacy's safety, but SFF didn't use it because [they didn't think it was worth it or want to or something like that.]\"<ol><li>This would reflect very badly on SFF management and they should be reprimanded and coached to do better, at a minimum (even if SFF is not technically EA if they are making decisions that put EAs at risk, PR-wise and safety-wise, we should try to prompt them to do better).</li></ol></li><li>\"The CH Team does have adequate systems for ensuring those who need the info and plans can do so, and SFF did so and determined that Jacy was safe to work with\"<ol><li>If this is the case, I would want to see it noted in SFF's grant report and a few details.</li></ol></li></ol><p>I'm pretty sure multiple of these possibilities can be ruled out by the people in the know, or even random people who do a little digging, but I'm burned out on it for now.</p>", "parentCommentId": "62qwgKjjXH35QGZpJ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "S7eKGJdsNvG28FKHK", "postedAt": "2023-03-16T18:43:49.644Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I needed to walk away from this thread due to some unrelated stressful drama at work, which seems to have resolved earlier this week. So I took today off to recover from it. :) I wanted to return to this in part to point out what I think are some potential cruxes, since I expect some of the same cruxes will continue to come up in further discussions of these topics down the road.</p><p>1. I think we may have different assumptions or beliefs about the credibility of internal data-gathering versus independent data-gathering. &nbsp;Although the review into handling of the Owen situation is being handled by an outside firm, I don't believe the broader inquiry you linked is.</p><p>I generally don't update significantly on internal reporting by an organization which has an incentive to paint a rosy picture of things. That isn't anti-CEA animus; I feel the same way about religious groups, professional sports leagues, and any number of other organizations/movements.</p><p>In contrast, an outside professional firm would bring much more credibility to assessing the situation. If you want to get as close as ground truth as possible, you don't want someone with an incentive to sell more newspapers or someone hostile to EA -- but you also don't want those researching and writing the report to be <i>favorably </i>inclined to EA either. If the truth is the goal, those involved shouldn't be even unconsciously influenced by the potential effect of the report on EA. This counts for double after the situation with Owen wasn't managed well.</p><p>Conditional on the news articles being inaccurate and/or overstated, an internal review is a much weaker shield with which to defend EA against misrepresentations in the public sphere because the public has to decide how much to trust inside researchers/writers. An outside firm also allows people to come forward who do not want to reveal their identities to any EA organization, and brings specialized expertise in data collection on sensitive topics that is unlikely to be available in-house.</p><p>As I see it, the standard practice in situations like this is to bring in a professional, independent, and neutral third party to figure out what is going on. For example, when there were allegations of sexual misconduct in the Antarctic research community, the responsible agencies brought in an independent firm to conduct surveys, do interviews, and the like. The report is <a href=\"https://www.nsf.gov/geo/opp/documents/USAP%20SAHPR%20Report.pdf\">here.</a></p><p>Likewise, one of the churches in the group of 15-20 churches I attend discovered a sexual predator in its midst. Everyone who attended any of the 15-20 churches was given the contact information for an independent investigative firm and urged to share any information or concerns about other possible misconduct anywhere in the group. The investigative firm promised that no personally-identifiable information would be released to the church group without the reporter's permission (although declining permission would sharply limit the action the church could take against any wrongdoer). The group committed, in advance, to releasing the independent investigative report with redactions only to protect the identities of survivors and witnesses. &nbsp;Those steps built credibility with me that the group of churches was taking this seriously and that the public report would be a full and accurate reflection on what the investigators found.</p><p>2. Based on crux 1, I suspect people may be trying to answer different questions based on this article. If one expects to significantly update on the CEA data gathering, a main question is whether there is enough information to warrant taking significant actions <i>now</i> on incomplete information rather than waiting for information to assist in making a more accurate decision. If one doesn't expect to significantly update on that data gathering, a main question is whether there is enough information to warrant pursuing independent information gathering. The quantum of evidence needed seems significantly higher for the first question than the second. (Either formulation is consistent with taking actions now that should be in undertaken no matter what additional data comes in, or actions where the EV is much greater than the costs.)</p>", "parentCommentId": "5bsyWyCfFgc3cE5LC", "user": {"username": "Jason"}}, {"_id": "YnPmjiBGwy2W8QknY", "postedAt": "2023-03-16T21:42:28.665Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thanks for coming back. Hm in my mind, yes if all you are doing is handling immediate reports due to an acute issue (like the acute issue at your church), then yes a non-EA contractor makes sense. However if you want things like ongoing data collection and incident collection for ~the rest of time, it does have to be actually collected within or near to the company/CEA, enough that they and the surveyor can work together. <s>Why would you</s> It seems bad [and risky] to keep the other company on payroll forever and never actually be the owner of the data about your own community?&nbsp;<br><br>Additionally I don't trust non-EAs to build a survey that really gives survey respondents the proper choices to select. I think data-collection infrastucture such as a survey should be designed by someone who understands the \"shape\" and \"many facets\" of the EA community very well so as to not miss things. Because it is quite the varied community. In my mind, you need optional questions about work settings, social setting, conference settings, courses, workshops, and more. And each of these requires an understanding of what can go wrong in that particular setting, and you will want to also include correlations you are looking for throughout that people can select. So I actually think, ironically, that data-collecting infrastructure and analysis by <i>non</i>-EAs will have more gaps and therefore bias (unintended or intended) than when designed by EA data analysts and survey experts.&nbsp;<br><br>That brings me to the middle option (somewhere between CEA and non-EA contract), which is what I understand CEA's CH Team to be doing based on talks/emails with Catherine: commissioning independent data collection and analysis from Rethink Priorities. RP has a skilled/educated professional survey arm. It is <i>not </i>part of Effective Ventures (CEA's parent organisation), so it is still an external investigation and bias should be minimized. If I understand correctly,<s> CEA/CH team will give over their current data to RP</s> [whoops nvm see Chatherine's comment below], and RP will build and promote a survey (and possibly other infrastructure for data-collection), and finally do their own all-encompassing data analysis without CH Team involved, [possibly but not decided yet]. That's my rough understanding as of conversation last month anyway.<br><br>I do find the question of how data will be handled to be a bit tangential to this post, and I encourage people to comment <a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\">there</a> if concerned. Though I'd actually just caution patience instead. This is a very important problem to the Community Health Team, and I hope this separation (CHT/RP) is enough for people. Personally, the only bias I'd expect Rethink Priorities [and the CH Team] to have would be to work extra hard because they'd <i>care a lot about solving the problem as best they can</i>. EAs know that as best you can requires naked, unwarped truth, as close as you can get, so I don't expect RP to be biased against finding truth at all.<br><br>Now I find myself considering, \"Well, what if RP isn't separate enough for people, and they want a non-EA investigator, <i>despite</i> risk that non-EAs won't understand the culture well enough for investigating cultural problems?\".... And idk, maybe people will feel that way. But then I feel incredible concern and confusion: I would honestly wonder if there is any hope of building resilient trust between EAs and EA institutions at all. If some EA readers don't trust <i>other</i> skilled EAs to try really hard (and competently) to find the truth and good solutions in our own community, idk what to say. It's hard to imagine myself staying in EA if I thought that way. Hopefully no readers here do think that, hopefully readers think RP separation is enough, as I do, but idk, just making my thoughts known.</p>", "parentCommentId": "S7eKGJdsNvG28FKHK", "user": {"username": "Ivy_Mazzola"}}, {"_id": "vjn8GKkeYMbWjktQ4", "postedAt": "2023-03-17T16:45:04.608Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I realized I missed the bit where you talk about how we might not need such intense data to respond now. Yes, I agree with that. I personally expect that most community builders/leaders are already brainstorming ideas, and even implementing them, to make their spaces better for women. I also expect that most EA men will be much more careful moving forward to avoid saying or doing things which can cause discomfort for women. We will see what comes of it. Actually I'm working on a piece about actions individuals can take now... maybe I will DM it to ya with no pressure at all o.o</p>", "parentCommentId": "S7eKGJdsNvG28FKHK", "user": {"username": "Ivy_Mazzola"}}, {"_id": "WJt9wpBpTWEnCABHc", "postedAt": "2023-03-17T19:45:48.496Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Thanks Ivy and Jason for your thoughts on internal and external investigations of problems of sexual misconduct in EA.</p><p>There are a few different investigation type things going on at the moment, and some of them aren’t fully scoped or planned. So it is a bit confusing. To clarify, this is where we are at right now:</p><ol><li>Catherine, Anu and Lukasz from the Community Health team are<a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\"><u> investigating the experiences of women and gender minorities in EA</u></a>.&nbsp;<ol><li>Analysing existing data sources (in progress - Rethink Priorities has kindly given us some (as yet) unpublished data from the 2022 Survey to help with this step)</li><li>We are considering gathering and analysing more data about the experiences of women and gender minorities in EA, and have talked with Rethink Priorities about whether and how they could help. Nothing has been decided yet. To clarify a statement in Ivy’s comment though, we’re not planning to hand over any information we have (e.g. survey data from EAG(x)s or information about sexual misconduct cases raised to our team) to Rethink Priorities as part of this process.&nbsp;&nbsp;&nbsp;</li></ol></li><li>The EV board has&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation\"><u>commissioned an external investigation</u></a> by an independent law firm into Owen’s behaviour and the Community Health team’s response.</li><li>The Community Health team are doing our own internal review into our handling of the complaints about Owen and our overall processes for dealing with complaints and concerns. More information about this&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=CRdikDzzK2z92GLSs\"><u>here</u></a>.</li></ol>", "parentCommentId": "YnPmjiBGwy2W8QknY", "user": {"username": "cafelow"}}, {"_id": "knGidkrxjkJpodo5R", "postedAt": "2023-03-19T22:54:51.464Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>First, I want to broadly agree that distant information is less valuable, and no one should be judged by their college behavior forever. I learned about the Brown accusation (with some additional information, that I lack permission to pass on, and also don't know the source well enough to pass it on) in 2016 and did nothing beyond talking to the person and passing it on to Julia*, specifically &nbsp;because I didn't want a few bad choices while young to haunt someone forever.</p><p>[*It's been a while, I can't remember whether I told Julia or encouraged the other person to do so, but she got told one way or another]</p><p>The reason I think the college accusations are relevant is that, while I tentatively agree he shouldn't face more consequences for the college accusations, they definitely speak to Ariel's claim there's been no recidivism, and in general they shift my probability distribution over what he was apologizing for.</p><p>I don't necessarily think these concerns should have prevented the grant, or that SFF has an obligation to explain to me why they gave the grant. I wouldn't have made that grant, for lots of reasons, but that's fine, and I generally think the EA community acts too entitled around private grantmakers.&nbsp;</p><p>But I do think that confidently asserting that the only thing Jacy did was \"ask some people out over FB messenger\" is likely inaccurate, and it is important to track that. It might be accurate to say \"the only thing he has been publicly accused of is asking people out\" or \"the only thing he has admitted to is asking people out\" or \"No one has provided any proof he did anything beyond ask people out\", &nbsp;but none of those are the same as \"the only thing he did is ask people out\". &nbsp;</p><p>Or there could have been new information I missed, which is why I phrased it as a question.&nbsp;</p><p>I'm leaving a lot of your comment unresponded to because I think you're refuting the claim that the college accusations mean Jacy shouldn't have gotten the SFF grant, and I agree with that and never meant to imply otherwise. I just want to separately track what Jacy actually did, and what has been publicly acknowledged. &nbsp;Rereading the thread now I see why it didn't come across that way; I'm pretty sure I read Ariel's comment in the front page feed without realizing it was a response to something else.&nbsp;</p>", "parentCommentId": "jhATDsEzp6D3CANP2", "user": {"username": "Elizabeth"}}, {"_id": "PvCd7PEo4Yonx5XBN", "postedAt": "2023-03-20T16:06:47.415Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I think that most of your comment is reasonable, so I'm only going to respond to the second-to-last paragraph. Because that is the bit that critiques my comment, my response is going to sound defensive. But I agree with everything else, and I also think what went on with my original comment leads <i>back</i> into what I see as the actual crux, so it's worth me saying what's on my mind:</p><blockquote><p>But I do think that confidently asserting that the only thing Jacy did was \"ask some people out over FB messenger\" is likely inaccurate, and it is important to track that. It might be accurate to say \"the only thing he has been publicly accused of is asking people out\" or \"the only thing he has admitted to is asking people out\" or \"No one has provided any proof he did anything beyond ask people out\", &nbsp;but none of those are the same as \"the only thing he did is ask people out\". &nbsp;</p></blockquote><p>I have long ago edited the original comment where I wrote that. I didn't change that particular wording because I wrote the original on mobile (which I deeply regretted and am now incredibly averse to) so I didn't have fancy strikethrough edit features, even when I tried on PC (I didn't realize it worked like that). Without strikethrough ability, I thought it would be epistemically dishonest to just edit that sentence. Instead I promptly, right after that sentence, <i>told people to make their conclusions elsewhere</i> in a way that I feel clearly tells readers to take that part with a grain of salt. All in all I edited that comment ~5 times. I don't have the spoons to re-edit again given I think it's fine.&nbsp;<br><br>More importantly, the <i>transparency of info</i> is obviously a problem if someone like me who usually tries to be pretty airtight on EA Forum things had to edit so much going back and forth from \"here's a thing\" to \"maybe he did worse\" to \"maybe he did less\" to \"maybe he did worse\" again. That's not okay. And now I feel like I'm getting punished for trying to do what no other outsider of the case was willing to try to do (that I saw)... figure out the ground truth [and what it means for EA behavior] <i>publicly</i>.</p><p>Honestly trying to figure out what happened regarding Jacy was a heckin nightmare with people coming out of left field about it after each correction I tried to make, including over DM (again not publicly), and giving multiple comments to comb through on multiple other posts and with their own attached threads. It's good people chimed in sharing the existence of different pieces of discussion/info that I'd guess hardly any single person knew every single bit of, but damn, I have to be honest that I'm now really frustrated about what a nightmare it was. I was trying to do a public service and it was a huge waste of time with little to glean for certain. [And some of the more interesting bits are not public and I feel very, very weird about that, even saying that I now know of (know <strong>of</strong>, not know for certain) stuff others don't and can't find out about (I can't even doublecheck myself).]&nbsp;</p><p>Was that always the expected outcome just lurking underneath the surface? If so then why would people judge SFF? I'm no longer surprised SFF just granted tbh. They saved themselves the time I wasted. I no longer expect any single person to get it right and I <strong>see that as a problem worth talking about</strong> because<i> </i>that <i>will</i> lead to either (1) actually-abusive people getting involvement sooner which is a safety risk, or (2) appearing-abusive-but-actually-non-abusive people getting involvement sooner which is a PR-risk and comfort risk.&nbsp;</p><p>I apologize for fucking up. I am now frustrated at myself for even trying. But if people other than me care about my messed up original comment they need to look at the systems because other people <i>will </i>fuck up as I did. It just won't be public til after the decision is made, if ever. And you won't get to correct them as they make their fumbles along the way.&nbsp;</p>", "parentCommentId": "knGidkrxjkJpodo5R", "user": {"username": "Ivy_Mazzola"}}, {"_id": "bniyEYCTXEuTGy7SW", "postedAt": "2023-03-20T18:45:41.294Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Any competent outside firm would gather input from stakeholders before releasing a survey. But I hear the broader concern, and note that some sort of internal-external hybrid is possible. The minimal level of outside involvement, to me, would involve serving as a data guardian, data pre-processor, and auditor-of-sorts. This is related to the two reasons I think outside involvement is important: external credibility, and respondent assurance.</p><p>As far as external validity, I think media reports like this have the capacity to do significant harm to EA's objectives. Longtermist EA remains, on the whole, more talent-constrained and influence-constrained than funding-constrained. The adverse effect on talent joining EA could be considerable. Social influence is underrated; for example, technically solving AI safety might not actually accomplish much without the ability to socially pressure corporations to adopt effective (but profit-reducing) safety methods or convince governments to compel them to do so.</p><p>When the next article comes out down the road, here's what I think EA would be best served by being able to say if possible:</p><p><i>(A) According to a study overseen by a respected independent investigator, the EA community's rate of sexual misconduct is at most no greater than the base rate.&nbsp;</i></p><p><i>(B) We have best-in-class systems in place for preventing sexual misconduct and supporting survivors, designed in connection with outside experts. We recognize that sexual misconduct does occur, and we have robust systems for responding to reports and taking the steps we can to protect the community. There is independent oversight over the response system.</i></p><p><i>(C) Unfortunately, there isn't that much we can do about problematic individuals who run in EA-adjacent circles but are unaffiliated with institutional EA.</i></p><p>(A) isn't externally credible without some independent organization vouching for the analysis in some fashion. In my view, (B) requires at some degree of external oversight to be externally credible after the Owen situation, but that's another story. Interestingly, I think a lot of the potential responses are appropriate <i>either </i>as defensive measures under the \"this is overblown reporting by hostile media outlets\" hypothesis or \"there is a significant problem here\" hypothesis. &nbsp;I'd like to see at least funding and policy commitments on some of those initatives in the near term, which would reduce the time pressure on other initiatives for which there is a good chance that further datagathering would substantially change the desirability, scope, layout, etc.</p><p>I think one has to balance the goal of external credibility against other goals. But moving the research to (say) RP as opposed to CEA wouldn't move the external-credibility needle in any appreciable fashion.</p><p>The other element here is respondent assurance. Some respondents, especially those no longer associated with EA, may be more comfortable giving responses if the initial data collection itself and any necessary de-identification is done by an outside organization. (It's plausible to me that the combination of responses in a raw survey response could be uniquely identifying.)&nbsp;</p><p>Ideally, you would want to maximize the number of survivors who would be willing to confidentally name the person who committed misconduct. This would allow the outside organization to do a few things that would address methodological concerns in the Time article. First, it could identify perpetrators who had committed misconduct against multiple survivors, avoiding the incorrect impression that perpetrators were more numerous than they were. Second, it could use pre-defined criteria to determine if the perpetrator was actually an EA, again addressing one of the issues with the Time article. Otherwise, you end up with a numerator covering all instances in which someone reports misconduct by someone they identified as an EA . . . but use narrower criteria to develop the denominator, leading to an inflated figure. It would likely be legally safer for CEA to turn over its event-ban list to the outside organization under an NDA for very limited purposes than it would be to turn it over to RP. &nbsp;That would help another criticism of the Time article, that it failed to address CEA's response to various incidents.</p><p>Contingent on budget and maybe early datagathering, I would consider polling men too about things like attitudes associated with rape culture. Surveying or focusing-grouping people about deviant beliefs and behaviors (I'm using \"deviant\" here as sociologists do), not to mention their own harassment or misconduct, is extremely challenging to start with. You need an independent investigator with ironclad promises of confidentiality to have a chance at that kind of research. But then again, it's been almost 20 years since my somewhat limited graduate training in social science research methods, so I could be wrong on this.</p>", "parentCommentId": "YnPmjiBGwy2W8QknY", "user": {"username": "Jason"}}, {"_id": "ftogorYua6RJBTQGN", "postedAt": "2023-03-21T01:16:35.973Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>I'm sorry. it sounds like you've taken a lot of flak for that comment, and having had that same experience I know it's miserable. &nbsp;FWIW I was never responding to or criticizing your comment, only Ariel's. Probably I saw it in the front page feed without checking the larger context. Or I only skimmed your comment and didn't notice he was repeating a claim.&nbsp;</p><p>Plausibly I'm culpable for not noticing it was a repeated claim rather than original. Maybe the way comments are displayed on the front page with minimal context contributed.&nbsp;</p>", "parentCommentId": "PvCd7PEo4Yonx5XBN", "user": {"username": "Elizabeth"}}, {"_id": "fsfuuDr7zZwg5eTHH", "postedAt": "2023-03-28T04:11:30.809Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>Yes, this kind of 'idle conjecture' seems epistemically risky. It's too easy to invent reasons that point in any particular direction.</p>", "parentCommentId": "4tLysYkuEgYXFy4GJ", "user": {"username": "Kenny"}}, {"_id": "mWLrgCCR7o7RSu79q", "postedAt": "2023-03-28T04:22:07.500Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": "<p>It <i>is</i> a shame – and I would guess a very deliberate one.</p><p>I've been a user on LessWrong for a long time and these events have resurfaced several times that I remember already, always instigated by something like this article, and many people discovering the evidence and allegations about them jumps to the conclusion that 'the community' needs to do some \"soul searching\" about it all.</p><p>And this recurring dynamic is extra frustrating and heated because the 'community members', including people that are purely/mostly just users of the site, aren't even the same group of people each time. Older users try to point out the history and new users sort themselves into warring groups, e.g. 'this community/site is awful/terrible/toxic/\"rape culture\"' or 'WTF, I had nothing to do with this!?'.</p><p>Having observed several different kinds of 'communities' try to handle this stuff, rationality/LessWrong and EA groups are – far and away – <i>much</i> better at actually effectively addressing it than anyone else.</p><p>People should almost certainly remain vigilant against bad behavior – as I'm sure they are – but they should also be proud of doing as good of a job as they have, especially given how hard of a job it is.</p>", "parentCommentId": "cPkiefYziTfJTi7k5", "user": {"username": "Kenny"}}, {"_id": "r9kC3C6jMhC2QokCz", "postedAt": "2023-03-08T00:43:38.789Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": null, "parentCommentId": "54auSKkkbCqkdpPTk", "user": null}, {"_id": "obocacaz745ngLysk", "postedAt": "2023-03-08T06:19:17.366Z", "postId": "7b9ZDTAYQY9k6FZHS", "htmlBody": null, "parentCommentId": null, "user": null}]