[{"_id": "y6eYzof5HWa2xEM6i", "postedAt": "2022-11-24T18:24:39.833Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>May also be worth crossposting to LessWrong, since you might get more readers and engagement there.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "9ofh4de9cqhPjHvtE", "postedAt": "2022-11-24T20:01:44.370Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<blockquote><p><strong>Intelligence 1:</strong> Individual cognitive abilities.</p><p><strong>Intelligence 2:</strong> The ability to achieve a wide range of goals.</p></blockquote><p>Eliezer Yudkowsky means Intelligence 2 when he talks about general intelligence. e.g., He proposed \"<a href=\"https://www.lesswrong.com/posts/yLeEPFnnB9wE7KLx2/efficient-cross-domain-optimization\">efficient cross-domain optimization</a>\" as the definition in his post by that name. See the LW tag page for <a href=\"https://www.lesswrong.com/tag/general-intelligence\">General Intelligence</a> for more links &amp; discussion.</p>", "parentCommentId": null, "user": {"username": "Dan_Keys"}}, {"_id": "oqjZ8kzt6TYfmrui8", "postedAt": "2022-11-24T23:04:41.766Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Eliezer’s threat model is “a single superintelligent algorithm with at least a little bit of ability to influence the world”. In this sentence, the word “superintelligent” cannot mean intelligence in the sense of definition 2, or else it is nonsense - definition 2 precludes “small or no ability to influence the world”.</p>\n<p>Furthermore, in recent writing Eliezer has emphasised threat models that mostly leverage cognitive abilities (“intelligence 1”), such as a superintelligence that manipulates someone into building a nano factory using existing technology. Such scenarios illustrate that intelligence 2 is not necessary for AI to be risky, and I think Eliezer deliberately chose these scenarios to make just that point.</p>\n<p>One slightly awkward way to square this with the second definition you link is to say that Yudkowsky uses definition 2 to measure intelligence, but is also very confident that high cognitive abilities are sufficient for high intelligence and therefore doesn’t always see a need to draw a clear distinction between the two.</p>\n", "parentCommentId": "9ofh4de9cqhPjHvtE", "user": {"username": "David Johnston"}}, {"_id": "d95c7WbmvQtDeF4aY", "postedAt": "2022-11-25T09:40:39.315Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>What do you think about the perspective of \"Model 2, but there's still explosive growth\"? In particular, depending on what exactly you mean by cognitive abilities, I think it's pretty plausible to believe (1) cognitive abilities are a rather modest part of ability to achieve goals, (2)<br>individual human cognitive abilities are a significant bottleneck among many others to economic and technological growth, (3) the most growth-relevant human abilities will be surpassed by machines quite continuously (<i>not&nbsp;</i> over millennia, but there isn't any one \"big discrete jump\") and (4) there will be explosive growth. (1)-(3) are your main examples of Model 2 predictions, while (4) says there's explosive growth anyway.</p><p>Some readings on this perspective:</p><ol><li><a href=\"https://www.cold-takes.com/all-possible-views-about-humanitys-future-are-wild/\">The Most Important Century series</a></li><li><a href=\"https://slatestarcodex.com/2019/04/22/1960-the-year-the-singularity-was-cancelled/\">1960: The Year the Singularity was Cancelled</a></li><li><a href=\"https://www.openphilanthropy.org/research/modeling-the-human-trajectory/\">Modeling the Human Trajectory</a></li><li><a href=\"https://www.openphilanthropy.org/research/report-on-whether-ai-could-drive-explosive-economic-growth/\">Report on Whether AI Could Drive Explosive Economic Growth</a> (you mention this one but don't really talk about the hyperbolic growth model, just the conclusions)</li></ol><p>In particular I think most of your arguments for Model 2 also apply to this perspective. The one exception is the observation that growth rates are declining, though this perspective would likely argue that this is because of the demographic transition, which breaks the positive feedback loop driving hyperbolic growth. (Not sure about the last part, haven't thought it through in detail.)</p>", "parentCommentId": null, "user": {"username": "rohinmshah"}}, {"_id": "MAGurAs9x7ugniX4h", "postedAt": "2022-11-25T21:15:51.697Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>One objection to the “more AI -&gt; more growth” story is that it’s quite plausible that people still participate in an AI driven economy to the extent that they decide what they want, and this could be a substantial bottleneck to growth rates. Speeds of technological adoption do seem to have increased (<a href=\"https://www.visualcapitalist.com/rising-speed-technological-adoption/\">https://www.visualcapitalist.com/rising-speed-technological-adoption/</a>), but that doesn’t necessarily mean they can indefinitely keep pace with AI driven innovation.</p>\n", "parentCommentId": "d95c7WbmvQtDeF4aY", "user": {"username": "David Johnston"}}, {"_id": "kyLHchgf3E93RKkPe", "postedAt": "2022-11-25T21:23:26.876Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Thanks for your question :)</p><p>I might write a more elaborate comment later, but to give a brief reply:</p><p>It’s true that Model 2 (defined in terms of those three assumptions) does not rule out significantly higher growth rates, but it does, I believe, make explosive growth quite a lot less likely compared to Model 1, since it does not imply that there’s a single bottleneck that will give rise to explosive growth.</p><blockquote><p>I think most of your arguments for Model 2 also apply to this perspective. The one exception is the observation that growth rates are declining, though this perspective would likely argue that this is because of the demographic transition, which breaks the positive feedback loop driving hyperbolic growth.</p></blockquote><p>I think most of the arguments I present in the section on <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Why_I_consider_Model_2_most_plausible\">why I consider Model 2 most plausible</a> are about declining growth along various metrics. And many of the declining trends appear to have little to do with the demographic transition, especially those presented in the section “<a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Many_key_technologies_only_have_modest_room_for_further_growth\">Many key technologies only have modest room for further growth</a>”, as well as the apparent <a href=\"https://magnusvinding.com/2021/06/07/reasons-not-to-expect-a-growth-explosion/#rates-of-innovation-and-progress-in-science-have-slowed-down\">decline</a> in innovations per capita.</p>", "parentCommentId": "d95c7WbmvQtDeF4aY", "user": {"username": "MagnusVinding"}}, {"_id": "AqXkBaFeM5tr9XG3c", "postedAt": "2022-11-26T16:04:45.610Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>As I understand it your argument is \"Even if AI could lead to explosive growth, we'll choose not to do it because we don't yet know what we want\". This seems pretty wild, does literally no one want to make tons of money in this scenario?</p>", "parentCommentId": "MAGurAs9x7ugniX4h", "user": {"username": "rohinmshah"}}, {"_id": "QzZq2fb4tg7JP4F4a", "postedAt": "2022-11-26T16:14:56.980Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<blockquote><p>I think most of the arguments I present in the section on why I consider Model 2 most plausible are about declining growth along various metrics.</p></blockquote><p>Yes, sorry, I shouldn't have said \"most\".</p><blockquote><p>especially those presented in the section “<a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Many_key_technologies_only_have_modest_room_for_further_growth\">Many key technologies only have modest room for further growth</a>”</p></blockquote><p>Yeah, I mostly don't buy the argument (sorry for not noting that earlier). It's not the case that there are N technologies and progress consists solely of improving those technologies; progress usually happens by developing new technologies. So I don't see the fact that some technologies are near-perfect as all that relevant. For example:</p><blockquote><p>“Electric motors, pumps, battery charging, hydroelectric power, electricity transmission — among many other things — operate at near perfect efficiency (often around 90%).”</p></blockquote><p>Even if we get literally no improvement in any of these technologies, we could still see huge growth in this sector by developing new technologies for energy generation that generate much more power than we can currently generate.</p>", "parentCommentId": "kyLHchgf3E93RKkPe", "user": {"username": "rohinmshah"}}, {"_id": "a5gqn4uPwuAktDuBZ", "postedAt": "2022-11-26T21:48:55.782Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>I don’t think your summary is wrong as such, but it’s not how I think about it.</p>\n<p>Suppose we’ve got great AI that, in practice, we still use with a wide variety of control inputs (“make better batteries”, “create software that does X”). Then it could be the case - if AI enables explosive growth in other domains - that “production of control inputs” becomes the main production bottleneck.</p>\n<p>Alternatively, suppose there’s a “make me a lot of money” AI and money making is basically about making stuff that people want to buy. You can sell more stuff that people are already known to want - but that runs into the limit that people only want a finite amount of stuff. You could alternatively sell new stuff that people want but don’t know it yet. This is still limited by the number of people in the world, how often each wants to consider adopting a new technology and what things someone with life history X is actually likely to adopt and how long it takes them to make this decision. These things seem unlikely to scale indefinitely with AI capability.</p>\n<p>This could be defeated by either money not being about making stuff people want - which seems fairly likely, but in this case I don’t really know what to think - or AI capability leading to (explosive?) human population expansion.</p>\n<p>In defence of this not being completely wild speculation: advertising already comprises a nontrivial fraction of economic activity and seems to be growing faster than other sectors <a href=\"https://www.statista.com/statistics/272443/growth-of-advertising-spending-worldwide/\">https://www.statista.com/statistics/272443/growth-of-advertising-spending-worldwide/</a></p>\n<p>(Although only a small fraction of advertising is promoting the adoption of new tech)</p>\n", "parentCommentId": "AqXkBaFeM5tr9XG3c", "user": {"username": "David Johnston"}}, {"_id": "KrcquSSQxxJx8YRKc", "postedAt": "2022-11-27T08:14:42.909Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>I don't disagree with anything you've written here, but I'm not seeing why the limits they impose are anywhere close to where we are today.</p>", "parentCommentId": "a5gqn4uPwuAktDuBZ", "user": {"username": "rohinmshah"}}, {"_id": "E4XXiqvGyZCE2hQNc", "postedAt": "2022-11-27T11:03:58.213Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>We might just be talking past each other - I’m not saying this is a reason to be confident explosive growth won’t happen and I agree it looks like growth could go much faster before hitting any limits like this. I just meant to say “here’s a speculative mechanism that could break some of the explosive growth models”</p>\n", "parentCommentId": "KrcquSSQxxJx8YRKc", "user": {"username": "David Johnston"}}, {"_id": "6T35KuiLwzKAqrDSf", "postedAt": "2022-11-27T12:11:36.080Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Ah fair enough. In that case I agree.</p>", "parentCommentId": "E4XXiqvGyZCE2hQNc", "user": {"username": "rohinmshah"}}, {"_id": "ybkbBddDyD8pe8vmj", "postedAt": "2022-11-27T19:20:37.117Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Interesting post. I recently asked the <a href=\"https://forum.effectivealtruism.org/posts/aCY7sjbWKYNPJDcbj/graph-of-of-tasks-ai-is-superhuman-at\">question </a>whether anyone had quantified the percent of tasks that computers are superhuman at as a function of time - has anyone?</p><p>A lot of the decline in global GDP growth rate is due to lower population growth rate. But it is true that the GDP per capita growth in “frontier” (developed) countries has been falling.</p><blockquote><p>“Electric motors, pumps, battery charging, hydroelectric power, electricity transmission — among many other things — operate at near perfect efficiency (often around 90%).”</p></blockquote><p>This is seriously cherry picked. Anders Sandberg is writing a book called <i>Grand Futures</i>, and he talks about where fundamental limits lie. In almost all cases, we are far away from fundamental limits. For instance, if it is 10°C colder outside than inside, the fundamental limit on efficiency of a heat pump is about 3000% (coefficient of performance of 30). However, we are now at around a coefficient of performance of four. The conversion of solar energy to food is around 0.1% efficient for the typical field, and an order of magnitude lower than that for animal systems. Comminution (breaking up rock) is only about <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0892687507003573\">1% efficient</a>.</p><blockquote><p>This decline is arguably what one would expect given the predicted <a href=\"https://magnusvinding.com/2021/06/07/reasons-not-to-expect-a-growth-explosion/#moore-s-law-is-coming-to-an-end\">end</a> of Moore’s law, projected to hit the ceiling <a href=\"https://en.wikipedia.org/wiki/Moore's_law#Forecasts_and_roadmaps\">around</a> 2025. In particular, in approaching the end of Moore’s law, we should arguably expect progress to steadily decline as we get closer to the ceiling, rather than expecting a sudden slowdown that only kicks in once we reach 2025 (or thereabout).</p><p>Progress on other measures has also greatly slowed down, such as processor <a href=\"https://www.economist.com/technology-quarterly/2016-03-12/after-moores-law\">clock speeds</a>, the cost of hard drive storage (cf. <a href=\"https://en.wikipedia.org/wiki/Mark_Kryder#Kryder's_law_projection\">Kryder’s law</a>), and computations per joule (cf. <a href=\"https://en.wikipedia.org/wiki/Koomey's_law\">Koomey’s law</a>).</p></blockquote><p>Irreversible computing could be about <a href=\"https://www.osti.gov/servlets/purl/1458032\">five </a>orders of magnitude more efficient than what we do now, and reversible computing could be many orders of magnitude more efficient than that.</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "Mpsdj3TKGaknRcH89", "postedAt": "2022-12-01T19:58:36.960Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Thanks :)</p><blockquote><p>I recently asked the <a href=\"https://forum.effectivealtruism.org/posts/aCY7sjbWKYNPJDcbj/graph-of-of-tasks-ai-is-superhuman-at\">question </a>whether anyone had quantified the percent of tasks that computers are superhuman at as a function of time - has anyone?</p></blockquote><p>I'm not aware of any. Though I suppose it would depend a lot on how such a measure is operationalized (in terms of which tasks are included).</p><blockquote><p>This is seriously cherry picked.</p></blockquote><p>I quoted that line of Murphy's as one that provides examples of key technologies that are close to hitting ultimate limits; I didn't mean to say that they were representative of all technologies. &nbsp;:)</p><p>But it's worth noting that more examples of technologies that cannot be improved that much further are provided in Gordon's <a href=\"https://www.goodreads.com/book/show/26634594-the-rise-and-fall-of-american-growth\"><i>The Rise and Fall of American Growth</i></a> as well as in Murphy's <a href=\"https://dothemath.ucsd.edu/2011/07/can-economic-growth-last/\">article</a>. Another example of a limit we've hit is the speed at which we communicate information around Earth, where we also hit the limit (the speed of light) many decades ago. That's a pretty significant step that cannot be repeated, which of course isn't so say that there isn't still much room for progress in many other respects.</p><p>On the second point, I was referring to empirical trends we're observing, as well as a theoretical ceiling within the hardware paradigm that has been dominant for the last several decades. It is quite thinkable — though hardly guaranteed — that other paradigms will eventually dominate the silicon paradigm as we know it, which gives us some reason to believe that we might see even faster growth in the future. But I don't think it's a strong reason in light of the recent empirical trends and the not <i>that</i> far-off distance to the ultimate limits to computation.</p>", "parentCommentId": "ybkbBddDyD8pe8vmj", "user": {"username": "MagnusVinding"}}, {"_id": "JF3yus8gAkm3fpF9m", "postedAt": "2022-12-01T20:55:41.044Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<blockquote><p>It's not the case that there are N technologies and progress consists solely of improving those technologies; progress usually happens by developing new technologies.</p></blockquote><p>Yeah, I agree with that. :)</p><p>But I think we can still point to some important underlying measures — say, \"the speed at which we transmit signals around Earth\" or \"the efficiency with which we can harvest solar energy\" — where there isn't much room for further progress. On the first of those two measures, there basically isn't any room for further progress. On the second, we can at the very most see ~a doubling from where we <a href=\"https://en.wikipedia.org/wiki/Solar-cell_efficiency#/media/File:Best-research-cell-efficiencies-rev220126_pages-to-jpg-0001.jpg\">currently are</a>, whereas we have seen more than a 40x increase since the <a href=\"https://en.wikipedia.org/wiki/Timeline_of_solar_cells\">earliest</a> solar cells in the late 1800s. Those are some instances of progress that cannot be repeated (within those domains), even if we create new technologies within these domains.</p><p>Of course, there may be untapped domains that could prove similarly significant for growth. But I still think the increasing number of domains in which past growth accomplishments cannot be repeated provides a modest reason to doubt a future growth explosion. As noted, I don't think any of the reasons I listed are strong in themselves, but when combined with the other reasons, including the <a href=\"https://magnusvinding.com/2021/06/07/reasons-not-to-expect-a-growth-explosion/#rates-of-innovation-and-progress-in-science-have-slowed-down\">decline</a> in innovations per capita, recent <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#The_fastest_supercomputers_and_other_hardware_measures\">empirical trends</a> in hardware progress, the relatively <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#An_unprecedented_decline_in_economic_growth_rates_across_doublings\">imminent limits</a> in the growth of information processing (less than 250 years at current growth rates), and the point about the potential difficulties of explosive growth given limited efficiency gains I made <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#fnmulm6bdfxvo\">here</a>, I do think a growth explosion begins to look rather unlikely, especially one that implies &gt;1000 percent annual growth (corresponding to an economy that doubles ~every three months or faster).</p>", "parentCommentId": "QzZq2fb4tg7JP4F4a", "user": {"username": "MagnusVinding"}}, {"_id": "uiQHxzmgMMk4ccKfH", "postedAt": "2022-12-02T16:53:49.071Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>You're trying to argue for \"there are no / very few important technologies with massive room for growth\" by giving examples of specific things without massive room for growth.</p><p>In general arguing for \"there is no X that satisfies Y\" by giving examples of individual Xs that don't satisfy Y is going to be pretty rough and not very persuasive to me, unless there's some reason that can be abstracted out of the individual examples that is likely to apply to all Xs, which I don't see in this case. I don't care much whether the examples are technologies or measures (though I do agree measures are better).</p><p>(I'm also less convinced because I can immediately think of related measures where it seems like we have lots of room to grow, like &nbsp;\"the speed at which we can cost-effectively transmit matter around Earth\" or \"the efficiency with which we can harvest fusion energy\".)</p><p>For similar reasons I don't update much on empirical trends in hardware progress (there's still tons of progress to be made in software, and still tons of progress to be made in areas other than computing).</p><p>I agree that explosive growth looks unlikely without efficiency gains; \"no efficiency gains\" means that the positive feedback loop that drives hyperbolic growth isn't happening. (But for this to move me I need to believe \"no/limited efficiency gains\".)</p><p>I think the decline in innovations per capita is the strongest challenge to this view; I just don't really see the others as significant evidence one way or the other.</p>", "parentCommentId": "JF3yus8gAkm3fpF9m", "user": {"username": "rohinmshah"}}, {"_id": "QfY68Hs9dBgW2RkvK", "postedAt": "2022-12-13T20:10:12.445Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<blockquote><p>You're trying to argue for \"there are no / very few important technologies with massive room for growth\" by giving examples of specific things without massive room for growth.</p></blockquote><p>I should clarify that I’m not trying to argue for that claim, which is not a claim that I endorse.</p><p>My view on this is rather that there seem to be several key technologies and measures of progress that have very limited room for further growth, and the ~zero-to-one growth that occurred along many of these key dimensions seems to have been low-hanging fruit that coincided with the high growth rates that we observed around the mid-1900s. And I think this counts as modest evidence against a future growth explosion.</p><p>That is, my sense from reading <a href=\"https://www.goodreads.com/book/show/26634594-the-rise-and-fall-of-american-growth\">Gordon</a> and others is that the high growth rates of the 20th century were in large part driven by a confluence of innovations across many different technological domains — innovations that people such as Gordon and <a href=\"https://en.wikipedia.org/wiki/The_Great_Stagnation\">Cowen</a> roughly describe as low-hanging innovations that are no longer (as readily) accessible. This, combined with the empirical observation that growth rates have been declining since the 1960s, and the observation that innovations per capita have decreased, seems to me convergent (albeit in itself still quite tentative) evidence in favor of the claim that we will not see explosive growth in the future, as this “low-hanging fruit picture” renders a similar — and especially a greater — such <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Many_key_technologies_only_have_modest_room_for_further_growth\">confluence of progress</a> less likely to occur again. And I would regard each of those lines of evidence to be significant. (Of course, these lines of evidence are closely related; e.g. the decline in innovations per capita might be seen as a consequence of our having already reaped the most significant innovations in many — though by no means all — key domains.)&nbsp;</p><p>I also think it’s important to distinguish 1) how much room for growth that various technologies have, and 2) how likely it is that we will see a growth explosion. My view is that we are (obviously) quite far from the ultimate limits in many domains, but that future growth will most likely be non-explosive, partly because future innovations seem much harder to reap compared to past innovations (and partly for the other reasons outlined in the post).</p><p>So while I think a future growth explosion is unlikely, I <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#fnmbm8sfw231m\">still</a> think that there is considerable room for growth in an absolute sense, even if the room for growth is <a href=\"https://www.youtube.com/watch?v=8Cnj8MIQ0HY&amp;t=2377s&amp;ab_channel=Science,Technology&amp;theFuture\">more</a> <a href=\"https://magnusvinding.com/2020/05/04/the-future-of-growth-near-zero-growth-rates/\">limited</a> than we might intuitively expect.</p>", "parentCommentId": "uiQHxzmgMMk4ccKfH", "user": {"username": "MagnusVinding"}}, {"_id": "7nuY6mprc92L6MtgY", "postedAt": "2022-12-22T04:23:46.878Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<blockquote><p>My view on this is rather that there seem to be several key technologies and measures of progress that have very limited room for further growth, and the ~zero-to-one growth that occurred along many of these key dimensions seems to have been low-hanging fruit that coincided with the high growth rates that we observed around the mid-1900s. And I think this counts as modest evidence against a future growth explosion.</p></blockquote><p>Hmm, it seems to me like these observations are all predicted by the model I'm advocating, so I don't see why they're evidence against that model. (Which is why I incorrectly thought you were instead saying that there wasn't room for much growth, sorry for the misunderstanding.)</p><p>(I do agree that declining growth rates are evidence against the model.)</p><p>At any given point in time, I expect that progress looks like \"taking the low-hanging fruit\"; the reason growth goes up over time anyway is because there's a lot more effort looking for fruit as time goes on, and it turns out that effect dominates.</p><p>For example, around 0 AD you might have said \"recent millennia have had much higher growth rates because of the innovations of agriculture, cities and trade, which allowed for more efficient food production and thus specialization of labor. The zero-to-one growth on these key dimensions was low-hanging fruit, so this is modest evidence against further increases in growth in the future\"; that would have been been an update in the wrong direction.</p>", "parentCommentId": "QfY68Hs9dBgW2RkvK", "user": {"username": "rohinmshah"}}, {"_id": "pLp7DbjE9sTmsBJR4", "postedAt": "2022-12-26T14:34:59.065Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<blockquote><p>At any given point in time, I expect that progress looks like \"taking the low-hanging fruit\"; the reason growth goes up over time anyway is because there's a lot more effort looking for fruit as time goes on, and it turns out that effect dominates.</p></blockquote><p>I think the empirical data suggests that that effect generally doesn't dominate anymore, and that it <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Global_economic_growth\">hasn't</a> dominated in the economy as a whole for the last ~3 doublings. For example, US Total Factor Productivity growth has been <a href=\"https://www.youtube.com/watch?v=x7tk2ryjefQ&amp;t=1573s&amp;ab_channel=GlobalPrioritiesInstitute-UniversityofOxford\">weakly declining</a> for several decades despite superlinear growth in the effective number of researchers.</p><p>I think the example of 0 AD is disanalogous because there wasn't a zero-to-one growth along similarly <a href=\"https://www.goodreads.com/book/show/26634594\">significant</a> and fundamental dimensions (e.g. hitting the ultimate limit in the speed of communication) followed by an <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#An_unprecedented_decline_in_economic_growth_rates_across_doublings\">unprecedented</a> growth decline that further (weakly) supports that we're past the inflection point, i.e. past peak growth rates.</p>", "parentCommentId": "7nuY6mprc92L6MtgY", "user": {"username": "MagnusVinding"}}, {"_id": "cGiF2C5NkrXudgtJL", "postedAt": "2023-04-12T13:05:22.452Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>I do not claim otherwise in the post :) My claim is rather that proponents of Model 1 tend to see a much smaller distance between these respective definitions of intelligence, almost seeing Intelligence 1 as equivalent to Intelligence 2. In contrast, proponents of Model 2 see Intelligence 1 as an important yet still, in the bigger picture, relatively modest subset of Intelligence 2, alongside a vast set of other tools.</p>", "parentCommentId": "9ofh4de9cqhPjHvtE", "user": {"username": "MagnusVinding"}}, {"_id": "vDSt4T5wjqiRzaAvW", "postedAt": "2023-04-14T14:37:43.380Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>I wrote earlier that I might write a more elaborate comment, which I'll attempt now. The following are some comments on the pieces that you linked to.</p><blockquote><p>1. <a href=\"https://www.cold-takes.com/all-possible-views-about-humanitys-future-are-wild/\">The Most Important Century series</a></p></blockquote><p>I disagree with this series in a number of places. For example, in the post \"This Can't Go On\", it says the following in the context of an airplane metaphor for our condition:</p><blockquote><p>We're going much faster than normal, and there isn't enough runway to do this much longer ... and we're accelerating.</p></blockquote><p>As argued above, in terms of economic growth rates, we're in fact not accelerating, but instead seeing an unprecedented growth <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#An_unprecedented_decline_in_economic_growth_rates_across_doublings\">decline</a> across doublings. Additionally, the piece, and the series as a whole, seems to neglect the possibility that growth rates might simply continue to decline very gradually, as they have over the last 5-6 decades.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0s295cezlbg\"><sup><a href=\"#fn0s295cezlbg\">[1]</a></sup></span></p><p>Relatedly, I would question some of the \"growth-exploding\" implications that the series implicitly assumes would follow from PASTA (\"AI systems that can essentially automate all of the human activities needed to speed up scientific and technological advancement\"). I've tried to explain some of my reservations <a href=\"https://forum.effectivealtruism.org/posts/SueEfksxDQm4Q97oK/forecasting-transformative-ai-are-we-trending-toward?commentId=6NDGECoBw9eEuRFoj\">here</a> (more on this below).</p><blockquote><p>2. <a href=\"https://slatestarcodex.com/2019/04/22/1960-the-year-the-singularity-was-cancelled/\">1960: The Year the Singularity was Cancelled</a></p></blockquote><p>This post relates to the PASTA point above; I guess the following is the key passage in this context:</p><blockquote><p>AI potentially offers a way to convert money into researchers. Money = build more AIs = more research.</p><p>If this were true, then once AI comes around – even if it isn’t much smarter than humans – then as long as the computational power you can invest into researching a given field increases with the amount of money you have, hyperbolic growth is back on. Faster growth rates means more money means more AIs researching new technology means even faster growth rates, and so on ...</p></blockquote><p>I think this is by far the most plausible conjecture as to how growth rates could explode in the future. But I still think there are good reasons to be skeptical of such an explosion. For one, an AI-driven explosion of this kind would most likely involve a corresponding explosion in hardware (e.g. for reasons gestured at <a href=\"https://www.overcomingbias.com/p/why-does-hardware-grow-like-algorithmshtml\">here</a> and <a href=\"http://www.incompleteideas.net/IncIdeas/BitterLesson.html\">here</a>), and there are both theoretical and empirical reasons to doubt that we will see such an explosion.</p><p>Indeed, growth rates are <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#The_fastest_supercomputers_and_other_hardware_measures\">declining</a> across various hardware metrics, and yet here we are not just talking about growth rates in hardware remaining at familiar levels, but presumably about an explosion in these growth rates. That seems to go against the empirical trends that we are observing in hardware, and against the impending end of Moore's law that we can predict with reasonable confidence based on theory.</p><p>Relatedly, there is the point that explosive economic growth likely would imply an explosion in energy production, but it is likewise doubtful whether progress in software/computation could unleash such an explosion (as argued <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Global_economic_growth\">here</a>). More generally, even if we made a lot of progress in both computer software and hardware, it seems likely that growth would become constrained by other factors to a degree that precludes an economic growth explosion (Bryan Caplan makes similar points in response to Hanson's <i>Age of Em</i>; see point 9 <a href=\"https://www.econlib.org/archives/2016/06/whats_wrong_in.html\">here</a>; see also Aghion et al., <a href=\"http://web.stanford.edu/~chadj/AJJ-AIandGrowth.pdf\">2019</a>, p. 260).</p><p>Moreover, as mentioned in an earlier comment, it is worth noting that the decline in growth rates that we have seen since the 1960s is not only due to decreasing population growth, as there are also other factors that have contributed, such as certain <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Many_key_technologies_only_have_modest_room_for_further_growth\">growth potentials</a> that have been exhausted, and the consequent <a href=\"https://magnusvinding.com/2021/06/07/reasons-not-to-expect-a-growth-explosion/#rates-of-innovation-and-progress-in-science-have-slowed-down\">decline</a> in innovations per capita.</p><blockquote><p>3. <a href=\"https://www.openphilanthropy.org/research/modeling-the-human-trajectory/\">Modeling the Human Trajectory</a></p></blockquote><p>One thing to notice about this model is that it conflicts with the historic <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#An_unprecedented_decline_in_economic_growth_rates_across_doublings\">decline in growth rates</a>. In particular, the model is an <a href=\"https://magnusvinding.com/2021/06/07/reasons-not-to-expect-a-growth-explosion/#three-objections-in-brief\">ever worse fit</a> with the observed growth rates of the last four decades. Roodman himself <a href=\"https://www.openphilanthropy.org/research/modeling-the-human-trajectory/#2-capturing-the-randomness-of-history\">notes</a> that his model has shortcomings in this regard:</p><blockquote><p>... recent global growth has been slower and steadier than the model predicts from previous history. ... Nevertheless, I think it is a virtue, and perhaps an inspiration for further work, that this rigorous model can quantify its own shortcomings.</p></blockquote><p>(Perhaps also see Tom Davidson's <a href=\"https://forum.effectivealtruism.org/posts/HgbAmhaAhky8SxPiv/some-thoughts-on-david-roodman-s-gwp-model-and-its-relation\">reflections</a> on Roodman's model.)</p><p>In other words, the model is not a good fit with the last 2-3 doublings of the world economy, and this is somewhat obscured when the model is evaluated across standard calendar time rather than across doublings; when looking at the model through the former lens, its recent mispredictions seem minor, but when seen across doublings — arguably the more relevant perspective — they become rather significant.</p><p>Given the historical data, it seems that a considerably better fit would be a model that predicts roughly symmetric growth rates around a peak growth rate found ca. 1960, as can be gleaned <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#An_unprecedented_decline_in_economic_growth_rates_across_doublings\">here</a> (similar points are made in Modis, <a href=\"http://www.growth-dynamics.com/articles/Singularity.pdf\">2012</a>, pp. 20-22). Such a model may be theoretically grounded in the expectation that there will be a point where innovations become increasingly harder to find. One would expect such a \"peak growth rate\" to occur at some point a priori, given the finite potential for growth (implying that the addition of a limiting factor that represents the finite nature of growth-inducing innovations would be a natural extension to Roodman's model). And empirical data then <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#An_unprecedented_decline_in_economic_growth_rates_across_doublings\">tentatively suggests</a> that this peak lies in the past. (But again, peak growth rates being in the past is still <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#fnmbm8sfw231m\">compatible</a> with increasing growth in absolute terms.)</p><blockquote><p>4. <a href=\"https://www.openphilanthropy.org/research/report-on-whether-ai-could-drive-explosive-economic-growth/\">Report on Whether AI Could Drive Explosive Economic Growth</a> (you mention this one but don't really talk about the hyperbolic growth model, just the conclusions)</p></blockquote><p>I think my main comments on this model are captured above.</p><p>Thanks again for engaging, and feel free to comment on any points you disagree with. :)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0s295cezlbg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0s295cezlbg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>E.g. when it says: \"We're either going to speed up even more, or come to a stop, or something else weird is going to happen.\" This seems to overlook the kind of future that I alluded to above, which would amount to staying at roughly the same pace, yet continuing to slow down growth rates very gradually. This is arguably not a particularly \"weird\" or \"wild\" prospect. (It's also worth nothing that the \"come to a stop\" would occur faster in the \"speed up even more\" scenario, as it would imply that we'll hit ultimate limits earlier; slower growth would imply that non-trivial growth rates end later.)</p></div></li></ol>", "parentCommentId": "d95c7WbmvQtDeF4aY", "user": {"username": "MagnusVinding"}}, {"_id": "qbRzzcntyTtTAJ9nv", "postedAt": "2023-04-15T18:45:46.244Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Thanks for this, it's helpful. I do agree that declining growth rates is significant evidence for your view.</p><p>I disagree with your other arguments:</p><blockquote><p>For one, an AI-driven explosion of this kind would most likely involve a corresponding explosion in hardware (e.g. for reasons gestured at <a href=\"https://www.overcomingbias.com/p/why-does-hardware-grow-like-algorithmshtml\">here</a> and <a href=\"http://www.incompleteideas.net/IncIdeas/BitterLesson.html\">here</a>), and there are both theoretical and empirical reasons to doubt that we will see such an explosion.</p></blockquote><p>I don't have a strong take on whether we'll see an explosion in hardware efficiency; it's plausible to me that there won't be much change there (and also plausible that there will be significant advances, e.g. getting 3D chips to work -- I just don't know much about this area).</p><p>But the central thing I imagine in an AI-driven explosion is an explosion in the <i>amount</i> of hardware (i.e. way more factories producing chips, way more mining operations getting the raw materials, etc), and an explosion in <i>software </i>efficiency (see e.g. <a href=\"https://openai.com/research/ai-and-efficiency\">here</a> and <a href=\"https://epochai.org/blog/revisiting-algorithmic-progress\">here</a>). So it just doesn't seem to matter that much if we're at the limits of hardware efficiency.</p><blockquote><p>it is worth noting that the decline in growth rates that we have seen since the 1960s is not only due to decreasing population growth, as there are also other factors that have contributed, such as certain <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Many_key_technologies_only_have_modest_room_for_further_growth\">growth potentials</a> that have been exhausted, and the consequent <a href=\"https://magnusvinding.com/2021/06/07/reasons-not-to-expect-a-growth-explosion/#rates-of-innovation-and-progress-in-science-have-slowed-down\">decline</a> in innovations per capita.</p></blockquote><p>I realize that I said the opposite in a previous comment thread, but right now it feels consistent with explosive growth to say that innovations per capita are going to decline; indeed I agree with Scott Alexander that <a href=\"https://slatestarcodex.com/2018/11/26/is-science-slowing-down-2/\">it's hard to imagine it being any other way</a>. The feedback loop for explosive growth is output -&gt; people / AI -&gt; ideas -&gt; output, a core part of that feedback loop is about increasing the \"population\".</p><p>(Though the fact that I said the opposite in a previous comment thread suggests I should really delve into the math to check my understanding.)</p><p>(The rest of this is nitpicky details.)</p><p>Incidentally, the graphs you show for the decline in innovations per capita start dropping around 1900 (I think, I am guessing for the one that has \"% of people\" as its x-axis), which is pretty different from the 1960s.</p><p>Also, I'm a bit skeptical of the graph showing a 5x drop. It's based off of an analysis of a book written by Asimov in 1993 presenting a history of science and discovery. I'm pretty worried that this will tend to disadvantage the latest years, because (1) there may have been discoveries that weren't recognized as \"meeting the bar\", since their importance hadn't yet been understood, (2) Asimov might not have been aware of the most recent discoveries (though this point could also go the other way), and (3) as time goes on, discoveries become more and more diverse (there are way more fields) and hard to understand without expertise, and so Asimov might not have noticed them.</p>", "parentCommentId": "vDSt4T5wjqiRzaAvW", "user": {"username": "rohinmshah"}}, {"_id": "ZPwHTAsbNKHhvqX9M", "postedAt": "2023-04-17T16:55:43.252Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Regarding explosive growth in the amount of hardware: I meant to include the scale aspect as well when speaking of a hardware explosion. I tried to outline one of the main reasons I'm skeptical of such an 'explosion via scaling' <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#fnmulm6bdfxvo\">here</a>. In short, in the absence of massive efficiency gains, it seems even less likely that we will see a scale-up explosion in the future.</p><blockquote><p>Incidentally, the graphs you show for the decline in innovations per capita start dropping around 1900 ... which is pretty different from the 1960s.</p></blockquote><p>That's right, but that's consistent with the per capita drop in innovation being a significant part of the reason why growth rates gradually declined since the 1960s. I didn't mean to deny that total population size has played a crucial role, as it obviously has and does. But if innovations per capita continue to decline, then even a significant increase in effective population size in the future may not be enough to cause a growth explosion. For example, if the number of employed robots continues to grow at current rates (roughly <a href=\"https://www.statista.com/chart/26210/operational-stock-of-industrial-robots/\">12 percent</a> per year), and if future robots eventually come to be the relevant economic population, then declining rates of innovation/economic productivity per capita would mean that the total economic growth rate still doesn't exceed 12 percent. I realize that you likely expect robot populations to grow much faster in such a future, but I still don't see what would drive such explosive growth in hardware (even if, in fact especially if, it primarily involves scaling-based growth).</p><blockquote><p>Also, I'm a bit skeptical of the graph showing a 5x drop.</p></blockquote><p>That makes sense.</p><p>On the other hand, it's perhaps worth noting that individual human thinking was increasingly extended by computers after ca. 1950, and yet the rate of innovation per capita still declined. So in that sense, the decline in progress could be seen as being somewhat understated by the graphs, in that the rate of innovation per dollar/scientific instrument/computation/etc. has declined considerably more.</p>", "parentCommentId": "qbRzzcntyTtTAJ9nv", "user": {"username": "MagnusVinding"}}, {"_id": "hfF5zHKfSG6B6hCaa", "postedAt": "2023-04-19T08:23:32.632Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>I am confused by your argument against scaling.</p><p>My understanding of the scale-up argument is:</p><ol><li>Currently humans are state-of-the-art at various tasks relevant to growth.</li><li>We are bottlenecked on scaling up humans by a variety of things (e.g. it takes ~20 years to train up a new human, you can't invest money into the creation of new humans with the hope of getting a return on it, humans only work ~8 hours a day)</li><li>At some point AI / robots will be able to match human performance at these tasks.</li><li>AI / robots will not be bottlenecked on those things.</li></ol><p>In some sense I agree with you that you have to see efficiency improvements, but the efficiency improvements are things like \"you can create new skilled robots in days, compared to the previous SOTA of 20 years\". So I think if you accept (3) then I think you are already accepting massive efficiency improvements.</p><p>I don't see why current robot growth rates are relevant. When you have two different technologies A and B where A works better now, but B is getting better faster than A, then there will predictably be a big jump in the use of B once it exceeds A, and extrapolating the growth rates of B before it exceeds A is going to predictably mislead you.</p><p>(For example, I'd guess that in 1975, you would have done better thinking about how / when the personal computer would overtake other office productivity technologies, perhaps based on Moore's law, rather than trying to extrapolate the growth rate of personal computers. Indeed, according a random website I just found, it looks like the growth rate <a href=\"https://stats.areppim.com/stats/stats_pcxfcst.htm\">accelerated</a> till the EDIT: 1980s, though it's hard to tell from the graph.)</p><p>(To be clear, this argument doesn't necessarily get you to \"transformative impact on growth comparable to the industrial revolution\", I'd guess you do need to talk about innovations to get that conclusion. But I'm just not seeing why you don't expect a ton of scaling <i>even if</i> innovations are rarer, unless you deny (3), but it mostly seems like you don't deny (3).)</p>", "parentCommentId": "ZPwHTAsbNKHhvqX9M", "user": {"username": "rohinmshah"}}, {"_id": "ArzWk8vcRjPboCeEB", "postedAt": "2023-04-19T14:39:47.713Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>I agree with premise 3. Where I disagree more comes down to the scope of premise 1.</p><p>This relates to the diverse class of contributors and bottlenecks to growth under Model 2. So even though it's true to say that humans are currently \"the state-of-the-art at various tasks relevant to growth\", it's also true to say that computers and robots are currently \"the state-of-the-art at various tasks relevant to growth\". Indeed, machines/external tools have been (part of) the state-of-the-art at some tasks for millennia (e.g. in harvesting), and computers and robots in particular have been the state-of-the-art at various tasks relevant to growth for decades (e.g. in technical calculations and manufacturing). And the proportion of tasks at which machines have been driving growth has been gradually increasing (the pictures of Model 2 was an attempt to illustrate this perspective). Yet <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#Superhuman_software_capabilities_increasingly_advance_technological_development___yet_growth_rates_appear_to_be_declining\">despite</a> superhuman machines (i.e. machines that are superhuman within specific tasks) playing an increasing role in pushing growth over the past decades, economic growth rates not only failed to increase, but decreased almost by a factor of 2. That is, robots/machines have already been replacing humans at the growth frontier across various tasks in the way described in premises 1-4, yet we still haven't seen growth increase. So a key question is why we should expect future growth/displacement of this kind to be different. Will it be less gradual? If so, why?</p><p>In short, my view is that humans have become an ever smaller part of the combined set of tools pushing growth forward — such that we're in various senses already a minority force, e.g. in terms of the lifting of heavy objects, performing lengthy math calculations, manufacturing chips, etc. — and I expect this process to gradually continue. I don't expect a critical point at which growth rates suddenly explode because the machines themselves are already doing such a large share of the heavy lifting, and an increasing proportion of our key bottlenecks to growth are (already) their bottlenecks to faster growth (which must again be distinguished from claims about absolute room for growth; there may be plenty of potential for growth in various domains without there being an extremely fast way to realize that potential).</p><blockquote><p>When you have two different technologies A and B where A works better now, but B is getting better faster than A, then there will predictably be a big jump in the use of B once it exceeds A</p></blockquote><p>Not if B is gradually getting better than A at specific growth-relevant tasks, and if B is getting produced and employed roughly in proportion to how fast it is getting better than A at those specific tasks. In that case, familiar rates of improvement (of B over A) could imply familiar growth rates in the production and employment of B in the future.</p><blockquote><p>But I'm just not seeing why you don't expect a ton of scaling</p></blockquote><p>Just to be clear, in one sense, I do expect to see a ton of scaling compared to today, I just don't expect scaling <strong>growth rates</strong> to explode, such that we see a doubling in a year or faster. In a future robot population that is much larger than the current one, consistent 12 percent annual growth would still amount to producing more robots in a single year than had been produced throughout all history 20 years earlier.</p>", "parentCommentId": "hfF5zHKfSG6B6hCaa", "user": {"username": "MagnusVinding"}}, {"_id": "ASHpvb9kcsHPsPcbR", "postedAt": "2023-04-19T14:56:23.434Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>I don't disagree with any of the above (which is why I emphasized that I don't think the scaling argument is sufficient to justify a growth explosion). I'm confused why you think the rate of growth of robots is at all relevant, when (general-purpose) robotics seem mostly like a research technology right now. It feels kind of like looking at the current rate of growth of fusion plants as a prediction of the rate of growth of fusion plants after the point where fusion is cheaper than other sources of energy.</p><p>(If you were talking about the rate of growth of machines in general I'd find that more relevant.)</p>", "parentCommentId": "ArzWk8vcRjPboCeEB", "user": {"username": "rohinmshah"}}, {"_id": "fDNsWsELpJgKz9bvf", "postedAt": "2023-04-19T15:29:57.298Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>To be clear, I don't mean to claim that we should give special importance to current growth rates in robotics in particular. I just picked that as an example. But I do think it's a relevant example, primarily due to the gradual nature of the abilities that robots are surpassing, and the consequent gradual nature of their employment.</p><p>Unlike fusion, which is singular in its relevant output (energy), robots produce a diversity of things, and robots cover a wide range of growth-relevant skills that are gradually getting surpassed already. It is this gradual nature of their growth-related abilities that makes them relevant, imo — because they are already doing a lot of work and already contributing a fair deal to the growth we're currently seeing. (To clarify, I mostly have in mind industrial robots, such as <a href=\"https://automation-insights.blog/2022/05/18/the-5-most-common-types-of-fixed-industrial-robots/\">these</a>, the future equivalents of which I also expect to be important to growth; I'd agree that it wouldn't be so relevant if we were only talking about some prototypes of robots that don't yet contribute meaningfully to the economy.)</p>", "parentCommentId": "ASHpvb9kcsHPsPcbR", "user": {"username": "MagnusVinding"}}, {"_id": "uoSHzNLqzhui55awi", "postedAt": "2023-04-19T16:56:55.694Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>By \"I am confused by your argument against scaling\", I thought you meant the argument I made <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth#fnmulm6bdfxvo\">here</a>, since that was the main argument I made regarding scaling; the example with robots wasn't really central.</p><p>I'm also a bit confused, because I read your arguments <a href=\"https://forum.effectivealtruism.org/posts/7cCr6vAmN4Xi3yzR5/two-contrasting-models-of-intelligence-and-future-growth?commentId=qbRzzcntyTtTAJ9nv\">above</a> as being arguments in favor of explosive economic growth rates from hardware scaling and increasing software efficiency. So I'm not sure whether you believe that the factors mentioned in your comment above are sufficient for causing explosive economic growth. Moreover, I don't yet understand why you believe that hardware scaling would come to grow at much higher rates than it has in the past.</p>", "parentCommentId": "ASHpvb9kcsHPsPcbR", "user": {"username": "MagnusVinding"}}, {"_id": "QQr3F8L5g6wSqmbYR", "postedAt": "2023-04-20T07:26:48.264Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<blockquote><p>I don't yet understand why you believe that hardware scaling would come to grow at much higher rates than it has in the past.</p></blockquote><p>If we assume innovations decline, then it is primarily because future AI and robots will be able to automate far more tasks than current AI and robots (and we will get them quickly, not slowly).</p><p>Imagine that currently technology A that automates area X gains capabilities at a rate of 5% per year, which ends up leading to a growth rate of 10% per year.</p><p>Imagine technology B that also aims to automate area X gains capabilities at a rate of 20% per year, but is currently behind technology A.</p><p>Generally, at the point when B exceeds A, I'd expect growth rates of X-automating technologies to grow from 10% to &gt;20% (though not necessarily immediately, it can take time to build the capacity for that growth).</p><p>For AI, the area X is \"cognitive labor\", technology A is \"the current suite of productivity tools\", and technology B is \"AI\".</p><p>For robots, the area X is \"physical labor\", technology A is \"classical robotics\", and technology B is \"robotics based on foundation models\".</p><hr><p>That was just assuming hardware scaling, and it justifies a growth in some particular growth rates, but not a growth explosion. If you add in the software efficiency, then I think you are just straightforwardly generating lots of innovations (what else is leading to the improved software efficiency?) and that's how you get the growth explosion, at least until you run out of software efficiency improvements to make.</p>", "parentCommentId": "uoSHzNLqzhui55awi", "user": {"username": "rohinmshah"}}, {"_id": "RaPFpquiaFTvnLMKp", "postedAt": "2023-11-05T14:49:23.439Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Great analysis, Magnus!</p><blockquote><p>The graph below is based on estimates of global GDP over time from <a href=\"https://data.worldbank.org/indicator/NY.GDP.MKTP.KD\">The World Bank</a> (in the period 1960-2021) and from DeLong, <a href=\"http://holtz.org/Library/Social%20Science/Economics/Estimating%20World%20GDP%20by%20DeLong/Estimating%20World%20GDP.htm\">1998</a> (prior to 1960). The graph draws a smoothed-out line between the estimated growth rate at the respective years listed along the x-axis, between which the world economy has seen a full doubling.</p></blockquote><p>Is the value for 2021 the annual growth rate from 2020 to 2021, or the annual growth rate from 1997 to 2021 (i.e. growth during the prior doubling)? The above suggests the former, but I think you meant the latter.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "MXgT2yCoNt4Daj5d4", "postedAt": "2023-11-07T15:11:16.552Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Thanks, and thanks for the question! :)</p><p>It's indeed not obvious what I mean when I write \"a smoothed-out line between the estimated growth rate at the respective years listed along the x-axis\". It's neither the annual growth rate in that particular year in isolation (which is subject to significant fluctuations), nor the annual average growth rate from the previously listed year to the next listed year (which would generally not be a good estimate for the latter year).</p><p>Instead, it's an estimated underlying growth rate at that year based on the growth rates in the (more) closely adjacent years. I can see that the value I estimated for 2021 was 2.65 percent, the average growth rate from 2015-2022 (according to the data from The World Bank). One could also have chosen, say, 2020-2022, which would yield an estimate of 2.01 percent, but that's arguably too low an estimate given the corona recession.</p>", "parentCommentId": "RaPFpquiaFTvnLMKp", "user": {"username": "MagnusVinding"}}, {"_id": "9XGHhePemJjv9LBsv", "postedAt": "2023-11-07T21:46:58.311Z", "postId": "7cCr6vAmN4Xi3yzR5", "htmlBody": "<p>Thanks for clarifying!</p>", "parentCommentId": "MXgT2yCoNt4Daj5d4", "user": {"username": "vascoamaralgrilo"}}]