[{"_id": "GksdqJnL3CM7pakmG", "postedAt": "2018-07-06T03:09:55.941Z", "postId": "7ctcuQci6JXCni3cZ", "htmlBody": "<p>I'm actually gearing up to do a study for my PhD including effective altruists, so this is really well-timed!</p>\n", "parentCommentId": null, "user": {"username": "Allan53"}}, {"_id": "k42me4JeDPFR5tXqv", "postedAt": "2018-07-06T03:47:20.421Z", "postId": "7ctcuQci6JXCni3cZ", "htmlBody": "<p>This sounds very interesting. How does it compare to alternative recruitment platforms?</p>\n", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "Z2Eeqvej22BBMuunH", "postedAt": "2018-07-06T22:45:31.104Z", "postId": "7ctcuQci6JXCni3cZ", "htmlBody": "<p>Thanks Peter – I've written an article that explains the differences generally speaking between different approaches to recruitment:\n<a href=\"https://www.positly.com/blogs/post/comparing-positly-with-alternative-recruitment-methods\">https://www.positly.com/blogs/post/comparing-positly-with-alternative-recruitment-methods</a></p>\n<p>The core difference is our approach:\nWe think a researcher’s job isn’t to figure out complex systems to find quality participants, so we provide best practice research methods directly into our tools. We allow researchers to customise their studies in many ways, but a researcher isn’t required to spend an inordinate amount of time focusing on details such as preventing duplication, calculating incentives, performing quality checks or other measures. Positly does all of this (and more) right out of the box.\nWhen we design a feature, we think about the many different contexts in which the feature could be used. Then we try to get to the root of the problem that the researcher has and abstract the solution to the most universally useful feature. Finally, we ensure that the feature behaves in a way that the researcher would expect.\nOur development process means that all researchers on Positly benefit from a versatile tool that is customisable to their needs. As we develop and release new features, Positly can be applied in different research contexts, all while maintaining a familiar and intuitive interface – freeing time for researchers to do what they do best.</p>\n<p>I've currently got some draft comparisons with specific other platforms which I can share with anyone who get's in touch (not posting publicly as I want to make sure they're bulletproof first when making specific comparisons to other companies).</p>\n", "parentCommentId": "k42me4JeDPFR5tXqv", "user": {"username": "Luke Freeman"}}, {"_id": "jEN6woHS9AayK48Sx", "postedAt": "2018-07-07T02:43:59.311Z", "postId": "7ctcuQci6JXCni3cZ", "htmlBody": "<p>Seems to be a broken link for the Facebook group: \n&quot;Join our Supporters/Advisors/Users private group on Facebook&quot;</p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "cyQS76QZSaaAf89LE", "postedAt": "2018-07-30T08:14:29.954Z", "postId": "7ctcuQci6JXCni3cZ", "htmlBody": "<p>Sorry I seemed to miss this comment earlier 😅</p>\n<p>Thanks for pointing it out – fixed now 😀</p>\n", "parentCommentId": "jEN6woHS9AayK48Sx", "user": {"username": "Luke Freeman"}}, {"_id": "iw7A5E288rNajthJp", "postedAt": "2018-07-30T17:24:48.909Z", "postId": "7ctcuQci6JXCni3cZ", "htmlBody": "<p>I agree with the listed 8 goals in last section of the article, and also think online technologies have a role in (possibly) meeting them. \n  I am interested in this topic but more from a theoretical perspective (mathematics, data analytics, statistics and probability, psychology and economics--complexity theory). </p>\n<p>Partly because of my interest I have participated in several of these online research studies (most recently the SWARM intelligence study conducted by a group in Australia (i think U Melbourne) which was funded by US DoD , and one from a university in  New York. I found most of these online studies (which involve answering questions ) too time consuming, so many of them i dropped out of.<br />  Hence one ends up with 'sample selection bias' problems.<br />This is similar to polling issues---when they only poll people who have smart phone numbers.  </p>\n<p>Hence i'm interested in how accurate these research studies are----perhaps I (and others like me) are 'outliers' (i have a smart phone but dont use it inside).  Similar ideas are discussed by Heinrich in his paper W.E.I.R.D people published in Behavioral and Brain Sciences several years ago.   </p>\n", "parentCommentId": null, "user": {"username": "ishi"}}]