[{"_id": "cvmkRq6JXm5aPmEy9", "postedAt": "2022-12-11T22:28:33.936Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>\"Subjecting countless animals to a lifetime of suffering\" probably describe the life of the average bird in the amazon (struggling to find food, shelter, avoid predators, protect its children) or the average fish/shrimp in the ocean.</p>\n<p>If you argue that introducing animals to other planets will cause net suffering then it seems to follow that we should eliminate natural ecosystems here on earth</p>\n", "parentCommentId": null, "user": {"username": "Henry Howard"}}, {"_id": "CYdmKvcw9u3BDb4oG", "postedAt": "2022-12-11T22:59:01.727Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>If done immediately, this seems like it’d severely curtail humanity’s potential. But at some point in the future, this seems like a good idea.</p>\n", "parentCommentId": "cvmkRq6JXm5aPmEy9", "user": {"username": "D0TheMath"}}, {"_id": "Z3nhCemKyN8zpZ7Fd", "postedAt": "2022-12-11T22:59:49.750Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I'm not sure eliminate is the right way to put it. Reducing net primary productivity (NPP) in legally acceptable ways (e.g. converting lawns into gravel) could end up being cost-effective, but eliminate seems too strong here.</p>\n<p>Doing NPP reduction in less acceptable ways could make a lot of people angry, which seems bad for advocacy to reduce wild animal suffering. As Brian Tomasik pointed out somewhere, most of expected future wild animal suffering wouldn't take place on Earth, so getting societal support to prevent terraforming seems more important.</p>\n", "parentCommentId": "cvmkRq6JXm5aPmEy9", "user": {"username": "Timothy Chan"}}, {"_id": "EbYtJBLzK6vQmDZAt", "postedAt": "2022-12-11T23:17:55.526Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>That would have negative consequences for the people that already exist today and rely on earths biosphere, the same can not be said for these frivolous space colonization ventures</p>\n", "parentCommentId": "cvmkRq6JXm5aPmEy9", "user": {"username": "Vgvt"}}, {"_id": "HYAFWvuJqGmo9jctA", "postedAt": "2022-12-12T00:32:29.427Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<blockquote><p>If you argue that introducing animals to other planets will cause net suffering then it seems to follow that we should eliminate natural ecosystems here on earth</p></blockquote><p>Do you intend this as an endorsement, a <i>reductio ad absurdum</i>, or a neutral statement?</p><p>I personally strongly suspect that many (most?) wild animals alive on Earth today live lives of net suffering. Even so, there are a bunch of reasons not to try to \"eliminate natural ecosystems\" right now, including instrumental reliance on those ecosystems, avoidance of drastic &amp; irreversible action before we understand the consequences &amp; alternatives, and respect for non-utilitarian side constraints (most compellingly for me, respect for the personhood/rights of existing animals). None of these really apply to terraforming.</p><p>As an intuition pump, I personally strongly suspect that there are many people alive on Earth today living lives of net suffering, but it would obviously be awful to try to \"eliminate\" those people, at least for many common interpretations of that word.</p>", "parentCommentId": "cvmkRq6JXm5aPmEy9", "user": {"username": "willbradshaw"}}, {"_id": "2Misg6oE8LMTLKBjx", "postedAt": "2022-12-12T00:49:36.745Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I agree with almost all of the logic behind this argument, but there's one critical factor that wasn't taken into account.&nbsp;</p><p>The vast majority of the stars in the milky way are beyond 10,000 light years away, so if people were seeding the galaxy with life at the fastest rate possible, they would have to continue making the mistake of the seeding the galaxy with standard earth organisms, for significantly longer than 10,000 years. There's no way the seeding itself could be locked in unless humanity persisted in the mistake for longer than 10,000 years, both lasers and von neuman probes can easily be overwritten by waves that are projected after 12022 C.E. that quickly replace the original animals with ethical synthetic animals (which will subsequently exist for hundreds millions of years). \"Ethical synthetic life\" might sound strange, but humanity only invented writing and civilization around 5,000 years ago and there was no modern math or science until at most 200 years ago. It's actually quite a stretch to consider a world <i>without</i> the ability to develop a preliminary model of ethical synthetic life by 3,000 C.E. let alone 12022 C.E. or 102022 C.E.</p><p>The problem with this post's analysis is that</p><blockquote><p>setting aside the conversation of whether or not we should extend human life into other planets and galaxies (for those who don't particularly follow longtermism, or the staunch antinatalists that might be reading this), wouldn't we be far better off just seeding these terraformed planets with plant life instead?</p></blockquote><p>Ignoring human actions isn't like trying to write the equations of general relativity with one arm behind your back or without ever drawing a square root symbol, it's like trying to write the equations of general relativity without acknowledging the existence of the number \"3\". It's a problem that's worth solving, so getting the right answer is worth observing all the factors in the equation. We don't even have any decent probability estimates for how likely it is that most anti-natalist problems will end up conclusively solved within the next 10,000 years. We do have good probability estimates that animal suffering will end up conclusively resolved as \"yes\", which is high, so it's worth considering all the variables in order to get the best results. &nbsp;&nbsp;</p><p>Seeding the terraformed planets with plant life could actually be a terrible mistake, since some of the plant species could mutate and ruin many of the planets in the timescale of 50 years, or mutate into extremely large amounts of strange, suffering life that humanity will not be able to detect, comprehend, and/or overwrite for a very long time because it is millions of light years away.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "kbk6btkuHRkcSZGBJ", "postedAt": "2022-12-12T01:38:38.223Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>Even if someone thinks that wild animals matter a lot morally, this seems like an unreasonably demanding standard:</p><blockquote><p>I'd still be staunchly against this unless we could somehow guarantee that the lives of every individual animal would be net-positive</p></blockquote><p>The aspects of life where we can reasonably expect 'guarantees', or that every single member of a class will benefit from a policy, are few. We will never be able to guarantee that space colonization will help every single animal, but we'll never be able to guarantee that opposing it will help every single animal either. This requirement is a recipe for paralysis.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "JNfAKbn2BLCp3qmPJ", "postedAt": "2022-12-12T04:42:49.644Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I think the main point this piece is making is broadly interesting, but I don't like the presentation.&nbsp;<br><br>&gt; Kurzgesagt's most recent video promoting the introducing of wild life to other planets is unethical and irresponsible<br><br>This uses emotional language very similar to what I see &nbsp;coming from people trying to ban content or creating long Twitter attacks.&nbsp;<br><br>I'd push back against us getting emotionally charged about each instance like this.<br><br>If you have access to ChatGPT, I recommend using that to help write things in what it considers the style of the effective altruism forum. &nbsp;[Edit: I don't mean this to be demeaning. There must also be good conversational norm documents on the EA Forum too. I'm sure some people would prefer those - personally, I'd find ChatGPT more useful here)</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "t4srpAorH2K7GDhNL", "postedAt": "2022-12-12T06:12:10.097Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I think in context, i.e. following OP's sentence \"If the key decision makers of the future decide they have to bring animals to other planets ... introducing herbivores would be preferred ...\" - by 'every individual animal', OP means every individual animal <i>brought to other planets</i> - not <i>every single animal in existence</i>. OP also seems to focusing on terraforming rather than space colonization.</p><p>So I'm not sure why you think that it's \"an unreasonably demanding standard\".&nbsp;There are certainly ways of assigning value that would say that creating additional lives with negative experiences makes it worse <i>for those lives </i>compared to refraining from creating them (e.g. <a href=\"https://forum.effectivealtruism.org/s/MBadsrYLmzLNmYjaj\">minimalist axiologies</a>). These may be rarer within the EA community, but they definitely exist outside of it (e.g. some forms of Buddhist ethics). If that's the case, and we're only talking about the lives created, then opposing bringing animals <i>will indeed help every single animal involved.&nbsp;</i></p><p>The implications of this is only that we find it preferable not to terraform - which isn't paralysis - just opposition to that particular policy.</p>", "parentCommentId": "kbk6btkuHRkcSZGBJ", "user": {"username": "Timothy Chan"}}, {"_id": "bFMCRe66AkhvnBJ6Y", "postedAt": "2022-12-12T08:35:19.386Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I took the “unless we can guarantee” part to mean something like, “we need to meet rigorous conditions before we can ethically seed wild animals onto other planets.”</p><p>The issue many people are taking with this post is semantic in nature. Having measured/methodical language does help with having more productive conversations. However, focusing on the specific words used detracts from the post's main point.</p><p>Kurzgesagt videos have an outsized influence. This video was released just 17 hours ago and already has 1 million views and is the #2 trending video on YouTube. Additionally, the studio was recommended for almost&nbsp;<a href=\"https://www.openphilanthropy.org/grants/kurzgesagt-video-creation-and-translation/\">$3 million</a>&nbsp;in grant money from Open Phil to “support the creation of videos on topics relevant to effective altruism and improving humanity’s long-run future.”</p><p>With great power (and grant money), comes great responsibility.</p><p>It would have only taken a couple seconds to say something like the following:</p><p>“Given the large amount of suffering experienced by animals in the wild on Earth, we have the opportunity to design the ecosystem of this new planet with just flora and microbe species that are carefully selected to support human life.”</p><p>That’s just one example of an alternative direction. My main point is that there was a moral opportunity that was lost. This Kurzgesagt video casually spread an idea (seeding wild animals to new planets) that could lead to s-risk and didn’t even mention that the potential for s-risk exists. They also missed the opportunity to spread awareness of the neglected issue of wild animal suffering. It’s a double loss.</p><p>Open Phil has also recommended a&nbsp;<a href=\"https://www.openphilanthropy.org/grants/wild-animal-initiative-animal-welfare-research/\">$3.5 million</a>&nbsp;grant to Wild Animal Initiative, but the potential impact of their funding is now discounted because they missed the opportunity to increase the tractability of wild animal welfare through this Kurzgesagt video.</p><p>I think pointing this concern on the EA forum could potentially lead to the issue of wild animal suffering being considered more in future videos, whether it be directly through the creators of Kurzgesagt or indirectly through Open Phil suggesting it to Kurzgesagt. So in the end, I’m glad OP decided to make this post.</p>", "parentCommentId": "kbk6btkuHRkcSZGBJ", "user": {"username": "Constance Li"}}, {"_id": "m6NQWwzwnbWG6Rg7b", "postedAt": "2022-12-12T10:18:35.278Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>Thanks for the comment Larks.</p><p>I could have worded that better, it wasn't meant to be a reasonable demand <i>exactly because</i> it's impossible to guarantee, so I'm in complete agreement with you and that position. Apologies.</p><p>This is why I wouldn't advocate for bringing in <i>any</i> wild animal life, and to <i>only</i> terraform / seed these new planets with flora and microbe species. That's the only realistic guarantee that we wouldn't be risking creating another s-risk in our future should we pursue such a path.</p><p>Timothy's reply is also on point to my thinking.</p>", "parentCommentId": "kbk6btkuHRkcSZGBJ", "user": {"username": "davidvanbeveren"}}, {"_id": "F8eZMMm9tk4tnW8Zv", "postedAt": "2022-12-12T10:32:35.119Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<blockquote><p>The issue many people are taking with this post is semantic in nature. Having measured/methodical language does help with having more productive conversations. However, focusing on the specific words used detracts from the post's main point.</p></blockquote><p>You knocked it out of the park, this is what I was attempting to convey. I'm new to this community, english isn't my native language (although, funnily enough, it's my best), and I'm still getting used to the jargon and writing style. I appreciate the comment.</p><blockquote><p>Kurzgesagt videos have an outsized influence. This video was released just 17 hours ago and already has 1 million views and is the #2 trending video on YouTube. Additionally, the studio was recommended for almost&nbsp;<a href=\"https://www.openphilanthropy.org/grants/kurzgesagt-video-creation-and-translation/\">$3 million</a>&nbsp;in grant money from Open Phil to “support the creation of videos on topics relevant to effective altruism and improving humanity’s long-run future.”</p></blockquote><p>I had no idea that they were funded by Open Phil— I completely agree &nbsp;that they failed to align their awareness efforts with one of EA's priorities here, and missed a large opportunity.</p><blockquote><p>I think pointing this concern on the EA forum could potentially lead to the issue of wild animal suffering being considered more in future videos, whether it be directly through the creators of Kurzgesagt or indirectly through Open Phil suggesting it to Kurzgesagt. So in the end, I’m glad OP decided to make this post.</p></blockquote><p>I'm very doubtful this would reach anyone at OP/Kurzgesagt, or that &nbsp;my post could make much impact, but of course I'd be happy if it did contribute to any conversations in that direction.</p><p>&nbsp;Thanks for the support Constance, appreciate it.</p>", "parentCommentId": "bFMCRe66AkhvnBJ6Y", "user": {"username": "davidvanbeveren"}}, {"_id": "XJ8XiucgmEbpYi2hM", "postedAt": "2022-12-12T10:56:20.263Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>Thanks for the comment, Ozzie. I appreciate the constructive criticism.</p><p>I did go back and forth on a few title ideas, but ended up with this one as I believed it to be succinct and in-line with what I think, along with being engaging for readers to click. I can see how this may have rubbed you the wrong way, and I do have access to ChatGPT - I'll check it out.</p><p>I also agree that we should avoid emotionally charged language as much as possible, but I do think there's a balance to be struck in making the initial statement, for example a title, compelling enough for people to read while staying true to the content it's conveying.</p><p>In either case, thanks for the comment.</p>", "parentCommentId": "JNfAKbn2BLCp3qmPJ", "user": {"username": "davidvanbeveren"}}, {"_id": "mTynsTDGFvk3mvJ9j", "postedAt": "2022-12-12T11:18:07.132Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>Animals already exist on earth independently of humans. The difference with introducing life on Mars is that humans would take the decision to make the decision and expend the resources to do so.</p>", "parentCommentId": "cvmkRq6JXm5aPmEy9", "user": {"username": "Darren_Tindall"}}, {"_id": "3yHe9PvierHgLqJ5P", "postedAt": "2022-12-12T11:36:54.947Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I've yet to see someone suggest actions. You should consider reaching out to them, to OpenPhil, or find someone in the EA forum who ha contacts at the channel/company.</p><p>&nbsp;I wouldn't be surprised if their staff frequent the forum?&nbsp;</p><p>As far as I am aware you can edit Youtube videos once published so perhaps there is still the opportunity to update the video with a snippet noting the potential implications for animal welfare.&nbsp;</p><p>The topics they cover are very complex and speculative so its unsurprising that they don't hit the mark 100% of the time.</p>", "parentCommentId": null, "user": {"username": "Darren_Tindall"}}, {"_id": "rGnsRmtNaxgXtWiAm", "postedAt": "2022-12-12T15:18:32.045Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<blockquote><p>The issue many people are taking with this post is semantic in nature. Having measured/methodical language does help with having more productive conversations. However, focusing on the specific words used detracts from the post's main point.</p></blockquote><p>It <a href=\"https://forum.effectivealtruism.org/posts/7DCuhq23zHxAmPqvJ/kurzgesagt-s-most-recent-video-promoting-the-introducing-of?commentId=m6NQWwzwnbWG6Rg7b\">sounds like</a> the author agrees with my interpretation and supports the extreme position so I disagree this is merely semantics.</p>", "parentCommentId": "bFMCRe66AkhvnBJ6Y", "user": {"username": "Larks"}}, {"_id": "zSrqXAApZbMCmEDph", "postedAt": "2022-12-12T15:29:24.801Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<blockquote><p>OP means every individual animal <i>brought to other planets</i> - not <i>every single animal in existence</i>.</p></blockquote><p>Every policy we can take has some knock-on effect, however small, on a vast array of different people (and animals). We can't just ignore some impacts by fiat. The justification for narrowing our scope and focusing only on some subset is typically because either some effects don't matter morally (e.g. wild animals don't matter, only humans) or because they are very small (most people will benefit and only a few will lose out). But OP rejects both these strategies, and takes a hard deontologic/rawlsian line, so even if he is only intending to discuss the impacts on some animals, logically he should apply the same to everyone - with paralysis the result.&nbsp;</p><blockquote><p>The implications of this is only that we find it preferable not to terraform - which isn't paralysis - just opposition to that particular policy.</p></blockquote><p>No, because the world is so big and complicated that every single decision you make will make some animal worse off, and slightly change which animals will be born in the future, some of whom will suffer. OP is applying a standard here so demanding that, if applied generally, no action could pass muster.</p>", "parentCommentId": "t4srpAorH2K7GDhNL", "user": {"username": "Larks"}}, {"_id": "pe3FA9GaEfA2FtXiR", "postedAt": "2022-12-12T16:35:44.650Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p><i>Two quick points on this:</i></p><ol><li>I believe Constance might be referencing to my entire post in the general sense, not just that tidbit, but perhaps it's included. In hindsight, I could have worded this better as many folks are attempting to interpret my meaning behind that and &nbsp;other lines.</li><li>&nbsp;I'm not sure I would agree that it's an <i>extreme</i> position to simply not take an action to bring wild life to other planets and instead just plants— but perhaps you mean in a sense from all-or-nothing viewpoint?&nbsp;</li></ol><p>I think, if I understand correctly: you're saying there could be a net-positive for animals on these new terraformed planets, as much as a net-negative, and that we simply don't know? My opinion of this is that without a guarantee that we don't accidentally cause another s-risk by introducing wildlife on these planets, that we simply shouldn't. I wouldn't say that's paralysis, but instead a direct action to <i>take</i> no action.</p><p>We can still terraform and seed planets with human and plant life, wildlife is not a requirement needed in order for us to live healthy and fulfilling lives. Considering we haven't solved Wild Animal Suffering on this planet, I'm advocating to not perpetuate the problem on the next one by promoting it as an essential step in terraforming planets.</p>", "parentCommentId": "rGnsRmtNaxgXtWiAm", "user": {"username": "davidvanbeveren"}}, {"_id": "5W48JxMkEQ3gpxvSm", "postedAt": "2022-12-12T16:57:25.625Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>As a (semi humorous) devils advocate, if we applied existential risk/longtermist ideas to non human animals, couldn't the animal lives on Mars still be net positive, as they help their respective species flourish for billions of years, and reduce their risk of going extinct if they were only on earth?</p>\n<p>I'm not sure I take this seriously yet, but it's interesting to think about.</p>\n", "parentCommentId": null, "user": {"username": "Ariel G."}}, {"_id": "jTa3tiTspvxAkLzhQ", "postedAt": "2022-12-12T21:21:48.261Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I interpreted “ eliminate natural ecosystems” as more like eliminating global poverty in the human analogy. Seems bad to do a mass killing of all animals, and better to just make their lives very good, and give them the ability to mentally develop past mental ages of 3-7.</p>\n", "parentCommentId": "HYAFWvuJqGmo9jctA", "user": {"username": "D0TheMath"}}, {"_id": "zvKy6AnFarW2idii6", "postedAt": "2022-12-12T21:24:08.983Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I wish people would stop optimizing their titles for what they think would be engaging to  click on. I usually downvote such posts once I realize what was done.</p>\n<p>I ended up upvoting this one bc I think it makes an important point.</p>\n", "parentCommentId": "XJ8XiucgmEbpYi2hM", "user": {"username": "D0TheMath"}}, {"_id": "tsKJFy5QkH4u3ZzmZ", "postedAt": "2022-12-12T21:32:00.908Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<blockquote><p>Seems bad to do a mass killing of all animals, and better to just make their lives very good, and give them the ability to mentally develop past mental ages of 3-7.</p></blockquote><p>Well, that sentence turned sharply midway through.</p><p>I'm not sure about the last part. If I wanted to create lots more intelligent beings, genetically engineering a bunch of different species to be sapient seems like a rather labour-intensive route.</p><p>I agree that a lot turns on your interpretation of the word \"eliminate\" in the original comment.</p>", "parentCommentId": "jTa3tiTspvxAkLzhQ", "user": {"username": "willbradshaw"}}, {"_id": "L5cSbLyAeT6o97LJZ", "postedAt": "2022-12-12T21:33:01.079Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<blockquote><p>If you have access to ChatGPT, I recommend using that to help write things in what it considers the style of the effective altruism forum.&nbsp;</p></blockquote><p>FWIW I had a much stronger negative emotional reaction to this sentence than to the title &amp; tone of the post.</p>", "parentCommentId": "JNfAKbn2BLCp3qmPJ", "user": {"username": "willbradshaw"}}, {"_id": "LiooJZaguosdjP9Aa", "postedAt": "2022-12-12T21:39:20.570Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>Quick callout to anyone intrigued by this topic that there is an <a href=\"https://discord.gg/s4PZytVN\">Animals and Longtermism Discord</a>. David, I get the sense you'll feel right at home with us there if you're not on it already :)</p>", "parentCommentId": null, "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "CKrfSB2hJ7vCtDLQv", "postedAt": "2022-12-12T21:40:28.549Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I wouldn’t advocate for engineering species to be sapient (in the sense of having valenced experiences), but for those that already are, it seems sad they don’t have higher ceilings for their mental capabilities. Like having many people condemned to never develop past toddlerhood.</p>\n<p>edit: also, this is a long-term goal. Not something I think makes sense to make happen now.</p>\n", "parentCommentId": "tsKJFy5QkH4u3ZzmZ", "user": {"username": "D0TheMath"}}, {"_id": "JfcCKf7sa4yxioWGM", "postedAt": "2022-12-12T22:42:35.969Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>Thanks for flagging!<br><br>I really didn't mean this in a demeaning way. I genuinely like ChatGPT a lot, think it can be really useful here.<br><br>I'd like to write posts about my preferred online etiquette and the usual etiquette of the community, but I think it's really tough to do so in a way that's general enough to cover most of the cases, but still somewhat interesting to read.&nbsp;<br><br>This is one extreme example, but I've been writing about this a bit more on my Facebook feed.<br>https://www.facebook.com/ozzie.gooen/posts/pfbid02JiqiMnWoEme61EhUiZfDSTP9nFV5E1zBanThKfQMcDZXhW1zvRX9gutMeZnNnovsl</p>", "parentCommentId": "L5cSbLyAeT6o97LJZ", "user": {"username": "oagr"}}, {"_id": "5GWH6EaD9roy6iqPC", "postedAt": "2022-12-13T01:58:25.586Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>You would be surprised at what kind of reach you can have! Your post was up on the front page for a whole day and is now the second result when searching Kurzgesagt on the forum. Plus, you can also just email OPP and  Kurzgesagt with a link to the post to increase the likelihood that they will see it. Who knows.. they might even comment and explain why they chose to create the video in the way they did or, better yet, edit the video. I recently had a random experience interacting with Dustin Moskovitz on Dank EA Memes so at this point I believe anything could happen.</p>\n<p>Also, there’s a Facebook group called “Effective Altruism Editing and Review” that provides editing help for EA forum posts that you can check out. People will give you feedback on your post and through that you can learn the preferred style of writing and all the terms that are commonly used on the forum.</p>\n", "parentCommentId": "F8eZMMm9tk4tnW8Zv", "user": {"username": "Constance Li"}}, {"_id": "hSMZBEExqHgLjokRP", "postedAt": "2022-12-13T02:58:38.640Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>This is a picture perfect demonstration of how EA has an emotions problem. Someone writes an emotional post and your primary response is to tell them that that's not in the \"style of the EA Forum\"? In the comments and in the body of the post, the OP is very constructive and generous and in my view follows all the discursive norms we want on the forum. I don't think this comment is constructive, even before the absolute backhand of telling them to replace their voice with an AI.</p>\n", "parentCommentId": "JNfAKbn2BLCp3qmPJ", "user": {"username": "therealslimkt"}}, {"_id": "ByjSWQSvnnQJh2F3h", "postedAt": "2022-12-13T04:36:31.939Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I'm not sure what you want me to say here. I imagine there's little response I could give at this point that would change your mind on this.</p><p>I'm obviously don't like being called the \"<i>picture perfect demonstration of how EA has an emotions problem</i>\".<br><br>Happy to try to have further discussions in PMs or similar, especially with David van Beveren, who I tried, perhaps unsuccessfully, to give some advice to.&nbsp;<br><br>Again, I wasn't using the GPT thing as an insult. Personally, I'm rewriting a lot of my work with AI assistants.&nbsp;</p>", "parentCommentId": "hSMZBEExqHgLjokRP", "user": {"username": "oagr"}}, {"_id": "KsKqEaCzhMt3cKCHs", "postedAt": "2022-12-13T04:55:33.008Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>Yeah I regularly see Ozzie talk about replacing language styles with ChatGPT, hardly a new thing for this comment.</p>", "parentCommentId": "JfcCKf7sa4yxioWGM", "user": {"username": "Linch"}}, {"_id": "xiXygehKCWLtujPj5", "postedAt": "2022-12-13T10:11:37.896Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>It was unfairly snarky, I'm sorry about that.</p>\n", "parentCommentId": "ByjSWQSvnnQJh2F3h", "user": {"username": "therealslimkt"}}, {"_id": "CphrSsLvpZySEGmrd", "postedAt": "2022-12-13T22:11:25.897Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I really appreciate this post. I also watched this video and was horrified at how no attention at all was paid to wild animal suffering, and I'm really glad there are other people who had the same experience. I think this is a serious moral blindspot in our society.</p>", "parentCommentId": null, "user": {"username": "Nicholas Kees Dupuis"}}, {"_id": "HtnvkHPFthjCuMsGq", "postedAt": "2022-12-14T03:07:49.230Z", "postId": "7DCuhq23zHxAmPqvJ", "htmlBody": "<p>I think talking about really thorny, alienating ideas like wild animal suffering reduction in a youtube video specifically targeted to a very naive or idealistic type of futurist would be a really bad idea, likely to backlash, and that this would be an obvious consideration to anyone who was good at public communication, and if you're going to cast strong judgements like these, you can't be part of a moral community that includes competent public communicators.</p>", "parentCommentId": null, "user": {"username": "MakoYass"}}]