[{"_id": "P3ujNS55WLXRfvH6B", "postedAt": "2024-03-28T15:14:39.992Z", "postId": "7deJh2YdWwzEXACuL", "htmlBody": "<p><strong>Executive summary:</strong> Reforming the global research publishing system to improve accessibility, equity, and affordability should be a high priority given the immense potential benefits compared to the relatively modest investments needed.</p><p><strong>Key points:</strong></p><ol><li>The current research publishing system is costly, inefficient, and inequitable, with most research locked behind paywalls and dominated by a few for-profit publishers.</li><li>Rough estimates suggest research publishing reforms could yield benefits in the trillions of dollars by increasing the impact of the $1 trillion in annual global research spending.</li><li>Reforms could also lead to tens of billions in annual savings by reducing research duplication and increasing researcher productivity.</li><li>Current resources spent on publishing are sufficient to sustain a reformed system, with potential cost savings of $6.5 billion per year.</li><li>The technology and initiatives exist to enable reform, but high-level political leadership and international coordination are needed to drive systemic change.</li><li>Research publishing reform has been relatively neglected as a global policy issue and warrants greater engagement from think tanks, policymakers, and funders.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "kxWyD5NjyDtyHHepT", "postedAt": "2024-03-28T22:55:29.224Z", "postId": "7deJh2YdWwzEXACuL", "htmlBody": "<p>Possibly an infohazard, but would donating to sci-hub be the most cost-effective way to tackle this problem? Piracy had a massive effect on the cost structures of the entertainment industry; even if it didn't remove the big players here it would force them to lower prices. (Moving to preprint servers is hard, given the way major journals control status in established fields).</p><p>The only other way out I see is regulation, and lobbying the EU in particular should be somewhat effective (they're pro-regulation, they govern a significant part of this industry, they already previously supported then rescinded <a href=\"https://en.wikipedia.org/wiki/Plan_S\">Plan S</a>).</p>", "parentCommentId": null, "user": {"username": "huw"}}]