[{"_id": "ho8jqTa68FTA4ZLa7", "postedAt": "2018-03-15T03:29:12.665Z", "postId": "7Dg7xvsZ9GfjF2Z4u", "htmlBody": "<p>Systematic research would be useful to many areas within EA, and I agree - that from a broader perspective it is incorporated more here than other communities.</p>\n<p>I think this discussion would benefit from acknowledging the risk of confirmation bias and general systematic inductive reasoning and deductive reasoning errors. Especially with related to your criteria example, I think there is a danger of finding evidence to confirm to existing beliefs about what framework should be used.</p>\n<p>All the same though, do you think systematically comparing several criteria options will arrive at a better outcome? How would we assess this?</p>\n", "parentCommentId": null, "user": {"username": "cassidynelson"}}, {"_id": "BdAomW5d5ebcsvpGN", "postedAt": "2018-03-15T22:14:30.087Z", "postId": "7Dg7xvsZ9GfjF2Z4u", "htmlBody": "<p>I've been thinking for awhile that there's a surprising lack of historical research in EA. I mean not that surprising given the dominance of STEM backgrounds, but rather in the sense that it's such an obviously useful tool to exploit.</p>\n", "parentCommentId": null, "user": {"username": "Richenda"}}, {"_id": "v5quxpk7Fpwy8FcEZ", "postedAt": "2018-03-20T20:43:25.741Z", "postId": "7Dg7xvsZ9GfjF2Z4u", "htmlBody": "<p>Is there a community / FB group for people with backgrounds or research interests in History within EA? There have been quite a few times when this has come up and it might be good to share ideas and collaborate. </p>\n<p>Examples: I'm thinking primarily within Effective Animal Advocacy (Sentience Institute's study of the British antislavery movement; ACE discontinuing their social studies project; technology adoption being considered as a precedent for clean meat e.g. by Sentience Institute and Paul Shapiro) but this would also apply to other fields.\nThe systematic approach described in the post above seems to correlate more closely with the approach Holden and others took at OPP than it does the studies done in the Effective Animal Advocacy sphere.</p>\n", "parentCommentId": "BdAomW5d5ebcsvpGN", "user": {"username": "Jamie_Harris"}}, {"_id": "LEwvgcHpys6525DwN", "postedAt": "2018-03-23T23:29:49.870Z", "postId": "7Dg7xvsZ9GfjF2Z4u", "htmlBody": "<p>What kind of systematic research would be good for AI strategy? </p>\n", "parentCommentId": null, "user": {"username": "branperr"}}, {"_id": "uaLbrAsizz5TfuDBg", "postedAt": "2018-03-26T05:32:25.384Z", "postId": "7Dg7xvsZ9GfjF2Z4u", "htmlBody": "<p>I haven't heard of anything, I'm afraid. </p>\n", "parentCommentId": "v5quxpk7Fpwy8FcEZ", "user": {"username": "Richenda"}}]