[{"_id": "bLb9gT2RotEs3kxGg", "postedAt": "2022-09-09T11:03:41.829Z", "postId": "7DPvmefCHKxhdh8kD", "htmlBody": "<p>Context: there has recently been a new phase 1/2b RCT in The Lancet, confirming a ~80% effectiveness rate for the R21/MM malaria vaccine (and confirming that booster shots work).&nbsp;</p><p>Quoting https://www.bbc.com/news/health-62797776:</p><p>'Prof Hill said the vaccine - called R21 - could be made for \"a few dollars\" and \"we really could be looking at a very substantial reduction in that horrendous burden of malaria\".</p><p>He added: \"We hope that this will be deployed and available and saving lives, certainly by the end of next year.\"'</p><p>If the vaccine makes it through phase III trials, this seems intuitively like a much more effective malaria intervention than bednets.</p>", "parentCommentId": null, "user": {"username": "Alexander de Vries"}}, {"_id": "jEgLd2jEka3X7mufw", "postedAt": "2022-09-09T11:10:45.424Z", "postId": "7DPvmefCHKxhdh8kD", "htmlBody": "<p>I think an 80% effectiveness rate is a fair bit higher than you get from using bednets - if I recall correctly they tend to reduce malaria deaths (or perhaps cases) by 30-50%.&nbsp;</p><p>The question is cost-effectiveness. If it's a few dollars for the whole set of vaccines ('three initial doses followed by a booster a year later'), <i>and</i> &nbsp;this includes distribution costs, then this seems pretty clearly more cost-effective than bednets. &nbsp;</p>", "parentCommentId": "bLb9gT2RotEs3kxGg", "user": {"username": "Matt_Sharp"}}, {"_id": "qvfQZTrhBNpyueJFt", "postedAt": "2022-09-09T12:14:57.671Z", "postId": "7DPvmefCHKxhdh8kD", "htmlBody": "<p>It's also worth considering that vaccines can't rip, get lost, or be installed incorrectly. It also protects the user no matter where they go-- they don't have to stay in bed to be protected.&nbsp;<br><br>Even if slightly more expensive, vaccines seem like they might be more convenient for the people who need protection from malaria.<br><br>I wonder though if there are other major mosquito-borne diseases that bed nets protect from besides malaria. If there are, then a combination of nets+vaccine seems best.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jendayi Jones"}}]