[{"_id": "oJ982mgk6RjigPxs2", "postedAt": "2023-01-06T23:18:39.720Z", "postId": "7E3AGFB86mKYeo5aC", "htmlBody": "<p>Thanks for this helpful post!</p>", "parentCommentId": null, "user": null}, {"_id": "vpJBaKAK8Chc9QLB8", "postedAt": "2023-01-08T19:40:50.889Z", "postId": "7E3AGFB86mKYeo5aC", "htmlBody": "<p>Thank you so much for this, it's so helpful! It looks like an extensive library of useful links too.</p><p>I have &nbsp;a few questions:</p><ol><li>Have you heard about the <a href=\"https://forum.effectivealtruism.org/posts/YgBXswPkPeqf99mrb/back-by-popular-demand-the-impactful-policy-careers-workshop\">Impactful Policy Careers Workshop</a> (and <a href=\"https://bald-elf-6f3.notion.site/Impactful-Policy-Careers-54ad72be1d444f198f9884c4e9b084ad\">here</a> too)? If yes, what's your take on it? (it seems to stem from Training for Good but with different objectives and framework)</li><li>You talk about orgs in the EA space working on EU policies in Brussels, could you be more specific?</li><li>[edit] Do you recommend other 'academic' options besides the College of Europe?<br>Heard about <a href=\"https://extension.harvard.edu/academics/programs/international-relations-graduate-certificate/\">this one at Harvard</a>, saw some on Coursera and other websites... Hard to see whether some are more valuable than others.</li></ol><p>Thanks again!</p>", "parentCommentId": null, "user": {"username": "alix.pham"}}, {"_id": "tzMA67nQCMbo9hPBG", "postedAt": "2023-01-08T21:43:08.671Z", "postId": "7E3AGFB86mKYeo5aC", "htmlBody": "<p>Thank you, glad it's helpful!</p><p>I think the Impactful Policy Careers workshop is a great way to dive deeper into the topic and connect with other EAs interested and working in the field.</p><p>Degrees from other prestigious schools in policy-related subjects (LSE, Sciences Po, Harvard Kennedy school, Oxford Blavatnik, etc.) can also give you an advantage and you meet many people having graduated from those in Brussels. I mentioned the College of Europe specifically as it is explicitly training graduates for EU policy and the network you can build there will be very relevant. I don't know about online degrees - I'm not very confident they would distinguish your CV much, but the right ones might be a good learning opportunity.</p>", "parentCommentId": "vpJBaKAK8Chc9QLB8", "user": {"username": "EU Policy Careers"}}, {"_id": "Bkz6iXu5Ci7jcBEra", "postedAt": "2023-01-09T18:59:28.509Z", "postId": "7E3AGFB86mKYeo5aC", "htmlBody": "<p>Thanks very much for writing this post. As someone who has gone through the process myself I find it very useful and will share it with others who are considering an application. I find the job landscape to be quite complex and the post does a great job of being both clear and comprehensive.</p><p>Two points:</p><p>You say:</p><blockquote><p>Though some positions are intense, people usually work well below 50 hours per week (with overtime counting towards your vacation allowance).</p></blockquote><p>I would tend to disagree with this statement. In my experience there are many, <u>many</u> people working well above 50 hours, not just members of cabinet, assistants to Directors and (Deputy)DGs, etc. but also Heads of Units and many Policy Officers. In my experience this is largely driven by peer pressure and ad-hoc demands. Of course one does not necessarily need to pursue the intense positions you mention, but at lower level it can be very difficult to avoid excessive workloads, at least in specific time periods (e.g. acute crisis, political deadlines). In addition, as far as I know overtime does not count toward your vacation allowance per se, but can be \"recuperated\" depending on the policy of the unit; this is probably too much detail for this post though.</p><p>You say:</p><blockquote><p>entry-level positions pay around € 3,500 - € 5,500 monthly tax free</p></blockquote><p>This may again be overly precise for the purposes of this guide, but while EU officials do no pay national taxes, they do in fact pay social security contributions and various taxes, including an income tax, to their employer. These taxes are considerable lower than for those in regular employment in the country (around half) and are largely compensated for through generous allowances (family, household, expatiation). Nevertheless, I believe it is important to be precise here as there is a persistent misperception about this topic both in the Brussels bubble and among citizens more broadly.</p>", "parentCommentId": null, "user": {"username": "simondrees"}}, {"_id": "5AzHEjxwvfGJ6aT56", "postedAt": "2023-01-10T20:34:43.341Z", "postId": "7E3AGFB86mKYeo5aC", "htmlBody": "<p>Thank you very much for your comment!\nI will adjust the section on working hours in the post</p>\n", "parentCommentId": "Bkz6iXu5Ci7jcBEra", "user": {"username": "EU Policy Careers"}}]