[{"_id": "wFxnSjvhDCyH6ukRG", "postedAt": "2023-02-20T17:13:23.513Z", "postId": "7f9eMGRhfEgjbMxsa", "htmlBody": "<p>I'm excited that more people are looking into this area!</p><p>Flagging that I only read the intro and the conclusion, which might mean I missed something.&nbsp;<br><br><strong>High-skilled immigration</strong></p><p>From my current understanding, high-skilled immigration reform seems promising not so much because of the effects on the migrants (though they are positive) but mostly due to the effect on the destination country's GDP and technological progress. The latter has sizeable positive spillover effects (that also accrue to poorer countries).</p><p>Advocacy for high-skilled immigration is less controversial and thus easier, which could make interventions in this area more valuable when compared to general immigration reform.</p><p>Then again, for the reasons above, more individuals are likely already working on improved high-skilled immigration.&nbsp;<br><br><strong>Malengo</strong></p><p>Also, have you chatted with Johannes Haushofer? He knows EA and recently started <a href=\"https://malengo.org/team\">Malengo</a>, which wants to facilitate educational migration from low-income countries. I'd assume he has thought about these topics a bunch.</p>", "parentCommentId": null, "user": {"username": "Simon_Grimm"}}, {"_id": "jweRoLQBeNWPX2BPm", "postedAt": "2023-02-20T18:43:51.781Z", "postId": "7f9eMGRhfEgjbMxsa", "htmlBody": "<p>I agree that advocacy for high skilled immigration is more likely to succeed, and that the benefits would probably come more from technological and material progress. The problem is we currently aren't prepared to try and estimate the benefits of these society and world wide spillover effects.&nbsp;</p><p>Maybe we will return to this if (big if) we explore policies that may cost-effectively increase GDP growth (which some argue is = tech progress in the long run?), and through that subjective wellbeing&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref1wna5qkx1w8\"><sup><a href=\"#fn1wna5qkx1w8\">[1]</a></sup></span>&nbsp;.&nbsp;</p><p><strong>Regarding Malengo</strong>, <a href=\"https://forum.effectivealtruism.org/posts/TMjRuTLjQa6z6rdeY/large-scale-international-educational-migration-a-shallow?commentId=hzGvBtdQheADKinoC\">I asked Johannes a few questions about it</a> and I'm referencing that post whenever I cite Malengo numbers. I didn't add it here because most of our work was already done when they wrote a post about it, and I was too lazy, and I didn't think it looked particularly promising in my initial estimates. However, I now notice that in my previous calculations I didn't consider remittances, which seems like an omission. As we discussed in the report, it's unclear how remittances balance the negative effects of separation from the immigrant, but I think that separation pains are less of a concern if it's a young adult leaving -- as that's pretty normal in many cultures.&nbsp;</p><p>So here's a BOTEC with remittances considered.&nbsp;</p><p>As Johannes said, they expect that 64% of students will settle permanently in Germany (or a similar country) after graduating. I interpret this to imply an expected stay of 38.4 years, which if life-satisfaction difference &nbsp;between the countries closes slightly to 2 life-satisfaction points, will mean 2 * 38.4 = 78.8 WELLBYs per student sent. It costs $15,408&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref38d2mdvoamw\"><sup><a href=\"#fn38d2mdvoamw\">[2]</a></sup></span>to fund a student to matriculate in Germany.&nbsp;</p><p>If we're only concerned with the student, this implies a cost-effectiveness of 76.8 / $15,408 = ~5 WELLBYs per $1000. Which is a bit less than 8 WELLBYs per $1k that I estimate come from GiveDirectly cash transfers. But this excludes remittances.&nbsp;</p><p>They expect Malengo participants to remit ~$2k a year. If assume a 1 to 1 equivalence between $1k of remittances and GiveDirectly cash transfers, and assume this continues for 20 years, this would imply a 40 * 8 = 320 additional WELLBYs generated by remittances. This boosts the cost-effectiveness of Malengo from ~0.6x GiveDirectly to ~3x GiveDirectly. However, I'm unsure that the equivalence assumption would be warranted, or how long we could expect remittances to continue<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreff709bldi49s\"><sup><a href=\"#fnf709bldi49s\">[3]</a></sup></span>. One potential concern is that the families that can send students to university (regardless of cost) are going to be much wealthier, so remittances will matter relatively less.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn1wna5qkx1w8\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref1wna5qkx1w8\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;Note that the relationship between GDP &lt;&gt; SWB is rather contested -- see previous <a href=\"https://forum.effectivealtruism.org/posts/gCDsAj3K5gcZvGgbg/will-faster-economic-growth-make-us-happier-the-relevance-of\">work from HLI on the topic</a> that argues that maybe GDP doesn't matter much for subjective wellbeing, and <a href=\"https://forum.effectivealtruism.org/posts/coryFCkmcMKdJb7Pz/does-economic-growth-meaningfully-improve-well-being-an#comments\">a reply post from Founder's Pledge</a> that argues against that point using the same evidence. In the latter post there's also a quite interesting discussion Vadim and an author of one of the key papers (Kelsey O'Connor).&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn38d2mdvoamw\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref38d2mdvoamw\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Malengo costs 12k euros to send a student, and they hope to get overhead down to 20% once they scale. Converting this into dollars implies $15k.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnf709bldi49s\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreff709bldi49s\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This question should be easy in principle, to gain traction on. We could use a survey that includes immigrants that asks about if they send remittances, and how long they've lived in the country they moved to.&nbsp;</p></div></li></ol>", "parentCommentId": "wFxnSjvhDCyH6ukRG", "user": {"username": "JoelMcGuire"}}, {"_id": "gkDCEar8twk4iz2Tk", "postedAt": "2023-02-22T05:11:37.069Z", "postId": "7f9eMGRhfEgjbMxsa", "htmlBody": "<p>I do not think this was the intention behind this post at all, but it struck me that perhaps this analysis can be used to refute the often touted \"it is cheaper to help immigrants where they came from\" argument.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "rk7NEWbmH6dWDJZtS", "postedAt": "2023-02-24T01:30:03.924Z", "postId": "7f9eMGRhfEgjbMxsa", "htmlBody": "<p>I find it somewhat troubling that this analysis only mentions positive effects of immigration &nbsp;without once mentioning or trying to determine the probability/impact of any negative effects. This seems to me to be</p><ol><li>epistemically not great</li><li>possibly reflective of a general left/right skew for/against immigration&nbsp;</li></ol><p>There are many plausible arguments as to why low-skill immigration has &nbsp;negative effects. A few of the classic lines of argument for this are:</p><ul><li>mass immigration makes the countries migrants move to more like the countries they left aka worse institutions/governance/norms (e.g: https://www.researchgate.net/publication/320112681_Do_Immigrants_Import_their_Economic_Destiny)</li><li>mass immigration inhibits growth as the most able leave their host countries</li></ul><p>I am personally unconvinced by many of these arguments and don't think they are true or impactful enough to outweigh the positive impacts of more migration, but I would expect them to at least be assessed to some extent and to see them enter into an EV calculation.</p>", "parentCommentId": null, "user": {"username": "e102"}}, {"_id": "vp8wCgZuwKLSCGBTm", "postedAt": "2023-02-24T22:28:59.601Z", "postId": "7f9eMGRhfEgjbMxsa", "htmlBody": "<p>Dear Srdjan,&nbsp;</p><p>I think we do address the potential for negative impacts. As we say in section 2.2 (and elaborate on in Appendix B.3:</p><blockquote><p>&nbsp;\"From 11 studies we estimate that a 1% increase in immigrants as a share of the population is associated with a (non-significant) decrease of -0.004 SDs of SWB (or -0.008 WELLBYs) for the native population.\"</p></blockquote><p>Additionally, we have a subsection (3.2) called \"risk of backlash effects\". Again, these may not be the concerns you have in mind, but to say we're only mentioning positive effects is wrong. We mention throughout the report that we're concerned with potential negative impacts and include speculative estimates of these in our BOTECs.&nbsp;</p><p>And in section B.2 we say</p><blockquote><p>One concern is that emigration could limit the ability of the origin country to improve its institutions. This could be true if emigration drains high-skilled individuals from the country, making it poorer and less likely to reform. We expect this concern to be blunted somewhat by high rates of return (29% globally, <a href=\"https://www.pnas.org/doi/abs/10.1073/pnas.1722334116\"><u>Azose &amp; Raftery, 2018</u></a>) and remittances (<a href=\"https://www.un.org/development/desa/en/news/population/remittances-matter.html\"><u>which are three times the size of development aid</u></a>). Remittances seem correlated to beneficial political (<a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/rode.12401\"><u>Williams, 2018</u></a>) and economic (<a href=\"https://www.adb.org/publications/international-remittances-and-poverty-reduction\"><u>Yoshino et al., 2017</u></a>; <a href=\"https://www.emerald.com/insight/content/doi/10.1108/IJSE-08-2013-0189/full/html\"><u>Kratou et al., 2015</u></a>) effects at the country level.&nbsp;Historical quasi-experimental evidence from Sweden found that Swedish emigration led to a higher likelihood of reform for local governments in Sweden (<a href=\"https://www.journals.uchicago.edu/doi/abs/10.1086/701682\"><u>Karadja &amp; Prawitz, 2019</u></a>). However, this study may not generalise to other contexts. We think that the positive effects of emigration may be less likely in authoritarian countries where potential reformers&nbsp;may emigrate at higher rates.</p></blockquote>", "parentCommentId": "rk7NEWbmH6dWDJZtS", "user": {"username": "JoelMcGuire"}}, {"_id": "DqsKGPj9cg7BTfsNv", "postedAt": "2023-02-26T15:39:09.678Z", "postId": "7f9eMGRhfEgjbMxsa", "htmlBody": "<p>Hi Joel and Samuel,</p><p>Have you considered accounting for the <a href=\"https://forum.effectivealtruism.org/topics/meat-eater-problem\">meat eater problem</a>? Immigration to countries where SWB is higher will also lead to higher consumption of animals, which counters the benefits of the increase in human happiness.</p><p>To illustrate, for the <a href=\"https://ourworldindata.org/grapher/poultry-livestock-count?tab=chart&amp;country=~OWID_WRL\">35.07 G</a> poultry birds and <a href=\"https://ourworldindata.org/world-population-growth\">7.84 G</a> humans in 2020, and Rethink Priorities' median moral weight of <a href=\"https://forum.effectivealtruism.org/posts/Qk3hd6PrFManj8K6o/rethink-priorities-welfare-range-estimates\">0.332</a> for chickens, one can conclude the total moral weight of chickens is 1.49 (= 35.07*0.332/7.84) times that of humans. I also guess the intensity of the experiences of chickens relative to their moral weight is higher than for humans, so the factor of 1.49 may well be an underestimate.</p><p>In any case, considering the impact on wild arthropods is pretty uncertain (quick illustration <a href=\"https://forum.effectivealtruism.org/posts/HwDZ6oHtz34kBAsts/finding-bugs-in-givewell-s-top-charities\">here</a>), and may well be more important than the impact on chickens (see <a href=\"https://forum.effectivealtruism.org/posts/rdLMTsSZ2oqoFAeTg/is-improving-the-welfare-of-arthropods-and-nematodes-1\">here</a>), I would say the impact of immigration in the nearterm is pretty uncertain too.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "C395cHEdfKQ6wS4h4", "postedAt": "2023-03-04T23:41:20.246Z", "postId": "7f9eMGRhfEgjbMxsa", "htmlBody": "<p>First, at Malengo the students fully fund the next cohort via repaying the original donation in an ISA.</p>\n<p>This means that funding 1 student will actually fund many students over time. Using the numbers above you get a rate of return around 6% annualized. So funding a student is sorta infinite students 0% discount rates. But that is unreasonable, so let's just cap at the next 100 years and say 2% discount rate from inflation.</p>\n<p>BOTEC for 1 funding pays 12.5 students or a student every 8 years.</p>\n<p>That changes your calculation from 3x givedirectly to 37.5x.</p>\n<p>Second, you also said the students are richer but that is factually incorrect, the program is means testing to ensure that students are well targeted.</p>\n<p>Finally, there are other fudge factors, but they are all dwarfed by the development benefits of immigration.</p>\n<p><a href=\"https://www.nber.org/papers/w29862\">https://www.nber.org/papers/w29862</a></p>\n<p>This shows that nearly 80% of long-run income gains are accrued within sending countries across a wide variety of channels.</p>\n<p>Hence, I think 37.5x GiveDirectly is a completely reasonable estimate.</p>\n", "parentCommentId": "jweRoLQBeNWPX2BPm", "user": {"username": "Richard Nerland"}}]