[{"_id": "L8RDmgJwwrDuru4k7", "postedAt": "2024-02-19T11:26:32.028Z", "postId": "7FC8DpGr9jKYBDtG8", "htmlBody": "<p>I think an important thing to remember is that drastic change both obsoletes and creates jobs. I know that AI is not the same as prior technologies, but we've had very similar situations before with the first, second, and third industrial revolutions - with mass production and computing in particular. Many of the jobs we know of today will disappear, though new ones will appear (some are already starting to).<br><br>I think AI will struggle with a lot of the soft skills of academia, but I do agree that the field will be extensively changed. This isn't always a bad thing - I think the LLM and automation aspect will make scientific participation and discover much easier for large sections of society. My father is one of the most intelligent and driven men I know, but is mostly illiterate (and I mean this literally) for a variety of reasons, so I think for people like that AI will be useful.<br><br>To most directly answer your question, I'd say do what you love. Yes, that's really annoying and something you'd find on a motivational poster but if you genuinely love psychology academia then stick with it but keep an agile scout mindset to roll with the punches. If it was always just a job, play to very human strengths - look for roles which require a very human understanding of the world. Roles in HCI fit this, but there are a lot of roles in engineering and frontline science that are also almost impossible to automate within the next 20 years. Project management and people management roles also fit into this category.<br><br>Lots of this answer is opinion-based (and will be, naturally, given the request for opinions!) so others may disagree - but this is how I see it.<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "A4knkkcPrGJqdNLwP", "postedAt": "2024-02-19T15:12:34.540Z", "postId": "7FC8DpGr9jKYBDtG8", "htmlBody": "<p>This is an important question! I think you're right to imagine that traditional career paths are likely to shift a lot.</p>\n<p>In terms of skills which are likely to remain useful for a good while, I want to highlight four areas:</p>\n<p>First, general analytical skills and the ability to recognise important (vs unimportant or flawed) arguments. Even if we have assistance from language models, there will be important challenges in knowing which pieces of things to pay attention to.</p>\n<p>Second, skills around in-person human interactions. These will be slow to be replaced by AI and they are crucial in several domains.</p>\n<p>Third, and relatedly (since in-person interactions are an important component of how people understand and relate to things), developing social or political influence, broadly understood. Having a position to help others focus on what's important and make connections to try to ensure good outcomes could matter in lots of futures. Of course, this one comes with significant caveats: even well-intentioned influence may cause harm as well as help things; and jostling for influence can easily be negative sum. Approach with care!</p>\n<p>Fourth, knowing how to get good use out of language models themselves. There is likely to be a period where centaurs (human-AI teams) outperform either pure AI or pure human teams. Having experience with the latest models and knowing how to get the best out of them will be helpful for staying at the forefront of the relevant labour force.</p>\n<p>I think it should be possible to practice and develop these four classes of skill in many different local career paths, so I wouldn't want to make strong statements about what you should or shouldn't be pursuing in the short term.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "Jxw6TBQfKCcahKs7X", "postedAt": "2024-02-20T09:34:02.958Z", "postId": "7FC8DpGr9jKYBDtG8", "htmlBody": "<p>If you haven't had 80k advising before, that could be a great place to start!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sam Robinson"}}]