[{"_id": "nCKEkNWvZTLE9vokx", "postedAt": "2022-12-25T05:50:38.106Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>Does chewing sugar-free gum suffice? Seems much simpler<br><br>I chewed sugar-free gum all the time growing up and didn't need braces or wisdom teeth removal<br><br><a href=\"https://news.stanford.edu/2020/07/21/toll-shrinking-jaws-human-health/\">https://news.stanford.edu/2020/07/21/toll-shrinking-jaws-human-health/</a></p>", "parentCommentId": null, "user": {"username": "Pat Myron"}}, {"_id": "6FYzHWGK3WveXG7fK", "postedAt": "2022-12-25T08:06:18.730Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>Seems plausible, I’ve wondered if the outward-pulling force you get when you try to rip off a piece of big chewy food has any effect, but I don’t think it’s been studied and it doesn’t seem super likely. (Healthy people chew with a rotating jaw motion, not an up-and-down motion, so any chewing should have outward-pushing force because of that.)</p>\n", "parentCommentId": "nCKEkNWvZTLE9vokx", "user": {"username": "Andre Popovitch"}}, {"_id": "95KcgwKyzxwtWSEed", "postedAt": "2022-12-25T17:21:23.569Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>Maybe difficult to assess conclusively from research (<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7353031/\">here</a> and <a href=\"https://pubmed.ncbi.nlm.nih.gov/24215801/\">here</a>), but it seems likely that another benefit of chewier food is that it forces you to eat more slowly. &nbsp; This theoretically promotes mindful eating and less risk of overeating.</p>", "parentCommentId": null, "user": {"username": "NicoleJaneway"}}, {"_id": "LLN3wHTPSNSAwzGN3", "postedAt": "2022-12-25T18:04:32.290Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>I don't this post really makes the case for this being an EA cause area. I don't think you've addressed any of neglectedness (is anyone else thinking about this?), tractability (how much can we improve awareness, and would behaviour really change?), or importance (how much welfare loss do these issues cause anyway?), let alone even BOTEC-ing a cost effectiveness analysis.</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "pPQTHDpwtjDq9dxck", "postedAt": "2022-12-25T19:11:03.428Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>The figure of 85% of Americans having their wisdom teeth removed isn’t very informative as (IIRC) most Americans have them removed by default, even if there’s no impaction.</p>\n<p>In the UK, the NHS only removes them if they’re causing problems (although in practice I found they were quite reluctant even in this case). That would provide a more useful base rate.</p>\n", "parentCommentId": null, "user": {"username": "HenryStanley"}}, {"_id": "nyDn46iy8qihcgxf3", "postedAt": "2022-12-26T10:15:44.161Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>With recent FTX news, EA has room for more billionaire donors.  For any proposed EA cause area, a good standard question to ask is: \"Could this be done as a for-profit?\"  <a href=\"https://forum.effectivealtruism.org/posts/YNnG86WS8z8aYdBES/how-to-make-billions-of-dollars-reducing-loneliness?commentId=EWfxGQrRbTwcHxGFAD\">Quoting myself</a> from a few years ago:</p>\n<blockquote>\n<p>There are a few reasons I think for-profit is generally preferable to non-profit when possible:</p>\n<ul>\n<li>It's easier to achieve scale as a for-profit.</li>\n<li>For-profit businesses are accountable to their customers. They usually only stay in business if customers are satisfied with the service they provide. Non-profits are accountable to their donors. The impressions of donors correlate imperfectly with the extent to which real needs are being served.</li>\n<li>First worlders usually aren't poor and don't need charity.</li>\n<li>You can donate the money you make to effective charities.</li>\n</ul>\n</blockquote>\n<p>Before anyone jumps on me here: IMO, an important takeaway from the FTX catastrophe is that EA-founded businesses should avoid mentioning EA in their marketing by default.  Even if you think you have a good reason to use EA in your marketing, you should still get CEA's permission first.</p>\n<p>Other good ways to not be like SBF include: Have detailed knowledge of what people are buying and accurately communicate it to customers, including your own uncertainty.  Pay special attention to identifying and mitigating ways in which your product could do harm (e.g. for a chewy food product, choking is an obvious potential hazard).  Do these things beyond what's required by law, and what's pragmatic from the point of view of maximizing profit.  Be willing to pull the plug on the business proactively if risks seem too high, or things aren't going in a good direction.</p>\n<p>If you aren't able to achieve healthy profits while respecting such ethical guidelines, that's an indicator that the business idea isn't promising and you should find something else.  Good business ideas are in \"blue oceans\" with little competition, plus somewhere you can build a durable competitive moat, meaning you won't be caught in a race to the bottom.</p>\n<p>Anyway, back to the post.  Your proposed interventions are \"mostly bottlenecked on improving awareness\".  In the business world, awareness is achieved through marketing.  You could sell a product which helps kids with jaw development, and your marketing could improve awareness of this problem as a side effect.</p>\n<p>What product could you sell?  Perhaps some sort of kid-themed chewy snacks -- a nutty animal cracker?  Or maybe a long, thin stick to minimize choking risk (with spiky sides so even if it gets caught in the throat they can still breathe around it?)  Maybe the snacks could come in grades of chewing difficulty, so you can put your kid on a step-by-step program of jaw development, gradually ramping them up from the soft foods they're eating right now.</p>\n<p>It'd be very tempting to promote this by saying: \"buy this $10 snack and you could save thousands on orthodontics down the road\".  That could be an amazing sales pitch.  But you want to be very careful in making any kind of health claim.  There are lawyers who specialize in navigating FDA regulations around such claims.  Maybe you'd want to start with a study measuring your product's impact on some sort of near-term proxy for jaw development, as a basis for eventually making such a claim.</p>\n<p>In terms of the professional treatment side, you could build a directory of dentists who e.g. work with expanders instead of doing extractions.  Then create a tool that helps a parent find such a dentist in their area, solicit dentist reviews from parents, advertise your tool, and make money through lead generation.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "zXo5hH4m5tfoegQhH", "postedAt": "2022-12-26T20:24:10.612Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<blockquote><p>Even if you think you have a good reason to use EA in your marketing, you should still get CEA's permission first.</p></blockquote><p>&nbsp;</p><p>I strongly disagree with the idea that CEA (or any person or entity) should have that kind of ownership over \"effective altruism\". It's not a brand, but a concept whose boundaries are negotiated by a wide variety of actors.</p>", "parentCommentId": "nyDn46iy8qihcgxf3", "user": {"username": "jasonk"}}, {"_id": "57S54hBwnD4o6aF8n", "postedAt": "2022-12-27T00:54:22.459Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>Suppose you saw a commercial on TV.  At the end of the commercial a voice says \"brought to you by Effective Altruism\".  The heart-in-lightbulb logo appears on screen for several seconds.</p>\n<p>I actually did hear of a case of a rando outside the community grabbing a Facebook page for \"Effective Altruism\", gaining a ton of followers, and publishing random dubious stuff.</p>\n<p>You can insist EA isn't a brand all you want, but someone still might use it that way!</p>\n<p>I'm not super attached to getting permission from CEA in particular.  I just like the idea of EAs starting more companies, and dislike the idea of them often advertising those companies as EA?</p>\n<p>Maybe a good thing to point out is that while the survival criterion for nonprofits is donation (i.e. almost by definition nonprofits must achieve the approval of philanthropists), the survival criterion for companies is profitability.  Imagine \"Superstimulus Slot Machines Inc.\" puts the EA logo on the side of their machine and runs a bunch of commercials explaining how all profits go to EA charities.  This might be a really profitable business, and become the first thing people think of when they hear \"EA\", without any EA outside the company ever signing on.  [Note: Please don't start this company, there are many better business ideas that don't involve harming people!]</p>\n<p>If the process for making this sort of corporate branding decision is fuzzy, it becomes easier for people to tilt it in their favor.  So I think an explicit process makes sense, for the same reason it makes sense to preregister data analysis code before data gets collected.  If you don't like the \"ask CEA\" process, maybe you could suggest an alternative and explain why it's better?</p>\n", "parentCommentId": "zXo5hH4m5tfoegQhH", "user": {"username": "John_Maxwell_IV"}}, {"_id": "9XGfS9atByxJ737oe", "postedAt": "2022-12-27T02:20:14.126Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>There's an EA cause area in this, but it's not tooth-related. Our jaws are perfectly fine. The problem is bad incentives in the healthcare system; dentists get paid to take wisdom teeth out, not to leave them in, <a href=\"https://www.sciencealert.com/no-you-probably-don-t-need-to-get-your-wisdom-teeth-removed-ever\">so about 90% of wisdom tooth extractions are unnecessary</a>.&nbsp;</p><p>The mortality rate of anesthesia is not quite negligible; a couple hundred people <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5535496/\">have died</a> because of anesthesia during wisdom tooth removal, and there's also the risk of infection.</p>", "parentCommentId": null, "user": {"username": "Closed Limelike Curves"}}, {"_id": "aKCqXuJ46PLQvzSf8", "postedAt": "2022-12-29T00:40:16.088Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>The OP is 100% right. People are less attractive because jaws and faces are narrower; and they don't sleep well because their nasal passages are too narrow. This negatively impacts the well-being of millions--perhaps billions-- of people.</p>\n", "parentCommentId": null, "user": {"username": "L. L."}}, {"_id": "in5piQxsHNRmxKCWA", "postedAt": "2022-12-29T19:14:20.791Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>My suggestion would be to have no process other than general social &nbsp;sanctions. I don't think it makes sense to make any person or entity an authority over \"effective altruism\" any more than it would make sense to name a particular person or entity an authority over the appropriate use of \"Christian\" or \"utilitarian\".</p><p>I believe you're introducing a new kind of connection when you talk about usage of the heart-in-lightbulb image. I couldn't tell you who originally produced that image, but I assume it was connected to CEA. I agree that using an image with strong associations with a particular organization that created it might morally require someone to check in with the organization even if the image wasn't copyrighted.</p><p>I believe effective altruism benefits strongly from the push and pull of different thinkers and organizations as they debate its meaning and what's effective. Some stuff people do will seem obviously incongruous with the concept and in such cases it makes sense for people to express social disapproval (as has been done in the past).</p>", "parentCommentId": "57S54hBwnD4o6aF8n", "user": {"username": "jasonk"}}, {"_id": "JaZy82draiwgjcsfF", "postedAt": "2022-12-29T20:02:57.384Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<blockquote><p>Before anyone jumps on me here: IMO, an important takeaway from the FTX catastrophe is that EA-founded businesses should avoid mentioning EA in their marketing by default. Even if you think you have a good reason to use EA in your marketing, you should still get CEA's permission first.</p></blockquote><p>This seems like the opposite lesson to learn from me. I think it would be terrible if EA updated from the FTX situation by still giving fraudsters a ton of power and influence, but now just don't publicly associate with them.&nbsp;</p><p>This seems like it creates an even more adversarial relationship to the public, and I don't think would have made this situation much better (the vast majority of the damage of this situation is because Sam stole $8 billion of customer deposits, was actually a quite influential EA, and in some sense was an important leader, not because he was publicly associated with EA).</p>", "parentCommentId": "nyDn46iy8qihcgxf3", "user": {"username": "Habryka"}}, {"_id": "G9JhEgnrzyyjDxBFt", "postedAt": "2022-12-29T23:35:19.833Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<blockquote>\n<p>I think it would be terrible if EA updated from the FTX situation by still giving fraudsters a ton of power and influence, but now just don't publicly associate with them.</p>\n</blockquote>\n<p>I don't think fraudsters should be given power and influence.  I'm not sure how you got that from my comment.  My recommendation was made in the spirit of defense-in-depth.</p>\n<p>I can see how a business founder trying to conceal their status as an EA might create an adversarial relationship, but that's not what I suggested.</p>\n<p>Put it another way: SBF <em>claimed</em> he was doing good with lots of fanfare, but <em>actually did</em> lots of harm.  The next EA billionaire should focus less on <em>claiming</em> they're doing good, and more on <em>actually doing</em> good for their employees, customers, shareholders, and donation recipients.</p>\n", "parentCommentId": "JaZy82draiwgjcsfF", "user": {"username": "John_Maxwell_IV"}}, {"_id": "4Pucf6tyqzzJBJ4vx", "postedAt": "2022-12-29T23:39:46.920Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>But your recommendation of defense-in-depth would I think have made this situation substantially worse. I think the best saving throws we had in this situation was people scrutinizing Sam and his activities, not trying to hide his involvement with stuff.&nbsp;</p><p>I think we had a bunch of good shots of spotting what was going on at FTX before the rest of the world, and I think downplaying Sam's actual involvement in the community would have harmed that.&nbsp;</p><p>I also think that CEA would have very likely approved any request by Sam to be affiliated with the movement, so your safeguard would have I think just differentially made it harder for the higher-integrity people (who CEA sadly tends to want to be associated less with, due to them by necessity also having more controversial beliefs) to actually be affiliated with EA, without helping much with the Sam/FTX case.</p>", "parentCommentId": "G9JhEgnrzyyjDxBFt", "user": {"username": "Habryka"}}, {"_id": "8ra9tfJEKeKpXBdk9", "postedAt": "2022-12-30T00:24:41.359Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>Interesting points.</p>\n<blockquote>\n<p>I think we had a bunch of good shots of spotting what was going on at FTX before the rest of the world, and I think downplaying Sam's actual involvement in the community would have harmed that.</p>\n</blockquote>\n<p>I could see this going the other way as well.  Maybe EAs would've felt more free to criticize FTX if they didn't see it as associated with EA in the public mind.  Also, insofar as FTX was part of the \"EA ingroup\", people might've been reluctant to criticize them due to tribalism.</p>\n<blockquote>\n<p>I also think that CEA would have very likely approved any request by Sam to be affiliated with the movement, so your safeguard would have I think just differentially made it harder for the higher-integrity people (who CEA sadly tends to want to be associated less with, due to them by necessity also having more controversial beliefs) to actually be affiliated with EA, without helping much with the Sam/FTX case.</p>\n</blockquote>\n<p>Re: controversial beliefs, I think Sam was unusually willing to bite bullets in public even by EA standards -- <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=XD5Yoc2xHxEbK87vT\">see here</a>.</p>\n<p>Presumably any CEA approval process from here on would account for lessons learned from Sam.  And any approval process would hopefully get better over time as data comes in about bad actors.</p>\n<p>In any case, I expect that paying for audits (or criticism contests, or whatever) is generally a better way to achieve scrutiny of one's organization than using EA in one's marketing.</p>\n", "parentCommentId": "4Pucf6tyqzzJBJ4vx", "user": {"username": "John_Maxwell_IV"}}, {"_id": "KYmGA3pB828DuMcYa", "postedAt": "2022-12-31T14:16:33.400Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<blockquote>\n<p>It seems likely that many of these problems could be avoided if parents encouraged children to eat chewier food.</p>\n</blockquote>\n<p>Why do you think this?</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "swjoS7jkcpHKxYEWv", "postedAt": "2023-07-03T17:23:28.822Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>Step one is establishing whether or not chewier foods, in fact, do promote jaw growth. It could be that hunter gatherers develop differently for a number of reasons (you mentioned some possibilities), or it could be the case that selection pressures on people with a long history of ancestors living in more developed civilizations have a history of weaker selection pressures on jaw development (or even competing pressures that lead to smaller jaws for some reason, as is the trend in human evolution compared to other primates).<br><br>But I like the idea!</p>", "parentCommentId": null, "user": {"username": "Holly_Elmore"}}, {"_id": "EBqTa7zinB67Jb4Gd", "postedAt": "2023-07-03T20:30:54.223Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>I'd recommend looking into vitamin K2 (along other fat-soluble vitamins involved ) and Weston Price's work. Some of that stuff goes a bit into quackery territory (like the massive fish oil consumption) but I think the case for the utility of vitamin K2 for bone/teeth along possible underconsumption (due to lack of eating liver/etc) of it in modern western diets is defensible.</p>\n", "parentCommentId": null, "user": {"username": "havequick"}}, {"_id": "6hfKorxexe8CmaEuA", "postedAt": "2023-07-04T08:20:23.867Z", "postId": "7fnMyCXuJftsFNKYJ", "htmlBody": "<p>Michael Keenan on Twitter <a href=\"https://twitter.com/michaelkeenan_0/status/1675933339302383616\">points to</a> an 2012 Wikipedia edit of his (see <a href=\"https://en.wikipedia.org/wiki/Malocclusion#Causes_2\">current version</a>). There's some studies on association between chewy food and jaw size in animals and <a href=\"https://academic.oup.com/ejo/article-abstract/9/1/15/539577\">one 1987 study</a> about chewing gum in children.</p><p>Other things can play a role still! Like whatever movements made it less likely for breastfed children to have underdeveloped jaws.</p>", "parentCommentId": "swjoS7jkcpHKxYEWv", "user": {"username": "Mingye Wang (Artoria2e5)"}}]