[{"_id": "fm4yz2xm9QNtBjW3y", "postedAt": "2023-07-31T10:28:30.997Z", "postId": "7gL7CFBmybjAjJvAw", "htmlBody": "<p>I just wanted to chime in and say that Serbia doesn't have the best reputation but is actually really nice. I just spent a couple of weeks in Belgrade and it's one of the most underrated places I've been to.&nbsp;</p><p>The <a href=\"https://www.google.com/search?sxsrf=AB5stBi2cFKQ9ZAlMPO5ehZkBiQDC7g3bQ:1690798964664&amp;q=church+of+saint+sava+belgrade&amp;tbm=isch&amp;source=lnms&amp;sa=X&amp;ved=2ahUKEwj_jbP93LiAAxVfRfEDHXSBCREQ0pQJegQIEhAB&amp;biw=1866&amp;bih=1072&amp;dpr=1.8\">most beautiful church I've ever been to in my entire life</a> is there. There are tons of old gorgeous buildings (interspersed with ugly appartment buildings). It feels just as safe as any other European city, including for women. There's a ton of graffiti, but that's about it in terms of crimey-ness. (Don't know the stats. Just know how I felt while I was there).</p><p>Not saying it's necessarily the best spot for an AI safety hub (why not Budapest, Prague, or Lisbon, if you're optimizing for cheap and European time zones?), but wanted to help fight against the reputation of Serbia. Belgrade is gorgeous and interesting and would highly recommend people living there for a few months.&nbsp;</p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "zzcRTHdzgfa6bKT6v", "postedAt": "2023-08-01T20:51:24.556Z", "postId": "7gL7CFBmybjAjJvAw", "htmlBody": "<p>Thanks for the lovely words Kat, happy to hear you had a great time! Next time you're around, ping EA Serbia, we make for great guides :)\nAs for why Serbia, visa policy is really the main considerations - Budapest, Prague and Lisbon are all equally unattainable to many weaker passport holders (something often underappreciated as our movement is mostly from the West). Serbia has the unique advantage of being visa free (sometimes for unlimited time!) for the west and many countries in the east.</p>\n", "parentCommentId": "fm4yz2xm9QNtBjW3y", "user": {"username": "Dušan D. Nešić (Dushan)"}}, {"_id": "mZcyryaQa9bBRd7Sg", "postedAt": "2023-08-16T16:21:57.036Z", "postId": "7gL7CFBmybjAjJvAw", "htmlBody": "<p>Bravo! 🙌</p>", "parentCommentId": null, "user": {"username": "David Solar"}}, {"_id": "5TyNGbKh4ZMQjwjzy", "postedAt": "2023-08-19T09:59:48.874Z", "postId": "7gL7CFBmybjAjJvAw", "htmlBody": "<p>Oh smart! Yeah, visas are a big issue for most people.&nbsp;</p>", "parentCommentId": "zzcRTHdzgfa6bKT6v", "user": {"username": "katherinesavoie"}}]