[{"_id": "TFEYkiP2B3T9iLd3c", "postedAt": "2014-12-19T19:44:34.578Z", "postId": "7GnJsRQXP7szHBSDA", "htmlBody": "<p>This gripe is at least partly derivative from my wider dislike of Oxfordian conceptual analysis, but I really do find this wanting, I'm sorry to say. I read it twice-over, and still found myself bereft of any demonstration of its main thesis, namely, that supererogatory giving is not morally unconditional; unless one counts the reference to the Parfit essay as independently sufficient. I have surely missed something?</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "HBi7MSHDktAFCgMkB", "postedAt": "2014-12-19T21:59:56.807Z", "postId": "7GnJsRQXP7szHBSDA", "htmlBody": "<p>Not sure I can offer you a <em>demonstration</em> of the main thesis, but I was hoping that people would share my intuition about the two lakes case.  (Also see the Kagan burning building case in note 2.)  The reference to Parfit was only for those who have doubts that one should save the greater number.  </p>\n", "parentCommentId": "TFEYkiP2B3T9iLd3c", "user": {"username": "Theron"}}, {"_id": "kXtYWXFFBYhzgGwud", "postedAt": "2015-08-12T06:10:51.040Z", "postId": "7GnJsRQXP7szHBSDA", "htmlBody": "<p>I had the intuitions you were looking for at first...but I'm not sure they withstood reflection!  In the basic case, I have $100 which I can (i) keep for myself, (ii) donate to an ineffective charity, or (iii) donate to an effective charity.  Surely (iii) is better than (ii) which is better than (i), but (ii) is impermissible while (i) isn't...likewise for (i) staying where I am, (ii) saving the one, and (iii) saving the 100.  In general, it's just odd when permissibility doesn't supervene on goodness in this way. </p>\n<p>The Kagan case looks at first like it has the same structure, but the intuitions there seem to depend at least in part on knowledge, as well as cost: the reason it's permissible not to enter the building is that you don't know there's a child in there.  Once you do know, perhaps saving the child is morally required, after all.  So it's not as clear that you have the same structure of (i)-(iii) as in your lakes case. </p>\n", "parentCommentId": "HBi7MSHDktAFCgMkB", "user": {"username": "Demosthenes"}}]