[{"_id": "nT3tjPczyaFXgLgNg", "postedAt": "2022-10-15T00:00:36.722Z", "postId": "7hCCdw8LhWFiMjCff", "htmlBody": "<p>Good points, but I feel like you're biased against foxes. First of all, they're cute (see diagram). You didn't even mention that they're cute, yet you claim to present a fair and balanced case? Hedgehog hogwash, I say.</p><p>Anyway, I think the skills required for forecasting vs model-building are quite different. I'm not a forecaster, so don't trust me on this. But if I were, I believe I would try to read much more and more widely so I'm not blindsided by stuff I didn't even know that I didn't know. Forecasting is caring more about the numbers; model-building is caring more about how the vertices link up, whatever their weights. Model-building is for generating new hypotheses that didn't exist before; forecasting is discriminating between what already exists.</p><p>I try to build conceptual models, and afaict I get much more than 80% of the benefit from 20% of the content that's already in my brain. There are some very general patterns I've thought so deeply on that they provide usefwl perspectives on new stuff I learn weekly. I'd rather learn 5 things deeply, and remember sub-patterns so well that they fire whenever I see something slightly similar, compared to 50 things so shallowly that the only time I think about them is when I see the flashcards. Knowledge not pondered upon in the shower is no knowledge at all.</p><figure class=\"image image_resized\" style=\"width:439.219px\"><img src=\"https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/81a89762c410688074e8051fbddf5c4216d02de125aaa2ba.jpg\" srcset=\"https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/81a89762c410688074e8051fbddf5c4216d02de125aaa2ba.jpg/w_112 112w, https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/81a89762c410688074e8051fbddf5c4216d02de125aaa2ba.jpg/w_192 192w, https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/81a89762c410688074e8051fbddf5c4216d02de125aaa2ba.jpg/w_272 272w, https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/81a89762c410688074e8051fbddf5c4216d02de125aaa2ba.jpg/w_352 352w, https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/81a89762c410688074e8051fbddf5c4216d02de125aaa2ba.jpg/w_432 432w, https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/81a89762c410688074e8051fbddf5c4216d02de125aaa2ba.jpg/w_512 512w\"></figure>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "PgRGAiS5BgaAvPy2P", "postedAt": "2022-11-05T15:44:23.332Z", "postId": "7hCCdw8LhWFiMjCff", "htmlBody": "<p>John von Neumann was a hedgefox.</p><blockquote><p>“The spectacular thing about Johnny [von Neumann] was not his power as a mathematician, which was great, or his insight and his clarity, but his rapidity; he was very, very fast. And like the modern computer, which no longer bothers to retrieve the logarithm of 11 from its memory (but, instead, computes the logarithm of 11 each time it is needed), Johnny didn't bother to remember things. He computed them. You asked him a question, and if he didn't know the answer, he thought for three seconds and would produce and answer.”</p><p>-- Paul R. Halmos</p></blockquote>", "parentCommentId": "nT3tjPczyaFXgLgNg", "user": {"username": "Emrik"}}]