[{"_id": "pPSRCF6sRDDWt8Mf7", "postedAt": "2021-11-07T16:00:16.500Z", "postId": "7heEBq7oZnMvbSbJa", "htmlBody": "<p>Welcome to the Forum!</p><p>It's not super clear to me what the goal of this post is. Are you arguing for a particular position (e.g. that we should put more moral weight on cleanliness/loyalty/etc in EA cause prioritisation) or just trying to inform people about alternative worldviews?&nbsp;</p><p>I think many people here are broadly familiar with Haidt's moral foundations theory. I'm personally pretty uncompelled by most non-welfare-based values I've seen proposed, but there are EAs that advocate for a more complex value system.</p>", "parentCommentId": null, "user": {"username": "willbradshaw"}}, {"_id": "BYJwMaAigHibwAXkW", "postedAt": "2021-11-08T01:18:38.443Z", "postId": "7heEBq7oZnMvbSbJa", "htmlBody": "<p>Thanks for the welcome.</p><p>I suppose &nbsp;I should have made my aims clearer. I'll remember that next time for my next post!</p><p>I believe my main goal with this post was not so much to address conflicts of values/norms by arguing for non-welfarist values/norms but rather to address any semantic disagreements that may arise from different interpretation of words like \"morality\" and \"ought\" thereby guiding people who make a semantic distinction between prudential vs moral ought to have be on the same page with people who do not make the distinction.</p><p>I hope that helps.</p>", "parentCommentId": "pPSRCF6sRDDWt8Mf7", "user": {"username": "imperfectscout"}}, {"_id": "2oojpvpsY6D7SNJwH", "postedAt": "2021-12-14T14:52:07.472Z", "postId": "7heEBq7oZnMvbSbJa", "htmlBody": "<p>Coming here a month late, I'd like to give some contrast to the other commenter:</p>\n<ol>\n<li>\n<p>This was very interesting and I didn't find a need for clarification of what the aims of the post were. Though this may just be because I share what I understood to be the aim: to make EA consider outside moral theories much more openly, and be aware that what we count as \"Good\" when we try to maximise doing good, may not be the same as what other people do (in particular, those whom we're trying to help).</p>\n</li>\n<li>\n<p>But - I found it hard to understand some parts because background knowledge was assumed that I don't have: in particular, I don't know what a \"moral ought\" is, nor a \"prudential ought\", nor indeed what \"ought\" means as a noun. I <em>certainly</em> was not familiar* with Haidt's theory (which you nicely explained), and I expect most people reading this to not yet be familiar with it.</p>\n</li>\n</ol>\n<p>*I happen to have bought Haidt's book some years ago, but I haven't read it yet and this doesn't change my point.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "9qSSGHMiqKcjrapgq", "postedAt": "2023-08-06T23:17:02.144Z", "postId": "7heEBq7oZnMvbSbJa", "htmlBody": "<p>It's been a couple of years since this was posted. I hope it's fine for me to comment on it after so long. I'm definitely into effective altruism, I'm familiar with Jonathan Haidt's moral foundations theory, and I'm particularly fascinated by the WEIRD bias. But I have my disagreements with some of what I perceive as Haidt's own biases. About the presentation of these ideas here, I must admit that I'm left feeling uncertain. It's been years since I read Haidt's book, and so the details are a bit fuzzy. Hopefully, we could clarify some of these issues and see how all of it might apply to effective altruism. But at the moment, it's not clear to me exactly how any of this, at least in the context of Haidt's work, might help. I'd likely take it in another direction, such as the affect of public health, which I'll touch upon below.</p><p>First off, let me explain some of my disagreements with Haidt, from my own liberal and WEIRD biased perspective. I'm not entirely convinced that liberals, the liberal-minded, and other WEIRDos necessarily lack any of the moral values, but that they express them differently. The problem is, as he defined them, he may have defined away those other expressions. And since his definitions informed how he framed those moral values in his research, I suspect he simply fed his own biases into his results. What I mean by this will be made more clear by some of the following examples, but the main point is that Haidt's theory is problematic for what it selectively includes and selectively excludes, while not acknowledging that one could just as easily or even more justifiably select otherwise. Haidt's biases seem like total blind spots.</p><p>Furthermore, quite likely all of his moral values could be reduced further to some basic overlapping personality traits: high openness (liberalism) and high conscientiousness (conservatism), thin boundary type (liberalism) and thick boundary type (conservatism), or something along those lines. Or to the opposite ends of some survival mechanisms: parasite-stress theory, behavioral immune system, sickness behavior, etc. Diverse research shows that, under stressful and sickly conditions (parasite load, pathogen exposure, inequality, etc), there are population level increases of sociopolitical conservatism, right-wing authoritarianism, and social dominance orientation; all three representing different kinds of anti-liberalism, anti-egalitarianism, etc; and all three measuring lower on liberal-minded openness. This stands out because the centrality of low vs high openness has no clear place within Haidt's moral foundations theory.</p><p>So, how much of this is really about WEIRD vs non-WEIRD? A healthy, low-stress hunter-gatherer population like the Piraha exhibit higher levels of non-authoritarianism, non-dominance, egalitarianism, and individualism. These are supposed to be WEIRD traits. Why do we sometimes see WEIRD or WEIRD-like traits in extremely non-WEIRD populations? Maybe because the there is a deeper set of causes having nothing to do with the WEIRD demographics and culture but, instead, having to do with the healthiness or unhealthiness of conditions. Many other traditional populations might exhibit non-WEIRD traits not because they aren't WEIRD but because they are under unhealthier and more stressful conditions. There are scientifically studied correlations, for example, between improving health conditions in a population, rising average IQ (Flynn effect), and increasing pro-social behaviors and social health (Moral Flynn effect).</p><p>To get to the above description and explanation of Haidt's work, some of it just feels off to me. The description of WEIRD feels like an outsider's view, which it is according to the individual who posted it, but specifically it feels like an outsider's view in that it doesn't capture the actual experience and motivation of many (most?) WEIRDos, at least that is what I'd argue. I speak as a representative of the WEIRD sub-species. I was raised middle class by college-educated teachers in the US, grew up in a hyper-liberal church, and have spent most of my life in a liberal college town. I've drunk deeply from the well of WEIRDness, and I'd like to think that I have some insight about what flavors it. Above, imperfectscout writes:</p><p>\"The welfarism (belief that welfare is the only thing with intrinsic value) that seems to be so prevalent in the EA movement ignores non-welfarist theories that recognize other sources of value, such as fairness, equality, or beauty. Welfarism is what happens when one's domain-of-moral-ought is based only on harm/care norms without regard for the other norms that exist; sometimes even going so far as to deny the existence of these other norms. Other values such as justice and liberty are merely thought as means to achieving the ultimate moral value of wellbeing or suffering-reduction. [...]&nbsp;</p><p>\"In WEIRD societies, where the domain-of-moral-ought is almost exclusively limited to concerns of welfare (care norms) and justice (fairness norms), only norm-violations such as harm and injustice are moralized and, therefore, considered to fall within the purview of moral ought. Norms pertaining to cleanliness, beauty, loyalty, politeness, obedience and sanctity are not intrinsically valuable according to WEIRD morality and so belong to prudential ought. Prudential oughts are adhered to not because they are moral obligations, but because they are instrumental norms which are valued insofar as they contribute to intrinsic values such as care.\"</p><p>Is that true? In my experience, welfarist concerns are rarely, if ever, considered in isolation. Liberal-minded WEIRDos, for example, seem to be far more obsessed about fairness, equality, justice, etc than are conservative-minded or traditional-minded non-WEIRDos -- there is a reason liberals, not conservatives, have a social justice movement. Or consider beauty. Social science research shows that liberals measure higher on aesthetic appreciation, and anyone would know that from how many liberals are into art, music, landscaping, decorating, and bodily adornment. Related to this, cleanliness is prioritized or even idealized by many WEIRDos. Go to any WEIRD house, neighborhood, community, workplace, etc; and you'll often fine a downright obsession with cleanliness and orderliness; both in terms of practical hygiene and the aforementioned aesthetics (e.g., litter is kept picked up in liberal cities, and not for any welfarist reasons). Haidt, by the way, points to the WEIRD love of systematizing (i.e., orderliness).&nbsp;</p><p>Then consider some of the other things mentioned. Much of political correctness is an extreme expression of politeness, as part of being kind, considerate, caring, and compassionate, but also being respectful. To go on, WEIRDos are loyal to larger inclusionary identities, rather than to narrow exclusionary identities. But of course, if we define loyalty as Haidt appears to do as adherence to and defense of narrow exclusionary identities, then we've defined loyalty from the get go according to a conservative bias. This one really sticks hard for me as a liberal, in that loyalty is one of my strongest values. It's just I realize that most conservatives would likely have no appreciation or even comprehension of what loyalty means to me and other liberals. It's because of loyalty to our liberal society that we can be intolerant toward those who betray and harm the sanctity of liberal values, such as right-wingers who seek to destroy democracy, to the point of aggressively seeking punishment of norm breakers (e.g., legal prosecution of Donald Trump and MAGA insurrectionists).</p><p>And WEIRDos are possibly obedient to more forms of authority than is the case with non-WEIRDos: democratically-elected officials, public servants, social workers, non-profit workers, community organizing leaders, protest leaders, librarians, teachers, professors, academics, researchers, scientists, authors, public intellectuals, doctors, inventors, explorers, etc; even religious or spiritual practitioners and aspirants such as meditation teachers, gurus, mystics, shamans, etc (i.e., those who seek divine or spiritual truths through direct experience, rather than authoritarian and hierarchical command). What differentiates WEIRDos is that they tend to think authority has to be earned, proven, demonstrated, and maybe used for public benefit; or else as an expression of values related to the dual trait of openness and intellectuality.</p>", "parentCommentId": null, "user": {"username": "Benjamin David Steele"}}, {"_id": "ZCoePG6aC4vedEgtq", "postedAt": "2023-08-07T16:29:02.881Z", "postId": "7heEBq7oZnMvbSbJa", "htmlBody": "<p>Reading this post, it didn't occur to me to ask the reason it was being posted. I assumed it was for general information, the sharing of which doesn't necessitate a specific reason. But I wouldn't have guessed the author's actual purpose, as stated in their response here, just by reading the post. For whatever purpose, it does seem highly relevant to effective altruism, if only in understanding what motivates people and what frames their way of thinking, perceiving, acting, and speaking. Though I disagree with aspects of Haidt's theory, I do appreciate that he has inspired so many people to think more deeply about a topic that typically would be taken as dry, tedious, and boring. That is quite an accomplishment. I just would hope that people would take Haidt's work as a starting point for public debate, not an ending point as a final explanation.</p><p>One thing this post did clarify in my mind is the welfare angle, something I hadn't previously given much thought to in this context. As humans are complex, WEIRDos too, it never occurred to me to think of welfare as an expression of separate and isolated values (with there supposedly also being non-welfare-based values), rather than as a focus that could represent numerous values-based motivations. Apparently, there is something relevant in that interpretation, given Will's comment above that, \"I'm personally pretty uncompelled by most non-welfare-based values I've seen proposed.\" But couldn't both perspectives be true? Personally, I can't imagine any value could be unrelated to welfare, be it consciously or unconsciously motivated, and no matter how framed and interpreted. If so, it's merely human, not WEIRD, to focus on welfare. Then again, maybe I only think this way because I'm a WEIRDO -- it's like a Catch-22, no escape!</p><p>Of course, I have my rational reasons for thinking this way; and, yes, holding rationality as a primary, idealized, and normative standard is a bit WEIRD as well. So, let's embrace this supposedly WEIRD take on things for a moment. Like Haidt, another WEIRDo, I'm biased to trust social science researchers to inform my understanding, as opposed to basing my views of human nature on the patriarchal authority, theocratic law, religious texts, conventional truisms, received wisdom, or whatever. The main disagreement I'd have with Haidt is not his social science framing which fits my WEIRD predilections, but instead where I perceive him as diverging from that by introducing unstated cultural biases and not appreciating how pervasive and powerful are those cultural biases. It's funny how he is seeking to understand the non-WEIRD and non-liberal as a WEIRD liberal, with some critics pointing out how his moral foundations theory itself is a highly WEIRD way of thinking about morality.&nbsp;</p><p>I'm not sure he really grasps what non-WEIRD looks like in its full glory, as he apparently is unfamiliar with the anthropological record showing the extreme far end of traditionalism as seen among indigenous tribes. His main point of reference is not only Western society but also modernized and urbanized non-Western societies, that are increasingly modernized, urbanized, and Westernized, that is to say WEIRDified and liberalized across entire populations, not limited to a single political group or social demographic. As such, the Western (or otherwise modernized and urbanized) conservatives he typically uses as a contrast are merely somewhat less WEIRD, not actually non-WEIRD, not actually traditional, since traditionalism disappeared in the West when feudalism ended, and has disappeared in most of the modern non-West as well (see Karen Armstrong's distinction between traditional religion and fundamentalist religion: non-literalism vs literalism, pre-scientific theology vs pseudo-scientific theology; and see Corey Robin's distinction between the traditionalism of the Ancien Regime and the reactionary mind of modern conservatism).&nbsp;</p><p>So, Western conservatives too are relatively liberal-minded and relatively liberal in general (socially, economically, and politically); as compared to fully non-WEIRD populations. He is focusing too much on liberals proper as a culprit, which is understandable as it's the group he is familiar with as a fellow liberal, but my sense is this blinds him to the larger context in how others (i.e., those not in the WEIRDest demographic) are also being affected by the same set of factors. Liberals, specifically within the Western educated professional class and creative class, may simply be the canary in the coal mine. Also, being overlooked is that many conservatives themselves are straight up WEIRDos themselves, not merely relatively so. Interestingly, the middle-to-upper class (the 'R' in WEIRD), a well-educated demographic (the 'E' in WEIRD), is disproportionately drawn to the Republican Party with its conservative politics. It stands out that Haidt never mentions this fact, as it doesn't fit into his analyses and conclusions.</p><p>The problem I see is not that Haidt is WEIRD, in the way all liberals are WEIRD. That WEIRDness of liberalism is undeniable. There is at least one scientific paper, of which Haidt is a co-author, that measured the high rates of WEIRD traits among liberals: \"Liberals Think More Analytically (More “WEIRD”) Than Conservatives.\" Instead, it's more of an issue of not recognizing how WEIRD all of us are, including Western conservatives who are far more individualistic and analytical than most non-WEIRDos, such as rural farmers in Asia or hunter-gatherer tribes in Africa. Everyone in the Western world has gotten quite WEIRD and, according to Joseph Henrich, the development of WEIRD began largely with literacy, something that has been spreading for millennia at this point, if the mass spread of it first took hold in the West. Related to this, it's no coincidence that there has been a simultaneous rise of sociopolitical liberalism, mandatory public education, literacy rates, and average IQ; along with public health standards (hygiene, sewage systems, vaccines, nutritionally fortified foods, etc).&nbsp;</p><p>I'll get to that in greater detail, but just note the increasing liberalization of our society in public polling with the whole population lurching leftward. For example, most American conservatives now accept same sex marriage as a civil right. Or consider that many Americans who identify as 'conservative' with a forced binary choice will, if given a third choice, pick 'progressive'. And that can be put in context of the apparent fact that more American conservatives would identify as classical liberals than as classical conservatives, as almost no one wants to be associated with classical conservatism: imperialism, colonialism, land theft, exploitation, genocide, slavery, etc. The average conservative today is more liberal than was the average liberal a century ago. With that in mind, it's probably also the case that conservatives, along with the entire Western world, has become more WEIRD over time. In many Western countries like in Scandinavia, even right-wingers defend liberal social democracy. No doubt American conservatives have entirely abandoned traditional economics.</p><p>Here is the real zinger. That study done by Haidt, et al pointed out that it wasn't merely about Western culture but apparently something within the entirety of modern, urban society; all of it, at this point, operating within capitalist realism and neoliberal globalization. The authors of that paper point out that one of the studies \"replicates this finding in the very different political culture of China, although it held only for people in more modernized urban centers.\" So, the most fundamental distinction is between the degree places have been modernized and urbanized or not. But even that in and of itself doesn't necessarily tell us anything about what precisely is causing the change, obviously not limited to the West, but the acronym EIRD is not quite as catchy. Is modernization and urbanization simply a telltale sign of how likely a society has gotten hooked into Western economics and culture, and hence how Westernized it's become? So, in a sense, does the 'W' in WEIRD also apply to Westernized non-Western countries?</p><p>To understand our purposes in relation to such information and theorizing, we'd need to know what causes we are dealing with, either to support those causes in further promoting the changes as desirable or the opposite. If nearly everyone (liberal and conservative, Western and non-Western) is becoming more WEIRD or rather more EIRD, is that good thing? Also, whether or not it's a good thing, it might be false, misleading, and unhelpful to scapegoat Western liberals as uniquely WEIRD and hence problematic. Most of the world might be quite unlike Western liberals, but the gap between the WEIRD and supposed non-WEIRD is shrinking. Once most Easterners are modernized and urbanized, will we still be able to talk about a difference of Eastern and Western ways of thinking? Or is this global homogenization not inevitable? Maybe it's not modernization and urbanization in its totality but a specific variety of it. We could untangle one possible factor by looking at other research.</p><p>Intriguingly, that paper was not only co-authored by Haidt but by another researcher, Thomas Talhelm, with his own theory. Talhelm has done research comparing and contrasting rice-growing cultures and wheat-growing cultures. But in at least one study, he did it in a useful way to control for confounders. This other study limited itself to China, as historically southern China grew rice and northern China grew wheat. Indeed, he found that people who grew up in areas of wheat farming thought and acted more like Westerners, that is to say more individualistic and analytical, no matter if they were or weren't modernized and urbanized. Now that throws a wrench into the works. It really isn't merely about Western liberals at all, and so the accuracy of the whole WEIRD acronym in describing the demographics of these kinds of people becomes increasingly uncertain.&nbsp;</p><p>Talhelm's theory is that wheat farming can be done by an individual farmer, whereas rice farming requires an entire community not only to farm but to build and maintain canals and irrigation systems. Accordingly, whole cultures form around these agricultural systems. That seems plausible and I'd be surprised if it isn't a causal factor, whether or not the primary one. The thing is do distinct agriculturally-based cultures persist for generations after most people are no longer directly involved in farming? Maybe that is why all populations, no matter the location, become more WEIRD-like with expanding modernization and urbanization. That alone could explain much, although it just brings us back to the question of what it all really means. Is it the modernization and urbanization itself enacting the mental shift? Or are these proxy indicators for other causal factors?</p><p>There is one other detail that gets overlooked, that is what people were and now are eating. Rice farmers eat a lot of rice, as wheat farmers do wheat. What has changed is that, among modernized and urbanized Asians (Chinese, Japanese, etc), their traditional rice-based diets have become ever more Westernized, specifically in including larger amounts of wheat. We know there are nutritional differences of the two staples. Wheat, for example, seems to have a more addictive quality to it. This might relate to the fact that wheat has dopaminergic (dopamine-affecting) peptides and exorphins (in-dwelling morphine-like substances). Also, a diet high in grains promotes the growth of the gut Prevotella gut microbe, which overgrowth of is linked to autism. Removing wheat, in particular, from the diet has improved the symptoms for many autistics. As a side note, wheat has likewise been linked to worsening schizophrenia.</p><p>Haidt argues that there is something autistic-like about Western philosophy, a speculation I'm not sure is justified, if an interesting consideration. But in support of this hypothesis, it could be noted that wheat was hard to grow in the past and largely limited to the elite, before the surplus grain yields that began in the 19th century. So, if wheat does alter neurocognitive development and functioning, we would expect to find it first among the elites, be they intellectual elites or liberal elites (e.g., philosophers). That brings us back around to why we should be talking about this here. Some of these Western elites have profoundly shaped our modern thinking, especially among WEIRDos, on morality, ethics, and values. Haidt apparently is seeing a connection between the increasing prevalence (and/or dominance?) of both liberalism and autism, although he doesn't seem to attempt to explain why this would be happening (not that I recall), other than some vague hegemonic enculturation I presume.</p><p>Besides the differences and changes in diet, let's now return to the public health angle. That also involves diet, along with much else. First off, it's hard for many of us modern Westerners now to imagine the disease epidemic, mental health concerns, and maldevelopmental issues that occurred during the process of mass urbanization and industrialization. In the US, that transition mostly happened at the turn of the 20th century. It was a public health crisis as moral panic, but it wasn't fully taken seriously by the federal government until World War II when it was discovered, during the draft, that a large number of American men were physically unfit for military service; and then it was a national problem, potentially an existential threat. That is why, after the war, there was a concerted push for school food programs, nutritional fortification of foods, better application of vaccinations, building of sewage systems where they'd been lacking, etc. Talk about effective altruism on the mass scale.</p><p>This, of course, decreased severe nutritional deficiencies that improved neurocognition and, along with education, helped raised the average IQ (i.e., Flynn effect). Better nutrition also lessened immunocompromise that made people less vulnerable to infectious disease. At the same time, more hygienic living conditions, along with clean air and water, ensured decreased exposure to pathogens and parasites. The thing is this doesn't merely effect intellectual ability but also personality and politics, morality and behavior (i.e., Moral Flynn effect); for contrast, see what high lead toxicity rates does for individuals and populations (lower IQ, learning disabilities, aggressive behavior, impulse control impairment, violent crime, etc). Numerous studies have repeatedly confirmed that sickly and stressful conditions (high parasite load, high pathogen exposure, etc; but also high inequality, etc) are correlated to higher population levels rates of sociopolitical conservatism, right-wing authoritarianism, and social dominance orientation; though each of these measures independently at the individual level.&nbsp;</p><p>What does it mean that distinct measurable personality constructs constellate around the same or similar conditions? This can lead to uncomfortable and divisive discussion. One of the WEIRD tendencies, found among modern urbanized liberals and conservatives alike (and among literate people in general), is that we tend to think abstractly of personalities, politics, morality, and such as almost being essentialist and non-contingent (i.e., not holistically understood as affected by and inseparable from the environment); if not necessarily genetically deterministic. It feels alien to us to point to the social science research that shows individual and population levels of personality measures, as related to politics and morality, can so easily be altered by environment. Some would perceive such an assertion as a personal attack on their values and identity, as it suggests that we rarely know why we hold the positions we do, with more of our beliefs being closer to ad hoc and post rationalizations that only seem compelling because they form into collective biases, echo chambers, and reality tunnels.</p><p>What might seem even more shocking is how easy this can be done, how simply we are manipulated, our very minds and identities altered. Judges can be made more punitive simply by having them sit on a hard chair. And liberals can be made to express conservative-style language of stereotypes just by getting them slightly inebriated. But change the entire conditions of society and everything can be transformed simultaneously, such that the ground shifts beneath our feet and the world is rearranged, sometimes with few people noticing it happened, and even fewer remembering later on (i.e., historical amnesia). That undermines our notion of morality as universal and unchanging principles, a highly WEIRD mindset shared by most Western liberals and conservatives. WEIRDos value consistency above all else. Our entire Western civilization is built on this (equality before the law, liberal proceduralism, due process, civil rights, human rights, etc). We take this WEIRD culture as so normalized as to be the perceived default, the obviously proper and right way of doing things.</p><p>After that long diatribe, what is the relevance of this to effective altruism? The question, as always, is altruism for who and effective toward what end? Depending on the conditions and purpose, multiple responses can be considered morally-motivated with pragmatic moral results. Consider what was mentioned above about sickly and stressful conditions, in engaging and upregulating the psycho-social response of sociopolitical conservatism, right-wing authoritarianism, and social dominance orientation; with all being various expressions of the disengagement and downregulating of liberal-mindedness, such as how all three show lower measures of the defining feature of liberalism, the personality trait of openness to experience. From an evolutionary response, these three are supporting strategies of adaptive and survival behavior. In social science research, this non-liberal profile is linked to disgust response, threat response, and what I'd call the stress-sickness response (or what, in the research literature, is called the parasite-stress theory and behavioral immune system).</p><p>Under risky, threatening, or outright dangerous conditions, across millions of years of hominid evolution (and probably further back), the human species and its precursors wouldn't have survived if at those times they hadn't become more conservative, authoritarian, and dominating. But the problem is that, since agricultural settlements and worsening over time, what had been occasional and relatively brief periods of stress and sickness turned into permanent conditions for many societies (i.e., shit life syndrome). This has been exacerbated to an extreme with the consequences of the highest inequality seen in human history (Keith Payne, The Broken Ladder). The question is if optimally effective altruism possible at all, until we resolve the public health crisis. Yet resolving the public health crisis would be the greatest act of effective altruism.&nbsp;</p><p>How do we get there? That leaves us with a challenge, to say the least. Those who are the most sickly and stressed-out (e.g., high rates of disease, parastism, poverty, and inequality in the Deep South) are precisely the same people who would both benefit the most from public health measures and offer the most resistance to implementing them (e.g., high rates of conservatism and authoritarianism in the Deep South). In the US, something as simple as sewage systems for everyone, not only the rich, were originally opposed by almost everyone other than municipal socialists; it just wasn't affordable or was too difficult, critics likely said. Well, what's affordable depends on what we are willing to invest in. And it is an investment in that it pays out generous dividends in public benefits, as experienced individually and collectively.&nbsp;</p><p>Look, for example, at how many IQ points increase on average when parasitism or lead toxicity are reduced; and then look at how much lifetime earnings increases per increased IQ point; as such things have actually been calculated. Isn't that what effective altruism is all about? It's doing good that leads to good results, right? We need to achieve with other measures of public health what those municipal socialists did in their own era of rule in the early 20th century (e.g., Milwaukee sewer socialism). It's the same thing the Scandinavian and a few other countries (e.g., Japan) have achieved with well-funded social democracy. Everything is impossible until it becomes real. That same conflict was faced in those other countries as well, such as Finland having been plagued by problems (social, economic, and political) a century ago. Somehow, those Finnish were able to imagine something as possible that their opponents declared impossible. Then they acted on that imagined possibility and made it a social reality.&nbsp;</p><p>Is this vision I offer biased by WEIRDness? I don't know. Maybe, probably. Even if it is, is that a problem? Should we not still pursue it? After all, the WEIRD bias is as American as apple pie, and increasingly the beating heart of Western civilization. Maybe without WEIRD mentality, culture, and bias all of the things we love about modern liberal society wouldn't be possible at all. Is there really any point in trying to convince illiberal opponents of this being true? Probably not. We just need to find ways to change the conditions that promote illiberalism in the first place. After that, we might find many former opponents becoming less strong in their opposition, with some even finding they have a change of heart. That is to say, without realizing it, they might find themselves becoming more WEIRD and/or more liberal-minded (i.e., operational ideology), even if they continue to identify as conservatives (i.e., symbolic ideology). We don't need to rationally convince anyone, or even try to translate our ideas into their language. Rather, what is needed is to change the conditions in which they think and so then they'll be able to have new thoughts.</p>", "parentCommentId": "pPSRCF6sRDDWt8Mf7", "user": {"username": "Benjamin David Steele"}}, {"_id": "T3s6pJEAmSGBc4Qdv", "postedAt": "2023-08-07T16:43:07.394Z", "postId": "7heEBq7oZnMvbSbJa", "htmlBody": "<p>Is health on the care/harm axis?&nbsp;</p><p>I can't really get behind a sort of \"all tastebuds are equally valid\", I think it's fine to prioritize some tastebuds over others, because I think some are more upstream than others. If you're not relentlessly assaulted by diseases you can better navigate and iteratively figure out where on the liberty/oppression axis you're most adapted to, or for any other axis, so I think a sort of \"solve health/wealth to give people the slack to figure out the other sources of moral value for themselves in virtuous cycles\" is sufficiently compelling. That's why welfarism is good.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}]