[{"_id": "yEfXCdGchpzDZmstY", "postedAt": "2023-05-27T10:14:03.264Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Not sure if I missed it, but another factor might be AMR. (Anti-microbial resistance is a mechanism for factory farming leading to pandemics, which you mention. But AMR causes other harms too)</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "6uDYm3tGb7wPXo788", "postedAt": "2023-05-27T14:42:24.059Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Thanks! I have now added:</p><blockquote><ul><li>Mitigating <a href=\"https://www.who.int/news-room/fact-sheets/detail/antimicrobial-resistance\">antimicrobial resistance</a>:<ul><li>From <a href=\"https://aricjournal.biomedcentral.com/articles/10.1186/s13756-019-0671-7\">Carrique-Mas 2020</a>, \"the greatest quantities of antimicrobials (in decreasing order) were used in pigs (41.7% of total use), humans (28.3%), aquaculture (21.9%) and chickens (4.8%). Combined AMU in other species accounted for &lt; 1.5%\".</li><li><a href=\"https://www.pnas.org/doi/full/10.1073/pnas.1503141112\">Boeckel 2015</a> projects that \"antimicrobial consumption [in livestock production] will rise by 67% by 2030 [relative to 2010]\".</li></ul></li></ul></blockquote>", "parentCommentId": "yEfXCdGchpzDZmstY", "user": {"username": "vascoamaralgrilo"}}, {"_id": "nWWzqNpFNKCTrsbYD", "postedAt": "2023-05-28T14:11:39.201Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Would you be against breeding (forcibly impregnating) humans, giving them good lives then murdering and eating them? That would be \"net positive\" according to your logic.</p>\n", "parentCommentId": null, "user": {"username": "matty"}}, {"_id": "NH94ZNj6hqzcq7D3g", "postedAt": "2023-05-28T15:17:55.150Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Thanks for the thought experiment!</p><p>I am very strongly against forcibly impregnating or murdering humans under almost all circumstances, including the one you describe. Humans are not only moral patients, but also moral agents, and these being forcibly impregnated or murdered is highly anti-cooperative. I follow expectational total hedonistic utilitarianism, but this only justifies creating net positive lives all else equal. In a society where humans are forcibly impregnated and murdered for food, I think it is fair to say that all else would not be equal! One should take into account the actions involved in the creation of lives, and forced impregnation and murder are actions with pretty bad consequences. For example, they would tend to normalise violence and inequality, which correlate with lower wellbeing longterm.</p><p>These concerns apply to animals too. Forcibly impregnating or murdering animals is still uncooperative, and my ideal world does not involve those. However, by decreasing the consumption of animals, one may accidently increase the suffering of wild animals, and the existential risk from ASRSs. So, as a precautionary measure, I think it would be better to increase resilience to ASRSs before/while driving down the number of factory-farmed animals. I think welfare reforms are more robustly good because they significantly decrease the suffering of factory-farmed animals while not decreasing much the resilience against ASRSs, at least in the nearterm (in the longer term, continued welfare reforms will increase prices, and therefore decrease the consumption of animals).</p>", "parentCommentId": "nWWzqNpFNKCTrsbYD", "user": {"username": "vascoamaralgrilo"}}, {"_id": "F3yL2ynRKNx3itF2K", "postedAt": "2023-05-28T15:30:20.535Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>So the thing wrong with breeding, murdering and eating humans is the harmful effects it would have on other humans not the treatment of the victim?</p>\n", "parentCommentId": "NH94ZNj6hqzcq7D3g", "user": {"username": "matty"}}, {"_id": "Qkto57WeLWfLpwkL4", "postedAt": "2023-05-28T18:24:29.020Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>I wonder how the magnitude of these various effects would scale between 1 additional percent of the population going vegan vs. 10 percent vs. 100 percent.</p>\n<p>Specifically, at least in the medium run, it seems that many of the inputs of producing crops are sunk costs, and that a reduction in the demand for farmed animal feed would cause agricultural producers to keep growing many crops but try to sell them as biofuel material. At least here in the US, Big Corn is powerful and could probably get Congress to mandate / subsidize more biofuel use to a certain point. Or they could probably get some other method to maintain a crop market and keep the farmers / ag lobby content, again to a certain point.</p>\n<p>So I am not confident a small-to-medium refuction in animal feed demand would ultimately impact crop acreage that much. I don't know about other markets though!</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "dpuAPJSf9eaByJiTp", "postedAt": "2023-05-28T18:35:26.185Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>My understanding was that, in the though experiment you described, \"the victim\" would have a good/positive life. By definition, having a good/positive life means it being lived is better than it not existing, everything else equal. So there is a sense in which I would be happy to add positive lives to the universe regardless of what they involve, as long as the expected total hedonistic utility of the rest of the universe did not decrease (or decreased less than the extra utility coming from the added life). In practice, the situation you described being good is highly implausible.</p>", "parentCommentId": "F3yL2ynRKNx3itF2K", "user": {"username": "vascoamaralgrilo"}}, {"_id": "R4Rxxcjh8PsqBFLuW", "postedAt": "2023-05-28T18:53:58.324Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Great point, Jason!</p><blockquote><p>So I am not confident a small-to-medium refuction in animal feed demand would ultimately impact crop acreage that much.</p></blockquote><p>I agree confidence is not warranted.</p><blockquote><p>I don't know about other markets though!</p></blockquote><p>It <a href=\"https://ourworldindata.org/grapher/biofuel-production?tab=map&amp;time=latest\">looks like</a> there is significant variation across countries (the relevant metric is per capita production, but I did not immediately find it):</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/fyyttkbd5vaijeytuwsd\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/bb1ndne1zsex9g9gcqen 320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/xebbhlceyz5hpxzsdzqe 640w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/lxwbuy19breohn3rsr4z 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/mfc36f4ssnaxuybesgfs 1280w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/vidqjeamoucnh7guytnb 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/ntljj46bkglvfyxdazn1 1920w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/pyqv8jczkmsnm9o50k86 2240w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/m91lqfst7vngusvxy3qb 2560w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/hjhi9lfl0pwqgt3sdasw 2880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/R4Rxxcjh8PsqBFLuW/ir88pahqbv3tjx4wjpii 3184w\"></figure>", "parentCommentId": "Qkto57WeLWfLpwkL4", "user": {"username": "vascoamaralgrilo"}}, {"_id": "d6m3exiwyxQKBcFx5", "postedAt": "2023-05-28T22:38:13.344Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>The same crops are already used for bioethanol before being sold and fed to farmed animals, as distillers grains. Decreasing animal product consumption could therefore reduce bioethanol revenues from selling the byproducts for feed, but it could also reduce input grain costs.</p>\n", "parentCommentId": "Qkto57WeLWfLpwkL4", "user": {"username": "MichaelStJules"}}, {"_id": "CbsEKKQxZARtKa76Y", "postedAt": "2023-06-02T17:13:52.223Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<blockquote><p>Decreasing the production of animal feed, and therefore reducing crop area, which tends to: Increase the population of wild animals</p></blockquote><p>&nbsp;</p><p>Could you share the source for this? I've wondered about the empirics here. Farms do support wild animals (mice, birds, insects, etc), and there is precedent for farms being paved over when they shut down, which prevents the land from being rewilded.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Rocket"}}, {"_id": "rxo6vXKtbJHaRpcgd", "postedAt": "2023-06-03T08:36:53.675Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Thanks for asking!</p><p>70 % to 80 % of deforestation <a href=\"https://ourworldindata.org/drivers-of-deforestation\">is</a> driven by conversion of primary forest to agriculture or tree plantations:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/b03onkmym4brbnijjph6\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/izvtm406uabovkfqvkb0 140w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/hsorqptzmijcbqmjugbb 280w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/ujyeaaxaictg30tzjnol 420w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/uk6gtcbzz7mexwqv7gjs 560w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/oljdftd6fdwxwopocd7p 700w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/xbaowllsja7ic6gkopfe 840w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/kkcamntaa12uuls9fdu0 980w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/vhtmbphlkfgnhuudjiyo 1120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/px7nkcoo7neyk4g1pdyx 1260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/rxo6vXKtbJHaRpcgd/qw3hp6oeyr3jf7m31mxd 1354w\"></figure><p>Since more agriculture tends to result in more deforestation, I guess less agriculture leads to less/more deforestation/forestation. In any case, I do not know whether terrestrial arthropods have good or bad lives, so regardless of whether their population would increase or decrease due to greater consumption of animals, I would not be able to tell whether the effect was good or bad.</p>", "parentCommentId": "CbsEKKQxZARtKa76Y", "user": {"username": "vascoamaralgrilo"}}, {"_id": "3jsrJ7JpybeSMbDCD", "postedAt": "2023-06-06T20:09:18.514Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Thanks for this! I would still be interested to see estimates of eg mice per acre in forests vs farms and I'm not sure yet whether this deforestation effect is reversible. I'll follow up if I come across anything like that.</p><p>I agree that the quality of life question is thornier.</p>", "parentCommentId": "rxo6vXKtbJHaRpcgd", "user": {"username": "Rocket"}}, {"_id": "f3ZEj7e7d9did6ksF", "postedAt": "2023-06-07T14:44:20.558Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>You are welcome!</p><blockquote><p>I would still be interested to see estimates of eg mice per acre in forests vs farms</p></blockquote><p>Brian Tomasik has some <a href=\"https://reducing-suffering.org/how-rainforest-beef-production-affects-wild-animal-suffering/#Parameter_settings\">estimates</a>. For rainforest, the density of wild terrestrial arthropods as a fraction of the global mean is 1.02 to 5 (95 % confidence interval). For <a href=\"https://pt.wikipedia.org/wiki/Cerrado\">Cerrado</a>, which is a proxy for farmland, it is 0.70 to 3.00. I <a href=\"https://forum.effectivealtruism.org/posts/HwDZ6oHtz34kBAsts/finding-bugs-in-givewell-s-top-charities%23Decrease_in_density_of_terrestrial_arthropods_due_to_deforestation#Decrease_in_density_of_terrestrial_arthropods_due_to_deforestation\">fitted</a> lognormal distributions to these values, and got that the expected value for the density of wild terrestrial arthropods in rainforests is 72.4 % (= 1.55/0.899 - 1) higher than that for Cerrado. Overall, it looks like there are more wild terrestrial arthropods in forests, but it is not super clear, judging from the overlap between the 95 % confidence intervals.</p><blockquote><p>I'm not sure yet whether this deforestation effect is reversible.</p></blockquote><p>Yes, I do not know either. From the point of view of resilience against ASRSs, it would be good if abandoned farmland remained deforested such that it could quickly start being used if needed.</p>", "parentCommentId": "3jsrJ7JpybeSMbDCD", "user": {"username": "vascoamaralgrilo"}}, {"_id": "jqLhn6Zq4NLJmg74y", "postedAt": "2023-06-07T17:09:27.644Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Fantastic, thanks for sharing!</p>", "parentCommentId": "f3ZEj7e7d9did6ksF", "user": {"username": "Rocket"}}, {"_id": "JxaEdCJJKKT6FJWMK", "postedAt": "2023-06-10T09:14:33.028Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>So if some people went off to live very remotely in the woods with no contact with other people and started breeding, murdering and eating humans where the children's lives are \"net positive\" that would be okay to you?</p>\n", "parentCommentId": "dpuAPJSf9eaByJiTp", "user": {"username": "matty"}}, {"_id": "vs8QXiMtG8KA8JcWp", "postedAt": "2023-06-10T09:41:05.929Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Everything else equal<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefn9m897jwol\"><sup><a href=\"#fnn9m897jwol\">[1]</a></sup></span>, I would rather have such children exist. However, I would not be okay with that situation, because I think we can do much better. For example, if the children had net positive lives, it would make sense to let them live longer. A situation where each person decides when to end their lives painlessly would also be better than one involving murders.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnn9m897jwol\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefn9m897jwol\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This would be impossible. For example, the children would have to eat, and the production of food would influence the population of wild animals.</p></div></li></ol>", "parentCommentId": "JxaEdCJJKKT6FJWMK", "user": {"username": "vascoamaralgrilo"}}, {"_id": "nNzZtp3gk6BzSTbHX", "postedAt": "2023-06-10T09:50:26.614Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>But if they repeatedly bred humans and killed them there would be just as much \"utility\" as if you let the children live longer so it's all good!</p>\n", "parentCommentId": "vs8QXiMtG8KA8JcWp", "user": {"username": "matty"}}, {"_id": "LqS7sSyBed7rsFG5Q", "postedAt": "2023-06-10T17:42:29.930Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>We're issuing <a href=\"https://forum.effectivealtruism.org/users/matty\">matty</a> <strong>a 1-week ban</strong> for this comment thread; matty’s comments here are counterproductive and not a type of discourse acceptable on the Forum. They’re very rhetorically loaded (and almost entirely phrased in the form of rhetorical questions — a bad idea for a collaborative discussion) and they don’t seem to be serious or remotely charitable attempts to understand Vasco’s point of view.</p><p>E.g. I don’t think that a reasonable reader can actually believe that Vasco’s answer to matty’s question <a href=\"https://forum.effectivealtruism.org/posts/7hMgK4hciBhXmBRnW/do-you-think-decreasing-the-consumption-of-animals-is-good?commentId=F3yL2ynRKNx3itF2K\">here</a> — “So the thing wrong with breeding, murdering and eating humans is the harmful effects it would have on other humans not the treatment of the victim?” — is “Yes.”</p><p>The comments also heavily lean on using graphic descriptions of violence towards humans in a pretty careless way, which doesn’t help; that kind of content should be approached more thoughtfully.</p><p>I think it’s possible to outline strong disagreement and to point out possible contradictions (both of which can be incredibly useful) while still <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">following Forum discussion norms</a>. I’d want to see this from matty in the future.</p>", "parentCommentId": "nNzZtp3gk6BzSTbHX", "user": {"username": "Lizka"}}, {"_id": "DTWkhBhAsfWHJxKuL", "postedAt": "2023-06-10T19:50:21.799Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>This seems a really weird ban to me to be honest.\nI don't see why in ethical discussions we can't use extreme cases that try and stir an emotional reaction- in many ways our emotions are a key tool in deciding what is ethical.\nAnd with regards to the example you have given, I very much think a reasonable person can take Matty's interpretation of Vasco; indeed, I still don't see why this interpretation is incorrect. Vasco seems to be suggesting that as long as ones life is worth living, been bred for slaughter is only morally bad because of the impacts on other people, not on the person being slaughtered it seems like highlighting a key crux between kantian and utilitarian viewpoints, rather than being uncharitable.</p>\n", "parentCommentId": "LqS7sSyBed7rsFG5Q", "user": {"username": "Gideon Futerman"}}, {"_id": "hNAfhab3qxcu3Eexk", "postedAt": "2023-06-11T08:31:38.724Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>I agree that the same points could have been made in a less counterproductive way. Specifically, I found them a bit aggressive and condescending (like \"gotcha!\"). I can see how this could warrant a temporary ban. (I don’t have strong views either way about whether it should.)</p>\n<p>I also agree that \"forcibly impregnating\" is graphic and I'm not sure if it's even generally accurate for animal agriculture, since I expect milder reactions from farmed animals than \"forcibly\" suggests.</p>\n<p>However — and I don’t know if you had them in mind, so you can correct me if you didn't — the other terms, like 'breeding', 'killing' and 'eating', don't really have any better alternatives for making the same points. They're also standard terms in both animal ethics and animal agriculture (well, 'slaughter' instead of 'killing', and 'slaughter' is both more precise and graphic, or sometimes 'dispatch', 'process' or 'harvest', which are much less precise/descriptive and less graphic; and 'murder' isn't applicable to nonhuman animals, because it refers to unlawful killing.) I don't think we should deter people from using them.</p>\n<p>(EDITED)</p>\n<p>I'm not sure either way whether the example you pointed out was a reasonable interpretation of what Vasco wrote, but I think that's what votes and explanations should be used for, unless it becomes a disruptive pattern. Vasco did refer to both reasons applying to the direct victims and reasons applying to others affected, and the OP is mostly about whether or not the effects on others are generally more important than the effects on farmed animals.</p>\n", "parentCommentId": "LqS7sSyBed7rsFG5Q", "user": {"username": "MichaelStJules"}}, {"_id": "GqYFELKHcH4N6xrd3", "postedAt": "2023-06-11T09:38:35.329Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Thanks for commenting, Gideon.</p><blockquote><p>And with regards to the example you have given, I very much think a reasonable person can take Matty's interpretation of Vasco; indeed, I still don't see why this interpretation is incorrect.</p></blockquote><p>I actually upvoted some of matty's comments in this thread because of that, and did not downvote any. They made me question my arguments, and I think that is quite useful in general. However, I agree with Lizka that the tone could have been better (although I personally did not feel offended by it, because I do not see a big intrinsic difference between factory-farming humans and e.g. chickens).</p><blockquote><p>Vasco seems to be suggesting that as long as ones life is worth living, been bred for slaughter is only morally bad because of the impacts on other people, not on the person being slaughtered</p></blockquote><p>I agree if \"bad\" means better than non-existence. I disagree if \"bad\" is interpreted as in common usage of language, which I think pressuposes a counterfactual with higher value than non-existence. In other words, having a barely good life is better than nothing, but could be much better.</p>", "parentCommentId": "DTWkhBhAsfWHJxKuL", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ndoxvFKcftFPoLFeF", "postedAt": "2023-06-11T09:52:31.275Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Children eat less than adults, so you can feed more children at the same time than adults with the same amount of food. If they're young enough (or otherwise unaware), they won't understand or expect their deaths. Children also seem more hedonistically reactive than adults, both positively and negatively, so if you ensure they are happy (good food, play, affection), they'd plausibly be happier than adults treated just as well.</p>\n<p>So, it’s not clear that letting people decide when they die is better from a classical utilitarian perspective and ignoring indirect effects, e.g. the productivity of adults and how it contributes to others' welfare. Adults are also more self-sufficient, which counts further in their favour.</p>\n", "parentCommentId": "vs8QXiMtG8KA8JcWp", "user": {"username": "MichaelStJules"}}, {"_id": "HCLkSvzRYQJgFzt3m", "postedAt": "2023-06-11T10:00:11.355Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Thanks for commenting, Michael.</p><blockquote><p>I agree that the same points could have been made in a less counterproductive way. Specifically, I found them a bit aggressive and condescending (like \"gotcha!\"). I can see how this could warrant a temporary ban. (I don’t have strong views either way about whether it should.)</p></blockquote><p>This is my view too.</p><blockquote><p>However — and I don’t know if you had them in mind, so you can correct me if you didn't — the other terms, like 'breeding', 'killing' and 'eating', don't really have any better alternatives for making the same points.</p></blockquote><p>On the one hand, I believe applying the same terms to both humans and non-human animals is helpful to break speciesism. On the other, it can be offensive to people who attribbute quite different moral weights to humans and non-human animals (I do not).</p><blockquote><p>Furthermore, my understanding from Vasco's writing and comments is that he's a classical utilitarian or close, so the replaceability argument should apply in principle even to humans, as long as the average human life-moment isn't worse, or greater numbers can make up for a worse average.</p></blockquote><p>Agreed. To clarify, I strongly endorse expectational total hedonistic utilitarianism (which I think is the same as classical utilitarianism).</p><blockquote><p>This is basically what matty pointed out in the last comment, and it seems worth it for Vasco to explicitly consider and respond to this point. Vasco did call it uncooperative, both if done to humans and to other humans.</p></blockquote><p>Good point! I had not realised that, possibly because of the tone. I will reply.</p>", "parentCommentId": "hNAfhab3qxcu3Eexk", "user": {"username": "vascoamaralgrilo"}}, {"_id": "CFtbXzMFfE72nuakC", "postedAt": "2023-06-11T10:12:19.600Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Good point. The utility equals the product between population size, quality of life and duration of the situation. So I agree that one can make the situation better by increasing any of these.</p>", "parentCommentId": "nNzZtp3gk6BzSTbHX", "user": {"username": "vascoamaralgrilo"}}, {"_id": "xxJnDTFLDWrTPHHJp", "postedAt": "2023-06-11T10:26:33.051Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Great points, Michael. I found the situation intuitively quite bad, and therefore stumbled into some motivated reasoning. I would be okay with the situation described by matty as long as the lives of the children were sufficiently good (to offset the negative effects to the mothers, and the pain involved in the murders), and neglecting indirect effects.</p><p>Nevertheless, in practice, if a bunch of humans contacted me describing their great plan to produce lots of utility along the lines described by matty, I would just report them to the police. I think having such plans in real life correlates with bad outcomes (compared to non-existence), even if the plan itself describes a good outcome (compared to non-existence).</p>", "parentCommentId": "ndoxvFKcftFPoLFeF", "user": {"username": "vascoamaralgrilo"}}, {"_id": "G2QfeNaEWjK4im38n", "postedAt": "2023-06-11T14:24:43.626Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Hey Vasco, I edited my response around when you were replying, and replaced the bottom part of my comment. What I had before and decided to replace wasn't useful/relevant in response to Lizka. I'm just flagging this for you, but feel free to leave your comment as is.</p>\n", "parentCommentId": "HCLkSvzRYQJgFzt3m", "user": {"username": "MichaelStJules"}}, {"_id": "q3vGmYaAok5wdcKdn", "postedAt": "2023-06-13T14:22:30.283Z", "postId": "7hMgK4hciBhXmBRnW", "htmlBody": "<p>Thanks! It's worth noting that the rainforest and Cerrado numbers in that piece are very rough guesses based on limited and noisy data. As one friend of mine would say, I basically pulled those numbers out of my posterior (...distribution). :) Also, even if that comparison is accurate, it's just for one region of the world; it may not apply to the difference between, e.g., temperate forests and grasslands. All of that said, my impression is that crop fields do tend to have fewer mammals and birds than wild grassland or forest. For birds, see the screenshot of a table in <a href=\"https://reducing-suffering.org/how-many-wild-animals-are-there/#Birds\">this section</a>.</p>\n", "parentCommentId": "f3ZEj7e7d9did6ksF", "user": {"username": "Brian_Tomasik"}}]