[{"_id": "ZFrJqmcwh8Kq2tFcx", "postedAt": "2014-04-05T12:26:00.000Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>This might be the greatest idea ever. I can give you all the reasons why it's so good, but you have got them all figured out. My definate props for that!</p><p>I have a tip though. If you are interested, continue reading.</p><p>I like your story but I don't LOVE it. It's because it's written in an inpersonal style. In order to promote it more effectively, I'd like you to give a personalised WHY?</p><p>I.E: I was hiding from my friends for two years. I was failing in my study of philosophy and I didn't wanted to come out. I had a severe case of depression. I had everything I needed: A house, food, even a hot shower, and still I despaired. Life was way out of whack, something was deeply wrong!</p><p>Then, I remember the moment clearly: I was in the kitchen and I was going to stuff myself with yet another sandwich, when by chance a shadow of a man walked by, obviously a beggar. I looked at my extra bacon and egg sandwich, and something just clicked in my brain. I hurried outside and caught him on the street corner. I gave it to him, he murmbled something weird, but the look he gave me was etched into my soul.</p><p>That day I felt elated. I went out and started to do random acts of kindness. I bought flowers and gave it to an old lady and an anorexic girl. I joined a couple of young people to give free hugs. I donated all my pocket money to beggars. I even withdrew money to give more. </p><p>I was stunned: Living truly is giving! The depression lifted and I never looked back. I was able to finish my master in philosophy, and made more friends than i ever had. Since then I have been trying to help as much as I can. And as smart as I can! </p><p>~ I am sure you can write a terrific personal story. Continue what you are doing, and make it count!</p>", "parentCommentId": null, "user": {"username": "Martijn"}}, {"_id": "Lu6YWgEgbBC5pLf2C", "postedAt": "2014-04-05T12:29:00.000Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Was that of any help?</p>\n", "parentCommentId": "ZFrJqmcwh8Kq2tFcx", "user": {"username": "Martijn"}}, {"_id": "wzPSakPhiaYcXaBqP", "postedAt": "2014-04-22T22:20:00.000Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Thanks, Martijn! Will is currently writing a book on effective altruism and is giving a lot of thinking to ways in which we can make EA ideas more appealing to a wider audience, without sacrificing precision or accuracy.  Making such ideas more personal is a key way of accomplishing this, and for this reason the book will feature interviews with many prominent EAs and top researchers.</p>\n", "parentCommentId": "ZFrJqmcwh8Kq2tFcx", "user": {"username": "Pablo_Stafforini2"}}, {"_id": "dbNx2K8RSecEwRSSa", "postedAt": "2015-01-17T00:53:30.975Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>just a small thought on the term &quot;altruism&quot; -- in an omoiyari* world there is really no need for altruism or charity. They are not required and hardly, if ever, occur.  In an omoiyari world every success is reciprocal, every personal creative act is a shared success. By the same token,  every wound one causes to another is a self-inflicted wound.  In such a world, the terms 'altruism', 'charity' and the like simply drop away. Nor is there any conflict between the states of individuality and collective. Indeed, where the personal is shared and reciprocal, personal creativity, imagination and exploration are routinely encouraged and fostered.  </p>\n<p>Omoiyari society (or civilization, if you prefer) is a &quot;we&quot; society. But there is no implication of &quot;we&quot; being at the expense of &quot;you&quot; or &quot;me&quot;.  It is a society which maximizes and distributes the surplus of our creativity and energy, rather than conscripting it.  It does so with the minimum of distortion or dislocation of each person's self-directed initiatives. And there is plenty for an omoiyari society to recycle and share, because there is little need to accumulate, hoard or own for its own sake, nor out of fear-driven insecurity.  </p>\n<p>There is no &quot;either/or&quot; or &quot;them/us&quot; about an omoiyari society.  Those are scripts for reality that have been written and handed to us by others to serve their own narrow, self-interested ambitions.  There is simply no use for our current competitive, acquisition-driven, 'charity-fixated' societies or the compensations we try to make for them. We presently receive such reality scripts as if they were an unalterable part of &quot;human nature&quot;. They are not.  An omoiyarii society has no use for them. Why?  Because, in an omoiyari-world, we all own and write the scripts of our own reality and we distribute them as a shared reality.  We write them creatively and imaginatively and we share them reciprocally.   </p>\n<p>So, is that possible?  Is there an &quot;effective&quot; way to bring about an omoiyari world?  Yes, actually. It's quite simple and the tools to do it are already possessed by everybody.  It is really nothing more than the realization that our reality is not something that can actually be owned by anyone, least of all those who presently claim a proprietary right to it (the ones who exclaim, &quot;Reality is what we say it is&quot; and by 'we' mean only themselves), the ones who can make reality seem unalterable only through the coercive use of power. </p>\n<p>The effective end to that fiction is to simply begin rewriting that script.  And that is not as difficult as it may seem.  To begin with, we actually know what the real script for reality ought to be. We all know it -- even if our ways of expressing it may be different.  It comes with our DNA, there's nothing extraordinarily complicated about it.  It is a script which no longer has us settle arguments with ourselves by means of violence or war.  It is a script in which hunger or homelessness or exclusion or other forms of neglect and deprivation are not possible simply because those wounds are self-inflicted wounds and no one (it's in our DNA) leaves their own wounds untended to fester.  </p>\n<p>It is a script in which there is really no distinction between work and play because the very act of using our energy and our bodies to do useful and creative things is a natural expression of ourselves, a yoga of living and a joy, even if the particular task may be difficult or routine.  Our script would not turn people into interchangeable, expendable units of fuel for the engines of an economy or anything else. The human project would not be here to serve the economies it created, those economies would be here to serve the people. I could go on and on, but you see, you already know that don't you. It comes with our manual of operating a sane, healthy flourishing world. The one given to each of us when we were born.  We just tend forget that at times.</p>\n<p>So that's all I really came to say. A little food for thought, that's all.  It may not happen in our lifetimes, maybe not for many generations (provided we survive the messes we've created for ourselves).  When it does, those who rewrite our primitive reality will probably wonder at those first proto-humans who hadn't yet crossed the evolutionary rubicon from OMG to omoiyari, just as we wonder about the first hominids who stood at the edge of the Serengeti, but hadn't quite crossed the evolutionary bridge from thinking to minding.   </p>\n<p>But we can start now, preparing the way for those who will follow us. We can begin to reclaim small pieces of our reality and renew it as it should be. That we can do, and that will likely help make the Dark Ages to come a little bit shorter.  That is all I have to say.</p>\n<hr />\n<p>*omoiyari is a Japanese word that really has no equivalent in English. Roughly, it means &quot;putting others first.&quot;   It was first introduced to me by Charles Pellegrino in his book &quot;Last Train from Hiroshima&quot; (definitely an omoiyari, if tragic, book about events that should never have happened). Omoiyari was introduced to Charles through the writings and talks by Masahiro Sasaki, brother of Sadiko Sasaki, whom many of you will know as the girl who set about folding a thousand paper cranes in the interest of world peace and omoiyari. The girl who died of wounds received in the bombing of Hiroshima.  --  omoiyari, Red Slider</p>\n", "parentCommentId": null, "user": {"username": "redslider"}}, {"_id": "AAikuW997jtHt6kie", "postedAt": "2016-11-02T07:38:39.128Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>I totally agree. Altruism and egoism are the consequences of our intellettualistic occidental society. Does it really exist any difference between self and other? The logical analytic approach fails if it doesn't comprehend the dialectic aspects of the whole reality. When I am helping people I am doing something good not only for whom I help but also for me: i need to do good, that is my interior obligation that let me free only if I decide to obey it. To me we have to find out what human nature means.</p>\n", "parentCommentId": "dbNx2K8RSecEwRSSa", "user": {"username": "Patrizia"}}, {"_id": "HmLMeAjmzxNYEkqjL", "postedAt": "2017-02-22T17:50:09.465Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p> first of all i am from argentina so excuse my awful english ! I am a very concern sense i was a little girl about the animals rights, also the human right. i discover today this magnificent movement EA, and my heart is really relieved. i think the world is really in darkness right now, but also can see how every day the human society evolves every minute to an more ethics existence and is happening very fast so we must know that every little gesture we have for help others is going to be a enormus impact for change the world and make it a better place for all.</p>\n", "parentCommentId": null, "user": {"username": "silvia_fromargentina"}}, {"_id": "R3M53AQSaYkwRekzS", "postedAt": "2019-06-09T20:30:24.030Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>&#x27;Nor is there any conflict between the states of individuality and collective. Indeed, where the personal is shared and reciprocal, personal creativity, imagination and exploration are routinely encouraged and fostered.&#x27;</p><p>Could you please elaborate on this?</p>", "parentCommentId": "dbNx2K8RSecEwRSSa", "user": {"username": "advyyy"}}, {"_id": "xKDvdm6YHK38dCyGY", "postedAt": "2020-03-24T20:01:48.195Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>The world is currently experiencing a great pandemic, with a rate of contagion much higher than fatal, but with a drastic effect on the global economy and where, there be a marked increase in the level of poverty in countries of relative low development.</p><p>There will be substancial urgency in releasing resources to reduce the devastating effects on those who were already poor and lacking food.</p><p>In my understanding, it will be necessary for HOW to be rethought, WHERE carefully chosen (the most affected or those that have had the greatest grown in poverty) and will have  WHAT (or WHO) will have to be re-established by expanding its base with the involvement of new players (stakeholder) . Its time to balance weighing between who  has it and who needs it.</p>", "parentCommentId": null, "user": {"username": "thisisbrazil"}}, {"_id": "SvC3gDaPwP854SRmf", "postedAt": "2020-04-08T07:36:38.163Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>The &quot;why&quot; is an efficient way of measuring the amount of all the positive effects we can do through a transparent organization that we trust, or by meeting real people and not slogans, or by our daily actions. Better if it is organized and aimed for causes we agree to collaborate not for the theme, but for the common benefits. <br>The &quot;how&quot; is by proofs and facts that we certainly rely on as confirmed information, the problem, and it is related to altruism, it is that information mostly takes some time and the reaction will arrive too late.  <br>Certain aspects of an unfortunate situation can be resolve by performance according to the sense of coherence, it has been developed by experience and knowledge. As individuals, we should not overthink how to do, rather in what. Of course, more evidence is needed, but our criteria must not be delayed.<br>And of course, every individual has a list of priorities that should be done. The problem dwells when society begins to push in favor of new aspects over unresolved tasks. The &quot;what&quot; will be always put on hold while new priorities arise and the old ones are limping to be over. Then the circle starts again.</p>", "parentCommentId": null, "user": {"username": "Felipe"}}, {"_id": "gzWMz5Lj4eJXQrGBN", "postedAt": "2020-04-10T10:09:13.295Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>this is a struggle I have had- feeling guilt for holidays, buying new clothes, spending money on a drink at a bar. I feel I have become more disengaged from this. But I want to engage with this feeling and come to a happy &apos;or cheerful&apos; agreement within myself that allow me to enjoy things in life too. There is always MORE we can do. I have savings, and I couldn&apos;t really say how much savings I &apos;need&apos;. therefore I don&apos;t know how much I could be donating too others. It is hard to draw the line because so much is unknown about the future. </p>", "parentCommentId": null, "user": {"username": "Nic Tea"}}, {"_id": "BekzhWSaPuJFoSypB", "postedAt": "2020-04-17T13:27:10.881Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>I am excited to learn how to give more of myself in the most effective way possible. I used to give to the United Way through my place of work for many years, choosing the specific agency that I thought matched my values. </p>", "parentCommentId": null, "user": {"username": "Psanchez1012"}}, {"_id": "dhhhnkbJ8k5bCMAJ6", "postedAt": "2020-06-03T06:44:47.062Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p> The word altruism is associated with being generous or detached with your neighbor. Give large amounts of money and always subsidize. But, I think, altruism is more than doing things for the people. Instead of giving them goods and services, and condemning them to be dependent, it is better to teach them to achieve their own goals through study and work. In this way, the difference would be made and we would really be altruistic. </p>", "parentCommentId": null, "user": {"username": "Mael_Peru"}}, {"_id": "uAyvxZ68zMrJvJZSi", "postedAt": "2020-06-18T09:17:57.047Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Ssposso</p><p>I am from Europe (Spain) , I am surprised that none has  mentioned  ( at least I have nout found any comment on the matter ) the harm to the poors (individuals , countries and continents) as well as  to the farming industry , among other activities , that  the huge international business corruption has made and is making woldwide.</p><p>In my humble opinion, the What and the Why should take into consideration the real businesses behaviours and  corruption is not only detrimental to the subject that has been corrupted  but in the long term to the corruptor too.</p><p>In my view Ethics and Effective Charity have  the obligation to fight againts corruption , sort of moral cancer more or less admited as necessary to maintain the business motor  running .</p>", "parentCommentId": null, "user": {"username": "ssposso@gmail.com"}}, {"_id": "YKDjJuL8RMWduuE44", "postedAt": "2020-06-24T23:39:02.432Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Several of you have written here of sadness because the challenges seem to big and the rate of change too slow. Governments and big corporations seem to reluctant to make even the smallest of changes. A bit depressing really and then Covid-19 hit. Suddenly everything changed almost overnight. Millions and millions of people locked themselves indoors to save the most vulnerable and Governments loosened their purse strings. It can be done and when the will is there or enough people want the changes it can happen extraordinarily quickly.</p>", "parentCommentId": null, "user": {"username": "Carol McHugh"}}, {"_id": "JCAP8ZsHHPWCzu2H5", "postedAt": "2020-08-22T17:46:54.523Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Working in finance, I feel guilty that all my long hours and efforts aim to basically make rich people richer. In this consumer-driven capitalist society, we all play a role giving more power to the privileged, hence expanding the gap between socio-economic classes . Many of us don&#xB4;t have another choice, as we need our jobs in order to survive or even fulfill basic needs. I hope one day, society will wake up and realize how unfair, and ineffective this outdated economic system is. In my opinion true prosperity is reached when you give without expecting something in return, and if you give-back even if your resources are scarce that&#xB4;s more enriching than buying/owning a luxury item.</p>", "parentCommentId": null, "user": {"username": "diegoszg"}}, {"_id": "JorphxpGecYAt4QtA", "postedAt": "2020-10-30T11:50:26.309Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Which government's have loosened it's purse strings??? No contrary or criticism or that I don't believe you, just curious where???</p>\n", "parentCommentId": "YKDjJuL8RMWduuE44", "user": {"username": "wilcoxism"}}, {"_id": "zJPkXwCuGb958Qca7", "postedAt": "2020-10-30T11:57:32.121Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Hello\nI'm in Spain too, well Cataluna, fully agree don't get me started Nazism without the concentration camps, yet...\nToo busy playing the corruption catch up game, spouting the new very new found vocabulary of sustainability with no clue what it means and sharing the EU funding amongst their mates.</p>\n", "parentCommentId": "uAyvxZ68zMrJvJZSi", "user": {"username": "wilcoxism"}}, {"_id": "ZrHwNyt8rgEHTXFPT", "postedAt": "2020-10-30T12:09:01.135Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>I whole heartedly agree that there should be no need for charities in an ideal world, we have had the knowledge and technology for everyone to receive sufficient for a good life, and in an ideal world as you say there should be no need for work just collaboration for the greater good first on what ever needs doing then on individual development for the greater good of all, transition seems to be the biggest problem, there are many trying to figure this out but sadly all seem to remain Fringe movements, eg Ubuntu, resource based economy, Venus project, zeitgeist movement, new earth nation to name but a few.</p>\n", "parentCommentId": "dbNx2K8RSecEwRSSa", "user": {"username": "wilcoxism"}}, {"_id": "3NpsnsLCpEj6ykbNW", "postedAt": "2020-10-30T12:10:28.464Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>There are no thumbs up icon's... So YUP will have to do...</p>\n", "parentCommentId": "AAikuW997jtHt6kie", "user": {"username": "wilcoxism"}}, {"_id": "tyNYwXE3WbNTuvgif", "postedAt": "2020-10-30T12:18:08.980Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>Or sharing the global resources so everyone achieves an acceptable level, then see what everyone can contribute to the greater good and lend extra support to those able to do the greatest good on the most urgent upgrades for all.</p>\n", "parentCommentId": "dhhhnkbJ8k5bCMAJ6", "user": {"username": "wilcoxism"}}, {"_id": "quMYay9aYbynAvFui", "postedAt": "2021-01-19T07:18:42.193Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>We are hear to serve others, is a principle of Buddhist thinking and could be extended to a general altruistic thought. The problem becomes what is serving?  In some cases it could be to satisfy our own ego and others even the best intensions be destructive.  The stolen children of the first australian people is a example of that thinking.  Christian missions destroying the indigenous cultures so loosing much valuable wisdom, once again is well intentioned actions with poor consequences.</p>\n", "parentCommentId": null, "user": {"username": "noswadbert@gmail.com"}}, {"_id": "dduJDPj8JaCcHfqAw", "postedAt": "2022-03-29T20:57:19.174Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<p>It would be nice to see something where a need was posted by governments and people from different parts of the world could sign up for that initiative. &nbsp;I personally have teaching skills and blacksmithing skills and would love to teach that abroad to common folk who have a real desire to learn that trade but are unable to afford a formal training environment.</p><p>The way I see charities today are often a disembodied entity that is results-oriented but disconnects the giver from the receiver. Sure a picture or a phone call helps but I feel so much less of an impact on my heart if I gave 500$ to a cause. I would rather spend a couple weeks to a month with willing students who learn the skills I can teach them and carry those skills with them for a lifetime.</p>", "parentCommentId": null, "user": {"username": "Henry Hamilton"}}, {"_id": "qp4CeSZHnd2aoz9RF", "postedAt": "2022-03-29T22:44:04.250Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<blockquote><p>It would be nice to see something where a need was posted by governments and people from different parts of the world could sign up for that initiative. &nbsp;I personally have teaching skills and blacksmithing skills and would love to teach that abroad to common folk who have a real desire to learn that trade but are unable to afford a formal training environment.</p></blockquote><p>I think you are proposing a kind of matchmaking system for volunteer teachers and students, or maybe a coordination website/institution for the same.</p><p>The challenge is that this system (jargon: “<a href=\"https://en.wikipedia.org/wiki/Two-sided_market\">two sided marketplace</a>”) is hard to execute.</p><p>&nbsp;</p><p>The root issue is that there needs to be value for the students and teachers. But teachers are volunteers, commitment and quality requirements are deceptively high and require a lot of support, and so match quality is low or unreliable.&nbsp;</p><p>When it does exist, this match value can be further undermined in many ways. One way is the existence of for-profit competitors (e.g. a for-profit academy teaching blacksmithing). For-profits can be wholesome and impactful. However, these services with greater pay and resources will often poach the best teachers or students (or they can depart through intrapreneurship). The resulting adverse selection and loss of resources can collapse the non-profit.</p><p>Separately and additionally, there’s another objection to this idea that is sort of hard to unpack (like it gets into ideology/”dinner party economics”). Basically, the lack of payment or a loan system might be inefficiency or hardship, as I think you are characterizing. But also could be a strong signal that there is no real demand or value for the services (or the society is so dysfunctional that investment is uncertain and not viable).</p><p>&nbsp;</p><p>The above issues lowers match value. In turn, this lower match value limits the resources that can be reasonably dedicated in a “professional” or “institutional” way that is needed to attract and maintain students/teachers in your proposed matching/coordination service. Again, I think this is hard and costly to do, even if most participants are volunteers.<br>&nbsp;</p>", "parentCommentId": "dduJDPj8JaCcHfqAw", "user": {"username": "Charles He"}}, {"_id": "6qmGrmybokLikuxKk", "postedAt": "2022-03-29T22:47:05.808Z", "postId": "7hNr5WuYMJHTxqNun", "htmlBody": "<blockquote><p>The way I see charities today are often a disembodied entity that is results-oriented but disconnects the giver from the receiver.&nbsp;</p></blockquote><p><br>When you say charities are disembodied entities, you mean giving aid or a check to some monolithic organization, who then distributes this, is impersonal.&nbsp;<br>&nbsp;</p><p>While your experience of this “disembodiment” is correct—this is just &nbsp;the result of having a small, dedicated professional staff, distributing the aid fairly, effectively and efficiently.&nbsp;</p><p>If you wanted to distribute aid, this is probably the best way of doing it.&nbsp;</p><p>If you didn’t want this aid distributed, you can argue the particular aid is bad (worse than your classes) or that aid in general is bad. These argument are commonly made (there’s multiple camps/movements/literatures against poverty or development aid), but you won't find a lot of agreement here.</p><p>&nbsp;</p><p>Your intuitions and concerns seem correct and important. It would be wonderful to speak and watch your students grow and become independent instead. It's not clear how to solve this problem.</p>", "parentCommentId": "qp4CeSZHnd2aoz9RF", "user": {"username": "Charles He"}}]