[{"_id": "qNXSynHJvQjtkB7Fi", "postedAt": "2022-11-28T21:20:16.179Z", "postId": "7iTfePcgswTivy2zo", "htmlBody": "<p>You might be interested in:</p><ul><li>The recent <a href=\"https://forum.effectivealtruism.org/topics/cause-exploration-prizes\">Cause Exploration Prizes</a>, launched from <a href=\"https://forum.effectivealtruism.org/topics/open-philanthropy\">Open Philanthropy</a> to <a href=\"https://www.causeexplorationprizes.com/\">find ideas for the best ways to use our resources</a></li><li>The excellent post <a href=\"https://forum.effectivealtruism.org/posts/SCqRu6shoa8ySvRAa/big-list-of-cause-candidates\">Big List of Cause Candidates</a></li><li>Pitching the idea to <a href=\"https://www.charityentrepreneurship.com/research\">https://www.charityentrepreneurship.com/research</a> (I don't know what the process is, I think you can just mail them and ask), if it's about starting a new org</li></ul><p>As I see it, EA is not a single consensus, different individuals reach very different conclusions about resource allocation, as you can see e.g. in the current <a href=\"https://forum.effectivealtruism.org/posts/LNbzDCgCH2py3cnJv/where-are-you-donating-this-year-and-why-open-thread\">\"Where are you donating this year, and why?\" thread</a>. Or by comparing <a href=\"https://founderspledge.com/funds/global-health-and-development\">Founders Pledge The Global Health and Development Fund Grants</a> with <a href=\"https://www.givewell.org/research/all-grants\">GiveWell's All Grants Fund</a>.<br>Also, it seems to me that there are many ideas that people are passionate about, but are often bottlenecked by a lack of implementers (i.e. people willing and able to turn those ideas into concrete projects).<br>When I see a successful new EA project, it never seems to happen because \"EA\" reached the conclusion that the project was important and allocated resources to it, but because some individuals developed a <a href=\"https://forum.effectivealtruism.org/topics/theory-of-change\">theory of change</a> and worked to make it happen.</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "7sX7q5pschvoxqEqL", "postedAt": "2022-11-28T22:06:05.495Z", "postId": "7iTfePcgswTivy2zo", "htmlBody": "<p>You might want to check out <a href=\"https://forum.effectivealtruism.org/s/AbrRsXM2PrCrPShuZ\">https://forum.effectivealtruism.org/s/AbrRsXM2PrCrPShuZ</a></p><p>pretty much agree that it doesn't seem optimal to have people trying to drum up hype with a blog post when they think there is an opportunity for high impact. It would be nice to have a site that has thousands of very modular forecasts/ impact estimates on things that you can paste together so that people can see the numbers clearly and quickly.&nbsp;</p><p>&nbsp;</p><p>I think<a href=\"https://github.com/quantified-uncertainty/metaforecast\"> this </a>is sorta trying to do that on a less ambitious level.</p>", "parentCommentId": null, "user": {"username": "Charles_Guthmann"}}]