[{"_id": "oepYerChxvnvGhzwW", "postedAt": "2024-01-18T10:43:53.556Z", "postId": "7jdtLNu2uis9MY6io", "htmlBody": "<p>Sorry to be picky but you have misspelled worrisome in your title- I think that might affect how many readers you are likely to get. I'd recommend changing it (on lesswrong, because this is a crosspost).&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "DD9i9pPKnvRnSBFQk", "postedAt": "2024-01-18T11:33:53.218Z", "postId": "7jdtLNu2uis9MY6io", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "oepYerChxvnvGhzwW", "user": {"username": "Roman Leventov"}}, {"_id": "pYmYpThr8T6YALaBC", "postedAt": "2024-01-18T14:51:50.240Z", "postId": "7jdtLNu2uis9MY6io", "htmlBody": "<p><strong>Executive summary</strong>: The post argues that business leaders and journalists fundamentally misunderstand the core issues around AI adoption and transition, focusing too much on accuracy, correctness, and rule-following rather than the deeper challenges of context alignment, shared languages, compositional reasoning, and provable computing.</p><p><strong>Key points:</strong></p><ol><li>The focus on accuracy, factual correctness, and rule-following suits bureaucratic automation but misses the real productivity gains from shared contexts, languages, and reasoning.</li><li>Hallucinations show alignment requires shared frames of reference across timescales from pre-training to dialogue.</li><li>Richer language and compositional, collective reasoning make economies more productive and civilizations safer, not just better bureaucracies.</li><li>Making AI systems \"accurate rule-followers\" fails to really improve reasoning - instead we need languages, protocols, and provably correct computing.</li><li>Key ingredients for safe, beneficial AI: context alignment, shared languages, provable computing, governance mechanisms - not control, values, or trust.</li><li>\"Trust\" shouldn't oversimplify algorithms - instead educate on the difference between context alignment (\"trust in science\") and algorithmic correctness (\"trust in math\").</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]