[{"_id": "fD4ncxemG4FGZgLup", "postedAt": "2022-11-17T04:14:58.356Z", "postId": "7kiwwSqjfHcSkZu7N", "htmlBody": "<p>I think the main obstacle is tractability: there doesn't seem to be any known methodology that could be applied to resolve this question in a definitive way. And it's not clear how we could even attempt to find such a method. Whereas projects related to areas such as preventing pandemics and making sure AI isn't misused or poorly designed seem 1) incredibly important, 2) tractable - it looks like we're making some progress and have and can find directions to make further progress (better PPE, pathogen screening, new vaccines, interpretability, agent foundations, chip regulation) and neglected right now and will matter for the next few decades at least unless the world changes dramatically.&nbsp;<br><br>Also, it could be possible that there are \"heaven\" worlds and \"hell\" worlds that last an extremely long time, but not forever. Buddhist traditions are one group that tend to emphasize that all worldly places and experiences are impermanent, even extremely pleasant and unpleasant ones.&nbsp;<br><br>\"The kingdom of heaven is within you\" comes to mind. I've always thought that was a very important verse. I imagine it may be talking about some kind of distinct and significant transformation that other religions might refer to by other names, such as awakening or enlightenment, that makes us durably and noticeably more peaceful and loving/kind toward others.&nbsp;<br><br>These experiences are often described in a way that indicates the subjective experience of having a distinct, separate self diminishes or even disappears. It may not even make sense to think of heaven using our concepts of a 'place,' let alone one where what we perceive as a separate self would exist in.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "qNAEsGDpXtGkMBGs3", "postedAt": "2022-11-17T08:14:12.255Z", "postId": "7kiwwSqjfHcSkZu7N", "htmlBody": "<p>Speaking broadly, I think people underestimate the tractability of this class of work, since we’re already doing this sort of inquiry under different labels. E.g.,</p><ol><li>Nick Bostrom coined, and Roman Yampolskiy has followed up on, the Simulation Hypothesis, which is ultimately a Deist frame;</li><li>I and others have written various inquiries about the neuroscience of Buddhist states (“neuroscience of enlightenment” type work);</li><li>Robin Hanson has coined and offered various arguments around the Great Filter.</li></ol><p>In large part, I don’t think these have been supported as longtermist projects, but it seems likely to me that there‘s value in pulling these strings, and each is at least directly adjacent to theological inquiry.</p>", "parentCommentId": "fD4ncxemG4FGZgLup", "user": {"username": "MikeJohnson"}}, {"_id": "p7j4zxoQTvAsdFNne", "postedAt": "2022-11-17T11:19:59.161Z", "postId": "7kiwwSqjfHcSkZu7N", "htmlBody": "<p>Thanks for the post (as well the content of the post itself, I am glad when people make their first post and the forum grows :) ).</p><p>I agree with Peter that the key issue seems to be traceability. You point to the history of religion, which I think should make us relatively pessimistic about making progress on TI. Perhaps having researchers dedicated more to truth than tribal identity would make a big difference though. What would your rough research agenda be for TI?</p><p>(The SPC framework roughly fits into the importance term of the ITN framework, see <a href=\"https://globalprioritiesinstitute.org/wp-content/uploads/William-MacAskill-Teruji-Thomas-and-Aron-Vallinder-The-Significance-Persistence-Contingency-Framework.pdf\">https://globalprioritiesinstitute.org/wp-content/uploads/William-MacAskill-Teruji-Thomas-and-Aron-Vallinder-The-Significance-Persistence-Contingency-Framework.pdf</a> &nbsp;)</p><p>Regarding infinities and how to deal with them in ethics, I liked <a href=\"https://forum.effectivealtruism.org/posts/CeeeLu9PoDzcaSfsC/on-infinite-ethics\">https://forum.effectivealtruism.org/posts/CeeeLu9PoDzcaSfsC/on-infinite-ethics</a>&nbsp;</p><p>Regarding the persistence term in the SPC framework, I think our interpretations are different: I think in your cure for cancer example, the persistence is not from now until the end of biological humans, but rather from the time I invent a cure to the expected time someone else finds one, which presumably is on the order of decades as it is rare for one researcher/research group to be way far in front of everyone else.</p>", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "FqAaPC37Wxq3uoiiz", "postedAt": "2022-11-17T22:11:03.150Z", "postId": "7kiwwSqjfHcSkZu7N", "htmlBody": "<p>In all honesty, I haven't put too much thought into a research agenda so forgive me if this response isn't very thought provoking haha. This post was a sort of spur of the moment idea that I just had to get down on paper (as signified by my many typos), but in a sort of knee-jerk response to your comment on a rough research agenda for TI, I guess the first step would be spending resources (be it time or money) convincing people (particularly EAs at first) that TI should be taken seriously, especially considering WM's SPC framework.</p><p>Honestly, conceding to the existence of the uncertainty gap is the first major obstacle that everybody faces and it needs to be addressed. I think separating EA for Christian's out from EA itself was didactic felo de se because it ruined potential meaningful exposure to opposing viewpoints by presuming incompatibility or at least irreconcilable rationale bases, thus making it more difficult for ideas like TI to gain traction as priorities; so I'd address this first. This could be done by maybe creating a compilation of works meant to create uncertainty in either side (a page of a website for atheists and a page of a website for theists)... although this comes dangerously close to faith-bashing so I'm not entirely sure how to do this.&nbsp;</p><p>Secondly, I think prioritizing quantum physics research (specifically exploring quantum consciousness - QC - theory) would be a savvy move. &nbsp;It has multilateral applications. A breakthrough would not only likely bring us closer to concluding TI but would also be likely to further the human species (getting us into space travel, for example) and at the very least would improve quality of life. As far as I'm aware, encouragement towards research in these fields is nonexistent in not just EA, but in the world in general. Exploring things like the observer effect, collapse of wave functions as a result of observation, etc. are all very real research options with solid scientific foundations and yet are hardly talked about (certainly never talked about in EA). Encouraging donations to orgs similar to the Accelerating Research on Consciousness initiative (although I know this one is a bit big haha) could be a good move, promoting QC research within EA as a viable impactful career option would be another good move, etc.&nbsp;</p><p>A quick google search shows there is virtually no work being done on quantum consciousness, and the work being done on consciousness alone is certainly neglected compared to other higher priority cause areas like Nuclear Threats or AI research. so this fits pretty solidly in the ITN framework as well.&nbsp;</p><p>Thoughts?</p>", "parentCommentId": "p7j4zxoQTvAsdFNne", "user": {"username": "Garrett Ehinger"}}, {"_id": "36jmLhJJC57bgHgq3", "postedAt": "2022-11-17T22:29:52.205Z", "postId": "7kiwwSqjfHcSkZu7N", "htmlBody": "<p>I agree with @MikeJohnson on thought experiments falling within a deist frame (such as Nick Bostrom's Simulation Hypothesis), however I'd hardly say these make TI tractable. I'd rather say that research into quantum consciousness or string theory etc. have very strong scientific bases and I personally think they have set good precedents for concluding TI. I.e., they make a good case for just how tractable TI can be. A good book that sums this up pretty well is Jeffrey M. Schwartz M.D.'s \"The Mind and the Brain\". He goes into the implications of quantum consciousness and the potential for there to be Creator's that we could possibly be influenced by via String Theory related physics, and that this could be tested for. I think people would be surprised by just how tractable this could be, but honestly it's contingent on the nature of a Creator if that Creator does exist. Like I said in the last clause of my post, if the Creator's don't want to be found or are impossible to observe, then we are wasting our time no matter how theoretically tractable TI might be, so ultimately I have to say I sort of agree with your point, Peter!<br>&nbsp;</p><p>As for your point on impermanence, I'm pretty sure every religion believes that everything continues forever; although some do get nuanced regarding whether or not that \"forever\" is divided up into infinite separate lives like the aforementioned Buddhists, but even they believe that once you've obtained complete enlightenment and have shed your Karma you exit the cycle of 轮回 (lun hui) and enter an eternal state of peace. The only group of people I can think of who don't believe something along the lines of an eternal afterlife in a heaven or hell world are die-hard heat-death atheists, which is a pretty small subset of the atheist population if I'm correct. Ultimately, its still a part of TI that deserves answering I think.</p><p>As for your last point, I definitely see the merit of your point there! Thanks a bunch for sharing that! It's an awesome new perspective I hadn't thought of. :)</p>", "parentCommentId": "fD4ncxemG4FGZgLup", "user": {"username": "Garrett Ehinger"}}, {"_id": "REp2awua83biCy6M2", "postedAt": "2022-11-19T03:03:00.912Z", "postId": "7kiwwSqjfHcSkZu7N", "htmlBody": "<p>Nice, I don't really have object level thoughts as I don't know anything about QC.  Yes I think there is an interesting general tension between having smaller groups with more shared assumption to facilitate easy collaboration and dialogue, versus larger groups where more assumptions are questioned and everything is slower and more laborious but perhaps more rigorous.  I'm unsure what was best in that specific case.</p>\n", "parentCommentId": "FqAaPC37Wxq3uoiiz", "user": {"username": "Oscar Delaney"}}, {"_id": "88prp5y3o8ediLn3L", "postedAt": "2022-11-19T06:58:41.562Z", "postId": "7kiwwSqjfHcSkZu7N", "htmlBody": "<p>Yeah, I do sometimes wonder if perhaps there's a reason we find it difficult to resolve this kind of inquiry.&nbsp;<br><br>Yes, I think they're generally pretty wary of saying much exactly since it's sort of beyond conceptual comprehension. Something probably beyond our ideas of existence and nonexistence.&nbsp;<br><br>Glad to hear that! You're welcome :)</p>", "parentCommentId": "36jmLhJJC57bgHgq3", "user": {"username": "Peter Gebauer"}}]