[{"_id": "h6KicfjuDsGpEwovH", "postedAt": "2022-10-21T05:14:53.707Z", "postId": "7KJZWLMepdZ4mHvxS", "htmlBody": "<p>Delighted to see a post about pain.</p><p>My particular area of interest is human pain- specifically chronic pain.</p><p>Has anyone ever done a proper trial (with independent funding!) &nbsp;of the methods proposed by James Pennebaker, &nbsp;John Sarno, Howard Schubiner, Alan Gordon or (my personal favourite- it worked for me) David Hanscom?</p><p>I saw that Scott &nbsp;Alexander asked for volunteers for a trial here : <a href=\"https://slatestarcodex.com/2016/06/26/book-review-unlearn-your-pain/\">https://slatestarcodex.com/2016/06/26/book-review-unlearn-your-pain/</a>&nbsp;</p><p>\"Part of me is tempted to recommend&nbsp;<i>Unlearn Your Pain</i>&nbsp;to my patients on the same principle. And if any readers of this blog have chronic pain and want to try &nbsp;the month-long self-help therapy course in this book, I would be very interested in hearing back from you (please tell me&nbsp;<i>before</i>&nbsp;you start, so that there aren’t response biases).&nbsp; \"</p><p>But I don't know if anyone ever took him up on the offer.&nbsp;</p><p>The actual treatment costs are virtually zero, so if these methods work (even partially) they could potentially save a large number of those 65 million disability years that have been calculated as lost to chronic pain as well as the misery. It's the ultimate effective altruism project. Surely someone who reads this has the authority and cash to get a proper trial done?&nbsp;</p><p><a href=\"https://stuartwiffin.substack.com/p/pain-and-what-to-do-about-it\">https://stuartwiffin.substack.com/p/pain-and-what-to-do-about-it</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Stuart Wiffin"}}, {"_id": "kRkRtgr6hmBpSP92t", "postedAt": "2022-11-17T17:40:43.509Z", "postId": "7KJZWLMepdZ4mHvxS", "htmlBody": "<p>I don't understand why this is being downvoted. I'm reading the SSC post now and haven't read all, but I agree this should be explored more. Consider hypnosis - there are anecdotal reports it can be used to get rid of pain. I sorta doubt how far hypnosis can go to eliminate pain but it appears understudied and if it's true it can really eliminate major pain and if hypnosis (either self or administered) could be systematized and delivered at scale, it would could revolutionize how we treat pain.&nbsp;<br><br>At the very least, we already know psychological treatments already work for some conditions involving chronic pain like CFS/ME and Fibromyalgia, but they are underutilized. Patient groups resist these treatments, because of the stigma around mental illness and confusions about the mind-body connection. CBT combined with graded exercise therapy is the only intervention for CFS/ME with multiple RCTs backing it up. It stands to reason that CBT (or similar interventions like DBT / third wave CBT) may be helpful for other chronic conditions which are medically unexplained and for which no good treatments exist.&nbsp;</p>", "parentCommentId": "h6KicfjuDsGpEwovH", "user": {"username": "Dan Elton"}}, {"_id": "snBNoetLWP49sMfJM", "postedAt": "2022-11-17T17:52:38.253Z", "postId": "7KJZWLMepdZ4mHvxS", "htmlBody": "<p>I'm not a purely hedonic utilitarian but I think understanding and eliminating the sources of the greatest pain and suffering is important. Humans aren't good at reasoning about pain severity. There's a trick the brain plays (especially when depressed) that the pain being experienced is \"the worst possible\". However, it can't be that everyone's pain is the worst (although it may in truth be the worst the person has experienced themselves). &nbsp;Several times I've experienced pain (either psychological or physical, or some combination) which felt like the worst possible (at least along some dimension) only to find later that far greater pain is possible.&nbsp;<br><br>&nbsp;You know that Black Mirror episode where the doctor uses a BCI device to feel his patient's pain &nbsp;(S4E6: \"Black Museum\")? I think that could be useful here for comparing instantaneous pain states across wildly different situations.&nbsp;<br><br>It's pretty obvious that what matters is the integral, and philosophers arguing otherwise just seem to be spinning yarn. The integral over instantaneous values is what matters. Unfortunately this is hard to measure and retrospective analyses trying to gauge this integral really suck. Pain experienced is not any less a tragedy if forgotten shortly afterwards. We all die in the end, the ultimate forgetting.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dan Elton"}}, {"_id": "HskRPs3rRJHSYeS8P", "postedAt": "2022-11-17T19:57:52.912Z", "postId": "7KJZWLMepdZ4mHvxS", "htmlBody": "<p>I downvoted it because it seemed too off-topic and promotional, kind of spammy. I had strong downvoted it, but I just switched that to a regular downvote, since I now think that's too harsh and I typically avoid strong downvoting anything I wouldn't report. The author made similarly off-topic and promotional comments on other posts.</p>\n<p>Their post on the topic was not well-received on the forum, and it seems they've been trying to promote their work on others' only tangentially related posts:\n<a href=\"https://forum.effectivealtruism.org/posts/rdExzZJhge4PFzDki/ea-and-the-chronic-pain-problem-solution\">https://forum.effectivealtruism.org/posts/rdExzZJhge4PFzDki/ea-and-the-chronic-pain-problem-solution</a></p>\n", "parentCommentId": "kRkRtgr6hmBpSP92t", "user": {"username": "MichaelStJules"}}]