[{"_id": "ccsZrdqp53TGCgJsa", "postedAt": "2022-10-28T14:12:47.471Z", "postId": "7LaJyhDYASnG2tJtz", "htmlBody": "<p>It's good to see that this is happening. I hope we will receive some updates after the Summit occurs.&nbsp;</p><p>I agree with Josh's point and would like to expand on it a bit: I have noticed this same issue with other EA events - applications/admissions do not leave enough time for visa processing for people in many countries. I suspect some who would otherwise attend might be prevented from doing so for visa reasons alone, given the short notice.</p><p>Good luck and enjoy!</p>", "parentCommentId": null, "user": {"username": "Kyle Lucchese"}}, {"_id": "TGA7rG6XNtpw2bnqQ", "postedAt": "2022-10-28T14:23:10.185Z", "postId": "7LaJyhDYASnG2tJtz", "htmlBody": "<p>This looks great! Very excited you're putting this on. I think building local capacity in low and middle income countries is extremely important for EA, and this seems like a great initiative.&nbsp;</p><p>Just to nitpick on a somewhat minor point: &nbsp;December 1st is really soon! I feel like a lot of EA events are announced very shortly before they happen, and I imagine this limits their impact and the people who are able to attend. Maybe it's just something I'm sensitive to because it's a mistake I've made before with 1Day Sooner (and I'm sympathetic to the desirability of moving quickly to accomplish important things sooner than later), but I think EA's status as a youth movement (and perhaps some other psychological factors) may generate these short lead times for events that then in turn become inaccessible to older people with families and other life commitments or people who are currently less into EA but might be really valuable to engage.&nbsp;</p><p>To throw out a potentially dumb suggestion: one possibility in this case could be to schedule and announce (pre-event or pre-the new year) a follow-on retreat in like June &nbsp;(basically a copy of this but just later) as a way of both using this upcoming event as an anchor to a broader project and allowing people to register interest who won't consider applying for an event in a month.&nbsp;</p>", "parentCommentId": null, "user": {"username": "joshcmorrison"}}, {"_id": "uPw5ndeEJ42mPoHoR", "postedAt": "2022-10-28T14:28:10.912Z", "postId": "7LaJyhDYASnG2tJtz", "htmlBody": "<p>I definitely agree with these points! The delay is entirely a failure on my part . This is definitely not the only event of its kind that will be run though and I anticipate another one will happen very soon after.</p>", "parentCommentId": "TGA7rG6XNtpw2bnqQ", "user": {"username": "Jordan Pieters"}}, {"_id": "PSzRrQrrFcREdrGdC", "postedAt": "2022-11-06T16:31:52.604Z", "postId": "7LaJyhDYASnG2tJtz", "htmlBody": "<p>I joined the EA forum late, did I? We started working on a movement aimed at stimulating phage research across Africa. The formation of Africa Phage forum(APF). &nbsp;Would you consider a movement aimed at training students, and capacity building aimed at saving lives an initiative EA Africa will like to identify with? We have observed Key challenges affecting phage research in Africa to include poor laboratory infrastructure, lack of capacity building in the phage field, and lack of local awareness of the significance of phages for policymakers and governments. APF could, therefore, play a role in creating phage awareness in Africa; mobilizing resources; enhancing networks and collaborations amongst APF members and beyond, especially with more experienced phage mentors in the Western countries, to greatly reduce the gap in knowledge and enhance phage research in Africa. &nbsp;I look forward to attend the submit and network</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "McFWQ3cEm9sRn7eL2", "postedAt": "2022-11-07T16:54:06.954Z", "postId": "7LaJyhDYASnG2tJtz", "htmlBody": "<p>I'm very excited to see this. EA for Christians is working with local EAs in Kenya and Nigeria to do grassroots outreach. We would love to see more EA community building in an African context, including outreach that builds networks to impactful careers that don't require difficult-to-obtain western visas.</p>", "parentCommentId": null, "user": {"username": "JDBauman"}}, {"_id": "Q6i6zmDb7uKsumzW7", "postedAt": "2022-10-28T15:17:12.283Z", "postId": "7LaJyhDYASnG2tJtz", "htmlBody": null, "parentCommentId": "ccsZrdqp53TGCgJsa", "user": null}]