[{"_id": "S8iKp8rGEEX9FQZSL", "postedAt": "2024-02-23T11:45:40.617Z", "postId": "7LtRuKJzdmtN4ACij", "htmlBody": "<p>This is actually a really well thought out, feasible, implementable idea. One aspect of leveraging impact to consider would be the supply chain impacts of the Transparency Index. I can certainly see valuable buy-in from stores who buy the products to want to show that they are ethically sourcing their products, and so would potentially buy in to the transparency index model. Some would likely then have a 'minimum transparency rating' policy in their procurement and compliance rules which would be a good avenue for impact as it then forces the producers to achieve that level of lose major contracts to competitors.</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "EqmWkKap2Mu62eKGR", "postedAt": "2024-02-23T11:55:25.205Z", "postId": "7LtRuKJzdmtN4ACij", "htmlBody": "<p>Thanks for the post, it's an interesting idea. I slightly worry about corruption in \"unannounced animal welfare audits by accredited and independent third parties\". Someone told me years ago that such audits by government agents in Lithuania were a farce. Do you know if such audits work well in practice? One way I see it working is if the auditor is an animal advocate. Is that what tends to happen in practice?</p>", "parentCommentId": null, "user": {"username": "saulius"}}, {"_id": "XF4bhP9MQBkSheP4S", "postedAt": "2024-02-23T12:12:47.143Z", "postId": "7LtRuKJzdmtN4ACij", "htmlBody": "<p>You are absolutely right. From my personal experience in Spain, animal welfare audits are often announced to farmers weeks in advance, so even if they happen (often they only happen in the paper, without the actual visit) farmers have time to correct whatever needs to be corrected, just for the visit. Hence the idea of creating mechanisms to enable auditing by independent parties (other than the companies' own vets or governmental auditors). There is also potential for corruption here, but if there is an organization behind certifing auditors, creating standards for how these audits should happen, or simply reporting the willingness of companies to adhere to these standards (e.g., through a transparency index or something of the sort), the risk could be reduced somehow.</p>", "parentCommentId": "EqmWkKap2Mu62eKGR", "user": {"username": "cynthiaschuck"}}, {"_id": "DfJh4FHRRGoHuuTiz", "postedAt": "2024-02-23T12:18:33.867Z", "postId": "7LtRuKJzdmtN4ACij", "htmlBody": "<p>Thanks! I like the idea of a 'minimum transparency rating' policy in the supply chain.</p>", "parentCommentId": "S8iKp8rGEEX9FQZSL", "user": {"username": "cynthiaschuck"}}, {"_id": "nGfqg6jkWAQLdQXAz", "postedAt": "2024-02-23T13:59:20.488Z", "postId": "7LtRuKJzdmtN4ACij", "htmlBody": "<p><strong>Executive summary</strong>: The post argues for establishing an organization modeled after Transparency International to improve farm animal welfare by increasing transparency in the production chain through standard auditing methods, public reporting, ranking systems, traceability measures, and labeling schemes.</p><p><strong>Key points</strong>:</p><ol><li>Lack of transparency enables companies to circumvent reforms and prevents assessing the true effectiveness of animal welfare policies.</li><li>Increased transparency would promote accountability, compliance with standards, and enhancement of welfare practices.</li><li>An organization focused on transparency could develop reporting frameworks, auditing processes, traceability systems, sourcing policies requiring transparency, and welfare labeling schemes.</li><li>Transparency initiatives could include public sharing of independent audit results, animal-based health monitoring, stockmanship qualifications, slaughter line inspections, and transparency rankings of companies.</li><li>Increased consumer awareness through transparent labeling, traceability, sourcing policies, and educational campaigns could help bridge the gap between preferences and realities.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "KbdDvNLz4cAByoiii", "postedAt": "2024-02-25T16:04:20.039Z", "postId": "7LtRuKJzdmtN4ACij", "htmlBody": "<p>Thanks for the post, Cynthia and Wladimir! Creating such an organisation sounds like a great idea to me.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]