[{"_id": "JojC87LaxAB9H9wGS", "postedAt": "2023-01-05T13:11:14.122Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>I think you intended to link to <a href=\"https://youtu.be/Bs1GtHLneXs?t=318\">this</a> instead of the 80K article at the top?</p>", "parentCommentId": null, "user": {"username": "AryanYadav"}}, {"_id": "fcqQ8FecyXsLT9r3c", "postedAt": "2023-01-05T13:29:27.568Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>My sense from what other YouTubers have said is that the norm is for YouTubers to send sponsors the video early so they can review it, and they are given broad guidelines rather than exactly what to say. I can imagine someone from GiveWell seeing this line and knowing it's (in spirit) wrong but it's not worth asking the person to re-do the whole ad read.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "PXWknqLczwPMmHkS6", "postedAt": "2023-01-05T15:11:39.683Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>Did you reach out directly to GiveWell? They are pretty responsive in my opinion.</p>\n<p>In my view, the text should at least read \"potentially\" save because read literally it does say the vitamin A dose does save the recipient.</p>\n<p>I hear the more general concern, but high fidelity is tough in a short ad -- and \"$5000 will save an additional life\" doesn't convey accurately to someone whose prior assumptions are that this is inefficient. So I am struggling to come up with better wording that is both literally accurate, concise, and accurately conveys HKI's relative value proposition.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "2jtxY2BkuQ3Pr3wgi", "postedAt": "2023-01-05T15:16:10.524Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>Thanks for the context! I think it was worth a redo to add \"potentially,\" and the issue is worth a sentence or two in guidance to future paid promoters.</p>\n", "parentCommentId": "fcqQ8FecyXsLT9r3c", "user": {"username": "Jason"}}, {"_id": "aRtcnyyyXkEPbeNwg", "postedAt": "2023-01-06T02:56:53.180Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>Yeah this seems pretty important to me, as it's about one of the key differences between EA and other charity (the strong emphasis on being rigourous about actual effectiveness). I saw something else similar to this recently, though can remember who from, and felt concerned about it, so glad to see you pointing this one out.</p>", "parentCommentId": null, "user": {"username": "Jalen_Lyle-Holmes"}}, {"_id": "bQ4BYEzPbfY3rPTs5", "postedAt": "2023-01-06T05:09:48.004Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>Fixed</p>", "parentCommentId": "JojC87LaxAB9H9wGS", "user": {"username": "tkwa"}}, {"_id": "gNet6SFQBfcZZdhJg", "postedAt": "2023-01-06T14:37:13.544Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>+1 on saying something directly to GiveWell. info@givewellorg<br><br>Sometimes there's a problem in EA where people have a concern and write it up publicly, but don't flag it to the specific org or person they want to read it, and the org or person doesn't see it for a while or at all.&nbsp;<br><br>If the facts are unclear, I think it's good practice to fact-check with the organization before writing publicly. But if the author doesn't think that's necessary or finds that too restrictive, I think they should at least ping the organization with \"Here's a link to something I wrote about your practices.\"</p>", "parentCommentId": "PXWknqLczwPMmHkS6", "user": {"username": "Julia_Wise"}}, {"_id": "Zv4taBAJwCzfY6ar5", "postedAt": "2023-01-06T14:57:42.569Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>I sent info@givewell a link to this thread after not seeing a quick answer from the original poster, and got an auto-response that \"We’ll make every effort to respond promptly, but it may take up to three business days to hear back from us during this busy time.\" I assume that is a holiday / end of tax year reference, which is totally understandable!</p>\n", "parentCommentId": "gNet6SFQBfcZZdhJg", "user": {"username": "Jason"}}, {"_id": "KSnFfwR2wkdAf52GR", "postedAt": "2023-01-06T15:00:30.087Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>I don't mind the disagreevotes, but it would be helpful if anyone who has specific ideas about how to communicate this accurately and faithfully in a short spot to share them, especially since I brought this thread to the attention of <a href=\"mailto:info@givewell.org\">info@givewell.org</a> and they could potentially benefit from your suggestions on how to improve here.</p>\n", "parentCommentId": "PXWknqLczwPMmHkS6", "user": {"username": "Jason"}}, {"_id": "5PKPoMB55JWtt3uEi", "postedAt": "2023-01-06T23:43:35.075Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>Hi, Thomas,</p>\n<p>We agree that the language you highlight is misleading, and we're sorry that it was included in the ad. It wasn't a part of the copy we provided to advertisers, and we didn't notice it in our review of the ad before it went live.</p>\n<p>We're now speaking to the agency that coordinates these ads about the possibility of updating the video, but we think this is unlikely to happen, as the ad has already been live as is for some time and can't easily be reuploaded.</p>\n<p>Thank you for bringing this to our attention!</p>\n<p>Best,</p>\n<p>Miranda (GiveWell Communications Associate)</p>\n", "parentCommentId": null, "user": {"username": "GiveWell"}}, {"_id": "pcc6Jgp8JgEqzsg7c", "postedAt": "2023-01-08T02:20:00.764Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>Same here.</p>", "parentCommentId": "Zv4taBAJwCzfY6ar5", "user": {"username": "CarlShulman"}}, {"_id": "mugH2m4qmszkaXmz4", "postedAt": "2023-01-08T11:04:50.507Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>Thanks for pointing this out! My approach in the past has been to write things publicly, I hadn't really considered contacting the relevant organisations first which in hindsight seems really really stupid of me (I wrote the \"Why did CEA buy Wytham Abbey\" post).  I will now aim to do so in the future. One benefit of asking things publicly is to get theories from other people. But I always felt scared that my public questions might come across as too \"attacking\", so I don't think that benefit is worth the potential negative impact now.</p>\n", "parentCommentId": "gNet6SFQBfcZZdhJg", "user": {"username": "Jeroen_W"}}, {"_id": "j5uXqoCZEWbKJiWqG", "postedAt": "2023-01-16T00:31:53.136Z", "postId": "7NmxHKCTMX73eLBjW", "htmlBody": "<p>great to hear!</p>", "parentCommentId": "5PKPoMB55JWtt3uEi", "user": {"username": "Jalen_Lyle-Holmes"}}]