[{"_id": "biqMtGeR8FfGSNHAq", "postedAt": "2014-12-30T18:02:54.864Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Great post, Jess! Here's another thing people can do to expose themselves to more perspectives:</p>\n<p>When I ran HCEA, we pretty frequently had group dinners with other student groups. Mostly they would ask us questions about effective altruism and we would ask them questions about what they thought about it. I think these dinners were great for exposing HCEA to a broad range of perspectives, and they weren't too much trouble to set up.</p>\n<p>(They were also great for recruiting and publicity--we were amused to note this year that during the annual atheist-Christian debate, one of the few things the two sides could agree on was that HCEA was awesome!)</p>\n<p>If you're a non-student EA, you can do a similar thing by having your local EA group meet up with other local organizations (e.g. religious organizations, social justice groups, global poverty groups, etc.--though finding them might be a bit more challenging). If you want to get super advanced you could even offer to give a talk on effective altruism to the group, although that requires more prep and you need to be careful not to proselytize.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "7dLwtddrYMzko5SYv", "postedAt": "2014-12-30T19:31:43.765Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>I'm not an effective altruist and don't think I ever will be one. I'm here only out of curiosity and intellectual entertainment. Perhaps this allows me to give you an honest &quot;outside&quot; perspective. My main reasons for not donating 10% of my income or make other similar commitments:</p>\n<ol>\n<li><p>I am instinctively too egoistic and I don't like the cognitive dissonance from being a little altruistic, but not as much as I reasonably could be. I feel best when I &quot;play for my own side&quot; in life, am productive to get only what I want and don't think about the suffering of others. I feel better when I don't care, and I prefer feeling better over caring. They say giving makes happy, but I find it brings me no equivalent pleasure.</p>\n</li>\n<li><p>Society and the law already demand a great deal of altruism and (what they think of as) morality from me. Some of it in the form of taxes, some of it in the form of restrictions on what I can do, some of it in the form of implicit status attacks. Of course, I get a lot in return, but subjetively it doesn't feel balanced. Perhaps if I were richer or had higher life satisfaction, I might be more generous in addition to what is already demanded.</p>\n</li>\n<li><p>In many morally relevant domains, there is a discrepancy between what I feel is important and what people in general feel is important. In addition, I have given up on convincing people through value talk. Most people will never value what I value, and vice versa. There are no cost-effective ways to change these discrepancies, and even though EA is a multi-domain endeavor, it is ultimately about empowering humanity to fulfill its preferences, half of which are more or less opposed to mine.</p>\n</li>\n<li><p>Psychologically, uncertainty cripples my motivation. I am not an &quot;expected utility maximizer&quot;. But in EA, certainty of impact and scope of impact are somewhat negatively correlated. And where positive effects are really certain, I expect the most cost-effective ground will eventually be covered by the EA movement without me, and I'd rather other people pay than me (donor's dilemma).</p>\n</li>\n</ol>\n<p>These are the core reasons why I have decided against EA in my personal life. It does not preclude small donations or ethical consumption, both of which I make, but it makes me recoil from real commitments, unless I have an unexpected windfall or something.</p>\n", "parentCommentId": null, "user": {"username": "Nicholas_Bregan"}}, {"_id": "8KWptPBqwFoF6cjFR", "postedAt": "2014-12-31T03:48:37.008Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Do you remember any of the questions/reactions you got from the non-EA students at those dinners?</p>\n", "parentCommentId": "biqMtGeR8FfGSNHAq", "user": {"username": "ruthie"}}, {"_id": "4CW6uhDCccSSG3kDj", "postedAt": "2014-12-31T11:27:08.589Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Good post.  Maybe it'd be valuable to start discussions on other online forums and try to gather external perspectives on EA, instead of just discussing what hypothetical external perspectives might look like here amongst ourselves :)  For example, most of <a href=\"http://lesswrong.com\">Less Wrong</a> knows what EA is, but <a href=\"http://lesswrong.com/lw/jj0/2013_survey_results/\">over half don't identify as EA</a>.  <a href=\"http://lesswrong.com/lw/l30/on_caring/\">This thread</a> has lots of non-EA LWers explaining themselves.  Maybe we can come up with a list of questions and try to administer an informal survey to further our understanding?</p>\n<p>(Yes, we have many people from the LW demographic already... but smart people concerned with cognitive biases seem like good EA recruits if they're less likely to see their good intentions go awry.  So I think more people from that demographic are still highly valuable on the margin.  The EA movement is currently full of smart thoughtful people, but it's growing fast, and there are only so many people who are smart and thoughtful... what will happen when less intelligent, less thoughtful people dominate?)</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "XjQsxuFSJ23TfEYrk", "postedAt": "2014-12-31T14:14:28.266Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>This is a thoughtful post, so thanks for making it. On the other hand, from an EA perspective I hope we don't waste too much time worrying about people like you.</p>\n<p>Put simply, you are weird.  ( that is not an insult! - EA is weird and the founding communities of philosophers,  students and AI/LW people who primarily make us up are even wierder). </p>\n<p>I suspect, for those of use who want to expand and grow the reach of EA we should worry about how to expand our ideas to people who cannot use &quot;expected utility maximiser&quot; in a sentence and would never dream of admitting that they are &quot;too egoistic&quot; to prefer helping others over their own feelings. There is much more potential in talking to people who have never thought hard about an issue before than those who have thought hard about it and decided to go another way. </p>\n", "parentCommentId": "7dLwtddrYMzko5SYv", "user": {"username": "AlasdairGives"}}, {"_id": "7M3xMgCnNTmsZGMvh", "postedAt": "2014-12-31T19:43:08.993Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>There are also intelligent, thoughtful people outside of LW.</p>\n<p>Also, while I agree that keeping the tone among EAs thoughtful, I would be extremely sad if we didn't encourage particular people or groups from being interested in EA because they aren't &quot;intelligent enough.&quot;</p>\n", "parentCommentId": "4CW6uhDCccSSG3kDj", "user": {"username": "ruthie"}}, {"_id": "nYKfy2o5oH6jJreJ8", "postedAt": "2014-12-31T19:48:40.869Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<blockquote>\n<p>I would be extremely sad if we didn't encourage particular people or groups from being interested in EA because they aren't &quot;intelligent enough.&quot;</p>\n</blockquote>\n<p>This is also how the movement gets an elitist reputation that seems quite harmful.</p>\n", "parentCommentId": "7M3xMgCnNTmsZGMvh", "user": {"username": "Peter_Hurford"}}, {"_id": "tQRZN2xT4PPpGSEik", "postedAt": "2014-12-31T19:48:59.400Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>The dinner I learned the most from was the one we had with Harvard College Faith and Action, a Christian student group. I could identify three main differences in perspective (there are likely a bunch of others too):</p>\n<p>(1) Many of the Christian students ascribed to non-consequential ethics systems. Their goal was to &quot;act as Jesus would.&quot; While this would have consequences they considered good, they were maximizing for acting like he would, not for the outcomes acting like him would cause.</p>\n<p>(2) A corollary of &quot;act as Jesus would&quot; is &quot;help thy neighbor&quot;; many of the students we talked to felt a need to prioritize local aid, or at least do it along side non-local aid.</p>\n<p>(3) When cornered into least-convenient-possible-world thought experiments, most of the Christian students said that it was better to &quot;save&quot; one life (in the sense of salvation, i.e. ensuring one more soul went to heaven) than to save any number of physical lives. To be fair, they were quite resistant to this question, mostly saying that they supported the idea of local or international aid through Christian organizations who would also encourage the spread of Christian principles.</p>\n", "parentCommentId": "8KWptPBqwFoF6cjFR", "user": {"username": "John_Sturm"}}, {"_id": "BZAx4gWWEtujYhudt", "postedAt": "2014-12-31T23:15:15.094Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Fair points.</p>\n", "parentCommentId": "7M3xMgCnNTmsZGMvh", "user": {"username": "John_Maxwell_IV"}}, {"_id": "66NyQyHRfJqRiHyjB", "postedAt": "2015-01-02T03:00:30.251Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>I wouldn't write it off. These reasons may apply to a lot of people, even if they wouldn't express them in those words. I found point 2 particularly interesting.</p>\n", "parentCommentId": "XjQsxuFSJ23TfEYrk", "user": {"username": "Giles"}}, {"_id": "26DPvQsYrybSez72t", "postedAt": "2015-01-02T03:23:20.249Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>I've been talking a lot to an EA outsider, and she offers the following opinions (which I'm expressing in my own words; she hopes to flesh this out into a blog post at some point).</p>\n<p>1) EA is arrogant</p>\n<ul>\n<li>The name &quot;effective altruism&quot;</li>\n<li>The name &quot;effective altruist&quot;</li>\n<li>The attitude towards most charities and their supporters</li>\n<li>The attitude of the Friendly AI people</li>\n</ul>\n<p>2) EA is individualistic. It values individual wellbeing, not (for their own sake):</p>\n<ul>\n<li>Art and culture</li>\n<li>The environment</li>\n<li>Communities</li>\n</ul>\n<p>3) EA is top-down</p>\n<ul>\n<li>Orgs like GiveWell call the shots</li>\n<li>Charities aren't based in the countries they're trying to help</li>\n<li>Donors are armchair-based, don't visit the communities they're trying to help</li>\n</ul>\n<p>4) EA promotes incremental change, not systemic change</p>\n<ul>\n<li>Charity rather than activism</li>\n<li>Part of the capitalist system; money-focussed</li>\n</ul>\n<p>5) EA is somewhat one-size-fits-all</p>\n<ul>\n<li>donors have particular causes that are important to them</li>\n<li>art patrons favour particular artists; they aren't trying to &quot;maximize the total amount of art in existence&quot;</li>\n</ul>\n<p>6) Many consequences are hidden</p>\n<ul>\n<li>If you're a teacher, how do you know what effect you ultimately have on your students?</li>\n</ul>\n<p>7) How do you assess the actual needs of the communities you're trying to help?</p>\n<ul>\n<li>Have you asked them?</li>\n</ul>\n<p>8) The whole Friendly AI thing is just creepy.</p>\n<ul>\n<li>If it is real, it means a tiny elite is making huge decisions for everyone without consulting people if that's what they want</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "hbp7nqnakdE4Tjaaa", "postedAt": "2015-01-02T04:42:13.487Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>My suggestion: if you can't think of an existing resource that answers one of these criticisms, then write it yourself.</p>\n", "parentCommentId": "26DPvQsYrybSez72t", "user": {"username": "Bitton"}}, {"_id": "wtL6zAk8Rn9QhjvW2", "postedAt": "2015-01-02T11:38:23.806Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>The language is certainly atypical, but I don't actually think these reasons are weird at all; they're what I would consider pretty common/core objections to EA and I've heard versions of all of these before. I think they're worth answering, or at least having answers available.</p>\n", "parentCommentId": "XjQsxuFSJ23TfEYrk", "user": {"username": "AGB"}}, {"_id": "eRAZq2W6LPpXB6Lub", "postedAt": "2015-01-02T12:11:20.289Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>&quot;Maybe you’re already doing this much more than me - I’m sure some people are, and that’s great. But I also think it’s not something we’ve prioritised or talked much about explicitly as a group. This is surprising, in a way - seeking negative feedback is such an obviously useful thing. So why aren’t we doing this more?&quot;</p>\n<p>First off, I like this post and up-voted it, because the concrete suggestions on how to go about this are good and I would like to see them done.</p>\n<p>But my response to this post up to this point was to be confused because I think talking and listening to outsiders is already prioritised very highly. To take an obvious example, at London EA meetups I try to spend the bulk of my time talking to people who I don't recognise and asking what their impressions are. Within EA, one of the main things I do is try to feed back those outside impressions and use that to shape how we approach things. Am I really one of few people deliberately doing this? </p>\n<p>I guess I might fall into the 'maybe you're already doing this more than me' category and then be committing a typical mind fallacy.  With that said, I do see at least some evidence that a lot of other people are thinking about this hard and implementing at least your first three suggestions:</p>\n<ol>\n<li><p>In much of the internal discussion about how to present EA that you reference, people imply or explicitly state that their basis for their opinion is exactly such conversations with outside friends or family.</p>\n</li>\n<li><p>There have been multiple long facebook threads seemingly doing exactly this; it seems quite popular and most of the commentary has been thoughtful. In fact, I'm not aware of a public critique of EA that hasn't been widely shared and reasonably fairly discussed within the community. I think this is good! But beyond perhaps drawing together common strands of criticism, I'm not sure what more we actually could do here.</p>\n</li>\n<li><p>Ben Kuhn stands out here, with both his description of HCEA meetings with other groups below and blog posts like <a href=\"http://www.benkuhn.net/etg-objections\">http://www.benkuhn.net/etg-objections</a>. There's also some overlap with 2, which I think is being heavily done. Anecdotally I also think CEA is trying to do this, especially on the academics/public figures front.</p>\n</li>\n<li><p>Ok, AFAIK this is new. No idea how to implement it sensibly, but quite probably worth someone's time. I'm curious as to whether CEA/EAO have considered anything like this, and if so what they make of it.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "AGB"}}, {"_id": "jA8PxFugKpqheLJL6", "postedAt": "2015-01-02T15:39:28.438Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>That's interesting to hear about their beliefs for #2. By contrast, the leaders at my church specifially say that everyone is our neighbor.</p>\n", "parentCommentId": "tQRZN2xT4PPpGSEik", "user": {"username": "Andy_Schultz"}}, {"_id": "AF249jXydYnJBnsgi", "postedAt": "2015-01-02T18:12:43.348Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Object level suggestion for collecting diverse opinions (for a specific person to look through, to make it easier to see trends): have something like a google form where people can report characteristics of an attempt to bring up EA ideas to a person or audience, and report comments on how the ideas were received. (This thread is a Schelling Point now, but won't remain so in the future)</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "wpboM4Y5umhTywGQw", "postedAt": "2015-01-02T18:27:59.812Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>I would like to note (although I don't quite know what to do with this information) that the proposed method of gathering feedback leaves out at least 3 billion people who don't have internet access. In practice, it's probably also limited to gathering information from countries/in languages with at least some EA presence already (and mainly English speaking). Now, from a &quot;optimize spread of EA ideas&quot; perspective, it might be reasonable to focus in wealthier countries to reach people with more leverage (ie. expected earnings), but there are reasons to pay attention to this:</p>\n<p>1) It could be very useful to have a population of EAs with background/lived experience in developing countries, to aid in idea generation for new international development programs.\n2) EA might end up not spreading very much to people living in countries like China/India, which will become more economically important in the future.\n3) We might end up making a mistake on some philosophically important issue due to biases in the background of most people in the EA movement. (I don't have a good example of what this looks like, but there might be, say, system 1 factors arising from the culture where you grow up that influence your position on issues of population ethics or something).</p>\n<p>I also don't know how to go about this on the object level, or whether it's the best place for marginal EA investment right now. (I also think that EA orgs involved in international development will have access to more of these diverse perspectives, but the point I make is that they aren't present in the meta-level discussions).</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "zaiy8tpzi2DC3EBWm", "postedAt": "2015-01-03T03:50:05.201Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>What successful responses to these objections have people used in in-person discussions? </p>\n<p>Reading the other comments below has been eye-opening exactly because I wouldn't have anticipated many of the objections to EA. Therefore, I'm not confident enough in my mental model of a non- or anti-EA person to know what responses would convince them, under their value system: the responses on e.g., <a href=\"http://www.benkuhn.net/etg-objections\">Ben Kuhn's page</a> and at <a href=\"http://www.thelifeyoucansave.org/learn-more/common-objections-to-giving\">The Life You Can Save</a> are very convincing to me, and there are plenty of other responses that would score points in a debate, but I'm not sure that's enough. What's worked empirically to change minds?</p>\n", "parentCommentId": null, "user": {"username": "Lu_Wang"}}, {"_id": "NBMk8rQTFSp6FZupu", "postedAt": "2015-01-03T05:27:28.056Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<blockquote>\n<p>at London EA meetups I try to spend the bulk of my time talking to people who I don't recognise and asking what their impressions are. Within EA, one of the main things I do is try to feed back those outside impressions and use that to shape how we approach things. Am I really one of few people deliberately doing this?</p>\n</blockquote>\n<p>Kudos to organizing meetups!  Not too many people do that, actually, so I think you might be rarer than you think.</p>\n<p>Also, do you ever get a chance to talk to people who don't go to the meetup groups?</p>\n", "parentCommentId": "eRAZq2W6LPpXB6Lub", "user": {"username": "Peter_Hurford"}}, {"_id": "f55Dv8vYyuFZvdyvb", "postedAt": "2015-01-03T10:42:40.075Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Sam Hilton does most of the organising, I mostly just turn up :)</p>\n<p>Less so. I have my extended network of friends and acquaintances, obviously, but I'm cautious about bothering people where it doesn't come up naturally or they haven't indicated interest. One of the points of the donation match Denise and I are currently running is to flush out people who might have interest.</p>\n", "parentCommentId": "NBMk8rQTFSp6FZupu", "user": {"username": "AGB"}}, {"_id": "DniRFaTBaXHPyLaTc", "postedAt": "2015-01-03T18:43:24.892Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<blockquote>\n<p>One of the points of the donation match Denise and I are currently running is to flush out people who might have interest.</p>\n</blockquote>\n<p>That's a smart idea!  I hadn't thought of that.</p>\n<p>What are your plans on following up with them?</p>\n", "parentCommentId": "f55Dv8vYyuFZvdyvb", "user": {"username": "Peter_Hurford"}}, {"_id": "qsdZnzdJnmT3yErPN", "postedAt": "2015-01-04T19:40:22.669Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Some of these negative beliefs I hold, others I don't but appeal to the intellectual identities I circulate in, and thus at least register as possible negative beliefs:</p>\n<p>(i) EA is elitist: in being largely constituted, particularly in staff, by well-to-do Oxbridge or Ivy League graduates; in being premised on, and thereby implicitly valuing people according their capacity to, earn-to-give; and in being conducted, within the movement, at a relatively technical level of discourse. There's also a potential anti-egalitarianism in the respect in which charitable giving is normally evaluated, namely, as a percentage of net income rather than, say, relative to a generalised baseline of minimally or moderately decent living. </p>\n<p>(ii) EA is highly individualistic, rendering everything instrumental to the aggregate utility one can discharge through impersonal donations. Structural political and social change are mostly irrelevant, and insofar as they are, it is typically as new sites for impersonal donations.</p>\n<p>(iii) EA is overwhelmingly populated by utilitarians and utilitarian thinking, despite external pretensions of being an ecumenical movement unified by concern for charitable giving. This is self-limiting as a movement, in that it discourages those not observing, what is for most people, a highly controversial ethical theory.</p>\n<p>(iv) From my experience, most people simply don't accept - intellectually and/or psychologically - the demanding moralism implicit in charitably donating 10% of one's income; they don't see any impersonal and objective reason for doing so, and thus are not moved (the second most common response, in my experience, is for them to rationalise that charities are uniformly money-grubbing and ineffective).</p>\n<p>Obviously these are not unrelated.</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "g3om3FYbboZ2rDFmB", "postedAt": "2015-01-04T20:07:57.410Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Mostly I just want to talk to those in my extended (non-EA) network who donate, thank them for donating, and work out where they are w.r.t. EA ideas. I don't currently have a more detailed plan than that.</p>\n", "parentCommentId": "DniRFaTBaXHPyLaTc", "user": {"username": "AGB"}}, {"_id": "j6kBg5LdDSRiyeqyH", "postedAt": "2015-01-04T20:24:38.001Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>I don't have the impression that most people talk and listen to outsiders as much as I do. I think the Bay Area is a lot worse about this than Boston (for instance, AFAIK the Bay Area has no introductory EA meetups), so maybe it's an issue with how numerous local EAs are? In Boston we were forced to talk and listen to outsiders a lot because there weren't enough insiders, but in the Bay Area you can easily forge an entire social circle out of people in the EA movement and never interact with anyone else.</p>\n<p>This might explain why Jess has observations closer to mine than yours, since hers are based partly on Oxford, which has a similar critical mass to the Bay Area.</p>\n", "parentCommentId": "eRAZq2W6LPpXB6Lub", "user": {"username": "Ben_Kuhn"}}, {"_id": "p3RfLzprRskoChHvX", "postedAt": "2015-01-04T23:35:07.251Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>At our Dutch EA meetup we got some feedback from a complete newcomer which we found quite useful. To summarize:</p>\n<ul>\n<li><p>EA lacks concrete actions that a newcomer can take to do something that is in some sense effective. In particular, to make a tangible impact. Everything seems to pay off (if at all) in the very long run. Not appealing to a broad audience.</p>\n</li>\n<li><p>Because EA lacks concrete actions and a concrete common purpose, the message remains unclear. Only a certain type of person can handle this ambiguity long-term. We've got the 'Why' and the 'How', but the 'What' remains blurry (she was not familiar with Will's post about EA, which uses exactly these terms to describe EA btw).</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": null}, {"_id": "vWSomDErM8a6pWy66", "postedAt": "2015-01-05T00:13:58.277Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Yeah we got similar feedback in Melbourne and agreed that it was not clear that we had great short-term things for people to do. There's donating, for one, and in Oxford, historically, there's been scope for volunteering, but apart from that it is tricker. There's .impact, and there's helping with arranging events and talks but it's not clear that those are the right kind of activity. Obviously, protests aren't either. But some kinds of non-costly in-group activities that have at least some impact would be great.</p>\n", "parentCommentId": "p3RfLzprRskoChHvX", "user": {"username": "RyanCarey"}}, {"_id": "qt7dksE7BKdQzD6Jv", "postedAt": "2015-01-05T13:05:43.846Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Thanks for being so honest, Nicholas, really useful to hear your perspective - especially as it sounds like you've been paying a fair amount of attention to what's going on in the EA movement. I can empathise with your point 4. quite a bit and I think a fair number of others do too - it's so hard to be motivated if you're unsure about whether you're actually making a difference, and it's so hard to be sure you're making a difference, especially when we start questioning everything. For me it doesn't stop me wanting to try, but it does affect my motivation sometimes, and I'd love to know of better ways to deal with uncertainty.</p>\n", "parentCommentId": "7dLwtddrYMzko5SYv", "user": {"username": "Jess_Whittlestone"}}, {"_id": "h4MLKHLmgEE2Ywspn", "postedAt": "2015-01-05T13:43:23.088Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Thanks, Ben! This is a great idea, especially for student groups.</p>\n", "parentCommentId": "biqMtGeR8FfGSNHAq", "user": {"username": "Jess_Whittlestone"}}, {"_id": "fk54Jd3dkLHSXhAG5", "postedAt": "2015-01-23T08:25:55.438Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Nicholas, can you please elaborate on point 3 - your thoughts and what you care about might genuinely be things that I +others collected here should be caring about or taking into account. I'm interested. Please just email me at <a href=\"mailto:tomstocker88@gmail.com\">tomstocker88@gmail.com</a> if they're so different from humanity's preferences that they're problematic to share publicly. Thank you for posting this, even if you are egoistic (I don't know many people that aren't to some extent), you have courage / honesty, which is awesome.</p>\n", "parentCommentId": "7dLwtddrYMzko5SYv", "user": {"username": "tomstocker"}}, {"_id": "6WidrCndniQ5nDsef", "postedAt": "2015-02-01T00:25:09.163Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Any one got good answers to 1), 8), and something that seems to be an element of 3) &amp; 7) which is something like &quot;there seems to be a real lack of actual experience living/befriending etc. your beneficiaries - surely this will help you learn what is important, and the validity of your data?&quot;  ?</p>\n", "parentCommentId": "26DPvQsYrybSez72t", "user": {"username": "tomstocker"}}, {"_id": "XnsmYAGv8b9ehW6RN", "postedAt": "2015-02-01T00:29:46.522Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>Can you argue on christian grounds - for example: </p>\n<p>1). Jesus was very strong on giving to the poor - not to convince people of God but because they were poor and in need - Ananias was struck down (only person in New Testament I think) because he failed to tithe to the poor. People came to him asking to follow him (meaning high probability of salvation) - he said to give ALL of their money away to the poor first.</p>\n<p>2). loving thy neighbour is all about loving people you aren't familiar with or are even afraid of.</p>\n<p>3). you just kind of have to accept if they believe in eternal damnation - infinite QALYs for each person saved.</p>\n", "parentCommentId": "tQRZN2xT4PPpGSEik", "user": {"username": "tomstocker"}}, {"_id": "7KZ4BA5rf2MfkBYeB", "postedAt": "2015-02-01T00:34:38.677Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>(i) really gets me: I think these ideas would really take off among different groups of people if presented differently.\n(ii) I think the remedy to this is just to estimate the benefits of societal change. The structural political thing is different and quite an interesting question for an EA - but the lack of analysis of power structures is certainly something to address (This isn't Raymond Geuss is it??)\n(iv) - don't see why this is important - it's a contraint or bias rather than a morally salient criticism? </p>\n", "parentCommentId": "qsdZnzdJnmT3yErPN", "user": {"username": "tomstocker"}}, {"_id": "NMQLqQQFpCEA3JzMc", "postedAt": "2015-02-01T00:38:12.432Z", "postId": "7oEMDW8gSZ4DTpg8d", "htmlBody": "<p>If people don't bring a basic &quot;caring for other people&quot; vibe, you're either down to meta-ethics, which I haven't had any luck persuading people to care with, or their own moral or psychological framework - which entails a level of familiarity?</p>\n", "parentCommentId": "zaiy8tpzi2DC3EBWm", "user": {"username": "tomstocker"}}]