[{"_id": "JD8krGAgi2WnZ3krK", "postedAt": "2022-11-14T00:48:47.926Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>See NonLinear Emergency Funding <a href=\"https://forum.effectivealtruism.org/posts/L4S2NCysoJxgCBuB6/announcing-nonlinear-emergency-funding\">https://forum.effectivealtruism.org/posts/L4S2NCysoJxgCBuB6/announcing-nonlinear-emergency-funding</a></p>\n", "parentCommentId": null, "user": {"username": "rharris"}}, {"_id": "pqpCAxe2MbbFJy9LW", "postedAt": "2022-11-14T09:28:34.540Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>Wishing you best of luck Markus!<br><br>As one of the people who Markus worked with during the pilot phase, I can very much attest to the value he brings to an organization, and would be happy to speak with any potential funders about my experience working with Altruistic Agency.</p>", "parentCommentId": null, "user": {"username": "ezrah"}}, {"_id": "BQegGbd8xGbsB6sXE", "postedAt": "2022-11-14T09:36:57.384Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>Thank you, Ezra, that is very kind of you.</p>", "parentCommentId": "pqpCAxe2MbbFJy9LW", "user": {"username": "peppersghost"}}, {"_id": "jkEptgCJcsCMyJJfy", "postedAt": "2022-11-14T09:37:27.407Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>Thank you for taking the time to post this reply, this is really helpful.</p>", "parentCommentId": "JD8krGAgi2WnZ3krK", "user": {"username": "peppersghost"}}, {"_id": "abcJFbvDdFWsEFcpH", "postedAt": "2022-11-15T01:53:06.225Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>Please forgive the insensitivity of the following question. I've been wondering about this for a while and  now I'm (ab)using your post about your troubles and ambitions as a place to ask it: What is your thinking on charging money for the tech support part of your work?</p>\n<p>The EA ecosystem appears to consist of organizations supporting each other for free, while being funded by a third party. How about third-parties funding only those organizations that do direct work and can't have paying customers, and having the rest be semi-commercial, organized by market forces? (I know that this wouldn't work for your more ambitious projects. But for the day-to-day tech support it should be possible, at least in a market economist's dream world.)</p>\n", "parentCommentId": null, "user": {"username": "rmoehn"}}, {"_id": "H8hNJJ8ffFQ3WuGT2", "postedAt": "2022-11-15T12:21:38.336Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>I've spent a lot of time this year looking into this exact scenario and discussing various models with many people with different views. Most other EA agencies are trying to figure it out as well.</p><p>What is most likely is that I'll move to a hybrid model where the first X hours are free, and after that, most would pay some (below market rate) fee that is offset by larger clients that can afford market rate. The main reason for this is that my data suggests around 70% of clients would have tried to solve the issues themselves otherwise, which is a huge time waste. Another reason is that there is a significant transaction cost, especially given that the funding for services like these often comes from the same sources (in the EA funding landscape) in the end.</p><p>In any case, I expect this part of the agency's activities to be relatively small in the future, as creating public goods and services is immensely more valuable.</p>", "parentCommentId": "abcJFbvDdFWsEFcpH", "user": {"username": "peppersghost"}}, {"_id": "unn9sc5SNDNZNMdtz", "postedAt": "2022-11-16T22:06:52.182Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>Thanks for explaining! I'm happy to read that you're discussing this with other people, too.</p>\n", "parentCommentId": "H8hNJJ8ffFQ3WuGT2", "user": {"username": "rmoehn"}}, {"_id": "HWeKbXG8hiPip5e3P", "postedAt": "2022-11-29T17:18:40.573Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>I also worked with Markus during his pilot phase, and his work was extreamly helpful in helping us figure out some technical bits that he was able to do very quickly, but would have taken me hours (maybe would have just never been able to fix alone). I was exceptionally grateful for his help and it just gave me so much faith in the EA community that such a service would even exist. &nbsp;Still feel really grateful for all his help.</p>", "parentCommentId": null, "user": {"username": "Joy Bittner"}}, {"_id": "R9gr3BBGCykgFcmyk", "postedAt": "2022-11-29T22:50:33.772Z", "postId": "7q8uEwksmP5wK6kqA", "htmlBody": "<p>Thank you for the kind words.</p>", "parentCommentId": "HWeKbXG8hiPip5e3P", "user": {"username": "peppersghost"}}]