[{"_id": "CTzGsxDhBspGFNDfi", "postedAt": "2022-11-13T18:20:17.160Z", "postId": "7qd68BsKhHnBEGtB5", "htmlBody": "<p>If you want to become a research assistant to academic economists, I would recommend taking econometrics courses with a coding component. A course using Stata is probably best for this, but R might also be fine. The essential requirement for most of those jobs is being able to clean data and run econometric tests, usually within Stata.</p>", "parentCommentId": null, "user": {"username": "Joseph Richardson"}}, {"_id": "Chfi739ejjD2LpFZj", "postedAt": "2022-11-13T19:25:43.493Z", "postId": "7qd68BsKhHnBEGtB5", "htmlBody": "<p>I agree with this, but to add on since the post mentioned 3-4 courses.</p><p>&nbsp;</p><p>I would say if you're picking 3, definitely econometrics, &nbsp;stats/probability to supplement analysis skills. For the third, I would say probably development economics (both to visibly show interest in the topic and have a professor you can try to build a relationship for resources/recommendations &nbsp;in that network). Two potential caveats- if you think the ability to leverage the network of the behavioral econ professor is better, or if that's a substantially more research skill building class that's also a pretty good option. Other caveat would be that depending on the level of the course, the Econometrics course could plausibly require or at least benefit a lot from better linear algebra skills- that'd suggest econometrics/stats/lin alg.</p><p>&nbsp;</p><p>If you're taking 4 to stand out to employers: same logic as I described above probably applies. Would also add that depending on grad school being a possibility for you, many PhDs require or strongly suggest linear algebra.</p><p>&nbsp;</p><p>One final thought here: I'm treating this as if you need to stay within that list- if there is an option to go outside that list (maybe to a CS or stats department?), learning programming/statistical computing skills might be among the highest value couple options.</p>", "parentCommentId": "CTzGsxDhBspGFNDfi", "user": {"username": "Andy Timm"}}, {"_id": "78C8MmbkLRikAEMGZ", "postedAt": "2022-11-13T19:39:56.187Z", "postId": "7qd68BsKhHnBEGtB5", "htmlBody": "<p>Strongly agreed with both of the comments above. One additional strategy to consider would be looking into whether any of the professors in your school's economics department typically hire part-time undergrad research assistants. If so, taking a class with one of those professors and impressing them is a good way to get a job, which can then serve as a stepping-stone to RA jobs at other institutions (since you'll pick up skills and get someone who can write you a recommendation letter).</p>", "parentCommentId": "CTzGsxDhBspGFNDfi", "user": {"username": "Shakked Noy"}}, {"_id": "Xsx8WgupsgzZvtnJp", "postedAt": "2022-11-13T20:05:44.831Z", "postId": "7qd68BsKhHnBEGtB5", "htmlBody": "<p>Are you interested in grad school or just working in non-profit sector, or private sector?&nbsp;</p><p>My background is more theory so take all of this with grain of salt.</p><p>During your undergrad, I would recommend to focus on learning as much math, coding, and statistics as you can. I worry less about learning economics for now.</p><p>With some RAships, you might not learn that much from them (they will just be grunt work). You will be more likely to get better RA positions slightly later once you have built up more skill/knowledge. So I would consider waiting to do RAs till late in college (summer after 3rd year at the earliest) or even after college when you have solid statistics and coding knowledge. &nbsp;I would even recommend considering switching majors away from economics towards math (or mathematical economics) or statistics if you can (though not necessary).</p><p>Regarding your courses. I wouldn't prioritize taking any of those economics classes except econometrics. The probability and statistics class would be very good as long as it's more advanced than the statistics class you already took. Probability is something that you will &nbsp;need to study multiple times to understand well.</p><p>I would say Linear Algebra is essential so take that for sure. Personally I very much like the book linear algebra done wrong by Sergei Treil (though it is a little advanced). Gilbert Strang also has a nice online course on LA. I would steer clear of \"abstract\" linear algebra courses/books such as Axler. Keep in mind that this is a visual subject; don't get lost in the algebra.&nbsp;</p><p>I would also recommend a good sequence in econometrics (ideally at least 2 courses that have probability/stats as a prereq). Other good courses if your more advanced would be bayesian statistics and/or probabilistic machine learning, maybe monte carlo simulation. &nbsp;</p><p>If you want to go to grad school, you need at least one course in real analysis. For grad school, I would also recommend &nbsp;some sort of \"intro to higher math\"-type course in pure math like discrete math, number theory, or intro to proofs or something-- this will help your mathematical maturity which will pay dividends in the long run in your other courses.</p><p>Learn to code in Stata, R, and/or Python (esp. Pandas package). &nbsp;I would take a course in one of these if possible e.g. a course in statistical computing. Stata is probably best for empirical academic economics research (e.g. &nbsp;development econ). But other languages are probably better if you want more options for other career paths. Maybe also consider doing a certificate online class in one of these languages e.g. from Coursera or Stata Corp or something. Learn to merge, clean, and analyze datasets.</p><p>I would take at least a couple economics classes at some point and try to find a good professor that can mentor you a bit; maybe like a department undergrad advisor. They may also help you network for RAships and give you letters of recommendation.</p><p>Learning this stuff is hard and you might not get some of the material the first time around. Don't get too discouraged if you get a bad grade or even fail a class. Keep reviewing the material and learning it even after the class ends. Study hard, and keep up with good study techniques. Don't get behind. Make sure you are keeping up with the material and if there is something you don't understand (keep a list), ask for help on that. Practice regular self-quizzing: Every day, think about what you learned 2 days ago!</p><p>Coming from an underprivileged background is tough and you should be proud of your achievements so far!</p><p>Also, some good online resources (for self study) (maybe slightly advanced):</p><ul><li>Ben Elsner <a href=\"https://www.youtube.com/playlist?list=PLyvUJLHD8IsJCB7ALqwjRG1BjL5JxE__H\">Causal Inference</a> videos<ul><li><a href=\"https://www.youtube.com/playlist?list=PLD0F06AA0D2E8FFBA\">causal inference with R</a></li><li><a href=\"https://matheusfacure.github.io/python-causality-handbook/01-Introduction-To-Causality.html\">causal inference with Python</a>&nbsp;</li></ul></li><li>Ben Lambert <a href=\"https://www.youtube.com/playlist?list=PLwJRxp3blEvZyQBTTOMFRP_TDaSdly3gU\">Econometrics</a> playlist</li><li><a href=\"https://www.youtube.com/playlist?list=PLD0F06AA0D2E8FFBA\">Mathematical Monk Machine Learning</a> Playlist<br>&nbsp;</li></ul><p>Good books on econometrics (advanced but accessible to <i>advanced</i> undergrads). I don't know the best undergrad level books; maybe others can comment.</p><ul><li>Mostly harmless econometrics.&nbsp;</li><li>Causal inference mixtape.</li><li>Bruce Hansen <i>Econometrics</i></li><li>Jeff Wooldridge <i>Econometric Analysis of Cross Section and Panel Data</i></li></ul>", "parentCommentId": null, "user": {"username": "banon"}}]