[{"_id": "nSqwQuTcEGccNQBZS", "postedAt": "2022-11-08T19:53:55.040Z", "postId": "7qzjdpBgBR8hBv2bN", "htmlBody": "<p>Two more organizations which try to get a narrow group of people (athletes / founders) to give to effective causes:&nbsp;</p><ul><li><a href=\"https://highimpactathletes.org/\">High Impact Athletes</a></li><li><a href=\"https://founderspledge.com/\">Founders Pledge</a></li></ul><p>One more organization trying to get the everyday person to give 1%:&nbsp;</p><ul><li><a href=\"https://www.1fortheworld.org/\">One for the World</a></li></ul>", "parentCommentId": null, "user": {"username": "electroswing"}}, {"_id": "PBoayhmosYcLN4ACX", "postedAt": "2022-11-08T20:22:00.804Z", "postId": "7qzjdpBgBR8hBv2bN", "htmlBody": "<p>To some extent, every EA organization is a \"donation advisor\" in the sense that the overall project of EA is about prioritizing how to spend resources to most effectively do good in the world. &nbsp;But when you get down into the details, many of these organizations have different purposes:</p><ul><li>Givewell, for instance, does a lot of work to investigate individual global health charities and estimate how well each charity is actually achieving its goals. &nbsp;They also do research to figure out things like <a href=\"https://forum.effectivealtruism.org/posts/uTSxcDzPLiifryqH6/technical-updates-to-our-global-health-and-wellbeing-cause\">how to properly compare the value of health improvements vs economic prosperity</a>.</li><li>Similarly, Happier Lives Institute is (as far as I'm aware) mostly a research organization trying to understand issues related to mental health and psychological well-being.</li><li>By contrast, the Life You Can Save is much closer to a pure advocacy organization -- in their annual report they focus on money moved, books distributed, and ratios like \"how much does it cost us in marketing expenses to move each additional $1K to effective charities\".</li></ul><p>IMO the natural structure of the EA ecosystem is to have a relatively small number of grantmaking organizations to coordinate things and maintain a high \"bar\" for funded projects (although I think there should be more than 1 big grantmaker; I would love to see 3-4 organizations on the scale of OpenPhil or FTX Future Fund). &nbsp;Then for research organizations, I think you want lots of organizations of varying size, since there are so many different research agendas to pursue. &nbsp;For pure advocacy / awareness organizations, these should probably be kept small to minimize overhead (although if you are focusing on career change like 80K, or high-net-worth-individuals like LongView Philanthropy, higher overhead is probably necessary to provide more in-depth interaction) and people should be willing to experiment with spinning up new EA-awareness-raising organizations targeting new potential audiences, then shutting them down if they don't catch on.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "ZP5ay4tPoqgoTnhcn", "postedAt": "2022-11-08T21:42:58.287Z", "postId": "7qzjdpBgBR8hBv2bN", "htmlBody": "<p>Nice, thanks! I didn't include niche groups but maybe I'd put them into a separate category if I were myself to do this work (?). Another one is <a href=\"https://www.effectivegivingquest.org/\">https://www.effectivegivingquest.org/</a> for game creators&nbsp;</p>", "parentCommentId": "nSqwQuTcEGccNQBZS", "user": {"username": "setgree"}}, {"_id": "bAxeNphiAcFFju6to", "postedAt": "2022-11-09T11:48:29.418Z", "postId": "7qzjdpBgBR8hBv2bN", "htmlBody": "<p>Nice, thanks! It sounds like you know these orgs better than I do. Superficially, if you look at their websites, you'll notice a lot of <a href=\"https://en.wikipedia.org/wiki/Isomorphism_(sociology)\">organizational isomorphism </a>, e.g.</p><ul><li>GiveWell: \"We search for the charities that save or improve lives the most per dollar.\"</li><li>CEP: \"CEP has resources on effective giving practices for individual donors and philanthropic advisors.\"</li><li>Effective Giving: \"Our mission is to help major donors to find – and fund – the most promising solutions to the world’s most pressing problems.\"&nbsp;</li><li>Grantmakers for Effective Philanthropy: \"our community turns a hunger for more effective philanthropy into clear pathways for achieving it.\"</li><li>The Life You Can Save: \"At The Life You Can Save, we make “smart giving simple” by recommending charities that save lives and improve well-being where each dollar goes the furthest.\"</li><li>Happier Lives Institute: \"The Happier Lives Institute connects donors, researchers, and policymakers with the most cost-effective opportunities to increase global wellbeing.\"</li></ul><p>So it seems like you <i>know </i>that there are substantive differences between these orgs, but at face value, they're marketing themselves in similar ways. So what I'm asking is: has there been something digestible that would articulate their similarities and differences? Has there been any effort to think about whether this is too man orgs or too few? &nbsp;</p><p>(Edited to put the Effective Altruism Foundation into the funder category which I think is a better fit)</p>", "parentCommentId": "PBoayhmosYcLN4ACX", "user": {"username": "setgree"}}]