[{"_id": "fzYjjKvsyiHwTGHde", "postedAt": "2024-02-14T23:53:43.954Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>I'm not affiliated with 80k, but I would be surprised if the average reader who encounters their work comes away from it with higher regard for AI labs than they came in with — and certainly not that there is something like a brand partnership going on. Most of the content I've seen from them has (in my reading) dealt pretty frankly with the massive negative externalities that AI labs could be generating. In fact, my reading of their article \"<a href=\"https://80000hours.org/career-reviews/working-at-an-ai-lab/\">Should you work at a leading AI lab?</a>\" is that they don't <i>broadly</i> recommend it at all. Here's their 1-sentence summary verbatim:</p><blockquote><p>&nbsp;<strong>Recommendation: it's complicated</strong></p><p>We think there are people in our audience for whom this is their highest impact option — but some of these roles might also be very harmful for some people. This means it's important to take real care figuring out whether you're in a harmful role, and, if not, whether the role is a good fit for you.</p></blockquote><p>&nbsp;Hopefully this is helpful. It also sounds like these questions could be rhetorical / you have suspicions about their recommendation, so it could be worth writing up the affirmative case <i>against</i> working at labs if you have ideas about that. I know there was a post last week about this, so that thread could be a good place for this.</p>", "parentCommentId": null, "user": {"username": "Tyler Johnston"}}, {"_id": "2XzQeJWJ7wZrtJAhE", "postedAt": "2024-02-15T00:44:24.634Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>Hey Tyler - I agree that this solves for the case where somebody engages deeply with 80k's content (System 2 thinking). But unfortunately that is not how most people make decisions and form opinions (System 1 thinking).&nbsp;<br><br>The bias here is something like - <i>I am an effective altruist who thinks long and hard about all the opinions I form and decisions I make and therefore that is what everyone else does.</i></p><p>I think 80k needs to either deny or acknowledge that is the reality of the situation.</p>", "parentCommentId": "fzYjjKvsyiHwTGHde", "user": {"username": "Yanni Kyriacos"}}, {"_id": "qhny2vHDmt6k3ECzk", "postedAt": "2024-02-15T05:09:03.706Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>I’m very confused about what you mean by “brand partnerships” in this context</p>\n", "parentCommentId": null, "user": {"username": "bec_hawk"}}, {"_id": "pS3tqBGihC9D3JjcC", "postedAt": "2024-02-15T05:36:41.287Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>Organisations often partner together because they have overlapping audiences but separate products. Here is a dumb example https://www.woolworths.com.au/shop/productdetails/299503/nescafe-original-choc-mocha-tim-tam-coffee-sachets</p>", "parentCommentId": "qhny2vHDmt6k3ECzk", "user": {"username": "Yanni Kyriacos"}}, {"_id": "NQ5rbC76wag45K5Zk", "postedAt": "2024-02-16T09:14:50.880Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>Lol I know what a brand partnership is in general, but I'm not aware of 80k doing anything like that&nbsp;</p>", "parentCommentId": "pS3tqBGihC9D3JjcC", "user": {"username": "bec_hawk"}}, {"_id": "L5KApBLLuYwigYp4e", "postedAt": "2024-02-17T15:29:24.607Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>They're not quite doing a brand partnership.&nbsp;<br><br>But 80k has featured various safety researchers working at AGI labs over the years. Eg. see <a href=\"https://80000hours.org/topic/effective-solutions/top-recommended-organisations/openai/\">OpenAI</a>.<br><br>So it's more like 80k has created free promotional content, and given their stamp of approval of working at AGI labs (of course 'if you weigh up your options, and think it through rationally' like your friends).</p>", "parentCommentId": "NQ5rbC76wag45K5Zk", "user": {"username": "remmelt"}}, {"_id": "74Wkvk9eSBZ9NHzK7", "postedAt": "2024-02-21T04:01:11.147Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>They do it with influencers, but not with labs. They partner with labs by promoting their initiatives, producing thought leaders within the labs, listing their jobs.</p>", "parentCommentId": "NQ5rbC76wag45K5Zk", "user": {"username": "Yanni Kyriacos"}}, {"_id": "jfYaRF8SDAzt5FCTG", "postedAt": "2024-02-21T13:34:08.611Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>This seems like intentionally inflammatory concept creep to me</p>", "parentCommentId": "74Wkvk9eSBZ9NHzK7", "user": {"username": "bec_hawk"}}, {"_id": "k4cEfXX9eyjrMZdyj", "postedAt": "2024-02-21T13:35:22.350Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>I generally think people who listen to detail-focused 3 hour podcasts are the sorts of people who weigh up options&nbsp;</p>", "parentCommentId": "L5KApBLLuYwigYp4e", "user": {"username": "bec_hawk"}}, {"_id": "ooEhWetx2Snt4LDu8", "postedAt": "2024-02-21T23:26:57.893Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>I don't think it is fair to assume anything about my intentions without first asking - maybe you have a question about my intentions? I'm happy to answer any.</p><p>Am I right in saying that you think that me using the word \"partnering\" is inaccurate when when describing 80k listing jobs at labs, having people on their podcast to promote their initiatives and their people? etc<br><br>I'd be happy to use another word, as it doesn't really change the substance of my claims.</p>", "parentCommentId": "jfYaRF8SDAzt5FCTG", "user": {"username": "Yanni Kyriacos"}}, {"_id": "3MmWyRFAjBgkcEvJf", "postedAt": "2024-02-21T23:30:52.619Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>If everyone I targeted with marketing initiatives listened to an entire 3 hour podcast my job (as a marketer) would be a lot easier.&nbsp;</p><p>Of 80k's entire reach, I'd be surprised if 1% had listened to an entire 3 hour podcast in the last 6 months with a lab.</p><p>Most people will glance at their content and see that they're \"working together\" (you can replace \"working together\" with \"partnership\" or whatever phrase you think is more accurate).</p>", "parentCommentId": "k4cEfXX9eyjrMZdyj", "user": {"username": "Yanni Kyriacos"}}, {"_id": "couwfLudMBxjzbHz3", "postedAt": "2024-02-22T03:56:00.872Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>I agree that implies that those people are more inclined to spend the time to consider options. At least they like listening to other people give interesting opinions about the topic.</p>\n<p>But we’re all just humans, interacting socially in a community.  I think it’s good to stay humble about that.</p>\n<p>If we’re not, then we make ourselves unable to identify and deal with any information cascades, peer proof, and/or peer group pressures that tend to form in communities.</p>\n", "parentCommentId": "k4cEfXX9eyjrMZdyj", "user": {"username": "remmelt"}}, {"_id": "7FontPtMArvPRo6B7", "postedAt": "2024-02-22T16:33:30.094Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<blockquote>\n<p>Most people will glance at their content and see that they're \"working together\"</p>\n</blockquote>\n<p>I still don’t see how that would be the conclusion people would draw</p>\n", "parentCommentId": "3MmWyRFAjBgkcEvJf", "user": {"username": "bec_hawk"}}, {"_id": "PkW9WuweWhKGfLrwJ", "postedAt": "2024-02-22T16:35:34.344Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>I’m not assuming anything - I’m stating how it appears to me (ie I said ‘this seems like X to me’, not ‘this is X’).</p>\n", "parentCommentId": "ooEhWetx2Snt4LDu8", "user": {"username": "bec_hawk"}}, {"_id": "oGSGPwfeDG4vKn57i", "postedAt": "2024-02-22T16:58:00.672Z", "postId": "7TKshJxcgqQhEMesK", "htmlBody": "<p>I do think it’s inaccurate to say that 80k listing a job at an organisation indicates a partnership with them. Otherwise you’d have to say that 80k is partnering with e.g. the US, UK, Singapore and EU governments and the UN.</p>\n<p>Re the podcast, I don’t think that’s the central purpose or effect. On the podcast homepage, the only lab employee in the highlighted episode section works on information security, and that is pitched as the focus of the episode.</p>\n<p>I am disappointed at how soft-balled some of the podcast episodes have been, and I agree it’s plausible that for some guests it would be better if they weren’t interviewed, if that’s the trade-off. However I also think that overstating the case by describing it in a way that would give a mistaken impression to onlookers is unlikely to do anything to persuade 80k about it.</p>\n", "parentCommentId": "ooEhWetx2Snt4LDu8", "user": {"username": "bec_hawk"}}]