[{"_id": "Yn6zALFRN4xE2YB9r", "postedAt": "2023-07-20T13:48:41.656Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>These are great updates, thank you for all your work on them! I'm especially excited about being able to search for posts by chronology. Two notes:<br><br>1. I would like to be able to search for a phrase, rather than just one word, using quotation marks like you can on Google. E.g. When I search \"united nations\" and look by time posted, I get a number of results with just the word \"nations\" and for \"New York City\" I get results for \"new\" and \"city.\" Being able to search with quotation marks around the full phrase would be very useful.<br><br>2. If you do add personalized recommendations to the front page, please only make it a small part of the page and very clear that it is user-specific. I like that I know what other users are generally seeing when they come to the Forum and I'm annoyed by e.g. news sites that show me overly catered results.</p><blockquote><p>We’ve been experimenting with recommendations on post pages first, and may also consider personalized recommendations on the Frontpage.</p></blockquote>", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "biNJrLWsbdAxa7eec", "postedAt": "2023-07-20T16:14:59.869Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>Feels like the forum is adding a lot of features recently good work team and good work Lightcone.</p><p>I really appreciate that the forums shows me more of what the best version of me would want rather than maximising engagement.&nbsp;</p><p>Can we have emoji reactions to individual paragraphs?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "KHu7BQ2QuTbRryocB", "postedAt": "2023-07-21T17:16:38.348Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>Nice to see the forum keeps being innovated.</p>\n<p>I would really like to see agree/disagree votes on posts! I think they've added a lot to the comment section, and will be similarly meaningful to posts (even though many posts are complex and make multiple claims).</p>\n<p>I also wouldn't view a \"confused (?)\" react as negative, and as comment writer would actually find it very useful to know when I should edit a comment to clarify!</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "FyKaKJPNcDL7dTH6M", "postedAt": "2023-07-21T21:57:15.053Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>Hi there, thanks for expressing your interest in post votes. I am pretty excited about trying them out on posts after lots of people gave us good reasons for this in our <a href=\"https://forum.effectivealtruism.org/posts/sQ6NdLT9g7Z84f9rL/feedback-requested-ea-forum-reactions#comments\">last feedback post</a>. A major reason we started with the comment level was that turned out to be technically much easier, and we thought we'd be able to learn and iterate faster before considering the post level.</p>", "parentCommentId": "KHu7BQ2QuTbRryocB", "user": {"username": "Sharang Phadke"}}, {"_id": "qfEDWE2aLN5jbn5tx", "postedAt": "2023-07-21T21:59:54.510Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>Thanks Nathan! Do you happen to have an example of another site that does paragraph-level reactions well? The main question that pops to mind is is clutter vs value</p>", "parentCommentId": "biNJrLWsbdAxa7eec", "user": {"username": "Sharang Phadke"}}, {"_id": "B3jAWkjLpxz73xNih", "postedAt": "2023-07-21T22:26:53.021Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>Hey Rocky, thanks for these thoughts</p><ol><li>Searching with quotations is actually supported, and it does give you the desired behavior. The issue is that the snippets of text from posts that we're highlighting are not properly focusing in on the search term. We're planning to fix this soon.</li><li>Thanks for this feedback, we'll keep that in mind. We definitely won't overshadow the main common-to-everyone components of the frontpage.</li></ol>", "parentCommentId": "Yn6zALFRN4xE2YB9r", "user": {"username": "Sharang Phadke"}}, {"_id": "wDkzyAPMu7KBW23Ka", "postedAt": "2023-07-25T17:15:59.752Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<ol><li>I'm really excited about the emojis! I think this has potential to push the forum further towards \"a social network but done well, optimizing for high quality discussions\". I thought the agree/disagree was a great idea and I'm happy you're continuing exploring similar directions</li><li>Regarding writing the post itself: Consider maybe adding descriptions for the screen shots, especially for people listening to the nonlinear-library (text-to-speech) version of the post (as I did originally, and then I came here to see the specific emojis)</li></ol>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "bjuAjJoYAi92tnEXd", "postedAt": "2023-07-27T13:57:00.640Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>I have a crazy opinion that everyone's invited to disagree with: Often long comments on the EA forum would better be split up into a few smaller comments, so that others could reply separately, agree/disagree separately, or (as you point out) emoji-react to separately.&nbsp;</p><p>This is a forum culture thing, right now it would be weird to respond with many small comments, but it would be better to make it not-weird</p><p>What do you think?</p>", "parentCommentId": "biNJrLWsbdAxa7eec", "user": {"username": "hibukki"}}, {"_id": "KATa4MfqASE3rR3YH", "postedAt": "2023-07-30T14:08:57.464Z", "postId": "7Tvc3N7nFa32ekuGA", "htmlBody": "<p>I strongly agree, but people don't really like this. There are, I sense two modes of thinking about comments:</p><ul><li>There to start discussion</li><li>There to find concensus</li></ul><p>Long/interesting comments are good for the former. Short, clear comments are good for the latter.&nbsp;</p>", "parentCommentId": "bjuAjJoYAi92tnEXd", "user": {"username": "nathan"}}]