[{"_id": "4zv5nnngwdjFEjjp5", "postedAt": "2022-10-18T15:15:23.142Z", "postId": "7urvvbJgPyrJoGXq4", "htmlBody": "<p>Cool trying to look at rationality from a political philosophy angle. But what rules of rationality are you suggesting we precommit to?</p><p>One of the informal rules that's pretty popular around here is the virtue of concreteness and precision, and I'd like to hear more about what you concretely imagine.</p>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "myuFqcnPfBPby5ozC", "postedAt": "2022-10-19T16:32:45.315Z", "postId": "7urvvbJgPyrJoGXq4", "htmlBody": "<blockquote>\n<p>But what rules of rationality are you suggesting we precommit to?</p>\n</blockquote>\n<p>Whichever ones you think are good. I will give some examples in future articles, but the issue of whether written policies are good is independent from the issue of which policies are good.</p>\n", "parentCommentId": "4zv5nnngwdjFEjjp5", "user": {"username": "Elliot Temple"}}, {"_id": "ETat2eaaXaKbmwXaM", "postedAt": "2022-10-24T09:13:23.902Z", "postId": "7urvvbJgPyrJoGXq4", "htmlBody": "<p>Thanks for the post !&nbsp;</p><p>It points out an interesting thing, which is that without a <i>mechanism </i>to bring the best information forward, it's hard to get good information. A main reason science has better results than most attempts ar getting knowledge is that it has a mechanism of making experiments, and validating by peers the results.&nbsp;</p><p>Of course, these mechanisms can be flawed, leading to the current reproductibility crisis (research funded by companies trying to protect its products, incentives to make remarkable results to be published, increasing specialization that means your knowledge get less accessible to other fields).</p><p>It also reminds me about<a href=\"https://siparishub.medium.com/your-strategy-like-mine-is-doomed-to-fail-b2b9c73d895a\"> this research</a> that tried to know why our election system puts forward so many incompetent leaders, that fail to resolve our biggest crises. One of the reason was that the \"selection mechanism\" favored those that propagated false information.&nbsp;</p><p>I don't really know how we can implement such a mechanism in EA, though.</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}, {"_id": "vuofXnzgPB8F4ZxEc", "postedAt": "2022-10-24T18:29:26.347Z", "postId": "7urvvbJgPyrJoGXq4", "htmlBody": "<blockquote>\n<p>I don't really know how we can implement such a mechanism in EA, though.</p>\n</blockquote>\n<p>Individuals can work on creating rationality policies for themselves and create a culture where such things are normal, encouraged, expected, etc. An IMO particularly important type is a debate policy. Debate polices basically mean if someone knows you're wrong, and wants to help, there's a way they can correct your error. Without debate policies, there's often no way for that to happen. I just posted an article related to my debate policy:</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/o8ps3uC68AFkGivTJ/my-experience-with-my-debate-policy\">https://forum.effectivealtruism.org/posts/o8ps3uC68AFkGivTJ/my-experience-with-my-debate-policy</a></p>\n<p>I've also written a lot more about this kind of mechanism previously and there are some links to more of that at the end of the new article.</p>\n<p>Besides individual action, an organization could also have a debate policy or other rationality policies. E.g. if someone wants to debate something and meets the right conditions then the organization assigns someone to do the debate. There would need to be some kinda escalation mechanism in case the assigned debater loses, breaks the rules, etc.</p>\n<p>One simplified way to look at a group having a rationality policy is a single leader with a policy plus proxies who help with some of the work. A CEO, founder or whatever of some organization can personally want to be rational and have policies, but delegate some of the implementation like actually doing debates, and have escalation mechanisms for when she or he needs to personally get involved.</p>\n", "parentCommentId": "ETat2eaaXaKbmwXaM", "user": {"username": "Elliot Temple"}}, {"_id": "AmAAF6r7wjavi5a4P", "postedAt": "2022-10-27T09:17:06.651Z", "postId": "7urvvbJgPyrJoGXq4", "htmlBody": "<p>This is interesting, I can get your reasoning behind this. I'm also sure this helps you.</p><p>However, I would have liked a few more things :</p><ol><li>While your debate policy works for you, it sets a very high bar. Debating with people making 20 articles... well this greatly restrains the pool of people to talk to, so I don't see this applied on the EA Forum.<ol><li>It could be interesting, for instance, to propose a debate policy that could work for the EA Forum.</li></ol></li><li>Your post is interesting, but I feel like it could improve by having examples (same in your debate policy I think). There are one or two at the beginning but only at the beginning. I like seeing examples to anchor in my mind what that these rules would look like in a real conversation.&nbsp;</li><li>Maybe put your debate policy more prominently in this post, otherwise we have trouble grasping what the concept means.</li></ol>", "parentCommentId": "vuofXnzgPB8F4ZxEc", "user": {"username": "Corentin Fressoz"}}, {"_id": "AHYgTPFCzwymASmDX", "postedAt": "2022-10-27T16:45:47.123Z", "postId": "7urvvbJgPyrJoGXq4", "htmlBody": "<p>I replied to the other partial-copy of this message at <a href=\"https://forum.effectivealtruism.org/posts/o8ps3uC68AFkGivTJ/my-experience-with-my-debate-policy?commentId=LkcMac7rX2hboSnaZ#LxQdSK7nnyMezGbCm\">https://forum.effectivealtruism.org/posts/o8ps3uC68AFkGivTJ/my-experience-with-my-debate-policy?commentId=LkcMac7rX2hboSnaZ#LxQdSK7nnyMezGbCm</a></p>\n", "parentCommentId": "AmAAF6r7wjavi5a4P", "user": {"username": "Elliot Temple"}}]