[{"_id": "TjbaTeggTBiNy5ekZ", "postedAt": "2017-11-03T18:56:29.430Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>I see you didn't call Charity Science 'talent constrained' but rather 'talent limited'. Was this intentional? Because it does seem Charity Science is an org that would get much better access to talent with more funds for salaries.... and that that is a likely major factor in your talent shortage.</p>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "Ez6asRGZhTkicvhFf", "postedAt": "2017-11-03T21:31:12.076Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>Hey Joey,</p>\n<p>Just a very quick comment to say that I largely agree and 80,000 Hours, as you note, is already moving heavily in this direction.</p>\n<p>For instance, we track 'impact-adjusted' plan changes, to try to proxy the fact that some plan changes are far bigger than others. Recently, we've been focused only on growing the biggest changes in our priority paths (&quot;upgrading&quot;), since we think this is where the biggest bottlenecks lie in the community, and we've tilted our content and coaching in that direction.</p>\n<p>We've also started to hire cause specialist coaches, to focus on resolving the most pressing talent bottlenecks in each cause area.</p>\n<p>Along the lines of some of your other suggestions, we also set up 80000hours.org/job-board/ and are looking into an EA internship and scholarship scheme.</p>\n<p>I can't speak for them, but my impression is that CEA is taking similar steps. Open Phil is also doing more of this kind of work, such as with the AI Fellowship.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "jGdA3NKmb3Fq5GGjS", "postedAt": "2017-11-05T13:13:32.985Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>The use of the term talent constrained vs talent limited was not intentional. </p>\n<p>Overall I think salary is not a large factor in our talent concerns. We have experimented with different levels of salaries between 10k and 50k USD and have not found increasing the salary increases the talent pool in the traits we would like to see more of. It could be that 50k is still too low or that we are not marketing our jobs in communities that are very income sensitive. I would guess that normally we are looking for pretty hardcore/dedicated EAs and that tends to correlate very strongly with people who take low salaries.</p>\n", "parentCommentId": "TjbaTeggTBiNy5ekZ", "user": {"username": "Joey"}}, {"_id": "YqYmHt9JpmrdRcbAH", "postedAt": "2017-11-05T19:01:15.337Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>People who have the requisite talent level to be a &quot;top&quot; or &quot;senior-level&quot; hire seem to be rare in general, given that there's a huge market for recruiting organizations whose only job is to refer promising senior-level hires to companies who will pay a five-or-six-figure bounty if they actually manage to hire someone at that level.</p>\n<p>How many people connected to effective altruism are at this level, AND are not involved with some other key EA project, AND do not already have a job that generates enough money that they'd be very unlikely to take a low-salary job at a small EA organization? (Even if you care a lot about impact, it's probably tempting to make $150,000 and donate $50,000 for &quot;someone else&quot; to make that impact, rather than to take the $50,000 job yourself.)</p>\n<p>It seems like we're talking around one aspect of the problem: What, exactly, defines a &quot;top hire&quot;? What are the differences between that person and the average enthusiastic recent college graduate? How many of those differences can be remedied with an internship and some skills training, and how many are inherent features of the way someone &quot;turned out&quot; after their first twentysomething years of being alive? What fraction of the EA population -- among people who are willing to go in for unpaid training and don't already have great jobs/positions -- might actually be able to become &quot;top hires&quot; with a reasonable amount of training?</p>\n<p>I'd be interested to hear your thoughts on that, Joey. Having run a few small organizations myself, I've worked with people who were reliable vs. unreliable, or who had good vs. bad instincts, and I know what my own criteria look like, but I don't have a good sense for how many people actually fit those criteria, since I've done very little direct &quot;hiring&quot; (these were student orgs, so anyone who wanted to join was welcome).</p>\n", "parentCommentId": null, "user": {"username": "aarongertler"}}, {"_id": "6PR4eWYzCvqwK5nuK", "postedAt": "2017-11-06T09:58:11.325Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<blockquote>\n<p>We have experimented with different levels of salaries between 10k and 50k USD and have not found increasing the salary increases the talent pool in the traits we would like to see more of</p>\n</blockquote>\n<p>Is this really true throughout the whole range? It seems extraordinary to claim that moving from a salary of 10k to 20k truly had no effect. Most EAs live on much more than US$10k, and I think this is the right call for most of them.</p>\n", "parentCommentId": "jGdA3NKmb3Fq5GGjS", "user": {"username": "Ben_Kuhn"}}, {"_id": "NKK4Ttou34pTvC4bE", "postedAt": "2017-11-06T11:53:38.881Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>10k was not attempted for people living in the higher income countries (with the exception of the co-founders) as it would often go below minimum wage.</p>\n", "parentCommentId": "6PR4eWYzCvqwK5nuK", "user": {"username": "Joey"}}, {"_id": "C8ucLKnPb28yCESez", "postedAt": "2017-11-06T14:59:27.586Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>Hi Joey, how can one apply for Charity Science's tech lead position? The link on your jobs page just goes to a Github repo.</p>\n", "parentCommentId": null, "user": {"username": "oge"}}, {"_id": "M4TuHQwM7RGj6SZBS", "postedAt": "2017-11-06T21:23:04.790Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>FWIW, 50k seems <em>really</em> low to me (but I live in the U.S. in a major city, so maybe it's different elsewhere?). Specifically, I would be hesitant to take a job at that salary, if for no other reason than I thought that the organization was either dramatically undervaluing my skills, or so cash-constrained that I would be pretty unsure if they would exist in a couple years.</p>\n<p>A rough comparison: if I were doing a commissioned project for a non-profit that I felt was well-run and value-aligned, my rate would be in the vicinity of $50USD/hour. I'd currently be willing to go down to $25USD/hour for a project that is something I basically would have done anyways. Once I get my PhD I think my going rates would be higher, and for a senior-level position I would probably expect more than either of these numbers, unless it was a small start-up-y organization that I felt was one of the most promising organizations in existence.</p>\n<p>EDIT: So that people don't have to convert to per-year salaries in their heads, the above numbers if annualized would be $100k USD/year and $50k USD/year.</p>\n", "parentCommentId": "jGdA3NKmb3Fq5GGjS", "user": {"username": "jsteinhardt"}}, {"_id": "xsiZm3b5GZcLHNduY", "postedAt": "2017-11-06T22:21:50.370Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>What was the communication of this like? As someone who I believe has monitored CS pretty closely, I can't remember a time a salary approaching $50k was communicated.</p>\n", "parentCommentId": "jGdA3NKmb3Fq5GGjS", "user": {"username": "joshjacobson"}}, {"_id": "jsbp3aNku88WLrZA8", "postedAt": "2017-11-06T22:45:20.931Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>But you did find that 20k (above min wage in most places) was not appreciably different from 50k in terms of &quot;talent pool in the traits we would like to see more of&quot;? I'm still extremely surprised. While above the minimum wage, 20k would require many EAs I know to make large sacrifices in housing location, quality and/or savings buffer.</p>\n<p>Are you only looking for people who are willing to move to India, or do you think the traits you care about are strongly correlated with being willing to make large sacrifices on those dimensions, or what?</p>\n", "parentCommentId": "NKK4Ttou34pTvC4bE", "user": {"username": "Ben_Kuhn"}}, {"_id": "HfrnRjkECYNRQZhEw", "postedAt": "2017-11-06T23:21:21.094Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>We have not posted a job ad with a 50k set salary, but as I mentioned above, in the late interview stages we often ask what salary candidates are looking for without specifying a number for the job beforehand.</p>\n", "parentCommentId": "xsiZm3b5GZcLHNduY", "user": {"username": "Joey"}}, {"_id": "WAc8vonBiz3RySmbT", "postedAt": "2017-11-06T23:22:06.724Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>Most of these jobs included a move to either Vancouver or India. I do expect strong ability/interest in self-sacrifice correlates with many of the traits we are looking for. With our strongest candidates we often ask what salary they are looking for without specifying a number for the job beforehand, although our budget is public so they could in theory deduce the current average wages other employees are getting.</p>\n", "parentCommentId": "jsbp3aNku88WLrZA8", "user": {"username": "Joey"}}, {"_id": "Y7xDiZixyX6dgEAq3", "postedAt": "2017-11-07T00:05:03.109Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>Great to see you are so keen. The job ad was not yet finished and public. It is now public and attached to that page.</p>\n", "parentCommentId": "C8ucLKnPb28yCESez", "user": {"username": "Joey"}}, {"_id": "G3T9ox5rde58Gqcp9", "postedAt": "2017-11-07T04:40:26.714Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>FWIW: Although part of this might be anchoring (it perhaps 'hurts more' to go down in salary rather than start at a low salary level) I don't think I'd have taken my current role as a researcher at FHI for salaries at the 20k sort of level (when adjusted for living expenses etc.) but much more palatable at the upper end of the 20-50k interval.</p>\n<p>I regret I am far from a moral saint (like e.g. Katherine and yourself, Julia Wise and Jeff Kaufmann, many others), and I expect I am less virtuous in this respect (and many others) than the typical EA who would contemplate direct work. But, insofar as one thinks some counterpart of mine (e.g. EA aligned medical doctor who specialised in public health and who was passionate about global poverty) could be an effective hire at a group like this, I think this offers evidence against  a really strong correlation between altruistic ardour and the traits of efficacy you desire.</p>\n<p>[I suspect asking for what salary a candidate looks for given public knowledge about the extremely low salary you and other employees claim may implicitly screen out people pre-application who would only work for more generous remuneration.]</p>\n", "parentCommentId": "WAc8vonBiz3RySmbT", "user": {"username": "Gregory_Lewis"}}, {"_id": "3iDsoggDNEBXjagjh", "postedAt": "2017-11-07T08:54:44.891Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>[My views, not my employer's.]\nJust a data point, but I interpreted &quot;We have experimented with different levels of salaries between 10k and 50k USD and have not found increasing the salary increases the talent pool in the traits we would like to see more of.&quot; to mean that you had advertised salaries between 10k and 50k. I don't know if others would have misinterpreted it in the same way. </p>\n<p>Does that statement instead mean &quot;When we asked people who made it through to late interview stages what salary they required, candidates who asked for 50k salaries were not on average better qualified than those who asked for 10k salaries.&quot;? If it does, this suggests that <em>of relatively well-qualified candidates who thought that CS would meet their salary requirements</em>, salary didn't seem to affect quality between 10k and 50k.  But you might be missing some better-qualified candidates who required a 45k salary, but thought that CS wouldn't be able to meet that requirement, or who felt uncomfortable asking for such a salary given that they knew other people at the organisation took lower salaries.  So I worry that there will still be some effect of shrinking the applicant pool that you're not accounting for.</p>\n<p>(Maybe you advertised the salary as a range (20k to 50k), then asked candidates where they wanted to be on the range. In that case, I think my worry is slightly weakened, but that people might still feel uncomfortable asking for the higher end, given CS's reputation for people taking low salaries.)</p>\n", "parentCommentId": "HfrnRjkECYNRQZhEw", "user": {"username": "Maxdalton"}}, {"_id": "A34a9xMrhMYeRqfFt", "postedAt": "2017-11-07T14:49:15.822Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>I think the traits we are looking for in a senior hire are pretty complex and fairly rare even in the EA movement, so it's hard to take a strong counterexample without me interviewing someone to see if they would be a good fit. </p>\n<p>It would be interesting for my next senior hire to explicitly put a higher range (e.g. 50-100k) and see if the application pool changes dramatically. My expectation is we would get more total applications but the same number from the category we would considering hiring in the end (0-2 candidates). </p>\n", "parentCommentId": "G3T9ox5rde58Gqcp9", "user": {"username": "Joey"}}, {"_id": "iH4w3mDHX9G9rPNXc", "postedAt": "2017-11-07T14:49:53.977Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>We generally post job ads without specific salaries. 50k is the highest that someone has asked that we have paid. It is not the highest people in late stage interviews have asked (it would range from 10k-100k if we used that criteria). My sense from most of my interviews is that candidates did not have a strong sense of the salary range of CS. We are more public about this now and more well known now than we were for the majority of the interviews I am speaking of. </p>\n", "parentCommentId": "3iDsoggDNEBXjagjh", "user": {"username": "Joey"}}, {"_id": "AabeCwaAifhmxQ7kn", "postedAt": "2017-11-11T07:18:20.636Z", "postId": "7vTwej6np9LzFaeXg", "htmlBody": "<p>Great points! I'm going against the trend where community-building organizations focus on number of people rather than attracting people who might do high quality work. I'm intentionally growing Evidence and Reasoning Enthusiasts slowly and selecting for people who have demonstrated the ability to make an important update publicly, who have improved their rationality by reading books, etc. I am so glad to see this connection being made by someone other than me! I feel inspired! Thanks!</p>\n", "parentCommentId": null, "user": {"username": "Kathy_Forth"}}]