[{"_id": "zf8bzk4GsedcWjuRf", "postedAt": "2014-10-06T19:52:42.761Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>There was a great thread in the facebook group on whether people making a modest wage (around or below $30k/yr in US terms) should be donating to effective charities or saving money. I'd like to weigh in on this but that thread is already pretty crowded and unstructured.</p>\n<p>The proposition here is &quot;People with average or below average income should save money rather than donate to effective charities&quot;</p>\n<p>One thing that it looks like almost nobody mentioned is the opportunity cost of worrying about other people over yourself and how this corresponds to effective altruistic output. It seemed from facebook that most EA's were against the proposition, claiming that most people in the developed world are still far better off than X% of the global population and therefore they should still be donating some percentage of their wealth. I believe there is a strong case to be made that focusing on optimizing one's own career capital, not just making smart personal finance decisions, will enable one to earn substantially higher income in the future and thus be a more &quot;E&quot; EA. Any intellectual power devoted to understanding the EA argument (doing the relevant research, picking an EA organization or EA-organization-recommended charity to donate to, and &quot;stretching your EA muscles&quot; by donating a small amount over a regular period of time) is a small investment in terms of money but a large investment in terms of intellectual capital that I think dedicated EA's tend to discount because they have already invested this capital. This is a CFAR-esque argument that advocates focusing on personal development and improvement until one is at a level to reasonably maximize one's own output both in terms of income and effectiveness of donations.</p>\n<p>I am still uncertain about my position in this debate, but it seemed that most EA's (at least on facebook) were strongly against the proposition so I would like to see more discussion taking the above points into consideration.</p>\n", "parentCommentId": null, "user": {"username": "AlexCuevas"}}, {"_id": "WPQHLHJnzSQNFyFq9", "postedAt": "2014-10-06T20:16:53.017Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Context <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/655328167856877/\">here</a> (fixed)</p>\n", "parentCommentId": "zf8bzk4GsedcWjuRf", "user": {"username": "RyanCarey"}}, {"_id": "Zmu9xQJSgj82Y7Wkr", "postedAt": "2014-10-06T20:40:13.942Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I think that if the Standard EA Recommendation for middle- to low-income people is &quot;come back when you make more money&quot;, no middle- to low-income people (to a first approximation) will ever become interested in EA.</p>\n<p>I think if I made 30k a year and asked someone what EA-related things I could do and they told me &quot;you don't make enough to worry about donating, try to optimize your income some more and then we'll talk,&quot; my reaction would be &quot;Ack! I don't want to upend my entire life! I just want to help some people! These guys are mean.&quot; And then I would stop paying attention to effective altruism.</p>\n<p>My general heuristic for stuff like this is that it's more important for general recommendations to <em>look reasonable</em> than for them to <em>be optimal</em> (within reason). This is because by the time someone is wondering whether your policy is actually optimal, they care enough to be thinking like an effective altruist already, and are less likely to be scared off by a wrong answer than someone who's evaluating the surface-reasonableness.</p>\n", "parentCommentId": "zf8bzk4GsedcWjuRf", "user": {"username": "Ben_Kuhn"}}, {"_id": "mohr3RjM5tjuKsDZr", "postedAt": "2014-10-06T21:09:24.640Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>EDIT: struck from the record. (I don't know whether &quot;retract&quot; does what I want or not so I'm doing this instead.)</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "Lh68QamszYJce9fCc", "postedAt": "2014-10-06T21:16:44.279Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I think we can both agree that the way you say things is very important. Saying &quot;come back when you make more money&quot; is very different from saying &quot;if you are interested in helping people as effectively as possible it may be wise to consider looking out for yourself first before turning your motivations outward.&quot; There are a lot of reasons for people to worry that their lives are too good in comparison to others' and therefore they have a moral obligation to help. I think a lot of EA's have felt this way before. When faced with this sentiment, I think it can be a mistake with regard to actually being effective to devote significant effort into explicit donation rather than personal development.</p>\n<p>I think you are also framing the argument to make &quot;making more money&quot; sound like a bad thing that most people don't want to do. A lot of people already want to make more money, and they feel a conflict between trying their best to become successful VS using the resources / leverage they already have to help others. My argument is that focusing on personal goals and development could kill two birds with one stone for a lot of people and I don't think it's as off-putting as you make it sound.</p>\n<p>Speaking from my own experience, I have a very high propensity to think about others before myself and I think this can be a flaw and limit productivity in many ways. I think I would ultimately be a more effective altruist if I had spent more of my time pondering &quot;how can I become really good at something / develop valuable skills&quot; rather than &quot;how can I do the most good.&quot;</p>\n", "parentCommentId": "Zmu9xQJSgj82Y7Wkr", "user": {"username": "AlexCuevas"}}, {"_id": "JWEurGrtKFvAH2n7G", "postedAt": "2014-10-06T21:59:23.620Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Hi Ben - thanks for the feature request. Anton Geraschenko, who founded Math Overflow, advised me that it's important to keep object-level and meta-discussion separate so that the latter doesn't take focus away from the former. So can you please put this discussion here: <a href=\"http://effective-altruism.com/ea/8y/improvements_to_the_effective_altruism_forum/\">Improvements to the EA Forum</a>.</p>\n<blockquote>\n<p>It's great to see improvements like these. If you have more feature suggestions, rather than scattering these suggestions all over the site, it's best to concentrate them in this thread or in this Google form (responses here).</p>\n</blockquote>\n", "parentCommentId": "mohr3RjM5tjuKsDZr", "user": {"username": "RyanCarey"}}, {"_id": "6BpazTqWRZvuhvvcE", "postedAt": "2014-10-06T22:17:54.993Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>A strong consideration in favour of donating on that sort of modest wage is that it gets\nyou into the habit of doing so, rather keeping on putting it off until you're richer. It also makes you better able to influence others to donate.</p>\n<p>Also, an admittedly cursory <a href=\"https://en.wikipedia.org/wiki/Personal_income_in_the_United_States\">look at Wikipedia</a> suggests that the median adult income in the US is $24k/year, which'd suggest that telling these people not to donate would exclude half of all adults. (I expect that $24k/year is not the most relevant figure to use here, but the point stands that it's easy to underestimate how wealthy we are even compared to others in the developed world.)</p>\n", "parentCommentId": "zf8bzk4GsedcWjuRf", "user": {"username": "Tom_Ash"}}, {"_id": "9ZvRbWLtrFG5wdrhu", "postedAt": "2014-10-06T22:21:27.693Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I'm not sure if this is what Ryan meant to link to or not, but here's <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/655328167856877/\">the Facebook thread on donating on $30k/year that Alex refers to in his original comment</a>.</p>\n", "parentCommentId": "WPQHLHJnzSQNFyFq9", "user": {"username": "Tom_Ash"}}, {"_id": "XbrvFupMoNRJGD3sQ", "postedAt": "2014-10-06T22:34:52.758Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I was involved in the initial facebook thread on the topic. At the time, I made less than 30k,  didn't ever expect to make much more than $30k (I'm a nanny), and was highly turned off by the conversation. </p>\n<p>Two cross-country moves later, I <em>have</em> actually doubled my income, but I still am highly turned off by elitist EA conversations that assume that all the readers are high-potential-earners in their 20s with strong social safety nets. </p>\n<p>It would have been much easier to convince me to donate 10% of a $30k income, than to upend my life in order to make some kind of career change. </p>\n", "parentCommentId": "zf8bzk4GsedcWjuRf", "user": {"username": "Erica_Edelman"}}, {"_id": "7HmpcrXoAR88EDnsz", "postedAt": "2014-10-06T23:32:56.660Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>To delete a comment forever, first retract it, then click on the permalink, then click on the 'delete'  button. Note: this applies to comments that haven't been replied to; comments with replies can be retracted, but not deleted. (In this case, you wouldn't have been able to delete the comment, since Ryan had already replied to it when you decided to strike it from the record.)</p>\n", "parentCommentId": "mohr3RjM5tjuKsDZr", "user": {"username": "Pablo_Stafforini"}}, {"_id": "2kR7hgZkoaiiEMdWq", "postedAt": "2014-10-07T00:37:47.563Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>&quot;I still am highly turned off by elitist EA conversations that assume that all the readers are high-potential-earners in their 20s with strong social safety nets.&quot;</p>\n<p>Sure, but I think your use of the term elitist is a bit unfair here. I personally know many friends that view my own identification as an EA itself elitist, because by trying to help with things like alleviating global poverty through targeted donation I am putting myself on a pedestal above people living in the developing world (or so the argument goes). To these friends, it's less elitist to try and focus on pursuing their own happiness rather than thinking you can solve other people's problems better than they can. Maybe this is why I am arguing for this angle of attack; I have friends that have different off-putting triggers as you.</p>\n<p>I agree that we shouldn't make broad generalizations about EA demographics, but at the same time we shouldn't misrepresent them; I would wager that a large number, if not the majority, of prospective EAs would fall under the high-potential-earners-in-their-20's demographic and this is very relevant in the discussion of how to advise people who are just getting into EA. I definitely agree that the same advice wouldn't work equally well when addressing every person, and sometimes it's correct to give two different people completely opposite advice. That being said, if I had to give 1 piece of advice in a generalizing way, I would want to consider the demographic of who I am giving this advice to rather than assuming that it is directed towards the median US citizen, for instance.</p>\n", "parentCommentId": "XbrvFupMoNRJGD3sQ", "user": {"username": "AlexCuevas"}}, {"_id": "5JrCAt33ZjxwapfPj", "postedAt": "2014-10-07T01:03:32.234Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Although that can be self-perpetuating. For example, few would be willing to bite the bullet and say that they should give male-focused advice if 60% of effective altruists were male.</p>\n", "parentCommentId": "2kR7hgZkoaiiEMdWq", "user": {"username": "RyanCarey"}}, {"_id": "qPw29p7XRLdZ3Ch6Y", "postedAt": "2014-10-07T02:44:45.484Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I think this is what Ryan is saying, but I want to say it again and say more, because I feel strongly and because Ryan left a lot of inferential distance in his post.</p>\n<p>I dislike the idea that EA is mostly attractive or mostly applicable to it's current dominant demographic of math/econ/tech interested people in their 20s.  I think the core ideas of EA are compelling to a wide variety of people, and that EA can benefit from skills outside of it's current mainstream.  It seems likely to me that the current situation is more the result of network effects than that EA is not interesting to people outside of this cluster.</p>\n<p>Catering our &quot;general&quot; advice to only one sort of person makes it more likely that other types of people will feel lost or unwelcome and not pursue their interest in EA; I take it Erica has felt this way.  While the statement Alex made in his last paragraph is reasonable as stated, we are not in the position of only being able to give one piece of advice.</p>\n", "parentCommentId": "2kR7hgZkoaiiEMdWq", "user": {"username": "ruthie"}}, {"_id": "YDwAJgYHFRRDyDrvM", "postedAt": "2014-10-07T03:09:11.651Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Excellent news.</p>\n<p>A promising idea in macroeconomics is that of <a href=\"http://www.economist.com/blogs/freeexchange/2011/10/monetary-policy-3\">NGDP level targetting</a>. Instead of targetting the inflation rate, the central bank would try to maintain a trend rate of total spending in the economy. Here's <a href=\"http://www.adamsmith.org/sites/default/files/resources/ASI_NGDP_WEB.pdf\">Scott Sumner's excelent paper making the case for NGDP level targetting</a>. As economic policy suggestions go, it's extremely popular among rationalists - I recall Eliezer endorsing it a while back.</p>\n<p>At the moment we have real-time market-implied forecasts for a variety of things; commodity prices, interest rates and inflation. These inflation expectations acted as an early warning sign of the great recession. Unfortunately, at present there does not exist a market in NGDP futures, so it's hard to get real-time information on how the economy as a whole is doing.</p>\n<p>Fortunately, <a href=\"http://www.themoneyillusion.com/?p=27695\">Scott Sumner is setting up a prediction market for NGDP targetting in New Zealand.</a> A variety of work, including some by Robin Hanson, suggests that even quite small prediction markets can create much more accurate predictions than teams of experts. The market is in the early stages of creation, but if anyone was interested in supply technical skills or financial assistance*, this could potentially have a huge payoff. Even if you don't want to contribute to the project, you could participate in the market when it launches, which would help improve liquidity and aid the quality of predictions.</p>\n<ul>\n<li>A few EA types have already donated, and Scott quickly raised his initial target of $30k within a day or so, but it's plausible that costs might be higher than expected.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "RpxvQPrmRWCWCrka7", "postedAt": "2014-10-07T04:53:43.038Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Do you have any idea how we might go about fixing the situation? It seems to me like math/econ/tech people in their 20s (including me) don't know what it takes to make other demographics feel welcome. The best thing I can think of is encourage some people from other demographics to write about and actively discuss EA, and to spread the writings of people who already do.</p>\n", "parentCommentId": "qPw29p7XRLdZ3Ch6Y", "user": {"username": "MichaelDickens"}}, {"_id": "SkPdYdJbSRunuLEDe", "postedAt": "2014-10-07T07:28:25.826Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>I personally know many friends that view my own identification as an EA itself elitist, because by trying to help with things like alleviating global poverty through targeted donation I am putting myself on a pedestal above people living in the developing world (or so the argument goes). To these friends, it's less elitist to try and focus on pursuing their own happiness rather than thinking you can solve other people's problems better than they can.</p>\n</blockquote>\n<p>[tangent] Have you tried describing GiveDirectly to these friends, and if so how did they react? </p>\n", "parentCommentId": "2kR7hgZkoaiiEMdWq", "user": {"username": "Tom_Ash"}}, {"_id": "xYnfaDhriDqJdkyBS", "postedAt": "2014-10-07T11:15:16.325Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Should we moderate ourselves to help grow the movement?</p>\n<p>I've come across this idea before in the EA community and also thought about it a lot myself.</p>\n<p>EA's are known to do some pretty &quot;out there&quot; things to maximize their impact. Many of us give far more than 10%. I know someone who lives in a van and is a &quot;freegan&quot; to maximize the amount of cash they have to give. Personally, I live with my parents and have forgone overseas holidays to leave me extra money to give/save. I know that many people who ask me why think I'm crazy even after hearing my reasons.</p>\n<p>What I worry about is that even if we don't advocate things like this people will associate our behavior with effective altruism. Then they may think, 'well if that's what being EA is then count me out&quot;. </p>\n<p>So I guess I'm asking, should we moderate ourselves while the movement grows? Should we live lives that are as normal as possible so that more people feel they would like to be part of the movement, so that more people feel they could become EA's without sacrificing their current lifestyle?</p>\n", "parentCommentId": null, "user": {"username": "Jackson_Sussman"}}, {"_id": "syQge3WJdvpwe5rqT", "postedAt": "2014-10-07T12:17:03.892Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Great question. We should definitely consider these reputational effects as they could be large.</p>\n<p>I'd start by thinking about what portfolio might look best from the point of view of helping to grow the movement well. My guess is that this isn't necessarily having everyone &quot;as normal as possible&quot;, but could well be in that direction from where we are right now.</p>\n<p>Then when we're thinking about deviations we can think about how large the reputational effect is and how large the benefit is. It's actually pretty hard to estimate the size of reputational effect, but we should try. For example thinking about what the effect might be if the whole movement were doing it might be a reasonable first approximation. In some cases that probably underestimates the costs -- if your behaviour is extreme even within the movement, it's more likely to be picked up on and have a high reputational cost. In some cases that may overestimate the costs -- e.g. if the whole movement were vegetarian that might appear weird and discourage growth, but having half the movement be vegetarian probably doesn't.</p>\n<p>It sounds to me that living in a van is likely to be erring too far on the side of ignoring reputation.</p>\n<p>In your case, it might be that the best thing to do is to quietly continue not to take overseas holidays, but not talk about it much. Or to only take them occasionally. (Of course it could be that the not taking overseas holidays provides a useful talking point and helps more than it hurts -- it isn't obvious to me, but I'm glad you're at least considering the question.)</p>\n", "parentCommentId": "xYnfaDhriDqJdkyBS", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "9rBZ9Mw6auhsPdXKd", "postedAt": "2014-10-07T14:33:25.167Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>The question is not going to be whether we should moderate ourselves- yes or no - but when and how much. Moderating yourself, consciously or unconsciously is part of being a functioning human.</p>\n", "parentCommentId": "xYnfaDhriDqJdkyBS", "user": {"username": "RyanCarey"}}, {"_id": "uekTTqnvtGbLCyi22", "postedAt": "2014-10-07T16:29:09.179Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I definitely agree, and as a result I wouldn't cater my advice to only one sort of person. I think it's best to take an approach where you change the advice you give based on who you are talking to. Perhaps we should have some sort of portfolio of starting advice to give based on simple diagnostics. I'm sure 80,000 hours does something like this, so it's not new ground. I think this is way better than saying &quot;everybody should donate 10% of their income right now if you can afford it or you're not a real EA.&quot; And yes some people have said this. I find this to be a huge turn off personally.</p>\n<p>ruthie: &quot;It seems likely to me that the current situation is more the result of network effects than that EA is not interesting to people outside of this cluster.&quot; I'm not sure I agree with this. I know surprisingly few people that are both actively altruistic and who actually think critically and examine evidence in their every day lives. I wish this was everyone, but realistically it's not. I do believe there are a ton of people who would be interested EA that haven't discovered it yet, but I think that the people who will ultimately be drawn in won't be totally shunned by the fact that a lot of the info is catered to demographics that aren't exactly like them. Especially since there is such a large range of socioeconomic status that a person could reside in, and each one might have a totally different EA approach that works best for them (and I'm not even talking about cause selection yet).</p>\n<p>What if somebody has no interest in donating, but they are interested in career choice? Or interested in lifestyle change? Or interested in saving, researching, and donating later? Or interested in advocacy? Or interested in personal development? There are a lot of options, and I think telling everyone the blanket advice &quot;just start donating now to GiveWell's top charities and don't worry about the meta stuff&quot; will turn off many people in the same way that &quot;focus on yourself until you have more income leverage&quot; might turn people off. I haven't seen any real evidence either way, just some armchair arguments and half-baked anecdotes, so I don't understand why everyone is so confident in this.</p>\n", "parentCommentId": "qPw29p7XRLdZ3Ch6Y", "user": {"username": "AlexCuevas"}}, {"_id": "w7iCnXAGBbrhGLgzE", "postedAt": "2014-10-07T16:49:20.555Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I don't think it's a matter of reputation as much as a matter of socialization and network building. Humans are at their best when they're interacting with other humans (generally speaking). If your actions based in EA motivations are hurting your personal relationships or your ability to socialize, either by constraining your living situation or by limiting your social interactions due to cost / time considerations, then they may be doing more harm than good. I think building a strong network of friends and colleagues is one of the highest-leverage things you can do, and shouldn't be easily discounted for the sake of simply giving as much money as you can.</p>\n<p>Similarly, while going overseas for vacation is expensive and bad for the environment, sometimes seeing another place or culture in real life can have a lot of altruism-related benefits.</p>\n<p>I don't mean this to disparage your particular life choices, but rather to say that a &quot;typical&quot; EA shouldn't be expected to make the same choices, and it shouldn't be implied that making those choices makes you more effective or more altruistic than somebody else who focuses more on network building and travel, for instance.</p>\n", "parentCommentId": "xYnfaDhriDqJdkyBS", "user": {"username": "AlexCuevas"}}, {"_id": "8MwrHXvtJdWpqFRMd", "postedAt": "2014-10-07T16:58:09.328Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Could giving good vegan food to poor people compete with other effective charity?</p>\n<p>The idea: A charity develops or purchases nutrition-complete vegan food, ships it to areas of global poverty, and distributes it to the poorest for free.</p>\n<p>The positive impact would be: Improved practical knowledge and demand to make nutrition-complete affordable vegan food, improved nutrition and purchasing power for the poor, reduced farm animal use without appeals to values or emotions toward animals (because the incentive is in-built into the wealth transfer).</p>\n<p>It might be less effective in pure wealth transfer than, say, GiveDirectly, but the other upsides could make up for that.</p>\n<p>I didn't see a charity quite like this <a href=\"http://www.animalcharityevaluators.org/research/organizations/list-organizations/\">listed</a>. (<a href=\"http://www.awfw.org/\">A Well-Fed World</a> advocates an approach like this, but supports a diversity of groups and it's not clear how homogenous and scalable they are.)</p>\n", "parentCommentId": null, "user": null}, {"_id": "YsQbnthd65T8vGPQX", "postedAt": "2014-10-07T20:14:26.724Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>That's a really good question, and as another 20-something in tech, I also definitely don't have all the answers.  I have an in-progress draft of a post more generally on outreach, to be posted somewhere (not sure where), but I'll briefly list some of my thoughts directly related to making a wider variety of people feel welcome.</p>\n<ul>\n<li><p>Expand our models of EA dedication beyond earning to give.  This model doesn't fit most people well, but it's by far the most prominent idea of what living an EA life looks like.</p>\n</li>\n<li><p>People want to see people like them in communities they're part of (I don't endorse this state of affairs, but I think it's often true).  This may seem discouraging, because it most obviously says &quot;to get more of x type of people, you need to already have x type of people.&quot;  I think it's not totally unactionable though-- if cultural minorities make themselves more visible by posting an commenting on the forum, coming to meetups, etc., new people in the same cultural minorities will see them and know they are welcome.</p>\n</li>\n<li><p>Do your best not to assume that people are in your cluster.  The career advice example is good.  Another example is to explain math or econ jargon when you use them in a post.  I think this has an outsize effect.  The experience of being in a community but having the content aimed at different sorts of people is a little like going to a social dance and having no one ask you to be their partner-- it's hard to believe that you're wanted, even when people keep telling you so.  And it feels really crummy.</p>\n</li>\n</ul>\n<p>Note that I don't know anyone who has said that they were interested in EA but felt unwelcome there.  I think at least part of it is that EA is something that very few people outside of this cluster have even heard of, much less have taken steps towards getting involved in.</p>\n", "parentCommentId": "RpxvQPrmRWCWCrka7", "user": {"username": "ruthie"}}, {"_id": "vaTZrATTEtGQMEozN", "postedAt": "2014-10-08T00:16:14.433Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>There's also a charity called Vegfam - <a href=\"http://www.vegfamcharity.org.uk/\">http://www.vegfamcharity.org.uk/</a> - not sure how effective they are though.</p>\n", "parentCommentId": "8MwrHXvtJdWpqFRMd", "user": {"username": "Greg_Colbourn"}}, {"_id": "rTiprqHc8TxprWwFR", "postedAt": "2014-10-08T00:17:47.754Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>Improved practical knowledge and demand to make nutrition-complete affordable vegan food</p>\n</blockquote>\n<p>Could you explain the causal mechanism you have in mind? It seems that such a charity would increase overall demand for vegan food, because it is buying some, but reduce demand from everyone else, because some people who would otherwise have eaten vegan food will instead just take from this charity.</p>\n<p>Also I think it would be good if you could outline some thoughts about possible disadvantages of such a charity.</p>\n", "parentCommentId": "8MwrHXvtJdWpqFRMd", "user": {"username": "Larks"}}, {"_id": "MLjoZK5yR23CBnH96", "postedAt": "2014-10-08T01:10:03.933Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>Could you explain the causal mechanism you have in mind?</p>\n</blockquote>\n<p>The beneficiaries of this charity would eat more food than they otherwise would (assuming the charity targets really poor people), and more of it would be vegan, percentage-wise. Since using good, affordable and nutrition-complete food would be an explicit goal, donations would have the welcome side-effect of incentivizing such R&amp;D, as well as scale economics.</p>\n<p>I think this is a general argument for eating nutrition-fortified vegan products, but they tend to be high-cost organic life-style products, and I'd prefer to help make them ready for affordable mass consumption.</p>\n<blockquote>\n<p>Also I think it would be good if you could outline some thoughts about possible disadvantages of such a charity.</p>\n</blockquote>\n<p>Opportunity costs if it's not optimal. Then there's the argument from <a href=\"http://reflectivedisequilibrium.blogspot.de/2013/07/vegan-advocacy-and-pessimism-about-wild.html\">wild-animal suffering and ecosystem displacement</a>, that is, that meat consumption helps destroy the environment faster and therefore prevents more animals from suffering. And speculative acceptance problems or PR backlash if, say, the food isn't healthy. Also, you would need to identify people who really benefit from free food and bring it to them in a cost-effective way (I figure malaria nets don't spoil as fast as food does.)</p>\n<p>Perhaps there could be a niche for this in disaster aid or acute famine relief.</p>\n", "parentCommentId": "rTiprqHc8TxprWwFR", "user": null}, {"_id": "m36kffysJqfQyJZMF", "postedAt": "2014-10-08T07:49:54.526Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Agreed - and there are plenty of ways for people to contribute to EA besides donating. Writing articles, helping organize EA events, and offering support and encouragement to people who are working on more direct things are just the three first things that come to mind.</p>\n<p>Any large group working on something needs both people working directly on things, and people who are in support roles and take care of the day-to-day needs of the organization. The notion that all EAs should be working directly on something (I'm counting earning-to-give as &quot;working directly on something&quot;, here) seems clearly wrong.</p>\n", "parentCommentId": "Zmu9xQJSgj82Y7Wkr", "user": {"username": "Kaj_Sotala"}}, {"_id": "9CEKn9cMhbmTyrKHd", "postedAt": "2014-10-08T07:57:37.941Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>A lot of people already want to make more money, and they feel a conflict between trying their best to become successful VS using the resources / leverage they already have to help others.</p>\n</blockquote>\n<p>True, but a lot of people are also struggling just to find a job that would be both enjoyable <em>and</em> provide a sufficient wage to pay the bills. Emphasizing making more money could cause them to feel a conflict between finding a job that doesn't feel soul-crushing VS feeling guilty about being unable to donate much. (Full disclosure: I feel a bit of this, since the career path that I'm currently considering the most isn't one that I'd expect to make a lot of money.)</p>\n", "parentCommentId": "Lh68QamszYJce9fCc", "user": {"username": "Kaj_Sotala"}}, {"_id": "k5ZQPz6AaBjMEEvNL", "postedAt": "2014-10-08T08:06:57.396Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>What do effective altruists think about population ethics? I asked about this on Slate Star Codex, and got the impression that there's too much disagreement for there to be an Official Position about this. I'm asking again here since I want to know what the general range of opinions on this is. Do you think that the number of future lives should be valued systematically, and if so, what sorts of future lives do you think we should:</p>\n<ol>\n<li>Pay to add?</li>\n<li>Be indifferent to adding?</li>\n<li>Pay to prevent adding?</li>\n</ol>\n", "parentCommentId": null, "user": null}, {"_id": "tfafApTmchyhQSoCw", "postedAt": "2014-10-08T08:49:09.449Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>To me, the decision (freely made) to have children is morally neutral -- I am not utilitarian on this topic.</p>\n<p>Birth rates usually fall substantially as female education levels rise and women become more empowered generally.  I would be happier about the world if countries that currently have high birth rates see those birth rates fall thanks to better education levels etc.  The sort of drastic fall in birth rates seen in, e.g., South Korea and Iran, are caused by large society-wide changes, and I don't think it's likely that as an outside donor I can do anything to help bring about similar society-wide change in, e.g., Nigeria.</p>\n<p>But improved access to contraceptives and family planning information help at least some couples choose to have fewer children, and that is something that I would plausibly donate towards.  (I don't know what sort of cost-per-unwanted-birth-averted figure I'd need to prefer a donation to, say, Marie Stopes over a donation to SCI, but it's something I would carefully consider if I <em>did</em> see those figures.)</p>\n<p>I can't think of any realistic cases where I would pay for extra people to be born.</p>\n", "parentCommentId": "k5ZQPz6AaBjMEEvNL", "user": {"username": "pappubahry"}}, {"_id": "sMb34cGL2XeCJXYKm", "postedAt": "2014-10-08T08:58:13.676Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>To me, the decision (freely made) to have children is morally neutral -- I am not utilitarian on this topic.</p>\n</blockquote>\n<p><a href=\"http://www.effective-altruism.com/ea/66/parenthood_and_effective_altruism/\">Bernadette Young wrote a great post on this decision (as made by individual parents) here</a>.</p>\n<p>For my part, I think that it's healthy to have some parts of your life which you dedicate to doing what seems morally best, and some which you treat as personal, and that having kids should clearly be treated as personal (i.e. you shouldn't agonise about whether it's morally optimal). And I say that as someone who probably doesn't want kids myself, a position that's informed but not determined by ethical concerns.</p>\n", "parentCommentId": "tfafApTmchyhQSoCw", "user": {"username": "Tom_Ash"}}, {"_id": "ndertdignatcejwi3", "postedAt": "2014-10-08T10:33:11.689Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I'll write more on this but for now, I'll just state my beliefs without really explaining why I believe them:</p>\n<ul>\n<li>Asking 'how should I feel about adding a life is the wrong kind of question to ask</li>\n<li>The right question to ask is 'what is valuable in life, and will this be present in that person's life</li>\n<li>It's not clear that we have a good concept of identity that persist over time but separate people</li>\n<li>We should evaluate actions based on their impact on people's lives, treating all people equally - present or future (or possibly past, depending on your moral system and philosophy of physics), local or far away, existent or not-yet-existent.</li>\n<li>All population ethical systems have some unintuitive consequences. It's a matter of picking the best. (or formulating a compromise)</li>\n<li>If you try to make a bonus or a penalty for each life created, then you get <a href=\"http://philosophyforprogrammers.blogspot.co.uk/2014/04/an-interactive-guide-to-population.html\">weird results</a>, and it becomes even less intuitive.</li>\n<li>To the extent that we take a hard-line utilitarian view, we should judge the creation of lives purely based on the life that is created, without bonuses or penalties.</li>\n</ul>\n", "parentCommentId": "k5ZQPz6AaBjMEEvNL", "user": {"username": "RyanCarey"}}, {"_id": "sCgDqbEWScmBuP6mq", "postedAt": "2014-10-08T16:06:48.641Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Reproduction can't be morally neutral.</p>\n<p>Imagine a thought experiment where you have to push exactly one of three buttons:</p>\n<ul>\n<li>a - a person is created from thin air and tortured horribly for 1,000 years, then vanishes</li>\n<li>b - nothing happens</li>\n<li>c - a person is created from thin air and lives in unimaginably intense bliss and subjective freedom for 1,000 years, then vanishes</li>\n</ul>\n<p>I can accept someone saying there should be no laws that mandate or ban reproduction for various practical and political reasons.</p>\n<p>But I can't take someone seriously who says it's morally neutral which button you push in the thought experiment above.</p>\n", "parentCommentId": "k5ZQPz6AaBjMEEvNL", "user": null}, {"_id": "XogK8yvzjENonmBYN", "postedAt": "2014-10-08T19:49:12.871Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Here's my own opinions:</p>\n<ol>\n<li>I think that there's no essential difference between making someone in the future better off and changing who's born in the future so that those who are born are better off. &quot;Person A with good quality of life vs. Person A with poor quality of life&quot; isn't very different from 'Person A with good quality of life vs. Person B with poor quality of life&quot;, because it shouldn't matter whether the two lives are &quot;different people&quot; or not.</li>\n<li>Given (1), causing a person with poor quality of life not to be born and independently causing a person with good quality of life to be born combine to give a very good outcome, so at least one of these changes should be very good, since the benefits of independent interventions should be additive. This doesn't determine the benefit of any individual intervention, though. You could think that it's not important for more good-quality-of-life people to be born and very important for fewer poor-quality-of-life people to be born, or the reverse, or something in between. I don't think there's very strong arguments for which one of those you should choose, but I would personally value future lives fairly highly.</li>\n<li>&quot;Pure&quot; population interventions like increasing the availability of contraception or funding infertility treatments are not very cost-effective right now, compared to &quot;indirect&quot; interventions. Preventing fatal diseases <a href=\"http://davidroodman.com/blog/2014/04/16/the-mortality-fertility-link/\">increases population</a>, while economic development decreases it, and both of these things have very good non-population effects as well. Your opinion on population ethics might affect your choice between the two, however. I personally favor health interventions since I value future lives relatively highly.</li>\n<li>There should be more research on the costs of changing population size - currently, it's hard to estimate how difficult it is to change population in location X by amount Y.</li>\n<li>Effective altruists should think about population ethics more quantitatively. There are lots of statistics available about health, GDP, income inequality, population, etc., but I haven't seen any discussion of tradeoffs between population and the other metrics (e.g. what % population change, either positive or negative, is required to compensate for a 5% reduction in per capita GDP or a 1 year decrease in life expectancy?). Even if you don't care about the global population <em>per se</em>, the population size of individual countries is still important! If a country has life expectancy 10 years higher than average, adding one person to that country increases global life expectancy <strong>just as much</strong> as lengthening one person's life by 10 years does.</li>\n</ol>\n", "parentCommentId": "k5ZQPz6AaBjMEEvNL", "user": null}, {"_id": "45zbTzRqNmX9ZkLJo", "postedAt": "2014-10-08T22:52:52.941Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Would this have a drawback of disrupting local farming/food economies?</p>\n", "parentCommentId": "8MwrHXvtJdWpqFRMd", "user": {"username": "Peter_Hurford"}}, {"_id": "7GnxT3Y83vty6b9eS", "postedAt": "2014-10-09T01:53:49.210Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I was too lazy to specify that I was talking about the world as it is.</p>\n<p>A couple might have a third (or first, or...) child, or they might not.  I can accept that the two possibilities lead to slightly different total or average utilities, but as I said, I am not utilitarian on this point.  I think we just allow people to choose how many children they have, and we build the rest of ethics around that.</p>\n", "parentCommentId": "sCgDqbEWScmBuP6mq", "user": {"username": "pappubahry"}}, {"_id": "bBbGkXiK6FwfR3Ldo", "postedAt": "2014-10-09T03:20:24.455Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I think in the world as it is, allowing people to choose how many children they have is exactly the utilitarian thing to do.</p>\n<p>Of course, there are forms of persuasion other than coercion. Some ideas like liberal eugenics have world-improvement potential imo.</p>\n", "parentCommentId": "7GnxT3Y83vty6b9eS", "user": null}, {"_id": "Lkv5yPpR4eLL3L7bz", "postedAt": "2014-10-09T05:11:12.795Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Thanks for the feedback everyone!</p>\n<p>I think I agree with most of your sentiments. Especially while EA is young and growing I see the importance of maintaining the image of EA as something that anyone can do while living a normal life.</p>\n", "parentCommentId": "9rBZ9Mw6auhsPdXKd", "user": {"username": "Jackson_Sussman"}}, {"_id": "HPy6gv4zqmrwLSfSJ", "postedAt": "2014-10-09T10:53:06.693Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Are young people really more idealistic than older people? More young people attend protests but more older people participate in lobbying, fund political parties, and provide most funding for charities.  Perhaps a large fraction of what is going on just relates to older people possessing different kinds of resources from young people. Do you agree or disagree?</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "yhgmq997QSptAWzFy", "postedAt": "2014-10-09T11:33:05.549Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>older people ... provide most funding for charities</p>\n</blockquote>\n<p>Do you have figures for this? They could be relevant for EA groups which focus on raising funds (like local groups with older members, or older people in their social networks).</p>\n", "parentCommentId": "HPy6gv4zqmrwLSfSJ", "user": {"username": "Vincent_deB"}}, {"_id": "nhzXYeRPuWubETC7G", "postedAt": "2014-10-09T12:15:59.668Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p><a href=\"http://www.forbes.com/sites/deborahljacobs/2013/08/08/charitable-giving-baby-boomers-donate-more-study-shows/\">Here</a> is a popular article on the topic. The reason for fundraising from younger people would be that they may be note willing to donate to a new charity.</p>\n", "parentCommentId": "yhgmq997QSptAWzFy", "user": {"username": "RyanCarey"}}, {"_id": "cgv2ujyL4DG5NpdSk", "postedAt": "2014-10-09T15:39:44.526Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>&quot;True, but a lot of people are also struggling just to find a job that would be both enjoyable and provide a sufficient wage to pay the bills.&quot;</p>\n<p>Agreed, so in that context, how does it make more sense to tell somebody that they should care about helping other people as much as they possibly can? I don't see that train of thought getting through to many people in this situation.</p>\n", "parentCommentId": "9CEKn9cMhbmTyrKHd", "user": {"username": "AlexCuevas"}}, {"_id": "tXsdotG8DQ5iM58dR", "postedAt": "2014-10-10T00:35:28.621Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>This is an argument that I've previously made, but I can't recall ever seeing anyone else ever make it. I wish you hadn't deleted your account so I could see who you were!</p>\n", "parentCommentId": "sCgDqbEWScmBuP6mq", "user": {"username": "Larks"}}, {"_id": "5XNtLEv6yHGf5jxQ7", "postedAt": "2014-10-10T04:33:36.719Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>It was Hedonic_Treader.</p>\n", "parentCommentId": "tXsdotG8DQ5iM58dR", "user": null}, {"_id": "bWhFBktfWD3j39EpA", "postedAt": "2014-10-10T09:52:25.533Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I don't want to tell anyone that they <em>should</em> care about helping as many people as possible. I want to tell them that they have a <a href=\"http://effective-altruism.com/ea/8h/effective_altruism_as_the_most_exciting_cause_in/\">fantastic, exciting opportunity</a> to help lots of people and have a big impact on the world, if they want to.</p>\n<p>Someone who is struggling to find a meaningful job might also be someone who's struggling to find some purpose for their life in general. (This has been true for me.) That might make them exceptionally receptive to a cause that <em>does</em> offer such a purpose.</p>\n", "parentCommentId": "cgv2ujyL4DG5NpdSk", "user": {"username": "Kaj_Sotala"}}, {"_id": "2onpapzb3dNbaksqx", "postedAt": "2014-10-10T14:06:08.871Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Yes, this seems right. A lot of people could usefully contribute to effective altruism seem turned off by moralisation. And some effective altruists are <a href=\"http://www.effective-altruism.com/ea/7x/supportive_scepticism/\">demotivated</a> by it. It's generally pretty easy to make a point about how people can help without using the word 'should', 'ought' or 'obligated'. I think it's better to engage our intuitive and emotional mind with this talk of excitement.</p>\n", "parentCommentId": "bWhFBktfWD3j39EpA", "user": {"username": "RyanCarey"}}, {"_id": "fkzjtgwKsjhxPpibn", "postedAt": "2014-10-10T14:09:24.902Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I agree with these.</p>\n<ol>\n<li>Is interesting. It's the sort of thing that I think Robin Hanson or Tyler Cowen might have an opinion on, and one could easily ask them.</li>\n</ol>\n", "parentCommentId": "XogK8yvzjENonmBYN", "user": {"username": "RyanCarey"}}, {"_id": "h8S4rcZgKh8ju4wd5", "postedAt": "2014-10-10T19:05:46.840Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I'm thinking about what kinds of material newcomers to EA should be exposed to. What are some of the basic conceptual tools that are useful for thinking about EA, and evaluating the effectiveness of different interventions/career paths/charities?</p>\n<p>I'm thinking about stuff like:</p>\n<ul>\n<li>Basic economic concepts: expected utility, opportunity cost, fungibility, various marginal concepts (e.g. marginal cost, marginal usefulness), diminishing returns.</li>\n<li>Scientific concepts: control groups, randomized controlled trials.</li>\n<li>Well-being-related concepts: quality-adjusted life years.</li>\n<li>Heuristics and biases: scope neglect, motivated cognition, confirmation bias, affect heuristic.</li>\n</ul>\n<p>What else?</p>\n", "parentCommentId": null, "user": {"username": "Kaj_Sotala"}}, {"_id": "wTGKoNpuwgXcH3f7d", "postedAt": "2014-10-10T20:51:40.085Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>These are good well-established concepts. I have some suggestions that are styled more as subjective advice that I would give to newcomers based on my experience.</p>\n<ul>\n<li><strong>System 1 and System 2 in applied rationality:</strong> people often have low motivation if their intuitions conflict with their analysis. If you're pretty sure something is correct, it's good to support it with emotional drivers like friendship or chocolate.</li>\n<li><strong>Signalling:</strong> if you're trying to model why people do good, a lot of it can be explained by assuming that they are trying to make themselves good. It seems like it might be a major driver of charitable behaviour.</li>\n<li><strong>Pitfalls of expected value thinking:</strong> we're not perfect reasoning machines, and we shouldn't try to be. If you try to evaluate the expected value of everything, then you might spend too much time paralysed, or you might become untrustworthy. It's important not to just act in a way that would make you look like an extreme effective altruist but to act in a way that will make you a good ally too. (cf signalling)</li>\n<li><strong>Virtue ethics:</strong> If you want to do good, it often pays to get into a habit of doing good. This means practising being nice, being generous, being successful, being thoughtful, being scholarly, being loyal, and so on. Not at the expense of thinking independently, but in order to be happily coexist with most of your neighbours most of the time.</li>\n</ul>\n", "parentCommentId": "h8S4rcZgKh8ju4wd5", "user": {"username": "RyanCarey"}}, {"_id": "um9BhdS3xGcQdsXgP", "postedAt": "2014-10-10T21:38:29.640Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Thanks, this is good advice.</p>\n<blockquote>\n<p>System 1 and System 2 in applied rationality: people often have low motivation if their intuitions conflict with their analysis. If you're pretty sure something is correct, it's good to support it with emotional drivers like friendship or chocolate.</p>\n</blockquote>\n<blockquote>\n<p>Signalling: if you're trying to model why people do good, a lot of it can be explained by assuming that they are trying to make themselves good. It seems like it might be a major driver of charitable behaviour.</p>\n</blockquote>\n<p>One additional piece of advice that I might mention relating to these two points: <em>it's fine to act out of selfish motives</em>. If you realize that you're actually working on some altruistic project because you want to gain status, get social approval, make a good impression on people of your preferred sex(es) - great! If those motives cause you to work harder on worthwhile projects, then there's no point in beating yourself up for being human and caring about yourself as well. Just be honest to yourself about your motives, whatever they are.</p>\n", "parentCommentId": "wTGKoNpuwgXcH3f7d", "user": {"username": "Kaj_Sotala"}}, {"_id": "mZS4rFMQbY7m9353K", "postedAt": "2014-10-10T22:24:37.399Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<ul>\n<li>Net present value - even some EAs do not understand this idea.</li>\n<li>Statistics concepts - especially regression to the mean.</li>\n<li>Inside view vs Outside view.</li>\n</ul>\n", "parentCommentId": "h8S4rcZgKh8ju4wd5", "user": {"username": "Larks"}}, {"_id": "8onMmsQgb8Z8Zd3RK", "postedAt": "2014-10-11T07:27:39.620Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Hey everyone! I've been very busy the last couple of weeks, so I haven't been able to make those open and special threads I mentioned in my post. Luckily, it seems as though others have taken it up. Thanks to Ryan Carey, Diego Caliero, Peter Hurford, Tom Ash, and Kaj Sotala for keeping things going. The importance of an online community is often underscored. This forum wouldn't exist, for example, if there wasn't Facebook to provide us with a place to rally as allies in the first place, and greater collaboration for reviews of strategies, and new collaborations between effective altruists, won't take place as soon as they would without this forum.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "PjyD5ojCTyqR7RjHg", "postedAt": "2014-10-12T09:48:55.882Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I think old people just have more resources than young people, so they give less as a proportion of their resources.</p>\n<p>Alternatively, you might think old people have had a lot of time to develop commitments to various causes, and so feel obligated to give more.</p>\n", "parentCommentId": "HPy6gv4zqmrwLSfSJ", "user": {"username": "GMcGowan"}}, {"_id": "grHz4tX7xPGaL8Fnf", "postedAt": "2014-10-12T12:20:00.172Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>A poem, with an effective altruism bent that I have in my evernote. I don't have attribution as to where I found it online first, but it is called The Exposed Nest, By Robert Frost </p>\n<p>YOU were forever finding some new play.<br />So when I saw you down on hands and knees<br />In the meadow, busy with the new-cut hay,<br />Trying, I thought, to set it up on end,<br />I went to show you how to make it stay,            5\nIf that was your idea, against the breeze,<br />And, if you asked me, even help pretend<br />To make it root again and grow afresh.<br />But ’twas no make-believe with you to-day,<br />Nor was the grass itself your real concern,            10\nThough I found your hand full of wilted fern,<br />Steel-bright June-grass, and blackening heads of clover.<br />’Twas a nest full of young birds on the ground<br />The cutter-bar had just gone champing over<br />(Miraculously without tasting flesh)            15\nAnd left defenseless to the heat and light.<br />You wanted to restore them to their right<br />Of something interposed between their sight<br />And too much world at once—could means be found.<br />The way the nest-full every time we stirred            20\nStood up to us as to a mother-bird<br />Whose coming home has been too long deferred,<br />Made me ask would the mother-bird return<br />And care for them in such a change of scene<br />And might our meddling make her more afraid.            25\nThat was a thing we could not wait to learn.<br />We saw the risk we took in doing good,<br />But dared not spare to do the best we could<br />Though harm should come of it; so built the screen<br />You had begun, and gave them back their shade.            30\nAll this to prove we cared. Why is there then<br />No more to tell? We turned to other things.<br />I haven’t any memory—have you?—<br />Of ever coming to the place again<br />To see if the birds lived the first night through,            35\nAnd so at last to learn to use their wings.</p>\n<p>Edit - ok it is very hard to get poems to display right in the text editor</p>\n", "parentCommentId": null, "user": {"username": "AlasdairGives"}}, {"_id": "W5ZnoTNfhwgzQHLor", "postedAt": "2014-10-12T20:36:20.956Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>More young people attend protests but more older people participate in lobbying, fund political parties, and provide most funding for charities.</p>\n</blockquote>\n<p>Many young people I know basically treat protests as a recreational event. </p>\n", "parentCommentId": "HPy6gv4zqmrwLSfSJ", "user": {"username": "Larks"}}, {"_id": "oTwkd4ZsFeEWJ7nPY", "postedAt": "2014-10-13T19:19:34.371Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Me and some others are interesting in creating an Effective Altruism video that can serve as the go-to introductory video for EA. Does anyone know of examples of videos that we might want to emulate?</p>\n", "parentCommentId": null, "user": {"username": "Kerry_Vaughan"}}, {"_id": "g4qdXFn4TWaaMyYN4", "postedAt": "2014-10-13T23:20:57.459Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I know this isn't answering your question, but I think Mihai Badic was working on making a high-quality intro video at the EA summit and retreat earlier this year, so it would be worth talking to him.</p>\n", "parentCommentId": "oTwkd4ZsFeEWJ7nPY", "user": {"username": "HelenToner"}}, {"_id": "cBHjsmbGpy6oFSYPZ", "postedAt": "2014-10-13T23:29:46.207Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Nick Beckstead's thesis &quot;On the Overwhelming Importance of the Far Future&quot; deals thoroughly with these questions from the perspective of Effective Altruism (albeit within the framework of a Philosophy PhD). See especially chapter 4.</p>\n<p><a href=\"http://tinyurl.com/BecksteadFuture\">http://tinyurl.com/BecksteadFuture</a></p>\n<p>Working through the thought experiments he presents and seeing the different unintuitive consequences of each theory changed my mind: I had strong intuitions that creating extra happy lives had no moral value, but I'm now convinced that doesn't make sense. I also agree with Ryan that the question becomes less about what is worth adding and what isn't, and more about what we fundamentally value and whether that will be increased.</p>\n", "parentCommentId": "k5ZQPz6AaBjMEEvNL", "user": {"username": "HelenToner"}}, {"_id": "5BJbzWLAqhEznvDMX", "postedAt": "2014-10-14T12:07:49.650Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Also not answering your question but Joey and Xio <a href=\"https://www.google.co.uk/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=video&amp;cd=10&amp;cad=rja&amp;uact=8&amp;ved=0CFIQtwIwCQ&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D9D90R1ccbuw&amp;ei=7BE9VJyWMpLg7QalyYDoCw&amp;usg=AFQjCNE8vK-hKHZGHl0bmJLuVxbb4imcng&amp;bvm=bv.77161500,d.ZWU\">dabbled</a> in this project previously, and you will want to check out their effort.</p>\n", "parentCommentId": "oTwkd4ZsFeEWJ7nPY", "user": {"username": "RyanCarey"}}, {"_id": "f679gtL6mdT2b4L8n", "postedAt": "2014-10-15T01:15:10.106Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Do we allow links in the open thread? If so, <a href=\"http://econlog.econlib.org/archives/2014/10/diseases_of_pov.html\">here's a nice one by Bryan Caplan</a>.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "QsNe6r8eWuRW5nwB6", "postedAt": "2014-10-15T07:41:48.775Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Does anyone have any thoughts on whether the Ebola outbreak is a unique effective giving opportunity compared to better-studied issues like malaria and schistosomiasis? I tried to do a Fermi estimate <a href=\"http://lesswrong.com/lw/l3x/open_thread_oct_13_oct_19_2014/bgck\">here</a> but I don't trust it further than I can throw it.</p>\n", "parentCommentId": null, "user": {"username": "Scott Alexander"}}, {"_id": "PxXyfSJ9Ng3rYJFua", "postedAt": "2014-10-15T12:18:14.891Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Back when I was involved with party politics, I heard someone mention that pensioners with basically unlimited free time were a really major asset for the campaigns of the older and more established parties.</p>\n", "parentCommentId": "PjyD5ojCTyqR7RjHg", "user": {"username": "Kaj_Sotala"}}, {"_id": "mLHNn2ZkvCdHQ8bXp", "postedAt": "2014-10-16T08:22:15.709Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>First of all, effective altruist organizations, ones that explicitly exist because there effective altruism exists as a social movement, make it their shared mission to make people aware that people can be effective altruists, while still being <em>totally normal</em>. Not, like, even relatively normal, or sort of normal, but not <a href=\"http://www.effective-altruism.com/ea/59/altruism_isnt_about_sacrifice/\">requiring <em>you</em>, yes <em>you</em>, to sacrifice anything major you wanted out of life</a>[1].</p>\n<p>The Life You Can Save, Giving What We Can, and 80,000 Hours exist to do this. The Centre of Effective Altruism incubated all these organizations, and now they're starting a special project to build the effective altruism movement, and steer its public image, called Effective Altruism Outreach. It's currently being led by <a href=\"http://www.effective-altruism.com/user/NielBowerman2\">Niel Bowerman</a>. Your comment is one great concern that Effective Altruism Outreach was specifically started to handle. </p>\n<p>Of course, as effective altruism grows, nobody wants it to become so diluted as a set of ideas that anyone can as validly call themselves an effective altruist as anyone else, without actually doing anything. So, the community itself must reach consensus on some standard, and each individual is responsible for holding themselves to it to maintain the integrity of effective altruism. Rob Wiblin covered this in his keynote address at the 2014 Effective Altruism Summit. As a shorthand, 'anyone giving $10 to Oxfam' was the hypothetical example of what an overly diluted effective altruism might look like. </p>\n<p>The standard thus far seems to be 10% of lifetime income donated to the most effective charity (one can find). Now, this isn't sufficient, so some caveats and distinctions have to be included, such as:</p>\n<ul>\n<li>does this include income before or after taxes?</li>\n</ul>\n<p>Personally, I would qualify this commitment with what each individual effective altruist honestly tries as hard as they can to figure out what the best charity is <a href=\"http://www.effective-altruism.com/ea/72/estimation_is_the_best_we_have/\">given their best estimates</a> and <a href=\"http://effective-altruism.com/ea/8a/cooperation_in_a_movement_supporting_diverse/\">their personal values, even as they differ from those of others</a>. In practice, such research is difficult, so I would recommend looking to evaluations independent of one another, organizationally, and across disciplines, converging upon the same solutions. This is what effective altruism calls <a href=\"http://blog.givewell.org/2014/06/10/sequence-thinking-vs-cluster-thinking/\">cluster thinking</a>, and it's an epistemology <a href=\"http://effective-altruism.com/ea/87/an_epistemology_for_effective_altruism/\">the effective altruist movement is turning toward</a>. </p>\n<p>Of course, the 10% commitment was chosen as a round number favored historically by the donation standard prescribed by various world religions. How arbitrary it really is, and if effective altruism should rethink it, may be a challenged posed by the possible future success of The Life You Can Save. If the The Life You Can Save, which only encourages people to pledge at least only 1% of their income, ever hits some critical mass in how much awareness it raises, and the amount of money from as many people as possible, that no other effective altruist organization had yet achieved, it may force effective altruism to rethink how it presents itself.</p>\n<p>In a way, the already thousands of effective altruists, hopefully of whom as many as possible will continue to be effective altruists, will demonstrate a cluster-thinking approach to lifestyle design for effective altruists. Effective altruism is a voluntary movement in which, aside from the narrow standard, not yet well-defined, above, one can choose to live how they wish. The commonalities of what makes life more functional for effective altruists will come to light as time passes, so what's 'normal' for effective altruism, while still being 'normal' for the rest of the world at large, will become apparent.</p>\n<p> I wish more effective altruists would share their personal stories, and how they differ not only in their donations, but lifestyle choices, from others. Luckily, effective altruists don't even need their own blogs to do so, as they can post them to this forum. I will indeed make a new thread next time encouraging others to do this.</p>\n<p>[1] The lifestyle written about in that post was written by Jeff Kaufman about the effective altruist lives his wife and himself are leading. They're earning to give, in addition to raising awareness of effective altruism by updating how they build their life with effective altruism in mind, without sacrifice. Since that article was written, Kaufman and Wise have increased how much of their joint income they give from <em>30%</em> to <em>50%</em>, while raising their <em>first child</em>. They may be the best existing example of how <em>normal</em> effective altruism can be for any middle class person.</p>\n", "parentCommentId": "xYnfaDhriDqJdkyBS", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "6K4CPYXW8SWiR5ayt", "postedAt": "2014-10-16T08:30:26.923Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>This doesn't surprise me. I have friends who treat protests <em>very seriously</em>, and though I can't think of any, it wouldn't surprise me if some of my friends treated them as a recreational event, either. Being activists, and philanthropists, ourselves, during, or prior, our lives as effective altruists, I imagine lots of us have friends who are involved in protest movements, to the point that we, or they, might call them(selves) 'career activists'. That is, especially if you live a metropolitan area, some people will become involved in multiple public advocacy causes, and treat activism as part of their lifestyle, or a part-time job.</p>\n<p>For people treating it more like a hobby than a part-time job as they integrate it into their lifestyle, they may think of it as a recreational event. For some activists, it's easy for me to imagine protests being a recreational event <em>and</em> serious business, much like a 'work function' might be an office-sanctioned party with prospective clients present is for white-collar professionals.</p>\n<p>In hindsight, it'd be interesting if there was greater discussion of 'career activism' on this forum, as people who live such a lifestyle are the closest set of people I'm aware of who claim to be dedicating their lives to doing good as seriously as effective altruists do, without actually being part of effective altruism. Of course, there is serious overlap between these two lifestyles as well.</p>\n", "parentCommentId": "W5ZnoTNfhwgzQHLor", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "QgQmFxybWYyZcFkEa", "postedAt": "2014-10-16T08:47:55.188Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I can't find it right now, but Leah Libresco posted on Unequally Yoked lately about how she hypothesizes that her life would be richer from having a larger demographic catchment as part of her regular social life/circle. In between that, your above comment, and the idea that 'life experience' can be tabooed as 'epic procedural knowledge gaps between you and your elders', I'm pondering <em>&quot;why aren't we getting more of the older generations to join effective altruism??&quot;</em>. </p>\n<p>I don't actually want effective altruism to have an implicit ageism bias, and if it does, I hope this thread results is some proposals for resolving it.</p>\n", "parentCommentId": "PxXyfSJ9Ng3rYJFua", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "qBzmFQgXfh99uuDyp", "postedAt": "2014-10-16T08:58:31.373Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>most EA's (at least on facebook)</p>\n</blockquote>\n<p>Yeah, this is a problem in gauging the majority opinions of effective altruists on anything. The best assessment of that for real will come out with the results of the 2014 effective altruism survey, which are being processed now. Even still, though, issues like this are still too new, specific, and narrow within effective altruism for a reliable record of consensus to be known. The issue is that the people who post, or comment, regularly in the Facebook group select themselves to be people who have fun discussing conundrums in giant forums. I am like this. Notice how I am commenting on everything, rather than spending my time earning more money, and then giving it away.</p>\n<p> I would estimate that only 10% of effective altruists regularly discuss it on social media, and I don't believe the few major perspectives put forward in any one discussion thread can be reliably thought of as representative of all positions effective altruists might take on that discussion. I believe to curb this issue is the reason, in part, this forum was started.</p>\n", "parentCommentId": "zf8bzk4GsedcWjuRf", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "CRtAjZaarPBzsQZpC", "postedAt": "2014-10-16T10:22:46.148Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I think that the Fermi estimate is a good start, but I am more suspicious that it might be a substantial underestimate of the cost-effectiveness.</p>\n<p>The strongest case for the Ebola outbreak to be an outstanding giving opportunity seems to be that the outbreak might grow a long way, and intervening now could be an easy way to help containment and give outside agencies enough time to get a proper plan into action.</p>\n<p>Perhaps there's a story where we're on route to discover a cure or vaccine, but we'll hit 1 million deaths (say) before this happens, and it will still be on its exponential growth curve at that stage. Then it might be pretty cheap to slow the whole thing down by 1% today, but that could translate to 10,000 fewer deaths at the point where the cure or vaccine comes in.</p>\n<p>I don't really think that story has high likelihood, particularly as perturbations can lessen its impact -- if Ebola spreads slower today, perhaps that will also slow down the efforts of people who would eventually deal with it; or if it's no longer in exponential growth phase when we get a solution then the effect will be much smaller. But this looks like a scenario where the tail benefit could dominate, so I'd want to take the possibility seriously if looking at this. </p>\n<p>If this is correct then early interventions could be quite a bit better (in expectation) than later ones. My best guess right now is that it's still not good enough to target, though.</p>\n", "parentCommentId": "QsNe6r8eWuRW5nwB6", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "DihFLmCFsqNnf4YiJ", "postedAt": "2014-10-17T07:59:22.892Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I agree, because people of all different demographics not only have different kinds of resources, but different opportunities.</p>\n<p>Young people are more likely to have time to attend protests, and involve themselves in activism. It's easier to schedule those events around a shift at your part-time job, or a single class you have that day, than a business meeting, crucial to your career, the sort of which will become more common in your thirties. There's also a lower cost to social status if young people do things that look weird, and deviate from societal norms, which tend to be set by an older, possibly less active, generation. At a younger age, what individuals lack is soft power, and influence. After all, if they could change things without protest action, surely they would try do so more readily.</p>\n<p>Of course, the older generation, between the ages of 30 and 50, is hardly inactive, really. They just focus on different things, because they have different motivations. This is a time when, keeping up appearances to stay ahead in the rat race, one cannot take as many personal risks without risking career capital. People of this demographic are also more likely to have a large(r) family of dependents, such as young children, and elderly parents. In addition to the high constraints all this may place on time and money, the fact that this is family may cause people to focus less upon distant others. This is understandable. People of this cohort are still altruistic, though. However, upon focusing on their career development, family, and community, they're more likely to support causes that have been brought to their attention by their default circle of influence. They may fund donation drives at their children's school, or at the workplace, they may volunteer locally, and they may count the community involvement they do for fun altruistic in its own right as well. Also, because they have so much to care for, people of prime working age may be minimizing extra costs, such as donated time or money, to hedge against unknown risks such as family emergencies, etc.</p>\n<p>As people age, their children, and other family, are no longer dependent upon them. After retirement, people have more time. Even in the later parts of one's career, before retirement, one may own a business, or be in a position for which one doesn't need to put in extra effort beyond the requirements to stay afloat, or get ahead. Elders have more money to donate to political causes, but they also leave legacy gifts, endowments, and the like. This happens at a time when they're more respected in society as elders, and may have more soft power anyway. Additionally, they either have more money than they'll ever need, or they at least have greater confidence in how secure the money they have saved will support them for the remainder of their lives. Finally, they may think about supporting grander causes in a broader way than what they did with altruism earlier in their life, as they think about how they'll want to be known, and remembered.</p>\n<p>This model above is a hypothesis for a trend. Of course, there will be outliers. Mark Zuckerburg is influencing the world in ways many in their twenties couldn't have dreamed of, while they're still trying to get on the career track. On the converse, it would be crass of us to just assume the typical senior has money they're sitting on that they could give away, when many pensioners themselves are in need. Indeed, I believe that increasing the healthspan of seniors could be considered one of the most effective altruism opportunities available, given the right research, and application of it. Anyway, this model seems simple enough to verify, or falsify, by checking the right sort of data.</p>\n<p>What I'm trying to show is that it seems intuitively plausible that everyone has ideals, and everyone cares, but society drives people to care about different things in different ways over the course of their lives. To a parent, 'ensuring my child grows up happy, healthy, and safe' may be an ideal felt as strongly by a young activist yet without children pushing for some greater equity, or equality, in society. Cynicism of any particular generation doesn't need to be rejected on the basis that it's unattractive; rather, the cynical approach of older generations don't care, or young people are too naive, may not explain as much as simply as this other model.</p>\n<p>Ryan, if you think this hypothesis may hold weight, where could someone access the data to check? If not you, would someone at 80,000 Hours know? I feel as if that if we could figure this out, it could be not only an optimistic but also truer message that, e.g., Will MacAskill could put into his book. For people of any age, effective altruism will be non-conformist. If we can paint a positive picture that everyone cares, and wants to care, about the world, but just socially pushed in different directions, people new to effective altruism might realize that they can get off the hedonic treadmill anytime they like, rethink where they focus their resources for doing good, and find support in others.</p>\n", "parentCommentId": "HPy6gv4zqmrwLSfSJ", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "JJHqLLobRvX5uDQzX", "postedAt": "2014-10-17T08:19:34.995Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<blockquote>\n<p>I'm sure 80,000 hours does something like this, so it's not new ground.</p>\n</blockquote>\n<p>Are you <em>sure</em> you're sure? I don't mean to nitpick, but unless someone from 80,000 Hours has shown, or told us, and they're reading this, we don't know for sure. I was going to write something to this affect, but your framing of the idea is even better, so 80,000 Hours should be addressed. </p>\n<p>The thing about effective altruism is we don't need preexisting status to have organizations pay attention to us. They pay attention to our merit, arguments, mettle, and records. </p>\n", "parentCommentId": "uekTTqnvtGbLCyi22", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "fRcu5nQqpwumpio8G", "postedAt": "2014-10-17T08:49:27.420Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I had difficulty wrapping my head around the latter two when I first heard of them, and I am one who doesn't understand the idea of 'net present value' (yet). I am a data point that Larks is right; please update in the direction of caring about these things more.</p>\n", "parentCommentId": "mZS4rFMQbY7m9353K", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "bTsnRf7NbmG9k2WoH", "postedAt": "2014-10-17T08:52:08.128Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>+1</p>\n<p>Often we might tell ourselves that we're doing something for an altruistic reason, while in our gut we don't realize until later that we're really doing something that looks like it could be for very selfish reasons. Also, human brains are enough of a kludge that we can act for different reasons. Cooperation is helping others in a way that also helps oneself: it's selfish <em>and</em> altruistic.</p>\n", "parentCommentId": "um9BhdS3xGcQdsXgP", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "GLHh8q6GNfBYMvcuN", "postedAt": "2014-10-17T09:01:02.011Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p><a href=\"http://www.effective-altruism.com/user/RyanCarey\">Ryan Carey</a> is the only moderator, and there are maybe only 100 other people using this forum so far, so trying out something new is like a feature request that you can implement yourself. Also, forum norms here <em>seem</em> to be an even nicer version of norms on Less Wrong. </p>\n<p>Also, for the record, I too think Dr. Caplan makes a nice point. There's a Facebook group I shared the link with, called 'the Economics of Doing Good'. It's the discussion group for the economics by effective altruists, and it's drawn a disproportionate number of economics scholars/enthusiasts. There's some discussion of the link there, so if you're on Facebook, join the group, and we'll see you over there!</p>\n", "parentCommentId": "f679gtL6mdT2b4L8n", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "jrW3NLBdgYAjqezs8", "postedAt": "2014-10-17T11:06:48.386Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>I'm not sure. I think the data you want is who donates and volunteers more, and how does this relate to age and income? Maybe census data would help?</p>\n", "parentCommentId": "DihFLmCFsqNnf4YiJ", "user": {"username": "RyanCarey"}}, {"_id": "NuQcaeuxeng5RsANe", "postedAt": "2014-10-17T11:32:21.784Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>Yeah, that's the sort of data I'm thinking of. Honestly, I'm not very thoughtful when it comes to these things. Thanks for the pointer.</p>\n", "parentCommentId": "jrW3NLBdgYAjqezs8", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "tocfeNNTFCmHERRNu", "postedAt": "2014-10-21T12:50:05.956Z", "postId": "7xFQAQrWuH4ye73QS", "htmlBody": "<p>What about something like <a href=\"https://www.youtube.com/watch?v=u5BDIBRwQ88\">this</a> for introducing the idea of comparing causes?</p>\n", "parentCommentId": "oTwkd4ZsFeEWJ7nPY", "user": {"username": "Joseph_ONeill"}}]