[{"_id": "DRfYSwY8rgMhqXWPY", "postedAt": "2017-10-30T14:02:22.292Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>Really exciting work! This seems like an intervention that could potentially be funded with public resources more easily than AI safety research could, which opens up another avenue to funding. </p>\n<p>I see how this could be very useful in the event of a nuclear war, but I do have some skepticism about how useful these alternative foods wold be for a less severe shortage. With a 10% reduction in agricultural productivity, why do you think alternative foods that don't need sunlight could be cheaper than simply expanding how much of useable land we devote to agriculture/using land to grow products that are cheaper per calorie?</p>\n", "parentCommentId": null, "user": {"username": "Michael_S"}}, {"_id": "E25NhKwJJ8X8crsiP", "postedAt": "2017-10-30T16:34:48.079Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>Thanks! Good question - for a 10% shortfall, it is more about alternate <strong>feed</strong> than alternate <strong>food</strong>. The natural gas digesting bacteria is currently being used as fish feed. We could utilize agricultural residues much better, first extracting edible calories directly, which has been done at both small and large scale. Then we take the left over of that and put it into a cellulosic or second-generation biofuel process that breaks the cellulose into sugar that people could eat. Finally, the leftover from that could be fed to animals. In addition, we might be able to have municipal collection of food waste to feed pigs. Just with agricultural residues, we could save/produce more than 10% of our current food consumption. Another possibility is growing mushrooms on logging residues that normally just decompose and feeding the leftover from that to animals, which has already been done. And we might even want to do some of this now to reduce the environmental impact of animals.</p>\n", "parentCommentId": "DRfYSwY8rgMhqXWPY", "user": {"username": "Denkenberger"}}, {"_id": "Ft6TabXLMKDS8dvnt", "postedAt": "2017-10-30T19:20:37.069Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>Truly one of the most satiating interventions on the menu of causes!</p>\n<p>Could you go more into the full list of what the food alternatives look like, and how tractable each of them are?</p>\n", "parentCommentId": null, "user": {"username": "DonyChristie"}}, {"_id": "L5NnD5qamK4FHspWn", "postedAt": "2017-10-30T21:58:45.679Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>:) There is lots more detail <a href=\"https://drive.google.com/viewerng/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxkYXZpZGRlbmtlbmJlcmdlcnxneDo1MTg1ZDQ4NGI1MDMxN2Q0\">here</a>, but briefly:</p>\n<p>1) If the sun is not completely blocked during a global catastrophe, the cooling of the upper layer of the  ocean would cause overturning, bringing nutrients to the surface. Over a longer period of time, macronutrient (e.g. nitrogen) fertilization could allow the ramping up of fishing to feed the global population. This might even be economical now. Figuring out how to retrofit ships for fishing would be a good near-term project. We could also harvest deeper fish in a catastrophe that are not economical now.</p>\n<p>2) Processes already demonstrated to convert natural gas to edible calories with bacteria are also technically viable. Work here would be figuring out how to retrofit existing breweries and chemical plants.</p>\n<p>3) Extracting food from leaves: grinding leaves and extracting leaf protein concentrate: again, figuring out how to scale up quickly.</p>\n<p>4) Mushrooms: again scale up investigation.</p>\n<p>5) Current cellulosic biofuel techniques with agricultural residues as feedstock produce an intermediate product of sugar. Though there are currently few biofuel plants like this, it may be possible to quickly retrofit existing chemical production plants, as was done with automobile factories in the U.S. to produce airplanes for World War II. \nWaste from mushrooms consuming wood could then be fed to:</p>\n<p>6) ruminants (cattle, sheep, goats, etc.) (already been done),</p>\n<p>7) cellulose-digesting beetles (needs more research because current insects raised for food are not cellulose-digesting), and</p>\n<p>8) rats (needs more research).</p>\n<p>Furthermore, bacteria can make fiber digestible by non-cellulose digesters, so this may work for:</p>\n<p>9) chickens (needs more research) and</p>\n<p>10) as a backup plan even humans (needs more research). </p>\n<p>11) Leaves can be eaten directly by ruminants and rabbits (needs more research for common leaves.)</p>\n<p>12) The tropics would generally stay unfrozen, but even though crops currently grown outside the tropics would be able to tolerate the lower light, precipitation, and temperature, they generally would not be adapted for the high UV levels. One exception is crops being grown on the Tibetan plateau because of the thin high-altitude atmosphere (more detail <a href=\"https://www.academia.edu/30961018/Feeding_Everyone_if_the_Sun_is_Obscured_and_Industry_is_Disabled?coauthor_invite=9c31cbd7d7885cc26a05c5d6d090738c&amp;src=approve_btn\">here</a>). This needs experiments to confirm.</p>\n<p>So basically, some of the alternate foods are already commercialized, but we need to figure out how to scale them up quickly. Other of the foods are more speculative, and would need research and development. I also have a paper (not yet published) that estimates current cost of alternate foods. The most promising ones from this perspective are fish, cellulosic sugar, leaf extract, natural gas digesting bacteria, and Tibetan wheat. Does that answer tractability? </p>\n", "parentCommentId": "Ft6TabXLMKDS8dvnt", "user": {"username": "Denkenberger"}}, {"_id": "MAEDyb5jNEqzJtuQG", "postedAt": "2017-10-31T15:09:26.531Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>As for the funding part of your comment, it is true that the agricultural risks are more mainstream than AI. We have been pursuing public resources (e.g. grants). However, I think EAs with their willingness to change their minds and openness to expected value calculations are ideal candidates to recognize the value of this early on and help get it off the ground.</p>\n", "parentCommentId": "DRfYSwY8rgMhqXWPY", "user": {"username": "Denkenberger"}}, {"_id": "3z9YK2kDGMzjnFFsC", "postedAt": "2017-10-31T18:14:32.848Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>Sure, this material is most important for EAs. However, it could be used to raise funding from EAs that would then be used to secure even more funding from the public sector in a way that's more difficult for AI safety.</p>\n", "parentCommentId": "MAEDyb5jNEqzJtuQG", "user": {"username": "Michael_S"}}, {"_id": "fY4wLCXh4H2h87BTE", "postedAt": "2017-10-31T22:16:02.107Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>I am a great fan of the bacteria which will be able to convert methane into food. Basically, it would balance two markets which both suffer sometimes of oversupply or undersupply: fossil fuels market and food market. If we will be able to move the excess of supply in one of them into another, both will be more stable. It would support also fight with climate change, as natural gas is 4-5 times cleaner than coal.</p>\n<p>I also think that methane producers will be happy to pay for such bridge as it will be a new market for them, and in that case, we will reach the negative cost of the earth-saving intervention. Negative cost should be a gold standard for EA creativity, as in that case we don't need to collect money, but just suggest an idea - and some entertainers will pay for it. However, some initial investment in the analysing and promoting the idea are needed.</p>\n", "parentCommentId": null, "user": {"username": "turchin"}}, {"_id": "WD5uNo7LjwsqpYc3Q", "postedAt": "2017-11-08T18:29:04.845Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>Could you speak a little to the adversarial nature of nuclear war adaptation? (Apologies if it’s already discussed and I missed it, I’m quite bad at tracking the maths often used in the EA community.)</p>\n<p>As far as I know, a full-scale nuclear exchange is still understood strategically as mutually assured destruction.  If agricultural adaptation becomes a confounding factor for MAD, then would this not just increase pressure to increase stockpile sizes/yields, or encourage the use of deadlier alternatives (e.g. cobalt-60 weapons, or the effective equivalent thereof), until MAD is achieved again?  It strikes me as a situation somewhat analogous to ICBM shields - in a vacuum it’s a countermeasure to the status quo, but there’s an obvious counter-countermeasure available.  </p>\n", "parentCommentId": null, "user": {"username": "DCM"}}, {"_id": "XrY8iw3XD9EPaWNiS", "postedAt": "2017-11-18T02:48:10.570Z", "postId": "7XRjb3Tx8j36AcBpb", "htmlBody": "<p>I didn't mention this issue in this point, but here is an excerpt from a paper:</p>\n<p>&quot;Moral hazard in this context refers to the possibility that awareness of a food backup plan will result in less effort to prevent these catastrophes. Nuclear winter is the catastrophe over which humanity has the most technical control and poses the most serious threat. Mikhail Gorbachev explicitly stated that a motivating factor for reducing the nuclear arsenal of the USSR was the studies predicting nuclear winter and therefore destruction outside of the target countries [48]. However, despite the knowledge of the possibility of nuclear winter, the nuclear arsenals remain large enough to potentially cause nuclear winter. Similarly, though there is a clear and present threat of anthropogenic abrupt climate change, little has been done to effectively prevent global climate change [49]. Furthermore, the backup plan presented here could reduce the damages associated catastrophes over which humanity currently has no or very little control (e.g. supervolcanic eruptions). The only cases for which moral hazard appears to be important are the super organisms. Therefore, despite the relatively small moral hazard dilemma, we believe humanity would be much better off with a viable back up plan.&quot;</p>\n<p>We are addressing more the TAD (total assured destruction) in the quote above. Your question was on the mutual assured destruction, or basically deterrence. In this case, I would argue that despite food backup plans, being able to kill half of your enemies' population is sufficient deterrence (and indeed just having 100 nukes and being able to kill as many people as died in WWII would be enough deterrence in my opinion, and far less nuclear winter risk). ICBM shields have the potential to eliminate deterrence and could make a first strike attractive, so they are more problematic.</p>\n", "parentCommentId": "WD5uNo7LjwsqpYc3Q", "user": {"username": "Denkenberger"}}]