[{"_id": "M3M4XSrfGSeK6jRLd", "postedAt": "2022-11-18T10:52:23.912Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>This. I know that dilution of our original ideals is the price we pay for growth so perhaps I shouldn't have expected much better by this point, but it's still so sad to watch the community jump at the chance to attack some of the people who put so much into starting and building this movement. I think the level of hindsight bias, mob mentality, and lack of empathy is pretty shocking.</p><p>Thank you for your ten years of hard work and for swimming against the tide today.</p>", "parentCommentId": null, "user": null}, {"_id": "9X5eHbf9uTbmzWqh2", "postedAt": "2022-11-18T10:57:15.060Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>And +100 to the shout-out to Julia Wise and Cate Hall.</p>", "parentCommentId": "M3M4XSrfGSeK6jRLd", "user": null}, {"_id": "MrCG2968noNeicDwB", "postedAt": "2022-11-18T11:02:52.382Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>This has included Will MacAskill and other thought leaders for the grave sin of not magically predicting that someone whose every external action suggested that he wanted to work with us to make the world a better place, would YOLO it and go Bernie Madoff.&nbsp;</p></blockquote><p>A contingent of EAs (e.g., Oliver Habryka and the early Alameda exodus) seems to have had strongly negative views of SBF well in advance of the FTX fraud coming to light. So I think it's worthwhile for some EAs to do a postmortem on why some people were super worried and others were (apparently) not worried at all.</p><p>Otherwise, I agree with you that folks have seemed to overreact more than underreact, and that there have been a lot of rushed overconfident claims, and a lot of hindsight-bias-y claims.</p>", "parentCommentId": null, "user": {"username": "RobBensinger"}}, {"_id": "kCya2Sm4kwiGAuCCD", "postedAt": "2022-11-18T11:04:05.980Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Personally, I’ve mostly seen people confused and trying to demonstrate willingness to re-evaluate what might have led to these bad outcomes. They may overly sway in one direction, but this only just happened and they are re-assessing their worldview in real-time. Some are just asking questions about how decisions were made in the past so we just have more information and can improve things going forward (which might mean doing nothing differently in some instances). My impression is that a lot of the criticism about EA leadership are overblown and most (if not all) were blindsided.</p>\n<p>That said, I haven’t really had the impression it’s as bad and widespread as this post makes it seem though. Maybe I just haven’t read the same posts/comments and tweets.</p>\n<p>I do think that working together so we can land on our feet and continue to help those in need sounds nice and hope you’ll still be there since critical posts like this are obviously needed.</p>\n", "parentCommentId": null, "user": {"username": "jaythibs"}}, {"_id": "J2Re4dRn8x4jHvwAJ", "postedAt": "2022-11-18T11:57:45.691Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I disagree with your assessment of the reactions in EA (I can recognize some symptoms that you mention, but it doesn't seem to be the majority of people), but I thank you for helping the world, and I hope your disgust will diminish a bit and you will want to continue to participate in EA.</p>\n", "parentCommentId": null, "user": {"username": "Gabin Kolly"}}, {"_id": "L3yKHRK7bq4zrHBFu", "postedAt": "2022-11-18T12:13:40.912Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>A contingent of EAs [...] seems to have had strongly negative views of SBF well in advance of the FTX fraud coming to light</p></blockquote><p><strong>The way to avoid hindsight bias here, I think, is to ask what other similar contingents have similar negative views about what else.</strong></p><p>Will we be flooded with 100 targets that people have negative views about? If so, maybe this kind of signal is usually a false positive</p><p>Will there only be 2 others? If so, maybe we should deal with those 2</p>", "parentCommentId": "MrCG2968noNeicDwB", "user": {"username": "hibukki"}}, {"_id": "XE5qdHhdfosgwtptw", "postedAt": "2022-11-18T12:27:45.129Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Thanks for all your hard work in EA!</p>\n<p>I think you (and lots of other EAs who feel the same way you do) are totally correct that you don't deserve the response you've been seeing to the FTX situation.  You deserve a huge pat on the back for doing so much for the world.</p>\n<p>Separately, I also agree with these paragraphs Oliver <a href=\"https://forum.effectivealtruism.org/posts/RPTPo8eHTnruoFyRH/some-important-questions-for-the-ea-leadership?commentId=X3Q98gHpShqXe39ph\">wrote</a> a few days ago, and I'm (tentatively) glad that there's been more criticism than usual on the forum right now (even if it's ultimately unrelated to FTX):</p>\n<blockquote>\n<p>I do think it is indeed really sad that people fear reprisal for disagreement. I think this is indeed a pretty big problem, not really because EA is worse here than the rest of the world, but because I think the standard for success is really high on this dimension, and there is a lot of value in encouraging dissent and pushing back against conformity, far into the tails of the distribution here.</p>\n</blockquote>\n<blockquote>\n<p>I expect the community health team to have discussed this extensively (like, I have discussed it with them for many hours). There are lots of things attempted to help with this over the years. We branded one EAG after \"keeping EA weird\", we encouraged formats like whiteboard debates at EAG to show that disagreement among highly-engaged people is common, we added things like disagree-voting in addition to normal upvoting and downvoting to encourage a culture where it's normal and expected that someone can write something that many people disagree with, without that thing being punished.</p>\n</blockquote>\n<blockquote>\n<p>My sense is this all isn't really enough, and we still kind of suck at it, but I also don't think it's an ignored problem in the space. I also think this problem gets harder and harder the more you grow, and larger communities trying to take coordinated action require more conformity to function, and this sucks, and is I think one of the strongest arguments against growth.</p>\n</blockquote>\n<p>I know it may feel like someone \"curb stomping you while you're on your knees\".  But in many cases I think a better model is (a) people doing public soul-searching or (b) people who were previously self-censoring no longer doing so.</p>\n<p>I want a world where people feel appreciated for hard work, and (simultaneously) people feel comfortable in attempting constructive criticism, safe in the knowledge that their criticism won't have the sort of negative career repercussions your post implies.  Here's my attempt to reconcile those two objectives; this goes out to all the EAs who are feeling burnt out right now:</p>\n<p>It sounds like you've been working really hard at a job you hate, doing a lot of good.  Maybe sometimes you think about taking a vacation or searching for a job that's more fun, but avoid it because of opportunity costs.</p>\n<p>If you've been doing that, I want to push back.  You <strong>deserve</strong> a vacation.  A nice long sabbatical, even.  Not only do you deserve it, it seems justified on consequentialist grounds -- I think the opportunity cost of your vacation will be less than the cost of the ingroup-hardening process you describe in your post.  (Convenient that consequentialism sometimes calls for vacations, isn't it?)</p>\n<p>In conclusion, please know that your work is appreciated, and please take care of yourself!</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "T5wwfijKpKcPZAkqi", "postedAt": "2022-11-18T13:48:41.914Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I was considering writing something similar, but investing time in writing a post is hard, so thank you for writing this.</p>\n<p>While I understand emotions we all feel, I'm under an impression that effective altruism community is now reacting in a way that they try to educate public NOT to - to use anecdotal examples and emotional states to guide the decision making. While it's very human to react in such a way I see that I'm growing more and more anxious of this direction observing the discourse.</p>\n<p>Of course what happened is devastating and that there is a lot of constructive feedback and good questions to be asked, but I hope we can preserve our commitment to compassion and truth-seeking even in hard moments like this. The things that worry me can be seen in how demanding people are to the EA leaders - to the point of almost blaming them for this without enough evidence or sympathy. And that even not that good proposals earn a lot of support because I feel we are all incentivizied to be critical of EA (and it's good to feel better about ourselves by distancing ourselves from the misery that FTX caused).</p>\n<p>I'm also worried about EA doing things now (both community here and established orgs) to influence optics rather than for the sake of integrity. It would be worrying if true, because if so it may lead to the recreating potentials errors, like people silencing themselves instead of having good-faith arguments. I hope that accountability will prevail and both community and people will be open where we screwed up and, if needed, there will be consequences, instead of us protecting the brand of EA at any cost.</p>\n<p>But I want to mention that I'm also incredibly impressed by some people here and generally very happy to consider myself part of this community. I admire the courage, integrity and sobriety of thinking of many people here. After spending recently way more time on EA Forums than I should, I came to conclusion that I would want to especially mention <a href=\"https://forum.effectivealtruism.org/users/habryka\">Habryka</a> for his behavior and comments during the last period . It's really a privilege to have such people in EA community (and I'm really sorry for not mentioning other people behaving in a similar way who I didn't notice).</p>\n", "parentCommentId": null, "user": {"username": "Jakub Stencel"}}, {"_id": "E2pRCXnrpsavEA8zW", "postedAt": "2022-11-18T14:18:17.610Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Ollie has a very high false positive rate. I can't imagine a person or project he wouldn't get off on kicking the legs out from under (https://getyarn.io/yarn-clip/1767181b-4b9d-4f7f-95fa-be4cae266511). If I join in on this \"re-drawing lines around the community\" exercise he can stand with Kerry Vaugn, Emile Torres, and Robin Hanson on the other side of my big chalk circle.<br><br>No one in the Alameda exodus expected fraud. They just thought Sam was terrible on other dimensions, they've said as much. Heck, Lantern lost money they were holding on FTX because they trusted it there.</p>", "parentCommentId": "L3yKHRK7bq4zrHBFu", "user": {"username": "NeoMohist"}}, {"_id": "wiPSCtaqKggmZ8F7J", "postedAt": "2022-11-18T14:21:09.322Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>But why exactly should I help those in the community who believe that the moral thing to do when someone is on their knees is to curb stomp them while yelling “<i>I should have been admitted to EAG 2016!</i>”? Why should I expose myself further by doing ambitious things (No I don’t mean fraud- that’s not an ambitious thing that’s a --- <strong>criminal</strong>--- thing) when if I fail people are going to make everything worse by screaming “<i>I told you so</i>” to signal that they never would have been such a newb? Yeah. No. The circle I’m drawing around who is and is not in my community is getting dramatically redrawn.&nbsp; This is not because one person or company made a series of very bad decisions, it's because so many of your actions are those of people I will not invest in further and who I don't want anywhere near my life or life’s work.</p></blockquote><p>&nbsp;</p><p>This paragraph really resonated with me. I suspect many people whom we would benefit greatly from having in our community are turned off because of they got the same feeling you articulated here.</p><p>I'm finding difficult to articulate why I think this is, but let me attempt:</p><p>&nbsp;</p><p>When I've been at my least productive, I find myself falling into a terrible zero-sum mindset of actively searching for things that are unjust or unfair. My thoughts often take the shape of something like:</p><blockquote><p>Why do influential EA's only care about &lt;thing they think is important&gt; and not &lt;thing I think is important&gt; ?</p></blockquote><blockquote><p>'If EA was less &lt;elitist/nepotistic&gt; and more &lt;democratic/open/whatever&gt; then my pet cause would get the attention it deserves! '</p></blockquote><p>On the other hand, when I'm at my most productive and fully immersed projects that matter to me, I don't ever find myself thinking those thoughts. I'm too focused on actually getting things done and producing surplus to care about how others spend their time and resources.</p><p>In this mindset I'm incredibly optimistic and I intuitively feel that any problem solvable if I put my mind to it. In the former mindset, everything seems doomed to fail and I want to sneer at anyone who thinks otherwise.<br><br>These mindsets feel very distinct, and it's very clear the latter is highly conducive to success and the former is actively harmful. If somebody with the latter mindset gets their first impression of EA from people with the former, I don't blame them for bailing.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "fr5ZWyBXfhXYqYowA", "postedAt": "2022-11-18T15:04:33.706Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Oof. What did Gideon Futerman do? Break the wagon circle to air his <a href=\"https://forum.effectivealtruism.org/posts/RPTPo8eHTnruoFyRH/some-important-questions-for-the-ea-leadership\">loss of confidence</a> in EA leadership? I think it's pretty reasonable to have said confidence shaken, especially when <a href=\"https://forum.effectivealtruism.org/posts/Et7oPMu6czhEd8ExW/why-you-re-not-hearing-as-much-from-ea-orgs-as-you-d-like\">no one is talking</a> (seemingly putting their own reputations, and PR, ahead of what's best for the future of the EA community).</p>", "parentCommentId": "E2pRCXnrpsavEA8zW", "user": {"username": "Greg_Colbourn"}}, {"_id": "zcoE539TzLczBboWd", "postedAt": "2022-11-18T15:15:46.402Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>It has included attributing the cause of Sam’s actions to everything from issues with diversity and inclusivity, lack of transparency in EAG admissions, the pitfalls of caring if we all get eviscerated by a nuke or rogue AI, and, of course, our office spaces and dating habits.&nbsp;</p></blockquote><p>I have not seen any of this on the EA Forum<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefoqwm9mnorfh\"><sup><a href=\"#fnoqwm9mnorfh\">[1]</a></sup></span>. I imagine Twitter is a lot more toxic (as usual) though.<br><br>I get that you are angry. I'm sorry, and I wish you well. I'm angry from the other side - I'm seeing <a href=\"https://forum.effectivealtruism.org/users/greg_colbourn#:~:text=Greg_Colbourn-,3d,-54\">too much wagon circling</a>, and not enough willingness to engage or change from the people at the centre. I've also invested a decade into EA, and I am upset with how things are going post-FTX Crisis.</p><blockquote><p><i>Lizka-- I’m sorry-- I’ll see myself out.</i></p></blockquote><p>This literally made me laugh out loud (you're a good writer!) :)<br><br>Anyway, I think I need to get off the EA Forum for a while. I'm going for a weekend away and will tell my partner to stop me if she sees me on the Forum!</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnoqwm9mnorfh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefoqwm9mnorfh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Apart from maybe dating habits - but the point there isn't the dating habits, it's the <a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx?commentId=byP6muwztkrwXBLMG\">conflict of interest</a> they cause if they also involve professional relationships!)</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "84Pvx3ELRSa8C5e8d", "postedAt": "2022-11-18T15:55:22.871Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>Heck, Lantern lost money they were holding on FTX because they trusted it there.</p></blockquote><p>In case some readers need more context: The source of the \"Some EAs thought Sam was bad\" comments seem to originate with <a href=\"https://twitter.com/Tara_MacAulay/status/1592985303262072834\">Tara Mac Aulay and some of her colleagues in 2018</a>. Some of this group then <a href=\"https://twitter.com/Tara_MacAulay/status/1592985305556074497\">started Lantern</a>.</p>", "parentCommentId": "E2pRCXnrpsavEA8zW", "user": null}, {"_id": "MRkr5JNAxwn9sh2gS", "postedAt": "2022-11-18T16:28:00.384Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I think the point I have been trying to make in criticising the leadership is something like this:</p><ul><li>EA has this slightly weird, very opaque and untransparent, sort of unaccountable leadership which we trust with a lot of power. We treat them, in many ways, like \"philosopher-kings\" of the community</li><li>We do this on the premise that these people are uniquely good at leading the community and uniquely good at seeing risks that might be posed to the EA enterprise, and if they were more accountable and public, this would reduce their ability to do this, so reduce the ability of EA to do good in the world</li><li>However, the FTX scandal has shown us that these EA leaders are just humans, with the same flaws and biases as the rest of us (as I think many of us suspected), and aren't these superhuman philosopher kings&nbsp;</li><li>Thus, we probably shouldn't centralise so much power and trust in such a small unaccountable opaque group of people.</li></ul><p>Its not that these people aren't worthy of compassion, or that I would have done better (I wouldn't have done). Its that we defer dso much power to them on the assumption that they are so much better than us at this, and I just think they're not.</p>", "parentCommentId": "T5wwfijKpKcPZAkqi", "user": {"username": "Gideon Futerman"}}, {"_id": "hvSLbMDQcYPkxrWT4", "postedAt": "2022-11-18T16:57:12.356Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I appreciate you for writing this! I don't agree with everything you've written here, but I vibe a lot with the spirit. Hindsight bias and \"my personal pet peeve against EA is responsible for everything bad that happened here\" seem everywhere. My guess is that while there are important updates to be made, and many short term fires to put out, the actually important updates will be far easier to make in a few weeks once things feel calmer and less emotionally raw.</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "sdmzGA687YqEjBTnq", "postedAt": "2022-11-18T17:16:01.668Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote>\n<p>However, the FTX scandal has shown us that these EA leaders are just humans, with the same flaws and biases as the rest of us (as I think many of us suspected), and aren't these superhuman philosopher kings</p>\n</blockquote>\n<p>To be clear, this was always known, just never acted upon.</p>\n", "parentCommentId": "MRkr5JNAxwn9sh2gS", "user": {"username": "Guy Raveh"}}, {"_id": "Q8eZSPgFGvEkbsB4K", "postedAt": "2022-11-18T17:19:34.468Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Well, yes, that I do agree with</p>\n", "parentCommentId": "sdmzGA687YqEjBTnq", "user": {"username": "Gideon Futerman"}}, {"_id": "4tsYpwjzKf2Wfz3jD", "postedAt": "2022-11-18T17:50:15.856Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>One view is that SBF's actions are a sample of one and therefore cannot justifiably be the premise for the kind of wide-ranging criticisms fielded against effective altruism on this forum and elsewhere over the last week. I think this is wrong-headed, however. The point is not that SBF's fraud in and of itself proves the existence of these problems, it is merely that it <i>highlights </i>problems which can be independently justified. For example, it highlights that that this is a fairly hierarchical movement that vests a lot of power in the hands of a small number of people, with few mechanisms to hold them accountable and transparent to the community at large.&nbsp;</p><p>Across a wide range of domains, crises are productive moments where the legitimacy of the existing order of things breaks down and there is a space for new, open and critical thought. If you are happy with the current incarnation of the movement no doubt that is regrettable, but clearly, <i>many people are not</i>. Obviously some fraction of criticism - this is the internet, after all - is not thoughtful, constructive or made in good faith. But to say that criticism at a time of crisis is equivalent to seeing someone on their knees and curb stomping them is, I think, an extremely dangerous attitude. What you are effectively advocating for is a rally-around-the-flag effect.</p><p>I agree that some people are being too harsh on the 'leaders' of effective altruism, and especially Will. He was one of a great many people who were deceived. I don't think the problem is one of his or any one else's individual character. I think the problem is how the movement is organised. I would add that how it is organised is probably not entirely independent from utilitarian and rationalist philosophy.</p>", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "s7p7HpgH4KG7qeEnb", "postedAt": "2022-11-18T18:02:48.610Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Thank you very much for your decade of hard work for EA, and for sharing some thoughts vividly and articulately that many of us have probably been feeling over the last few days.&nbsp;</p><p>I have seen a lot of 'blood in the water' reactions, where people with long-standing grievances about various alleged problems in EA (some real, some exaggerated, some imagined) have taken the FTX crisis as an opportunity for criticizing those problems in highly emotional and often unconstructive ways. This often seems driven not by a desire to strategize about how those problems can be rectified in the future, but to enjoy seeing certain people get their 'comeuppance' for some past misjudgment or misbehavior that is attributed to them, or to re-engineer EA's culture in some new ideological or political direction.&nbsp;</p><p>This is standard human behavior. Whenever an organization or movement faces a sudden, massive PR crisis, people tend to start backbiting, recriminating, criticizing, re-opening old wounds, and, all too often, fracturing into warring cliques.&nbsp;</p><p>I hope that as people who have devoted our lives to taking a big step back from 'normal' human emotional reactivity, tribalism, and signaling, and to trying to hold our values and actions to a higher, more rational, more empathetic standard, we can all calm down, treat each other better, remember our common mission, and have confidence that EA will survive, adapt, grow, prosper, and do more of the good that we're devoted to doing.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "ArmsJhFGA9PKCnFvT", "postedAt": "2022-11-18T18:30:41.668Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I'm placing myself on a ban because I'm not my best self right now but briefly:<br><i><strong>1. \"EA has this slightly weird, very opaque and untransparent, sort of unaccountable leadership which we trust</strong></i><strong> </strong><i><strong>with a lot of power. We treat them, in many ways, like \"philosopher-kings\" of the community.\" &nbsp;</strong></i><br>I don't think very many people treat him like this (certainly not the majority- literally, no one I know defers to him in this way and this strikes me as a super weird interpretation of his role in EA). But treating this as true how is this Will's fault? At no point do I personally remember Will standing on a podium of What We Owe The Future, screaming \"I am your leader bow to me, peasants!\" I think I would have remembered that. Sounds like a hoot. Instead, the, and so help me I don't know why I have to emphasize this, *living, breathing human being with feelings* &nbsp;is a philosopher and an academic who had an idea and promoted it because he thought it would make the world a better place. This resulted in a community and organizations inspired by his ideas -- <i>not</i> &nbsp;-- governed by him. It's a handful of organizations with distinct leaders and a handful of individuals with their own interpretations of his and other people's work. Maybe people who deferred to Will should be the ones who are pondering their own epistemics.<br><strong>2. On Lantern Ventures:</strong><br>There is a big difference between not wanting to work with someone because you don't like their ethics (looking at you Kerry) and thinking they are going to commit the century's worst fraud. Also, she's getting death threats. Do you not reckon she's suffering enough without her community adding their voices to the mob of people saying she should have known or that she could have prevented this? I remember when this stuff happened, it was on the periphery of EA at best. I literally don't think I thought about it for longer than around 10 minutes and I had friends personally involved at the time. My take was \"Wow! Sam sounds like a bad manager\" not \"Uhoh best nail down the furniture.\" &nbsp;&nbsp;<br><strong>3. On Dancer, and a handful of other people being kind while being critical:&nbsp;</strong><br>Thank you. You can stay. ;)<br>&nbsp;</p>", "parentCommentId": "MRkr5JNAxwn9sh2gS", "user": {"username": "GoodEAGoneBad"}}, {"_id": "DAybYbsoTyCwxK8TD", "postedAt": "2022-11-18T18:38:06.601Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>This feels kind of strawmanny.</p>\n<p>I said many times neither me nor others predicted the scale of the fraud and explosion at FTX.</p>\n<p>I do think it was clear that Lantern was disassociating themselves from Sam, and stopped giving Sam resources, and that is the primary thing I think we should have done too, based on roughly the same info that Lantern and other past Alameda employees had.</p>\n<p>About false-positives: I agree that false-positives are a key thing to pay attention to. I do think I have concerns about a bunch of things in EA here, though I think it's really far from everyone, and also, I don't think I have a historically bad track record (like, I did say that CEA was really corrupt and broken during 2015-2017 and I think that is accurate and I think current CEA would agree with that. I also think my concerns about Leverage are well-warranted. I was also one of the people most involved with kicking Diego out of the community, and in the Bay Area warned a lot of people about Brent earlier than others. I also think I was too pessimistic about CEA after 2018, and I was wrong about the future of EA Funds when I was frustrated with it at various points.)</p>\n<p>We can make a concrete list of organizations and public intellectuals if you want, and then people can judge on their own if I have a huge false-positive rate.</p>\n<p>(For some random examples: I think the 80k podcast is great. I think SSC/ACX is great. I think Open Phil's research team does a lot of good work despite me deeply disagreeing with them a lot. I think MIRI has done good work but also produced a depression machine that made everyone there depressed. I think FHI was really great before it scaled a lot, now it is a sad husk of its former self, as the university has been smothering it. I think Nicole Ross's team is great and they do valuable work, though I think they lack ambition. I think Julia Wise's stuff is high-variance and sometimes has bad consequences, but I've come around over the years to thinking that it's probably good for the world, though I am still hesitant. I think Redwood Research is genuinely well-intentioned and doing good work, and I trust Buck a lot, though almost all the work they do doesn't seem to be on the critical path towards safe AI (but it's still my favorite prosaic alignment place to send people to). I think Paul fucked up hard by endorsing OpenAI as much as he did, and I think something kind of bad is happening with his writing style, but he is a genuinely great thinker for AI Alignment and I've learned a lot from him about how to think about AI Alignment, and want him to have the resources to pursue his research even if it seems doomed to me. I think CFAR makes some great workshops, though also had some pretty fucked-up dynamics and Anna continues to have a not-great track record at identifying who will end up kind of crazy and causing a bunch of harm. I think Robin Hanson's research and writing is great, though I heard he has some more dubious in-person behavior. I think the Atlas Fellowship seems pretty cool and I support it, though I think the presentation is too... I don't know, fake-ambitious/EAish. In-general the Stanford EAs seem like they are doing cool stuff with a bunch of the events and workshops they are running.)</p>\n", "parentCommentId": "E2pRCXnrpsavEA8zW", "user": {"username": "Habryka"}}, {"_id": "Smkzo4dG9zw7bQTu3", "postedAt": "2022-11-18T18:42:16.157Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I have maybe 1-2 other people/organizations that I feel as doomy about as I did for SBF.</p>\n<p>That said, there are definitely lots of other parts of EA that I feel unhappy about, and I do think there are some deeper things going wrong (like generally too much private scheming and empire building, and not enough blurting out of opinions and open curiosity and deep commitment to honesty).</p>\n", "parentCommentId": "L3yKHRK7bq4zrHBFu", "user": {"username": "Habryka"}}, {"_id": "v6c8wNAeBgqBPfwxL", "postedAt": "2022-11-18T19:18:10.673Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Your contention: Too much planning and building, not enough blurting out \"deeply honest\" (and very negative!) opinions.&nbsp;<br><br>My contention: Stop burning each other online, EA is not Mean Girls. Shut up, play nice, go into the real world, build, and get shit done.&nbsp;<br><br>This actually matters!</p>", "parentCommentId": "Smkzo4dG9zw7bQTu3", "user": {"username": "NeoMohist"}}, {"_id": "H27snQkGnsYLg99oL", "postedAt": "2022-11-18T19:18:57.099Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>A bunch of things that all seem true to me:</p>\n<ol>\n<li>Some number of people in EA community could have done things that were positive in expectation that would have mitigated much of the downside to EA from FTX.</li>\n<li>A bunch of people are overreacting to this situation and making it seem much more damning to EA than I think it is. Some of those people are acting in bad faith.</li>\n<li>It is very possible that as a community we overreact to this situation and adopt bad norms, institutions, or practices that are negative EV going forward.</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Cullen_OKeefe"}}, {"_id": "nDkKCx5GH9CRbmR2j", "postedAt": "2022-11-18T19:33:13.360Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Yep, definitely matters! I also think the current situation is some more evidence of my contention over your contention, though not like hugely so (at least without digging into the details).</p>\n<p>At least in this case though we can agree that something terrible happened, so let's start with an analysis of what things could have maybe prevented that. And maybe we will learn that it was really hard to prevent, or the prevention would have been too costly.</p>\n<p>And I do agree and want to apologize at least a bit for pushing towards my contention in a way that I think was a bit too much driven by a specific inside view in which this did seem quite straightforwardly caused by a bunch of stuff that I have been concerned about for a while, but I don't think I've explicated those models in sufficient detail to be compelling to many people.</p>\n", "parentCommentId": "v6c8wNAeBgqBPfwxL", "user": {"username": "Habryka"}}, {"_id": "79zccYfqAj8zBGq8y", "postedAt": "2022-11-18T19:51:09.084Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>Ollie has the highest false positive rate I've ever seen.</p></blockquote><p>What are the false positives? Some of the big things I recall Ollie critiquing in the past are Leverage Research and \"mainstream EA playing fast and loose with honesty\"; those critiques seem to have aged well.</p><blockquote><p>No one in the Alameda exodus expected fraud. They just thought Sam was terrible on other dimensions, they've said as much.&nbsp;</p></blockquote><p>The claim isn't \"lots of people predicted fraud, therefore we should do a postmortem on why EA's FTX boosters didn't predict it\". Rather, the claim is that SBF had a bunch of red flags that plausibly would have sufficed for <i>at least</i> engaging with SBF with a lot more caution, as opposed to whole-heartedly embracing him in the way that a lot of EA did.</p><p>It <i>might</i> also have increased the probability of more of FTX's shady and shoddy business practices coming to light, but I agree that this is more uncertain. The main question is just whether there were process or norm failures in terms of how we reacted to lesser warning signs. Lesser warning signs won't always let you catch disasters in advance, but it <i>does</i> matter how we react to those signs -- in expectation, whether or not it would have helped in this case.</p>", "parentCommentId": "E2pRCXnrpsavEA8zW", "user": {"username": "RobBensinger"}}, {"_id": "9PFovYMdgSa6eNEri", "postedAt": "2022-11-18T20:03:17.279Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Who are these EA leaders? What are their names and what do they do? Who directs what? How sure are you that you aren't just imagining that there must be some adults in charge somewhere?&nbsp;<br><br>EA is anarchy. No one is even a little in charge. Some people get asked for advice more than others. Some people have ideas that are more influential than others. No one knows what they are doing, but all the constructive EAs are trying to do things and while also asking around to shore up their epistemics as they do so. EA is a workshop where everyone has their own projects but is free to ask the old hands for tips or to spy on the cool new up-and-coming projects and to try to emulate them.&nbsp;<br><br>EA forum, Twitter, EAG talks, etc are not real life. Will is a mascot. At best an \"influencer.\" If you want to shape the future (of the world, EA, the British government) you have to ground yourself in what is actually going on, not just the chattering in places like the EA forum. Be constructive, be nice, support others, and start building some stuff of your own.&nbsp;</p>", "parentCommentId": "MRkr5JNAxwn9sh2gS", "user": {"username": "NeoMohist"}}, {"_id": "ZWiKYfBMKHWqYujkJ", "postedAt": "2022-11-18T20:13:53.435Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>EA is anarchy. No one is even a little in charge.&nbsp;</p></blockquote><p>I don't think that's true. I've worked at CEA myself, and I know that CEA wields considerable influence.</p><p>I also think your way of discussing is inappropriate.</p>", "parentCommentId": "9PFovYMdgSa6eNEri", "user": {"username": "Stefan_Schubert"}}, {"_id": "GFMpYbY8mSiLuW6xh", "postedAt": "2022-11-18T20:25:09.655Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Hi, it's bad to hear that you feel this way, and I can understand why you have this sort of sentiment. A lot of emotions are running high right now.&nbsp;<br><br>But what I have not seen mention of here:<br>I have not had funding effected by this (apart from reducing future potential funding sources), so I am saying this as someone far less effected than most. But a lot of people had their funding sources part or all from FTX, whose funding is now uncertain. There has been no guarantee that all promised grants will be fulfilled as far as I am aware, even through another funding source like Open Phil as they mentioned raising their criteria. There will be people, as a direct result of this, who do not know whether their work can continue or if they lose their job/business/other project, or whether past money that they spent, having received in good faith while trying to have the highest positive impact they could, may even be clawed back. Some of these people will be students, or people early in their careers, who are less likely to have savings to fall back on, or in the event of a clawback may have their savings wiped out (I have no idea of the actual likelihood of this, but I have seen this discussed on the forum). Who perhaps have not been given a clear answer, by other people in the movement who they may have been expecting an answer from but who are instead remaining silent (although there might have been private communication that I am unaware of). My sympathy lies with them the most, and I do not blame them (or others) for potentially questioning people who perhaps could have known more (not saying anyone did or didn't, I wouldn't know beyond what is in the media).&nbsp;<br><br>And that's of course just the people affected within the EA community. That's not mentioning the hundreds of thousands or millions of customers who were directly stolen from, many of whom lost significant amounts of money or even their life savings. That's not mentioning people who will be effected in future fallout.&nbsp;<br><br>\"This has included Will MacAskill and other thought leaders for the grave sin of not magically predicting that someone whose every external action suggested that he wanted to work with us to make the world a better place, would YOLO it and go Bernie Madoff.&nbsp; The hunt has included members of Sam’s family for the grave sin of being related to him.\"&nbsp;<br>I think it is fairly natural to question if certain people knew more than most, when it externally seems like Will MacAskill may have been some form of mentor to SBF for nearly a decade (I know nothing here, just going by the media for this one, and it seems likely that this may have been overstated in media as it makes a good story). Family members can plausibly know better than that, and of course nobody should be threatened, but luckily I have not really seen this within the EA community.&nbsp;<br><br>\"It has included attributing the cause of Sam’s actions to everything from issues with diversity and inclusivity, lack of transparency in EAG admissions, the pitfalls of caring if we all get eviscerated by a nuke or rogue AI, and, of course, our office spaces and dating habits.\"&nbsp;<br>Dating habits can very much be a conflict of interest (Google it), particularly if it is likely to influence something like the willingness to provide *multi-billion dollar fraudulent loans* due to this person being someone you are (allegedly) dating..&nbsp;<br><br>\"But why exactly should I help those in the community who believe that the moral thing to do when someone is on their knees is to curb stomp them while yelling “I should have been admitted to EAG 2016!”?\"&nbsp;<br>Who's actually done this? Source? And the main 'curb-stomped' people, if you can call it that, are literally 1) someone who has committed multi-billion dollar fraud more likely than not it seems (and some of his inner circle) and 2) someone who at this point is likely the main public face of the movement who said fraud claimed (in many past interviews) motivated him (and public figures should not be above question). Innocent until proven guilty of course, but even if the odd person takes things too far, that is not indicative of a movement wide 'witch hunt'.&nbsp;<br><br>A lot of people's emotions are high right now, and remember that when reading other people's comments, the same way they should remember when reading what you write including this post.&nbsp;<br><br>(And in fairness to Twitter, it has been more balanced than I was expecting (considering my base rate for expected Twitter discourse is basically people screaming/a witch hunt, you don't go to Twitter for reasoned debate). People appear to be defending EA, and that includes people from the public.)</p>", "parentCommentId": null, "user": {"username": "LinBowkerLonnecker"}}, {"_id": "xGZejWp2NLwPaQkSX", "postedAt": "2022-11-18T20:35:35.811Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I don't usually like responding to these sorts of comments as it is rarely worth it, but:&nbsp;<br><br>I truly hope your usual method of arguing is not this ad-hominem, and with emotive language used rather than rational argument.&nbsp;<br><br>Edit: I understand emotions are running high, and I see your above comment. Personal attacks, particularly to specific individuals in the above way really aren't appropriate though, which is why I felt I had to say something here.&nbsp;</p>", "parentCommentId": "9PFovYMdgSa6eNEri", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "7MXu98Ee9baySfaqP", "postedAt": "2022-11-18T20:37:39.042Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Reposting my penultimate paragraph as it is important and in case people don't otherwise read that far:&nbsp;<br>&nbsp;</p><p>A lot of people's emotions are high right now, and remember that when reading other people's comments, the same way they should remember when reading what you write including this post.&nbsp;</p>", "parentCommentId": "GFMpYbY8mSiLuW6xh", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "YhSjmjxbLStKsNCXb", "postedAt": "2022-11-18T20:38:45.649Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>The monarchy wields influence. &nbsp;That is not the same thing as control.&nbsp;<br><br>I will go back and edit this. I've clearly crossed the line by more than I realized. Like a lot of people, I'm fraying with this one. It feels like all of the worst folks in EA publicly (and permanently!) shaming all of the best. Break ups don't hurt this much.</p>", "parentCommentId": "ZWiKYfBMKHWqYujkJ", "user": {"username": "NeoMohist"}}, {"_id": "NmxJdauo49dRv9R4f", "postedAt": "2022-11-18T21:05:43.968Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I don't want to get into debates around object-level criticisms this early but I keep being puzzled by this assertion:<br>\"This resulted in a community and organizations inspired by his ideas -- <i>not</i> &nbsp;-- governed by him. It's a handful of organizations with distinct leaders and a handful of individuals with their own interpretations of his and other people's work.\"</p><p>There was also a similar quote elsewhere:<br>\"But Will is not the CEO of EA! He's a philosopher who writes books about EA and has received a bunch of funding to do PR stuff.\"</p><p>I don't think this conception of \"people loosely connected together in various ways\" really captures the correct level of accountability here. There is a legal entity named Effective Ventures, which is the umbrella organisation of CEA, 80000 Hours, GWWC etc. and Will is the president of Effective Ventures as well as CEA. The people in the community volunteer their time and credibility by referring these organisations(and their literature) to their social circles. Many also do donate money to these organisations.</p><p>I refuse to have a verdict on FTX related criticisms until the dust settles, and most of the non-FTX related criticisms seem unreasonable to me, but this argument of \"no one is the leader of EA really\" strikes me as quite odd. <s>I suspect CEA might even be the official copyright owner for \"Effective Altruism\" brand as I don't see any organisation that has \"Effective Altruism\" in its name despite not being approved by CEA.</s> Please inform me on this if I'm wrong. EA is much more centralised than &nbsp;\"Socialism\" or \"Feminism\".</p><p>Correction: No one owns \"Effective Altruism\" as a trademark. <a href=\"https://forum.effectivealtruism.org/posts/DdSszj5NXk45MhQoq/decision-making-and-decentralisation-in-ea\">More detailed information here.</a></p>", "parentCommentId": "ArmsJhFGA9PKCnFvT", "user": {"username": "emre kaplan"}}, {"_id": "syTBsWKHmzwq9LpDD", "postedAt": "2022-11-18T21:20:47.829Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I've been thinking about a conversation a friend of mine and I had while reading the book Unmask Alice, about the author Beatrice Sparks and how the books she passed off as authentic diaries contributed to the Satanic panic and the war on drugs. Specifically, we were trying to work out how to avoid making the terrible mistakes multiple grieving parents made and years later ended up deeply regretting, both in connection to Sparks and in cases we'd heard about elsewhere (at least one former advocate for the sex offender registry falls into this category). The place we got to in that conversation was that the kind of overwhelming grief felt in the immediate aftermath of tragedy makes it harder to make measured choices. It is easy to want to stamp out the problem forever, as quickly as possible, because the horrible thing that happened cannot be allowed to happen ever again. But that is not a good mental state to be in when trying to change the world.</p><p>I keep thinking about it because I feel like I'm seeing a similar pattern shaking out here. What FTX did was unacceptable, and it cannot be allowed to happen again. We have to find what allowed this and take quick decisive action about it, because anything less might let another FTX rise up. I can understand this impulse, and having seen my share of unresolved drama in related communities I too feel the fear that if we don't do anything now then nothing will ever be done. But I don't trust a lot of the solutions being floated right now. I think people have a sense that something must be done, and are reaching for anything that might be something. I just hope that we manage to come out the other side somewhere sensible.</p>", "parentCommentId": null, "user": {"username": "Disciple_of_Sound"}}, {"_id": "gLyzwfpqpvC57ggca", "postedAt": "2022-11-18T21:22:38.535Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>We treat them, in many ways, like \"philosopher-kings\" of the community</p></blockquote><p>Having read Plato, I have no idea what you mean by this.</p>", "parentCommentId": "MRkr5JNAxwn9sh2gS", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "PFfxotqYGkPgqJbkR", "postedAt": "2022-11-18T21:27:43.690Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Absolutely. We obviously can weather losing funding. EA started small and it can grow back. And people always have enjoyed heaping one form of abuse on it or another. The more fundamental damage will be what we inflict on ourselves.</p><p>But I'm still optimistic this will mostly blow over with respect to the EA movement. Mostly, I think that people are being louder than usual across the board, but they seem to be expressing opinions they'd already held. When it stops being as salient, people will probably more or less quiet down and keep pursuing the same types of goals and having the same perspectives they had previously. Hopefully in the context of improved movement governance.</p>", "parentCommentId": "H27snQkGnsYLg99oL", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "SEkJziBmRHeZKEYty", "postedAt": "2022-11-18T21:35:07.621Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I'd be interested to hear what you think is going wrong with Paul's writing style, if you want to share.</p>", "parentCommentId": "DAybYbsoTyCwxK8TD", "user": {"username": "lukasberglund"}}, {"_id": "8RaRyt7v2pCNRy3NL", "postedAt": "2022-11-18T21:43:35.451Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I like your comment- thank you. I am really confused by the opposite view. I don't quite understand where Will as governor of EA comes from. There are influential organizations and thinkers in EA for sure but ownership and ultimate responsibility particularly cosmic responsibility for bad actors feels very different... I think something is obviously going on here which is important and once things are less awful we should try and dissect calmly, kindly, and deliberately. &nbsp;</p>", "parentCommentId": "NmxJdauo49dRv9R4f", "user": {"username": "GoodEAGoneBad"}}, {"_id": "S4XmkLt6nD6zkJQNS", "postedAt": "2022-11-18T21:45:37.377Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Guys, please have a go at people on another person's post. God knows there are enough of them... This is exactly what I'm talking about and I will literally have a coronary. Lol.</p>", "parentCommentId": "SEkJziBmRHeZKEYty", "user": {"username": "GoodEAGoneBad"}}, {"_id": "Gfm2pReomiWinxKa7", "postedAt": "2022-11-18T21:52:07.727Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "", "parentCommentId": "S4XmkLt6nD6zkJQNS", "user": {"username": "lukasberglund"}}, {"_id": "jiFGzbjAn78nQAmvJ", "postedAt": "2022-11-18T21:53:13.383Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Appreciate you <a href=\"https://emojipedia.org/red-heart/\">❤️</a></p>", "parentCommentId": "Gfm2pReomiWinxKa7", "user": {"username": "GoodEAGoneBad"}}, {"_id": "6xmXg6wYkN9aL4PAR", "postedAt": "2022-11-18T23:34:49.053Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I think it is appropriate for the movement to reflect at this time on whether there are systematic &nbsp;problems or failings within the community that might have contributed to this problem. I have publicly argued that there are, and though I might be wrong about that, I do think its entirely reasonable to explore these issues. I don't think its reasonable to just continually assert that it was all down to a handful of bad actors and refuse to discuss the possibility of any deeper or broader problems. I like to think that the EA community can learn and grow from this experience.</p>", "parentCommentId": null, "user": {"username": "Fods12"}}, {"_id": "bnJwFAACFjTxQWizm", "postedAt": "2022-11-19T00:14:25.263Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Personally I'd rather be kicked when I'm down. Better to deal with all the pain at once.  Maybe there can be a forum feature that can allow a person to tune the percentage of critical posts they see based on sentiment analysis and those who can't handle all the vitriol at once can take it in little bits at their own convenience.</p>\n", "parentCommentId": null, "user": {"username": "supesanon"}}, {"_id": "naNECfbkqiNPhSvD5", "postedAt": "2022-11-19T00:16:24.973Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Not going to lie, I understand you're emotional, but being referred to as \"all of the worst folks\" in EA, and your previous comment before you edited wich was exceptionally rude, is honestly one of the worst interactions I've had in this community.</p><p>I have volunteered hours of my time running seminar programmes, writing curricula, helping organise speaker events and Q&amp;As. I have spent literally 100s of hours consuming EA content and trying to compile EA content for people tgo use. I have orientated my research around X-Risk, spent an entire summer at CERI, taken a year off from university to research X-Risk, spoken at EAGx Rotterdam, and tried to make sense of the world to reduce X-Risk. Sure, I'm not perfect, and critiques of my approach and my criticisms I am sure I am valid, and understand this is emotional and hard for you, and I apologise if my critiques have made it harder- I still tink its time to have such difficult conversations, but I do apologise if this is hard. To be called \"one of the worst folks in EA\" and being accused essentially of \"not actually doing stuff\" is really upsetting when I really am trying my best, so I do hope you will apologise</p>", "parentCommentId": "YhSjmjxbLStKsNCXb", "user": {"username": "Gideon Futerman"}}, {"_id": "KNPxPsJvtDLK4CnuW", "postedAt": "2022-11-19T01:32:24.124Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Seriously mate, I get your upset, but maybe take a break from the forum for a while? Like, this isn't healthy. I get my critiques of the leadership I have has upset you, and maybe they are incorrect, but I don't quite understand why you want me out of EA.\nAlso, if you do want to find out who I am before wanting to remove me from your community, please check out my profile so you can know who I an 🙂</p>\n", "parentCommentId": "E2pRCXnrpsavEA8zW", "user": {"username": "Gideon Futerman"}}, {"_id": "nu9Lo2XoCeoJBy5wg", "postedAt": "2022-11-19T01:36:24.527Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Honestly not sure why I seem to have become NeoMohists enemy! Like I just posted some questions, sure they were questioning and not the most sympathetic to the leadership, but its hardly enough I think to warrant this. On the otherhand, I am sure NeoMohist is going through a difficult time like many of us, so I sort of get jumping to attack me (I'm sure ai have been similarly unreasonable at times in the past)</p>\n", "parentCommentId": "fr5ZWyBXfhXYqYowA", "user": {"username": "Gideon Futerman"}}, {"_id": "FQAWDQnkpR4n3nnkD", "postedAt": "2022-11-19T01:39:59.359Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Habryka's comments have been pretty strongly upvoted on the forum these days, indicating that folks have found them helpful. It might &nbsp;be useful for you to provide receipts or anything that supports claims like \"Ollie has the highest false positive rate\", \"Ollie is terrible for EA\", otherwise this is just a fairly baseless accusation.</p>", "parentCommentId": "E2pRCXnrpsavEA8zW", "user": {"username": "pseudonym"}}, {"_id": "tk8TgzbSXtAjgqt5v", "postedAt": "2022-11-19T02:38:07.094Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>See the heart-related, moderation request above. Berglund (aka. my new fav) has an excellent and I am told extra spicy new <a href=\"https://forum.effectivealtruism.org/posts/jsK9wD6d5MSAFttgC/berglund-s-shortform?commentId=aDTzFSKB89EotK7BT\">short form</a> for this.&nbsp;</p>", "parentCommentId": "FQAWDQnkpR4n3nnkD", "user": {"username": "GoodEAGoneBad"}}, {"_id": "zdFtWGzckftjZmGLf", "postedAt": "2022-11-19T08:40:00.336Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<blockquote><p>There is a big difference between not wanting to work with someone because you don't like their ethics (looking at you Kerry) and thinking they are going to commit the century's worst fraud.</p></blockquote><p>I don't think anyone asking for more information about what people knew believes that central actors knew anything about fraud. If that is what you think, then maybe therein lies the rub. It is more that strong signs of bad ethics are important signals and your example of Kerry is perhaps a good one. Imagine if people had concerns with someone on the level of what they had with Kerry (plausible in the case of SBF - that is what it important to find out) and despite that promoted Kerry to be one of the few faces of the movement. That would be problematic and it is important to figure out what happened. That's not a witch hunt.</p><p>Also, it is very surprising to me that you don't hold the belief that many people treat e.g. Will as a central figure to defer to. Given what you've written it sounds like you are quite central so maybe get exposed to different people who have more eye-to-eye contact with Will, but it is certainly my experience that most people confer star power on Will. You are right that that doesn't make it Will's fault. I am just trying to claim that I don't think you claim that people don't treat him like a philosopher king hasn't been my experience at all.</p>", "parentCommentId": "ArmsJhFGA9PKCnFvT", "user": {"username": "DevonFritz"}}, {"_id": "qvLDubJKdaASLXCJu", "postedAt": "2022-11-19T09:32:12.784Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I am sorry you're so upset. As someone that has not dedicated themself to EA like you maybe I can't understand your anger.</p>\n<p>However, I take exception to using the term curb stomp. Like I get your whole post is deliberately hyperbolic but curb stomping is a horrifically violent act perpetrated by neo-nazis to cause permanent disfigurement to their victims. <a href=\"https://en.m.wikipedia.org/wiki/Curb_stomp\">https://en.m.wikipedia.org/wiki/Curb_stomp</a></p>\n<p>It doesn't accurately describe what has happened even metaphorically and it is certainly not amusing. I think a lot of the comments (mainly on Twitter) were uncharitable and unkind when Will put out his statement but yeah I just object to that term and found it inappropriate and distasteful.</p>\n", "parentCommentId": null, "user": {"username": "James Gough"}}, {"_id": "TeLAXwxFowGMGGFEk", "postedAt": "2022-11-19T10:11:25.856Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Keep in mind that the people who are commenting, writing call-out posts, etc., online are both a) only a small fraction of EAs, and b) a particularly skewed sample in the current moment.<br><br>Some of us either chose to or were asked to be quiet for now, or are still reeling from our losses and not sure what to say.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "brci25pjcXv3EhBg6", "postedAt": "2022-11-19T10:39:55.790Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I love the rest of this post but I agree with you here.</p>", "parentCommentId": "qvLDubJKdaASLXCJu", "user": null}, {"_id": "s8yyhPgxeGswGupBB", "postedAt": "2022-11-19T16:34:10.587Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>Thank you. Didn't know. Will change it to \"jump on them.\" Sorry friend.&nbsp;</p>", "parentCommentId": "brci25pjcXv3EhBg6", "user": {"username": "GoodEAGoneBad"}}, {"_id": "7AGj6GqSPEN9izyAY", "postedAt": "2022-11-20T02:38:14.432Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>As a moderator, I think a previous version of this comment was rude and clearly violated many <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_discourage__and_may_delete_\">Forum norms</a>. <a href=\"https://forum.effectivealtruism.org/posts/7ZjJ9w2xf7Mkdofk8/does-sam-make-me-want-to-renounce-the-actions-of-the-ea?commentId=E2pRCXnrpsavEA8zW\">Another comment</a> also violates Forum norms.</p><p>While I appreciate the edit, this is a warning, if you leave another comment like these, you will probably receive a ban.</p>", "parentCommentId": "E2pRCXnrpsavEA8zW", "user": {"username": "Lizka"}}, {"_id": "gjdyQgcRbaFMzWn9x", "postedAt": "2022-11-20T16:59:19.173Z", "postId": "7ZjJ9w2xf7Mkdofk8", "htmlBody": "<p>I didn't notice this comment and I think it's excellent. Thank you so much for sharing.&nbsp;</p>", "parentCommentId": "wiPSCtaqKggmZ8F7J", "user": {"username": "GoodEAGoneBad"}}]