[{"_id": "Lf5y2EyXdtAw5zpnj", "postedAt": "2022-11-24T13:14:32.228Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks so much for your awesome work!! :)&nbsp;</p><p>What is StrongMinds' room for more funding, and do you expect the cost-effectiveness of the marginal dollar (ie. additional funds) to be any worse than the average cost-effectiveness of StrongMinds?</p>", "parentCommentId": null, "user": {"username": "Lucas Lewit-Mendes"}}, {"_id": "gniYHYPwj6uCijss9", "postedAt": "2022-11-24T13:19:23.393Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Hey Sean, happy Thanksgiving!<br><br>I was wondering why StrongerMinds focuses on women. Is it because women especially suffer from depression, or maybe helping women has better downstream effects? Another reason?</p>", "parentCommentId": null, "user": {"username": "SamiM"}}, {"_id": "aThDQcw32pAHm962P", "postedAt": "2022-11-24T14:13:34.596Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>+1 for having an AMA!!</p><p>I wish more orgs will do this, seems super healthy to me</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "aQQPczov9cAWHqAnD", "postedAt": "2022-11-24T14:21:01.383Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>In EA Israel, many people are talking about using technology to make a scalable impact in mental health. Any chance you have \"generic advice\" here, such as \"common mistakes people make when looking for an idea for such a project\" ?</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "rKay3K9KCFZKhb4Yg", "postedAt": "2022-11-24T14:25:14.697Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Do you need:</p><ol><li>Software developers</li><li>Data Scientists / Machine Learning researchers</li></ol><p>?</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "Qj7KdudWhkAF3qqsN", "postedAt": "2022-11-24T14:32:46.758Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>You wrote:</p><blockquote><p>StrongMinds has now treated over 160,000 women with depression to date in Uganda and Zambia. On average, 80% of the women we treat remain depression-free six months after the conclusion of therapy.</p></blockquote><p>This sounds like you.. solved depression? And you did it in the extra challenging setting of working in Uganda and Zambia (!)</p><p>Can we import your methods to other countries, like even the U.S?</p><p>Is everyone doing therapy wrong and should instead learn from your programs?</p><p>(What am I missing? Are these questions wrong somehow?)</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "jgapHMCAmr5mgHcsb", "postedAt": "2022-11-24T19:34:54.480Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>I think it would be useful to know the percentage of women with depression who we would expect to be depression-free after a six month period without any intervention.&nbsp;</p>", "parentCommentId": "Qj7KdudWhkAF3qqsN", "user": {"username": "Sam Glover"}}, {"_id": "kM6TwxaHGdeviL8Zh", "postedAt": "2022-11-24T20:36:53.802Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks for your amazing work! I have two questions.</p>\n<ol>\n<li>\n<p>StrongMinds' work seems to suggest that depression in Uganda and Zambia is at least as treatment-responsive as depression in high-income countries, if not more. This is true despite your intervention being psychotherapeutic rather than improving income directly. How do we reconcile this with the intuition that economic conditions are very important in causing people's depressive experiences? Should we infer from this that economic conditions are not very important in causing depression?</p>\n</li>\n<li>\n<p>How does StrongMinds think about the Hawthorne effect - the possibility that clients feel obligated to report improvements in their health even if they don't feel them? My anecdotal observations of therapy in high-income contexts suggest that people feel like if they aren't being helped, then they must be the problem, so they report that therapy helps them in order to avoid being a burden. This seems like a challenge for measuring impact.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "6PYjJbk3zrzvr9b49", "postedAt": "2022-11-24T21:06:25.109Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>On (2): &nbsp;Here's the section on social desirability bias from HLI's <a href=\"https://www.happierlivesinstitute.org/report/strongminds-cost-effectiveness-analysis/\">cost-effectiveness analysis</a>.</p><blockquote><p>Haushofer et al., (<a href=\"https://www.nber.org/papers/w28106\">2020</a>), a trial of both psychotherapy and cash transfers in a LMIC, perform a test ‘experimenter demand effect’, where they explicitly state to the participants whether they expect the research to have a positive or negative effect on the outcome in question. We take it this would generate the maximum effect, as participants would know (rather than have to guess) what the experimenter would like to hear. Haushofer et al., (<a href=\"https://www.nber.org/papers/w28106\">2020</a>), found no impact of explicitly stating that they expected the intervention to increase (or decrease) self-reports of depression. The results were non-significant and close to zero (n = 1,545). We take this research to suggest social desirability bias is not a major issue with psychotherapy. Moreover, it’s unclear why, if there were a social desirability bias, it would be proportionally <i>more </i>acute for psychotherapy than other interventions. Further tests of experimenter demand effects would be welcome.&nbsp;</p><p>Other less relevant evidence of experimenter demand effects finds that it results in effects that are small or close to zero. Bandiera et al., (n =5966; <a href=\"http://eprints.lse.ac.uk/102465/1/womens_empowerment_in_action.pdf\">2020</a>) studied a trial that attempted to improve the human capital of women in Uganda. They found that experimenter demand effects were close to zero. In an online experiment Mummolo &amp; Peterson, (<a href=\"https://www.semanticscholar.org/paper/Demand-Effects-in-Survey-Experiments%3A-An-Empirical-Mummolo-Peterson/441c602068ed3a67262c07ff089d83bd6481044b\">2019</a>) found that “Even financial incentives to respond in line with researcher expectations fail to consistently induce demand effects.” Finally, in de Quidt et al., (<a href=\"https://www.semanticscholar.org/paper/Measuring-and-Bounding-Experimenter-Demand-Quidt-Haushofer/9f84b7fa1e9c9d6b403cb6f48d71eefe8dbbf1b0\">2018</a>) while they find experimenter demand effects they conclude by saying “Across eleven canonical experimental tasks we … find modest responses to demand manipulations that explicitly signal the researcher’s hypothesis… We argue that these treatments reasonably bound the magnitude of demand in typical experiments, so our … findings give cause for optimism.”</p></blockquote>", "parentCommentId": "kM6TwxaHGdeviL8Zh", "user": {"username": "BarryGrimes"}}, {"_id": "NEtHmWtSPQoaL8JtK", "postedAt": "2022-11-24T21:19:49.893Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>The experimenter demand test is quite reassuring! Although I disagree with the rest of that section, since I didn't have in mind a conventional social desirability bias. I disagree with the idea that psychotherapy is no different from other interventions in this regard - anecdotally, depressed people are much more sensitive than average to feeling like a burden and not wanting other people to worry about their problems.</p>\n", "parentCommentId": "6PYjJbk3zrzvr9b49", "user": {"username": "therealslimkt"}}, {"_id": "jQAbBSfRTJMbndaBh", "postedAt": "2022-11-24T21:37:35.163Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Can you give us a breakdown of the cost of treating each additional person?<br><br>E.g. &nbsp;70% salary for facilitator, 15% recruitment, 9% admin, ...</p>", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "ghqBzx9HmqqhufH2A", "postedAt": "2022-11-24T22:39:24.806Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>I’m glad this is (currently) the top-voted comment. I’ve reviewed the evidence StrongMinds offers up and find it relatively persuasive. But every page yells “offer this in wealthy countries and you’ll do good and do well at the same time.” A quick google suggests that the global ‘market’ for mental health is in the order of $400b. And this intervention seems significantly better than anything else currently in the market. Shouldn’t this be a multi-billion-dollar company being snapped up by pharma giants?&nbsp;</p><p>I guess that outcome seems so wild that it generates doubt about the original claim. I’d like to know the additional detail that contextualises that.&nbsp;</p>", "parentCommentId": "Qj7KdudWhkAF3qqsN", "user": {"username": "Greg S"}}, {"_id": "XXsZjaKoT8ezNdCjD", "postedAt": "2022-11-25T03:15:51.086Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Hi Sean!</p><p>I really admire what you do at StrongMinds, and I really think that mental health is a theme that isn't picked up on much but taking care of it can do a huge difference, like with what you do! This is really amazing work and it fills me with joy to see so many women getting access to the treatment they need to live happily (and the number that remains depression-free after getting treated, wow!). &nbsp;I have a few questions :)</p><ol><li>How did you work during the pandemic? I imagine it wasn't easy to do group psychotherapy in a context of social distancing and less interpersonal connections.</li><li>Have you noticed a difference between pre-pandemic and post-pandemic depression? My own personal impression - but I &nbsp;believe the mental health crisis we live in currently is, in part, because of a decay in interpersonal relationships. Is the treatment even more effective because once having the group therapy these women have the whole group as a support network?</li><li>As a person who has had depression, I know it is very difficult to ask for help at the beginning, how do you convince these women to access treatment? How taboo is talking about mental health in Uganda and Zambia? Are there cultural differences you considered when developing the program?</li><li>I an engineering undergrad living in Chile, where 1/4 of our population has mental health illnesses such as depression and anxiety and a really poor access to treatment. What advice would you give to someone who wants to work in this area? Do you know of other effective interventions in mental health, especially for students?</li></ol><p>Thanks so much for the AMA! :)&nbsp;</p>", "parentCommentId": null, "user": {"username": "riadeane"}}, {"_id": "QW9TwxamTn6kALxfH", "postedAt": "2022-11-25T12:54:34.933Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Hi Sean, thanks for doing this, StrongMinds sounds very cool! I have two questions:&nbsp;</p><ul><li>How does group therapy compare to 1:1 on treatment effectiveness? I understand group therapy is more <i>cost-effective</i> &nbsp;in aggregate but am interested to know what the average effect of moving from 1:1 therapy to group therapy is on patient outcomes.&nbsp;</li><li>&nbsp;I live in Uganda and buy SSRIs without a prescription for around 600-800 Ush (15-20c) per tablet. Based on purely anecdotal evidence they seem pretty underutilised here. Obviously not all SSRIs work for all people and there are side effects, so distributing SSRIs isn't directly comparable to the StongMinds model, but I'd be interested to hear whether you consider distribution of SSRIs to people who meet the clinical definition for depression to be cost effective?</li></ul>", "parentCommentId": null, "user": {"username": "harriet"}}, {"_id": "q93W3HA7bixLApELo", "postedAt": "2022-11-27T13:42:16.933Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Many thanks for doing this AMA!</p><p>I'm personally excited about more work in the EA space on topics around mental health and subjective well-being, and was initially excited to see StrongMinds (SM) come so strongly recommended. I do have a few Qs about the incredible success the pilots have shown so far:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefo3xithndp8d\"><sup><a href=\"#fno3xithndp8d\">[1]</a></sup></span></p><ol><li>I couldn't find number needed to treat (NNT)<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreffx2zv9acmt7\"><sup><a href=\"#fnfx2zv9acmt7\">[2]</a></sup></span>&nbsp;figures anywhere (please let me know if I've missed this!), so I've had a rough go based on the published results, and <strong>came to an NNT of around 1.35</strong>.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefk42qssy1tfm\"><sup><a href=\"#fnk42qssy1tfm\">[3]</a></sup></span>&nbsp;Limitations of the research aside, this suggests StrongMinds is among the most effective interventions in all of medicine in terms of achieving its stated goals.<ol><li>If later RCTs and replications showed much higher NNT figures, what do you think would be the most likely reason for this? For comparison:&nbsp;<ol><li>This <a href=\"https://doi.org/10.1176/appi.ajp.2015.15091141\">meta-analysis</a> suggests an <a href=\"https://ajp.psychiatryonline.org/doi/10.1176/appi.ajp.2015.15091141#F1:~:text=number%20needed%20to%20treat%3D3\">NNT of 3</a> when comparing IPT to a control condition;</li><li>This <a href=\"https://doi.org/10.1371/journal.pone.0019044\">systematic review</a> suggests an <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0019044#s4:~:text=The%20number%20needed%20to%20treat%20to%20obtain%20one%20extra%20patient%20with%20remission%20is%20about%20four%20patients\">NNT of 4</a> for interpersonal therapy (IPT) compared to treatment as usual<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefrg5rognxb8k\"><sup><a href=\"#fnrg5rognxb8k\">[4]</a></sup></span>;</li><li>This <a href=\" https://doi.org/10.1111/acps.13335\">meta-analysis </a>suggests a <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/acps.13335#:~:text=The%20overall%20response%20rate%20in%20psychotherapies%20at%202%20(%C2%B11)%C2%A0months%20after%20baseline%20was%2041%25\">response rate of 41%</a> and an <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/acps.13335#:~:text=The%20NNT%20for%20therapy%20versus%20CAU%20was%205.3%20and%20versus%20waitlist%203.9\">NNT of 4</a> when comparing therapy to 'waitlist' conditions (and lower when only considering IPT in subgroup analyses); or&nbsp;</li><li>this <a href=\"https://doi.org/10.1017/S0033291713000457\">meta-analysis</a> which suggests an <a href=\"https://www.cambridge.org/core/journals/psychological-medicine/article/abs/comparison-of-psychotherapies-for-adult-depression-to-pill-placebo-control-groups-a-metaanalysis/A446D5F6307B178C77ACACACEB24E0C7#:~:text=This%20effect%20size%20corresponds%20to%20a%20number%20needed%20to%20treat%20(NNT)%20of%207.14\">NNT of 7</a> when comparing psychotherapies to placebo pill.</li></ol></li><li>Admittedly, there are many caveats here - the various linked studies aren't a perfect comparison to SM's work, NNT clearly shouldn't be used as sole basis for comparison between interventions, and I haven't done enough work here to feel super confident about the quality of SM's research. But my initial reaction upon skimming and seeing response to treatment in the range of 94-99%, or <strong>100+ people </strong>with PHQ-9 scores of over 15 basically all dropping down to 1-4<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefhgvx6n2kjd7\"><sup><a href=\"#fnhgvx6n2kjd7\">[5]</a></sup></span>&nbsp;(edit: an <a href=\"https://forum.effectivealtruism.org/posts/82heDPsmvhThda3af/ama-sean-mayberry-founder-and-ceo-of-strongminds#:~:text=we%20saw%20an%20average%20difference%20of%2012%20pts%20after%20the%20conclusion%20of%20therapy\">average improvement of 12 points </a>after conclusion of therapy) after 12-16 weeks of group IGT by lay counsellors was that <strong>this seemed far \"too good to be true\"</strong>, <strong>and fairly incongruent with ~everything I've learnt or anecdotally seen in clinical practice about the effectiveness of mental health treatments </strong>(though clearly I could be wrong!). This is especially surprising given SM dropped the group of participants with minimal or mild depression from the analysis.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdw1o0e4dufa\"><sup><a href=\"#fndw1o0e4dufa\">[6]</a></sup></span></li><li>Were these concerns ever raised by the researchers when writing up the reports? Do you have any reason to believe that the Ugandan context or something about the SM methodology makes your intervention many times more effective than basically any other intervention for depression?<br>[Edit: I note that the 99% figure in the phase 2 trial was disregarded, but the 94% figure in phase 1 trial wasn't, despite presumably the same methodology? Also curious about the separate analysis that came to 92%, which states: \"Since this impact figure was collected at a regular IPT group meeting, as had been done bi-weekly throughout the 12- week intervention, it is unlikely that any bias influenced the figure.\" I don't quite understand how collection at a regular IPT group meeting makes bias unlikely - could you clarify this? Presumably participants knew in advance how many weeks the intervention would be?]</li></ol></li><li>How did you come to the 10% figure when adjusting for social desirability bias?</li><li><strong>Was there a reason an RCT couldn't have been done as a pilot</strong>? Just noting that \"informal control populations were established for both Phase 1 and Phase 2 patients, consisting of women who screened for depression but did not participate\", and the control group in both the pilots were only 36 people, compared to the 244 and 270 in the treatment arm for phase 1 and phase 2 respectively. As a result, <strong>11 / 24 of the villages where the interventions took place did not have a control arm at all.</strong> (<a href=\"https://strongminds.org/wp-content/uploads/2013/07/StrongMinds-Phase-Two-Impact-Evaluation-Report-July-2015-FINAL.pdf\">pg 9</a>)</li><li>Are you happy to go into a bit more detail about the background of the lay counsellors? E.g. what they know prior to the SM pilots, how much training (in number of hours) they receive, and who runs it (what relevant qualifications / background? How did the trainers get their IPT-G certification - e.g. is this a postgrad psychology qualification, or a one-off training course?) I briefly skimmed the <a href=\"https://strongminds.org/wp-content/uploads/2013/07/StrongMinds-Phase-Two-Impact-Evaluation-Report-July-2015-FINAL.pdf\">text (appendix A + E) </a>but also got a bit confused over the difference between \"lay counsellor\", \"mental health facilitator\", \"mental health supervisor\" and \"senior technical advisor\" and how they're relevant for the intervention.</li><li>Can you give us a cost breakdown of $170 / person figure for delivering the programme (Or $134 for 2021)? &nbsp;See Joel's <a href=\"https://forum.effectivealtruism.org/posts/82heDPsmvhThda3af/ama-sean-mayberry-founder-and-ceo-of-strongminds?commentId=cycXp325dBKpheLuM\">response </a>and subsequent discussion for more details. Specifically, whether the methodology for working out the cost / client by dividing total clients reached over SM's total expenses means that this includes the clients reached by the partners, but not their operating costs / expenses. For example,<strong> ~48% of clients were treated through partners in 2021, and </strong><a href=\"https://strongminds.org/wp-content/uploads/2022/09/2022-Q2-report-8.5x11-FINAL.pdf\"><strong>Q2 results (pg 2) </strong></a><strong>suggest StrongMinds is on track for ~79% of clients treated through partners in 2022.</strong><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreffojpvzkotvi\"><sup><a href=\"#fnfojpvzkotvi\">[7]</a></sup></span>&nbsp;Or are all expenses of SM partners covered by SM and included in the tax returns?</li><li>In the most recent <a href=\"https://strongminds.org/wp-content/uploads/2017/07/strongminds-phase-1-and-2-follow-up-evaluations_final.pdf\">publication (pg 5)</a>, published 2017, the report says: \"Looking forward, StrongMinds will continue to strengthen our evaluation efforts and will continue to follow up with patients at 6 or 12 month intervals. <strong>We also remain committed to implementing a much more rigorous study, in the form of an externally-led, longitudinal randomized control trial, in the coming years.</strong>\"<ol><li>Have either the follow-up or the externally-led longitudinal RCT happened yet? If so, are the results shareable with the public? (I note that there has been a qualitative study done on a teletherapy version published in 2021, but no RCT.)</li></ol></li><li>The pivot to teletherapy in light of COVID makes sense, though the evidence-base for its effectiveness is ?presumably weaker.<ol><li>What's the breakdown of % clients reached via teletherapy versus clients reached via group IGT as per the original pilots (i.e. in person)</li><li>In the <a href=\"https://strongminds.org/wp-content/uploads/2022/06/Teletherapy-Qualitative-Results-Report.pdf\">2021 report on a qualitative assessment of teletherapy (pg 2)</a>, it says: \"Data from StrongMinds shows that phone-based IPT-G is as effective as in-person group therapy in reducing depression symptoms among participants\". Is this research + methodology available to the public? (I searched for phone and telehealth in the other 4 reports which returned no hits)</li><li>Does StrongMinds have any other unpublished research?</li><li>What's the plan with telehealth going forward? Was this a temporary thing for COVID, or is this a pivot into a more / similarly effective approach?</li></ol></li><li>I also saw in the <a href=\"https://www.happierlivesinstitute.org/report/strongminds-cost-effectiveness-analysis/#:~:text=A%20further%20note%20is%20that%20they%20defined%20treatment%20as%20attending%20more%20than%20six%20sessions%20(out%20of%2012)%20for%20face%2Dto%2Dface%20modes%20and%20more%20than%20four%20(out%20of%208)%20for%20teletherapy.\">HLI report</a> that SM defines treated patients treated for purpose of cost analysis as \"attending more than six sessions (out of 12) for face-to-face modes and more than four (out of 8) for teletherapy.\" - is this also the definition for the treatment outcomes? i.e. <strong>how did SM assess the effectiveness of SM for people who attended 7 sessions and then dropped out? </strong>Do we have more details around about how many people didn't do all sessions, how they responded, and how this was incorporated into SM's analyses?</li></ol><p>&nbsp;Thanks again!</p><p>&nbsp;</p><p>(Commenting in personal capacity etc)</p><p>&nbsp;</p><p>[Edited after Joel's response to include Q7, Q8, and an update to Q1c and Q5, mainly to put all the unresolved Qs in one place for Sean and other readers' convenience.]</p><p>[Edited to add this <a href=\"https://forum.effectivealtruism.org/posts/82heDPsmvhThda3af/ama-sean-mayberry-founder-and-ceo-of-strongminds#:~:text=I%20should%20say,is%20really%20great.\">disclaimer</a>.]</p><p>[Edited to include a link to a newer post <a href=\"https://forum.effectivealtruism.org/posts/ffmbLCzJctLac3rDu/strongminds-should-not-be-a-top-rated-charity-yet\"><i>StrongMinds should not be a top-rated charity (yet)</i></a>, which includes additional discussion.]</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fno3xithndp8d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefo3xithndp8d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Apologies in advance if I've missed anything - I've only briefly skimmed your website's publications, and I haven't engaged with this literature for quite a while now!</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnfx2zv9acmt7\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreffx2zv9acmt7\">^</a></strong></sup></span><div class=\"footnote-content\"><p><a href=\"https://www.cebm.ox.ac.uk/resources/ebm-tools/number-needed-to-treat-nnt\">Quick primer on NNT</a> for other readers. Lower = better, where NNT = 1 means your treatment gets the desired effect 100% of the time.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnk42qssy1tfm\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefk42qssy1tfm\">^</a></strong></sup></span><div class=\"footnote-content\"><p>SM's <a href=\"https://strongminds.org/wp-content/uploads/2017/07/strongminds-phase-1-and-2-follow-up-evaluations_final.pdf\">results </a>of 95% depression-free (85% after the 10% adjustment for social desirability bias) give an EER of 0.15 after adjustment.&nbsp;By a more conservative estimate, based on this <a href=\"https://strongminds.org/wp-content/uploads/2013/07/StrongMinds-Phase-Two-Impact-Evaluation-Report-July-2015-FINAL.pdf\">quote (pg 3)</a>: \"A separate control group, which consisted of depressed women who received no treatment, experienced a reduction of depressive symptoms in only 11% of members over the same 12-week intervention period\" and assuming all of those are clinically significant reductions in depressive symptoms, the &nbsp;CER is 0.89, which gives an <strong>NNT of 1 / (0.89 - 0.15) = 1.35</strong>. The EER can be adjusted upwards because not all who started in the treatment group were depressed, but this is only 2% and 6% for phase 1 and 2 respectively - so in any case the NNT is unlikely to go much higher than 1.5 even by the most conservative estimate.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnrg5rognxb8k\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefrg5rognxb8k\">^</a></strong></sup></span><div class=\"footnote-content\"><p>They also concluded: \"We did not find convincing evidence supporting or refuting the effect of interpersonal psychotherapy or psychodynamic therapy compared with ‘treatment as usual’ for patients with major depressive disorder. The potential beneficial effect seems small and effects on major outcomes are unknown. Randomized trials with low risk of systematic errors and low risk of random errors are needed.\"</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnhgvx6n2kjd7\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefhgvx6n2kjd7\">^</a></strong></sup></span><div class=\"footnote-content\"><p>See <a href=\"https://strongminds.org/wp-content/uploads/2013/07/StrongMinds-Phase-Two-Impact-Evaluation-Report-July-2015-FINAL.pdf\">Appendix B, pg 30</a>. for more context about what the PHQ-9 scoring is like.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndw1o0e4dufa\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdw1o0e4dufa\">^</a></strong></sup></span><div class=\"footnote-content\"><p>As pointed out in <a href=\"https://strongminds.org/wp-content/uploads/2013/07/StrongMinds-Phase-Two-Impact-Evaluation-Report-July-2015-FINAL.pdf\">the report (pg 9)</a>:</p><blockquote><p>A total of 56 participants with Minimal or Mild Depression (anyone with total raw scores between 1-9) at baseline in both the treatment intervention (46 participants) and control (10 participants) groups were dropped from the GEE analysis of determining the depression reduction impact. In typical practice around the world, individuals with Minimal/Mild Depression are not considered for inclusion in group therapy because their depressive symptoms are relatively insignificant. StrongMinds consciously included these Minimal/Mild cases in Phase Two because these patients indicated suicidal thoughts in their PHQ-9 evaluation. However, their removal from the GEE analysis serves to ensure that the Impact Evaluation is not artificially inflated, since reducing the depressive symptoms of Minimal/Mild Depressive cases is generally easier to do.</p></blockquote></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnfojpvzkotvi\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreffojpvzkotvi\">^</a></strong></sup></span><div class=\"footnote-content\"><p>% clients reached by partners:</p><p>20392 / 42482 in 2021<br>33148 / (33148+8823) in 2022</p></div></li></ol>", "parentCommentId": null, "user": {"username": "bruce"}}, {"_id": "XDvTkhbSH3afK9PML", "postedAt": "2022-11-28T17:53:42.754Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>There's a sister org working on it <a href=\"https://www.strongmindsamerica.org/about-depression.html\">About Depression - StrongMinds America</a></p>", "parentCommentId": "Qj7KdudWhkAF3qqsN", "user": {"username": "Peter Gebauer"}}, {"_id": "9TFM7kyWLHamAEqfh", "postedAt": "2022-11-29T18:32:53.237Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Hi Yonatan. Thanks for the questions. I wouldn't quite say we solved it, but we have found a solution that has had tremendous results in Uganda and Zambia. There are probably a few reasons for this. &nbsp;Most of the communities we work in are very close-knit and interpersonal, so the group talk therapy model of IPT-G works well. Additionally, around 85% of women in sub-Saharan Africa don't have access to quality mental health care. There is a huge treatment gap, for instance, Uganda has approximately 30 trained psychiatrists serving a population of 45M, so we are also filling a dire need by providing these free services using lay community health workers. The symptoms of depression are still not commonly known in Uganda and Zambia, and many people think they are just fatigued, sick, or just unmotivated/lazy, so discovering that there is a way to treat their symptoms and that there are other people experiencing this too is life-changing. Many women in therapy groups form a bond and continue to meet long after therapy ends. They now have a new support system and are no longer isolated. All of these factors play a role in our success.&nbsp;</p><p>The program model can be replicated in other geographical locations, and <a href=\"https://psychnews.psychiatryonline.org/doi/10.1176/appi.pn.2021.5.4\">IPT has been shown to work well cross-culturally.</a> We are currently exploring<a href=\"https://www.strongmindsamerica.org/\"> an American pilot </a>where the need is also extreme in underserved BIPOC communities. Our pilot is happening in the Newark, NJ area just outside of NYC. That said, we have to do quite a bit of work to determine how western preferences fit into this, and we are collecting data from some initial groups now.&nbsp;</p><p>StrongMinds therapy model is based on an RCT from 2002 in Uganda. It has shown to be a highly effective way to reach women in underserved and remote areas that would otherwise not have access to mental health treatment options. &nbsp;</p>", "parentCommentId": "Qj7KdudWhkAF3qqsN", "user": {"username": "Sean Mayberry"}}, {"_id": "BLFBzjdJk8aJ4WKoe", "postedAt": "2022-11-29T19:38:31.445Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Greg S- I wish we had 400B at our fingertips because I can only imagine what impact we could have. In all honesty, our model is very low-tech. There are no apps or fancy gadgets. We also don't use prescription medicine (which may be why a pharma company has yet to snap us up!) Finally, the women we treat mostly live on less than $2 a day, so they aren't in an income bracket that many investors might want as consumers. While apps, tech, and pharmaceutical partnerships receive considerable funds, mental health in low and middle-income countries trying to help with poverty reduction is not heavily funded. Yearly global costs from mental, neurological, and substance use disorders are estimated at <a href=\"https://www.worldbank.org/en/topic/universalhealthcoverage\">between $2.5 and $8.5 trillion dollars</a> a year. That figure is projected to nearly double by 2030. Mental health is still frequently overlooked in health budgets. Most African governments devote less than 1% of their budgets to mental health services.&nbsp;</p><p>You raise a good point, though, to which we have given a little thought. Is there space to look at our model and make it self-sustainable and profitable? We would never consider this with our current clients, but is there room to have a for-profit arm that funds the non-profit, or should we consider a franchise model? We constantly push ourselves beyond what is comfortable, and we've had some early discussions. While I have no answers, I wanted to flag that we had considered new and different ways to fund our work.&nbsp;</p>", "parentCommentId": "ghqBzx9HmqqhufH2A", "user": {"username": "Sean Mayberry"}}, {"_id": "FaPdfJsCtp2xoaa3H", "postedAt": "2022-11-29T19:48:25.161Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Sam Glover- We looked at this with a control study and found that a statistically significant number of women were depression-free after completing StrongMinds therapy versus those that received no treatment. Additionally, using the PHQ-9 (an international standardized tool to assess depression), we saw an average difference of 12 pts after the conclusion of therapy. To contextualize that, in western countries, a change of 4 pts is considered significant in terms of depression recovery.&nbsp;</p>", "parentCommentId": "jgapHMCAmr5mgHcsb", "user": {"username": "Sean Mayberry"}}, {"_id": "pqSkAzGjxxYH2DMrk", "postedAt": "2022-11-29T19:51:11.871Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thank you! We try to be open to challenging questions at StrongMinds. It's part of our culture, and we think asking tough questions can lead to better results.&nbsp;</p>", "parentCommentId": "aThDQcw32pAHm962P", "user": {"username": "Sean Mayberry"}}, {"_id": "joY7GZR93CGgiGasN", "postedAt": "2022-11-29T20:23:37.155Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks for your kind words and for the great questions!</p><ol><li>The relationship between poverty and mental health disorders, including depression, is complex. Poverty exacerbates depression, and depression, alongside other mental health disorders, can drive people further into poverty through reduced productivity, decreased income, and isolation. (<a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(11)60754-X/fulltext\">Lund et al. 2011</a>) But it is incorrect to conclude that poverty on its own causes depression. If it did, we would see rates of depression at 100% rather than 25% in the slums of Kampala. Our model looks at four distinct triggers for depression: grief, life changes, loneliness/isolation, and conflict. Interestingly, we see from our well-being indicators that many times, restoring a woman's mental health can increase her productivity and livelihood; for instance, 16% of our former clients reported increases in work attendance after the conclusion of therapy.&nbsp;</li><li>Yes, in self-reported data, we have to be very careful to ensure we measure correctly and there aren't existing biases or misrepresentations. We work directly with an external firm to help with this. They conduct our endline evaluations. As mentioned above, we also look at well-being indicators to help demonstrate our impact, such as a 13% increase in family food security, a 30% increase in school attendance, and a 28% increase in women feeling socially connected.&nbsp;</li></ol>", "parentCommentId": "kM6TwxaHGdeviL8Zh", "user": {"username": "Sean Mayberry"}}, {"_id": "KwuiTiWKLvcQ3aeur", "postedAt": "2022-11-29T21:37:48.951Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Both are true! Numerous studies have shown that when you help an African Mom, the downstream effects are significantly more substantial. Globally, women have a <a href=\"https://blogs.worldbank.org/health/her-burden-bear-women-aging-and-depression\">depression rate of 1.5 times higher than that of men</a>. An African woman with depression, compared with her healthy peers, suffers greatly: she is less productive, &nbsp;has a lower income, &nbsp;and has poorer physical health. If she is a Mother, the negative impact extends to her entire family. Research shows that children of depressed Mothers are more likely to have poor health, &nbsp;struggle in or miss school, and suffer from depression themselves.&nbsp;</p><p>Furthermore, because depression impairs the ability to focus and concentrate, depression sufferers do not respond to health initiatives or livelihood trainings, rendering these programs less effective.&nbsp;</p><p>This impaired ability to function in day-to-day life creates profound hardship in Uganda and Zambia, &nbsp;where life is community-centered and reliant on each person fulfilling her role and where depression carries a great stigma. When a woman cannot perform her social responsibilities, she can become a target of criticism and social exclusion. Women in these communities also often have far less access to resources.&nbsp;</p>", "parentCommentId": "gniYHYPwj6uCijss9", "user": {"username": "Sean Mayberry"}}, {"_id": "ZK3EJR8s24oyq6xA4", "postedAt": "2022-11-29T22:34:47.614Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<blockquote>\n<p>Poverty exacerbates depression, and depression, alongside other mental health disorders, can drive people further into poverty through reduced productivity, decreased income, and isolation. (Lund et al. 2011) But it is incorrect to conclude that poverty on its own causes depression. If it did, we would see rates of depression at 100% rather than 25% in the slums of Kampala.</p>\n</blockquote>\n<p>What I was wondering about was not the prevalence of depression, but rather how treatable it is. For the reasons you described of poverty exacerbating mental health, it seems like depression should be much less treatable in Kampala than in the US. Yet SM's success rate indicates that depression is at least as treatable and possibly more treatable than depression in the US. Those are the two things that I struggle to reconcile.</p>\n<p>Measurement of other well-being indicators is a great corroboration of your results.</p>\n", "parentCommentId": "joY7GZR93CGgiGasN", "user": {"username": "therealslimkt"}}, {"_id": "cycXp325dBKpheLuM", "postedAt": "2022-11-29T22:37:05.400Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>I can maybe help with question 5, since the $170 figure originates from <a href=\"https://forum.effectivealtruism.org/posts/mY4pZSwvFCDsjorJX/donating-money-buying-happiness-new-meta-analyses-comparing\">my analysis</a>.&nbsp;</p><p>I finalized the cost figures during COVID when their cost figures were very high ($400 per person). I tried to project what they'd be over the next 3 years (starting in 2020) and assumed it'd come down, but the costs have come down faster than I imagined. They now say they expect 2022 to cost 105 USD per person treated.&nbsp;</p><p>They regularly update their cost and expense figures in their <a href=\"https://strongminds.org/wp-content/uploads/2022/06/2022-Q1-report-8.5x11-FINAL.pdf\">quarterly reports</a>.&nbsp;</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_95 95w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_175 175w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_255 255w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_335 335w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_415 415w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_495 495w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_575 575w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_655 655w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/35d0d22a4932910f237501fa5bedbaac0df3d33f96d4515b.png/w_735 735w\"></figure><p>&nbsp;</p><p>And here's the general breakdown of their expenses according to their <a href=\"https://strongminds.org/wp-content/uploads/2022/07/2021-990.pdf\">2021 tax returns</a> (page 10).&nbsp;</p><p><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png\" alt=\"PastedGraphic-1.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_80 80w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_160 160w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_240 240w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_320 320w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_400 400w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_480 480w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_560 560w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6a3e9b8f85488cb471a1ad510c06e1ff6cbb57fcd96bf943.png/w_640 640w\"></p>", "parentCommentId": "q93W3HA7bixLApELo", "user": {"username": "JoelMcGuire"}}, {"_id": "oq3DA69CPa6S2qRtr", "postedAt": "2022-11-29T23:19:15.516Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks for this Joel!</p><p>RE: Q5 - sorry, just to clarify, I was interested in a breakdown of the $170 figure (or the 109 / 134/ 79 figure in the cost-per-patient graph). What does it consist of?</p><p>On skimming the <a href=\"https://www.happierlivesinstitute.org/report/strongminds-cost-effectiveness-analysis/#:~:text=5.-,Cost%20of%20StrongMind%E2%80%99s%20core%20programme,-We%20are%20interested\">HLI report</a> it says:&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefnif44hbyoy\"><sup><a href=\"#fnnif44hbyoy\">[1]</a></sup></span></p><blockquote><p>StrongMinds records the average cost of providing treatment to an additional person (i.e. total annual expenses / no. treated) and has shared the most recent figures for each programme with us.</p></blockquote><p>But I'm interested in something more fine-grained than \"total annual expenses, or even \"program service expenses\" (per tax returns). e.g.:<br>$A to train lay counsellors<br>$B / hour for facilitators * number of hours<br>$C operating costs for StrongMinds (SM)<br>$D for outreach to SM partners<br>$E for SM partner operating costs<br>etc</p><p>I'm mindful this is asking a lot of info, sorry! I just assumed it'd be readily available, but it looks like you've just deferred to SM here.</p><p>I had a very brief look through the tax returns - per the tax returns you linked, the total expenses for 2021 come to 5,186,778. Per the quarterly report you linked, the total clients reached in 2021 was 42482. This means the $ per client figure should be $122? But that's not the $134 figure reported, so I'm probably doing something wrong here.</p><p><strong>Also, ~48% of clients were treated through partners in 2021, but does the methodology of working out cost effectiveness by dividing clients reached by SM expenses include expenses and operating costs of the partners? </strong><a href=\"https://strongminds.org/wp-content/uploads/2022/09/2022-Q2-report-8.5x11-FINAL.pdf\"><strong>Q2 results (pg 2) </strong></a><strong>suggest StrongMinds is on track for ~79% of clients treated through partners in 2022. If the expenses of the partners aren't covered by SM but the clients reached are then this will make SM look more cost-effective than it is.</strong></p><p>I also saw in the <a href=\"https://www.happierlivesinstitute.org/report/strongminds-cost-effectiveness-analysis/#:~:text=A%20further%20note%20is%20that%20they%20defined%20treatment%20as%20attending%20more%20than%20six%20sessions%20(out%20of%2012)%20for%20face%2Dto%2Dface%20modes%20and%20more%20than%20four%20(out%20of%208)%20for%20teletherapy.\">HLI report</a> that SM defines treated patients treated here as \"attending more than six sessions (out of 12) for face-to-face modes\" - is this also the definition for the treatment? i.e. <strong>how did the pilot assess the effectiveness of SM for people who attended 7 sessions and then dropped out?</strong></p><p>Do you know the answers to the other Qs too? If so, I'd be interested in your take as well! But also no worries if you prefer to leave it to Sean (I've edited the <a href=\"https://forum.effectivealtruism.org/posts/82heDPsmvhThda3af/ama-sean-mayberry-founder-and-ceo-of-strongminds?commentId=q93W3HA7bixLApELo\">comment</a> above to incorporate these Qs).</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnnif44hbyoy\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefnif44hbyoy\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Sorry if I missed it, I just ctrl+F'ed 170 in the <a href=\"https://forum.effectivealtruism.org/posts/mY4pZSwvFCDsjorJX/donating-money-buying-happiness-new-meta-analyses-comparing\">forum post</a> you linked which didn't give me a result, so I skimmed section 5 in the full HLI report. I also looked at the Q report and the tax returns but it doesn't quite answer the question.</p></div></li></ol>", "parentCommentId": "cycXp325dBKpheLuM", "user": {"username": "bruce"}}, {"_id": "a4txJErFeBQyDawEN", "postedAt": "2022-11-30T04:06:44.315Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>I suggest doing your research (the information we received from the researchers who conducted the initial John Hopkins/Columbia University RCT was instrumental to our success.) Also, know your audience. We try to consider each woman in our therapy program's perspective. How did she hear about us? How is she accessing information about the program? The more demographic information you have about your audience, the better you can target your outreach/messaging and achieve results. Other considerations are what staffing is needed to make the product or tech run? And what frameworks need to be in place? We had to do a lot of this evaluation ourselves when switching our model to teletherapy during the pandemic. The model, resources, and modes of communication available will all have a huge impact on the specific strategy.&nbsp;</p>", "parentCommentId": "aQQPczov9cAWHqAnD", "user": {"username": "Sean Mayberry"}}, {"_id": "FBpNyStrALtfkGEit", "postedAt": "2022-11-30T04:19:03.327Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks for the question! We decided to start the StrongMinds programming in Uganda because <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1525093/\">the initial RCT </a>had such positive results there. We wanted to see if we could replicate those findings and reach even more women. I also had some experience there in my prior work as a diplomat and through my work with other NGOs. My family and I lived just across the border in the Democratic Republic of Congo for over four years, so I have many friends and connections in sub-Saharan Africa and have seen the dire need for treatment options and the consequences of untreated depression there firsthand.&nbsp;</p>", "parentCommentId": "eb4Lg6FtodkJJ9iYu", "user": {"username": "Sean Mayberry"}}, {"_id": "KjC5Zhes89xGAZKiN", "postedAt": "2022-11-30T04:56:14.906Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks so much for your kind words and for following our work! I appreciate your comment about the incredible impact mental health can have. We've certainly seen it change women's lives far beyond what we could have predicted, such as helping a woman's children eat more meals a day or even helping individuals with HIV adhere to their antiretroviral treatments more regularly.&nbsp;</p><ol><li>We completely switched to a teletherapy model during the COVID-19 lockdowns in Uganda and Zambia, which required a lot of creative thinking on a short timeline. This made it somewhat tricky to reach our target demographic since many women share a phone with their family or neighbors (and some don't own a phone at all.) Fortunately, the depression-free rates were comparable to in-person group therapy, and some ultimately preferred the flexibility it offered. We usually work in communities, offering therapy directly where the women live to make access easy (our motto was often to diagnose on a doorstep, treat under a tree.) We had to reach new clients using things like radio ads, social media, and a mental health WhatsApp-based chatbot to help ensure resources were available as often as needed. You can read more about our key learnings from the COVID-19 pandemic<a href=\"https://strongminds.org/wp-content/uploads/2020/07/COVID-19-MENTAL-HEALTH-WHITE-PAPER.pdf\"> here</a>.&nbsp;</li><li>Like most in the mental health field, we saw a sharp increase in the need for services, particularly during the lockdowns. Unfortunately, since then, we have seen other climate-related humanitarian crises causing things like flooding and drought, undoubtedly worsening mental health conditions. Additionally, Uganda currently has some Ebola lockdowns in place, stressing already thinned health resources. StrongMinds has made ourselves available to support in these cases. We know mental health care is critical during high-stress times, and rates are only projected to increase in the coming decades. The good news, though, is, as you've eloquently stated, the interpersonal nature of group talk therapy enhances outcomes. We've seen that 72% of former clients we spoke to in Uganda were still in touch with their group mates. This extends years later in many cases.&nbsp;</li><li>Absolutely! I've often said that the hardest part of our job is finding depressed individuals and getting them into a group. Depression can make simply getting out of bed a challenge, so this can be tricky. The group model works well to help with this scenario, though, because group members can hold each other accountable and check in on each other. Uganda and Zambia still have many stigmas associated with mental health, so advocacy and psychoeducation are critical to our work in-country. You can read more about the complete therapy assessment process and how we work to educate about mental health <a href=\"https://www.psychologytoday.com/us/blog/global-events/202109/they-called-me-lazy-addressing-depression-stigma-in-uganda\">here in this Psychology Today article</a> by our talented Uganda Country Director/Clinician, Tina Ntulo.&nbsp;</li><li>Similarly, a small door-to-door study led by StrongMinds in Mukono District, Uganda, estimated that the prevalence of moderate to severe depression in adult women was about 20%. We also have about 85% of individuals with no access to other forms of treatment. IPT works particularly well in these settings and is currently<a href=\"https://www.who.int/publications/i/item/WHO-MSD-MER-16.4\"> a WHO-recommended first-line treatment </a>for depression in low-resource settings. Other forms of community-based models using a rights-based approach are a great way to empower individuals to seek recovery and focus on the value of human rights within the mental health space.&nbsp;</li></ol>", "parentCommentId": "XXsZjaKoT8ezNdCjD", "user": {"username": "Sean Mayberry"}}, {"_id": "z7pSs2opRy2tdm2gj", "postedAt": "2022-11-30T15:03:22.557Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>StrongMinds seeks to treat 300,000 women and adolescents between 2022 through 2024. To do that, we need to raise $30M U.S. dollars. To date, we've raised about $13M, which leaves us at a shortfall of $17M. So there is lots of room for more funding!</p><p>In 2022 we expect the cost to treat one patient will be $105 USD. By the end of 2024, we anticipate the cost per patient will have decreased to just $85. We will continue to reduce the cost of treating one woman even while our numbers increase. This is through effective scaling and continuing to evaluate where we can gain more cost savings. A donation to StrongMinds will be used as effectively and efficiently as possible. And when you think about what it costs for therapy in the United States, to spend just $105 and treat a woman for depression is a pretty incredible feat.&nbsp;</p>", "parentCommentId": "Lf5y2EyXdtAw5zpnj", "user": {"username": "Sean Mayberry"}}, {"_id": "AtwZ9qG3WobuQauTq", "postedAt": "2022-11-30T15:10:20.901Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Currently, StrongMinds is actively looking to hire for a few positions listed <a href=\"https://strongminds.org/job-vacancies/?swcfpc=1\">here</a>. We are growing and are always looking for smart, ambitious, and creative people to join our team. We encourage everyone to follow us on <a href=\"https://www.linkedin.com/company/makestrongminds/\">LinkedIn</a> for our most up-to-date job openings. At this time, we currently do not use volunteers.&nbsp;</p>", "parentCommentId": "rKay3K9KCFZKhb4Yg", "user": {"username": "Sean Mayberry"}}, {"_id": "hkpQAzwHonvqZJEuh", "postedAt": "2022-11-30T15:49:00.805Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Hi, harriet! Thanks for the questions! Yes, there are advantages and disadvantages to both individual and group therapy, and as you mentioned, cost certainly favors the group model. We can offer a woman an entire course of treatment for $105. In terms of patient outcomes, StrongMinds doesn't utilize individual therapy, but <a href=\"https://pubmed.ncbi.nlm.nih.gov/30849287/\">some studies have shown that effectiveness overall is pretty similar</a>, and it really comes down to individual (and sometimes cultural) preferences to determine what type of therapy is best. I hope that helps!</p><p>In terms of SSRIs, yes, they can certainly be effective. In some cases where we think the client is a risk to themselves or others during therapy pre-screening, we refer them to where they have access to other methods, including SSRIs or other prescription options. That said, there are some significant challenges with the availability of SSRIs, given the treatment gap and the fact that everyone may not have the access needed to get to a trained psychiatrist/psychologist or nurse to prescribe them. This is one of the reasons the <a href=\"https://www.who.int/publications/i/item/9789240049338\">WHO recently cited and recommended community-based models and methods </a>using lay community workers rather than trained mental health professionals as a key way to meet the growing need for services.&nbsp;</p><p>In terms of cost-effectiveness, prescribed medication is reasonably affordable, but the cost can add up over a lifetime of use. For $105 USD on our end (and entirely free for the women we treat), we can provide long-term depression-free rates. Our results show that for every woman who restores her mental health, four additional members of her family feel the benefits. The HLI cost analysis looks at the benefits for the whole family as well as some of the long-term impacts as well, which is what makes our model so cost-effective.&nbsp;</p>", "parentCommentId": "QW9TwxamTn6kALxfH", "user": {"username": "Sean Mayberry"}}, {"_id": "vtoP4sK5Q4d7H9EPw", "postedAt": "2022-11-30T19:51:11.116Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Hi Sean,<br>(Sorry for the late question!)<br>Being in the field of providing solutions for mental health, what is your opinion on <a href=\"https://forum.effectivealtruism.org/topics/s-risk\">S-risk</a> and <a href=\"https://forum.effectivealtruism.org/topics/longtermism\">Longtermism</a>? Do you think such topics are directly in line with the cause prioritization of mental well-being?</p>", "parentCommentId": null, "user": {"username": "Mayank Modi"}}, {"_id": "b2kXryecapbHfxZjh", "postedAt": "2022-12-01T04:58:07.268Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks for these questions! I appreciate the time you took to really look at our data, and I think some of the questions will help us ponder what we need to be looking at next within StrongMinds. Please note, as the Founder, I'm not a researcher or clinician by trade, so my answers may not be as granular as you would hope, but I'll do my best to respond. I'm going to tackle the first four tonight.</p><ol><li>a. The NNTs could be different due to a variety of theoretical factors. NNTs are really only as good and accurate as the data provided. We are planning an RCT for 2023, so hopefully, we will have more to consider and dig into once those numbers are available. b/c. Yes, the numbers are surprising. As I've mentioned in some of the other responses, I largely think the success has to do with the interpersonal nature of IPT and how it works within the community-centered culture of Uganda and Zambia.</li><li>I believe the 10% figure is part of the HLI analysis, and I am not an expert on that, so I'll let their team speak to that or let the numbers speak for themselves.&nbsp;</li><li>An RCT certainly could have been done as a pilot, but they are pretty costly to complete, and at the time, StrongMinds was just finding its footing and searching for funders. I was working as a volunteer at StrongMinds for the first 18 months of operation.&nbsp;</li><li>Our facilitators are all lay community members. In Uganda, 100% of our facilitators are Ugandan. In Zambia, they are all Zambian. They don't need to have a college degree in Psychology; in fact, they don't even need to have a high school degree. The most critical factor when we are interviewing potential facilitators is their empathy level. We have found that the higher their empathy level, the better they are as facilitators.&nbsp;</li></ol>", "parentCommentId": "q93W3HA7bixLApELo", "user": {"username": "Sean Mayberry"}}, {"_id": "PcAxHTxEw2eZBNf2a", "postedAt": "2022-12-01T05:12:12.153Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>I agree that based on all of the barriers and life challenges that it seems like it would be harder to treat depression in Kampala. As mentioned in some of the other answers, I think the model itself, being culturally appropriate and community-centered, as well as the interpersonal bonds, play a significant role in the program's success. Also, the fact that we work where the women are, in refugee camps, slums, or schools, to deliver our services.&nbsp;</p>", "parentCommentId": "ZK3EJR8s24oyq6xA4", "user": {"username": "Sean Mayberry"}}, {"_id": "A8zqPQK5jMsvJDDS3", "postedAt": "2022-12-01T06:42:44.631Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>No worries! I should say that I've spent less than 3 hours looking through SM/HLI documents around this, so I'm not highly confident about most of these points. I have a lot of respect for anyone who is trying their best to make as much impact in the world as they can -&nbsp;thank you for all your work thus far, and thank you for engaging with all the questions!</p><p>I should also clarify that the digging was largely prompted by HLI's strong <a href=\"https://www.happierlivesinstitute.org/2022/11/24/2022-charity-recommendation/#:~:text=We%E2%80%99re%20now%20in%20a%20position%20to%20confidently%20recommend%20StrongMinds%20as%20the%20most%20effective%20way%20we%20know%20of%20to%20help%20other%20people%20with%20your%20money.\">endorsements</a>:</p><blockquote><p>We’re now in a position to confidently recommend StrongMinds as the most effective way we know of to help other people with your money.</p></blockquote><p>And while this was a result of over 3 years and 10,000 hours of work, I generally aim to be more hesitant to take such strong claims at face value.</p><p>But I mention this because &nbsp;I want to emphasise that even if it's the case that after this conversation, I decide that I'm not personally quite convinced that StrongMinds is the single <strong>most </strong>cost effective way to help other people, it doesn't mean this is a reflection of the effort you have and continue to put into SM! It doesn't necessarily mean SM isn't a great charity. It doesn't mean it's not possible for StrongMinds to be the best charity in the future, or be the best under different philosophical assumptions. It's just really hard to be the most cost effective charity.</p><p>And I'm mindful that this conversation has been possible precisely because of your shared commitment to transparency and willingness to engage, which I have a lot of respect for. We are both on the same team of wanting to do as much good as we can, and I hope you interpret this barrage (apologies!) of questions in that light.</p><p>Lastly, I'm also happy to continue via email and update folks later with a summary, if you think that would be helpful for getting answers that you may not be able to answer immediately etc.</p><p>With that in mind, some followups:</p><p>&nbsp;</p><p><strong>1) &nbsp;</strong>Just re-flagging the question RE: bias, though as you pointed out, this may be better suited for a researcher &nbsp;on the team / someone who was more in-the-weeds with the research:</p><p><strong>a) </strong>What's the justification behind the 94% figure not being found to be invalid when the 99% was? Was it based on different methodology between the two pilots, or something else? As far as I can tell, the difference in methodology RE: recording PHQ-9 scores was that in phase 1 these were scored weekly from week 5-16, with a post-assessment scoring at week 17, and for phase 2, these were done biweekly from week 2-12, with a post-assessment at week 14. It's not clear that this difference leads to bias in one but not the other.<br><br><strong>b) </strong>Also curious about the separate analysis that came to 92%, which states: \"Since this impact figure was collected at a regular IPT group meeting, as had been done bi-weekly throughout the 12- week intervention, it is unlikely that any bias influenced the figure.\" I don't quite understand how collection at a regular IPT group meeting makes bias unlikely - could you clarify this? Presumably participants knew in advance how many weeks the intervention would be?&nbsp;</p><p>&nbsp;</p><p><strong>2) </strong>I took the 10% from StrongMinds' <a href=\"https://strongminds.org/wp-content/uploads/2017/07/strongminds-phase-1-and-2-follow-up-evaluations_final.pdf\">2017 report (pg 2)</a>, not an HLI analysis (though if HLI independently came to that conclusion or have reviewed it and agreed I'd be interested too):&nbsp;</p><blockquote><p>While both the Phase 1 and 2 patients had <strong>95% depression-free rates</strong> at the completion of formal sessions, our Impact Evaluation reports and subsequent experience has helped us to understand that those rates were somewhat inflated by social desirability bias, <strong>roughly by a factor of approximately ten percentage points</strong>. This was due to the fact that their Mental Health Facilitator administered the PHQ-9 at the conclusion of therapy. StrongMinds now uses external data collectors to conduct the post-treatment evaluations. Thus, for effective purposes, <strong>StrongMinds believes the actual depression-free rates for Phase 1 and 2 to be more in the range of 85%</strong>.</p><p>[emphasis added]</p></blockquote><p>I couldn't find a justification of this figure in that report or any of the preceding reports. (admittedly I just very quickly searched for various combinations of 10/85/95% and didn't read the entire report)</p><p>&nbsp;</p><p><strong>3) </strong>Makes sense - looking forward to the results of the RCT! I assume it will be independent and pre-registered?</p><p>&nbsp;</p><p><strong>4)</strong> Thanks! Just looked in a bit more detail - in <a href=\"https://strongminds.org/wp-content/uploads/2013/07/StrongMinds-Phase-Two-Impact-Evaluation-Report-July-2015-FINAL.pdf\">Appendix A (pg 30)</a> it says:</p><p>\"Use of lay community workers as the IPT-G facilitators, or Mental Health Facilitators(MHFs)</p><ul><li>MHFs require at least a high-school diploma, and are employed and salaried by StrongMinds. They receive two weeks of training by a certified IPT-G expert and receive on-going supervision and guidance by a mental health professional. Since they are community members themselves, they are well-received by the depressed patients. The IPT-G training curriculum includes modules on mental illness in general, depression, interpersonal psychotherapy, management of suicidality, and the goals and objectives for each weekly session of the 16 total sessions that are held. The training extensively uses role-playing to recreate group meeting settings.\"</li></ul><p>In <a href=\"https://strongminds.org/wp-content/uploads/2013/07/StrongMinds-Phase-Two-Impact-Evaluation-Report-July-2015-FINAL.pdf\">Appendix E (pg 33)</a> it says:</p><ul><li>\"StrongMinds completed training its initial cadre of four MHFs in March, 2014. The training lasted 10 days and was conducted by two Ugandans certified in IPT-G by Columbia University. In addition, the training was monitored long-distance via Skype by our senior technical advisor who is an international expert on IPT-G from Columbia University.\"</li><li>\"In Phase One of the 2014-2015 pilot in Uganda, our 4 MHFs were supervised by the two Ugandan IPT-G experts noted above. In Phase Two, StrongMinds hired a full-time Mental Health Supervisor (MHS) who both conducted IPT groups and supervised the 4 MHFs. This MHS was actually a member of the 2002 RCT in Uganda and has over ten years of IPT-G experience\"</li></ul><p><strong>a)</strong> Just confirming that \"lay counsellor\" is the same as \"IPT-G facilitator\" and \"mental health facilitator\"? If not, what are the differences? How much training do they get and what's their role in the intervention etc.</p><p><strong>b)</strong> How does StrongMinds select for empathy? E.g. questionnaire, interview, etc.<br><br><strong>c)</strong> What does it mean to be a \"certified IPT-G expert\"? For example, it sounds like there are a lot of various <a href=\"https://iptinstitute.com/ipt-certification/\">levels of certification</a>. From a quick google the best match I found for the description of the training was <a href=\"https://www.cugmhp.org/programs/gmh-summer-institute/#:~:text=Specifically%2C%20participants%20of%20this%206%2Dday%20training%20program%20learn%20to%20use%20Group%20Interpersonal%20Psychotherapy%20and%20the%20World%20Health%20Organization%E2%80%99s%20(WHO)%20Mental%20Health%20Gap%20Humanitarian%20Intervention%20Guide\">this</a>, which suggests a \"certified IPT-G expert\" is someone who has completed this specific 6-day course, i.e., with a level A certification? (Happy to be corrected - just couldn't find any details of this). If true, am I understanding correctly that the StrongMinds lay counsellors / mental health facilitators take a 10 day training course which is delivered by someone who has taken a 6-day course? Do the certified IPT-G experts play a role in SM other than the initial training of lay counsellors?</p><p><strong>d)</strong> What does it mean to be a \"mental health supervisor\"? What's their role in SM?</p><p><strong>e) </strong>[Minor] I just realised the appendix said MHFs require at least a high school diploma, contra what you said earlier: \"in fact, they don't even need to have a high school degree\". I assume this was just a more recent change in policy. Not a big deal, just clarifying.</p><p>&nbsp;</p><p><strong>5) </strong>I had another question, which came up as I was going through the tax returns Joel linked to work out the cost per client reached - in the tax return it says</p><blockquote><p>STRONGMINDS IS A SOCIAL ENTERPRISE THAT PROVIDES LIFECHANGING DEPRESSION TREATMENT TO LOW-INCOME INDIVIDUALS IN SUB-SAHARAN AFRICA.</p></blockquote><p>This didn't exist in the tax returns before 2019, but came up every year from 2019 onwards.</p><p><strong>a)</strong> Was there a change in model in terms of revenue streams or business model for StrongMinds - if so, what changed?</p><p><strong>b) </strong>You'll probably cover this in some of the other questions, but how do the partnerships work? Do partners pay you <a href=\"https://strongminds.org/scaling-through-partnerships/#:~:text=The%20training%20and%20handover%20process%20takes%20place%20over%20the%20course%20of%20about%20one%20year%20of%20on%2Dsite%20technical%20assistance.\">for the year of training</a>? What does this training look like?</p><p><strong>c)</strong> Are there other revenue streams that StrongMinds have outside of donors / grants? (To be clear - I don't have an issue with StrongMinds being a social enterprise, just wanting to clarify so I have the facts right!)</p><p>&nbsp;</p><p>(commenting in personal capacity etc)</p>", "parentCommentId": "b2kXryecapbHfxZjh", "user": {"username": "bruce"}}, {"_id": "5tumr2HJ8gFRKcsZ2", "postedAt": "2022-12-02T01:44:28.171Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<blockquote><p>But I'm interested in something more fine-grained than \"total annual expenses, or even \"program service expenses\" (per tax returns). e.g.:<br>$A to train lay counsellors<br>$B / hour for facilitators * number of hours<br>$C operating costs for StrongMinds (SM)<br>$D for outreach to SM partners<br>$E for SM partner operating costs<br>etc</p></blockquote><p>&nbsp;</p><p>Unfortunately, I don't know if I can share any information beyond the pie chart I shared above. So I'll leave that for StrongMinds.&nbsp;</p><blockquote><p><strong>Also, ~48% of clients were treated through partners in 2021, but does the methodology of working out cost effectiveness by dividing clients reached by SM expenses include expenses and operating costs of the partners?</strong></p></blockquote><p>We did our analysis before they shifted models, so we hadn't incorporated this. I don't think StrongMinds includes partner costs. This will be something we revisit when we update our StrongMinds CEA (expected in 2023).&nbsp;</p><p>I see this as more of a concern for counterfactual impact. Where I see it as \"StrongMinds got these organizations to do IPT-g, how much better is this than what they'd otherwise be doing?\" But maybe I'm thinking about this wrong.&nbsp;</p>", "parentCommentId": "oq3DA69CPa6S2qRtr", "user": {"username": "JoelMcGuire"}}, {"_id": "JLZuN74BZzR2ChskC", "postedAt": "2022-12-05T06:45:35.011Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks Sean, amazing work!&nbsp;</p>", "parentCommentId": "z7pSs2opRy2tdm2gj", "user": {"username": "Lucas Lewit-Mendes"}}, {"_id": "Jof5NosucuqNYsZpY", "postedAt": "2022-12-06T20:12:27.681Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thank you! I appreciate your curiosity, and I'm not put off by the questions or anything; it's just many of them are not in my area of expertise, and this happens to be a pretty busy time of year at StrongMinds. It may take some time to fully gather what you're asking for. We aren't a large research institute by any means, so our clinical team is relatively small. Additionally, some of the work you are referencing is nearly a decade old, so we have shifted some of the ways we operate to be more effective or better based on our learnings. That said, I will dig back in when I can to help answer your additional questions via email or direct message.&nbsp;</p><p>To answer the remaining four from your original note to close the loop:</p><p>5) Since HLI generated the $170 figure, they have the best information on that particular breakdown, but I am collecting the most recent info on our CPP for another question, and I will share that with you later this week when I have the updated numbers.&nbsp;</p><p>6) As mentioned above, we are currently in the process of assessing the right questions and framework for an RCT looking at the results and impact of our therapy model. We are hoping to be able to launch the RCT late in 2023.&nbsp;</p><p>7) We switched our model to teletherapy to continue to treat clients during the pandemic lockdowns. It was not ideal, but we wanted to continue reaching as many women as possible despite the challenges. Though it proved tricky in some cases to reach our target demographic, we did find that some women preferred the flexibility teletherapy offered them. For the most part, we have switched back to our original model, but we still see some groups via teletherapy in Uganda. All research shared publicly from our initial year using teletherapy can be found <a href=\"https://strongminds.org/wp-content/uploads/2020/07/COVID-19-MENTAL-HEALTH-WHITE-PAPER.pdf\">here.</a></p><p>8) We track individuals that attend most of their therapy sessions, as we saw that the effects of therapy were still statistically significant and that attending additional sessions did not produce incremental impact. Due to the individual roles and responsibilities of the women that attend, it's sometimes challenging for them to make it to all 12 sessions.&nbsp;</p><p>Thanks again for the questions!</p>", "parentCommentId": "A8zqPQK5jMsvJDDS3", "user": {"username": "Sean Mayberry"}}, {"_id": "9neosKYArZpnBbjbb", "postedAt": "2022-12-06T20:16:23.224Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Hi John! I have not forgotten this question. I aim to have an answer for you by the end of the week. I wanted to wait until our CFO had the opportunity to review to ensure we have the most recent figures for you. I'll be back in touch on this very soon. Thanks for your interest!&nbsp;</p>", "parentCommentId": "jQAbBSfRTJMbndaBh", "user": {"username": "Sean Mayberry"}}, {"_id": "zmC99C7Wab5mSfjDE", "postedAt": "2022-12-06T21:06:19.673Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Great questions! I should probably do a bit more reading on both topics before making a definitive statement, but just like the emphasis on well-being from Happier Lives Institute, I think considering the suffering risk of populations is a high moral priority. Mental health is an investment in the betterment of all areas of life. We see it can increase productivity, the number of meals a family eats, and the amount of school children attend. It impacts all areas of life and health, and similarly, restoring mental health creates thriving communities and stronger economies. From the longtermism philosophy, I think there is much to consider outside of simply eliminating existential threats and improving humanity. The results of climate change are already devastatingly impacting some of the communities we work in, which has serious implications for mental health and overall well-being. If we genuinely wish to eliminate suffering, we must address the crises and unrest at the root of the depression triggers.&nbsp;</p>", "parentCommentId": "vtoP4sK5Q4d7H9EPw", "user": {"username": "Sean Mayberry"}}, {"_id": "2uMXNTfP7oDpehpnC", "postedAt": "2022-12-06T21:22:04.904Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks so much to everyone that took the time to ask me questions and participate in this AMA. It was really refreshing to speak to so many people that are curious about our work. Many of the questions got me thinking about how we work and the ways we can do a better job moving into 2023. I appreciate all of your thoughts, ideas, and support!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sean Mayberry"}}, {"_id": "2Gbp4d947TGaGGZcc", "postedAt": "2022-12-22T23:41:30.749Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Thanks for the reply Sean.&nbsp;<br><br>I guess if I was in your position I'd consider running a pilot of the service (using as-similar-a-method-as-possible) &nbsp;in a demographic that is seen as desirable to the health industrial complex (New York or California or something). Perhaps I'd also talk to an intellectual property lawyer and see if there are any elements of your method that can be subject to protections (patents, copyright material or whatever).&nbsp;<br><br>If it's so impactful and cost-effective it might be immediately profitable if offered to other demographics (including because market-provided mental health services seem hugely expensive in many western countries - it's possible that this model could undercut the market dramatically).&nbsp;</p>", "parentCommentId": "BLFBzjdJk8aJ4WKoe", "user": {"username": "Greg S"}}, {"_id": "qFhZ8pfdiTZLaHRrG", "postedAt": "2022-12-28T18:49:07.811Z", "postId": "82heDPsmvhThda3af", "htmlBody": "<p>Friendly reminder</p>\n", "parentCommentId": "9neosKYArZpnBbjbb", "user": {"username": "John Salter"}}]