[{"_id": "fknuo5tYPxtDaoTXM", "postedAt": "2018-01-22T16:37:54.963Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>How does this differ from the more general practice of looking at the upper and lower bounds of the costs and impact of interventions and seeing how the interventions compare? This seems like something EAs do a lot and something I've personally begged systemic change advocates to do repeatedly (no takers so far).</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "4D6hJswSRPHF2Tfnt", "postedAt": "2018-01-22T18:00:40.947Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>In most cases, I expect interventions to impact policy to also have diminishing marginal returns. Eg An experiment on legislative contacts found little increased effect with more calls (<a href=\"https://link.springer.com/article/10.1007/s11109-014-9277-1\">https://link.springer.com/article/10.1007/s11109-014-9277-1</a>) .</p>\n", "parentCommentId": null, "user": {"username": "Michael_S"}}, {"_id": "kCuLYi3d3DfQDjkyg", "postedAt": "2018-01-22T19:01:37.831Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>I think I'm making a difference point. The context to the post was that it's quite hard to estimate the EV of systemic interventions without a context, but it's much easier to guess whether you think they'd cost more or less than a scaled-up atomic intervention. </p>\n<p>I'm all for sensitive analysis too. This was more just to make the initial comparisons easier. Many EAs seem to wave away systemic interventions, often without even trying to run these sorts of numbers.</p>\n", "parentCommentId": "fknuo5tYPxtDaoTXM", "user": {"username": "MichaelPlant"}}, {"_id": "8gyhk4ErSNKjJeMxt", "postedAt": "2018-01-22T23:06:42.050Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>Thanks for writing this up – the ceiling-cost estimate seems like a valuable tool for comparing interventions across different cause areas.</p>\n<blockquote>\n<p>Second, I also assumed it would have an effect of 0.1 HALYs per person per year. This might be high, so let's assume it has a 1/10th of that impact.</p>\n</blockquote>\n<p>0.01 HALY/person/year on average still seems quite high. We're estimating the average impact across a <em>billion</em> people, and any sort of systemic reform is going to have an enormous number of impacts (of varying magnitudes, in both directions). Attributing 0.01 HALY on average sorta assumes there aren't any really big negative impacts (more precisely, that any negative impacts are insubstantial compared to the positive impacts). </p>\n<p>It also seems difficult to separate out the impacts that are appropriate to attribute to the systemic reform from all the other effects that are going on in the background.</p>\n<p>All this is to say that I think arriving at believable average-impact estimates for systemic interventions is tricky. It's probably one of the harder parts of making good ceiling-cost estimates.</p>\n", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "9MKW8ergTN9wMcsdX", "postedAt": "2018-01-22T23:28:05.542Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>These numbers are just illustrative and to get people thinking, rather than to be taken literally.</p>\n<p>Nevertheless, in some sense, it's not the 0.01 that's so important, it's the ratio between that and the Give Directly score. I'm amusing the intervention, whatever it is, has a 1/50th of a effect Give Directly does. That seems pretty believable: massive campaign to restucture the trade and subsidy system could do quite a bit of shift people out of poverty. </p>\n<p>We could make the average effect a 1/500th of the GD average effect and the mystery campaign would be cost-effective up to $14.6bn. That's still a lot of sauce.</p>\n<p>But yes, if you don't think the intervention would do good, that would be a substantial reason to dodge it (presumably in favour of another systemic intervention).</p>\n", "parentCommentId": "8gyhk4ErSNKjJeMxt", "user": {"username": "MichaelPlant"}}, {"_id": "E9WsyhympuwC3reDe", "postedAt": "2018-01-23T18:57:02.956Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>You seem to be assuming that the &quot;bad case&quot; for systematic reform is that it's, say, 1/500th of the benefit of the GD average effort. But I don't think that's the bad case for most systematic reforms: the bad case is that they're <em>actively harmful</em>.</p>\n<p>For me, at least, the core of my problem with &quot;systematic reform&quot; is that we're &quot;clueless&quot; about its effects - it could have good effects, but could also have quite bad effects, and it's extremely hard for us to tell which.</p>\n<p>I think the ceiling cost estimate is a nice way of framing the comparison, but I agree with Milan that the hard bit is working out the expected effect.</p>\n", "parentCommentId": "9MKW8ergTN9wMcsdX", "user": {"username": "Michael_PJ"}}, {"_id": "GeAgEo2qN5u3W3NoS", "postedAt": "2018-01-23T20:00:40.293Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>There are some systemic reforms that seem easier reason about that others. Getting governments to be able to agree a tax scheme such that the Google's and Facebook's of the world can't hide their profits, seems like a pretty good idea. Their money piles suggest that they aren't hurting for cash to invest in innovation. It is hard to see the downside.</p>\n<p>The upside is going to be less in developing world than the developed (due to more profits occurring in the developed world). So it may not  be ideal. The <a href=\"https://www.taxjustice.net/\">tax justice network</a> is something I want to follow more.  They had a conversation with <a href=\"http://files.givewell.org/files/conversations/Alex_Cobham_07-14-17_\\(public\\\">givewell</a>.pdf)</p>\n", "parentCommentId": "E9WsyhympuwC3reDe", "user": {"username": "WillPearson"}}, {"_id": "CiiKiNmCgnjjYHPjT", "postedAt": "2018-01-23T20:29:04.074Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<blockquote>\n<p>the core of my problem with &quot;systematic reform&quot; is that we're &quot;clueless&quot; about its effects - it could have good effects, but could also have quite bad effects, and it's extremely hard for us to tell which.</p>\n</blockquote>\n<p>I think this can also apply for the atomic interventions EAs tend to like, namely those from GW. You can tell a story about how <a href=\"http://effective-altruism.com/ea/ub/the_meat_eater_problem_developing_an_ea_response/\">Give Directly increases meat consumption</a>, so that's bad. For life saving charities, there's the same worry about meat, in addition to concerns about overpopulation. I'm not claiming we can't sensible work through these and concude they all do more good than bad, only that cluelessness isn't just a systemic intervention worry.</p>\n", "parentCommentId": "E9WsyhympuwC3reDe", "user": {"username": "MichaelPlant"}}, {"_id": "CLmFsFwEfWki3FTLk", "postedAt": "2018-01-23T21:01:28.363Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>Frame it as a matter of degree if you like: I think we're drastically <em>more</em> clueless about systematic reform than we are about atomic interventions.</p>\n", "parentCommentId": "CiiKiNmCgnjjYHPjT", "user": {"username": "Michael_PJ"}}, {"_id": "6YKmn8bRMxupxENoe", "postedAt": "2018-01-23T21:03:33.028Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>There's a sliding scale of what people consider &quot;systematic reform&quot;. Often people mean things like &quot;replace capitalism&quot;. I probably wouldn't even have classed drug policy reform or tax reform as &quot;systematic reform&quot;, but it's a vague category. Of course the simpler ones will be easier to analyze.</p>\n", "parentCommentId": "GeAgEo2qN5u3W3NoS", "user": {"username": "Michael_PJ"}}, {"_id": "uTAsivAERmwzsrjCa", "postedAt": "2018-01-23T21:16:01.588Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>FWIW, I think this is way too broad. Even if, a priori, systemic interventions are more clueness-ny (?) than atomic interventions ones, it's not that useful to talk about them as a category. It'd would be more useful to argue the toss on particular cases.</p>\n", "parentCommentId": "CLmFsFwEfWki3FTLk", "user": {"username": "MichaelPlant"}}, {"_id": "2JRhJfyfkqEDeB5yn", "postedAt": "2018-01-24T00:08:42.301Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>Sure - I don't think &quot;systematic change&quot; is a well-defined category. The relevant distinction is &quot;easy to analyze&quot; vs &quot;hard to analyze&quot;. But in the post you've basically just stipulated that your example <em>is</em> easy to analyze, and I think that's doing most of the work. </p>\n<p>So I don't think we should conclude that &quot;systematic changes look much more effective&quot; - as you say, we should look at them case by case.</p>\n", "parentCommentId": "uTAsivAERmwzsrjCa", "user": {"username": "Michael_PJ"}}, {"_id": "9WSLfDRxXCMd2rTwx", "postedAt": "2018-01-24T09:02:25.934Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>I really like this type of reasoning - I think it allows for easier comparisons than the standard expected value assessments people have occasionally tried to do for systemic changes. A couple points, though.</p>\n<p>1) I think very few systemic changes will affect 1B people. Typically I assume a campaign will be focussed on a particular country, and likely only a portion of the population of that country would be positively affected by change - meaning 10M or 100M people is probably much more typical. This shifts the cutoff cost to closer to around $1B to $10B, which seem plausibly in the same ballpark as GD.</p>\n<p>2) Instead of asking &quot;how much would this campaign cost to definitely succeed&quot;, you could ask &quot;how much would it cost to run a campaign that had at least a 50% chance of succeeding&quot; and then divide the HALYS by 2. I'd imagine this is a much easier question to answer, as you'd never be certain that an effort at systemic change would be successful, but you could become confident that the chances were high.</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "mmBZ9sxDAdLA4rw3m", "postedAt": "2018-01-24T11:50:21.779Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>Thanks.</p>\n<blockquote>\n<p>I think very few systemic changes will affect 1B people.</p>\n</blockquote>\n<p>I'm not making a serious claim about EV in any particular case, just suggesting an easier way to do the maths. However, if systemic change X affected A people for £B, and systemic change Y affected 1/2A people for £1/2B, then they would have the same expected value. </p>\n<blockquote>\n<p>how much would this campaign cost to definitely succeed</p>\n</blockquote>\n<p>I actually don't do this (although now I wonder if I should have been clearer about this). I deliberately use the <em>expected cost</em> for it to succeed. The 'definite success' cost would nearly always be ludicrously high, because you can't really guaranatee success. If you thought you could estimate the expected cost for 100% chance of success, you could obviously use the same reasoning to estimate the expected cost for a 50% chance of success.</p>\n", "parentCommentId": "9WSLfDRxXCMd2rTwx", "user": {"username": "MichaelPlant"}}, {"_id": "vhd5TowKyqnRvFcn7", "postedAt": "2018-01-24T16:04:05.536Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>Quick comment - I broadly agree. I think if you want to maximise impact within global poverty, then you should first look for potential large-scale solutions, such as policy change, even if they have weak evidence behind them. We might not find any, but we should try hard first. It's basically hits based giving.\n<a href=\"https://www.openphilanthropy.org/blog/hits-based-giving\">https://www.openphilanthropy.org/blog/hits-based-giving</a></p>\n<p>In practice, however, the community members who agree with this reasoning, have moved on to other problem areas. This leaves an odd gap for &quot;high risk global poverty&quot; interventions. Though GiveWell has looked into some options here, and I hope they'll do more.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "JaArtEuKh8nP6KLrM", "postedAt": "2018-01-25T00:01:01.348Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>&quot;the community members who agree with this reasoning, have moved on to other problem areas&quot;</p>\n<p>I've seen this problem come up with other areas as well. For instance, funding research to combat aging (eg the SENS foundation) gets little support, because basically anyone who will &quot;shut up and multiply&quot; - coming to the conclusion that SENS is higher EV than GiveWell charities, will use the same logic to conclude that AI safety is higher EV than GiveWell charities or SENS.</p>\n", "parentCommentId": "vhd5TowKyqnRvFcn7", "user": {"username": "Daniel_Eth"}}, {"_id": "4HNB6ZtrQ9HrrBLca", "postedAt": "2018-01-26T14:40:38.683Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>In many cases a big concern with systemic change is that, especially when political, it involves playing zero-sum, or negative-sum games. For example, if I think that some international legal reform X is useful, but you think it would be detrimental, we might both donate money to campaigns fighting for our side of the issue and cancel each other out, meaning the money is wasted. It would have been better for us to realise this before donating to the political campaigns and give our money elsewhere.</p>\n<p>Note this is not the same as just saying that people might disagree on which cause is the most effective. If I think that funding a vaccine program is most effective, and you think that funding a malaria-net program is more effective we can both donate without stopping the other. </p>\n<p>Not all systemic change is of this adversarial type, involving campaigning against other people who disagree and will spend money in the other direction. But I think this is a problem which overwhelmingly affects attempts at systemic change rather than atomic change. Systemic change usually involves changing some rules or reforming some institution - which doesn't inherently need to consume lots of resources - unless we need to spend money campaigning against some people on the other side. Conversely, atomic change generally involves interventions which require resources even if everybody agrees it is a good idea (such as buying malaria nets or creating vaccines).</p>\n<p>The conclusion here is that when calculating spending money on systemic change, you need to account for other people reacting by spending their money fighting against you - money they might have otherwise spent on something useful.</p>\n", "parentCommentId": null, "user": {"username": "James_Clough"}}, {"_id": "aFvTWmGzS8LepTP4b", "postedAt": "2018-01-26T17:42:12.497Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>I don't think this is quite right. The distinction you seem to be drawing on is 'people counteract your action' vs 'people don't', rather that 'systemic' vs 'atomic'. An example of two atomic interventions counteracting each other would be saving lives and family planning to reduce population size; the latter want there to be generally less people, the former keep more people alive. Hence there's a natural tension there (although both could be good under certain circumstances and views).</p>\n<p>It's true we need to consider if people will counteract us. However, the scenario you suggest where it would be better us, who are for legal reform X to engage in a moral trade with those who are against us and we both agree to do something else, actually requires we could get the other side to agree. If we can't get the other side to agree to moral trade, we need to think &quot;what is my counterfactual impact given they'll fight me&quot; vs &quot;what is the counterfactual impact of other stuff i could do&quot;.</p>\n<p>You're right to point out that it could be the case if you do X, people will try to make not X happen, when if you haven't tried to do X, they would have done Y instead, where Y is a positive outcome. But that could apply to both systemic and atomic interventions. I spend money saving lives, someone concerned about overpopulation could marginally step up their donations to thwart me.</p>\n", "parentCommentId": "4HNB6ZtrQ9HrrBLca", "user": {"username": "MichaelPlant"}}, {"_id": "iKS4zLarBnPBeB34A", "postedAt": "2018-01-26T18:37:53.074Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>I agree that the 'people counteract your action' vs 'people don't' axis and the 'systemic' vs 'atomic' axis are different - but I think that there's a strong correlation between the two. Of course any intervention <em>could</em> have people working to counteract it, but I think these counter-actions are much more likely for systemic-type interventions.</p>\n<p>This is because many systemic interventions have the property that, if a large majority of people agreed the intervention was a good idea, it would be easy to accomplish, or would have already been accomplished. This is at least true of systemic interventions that take the form of advocacy for social/political change in democracies - there might be other significant classes of systemic change to which this argument does not apply though - perhaps those where we think that many of those who disagree with us can be easily persuaded, or forced to comply.</p>\n<p>This means that it's likely to be the case that the systemic interventions that still need doing must be those that have a significant group of people who disagree with us, and it is these people who are likely to counteract. It is hard to think of ways to campaign for removing rich-world agricultural subsidies in a way that is both effective, and does not invoke counteraction. Drug policy reform would also likely provoke counteraction (and by people who will genuinely believe that they, not we, are the altruists). </p>\n<p>But non-systemic interventions seem like they would generally be easier to do in ways that avoid counteraction, because they tend to take the form of atomic improvements rather than sweeping change. I don't think there actually are many, if any, people who will really spend their money attempting to give <em>more</em> people malaria or schistosomiasis as a response to us spending ours the other way.</p>\n<p>Having said all this I think this ceiling-cost approach is a very useful one, and systemic changes can be extremely effective. Rather, I just think these are the sorts of reasons that make might make one `suspicious about systemic changes per se.' as you put it.</p>\n", "parentCommentId": "aFvTWmGzS8LepTP4b", "user": {"username": "James_Clough"}}, {"_id": "DLRni3Pi6sqNPeGx5", "postedAt": "2018-01-28T11:59:32.445Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>Hi and many thanks for this wonderful post, I have a few thoughts and observations to share:</p>\n<p>I strongly agree there is a need for a greater focus in general (i.e. within and outside of the EA community) on systemic versus symptomatic interventions.</p>\n<p>I think this should be achieved via proportionally funding systemic versus symptomatic interventions.  This appears to me to be morally correct in the sense that it considers both current and future suffering reduction.  My off-the-bat split … 90% symptomatic / 10% systemic given the scale of the current state of suffering</p>\n<p>This however is based on the assumption that compelling, well-reasoned and evidence-based systemic invention opportunities exist for funding allocation</p>\n<p>This is problematic: I personally I not aware of such intervention opportunities today per se, perhaps in part because of the central issue you raise i.e. quantifying the estimated impact</p>\n<p>Conversely we have several compelling, well-reasoned and evidence-based symptomatic interventions today.  Front-of-mind is AMF: $2 a net, 3750 nets installed = 1 life saved @ $7,500 total.  Qudos to this community for shining a light on this suffering reduction no-brainer</p>\n<p>Coming back to the example given, I don’t regard international legal reform as a systemic invention: the need for it is the absence of it in the first place leading to the symptom (in this case poverty), as such the reasoning is that international legal reform is symptom of symptom and not cause of the problem in itself</p>\n<p>As such the first challenge is to formulate interventions that are truly systemic and with a tremendous sense of urgency: there is what seems like an infinite number of manifestations of suffering in our world today and a real threat to our existence estimated at 1 in 5 by 2100 by this community</p>\n<p>Reasoning and logic always leads me personally (i.e. whether thinking about any specific case of suffering, anytime, anywhere) to the root cause being embedded within our consciousness (individually/collectively, naturally/nurturally)</p>\n<p>One issue that your example highlights is the investment required for large-scale systemic interventions: using your example, funding need will exceed funding availability by many multiples</p>\n<p>As such feasible and compelling systemic interventions should be scalable i.e. testable on a smaller scale i.e. via (non-throwaway) pilot projects; and/or have extremely high expected return profiles</p>\n<p>As such it does not have to be the case that smaller campaigns be proportionally less effective in a material sense i.e. in the sense that they can be judged for their effectiveness, considering the benefits of efficiency of scale-up, and therefore requiring more modest investment and therefore able to access a broader base of potential funding</p>\n<p>Many thanks again for the post,</p>\n<p>Allister Clark.</p>\n", "parentCommentId": null, "user": {"username": "allister_clark"}}, {"_id": "xZdSNpF2KQ8iwDHhy", "postedAt": "2018-01-28T14:35:02.474Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>'I think very few systemic changes will affect 1B people' .  I agree entirely.  We should not in any way close the door on the possibility of systemic interventions with wide-scale impact and it made me think:</p>\n<p>'Imagine a systemic change intervention could create a HALY/person of 1.00 for all scentient beings all the time'.</p>\n<p>Noting: </p>\n<p>1) all time less an implementation period accounting for ramp-up to maximum impact</p>\n<p>2) is not constrained by arbitrary boundaries e.g. rich/poor, planetary, species, only by the limits of our consciousness</p>\n<p>3) I'm considering a HALY of 1.00 to equate to the elimination of all avoidable suffering</p>\n<p>This statement is logically consistent with the original sentence and only scaled up beyond the 1B people (so both numerically, within the our species, but also beyond our species).</p>\n<p>So what does this mean exactly?  Effectively we are imagining, expressed in another way, transitioning from a world of:</p>\n<p>x-risk, nuclear catastophe, environmental degradation, compromised well being, family-oriented suffering, animal suffering, selfishness, displacement, conflict, fair economies, discrimination, compromised physical or mental health, poor nutrition, tobacco, pollution, corruption, poorly treated children, unsafe (e.g. safe roads) and irresponsible transportation, abuse, inadequate education, slavery, poverty, corporate or poltical irresponsibility, gridlock, equality, the ills of globalization, technology risk e.g. AI, to children), genocide,, terrorism, materialism, suicide etc</p>\n<p>to living experiences characterized by:</p>\n<p>happiness, sensation, creativity, caring, love, understanding, dynamicism, responsibility, progress, equality, fun, good health, truth, trust, consensus, sharing etc</p>\n<p>Even if there were very few such interventions, any demonstrating:</p>\n<ul>\n<li>a compelling, well-reasoned and evidence-based story</li>\n<li>scalable to achieve the desired outcome</li>\n<li>testable from a modest initial scale pilot</li>\n<li>as such not massive $'s to test</li>\n</ul>\n<p>This would have to be worth investing in.  It would have to be as much of a no-brainer as buying malaria nets, frankly.</p>\n", "parentCommentId": "mmBZ9sxDAdLA4rw3m", "user": {"username": "allister_clark"}}, {"_id": "Rg9vyJDZkyjmbEQkB", "postedAt": "2018-01-30T14:55:26.147Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>As many others have expressed, the concern with systemic changes is you are often dealing with complex poorly understood systems. </p>\n<p>Let's take the example of EU's Common Agricultural Policy. It is most likely evil toward world's poor, but it's not clear for example whether it works toward or against EU unity. It is plausible it is somehow important for EU unity, either because being a form of fiscal transfer or a way how to corrupt important voter block... So we should include possible political consequences in the utility calculation, and the problem becomes really tricky.</p>\n<p>On the other hand I agree systemic interventions are worth considering, and e.g. change in drug policy seems to be an excellent candidate, as the action has been tested, we understand most of the consequecnes.</p>\n", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "jZTJQP9Eqbm3bAzmi", "postedAt": "2018-02-28T01:57:54.370Z", "postId": "84utmyNmRqCS9Ytka", "htmlBody": "<p>It seems there has been a build-up of a handful of people who would be willing to support organizations like SENS, and can donate to anti-ageing when they think on the margin it's a more impactful intervention. Another factor is with the Open Philanthropy Project and others granting to EA organizations more than ever, this results in fewer organizations having room for more funding, meaning the money can be donated to a charity like SENS. I know they received a lot of funding in 2017, so I'm wondering why that might be the case.</p>\n", "parentCommentId": "JaArtEuKh8nP6KLrM", "user": {"username": "Evan_Gaensbauer"}}]