[{"_id": "F5A6izH4GzppSAZeu", "postedAt": "2023-12-29T07:30:23.921Z", "postId": "86RcytpqKDLGG2mE8", "htmlBody": "<p>Is the 2024 funding gap a gap for the start of 2024 or the end of 2024?</p>\n", "parentCommentId": null, "user": {"username": "wes R"}}, {"_id": "58hCHWfbJLENksLit", "postedAt": "2023-12-29T08:01:37.755Z", "postId": "86RcytpqKDLGG2mE8", "htmlBody": "<p>Nice concise write up and I'm super encouraged by your starting efforts. This charity idea makes so much sense to me and I really believe you can get a significant \"win\" in the next year or too. If you can even claim you contributed 20 percent to any state or nationwide tobacco policy in an LMIC, the cost effectiveness of your work is likely to be very impressive.</p>\n<p>I also love that you have raised 16,000 in non EA funding as this both demonstrates good networking ability, and I also believe the counterfactual of pulling non EA related donations away from less important work makes this money potentially more valuable then EA sourced money, although very uncertain by how much.</p>\n<p>I also appreciate that you have asked for an unusually small amount of money for the forum, great to see people operating on small budgets and only asking for what they can use right now. I would imagine you'll get it soon!</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "L37Tog6u5F7cjcTGo", "postedAt": "2023-12-30T20:44:56.689Z", "postId": "86RcytpqKDLGG2mE8", "htmlBody": "<p>It's perhaps not very \"EA\" of me to say, but having lost a loved one to tobacco -- this specific cause is more personal to me than most. I squeezed in a last-minute donation for y'all.</p><p>Returning to a more analytical frame of mind, one of the things I like about your org's value proposition for EAs right now is this: I could see your org drawing significant non-EA financial support in the future. This is also evidenced by having obtained over $16K in non-EA funds already. I really like new charity startups that have the potential to draw significantly on non-EA funds as they expand, such that the expansion isn't funded by monies that would have counterfactually gone to AMF, et al.</p><p>Hatred can be a powerful variant on warm fuzzies, and I think a decent number of people hate Big Tobacco. That would be hard to market around, but I think it is worth keeping in mind. Or, more positively: for people in my shoes, the possibility of preventing others from suffering the same fate as their loved ones could be a significant motivation. <i>Cf. </i>the pattern of people donating to disease-specific charities for diseases that they or their loved ones have/had.</p>", "parentCommentId": null, "user": {"username": "Jason"}}]