[{"_id": "Y3rHRdabJjAycZFkB", "postedAt": "2018-08-29T04:02:23.137Z", "postId": "89B9tQzfJB4wLKyvF", "htmlBody": "<p>Thanks for sharing these reflections. I really appreciate them and it's exciting to see all this progress. I think some additional context about what the Human Level AI multi-conference is would be helpful. It sounds like it was a mix of non-EA and EA AI researchers meeting together?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "szxGAcuueR9ESNZkg", "postedAt": "2018-08-29T09:50:03.140Z", "postId": "89B9tQzfJB4wLKyvF", "htmlBody": "<blockquote>\n<p>It sounds like it was a mix of non-EA and EA AI researchers meeting together?</p>\n</blockquote>\n<p>Mostly the former; maybe 95% / 5% or higher. Probably best to describe it as a slightly non-mainstream AI conference (in that it was focused on AGI more so than narrow AI; but had high-quality speakers from DeepMind, Facebook, MIT, DARPA etc) which some EA folk participated in.</p>\n<p><a href=\"https://www.hlai-conf.org/\">https://www.hlai-conf.org/</a></p>\n", "parentCommentId": "Y3rHRdabJjAycZFkB", "user": {"username": "Sean_o_h"}}, {"_id": "KCTERWgxXj5xwtXHS", "postedAt": "2018-08-29T10:02:13.979Z", "postId": "89B9tQzfJB4wLKyvF", "htmlBody": "<p>Great summary, thanks.</p>\n<blockquote>\n<p>The sink source should then be owned by a team seen as extremely responsible, reliable, and committed to safety above all else. I recommend FHI or MIRI (or both!) take on that role.</p>\n</blockquote>\n<p>Were this to happen, these orgs would not be seen as the appropriate 'owners' by most folk in mainstream AI (I say as a fan of both). Their work is not really well-known outside of EA/Bay area circles (other than people having heard of Bostrom as the 'superintelligence guy;).</p>\n<p>One possible path would be for a high-reputation network to take on this role. E.g. something like the partnership on AI's safety-critical AI group (which has a number of long-term safety folk on it as well as near-term safety) or something similar. \nThe process might be normalised by focusing on reviewing/advising on risky/dual use AI research in then near-term - e.g. research that highlights new ways of doing adversarial attacks on current systems, or enables new surveillance capabilities (e.g. <a href=\"https://arxiv.org/abs/1808.07301)\">https://arxiv.org/abs/1808.07301)</a>. This could help set the precedents for, and establish the institutions needed for safety review for AGI-relevant research (right now I think it would be too hard to say in most cases what would constitute a 'risky' piece of research from an AGI perspective, given most of it for now would look like building blocks of fundamental research).</p>\n", "parentCommentId": null, "user": {"username": "Sean_o_h"}}, {"_id": "CQXAJ8x6qRbnxNgdA", "postedAt": "2018-08-30T17:20:45.284Z", "postId": "89B9tQzfJB4wLKyvF", "htmlBody": "<p><a href=\"https://medium.com/goodai-news/reflections-on-the-human-level-ai-conference-2018-3e78f10e3e13\">Additional reflections</a> from Marek, CEO of GoodAI, along with links to additional media coverage, <a href=\"https://futurism.com/should-evil-ai-research-be-published-five-experts-weigh-in/\">including one about whether or not to publish dangerous AI research</a>.</p>\n", "parentCommentId": null, "user": {"username": "gworley3"}}, {"_id": "5Ltgg5BuApubrBseZ", "postedAt": "2018-09-03T07:25:09.917Z", "postId": "89B9tQzfJB4wLKyvF", "htmlBody": "<blockquote>\n<p>I talked to two people who said things that indicated they lean EA, asked them about if they identified that way, and then they told me they didn't because they associate EA with Singer-style act utilitarianism and self-imposed poverty through maximizing donated income.</p>\n</blockquote>\n<p>This is interesting. What about them seemed EA-aligned? When I came across EA I was attracted to it because of the Singer-style act utilitarianism, and I've had worries that it's drifting too far from that and losing touch with the moral urgency that I felt in the early days. That said, I do think that actually trying to practice act utilitarianism leads to more mature views that suggest being careful about pushing ourselves too far.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "BPwQNpoFCMi8RnhAT", "postedAt": "2018-09-03T21:52:46.652Z", "postId": "89B9tQzfJB4wLKyvF", "htmlBody": "<p>Probably that they expressed interest in doing the most good possible for the world with their work.</p>\n", "parentCommentId": "5Ltgg5BuApubrBseZ", "user": {"username": "gworley3"}}]