[{"_id": "cL2K7nmaoaFHBg6HK", "postedAt": "2023-11-30T05:06:32.749Z", "postId": "89GdH5unSb2Sze6kj", "htmlBody": "<p>I resonate a lot with this. I have been thinking about writing an EAF post titled: \"EA is not special, nor should it be\". I have been thinking about this because a couple of months ago I was walking with my best friend, explaining to him for the first time what EA was. After my 5 minute intro he goes: \"But does not everyone do that? I mean, they should think about effectiveness and all that! It is the only sensible thing to do.\"<br><br>I think we can bring in a lot more people by reframing EA as being more about \"Doing good together\" rather than the current, a bit esoteric amalgamation of unusual ideas. To me, what is truly special about EA is that we together figure out how each one of us can have the most impact. My non-EA friends who want to make the world better (of which there are many!) do not collaborate much or seek advice on how they can have the most impact. I think this, at the core, is what sets EA apart. Neglectedness, tractability and importance is something that should not be weird and that most people will subscribe to. Perhaps counterfactual impact is also a bit unique, but I do not think we should lead so heavily with that. In fact, has my friends collaborated more when thinking about how to do good, I am pretty sure they too would have identified counterfactual impact.&nbsp;</p><p>EA, to me, is more like a \"community career service\".</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "YiGHKeXb87Dc8sjum", "postedAt": "2023-12-01T18:40:31.683Z", "postId": "89GdH5unSb2Sze6kj", "htmlBody": "<blockquote>\n<p>\"But does not everyone do that? I mean, they should think about effectiveness and all that! It is the only sensible thing to do.\"</p>\n</blockquote>\n<p>If only! I think from the inside (and, it seems, some people on the outside), EA can seem \"obvious\", at least in the core / fundamentals. But I think most philanthropy is not done like this still, even among people who spend a lot of time and effort on it.</p>\n<p>For example, the idea that we should compare between different cause areas or that we should be neutral between helping those in our own country vs. those abroad still seem relative minority positions to me.</p>\n", "parentCommentId": "cL2K7nmaoaFHBg6HK", "user": {"username": "BenMillwood"}}, {"_id": "MxmTucqR5KjPXrWce", "postedAt": "2023-12-09T09:05:29.384Z", "postId": "89GdH5unSb2Sze6kj", "htmlBody": "<p>I get this on a personal level, even if I don’t entirely agree.</p>\n<p>Ideally I’d be involved in all five, but I live pretty far from EA hubs (so not much chance to form relationships). My career is related to EA’s mission but as a small contractor it’s hard to choose effective charities (even though I would ideally love to focus on getting animal welfare initiatives funded), and I’m not sure a career change at this point in my life is practical for me.</p>\n<p>So do I count as actually EA? In my own mind, probably not, although I definitely want to be—I just don’t think I do enough to count. This is probably just imposter syndrome on my part, though.</p>\n<p>The one thing that I think is essential* to EA is the philosophy. Everything else (the social and professional communities, the effective methods, the moral obligation, etc.) flows from universalist utilitarianism, usually of the hedonic / suffering minimization kind (although the specific forms can differ slightly). If that’s not there, and if you’re coming from a totally different philosophical perspective (e.g., virtue ethics, some form of deontology not rooted in observable reality, etc.), to me it’s hard to call this EA. It seems like a house with no foundation. This was the main reason I didn’t join EA back in college, because I wasn’t ready to accept utilitarianism.</p>\n<p>I don’t know. Maybe I’m too idealistic?</p>\n<p>*in the sense of “if this isn’t there, you’re no longer doing EA”</p>\n", "parentCommentId": null, "user": {"username": "Hayven Jackson"}}]