[{"_id": "CzX9PWg7v5wQD6dLw", "postedAt": "2017-05-20T17:55:43.179Z", "postId": "8AABHubnwpoqZXABh", "htmlBody": "<p>Briefly, how do you define/describe 'Giving Games'?</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "sc7bgsazh7g9ir8Se", "postedAt": "2017-05-22T02:22:18.610Z", "postId": "8AABHubnwpoqZXABh", "htmlBody": "<p>Great piece!</p>\n", "parentCommentId": null, "user": {"username": "Gleb_T"}}, {"_id": "iBJPg3curm9KoQsm5", "postedAt": "2017-05-22T21:05:40.327Z", "postId": "8AABHubnwpoqZXABh", "htmlBody": "<p>Giving Games are workshops where participants hear a brief introduction to effective giving, learn about a few pre-selected charities, discuss their relative merits, and then make a real money donation (with money typically provided by an outside source) to their favorite.  More details <a href=\"https://www.thelifeyoucansave.org/Giving-Games/What-is-a-Giving-Game\">here</a>.</p>\n", "parentCommentId": "CzX9PWg7v5wQD6dLw", "user": {"username": "Jon_Behar"}}, {"_id": "4gwvut9dwbhbu85hC", "postedAt": "2017-05-24T17:14:23.435Z", "postId": "8AABHubnwpoqZXABh", "htmlBody": "<p>Thank you. It sounds somewhat similar to some economics experiments involving charity that I have seen, but of course with a different goal in mind.  I will look into this -- I am curious also about the evidence one might collect from such games, especially about which arguments people have found convincing, and which approaches have convinced people to choose the more effective charities.</p>\n", "parentCommentId": "iBJPg3curm9KoQsm5", "user": {"username": "david_reinstein"}}, {"_id": "2wh9kgXj7n2Efsdwb", "postedAt": "2017-05-24T21:22:27.346Z", "postId": "8AABHubnwpoqZXABh", "htmlBody": "<p>Yes, there’s definitely a quasi-experimental format, and we hope to use meta-analysis to draw lessons from all the different Giving Games we run in the field (which include a lot of natural variation).  Separately, we’re also working with a number of academic researchers on experimental collaborations.  Some of these involve studying the efficacy of the GG model, while others use the GG format as an experimental design to study other topics.  You can find more about experimentation with GG <a href=\"https://docs.google.com/presentation/d/1-q8I2DLccmd-HIv28O-33aYzd78266NwhS7McBcN8kA/edit#slide=id.p40\">here</a></p>\n", "parentCommentId": "4gwvut9dwbhbu85hC", "user": {"username": "Jon_Behar"}}, {"_id": "eFrSpS9k23A4Ma8yS", "postedAt": "2017-08-09T04:10:12.548Z", "postId": "8AABHubnwpoqZXABh", "htmlBody": "<p>Giving games are a great interactive activity and an awesome idea. A big component that may be being overlooked here is how participants vote on the charities. That plays a role in how the winner is determined as well as how the results are reflected. The voting method can also play a role in how participants assess candidate charities. To expand on the role of the voting method in giving games, I've put together an article. I hope this information brings even more success to giving games: <a href=\"https://medium.com/@aaronhamlin/let-the-giving-games-begin-d19a5ad91570\">https://medium.com/@aaronhamlin/let-the-giving-games-begin-d19a5ad91570</a></p>\n", "parentCommentId": null, "user": {"username": "aaronhamlin"}}, {"_id": "4RDuf4oDL2asqNJFF", "postedAt": "2018-09-08T19:56:46.376Z", "postId": "8AABHubnwpoqZXABh", "htmlBody": "<p>I'm about to put on a Giving Game for passerbyers in the middle of a student center building. AKA  <strong>Speed Giving game</strong> at a tabling booth. It will go on for however long my schedule will allow. This will be 3-4 hours at a time. (I am the only explicit-EA at my uni.)</p>\n<p>I plan on having a <strong>stack of $2 bills and three fish bowls</strong> for three different charities. Not many students will participate. (I've volunteered for the Engineers Without Borders booth in the same place, and few stop to see our stand. They are mainly going downstairs to eat.)</p>\n<p>From what I've read about Giving Games, the majority of people choose the effective charities. Although, I was told at my one and only EA meetup, that I could do <strong>two or three effective charities--just having them be different cause areas.</strong> This is what I plan to do. Do you see advantages of putting, say, the Make-A-Wish Foundation in there as a choice? To me it's just common sense to choose the stringently evaluated charities over non-transparent, little traction, etc--type charities. </p>\n<p>And so I don't want to insult other people's intelligence. The results of Giving Games with an &quot;ineffective&quot; charity, that I've read, show that the majority of people pick the more effective charities. It seems the &quot;bad&quot; charity is there as a <a href=\"https://www.urbandictionary.com/define.php?term=token\">token</a>. It appears the <strong>cause-area style of Giving Game</strong> is better (than winner-takes-all, tiered or proportional games for university students).</p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}]