[{"_id": "E4ppkyEJ5EasdBjuT", "postedAt": "2015-05-11T03:20:39.110Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<blockquote>\n<p>Entrepreneurship must involve an element of risk for the founder (i.e. luck). If it didn’t, no one would invest.</p>\n</blockquote>\n<p>Not really. To avoid principal-agent problems, it's only necessary that the founders share in the returns, <em>not</em> that some part of the returns is nondeterministic/unknowable-a-priori. For instance, if God appeared to you and Marc Andreessen and told you both (truthfully) that Health eFilings was going to be the next Facebook, I'm pretty sure Andreessen would invest, even though the outcome was now 100% knowable-a-priori.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "YpZdC4vk2bLeqWAs3", "postedAt": "2015-05-11T03:41:54.948Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<blockquote>\n<p>In which the authors performed a linear regression on companies’ profitability which included a coefficient for every single company (i.e. it was insanely biased towards finding that individual performance matters).</p>\n<p>This lead to the following conclusions:</p>\n<ol>\n<li>Your industry’s performance explains 19% of your company’s performance.</li>\n<li>Everything else about your company combined (growth, employees, IP,…) explains 32% of performance.</li>\n</ol>\n</blockquote>\n<p>I have some concerns with this paper:</p>\n<ol>\n<li>It's not about startups (average assets of included companies were something like $500m) and is highly weighted towards commoditized industries.</li>\n<li>They allow persistent shocks in unexplained variance, which is going to seriously attenuate any firm-specific effect, basically shifting some of the &quot;growth, employees, IP, ...&quot; effects into the unexplained variance.</li>\n<li>Finally, they don't mention logging dollar variables, which makes me <em>highly</em> suspicious (perhaps it's so obvious they don't need to mention it?)--dollars are power-law distributed, which means large values have an outsized influence on unlogged linear regression fits.</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "LmZfiNQL74PcTHPY2", "postedAt": "2015-05-11T10:24:49.297Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Very interesting and thorough post. Thanks for doing all this research and posting this.</p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "dvi2hSagkRk6nHn6j", "postedAt": "2015-05-11T11:44:45.650Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Thank Ben! I agree. This is why I said &quot;Because salaries are much more stable than business values&quot; - if that antecedent doesn't hold, then the conclusion doesn't either.</p>\n", "parentCommentId": "E4ppkyEJ5EasdBjuT", "user": {"username": "Ben_West"}}, {"_id": "h4y7vvqcLuAHkYYt8", "postedAt": "2015-05-11T12:53:51.480Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Thanks for the comments Ben! This paper is the canonical response to the poorly researched &quot;All great CEOs do these 10 things&quot; sorts of articles that Harvard Business Review etc. loves to publish, which is why I included it.</p>\n<ol>\n<li>Fair enough. If you look at table 4, you can see that the basic trend of &quot;industry matters more than segment specific effects&quot; holds for everything except, confusingly, for manufacturing. So while it may not be robust across different company sizes, it's at least robust across different industries. (And my intuition is that small companies are even more affected by industry downturns.)</li>\n<li>If I'm understanding you correctly, you think they should be using the Rumelt model described on pages 17 and 18? They ran that model on the data in table 4 with basically the same result (17% of variance explained by industry, 29% by company versus 19% and 32% with their model).</li>\n<li>Interesting, good point. I skimmed some citing articles and couldn't find anyone talking about this, so I'm not sure.</li>\n</ol>\n", "parentCommentId": "YpZdC4vk2bLeqWAs3", "user": {"username": "Ben_West"}}, {"_id": "3NyMbjZfYnyG3kQd3", "postedAt": "2015-05-11T14:38:33.396Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Very interesting, Ben. Thanks for posting.</p>\n<p>Here's an idea indirectly related to your article: The EA community has an incredible amount of intellectual talent. And it is unusual as far as communities go in that everyone's motive to make money is selfless. For that reason, I am indifferent to whether I make a million dollars all by myself or whether I make it with the help of 40 other people (aside from differences in the initial investment). Given that, isn't the EA community uniquely positioned to crowd source a business idea, fund that idea with an EA-friendly VC, hire EA types to run the business, and then give the vast majority of the returns (if any) to EA causes? Would it be a good investment for EA Ventures, for example, to organize an entrepreneurial think tank?</p>\n", "parentCommentId": null, "user": {"username": "mhpage"}}, {"_id": "3qxkZrPFSStFxycLo", "postedAt": "2015-05-11T17:18:50.519Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<blockquote>\n<p>Human capital variables have limited impact on startup performance, and the few significant effects are split equally between enhancing and impeding performance</p>\n</blockquote>\n<p>Isn't this what you would see if your &quot;human capital variables&quot; just don't have much predictive power? Their four human capital variables, described in section 4.3.3, seem to be the following: 1. number of people in management roles, 2. number of management roles held by the president, 3. number of prior startups which the founder was president of, 4. number of roles at other companies currently held by president.</p>\n<p>I'm not too surprised that these factors had limited predictive ability, or that their sign was mixed. Factor 3 doesn't seem to incorporate anything about the success of those startups, just their number.</p>\n<blockquote>\n<p> Entrepreneurship must involve an element of risk for the founder (i.e. luck). If it didn’t, no one would invest.</p>\n</blockquote>\n<p>I don't understand the logic here. In any domain with principal agent problems, you expect the principal to pay the agent a fraction of the output, i.e. for the agent to retain equity. In fact, financial theory suggests that startup founders should take more equity when performance was more dependent on their behavior / skill, and should take less equity when performance is more out of their control. So the fact that startup founders receive variable payouts is direct evidence against the luck hypothesis.</p>\n<p>I agree this why startup founders have such a wide spread in their compensation, but I don't think it helps attribute that spread to luck vs. skill.</p>\n<blockquote>\n<p>But the point is that skill in entrepreneurship is less about being able to steer your ship through stormy waters and more about checking the weather before you set off.</p>\n</blockquote>\n<p>It seems like this is mostly a claim about what skills are useful, rather than about the importance of skill. The fact that smartphone use was high was not out of Uber's control, as you point out, since they founded the businesses when it looked reasonable. So it's strange to call it a &quot;factor completely outside of the founder's control.&quot;</p>\n<blockquote>\n<p>Your industry’s performance explains 19% of your company’s performance.</p>\n</blockquote>\n<p>This looks like a surprisingly small effect! Even a 50-50 split would leave room for the best entrepreneurs to succeed with very high probability if dropped into a random industry. You say:</p>\n<blockquote>\n<p>my intuition is that small companies are even more affected by industry downturns.</p>\n</blockquote>\n<p>This may be true (though I have the opposite intuition), but even if so it seems almost guaranteed to be a smaller share of the variance---just because there is so much more variance.</p>\n<p>More importantly, variation in performance of an industry has a huge impact on the returns to industry-specific capital, even in efficient-market land. But in efficient-market land, it's not very important as a consideration about what startup to start, because there is more competition in industries that are poised to grow.</p>\n<blockquote>\n<p>One of the differentiators between entrepreneurs and everyone else is that entrepreneurs have a stronger illusion of control, believing that they can accurately predict things like when competitors will enter the market.</p>\n</blockquote>\n<p>The study in question showed that entrepreneurs believe they are better at predicting things. It assumed that this was because they were more biased rather than being better predictors, but both explanations seem plausible. Similarly, it showed that entrepreneurs had better views of themselves, and assumed that was due to overconfidence rather than ability, but didn't try to distinguish the two possibilities.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "qXMnCn9kEsgiTJkEe", "postedAt": "2015-05-12T00:14:27.896Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Your post read: &quot;This is important so I’m going to call it out in very clear terms: Entrepreneurship must involve an element of risk for the founder (i.e. luck). If it didn’t, no one would invest.&quot; You weren't very clear about the fact that this had &quot;salaries are much more [deterministic] than business values&quot; as a possibly-false antecedent.* (It needs to be a possibly false antecedent because that's exactly what you're trying to prove in the rest of the essay. To assert it here would beg the question.)</p>\n", "parentCommentId": "dvi2hSagkRk6nHn6j", "user": {"username": "Ben_Kuhn"}}, {"_id": "Lb9PSAgzvb4fNochx", "postedAt": "2015-05-12T00:26:30.185Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<blockquote>\n<p>So while it may not be robust across different company sizes, it's at least robust across different industries.</p>\n</blockquote>\n<p>This is irrelevant to your point if it doesn't hold across sizes, though. Compustat's data is entirely on public companies. I really don't see any reason to expect this to generalize to tech startups.</p>\n<p>In fact, one would expect that <em>most</em> of the influence of founder/IP/team/whatever would be concentrated in navigating from startup to IPO, rather than in post-IPO profits. If the fixed effect is already on the order of 30% of variance post-IPO, I think it's hard to defend the primarily-lottery-ticket interpretation in the pre-IPO regime.</p>\n", "parentCommentId": "h4y7vvqcLuAHkYYt8", "user": {"username": "Ben_Kuhn"}}, {"_id": "p6GKghMupR66bYfy5", "postedAt": "2015-05-12T00:55:34.328Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Thanks for the feedback Paul.</p>\n<blockquote>\n<p>I'm not too surprised that these factors had limited predictive ability, or that their sign was mixed. Factor 3 doesn't seem to incorporate anything about the success of those startups, just their number.</p>\n</blockquote>\n<p>Factor 3's non-significance tells us that, if there is such a thing as founding skill it's not a skill which improves through practice. This certainly doesn't disprove the skill hypothesis, but it's a mark against.</p>\n<p>For what it's worth: anecdotally these are major factors that VCs look at, so it's very surprising to people in the startup world that they don't correlate with success. (To the extent that most investors bluntly tell me that they don't believe the result.)</p>\n<blockquote>\n<p>I agree this why startup founders have such a wide spread in their compensation, but I don't think it helps attribute that spread to luck vs. skill.</p>\n</blockquote>\n<p>I don't think I understand. To me a good formalization of &quot;luck&quot; is &quot;ex-ante variance&quot; – I think you disagree?</p>\n<blockquote>\n<p>This looks like a surprisingly small effect! Even a 50-50 split would leave room for the best entrepreneurs to succeed with very high probability if dropped into a random industry.</p>\n</blockquote>\n<p>Keep in mind that most of the variance is still unexplained; it's not 19% industry and 81% founder.</p>\n<blockquote>\n<p>But in efficient-market land, it's not very important as a consideration about what startup to start, because there is more competition in industries that are poised to grow.</p>\n</blockquote>\n<p>I agree that under perfect competition profits are zero, and that this mechanism is enforced by increased competition in profitable sectors, but it seems weird to assume perfect competition here? I think I'm not understanding you again.</p>\n<blockquote>\n<p>The study in question showed that entrepreneurs believe they are better at predicting things. It assumed that this was because they were more biased rather than being better predictors, but both explanations seem plausible. Similarly, it showed that entrepreneurs had better views of themselves, and assumed that was due to overconfidence rather than ability, but didn't try to distinguish the two possibilities.</p>\n</blockquote>\n<p>I don't think this is a fair summary of their paper. For example, they asked people to give 90% confidence intervals for various things, and recorded how frequently the true answer was outside that range. This seems to me to be a legitimate definition of &quot;overconfident&quot;.</p>\n<p>The authors also cite evidence that people's answers to questions like &quot;I could succeed at making this venture a success, even though many other managers would fail&quot; is uncorrelated with their actual ability, although I agree that it's not 100% clear.</p>\n", "parentCommentId": "3qxkZrPFSStFxycLo", "user": {"username": "Ben_West"}}, {"_id": "ehGwEbBpfXkmif4Fw", "postedAt": "2015-05-12T00:58:10.432Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>I'm not sure I understand. It's just empirically true that business values fluctuate a lot more than salaries, so while it's a <em>possibly</em> false antecedent it just <em>isn't</em> false. I'm not sure I understand how you think that should be indicated?</p>\n", "parentCommentId": "qXMnCn9kEsgiTJkEe", "user": {"username": "Ben_West"}}, {"_id": "owkmMbiXxansoCAsq", "postedAt": "2015-05-12T01:22:46.200Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Overall, I agree with the point that this data set may not be valid, and I sincerely appreciate you pointing that out. I will have to do more research and figure out what can be done with that section. </p>\n<p>However, I disagree with the statement:</p>\n<blockquote>\n<p>In fact, one would expect that most of the influence of founder/IP/team/whatever would be concentrated in navigating from startup to IPO, rather than in post-IPO profits.</p>\n</blockquote>\n<p>Startups pivot all the time, and are constantly changing their products. Therefore we should expect that a startup's profitability in year T doesn't predict very well their profitability in year T+1. </p>\n<p>Big companies almost never change, and my experience is that a large part of the reason they make sales this year is because of the sales, products etc. they made last year. Therefore we should expect their revenue stream to be highly correlated over time.</p>\n<p>So I think the big company numbers place an upper bound on the results you would see from small companies, not a lower one.</p>\n<p>(One way of coming to this conclusion that I assume is uncontroversial is just to note that the valuations of startups fluctuate a lot more rapidly than the valuations of public companies.)</p>\n<p>Let me know what you think about this, and your thoughts around including some language about this in that section.</p>\n", "parentCommentId": "Lb9PSAgzvb4fNochx", "user": {"username": "Ben_West"}}, {"_id": "sebH5q6qzzGzHQ48q", "postedAt": "2015-05-12T03:12:18.047Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<blockquote>\n<p>Startups pivot all the time, and are constantly changing their products. Therefore we should expect that a startup's profitability in year T doesn't predict very well their profitability in year T+1.</p>\n</blockquote>\n<p>Yearly profitability isn't the right measure before IPO; most startups aren't optimizing for profitability (and indeed never become profitable until after IPO). High losses can indicate failure, or they can indicate rapid scaling of a successful model. So unpredictable profits aren't really evidence of eventual success being unpredictable. Even if eventual success was relatively predictable we would expect profits to fluctuate along the way depending on the company's specific growth trajectory.</p>\n", "parentCommentId": "owkmMbiXxansoCAsq", "user": {"username": "Ben_Kuhn"}}, {"_id": "45DqxvnTkjnP2DwMm", "postedAt": "2015-05-12T11:32:58.063Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Sure. For better or for worse that's what the paper I cited measured, so that's why I was using that metric.</p>\n<p>If you prefer though: startups have significantly higher fluctuations in valuation than public companies, and presumably valuation captures whatever metrics are relevant.</p>\n", "parentCommentId": "sebH5q6qzzGzHQ48q", "user": {"username": "Ben_West"}}, {"_id": "dapeXKNLmSEHZFJHP", "postedAt": "2015-05-12T21:36:15.983Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<blockquote>\n<p>For example, they asked people to give 90% confidence intervals for various things, and recorded how frequently the true answer was outside that range. This seems to me to be a legitimate definition of &quot;overconfident&quot;.</p>\n</blockquote>\n<p>I agree that this is a better measure of overconfidence. But it looks like startup founders did insignificantly better at this task, rather than doing worse at it. I may be misreading Table 1.</p>\n<p>That said, I also agree that startup founders tend to be unrealistically optimistic about their own prospects (or at least answer survey questions in ways that are unreallistically optimistic).</p>\n<blockquote>\n<p>To me a good formalization of &quot;luck&quot; is &quot;ex-ante variance&quot;</p>\n</blockquote>\n<p>Suppose that each startup's valuation is a deterministic function of the founder's skill (which is known to the founder). The we expect startup founders to be paid mostly in equity. And we could also see great variation in founder compensation. But I think we would agree that there is no luck in this case---it seems like exactly the kind of model you are trying to argue against.</p>\n<blockquote>\n<p>Factor 3's non-significance tells us that, if there is such a thing as founding skill it's not a skill which improves through practice. </p>\n</blockquote>\n<p>I'm skeptical that the study has enough power to detect a realistic effect for this factor, given that it's a small piece of human capital and all of the measures are extremely noisy. </p>\n<p>I also have concerns about confounding. For example, prior foundings had the largest negative coefficient of any variable on VC funding. The author's interpretation is: &quot;presidents who have experienced entrepreneurial failures in the past may find it more difficult to obtain VC financing for future startups.&quot; I don't know if that's the real explanation, but I'm pretty hesitant to make causal inferences in this case---whatever confounder produced that large negative effect, I expect it swamps a modest practice effect.</p>\n<blockquote>\n<p> but it seems weird to assume perfect competition here? </p>\n</blockquote>\n<p>I expect the real world is somewhere in between perfect competition and no competition.</p>\n", "parentCommentId": "p6GKghMupR66bYfy5", "user": {"username": "Paul_Christiano"}}, {"_id": "2kFqPvwD3HhuQ3XoN", "postedAt": "2015-05-13T07:14:35.744Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>You said &quot;salaries are much more stable than business values&quot; above but for your conclusion to go through you need salaries not only to be more stable, but more <em>ex-ante predictable</em>. If business values fluctuate more than salaries, but the fluctuation is ex-ante predictable, then there is no element of luck in founding a startup (and to the extent the ex-ante variance is small, the role of luck is small).</p>\n<p>On the other hand, the ex-ante variance being large is exactly what you're trying to prove in the rest of the post, so it would be circular to assume it there and then use this to support your subsequent arguments in favor of it.</p>\n", "parentCommentId": "ehGwEbBpfXkmif4Fw", "user": {"username": "Ben_Kuhn"}}, {"_id": "pF8ZZEj8BZnP9gMTN", "postedAt": "2015-05-13T13:03:45.945Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<blockquote>\n<p>But it looks like startup founders did insignificantly better at this task, rather than doing worse at it. I may be misreading Table 1.</p>\n</blockquote>\n<p>No, you are correct and I misread your statement. Entrepreneurs don't appear to have this sort of overconfidence (at least according to this study's results). They (we) appeared to have more self aggrandizing confidence.</p>\n<blockquote>\n<p>But I think we would agree that there is no luck in this case---it seems like exactly the kind of model you are trying to argue against.</p>\n</blockquote>\n<p>Cool, I thought you might be making this point but I didn't want to put words in your mouth.</p>\n<p>It's unquestionably true that part of the variance is explained by the fact that any jackass can call themselves an entrepreneur and therefore the set of &quot;entrepreneurs&quot; has a greater range of skills than e.g. the set of software developers. But I'm skeptical that this is the entire reason; to cite a fact from above: an entrepreneur who has a successful exit only has a 30% chance of success in their next venture. It seems unlikely that entrepreneurs' skills decline rapidly after a successful exit.</p>\n<blockquote>\n<p>whatever confounder produced that large negative effect, I expect it swamps a modest practice effect.</p>\n</blockquote>\n<p>I would agree with this more generally: there are probably modest skill effects, but they are incredibly hard to define and are swamped by the nosiness of startups. Especially once you look at &quot;qualified&quot; founders (e.g. those with venture backing), the skill differentiation explains a very small piece of the variance.</p>\n<p>Quoth Gompers et al.:</p>\n<p>&quot;While it may be better to be lucky than smart, the evidence presented here indicates that being smart has value too.&quot;</p>\n<blockquote>\n<p>I expect the real world is somewhere in between perfect competition and no competition.</p>\n</blockquote>\n<p>Hard to argue with that :-)</p>\n<p>I'm still not entirely sure what lesson you were drawing from the efficient market hypothesis, but perhaps it doesn't matter.</p>\n", "parentCommentId": "dapeXKNLmSEHZFJHP", "user": {"username": "Ben_West"}}, {"_id": "TpmqtFWntBNPSzPoJ", "postedAt": "2015-05-13T13:07:40.289Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Huh, interesting point! I will have to reread my copy of The Economics of Entrepreneurship; I wonder if they addressed that or just said &quot;adverse selection&quot; and left it at that.</p>\n", "parentCommentId": "2kFqPvwD3HhuQ3XoN", "user": {"username": "Ben_West"}}, {"_id": "Qn8i4kCcJfnWtPSi7", "postedAt": "2015-05-13T14:11:42.827Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Since so much luck is involved in start-up success, does that mean we might be too focused on creating <em>better</em> EAs when we should be focused more on just creating <em>more</em> EAs? This could apply more broadly than just start-ups, to things like politics, academia, or other forms of influence. Maybe we just need a shotgun approach.</p>\n", "parentCommentId": null, "user": {"username": "redmoonsoaring"}}, {"_id": "rmQdwMDBdQfjWZ8Bj", "postedAt": "2015-05-13T14:24:38.212Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>My thoughts exactly - except \n&quot;Your industry’s performance explains 19% of your company’s performance.</p>\n<p>This looks like a surprisingly small effect! Even a 50-50 split would leave room for the best entrepreneurs to succeed with very high probability if dropped into a random industry.&quot;</p>\n<p>doesn't take account of the proportion of businesses that fail - if 10% (as I understand it) succeed according to some measure, then a 50-50 split would leave a fairly small probability if dropped into a random industry, as would 80-20.</p>\n", "parentCommentId": "3qxkZrPFSStFxycLo", "user": {"username": "tomstocker"}}, {"_id": "NaqRc6Acyu3j2BYp4", "postedAt": "2015-05-14T06:04:28.466Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Thanks for engaging with objections, and sorry for being so critical!</p>\n<p>It's possible we just have a quantitative disagreement. </p>\n<p>For example, I agree that there are very few people who could start a successful startup with high reliability. But quantitatively, I don't know how much variation in skill there is and how important it is.  I think the most compelling statistic here is the 30% IPO rate for second startup (given success) vs. 18% IPO rate for first startups. But that seems to me like a pretty big effect, so I'm not sure quite what to make of it.</p>\n<p>I think you could just as well argue &quot;Submitting an academic paper to a good conference is a lottery ticket.&quot; (In fact, the numbers <a href=\"http://hunch.net/?p=467864\">are comparable</a>). In some sense this is true, but I still wouldn't say &quot;The idea that there are some excellent papers is just factually wrong.&quot;</p>\n", "parentCommentId": "pF8ZZEj8BZnP9gMTN", "user": {"username": "Paul_Christiano"}}, {"_id": "82k9orthuoeYHDaQo", "postedAt": "2015-05-20T20:31:23.549Z", "postId": "8AHxqgNHFRRt6ENN2", "htmlBody": "<p>Thanks Paul for the feedback, and for the reminder that we are criticizing ideas and not people :-)</p>\n<p>The thing with academic papers was really interesting, and gave me pause. I would point out two similarities:</p>\n<ol>\n<li>The set of all papers submitted to a specific conference is a lot more homogeneous than the set of all papers period. Similarly, the set of all entrepreneurs who get VC funding is a lot more homogenous than the set of all people who think about starting companies. So the statement &quot;performance within some limited subset is mostly due to chance&quot; isn't necessarily conflicting with the idea that there is such a thing as entrepreneurial skill/paper quality.</li>\n<li>Instead of drawing a lesson that there is no such thing as skill we might conclude that acceptance to a conference or having an IPO is just not a very good indicator of skill.</li>\n</ol>\n<p>I also agree that this is largely a quantitative disagreement. I've spent the last year being surrounded by people who believe that variance in startups is completely determined by the founder's skill, and that gives me a framing for what I write.</p>\n", "parentCommentId": "NaqRc6Acyu3j2BYp4", "user": {"username": "Ben_West"}}]