[{"_id": "NBGJPuY2WebgiH4pA", "postedAt": "2017-05-27T12:24:47.958Z", "postId": "8B3bwtoK4K4XD2GE4", "htmlBody": "<p>For banks and big corporations to want to join, there probably needs to be a greater sense of assurance that their signing up will actually lead to the publicity you suggest there would be. That in mind, it's plausible that 1. cancer charities would do better than an investment in something westerners aren't personally affected by, such as schistosomiasis, and 2. that one big check to one big organization will garner more attention than many checks to a myriad of organizations. To hammer home that latter point: you could refer to past examples where big donations to some charity lead to a big press event where the donor is thanked extensively (a google browse should garner plenty of results). Lastly, it's plausible that big organizations are more likely to listen and cooperate if they are asked by a big, known charity, which you will have contacted and gotten to initiate that process, rather than some obscure, new, small organization without any track-record whatsoever. </p>\n<p>Have you considered implementing this in already existing charity structures of organizations. Quite a few organizations already have partnerships, e.g.: <a href=\"https://fundraising.co.uk/2016/07/15/deloitte-raises-2-6m-three-years-three-charities/\">https://fundraising.co.uk/2016/07/15/deloitte-raises-2-6m-three-years-three-charities/</a>, and this could fit neatly into that. </p>\n", "parentCommentId": null, "user": {"username": "DardanBastiaan"}}, {"_id": "i9MtTwCeAipsrTLg5", "postedAt": "2017-06-05T12:00:21.382Z", "postId": "8B3bwtoK4K4XD2GE4", "htmlBody": "<blockquote>\n<p>For banks and big corporations to want to join, there probably needs to be a greater sense of assurance that their signing up will actually lead to the publicity you suggest there would be. </p>\n</blockquote>\n<p>I agree. It would be good to think of ways to line up endorsement and positive publicity in advance. Still, I think it depends on the cost-benefit calculation. If they can try this without much effort or risk, they might be willing to do so internally and roll out the PR gradually.</p>\n<blockquote>\n<p>That in mind, it's plausible that 1. cancer charities would do better than an investment in something westerners aren't personally affected by, such as schistosomiasis, and 2. that one big check to one big organization will garner more attention than many checks to a myriad of organizations.</p>\n</blockquote>\n<p>Domestic charities and charities like CRUK  will typically tend to do better in general, I suspect. However, i.  increasing the overall volume of giving should increase effective giving at least proportionally and ii. more so if we focus on this in the promotions and work with EA supporters in organisations. </p>\n<p>Developing approaches to get people outside of the EA movement to support EA charities is a separate and very important one (e.g., Deloitte could have at least one international/effective charity partnership. I'm working on this as well (I hope to update soon about the wiki and other things people can engage in.) </p>\n<p>I would be very keen to work with a big, known charity. It may not be the highest-rated EA charity, but it would be good to partner with one that is at least somewhere on the EA spectrum even if not perfect (an Oxfam, MSF, Comic Relief, etc). </p>\n", "parentCommentId": "NBGJPuY2WebgiH4pA", "user": {"username": "david_reinstein"}}]