[{"_id": "n4ZJNKcfNxJCLdjfh", "postedAt": "2024-02-29T23:18:06.085Z", "postId": "8ByxD5aCrCngbKzmj", "htmlBody": "<p>Congrats! Can we see the videos/collateral you created somewhere?</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "RccygKoAKyJPThPZG", "postedAt": "2024-03-01T01:50:30.514Z", "postId": "8ByxD5aCrCngbKzmj", "htmlBody": "<p>Yes, absolutely. You can see a version here: <a href=\"https://www.youtube.com/shorts/K4YBAzACTRU?feature=share\">https://www.youtube.com/shorts/K4YBAzACTRU?feature=share</a><br><br>It is linked in the doc above the table. I've just made bold to make more clear.</p>", "parentCommentId": "n4ZJNKcfNxJCLdjfh", "user": {"username": "J_Odene_UF"}}, {"_id": "LzTDqEPSwfmKC35tP", "postedAt": "2024-03-01T04:49:23.737Z", "postId": "8ByxD5aCrCngbKzmj", "htmlBody": "<p>Thanks! My apologies for missing that.</p>", "parentCommentId": "RccygKoAKyJPThPZG", "user": {"username": "Ben_West"}}, {"_id": "rgHJoavFm9m8z5M5a", "postedAt": "2024-03-01T09:52:25.584Z", "postId": "8ByxD5aCrCngbKzmj", "htmlBody": "<p>Really cool experiment!</p><p>Was it possible to track to what extent the more engaging ads drove conversions? (donations made, pledges taken, etc.)</p><p>My hypothesis would be the more engaging ads get more people onto the website, but those people will be much less likely to follow through (and especially with significant amounts), than for example a very targeted and nerdy ad aimed at wealthy tech workers.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "8MGwZYJuX3BCXRJro", "postedAt": "2024-03-04T02:51:42.022Z", "postId": "8ByxD5aCrCngbKzmj", "htmlBody": "<p>Hey, thanks for reading.</p><p>The objective for the campaign was increase the brand awareness (taking people from 'never heard of GWWC' to 'remember that they exist') and not conversion (taking people from 'remember that they exist' to 'doing something'). We would never expect people who had never heard of GWWC to hear about them for the first time and then pledge. It's going to take time to warm them up. It's also not part of our campaign test, or within our control the ability of the site to convert traffic.<br><br>That said, it's important to remember long-term branding work can produce conversion results, and in this case, we delivered 3x more pledge page views (for 4 mins and more) than organic traffic, and ~80% of all traffic hitting the pledge page. &nbsp;So we were targeting engaged and interested people (as compared to organic traffic).</p><p>It's too early to know the pledge levels of this new audience as it'll take time and continued engagement to bring them along (we'd expect ~7 interactions before they act), but it's a good story that we're bringing a much larger audience to the table.</p><p>What's the basis of your hypothesis?</p>", "parentCommentId": "rgHJoavFm9m8z5M5a", "user": {"username": "J_Odene_UF"}}, {"_id": "3LFrdbcZgsvGfsrFh", "postedAt": "2024-03-06T23:24:39.746Z", "postId": "8ByxD5aCrCngbKzmj", "htmlBody": "<p>It's great to have the positive example, and it'd be great too to have some concrete negative example of the ads that were unsuccessful.&nbsp;<br>Or maybe it's not really that they weren't unsuccessful but rather just \"ambient-level\"?</p>", "parentCommentId": null, "user": {"username": "hmijail"}}, {"_id": "mbwj5YBMgasaEkY2v", "postedAt": "2024-03-07T07:47:41.380Z", "postId": "8ByxD5aCrCngbKzmj", "htmlBody": "<p>Hey, thanks for reading.</p><p>Yeah, we wouldn't say that they were unsuccessful, just less-so.</p><p>In a broad sense, we'd expect ads that were poorly branded, rational arguments only and lacking in intrigue and interest as 'unsuccessful'</p>", "parentCommentId": "3LFrdbcZgsvGfsrFh", "user": {"username": "J_Odene_UF"}}]