[{"_id": "idhdvfFpfX272AcKP", "postedAt": "2022-12-09T15:08:39.177Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p>Does R.I.C.E. have an actual website with basic information about the program and the organization (e.g. the federal tax ID)? I wasn't able to find one based on googling and GiveWell doesn't link to one . If you don't have a website currently, I would suspect that the single best thing you could do get more donations from individuals would be to put one together. Going with something like squarespace, you could likely be up and running within a day and have hosting costs in the ~$30/month range. That's likely going to be a lot better for getting donors than just a paypal link.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "YuKethDtA4ALuwyWk", "postedAt": "2022-12-09T15:20:22.236Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p>That's also likely to be necessary for an organization to qualify for the 10% facts-and-circumstances test for avoiding characterization as a private foundation -- you need either 33% countable public support or 10% plus facts and circumstances showing that you are publicly supported (which IIRC requires showing repeated/continuous efforts to raise funds from the general public).</p>", "parentCommentId": "idhdvfFpfX272AcKP", "user": {"username": "Jason"}}, {"_id": "XBM8jJKLBmSZbkwyp", "postedAt": "2022-12-09T15:24:02.590Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p><a href=\" https://riceinstitute.org/\">Here's</a> the website, and <a href=\"https://github.com/riceinstitute/content/blob/release/501c3-approval-letter.pdf\">here's</a> their 501(c)3 &nbsp;approval letter. They seem to have a <a href=\"https://riceinstitute.org/maternal\">page</a> describing their maternal health research, <s>but not their involvement on the ground with the KMC program.</s></p><p>EDIT: the maternal health page has the following paragraph:&nbsp;</p><p>\"In recent months, r.i.c.e. researchers are pursuing a project to promote Breastfeeding and Care Practices for Newborn and Low Birthweight Babies in Uttar Pradesh. The program is based on our <a href=\"https://www.epw.in/engage/article/challenge-breastfeeding-sensitisation\">earlier work</a>. The program will test messages for breastfeeding and newborn care counseling to family members of newborns. It also intends to identify the existing systemic gaps in an adequate newborn care in hospitals and at home, and how can practitioners and caregivers overcome those.\"</p><p><br>&nbsp;</p>", "parentCommentId": "idhdvfFpfX272AcKP", "user": {"username": "km"}}, {"_id": "mNY7xLhDMwajT2487", "postedAt": "2022-12-09T15:29:30.160Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p>I'm confused; my understanding is that \"the 2% limitation doesn't apply to contributions from organizations qualifying as publicly supported organizations under section 170(b)(1)(A)(vi)\" (quoting p. 6 of the Schedule A <a href=\"https://www.irs.gov/pub/irs-pdf/i990sa.pdf\">instructions</a>) and GiveWell has posted a 2019 <a href=\"https://files.givewell.org/files/ClearFund/IRS_Determination_Affirmation_Letter.pdf\">letter from IRS</a> affirming that it is a 170(b)(1)(A)(vi) organization. Is GiveWell indicating that this classification is no longer accurate, or am I missing something?</p><p>Definitely consult your own legal or accounting advisers rather than relying on an offhand comment from some random person off the Internet who has completed one Schedule A in his life. But you may not have any reason to worry here.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "Yd4FPwPaQtAanXGQp", "postedAt": "2022-12-09T18:12:50.062Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p>Thank you so much, &nbsp;Jason! Your comment has been extremely helpful.</p><p>To clarify, no, GiveWell has not indicated that its classification as a 170(b)(1)(A)(vi) organization is no longer accurate!</p>", "parentCommentId": "mNY7xLhDMwajT2487", "user": {"username": "Nathan_Franz"}}, {"_id": "oTTMnC7DvEfT75DaE", "postedAt": "2022-12-09T18:20:05.603Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p>Thank you very much!  We are excited to learn about this!</p>\n", "parentCommentId": "mNY7xLhDMwajT2487", "user": {"username": "deanspears"}}, {"_id": "gbQKWy8ujHzh6b7vQ", "postedAt": "2022-12-09T18:20:13.425Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p>Oh great! I don't know why I had a hard time finding that!</p>", "parentCommentId": "XBM8jJKLBmSZbkwyp", "user": {"username": "MHR"}}, {"_id": "xSDfEHyYc5ortRxhc", "postedAt": "2022-12-10T07:50:18.942Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p><strong>Post summary</strong> (feel free to suggest edits!):<br>r.i.c.e collaborates with the Government of Uttar Pradesh and an organization in India to promote&nbsp;<a href=\"https://www.theguardian.com/lifeandstyle/2022/nov/15/kangaroo-mother-care-best-for-early-and-low-weight-babies-says-who\"><u>Kangaroo Mother Care</u></a> (KMC), which is a well-established tool for increasing survival rates of low birth weight babies. They developed a public-private partnership to cause the government’s KMC guidelines to be implemented cost-effectively in a public hospital.</p><p>Their best estimate based on a combination of implementation costs and pre-existing research is that it costs ~$1.8K per life saved. However they are unsure and are planning to compare survival rates in the hospital targeted vs. others in the region next year.<br><br>Both Founders Pledge and GiveWell have made investments this year. They welcome further support - you can donate&nbsp;<a href=\"https://paypal.me/riceinstitute?country.x=US&amp;locale.x=en_US\"><u>here</u></a>. Donations will help maintain the program, scale it up, do better impact evaluation, and potentially expand to other hospitals if they find good implementation partners.</p><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "DbLGb2LowuHfep33J", "postedAt": "2022-12-18T02:34:08.681Z", "postId": "8CRFTxrRLiizypyBu", "htmlBody": "<p>Hi, everyone!  Just to circle back and close the loop: GiveWell has confirmed to us that their legal organization is indeed a public charity, so r.i.c.e. will not have a tipping problem.  A big thank you to Jason for figuring that out!  We still believe we can put marginal funds to great use, but it is not urgent in this particular \"tipping\" way.   Thanks, everyone!</p>\n", "parentCommentId": null, "user": {"username": "deanspears"}}]