[{"_id": "J3CpRmEfN9xJFXo9m", "postedAt": "2023-05-26T10:41:00.335Z", "postId": "8cri5fZPkxP6vDiCH", "htmlBody": "<p>In case someone finds it interesting, Jonas Schuett (one of the authors) shared a thread about this: <a href=\"https://twitter.com/jonasschuett/status/1658025266541654019?s=20\">https://twitter.com/jonasschuett/status/1658025266541654019?s=20</a>&nbsp;</p><p>He says that the thread is to discuss the survey's:</p><ul><li>Purpose&nbsp;</li><li>Main findings&nbsp;<ul><li>\"Our main finding is that there is already broad support for many practices!\"</li><li>\"Interestingly, respondents from AGI labs had significantly higher mean agreement with statements than respondents from academia and civil society.\"</li></ul></li><li>Sample (response rate 55.4%, 51 responses)</li><li>Questions&nbsp;</li><li>Limitations&nbsp;<ul><li>E.g.: \"We likely missed leading experts in our sampling frame that should have been surveyed.\" and \"The abstract framing of the statements probably led to higher levels of agreement.\"</li></ul></li><li>Policy implications</li></ul><p>&nbsp;</p><p>Also, there's a nice graphic from the paper in the thread:&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/J3CpRmEfN9xJFXo9m/ydmgxrtikouyulc6sgto\" alt=\"Image\"></figure>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "8yBJnKcdCK2uwkSyn", "postedAt": "2023-05-26T11:03:18.214Z", "postId": "8cri5fZPkxP6vDiCH", "htmlBody": "<p>I'm surprised at how much agreement there is about the top ideas. The following ideas all got &gt;70% \"Strongly agree\" and at most \"3%\" \"strong disagree\" (note that not everyone answered each question, although most of these 14 did have all 51 responses):</p><ol><li>Pre-deployment risk assessment. AGI labs should take extensive measures to identify, analyze, and evaluate risks from powerful models before deploying them.</li><li>Dangerous capability evaluations. AGI labs should run evaluations to assess their models’ dangerous capabilities (e.g. misuse potential, ability to manipulate, and power-seeking behavior).</li><li>Third-party model audits. AGI labs should commission third-party model audits before deploying powerful models.</li><li>Safety restrictions. AGI labs should establish appropriate safety restrictions for powerful models after deployment (e.g. restrictions on who can use the model, how they can use the model, and whether the model can access the internet).</li><li>Red teaming. AGI labs should commission external red teams before deploying powerful models.</li><li>Monitor systems and their uses. AGI labs should closely monitor deployed systems, including how they are used and what impact they have on society.</li><li>Alignment techniques. AGI labs should implement state-of-the-art safety and alignment techniques.</li><li>Security incident response plan. AGI labs should have a plan for how they respond to security incidents (e.g. cyberattacks).</li><li>Post-deployment evaluations. AGI labs should continually evaluate models for dangerous capabilities after deployment, taking into account new information about the model’s capabilities and how it is being used.</li><li>Report safety incidents. AGI labs should report accidents and near misses to appropriate state actors and other AGI labs (e.g. via an AI incident database).</li><li>Safety vs capabilities. A significant fraction of employees of AGI labs should work on enhancing model safety and alignment rather than capabilities.</li><li>Internal review before publication. Before publishing research, AGI labs should conduct an internal review to assess potential harms.</li><li>Pre-training risk assessment. AGI labs should conduct a risk assessment before training powerful models.</li><li>Emergency response plan. AGI labs should have and practice implementing an emergency response plan. This might include switching off systems, overriding their outputs, or restricting access.</li></ol><p>The ideas that had<strong> the most disagreement</strong> seem to be:&nbsp;</p><ul><li>49 (48 in the graphic above) - Avoid capabilities jumps. AGI labs should not deploy models that are much more capable than any existing models.<ul><li>11% somewhat disagree, 5% strong disagree, and only 22% strong agree, 35% somewhat agree, 37 responses</li></ul></li><li>48 (49 in the graphic above) - Inter-lab scrutiny. AGI labs should allow researchers from other labs to scrutinize powerful models before deployment.<ul><li>13% somewhat disagree, 3% strong disagree, 41% somewhat agree, 18% strong agree, 37 responses</li></ul></li><li>37 - No [unsafe] open-sourcing. AGI labs should not open-source powerful models, unless they can demonstrate that it is sufficiently safe to do so.<ul><li>14% (somewhat and strong) disagree, 57% strong-agree, and 27% somewhat-agree, 51 responses</li></ul></li><li>42 - Treat updates similarly to new models. AGI labs should treat significant updates to a deployed model (e.g. additional fine-tuning) similarly to its initial development and deployment. In particular, they should repeat the pre-deployment risk assessment.<ul><li>14% somewhat disagree, but 45% strong agree and 35% somewhat agree, 51 responses</li></ul></li><li>50 - Notify other labs. AGI labs should notify other labs before deploying powerful models.<ul><li>11% somewhat disagree, 3% strong disagree, 11% strong agree, 32% somewhat disagree, 38 responses</li></ul></li></ul><p>And</p><ul><li>21 - Security standards. AGI labs should comply with information security standards (e.g. ISO/IEC 27001 or NIST Cybersecurity Framework). These standards need to be tailored to an AGI context.<ul><li>Got the most strong disagreement: 6% (51 responses), although it's overall still popular (61% strong-agree, 18% somewhat agree)</li></ul></li></ul><p>&nbsp;</p><p>&nbsp;(Ideas copied from <a href=\"https://www.lesswrong.com/posts/fkqvztgszJpqmDHom/govai-towards-best-practices-in-agi-safety-and-governance-a?commentId=AnuSgHnGGSSHRNjoY\">here</a> — thanks!)</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "L3TbrPiZhdxCKmuFG", "postedAt": "2023-05-26T11:10:54.704Z", "postId": "8cri5fZPkxP6vDiCH", "htmlBody": "<p>I also find the following chart interesting (although I think none of this is significant) — particularly the fact that pausing training of dangerous models and security standards have more agreement from people who <i>aren't</i> in AGI labs, and (at a glance):</p><ul><li>inter-lab scrutiny</li><li>avoid capabilities jumps</li><li>board risk committee</li><li>researcher model access</li><li>publish internal risk assessment results</li><li>background checks</li></ul><p>got more agreement from people who <i>are</i> in labs (in general, apparently \"experts from AGI labs had higher average agreement with statements than respondents from academia or civil society\").</p><p>Note that 43.9% of respondents (22 people?) are from AGI labs.&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/l2gdaerhstnfbyiit9pw\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/qtmuzioejuoq3vyzn2yd 100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/cy6b8fhulwlr57ij9q3b 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/wr3ssyzunotmer9kxz7l 300w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/dwwmo0rvyv0npx5gcsqc 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/a854a723jozajrte2b7e 500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/ztya9zkmcri7bghsudz0 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/kzjc1ru8ztrpbxlsgkft 700w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/di3hslqjqdghvuhhmbsl 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/b704kntl2roohnsm7bfx 900w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/L3TbrPiZhdxCKmuFG/id2djbqpnj84cbbsjrxz 988w\"></figure>", "parentCommentId": null, "user": {"username": "Lizka"}}]