[{"_id": "CD5GqNTGfHvm9Rsdp", "postedAt": "2023-09-30T00:55:10.469Z", "postId": "8fDyucEfgAyNvK3ge", "htmlBody": "<p>Reposting my LW comment here:</p><p>Just want to plug Josh Greene's great book <a href=\"https://www.joshua-greene.net/moral-tribes\"><i>Moral Tribes</i></a> here (disclosure: he's my former boss). Moral Tribes basically makes the same argument in different/more words: we evolved moral instincts that usually serve us pretty well, and the tricky part is realizing when we're in a situation that requires us to pull out the heavy-duty philosophical machinery.</p>", "parentCommentId": null, "user": {"username": "levin"}}, {"_id": "sK2hZoerSKGWAPnvb", "postedAt": "2023-10-02T14:29:01.106Z", "postId": "8fDyucEfgAyNvK3ge", "htmlBody": "<p>Nice post! Somewhat relatedly, people may like to check Paul Christiano's <a href=\"https://forum.effectivealtruism.org/posts/CfcvPBY9hdsenMHCr/integrity-for-consequentialists-1\">Integrity for consequentialists</a>.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "PykfjgopN8SucMmQB", "postedAt": "2023-10-02T23:58:53.419Z", "postId": "8fDyucEfgAyNvK3ge", "htmlBody": "<p>I wanted to highlight <a href=\"https://www.lesswrong.com/users/annasalamon\">Anna's comment</a> in the LW version:</p>\n<blockquote>\n<p>I agree with this, but would add that IMO, after you work out the consequentialist analysis of the small set of decisions that are worth intensive thought/effort/research, it is quite worthwhile to additionally work out something like a folk ethical account of why your result is correct, or of how the action you're endorsing coheres with deep virtues/deontology/tropes/etc.   ...</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "SAbtjSPnrLCGwvoND", "postedAt": "2023-10-06T10:30:15.540Z", "postId": "8fDyucEfgAyNvK3ge", "htmlBody": "<p>Didn't catch this until just now, but happy to see the idea expanded a bit more! I'll have to sit down and think on it longer, but I did have some immediate thoughts.&nbsp;</p><p>I guess at its core I'm unsure what exactly a proper balance of thinking about folk ethics<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefayug48aqjh\"><sup><a href=\"#fnayug48aqjh\">[1]</a></sup></span>&nbsp;(or commonsense good) and reasoned ethics<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8xjpa02m8jd\"><sup><a href=\"#fn8xjpa02m8jd\">[2]</a></sup></span>&nbsp;(or creative good) is, when exactly you should engage in each. You highlight the content, that reasoned ethics should be brought in for the big decisions, those with longevity generally. And <a href=\"https://www.lesswrong.com/posts/cEnJsoxQ3ziJEohnP/commonsense-good-creative-good?commentId=c8EKsfhv9wqhPtqgD\">Ana</a> starts to map this out a bit further, saying reasoned ethics involves an analysis of \"the small set of decisions that are worth intensive thought/effort/research\" But even if the decision set is small, if it's just these really big topics, the time spent implementing major decisions like these is likely long and full of many day to day tradeoffs and choices. Sure, eating vegan is now a system one task for me, but part of what solidified veganism for me was bringing in my discomfort from reasoned ethics into my day to day for awhile, for months even. The folk ethics there (for me) was entirely in the opposite direction, and I honestly don't think I would have made the switch if I didn't bring reasoned ethics into my everyday decisions.&nbsp;</p><p>I guess for that reason I'm kind of on guard, looking for other ways my commonsense intuitions about what I should do might be flawed. And sure, when you set it up like \"folk ethics is just sticking to basic principles of benevolence, of patience, honesty and kindness\" few will argue adherence to this is flawed. But it's rarely these principles <strong>and instead the application of them </strong>where the disagreement comes in. My family and I don't disagree that kindness is an important value, we disagree on what practicing kindness in the world looks like.&nbsp;</p><p>In light of this, I think I'd propose the converse of Anna's comments: stick to folk ethics for most of the day to day stuff, but with some frequency<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefshpqofqipza\"><sup><a href=\"#fnshpqofqipza\">[3]</a></sup></span>&nbsp;bring the reasoned ethics into your life, into the day to day, to see if how you are living is in accord with your philosophical commitments. This could look like literally going through a day wearing the reasoned ethics hat, or it could even look like taking stock of what what has happened over a period of time and reflecting on whether those daily decisions are in accord. Maybe this community is different, but I agree with <a href=\"https://www.lesswrong.com/posts/cEnJsoxQ3ziJEohnP/commonsense-good-creative-good?commentId=Q7drzwtBwnAsskB9Z\">Eccentricity</a> that I generally see way to little of this in the world, and really wish people engaged in it more.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnayug48aqjh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefayug48aqjh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'll use folk ethics in place of commonsense good hereafter because I find the term compelling&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8xjpa02m8jd\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8xjpa02m8jd\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'll use reasoned ethics in place of creative good because I think this set (folk ethics and reasoned ethics) feels more intuitive. Sorry for changing the language, it just made it easier for me to articulate myself here.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnshpqofqipza\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefshpqofqipza\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Really unsure what's best here so I'm leaving it intentionally vague. If I had to suggest something, at least an annual review and time of reflection is warranted (I like to do this at the end of the calendar year but I think you could do it w/e) and at most I think checking in each week (running through a day at the end of the week really thinking if the decisions and actions you are taking make sense) might be good.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "tswizzle96"}}]