[{"_id": "batFfnmwjuggCaoA2", "postedAt": "2022-11-17T07:51:52.320Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>This is a great post and mirrors a lot of the kinds of things I have been worried about over the years. I also recommend <a href=\"https://www.lesswrong.com/s/kNANcHLNtJt5qeuSS/p/45mNHCMaZgsvfDXbw \">Zvi's \"Immoral Mazes\" sequence</a> as covering some similar ground.</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "kHpk3JMvz2gvtz5PG", "postedAt": "2022-11-17T08:00:39.786Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>Great post, and agreed about the dynamics involved. I worry the current EA synthesis has difficulty addressing this class of criticism (power corrupts; transactional donations, geeks/mops/sociopaths), but perhaps we haven’t seen EA’s final form.</p>", "parentCommentId": null, "user": {"username": "MikeJohnson"}}, {"_id": "ewhsTAkfhty4Y3Ljy", "postedAt": "2022-11-17T09:49:00.468Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>Strong upvote from me. I really appreciated the frank sharing of your experience and also that it was playfully written (and more on this forum could be!)</p><p>Particularly keen on the <strong>policy mandating anonymous donations, and building a receiving organisation to do this </strong>and (presumably) pool all different donations for cause / intervention X together and administering them? TBH, it seems like a no-brainer to me to do in the first place if governance was being prioritised. Main reason I think you would keep the close donor-adviser relationship in place would be:</p><ul><li>historic precedence, this being the expectation in classic philanthroty</li><li>a belief that if you make a strong relationship with the donor, you can influence their donations to better places and at higher scale (and not an unreasonable belief at that)</li><li>something something 'donors deserve this for their money' something something 'accountability' and other things which someone might put forward a more earnest argument for that I would</li></ul><p>And I'm genuinely curious <strong>if people who advise donors 1:1 think that such interventions / policies you list would deter donors? </strong>Or if, on the plausible trade-off between anonymity-as-prevention-against-capture Vs. getting donations, they think it's net positive?</p><p>Would also be keen to hear views of donors directly on this (even if this thread might not be the most hospitable place given Eigenrobot's unpacking of how these structures necessarily corrupt).</p>", "parentCommentId": null, "user": {"username": "howdoyousay?"}}, {"_id": "JvjCx2fnR3shxhFvE", "postedAt": "2022-11-17T10:11:08.439Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>This post really does not match my perspective.<br><br>Some parts I especially disagree with:</p><blockquote><p>You want to stop malaria on the grounds of maximum impact per dollar spent? Actually, this week the hot thing is <a href=\"https://www.openphilanthropy.org/focus/criminal-justice-reform/\">criminal justice reform</a><a href=\"https://eigenrobot.substack.com/p/effective-altruism-and-its-future#footnote-3\"><sup>3</sup></a> in a first world country—why don’t you go rationalize that cause for us?</p></blockquote><p>I'm really annoyed by this line of reasoning, where once you give 1 dollar to the AMF then you can't give anything else to any cause area that critics might not like, otherwise you're killing children.<br>If Moskovitz was spending it on boats instead it would be seen as ok? Should we criticize everyone that spends 1% of their net worth on something we don't like? Was criminal justice reform ever recommended to small donors? Was it ever a GiveWell top charity?</p><p>This part enrages me:</p><blockquote><p>If you’re curious what kind of press you can buy, consider this <a href=\"https://www.vox.com/future-perfect/2022/8/8/23150496/effective-altruism-sam-bankman-fried-dustin-moskovitz-billionaire-philanthropy-crytocurrency\">fluff profile of SBF</a> by Dylan Matthews. Is Matthews’ conveyance of admiration feigned? I doubt it. Would he have gotten it past his editors if SBF hadn’t donated to his employer? Maybe. Would SBF keep donating to Vox if they didn’t deliver fawning coverage? I’m sure Vox editors wondered this themselves right up to the point where it became clear that there would be no donations forthcoming regardless of what they printed.</p></blockquote><p>Please I encourage people to read the \"fluff profile\"! Dylan Matthews also literally wrote:</p><blockquote><p>The enmity is particularly pronounced for Bankman-Fried, given the fact that crypto is, let’s be blunt, a completely useless asset class that has serious environmental costs.</p><p>(Disclosure: Bankman-Fried’s family foundation, Building a Stronger Future, is funding some of the Future Perfect section at Vox, so let me bite the hand that feeds me and say that I think him buying up Super Bowl ads and Vogue spreads with Gisele Bündchen to encourage ordinary people to put their money into this pile of mathematically complex garbage is … actually morally questionable. Bankman-Fried can do a lot of good with the money FTX produces, but parts of the production process make me increasingly uncomfortable.)</p></blockquote><p>At the top of <a href=\"https://www.vox.com/future-perfect/2022/8/23/23313081/effective-altruism-billionaires-tax-inequality-dustin-moskovitz-sam-bankman-fried\">another article</a>. &nbsp;Is Matthews' conveyance of enmity and discomfort feigned? I doubt it.</p><blockquote><p>As long as EA is reliant on large and especially on public donors, EA is <i>owned</i> by those donors and will over time evolve to serve them even more than they already do. [...] like everything else, EA will become a skinsuit shambling around and doing everything awful that the old charities do, and have nothing to do with its original goals.</p></blockquote><p>There are thousands of donors in EA, and dozens of organizations doing all sorts of stuff independent stuff! My favorite example is <a href=\"https://www.charityentrepreneurship.com/\">Charity Entrepreneurship</a>, and their <a href=\"https://www.charityentrepreneurship.com/our-charities\">incubated charities</a>. They are doing really amazing stuff and are saving thousands of lives, I don't see them (and all their 20 charities) going away any time soon.</p><blockquote><p>I am literally an economist and I am sorry to report that this is the way of the world. [charities existing to optimize taxes and reputation] [...] But What If No One Will Donate If They Can’t Influence Us, or Generate Flattering Press About Having Donated. And What If No One Cares Anymore When We Talk About This At Parties<br>Then you will have learned something valuable about the role of charity organizations in the world.</p></blockquote><p>[Sorry for ranting a bit from now on]<br>This kind of \"altruism doesn't exist\" reasoning seems really common and <i>really</i> annoys me. I'm not donating 70% of my income to \"optimize taxes\" or \"manage my reputation\", <a href=\"https://www.givingwhatwecan.org/about-us/members\">Giving What We Can just reached 8000 pledgers &nbsp;</a>(I know not all pledgers actually end up giving &gt;10% for their whole lives, but many do!).</p><blockquote><p>SBF is a symptom, not a freak one-off. As long as EA is reliant on large and especially on public donors, EA is owned by those donors and will over time evolve to serve them even more than they already do.</p></blockquote><p>For many people, EA is still a place to decide where to <i>give</i> their money and/or time. Not to <i>get</i> money. Many many EA direct workers are <i>both</i> donating significant amounts and earning significantly less than they would be in the private sector.<br>\"Altruism doesn't exist\" seems especially common in some rationalists and post-rationalists that really cannot imagine someone being in any way altruistic: it's always all signaling, nothing could ever falsify this.<br><br>Personal take: SBF/FTX stole a lot of money from a lot of people, and ruined the reputation of coworkers, families, industries, and politicians. I really think EA is making it all about ourselves in a very egocentric manner, and long-time critics are mostly using it to justify their existing \"altruism is bad\" or \"EA is bad\" takes.</p>", "parentCommentId": null, "user": {"username": "AnonymousAccount"}}, {"_id": "GMwPu8TgxGrWq8ty6", "postedAt": "2022-11-17T10:25:03.178Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>The \"donate in public and brag about it\" thing has been an EA norm since the early days. The rationale was to take the desire for status and weaponize and corrupt it in the service of good. It was in explicit and deliberate opposition to the mainstream Judeo-Christian norm of keeping it to oneself. Funny how things work out</p>", "parentCommentId": null, "user": {"username": "James Sully"}}, {"_id": "NRWzbKwyPG7kJZNwi", "postedAt": "2022-11-17T10:55:02.847Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>Thanks for the post !&nbsp;</p><p>It provides useful insight. It's true that <i>many, many &nbsp;</i>organisations over history have been \"captured\" up to some point.&nbsp;</p><p>I guess that is the fate of a lot of things : <strong>organisms that are the best at capturing power are more competitive</strong>. So at the end of the day, places with deciders concentrate mostly individuals and corporations that are very good at obtaining power and keeping it.</p><p>It's why we end up with <a href=\"https://www.cambridge.org/core/journals/perspectives-on-politics/article/testing-theories-of-american-politics-elites-interest-groups-and-average-citizens/62327F513959D0A304D4893B382B992B\">actual scientific studies </a>concluding that<strong> the US is not a democracy but an oligarchy</strong>. I recommend reading Propaganda by Edwards Bernays and the <a href=\"http://www.thwink.org/sustain/articles/017_PowellMemo/index.htm#F1\">Powell memo</a>.</p><p>Which is why you need<i> counter-powers </i>to prevent that. It's hard and doesn't always work, but with a lot of effort it's possible to mitigate that, many social movements obtained some results through this - but we really need to learn from the FTX scandal to achieve that.</p><p>&nbsp;</p><p>However, I'm not certain that EA as a whole has died yet. I agree that I find it seriously unlikely that EA ideals end up shaping the whole world for centuries to come, because of these reasons. But what I care about is \"how much impact do we have?\", and I'm not sure the impact we have is really declining. So far, Givewell is still donating more than ever before. But we'll see how this goes.</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}, {"_id": "HRRQp5J9qgrxHL7qc", "postedAt": "2022-11-17T11:31:55.945Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>I don't think the claim is that altruism doesn't exist. Rather, it's that at the margin large contributors are prone to use charity for their own goals. As EA attempts to monetize 'whales', it's pushed to twist itself into something that serves those goals, which in turn changes how good your own, smaller donations are.</p><p>It's a 'at the margin' argument, and I don't know how accurate it is. Maybe EA orgs are currently resistant to such processes. OTOH, the ones that are less resistant will be more appealing to big money, get bigger budgets, become more visible, and likely be copied. Seems unstable long-term.</p>", "parentCommentId": "JvjCx2fnR3shxhFvE", "user": {"username": "Jacek Lach"}}, {"_id": "mKceqfRiQtHCo39dC", "postedAt": "2022-11-17T20:36:43.578Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>I think this is an awfully difficult problem to solve. A status-motivated donor has plenty of other causes that will give them status in exchange for their millions to billions. If you accept that many donors are significantly motivated by status, adopting policies to prevent them from using donations to improve status will make one's cause areas less competitive with other causes.  Except in unusual circumstances, a specific charity or cause needs its donors a lot more than the donors need the cause/charity.</p>\n<p>So my takeaway is grace for everyone who is trying to muddle through all the challenges of thinking through and managing donor risk as best they can.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "ukxCeuJjyuHsCWkK9", "postedAt": "2022-11-21T18:47:54.480Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": "<p>Re <a href=\"https://meaningness.com/geeks-mops-sociopaths\">Geeks, MOPs, and Sociopaths</a>, SBF was one of the original Geeks (into EA when it was still small), so I don't think it makes sense to use this framing here. SBF seems to have developed into a Sociopath after he made it big (and EA became similarly big, somewhat independently). Does Chapman have anything to say about that (Geeks -&gt; Sociopaths)?</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "CY6HPoeDq4ntWB8Dm", "postedAt": "2022-11-17T05:09:53.433Z", "postId": "8FmaQDyRqDE7bpXtv", "htmlBody": null, "parentCommentId": null, "user": null}]