[{"_id": "udAwg2QMGWf4CvHsj", "postedAt": "2023-12-22T17:42:36.420Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<p>This piece has so many choices bangers! Cheers for writing it! will be checking heaps of quotes for future use.</p>\n", "parentCommentId": null, "user": {"username": "Powder"}}, {"_id": "ufvixi5NjnraLf4wa", "postedAt": "2023-12-22T23:48:48.218Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<p>Great piece!</p><p>I've long thought society overestimates the value of schooling (particularly secondary school).&nbsp;</p><p>One reason is negative spillovers (i.e, some of the benefits to individuals from education is probably from winning zero-sum games around jobs). Do you know if education RCTs have tried to take this into account (Eg - via two-step randomisation?)</p><p>Another reason I've been thinking about recently is the fact that most people forget most of the knowledge they learned in school, very soon after finishing school. I don't think there's a plausible mechanism by which this forgotten knowledge generates benefits for the individual or wider society.</p><p>I think it's likely that the optimal age to finish school isn't 17/18 as is the norm in many countries. The time we spend in school seems to have been very arbitrarily selected (eg - why not extend secondary school by 5 more years and have everyone continue a broad education if education is so beneficial?)</p><p>I also feel that the opportunity cost of more schooling isn't discussed near enough - people could do more on-the-job training more relevant to their actual jobs instead.</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "M2vQ6mh5LC2pp2J73", "postedAt": "2023-12-22T23:52:22.455Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<p>Do you think there's an opportunity for LLMs to enable a lot of translation of primary school books into local languages / help develop lesson plans? Is there a charity idea here?</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "Z2rD7Japwakj9LbJT", "postedAt": "2023-12-24T13:52:08.873Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<p>Yes, this also came top of the ideas when we did a discussion on potential use cases for AI in education for LMIC (https://ai-for-education.org/working-group-discussion-ai-use-cases/)</p><p>&nbsp;</p><p>There’s a few people trying this - my concern though, and something we just got a grant to think about, is how we make sure the content is good qualiTy. So we will start the year thinking about benchmarks for AI in education.&nbsp;<br>&nbsp;</p><p>lots of charity ideas here, and something we’re fortunate to get funding from BMGF and others to explore.&nbsp;</p>", "parentCommentId": "M2vQ6mh5LC2pp2J73", "user": {"username": "paul_fab"}}, {"_id": "KsvyxHjZB79yNFGvi", "postedAt": "2023-12-24T13:53:02.651Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<p>This is a great piece. A really good summary of the current status of education in LMIC.</p>", "parentCommentId": null, "user": {"username": "paul_fab"}}, {"_id": "AuYK5ZmEkywNK6RLi", "postedAt": "2023-12-26T16:54:46.217Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<blockquote>\n<p>Another reason I've been thinking about recently is the fact that most people forget most of the knowledge they learned in school, very soon after finishing school. I don't think there's a plausible mechanism by which this forgotten knowledge generates benefits for the individual or wider society.</p>\n</blockquote>\n<p>It's quite likely imo that the primary intellectual benefit of school is not knowledge (easily forgotten) but the learned <em><a href=\"https://www.nber.org/papers/w30133\">cognitive endurance</a></em> that makes it easier to do cognitively demanding jobs later in life. Those jobs are also better paid, and they have larger benefits to society in terms of helping a country grow. If this is the main benefit, then negative spillovers likely won't be large, because they are taking jobs that less educated people couldn't do. Plus, noncognitive benefits of school, in terms of better socialization, are real.</p>\n<p>I'm not aware of direct evidence on negative spillovers, but it's also important to point out that <em>positive</em> spillovers are also very plausible. More educated people can help their peers learn, not just in the classroom but also on the job. Plus if more educated people are <a href=\"https://fqueiro.github.io/entrep_hc_final.pdf\">better able to create successful businesses</a>, then they create jobs for others in a positive-sum way.</p>\n", "parentCommentId": "ufvixi5NjnraLf4wa", "user": {"username": "therealslimkt"}}, {"_id": "NNQwczKXeZ34DXxCs", "postedAt": "2023-12-28T08:44:17.828Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<p>There's definite possibility here - even potentially in marking and monitoring lessons. How much to \"Automate\" learning in general is. To put it crudely, many LMIC primary school education systems are based on rote learning. So one big question (and debate) in education circles is, should we then make that rote learning as effective as possible? Which is what orgs like Gates foundation funded bridge acadamies have tried to do.<br><br><a href=\"https://www.bridgeinternationalacademies.com/\">https://www.bridgeinternationalacademies.com/</a></p><p>Or should we try and transform learning environments and teaching styles, so that classrooms are transfrormed into the kind of interactive and exploratory spaces we have in higher income countries?</p><p>I don't have a strong opinion on this, but lean towards the \"improve the rote learning\" in places like Uganda where i live, especially if the government isn't putting in a huge effort to transform education sustem</p><p>LLMs even right now could easily play a big role in improving rote learning, but I'm not sure they are at the stage yet to play much of a role in transforming classroom spaces - but that could come in the near future.&nbsp;</p>", "parentCommentId": "M2vQ6mh5LC2pp2J73", "user": {"username": "NickLaing"}}, {"_id": "8SfJbMFQpjETg7uH7", "postedAt": "2023-12-29T22:05:19.487Z", "postId": "8FZ8dESrDciMJKC44", "htmlBody": "<p>Thanks for sharing, Lauren! I appreciate the humility about the difficult epistemic situation we are in with respect to education in developing country schools.</p><blockquote><p>So, really, we just don’t know what you get from education in a developing country. We don’t know how much more you are likely to earn if you stick through high school. We don’t know if you’ll even make <i>any</i> more money. If you do make more money from going to more school, we don’t really know why. It could be that you just came from a family that was always going to use their connections for you. Or it could be because you’ve learned to read and write. Or it could be because you’ve learned to manage your own time and cooperate with others.</p><p>All are plausible, but we don’t know which one is true — or if all of them are a little bit true. We can’t know if we’re succeeding unless we understand what success means.</p></blockquote>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]