[{"_id": "DiJB4PijN2SWua2uL", "postedAt": "2022-10-10T14:32:35.598Z", "postId": "8g2W7XpFdvRBdEiMm", "htmlBody": "<p>TL;DR -- The article is of questionable epistemic reliability.&nbsp;</p><p>&nbsp;</p><p>I had not, but since it was counterintuitive to me I took a look at the article. For something that doesn't have a good first principles explanation, I tend to think it should provide some clear evidence for me to change my priors. I did not leave the article with this feeling. When reading this article, these posts came to mind ( <a href=\"https://www.lesswrong.com/s/GSqFqc646rsRd2oyz/p/34XxbRFe54FycoCDw\">https://www.lesswrong.com/s/GSqFqc646rsRd2oyz/p/34XxbRFe54FycoCDw </a>and <a href=\"https://www.lesswrong.com/posts/SFZoEBpLo9frSJGkc/rationalization\">https://www.lesswrong.com/posts/SFZoEBpLo9frSJGkc/rationalization</a> ). As a vegan/vegetarian, it could be me doing the rationalization, but here are the aspects of the article which made me skeptical of the results.&nbsp;</p><p>The initial intention of the data was not to look at this problem. The data was originally collected to look at the risk factors and progression of diabetes, cardiovascular disease and other chronic noncommunicable disease. This means the study was not designed to really determine the answer to the question of depressive episodes and a meatless diet. Before looking at the results of a study, you should agree that the answer will be reliable given the study design. This study would not fit that criterion for me.&nbsp;</p><p>This is a study from Brazil. Generalizability to yourself should take that into consideration. This study also includes active and retired employees of public institutions of higher education and research in six state capitals. This study found a meatless diet in only 0.6% of their population (only 82 patients of over 14k) when they mention at 2018 study reporting 14% of a studied population in Brazil as vegetarian. Of note, in Table 2, only 8.5% of the \"do not consume meet\" respondents self-reported a vegetarian diet/reduced meet intake &nbsp;which brings into question the validity of the results.&nbsp;</p><p>There was no overall difference in the CIS-R score between groups. There was only one statistically significant difference in depressive episodes and that was mild without somatic symptoms. Their crude model included 1.00 in their 95% confidence interval. They said that \"In the present study, we found a lower intake of unprocessed/minimally processed foods and a higher intake of ultra-processed foods among those individuals who did not consume meat.\" Meatless diets had lower intake of overall calories. They also had lower overall intake of ultra-processed foods compared to those who eat meat (but not as a % of TEI which is how they made that claim). &nbsp; If, as a vegetarian, I eat 2000 calories and 500 of which were from girl scout cookies that would be 25% of my TEI (total energy intake). If the authors eat 3000 calories and 700 of which is girl scout cookies (23%), they would conclude that the vegetarian had a \"lower intake of unprocessed/minimally processed foods and a higher intake of ultra-processed foods\". That seems intellectually dishonest to me.&nbsp;</p><p>Ultimately, I do not find this article very convincing. I think one ought to require other better constructed studies to start to update their belief that meatless diets are associated with depressive episodes.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Roven Skyfall"}}, {"_id": "g87vB8tFNMQsbR7Y5", "postedAt": "2022-10-10T15:49:04.519Z", "postId": "8g2W7XpFdvRBdEiMm", "htmlBody": "<p>When I see a study like this I usually go to<a href=\"https://pubmed.ncbi.nlm.nih.gov/\"> Pubmed</a> and see if there are other studies or meta-studies.<br>In this case there are a couple of recent metastudies:<br><a href=\"https://pubmed.ncbi.nlm.nih.gov/34375207/\">https://pubmed.ncbi.nlm.nih.gov/34375207/</a><br><a href=\"https://pubmed.ncbi.nlm.nih.gov/32483598/\">https://pubmed.ncbi.nlm.nih.gov/32483598/</a><br>https://pubmed.ncbi.nlm.nih.gov/36045075/<br><br>From one of the abstracts: \"Eleven (44%) of the outcomes indicated that vegetarian and vegan diets were associated with higher rates of depression, while seven (28%) outcomes revealed beneficial effects of the diets on depression. Seven (28%) outcomes found no association between vegetarian and vegan diets and depression, although two of these studies found a higher risk of depression in some groups. . . . The evidence on the effect of vegetarian and vegan diets on depression is contradictory, possibly due to the heterogeneity of the studies analysed.\"</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}]