[{"_id": "hvGB8z2A82YfoxHpH", "postedAt": "2022-10-14T18:59:32.297Z", "postId": "8gyGtdAAuhT3AkXus", "htmlBody": "<p>For newcomers, if you're a typical US-based donor (giving ~$20k or so per year), making your donations via Facebook on Giving Tuesday each year is a great way to increase your impact. See: <a href=\"https://forum.effectivealtruism.org/posts/9ZRenh6bERDkoCfdX/eas-should-invest-all-year-then-give-only-on-giving-tuesday\">EAs Should Invest All Year, then Give only on Giving Tuesday</a>.</p>", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "wpBsFzLGN5TXtSwTA", "postedAt": "2022-10-14T19:02:19.916Z", "postId": "8gyGtdAAuhT3AkXus", "htmlBody": "<p>Thanks to GWWC and OFTW for taking on this project! It's great to see the results of the entire community's efforts (making Giving Tuesday feel like an EA holiday) and that can only happen with central organizing.</p>", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "B6k3JBo5v5YyrAW26", "postedAt": "2022-10-18T17:59:12.994Z", "postId": "8gyGtdAAuhT3AkXus", "htmlBody": "<p>I tried reaching out to <a href=\"mailto:contact@eagivingtuesday.org\">contact@eagivingtuesday.org</a> with the following, but never got a response…</p>\n<p>“Hello EA Giving Tuesday Team,</p>\n<p>I've been reading through the site &amp; getting a better idea of how you work this each year. Based on past efforts it looks like the matching isn't just limited to the FB listed organizations in the usual Fundraiser search section, which is good news.</p>\n<p>But for the upcoming Giving Tuesday 2022, I really want to know if you can include Giving Multiplier as an organization donation option? It is an EA organization, but it wasn't listed in the 2021 orgs.\nSite: <a href=\"https://givingmultiplier.org/\">https://givingmultiplier.org/</a>\nFB Page: <a href=\"https://www.facebook.com/GivingMultiplier/\">https://www.facebook.com/GivingMultiplier/</a></p>\n<p>I want to try to maximize my donation this year by donating through FB matching on Giving Tuesday, by using new credit cards with high intro cash-back bonuses, by checking if my company can also match my donation, and by donating to Giving Multiplier for a higher potential multiplier from additional new EA donors.</p>\n<p>Is Giving Multiplier an organization you can include in this year's lineup?”</p>\n<p>There should be a way to set this up to 3-4.5x most donations. (<a href=\"https://forum.effectivealtruism.org/posts/BFbNymbn4ukmKWHrX/donation-multiplier-stacking-directing-1-2x-to-9-9x-more\">https://forum.effectivealtruism.org/posts/BFbNymbn4ukmKWHrX/donation-multiplier-stacking-directing-1-2x-to-9-9x-more</a>)</p>\n", "parentCommentId": null, "user": {"username": "Tyler Kolota"}}, {"_id": "fX2NmcGfyAARRmK3r", "postedAt": "2022-10-24T03:23:14.130Z", "postId": "8gyGtdAAuhT3AkXus", "htmlBody": "<p>Hi Tyler, I saw your email but I'm just having some technical issues responding via the tech stack we have set up at the moment, am hoping to resolve very soon! It looks like Giving Multiplier aren't current set up to receive donations via Facebook so this would mean that we can't include them for now - if they get this set up, then we would be happy to include them.&nbsp;</p><p>Sorry for the delay in responding, I'm working on this project on top of my normal work for GWWC and this is already the busiest period of the year for me.</p><p>-Grace</p>", "parentCommentId": "B6k3JBo5v5YyrAW26", "user": {"username": "Giving What We Can"}}]