[{"_id": "CGoRZm5zFTxCdNEJ2", "postedAt": "2015-05-28T01:12:57.572Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>I think it has to happen in a way that mostly doesn't require EA organizations to spend large amounts of time courting individual minor donors. I also don't think more matching fundraisers is the solution.</p>\n<p>Some possible partial solutions: a stronger culture of giving to learn, established by prominent clever donors (Give now, note reports later). Using EA Ventures to arrange funding &quot;rounds&quot; where many donors or investors must be involved for the funding round to go ahead, or using a similar incentive structure, Kickstartr could be used.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "pmo8HMr3QecXMyhgC", "postedAt": "2015-05-28T01:25:13.059Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>How would a &quot;round&quot; or Kickstarter structure help with the coordination problem? People would still jockey to be late enough that the fundraiser got filled without them.</p>\n", "parentCommentId": "CGoRZm5zFTxCdNEJ2", "user": {"username": "Ben_Kuhn"}}, {"_id": "yBEEHpm8kSmwLZZMn", "postedAt": "2015-05-28T02:21:59.907Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>If you are holding back for this reason roll an N sided die and donate if a certain number comes up. N can be tuned such that on average we fulfill fundraisers in a timely manner. </p>\n", "parentCommentId": null, "user": {"username": "RomeoStevens"}}, {"_id": "sgDF4sqS9gPt4jPs6", "postedAt": "2015-05-28T03:38:26.854Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>The thought you ascribe to most EAs (which I think is very likely accurate) is something like this: if I donate now, it will just mean I divert money from what I think is a highly effective charity to GWWC, and then another EA who would have donated to GWWC later on will instead donate to another charity that EA thinks is highly effective.</p>\n<p>So the cost of donating to GWWC seems to be that money goes from your favorite charity to some other EA's favorite charity, and the benefit is that GWWC spends less time fundraising. Perhaps EAs are just thinking about this wrong - why should we think our favorite charity is that much more effective than some other prospective GWWC donor (or at least so much more effective that it is worth wasting GWWC staff's time)?</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "sTu2wx6GX3aMfDdr4", "postedAt": "2015-05-28T04:02:18.396Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Maybe price in the cost of staff time spent on the fundraiser - that is, if everyone donates immediately, it takes $X to fill the fundraiser. But if everyone donates at the end, it takes $X + $Y, where $Y is the cost of additional staff time spend on the fundraiser.</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "ikQiw7tCa8oMiLGBq", "postedAt": "2015-05-28T04:04:13.231Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Would it work to run shorter fundraisers? If it's the case that most donation money is tied up in this dynamic, then running a shorter fundraiser wouldn't significantly reduce the amount of money raised (of course, that might not be true)</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "3eQApDS3S2g8w5Rit", "postedAt": "2015-05-28T04:10:34.229Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>I wonder if delaying donations might play a role as a crude comparison of room for more funding between different EA organizations, or for a desire to keep all current EA organizations afloat. A donor who wants to support EA organizations but is uncertain about which provides the most value might chose the heuristic &quot;donate to the EA organization that is farthest from their fundraising target at the end of their fundraiser&quot;. If this is the case, providing better information for comparing EA organizations might help. Or, a &quot;EA Meta-Organization Fund&quot; could be created that the individual donors could fund, and then would fund the individual organizations (according to room for more funding, avoiding organizations collapsing due to lack of funds, or according to an impact evaluation of the individual organizations)</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "x4tfv8sw2agjYGC9F", "postedAt": "2015-05-28T05:08:45.468Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Here are the figures from Ben's poll so anyone can refer to them:</p>\n<hr />\n<p>&quot; how many folks have held off donating to GWWC in order to see whether their fundraiser hits its goal without their donations (so that their donation would have been replaceable/had no counterfactual impact)? &quot;</p>\n<p>I donated    0    (0%)    </p>\n<p>I refrained from donating PRIMARILY for the above reason    1    (3%)    </p>\n<p>I refrained from donating AT LEAST IN PART for the above reason    13    (45%)    </p>\n<p>The above reason didn't affect my decision at all    15    (52%)    </p>\n<hr />\n<p>And here are the figures from my poll with a fuller set of options:</p>\n<hr />\n<p>I donated money that'd otherwise have gone to direct support of the global poor    0    (0%)    </p>\n<p>I donated money that'd otherwise have gone to help others    0    (0%)    </p>\n<p>I donated money that wouldn't have otherwise have gone to help anyone else (e.g. I'd have spent it on myself)    1    (8%)    </p>\n<p>My main reason for not donating was the thought that my donation wouldn't raise GWWC's counterfactual spending    0    (0%)    </p>\n<p>My main reason for not donating was not being sufficiently convinced that increasing GWWC's spending would do the most good    12    (92%)    </p>\n<p>I thought donating would raise GWWC's counterfactual spending and this would do the most good, but nonetheless didn't donate    0    (0%)    </p>\n<hr />\n<p>Of course these polls aren't fully comparable, as saying &quot;I refrained from donating AT LEAST IN PART for the above reason&quot; means only that you think it's <em>one</em> reason for not donating, and \nas 'Larks' points out there are two possible ways of cashing out &quot;My main reason for not donating was the thought that my donation wouldn't raise GWWC's counterfactual spending&quot;:</p>\n<ul>\n<li>My donation would cause others to donate less</li>\n<li>My donation would cause CEA central to transfer resources away from GWWC\nbut only one of these is what Ben was talking about.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Nekoinentr"}}, {"_id": "5QTwy48jAeznB2Gqy", "postedAt": "2015-05-28T09:58:27.467Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>One possibility is to assign social kudos for having made significant donations to impactful charities. This could be done implicitly, or explicitly by charities issuing equity in the good they achieve (similar to <a href=\"http://effective-altruism.com/ea/ak/certificates_of_impact/\">certificates of impact</a>, but assigned before-the-fact rather than after).</p>\n<p>This would encourage a culture of donating to what appear to be the best opportunities early, lest they disappear.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "GWRwHuJ7EXFWERWFb", "postedAt": "2015-05-28T10:04:22.858Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>One possibility is to encourage epistemic modesty for beliefs about which are the top charities, relative to cohorts who would make the same decision as you at least once.</p>\n<p>Suppose I am wondering about donating to GWWC, but am not sure if I will just displace another donor. From an outside view, it is not obvious which of us would make best alternative use of the money (presumably we will both look for valuable giving opportunities). I think people often don't fully take this into account, and assume that holding the money themselves may be much better. But if you think the value is comparable (even if you think your judgement might on average be a little better) it could well be good to donate as soon as the opportunity arises, in order to increase the efficiency of the entire process.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "c9oj46pHmdgogmTRL", "postedAt": "2015-05-28T12:21:18.385Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>If people want it to be fair, so that they only give funds when others will, then a Kickstarter or a funding round allows them to only participate if lots of other people will, and gives an assurance that they will only have to provide &lt;x% of the required funds, and this all encourages cooperation and participation. In particular, for people who are procrastinating donating, it gives a good Schelling point for everyone to do so. I think that most people are waiting to know that it's an unusually good time to donate, rather than strategically trying to shirk responsibility.</p>\n", "parentCommentId": "pmo8HMr3QecXMyhgC", "user": {"username": "RyanCarey"}}, {"_id": "C5WxFj9skSmHic9Ny", "postedAt": "2015-05-28T15:48:08.576Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>That's a good point, and it might be plausible with regards to both charities and causes. Thinking through it a little, if...</p>\n<ul>\n<li>donor X has decided that GWWC (or whatever) is the best charity in the world before considering displacement effects</li>\n<li>and - we'd presumably want to add - these displacement effects don't appear to be unusually significant (e.g. displacing money which then goes to finish creating an unfriendly AI, or the Gates Foundation's small and most favoured pet projects having a large pool of potential funding available anyway and there marginal projects being clearly eccentric)</li>\n</ul>\n<p>...then this view would suggest that donor X just gives to that charity, and let displaced donors to give to what they initially thought was second best. The challenge would be that this is unconsequentialist.  A potential counter could explore the good consequences of a diverse donor market in which everyone gives to what they think best, though it might be harder to use this counter within the small EA market as opposed to the general philanthropic one. I haven't really thought this through, just getting some undigested considerations down (without care or concern for karma) as I come up with them in the hope that I can free ride on someone else doing that thinking through ;)</p>\n", "parentCommentId": "GWRwHuJ7EXFWERWFb", "user": {"username": "Tom_Ash"}}, {"_id": "jxDJvKcNpizxR8JDX", "postedAt": "2015-05-28T16:16:22.199Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Thanks for this! Do you know how many respondents there were for each poll?</p>\n", "parentCommentId": "x4tfv8sw2agjYGC9F", "user": {"username": "aliwoodman"}}, {"_id": "RmbTpQmsNu2CFLWqc", "postedAt": "2015-05-28T17:49:11.720Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Looks like 1+13+15 = 29 for Ben's and 1+12 = 13 for Nekoinentr's.</p>\n", "parentCommentId": "jxDJvKcNpizxR8JDX", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ov4zK4vqFwoF2Yp3p", "postedAt": "2015-05-29T07:36:14.722Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Many organisations, such as Oxfam, try to get their donors to set up regular (weekly/fortnightly/monthly) donations instead of giving a lump sum. This is largely done to make the organisation's funding more steady and predictable. Have any thoughts on this?</p>\n", "parentCommentId": null, "user": null}, {"_id": "yM7tScZ6EjW7gKxut", "postedAt": "2015-05-29T11:09:49.110Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Yeah I think it would make sense for some EA orgs to try this.</p>\n", "parentCommentId": "ov4zK4vqFwoF2Yp3p", "user": {"username": "RyanCarey"}}, {"_id": "nPdcdWbQ2iPyagh4h", "postedAt": "2015-05-30T11:43:17.548Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>We already recommend this if people ask us which we prefer.</p>\n", "parentCommentId": "yM7tScZ6EjW7gKxut", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "vwtxdcxrxYiHjno7m", "postedAt": "2015-05-30T23:12:54.680Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Small extra comment - I think the costs of slow fundraising are potentially much worse than 'a month of staff time'. Fundraising mainly takes up the time of senior management, so it bottlenecks the rest of the organisation. It usually becomes the <a href=\"http://www.paulgraham.com/top.html\">'top idea on your mind'</a> meaning it especially absorbs your most creative, focused hours. If fundraising results become more volatile (even if in expectation you get the same amount of money) it forces you to become more risk-averse and spend longer contingency planning, which makes it harder to reach really ambitious goals.</p>\n<p>In general, we want an ecosystem where the link between expected impact and getting money is quick and reliable.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "PuFzGcpGdbTxhCJ4w", "postedAt": "2015-05-31T02:29:23.559Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>In principle this can work OK with consequentialist donors who reason about the costs of delay and the counterfactual impacts of others' money. The decision problem for consequentialist donors is very complicated though. Also, there is a bunch of negative-sum jockeying which would be nice to eliminate. (Owen suggests encouraging epistmic modesty. That makes sense, but even if the participants were perfect reasoners they would still destroy value in negative sum conflict, and it seems like that's a more fundamental problem.)</p>\n<p>Delay plays a natural role in the naive consequentialist decision procedure. The most enthusiastic donors will give earliest, with less natural donors stepping in only as things get increasingly dire. This kind of works, but the direness is completely unnecessary and it would be nice to do the same thing without e.g. having charities operate on the brink of bankruptcy.</p>\n<p>A related problem is the signaling dynamic between fundraisers---who want to convince donors that the need is significant---and donors---who may treat fundraisers' claims as cheap talk.</p>\n<p>One natural solution to all of these issues is for charities to explicitly allocate credit to donors vs. employees vs. volunteers, and for every to try to get as much &quot;credit&quot; as possible. The fraction allocated to donors can then be adjusted to raise the desired amount of money, and the most enthusiastic donors---those willing to donate in exchange for the smallest share of the charity's impact---will be the ones to donate. This can provide a much more honest signal about charity's need for funds.</p>\n<p>This is not the most realistic solution. But it would be nice to see someone try it some day, e.g. by raising money by selling certificates for their activities. I don't think the logistics are complicated, and I think the scheme may be a significant improvement over the status quo (with lots of VOI); I think the biggest problem is that it's not good for morale or donor communications.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "WfajB9ywT5uLbs75L", "postedAt": "2015-05-31T02:37:54.580Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Certificates can be assigned whenever. Just like you can purchase an object that has already been made, or you can pay someone to make it for you. The impact purchase is buying things that have already been made, mostly because that is more novel and potentially neglected.</p>\n<p>There is also a distinction between purchasing equity and purchasing outputs. For example, an entrepreneur might give GWWC seed capital in exchange for 10% of all of their future profits (which might be unsold certificates). A donor might instead pay GWWC for 1% of GWWC's outputs over the last year, or for 1% of GWWC's outputs over the next year, or for some particular output that the donor particularly likes.</p>\n", "parentCommentId": "5QTwy48jAeznB2Gqy", "user": {"username": "Paul_Christiano"}}, {"_id": "xDzcwGCCRdfd5FH8t", "postedAt": "2015-05-31T05:31:26.046Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>I'm not sure how beneficial it would be, but it's definitely possible to push this 'donate monthly instead of giving a lump sum' point further without spending too many resources on it. </p>\n<p>With the example of Oxfam, they get their fundraising callers to use the message 'you should set up monthly donations' instead of just 'you should donate'. And they also have a 'make a monthly donation' button right next to the 'make a general donation' button on their website. And I'm sure they do other things as well, to push that message. </p>\n", "parentCommentId": "nPdcdWbQ2iPyagh4h", "user": null}, {"_id": "DFDgprWmR4XjTuEmp", "postedAt": "2015-05-31T06:43:55.693Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<blockquote>\n<p>a stronger culture of giving to learn, established by prominent clever donors (Give now, note reports later).</p>\n</blockquote>\n<p>I'd definitely be interested in more giving to learn, but I feel like public updates of lessons learned from expansion funding are few and far between.  I'd definitely donate more (like five figures more) if I had more orgs that ran public experiments with their funding and publicly wrote up (I'd even settle for a mailing list) successes and failures (and I'd expect failures, not just donor fluff).</p>\n<p>Does anyone else agree with me?  Or am I missing the work that some EA orgs already do? (Charity Science definitely does this and I donate to them, GiveWell does this a good amount and I donate to them, I think MIRI does this sometimes, I think the GPP has done this once or twice...)</p>\n", "parentCommentId": "CGoRZm5zFTxCdNEJ2", "user": {"username": "Peter_Hurford"}}, {"_id": "ntMAdScW5R49b4Pjr", "postedAt": "2015-05-31T10:45:04.287Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Lots of EA orgs write copious amounts of reports, I think - <a href=\"http://careyryan.com/transparency/\">http://careyryan.com/transparency/</a>. As far as I can tell, that's continued over the past year. They're not just fluffy generalities that would please donors, but I agree that they could give more focus to failures and strategic updates than they already do.</p>\n", "parentCommentId": "DFDgprWmR4XjTuEmp", "user": {"username": "RyanCarey"}}, {"_id": "WWQga8CgCARAC9d5v", "postedAt": "2015-05-31T13:45:36.648Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>I think the fact that it's a very stressful activity is also pretty relevant.</p>\n", "parentCommentId": "vwtxdcxrxYiHjno7m", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "Qc2jrFM5FZTcrDyYn", "postedAt": "2015-05-31T17:40:12.873Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Have you thought of updating that?  I remember, or think I remember, you doing a version for individuals which I found especially interesting, which could perhaps be rolled into one periodically updated page (updateable by anyone?) rather than a series of blog posts.</p>\n", "parentCommentId": "ntMAdScW5R49b4Pjr", "user": {"username": "arrowind"}}, {"_id": "5ea3aDwJAXJw4jKSg", "postedAt": "2015-05-31T19:59:05.333Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>The update that I did on individuals is also now over a year old. I'm too time-poor presently, although I could imagine an ongoing transparency update could be a useful thing to have.</p>\n", "parentCommentId": "Qc2jrFM5FZTcrDyYn", "user": {"username": "RyanCarey"}}, {"_id": "yr7xjFa5FygrpZiuR", "postedAt": "2015-05-31T20:27:43.073Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Anyone want to create one on the <a href=\"http://effective-altruism.wikia.com/wiki/Effective_Altruism_Wiki\">EA Wiki</a>?</p>\n", "parentCommentId": "5ea3aDwJAXJw4jKSg", "user": {"username": "jayd"}}, {"_id": "vpvnd3fiWGNfGW84S", "postedAt": "2015-06-02T21:20:21.633Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>Peter, what exact kinds of reports would make the difference for you? How would the table of contents read? I feel like if anything EA orgs spend already too long evaluating and not enough time growing.</p>\n", "parentCommentId": "ntMAdScW5R49b4Pjr", "user": {"username": "Benjamin_Todd"}}, {"_id": "iFQ9vfhXzayNoLa2Z", "postedAt": "2015-06-03T03:13:50.578Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>I agree insofar as having clear measures for success for suborganizations or projects which sometimes don't get met, resulting in suborganization sometimes getting shut down, would give me a good deal more confidence as a donor.</p>\n", "parentCommentId": "DFDgprWmR4XjTuEmp", "user": {"username": "Vincent_deB"}}, {"_id": "xPAPcAdwjasXPWG4e", "postedAt": "2015-07-28T09:07:02.383Z", "postId": "8MXhcnLearxSbeePe", "htmlBody": "<p>December is a Schelling point for fundraisers because it's &quot;giving season&quot;. I don't have the numbers, but I remember several metacharities at least holding fundraisers for their 2015 operations budget between the end of October 2014 and  end of December 2014. The pool of major donors to EA metacharities may be so small that donor coordination problems would be exacerbated by too few dollars for too many fundraisers during the crucial giving season period. If that's the case, executives at various metacharities could discuss solutions, express mutual support for donations to like-minded organisations, or one organization could independently decide to hold their major annual fundraiser outside the traditional giving season. Discovering if this is an actual additional problem will have to wait until the 2015 giving season fundraisers conclude to gather more reliable data.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}]