[{"_id": "6BGAkdeL3bqQwiAXK", "postedAt": "2023-07-21T14:06:39.128Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I think that it's good that this proposal was seriously considered. I don't think it currently beats other megaprojects on impact/solvability/neglectedness, especially since quite a bit of genetic engineering research is already legal in the US (I am once again reminding everyone that human reproductive cloning is legal in many US states, and that it seems unlikely for blue states to enact new laws against reproductive autonomy in a post-Roe era). However, I think that it's good that this proposal was seriously considered, and there should be, on the margin, more proposals like it (in terms of large scale, outside-the-box thinking, potential \"weirdness,\" etc.)</p>", "parentCommentId": null, "user": {"username": "Peter Berggren"}}, {"_id": "SxR5JgbokYwnjEFLp", "postedAt": "2023-07-21T15:01:50.320Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I think this is a ridiculous idea, but the linked article (and headline of this post) is super clickbait-y. This idea is mentioned in two sentences in the court documents (p. 20 of docket 1886, <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DocketInfo\">here</a>). All we know is that Gabriel, Sam's brother<i>,</i> sent a memo to someone at the FTX Foundation mentioning the idea. We have no idea if Sam even heard about this or if anyone at the Foundation \"wanted\" to follow through with it. I'm sure all sorts of wild possibilities got discussed around that time. Based on the evidence it's a a huge leap to say there were desires or plans to act on them.</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "mXozkSFpZL9mDBznd", "postedAt": "2023-07-21T15:06:02.267Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I'm unsure as to why people downvoted this post, the court filings do exist and have been covered by <a href=\"https://www.forbes.com/sites/dereksaul/2023/07/21/sam-bankman-frieds-brother-allegedly-wanted-to-buy-pacific-island-country-to-build-doomsday-bunker-for-effective-altruists/?sh=3c37ee33e559\">Forbes</a> already, and are worth discussion.&nbsp;</p><p>&nbsp;I think this idea, from what we know of it, is incredibly bad. A few reasons why:</p><ol><li>Nauru is an independent sovereign nation. There is no mechanism in place for an individual or corporation to \"buy\" an entire sovereign nation, so the idea is probably impossible anyway.</li><li>Nauru has a population of ten thousand and a democratically elected government. What exactly happens to the people who live there if the nation is \"purchased\"? If the population of the island disagrees with what the \"owners\" do, do their democratic decisions get overridden?&nbsp;</li><li>Why exactly would you need to buy an entire island nation in order to build a bunker? It seems obvious that it would be cheaper to do so within land that is owned by existing nations.&nbsp;</li><li>Giving preferential treatment to EA's introduces perverse incentives, where people join EA purely to get bunker access rather than for the goal of doing good.&nbsp;</li><li>Since this project was doomed from the start anyway, proposing it has no upside and has substantial downside in making EA look incredibly bad.&nbsp;</li></ol><p>I'll also note that I am personally not supportive of human genetic enhancement, but it's a bigger subject that I don't want to dive into here.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "6uY6cd4Xw7JCfJsNx", "postedAt": "2023-07-21T15:06:25.341Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Actual text from the complaint to save everyone time:</p><blockquote><p>One memo exchanged between Gabriel Bankman-Fried and an officer of the FTX Foundation describes a plan to purchase the sovereign nation of Nauru in order to construct a “bunker / shelter” that would be used for “some event where 50%-99.99% of people die [to] ensure that most EAs [effective altruists] survive” and to develop “sensible regulation around human genetic enhancement, and build a lab there.” The memo further noted that “probably there are other things it’s useful to do with a sovereign country, too.”</p></blockquote>", "parentCommentId": "SxR5JgbokYwnjEFLp", "user": {"username": "Jason"}}, {"_id": "prPXMHusGNxwvwS2t", "postedAt": "2023-07-21T15:26:27.416Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I agree that the media coverage implies SBF endorsed the content of this memo more than is warranted based on this text alone. But I would guess there <i>was</i> serious discussion of this kind of thing (maybe not buying Nauru specifically, but buying other pieces of land for the purpose of building bunkers/shelters).</p><p>In this <a href=\"https://www.youtube.com/watch?v=fOu8V0EI9SI&amp;t=2564s&amp;ab_channel=CentreforEffectiveAltruism\">EAG</a> Fireside Chat from October 2021, Will MacAskill says: \"I'm also really keen on more disaster preparedness work, so like, buying coal mines I'm totally serious on... but also just other things for if there's a collapse of civilization... at the most extreme you might have, like, a hermetically sealed bunker that no pathogens can enter into\" (42:26). So I don't think \"Buy Nauru\" falls into the category of \"all sorts of wild possibilities got discussed around that time\" versus a plausible extension of an idea that had become somewhat mainstream within EA at that point.</p>", "parentCommentId": "SxR5JgbokYwnjEFLp", "user": {"username": "hobbes"}}, {"_id": "naf9f28RkyMqQgWXN", "postedAt": "2023-07-21T15:37:08.241Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I think this underscores the need for a comprehensive and independent assessment of all of SBF's contacts with EA-affiliated people. (I recognize the various challenges to doing that.)</p><p>We aren't told whether the unnamed FTX Foundation official was merely the recipient of this memo or whether they had more involvement.&nbsp;</p><p>Any evidence of an EA leader's actual openness to this idea would likely be extremely troubling in my book. Of the narratives that may be factually defensible, I think the least damning is something like \"A number of EA leaders knew he was somewhat shady, but we had no reason to think he'd steal from depositors so we thought it OK to take his money.\" Everyone would have to decide for themselves how acceptable that narrative is, but it has some precedent -- EA orgs wouldn't be the first charities to take money from known-to-be-shady characters.</p><p>Evidence that someone was open to supporting SBF and allies \"purchas[ing]\" a country would be inconsistent with that mitigating narrative. As the quoted material in the complaint hints at, purchasing a sovereign country (if such a thing were possible) would put the relevant individuals basically above the law. \"I knew he was kinda shady, but I thought he was trustworthy enough to support him buying his own country where he could control the law\" would be a <i>much</i> harder position to defend.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "tJSgdJbCtK3kiaGgv", "postedAt": "2023-07-21T15:49:09.844Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>If I could save a few thousand people from a 99.99% death rate event to rebuild a new civilization, I wouldn't fill that doomsday bunker with mostly FTX/Alameda employees and EAs either. Monocultures are generally bad, genetic and other diversity is generally good, and I doubt that population would have the right skill/aptitude mix to recover from a near-extinction mix anyway. Whatever one thinks of doomsday bunkers as a means of reducing existential risk, this particular bunker proposal gave me uncomfortable vibes.</p>", "parentCommentId": "mXozkSFpZL9mDBznd", "user": {"username": "Jason"}}, {"_id": "dEgEYx8PJTtobvpyE", "postedAt": "2023-07-21T15:53:17.520Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>I'm unsure as to why people downvoted this post</p></blockquote><p>It has now a score of 23 with 9 votes (and also had a positive score when I first saw it before you wrote this comment), why do you think people downvoted it?</p>", "parentCommentId": "mXozkSFpZL9mDBznd", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "fCcFEoBQvRwYZJqJx", "postedAt": "2023-07-21T18:04:30.904Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>...whether this is a healthy line of thinking...</p></blockquote><p>Absolutely not healthy!</p><blockquote><p>...and something we're glad the public knows about us now.&nbsp;</p></blockquote><p>Leave the public! This is something I didn't know about \"us\" until now (and plausibly, 99% of the EA community didn't either).</p><p>The memo is bad because would-have-been top funders were floating the idea of preferentially helping the in-group (and helping is an understatement here). At the same time, I expect plenty of guilt-by-association critiques to spur out of this that will place blame on the entire community :(</p>", "parentCommentId": null, "user": {"username": "satpathyakash"}}, {"_id": "7GXEuRb4MoWJeDoEE", "postedAt": "2023-07-21T19:30:12.853Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Granted, the idea of taking over a sovereign nation seems unrealistic, unethical, and dubious on many levels.</p><p>However, the general idea of prepping to survive a global catastrophe should not be considered weird or embarrassing for EAs. If we support the <a href=\"https://en.wikipedia.org/wiki/Svalbard_Global_Seed_Vault\">Svalbard Global Seed Vault </a>in Norway, or efforts to make sure crucial <a href=\"https://www.amazon.com/Knowledge-Rebuild-Civilization-Aftermath-Cataclysm-ebook/dp/B00DMCV5YS/\">knowledge</a> is widely distributed in printed form, why not support other collective efforts to maximize the likelihood that humans can bounce back after a near-extinction event?</p><p>Millions of Americans are 'doomsday preppers' or survivalists who have stockpiled food, water, tools, gold, guns, ammo, etc in case of a catastrophe (aka a <a href=\"https://en.wikipedia.org/wiki/Survivalism#:~:text=SHTF%3A%20Shit%20hit%2Fhits%2F,film%20Threads%20(1984)).\">SHTF or TEOTWAWKI</a> event). They often network with neighbors, church members, or other like-minded people to form little survivalist communities, especially in rural or exurban areas. I think that's probably a net good, and it builds some much-needed resilience into human civilization.</p><p>Given that many EAs are seriously concerned about global catastrophic risks, and take the Toby Ord estimates seriously that we might face at least a 1/6 chance of X risk in this century, it's not at all weird that some EAs should get into prepping.&nbsp;</p><p>The main objection seems political rather than practical. Prepping is associated with American conservatives, and much of the American mainstream media (including Quartz online magazine, the source of this story) has a lefty disdain for preppers, or anything prepper-adjacent.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "c8uHycFnA5ZJaJYGa", "postedAt": "2023-07-21T20:30:10.195Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>To add even more reasons why this is a bad idea, Nauru has very poor soil as a result of phosphate mining, so on-land agriculture is extremely limited, and most food is currently imported, leading to an <a href=\"https://en.wikipedia.org/wiki/Obesity_in_Nauru\">obesity epidemic</a>. Similarly, there are no lakes or rivers on the island, so water is either imported or collected from rainfall.&nbsp;</p><p>Also the Australian government is currently operating a controversial <a href=\"https://en.wikipedia.org/wiki/Nauru_Regional_Processing_Centre\">detention centre</a> for asylum seekers on the island, and presumably would stand in the way of any purchase.&nbsp;</p><p>Really, it's hard to overstate how much of an obviously bad idea this was.&nbsp;</p>", "parentCommentId": "tJSgdJbCtK3kiaGgv", "user": {"username": "titotal"}}, {"_id": "bgxKsgJWJuBML8pn3", "postedAt": "2023-07-21T21:48:43.100Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>1. At the time, EA was looking for bold ideas to use a lot of money productively. There was talk of a funding overhang. EA was looking to get aggressive at spending money on useful things. I think you'd have heard very little pushback at the time on this.</p><p>2. I'm still not against this. I think this is a very good piece of the puzzle in mitigating against bio risk. I know it is expensive. Whether we do it or not depends a bit on our other options and the amount of money EA has.</p><p>3. Maybe not this island specifically but it seems like a decent start.</p><p>4. I don't think the island should be \"specific to EAs\" but a selected group that would be able to restart civilization? Sure</p>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "dpvydrjTAMkDANfdq", "postedAt": "2023-07-21T22:01:03.567Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<ol><li>I think there definitely would have been pushback against this at the time! And if there wasn't, I would have not felt like this was a community for me. Titotal's <a href=\"https://forum.effectivealtruism.org/posts/8NgFWTk2puBG5eSJA/ftx-foundation-wanted-to-buy-the-nation-of-nauru-to-save-eas?commentId=mXozkSFpZL9mDBznd\">comment</a> explains this better than I could. Additionally, GiveDirectly could have deployed billions and animal welfare charities were nowhere close to fully funded even at the height of the FTX bubble.</li><li>The idea of refuges broadly isn't obviously terrible, but all the specifics of this one seem terrible, again for reasons outlined by others.</li><li>See above</li><li>This seems like a pretty essential piece of the proposal!&nbsp;</li></ol>", "parentCommentId": "bgxKsgJWJuBML8pn3", "user": {"username": "Garrison"}}, {"_id": "vsgqujaRq2YFfewKA", "postedAt": "2023-07-21T22:05:32.393Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>It does depend on the cost, to be clear. And I fully agree with you that animal welfare charities are starved for cash and that we can be deploying far more to Global Health and Poverty.</p>", "parentCommentId": "dpvydrjTAMkDANfdq", "user": {"username": "MarcusAbramovitch"}}, {"_id": "uegFms9Lzu3Wui9Xb", "postedAt": "2023-07-21T22:53:48.234Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>This idea doesn't strike me as super crazy, though I do dislike the focus on \"having most EAs survive\", and I feel like at least the framing in the article implies too much like you can just \"purchase a sovereign nation\".&nbsp;</p><p>That said, I think neither the idea that you can purchase a sovereign nation, nor the idea to invest in shelters for your local community, strikes me as bad. If 95%+ of the Nauruan population would prefer receiving a large cash gift in order to give substantial control over the nation to a third party, this seems like the kind of thing that a democratic nation should be allowed to do.</p><p>Separately, it seems pretty fine to me to be more motivated to save your friends and local community than to be motivated to save a random subset of humanity. I would be excited if a bunch of billionaires or nation states or religious communities or local communities decided to build shelters for themselves and their friends/allies, and would not demand entry to such shelters if I did not contribute to building them.</p><p>My guess is this is quite unlikely to break even on cost-effectiveness grounds (compared to other ways to spend money more effectively), and I don't think this should count as a charitable intervention by normal US 501c3 standards, since it's not for the public benefit, but only for the benefit of a specific professional community, but otherwise it seems like this plan could have been executed in a way that would have been good for the world.&nbsp;</p><p>That said, de facto I expect that FTX, if they had ever taken this project seriously, would have not gone ahead with this plan in a way that would have been good for the world, mostly because they have demonstrated that they weren't very good at respecting boundaries and engaging in trades that leave all parties better off, and my guess is they would have done it in a way that would have violated some of the autonomy of the citizens of Nauru, and my guess is would have not been honest and straightforward about how this mostly benefits them and their friends.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "9D6bdjDaJ7H2DBS9u", "postedAt": "2023-07-21T23:18:56.762Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>&nbsp;If 95%+ of the Naura population would prefer receiving a large cash gift in order to give substantial control over the nation to a third party, this seems like the kind of thing that a democratic nation should be allowed to do.</p></blockquote><p>I'll first note that it seems incredibly unlikely that 95% of a population would agree to sell their ancestral homeland out from under themselves. But even if they did, what would happen if the next year there was some scandal and they changed their minds, and then 95% of them wanted the FTX project gone? Does the project go caput, despite the substantial investment, or does FTX continue on and override the democratic wishes of the people of Nauru?&nbsp;</p><p>It seems to me that the talk of buying an entire nation (instead of say, buying a plot of land <i>inside</i> a nation), is inherently undemocratic, for this reason. You're not just buying land, you're buying <i>control over people. </i>Fortunately, the idea is crazy for about a dozen other reasons I listed elsewhere, so it never would have gotten that far in the first place.&nbsp;</p>", "parentCommentId": "uegFms9Lzu3Wui9Xb", "user": {"username": "titotal"}}, {"_id": "hAk9wYWFS8wvGovEs", "postedAt": "2023-07-21T23:29:27.935Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>There are also minor citizens, and citizens not yet born. Even assuming all the adult citizens could and would validly and irrevocably sell their democratic rights, they could not validly sell those of the next generation.</p>\n", "parentCommentId": "9D6bdjDaJ7H2DBS9u", "user": {"username": "Jason"}}, {"_id": "jGtTWrJgQEEM5Rqzj", "postedAt": "2023-07-21T23:42:23.472Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>None of that would detract from its \"value\" as a regulation-free zone for crypto enterprises though!</p>\n<p>(At least where a plan has significant problems, and a co-conspirator or member of SBF's family was involved in the plan somehow, I think it's fair game to point out how the plan could have had significant advantages for SBF's own personal interests.)</p>\n", "parentCommentId": "c8uHycFnA5ZJaJYGa", "user": {"username": "Jason"}}, {"_id": "HhhEdH5Luom9D2HmM", "postedAt": "2023-07-21T23:48:29.142Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>I'll first note that it seems incredibly unlikely that 95% of a population would agree to sell their ancestral homeland out from under themselves. But even if they did, what would happen if the next year there was some scandal and they changed their minds, and then 95% of them wanted the FTX project gone? Does the project go caput, despite the substantial investment, or does FTX continue on and override the democratic wishes of the people of Nauru?&nbsp;</p></blockquote><p>I don't know how unlikely it is. It seems like the kind of thing that probably hasn't been tried, or at least not tried in a high-integrity way. It's plausible to me that it couldn't happen, but we are talking about just a few thousand people, which is small enough (though still, of course, an enormous undertaking) that you could negotiate with a huge fraction of those people individually. My sense is there have been areas with 10,000+ people who were voluntarily relocated, and where the relocation package did get a 95%+ approval, but I am not sure.</p><blockquote><p>But even if they did, what would happen if the next year there was some scandal and they changed their minds, and then 95% of them wanted the FTX project gone?</p></blockquote><p>The same that happens if the nation otherwise made agreements with external parties. Sometimes governments borrow money from foreign nations or corporations, and they are generally expected to pay that money back.&nbsp;</p><p>It is definitely the kind of thing that should be figured out as part of the contract. Having a vote where people can give back any funds they received, or some large fraction of it, but then kick out the people who gave that money, seems pretty reasonable to me.&nbsp;</p><p>Seems like a super messy situation, but I don't think it's without precedent, and it feels like the kind of thing that could be figured out.</p><blockquote><p>It seems to me that the talk of buying an entire nation (instead of say, buying a plot of land <i>inside</i> a nation), is inherently undemocratic, for this reason.</p></blockquote><p>I agree that treating the purchase of a nation as a commodity is deeply confused and probably implies a lack of respect for democratic boundaries by the writer. But a democratic nation, democratically agreeing to sell some or most of the ownership over their nation seems like a reasonable thing for a democracy to do. If it's the will of the people, I am not going to stop them? On what basis would you prevent a nation from democratically deciding to sell their governance this way?</p>", "parentCommentId": "9D6bdjDaJ7H2DBS9u", "user": {"username": "Habryka"}}, {"_id": "R5bQ5nYTbLjrSqMPw", "postedAt": "2023-07-21T23:51:34.725Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Yeah, I think this is a pretty interesting question. I don't have a super strong take here.&nbsp;</p><p>Parents can move to a nondemocratic country, and so already have the power to validly and irrevocably give up the democratic rights of their children. I wouldn't currently prevent a pregnant parent from moving to China because that would give up the democratic rights of their future children, would you? It's plausible I should, but I don't currently feel sold on that.</p>", "parentCommentId": "hAk9wYWFS8wvGovEs", "user": {"username": "Habryka"}}, {"_id": "zbWexq9nGo7qGoovf", "postedAt": "2023-07-22T01:33:06.686Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>(In most cases, a parent's move to another country will not strip their citizen children of citizenship in the democratic country with the right of returning there. This is often true even for children who have not yet been born. And I think my objection would win if limited to already-born minor children only. But I'll assume the parental action would indeed strip the child's citizenship.)</p><p>I think you're describing a life decision by the parent that has an incidental (albeit significant) effect on the child. Where a pregnant person lives is their decision because it is a question of their own personal autonomy. Whether to sell a child's democratic rights is not a decision about the parent's life and personal autonomy.</p><p>For example, one could believe that adults should be able to sell one of their kidneys for cash. (I'm not taking a position on that, but will assume it is correct for this paragraph). That doesn't come close to implying that a parent could validly sell one of the their child's kidneys for cash, even if the cash were securely locked up in a way that the child was guaranteed the full benefit of the payment.&nbsp;</p>", "parentCommentId": "R5bQ5nYTbLjrSqMPw", "user": {"username": "Jason"}}, {"_id": "egKk7JFt3L6unAGAi", "postedAt": "2023-07-22T01:52:47.715Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>Separately, it seems pretty fine to me to be more motivated to save your friends and local community than to be motivated to save a random subset of humanity.&nbsp;</p></blockquote><p>Sure, it's at a minimum better than those superyachts the other billionaires seem to favor. But any such discussions need to be light-years away from anyone involved with one's charitable foundation. That's not charity, that's a personal expense like the superyachts. And, in my view, it is epistemically critical to keep one's EA activities and one's personal activities separate (at least at that level of massive spend).</p>", "parentCommentId": "uegFms9Lzu3Wui9Xb", "user": {"username": "Jason"}}, {"_id": "SfN2K5SrZbBMBxqZX", "postedAt": "2023-07-22T01:57:11.316Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>(In most cases, a parent's move to another country will not strip their citizen children of citizenship in the democratic country with the right of returning there. This is often true even for children who have not yet been born. And I think my objection would win if limited to already-born minor children only. But I'll assume the parental action would indeed strip the child's citizenship.)</p></blockquote><p>Is this true? If a pregnant parent denounces their citizenship, I was assuming this would invalidate the citizenship of their unborn child. I should have clarified that moving alone isn't enough, but like, parents can renounce their citizenship, and this affects the citizenship status of their future children, which seems like the same deal.</p>", "parentCommentId": "zbWexq9nGo7qGoovf", "user": {"username": "Habryka"}}, {"_id": "stfsgJqouJWh4SH4J", "postedAt": "2023-07-22T01:59:14.942Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Totally! This seems pretty clearly non-charitable (which I tried to emphasize in my comment).</p>", "parentCommentId": "egKk7JFt3L6unAGAi", "user": {"username": "Habryka"}}, {"_id": "9P4scGg9ZxyrhGppS", "postedAt": "2023-07-22T03:04:53.164Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Countries make irrevocable decisions that influence their decedents all the time. When the colonies decided to become independent, they deprived their future generations of the benefits of British citizenship, but few people think this was an invalid decision.</p>", "parentCommentId": "hAk9wYWFS8wvGovEs", "user": {"username": "Larks"}}, {"_id": "Tc8eNuJhNezbwgJAR", "postedAt": "2023-07-22T03:31:27.524Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I believe most EAs live in major cities and other densely populated areas. At least according to orthodox \"prepper\" doctrine, that is a massive comparative disadvantage to effective prepping for the end of the world as we know it (\"TEOTWAWKI\"). For most near-extinction level events, I think orthodox prepper doctrine is probably right . . . among other things, nuclear threats and pandemics are likely to hit the Bay much harder than rural Montana. There are also a lot more mouths to feed in those areas versus natural resources. So even with a fairly significant investment of time and resources, I'm not sure your median EA could realistically get to a significantly better odds of survival in TEOTWAWKI than a mildly prepared person in rural Montana (without moving of course).</p><p>That being said, most people should be able to make it at least 14 days in their own home, and have three days of supply to-go (cf. the Red Cross <a href=\"https://www.redcross.org/get-help/how-to-prepare-for-emergencies/survival-kit-supplies.html\">here</a>, although I'd view its supply list as a starting point rather than a complete list). Having that level of preparedness across the board could certainly come in handy during various catastrophic events, as well as your garden-variety natural disaster.</p>", "parentCommentId": "7GXEuRb4MoWJeDoEE", "user": {"username": "Jason"}}, {"_id": "pxuNotqxNYCLfPGLr", "postedAt": "2023-07-22T03:48:10.177Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>In the U.S.: you can renounce citizenship (which must be done abroad), and then have your child abroad. This should prevent the child from obtaining U.S. nationality through you, although they could still obtain it through the other parent (if any). However, I think renunication by people with prior U.S. residence is fairly uncommon -- unless the renouncing person had another nationality, they would become stateless, which is not something you want to be!</p><p>Parents cannot, however, renounce the U.S. citizenship of their (born) minor children.</p>", "parentCommentId": "SfN2K5SrZbBMBxqZX", "user": {"username": "Jason"}}, {"_id": "NDLJDnTcAxYjpdxop", "postedAt": "2023-07-22T09:17:08.229Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>My sense is there have been areas with 10,000+ people who were voluntarily relocated, and where the relocation package did get a 95%+ approval, but I am not sure.</p></blockquote><p>I'm sure this has happened somewhere in the US, say, but, those 10,000 people did not constitute an entire sovereign nation, with representatives in the UN and so on. They were \"moving down the road\", to a different place within the same nation, where they continued to have democratic control over their own laws. The people of Nauru have lived there for 3000 years, and suffered greatly under colonial rule before finally gaining self-governance, I find it unlikely they would give it up again so lightly.&nbsp;</p><p>Fundamentally, I do not think it makes sense for a country to \"democratically\" give up it's right to democratic self-governance. I mean, think about the people who voted \"no\" on the sale: their right to vote on their own governance, on their own ancestral homeland, is taken away from them without their consent. I do not see a universe where this is ethical. Even if the set of laws FTX is allowed to write are limited, they still apply to the people of the nation, who either have to obey the FTX foundation or abandon their own country and ancestral homeland.&nbsp;</p><p>I'm sorry if I come off as emotional here, but I find this proposal deeply troubling and it stands against every one of my principles. I really hope that it was only the one or two fools who were actually considering it. &nbsp;</p>", "parentCommentId": "HhhEdH5Luom9D2HmM", "user": {"username": "titotal"}}, {"_id": "rX29EGpvE6hmAn8L2", "postedAt": "2023-07-22T13:38:22.147Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Buying a coal mine ( a common occurrence that normal people do, though it turns out Will misunderstood the process in a way that probably invalidated the plan ) seems sufficiently different from buying a country ( a very rare occurrence with no established process, normal people do not do ) that I don't think you should take Will's serious interest in the former as much evidence about the latter.</p>", "parentCommentId": "prPXMHusGNxwvwS2t", "user": {"username": "Larks"}}, {"_id": "qPqAmr8dyBpbFKkD8", "postedAt": "2023-07-22T14:09:55.062Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>People initially downvoted the post because \"<a href=\"https://forum.effectivealtruism.org/users/eugenics-adjacent?from=post_header\"><strong>Eugenics-Adjacent</strong></a><strong>\" </strong>is Émile Torres' account, and they typically don't engage in an intellectually honest way. Sure enough, Émile tweeted a screenshot of this post and highlighted that the byline was scandalously named \"Eugenics-Adjacent\" even though Émile is the one who gave it that name: https://twitter.com/xriskology/status/1682449905363701774&nbsp;</p><p>There's nothing wrong with the content of the original post, except that Émile refers to \"us,\" as if <a href=\"https://forum.effectivealtruism.org/users/eugenics-adjacent?from=post_header\"><strong>Eugenics-Adjacent</strong></a><strong> </strong>is an EA who is concerned about negative public perception of EA rather than someone who is in fact banking their career on a negative public perception of EA.</p>", "parentCommentId": "mXozkSFpZL9mDBznd", "user": {"username": "vboro"}}, {"_id": "GzEhLGmz3evJCNzwa", "postedAt": "2023-07-22T14:47:44.275Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Yeah, I did not mean to suggest anything about Will's support for buying small island nations. The point is just that when buying land (albeit coal mines, not Nauru) and building bunkers are mentioned in the same breath in a very public discussion at a very public EA event:</p><ol><li>I think this makes it harder for the EA community to put as much ideological space between itself and \"buy Nauru\" as we might like to. Clearly \"buy island nation\" and \"buy coal mines/build bunkers\" are different, but I don't know that they're <i>sufficiently</i> different that I would say \"wow, Gabe really went out on a limb in coming up with this; I doubt this idea was inspired by others he was exposed to through conversations with people in the EA community.\"</li><li>This makes me think that more extreme versions of these ideas were being floated behind closed doors (/on Signal). If I'm right about this, then I suspect we'll see more evidence of this during the trial, and I will happily eat my words in a few months if we don't.</li></ol><p>Maybe a more precise way of putting this:</p><p>If \"buy coal mines/build bunkers\" = A, and \"buy Nauru\" = E, then my view is that: 1) A and E aren't <i>that</i> far apart (just separated by B, C, and D) and 2) I suspect B, C, and D were being discussed.</p>", "parentCommentId": "rX29EGpvE6hmAn8L2", "user": {"username": "hobbes"}}, {"_id": "sgZhL4peuhZaiEWj8", "postedAt": "2023-07-22T15:03:23.324Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I'm curious about all the downvotes as I understood Marcus to simply be saying \"Building a bunker for some people somewhere should at least be on the table.\"</p><p>Is even this just too toxic an idea in the current political climate? Because if you can't save everyone, you obviously shouldn't save anyone or something like that?</p><p>(I know Garrison has given a response below that sounds like an explanation for a downvote, but actually I can't see any disagreement in it.)</p>", "parentCommentId": "bgxKsgJWJuBML8pn3", "user": {"username": "aprilsun"}}, {"_id": "Euj9dd4MZ3hyzhKDN", "postedAt": "2023-07-22T15:21:02.381Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Jason - good points.&nbsp;</p><p>Even for EAs who live in major cities, it can be helpful to cultivate good relationships with friends or extended family who live in lower-density areas, in case situations escalate (e.g. nuclear brinksmanship, pandemic intensifies) enough that it's worth leaving the city.</p><p>In terms of prepping with supplies, it's worth remembering that if one doesn't have effective means to defend one's supplies from others who might want them, one's basically just storing up stuff that will end up being taken by others. In some countries, 'effective defense' just means good fences and locks; in other countries, it means AR-15s.&nbsp;</p><p>The best defense is often just 'op sec' (operational security), meaning, don't brag about being a prepper in public, on social media, or in giving away cues of prepping (e.g. survivalist bumper stickers or house signs), which just makes one a target for others.</p>", "parentCommentId": "Tc8eNuJhNezbwgJAR", "user": {"username": "geoffreymiller"}}, {"_id": "7mDvZ6YtAgoi2bYzo", "postedAt": "2023-07-22T18:51:20.646Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>One way for us to find that out would be for the person who was sent the memo and thought it was a silly idea to make themselves known, and show the evidence that they shot it down or at least assert publicly that they didn't encourage it.&nbsp;</p><p>Since there seems to be little downside to them doing so if that's what happened, if no-one makes such a statement we should increase our credence that they were seriously entertaining it.</p>", "parentCommentId": "SxR5JgbokYwnjEFLp", "user": {"username": "Arepo"}}, {"_id": "bKc78Z85jaZ7BDnFo", "postedAt": "2023-07-22T20:27:19.619Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>About point 4: While commenting, I presumed the controversial bit was \"let's build bunkers <u>only for EAs.</u>\" Reading other comments, however, it seems that maybe I misunderstood something because there is more focus on the \"let's build bunkers\" part and not as much on the latter.<br><br>The idea of making bunkers is somewhat out there but not uncommon; governments have done it nationally at least once, and an active group of <i>preppers</i> do it now. In the event of a catastrophe, I would appreciate having access to a bunker, and I am sure so would others.&nbsp;<br><br>Making it <i>only for EAs</i> implies (the utterly wrong idea) that in the event of a catastrophe, EAs are somehow more valuable and worthy of saving than non-EAs. This goes against some <a href=\"https://forum.effectivealtruism.org/posts/MP9qDZCXMaTJhiJ9u/ea-is-three-radical-ideas-i-want-to-protect\">core ideas that we aim to cultivate.</a></p>", "parentCommentId": "dpvydrjTAMkDANfdq", "user": {"username": "satpathyakash"}}, {"_id": "Qo8q8Wp8SJwupJ4ty", "postedAt": "2023-07-23T03:12:52.051Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Your first point brings up yet another reason the Nauru proposal was ill-conceived on its face -- in an active nuclear brinkmanship or pandemic situation, getting a bunch of EAs to Nauru of all places in a hurry would have been extraordinarily difficult.</p>\n<p>If I were trying to save a bunch of EAs from a near-catastrophic event . . . the centerpiece of my plan sure wouldn't be a bunker that was only useful with extensive advance notice.</p>\n", "parentCommentId": "Euj9dd4MZ3hyzhKDN", "user": {"username": "Jason"}}, {"_id": "4sugvJryBukQcj4hc", "postedAt": "2023-07-23T07:29:03.026Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Could someone say why they downvoted this comment?</p>", "parentCommentId": "7mDvZ6YtAgoi2bYzo", "user": {"username": "Arepo"}}, {"_id": "4FwGKQprvRjEzBfNw", "postedAt": "2023-07-23T07:49:01.021Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I don't think there is any evidence that this proposal was <strong>seriously</strong> considered, and I am fairly sure human reproductive cloning is not legal in any US state.</p>", "parentCommentId": "6BGAkdeL3bqQwiAXK", "user": {"username": "calebp"}}, {"_id": "CYt5N3PxF5HrWSsvZ", "postedAt": "2023-07-23T12:29:30.532Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Didn't vote, but I think your comment didn't grapple with legal exposures. They are likely higher for FTXFF affiliated persons than anyone else still in EA, and the FTX estate isn't going to shell out for legal advice and analysis so they can manage EA PR risks.</p>\n<p>I think your adverse-inference reasoning can be valid in some cases, even those with legal implications if involving orgs.</p>\n", "parentCommentId": "4sugvJryBukQcj4hc", "user": {"username": "Jason"}}, {"_id": "BuMYi8CQJEodQnfFK", "postedAt": "2023-07-23T15:24:31.778Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>It's a bit more complicated, as I understand (from Wikipedia):</p>\n<p>\"In 1998, 2001, 2004, 2005, 2007 and 2009, the United States Congress voted whether to ban all human cloning, both reproductive and therapeutic (Stem Cell Research Enhancement Act). Divisions in the Senate, or an eventual veto from the sitting President (George W. Bush in 2005 and 2007), over therapeutic cloning prevented either competing proposal (a ban on both forms or on reproductive cloning only) from being passed into law. On 10 March 2010, a bill (HR 4808) was introduced with a section banning federal funding for human cloning. Such a law, if passed, would not have prevented research from occurring in private institutions (such as universities) that have both private and federal funding. However, the 2010 law was not passed.</p>\n<p>There are currently no federal laws in the United States which ban cloning completely. Fifteen American states (Arkansas, California, Connecticut, Florida, Georgia, Iowa, Indiana, Massachusetts, Maryland, Michigan, North Dakota, New Jersey, Rhode Island, South Dakota, and Virginia) ban reproductive cloning and three states (Arizona, Maryland and Missouri) prohibit use of public funds for such activities.</p>\n<p>Ten states, California, Connecticut, Illinois, Iowa, Maryland, Massachusetts, Missouri, Montana, New Jersey and Rhode Island, have \"clone and kill\" laws that prevent cloned embryo implantation for childbirth, but allow embryos to be destroyed.\"</p>\n<p>In global comparisons like this (<a href=\"https://www.ruf.rice.edu/~neal/temp/ST%20Policy/index/SCBooklet/World.pdf\">https://www.ruf.rice.edu/~neal/temp/ST Policy/index/SCBooklet/World.pdf</a>), the US is routinely classified as not having a complete ban on human cloning.</p>\n", "parentCommentId": "4FwGKQprvRjEzBfNw", "user": {"username": "Moritz von Knebel"}}, {"_id": "ixSzKWzEvk7aA8Dcu", "postedAt": "2023-07-24T12:15:59.082Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I amend my previous comment to replace the phrase \"seriously considered\" with \"considered.\" Also, there are many state laws against human reproductive cloning, but many states have no such laws:&nbsp;</p><p>https://www.thenewatlantis.com/publications/appendix-state-laws-on-human-cloning</p>", "parentCommentId": "4FwGKQprvRjEzBfNw", "user": {"username": "Peter Berggren"}}, {"_id": "cBkxXybkcjAPxCDm8", "postedAt": "2023-07-24T13:21:38.973Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Do you have additional evidence that this was specifically Torres, and not someone else who dislikes EA?&nbsp;</p><p>I was initially skeptical of the claim, thinking it was one of Torres followers, but looking at the timestamps, it seems that the OP here was posted 20 minutes before Torres <a href=\"https://twitter.com/xriskology/status/1682392845318082560\">tweeted</a> about the article. And I know Torres has <a href=\"https://markfuentes1.substack.com/p/emile-p-torress-history-of-dishonesty#%C2%A7sockpuppetry\">used sock-puppets</a> before, so it at least seems plausible that it's another one.&nbsp;</p><p>However, It could have also been that Torres saw the post here and decided to tweet about it, or that eugenics-adjacent is a different person who posted here and then tipped off Torres about the article, or they both by chance saw the article at around the same time. I don't think there is enough information to make a confident accusation here.&nbsp;</p>", "parentCommentId": "qPqAmr8dyBpbFKkD8", "user": {"username": "titotal"}}, {"_id": "q8ocrmkHEixgXb9iq", "postedAt": "2023-07-24T15:36:33.626Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>If \"Eugenics-Adjacent\" is not Torres but tipped off Torres about the article, that also seems like a good reason for downvoting the post, since it indicates that the username was chosen to cause damage to EA rather than to stimulate an honest discussion.</p>", "parentCommentId": "cBkxXybkcjAPxCDm8", "user": {"username": "Pablo_Stafforini"}}, {"_id": "tEQ8fcRFqdRZhZ9Hn", "postedAt": "2023-07-24T16:46:49.323Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I'm concerned about downvoting posts containing news information solely on a belief that they were posted by a sockpuppet. It was appropriate for there to be a post on this news development, and downvoting based on a belief about the poster's identity has the unintended effect of burying the adverse news story (and the appearance of doing so).</p>\n<p>Conditional on this being Torres, all those downvotes just played into their hands. If this post were truly objectionable, someone should have put the news information in a separate post so that sockpuppet defense doesn't imperil visibility of news information.</p>\n<p>I thought it was pretty obvious that \"Eugenics-Adjacent\" would likely be a critic.</p>\n", "parentCommentId": "qPqAmr8dyBpbFKkD8", "user": {"username": "Jason"}}, {"_id": "BxTNnGN4AtTAkALZ7", "postedAt": "2023-07-26T19:05:48.477Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>Two people downvoted <i>this</i> comment O_o</p>", "parentCommentId": "4sugvJryBukQcj4hc", "user": {"username": "Arepo"}}, {"_id": "rLNZtLBjHBwaXRXt8", "postedAt": "2023-08-05T21:38:24.405Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<blockquote><p>I thought it was pretty obvious that \"Eugenics-Adjacent\" would likely be a critic.</p></blockquote><p>Torres' tweet and commentators don't <i>appear</i> to think so, but I often have trouble teasing apart the difference between performative outrage and genuine ignorance, especially from strangers.</p>", "parentCommentId": "tEQ8fcRFqdRZhZ9Hn", "user": {"username": "Linch"}}, {"_id": "8QDqBsdQXREfhAWeZ", "postedAt": "2023-08-05T21:43:56.856Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": "<p>I didn't downvote your original comment, but I think the sample space of possible options is quite wide, and it shouldn't be too difficult for a reasonable person to generate a subset of them.&nbsp;</p><p>I will try to refrain from making further meta-level observations.</p>", "parentCommentId": "4sugvJryBukQcj4hc", "user": {"username": "Linch"}}, {"_id": "ne74zDza7PyYxtGLF", "postedAt": "2023-08-01T05:33:02.759Z", "postId": "8NgFWTk2puBG5eSJA", "htmlBody": null, "parentCommentId": "4FwGKQprvRjEzBfNw", "user": null}]