[{"_id": "RpdSLjJL4RqDtQWcv", "postedAt": "2022-10-28T13:30:35.863Z", "postId": "8nGm8r7EM4oDXjbbz", "htmlBody": "<p>Hi Cesar! You might be interested to check out the transparency page for the Against Malaria Foundation: <a href=\"https://www.againstmalaria.com/transparency.aspx\">https://www.againstmalaria.com/transparency.aspx</a> &nbsp;</p>", "parentCommentId": null, "user": {"username": "Zachary Brown"}}, {"_id": "5CzjfADDN7sazRzDw", "postedAt": "2022-10-28T13:48:57.063Z", "postId": "8nGm8r7EM4oDXjbbz", "htmlBody": "<p>Hi Zachary,</p><p>Yes! I am aware that AMF is considered one of the best examples of transparency in the EA Community. I already glanced at it before but I will now take a closer look at their page. They definitely show a higher standard of transparency when compared to other organizations but I am still not sure they provide what can be called <i>true transparency</i> (one that could be independently verifiable and does not demand <i>faith based trust</i>).</p><p>But I may be wrong. I don't have enough information to build strong conclusions yet... that is why I will spend some time reading their website and hopefully, if I have time, I will share my findings here.</p><p>Thanks.</p>", "parentCommentId": "RpdSLjJL4RqDtQWcv", "user": {"username": "Cesar Scapella"}}, {"_id": "ZjbWPz9dZruW6zEf4", "postedAt": "2022-10-28T15:35:02.552Z", "postId": "8nGm8r7EM4oDXjbbz", "htmlBody": "<p>What are the specific things you'd want to see on a transparency page? I think transparency is important, and I try to maintain <a href=\"https://existence.org/transparency\">BERI's transparency page</a>, but I'm wondering if it meets your standards.</p>", "parentCommentId": null, "user": {"username": "sawyer"}}, {"_id": "mqBsWRM3vrtBzTh9v", "postedAt": "2022-10-28T15:51:56.644Z", "postId": "8nGm8r7EM4oDXjbbz", "htmlBody": "<p>You might be interested in the concept of <a href=\"https://forum.effectivealtruism.org/posts/8RcFQPiza2rvicNqw/minimal-trust-investigations\">\"minimal trust investigations\"</a> (and <a href=\"https://forum.effectivealtruism.org/search?query=minimal%20trust%20investigation\">other posts that mention it</a>)</p>", "parentCommentId": "5CzjfADDN7sazRzDw", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "GFEGzgBjEcPgDtsF4", "postedAt": "2022-10-28T21:15:38.242Z", "postId": "8nGm8r7EM4oDXjbbz", "htmlBody": "<p>Hi Sawyer, I looked at your transparency page and I believe that it is somewhat satisfactory for the kind of people who are familiar with the nonprofit structure.</p><p>For a potential donor who is totally unfamiliar with the organization and also does not live in the US, they may find it difficult to navigate and understand.</p><p><strong>For example:</strong></p><p>People outside of US (and probably some people living in the US) may not be satisfied with IRS 990 filings as they may not know how they should interpret that information (myself included) and how much importance they should give to it (in the context of transparency).</p><p>There are other documents, for example one called \"ByLaws\", which, again, for a non-US person (or US people who are not familiar with those docs) they can't judge the importance of such document for the transparency of an organization.</p><p>Alright, all of this is not exactly a criticism, especially if your organization is only focused on the US audience for donations and contributions.</p><p>As to the annual reports I think it is a positive sign that they contain a lot of information. I would suggest though it would make for a more friendly transparent page if some key information was summarized in a neat table of contents shown at the top of the page like: salary of each team member, total donations received per month or year, how much spent (on what), etc., so that someone from outside could have some overall idea of what is going on before they dig deeper on those more technical and dense PDFs.</p><p><strong>A note:</strong> it is probably there in the annual reports or 990 files, but I couldn't easily find info about team members and directors salary. I think that is crucial information to be found buried inside PDFs. I know that is a minor thing but if you take a look at the transparency page of <a href=\"https://buffer.com/transparency\">Buffer</a> you will have a good illustration of what I am imagining.</p><p>I conclude by saying that your page is probably satisfactory for someone well versed in how nonprofit work, its financials, IRS files, etc (and also have a good 30 minutes to sit down and read). Not friendly for the lay people, I have to say.</p><p>But again, this would be irrelevant if the lay public is not your target audience or the main source of donations.</p>", "parentCommentId": "ZjbWPz9dZruW6zEf4", "user": {"username": "Cesar Scapella"}}]