[{"_id": "BdKTgCc6H56vxMAtS", "postedAt": "2023-06-06T14:52:18.361Z", "postId": "8nNWnDBTh8r59x2L7", "htmlBody": "<p>Excited abstractly about debates as EAG programming! Though I don't have any particular ideas that aren't either too broad or too in the weeds.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "rmwe4ydZ7AiBhDuKu", "postedAt": "2023-06-06T16:18:04.399Z", "postId": "8nNWnDBTh8r59x2L7", "htmlBody": "<p>The best debates I've seen are by Intelligence Squared. John Donovan appears to be a very skilled moderator. Watching him cut off debaters or &nbsp;re-route the conversation is a pleasure, and shows the difference between an excellent moderator and a passable moderator.</p><p>I don't know all the factors that contribute to Intelligence Squared debates, but I suspect that the pre- and post-debate audience voting, choice of debaters, and good moderation contribute a lot.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "7r3yrZztcfuBfhi37", "postedAt": "2023-06-06T16:24:09.196Z", "postId": "8nNWnDBTh8r59x2L7", "htmlBody": "<p>I have a slight concern that this would contribute to the vague celebrity/elitist culture that EA has. Sure, I'd find it fun/enjoyable to see people who are EA-famous on stage, but that plays into my vague perception of the <i>haves</i> and the <i>have nots</i>, elitism, and other poorly defined/not well thought-out ideas.</p><p>I'm not sure how to avoid that. Maybe design it so that none of the debaters are well-known people?</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "nBfsaqkppu9eew7o8", "postedAt": "2023-06-06T17:11:05.872Z", "postId": "8nNWnDBTh8r59x2L7", "htmlBody": "<p>Yeah I wasn't planning on these necessarily being between \"famous\" EAs - if someone is a content expert and wants to debate, and happens to be \"famous\" then that'd be okay I think. But the point isn't \"Come to EAGx and watch the MacAskill v Holden debate boxing\".</p>\n", "parentCommentId": "7r3yrZztcfuBfhi37", "user": {"username": "Kaleem"}}, {"_id": "DmCtuHwfL7rJJDiqa", "postedAt": "2023-06-08T13:00:28.166Z", "postId": "8nNWnDBTh8r59x2L7", "htmlBody": "<p>Could you share how the debate format may be more likely to play into celebrity/elitist culture in EA than a standard conference talk format?</p>", "parentCommentId": "7r3yrZztcfuBfhi37", "user": {"username": "Rockwell Schwartz"}}, {"_id": "uWEzWPjXpRizosxK9", "postedAt": "2023-06-08T17:17:30.154Z", "postId": "8nNWnDBTh8r59x2L7", "htmlBody": "<p>Hmmm. I don't have anything well thought out, but my rough and off-the-top-of-my-head impressions are this:</p><ul><li>it is much more impressive to speak extemporaneously about a complex subject than to do a prepared speech</li><li>an aspect of charisma and of performance in debates that seems much more impressive than in giving a talk</li><li>the fact that there are \"sides\" in a debate increases the level of excitement/tension</li><li>the fact that it isn't fully rehearsed means that we might see new things. (simple example, if I am a huge fan of John Doe, going to a talk of his might be exciting but I am probably familiar with everything he is going to say. In a debate, there is the possibility of him sharing things that he hasn't shared before)</li></ul><p>None of these are particularly high-confidence, and I want to emphasize that these are vague impressions. I'll also add that how the debate is structured/designed has a huge affect, and could minimize or amplify various characteristics. Merely saying \"a debate\" really leaves a lot of room open for interpretation regarding what it will actually be. (4-10 people around a conference table in a small room? 2-4 people on stage with podiums? Time limits? Interruptions? Prepared notes? Audience votes?)</p>", "parentCommentId": "DmCtuHwfL7rJJDiqa", "user": {"username": "jlemien"}}, {"_id": "GBhKsRJkfbBz7XXym", "postedAt": "2023-06-08T20:20:59.519Z", "postId": "8nNWnDBTh8r59x2L7", "htmlBody": "<p>otoh I've found watching \"famous\" people debate helpful for taking them off the pedestal. It's demystifying to watch them argue things and think about things in public rather than just reading their more polished thoughts. The former almost always makes impressive-looking people seem less impressive. &nbsp;</p>", "parentCommentId": "uWEzWPjXpRizosxK9", "user": {"username": "Quadratic Reciprocity"}}]