[{"_id": "fw7kinNQyMZZE4psh", "postedAt": "2017-07-18T12:29:09.297Z", "postId": "8qMDseJTE3vCFiYec", "htmlBody": "<p>Thanks for the post!</p>\n", "parentCommentId": null, "user": {"username": "MartinHoover"}}, {"_id": "ziFGyExsPF4gGa2dB", "postedAt": "2018-02-24T11:07:47.457Z", "postId": "8qMDseJTE3vCFiYec", "htmlBody": "<p>This is extremely interesting, only now saw this article (I'm relatively new to the forum). Have you guys thought of publishing this (perhaps in combination with your other essay on the costliness of vaccine development) as a journal article? Beside being useful for science policy estimations, another domain of application for these results could be simulations of scientific inquiry (usually done in terms of agent-based models), where this data could serve as the basis of their empirical calibration. While this method has been increasingly popular in the domain of social epistemology, these models tend to be highly abstract, lacking the input of empirical data that would indicate which parameter choices and which results are relevant for the real world.</p>\n", "parentCommentId": null, "user": {"username": "Dunja"}}, {"_id": "55cy3MHG5LMJc2mhB", "postedAt": "2018-02-25T01:41:48.492Z", "postId": "8qMDseJTE3vCFiYec", "htmlBody": "<p>Thanks. We have not considered publishing as a journal article. I'm unsure of how that could be done, especially without formal academic credentials, and what the relevant costs and benefits would be. My initial guess is that it would be pretty time consuming without much benefit.</p>\n<p>There are going to be a few more posts in this series on the path to creating some cost-effectiveness estimates, so stay tuned! :D</p>\n", "parentCommentId": "ziFGyExsPF4gGa2dB", "user": {"username": "Peter_Hurford"}}, {"_id": "hbLGdhdLXtM6puwxk", "postedAt": "2018-02-25T11:02:44.161Z", "postId": "8qMDseJTE3vCFiYec", "htmlBody": "<p>I don't think you necessarily need academic credentials: submissions to most relevant journals are fully blind, so nobody would actually know whether you have the credentials or not (and if the article is accepted, you can simply be independent scholars with no affiliation, that's really unimportant (as it should be)).</p>\n<p>As for the costs: I think you wouldn't need too much time for this. Best would be to combine both essays into one article, make an intro into the topic, check again your sources and other relevant literature and send to a journal somewhere in the field of sociology of science/philosophy of science/science policy. Now, I am not a sociologist of science, so I am not familiar with other relevant literature on this topic (e.g. whether there already are similar estimations, which apply more rigorous standards, which suggest that you'd have to do the same - you could do some research and check this out, unless you've already done so). Just checking randomly online, I see there are studies such as <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0167629602001261\">this one</a>, which employ a more rigorous methodology, but I'm not sure if there is something similar concerning time estimates.</p>\n<p>Concerning your current sources, while Wikipedia is usually not an academic standard, if you have good reasons why it is for this kind of research (or at least in some of the cases), you could just explicitly state so in the text. Alternatively, if Wiki articles have their own (academic) sources, just cite those.</p>\n<p>As for the benefits: I think there'd be a lot of benefits! </p>\n<p>First, your results would be peer-reviewed, and even if the article is rejected you'd have a feedback from experts in the field, which would help you to revise your results and make them more accurate. In case someone in academia has already done a similar work, which you haven't been aware of, at least you'll learn this and integrate it with your results.</p>\n<p>Second, your results could become a more reliable basis for discussions on science policy: a peer-reviewed source for other scholars and policy makers. (I'd also have a personal interest here: as a philosopher of science, I'd be extremely interested in using your results in my research, and they would be more reliable if they passed a peer-review procedure).</p>\n<p>Third, your personal gain would be having a publication in an academic journal :)</p>\n", "parentCommentId": "55cy3MHG5LMJc2mhB", "user": {"username": "Dunja"}}, {"_id": "RAtZ5vfskayZBHNhn", "postedAt": "2018-02-26T00:01:11.203Z", "postId": "8qMDseJTE3vCFiYec", "htmlBody": "<p>Thanks, that's helpful, and I'm glad you find the research useful. I'll think about it and talk with Marcus (co-author).</p>\n", "parentCommentId": "hbLGdhdLXtM6puwxk", "user": {"username": "Peter_Hurford"}}]