[{"_id": "EEzKSKGi8BZLMnMDm", "postedAt": "2023-09-08T12:18:18.576Z", "postId": "8qQGLwwtSdq7jrNhE", "htmlBody": "<p><strong>Executive summary</strong>: The post seeks to identify policies to achieve Rawlsian principles of justice, focused on economic equality and political liberalism.</p><p><strong>Key points</strong>:</p><ol><li>The \"least advantaged\" are defined based on lifetime consumption rather than wealth, excluding voluntary choices.</li><li>Markets maximize efficiency but can fail due to externalities and irrational behavior, justifying limited government intervention.</li><li>Empirically, inclusive institutions like democracy and free markets improve outcomes for the disadvantaged globally.</li><li>Prescriptions include democracy, free markets and trade, land value taxes, Pigouvian taxes, and a social safety net.</li><li>Further details and justification are needed on implementing policies for developed vs. developing nations.</li><li>The first Rawlsian principle on civil liberties was not addressed.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "mXpZxxDkjz6RnAkdY", "postedAt": "2023-09-08T12:26:35.032Z", "postId": "8qQGLwwtSdq7jrNhE", "htmlBody": "<p>As a general rule, I think that \"algebraic\" and \"philosphical\" discussions are not very useful for economic policy or instituional desing. In my view, cardinal utility + (some kind of) utility normalization are all needed.&nbsp;</p><p>Is there even a single political arrangement that leaves everybody \"better off\"? There are allways fringe people who would be better in the state of nature, so Pareto arguments are only robust in paper. The organic nature of social systems imply that we cannot base anything on too exact-algebraic or logical moral systems: they are never robust. You need averages, and other \"smoothing\" operators.&nbsp;</p><p>On the other hand the main defect of \"naive\" cardinal utilitarianism is the fact that utility is un-observable and its absolute level is totally un-observable.</p><p>A solution is this:</p><p>&nbsp;<a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/1468-0262.00033\"><strong><u>Relative utilitarianism</u></strong></a><u>,</u><a href=\"https://scholar.google.com/citations?user=zohXkxsAAAAJ&amp;hl=en&amp;oi=sra\"><u> A Dhillon</u></a>, JF Mertens&nbsp;- Econometrica, 1999 &nbsp;</p><p>I have written this piece on issues parallel to those you are reviewing here:</p><p><a href=\"https://forum.effectivealtruism.org/posts/3YKZEFYgTccGbpQvf/no-room-for-political-philosophy\">https://forum.effectivealtruism.org/posts/3YKZEFYgTccGbpQvf/no-room-for-political-philosophy</a></p><p>Congratulations for the posts!</p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}]