[{"_id": "CgwtMhqRTpjEZ4ooN", "postedAt": "2023-10-04T12:23:15.139Z", "postId": "8rdZfXYPohdow5sei", "htmlBody": "<p><strong>Executive summary</strong>: Healthier Hens (HH), a charity aiming to improve the welfare of caged and cage-free hens, reports on its second year of operations, detailing financial challenges and a transition to a volunteer-led organization, while continuing research and outreach efforts to reduce hen suffering. It also provides updates on various projects, including a failed calcium timing study and ongoing work in Kenya, and discusses potential future strategies based on available funding and collected data.</p><p><strong>Key points</strong>:</p><ol><li>Despite financial challenges and a transition to a volunteer-led organization in their second year, Healthier Hens continued their mission of reducing hen suffering, particularly from keel bone fractures.</li><li>The organization conducted a calcium timing study with the University of Bern, but results indicated negative impacts on hen health, welfare, and productivity, leading to a reconsideration of such dietary interventions.</li><li>In Kenya, HH carried out farmer workshops, published a literature review on hen feed fortification, and a report on Kenyan feed quality issues, revealing significant knowledge gaps and the need for regional data on hen health issues.</li><li>HH estimates a slight net positive impact from their two years of operations, improving the lives of approximately 14,000 hens at a cost of $27 per hen.</li><li>Future strategies for the organization, to be decided in January 2024, range from shutting down to trialling multiple interventions simultaneously, dependent on financial resources and collected baseline data.</li><li>HH has received funding from multiple sources but continues to seek additional funds to further investigate and implement interventions to improve the welfare of cage-free hens.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "f79whKKjyBnCjj4g4", "postedAt": "2023-10-04T15:14:51.731Z", "postId": "8rdZfXYPohdow5sei", "htmlBody": "<p>It's a real shame that the calcium timing trial produced a negative result, but thanks for sharing the data. Hopefully you have more success trialing alternative interventions this year!&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "Y9Cj9jzRfkPCT39iM", "postedAt": "2023-10-04T17:34:04.492Z", "postId": "8rdZfXYPohdow5sei", "htmlBody": "<p>Definitely... We expected no effect at worst, so at least it was trialled small and in a well-controlled manner! Do share if you have opportunities, so that it's not repeated or rolled out somewhere. Thanks!</p>\n<p>We'll see what the data show and post an update once we make a decision.</p>\n", "parentCommentId": "f79whKKjyBnCjj4g4", "user": {"username": "lukasj10"}}, {"_id": "Nz7grJbhXBuBzdEns", "postedAt": "2023-10-05T06:33:12.961Z", "postId": "8rdZfXYPohdow5sei", "htmlBody": "<p>This looks like fantastic work on a small budget which makes sense. I'm always super impressed with publishing of negative results - my inclination there is that although it was negative welfare, in the long run it could be net positive as others will now not try</p><p>That you managed to run small RCTs like this on such a tiny budget is a real testament to the organisation, fantastic work! In medicine we usually need like a million dollars even for the most average RCT!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}]