[{"_id": "wi9ANb8XJEAvYb2Lq", "postedAt": "2021-11-18T16:26:01.248Z", "postId": "8w7BrsvZ4CkABmstF", "htmlBody": "<p>Thank you for your post Naomi! I saw some interesting similarities with how we organize our student group, so I wrote down some thoughts below.</p><p>Firstly, that same trend (heightened interest in aug/sep and jan/feb) probably also applies to students' availability/willingness to get engaged with new initiatives on their campus. This is certainly true for students at our university, so we also work with two 'recruitment seasons' (we call them 'cycles') per year.&nbsp;</p><p>Three additions to your image from our student group's perspective would be:</p><ul><li>Our initial marketing also included tabling at the university's fair for incoming students.</li><li>This year we're experimenting with a 4-week introduction to EA (preceded by some information sessions, indeed to reduce drop-out rate of our fellowship). The idea behind not doing a regular 8-week program is that it's easier to compete for students' attention with a shorter program. We hope to write a forum post about our 4-week fellowship experiment soon.</li><li>Right after this introduction program to EA, we present students with an array of options to get further engaged. These include becoming an official 'member' of our group, joining one of our committees, joining us on a retreat, etc. I'd be curious to hear if you have any innovative approaches to post-fellowship engagement of participants! &nbsp;(I think one of our organizers will also report on our 'innovative' approaches to engaging student-EA's at some point in the future.)</li></ul><p>Finally, choosing a 'non-EA' name for the introduction program sounds like an interesting experiment. Could you maybe share some additional insights from this (other than that there luckily was no confusion about the program being EA or not)? Perhaps we could also rename our introduction program, although that might get confusing <a href=\"https://forum.effectivealtruism.org/posts/i24sXY8v6FXLyJKXF/why-ea-groups-should-not-use-effective-altruism-in-their\">as our group name also doesn't directly include a reference to EA</a> (the rest of our marketing does, though).</p>", "parentCommentId": null, "user": {"username": "Joris P"}}]