[{"_id": "xCCyNSaF2bftM7FRE", "postedAt": "2023-05-19T21:38:15.082Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>Looking forward to reading the book. I hope there’ll be an audiobook available in the UK too!</p>\n", "parentCommentId": null, "user": {"username": "dotsam"}}, {"_id": "YknGqZQspE7CjZ5Gi", "postedAt": "2023-05-20T02:21:42.252Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>I only worry and work on AI safety, but I have a profound appreciation for animal welfare work, especially when it comes to sociology and public outreach. There's incredible insights to be made, and points to prove/demonstrate, by being as overwhelmingly <i>correct</i> about something as EA is on animal welfare. I'm really glad that this new book can focus on the last ~50 years of sociological changes since the last one; detailed research the phenomena of large numbers of people being slow to update their thinking on easily-provable moral matters is broadly applicable to global health and existential risk as well.</p><p>I've done a lot of reading about <a href=\"https://en.wikipedia.org/wiki/Soft_power\">Soft Power</a>, how elites around the world are attracted to things that are <i>actually good</i>, like freedom of speech and science, which ends up giving the US and Europe a big strategic advantage in global affairs; meanwhile, hard power like military force and economic influence systematically repels elites. I'm optimistic about the level of competence of people who find out about EA through animal welfare, due to their ability to recognize the sheer asymmetry between EA and non-EA takes on animal welfare.&nbsp;</p><p>I just wish there was a way to scale it up more effectively e.g. at university EA groups doing outreach, since the elephant in the room is the first impression that new people get when they reflexively default to thinking \"oh no a vegetarian is trying to convince me to change my diet even though I'm satisfied with it\". If there was some galaxy-brained way around that e.g. a perfect combination of 40 words that lets you introduce wild animal welfare to someone without being looked at funny, it would plausibly be worth putting a lot of effort into figuring out a near-optimal template for the perfect pitch.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "uy3cke44cTnRomk9h", "postedAt": "2023-05-20T12:26:20.576Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>actually agree on the template!</p>\n", "parentCommentId": "YknGqZQspE7CjZ5Gi", "user": {"username": "Bill!"}}, {"_id": "cJkqr67avNNEkJPmi", "postedAt": "2023-05-21T07:24:28.312Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>I'll be doing that pre-order now and I'll be attending the NYC talk next week!&nbsp;<br><br><strong>Thoughts on AI and Animal Ethics:</strong><br>I think there is a lot of room to align AI with animal ethics in the datasets that we feed into the models. For example, I can't get Midjourney to produce a picture of a chicken in a battery cage. There either just isn't enough accurately labeled pictures with metadata scraped from the internet or the pictures (and possibly also writings) about factory farming are somehow filtered from the data sets. I'd really like to investigate this matter further. If anyone reading this wants to help, please shoot me a message!</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "qRzngCRzJrjMCzxek", "postedAt": "2023-05-21T16:19:56.387Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<blockquote><p>being as overwhelmingly <i>correct</i> about something as EA is on animal welfare.</p></blockquote><p>&nbsp;</p><p>I identify with the EA animal welfare cause area, and I believe I can claim to \"come from\" the farmed animal side of EA animal welfare. And I have to say that EA is still not yet \"correct enough\" about wild animal welfare - too little attention and resources relatively and absolutely.</p><p>But also, to be fair, EA is already one of the rare communities in the world, if not the THE community, that cares the most about wild animal welfare. So maybe EA is still more correct (or less wrong) than most others when it comes to wild animal welfare.</p>", "parentCommentId": "YknGqZQspE7CjZ5Gi", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "waubR5zGtDMGQSFcC", "postedAt": "2023-05-21T20:38:59.045Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>This is super exciting and very much needed. Farmed animal welfare is still super neglected, funding is far too small, and there are not enough EAs working on this cause area. Hopefully, we all can help in getting this book a lot of hype, so maybe it will even inspire new people to join the movement.&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ula"}}, {"_id": "aa7dEuFerCQzhvdnn", "postedAt": "2023-05-23T03:52:03.828Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>You should launch a charity alongside it called Animal Liberation Now ;)</p>", "parentCommentId": null, "user": {"username": "Yanni Kyriacos"}}, {"_id": "YdgEbpkvjPxCcopDi", "postedAt": "2023-05-24T00:11:04.019Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>I've barely read this post yet, though just based on seeing it I want to express my excitement that Peter Singer has opted to post again on the EA Forum for the first time in almost 9 years.&nbsp;</p><p>I'm not even aware whether Singer personally logged into the EA Forum then or it was a user account made on his behalf for posterity. Maybe Singer hasn't even logged into publish this post.&nbsp;</p><p>It could be copy he authorized some site admin or assistant to post on his behalf. That'd be okay too. If Peter Singer himself is really, personally reading the other responses, that's even better! That Singer has opted to keep looping in, as peers, any effective altruists who might well be strangers with nothing else to offer is humbling enough.&nbsp;</p><p>This feels to me like it might be more significant than Dustin Moskowitz's revelations during the last year that he not only reads but takes into serious consideration the discourse among ordinary effective altruists (<i>e.g.</i>, on the EA Forum, on Twitter, and, apparently, especially in the form of dank memes)! I wouldn't be surprised if Dustin himself would be as giddy that you'd acknowledge even him of all people!</p><p>This comment might come across as weird and awkward, to Peter Singer, or others. Yet I can't stress enough how humbling it is that the one person who thousands of effective altruists would hope the most to turn to for help is still asking all of us for help even now!&nbsp;</p><p>That not only the importance of but the feasibility to improve wild animal welfare; research substantiating with more precision the extent and understanding of piscine and invertebrate sentience; and developments in clean meat are so prominent in this new book proves how seriously Singer respects all the greatest contributions of EA to animal welfare and liberation! I am glad to reciprocate, so I will help! What we owe you for making it possible to do what we have done is a debt we'll do our best to pay forward by helping you now!</p>", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "ydyk4ZczmERr6rXBP", "postedAt": "2023-05-24T01:24:58.354Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>Thank you for your comment. I appreciate that from you especially as someone with a specialized focus on AI safety.&nbsp;</p><p>Sometimes, I have the impression that perhaps most of those working in AI safety perceive only a small minority among themselves in the field as seriously considering the risk of adverse impacts on non-human life from advancing AI. I suspect it might even be a majority of those working in AI safety who afford some level of consideration to what impact advancing AI may have on other lifeforms. If that's true, it may not be common knowledge only because some working in AI safety are too shy to opine based in a concern they won't be taken seriously by their peers.&nbsp;</p><p>I'm not aware of any survey data that substantiates with precision either way the extent to which the welfare of non-human lifeforms may be a priority for those working in AI safety. Yet your comment here increases even more the visibility of the endorsement of cross-cause collaboration in EA. It can inspire others convinced of the same to speak up in ways catalyzing the positive feedback loop of such collaboration.&nbsp;</p><p>Given how much you care about this and how much it seems like you may still be gaining awareness of the intersection between animal welfare and AI safety, I'll inform you of how an independent cause at that intersection has been gradually growing in the last several years.</p><p>David Pearce, Brian Tomasik and Andres Emilsson are three utilitarians who perhaps more than any others have for almost 20 years have inspired the launch of longtermist animal welfare as its own field. That has resulted in at least a few dozen researchers dedicated full time to that effort across a few organizations, perhaps most prominently at Rethink Priorities, and the Center for Long-Term Risk, as research institutes.&nbsp;</p><p>Among those in AI safety in the Bay Area whose work you may be more familiar with, Buck Shlegeris is one of the biggest proponent of this approach. Rob Bensinger, Andrew Critch and Nate Soares are two other prominent individuals who've publicly expressed their appreciation of others doing this work.</p><p>I don't mention all this with an expectation you should take any significant amount of time away from your specialized work in AI safety to dive deeply into learning about this other research. I only figure you'd appreciate knowing the names of some individual researchers and also organizations for you or your curious peers to learn more when you might have spare time for that.&nbsp;</p>", "parentCommentId": "YknGqZQspE7CjZ5Gi", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "kFqFhqkDKoroMJaiH", "postedAt": "2023-05-24T02:22:31.424Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<blockquote><p>I'm really glad that this new book can focus on the last ~50 years of sociological changes since the last one; detailed research the phenomena of large numbers of people being slow to update their thinking on easily-provable moral matters is broadly applicable to global health and existential risk as well.</p></blockquote><p>This is an excellent point. Not that this statement necessarily implies ignorance of other recent developments in animal welfare research originating in effective altruism, though sociology is far from the only field from which dramatic transformations in animal welfare should be appreciated.</p><p>&nbsp;It has often been hard to categorize much of the animal welfare research out of the EA community because it is always interdisciplinary, often abstract and yet, at the same time, narrowly applied. Yet some of the most significant developments in research analysis relevant to animal welfare in fields from economics to neurobiology have originated from within EA. I'll highlight <a href=\"https://rethinkpriorities.org/\">Rethink Priorities</a> as a leading research organization in that domain.</p><blockquote><p>I've done a lot of reading about <a href=\"https://en.wikipedia.org/wiki/Soft_power\">Soft Power</a>, how elites around the world are attracted to things that are <i>actually good</i>, like freedom of speech and science[...]meanwhile, hard power like military force and economic influence systematically repels elites.</p></blockquote><p>The best historical example of this I'm aware of is how scientists from ethnically Jewish backgrounds fled Germany in the 1930s for the United States in the face of persecution for propagating \"Jewish science.\" The proof of the importance of prioritizing the pursuit of soft power as much as the pursuit of hard power is how because of that the US went on to gain more hard power than every other country anyway, never mind just Germany. The world shouldn't be such that the fruitful pursuit of knowledge is driven by the pursuit of power by one country to gain advantages over others. For as long as the world is stuck that way, it's better for the rest of us when countries are incentivized to advance knowledge for more humane ends.&nbsp;</p><blockquote><p>I just wish there was a way to scale it up more effectively e.g. at university EA groups doing outreach.</p></blockquote><p>The last few months have been relatively misfortunate for the entire effective altruism community, though they've been especially unfortunate for the intersection of animal welfare and EA. A decade's worth of work on animal welfare out of EA is finally coming to fruition, as evidenced through Singer writing this new book, at the same time the EA community as a whole is trying to recover from the worst crises in the history of its own movement. This has resulted in a responsible slowdown in EA community-building to ensure the fidelity of future efforts to grow the movement, though animal advocates are tragically unable to rely on that infrastructure at the time we'd look to it most. The question of how effective animal advocacy as a field ought to reorient in light of all that is still being answered, though it's appreciated you're acknowledging that as a solvable challenge we face.</p>", "parentCommentId": "YknGqZQspE7CjZ5Gi", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "oCiXam4tvzfoYWdHu", "postedAt": "2023-05-24T03:11:43.318Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>I've long had animal welfare, especially wild animal welfare, as one priority in EA, among others. I also has a background of being involved in animal welfare and environmental movements independent of EA. My experience is that more environmentalists tend to be at least mildly more conscientious about wild animal welfare than the typical animal welfarist.&nbsp;</p><p>That doesn't mean that the typical environmentalist cares more about wild animal welfare than the typical animal welfarist. Typically, both such kinds of people tend not to care much about wild animal welfare at all.&nbsp;</p><p>I've met more abolitionists who haven't thought of the welfare of wild animals much, but have quickly had a more intuitive sympathy for the cause, than I've met environmentalists who are conscientious about the plight of animal species other than those just commonly recognized for how endangered they are (<i>e.g.</i>, panda bears and other charismatic megafauna). Yet environmentalism seems to lend itself to a certain ecological consciousness such that I've met more environmentalists than abolitionists who validate the cause of wild animal welfare, in spite of the fact those environmentalists are not otherwise anti-speciesists.</p>", "parentCommentId": "qRzngCRzJrjMCzxek", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "k7LKdJudjS2a2FCM8", "postedAt": "2023-05-25T12:20:03.973Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>Happy to have a new significant contribution from Peter Singer, but disappointed to read that this will further fuel the fallacy that meat production contributes to climate change due to cattle belching.</p>\n", "parentCommentId": null, "user": {"username": "Duarte M"}}, {"_id": "miBDoqyQgCihC43mA", "postedAt": "2023-05-26T01:34:44.248Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>Can you elaborate?</p>", "parentCommentId": "k7LKdJudjS2a2FCM8", "user": {"username": "Linch"}}, {"_id": "mx5MCKiWkQNLpKm9r", "postedAt": "2023-05-26T15:45:36.496Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<blockquote><p>EA is still not yet \"correct enough\" about wild animal welfare - too little attention and resources relatively and absolutely.</p></blockquote><p>I'm very sympathic to the view that wild animal suffering is a huge deal, and that a mature and moral civilization would solve this problem. However, I also find “<a href=\"https://forum.effectivealtruism.org/posts/saEQXBgzmDbob9GdH/why-i-no-longer-prioritize-wild-animal-welfare-edited\">Why I No Longer Prioritize Wild Animal Welfare</a>” convincing. The conclusion of that post:</p><blockquote><p>After looking into these topics, I now tentatively think that WAW [wild animal welfare] is not a very promising EA cause because:</p><ul><li>In the short-term (the next ten years), WAW interventions we could pursue to help wild animals now seem less cost-effective than farmed animal interventions.</li><li>In the medium-term (10-300 years), trying to influence governments to do WAW work seems similarly speculative to other longtermist work but far less important.&nbsp;</li><li>In the long-term, WAW seems important but not nearly as important as preventing x-risks and perhaps some other work.</li></ul></blockquote>", "parentCommentId": "qRzngCRzJrjMCzxek", "user": {"username": "Will Aldred"}}, {"_id": "AiFg5dnAuSKJeuNv4", "postedAt": "2023-06-02T07:21:57.822Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>This book is desperately needed. The scale and neglect of animal welfare put this cause area right up there for me.</p><p>I will be attending the talk in London! (and bringing along as many people as I can)</p>", "parentCommentId": null, "user": {"username": "JordanStone"}}, {"_id": "NSJJ67g9DbwxfEa2X", "postedAt": "2023-10-14T23:00:21.069Z", "postId": "8xNSiwj5gjoDTRquQ", "htmlBody": "<p>Hi all,</p>\n<p>As per Professor Singer's suggestion above, is there anyone in the Melbourne (Victoria, Australia) area who is interested in holding a reading club for the book? (Or whether there may already be one organised that I'm not aware of?)</p>\n<p>If so please reach out, thanks.</p>\n", "parentCommentId": null, "user": {"username": "Monika Janinski2"}}]