[{"_id": "EqvEmpCEnw6fNPAxJ", "postedAt": "2023-05-22T13:47:30.536Z", "postId": "8ymrq8FzAmzAWgxkS", "htmlBody": "<p>Sure, the audience reaction wasn't great, but it's a start. New ideas can take time to sink in, especially the big, scary ones. Maybe a few of those grads will think it over later and get curious.</p>", "parentCommentId": null, "user": {"username": "Raphaël Lévy"}}, {"_id": "JdSzy5E4DwxHdR8Ha", "postedAt": "2023-05-22T23:00:24.638Z", "postId": "8ymrq8FzAmzAWgxkS", "htmlBody": "<p>SWK - thanks for sharing this. Good to see Santos talking about this. I think his message was somewhat undermined by three factors, which you alluded to: (1) commencement speeches are usually optimistic, uplifting platitude-dumps written to be as inoffensive as possible, (2) the Doomsday Clock just doesn't have much credibility or gravitas any more, since its meaning has been diluted from the original 'global nuclear war' focus to all sorts of other concerns, (3) mentioning climate change as if it's an 'existential risk' either doesn't understand what 'existential risk' means, or vastly over-estimates the likely severity of climate change.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "gG52s9Jq35NJGwtJ2", "postedAt": "2023-05-26T01:00:16.526Z", "postId": "8ymrq8FzAmzAWgxkS", "htmlBody": "<p>I think this is straightforwardly a good sign (especially how much he focused on AI). I also think the negatives you pointed to aren't as bad as you're interpreting them.</p><blockquote><p>Sitting in the audience, the people around me were smirking and giggling throughout the x-risk portion of Santos' speech.&nbsp;</p></blockquote><p>To be fair, his phrasing was kinda goofy and hyperbolic in places (eg emphasis on the doomsday clock, referring to AI risk as \"the tech giants... are creating a monster that might very well devour us\"), so it's understandable that people would giggle.</p><blockquote><p>Afterward, I overheard people joking about the AI part and how they thought it was inappropriate to talk about such morbid material in a commencement address.</p></blockquote><p>But \"morbid\" doesn't mean \"absurd\". If anything, it implies the topic is <i>too</i> serious for the venue.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "LuyLGXg7GTeEKrKia", "postedAt": "2023-05-26T16:56:35.930Z", "postId": "8ymrq8FzAmzAWgxkS", "htmlBody": "<p>Very fair points. I guess since I agreed with the general gist of Santos' message (and was generally just surprised that he was talking about this stuff in the first place) I looked past the presentation at the time. Looking back, Santos definitely used some language that makes his arguments more difficult to take seriously.</p>", "parentCommentId": "gG52s9Jq35NJGwtJ2", "user": {"username": "SWK"}}, {"_id": "as2Kd5uRgoJzi45yy", "postedAt": "2023-05-26T17:06:04.140Z", "postId": "8ymrq8FzAmzAWgxkS", "htmlBody": "<p>I appreciate the optimism, and I sure hope you're right. It took me a while to understand and accept the importance of x-risk mitigation, especially for AI, so I should really be more empathetic. And as others have noted, Santos' presentation wasn't great in terms of his accuracy and phrasing, so I would love to see people use this speech as a starting point to seek out more accurate assessments of the risks he discussed.</p>", "parentCommentId": "EqvEmpCEnw6fNPAxJ", "user": {"username": "SWK"}}, {"_id": "khd5rQkuRgbTHEfx2", "postedAt": "2023-05-26T17:23:42.735Z", "postId": "8ymrq8FzAmzAWgxkS", "htmlBody": "<p>Thanks for your comment, and I agree with your points. I definitely should have noted Santos' unfortunate use of the Doomsday Clock to frame his speech. This was, in hindsight, a sure way undermine his message both for people familiar or unacquainted with x-risk ideas.</p>", "parentCommentId": "JdSzy5E4DwxHdR8Ha", "user": {"username": "SWK"}}]