[{"_id": "ujkaEAoxmkAoQEHju", "postedAt": "2023-05-24T21:50:45.861Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Thank you for the work you're doing!</p>\n<p>How's the first lawsuit going?</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "m3bmQixc7pMkuZ7p8", "postedAt": "2023-05-24T22:04:01.585Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Thank you so much, Guy!! &nbsp;Sadly, the judge dismissed the <a href=\"https://www.legalimpactforchickens.org/costco-lawsuit\">Costco lawsuit</a>. &nbsp;:-( &nbsp;</p>", "parentCommentId": "ujkaEAoxmkAoQEHju", "user": {"username": "alene"}}, {"_id": "zeZCaBhz6QcCBe7uj", "postedAt": "2023-05-24T22:43:48.819Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>I'm really sad to hear that! Is the court's decision available somewhere?</p>\n", "parentCommentId": "m3bmQixc7pMkuZ7p8", "user": {"username": "Guy Raveh"}}, {"_id": "qbQgubPdAyQYQMhgy", "postedAt": "2023-05-25T00:31:00.254Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Yeah it stinks. &nbsp;The judge just ruled from the bench—He didn't author a written opinion.</p>", "parentCommentId": "zeZCaBhz6QcCBe7uj", "user": {"username": "alene"}}, {"_id": "LLTZvnKicyavK6sRp", "postedAt": "2023-05-25T16:26:57.892Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Yikes</p>", "parentCommentId": "qbQgubPdAyQYQMhgy", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "hGDh9iY42E9RBJFcF", "postedAt": "2023-05-25T16:28:30.692Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Thank you for doing it! All the best with it.</p><blockquote><p>Our lawsuit attacks the notion that Big Ag is above the law.</p></blockquote><p>And I want to mention that I particularly like this.</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "HDwuQe3HaK2yF5Bpm", "postedAt": "2023-05-26T13:41:23.516Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Whoa, this is huge! Major props to you and the LIC team for stepping up and taking the fight directly to the big guys like Case Farms. It's really inspiring to see you using the legal system as a tool to protect animals. I'm on eager to see how this case unfolds!</p><p>I've just watched the <a href=\"https://vimeo.com/592783686/2a89da93dd?embedded=true&amp;source=vimeo_logo&amp;owner=8266440\">undercover video</a> from the Animal Outlook investigation that your case will be based on, and it's a stark reminder of the harsh realities we're fighting against. I think we sometimes lose sight of the actual suffering behind the numbers and strategies we discuss on the EA Forum. So, I strongly recommend everyone here to take a few minutes to watch this video to remind ourselves of what suffering looks like on the ground.</p><p>For those who can't or choose not to watch it, here's a brief description of what it reveals:<br>&nbsp;</p><blockquote><p>Newly-hatched chicks killed, mangled, maimed or trapped in equipment or machinery that was improperly operated or set up.&nbsp;</p><ul><li>Some chicks were not mangled by machines but were deformed, hatched improperly, hatched early and died, etc.</li><li>Chicks being roughly handled, thrown, having plastic trays dragged across them and crushing their throats, and driven over with machinery.</li><li>Injured or deformed chicks in trays with dead ones left to languish for hours.&nbsp;</li><li>Gassing sick or injured birds before dumping them into a macerator to be sliced and rendered; in some instances, dumping fully conscious chicks into the macerator to be ground alive.</li></ul></blockquote><p>Alene, your work is reminding us of the urgency and significance of this cause. Please continue to keep us posted on your progress and victories.</p><p>Keep fighting the good fight!</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "QyRu5Af78aTPjBaDk", "postedAt": "2023-05-28T17:39:38.066Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Thank you so much Constance!</p>\n", "parentCommentId": "HDwuQe3HaK2yF5Bpm", "user": {"username": "alene"}}, {"_id": "gpiDyAANcceaDoaLN", "postedAt": "2023-05-28T17:40:02.039Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Thank you Fai!!!!</p>\n", "parentCommentId": "hGDh9iY42E9RBJFcF", "user": {"username": "alene"}}, {"_id": "nA2EgDSyz2XPwivHb", "postedAt": "2023-06-29T12:42:01.482Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Oh no! I think it would be good to write a short postmortem about what LIC learned from this experience. For example, do you think derivative suits are simply not the right vehicle for this kind of action, or is there still potential there?</p>", "parentCommentId": "m3bmQixc7pMkuZ7p8", "user": {"username": "Eli Barrish"}}, {"_id": "hfT4wpwTXs3TzS2fg", "postedAt": "2023-06-29T18:32:17.387Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Don't work for LIC, but I'd note that litigation strategy is one area in which the justification for non-transparency can be particularly strong. E.g., if LIC decided derivative suits were the wrong vehicle, I'm not sure I'd want them to publicize that and free any potential target companies from the fear that they could be next.</p>\n", "parentCommentId": "nA2EgDSyz2XPwivHb", "user": {"username": "Jason"}}, {"_id": "hLq6pfKcsJAtvfjWo", "postedAt": "2023-07-12T17:32:54.834Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Thank you for your support Eli! &nbsp;I think derivative suits definitely are still a strong vehicle to protect animals. &nbsp;Neither the court nor the defendants said anything that would cause us to become less bullish on derivative suits. &nbsp;And the court agreed that the board members had knowledge of Costco's treatment of animals, which was one of the things we were trying to prove in order to show why this is the board's responsibility and thus why a derivative suit is appropriate. &nbsp;Unfortunately, however, the court didn't agree that we had shown a violation of the criminal law against animal neglect. &nbsp;(Of course, we still think that we did show illegal animal neglect. &nbsp;So I think this was a failure on my part to properly convey why the evidence constituted neglect.)</p><p>The court left open one avenue, which was to send a formal demand letter to Costco's board, asking the board to change its treatment of chickens and sue Costco's executives. &nbsp;So we did that: &nbsp;<a href=\"https://www.legalimpactforchickens.org/costco-demand.\">https://www.legalimpactforchickens.org/costco-demand.</a> &nbsp; And we are waiting for a response.</p><p>I agree we need to somehow update our website. &nbsp;I just haven't gotten around to figuring out the best way to present this information. . . . But you bringing it up is a helpful nudge!</p>", "parentCommentId": "nA2EgDSyz2XPwivHb", "user": {"username": "alene"}}, {"_id": "iJWH3aQKQFtaKsFS3", "postedAt": "2023-08-10T01:22:58.407Z", "postId": "8Z2uFCkrg2dCnadA4", "htmlBody": "<p>Thank you Alene! Happy to chat offline if it's ever helpful to you or LIC.</p>", "parentCommentId": "hLq6pfKcsJAtvfjWo", "user": {"username": "Eli Barrish"}}]