[{"_id": "XZszTsWupYAMNKEuM", "postedAt": "2022-01-18T18:06:13.665Z", "postId": "8ZwK6poQYgfdSvGu8", "htmlBody": "<p>I think the approach taken in this post is still good: make the case that extinction risks are too small to ignore and neglected, so that everyone should agree we should invest more in them (whether or not you're into a longtermism).<br><br>It's similar to the approach taken in the Precipice, though less philosophical and longtermist.</p><p>I think it was a impactful post in that it was 80k's main piece arguing in favour of focusing more of existential risk during a period when the community seems to have significantly shifted towards focusing on those risks, and during a period when 80k was likely one of the influences on that.</p><p>If I were writing it again, I'd probably emphasise risk from asteroids and nuclear war less than I did, since I think they're small. I'd also try to avoid getting into the issue of what people think the risk of extinction is by default, since different surveys have such variable data about this.</p><p>The data and arguments in the Precipice are more thorough and up-to-date, so I'd also try to bring it in line with that.</p><p>Given this hasn't been done, these days I normally refer people to our podcast with Toby Ord or the Precipice instead.</p>", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "rfToGjfGC2NGioKKu", "postedAt": "2023-07-06T15:37:33.745Z", "postId": "8ZwK6poQYgfdSvGu8", "htmlBody": "<p>Considero que es importante tener claridad de la dimension de la situación, ahi estamos claros, sin embargo creo que cuando hablemos de encuestas para usarlas de referencia es necesario tener encuestas en todo caso diferenciadas, por lugares distintos, edades, sexo, género y la pregunta no debe ser muy general, tiene que ser mas específica, por tanto es muy relativo hablar de una encuesta en los EEUU y el resto de paises, ahora es cierto que el tema de cambio climático en especial no es priorizado en este país, pero creo que podemos hacer análisis más aterrizados</p>", "parentCommentId": null, "user": {"username": "Mariela Mejía"}}, {"_id": "QFxkChyRP2dawcqc9", "postedAt": "2023-11-06T10:55:26.662Z", "postId": "8ZwK6poQYgfdSvGu8", "htmlBody": "<p>Not sure if this is the best place to raise this but the link to the Concreate Problem in AI Safety on 80,000 Hours' site is down.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Noa Yang"}}]