[{"_id": "LNNkBkmPAgNbAfHFs", "postedAt": "2024-01-22T07:22:18.444Z", "postId": "8zzmZD5vsEkuDe24m", "htmlBody": "<p>I like the analogy of creating muscle strength, where additional weight can create more muscles in some circumstances and injuries in others. I fear, however, that people might interpret this too narrowly, only looking at short-term altruistic actions and not a longer-term goal. When thinking about change, it's easy to get focused either on too many things or changes that are less relevant, leaving little capacity for bigger changes. <a href=\"https://www.pasteurscube.com/my-template-for-a-quarterly-review-plan/\">Peter Wildeford's template for a quarterly review + plan</a> discusses this using the rock, pebbles, sand analogy.</p><p>For some people, additional altruistic actions might be the most important thing now, but I think for many, it will be focusing on their careers, <a href=\"https://80000hours.org/career-guide/career-capital/\">building skills</a> or getting better at thinking about prioritizing where they want to be headed in their careers.</p><p>A community that encourages people to take more altruistic actions might lead people to wrongly prioritize, leading to less effective outcomes in the long run. While much comes down to individuals making their own decisions, it is harder to be part of a group where many people show signs of small altruistic actions when you're not doing this and are focussing on your career. I think what I'm feeling is a fear of an altruistic virtue-signalling competition that is used as a proxy for what we actually want: Steadily increasing our individual impact.</p><p>Personally, I think other virtues might be more helpful for building up the strength needed, as I <a href=\"https://forum.effectivealtruism.org/posts/FtAxdRNTHgN7AD48K/patrick-gruban-s-quick-takes?commentId=DK3e77gxKbKDANfYc\">recently wrote</a>. Similarly, I expect others also to have different ways to impact. I think the combination of having a personal vision of being a person who will strongly value personal impact in combination with a growth and prioritization mindset who is strengthening their muscles in these areas could be a more general approach.</p>", "parentCommentId": null, "user": {"username": "gruban"}}, {"_id": "uT42FugxwgfHuDzAD", "postedAt": "2024-01-22T14:01:26.329Z", "postId": "8zzmZD5vsEkuDe24m", "htmlBody": "<p><strong>Executive summary</strong>: Altruistic actions can strengthen motivation for further altruism, but this depends on the person and situation. Overloading oneself with too many altruistic commitments can also lead to burnout.</p><p><strong>Key points</strong>:</p><ol><li>For some people, small altruistic acts reinforce motivation and commitment to larger impact altruistic choices like career selection.</li><li>Habits formed through repeated altruistic acts can become excessive or counterproductive if situations change.</li><li>Pushing oneself too hard with altruistic commitments can lead to burnout.</li><li>Different people are motivated differently; exploring which activities increase altruistic motivation can be worthwhile.</li><li>Cause-specific altruistic activities may shift focus in a particular direction, which could reduce flexibility.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]