[{"_id": "FsBtQF6roxacnK4BF", "postedAt": "2018-08-15T21:06:45.371Z", "postId": "93GmXP8ikHhQzjs2i", "htmlBody": "<p>I think you could fairly convincingly bucket virtue ethics in 'Ends' if you wanted to adopt this schema. A virtue ethicist could be someone who chooses the action that produces the best outcome in terms of personal virtue. They are (sort of)  a utilitarian that optimizes for virtue rather than utility and restricts their attention to only themselves rather than the whole world.</p>\n", "parentCommentId": null, "user": {"username": "cole_haus"}}, {"_id": "gujFc8LZotixkS8bp", "postedAt": "2018-08-15T21:13:59.473Z", "postId": "93GmXP8ikHhQzjs2i", "htmlBody": "<p>I think there's a certain prima facie plausibility to the traditional tripartite division. If you just think about the world in general, each of actors, actions, and states seem salient. It wouldn't take much to convince me that--appropriately defined--actors, actions, and states are mutually exclusive and collectively exhaustive in some metaphysical sense.</p>\n<p>Once you accept the actors, actions, states division, it makes sense to have ethical theories revolving around each. These corresponds to virtue ethics, deontology and consequentialism.</p>\n", "parentCommentId": null, "user": {"username": "cole_haus"}}, {"_id": "YuieWSp2DrxfRftni", "postedAt": "2018-08-15T21:23:16.519Z", "postId": "93GmXP8ikHhQzjs2i", "htmlBody": "<p>I think it's a mischaracterisation to think of virtue ethics in terms of choosing the most virtuous actions (in fact, one common objection to virtue ethics is that it doesn't help very much in choosing actions). I think virtue ethics is probably more about <em>being</em> the most virtuous, and making decisions for virtuous reasons. There's a difference: e.g. you're probably not virtuous if you choose normally-virtuous actions for the wrong reasons.</p>\n<p>For similar reasons, I disagree with cole_haus that virtue ethicists choose actions to produce the most virtuous outcomes (although there is at least one school of virtue ethics which seems vaguely consequentialist, the eudaimonists. See <a href=\"https://plato.stanford.edu/entries/ethics-virtue)\">https://plato.stanford.edu/entries/ethics-virtue)</a>. Note however that I haven't actually looked into virtue ethics in much detail.</p>\n<p>Edit: contractarianism is a fourth approach which doesn't fit neatly into either division</p>\n", "parentCommentId": null, "user": {"username": "richard_ngo"}}, {"_id": "3SXyQxMEfKKbCHXwe", "postedAt": "2018-08-16T21:44:12.739Z", "postId": "93GmXP8ikHhQzjs2i", "htmlBody": "<p>Honestly, the consequentialist/virtue/deontological division is not a complete categorization, just a list of the three most common theories; other moral theories simply fall outside of it. The Philpapers survey includes &quot;other&quot; as a fourth option to make a true categorization. </p>\n<p>I haven't seen any philosophers use a means/ends binary categorization. But others are often used instead of the consequentialist/virtue/deontological division. For instance, there is the agent-neutral/agent-relative distinction, and there is the thick concept centralism/thin concept centralism distinction. All can be more or less appropriate in different contexts. Overall, philosophers don't worry that much about this question of categorization, so don't worry too much about what they use. </p>\n<blockquote>\n<p>What am I missing about virtue ethics/deontology that implies I shouldn't categorize them both into &quot;means&quot;?</p>\n</blockquote>\n<p>I am not well read on virtue ethics, but it seems to me that both cole haus and richard ngo are right: some kinds of virtue ethics are about the end of achieving a certain personal character, and others are about having actions that align with the right principles. </p>\n<blockquote>\n<p>Whatever the answers to #1 and #2, what do you find to be the most helpful categorical breakdown of normative ethics?</p>\n</blockquote>\n<p>In most contexts I would tend towards stressing something Parfit talks about, between traditionalism (though I forget the exact word he uses) and revisionism. The former being moral theories that try to preserve our ordinary folk moral beliefs, and the latter being moral theories that try to revise them to meet more rigorous principles. Because I think that a relatively high amount of moral disagreement boils down to this. But again there are multiple ways of making categories here, and there is not one universal best option, they are just useful in different ways in different contexts.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "NDHvoJqSKePP4fdyz", "postedAt": "2018-08-17T21:50:53.937Z", "postId": "93GmXP8ikHhQzjs2i", "htmlBody": "<blockquote>\n<p>What am I missing about virtue ethics/deontology that implies I shouldn't categorize them both into &quot;means&quot;?</p>\n</blockquote>\n<p>I find this grouping weird as I think of virtue ethics (which, full disclosure, is most like the way I intuitively approach applied ethics) as the only one that's really about means rather than ends because it's about what generates your observable behaviors rather than the observable behaviors themselves.</p>\n<p>To see what I mean, a deontological ethical system might say &quot;don't kill other humans&quot; so you don't kill other humans based on that rule. In a certain sense this is a means to an end that is similar to what a consequentialist ethics might select for—humans end up not being killed, but because you followed the rule—but it is also an end in itself—you don't do any killing. The only difference between deontological systems and consequentialist systems in this case is that a consequentialist system places the emphasis on (or, if you like, optimizes on) the global outcome while the deontological system focuses more directly on ones observable behavior. It's a question of where you put the pressure in this sense: either on the observable, desired outcomes in the world that imply the actions that generate the desired outcomes (consequentialism) or on the observable behaviors that generate the desired outcomes (deontology).</p>\n<p>Virtue ethics is to me the odd-man-out here because it's focused on behavior that is not observable, or at least not observable by anyone other than the subject who is experiencing it. You can observe the outcomes of one who has virtue, which is intended to generate behaviors that will cause desirable outcomes in the world, but it pushes back the focus a level so that you optimize/emphasize the spontaneous generation of normative behavior rather than rules that generate normative behavior or normative behavior to produces a particular outcome.</p>\n<blockquote>\n<p>Is it actually true that philosophers (generally) give the 3-category version over the 2-category version?</p>\n</blockquote>\n<p>Philosophers use lots of different categorization methods for different reasons. The thing to keep in mind is that any groupings are always serving some purpose, so talking in terms of virtue, deon, and consequences is simply one useful way approaching ethical systems that helps us understand them. Other categorizations are possible and frequently used, and there is frequent disagreement among philosophers over where to draw particular lines or whether this or that ethical notion really belongs in some particular category.</p>\n<p>Personally I find it helpful to think of these categorizations found throughout philosophy as useful for certain purposes in academic philosophy but not necessary useful to the objectives of philosophy itself except inasmuch as you are addressing your readers and helping them understand an idea in the context of other ideas they are familiar with. It's tempting to get caught up in constructing detailed models of philosophical ideas at the expense of the philosophical act itself.</p>\n<blockquote>\n<p>Whatever the answers to #1 and #2, what do you find to be the most helpful categorical breakdown of normative ethics?</p>\n</blockquote>\n<p>All that being said, I tend to think about descriptive vs. prescriptive approaches. As Hume argued, we can't directly derive the normative from what is normal without metaphysical speculation, and for myself I find no reason to believe it is necessary to speculate in a way that ends up implying any particular norms. Therefore I tend to think about categorizing ethics in terms of whether we are trying to discuss norms in terms of what we find (descriptive) or what we wish we found (prescriptive), my own inclinations running towards the descriptive.</p>\n", "parentCommentId": null, "user": {"username": "gworley3"}}, {"_id": "EXHA8Njz9zFqG4y9W", "postedAt": "2018-08-22T22:56:34.258Z", "postId": "93GmXP8ikHhQzjs2i", "htmlBody": "<p>Can I ask why you actually want to catagorize ethics like this at all? I know that it is traditional and it can be very helpful when teaching ethics to set things out like this as if you don’t then students often miss the profound difference between different ethical theories. However a lot of exciting work has never fallen into these catagories, which in any case are basically post hoc classifications of the work of Aristotle, Plato and Mill. Hume’s work for instance is pretty clearly ‘none of the above’ and a lot of good creative work has been done over the past century or more in trying to break down the barriers between these schools (Sidgwick and Parfit being the two biggest names here, but by no means the only ones). Personally I think that there are a lot of good tools and poweful arguments to be found across the ethical spectrum and that so long as you apreciate the true breadty of diversity among ethical theories then breaking them down like this is no longer much help for anything really.</p>\n<p>From an EA perspective I think that the one distinction that may be worth paying attention to, and that can fit into your ‘consiquentialism’ Vs ‘deontology and virtue ethics’ distinction, though it is not a perfect fit, are moral theories that can be incorporated into an ‘expected moral value’ framework and those that can’t. This is an important distinction because it places a limit on how far one can go in making precise judgements about what one ought to do in the face of uncertainty which is something that may be of concern to all EAs. However this is a distinction that emerges from practice rather than being baked into moral theories at the level of first principles and there are other aproaches, such as the ‘parliamentary model’ for handelling moral uncertainty, that seek to overcome it.</p>\n", "parentCommentId": null, "user": {"username": "Simon_Beard"}}, {"_id": "zkSjKDh67cf2Brznb", "postedAt": "2018-08-26T19:07:36.675Z", "postId": "93GmXP8ikHhQzjs2i", "htmlBody": "<p>I don't think the tripartite division is particularly helpful. It smacks of parochialism. It's only been the standard way of breaking down 'normative ethics' among a small clique of analytic philosophers in the Anglophone world - i.e. a few thousand people - beginning sometime in the twentieth century. It's a shame that it has become the default pedagogical tool for introducing students to ethics. It has some merit as such, but students end up thinking that it's 'the' division of ethics, and it invariably ends up occluding more than it illuminates.</p>\n<p>If you try and fit most 'canonical' figures in the history of social and political thought into the tripartite division - e.g. Thucydides, Epictetus, Augustine, Montaigne, Voltaire, Rousseau, Marx, Nietzsche, Dewey, Wittgenstein - it becomes immediately apparent that it's an incredibly crude and misleading way of looking at ethics, and assumes a great deal about what 'ethics' is. Let alone if you go beyond the canon and look at more marginal figures, or ethnography/anthropology/cultural history for that matter. As someone else said, most thinkers are sui generis; it is almost always unhelpful to impose these kind of blunt ex post categories on them. The subject is infinitely richer and more complicated than that.</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}]