[{"_id": "urCvGTQf8AkcC2uBo", "postedAt": "2023-05-14T17:33:07.714Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>Could you say a little more about why these functions would be best housed at CEA specifically? I think there are fairly clear costs to a central organization moving strongly in the direction of a single cause area, so I think it's important to identify a case for them being at CEA specifically.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "RcA7Sow8Fed6CxavD", "postedAt": "2023-05-14T17:41:09.995Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>I guess I find the framing of this question somewhat strange because my proposal suggests that there should discussions about how AI intersects with various cause areas. That is, it is not the same as an AI safety pivot from my perspective (though it may result in more people pursuing AI safety). So I can try to answer your question as written the best that I can, but I might be able to answer better if you tried reframing your question first.</p>", "parentCommentId": "urCvGTQf8AkcC2uBo", "user": {"username": "casebash"}}, {"_id": "eex7ysLnaQhAZtoCS", "postedAt": "2023-05-14T20:21:27.968Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>I think a case should be made for important intersections with the various cause areas before CEA commits to pushing potentially distracting discussion onto others, and I don’t think CEA is the right organization to do this research, because they don't focus on research. I think Open Phil and/or Rethink Priorities (maybe others, too) could do this kind of research, because they research AI safety as well as global health and development and animal welfare.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "3fEkdSohLttWnDj5P", "postedAt": "2023-05-14T20:36:22.394Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>More research would definitely be useful to help us make these decisions and I suppose it would be hard to run such a course without high quality content to include in it. So it might be better to focus on the other ideas for now.</p>\n<p>One point I want to raise though: some of these discussions seem like discussions that should be happening in EA anyway and I don’t think we should only start having these discussions once we have all of the answers.</p>\n<p>It’s also less of a commitment if CEA were only to adopt it as the first “yearly theme”.</p>\n", "parentCommentId": "eex7ysLnaQhAZtoCS", "user": {"username": "casebash"}}, {"_id": "3EbqaXsgkqqpGq6qt", "postedAt": "2023-05-14T21:31:05.032Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>Rather than a course, a single (maybe optional) meeting in a standard EA course seems like it would make more sense to me at this point. Group discussion events or talks at EAG(x) could also make sense.</p>\n", "parentCommentId": "3fEkdSohLttWnDj5P", "user": {"username": "MichaelStJules"}}, {"_id": "WedJLppyrahpoTXEi", "postedAt": "2023-05-14T21:56:20.749Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>I'd probably lean towards suggesting that CEA leaves the standard EA course as is and just organising some talks/discussion online or at EAGs or creates some materials for local EA groups to potentially run such a discussion themselves.</p>", "parentCommentId": "3EbqaXsgkqqpGq6qt", "user": {"username": "casebash"}}, {"_id": "zqrxBaEvtxNhpkyGD", "postedAt": "2023-05-16T14:04:29.682Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>To put in some more backstory, what CEA does has an effect on people's sense of belonging -- such the extent to which people feel their work and interests are valued by the community. For instance, seeing a meaningful amount of subject-matter specific content relate to your cause area and the kind of work you do improves the sense of belonging. Detracting from it would have negative effects on recruiting and retention, and thus overall impact. So there's an added cost to anything that would detract from non-AI people's sense of belonging, a cost that wouldn't be borne if you stood up the new AI-focused initiative in a Center for Effective AI Epistemics or something.</p><p>I think your proposal would incur some costs to belonging. To take your proposal for GH&amp;D as an example:</p><blockquote><p>AI and Global Poverty: How does the advance of AI affect our global poverty efforts? Does it render them irrelevant? Should we be integrating AI into our efforts? Should we be focusing more on short-term interventions rather than long-term interventions, as there is less chance of them being made irrelevant?</p></blockquote><p>I don't think suggesting that the type of work people are predominately doing in GH&amp;D may be \"irrelevant\" is likely to promote their sense of belonging. I also don't see much evidence (in terms of grantmaking activity, Forum posts, etc.) that the types of questions you're suggesting are what people in global health &amp; development currently find important. That's not to say they aren't worth asking, but that they don't seem to represent the GH&amp;D community.</p><p>So I do think a focus shift by CEA would have some costs for other parts of the EA movement. (There would, of course, be opportunity costs and the like as well.) So the question is: What is the argument for CEA is particularly well-suited to do the work you're proposing? You've made, on the whole, a good case for why this work would be helpful but I don't think you've clearly linked it to CEA's place in the ecosystem.</p><p>Your suggestion that there could be rotating yearly topics is interesting, but producing new high-quality content each year would consume resources. And if there were a cycle (year of AI, of infectious diseases, of the chicken, of meta?) the mostly fixed costs of content creation and updating would be spread out over fewer uses. Plus someone who was interested in one of the topics might have to wait three years for the repeat. So I'd have the same kind of question: is the advantage of having CEA specifically run this work worth the increased resource utilization and inability to access the content 75% of the time?</p>", "parentCommentId": "RcA7Sow8Fed6CxavD", "user": {"username": "Jason"}}, {"_id": "CMQREvQmpcHWBBg3t", "postedAt": "2023-05-16T16:48:48.971Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>I agree that some of the points I listed could have been better framed.</p><p>In terms of why CEA, I guess I see it as a core function of CEA to try to ensure that members of the EA community have access to the information that they need in order to make up their own mind on how to have as great an impact as possible. I don't necessarily think that CEA should always follow, I think it's okay for it to lead as well, but if it were to run a course and most people who took it didn't find that it was helping them develop their views, then I would see that as a failure.<br><br>Regarding belonging, I don't see that as the primary thing that CEA should optimise for, particularly when it comes at the expense of epistemics. It's worth thinking through how to frame things in order to ensure as much belonging as possible, which is part of why I was suggesting a course that would cover considerations relevant to people from various cause areas, but it isn't the number one priority.</p><p>I agree that if they went with the plan of yearly topics (I wasn't suggesting a rotation, but rather that the topic would be different every year unless exceptional circumstances caused us to repeat a topic) it would require significant resources. On the other hand, I believe that it would be well worth it in order to significantly reduce the chance of intellectual stagnation within the community.</p>", "parentCommentId": "zqrxBaEvtxNhpkyGD", "user": {"username": "casebash"}}, {"_id": "cSL8nw5Hb9Ney3hdm", "postedAt": "2023-05-17T15:44:39.493Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>I think CEA needs to get behind the push for a <a href=\"https://forum.effectivealtruism.org/posts/8YXFaM9yHbhiJTPqp/agi-rising-why-we-are-in-a-new-era-of-acute-risk-and\">global moratorium on AGI</a>. Everything else is downstream of that (i.e. without such a moratorium there likely won't even be a world to do good in, or any sentient beings to help.)</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "yqKYxt8GaAd9Lb8aq", "postedAt": "2023-05-17T16:06:29.606Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>It's certainly possible that a version of this content could address the belongingness concerns I identified.</p><p>About belongingness more generally: When the question of splitting up EA (e.g., into neartermist and longtermist branches) has arisen, people have generally been opposed. But I think a consequence of that position is that certain central organizations need to reflect a rough balance of different cause areas and neartermist/longtermist perspective within the movement. Stated differently, I don't think it is plausible for both of the following conditions to be true: \"CEA is a broad-based organization for promoting effective altruism\" and \"CEA clearly gives the impression that certain key methodologies, cause areas, or philosophical views that are prominent within the community are second-rate.\" There are arguments for giving up the first statement to free CEA from the constraints it imposes, but they do impose costs. In my view, any argument that \"CEA should do X,\" where X creates risks of causing disunity, needs to acknowledge the downsides and explain why the marginal benefit of housing the work at CEA outweighs them.</p><p>As far as epistemics, I tend to prefer decentralized epistemic institutions to the extent practicable. Maybe that's a bias from my professional training (as a lawyer), but in general I'd rather have a robust epistemic marketplace in which almost everyone can promote their ideas without having to compromise on belongingness grounds, rather than setting up CEA (or any similar organization) as promoter of views that do not reflect broad community consensus. EAs, EA-adjacent people, and EA-interested people can evaluate epistemic claims for themselves, and centralizing epistemics creates the usual risks of any system with a single point of failure.</p>", "parentCommentId": "CMQREvQmpcHWBBg3t", "user": {"username": "Jason"}}, {"_id": "hz6sCzRTsJDg2o9qH", "postedAt": "2023-05-17T16:12:37.990Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>I think the push for global moratorium (which I agree with) would be better served by having CEA take as small a role as possible.&nbsp;</p><p>From the perspective of the people you need to actually convince -- politicans and voters -- the CEA and EVF brands are still way too linked to SBF right now. That's an easy attack surface to gift to those whose economic and other interests would be opposed to a mortatorium. \"One of the major organizations behind this is that group that SBF was treasurer of a few years ago / that group that had two of the five board members heavily involved with giving away SBF's fraudulent money\" may not be a convincing argument against a moratorium to the readers of this forum, but I think it would carry significant weight among some important groups.</p>", "parentCommentId": "cSL8nw5Hb9Ney3hdm", "user": {"username": "Jason"}}, {"_id": "NB6dq7CyzuKdJZhEq", "postedAt": "2023-05-17T17:04:11.352Z", "postId": "946ymfxwd7YAC9yvT", "htmlBody": "<p>Ok, fair point. Maybe OpenPhil then? Or Rethink Priorities? I think in general the EA community and its leadership are asleep at the wheel here. We're in the midst of an unprecedented global emergency and the stakes couldn't be higher, yet there is very little movement apart from amongst a rag-tag bunch of the rank and file (<a href=\"https://join.slack.com/t/agi-moratorium-hq/shared_invite/zt-1u6s1opls-~_l_Ynrr~8ay~SiA2yEqAQ\">AGI Moratorium HQ Slack</a> -- please join if you want to help)</p>", "parentCommentId": "hz6sCzRTsJDg2o9qH", "user": {"username": "Greg_Colbourn"}}]