[{"_id": "eJBCMGcy9oM5EWhK3", "postedAt": "2014-10-02T23:05:39.777Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>Those are handy updates Ryan, especially having new comments be highlighted - great work!</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "kwKfm9jG95f2vnLrj", "postedAt": "2014-10-04T17:46:30.229Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>Excellent! The new comment highlighting makes this forum much more readable.</p>\n<p>One thing that I'd like to see here, and have wished for LW for a long time, would be an option to sort threads by the most recent posting - so that commenting in those threads would &quot;bump&quot; the thread to the top, like it does on ordinary forums. People haven't been very enthusiastic about this proposal on LW for whatever reason, but the lack of that feature contributes to what I feel is the largest problem of the site - that valuable and semi-active threads get quickly buried below more recent ones, so that e.g. new Open Threads need to be continually reposted rather than the old ones organically rising to the top when they have new activity. This also disincentivizes people to comment in older threads, since their comments won't be seen by as many.</p>\n<p>The standard objection to why this feature isn't needed is that a lot of people follow the &quot;all comments&quot; section of the site that also shows comments to old threads, and it's true that sometimes this allows there to be new discussion in some old thread. But I still feel that the amount of people who follow &quot;all comments&quot; is much smaller than the amount of people who read the site by more &quot;normal&quot; means, and that the psychological disincentivizing effect persists even if some people do read &quot;all comments&quot;.</p>\n", "parentCommentId": null, "user": {"username": "Kaj_Sotala"}}, {"_id": "WkkHy6BKEjuTM4N48", "postedAt": "2014-10-04T19:17:06.857Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>I just wanted to say I think the forum is working really well so far - big kudos to the team behind it!</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "5dzH5Dpc8dYYvuk9Q", "postedAt": "2014-10-04T19:41:16.705Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>Yes indeed! Who is that team? Am I right in thinking it's Ryan Carey who owns the site?</p>\n", "parentCommentId": "WkkHy6BKEjuTM4N48", "user": {"username": "toron"}}, {"_id": "NZpXpFwhJabqdJaLW", "postedAt": "2014-10-04T19:42:33.428Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>I agree with your characterisation of the problem - new good new comments on old threads can get missed. A 'sort by new comments' option would probably help. An alternative would be to use a mixed algorithm to make up the default frontpage. A mixture of recent article/recent posts/lots of upvotes. I'm happy to discuss this more.</p>\n", "parentCommentId": "kwKfm9jG95f2vnLrj", "user": {"username": "RyanCarey"}}, {"_id": "aev4sv726453xkdRC", "postedAt": "2014-10-04T19:56:06.799Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>Thanks Ben!</p>\n<p>Hi Toron,\nMihai Badic designed the site, giving away some of his time for free, and Trike Apps built the site from the LessWrong codebase entirely for free. I've done what's left of managing the overall project, and am administrating :)</p>\n<p>I hope you continue to enjoy it, Toron.</p>\n", "parentCommentId": "5dzH5Dpc8dYYvuk9Q", "user": {"username": "RyanCarey"}}, {"_id": "AX6S3DyTpoNYPJ8cN", "postedAt": "2014-10-08T16:21:32.568Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>One feature I miss from Facebook is the ability to draw people's attention to comments and threads by tagging them. I realise this may be tricky to implement though (you'd probably want to use a program called sendmail on your server).</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "ru6rqmdp2X4SP2g8D", "postedAt": "2014-10-10T10:22:14.893Z", "postId": "98Fe4vYuDAAT7v6MY", "htmlBody": "<p>It would be nice to have some place (like the LW-FAQ) where things about the forum are explained such as:</p>\n<ul>\n<li>How to post links (I think I once tried it as described in the LW-FAQ, but it didn't work)</li>\n<li>How to quote</li>\n<li>Other site-mechanics: Here's a list from LW: </li>\n</ul>\n<p>5 Site Mechanics</p>\n<p>5.1 How do I make a comment?\n5.2 Is it worth commenting on ancient posts and long-dead threads?\n5.3 How does voting work?\n5.4 How is karma calculated?\n5.5 Why do I want high karma?\n5.6 How do I make a submission?\n5.7 What is shown on the &quot;New&quot; page?\n5.8 How do I get my post on the front page?\n5.9 I deleted an article. Can I undelete it?</p>\n", "parentCommentId": null, "user": null}]