[{"_id": "vFyBnQtBqazHCjPPh", "postedAt": "2023-02-16T18:15:20.923Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Thank you Max for your years of dedicated service at CEA. Under your leadership as Executive Director, CEA grew significantly, increased its professionalism, and reached more people than it had before. I really appreciate your straightforward but kind communication style, humility, and eagerness to learn and improve. I'm sorry to see you go, and wish you the best of luck in whatever comes next.</p>", "parentCommentId": null, "user": {"username": "Nick_Beckstead"}}, {"_id": "TpPDQ2uPsGTrrFekJ", "postedAt": "2023-02-16T18:27:06.780Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Max is a phenomenal leader, and I’m very sad to see him go. He’s one of the most caring and humble people I’ve ever worked with, and his management and support during a very difficult few months has been invaluable. He’s also just a genuine delight to be around.</p>\n<p>It’s deeply unfair that this job has taken a toll on him, and I’m very glad that he’s chosen the right thing for him.</p>\n<p>Max has taught me so much, and I’ll be forever grateful for that. And I’m looking forward to continuing to work with him as an advisor — I know he’ll continue to be a huge help.</p>\n", "parentCommentId": null, "user": {"username": "Shakeel Hashim"}}, {"_id": "SA53i9iREDiXdg6hb", "postedAt": "2023-02-16T18:30:37.968Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I think it's wise of you to do this while you can handover well. Thanks for the bravery of being able to say it's too hard. And I'm glad you are looking after yourself. Thank you for all your work. I'm sad this has been so hard for you.</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "CySRmCoYyyJbiFqyJ", "postedAt": "2023-02-16T18:52:02.738Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Super sorry to see you go Max. It's honestly kind of hard to believe how different CEA is today from when I joined, and a lot of that is due to your leadership. CEA has a bunch of projects going on, and the fact that you can step down without these projects being jeopardized is a strong endorsement of the team you've built here.</p><p>I look forward to continuing to work with you in an advisory role!</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "n5hDMdNpFohpH3zau", "postedAt": "2023-02-16T19:21:18.348Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I've only been at CEA for the last ~quarter of Max's tenure but it's hard to overstate how much I've appreciated Max's humility, his warm nature, his receptivity to feedback and how much he values and appreciates CEA staff in return. I'm really sad to see you go Max - we'll miss you!</p>", "parentCommentId": null, "user": {"username": "OllieBase"}}, {"_id": "XBSewzs3Dfq4ZFgJR", "postedAt": "2023-02-16T19:57:08.841Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Sad to hear this Max but also so glad to hear you are looking after your mental health. I think you did a great job building CEA in the last few years with a great team and consistent execution.</p>", "parentCommentId": null, "user": {"username": "LukeDing"}}, {"_id": "yH9gcvFxkPP2TXipj", "postedAt": "2023-02-16T20:11:34.819Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Working with you as ED for the past four years has been the happiest I’ve been at CEA. I'm really proud of the work we have done together and I’m so sorry for the personal toll it has taken on you. I hope you get some well-deserved rest and I look forward to working with you in your new advisory role. Thank you for everything, Max!&nbsp;</p>", "parentCommentId": null, "user": {"username": "AmyLabenz"}}, {"_id": "pd6uR77oLukeBugbm", "postedAt": "2023-02-16T20:32:46.601Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I've only been at CEA for a part of Max's tenure - but it's been a real privilege seeing you work. Absolutely incredible what you've achieved.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Oldman"}}, {"_id": "QrbqjjTZHgkgb9wDQ", "postedAt": "2023-02-16T20:37:59.851Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I'm really sorry for the experience you've been having, and I appreciate you stepping down to take care of yourself, and by sharing it all here, sending a message to all EAs that they should take care of themselves too.</p>\n<p>If the Executive Director of CEA can decide to prioritise his own health, so can anyone else. EA is known to be very demanding - particularly in such high responsibility positions, but also for most other EAs - and in doing this you're leading by example and hopefully preventing other EAs from harming their health.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "62JHQu4zGtj3hsiRH", "postedAt": "2023-02-16T20:40:59.993Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I felt happy reading the nice things your colleagues are saying about you Max, all of which ring true to me. I admire your humility, thoughtfulness and level-headedness, and I'm looking forward to seeing what you get up to next!</p>", "parentCommentId": null, "user": {"username": "JamesSnowden"}}, {"_id": "8vHFnkoxxNGNZDLhv", "postedAt": "2023-02-16T20:42:05.839Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Hey Max, I really want to thank you again for everything you've done for CEA, RP, myself, and the broader EA movement. I also am really proud of you for recognizing when you're not in the right space for the role. I think you're a very positive role model to demonstrate to others that it's totally best to prioritize your own health, even when it seems like you're really hard to replace. I look forward to working with the next ED to make EA a great space and I'm glad you'll still be in an advisory capccity.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "sZrSNJydwzna9HpW2", "postedAt": "2023-02-16T21:31:45.239Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>CEA has grown so much under your guidance. Your leadership has been patient, curious, and insightful. I've been immensely impressed by the humility you've shown while leading CEA, and which show in this post and this decision. I've personally learned a great deal from working with you and being managed by you. Thank you for all you've done for CEA!</p>", "parentCommentId": null, "user": {"username": "Cait_Lion"}}, {"_id": "Wrt8ckyN4D6FytsYQ", "postedAt": "2023-02-16T21:42:40.072Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Unfortunately, I never had the opportunity to speak or work with you directly, but your personal and professional reputations speak volumes.</p><p>I am sorry to hear about the toll this has taken on you; I hope this transition supports you on a healing journey. That you shared this and recognized what was needed is a testament to your leadership and care.&nbsp;</p><p>Thanks for all you've done for CEA and for the community. I wish you very well and look forward to seeing where your journey takes you. If I can somehow be supportive, please never hesitate to reach out.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Kyle Lucchese"}}, {"_id": "F32CGFLXeKGpABKKa", "postedAt": "2023-02-16T22:12:38.654Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Hi Max. Take care of yourself. Thanks for all of your hard work.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lauren Maria"}}, {"_id": "ugs82xF4tAr9pThpY", "postedAt": "2023-02-16T23:43:02.003Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I’m beyond impressed with your decision, and with the honesty and vulnerability you’ve expressed in writing this post. I know it’s extremely difficult to admit weakness, especially in a leadership role, but as you said it sounds like the right decision.</p>\n<p>I hope your next role is fulfilling for you, and thank you for all the great work you’ve done!</p>\n", "parentCommentId": null, "user": {"username": "Wil Perkins"}}, {"_id": "SxmojbZXg39u2TQea", "postedAt": "2023-02-17T01:20:59.788Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>It'll be hard to see you go, Max!</p><blockquote><p>I’ve loved to be a part of a culture where staff are valued and empowered to do things.</p></blockquote><p>I think of you as playing a major part in creating that culture (thank you :) ). I remember being really impressed when joining CEA how you take time to individually message &amp; appreciate staff, meet regularly with everyone 1:1, and take staff feedback really seriously.</p><p>I admire you a ton, and I'm sorry this whole thing has taken such a toll. That really sucks. I'm very glad you're getting more rest these days, and am excited to hear about what you do next!</p>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "XvzHxwEeomiNdukuB", "postedAt": "2023-02-17T03:30:51.427Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I'm really grateful I got to be a part of your team, Max. Coming into working at CEA nearly 2 years ago I was aware of some of its past reputation for stressful dynamics and tumult. I can happily say that's just never been my experience, and by all accounts the shift from that CEA of yore to the functioning, welcoming CEA I've been lucky enough to be a part of came significantly from the work you've done as executive director.</p><p>Thinking about my interactions with you, the thing that stands out most is that you’ve felt consistently great at balancing priorities: you manage to maintain epistemic humility and openness to criticism, but also agency and willingness to make tough calls. You’re committed to outcomes, but you also abide by legible principles that create trust and sidestep naive utilitarian mirages. You clearly feel the immense stakes of your/our potential in your bones, while never seeming to lose your air of levity and warmth. You helm a company culture where specific improvements to the lives of beings out in the world are the consistent focus, while also ensuring that people (or at least, certainly I) never feel like mere fodder for the impact engine.</p><p>A key EA tenet is a priori implementation agnosticism. When I imagine how that looks at its best, I imagine it looking a lot like this: a delicate balance of considerations, avoiding easy answers, moving forward with your best guesses and then listening carefully to what the world has to tell you.</p>", "parentCommentId": null, "user": {"username": "Jonathan Mustin"}}, {"_id": "pYcmQZXcagvwZPWFG", "postedAt": "2023-02-17T06:28:54.323Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I don't know how to say this well but FWIW, what a great community you helped build that you can even be this honest and vulnerable to us. From the many communities I'm part of, sharing these struggles and prioritizing the greater good over personal status/gain is unheard of. Even with the most progressive ones. I don't hear or see these actions, especially from the leadership of the movement/community. I'm honestly shocked. Thank you for placing our community's impact first.<br><br>I also can't help but still be in awe of the many great things our community has done and the real progress we cautiously make to do better. Thank you for your part in that.<br><br>We're sad to see you go but I'm glad you're taking care of yourself. I hope you feel better soon.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Arvin"}}, {"_id": "gGnT86wuFDiJj9atH", "postedAt": "2023-02-17T11:28:15.928Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>You're leaving as you've led: being a great positive role model (in this case on mental health), being humble, and focussing on what's best for the community and the wider impact it seeks to achieve. Congratulations and well done Max!</p>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "msLjKtF32JdqGgEM7", "postedAt": "2023-02-17T12:20:00.733Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Thank you for all your work Max! I really admire your courage to make this decision and allow yourself to be so honest and vulnerable in the process. &nbsp;You're leaving us with a really valuable leadership lesson here. &nbsp;And although we only got to interact very briefly during your tenure, I was still able to see all the great qualities that all of your team have mentioned here.</p><p>I'm wishing you lots of good times with your loved ones moving forward.</p>", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "rCkvEgCAois7YLNpc", "postedAt": "2023-02-17T16:18:33.264Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I didn't know you (Max) well but the comment above captures a lot of what was also my impression following CEA's progress from further away! Sorry to see you step back. Best wishes with taking more time for yourself and with future roles (if you plan to pursue them)!</p>\n", "parentCommentId": "vFyBnQtBqazHCjPPh", "user": {"username": "Lukas_Gloor"}}, {"_id": "MrFvxrY2zFkRniTTJ", "postedAt": "2023-02-17T16:18:43.118Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Thank you Max for all your hard work and all the good you've done in your role. Your colleagues' testimonials here are lovely to see.  I think it's really cool you're taking care of yourself and thinking ahead in this way about handing off responsibility - even though I'm sure it's hard.</p>\n<p>Good luck with the transition &lt;3</p>\n", "parentCommentId": null, "user": {"username": "Ardenlk"}}, {"_id": "5BnyLf3voPJAwyigR", "postedAt": "2023-02-17T16:56:31.989Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Me too, from inside the building. Best of luck Max!</p>", "parentCommentId": "rCkvEgCAois7YLNpc", "user": {"username": "RyanCarey"}}, {"_id": "gFmhPZwQXvxnsC6Ap", "postedAt": "2023-02-17T19:36:07.572Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Hey everyone, on an admin note I want to announce that I'm stepping in as \"Transition Coordinator.\" Basically, Max wanted to step down immediately, and choosing an ED even on an interim basis might take a bit, so I will be doing the minimal set of ED-like tasks to keep CEA running and start an ED search.&nbsp;</p><p>If things go well you shouldn’t even notice that I’m here, but you can reach me at&nbsp;<a href=\"mailto:ben.west@centreforeffectivealtruism.org\"><u>ben.west@centreforeffectivealtruism.org</u></a> if you would like to contact me personally.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "J5Djtiq7eH3MgrXW3", "postedAt": "2023-02-18T08:09:01.461Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Thank you for being open about this Max. I'm sorry to hear that it's been tough. I think this post in itself is really valuable. I imagine myself using it as a good example in the future to encourage people to prioritize their mental health.</p>\n<p>I appreciate the work you've done to make CEA into an organisation that I really admire. I'm sure you'll do great things in the future. Best wishes!</p>\n", "parentCommentId": null, "user": {"username": "Jordan Pieters"}}, {"_id": "YEQwYFSxJeTuwkxKn", "postedAt": "2023-02-18T19:43:14.660Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>&lt;3</p>", "parentCommentId": null, "user": {"username": "Raemon"}}, {"_id": "WYrKGPAMQg5JGHdgJ", "postedAt": "2023-02-18T22:31:00.354Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I can’t say anything much beyond what’s already been said, but want to reiterate the deep gratitude for what you’ve done in this role. I have always felt heard and respected in conversations with you, even before working at CEA, and I appreciate how value-driven and kind you are in your work.</p>\n<p>I really respect you making a choice that will be best for your health—while also making a choice on timing that will support the community’s health. Thank you for that thoughtfulness and all you’ve done for the community! Looking forward to seeing you around still.</p>\n", "parentCommentId": null, "user": {"username": "2ndRichter"}}, {"_id": "ZhC2AxdMifdMvNetQ", "postedAt": "2023-02-19T05:50:23.861Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Take care Max!!!! Thanks for all your good work, hope you get good rest and can take care of your well-being!</p>\n", "parentCommentId": null, "user": {"username": "kirstenangeles"}}, {"_id": "WckS87WnN3kJbeCjH", "postedAt": "2023-02-19T09:41:35.316Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>I have so much respect for your work. We haven't interacted much, but I imagine this has been an extremely challenging and important role - even before the past few months - and I'm very grateful for your years of service and that you're staying on as an advisor.</p>\n", "parentCommentId": null, "user": null}, {"_id": "Rxob32hrAAZ3LKach", "postedAt": "2023-02-22T01:25:57.790Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Max, thank you for everything you’ve done to strengthen the EA community. I’ve had (more than?) my share of disagreements with you about questions of strategy but there’s no doubt in my mind that you’ve worked extremely hard and that CEA has become a dramatically stronger organization under your leadership. On a personal level, I truly appreciate your thoughtful and helpful engagement with my critique for the read teaming contest; not many people would engage with criticism so constructively. I really hope that this decision helps you get to a better place, and I admire the example you’re setting in prioritizing your own well being at this time.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "hrRiLcBz78CCaGved", "postedAt": "2023-02-24T04:18:03.141Z", "postId": "99tnp7Jpts7Gssq7J", "htmlBody": "<p>Sorry to hear this Max. I can't even imagine how stressful all of this must have been.<br><br>Thank you for all your work and I hope you get back to good health soon.</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}]