[{"_id": "XryQX3BuNmaRMX6fZ", "postedAt": "2014-03-11T02:51:00.000Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>I think it's funny that I have been involved in EA since before the term came into popular use, but I can't remember it ever <em>not</em> being called &quot;effective altruism.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Michael_Dickens"}}, {"_id": "TS7Txc6eZEB4ZFEYA", "postedAt": "2014-03-11T14:38:00.000Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>I remember one of my favourites for the name of CEA as the Federation for Effective Altruism Research. Or the Society for the Progress of Empathetic Consequentialism Through Reasoned Evaluation. I think the first may have been yours, Will. ;)</p>\n", "parentCommentId": null, "user": {"username": "Sebastian_Farquhar"}}, {"_id": "qAMipe5B2am38h2Br", "postedAt": "2014-03-12T02:59:00.000Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>Hahaha. Another one of mine was &quot;Institute for the Development of Effective \nAltruism&quot; (IDEA - which came second to CEA... I'm glad it did!) As was &quot;The High Impact NetworK&quot; (THINK), which I was \npleased to see got taken on.</p>\n", "parentCommentId": "TS7Txc6eZEB4ZFEYA", "user": {"username": "William_MacAskill2"}}, {"_id": "5wZMNuKcJq7Fj4DMb", "postedAt": "2014-03-13T03:54:00.000Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>Fascinating! I've always wondered about the genesis of effective altruism, including the name. You definitely chose the best name; one that will survive the ages. The name makes it easier to explain to people why I think I'm helping others by working at an oil plant. As soon as I use the word &quot;effective&quot;, people STHU. How can you argue with effectiveness?. Rational is accurate, but a little dry, and somewhat off-putting for the faithful.</p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "rg2aLRY5BtRZu6P3a", "postedAt": "2014-03-15T00:08:00.000Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>See <a href=\"http://www.jefftk.com/p/a-name-for-a-movement\">this post</a> by Jeff Kaufman for a list of names that were in use before 'effective altruism' became established.</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini2"}}, {"_id": "ZrmDoHxHavJrLh94a", "postedAt": "2014-12-03T00:34:31.998Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>Interesting history!</p>\n<p>However, I think you are being unfair to <a href=\"http://intelligence.org/\">MIRI</a>. Eliezer was using the term as <a href=\"http://lesswrong.com/lw/hw/scope_insensitivity/\">as far back as 2007</a>, four years before you mention it first being used in Oxford. So it wasn't originated in Oxford. And given that many CEA members have read LessWrong, including <a href=\"http://lesswrong.com/user/Toby_Ord/overview/?count=10&amp;after=t1_1v8r\">Toby Ord</a>, it's seems a stretch to even say it was independently re-invented.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "QhLrHR6B33qHsadhi", "postedAt": "2015-05-31T05:02:02.655Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>There's only so many things you can call it, and accidental namespace collisions / phrase reinventions aren't surprising.  I was surprised when I looked back myself and noticed the phrase was there, so it would be more surprising if Toby Ord remembered than if he didn't.  I'm proud to have used the term &quot;effective altruist&quot; once in 2007, but to say that this means I coined the term, especially when it was re-output by the more careful process described above, might be giving me too much credit - but it's still nice to have this not-quite-coincidental mention be remembered, so thank you for that!</p>\n", "parentCommentId": "ZrmDoHxHavJrLh94a", "user": {"username": "EliezerYudkowsky"}}, {"_id": "ETPNJ8rKvPr69dtjH", "postedAt": "2017-08-12T01:09:14.709Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>notacleverthrow-away on Reddit points out that there's <a href=\"https://www.reddit.com/r/EffectiveAltruism/comments/6t3cvw/of_historical_interest_sl4_wiki_effective/\">an even earlier usage of the term on the SL4 wiki by Anand</a> from way back in January 2003! Here's <a href=\"http://sl4.org/wiki/EffectiveAltruism\">the page on EffectiveAltruism on sl4.org</a>.</p>\n", "parentCommentId": null, "user": {"username": "EricHerboso"}}, {"_id": "fCitp97pRfTxnYB4R", "postedAt": "2023-01-22T15:36:57.013Z", "postId": "9a7xMXoSiQs3EYPA2", "htmlBody": "<p>Copying the text here in case the <a href=\"http://archive.is\">archive.is</a> copy is lost:</p>\n<blockquote>\n<p>Whether you have $100 or $100 million that you can apply to improving humanity's condition, there are more effective and less effective ways to use that money. For example, say you want to donate $1,000 to an AIDS foundation, possibly one that attempts to slow the spread of HIV/AIDS in Africa, or one that works on figuring out how to control HIV itself, so that people can live with the virus. Giving to such a foundation is an altruistic act, a good deed, and thus by itself wonderful and commendable. It's certainly more altruistic to give $1000 to an AIDS foundation than to buy someone you care for $1000 in material possessions; possessions they don't need in any important sense. However, if the person with $1000 was aware, or became aware, of a way that they could use their money to help achieve a much greater and longer lasting altruistic impact on humanity, even though that way was less emotionally satisfying than helping AIDS victims, then it would be more helpful, more altruistic, and achieve greater lasting good if they used their money in the second way.</p>\n<p>Everything that I know about trying to do what's good, which includes trying to figure out how to do what's good, tells me that supporting the second way is preferable to supporting the AIDS foundation (that's not to say that supporting such a foundation isn't worthwhile or important!), and certainly more preferable than using the money on jewelry. To my knowledge, the best known examples of the second way are SingularityExplicitAndImplicitWork; the most effectively altruistic forms of work that one can presently do.\n-- Anand</p>\n<hr>\n<p>It is also worth noting that \"IntuitiveSelfishness\" is not the same thing as \"RationalSelfishness\" or \"EffectiveSelfishness\".\n--observer</p>\n<hr>\n<p>Last edited October 4, 2003 1:19 am by Observer</p>\n</blockquote>\n", "parentCommentId": "ETPNJ8rKvPr69dtjH", "user": {"username": "Jeff_Kaufman"}}]