[{"_id": "6fxmoxe4ncCCCHCjt", "postedAt": "2022-12-17T16:12:14.632Z", "postId": "9ah2c3v3KGBgbSLQo", "htmlBody": "<p>It seems unlikely that the interests of future generations would be different to our own, so efforts at improving our own interests is very effective at improving theirs as well?</p>\n", "parentCommentId": null, "user": {"username": "Brian E Adams"}}, {"_id": "BwaYtYA7ycRTQAq6G", "postedAt": "2022-12-17T16:20:31.396Z", "postId": "9ah2c3v3KGBgbSLQo", "htmlBody": "<p>I’d like to see some scenarios for each point to paint a clearer picture. I do agree with all 3 points although I would order them 3-2-1 in terms of strength of the arguments.</p>\n", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "rcuQ7WbGsqrKy5nfs", "postedAt": "2022-12-18T13:29:27.365Z", "postId": "9ah2c3v3KGBgbSLQo", "htmlBody": "<p>In general yes, but whether and how much we discount their welfare affects our decision making with regards to what does the <em>most</em> good</p>\n", "parentCommentId": "6fxmoxe4ncCCCHCjt", "user": {"username": "freedomandutility"}}, {"_id": "d8jL9ztnDAQ5RSjyh", "postedAt": "2022-12-19T04:49:53.687Z", "postId": "9ah2c3v3KGBgbSLQo", "htmlBody": "<p>If our interests are qualitatively the same, it doesn't matter to what extent we weigh their interest. We are achieving it by pursuing our own: health, wealth, happiness.</p>\n<p>Perhaps if you feel otherwise, it's because you feel we are mortgaging our future for the present? I don't think that is true, generally. Climate change, national debt, insolvent pensions....all are tractable problems we're either a) solving now and/or, b) are sufficiently incentivized to solve for.</p>\n", "parentCommentId": "rcuQ7WbGsqrKy5nfs", "user": {"username": "Brian E Adams"}}, {"_id": "wpBjvh94tLaHsrfzt", "postedAt": "2022-12-22T11:23:40.815Z", "postId": "9ah2c3v3KGBgbSLQo", "htmlBody": "<p>For point 1, if future human beings are better off (they live longer and happier lives), then (all else being equal) we should value more one of these better future lives than one life from today's world. Therefore we shouldn't discount its value for this reason.</p>", "parentCommentId": null, "user": {"username": "Miguel Lima Medín"}}]