[{"_id": "iGFzYxaxsbpM8esk7", "postedAt": "2023-05-24T07:21:59.666Z", "postId": "9apBqe4KH394cS89z", "htmlBody": "<p>I've been thinking along the same lines but wouldn't have verbalised it as well as you. Thank you for writing this up!</p>\n<p>I assume that especially in countries with less EA presence of direct impact orgs, the local EA communities can play an vital role in supporting people to get more engaged with EA ideas and potentially become leaders of their own high-impact projects.</p>\n<p>I thought having many different forms of engagement at each stage was implicit to the funnel model as well, but having it explicit as \"action, ideas, and diverse connections\" seems like a useful framework. I'll think more about what this could mean in practice for us in my group</p>\n", "parentCommentId": null, "user": {"username": "Karla Still"}}, {"_id": "aEMKo97fxBY3yhbbF", "postedAt": "2023-05-24T12:01:42.501Z", "postId": "9apBqe4KH394cS89z", "htmlBody": "<p>Thanks for clarifying that national groups fulfil important roles beyond those two parts of the funnel!</p><p>Reading this made me realise I'm worried that there are important things that regional/national groups do that aren't always very legible to funders, like:</p><ul><li>Allowing EAs outside of traditional EA Hubs maintain motivation in their work (kind of what you describe in the 'Continuous contact points' section)</li><li>Having EAGx conferences take place (initiating the idea; getting a team together, etc.)</li><li>Fostering positive portrayals of Effective Altruism in local media outlets</li></ul><p>I'm worried that various contributions of national groups are hard to capture in a metric like 'longtermist career changes', and think this post is helpful in clarifying the importance of funders not being too myopic in their grantmaking decisions. [Edit: I'm not necessarily arguing they are] Thanks for writing this!</p>", "parentCommentId": null, "user": {"username": "Joris P"}}, {"_id": "EHBr3hDYzRjpfSFzM", "postedAt": "2023-05-26T19:57:15.241Z", "postId": "9apBqe4KH394cS89z", "htmlBody": "<p>Thank you for wiring this down, the work of EA Israel has been inspiring for us at EA Germany.</p>\n", "parentCommentId": null, "user": {"username": "gruban"}}, {"_id": "etifHj2BZD2G562tE", "postedAt": "2023-05-27T15:21:19.608Z", "postId": "9apBqe4KH394cS89z", "htmlBody": "<p>I agree, thanks a lot Ezra! This is super interesting to read, and a great summary of my still vague impression of what our national group is able to offer to the many local groups scattered throughout Germany.</p>", "parentCommentId": "EHBr3hDYzRjpfSFzM", "user": {"username": "Milena Canzler"}}]