[{"_id": "BXQQ44zR4Q8PxsxA2", "postedAt": "2022-12-05T21:42:58.871Z", "postId": "9Axdtzusq9wSKixEZ", "htmlBody": "<p>Super interesting history here - thanks for sharing this research!&nbsp;</p><p>You note at the end that large, multi-focal charities are different because \"a lot of their funding goes to running their own programs instead of regranting, though they do some of both\". It's worth noting that when you give to funds like the GiveWell Unrestricted Fund, you support GiveWell's operations. In fact, about <a href=\"https://blog.givewell.org/2022/08/05/givewells-2021-metrics-report/\">2%</a> of GiveWell's overall spend last year was on internal ops. While 2% is a tiny number compared to organizations like Oxfam or IRC, it's still worth noting. I am in no way criticizing the $11M GiveWell spent on their operations last year - GiveWell needs this money to offer their services and conduct research.&nbsp;</p><p>Another complicating factor is that GiveWell <a href=\"https://blog.givewell.org/2021/11/22/we-aim-to-cost-effectively-direct-around-1-billion-annually-by-2025/\">chose last year</a> to begin \"rolling over\" funds. In practice, this meant that $66M donated to the Top Charities Fund in 2021 <a href=\"https://blog.givewell.org/2022/08/05/givewells-2021-metrics-report/\">did not get donated</a> in 2021. Again, I am not criticizing this decision, but it means that when you give to the fund, your donation is not necessarily immediately directed to an NGO. To your point, the same is/was certainly also true of United Way or the Community Chest. But folks should know that when they give to the Top Charities Fund, they cannot expect their donation to reach the bank account of a charity as quickly as if they had donated directly.</p><p>Neither of these factors was mentioned in <a href=\"https://www.givingwhatwecan.org/why-we-recommend-funds\">Giving What We Can's post</a> as potential reasons against giving to a fund, but in my opinion, GiveWell shouldn't be reluctant to share these details. I think that if anything, GiveWell explaining their internal ops and roll over funding strategy helps demystify the new EA incarnation of the charitable fund. Instead of billing it as something entirely novel, GiveWell et al. should bill it as a vast improvement on previous efforts to pool and direct charitable donations more effectively.</p>", "parentCommentId": null, "user": {"username": "Jasper Meyer"}}, {"_id": "hbPddKHqnZwHthwN7", "postedAt": "2022-12-05T22:07:53.284Z", "postId": "9Axdtzusq9wSKixEZ", "htmlBody": "<p>Only GiveWell's Unrestricted Fund supports GiveWell's operations <a href=\"https://www.givewell.org/our-giving-funds\">https://www.givewell.org/our-giving-funds</a></p>\n", "parentCommentId": "BXQQ44zR4Q8PxsxA2", "user": {"username": "Khorton"}}, {"_id": "fh5mBzeHKMbLzZ7dp", "postedAt": "2022-12-05T22:17:58.408Z", "postId": "9Axdtzusq9wSKixEZ", "htmlBody": "<p>Oops - I realized I understood this incorrectly and have edited my comment. Thank you for the clarification.</p>", "parentCommentId": "hbPddKHqnZwHthwN7", "user": {"username": "Jasper Meyer"}}, {"_id": "TXLBKk9hnoz6sdynP", "postedAt": "2022-12-06T03:38:16.835Z", "postId": "9Axdtzusq9wSKixEZ", "htmlBody": "<p>The analogy here would be if GiveWell, in addition to making grants to other charities, also had their own on the ground bed net distribution program.</p>\n", "parentCommentId": "BXQQ44zR4Q8PxsxA2", "user": {"username": "Jeff_Kaufman"}}, {"_id": "jNRXoEnirXHrFJ3r4", "postedAt": "2022-12-06T19:10:28.333Z", "postId": "9Axdtzusq9wSKixEZ", "htmlBody": "<p>Yes, exactly. One might even wonder if, because a GiveWell recommendation generates SO much funding, select on the ground charities have conformed to the point that we might consider GiveWell (via their standards/eval criteria) an essential part of their operation model. (I don't have the info/experience to support this claim - just interesting food for thought...)</p>", "parentCommentId": "TXLBKk9hnoz6sdynP", "user": {"username": "Jasper Meyer"}}]