[{"_id": "ktFMJjcARnq858kJu", "postedAt": "2023-08-18T02:50:04.977Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>This is really amazing! I really agree with you. I think these and many more reasons will make EA concepts not to have that deep impacts in Africa. What the west considers a problem versus what Africans considers important and relevant to us. While AI and animal safety are very important cause priority. I think EA should be very adaptive to listen to us and not tell us what they think is important. Maybe what makes this happen this way is that African's are not contributing much financially to EA pool of funding hence the person that blows the piper calls its tone.&nbsp;</p>", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "eWqRuQtndonChrmeh", "postedAt": "2023-08-18T10:34:27.520Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>I think the recommendations at the end of this post are great. In particular, I think there is a high expected value (EV) middle ground between the approaches EA takes to randomista development and animal welfare vs the approach it takes to longtermism. This middle ground would involve a focus on economics and social sciences education and training in low-income countries to increase the supply of individuals with local knowledge, appropriate language skills and the skills to implement evidence-based approaches to improving health and reducing extreme poverty.</p>\n<p>However I do disagree with “Striking a balance between allocating resources where they can have the greatest immediate impact and ensuring equitable distribution across the diverse landscape of Africa is a complex but necessary endeavour in the pursuit of comprehensive change.”</p>\n<p>I appreciate that “equity” can mean different things to different people, but I believe equity generally refers to something along the lines of “distributing different amounts of resources to different people according to their needs, to achieve equal outcomes”.</p>\n<p>So I think the equitable approach is the same as the impact maximising approach - resources should be focused on the poorest countries and should not be evenly spread across African countries.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "RuFZjdFtGmCoabeL4", "postedAt": "2023-08-18T14:09:35.972Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>Thanks for sharing this post both :) I also think it's an important discussion, so I've broken up a few points I'd like to make and hope you find useful</p><blockquote><p>It's worth contemplating the establishment of an EA Africa initiative [...] Actively seeking out and involve more community builders and contributors from diverse African backgrounds to ensure a broader range of perspectives. Explore the possibility of hosting an EAGx conference in Africa</p></blockquote><p>I think all of these suggestions are great and I'd be very happy if they came about, especially if the agenda and talks/themes were chosen by African EAs and not prescribed by 'central' EA</p><blockquote><p>EA UCT finds itself in a competitive environment where distinguishing our focus as a research- and evidence-based movement becomes an intricate endeavour. The prevailing narrative often places an emphasis on tangible, immediate impact, which has occasionally posed hurdles in conveying the nuanced nature of EA's approach.</p></blockquote><p>It's interesting that this is the environment you find EA to be in at UCT - and I'd definitely defer to you about how EA is perceived, or what kinds of EA arguments and stories would be best received in an African context. It's interesting because I feel a lot of EA criticism in the West is that it focuses <i>too much</i> on immediate impact and not the nuanced, longer-term ones (though this may have changed in recent years)</p><blockquote><p>Central to our discourse is the aspiration for Africa to become self-reliant and cease dependency on external interventions.</p></blockquote><p>I think many EAs would agree with this - and many of the points made here seem similar to me to those made in <a href=\"https://forum.effectivealtruism.org/posts/bsE5t6qhGC65fEpzN/growth-and-the-case-against-randomista-development\">\"Growth and the case against randomista development\"</a> and I think that argument could be strengthened when coupled with African perspectives and experiences. But also don't think these criticisms have been ignored by GHD EA, on a <a href=\"https://80000hours.org/podcast/episodes/elie-hassenfeld-givewell-critiques-and-lessons/\">recent podcast</a> the CEO of GiveWell responded to this critique, and seems to be unconvinced at the evidence base for systemic interventions and concerned that supporting them could cause harmful backfire effects (i'd recommend listening yourself rather than just accepting my summary)</p><blockquote><p>In our engagement with Effective Altruism (EA), we noted a distinct emphasis on Existential Risks, notably concerning Artificial Intelligence (AI), alongside a focus on animal welfare and veganism...It's important to note that concentrating solely on existential risks could inadvertently diminish the urgency of current issues,&nbsp;<a href=\"https://www.project-syndicate.org/commentary/ethical-implications-of-focusing-on-extinction-risk-by-peter-singer-2021-10?barrier=accesspaylog\"><u>such as poverty and education</u></a>.</p></blockquote><p>My main 'critical' take on this post, if there is one, is that is seems to buy into the idea &nbsp;that EA used to be about Global Health and is now about 'crazy ideas'<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefce5culyr8bu\"><sup><a href=\"#fnce5culyr8bu\">[1]</a></sup></span>&nbsp;like wild animal welfare or longtermism. Your experience is of course your experience and I don't deny it. I'd be very interested to find out why your impressions does lean this way.</p><p>I also don't think that the link makes the strongest case for longtermism being potentially harmful - the last paragraph could apply to essentially any ideology at all. And the piece Singer links to that brings up this potential harm is from Émile Torres, who I don't think is a credible critic of EA or longtermism.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref1r2b95ddj0r\"><sup><a href=\"#fn1r2b95ddj0r\">[2]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnce5culyr8bu\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefce5culyr8bu\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My emphasis, not yours! I'm not even saying you believe this per se, but the ideas seem in the same area</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn1r2b95ddj0r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref1r2b95ddj0r\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Cards on the table, I don't think they're credible full stop</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "FNa2i6HFv8QsErhbF", "postedAt": "2023-08-19T18:31:03.663Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>Thank you very much Aden</p>\n", "parentCommentId": "Prdzeo8bG3NydJFEB", "user": {"username": "Ashura Batu"}}, {"_id": "mgcdctradTnLum5pX", "postedAt": "2023-08-19T18:40:58.360Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>I understand your perspective, and I agree that there's often a fine balance between prioritising resources for the greatest immediate impact and ensuring equity in resource distribution, especially in the context of international development and poverty alleviation efforts.</p><p>You're correct that equity typically involves distributing resources based on need to achieve equal outcomes, and in many cases, this might align with an impact-maximising approach. However, it's also important to consider factors like historical disparities, political stability, and varying levels of capacity in different regions or countries.</p><p>For example, some regions or countries might require more initial investment to build the necessary infrastructure and capacity to effectively utilise resources for long-term development. In these cases, it could be argued that equitable distribution might mean temporarily directing more resources to such regions, even if it doesn't yield immediate impact comparable to areas with more established infrastructure.</p><p>So, while focusing on the poorest countries is often a sound strategy for immediate impact, it's also essential to take into account the broader context, acknowledge historical inequalities, and ensure that long-term strategies promote equitable development in the region as a whole.</p>", "parentCommentId": "eWqRuQtndonChrmeh", "user": {"username": "Hayley Martin"}}, {"_id": "8eYQZGR5XjX2ykwKo", "postedAt": "2023-08-19T18:44:58.158Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>Thank you for sharing your valuable perspective. Your insights shed light on the importance of cultural context in shaping priorities within EA. It's crucial for EA to be adaptive and inclusive, listening to the voices and concerns of diverse regions like Africa rather than prescribing priorities from afar. Financial contributions to the EA funding pool are one aspect, but the movement's true strength lies in its ability to engage with and learn from a global community with different perspectives and needs.</p>\n", "parentCommentId": "ktFMJjcARnq858kJu", "user": {"username": "Ashura Batu"}}, {"_id": "puqgopecH2oAvgjW7", "postedAt": "2023-08-19T19:13:23.789Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>Thank you for your thoughtful and constructive feedback. We greatly appreciate your input.</p><p>Your observation about the perception of EA at UCT and the emphasis on immediate impact versus long-term considerations is an intriguing one. It underscores the adaptability of EA principles to different contexts and highlights the ongoing discussions and critiques within the EA community about focus areas.</p><p>The aspiration for Africa to become self-reliant is a point of agreement that many EAs share, we appreciate your mention of this perspective, &nbsp;\"Growth and the case against randomista development\" as we hadn't heard nor read about it until you mentioned it. We're also grateful for the podcast suggestion and will be sure to check it out.</p><p>Your critique about the post potentially perpetuating the idea that EA is solely about existential risks or \"crazy ideas\" is duly noted. As you said, our experience is our experience. It's important to emphasise that EA encompasses a broad range of cause areas, including global health and development, and it's crucial to recognise the diversity of focus within the movement.&nbsp;</p><p>&nbsp;We appreciate your feedback on the credibility of the sources cited and acknowledge that criticisms and debates are ongoing within the EA community.</p>", "parentCommentId": "RuFZjdFtGmCoabeL4", "user": {"username": "Hayley Martin"}}, {"_id": "ZhdbFdSEwDhFgtwZf", "postedAt": "2023-08-20T16:12:59.534Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>I think EA forum should decide on what they would define as impact in Africa. I think, they should bring together key players from Africa a path for impact.</p>\n", "parentCommentId": "8eYQZGR5XjX2ykwKo", "user": {"username": "emmannaemeka"}}, {"_id": "TKHPKmbvg2qGjZcp3", "postedAt": "2023-08-25T21:09:46.159Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>Really nice post, I think that a lot of EA doesn't appeal to people from all backgrounds(especially global south countries)at the same level of enthusiasm which is a real shame given that a lot of good which can be done in the world right now in the most cost-effective way is in those very backgrounds</p>\n", "parentCommentId": null, "user": {"username": "Heramb Podar"}}, {"_id": "7nyhEvhCs9xgMDqeQ", "postedAt": "2023-09-01T17:10:27.382Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>Great post!</p>\n", "parentCommentId": null, "user": {"username": "Daniel Ajudeonu"}}, {"_id": "or5xQErvLxu27i4Xt", "postedAt": "2023-09-11T09:27:59.314Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>thank you Daniel</p>", "parentCommentId": "7nyhEvhCs9xgMDqeQ", "user": {"username": "Hayley Martin"}}, {"_id": "wwgzF869AMwC49zbP", "postedAt": "2023-09-11T09:28:46.782Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>so true Heramb! thank you.</p>", "parentCommentId": "TKHPKmbvg2qGjZcp3", "user": {"username": "Hayley Martin"}}, {"_id": "iyJ2b5cNmzbcdLA8d", "postedAt": "2023-12-23T06:13:25.664Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": "<p>Good insights.</p>", "parentCommentId": null, "user": {"username": "Geofrey Junior Waako"}}, {"_id": "PfPcEtcwq7nroL6dx", "postedAt": "2023-08-19T18:32:32.930Z", "postId": "9cdntNDJQTS8dH5fh", "htmlBody": null, "parentCommentId": "Prdzeo8bG3NydJFEB", "user": null}]