[{"_id": "ZKipNXCAc6ivNpdGB", "postedAt": "2015-01-01T19:25:26.384Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Sorry, did you mean to save this in your drafts?</p>\n", "parentCommentId": null, "user": null}, {"_id": "mBxDbL5F4hygeYAvA", "postedAt": "2015-01-01T22:00:16.182Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>In the Basu-Mitra result, when you use the term &quot;Pareto&quot;, do you mean strong or weak?</p>\n<p>I found the section on possibility results confusing.  </p>\n<p>In this sentence you appear to use X and Y to refer to properties: &quot;Basically, we can show that if &lt; were a “reasonable” preference relation that had property X then it must also have property Y. (of course, we cannot show that &lt; is reasonable.)&quot;</p>\n<p>But here you appear to use X and Y to refer to utility vectors: &quot;For example, say that X&lt;Y if both X and Y are finite and the total utility of X is less than that of Y.&quot;</p>\n<p>Did you duplicate variables, or am I misreading this?  </p>\n<p>General note: if you numbered your headings and subheadings, e.g. (1, 1.1, 1.1.1), it would make it easier to refer back to them in comments. </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "8ZakcPxRyxPkJQuqz", "postedAt": "2015-01-01T23:46:52.634Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Updated, thanks!</p>\n", "parentCommentId": "mBxDbL5F4hygeYAvA", "user": {"username": "Ben_West"}}, {"_id": "Qei88Ecz5mZWNwsdL", "postedAt": "2015-01-02T03:17:47.306Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>The universe may very well be infinite, and hence contain an infinite amount of happiness and sadness. This causes several problems for altruists</p>\n</blockquote>\n<p>This topic came up on the 80k blog a while ago and I found it utterly ridiculous then and I find it utterly ridiculous now.  The possibility of an infinite amount of happiness outside our light-cone (!) does not pose problems for altruists except insofar as they write philosophy textbooks and have to spend a paragraph explaining that, if mathematically necessary, we only count up utilities in some suitably local region, like the Earth.  No-one responds to the drowning child by saying, &quot;well there might be an infinite number of sentient life-forms out there, so it doesn't matter if the child drowns or I damage my suit&quot;.  It is just not a consideration.</p>\n<p>So I disagree very strongly with the framing of your post, since the bit I quoted is in the summary.  The rest of your post is on the somewhat more reasonable topic of comparing utilities across an infinite number of generations.  I don't really see the use of this (you don't need a fully developed theory of infinite ethics to justify a carbon tax; considering a handful of generations will do), and don't see the use of the post on this forum, but I'm open to suggestions of possible applications.</p>\n", "parentCommentId": null, "user": {"username": "pappubahry"}}, {"_id": "nQLu5vAYsgf5YiERb", "postedAt": "2015-01-02T05:27:44.647Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>The text immediately following the passage you quoted reads:</p>\n<blockquote>\n<p>for example: we can plausibly only affect a finite subset of the universe, and an infinite quantity of happiness is unchanged by the addition or subtraction of a finite amount of happiness.</p>\n</blockquote>\n<p>This implies that the quantity of happiness in the universe stays the same after you save the drowning child. So if your reason for saving the child is to make the world a better place, you should be troubled by this implication.</p>\n", "parentCommentId": "Qei88Ecz5mZWNwsdL", "user": {"username": "Pablo_Stafforini"}}, {"_id": "9RuaCGRipH5L6bKqp", "postedAt": "2015-01-02T05:36:35.266Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>That is precisely the argument that I maintain is only a problem for people who want to write philosophy textbooks, and even then one that should only take a paragraph to tidy up.  It is not an issue for altruists otherwise -- everyone saves the drowning child.</p>\n", "parentCommentId": "nQLu5vAYsgf5YiERb", "user": {"username": "pappubahry"}}, {"_id": "tyo6PANNaWyaM7Afv", "postedAt": "2015-01-02T11:31:03.062Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>&quot;No-one responds to the drowning child by saying, &quot;well there might be an infinite number of sentient life-forms out there, so it doesn't matter if the child drowns or I damage my suit&quot;. It is just not a consideration.&quot;</p>\n<p>&quot;It is not an issue for altruists otherwise -- everyone saves the drowning child.&quot;</p>\n<p>I don't understand what you are saying here. Are you claiming that because 'everyone' does do X or because 'noone' does not do X (putting those in quotation marks because I presume you don't literally mean what you wrote, rather you mean the 'vast majority of people would/would not do X'), X must be morally correct?</p>\n<p>That strikes me as...problematic.</p>\n", "parentCommentId": "Qei88Ecz5mZWNwsdL", "user": {"username": "AGB"}}, {"_id": "Zq4aRFaqgMayhE8PX", "postedAt": "2015-01-02T12:35:50.608Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Letting the child drown in the hope that</p>\n<p>a) there's an infinite number of life-forms outside our observable universe, and</p>\n<p>b) that the correct moral theory does not simply require counting utilities (or whatever) in some local region</p>\n<p>strikes me as far more problematic.  More generally, letting the child drown is a reductio of whatever moral system led to that conclusion.</p>\n", "parentCommentId": "tyo6PANNaWyaM7Afv", "user": {"username": "pappubahry"}}, {"_id": "mssP4RtqmRn3KywFk", "postedAt": "2015-01-02T14:21:09.820Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thanks for the feedback. Couple thoughts:</p>\n<ol>\n<li>I actually agree with you that most people shouldn't be worried about this (hence my disclaimer that this is not for a general audience). But that doesn't mean <em>no one</em> should care about it.</li>\n<li>Whether we are concerned about an infinite amount of time or an infinite amount of space doesn't really seem relevant to me at a mathematical level, hence why I grouped them together.</li>\n<li>As per (1), it might not be a good use of your time to worry about this. But if it is, I would encourage you to read the paper of Nick Bostrom's that I linked above, since I think &quot;just look in a local region&quot; is too flippant. E.g. there may be an infinite number of Everett branches we should care about, even if we restrict our attention to earth.</li>\n</ol>\n", "parentCommentId": "Qei88Ecz5mZWNwsdL", "user": {"username": "Ben_West"}}, {"_id": "okN6xqtPim8M3mgZw", "postedAt": "2015-01-02T15:01:24.707Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Hopefully this is my last comment in this thread, since I don't think there's much more I have to say after this.</p>\n<ol>\n<li><p>I don't really mind if people are working on these problems, but it's a looooong way from effective altruism.</p>\n</li>\n<li><p>Taking into account life-forms outside our observable universe for our moral theories is just absurd.  Modelling our actions as affecting an infinite number of our descendants feels a lot more reasonable to me.  (I don't know if it's <em>useful</em> to do this, but it doesn't seem obviously stupid.)</p>\n</li>\n<li><p>Many-worlds is even further away from effective altruism.  (And quantum probabilities sum to 1 anyway, so there's a natural way to weight all the branches if you want to start shooting people if and only if a photon travels through a particular slit and interacts with a detector, ....)</p>\n</li>\n</ol>\n", "parentCommentId": "mssP4RtqmRn3KywFk", "user": {"username": "pappubahry"}}, {"_id": "ycW4vRFvAD35eorFa", "postedAt": "2015-01-02T16:11:38.596Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I think the relevance of this post is that it tentatively endorses some type of time-discounting (and also space-discounting?) in utilitarianism.  This could be relevant to considerations of the far future, which many EAs think is very important.  Though presumably we could make the asymptotic part of the function as far away as we like, so we shouldn't run into any asymptotic issues?</p>\n", "parentCommentId": "okN6xqtPim8M3mgZw", "user": {"username": "Lila"}}, {"_id": "CHXWhm36g2jo5rJc4", "postedAt": "2015-01-02T16:13:31.679Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>One thing I liked about this post is that it was written in English, instead of math symbols.  I find it extremely hard to read a series of equations without someone explaining them verbally.  Overall I thought the clarity was fairly good.  </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "PdNiPucSKHRW3Dmfa", "postedAt": "2015-01-02T21:28:36.757Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thanks for the summary. :)</p>\n<p>I don't understand why they're working on infinite vectors of future populations, since it looks very likely that life will end after a finite length of time into the future (except for Boltzmann brains). Maybe they're thinking of the infinity as extended in space rather than time? And of course, in that case it becomes arbitrary where the starting point is.</p>\n<blockquote>\n<p>we can plausibly only affect a finite subset of the universe, and an infinite quantity of happiness is unchanged by the addition or subtraction of a finite amount of happiness.</p>\n</blockquote>\n<p>Actually, every action we take makes an infinite difference. I was going to write more explanation here but then realized I should add it to my essay on infinity: <a href=\"http://reducing-suffering.org/believe-infinity/#Infinity_does_not_imply_futility\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "Brian_Tomasik"}}, {"_id": "TnPdWQSw7ZRuZ6PQ6", "postedAt": "2015-01-02T23:28:11.187Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>More generally, letting the child drown is a reductio of whatever moral system led to that conclusion.</p>\n</blockquote>\n<p>Population ethics (including infinite ethics) is replete with impossibility theorems showing that no moral theory can satisfy all of our considered intuitions. (See <a href=\"http://www.repugnant-conclusion.com/population-ethics.pdf\">this paper</a> for an overview.) So you cannot simply point to a counterintuitive implication and claim that it disproves the theory from which it follows. If that procedure was followed consistently, it would disprove <em>all</em> moral theories.</p>\n", "parentCommentId": "Zq4aRFaqgMayhE8PX", "user": {"username": "Pablo_Stafforini"}}, {"_id": "mJNeNmSExM5ALzq2C", "postedAt": "2015-01-03T03:08:00.042Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>If that procedure was followed consistently, it would disprove all moral theories.</p>\n</blockquote>\n<p>I consider this a reason to not strictly adhere to any single moral theory.</p>\n", "parentCommentId": "TnPdWQSw7ZRuZ6PQ6", "user": {"username": "pappubahry"}}, {"_id": "k62SkAJbmdChSycSk", "postedAt": "2015-01-03T06:37:55.687Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>I consider this a reason to not strictly adhere to any single moral theory.</p>\n</blockquote>\n<p>This statement is ambiguous. It either means that you adhere to a hybrid theory made up of parts of different moral theories, or that you don't adhere to a moral theory at all. If you adhere to a hybrid moral theory, this theory is itself subject to the impossibility theorems, so it, too, will have counterintuitive implications. If you adhere to no theory at all, then nothing is right or wrong; <em>a fortiori</em>, not rescuing the child isn't wrong, and a theory's implying that not rescuing the child isn't wrong cannot therefore be a reason for rejecting this theory.</p>\n", "parentCommentId": "mJNeNmSExM5ALzq2C", "user": {"username": "Pablo_Stafforini"}}, {"_id": "ALenm854Dd2jJ7cDR", "postedAt": "2015-01-03T07:17:04.167Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I sympathize with this. It seems likely that the accessible population of our actions is finite, so I'm not sure one need to necessarily worried about what happens in the infinite case. I'm unworried if my impact on earth across its future is significantly positive, yet the answer of whether I've made the (possibly infinite) universe better is undefined.</p>\n<p>However, one frustration to this tactic is that infinitarian concerns can 'slip in' whenever afforded a non-zero credence. So although given our best physics it is overwhelmingly likely the morally relevant domain of our actions will be constrained by a lightcone only finitely extended in the later-than direction (because of heat death, proton decay, etc.), we should assign some non-zero credence our best physics will be mistaken: perhaps life-permitting conditions could continue indefinitely, or we could wring out life asymptotically faster than the second law, etc. These 'infinite outcomes' swamp the expected value calculation, and so infinitarian worries loom large. </p>\n", "parentCommentId": "Qei88Ecz5mZWNwsdL", "user": {"username": "Gregory_Lewis"}}, {"_id": "vrA46dYFKetqHrRCP", "postedAt": "2015-01-03T08:36:22.971Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>OK -- I mean the hybrid theory -- but I see two possibilities (I don't think it's worth my time reading up on this subject enough to make sure what I mean matches exactly the terminology of the paper(s) you refer to):</p>\n<ul>\n<li><p>In my hybridisation, I've already sacrificed some intuitive principles (improving total welfare versus respecting individual rights, say), by weighing up competing intuitions.</p>\n</li>\n<li><p>Whatever counter-intuitive implications my mish-mash, sometimes fuzzily defined hybrid theory has, they have been pushed into the realm of &quot;what philosophers can write papers on&quot;, rather than what is actually important.  The repugnant conclusion falls under this category.</p>\n</li>\n</ul>\n<p>Whichever way it works out, I stick resolutely to saving the drowning child.</p>\n", "parentCommentId": "k62SkAJbmdChSycSk", "user": {"username": "pappubahry"}}, {"_id": "RR5f3siLynZxDb6iK", "postedAt": "2015-01-03T13:20:04.639Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I think it quite obvious that if one does not observe a given theory they are not thereby disarmed from criticism of such a theory, similarly, a rejection of moralism is not equivalent with your imputed upshot that &quot;nothing is right or wrong&quot; (although we can imagine cases in which that could be so). In the case of the former, critiquing a theory adhering to but contradicting intuitionistic premises is a straightforward instance of immanent critique. In the case of the latter, quite famously, neither Bernard Williams nor Raymond Geuss had any truck with moralism, yet clearly were not 'relativists'. </p>\n", "parentCommentId": "k62SkAJbmdChSycSk", "user": {"username": "Geuss"}}, {"_id": "Xpvr7giG5wxLxxQ6f", "postedAt": "2015-01-03T13:41:07.451Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>&quot;The universe may very well be infinite, and hence contain an infinite amount of happiness and sadness. This causes several problems for altruists; for example: we can plausibly only affect a finite subset of the universe, and an infinite quantity of happiness is unchanged by the addition or subtraction of a finite amount of happiness. This would imply that all forms of altruism are equally ineffective.&quot;</p>\n<p>I have no particular objection to those, unlike me, interested in aggregative ethical dilemmas, but I think it at least preferable that effective altruism - a movement aspiring to ecumenical reach independent of any particular ethical presuppositions - not automatically presume some cognate of utilitarianism. The repeated posts on this forum about decidedly abstract issues of utilitarianism with little or no connection with the practice of charitable giving is, perhaps, not particularly helpful in this regard. Most basically however, I object to your equivalence of altruism and utilitarianism as a matter of form: that should not be assumed, but qualified.</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "RnwExmMTwHQGfLd3Y", "postedAt": "2015-01-03T13:52:05.394Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thanks Brian – insightful as always.</p>\n<ol>\n<li>It might be the case that life will end after time T. But that's different than saying it <em>doesn't matter</em> whether life ends after time T, which a truncated utility function would say. </li>\n<li>(But of course see theorem 4.8.1 above)</li>\n<li>Thanks for the insight about multiverses – I haven't thought much about it. Is what you say only true in a <a href=\"http://en.wikipedia.org/wiki/Multiverse#Max_Tegmark.27s_four_levels\">level one multiverse</a>?</li>\n</ol>\n", "parentCommentId": "PdNiPucSKHRW3Dmfa", "user": {"username": "Ben_West"}}, {"_id": "dSHaNxPDMA6fk7hTY", "postedAt": "2015-01-03T15:29:30.498Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>This seems reasonable to me. Assuming aggregative ethics only and examining niche issues within it are probably not diplomatically ideal for this site. Especially when one could feasibly get just as much attention for this kind of post on LessWrong.</p>\n<p>That'd suggest that if people want to write more material like this, it might fit better elsewhere. What do others think?</p>\n", "parentCommentId": "Xpvr7giG5wxLxxQ6f", "user": {"username": "RyanCarey"}}, {"_id": "vF5kysYi5BTW3Cz3Z", "postedAt": "2015-01-03T16:01:37.842Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>1) Fair enough. Also, there's some chance we can affect Boltzmann brains that will exist indefinitely far into the future. (<a href=\"http://reducing-suffering.org/is-there-suffering-in-fundamental-physics/#In_the_long_run_physics_dominates\">more discussion</a>)</p>\n<p>3) I added a new final paragraph to <a href=\"http://reducing-suffering.org/believe-infinity/#Current_physics_deflates_the_futility_argument\">this section</a> about that. Short answer is that I think it works for any of Levels I to III, and even with Level IV it depends on your philosophy of mathematics.</p>\n<p>(Let me know if you see errors with my facts or reasoning.)</p>\n", "parentCommentId": "RnwExmMTwHQGfLd3Y", "user": {"username": "Brian_Tomasik"}}, {"_id": "GRe7K3DusfHX7D24Z", "postedAt": "2015-01-03T17:14:20.459Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I found the OP useful.  If it were on LW, I probably wouldn't have seen it.  I don't go on LW because there's a lot of stuff I'm not interested in compared to what I am interested in (ethics).  Is there a way to change privacy settings so that certain posts are only visible to people who sign in or something? </p>\n", "parentCommentId": "dSHaNxPDMA6fk7hTY", "user": {"username": "Lila"}}, {"_id": "9N7C3exzwdfeSrZoF", "postedAt": "2015-01-03T17:35:23.960Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thanks for the data point!</p>\n<p>Sadly the forum doesn't have that kind of feature. Peter and Tom are starting to work through a few minor bugs and feature requests but wouldn't be able to implement something like that in the foreseeable future.</p>\n<p>I can see why it would be convenient for utilitarian EAs to read this kind of material here. But equally, there's a couple of issues with posting stuff about consequentialism. First, it's more abstract than seems optimal, and secondly, it's presently not balanced with discussion about other systems of ethics. As you're already implying with the filtering idea, if the EA Forum became an EA/Consequentialism Forum, that would be a real change that lots of people would not want.</p>\n<p>Would you have found this post more easily if it was posted on Philosophy for Programmers and linked from the Utilitarianism Facebook group?</p>\n", "parentCommentId": "GRe7K3DusfHX7D24Z", "user": {"username": "RyanCarey"}}, {"_id": "YbKsmrb9yHzZYPMHt", "postedAt": "2015-01-03T18:06:06.521Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>1) interesting, thanks!\n3) I don't think I know enough about physics to meaningfully comment. It sounds like you are disagreeing with the statement &quot;we can plausibly only affect a finite subset of the universe&quot;? And I guess more generally if physics predicts a multiverse of order w_i, you claim that we can affect w_i utils (because there are w_i copies of us)?</p>\n", "parentCommentId": "vF5kysYi5BTW3Cz3Z", "user": {"username": "Ben_West"}}, {"_id": "P8hSnTbPDwcuKJyJM", "postedAt": "2015-01-03T18:12:23.200Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>The problems with extending standard total utilitarianism to the infinite case are the easiest to understand, which is why I put that in the summary, but I don't think most of the article was about that.</p>\n<p>For example, the fact that you can't have intergenerational equity (Thm 3.2.1) seems pretty important no matter what your philosophical bent.</p>\n", "parentCommentId": "Xpvr7giG5wxLxxQ6f", "user": {"username": "Ben_West"}}, {"_id": "mYN62dJxTPTXagRhA", "postedAt": "2015-01-03T18:22:16.846Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Can you (or anyone else who feels similarly) clarify the sense in which you consider the repugnant conclusion 'not actually important', but the drowning child example 'important'? </p>\n<p>Both are hypotheticals, both are trying to highlight contradictions in our intuitions about the world, both require you to either (a) put up with the fact that your theory is self-contradictory or (b) accept something that most people would consider unusual/counter-intuitive.</p>\n", "parentCommentId": "vrA46dYFKetqHrRCP", "user": {"username": "AGB"}}, {"_id": "4DmehTMG8ipACGPej", "postedAt": "2015-01-03T19:51:20.192Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Yes, I was objecting to the claim that &quot;we can plausibly only affect a finite subset of the universe&quot;. Of course, I guess it remains <em>plausible</em> that we can only affect a finite subset; I just wouldn't say it's <em>highly probable</em>.</p>\n<blockquote>\n<p>you claim that we can affect wi utils</p>\n</blockquote>\n<p>Yes, unless the type of multiverse predicts that the measure of copies of algorithms like ours is zero. That doesn't seem true of Levels I to III.</p>\n<p>Also, if one uses my (speculative) <a href=\"http://reducing-suffering.org/anthropics-without-reference-classes/#SSA_on_physics_rather_than_observers\">physics-sampling assumption</a> for anthropics, a hypothesis that predicts measure zero for copies of ourselves has probability zero. On the other hand, the self-indication assumption would go hog wild for a huge Level IV multiverse.</p>\n", "parentCommentId": "YbKsmrb9yHzZYPMHt", "user": {"username": "Brian_Tomasik"}}, {"_id": "T2uY7sTqXA2uhr8sS", "postedAt": "2015-01-03T20:32:01.669Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I'm trying to use Facebook less, and I don't check the utilitarianism group, since it seems to have fallen into disuse.</p>\n<p>I have to disagree that consequentialism isn't required for EA.  Certain EA views (like the shallow pond scenario) could be developed through non-consequentialist theories.  But the E part of EA is about quantification and helping as many beings as possible.  If that's not consequentialism, I don't know what is.  </p>\n<p>Maybe some non-utilitarian consequentialist theories are being neglected.  But the OP could, I think, be just as easily applied to any consequentialism. </p>\n", "parentCommentId": "9N7C3exzwdfeSrZoF", "user": {"username": "Lila"}}, {"_id": "4qoAxsdZxmQ33p8jw", "postedAt": "2015-01-03T21:08:26.848Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>You can believe that you want to help people a lot, and that it's a virtue to investigate where those funds are going, so you want to be a good person by picking charities that help lots of people. Whether there's infinite people is irrelevant to whether you're a virtuous helper. </p>\n<p>You might like giving to givewell just because, and not feel the need for recourse to any sense of morality.</p>\n<p>The other problem is that there's going to be some optimal level of abstraction that most of the conversation at the forum could be at in order to encourage people to actually get things done, and I just don't think that philosophical analysis of consequentialism is the optimal for most people. I've been there and discussed those issues a lot for years, and I'd just like to move past it and actually do things, y'know :p</p>\n<p>Still happy for Ben to think about it because he's smart, but it's not for everyone!</p>\n", "parentCommentId": "T2uY7sTqXA2uhr8sS", "user": {"username": "RyanCarey"}}, {"_id": "iC7dqPuJqXwphqaQD", "postedAt": "2015-01-04T01:48:17.227Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>A minuscule proportion of political philosophy has concerned itself with aggregative ethics, and in my being a relatively deep hermeneutical contextualist, I take what is important to them to be what they thought to be important to them, and thus your statement - that intergenerational equity is perennially important - as patently wrong. Let alone people not formally trained in philosophy.</p>\n<p>The fact I have to belabour that most of those interested in charitable giving are not by implication automatically interested in the 'infinity problem' is exactly demonstrative of my initial point, anyhow, i.e. of projecting highly controversial ethical theories, and obscure concerns internal to them, as obviously constitutive of, or setting the agenda for, effective altruism.</p>\n", "parentCommentId": "P8hSnTbPDwcuKJyJM", "user": {"username": "Geuss"}}, {"_id": "hsZKqZiaZgeQjtj4t", "postedAt": "2015-01-04T01:59:16.454Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>Can you (or anyone else who feels similarly) clarify the sense in which you consider the repugnant conclusion 'not actually important', but the drowning child example 'important'?</p>\n</blockquote>\n<p>Because children die of preventable diseases, but no-one creates arbitrarily large populations of people with just-better-than-nothing well-being.</p>\n", "parentCommentId": "mYN62dJxTPTXagRhA", "user": {"username": "pappubahry"}}, {"_id": "gAyAnaAQwodaSk4wM", "postedAt": "2015-01-04T02:00:58.285Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>The 'E' relates to efficiency, usually thought of as instrumental rationality, which is to say, the ability to conform one's means with one's ends. That being the case, it is entirely apart from the (moral or non-moral) end by which it is possessed.</p>\n<p>I have reasons for charitable giving independent of utilitarianism, for example, and thus find the movement's technical analysis of the instrumental rationality of giving highly valuable.</p>\n", "parentCommentId": "T2uY7sTqXA2uhr8sS", "user": {"username": "Geuss"}}, {"_id": "m4vyXY9Z2tcfznfHe", "postedAt": "2015-01-04T03:32:51.025Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>there's going to be some optimal level of abstraction</p>\n</blockquote>\n<p>I'm curious what optimally practical philosophy looks like. This chart from Diego Caleiro appears to show which philosophical considerations have actually changed what people are working on:</p>\n<p><a href=\"http://effective-altruism.com/ea/b2/open_thread_5/1fe\">http://effective-altruism.com/ea/b2/open_thread_5/1fe</a></p>\n<p>Also, I know that I'd really like an expected-utilons-per-dollar calculator for different organizations to help determine where to give money to, which surely involves a lot of philosophy.</p>\n", "parentCommentId": "4qoAxsdZxmQ33p8jw", "user": {"username": "Giles"}}, {"_id": "Fo2Yswi9xZQSQ282L", "postedAt": "2015-01-04T05:12:34.520Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I'm sorry, but I don't understand this reply. Suppose you can in fact create arbitrarily large populations of people with lives barely worth living. Some moral theories would then imply that this is what you should do. If you find this implication repugnant, you should also find it repugnant that a theory <em>would</em> have that implication <em>if</em> you found yourself in that position, even if as a matter of fact you don't. As an analogy, consider Kant's theory, which implies that a man who is hiding a Jewish family should tell the truth when Nazi officials question him about it.  It would be strange to defend Kant's theory by alleging that, in fact, no actual person ever found himself in that situation.  What matters is that the situation is possible, not whether the situation is actual.</p>\n<p>But maybe I'm misunderstanding what you meant by &quot;not actually important&quot;?</p>\n", "parentCommentId": "hsZKqZiaZgeQjtj4t", "user": {"username": "Pablo_Stafforini"}}, {"_id": "dvnrXQvucR45czpSL", "postedAt": "2015-01-04T06:12:40.827Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>If you find this implication repugnant, {you should also find it repugnant that a theory would have that implication if you found yourself in that position, even if as a matter of fact you don't}.</p>\n</blockquote>\n<p>I reject the implication inside the curly brackets that I added.  I don't care what would happen to my moral theory if creating these large populations becomes possible; in the unlikely event that I'm still around when it becomes relevant, I'm happy to leave it to future-me to patch up my moral theory in a way that future-me deems appropriate.</p>\n<blockquote>\n<p>As an analogy</p>\n</blockquote>\n<p>I guess I could attach some sort of plausibility score to moral thought experiments.  Rescuing a drowning child gets a score near 1, since rescue situations really do happen and it's just a matter of detail about how much it costs the rescuer.  As applied to donating to charity, the score might have to be lowered a little to account for how donating to charity isn't an exact match for the child in the pond.</p>\n<p>The Nazi officials case... seems pretty plausible to me?  Like didn't that actually happen?</p>\n<p>Something of a more intermediate case between the drowning child and creating large populations would be the idea of murdering someone to harvest their organs.  This is feasible today, but irrelevant since no-one is altruistically murdering people for organs.  I think it's reasonable for someone previously a pure utilitarian to respond with, &quot;Alright, my earlier utilitarianism fails in this case, but it works in lots of other places, so I'll continue to use it elsewhere, without claiming that it's a complete moral theory.&quot;  (And if they want to analyse it really closely and work out the boundaries of when killing one person to save others is moral and when not, then that's also a reasonable response.)</p>\n<p>A thought experiment involving the creation of large populations gets a plausibility score near zero.</p>\n", "parentCommentId": "Fo2Yswi9xZQSQ282L", "user": {"username": "pappubahry"}}, {"_id": "KvpEa9m3BQuY98gpg", "postedAt": "2015-01-04T06:42:27.363Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>I reject the implication inside the curly brackets that I added.</p>\n</blockquote>\n<blockquote>\n<p>[...]</p>\n</blockquote>\n<blockquote>\n<p>I think it's reasonable for someone previously a pure utilitarian to respond with, &quot;Alright, my earlier utilitarianism fails in this case, but it works in lots of other places, so I'll continue to use it elsewhere, without claiming that it's a complete moral theory.&quot;</p>\n</blockquote>\n<p>I find your position unclear. On the one hand, you suggest that thought experiments involving situations that aren't actual don't constitute a problem for a theory (first quote above). On the other hand, you imply that they do constitute a problem, which is addressed by restricting the scope of the theory so that it doesn't apply to such situations (second quote above). Could you clarify?</p>\n", "parentCommentId": "dvnrXQvucR45czpSL", "user": {"username": "Pablo_Stafforini"}}, {"_id": "H8Zz8r67yo2dJXmKE", "postedAt": "2015-01-04T07:27:31.700Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Maybe I've misinterpreted 'repugnant' here?  I thought it basically meant &quot;bad&quot;, but Google tells me that a second definition is &quot;in conflict or incompatible with&quot;, and now that I know this, I'm guessing that it's the latter definition that you are using for 'repugnant'.  But I'm finding it difficult to make sense of it all (it carries a really strong negative connotation for me, and I'm not sure if it's supposed to in this context -- there might be nuances that I'm missing), so I'll try to describe my position using other words.</p>\n<p>If my moral theory, when applied to some highly unrealistic thought experiment (which doesn't have some clear analog to something more realistic), results in a conclusion that I really don't like, then:</p>\n<ul>\n<li><p>I accept that my moral theory is not a complete and correct theory; and</p>\n</li>\n<li><p>this is not something that bothers me at all.  If the thought experiment ever becomes relevant, I'll worry about how to patch up the theory then.  In the meantime, I'll carry on trying to live by my moral theory.</p>\n</li>\n</ul>\n", "parentCommentId": "KvpEa9m3BQuY98gpg", "user": {"username": "pappubahry"}}, {"_id": "o4oxJKvyfMY8arhRp", "postedAt": "2015-01-04T07:48:24.019Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thank you for the clarification.  I think I understand your position now.</p>\n<blockquote>\n<p>this is not something that bothers me at all. If the thought experiment ever becomes relevant, I'll worry about how to patch up the theory then. In the meantime, I'll carry on trying to live by my moral theory.</p>\n</blockquote>\n<p>Why doesn't it bother you at all that a theory has counterintuitive implications in counterfactual scenarios? Shouldn't this lower your confidence in the theory? After all, our justification for believing a moral theory seems to turn on (1) the theory's simplicity and (2) the degree to which it fits our intuitions. When you learn that your theory has counterintuitive implications, this causes you to either restrict the scope of the theory, and thus make it more complex, or recognize that it doesn't fit the data as well as you thought before. In either case, it seems you should update by believing the theory to a lesser degree.</p>\n", "parentCommentId": "H8Zz8r67yo2dJXmKE", "user": {"username": "Pablo_Stafforini"}}, {"_id": "MFKdeuq3oTimzWQKL", "postedAt": "2015-01-04T09:04:07.904Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>Why doesn't it bother you at all that a theory has counterintuitive implications in counterfactual scenarios? Shouldn't this lower your confidence in the theory?</p>\n</blockquote>\n<p>I think my disagreement is mostly on (1) -- I expect that a correct moral theory would be horrendously complicated.  I certainly can't reduce my moral theory to some simple set of principles: there are many realistic circumstances where my principles clash (individual rights versus greater good, say, or plenty of legal battles where it's not clear what a moral decision would be), and I don't know of any simple rules to decide what principles I deem more important in which situations.  Certainly there are many realistic problems which I think could go either way.</p>\n<p>But I agree that all other things equal, simplicity is a good feature to have, and enough simplicity might sometimes outweigh intuition.  Perhaps, once future-me carefully consider enormous aggregative ethics problems, I will have an insight that allows a drastically simplified moral theory.  The new theory would solve the repugnant conclusion (whatever I think 'repugnant' means in this future!).  Applied to present-me's day-to-day problems, such a simplified theory will likely give slightly different answers to what I think today: maybe the uncertainty I have today about certain court cases would be solved by one of the principles that future-me thinks of.</p>\n<p>But I don't think the answers will change <em>a lot</em>.  I think my current moral theory basically gives appropriate answers (sometimes uncertain ones) to my problems today.  There's wiggle-room in places, but there are also some really solid intuitions that I don't expect future-me to sacrifice.  Rescuing the drowning child (at least when I live in a world without the ability to create large numbers of sentient beings!) would be one of these.</p>\n", "parentCommentId": "o4oxJKvyfMY8arhRp", "user": {"username": "pappubahry"}}, {"_id": "kkdJ8G2BycuLhnjwu", "postedAt": "2015-01-04T12:32:30.484Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Making an expected-utilons-per-dollar calculator is an interesting project. Cause prioritisation in the broader sense can obviously fit on this forum and for that there's also: <a href=\"https://80000hours.org/career-guide/framework/cause-selection/\">80,000 Hours</a>, <a href=\"http://causeprioritization.org/_categories\">Cause prioritisation wiki</a> and <a href=\"http://www.openphilanthropy.org/\">Open Philanthropy Project</a>.</p>\n<p>If you're going for max number of years of utility per dollar, then you'll be looking at x-risk, as it's the cause that most credibly claims an impact that extends far in time (there aren't yet credible &quot;trajectory changes&quot;). That leaves CSER, MIRI, FLI, FHI and GCRI, of which CSER is currently in a fledgling state with only tens of thousands of dollars of funding, but applying for million dollar grants, so it seems to be best-leveraged.</p>\n", "parentCommentId": "m4vyXY9Z2tcfznfHe", "user": {"username": "RyanCarey"}}, {"_id": "wwh3obd5JY5qpccw8", "postedAt": "2015-01-04T12:38:44.570Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Well, you can argue that the hypothetical situation is sufficiently exotic that you don't expect your intuitions to be reliable there.</p>\n<p>It's actually pretty reasonable to me to say that the shallow pond example is simple, realistic and important, compared to the repugnant conclusion, which is abstract, unusual, unreliable and hence useless.</p>\n", "parentCommentId": "Fo2Yswi9xZQSQ282L", "user": {"username": "RyanCarey"}}, {"_id": "utt94NxBJLdNMsMJo", "postedAt": "2015-01-04T15:41:00.258Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>there aren't yet credible &quot;trajectory changes&quot;</p>\n</blockquote>\n<p>I strongly disagree. :)</p>\n<p>It's obvious that, say, the values of society may make a huge difference to the far future if (as seems likely) early AI uses goal preservation. (Even if the first version of AI doesn't, it should soon move in that direction.)</p>\n<p>Depending how one defines &quot;x-risk&quot;, many ways of shaping AI takeoffs are not work on extinction risk per se but concern the nature of the post-human world that emerges. For instance, whether the takeoff is unipolar or multipolar, what kinds of value loading is used, and how political power is divided. These can all have huge impacts on the outcome without changing the fact of whether or not the galaxy gets colonized.</p>\n", "parentCommentId": "kkdJ8G2BycuLhnjwu", "user": {"username": "Brian_Tomasik"}}, {"_id": "fRbKJaMKqhb6dMfAm", "postedAt": "2015-01-04T15:51:34.036Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I agree. I'd be clearer if I said that I think the only credible trajectory changes address the circumstances of catastrophically risky situations e.g. the period where AI takes off, and are managed my organisations that think about x-risk.</p>\n", "parentCommentId": "utt94NxBJLdNMsMJo", "user": {"username": "RyanCarey"}}, {"_id": "ByAdcrACJyQBEjwFu", "postedAt": "2015-01-05T00:26:22.949Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Or perhaps uncertainty to the size of the universe might lead to similar worries, if we merely know it is finite, but do not have a bound.</p>\n", "parentCommentId": "ALenm854Dd2jJ7cDR", "user": {"username": "Larks"}}, {"_id": "FD25hf9CWHHQpXsxF", "postedAt": "2015-01-05T00:53:29.249Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Putting to one side my bias towards aggregative consequentialism, someone has to say that to anyone except a radical consequentialist, the classic 'hope physics is broken' example does make you seem crazy and consequentialism seem wrong! :p</p>\n", "parentCommentId": "ALenm854Dd2jJ7cDR", "user": {"username": "RyanCarey"}}, {"_id": "EAvHR5jjsm3nWG9Gv", "postedAt": "2015-01-05T07:25:00.317Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Some kind of nitpicky comments:</p>\n<p>3.2: Note that the definition of intergenerational equity in Zame's paper is what you call finite intergenerational equity (and his definition of an ethical preference relation involves the same difference), so his results are actually more general than what you have here. Also, I don't think that &quot;almost always we can’t tell which of two populations is better&quot; is an accurate plain-English translation of &quot;{X,Y: neither XY} has outer measure one&quot;, because we don't know anything about the inner measure. In fact, if the preference relation respects the weak Pareto ordering, then {X,Y: neither XY} has inner measure 0. So an ethical preference relation must be so wildly nonmeasurable that nothing at all can be said about the frequency with which we can't tell which of two populations is better.</p>\n<p>4.1:</p>\n<blockquote>\n<p>Partial translation scale invariance: suppose after some time T, X and Y become the same. Then we can add any arbitrary utility vector A to both X and Y without changing the ordering. (I.e. X &gt; Y iff X+A &gt; Y+A)</p>\n</blockquote>\n<p>X+A and Y+A won't necessarily be valid utility vectors. I assume you also want to add the condition that they are.</p>\n<p>4.3: What does &quot;truncated at time T&quot; mean? All utilities after time T replaced with some default value like 0?</p>\n<p>4.5:</p>\n<blockquote>\n<p>Weak sensitivity: for any utility vector, we can modify its first generation somehow to make it better</p>\n</blockquote>\n<p>Since you defined utilities as being in the closed interval [0,1], if you have a utility vector starting with 1, you can't get anything better just by modifying the first generation, so weak sensitivity should never hold in any sensible preference relation. I'm guessing you mean that we can modify its first generation to make it either better or worse (not necessarily both, unless you switch to open-interval-valued utilities).</p>\n<p>4.7: Your definition of dictatorship of the present naively sounded to me like it's saying &quot;there's some time T after which changing utilities of generations cannot affect the ordering of any pairs of utility vectors.&quot; But from theorem 4.8, I take it you actually meant &quot;for any pair of utility vectors X and Y such that X&lt;Y, there exists a time T such that changing utilities of generations after T cannot reverse the preference to get X&gt;=Y.&quot;</p>\n", "parentCommentId": null, "user": {"username": "AlexMennen"}}, {"_id": "kepZBwufQafo9nEEy", "postedAt": "2015-01-13T01:21:39.445Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thanks!</p>\n<p>3.2 good catch – I knew I was gonna mess those up for some paper. I'm not sure how to talk about the measurability result though; any thoughts on how to translate it?</p>\n<p>4.3 basically, yeah. It's easier for me to think about it just as a truncation though</p>\n<p>4.5 yes you're right – updated</p>\n<p>4.7 yes, that's what I mean. Introducing quantifiers seems to make things a lot more complicated though</p>\n", "parentCommentId": "EAvHR5jjsm3nWG9Gv", "user": {"username": "Ben_West"}}, {"_id": "27efzXAuF8PXQdo9f", "postedAt": "2015-01-13T22:11:56.714Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I am curious about your definitions: intergenerational equity and finite  intergenerational equity. I am aware of that some literature suggests that finite permutations are not enough to ensure equity among an infinite number of generations. The quality of the argumentation in this literature is often not so good. Do you have a reference that gives a convincing argument for why your notion of intergenerational equity is appropriate and/or desirable? I hope this does not sound like I am questioning whether your definition is consistent with the literature: I am only asking out of interest. </p>\n", "parentCommentId": null, "user": {"username": "Lawrence"}}, {"_id": "zebZahx5fW3Sd7Zcu", "postedAt": "2015-01-17T07:51:39.741Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>I'm not sure how to talk about the measurability result though; any thoughts on how to translate it?</p>\n</blockquote>\n<p>Unfortunately, I can't think of a nice ordinary-language way of talking about such nonmeasurability results.</p>\n", "parentCommentId": "kepZBwufQafo9nEEy", "user": {"username": "AlexMennen"}}, {"_id": "MxQYGDWrt25SFApMM", "postedAt": "2015-01-18T02:42:09.165Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Good question. It's easiest to imagine the one-dimensional spatial case like (...,L2, L1, me, R1, R2, ...) where {Li} are people to my left and {Ri} are those to my right. If I turn 180° this permutes the vector to (..., R1, me, L1, ...) Which is obviously an infinite number of permutations, but seems morally unobjectionable.</p>\n", "parentCommentId": "27efzXAuF8PXQdo9f", "user": {"username": "Ben_West"}}, {"_id": "BqQ89dsaPKLaB9uEM", "postedAt": "2015-01-18T20:17:29.784Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thank you for the example. I have two initial comments and possibly more if you are interested. 1. In all of the literature on the problem, the sequences that we compare specify social states. When we compare x=(x_1,x_2,...) and y=(y_1,y_2,...) (or, as in your example, x=(....,x_0,x_1,x_2,...) and y=(...,y_0,y_1,y_2,...)), we are doing it with the interpretation x_t and y_t give the utility of the same individual/generation in the two possible social states. For the two sequences in your example, it does not seem to be the case that x_t and y_t give the utility of the same individual in two possible states. Rather, it seems that we are re-indexing the individuals.  2. I agree that moral preferences should generally be invariant to re-indexing, at least in a spatial context (as opposed to an intertermporal context). Let us therefore modify your example so that we have specified utilities x_t,y_t, where t ranges over the integers and x_t and y_t represent the utilities of people located at positions on a doubly infinite line. Now I agree that an ethical preference relation should be invariant under some (and possibly all) infinite permutations IF the permutation is performed to both sequences. But it is hard to give an argument for why we should have invariance under general permutations of only one stream.</p>\n<p>The example is still unsatisfactory for two reasons. (i) since we are talking about intergenerational equity, the t in x_t should be time, not points in space where individuals live at the same time: it is not clear that the two cases are equivalent. (They may in fact be very different.) (ii) in almost all of the literature (in particular, in all three references in the original post), we consider one-sided sequences, indexed by time starting today and to the infinite future. Are you aware of example in this context?</p>\n", "parentCommentId": "MxQYGDWrt25SFApMM", "user": {"username": "Lawrence"}}, {"_id": "5YhcpYKhACt2ZPQZq", "postedAt": "2015-01-20T16:01:01.940Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thank you for the thoughtful comment.</p>\n<blockquote>\n<p>For the two sequences in your example, it does not seem to be the case that xt and yt give the utility of the same individual in two possible states. Rather, it seems that we are re-indexing the individuals.</p>\n</blockquote>\n<p>This is true. I think an important unstated assumption is that you only need to know that <em>someone</em> has utility x, and you shouldn't care who that person is.</p>\n<blockquote>\n<p>Now I agree that an ethical preference relation should be invariant under some (and possibly all) infinite permutations IF the permutation is performed to both sequences. But it is hard to give an argument for why we should have invariance under general permutations of only one stream.</p>\n</blockquote>\n<p>I'm not sure what the two sequences you are referring to are. Anonymity constraints simply say that if y is a permutation of x, then x~y.</p>\n<blockquote>\n<p>in almost all of the literature (in particular, in all three references in the original post), we consider one-sided sequences, indexed by time starting today and to the infinite future. Are you aware of example in this context?</p>\n</blockquote>\n<p>It is a true and insightful remark that whether we consider vectors to be infinite or doubly infinite makes a difference.</p>\n<p>To my mind, the use of vectors is misleading. What it means to not care about temporal location is really just that you treat populations as sets (not vectors) and so anonymity assumptions aren't really required.</p>\n<p>I guess you could phrase that another way and say that if you don't believe in infinite anonymity, then you believe that temporal location matters. This disagrees with general utilitarian beliefs. Nick Bostrom talks about this more in section 2.2 of his paper linked above.</p>\n<p>A more mathy way that's helpful for me is to just remember that the relation should be continuous. Say s_n(x) is a permutation of _n_ components. By finite anonymity we have that x~s_n(x) for any finite n. If lim {n -&gt; infinity} s_n = y, yet y was morally different from x, the relation is discontinuous and this would be a very odd result.</p>\n", "parentCommentId": "BqQ89dsaPKLaB9uEM", "user": {"username": "Ben_West"}}, {"_id": "26G6XgwsH74smS2sy", "postedAt": "2015-01-20T20:59:31.187Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I would not only say that &quot;that you only need to know that someone has utility x, and you shouldn't care who that person is&quot; is an unstated assumption. I would say that it is the very idea that anonymity intends to formalize. The question that I had and still have is whether you know of any arguments for why infinite anonymity is suitable to operationalize this idea. </p>\n<p>Regarding the use of sequences: you can't just look at sets. If you do, all nontrivial examples with utilities that are either 0 or 1 become equivalent. You don't have to use sequences, but you need (in the notation of Vallentyne and Kagan (1997)), a set of &quot;locations&quot;, a set of real numbers where utility takes values, and a map from the location set to the utility set.</p>\n<p>Regarding permutations of one or two sequences. One form of anonymity says that x ~ y if there is a permutation,  say pi,  (in some specified class) that takes x to y. Another (sometimes called relative anonymity) says that if x is at least as good as y, then pi(x) is at least as good as pi(y). These two notions of anonymity are not generally the same. There are certainly settings where the fullblown version of the relative anonymity becomes a basic rationality requirement. This would be the case with people lined up on an infinite line (at the same point in time). But it is not hard to see its inappropropriateness in the intertemporal context: you would have to rank the following two sequences (periodic with period 1000) to be equivalent or non-comparable</p>\n<p>x=(1,1,....,1,0,1,1,...,1,0,1,1,...,1,......)\ny=(0,0,....,0,1,0,0,...,0,1,0,0,...,0,......)</p>\n<p>This connects to whether denying infinite anonymity implies that &quot;temporal location matters&quot;. If x and y above are two possible futures for the same infinite-horizon society, then I think that any utilitarian should be able to rank x above y without having to be critisized for caring about temporal location. Do you agree? For those who do not, equity in the intertemporal setting is the same thing as equity in the spatial (fixed time) setting. What those people say is essentially that intergenerational equity is a trivial concept: that there is nothing special about time. </p>\n<p>If you do not think that the sequences x and y above should be equivalent in the intergenerational context then I would be very interested to see another example of sequences (or whatever you replace them with) that are infinite permutations of each other, but not finite permutations of each other, and where you do think that equivalence should. </p>\n<p>P.S</p>\n<p>Regarding continuity arguments, I assume that the usefulness of such arguments depends on whether you can justify your notion of continuity by ethical principles rather than that they appear in the mathematical literature. Take x(n)=(0,0,....,1,0,0,...) with a 1 in the n:the coordinate. For every n we want x(n) to be equivalent to (1,0,0,....). In many topologies x(n) goes to (0,0,0,....), which would then give that (0,0,...) is just as good as (1,0,0,....).</p>\n", "parentCommentId": "5YhcpYKhACt2ZPQZq", "user": {"username": "Lawrence"}}, {"_id": "crMunzTjoWZFa7Src", "postedAt": "2015-02-05T14:50:25.841Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>The question that I had and still have is whether you know of any arguments for why infinite anonymity is suitable to operationalize this idea.</p>\n</blockquote>\n<p>Maybe I am missing something, but it seems obvious to me. Here is my thought process; perhaps you can tell me what I am overlooking.</p>\n<p>For simplicity, say that A is the assumption that we shouldn't care who people are, and IA is the infinite anonymity assumption. We wish to show A  IA.</p>\n<ol>\n<li>Suppose A. Observe that any permutation of people can't change the outcome, because it's not changing any information which is relevant to the decision (as per assumption A). Thus we have IA.</li>\n<li>Suppose IA. Observe that it's impossible to care about who people are, because by assumption they are all considered equal. Thus we have A.</li>\n<li>Hence A  IA.</li>\n</ol>\n<p>These seems so obviously similar in my mind that my &quot;proof&quot; isn't very insightful… But maybe you can point out to me where I am going wrong.</p>\n<blockquote>\n<p>One form of anonymity says that x ~ y if there is a permutation, say pi, (in some specified class) that takes x to y. Another (sometimes called relative anonymity) says that if x is at least as good as y, then pi(x) is at least as good as pi(y). These two notions of anonymity are not generally the same.</p>\n</blockquote>\n<p>I hadn't heard about this – thanks! Do you have a source? Google scholar didn't find much.</p>\n<p>In your above example is the pi in pi(X) the same as the pi in pi(y)? I guess it must be because otherwise these two types of anonymity wouldn't be different, but that seems weird to me.</p>\n<blockquote>\n<p>If x and y above are two possible futures for the same infinite-horizon society, then I think that any utilitarian should be able to rank x above y without having to be critisized for caring about temporal location. Do you agree?</p>\n</blockquote>\n<p>I certainly understand the intuition, but I'm not sure I fully agree with it. The reason I think that x better than y is because it seems to me that x is a Pareto improvement. But it's really not – there is no generation in x who is better off than another generation in y (under a suitable relabeling of the generations). </p>\n<blockquote>\n<p>I would be very interested to see another example of sequences (or whatever you replace them with) that are infinite permutations of each other, but not finite permutations of each other, and where you do think that equivalence should.</p>\n</blockquote>\n<p>(0,1,0,1,0,1,...) and (1,0,1,0,1,0,...) come to mind.</p>\n", "parentCommentId": "26G6XgwsH74smS2sy", "user": {"username": "Ben_West"}}, {"_id": "73GtqpGukBzCiCx83", "postedAt": "2015-02-07T21:03:44.173Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>The problem in your argument is the sentence &quot;...any permutation of people can't change the outcome...&quot;. For example: what does &quot;any permutation&quot; mean? Should the stream be applied to both sequences? In a finite context, these questions would not matter. In the infinite-horizon context, you can make mistakes if you are not careful. People who write on the subject do make mistakes all the time. To illustrate, let us say that I think that a suitable notion of anonymity is FA: for any two people p1 and p2, p1's utility is worth just as much as p2's. Then I can &quot;prove&quot; that A  FA by your method. The A -&gt; FA direction is the same.  For FA -&gt; A, observe that if for any two people p1 and p2, p1's utility is worth just as much as p2's, then it is not possible to care about who people are. </p>\n<p>This &quot;proof&quot; was not meant to illustrate anything besides the fact that if we are not careful, we will be wasting our time.</p>\n<p>I did not get a clear answer to my question regarding the two (intergenerational) streams with period 1000: x=(1,1,...,1,0,1,1,,...) and y=(0,0,...,0,1,0,0,,...). Here x does not Pareto-dominate y.</p>\n<p>Regarding (0,1,0,...) and (0,1,0,...): I am familiar with this example from some of the literature. Recall in the first post that I wrote that the argumentation in much of the literature is not so good? This is the literature that I meant. I was hoping for more. </p>\n", "parentCommentId": "crMunzTjoWZFa7Src", "user": {"username": "Lawrence"}}, {"_id": "bAkMCpPb3x4Pj5nZs", "postedAt": "2015-02-08T09:28:31.561Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I forgot the reference for relative anonymity: See the paper by Asheim, d'Aspremont and Banerjee (J. Math. Econ., 2010) and its references.</p>\n", "parentCommentId": "73GtqpGukBzCiCx83", "user": {"username": "Lawrence"}}, {"_id": "RSQarMYWToYA29Y4y", "postedAt": "2015-02-10T20:04:42.766Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Fair enough. Let me phrase it this way: suppose you were blinded to the location of people in time. Do you agree that infinite anonymity would hold?</p>\n", "parentCommentId": "73GtqpGukBzCiCx83", "user": {"username": "Ben_West"}}, {"_id": "SR6kEApP3TvvtEtaH", "postedAt": "2015-02-10T20:47:11.478Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>By the way, one version of what you might be saying is: &quot;both infinite anonymity and the overtaking criterion seem like reasonable conditions. But it turns out that they conflict, and the overtaking criterion seems more reasonable, so we should drop infinite anonymity.&quot; I would agree with that sentiment.</p>\n", "parentCommentId": "RSQarMYWToYA29Y4y", "user": {"username": "Ben_West"}}, {"_id": "Sy7TwEWm3YL43xHv6", "postedAt": "2015-02-11T10:19:43.974Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Forget overtaking. Infinite anonymity (in its strongest form – the one you called intergenerational equity) is incompatible with the following requirement: if everyone is better off in state x=(x_1,x_2,..)  than in state y=(y_1,y_2,..), then x is better than y.  See e.g. the paper by Fleurbaey and Michel (2003). </p>\n", "parentCommentId": "SR6kEApP3TvvtEtaH", "user": {"username": "Lawrence"}}, {"_id": "5Wrf57n5XLQ6pe8sm", "postedAt": "2015-02-11T10:21:06.569Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I will try to make the question more specific and then answer it. Suppose you are given two sequences x=(x_1,x_2,…) and y=(y_1,y_2,…) and that you are told that x_t is not necessarily the utility of generation t, but that it could be the utility of some other generation. Should your judgements then be invariant under infinite permutations? Well, it depends. Suppose I know that x_t and y_t is the utility of the same generation – but not necessarily of generation t. Then I would still say that x is better than y if x_t&gt;y_t for every t. Infinite anonymity in its strongest form (the one you called intergenerational equity) does not allow you to make such judgements. (See my response to your second question below.) In this case I would agree to the strongest form of relative anonymity however. If I do not know that x_t and y_t give the utility of the same generation, then I would agree to infinite anonymity. So the answer is that sure, as you change the structure of the problem, different invariance conditions will become appropriate. </p>\n", "parentCommentId": "RSQarMYWToYA29Y4y", "user": {"username": "Lawrence"}}, {"_id": "yLPHGPTHpmaSWSXHZ", "postedAt": "2015-02-22T14:44:16.353Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thank you for the clarification and references – it took me a few days to read and understand those papers.</p>\n<p>I don't think there are any strong ways in which we disagree. Prima facie, prioritizing the lives of older (or younger) people seems wrong, so statements like &quot;I know that xt and yt is the utility of the same generation&quot; don't seem like they should influence your value judgments. However, lots of bizarre things occur if we act that way, so in reflective equilibrium we may wish to prioritize the lives of older people.</p>\n", "parentCommentId": "5Wrf57n5XLQ6pe8sm", "user": {"username": "Ben_West"}}, {"_id": "SifwkWXRBfSENt2Nw", "postedAt": "2015-02-23T10:47:16.464Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Wait a minute. Why should knowing that x_t and y_t are the utility of the same generation (in two different social states) not influence value judgements? There is certainly not anything unethical about that, and this is true also in a finite context. Let us say that society consists of three agents. Say that you are not necessarily a utilitarian and that you are given a choice between x=(1,3,4) and y=(0,2,3). You could say that x is better than y since all three members of society prefers state x to state y. But this assumes that you know that x_t and y_t give the utility of the same agent in the two states. If you did not know this, then things would be quite different. Do you see what I mean?</p>\n", "parentCommentId": "yLPHGPTHpmaSWSXHZ", "user": {"username": "Lawrence"}}, {"_id": "6qtiZ8dEmpcAnKZBX", "postedAt": "2015-02-26T20:01:45.791Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote>\n<p>But this assumes that you know that xt and yt give the utility of the same agent in the two states. If you did not know this, then things would be quite different</p>\n</blockquote>\n<p>No, you would know that there is a permutation of x which Pareto dominates y. This is enough for you to say that x&gt;y.</p>\n<p>I understand and accept your point though that people are not in practice selfless, and so if people wonder not &quot;will someone be better off&quot; but &quot;will <em>I specifically</em> be better off&quot; then (obviously) you can't have anonymity.</p>\n", "parentCommentId": "SifwkWXRBfSENt2Nw", "user": {"username": "Ben_West"}}, {"_id": "QoiANNHhENfi8CtJC", "postedAt": "2015-02-26T22:43:14.498Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Things would not be all that different with three agents. Sorry. But let me ask you: when you apply Suppes' grading principle to infer that e.g. x=(1,3,4) is better than y=(2,0,3) since there is a permutation of x' of x with x'&gt;y, would you not say that you are relying on the idea that everyone is better off to conclude that x' is better than y? I agree of course that criteria that depend on which state a specific person prefers are bad, and they cannot give us anonymity.  </p>\n", "parentCommentId": "6qtiZ8dEmpcAnKZBX", "user": {"username": "Lawrence"}}, {"_id": "8GTDr6xPa8gHJvWkm", "postedAt": "2015-03-10T13:18:29.160Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thanks Lawrence, this is a good point.</p>\n<p>I agree that the immediate justification for the principle is &quot;everyone is better off&quot;, but as you correctly point out that implies knowing &quot;identifying&quot; information.</p>\n<p>It is hard for me to justify this on consequentialist grounds though. Do you know of any justifications? Probably most consequentialist would just say that it increases total and average utility and leave it at that.</p>\n", "parentCommentId": "QoiANNHhENfi8CtJC", "user": {"username": "Ben_West"}}, {"_id": "qshQ4B5qBPmJ5McJc", "postedAt": "2015-03-15T21:46:04.329Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>I am not sure what you mean by consequentialist grounds. Feel free to expand if you can.</p>\n<p>I am actually writing something on the topic that we have been discussing. If you are interested I can send it to you when it is submittable. (This may take several months.) </p>\n", "parentCommentId": "8GTDr6xPa8gHJvWkm", "user": {"username": "Lawrence"}}, {"_id": "qn6gRP4KkzKYFDaXi", "postedAt": "2015-03-20T13:17:58.904Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Good question; now that I try to explain it I think my definition of &quot;consequentialist&quot; was poorly defined.</p>\n<p>I have changed my mind and agree with you – the argument for finite anonymity is weaker than I thought. Good to know!</p>\n<p>I would be interested to hear your insights on these difficult problems, if you feel like sharing.</p>\n", "parentCommentId": "qshQ4B5qBPmJ5McJc", "user": {"username": "Ben_West"}}, {"_id": "DX7LzWevqowb4Q6Rq", "postedAt": "2016-08-29T23:34:58.700Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>This is really interesting stuff, and thanks for the references.</p>\n<h2>A few comments:</h2>\n<p>It'd be nice to clarify what:\n&quot;finite intergenerational equity over [0,1]^N&quot; \nmeans (specifically, the &quot;over [0,1]^N&quot; bit).</p>\n<p>Why isn't the sequence 1,1,1,... a counter-example to Thm4.8 (dictatorship of the present)?  I'm imagining exponential discounting, e.g. of 1/2 so the welfare function of this should return 2 (but a different number if u_t is changed, for any t).</p>\n", "parentCommentId": null, "user": {"username": "capybaralet"}}, {"_id": "vnSfA6fpN4GEfHhxQ", "postedAt": "2016-08-30T20:09:55.307Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>Thanks for the comments!</p>\n<p>Regarding your second question: the idea is that if x is better than y, then there is a point in time after which improvements to y, no matter how great, will never make y better than x.</p>\n<p>So in your example where there is a constant discount rate of one half: (1, 1, 1, (something)) will always be preferred to (0, 0, 0, (something else)), no matter what we put in for (something) and (something else). In this sense, the first three generations &quot;dictate&quot; the utility function.</p>\n<p>As you point out, there is no single time at which dictatorship kicks in, it will depend on the two vectors you are comparing and the discount rate.</p>\n", "parentCommentId": "DX7LzWevqowb4Q6Rq", "user": {"username": "Ben_West"}}, {"_id": "87kvnMafK3KxaAAHs", "postedAt": "2018-08-24T14:33:33.745Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>These issues are relevant for any ethical system that assigns non-zero weight to the consequences.</p>\n", "parentCommentId": "dSHaNxPDMA6fk7hTY", "user": {"username": "casebash"}}, {"_id": "zPCfDhKxoGtqKfp8S", "postedAt": "2021-05-06T03:23:40.193Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<p>The blog post links \"Ridiculous math things which ethics shouldn't depend on but does\" and \"Kill the young people\" are dead. You can find archived versions of the posts at the following links:</p>\n<ul>\n<li><a href=\"https://web.archive.org/web/20200630023504/http://philosophyforprogrammers.blogspot.com/2014/09/ridiculous-math-shit-which-ethics.html\">https://web.archive.org/web/20200630023504/http://philosophyforprogrammers.blogspot.com/2014/09/ridiculous-math-shit-which-ethics.html</a></li>\n<li><a href=\"https://web.archive.org/web/20190429032659/http://philosophyforprogrammers.blogspot.com/2012/11/why-old-people-matter-more.html\">https://web.archive.org/web/20190429032659/http://philosophyforprogrammers.blogspot.com/2012/11/why-old-people-matter-more.html</a></li>\n</ul>\n", "parentCommentId": null, "user": {"username": "michaelchen"}}, {"_id": "FnBR2q5FoiPCxT3ge", "postedAt": "2021-10-01T06:15:17.558Z", "postId": "9D6zKRPfaALiBhnnN", "htmlBody": "<blockquote><p>(Of course, finite changes in utility still won't matter.)</p></blockquote><p>The discounted utilitarianism term should still be sensitive to those, at least enough to break ties. Discounted utilitarianism satisfies strong Pareto, after all.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}]