[{"_id": "sxskTFN4AbpJeCH4L", "postedAt": "2023-09-14T07:34:39.532Z", "postId": "9ddheDChiMhveCfSw", "htmlBody": "<p>Thanks for sharing this and congrats on a very longstanding research effort!</p>\n<p>Are you able to provide more details on the backgrounds of the “biorisk experts”? For example, the kinds of organisations they work for, their seniority (eg years of professional experience), or their prior engagement with global catastrophic biological risks specifically (as opposed to pandemic preparedness or biorisk management more broadly).</p>\n<p>I ask because I’m wondering about potential selection effects with respect to level of concern about catastrophe/extinction from biology. Without knowing your sampling method, I could imagine that you could potentially disproportionately have reached people who worry more about catastrophic and extinction risks than the typical “biorisk expert.”</p>\n", "parentCommentId": null, "user": {"username": "jtm"}}, {"_id": "D4udZvFbvaKCH7bBu", "postedAt": "2023-09-18T19:45:32.196Z", "postId": "9ddheDChiMhveCfSw", "htmlBody": "<p>Hi Joshua!</p><p>Thanks for the kind words and for this question. For confidentiality reasons, the team can’t provide details of the institutions and roles of XPT participants. However, because several of our recruitment channels were EA-adjacent or directly related to existential risks (e.g. we recruited some experts via a post on the EA Forum and reached out to some organizations working on x-risks), our prior is that the XPT biorisk experts are more concerned about catastrophic and existential risks than would, say, a sample of attendees at the <a href=\"https://www.ghsconf.com/\">Global Health Security Conference</a>. So, you’re right that it shouldn’t be taken as representative sample of biosecurity or biorisk experts. It is also unclear to us what that sampling frame would look like, in general. I can see this wasn’t clear in the post, so I’ve edited/added some text to the ‘Participants’ and concluding sections in the post.<br>&nbsp;</p><p>Edits (bold is new text):</p><ul><li>Participants section:<br>\"Experts were recruited through advertising and outreach to <s>relevant organizations </s><strong>organizations working on existential risk, and relevant academic departments and research labs.</strong> … <strong>As this study partially recruited experts based on the study of existential and catastrophic risks, this participant group shouldn’t be taken as a representative sample of people who may be considered biorisk experts.\"</strong></li><li>Concluding section:<br>\"It’s also worth noting that for some questions, there were only a small number of expert respondents, and even the full group of biorisk experts <s>may not</s> <strong>is unlikely to </strong>be representative of the field<strong>, given we aimed to recruit some experts with an interest in existential risk</strong>.\"</li></ul>", "parentCommentId": "sxskTFN4AbpJeCH4L", "user": {"username": "Bridget_Williams"}}]