[{"_id": "Mk9yEz94m9tc5LmG2", "postedAt": "2022-12-15T19:14:22.364Z", "postId": "9DqD6zMKajKAHAE4o", "htmlBody": "<p>An intro-to-EA comic would be a lot of fun to see! &nbsp;There is some good introductory material out there on websites like <a href=\"https://80000hours.org/key-ideas/\">80,000 Hours</a>, or <a href=\"https://www.effectivealtruism.org/articles/introduction-to-effective-altruism\">the main \"effectivealtruism.org\" homepage</a>. &nbsp;I think the biggest challenge for a comic would be finding good concrete images and stories with which to illustrate the abstract concepts of Effective Altruism.<br><br>To that end, I would love to see a series of short comics that mixed together:</p><ul><li>individual EA concepts, like from each section of <a href=\"https://www.effectivealtruism.org/articles/introduction-to-effective-altruism\">effectivealtruism.org's introduction</a></li><li>some engaging graphs, maps, and etc data visualisation, maybe <a href=\"https://ourworldindata.org/war-and-peace\">taking inspiration from the work of OurWorldInData</a></li><li>a few concrete stories of people who worked to make things better -- like Norman Borlaug's contributions to the \"green revolution\", or the campaign to eradicate smallpox stretching from <a href=\"https://en.wikipedia.org/wiki/Edward_Jenner\">the invention of vaccines in the 1700s</a> to the final push for eradication as organized by <a href=\"https://en.wikipedia.org/wiki/Viktor_Zhdanov\">Victor Zhdanov</a>. &nbsp;This fancy <a href=\"https://www.youtube.com/watch?v=IV3dnLzthDA\">video</a> about the unintended disaster caused by the invention of leaded gasoline and chlorofluorocarbons kinda has the tone I am thinking of, using an interesting personal story as a way to talk about environmental issues and EA-adjacent ideas.</li></ul><p>For instance, there is probably a great comic that could be written about existential risk and nuclear war -- outlining a history of the cold war through some of the individual stories <a href=\"https://asteriskmag.com/issues/1/the-illogic-of-nuclear-escalation\">mentioned in this article</a>, plus famous close-calls like the cuban missile crisis, sprinkling in some <a href=\"https://ourworldindata.org/nuclear-weapons\">graphs and maps</a> where appropriate, and using all that to support an overall message about the importance of protecting humanity's long-term future.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "RGGrjtdnzAT9yxMbk", "postedAt": "2022-12-15T19:21:25.537Z", "postId": "9DqD6zMKajKAHAE4o", "htmlBody": "<p>For some more inspiration, you can peruse the Forum's <a href=\"https://forum.effectivealtruism.org/topics/effective-altruism-art-and-fiction\">\"Effective Altruism Art &amp; Fiction\" tag</a>, or you can check out some <a href=\"https://forum.effectivealtruism.org/posts/7Qup3sdLtXzfzurEK/what-videos-should-rational-animations-make?commentId=Axee8jq5TanSREM2f\">previous comments of mine on similar topics</a>.</p>", "parentCommentId": "Mk9yEz94m9tc5LmG2", "user": {"username": "Jackson Wagner"}}]