[{"_id": "thZkBLbZXRP8JEEbT", "postedAt": "2023-03-26T01:24:19.588Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>Would you be able to please include my startup Preamble, Inc. as a service provider in the tech category? &nbsp; https://preamble.com<br><br>Thank you for organizing all these resources in a way that makes them easy to find. &nbsp;This is pretty valuable for the community!<br><br>You also might want to partner with a project which is related to your called AVID, which is the AI Vulnerabilities Database.<br>https://avidml.org/</p>", "parentCommentId": null, "user": {"username": "JonCefalu"}}, {"_id": "nwHHhzkEar7iQAvAS", "postedAt": "2023-03-26T07:46:09.339Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>Could you expand a bit on \"software implementation\" being a missing service? At first glance I would've thought the Altruistic Agency would provide that, am I mistaken?</p>", "parentCommentId": null, "user": {"username": "Jonny Spicer"}}, {"_id": "PNMHYJNunmjTuABZt", "postedAt": "2023-03-26T12:51:01.574Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>I'm a little confused about what \"too little demand\" means in the second paragraph. Both of the below seem like they might be the thing you are claiming:</p>\n<ul>\n<li>There is not yet enough demand for a business only serving EA orgs to be self sustaining.</li>\n<li>EA orgs are making a mistake by not wanting to pay for these things even though they would be worth paying for.</li>\n</ul>\n<p>I'd separately be curious to see more detail on why your guess at the optimal structure for the provision of the kind of services you are interested in is \"EA-specific provider\". I'm not confident that it's not, but my low confidence guess would be that \"EA orgs\" are not similar enough that \"context on how to with with EA orgs\" becomes a hugely important factor.</p>\n", "parentCommentId": null, "user": {"username": "alexrjl"}}, {"_id": "kd8YYprYemR7sn3ag", "postedAt": "2023-03-26T13:28:33.925Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>How did you identify \"services that there is a high demand for but not enough supply\"? Is it simply based on the \"quick look\" you did, or is there some other evidence?&nbsp;</p><p>The absence of EA services could simply be evidence of sufficient non-EA services, in which case it's probably worth thinking about the pros and cons of having EA services.&nbsp;</p><p>The most obvious justification seems to be to keep money in the community, and/or to provide services at a relative discount.&nbsp;</p><p>However, by relying on EA services there is a risk of missing out on the highest quality services that already exist: I can't think of any particular reason why EAs would necessarily be better than the rest of the world at providing finance, legal, or tech services. Though perhaps in many cases this doesn't matter - maybe EA orgs merely need 'adequate' rather than 'best'.</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "4p7EL5nLJep3rHvwh", "postedAt": "2023-03-27T01:15:13.355Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>It's based on our collective experiences working with EA orgs. We all interact with a large volume of EA orgs, and we keep getting similar questions for providers in certain areas.<br><br>And to your point, I personally refer in non-EA specialists as needed, but I would prefer to use EA folks (if they exist) to strengthen the business support services in the community. And some services are better provided when the provider is at least familiar with EA. All the people I bring in get a short introduction of what to expect before they start with EAs. Believe it or not, EA orgs have a VERY different mentality than most other organizations out there and it can be challenging for providers to understand and navigate if they don't have prior exposure.<br><br>Another reason why we are focusing on EAs now is that we're building a directory of EA service providers, so we're just noting the gaps that exist within EA. Part of the goal is that anyone who needs help with something has an easily accessible resource to find access to trusted advisors and partners. So it's not that someone outside of EA provides \"worse\" software implementation than someone within EA - it's just noticing that our community doesn't have that resource available now. And potentially, it might be that none of us are aware of a provider that does that, in which case, we'd like to know about it.</p>", "parentCommentId": "kd8YYprYemR7sn3ag", "user": {"username": "Deena Englander"}}, {"_id": "fDYyyFm8deyujuWHR", "postedAt": "2023-03-27T01:17:16.177Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>It's your second point that we're addressing-</p><ul><li>EA orgs are making a mistake by not wanting to pay for these things even though they would be worth paying for.</li></ul><p>Although your first point is also true. I don't think that's a problem, though. Most businesses have diverse audiences and I don't think EA is large enough to support most business models independently.</p>", "parentCommentId": "PNMHYJNunmjTuABZt", "user": {"username": "Deena Englander"}}, {"_id": "D9MCACHXcAGPCKed8", "postedAt": "2023-03-27T01:21:16.905Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>There are lots of software needs and types of service providers that are needed. Anti Entropy also provides great support in addition to Altruistic Agency. But right now, if I need Salesforce or Smartsheets or Dynamics setup, those usually have specific consultants. Or sometimes we need larger-system research and implementation plans, and that's not something we currently have a resource for in EA. I do have good resources out of EA.</p>", "parentCommentId": "nwHHhzkEar7iQAvAS", "user": {"username": "Deena Englander"}}, {"_id": "vLMudYRGFG6vbgmh2", "postedAt": "2023-03-27T01:22:31.800Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>Please submit an application to be added <a href=\"https://forms.gle/oV23T92Qu9uDwK1c7\">here</a>.</p>", "parentCommentId": "thZkBLbZXRP8JEEbT", "user": {"username": "Deena Englander"}}, {"_id": "6na5QBjGdMnxTNvzf", "postedAt": "2023-03-27T18:24:49.099Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>Thanks for the reply! I agree having a directory seems potentially useful, and also that there could plausibly be some cases where having familiarity with EA could be particularly beneficial. Hopefully you're documenting such cases and can point to examples. I'm just a bit wary that sometimes there seems to be a reluctance to use outside experts.</p>", "parentCommentId": "4p7EL5nLJep3rHvwh", "user": {"username": "Matt_Sharp"}}, {"_id": "aAEJrJaCfu8bbdep8", "postedAt": "2023-03-27T19:27:53.837Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>I totally agree with you.<br>The other problem with outside experts is the same that anyone faces - who do I use? Which company is good? Pre-covid, I had been working on a problem in the small business community that created something very similar because of the hesitancy of humans to trust, especially when a lot of providers aren't as good as they claim to be. So I do think there's a trust factor that's important regardless, and if we don't have the talent in EA, I would consider bringing people out of EA into the community to fill those gaps.</p>", "parentCommentId": "6na5QBjGdMnxTNvzf", "user": {"username": "Deena Englander"}}, {"_id": "f9Ddzxe8xShEpDZHZ", "postedAt": "2023-03-27T22:48:31.018Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<blockquote>\n<p>Finance: everything from bookkeeping to outsourced CFOs\nLegal: contracts, employment, compliance\nTech: software implementation, Salesforce etc</p>\n</blockquote>\n<p>Why would it make sense for there to be EA-specific services for these? All of these services seem like things you can outsource to non-EA firms just fine and benefit little to none from EA knowledge/affiliation/alignment.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "mvHKwXAxz35segzpf", "postedAt": "2023-03-28T20:18:59.017Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>It's not a necessity to have these within EA. It is a necessity to have good resources. There are also some cases, such as with finances and legal matters, that having a specialized service provider will allow more people to be helped effectively since they'll have a greater degree of familiarity and expertise with common EA org problems. And if we do have an EA that does a good job providing those services, I'd rather prioritize using those folks and if we don't know of them I'd like to.<br>In general, I'm finding that there are many similar patterns to what most EA orgs need, and the objective needs to be finding them quality resource providers and making them easily accessible.</p>", "parentCommentId": "f9Ddzxe8xShEpDZHZ", "user": {"username": "Deena Englander"}}, {"_id": "uwdZkuujTN69DmRR8", "postedAt": "2023-03-29T19:53:43.118Z", "postId": "9g6zowaT2tAKSQXw3", "htmlBody": "<p>Submitted, thank you.</p>", "parentCommentId": "vLMudYRGFG6vbgmh2", "user": {"username": "JonCefalu"}}]