[{"_id": "XNbswAnTFmmH8fd9n", "postedAt": "2022-09-13T15:07:02.518Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Minor criticism, but having the same initials as expected value might cause some confusion when people refer to expected value as EV sometimes.</p>\n<p>Obviously Effective Ventures aren’t alone in this - CEA could mean both Centre for Effective Altruism and Cost Effectiveness Analysis.</p>\n<p>And I’m not sure how feasible it is for new orgs to avoid confusion due to other abbreviations and acronyms  used in EA.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "ysY5tXqpxNq4QH8p2", "postedAt": "2022-09-13T15:14:45.612Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>They're pretty different kinds of things - an abstract concept vs an organisation - so I don't think it will cause confusion.</p>", "parentCommentId": "XNbswAnTFmmH8fd9n", "user": {"username": "Stefan_Schubert"}}, {"_id": "JqoHAkoiyzNTGpotN", "postedAt": "2022-09-13T15:40:24.814Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>I had the same thought only with Tyler Cowen's <a href=\"https://www.mercatus.org/emergent-ventures\">Emergent Ventures</a>, which is an organisation that is even fairly closely associated with EA (e.g. I personally know two EAs who are among their fellows).</p>", "parentCommentId": "ysY5tXqpxNq4QH8p2", "user": {"username": "MaxRa"}}, {"_id": "jiuLtHZPmwixiGv6o", "postedAt": "2022-09-13T21:11:32.142Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>I know a few EAs amongst their fellows as well but I have never heard Emergent Ventures referred to as EV in practice, so it seems fine to me.</p>", "parentCommentId": "JqoHAkoiyzNTGpotN", "user": {"username": "calebp"}}, {"_id": "FcjQ8nzq6BpGd3Ck8", "postedAt": "2022-09-14T07:01:45.148Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>I once met an EA (effective altruist) who worked at EA (Electronic Arts) and I asked to meet his EA (executive assistant) and it turned out they lived in EA (East Anglia) and were studying EA (enterprise architecture) but considering adding in EA (environmental assessment) &nbsp;to make it a double major, the majors cost $40k ea (each) 😉</p>", "parentCommentId": "XNbswAnTFmmH8fd9n", "user": {"username": "Luke Freeman"}}, {"_id": "Hi5qytaqjja36nuhW", "postedAt": "2022-09-14T16:14:56.165Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>I strongly agree with this comment, except that I don't think this issue is minor.</p>\n<p>IMO, this issue is related to a very troubling phenomenon that EA is seemingly undergoing in the past few years: people in EA <s>tend to</s> sometimes do not think much about their <a href=\"https://forum.effectivealtruism.org/topics/expected-value\">EV</a>, and instead strive to have as much impact as possible. \"Impact\" is a sign-neutral term (\"COVID-19 had a large impact on international travel\"). It's very concerning that many people in EA now use it interchangeably with \"EV\", as if EA interventions in anthropogenic x-risk domains cannot possibly be harmful. One can call this phenomenon \"sign neglect\".</p>\n<p>Having a major EA organization named \"EV\" (as an acronym for something that is not \"expected value\") may exacerbate this problem by further decreasing the usage of the term \"EV\", and making people use sign-neutral language instead.</p>\n", "parentCommentId": "XNbswAnTFmmH8fd9n", "user": {"username": "ofer"}}, {"_id": "AWBwemwu659HNgEFy", "postedAt": "2022-09-14T16:51:58.811Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Does EV have any current employees outside of EV Ops?&nbsp;</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "qrynYHBvhnAznJtzf", "postedAt": "2022-09-14T17:09:02.628Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>I think when people talk about impact, it's implicit that they mean positive impact. I haven't seen anything that makes me think that someone in EA doesn't care about the sign of their impact, although I'd certainly be interested in any evidence of that.</p>\n", "parentCommentId": "Hi5qytaqjja36nuhW", "user": {"username": "Isaac_Dunn"}}, {"_id": "nHJFMayh8b2TmjPAy", "postedAt": "2022-09-14T18:27:45.128Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<blockquote>\n<p>I haven’t seen anything that makes me think that someone in EA doesn’t care about the sign of their impact</p>\n</blockquote>\n<p>It's not about people not caring about the sign of their impact (~everyone in EA cares); it's about a tendency to behave in a way that is aligned with maximizing impact (rather than EV).</p>\n<blockquote>\n<p>I’d certainly be interested in any evidence of that</p>\n</blockquote>\n<p>Consider <a href=\"https://80000hours.org/podcast/episodes/sam-bankman-fried-high-risk-approach-to-crypto-and-doing-good/#transcript\">this</a> interview with one of the largest funders in EA (the following is based on the transcript from the linked page):</p>\n<blockquote>\n<p>Rob: \"What might be distinctive about your approach that will allow you to find things that all the other groups haven’t already found or are going to find?\"</p>\n</blockquote>\n<blockquote>\n<p>[...]</p>\n</blockquote>\n<blockquote>\n<p>SBF: But having gotten that out of the way, I think that being really willing to give significant amounts is a real piece of this. Being willing to give 100 million and not needing anything like certainty for that. We’re not in a position where we’re like, “If you want this level of funding, you better effectively have proof that what you’re going to do is great.” We’re happy to give a lot with not that much evidence and not that much conviction — if we think it’s, in expectation, great. Maybe it’s worth doing more research, but maybe it’s just worth going for. I think that is something where it’s a different style, it’s a different brand. And we, I think in general, are pretty comfortable going out on a limb for what seems like the right thing to do.</p>\n</blockquote>\n<p>.</p>\n<blockquote>\n<p>Rob Wiblin: OK, so with that out of the way, what’s a mistake you think at least some nontrivial fraction of people involved in effective altruism are making?</p>\n</blockquote>\n<blockquote>\n<p>[...]</p>\n</blockquote>\n<blockquote>\n<p>SBF: Then the last thing is thinking about grantmaking. This is definitely a philosophical difference that we have as a grantmaking organization. And I don’t know that we’re right on it, but I think it’s at least interesting how we think about it. Let’s say we evaluate a grant for 48 seconds. After 48 seconds, we have some probability distribution of how good it’s going to be, and it’s quite good in expected value terms. But we don’t understand it that well; there’s a lot of fundamental questions that we don’t know the answer to that would shift our view on this.</p>\n</blockquote>\n<blockquote>\n<p>Then we think about it for 33 more seconds, and we’re like, “What might this probability distribution look like after 12 more hours of thinking?” And in 98% of those cases, we would still decide to fund it, but it might look materially different. We might have material concerns if we thought about it more, but we think they probably won’t be big enough that we would decide not to fund it.</p>\n</blockquote>\n<blockquote>\n<p>Rob Wiblin: Save your time.</p>\n</blockquote>\n<blockquote>\n<p>SBF: Right. You can spend that time, do that, or you could just say, “Great, you get the grant, because we already know where this is going to end up.” But you say that knowing that there are things you don’t know and could know that might give you reservations, that might turn out to make it a mistake. But from an expected value of impact perspective —</p>\n</blockquote>\n<blockquote>\n<p>Rob Wiblin: It’s best just to go ahead.</p>\n</blockquote>\n<blockquote>\n<p>SBF: Yeah, exactly. I think that’s another example of this, where being completely comfortable doing something that in retrospect is a little embarrassing. They’ll go, “Oh geez, you guys funded that. That was obviously dumb.” I’m like, “Yeah, you know, I don’t know.” That’s OK.</p>\n</blockquote>\n<blockquote>\n<p>[...]</p>\n</blockquote>\n<blockquote>\n<p>Rob Wiblin: Yeah. It’s so easy to get stuck in that case, where you are just unwilling to do anything that might turn out to be negative.</p>\n</blockquote>\n<blockquote>\n<p>SBF: Exactly. And a lot of my response in those cases is like, “Look, I hear your concerns. I want you to tell me — in writing, right now — whether you think it is positive or negative expected value to take this action. And if you write down positive, then let’s do it. If you write down negative, then let’s talk about where that calculation’s coming from.” And maybe it will be right, but let’s at least remove the scenario where everyone agrees it’s a positive EV move, but people are concerned about some…</p>\n</blockquote>\n<p>Notably, the FTX Foundation's <a href=\"https://ftxfuturefund.org/our-regrants/\">regranting program</a> \"gave over 100 people access to discretionary budget\" (and I'm not aware of them using a reasonable mechanism to resolve the obvious <a href=\"https://forum.effectivealtruism.org/topics/unilateralist-s-curse\">unilateralist's curse</a> problem). One of the resulting grants was a $215,000 grant for creating an impact market. They <a href=\"https://ftxfuturefund.org/our-regrants/?_search=impactmarkets.io\">wrote</a>:</p>\n<blockquote>\n<p>This regrant will support the creation of an “impact market.” The hope is to improve charity fundraising by allowing profit-motivated investors to earn returns by investing in charitable projects that are eventually deemed impactful.</p>\n</blockquote>\n<p>A naive impact market is a mechanism that <a href=\"https://forum.effectivealtruism.org/posts/74rz7b8fztCsKotL6/impact-markets-may-incentivize-predictably-net-negative\">incentivizes</a> people to carry out risky projects—that might turn out to be beneficial—while regarding potential harmful outcomes as if they were neutral. (The certificates of a project that ended up being harmful are worth as much as the certificates of a project that ended up being neutral, namely nothing.)</p>\n", "parentCommentId": "qrynYHBvhnAznJtzf", "user": {"username": "ofer"}}, {"_id": "WprQZcQfLJZN9BCmQ", "postedAt": "2022-09-14T20:45:40.314Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Can someone clarify whether I'm interpreting this paragraph correctly?</p><blockquote><p><a href=\"http://ev.org/\"><u>Effective Ventures (EV)</u></a> is a federation of organisations and projects working to have a large positive impact in the world.&nbsp;EV was previously known as the Centre for Effective Altruism but the board decided to change the name to avoid confusion with the organisation within EV that goes by the same name.</p></blockquote><p>I think what this means is that the CEA board is drawing a distinction between <i>the CEA legal entity / umbrella organization</i> (which is becoming EV) and <i>the public-facing CEA brand</i> (which is staying CEA). AFAIK this change wasn't announced anywhere separately, only in passing at the beginning of this post which sounds like it's mostly intended to be about something else?</p><p>(As a minor point of feedback on why I was confused: the first sentence of the paragraph makes it sound like EV is a new organization; then the first half of the second sentence makes it sound like EV is a full rebrand of CEA; and only at the end of the paragraph does it make clear that there is intended to be a sharp distinction between CEA-the-legal-entity and CEA-the-project, which I wasn't previously aware of.)</p>", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "cJizK4RHr8iBjXgpx", "postedAt": "2022-09-14T21:33:58.854Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Yep, your interpretation is correct. We didn't want to make a big deal about this rebrand because for most people the associations they have with \"CEA\" are for the organization which is still called CEA. (But over the years, and especially as the legal entity has grown and taken on more projects, we've noticed a number of times where the ambiguity between the two has been somewhat frustrating.) Sorry for the confusion!</p>", "parentCommentId": "WprQZcQfLJZN9BCmQ", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "PTcFBjN8toPRw3izQ", "postedAt": "2022-09-16T14:31:57.515Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Technically speaking all employees of the constituent organizations are \"employees of EV\" (for one of the <a href=\"https://ev.org/charity/\">legal entities</a> that's part of EV).</p>", "parentCommentId": "AWBwemwu659HNgEFy", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "kQSpPapTaW6B9oeRh", "postedAt": "2022-09-16T16:35:26.956Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Were they wearing an Emporio Armani t-shirt, by any chance?</p>", "parentCommentId": "FcjQ8nzq6BpGd3Ck8", "user": {"username": "Tom Gardiner"}}, {"_id": "vKpKt7HnhQFMifehP", "postedAt": "2022-09-16T17:36:05.271Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Thanks for the reply!</p><p>If I understand correctly, you think that people in EA <i>do </i>care about the sign of their impact, but that in practice their actions don't align with this and they might end up having a large impact of unknown sign?</p><p>That's certainly a reasonable view to hold, but given that you seem to agree that people are <i>trying</i> to have a positive impact, I don't see how using phrases like \"expected value\" or \"positive impact\" instead of just \"impact\" would help.</p><p>In your example, it seems that SBF is talking about quickly making grants that have positive expected value, and uses the phrase \"expected value\" three times.</p>", "parentCommentId": "nHJFMayh8b2TmjPAy", "user": {"username": "Isaac_Dunn"}}, {"_id": "csbzvrcP92wXHyxjj", "postedAt": "2022-09-17T06:22:11.063Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Reasonably determining whether an anthropogenic x-risk related intervention is net-positive or net-negative is often <strong>much more difficult</strong><sup class=\"footnote-ref\"><a href=\"#fn-G3kYgTrhBzAz4KKxG-1\" id=\"fnref-G3kYgTrhBzAz4KKxG-1\">[1]</a></sup> than identifying the intervention as potentially high-impact. With less than 2 minutes to think, one can usually do the latter but not the former. People in EA can easily be unconsciously optimizing for impact (which tends to be much easier and aligned with maximizing status &amp; power) while believing they're optimizing for EV. Using the term \"impact\" to mean \"EV\" can exacerbate this problem.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-G3kYgTrhBzAz4KKxG-1\" class=\"footnote-item\"><p>Due to an abundance of <a href=\"https://www.effectivealtruism.org/articles/crucial-considerations-and-wise-philanthropy-nick-bostrom\">crucial considerations</a>. <a href=\"#fnref-G3kYgTrhBzAz4KKxG-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": "vKpKt7HnhQFMifehP", "user": {"username": "ofer"}}, {"_id": "QDqL68g4pRnyapc2a", "postedAt": "2022-09-17T13:53:57.235Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Thanks, yea. I guess I'm asking if there are other people or functionalities of EV outside of EV Ops or the constituent orgs, and outside the board.</p>", "parentCommentId": "PTcFBjN8toPRw3izQ", "user": {"username": "edoarad"}}, {"_id": "YfkH3E5yHZLjapxup", "postedAt": "2022-09-17T16:41:32.186Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>What are your criteria for deciding which organizations to support?&nbsp;</p><p>I’m particularly interested in how you think about cause prioritization in this process. The list of currently supported organizations looks roughly evenly split between organizations that are explicitly longtermist (e.g. Forethought Foundation and Longview Philanthropy) and organizations that (like the EA community as a whole) support both longtermist and neartermist work (e.g. GWWC and EA Funds). I don’t see any that focus solely on neartermist work. Do you expect the future mix of supported organizations to look similar to the current one? Would an organization working on animal welfare be as likely to receive support as one working on biosecurity if other factors like strength and size of team were the same?&nbsp;</p><p>Also, I’ve <a href=\"https://forum.effectivealtruism.org/posts/hbejbRBpd6quqnTAB/red-teaming-cea-s-community-building-work-2?commentId=euYLZTFKTWooBFMGc\">mentioned this elsewhere</a>, but I <i>really&nbsp;</i>hope this change leads to a major reassessment of how governance is structured for these organizations.</p>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "8WaFjjNtJDJMoAKJv", "postedAt": "2022-09-17T22:29:47.681Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Ah, got you. There are a few people employed in small projects; things with a similar autonomous status to the orgs, but not yet at a scale where it makes sense for them to be regarded as \"new orgs\".</p>\n", "parentCommentId": "QDqL68g4pRnyapc2a", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "bsaxg5L3WwqYaqimo", "postedAt": "2022-09-29T17:57:36.738Z", "postId": "9gHTYC5qbSH9E37vx", "htmlBody": "<p>Does EV have any policies around term-limits for board members? This is a <a href=\"https://www.501c3.org/nonprofit-board-of-directors-term-length-how-long-is-too-long/\">fairly common practice for nonprofits</a> and I’m curious about how EV thinks about the pros and cons, and more generally how EV thinks about board composition and responsibilities given the outsize role the board has in community governance.</p>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}]