[{"_id": "SZchvqDbyCRerb9EF", "postedAt": "2022-08-30T03:29:22.912Z", "postId": "9hckjperBEnsxkzjP", "htmlBody": "<p>Thanks for soliciting public feedback on this. <strong>Unfortunately I'm worried that publicizing this could be net negative</strong> though I'm not very confident in this.  My worry is that humans are good at making numbers go up and will be driven by highly publicized benchmarks to try to get higher scores, and thus this event would make capabilities go faster than they otherwise would, which would be bad.</p>\n<p>I certainly realize it could be good to be able to more easily resolve Metaculus forecasts and also it could be helpful to get more insight into capabilities that might otherwise be hidden from the public, but my weakly held view and the view of at least three other people working at or associated with Rethink Priorities also feel the same (and also with weak confidence) but preferred their views to be anonymous for now.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "eyrBMBenEdbEgwtRK", "postedAt": "2022-08-31T15:50:32.789Z", "postId": "9hckjperBEnsxkzjP", "htmlBody": "<p>Thank you for the feedback. This is an important and valid concern. Similar concerns were raised on the <a href=\"https://www.metaculus.com/questions/12339/annual-agi-benchmarking-event/#comment-99905\">discussion thread</a> over at Metaculus, and we've replied with some thoughts there. It's worth mentioning that I don't think we should move forward with anything until we've carefully considered the consequences – probably using forecasting to help with this – and gotten feedback from several disinterested parties.</p><p>I've thought a little more, at a very high level, about how an event like this might be designed in order to be beneficial overall, and written the idea up <a href=\"https://www.metaculus.com/questions/12339/annual-agi-benchmarking-event/#comment-100057\">here</a>.</p>", "parentCommentId": "SZchvqDbyCRerb9EF", "user": {"username": "Lawrence Phillips"}}]