[{"_id": "aeMGyQEJnEoHBfxXi", "postedAt": "2022-09-19T20:40:42.968Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>You say your estimate for when alignment will be solved is from a \"Gaussian distribution... used for illustration purposes only\". How do you intend the graphs/numbers based on this estimate to be interpreted?</p>\n", "parentCommentId": null, "user": {"username": "Roddy MacSween"}}, {"_id": "G6YnBq84dTof64H39", "postedAt": "2022-09-19T21:03:05.387Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>Seems to me safety timeline estimation should be grounded by a cross-disciplinary, research timeline prior. Such a prior would be determined by identifying a class of research proposals similar to AI alignment in terms of how applied/conceptual/mathematical/funded/etc. they are and then collecting data on how long they took.&nbsp;</p><p>I'm not familiar with meta-science work, but this would probably involve doing something like finding an NSF (or DARPA) grant category where grants were made public historically and then tracking down what became of those lines of research. Grant-based timelines are likely more analogous to individual sub-questions of AI alignment than the field as a whole; e.g. the prospects for a DARPA project might be comparable to the prospects for working out the details of debate. Converting such data into a safety timelines prior would probably involve estimating how correlated progress is on grants within subfields.</p><p>Curating such data, and constructing such a prior would be useful both in terms of informing the above estimates, but also for identifying factors of variation which might be intervened on--e.g. how many research teams should be funded to work on the same project in theoretical areas? This timelines prior problem seems like a good fit for a prize, where entries would look like recent progress studies reports (c.f. <a href=\"https://www.theatlantic.com/science/archive/2018/11/diminishing-returns-science/575665/\">here</a> and <a href=\"https://docs.google.com/document/d/1cEBsj18Y4NnVx5Qdu43cKEHMaVBODTTyfHBa8GIRSec/edit\">here</a>).</p>", "parentCommentId": null, "user": {"username": "jacobpfau"}}, {"_id": "oSJXNNusLezc6baBR", "postedAt": "2022-09-20T07:55:29.167Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>It is the naive estimate and we would need a broader range of others' estimates (e.g. on Metaculus) before we make concise predictions based on this. I also wouldn't expect it to follow a gaussian at the moment but some mixture distribution of several parameters.</p>", "parentCommentId": "aeMGyQEJnEoHBfxXi", "user": {"username": "esben-kran"}}, {"_id": "sv8PLFCaFtLCJ92zw", "postedAt": "2022-09-20T08:33:27.716Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>Very good suggestions. Funnily enough, our next report post will be very much along these lines (<a href=\"https://forms.gle/9VCPncvxbkyvTpDX6\">among other things</a>). We're also looking at inception-to-solution time for mathematics problems and for correlates of progress in other fields, e.g. solar cell efficiency &lt;&gt; amount of papers in photovoltaics research.&nbsp;</p><p>We'd also love to curate this data as you mention and make sure that everyone has easy access to priors that can help in deciding AI safety questions about research agenda, grant applications, and career path trajectory.</p>", "parentCommentId": "G6YnBq84dTof64H39", "user": {"username": "esben-kran"}}, {"_id": "cLTQ3m3tLbaekKLnW", "postedAt": "2022-09-21T19:37:47.849Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>The compilation of p(doom) estimates is interesting, thanks for putting that together! I initially didn't realize that some of those are on the older side - several being from a couple of years ago, and the Sanders / Bostrom one being from 2008. I think it would be good to flag that these aren't all recent estimates.</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "7wRoRyCssXJc9BH29", "postedAt": "2022-09-21T19:58:38.993Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>In the \"a case for hope\" section, it looks like your example analysis assumes that the \"AGI timeline\" and \"AI safety timeline\" are independent random variables, since your equation describes sampling from them independently. Isn't that really unlikely to be true?</p>", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "EDEMKSKnjgc5n4bdn", "postedAt": "2022-09-22T14:10:29.976Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>Thank you for pointing it out! This is now mentioned before the list and maybe we'll add the years individually if we get the time.</p>", "parentCommentId": "cLTQ3m3tLbaekKLnW", "user": {"username": "esben-kran"}}, {"_id": "rC6dFdYuoa4AgjTXX", "postedAt": "2022-09-22T14:13:15.535Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>Indeed, I think there are a lot of dynamics that might arise in the combination of these two timelines. This is also one of the reasons why it is used solely for illustrating the point that we might be able to calculate this if we can model these dynamics. We hope to use our reports as a way to dive deeper and deeper into the materia of how to properly analyze our progress. A next post will have more details in relation to this.</p>", "parentCommentId": "7wRoRyCssXJc9BH29", "user": {"username": "esben-kran"}}, {"_id": "SainiQ6ks6o7prwpQ", "postedAt": "2022-09-22T14:19:07.453Z", "postId": "9iGFjYnRquxiy29jm", "htmlBody": "<p>And just to dive into some of these dynamics:</p><ul><li>AI might help us develop more aligned AI, leading to a correlation between the two's incidence date</li><li>The same correlation might happen as a result of new ways to look at AGI leading to more novel and innovative avenues in alignment research (though with earlier effect)</li><li>Progress in alignment is very likely to translate directly into AGI progress (see the Pragmatic AI Safety agenda, OpenAI, and DeepMind)</li><li>An actual AI takeover will diminish humanity's ability to come up with an alignment solution, though the TAI probably wants to solve the problem for next-gen AGI</li><li>Takeoff speeds will of course significantly affect these dynamics</li></ul><p>Just off the top of my mind, I'd be curious to hear more.</p>", "parentCommentId": "7wRoRyCssXJc9BH29", "user": {"username": "esben-kran"}}]