[{"_id": "rq9ayupZ3bpzaXuLJ", "postedAt": "2023-01-17T02:56:20.545Z", "postId": "9J3o3cjGSHbHZoWQN", "htmlBody": "<p>Hey it's cool that this got written up. I've only read your summary, not the paper, and I'm not an expert. However, I think I'd argue against using this approach, and instead in favour of another. It seems equivalent to using ratios to me, and I think you should use <a href=\"https://forum.effectivealtruism.org/posts/sMjcjnnpoAQCcedL2/when-pooling-forecasts-use-the-geometric-mean-of-odds\">the geometric mean of odds</a> instead when pooling ideas together (as you mentioned/asked about in your question 7.). The reason is that Upco uses each opinion as a <i>new piece of independent evidence</i>. Geometric mean of odds merely takes the (correct) <i>average </i>of opinions (in a Bayesian sense).<br><br>Here's one huge problem with the Upco method as you present it: two people think that it's a 1/6 chance of rolling a six on a (fair) die. This opinion shouldn't change when you update on others' opinions. If you used Upco, that's a 1:5 ratio, giving final odds of 1:25 - clearly incorrect. On the other hand, a geometric mean approach gives sqrt((1*1)/(5*5))=1:5, as it should be.<br><br>You can also pool more than two credences together, or weight others' opinions differently using a geometric mean. For example, if I thought there was a 1:1 chance of an event, but someone whose opinion I trusted twice as much as myself put it at 8:1 odds, then I would do the following calculation, in which we effectively proceed as if we have three opinions (mine and another person's twice), hence we use a cube root (effectively one root per person):<br><br>cube root((1*8*8)/(1*1*1)=4<br><br>So we update our opinion to 4:1 odds.<br><br>This also solves the problem of Upco not being able to update on an opinion of 50/50 odds (which I think is a problem - sometimes 1:1 is definitely the right credence to have (e.g. a fair coin flip)). If we wanted to combine 1:1 odds and 1:100 000 odds, it should land in the order of somewhere in between. Upco stays at ((1*1)/(1*100 000))=100 000 (i.e. 1:100 000), which is not updating at all using the 1:1. Whereas the geometric mean gives sqrt((1*1/1*100 000)=1:100. &nbsp;1:100 is a far more reasonable update from the two of them.<br><br>In terms of your question 3, where people have credences of 0 or 1, I think some things we could do are to push them to use a ratio instead (like asking if rather than certain, they'd say 1 in a billion), weight their opinions down a lot of they seem far too close to 0 or 1, or just discount them if they insist on 0 or 1 (which is basically epistemically inconceivable/incorrect from a Bayesian approach).</p>", "parentCommentId": null, "user": {"username": "Daniel Guppy"}}, {"_id": "GxqTde56JThC2kKib", "postedAt": "2023-01-17T16:56:13.286Z", "postId": "9J3o3cjGSHbHZoWQN", "htmlBody": "<p>Hey Daniel,&nbsp;</p><p>thanks for engaging with this! :)</p><p>You <i>might</i> be right that the geometric mean of odds performs better than Ucpo as an updating rule although I'm still unsure exactly how you would implement it. If you used the geometric mean of odds as an updating rule for a first person and you learn the credence of another person, would you then change the weight (in the exponent) you gave the first peer to 1/2 and sort of update as though you had<i> just</i> learnt the first and second persons' credence? That seems pretty cumbersome as you'd have to keep track of the number of credences you already updated on for each proposition in order to assign the correct weight to a new credence. &nbsp;Even if using the geometric mean of odds(GMO) was a better approximation of the ideal bayesian response than Upco (which to me is an open question), it thus seems like Upco is practically feasible and GMO is not.&nbsp;</p><blockquote><p>Here's one huge problem with the Upco method as you present it: two people think that it's a 1/6 chance of rolling a six on a (fair) die. This opinion shouldn't change when you update on others' opinions. If you used Upco, that's a 1:5 ratio, giving final odds of 1:25 - clearly incorrect. On the other hand, a geometric mean approach gives sqrt((1*1)/(5*5))=1:5, as it should be.</p></blockquote><p>If one person reports credence 1/6 in rolling a six on a fair die and this is part of a partition containing one proposition for each possible outcome {\"Die lands on 1\", Die lands on 2\", ... \"Die lands on 6\"}, then the version of upco that can deal with complex partitions like this will tell you not to update on this credence (see section on \"arbitrary partitions\"). I think the problem you mention just occurs because you are using a partition that collapses all five other possible outcomes into one proposition - \"the die will not land &nbsp;on 6\".&nbsp;<br><br>This case does highlight that the output of Upco depends on the partition you assume someone to report their credence over. But since GMO as an updating rule just differs from Upco in assigning a weight of 1/n to each persons credence (where n is the number of credence already learned), I'm pretty sure you can find the same partition dependence with GMO.</p>", "parentCommentId": "rq9ayupZ3bpzaXuLJ", "user": {"username": "Aaron__Maiwald"}}, {"_id": "5CJKDYMd373FRWTEH", "postedAt": "2023-02-10T16:13:44.085Z", "postId": "9J3o3cjGSHbHZoWQN", "htmlBody": "<p>A recent and related paper: <a href=\"https://philpapers.org/rec/PETJPF\"><i>Jeffrey Pooling</i></a> by Pettigrew and Weisberg. Abstract (bold emphasis mine):</p><blockquote><p>How should your opinion change in response to that of an epistemic peer? <strong>We show that the pooling rule known as “upco” is the unique answer satisfying some natural desiderata</strong>. If your revised opinion will impact your opinions on other matters by Jeffrey conditionalization, then upco is the only standard pooling rule that ensures the order in which peers are consulted makes no difference. <strong>Popular proposals like linear pooling, geometric pooling, and harmonic pooling cannot boast the same. In fact, no alternative to upco can</strong>, if it possesses four minimal properties—properties which these proposals all share.</p></blockquote>", "parentCommentId": null, "user": {"username": "Sylvester Kollin"}}, {"_id": "SSjrrYxcvfgkpmhzt", "postedAt": "2023-02-10T16:19:59.290Z", "postId": "9J3o3cjGSHbHZoWQN", "htmlBody": "<p>Also, <a href=\"https://philpapers.org/rec/PETPAU-2\"><i>Pooling: A User’s Guide</i></a> by the same authors. Abstract (where Upco is one specific multiplicative method):</p><blockquote><p>We often learn the credences of others without getting to hear the evidence on which they’re based. And, in these cases, it is often unfeasible or overly onerous to update on this social evidence by conditionalizing on it. How, then, should we respond to it? We consider four methods for aggregating your credences with the credences of others: arithmetic, geometric, multiplicative, and harmonic pooling. Each performs well for some purposes and poorly for others. We describe these in Sections 1-4. In Section 5, we explore three specific applications of our general results: How should we understand cases in which each individual raises their credences in response to learning the credences of the others (Section 5.1)? How do the updating rules used by individuals affect the epistemic performance of the group as a whole (Section 5.2)? How does a population that obeys the Uniqueness Thesis perform compared to one that doesn’t (Section 5.3)?</p></blockquote>", "parentCommentId": "5CJKDYMd373FRWTEH", "user": {"username": "Sylvester Kollin"}}]