[{"_id": "vjtEvaxDHFvfTXwBF", "postedAt": "2023-02-20T17:50:52.225Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I want to explain my role in this situation, and to apologize for not handling it better. The role I played was in the context of my work as a community liaison at CEA.</p><p>(All parts that mention specific people were run past those people.)</p><p>In 2021, the woman who described traveling to a job interview in the TIME piece told me about her interactions with Owen Cotton-Barratt several years before. She said she found many aspects of his interactions with her to be inappropriate.&nbsp;</p><p>We talked about what steps she wanted taken. Based on her requests, I had conversations with Owen and some of his colleagues. I tried to make sure that Owen understood the inappropriateness of his behavior and that steps were taken to reduce the risk of such things happening again. Owen apologized to the woman. The woman wrote to me to say that she felt relieved and appreciated my help. Later, I wrote about&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/fovDwkBQgTqRMoHZM/power-dynamics-between-people-in-ea\"><u>power dynamics</u></a> based partly on this situation.</p><p>However, I think I didn’t do enough to address the risk of his behavior continuing in other settings. I didn’t pay enough attention to what other pieces might need addressing, like the fact that, by the time I learned about the situation, he was on the board of EV UK (then called CEA UK), or the areas where he could influence funding and career opportunities for other people.</p><p>No other women raised complaints about him to me, but I learned (in some cases from him) of a couple of other situations where his interactions with women in EA were questionable. None of these seemed as serious on their own from what I knew — one of the women summarized it as \"He apologized to me then, and I accepted it and things were / are totally fine.” But they formed a pattern, and I should have taken that pattern more seriously.</p><p>A few months ago Owen told me about another more recent situation where, according to him, he had made another woman uncomfortable. I didn’t reach out to the woman about this at the time, which I now think was a mistake. I understand EV UK and EV US’s external investigation will look into what happened here.</p><p>I also didn’t seek adequate backup given that I was friends with Owen. (Owen and I live in different countries and were not close friends, but we and our families have spent social time together.) When the woman in the TIME piece told me that her concern was about Owen, I flagged to her that I was friends with him. She and I decided to proceed anyway because we couldn’t think of a better option, although she felt it was unhealthy for EA that people who had power were entwined in these ways.</p><p>If I had flagged the situation earlier and more thoroughly to others, they might have recognized the parts of the situation that I hadn’t handled adequately. I should have thought more about how to get more help here or how to hand off the situation to someone else.</p><p>After reading the TIME piece, I flagged my worries about Owen’s roles in EA to the EV UK and EV US boards. I had earlier flagged some parts of the situation to my manager, but not the whole picture.</p><p>I’m really sorry that I didn’t handle this better. It’s really important to me that women in the community can do their best work without wondering if they’ll be treated unfairly, be hit on in professional contexts, or worse.&nbsp;</p><p>I understand that EV UK and EV US will be working with external evaluators to assess my and my team’s processes here and evaluating the choices that I and my manager made in handling this situation. I will also be reflecting further on my own and with my team.<br><br>I’m guessing that my mistakes here may mean some people will feel less comfortable bringing problems to me. For unrelated reasons, over the last two months my team had moved most of our work on interpersonal harm to my colleague Catherine Low, who was not involved in this situation. If you’d like to get help from the community health team but don’t want me involved, please feel free to contact&nbsp;<a href=\"https://www.centreforeffectivealtruism.org/community-health\"><u>Catherine or my other teammates</u></a> (and you can ask them to not share information about the situation with me.)<br><br>[Edited to add: more info added <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=F5Zfn6MPAw3TBhmua\">below</a>]</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "CRdikDzzK2z92GLSs", "postedAt": "2023-02-20T17:52:29.179Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p><strong>Meta:&nbsp;</strong>I’m writing on behalf of the Community Health and Special Projects team (here: Community Health team) at CEA to explain how we’re thinking about next steps. For context,&nbsp;<a href=\"https://www.centreforeffectivealtruism.org/community-health-team\"><u>our team</u></a> consists of:</p><ul><li>Me, Chana Messinger: Normally I specialize (from a community health lens) in EA projects that involve high schoolers or minors, and community epistemics; since November, I’ve been the interim head of the Community Health team</li><li>Nicole Ross, the usual team head, who has been focusing on EV US board work since the FTX crisis, and when she transitions back to community health work, she plans to prioritize thinking through what changes should happen in EA given everything that happened with FTX</li><li>Julia Wise, who usually serves as a community health&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/hYh6jKBsKXH8mWwtc/contact-people-for-the-ea-community\"><u>contact person</u></a> for the EA community, but has been working primarily on other projects for a few months</li><li>Catherine Low, who serves as a&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/hYh6jKBsKXH8mWwtc/contact-people-for-the-ea-community\"><u>contact person</u></a> for the EA community among other roles</li><li>Eve McCormick, project manager and senior assistant</li><li>An affiliate and various contractors</li></ul><p>In this comment I’ll sometimes be referring to Effective Ventures (EV) UK and Effective Ventures (EV) US together as the “EV entities” or as Effective Ventures or EV.<br>&nbsp;</p><p><strong>Where things stand and next steps:</strong></p><p>Someone came to Julia in 2021 with information about possible misconduct by Owen Cotton-Barratt, a few years after the events they were reporting. Julia took steps at the time in response, described&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=vjtEvaxDHFvfTXwBF\"><u>here</u></a>. In 2021, when Nicole became her manager, Julia told Nicole that there were concerns about Owen’s behavior, but as far as they remember Julia didn’t share many details at the time.<br>&nbsp;</p><p>Earlier this month, after reading the TIME piece, Julia filled me and Nicole in on more details, and then later we informed the rest of the Community Health team about what had happened. We're now looking back on whether Julia or Nicole made mistakes in handling this, and whether we should change things about our processes going forward.</p><p>As the post notes, an external firm is going to give us their independent assessment; I think this is important, and I’m grateful to the trustees of EV UK and EV US for helping to organize it. There will also be an internal reflection process. Julia and Nicole are going to do retrospectives on this situation, which will then get discussed with me, Ben West (as&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/99tnp7Jpts7Gssq7J/transitioning-to-an-advisory-role?commentId=gFmhPZwQXvxnsC6Ap\"><u>transition coordinator</u></a> at CEA), and some senior management and/or trustees of the EV entities, possibly looping in others at CEA or EV as well.&nbsp;<br>&nbsp;</p><p>Further steps are yet to be decided (and some will depend on the information we learn), but could include having other members of the team do assessments of the process and decision-making in this situation and getting opinions on this situation and our approach generally from other people who do similar or analogous work, in and out of EA.&nbsp;</p><p>Things we will be keeping in mind as we reflect:&nbsp;</p><ul><li>potential conflicts of interest, the role of power in EA, and our own incentives as a team</li><li>that crucial details can differ between people or be misremembered over years</li><li>that the best response to a pattern of making people uncomfortable (for example) can be different from the best response to an isolated incident</li><li>that there are important selection effects on what we get to hear, and that we certainly don’t have all the information we would ideally want to have</li></ul><p><br>We are also going to continue our normal work. We are available for calls concerning issues in the community, and you can reach out to us via&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/hYh6jKBsKXH8mWwtc/contact-people-for-the-ea-community\"><u>relevant team members’</u></a> emails or our&nbsp;<a href=\"https://forms.gle/FGU5MZZuJTySptBZ6\"><u>form</u></a> (which can be anonymous). Feel free to also use the general form or forms for specific team members to give us feedback, questions or other thoughts and perspectives, on this situation or more generally.&nbsp;</p><p><strong>Forms</strong></p><ul><li>Chana’s<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdLnp5LVp0WwCOVKDHEZwh-5NPHz-ZwJEqsMe_Z38MPO8tUEg/viewform\"><u> form</u></a></li><li>Nicole's<a href=\"https://www.admonymous.co/nicolejamesross\"><u> Admonymous</u></a></li><li>Catherine's<a href=\"https://www.admonymous.co/cafelow\"><u> Admonymous</u></a></li><li>Julia's<a href=\"https://docs.google.com/forms/d/e/1FAIpQLScWtG3hNhdzSpVSAEHmpEz7mjlvoRhqch8hsFF2lKJX8dzrvw/viewform\"><u> form</u></a></li></ul><p>We are also considering many possibilities for proactive work to make the EA community safer and better at dealing with this kind of situation (some of which are&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\"><u>already happening</u></a>, and will continue).&nbsp;</p><p>If instead you’d like to share thoughts or feelings about this situation to someone not on the team,&nbsp;<a href=\"mailto:habiba@80000hours.org\"><u>Habiba Islam</u></a>,&nbsp;<a href=\"mailto:l.bruckamp@lse.ac.uk\"><u>Luzia Bruckamp</u></a> and&nbsp;<a href=\"mailto:rocky@effectivealtruism.nyc\"><u>Rockwell Schwartz</u></a> have all kindly volunteered to be listening ears not working at CEA. (Habiba works for 80,000 Hours, which along with CEA is an&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/GoWNiPbrEb6NHD3MF/announcing-interim-ceos-of-evf\"><u>Effective Ventures project</u></a>, and Rockwell is paid via CEA Community Building Grant. Luzia is an EA community member who volunteered to help on Twitter.) If you have feedback for the Community Health team you’d like them to pass on, they’re happy to do that, at whatever level of anonymizing / aggregating you wish. They are all volunteering for this additional work, so may have limited time slots available, but will communicate that with you. (Note that these people were asked in an informal capacity and have not been formally assessed or trained by our team.)</p><p>There are also resources external to our team that may be useful, such as those compiled by&nbsp;<a href=\"https://www.rainn.org/resources\"><u>RAINN</u></a>.&nbsp;</p><p>I’m going to do my best in the comments to answer questions people have, with all the obvious caveats about ones I can’t answer or won’t be able to answer quickly.</p><p>My heart goes out to everyone who has suffered from sexual harassment or misconduct in this community. I’m sorry, and I care deeply about making sure our team is equipped to handle these issues well.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "5HJeKGviqHxNpFnpw", "postedAt": "2023-02-20T18:03:56.373Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Julia, I really appreciate you explaining your role here. I feel uneasy about the framing of what I've read. It sounds like the narrative is \"Owen messed up, Julia knew, and Julia messed up by not saying more\". But I feel strongly that we shouldn't have one individual as a point of failure on issues this important, especially not as recently as 2021. I think the narrative should be something closer to \"Owen messed up, and CEA didn't (and still doesn't) have the right systems in place to respond to these kinds of concerns\"</p>\n", "parentCommentId": "vjtEvaxDHFvfTXwBF", "user": {"username": "Khorton"}}, {"_id": "AefiqCcJozwcophTm", "postedAt": "2023-02-20T18:09:07.572Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Please would someone be able to put together a slightly more fleshed out timeline of who knew what and when. Best I can tell is:</p><ul><li><strong>3rd February 2023</strong> - TIME article published</li><li><strong>3rd February 2023</strong> - People start questioning this specific case in the forum</li><li><strong>3rd February 2023</strong> - Julia and Owen discuss who should find out about this</li><li><strong>3rd February 2023</strong> - Julia informed Nicole that the person was Owen</li><li><strong>3rdFebruary 2023</strong> - Julia informs EV US and EV UK boards</li><li><strong>4th February 2023</strong> - Julia informed Chana that the person was Owen</li><li><strong>11th February 2023 </strong>- Owen resigns from the board</li><li><strong>20th February 2023 </strong>- Owen's resignation is made public</li></ul>", "parentCommentId": null, "user": {"username": "Simon_M"}}, {"_id": "e8SNeGgPkfwhagJtK", "postedAt": "2023-02-20T20:38:13.600Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Still digesting, and out on a stroller ride with my son -- but this needs to be pinned to the frontpage for a few days, or else it will quickly fall off in light of the design change.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "BhxQRAskmchTrsaJk", "postedAt": "2023-02-20T21:38:32.312Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Am I right in thinking that, if it weren't for the Time article, there's no reason to think that Owen would ever have been investigated and/or removed from the board?</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "WiWpr4uuGy7d8Bstp", "postedAt": "2023-02-20T21:41:38.141Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Supporting someone/people who are at least at arms length from EVF seems like it would be good asap. Relying on volunteers and good will to essentially cover for (at least perceived) mistakes seems bad.</p>\n", "parentCommentId": "CRdikDzzK2z92GLSs", "user": {"username": "jooke"}}, {"_id": "rd4bKEdqPsQibmHFg", "postedAt": "2023-02-20T21:46:14.816Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>The EA forum, run by CEA, choosing to hide community posts from the front page just before news breaks that reflects badly on CEA and its parent organisation, is not a good look. I'm not suggesting that there is any foul play here but it would be a positive nice if some way to highlight this issue was found. CEA should be going be doing everything possible to reassure that they are maximizing transparency and accountability here.</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "QP4BAAd9qqGYiBZhR", "postedAt": "2023-02-20T22:00:50.846Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>This seems right to me.</p>", "parentCommentId": "BhxQRAskmchTrsaJk", "user": {"username": "Lauren Maria"}}, {"_id": "goxWH6HR4vD3zqBJr", "postedAt": "2023-02-20T22:44:02.895Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Hey Joshua - can I ask you to clarify more what you mean about what kinds of people to support? I can imagine a few different things you might be pointing at being important.</p>", "parentCommentId": "WiWpr4uuGy7d8Bstp", "user": {"username": "ChanaMessinger"}}, {"_id": "gaf4KSGNHFEEvv2vX", "postedAt": "2023-02-20T22:44:55.148Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>The fact this is true, despite issues being reported to the community health team, is a serious indictment.</p>", "parentCommentId": "BhxQRAskmchTrsaJk", "user": {"username": "deluks917"}}, {"_id": "sL2dDpn9DSAqcJcur", "postedAt": "2023-02-20T22:51:48.599Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I just wanted to flag one issue that may have contributed to this situation, as well as some of the others described in the TIME article:</p><p>As far as I am aware, <i>CEA &nbsp;has no clear, public, working definition of sexual harassment, and there are no clear guidelines regarding appropriate and inappropriate behavior at different types of EA events</i>. This is a significant problem in a community where personal and professional relationships are frequently intertwined.</p><p>The lack of guidelines will predictably lead to bad consequences:</p><ol><li>People may engage in behavior that seems non-problematic to them, but that puts others in situations they don't want to be in. (Guidelines alleviate the pressure on individuals to consistently exercise good judgment, and can also serve an educational purpose by clarifying that/why certain behaviors are harmful.)</li><li>People may not report situations that made them uncomfortable because no rules were technically broken. (When some mixing of professional/personal relationships is considered appropriate, it is harder to discern when lines have been crossed, especially when these lines have not been explicitly drawn.)</li><li>The Community Health Team may have substantial leeway in resolving disputes, potentially leading to more biased or unfair decisions.</li></ol><p>I am really glad to hear there will be an external investigation by an independent law firm, and I hope one of the things they will recommend is developing clearer standards regarding appropriate conduct. &nbsp;</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "AFPLCLNGosuyKnfWZ", "postedAt": "2023-02-20T23:01:54.714Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for the apology Julia.</p><p>I'm mindful that there's an external investigation that is ongoing at present, but I had a few questions that I think would be useful transparency for the EA community, even if it may be detrimental to the CEA / the community health team. I'm sorry if this comes across as piling on in what I'm sure is a very stressful time for you and the team, and I want to emphasise and echo Kirsten's <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=5HJeKGviqHxNpFnpw\">comment</a> above about this ultimately being a \"lack of adequate systems\" issue, and not a responsibility that should be fully borne by you as an individual.</p><p>&nbsp;</p><blockquote><p>Shortly after the article came out, Julia Wise (CEA’s community liaison) informed the EV UK board that this concerned behaviour of Owen Cotton-Barratt;&nbsp;the incident occurred more than 5 years ago and was reported to her in 2021.&nbsp;(Owen became a board member in 2020.)</p></blockquote><ol><li>From the EV UK board's statement, it sounds like the board did not know about this until Feb this year. Can you clarify the extent to which not informing the EV UK board was a result of the victim explicitly requesting something along these lines, and if so, whether you spoke to the victim before informing the EV UK board when the article came out?</li><li>What actions did you take to reduce the risks associated with these events (whether to individual / potential victims in the EA community, to CEA, or the EA movement more broadly)? It sounds like the actions consisted of the following, but I wanted to make sure I wasn't missing anything important:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreford46lncqxs\"><sup><a href=\"#fnord46lncqxs\">[1]</a></sup></span><ol><li>Conversations with Owen Cotton-Barratt (OCB) and his colleagues<ol><li>Some clarity here would be useful also - what's the role of OCB's colleagues here? Were they complicit, or was this for harm-mitigating reasons?</li></ol></li><li>A written post about power dynamics</li><li>An update to Nicole when she became your manager in 2021<ol><li>Are you also happy to comment on whether your CoI with OCB was disclosed with Nicole when you informed her of this situation, or with anyone else in the CH team at any stage? What details did you share with Nicole in 2021, when she became your manager?</li><li>Given OCB's status and position in the community, the seemingly direct access to potential victims via mentoring / \"picking out promising students and funneling them towards highly coveted jobs\" / his <a href=\"https://incredibly and deliberately warped, adversarially targeted\">role</a> as Director for FHI's Research Scholars Programme, and your COIs with him (both from a friendship and EV / CEA organisational perspective), this seems to clearly tick many important boxes of where I'd expect to err on the side of full disclosure. Were there extenuating circumstances at the time that meant you didn't feel comfortable sharing more than you did?</li></ol></li></ol></li><li>Did the complaints from the woman in the Time article come before or after other feedback you heard about OCB? The timeline sounds something like:<ol><li>TIME magazine case, reported to you in 2021</li><li>Learnt about other situations (in the cases not from OCB, were these as a result of your investigation, or spontaneous reports by other community members?)</li><li>OCB raised concerns to you that he had made another woman uncomfortable - reported a few months ago.</li></ol></li><li>Accordingly, I also just want to flag this <a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of?commentId=v9PisNqHGNcjxXRvK\">set of questions</a> as important, and has been <a href=\"https://forum.effectivealtruism.org/posts/AbohvyvtF6P7cXBgy/brainstorming-ways-to-make-ea-safer-and-more-inclusive?commentId=z46k3cLoL6qNuJkMP#z46k3cLoL6qNuJkMP\">raised</a> in the <a href=\"https://forum.effectivealtruism.org/posts/AbohvyvtF6P7cXBgy/brainstorming-ways-to-make-ea-safer-and-more-inclusive?commentId=arwkeRmfDHsqD5pbp#z46k3cLoL6qNuJkMP\">past</a> as a potential cause for <a href=\"https://forum.effectivealtruism.org/posts/myp9Y9qJnpEEWhJF9/linch-s-shortform?view=postCommentsNew&amp;postId=myp9Y9qJnpEEWhJF9&amp;commentId=vqCzYE2HB6fgoXiZh\">insufficient action</a>. When the TIME article came out, you <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=tFxjdj34q8xoaWut3#tFxjdj34q8xoaWut3\">clarified</a> that one cause for confusion was that this consideration didn't apply to sexual assault but to things like \"someone has made some inappropriate comments and gotten feedback about it\". To what extent do you think these considerations played a role in the decisions you made around managing risk?</li><li>You mentioned that you had been \"<a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=krAgZxFKXCyTyQ2hc\">taking a renewed look at possible steps to take here</a>\". When did this start? I'm mainly interested in clarifying whether this was something ongoing, (e.g., prompted by finding out about other situations or hearing from OCB himself about making another woman uncomfortable a few months ago), or was this prompted by knowledge of the existence (or possible existence) of the TIME article.</li></ol><p>&nbsp;</p><p>(commenting in personal capacity etc)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnord46lncqxs\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreford46lncqxs\">^</a></strong></sup></span><div class=\"footnote-content\"><p>For example:</p><p>-notifying the EV board<br>-a discussion with other CH colleagues around reducing his exposure to possible victims or level of risk, given his role as Director for FHI's Research Scholars Programme, such as considering a temporary ban to EAGs (also seems like shared responsibility around the decision made would be appropriate, and not a burden that should fall solely on your shoulders)</p></div></li></ol>", "parentCommentId": "vjtEvaxDHFvfTXwBF", "user": {"username": "bruce"}}, {"_id": "xhmYthgRp84uMtMRS", "postedAt": "2023-02-20T23:13:07.137Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I’d like to chime in here. I can see how you might think that there’s a coverup or the like, but the Online team (primarily Ben Clifford and I, with significant amounts of input from JP and others on the team) made&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/wvBfYnNeRvfEXvezP/moving-community-discussion-to-a-separate-tab-a-test-we\"><u>the decision to run this test</u></a> based on feedback we’d been hearing for a long time from a variety of people, and discussions we’d had internally (also for a long time). And I didn’t know about Owen’s actions or resignation until today. (Edited to add: no one on the Online team knew about this when we were deciding to go forward with the test.)</p><p>We do think it’s important for people in EA to hear this news, and we’re talking about how we might make sure that happens. I know I plan on sharing one or both of these posts in the upcoming&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/bi9WWR58m45GJG7bc/forum-digest-reminder-that-it-exists-and-request-for\"><u>Digest</u></a>, and we expect one or both of the posts to stay at the top of the Community page for at least a few days. If the posts drift down, we’ll probably pin one somehow. We’re considering moving them out of the section, but we’re conflicted; we do endorse the separation of Community and other content, and keeping the test going, and moving them out would violate this. We’ll keep talking about it, but I figured I would let you know what our thoughts are at the moment.&nbsp;</p>", "parentCommentId": "rd4bKEdqPsQibmHFg", "user": {"username": "Lizka"}}, {"_id": "sKLjmZA89NQFkccoN", "postedAt": "2023-02-20T23:15:04.237Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for this note! I currently don’t think it will fall off in a few days, but we are considering pinning the post(s) (at the top of the Community section of the Frontpage or on the overall top of the Frontpage) if they do.&nbsp;</p>", "parentCommentId": "e8SNeGgPkfwhagJtK", "user": {"username": "Lizka"}}, {"_id": "797hABiReThZWYquD", "postedAt": "2023-02-20T23:15:59.123Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I suggest removing the community tag from one of them and pinning it to the main section.</p>\n", "parentCommentId": "xhmYthgRp84uMtMRS", "user": {"username": "nathan"}}, {"_id": "egtTxPeHnocAwdDK4", "postedAt": "2023-02-20T23:17:55.034Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I agree with this.&nbsp;</p>", "parentCommentId": "797hABiReThZWYquD", "user": {"username": "Lauren Maria"}}, {"_id": "hMbamQZbrSEcjpykL", "postedAt": "2023-02-20T23:27:44.147Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I have a significant concern that this response comes across as firefighting in response to the bespoke issue, with a very narrow focus on one incident rather than a wider review of cultural issues in EA.</p>\n<p>I appreciate the decision was made by the EV board for EV in particular, but it is notable that this is probably the 4th major scandal in EA in 6 months, all of which have been troubling, and regularly involving senior figures in the movement. (Ftx, Bostrom email, Time article, now this). I am unaware of any other independent investigations ongoing.</p>\n<p>It is far from clear that they are the last scandals which might hit EA e.g. what if more information came out from the Time, or if there was troubling information around the early vetting of FTX (I've seen that suggested as a rumour, I cant vouch for its reliability.)</p>\n<p>These issues seem to require read across, reflection and significant action. But I'm not seeing the major transformation programmethat I would expect from other similar organisations/movements facing a barrage of scandals. I've seen multiple similar independent investigations in other fields I'm involved with, and their scope is normally far broader.</p>\n<p>I confess that I'm not a regular commenter /forum reader and people who follow more closely may have a better view of work going on. That said, I think subjective perception does matter and suggests that EA at minimum faces a serious comms issue, and likely much more than that. (I am someone who's followed EA for years and donated to EA charities for that time).</p>\n", "parentCommentId": null, "user": {"username": "Tom Raus"}}, {"_id": "FSiFrs9zhqEHfo2nj", "postedAt": "2023-02-20T23:35:00.839Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Hi Chana,</p><p>Thanks for this - I imagine this has been a difficult few months for you as the interim head of the community health team.</p><p>I just wanted to bring <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=AFPLCLNGosuyKnfWZ\">Q4 from this comment</a> to your attention, (specifically, lilly's <a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of?commentId=v9PisNqHGNcjxXRvK\">set of questions here</a>) as you seem better placed to answer about the general case (as opposed to the specifics around OCB, which might be better suited for Julia)</p><p>Separately, I'm wondering what from the investigation if any, would you be happy to pre-commit to sharing publicly? I'd also love to get a sense of how you and the team hope to ensure the CH team has processes and systems in place to manage these kinds of cases going forward, and what you'd be happy to pre-commit to sharing &nbsp;in terms of internal investigations and reflections. Non-exhaustive categories of information I would be interested in would be:</p><ol><li>Methodology for investigations<ol><li>Conflicts of Interests identified</li></ol></li><li>Problems identified</li><li>Changes considered / explored</li><li>Changes made + reasoning</li></ol><p>&nbsp;My sense is that rebuilding trust in the CH team will be important going forward, and such a precommitment combined with transparent and appropriately timely follow-up may be useful here.</p><p>&nbsp;</p><p>(commenting in personal capacity etc)</p>", "parentCommentId": "CRdikDzzK2z92GLSs", "user": {"username": "bruce"}}, {"_id": "xHzgEshWinqxwvM6r", "postedAt": "2023-02-21T00:50:55.711Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I believe there is an independent external review of EVF over the FTX affair, on top of a statutory inquiry from the UK Charity Commission on that and other issues (which is a big deal). The University of Oxford -- Bostrom's employer -- is investigating him last I checked. Im not sure a separate EA investigation would add anything to that.</p>\n<p>Today's news is related to the Time article, as Owen was one of the people whose inappropriate conduct was mentioned. (I do hope the external investigation promised today looks at Community Health's handling of sexual harassment and assault more broadly).</p>\n", "parentCommentId": "hMbamQZbrSEcjpykL", "user": {"username": "Jason"}}, {"_id": "hkJhukZWSa7zZWADo", "postedAt": "2023-02-21T00:52:42.018Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I'm curious why some people disagree-voted on this comment.</p>", "parentCommentId": "sL2dDpn9DSAqcJcur", "user": {"username": "Jonas Vollmer"}}, {"_id": "G4CDqSHapEpKaReJt", "postedAt": "2023-02-21T00:55:39.369Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>A suggestion I'm throwing out just for consideration: maybe create a specific section on the frontpage for statements from organizations. I don't think there are that many organizations that want to make statements on the EA forum, but they usually seem pretty worth reading for people here. (Often: something bad happened, and here's our official stance/explanation).</p>\n<p>A downside could be that this means organizations can be more visible than individuals about community matters. That seems possibly bad (though also how it usually works in the broader world). But it seems worse for the forum moderators to arbitrarily decide if something is important enough to be displayed somehow.</p>\n", "parentCommentId": "xhmYthgRp84uMtMRS", "user": {"username": "ThomasWoodside"}}, {"_id": "EknoTdjpBm5Bfpfy4", "postedAt": "2023-02-21T01:36:41.644Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>It doesn't seem right for \"would never have been investigated.\" My understanding is that the community health team looked into this. They talked to affected parties and came to some decision that didn't call for a public apology or Owen stepping down. Instead, their \"steps to take\" included writing that post on power dynamics and probably(?) they made a judgment call of the sort \"our impression is that Owen learned from mistakes and is very unlikely to do this again.\" So, I'd imagine they resolved to keep an eye on things, but decided on no further actions otherwise.<br><br>[Edit1: Julia writes \"I hope I would have eventually recognized there was more to do here, including telling the board, but it’s possible I wouldn’t have recognized this.\" This suggests that maybe the team was overwhelmed with things happening and hadn't conclusively finalized dealing with this situation before the TIME article came out.]</p><p>[Edit2: Oh, I now see that posters above probably meant \"official investigation by experts\" rather than \"investigation by a team at an EA org.\" I agree that it looks like this wouldn't have happened.]</p><p>Then, the TIME article brought this up again and pressure mounted to hear more details about the incident and about the fact that the person mentioned is still active in the community, despite the description in the TIME piece sounding crazy and indefensible. And so here we are.</p><p>Personally, if we take Owen's account at face value, <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology?commentId=aGBEALtynghAEBZvA\">I think</a> the incident is bad and shouldn't have happened, but it was a lot less bad than what I'd have expected based on the TIME piece account. Even so, subjective judgment calls about how much someone learned from mistakes are risky to rely on all by themselves. In this particular instance, I can sympathize with wanting to take a forgiving stance. One reason I was extremely surprised about this post and the circumstances behind it is because I knew Owen (not very closely, but it still felt like a strong impression) as someone who's unusually committed to high integrity and modest and forthcoming about mistakes he might be making, etc. Still, there's a strong case that there should be procedures that call for more \"objective\" actions when complaints of this sort come to light and are even corroborated (\"corroborated\" in the sense that Owen, given his apology, must have agreed about many facts of what happened, even if he highlighted things that the person who complained about him may not have highlighted or may have thought about differently). So, instead of just making a judgment call about whether the person learned the most from mistakes, I think it would've been more appropriate to make a public statement about the incident. This would've put more eyes on Owen's behavior in this area and brought about the conditions for better accountability.&nbsp;</p><p>Personally, I think \"removal from the board\" wouldn't necessarily be warranted if this had been handled differently at the time when it happened (but as I say further below, some kind of public statement and apology seemed warranted!). But I think it would've made sense to ask Owen to step down from mentorship-type roles?<br><br>I &nbsp;think that if we just looked at the specific actions, the measures taken should probably be more severe than I just described them. However, if we then add extra context and if I go with my best guess about everything that Owen was thinking and so on, I pretty much believe the account he gave in the apology.&nbsp;<br><br>Since things didn't come out earlier, I want to say that I don't feel like it's good that basically nothing happened at the time. Even if the community health team has good judgment about these sorts of things (whether someone made genuine mistakes instead of deliberately using their position of power to push boundaries), it's much safer for incentives and overall accountability if they draw public eyes on this in some way (perhaps keeping some measure of discretion). (Edit: Also conflict of interest concerns!) To help with that, it would be good if the \"public eye\" has enough nuance to distinguish cases like the one here from things that would be significantly worse, and not call for the most extreme punitive measures in all cases. My impression is that the EA community is probably good at preserving this sort of nuance (or at least was so before the recent series of polarizing scandals), even though I often see EA forum comments that I disagree with in one direction or the other – too lenient or too strict for my taste for a given situation.</p>", "parentCommentId": "QP4BAAd9qqGYiBZhR", "user": {"username": "Lukas_Gloor"}}, {"_id": "smebhCoySEE4s8opo", "postedAt": "2023-02-21T02:17:07.340Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>A comment I made a few days ago said \"But usually very little changes until someone goes public (at least anonymously). Nothing else remotely reliably creates the momentum to get bad actors out of power.\" Really aged quite well.&nbsp;</p><p>As always I would advise survivors who want change to be as public as possible. Anonymous public statements work fine. Of course prioritize your own safety. But private internal processes are not a vehicle for change. Owen would, as predicted, still be on the board if not for the Time article.</p>", "parentCommentId": null, "user": {"username": "deluks917"}}, {"_id": "FwKWSgdBb2NBKPbe6", "postedAt": "2023-02-21T02:17:46.376Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Could you clarify whether the Charity commission investigation has any bearing on Owen’s resignation?</p>", "parentCommentId": "CRdikDzzK2z92GLSs", "user": {"username": "anolderea"}}, {"_id": "eKs2jwgzpkp6aLx6N", "postedAt": "2023-02-21T02:21:35.942Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<blockquote><p>it was a lot less bad than what I'd have expected based on the TIME piece account</p></blockquote><p>From my personal perspective: While the additional context makes the interaction itself seem less bad, I think the fact that it involved Owen (rather than, say, a more tangentially involved or less influential community member) made it a lot worse than what I would have expected. In addition, this seems the <s>first</s> <strong>second</strong> time (after <a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology\">this one</a>*) I hear about a case that the community health team didn't address forcefully enough, which wasn't clear to me based on the Time article.</p><p>* edited based on feedback that someone sent me via DM, thank you</p><p>(edit: I think you acknowledge this elsewhere in your comment)</p>", "parentCommentId": "EknoTdjpBm5Bfpfy4", "user": {"username": "Jonas Vollmer"}}, {"_id": "Qoqiqt7CJFgArraBu", "postedAt": "2023-02-21T02:24:04.722Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Strongly agree with (both parts of) this.</p>", "parentCommentId": "eKs2jwgzpkp6aLx6N", "user": {"username": "willbradshaw"}}, {"_id": "ZLribi7ZaAjoKmqkw", "postedAt": "2023-02-21T02:34:33.119Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<blockquote><p>While the additional context makes the interaction itself seem less bad</p></blockquote><p>That's what I was commenting on. I agree with your other points (which are arguably more important from a \"what does this mean for EA?\" perspective).</p>", "parentCommentId": "eKs2jwgzpkp6aLx6N", "user": {"username": "Lukas_Gloor"}}, {"_id": "tgWBFLMxqujSuGps5", "postedAt": "2023-02-21T02:46:05.356Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I hope I would have eventually recognized there was more to do here, including telling the board, but it’s possible I wouldn’t have recognized this.</p>", "parentCommentId": "BhxQRAskmchTrsaJk", "user": {"username": "Julia_Wise"}}, {"_id": "3BZMfJXYN3cGYprmp", "postedAt": "2023-02-21T02:51:31.002Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Could it also mean the sexual harassment problem is much wider and deeper rooted than we think?</p>", "parentCommentId": "eKs2jwgzpkp6aLx6N", "user": {"username": "anolderea"}}, {"_id": "7xSHu9KPKEvbiNfMu", "postedAt": "2023-02-21T03:02:42.962Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>On Feb 3 I heard from Owen, I discussed the situation with Nicole, I informed Owen I'd be telling the boards, and I told the boards. I told Chana the following morning.</p>", "parentCommentId": "AefiqCcJozwcophTm", "user": {"username": "Julia_Wise"}}, {"_id": "dvgq3NignuY4DYwuK", "postedAt": "2023-02-21T03:36:56.620Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>The TIME article is what prompted me to realize I hadn’t properly dealt with everything here.</p>\n<blockquote>\n<p>Can you clarify the extent to which not informing the EV UK board was a result of the victim explicitly requesting something along these lines</p>\n</blockquote>\n<p>She did not request that I not tell the board - I don't think we discussed that possibility.</p>\n<blockquote>\n<p>What actions did you take to reduce the risks associated with these events</p>\n</blockquote>\n<ul>\n<li>I had conversations with several of his colleagues alerting them to the situation so they could intervene if they thought something like this might be happening again.</li>\n<li>An email was sent to researchers he mentored encouraging them to bring concerns to me if they had feedback about their experience in the program or how personal and professional relationships were intersecting in the workplace.</li>\n<li>I talked with Owen about the problems I saw with his behavior, including the power dynamics.</li>\n</ul>\n<blockquote>\n<p>what's the role of OCB's colleagues here? Were they complicit, or was this for harm-mitigating reasons?</p>\n</blockquote>\n<p>As far as I know, they did not previously know about any of this. The goal was harm mitigation.</p>\n<blockquote>\n<p>Are you also happy to comment on whether your CoI with OCB was disclosed with Nicole when you informed her of this situation, or with anyone else in the CH team at any stage? What details did you share with Nicole in 2021, when she became your manager?</p>\n</blockquote>\n<p>We expect that we’ll be interviewed separately about what we recall of this conversation as part of the investigation, so I think it’s best if I don’t go into detail here.</p>\n<blockquote>\n<p>Did the complaints from the woman in the Time article come before or after other feedback you heard about OCB?</p>\n</blockquote>\n<p>The order was: I learned about one situation from a third party, then learned the situation described in TIME, then learned of another situation because I asked the woman on a hunch, then learned the last case from Owen.</p>\n<p>I don’t have a clear answer about the ways various considerations played into my decisions. I expect this is the kind of thing we’ll be discussing as part of the investigation into our work here.</p>\n", "parentCommentId": "AFPLCLNGosuyKnfWZ", "user": {"username": "Julia_Wise"}}, {"_id": "Hx5eQ6qQJ5wZMqAPK", "postedAt": "2023-02-21T06:51:57.321Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Someone doing something similar to the community contact points at CEA but more clearly separated. Much like the people you list in the post as others who have volunteered to be named as contacts but are doing this voluntarily.</p>\n", "parentCommentId": "goxWH6HR4vD3zqBJr", "user": {"username": "jooke"}}, {"_id": "usekDfiytDfrJhcLf", "postedAt": "2023-02-21T06:55:35.612Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for the response. I think this position is completely reasonable, and I'll repeat that I (currently) do not think there's any cover-up or the like here. But I think at this point, we've both acknowledged that it would be easy to misconstrue actions as a coverup, which is also a problem IMO.</p>\n", "parentCommentId": "xhmYthgRp84uMtMRS", "user": {"username": "jooke"}}, {"_id": "etFogxDaQZkNaSPmQ", "postedAt": "2023-02-21T07:18:24.884Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Ok, sorry in case that was a bit of a strawman!</p>\n", "parentCommentId": "ZLribi7ZaAjoKmqkw", "user": {"username": "Jonas Vollmer"}}, {"_id": "Wx2psRashgAcAoZz6", "postedAt": "2023-02-21T08:05:06.778Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>We need to be better, as a community, at pushing back against unsourced claims from over five years ago, especially those written by someone with a vendetta against EA. Human memories are malleable, and people who describe a traumatic incident many years later do a <em>terrible</em> job of reporting it accurately..</p>\n", "parentCommentId": null, "user": {"username": "Colonel_M"}}, {"_id": "GQHmGAbgHdm7y2JCb", "postedAt": "2023-02-21T08:17:55.768Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I appreciate you sharing this additional info and reflections, Julia.&nbsp;</p><p>I notice you mention being friends with Owen, but, as far as I can tell, the post, your comment, and other comments don't highlight that <strong>Owen was on the board of (what's now called) EV UK when you learned about this incident and tried to figure out how to deal with it, and EV UK was the umbrella organization hosting the org (CEA) that was employing you (including specifically for this work).</strong><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefkhqzw7r8oym\"><sup><a href=\"#fnkhqzw7r8oym\">[1]</a></sup></span>&nbsp;<strong>This seems to me like a key potential conflict of interest, and like it may have warranted someone outside CEA being looped in to decide what to do about this incident. </strong>At first glance, I feel confused about this not having been mentioned in these comments. I'd be curious to hear whether you explicitly thought about that when you were thinking about this incident in 2021?</p><p>That is, if I understand correctly, in some sense Owen had a key position of authority in an organization that in turn technically had authority over the organization you worked at. That said, my rough impression from the outside is that, prior to November 2022, the umbrella organization in practice exerted little influence over what the organizations it hosted did. So this conflict of interest was probably in practice weaker than it would've looked on paper. But still it seems noteworthy.</p><p>More generally, <strong>this makes me realise that it seems like it would be valuable for the community health team to</strong>:</p><ul><li><strong>have a standard protocol for dealing with reports/incidents related to leadership or board members at CEA itself, EV UK, and EV US</strong><ul><li>And <i>perhaps</i> also to other staff at those orgs, and senior staff at any funder providing these orgs with (say) &gt;10% of their funding (which I'd guess might just be Open Phil?)</li></ul></li><li><strong>have that protocol try to reduce reliance on the community health team's own judgment/actions in those cases</strong><ul><li><strong>Probably meaning finding someone similarly suited to this kind of work but who sits outside of those lines of authority, who can deal with the small minority of cases that this protocol applies to. </strong>Or perhaps multiple people, each handling a different subset of cases.</li></ul></li></ul><p>(I'm not saying this should extend to the other orgs EV UK / EV US host, e.g. GWWC or 80k, just CEA and the umbrella orgs themselves.)</p><p>I'd be curious to hear whether such a thing is already in place, and if so what it looks like.</p><p>Caveats in a footnote.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdwa4asgbbq\"><sup><a href=\"#fndwa4asgbbq\">[2]</a></sup></span></p><p><i>(I wrote this just in a personal capacity. I didn't run this by anyone.)</i></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnkhqzw7r8oym\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefkhqzw7r8oym\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'n not sure if this terminology is exactly right. I'm drawing on the post <a href=\"https://forum.effectivealtruism.org/posts/xaMLvzbaBMFjX88Z2/cea-disambiguation\">CEA Disambiguation</a>.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndwa4asgbbq\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdwa4asgbbq\">^</a></strong></sup></span><div class=\"footnote-content\"><p>:&nbsp;</p></div><ul><li>I'm certainly not an expert on how these sorts of things should be handled.</li><li>I think your team has a tricky job that has to involve many tradeoffs.</li><li>I think it's probably disproportionately common for the times when your actions were followed by bad outcomes (even if that wasn't caused by your action, or was you making a good bet but getting unlucky) to become visible and salient.</li><li>I think there are likely many considerations I'm missing.</li><li>I didn't saliently notice worries or ideas about how should the community health team should handle various conflicts of interest prior to November 2022, and didn't saliently notice the question of what to do about incidents relating to senior staff at CEA / EV UK / EV US until this morning, and of course things tend to be easier to spot in hindsight. (OTOH I just hadn't spent much time thinking about the community health team at all, since it wasn't very relevant to my job.)</li></ul></li></ol>", "parentCommentId": "vjtEvaxDHFvfTXwBF", "user": {"username": "MichaelA"}}, {"_id": "yhZWWFci4r4QWFDyy", "postedAt": "2023-02-21T08:38:10.170Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>How do you square:</p><blockquote><p>The order was: I learned about one situation from a third party, then learned the situation described in TIME, then learned of another situation because I asked the woman on a hunch, then learned the<strong> last case</strong> from Owen.</p></blockquote><p>with</p><blockquote><p>No other women raised complaints about him to me, but I learned (in<strong> some cases</strong> from him) of a couple of other situations where his interactions with women in EA were questionable.&nbsp;</p></blockquote><p>Emphasis mine. (Highlighting your first statement implies he informed you of multiple cases and this statement implies he only informed you of one)</p>", "parentCommentId": "dvgq3NignuY4DYwuK", "user": {"username": "Simon_M"}}, {"_id": "BoJgekt4ceRN4oDiA", "postedAt": "2023-02-21T09:29:49.053Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Yeah, I'll note because the memory might slip away that my initial reaction to the TIME article paragraph about Owen was:<br>- horror/disgust<br>- hope that the person was not as central as implied in the text<br>- (get distracted by my own work/life and allow the news to slip into the background of my mind, and allow the hope to transform into an implicit feeling that the person was, hopefully, not as central as Owen was)<br>- have an unjustified implicit belief that the person is not core to EA<br>- find out that that was wrong &lt;-- I am here, and the only reason I can detect my previous implicit beliefs is from the current feeling of surprisal</p>", "parentCommentId": "eKs2jwgzpkp6aLx6N", "user": {"username": "David Mears"}}, {"_id": "hnuWRs5LZnRtfHeCr", "postedAt": "2023-02-21T10:19:54.263Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<blockquote><p>She did not request that I not tell the board - I don't think we discussed that possibility.</p></blockquote><p>To clarify - do you mean you didn't tell them by because you hadn't discussed the possibility that you would, or you <i>did</i> tell them because you didn't discuss the possibility that you wouldn't? That's an important ambiguity!</p><p>Either way, for all my recent disillusionment with EVF, I feel like you've been the one constant I've continually heard good things about, so I hope you learn whatever lessons apply here and continue providing much needed support to the community :)</p>", "parentCommentId": "dvgq3NignuY4DYwuK", "user": {"username": "Arepo"}}, {"_id": "ecjXRR5FkQcqBnHdA", "postedAt": "2023-02-21T11:31:33.195Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Based on this <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=AefiqCcJozwcophTm#AFPLCLNGosuyKnfWZ\">comment</a> and this <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation#:~:text=Shortly%20after%20the%20article%20came%20out%2C%20Julia%20Wise%20(CEA%E2%80%99s%20community%20liaison)%20informed%20the%20EV%20UK%20board%20that%20this%20concerned%20behaviour%20of%20Owen%20Cotton%2DBarratt%3B%5B1%5D%C2%A0the%20incident%20occurred%20more%20than%205%20years%20ago%20and%20was%20reported%20to%20her%20in%202021.\">excerpt from the UK EV board</a> above, my interpretation is that the board as a whole did not know about this until Feb 2023.</p><p>I do think the comment doesn't fully clarify between whether she considered telling the board but opted against this versus this option did not cross her mind back in 2021, but I suspect this is something that will also be part of the investigation, which is why I didn't follow up on this.<br>&nbsp;</p>", "parentCommentId": "hnuWRs5LZnRtfHeCr", "user": {"username": "bruce"}}, {"_id": "PHgjBnqbLQa6Rcdva", "postedAt": "2023-02-21T12:10:07.088Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I suspect it’s because many people like the culture around dating in EA, and are glad EA hasn’t taken a hard line on, e.g., workplace relationships. And people may be worried about the difficulty of drawing lines well, or having outside actors do it, and the chilling effect this could have on people’s ability to date within EA (which I can understand and am sympathetic to).</p>\n<p>I think, though, that the solution is to create guidelines, and then develop creative solutions in accordance with them (e.g., more events/apps designed for EAs interested in dating).</p>\n", "parentCommentId": "hkJhukZWSa7zZWADo", "user": {"username": "hobbes"}}, {"_id": "b8TEmfPLy3xQExhJd", "postedAt": "2023-02-21T12:17:57.989Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Yeah I think this. But I think in some ways it's giving up to assume we give people at least some guidelines/advice. So while it makes me uncomfortable I think we should see if we can produce something that's better than nothing.</p>", "parentCommentId": "PHgjBnqbLQa6Rcdva", "user": {"username": "nathan"}}, {"_id": "cRrks8q9F599AtoTr", "postedAt": "2023-02-21T15:42:09.163Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>There needs to be an emergency interim policy that all reports about the conduct of a board member are brought to the attention of the rest of the board, as well as reports about specified senior staff within EVF. Reports about any other EVF staffer need to be brought to the attention of a  senior official or board member.</p>\n<p>I'm not sure if reporters should be able to opt out, or if they should be hold before reporting that this is the policy. (I'm not sure if it's legally feasible to offer non-reporting of certain information for legal reasons; there may be exposure of various sorts if EVF is deemed to know certain information because CH knows it, yet fails to act.)</p>\n<p>The better long-run approach is probably that reports about people associated with EVF should go elsewhere, but that would take time. So as an interim measure, CH needs to be taken out of the awkward position of having to decide whether to share these reports with leaders.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "D9ktqfDYkrGfdk52D", "postedAt": "2023-02-21T15:52:40.804Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Has the person who Owen harassed been offered some sort of independent external support at community expense? I'm guessing her experience may have been uncomfortable at best since the Time article came out. (I hedged that sentence because, as a man who has never experienced anything like this, I don't want to sound like I know what she is experiencing.)</p>\n<p>I don't know what (if anything) she would find useful, but don't want all the focus on Owen and EVF to obscure the need for the community to offer support for the harassed person through this.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "HLAwc6uougNdBQ9zJ", "postedAt": "2023-02-21T17:03:39.883Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Yeah, it being more pervasive and entangled with EA culture than I thought is one of my takeaways, and I've been spending some time to reflect and think about ways I could help improve things.</p>", "parentCommentId": "3BZMfJXYN3cGYprmp", "user": {"username": "Jonas Vollmer"}}, {"_id": "Y5Mu7drXTHKqNones", "postedAt": "2023-02-21T18:21:26.767Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>19 hours later the posts have dropped off the front page</p>\n<p>On mobile so can’t upload a screenshot, but I have one</p>\n", "parentCommentId": "xhmYthgRp84uMtMRS", "user": {"username": "David Mears"}}, {"_id": "BctpzcCmyk9h4sKRC", "postedAt": "2023-02-21T18:57:09.369Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/qerpqfbrxk3emluf0wgy.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1677005831/mirroredImages/BctpzcCmyk9h4sKRC/gk4g5hqzn9xtycghoszf.png 170w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/fim0jv5uyj1bcno1sj8y.png 340w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/w1xx6xjzehmpwxqkdgxj.png 510w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/of8lticazl8lfl8wqpyr.png 680w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/ficeevsd4jb5bcsv2zis.png 850w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/kfvucabqpucabqrkqy3y.png 1020w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/cke2jmwrbcs1amwtmiej.png 1190w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/r8eqgaltxyrberp5qsbd.png 1360w, https://res.cloudinary.com/cea/image/upload/v1677005831/mirroredImages/BctpzcCmyk9h4sKRC/rr5wz5bssuses2kqwte6.png 1530w, https://res.cloudinary.com/cea/image/upload/v1677005830/mirroredImages/BctpzcCmyk9h4sKRC/ganyoahn0mpjglxvxg4m.png 1675w\"></figure>", "parentCommentId": "Y5Mu7drXTHKqNones", "user": {"username": "Lauren Maria"}}, {"_id": "vwLd3ne4gojqivcsB", "postedAt": "2023-02-21T18:57:39.264Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for your comment and kind words.</p><p>I'll respond to the second set of questions here (we'll respond to comments from the other post there).</p><p>I can’t speak to the external investigation since I’m not involved (it’s going through the board so as to be external to my team).&nbsp;<br><br>In terms of our internal investigation, since I don’t currently know the form it will take there’s not much I can precommit to, but I definitely think we should publicly say new processes or other changes we’re putting in place (or if none, that it’s none), so that people know how we’re planning to approach things in the future.&nbsp;<br><br>I think the categories you’ve laid out are good ones though I don’t yet know if those will end up being exactly the categories I end up using as Ben and I go through this - appreciate you writing them up and flagging them. My strong guess is that relevant categories will include (as I noted in things I wanted to keep in mind during reflection) conflicts of interest and powerful people in EA.</p><p>I want to also address some elephant-in-the-room feeling (which may not be relevant to you, but feels important to say), which is that as I go into this only knowing what I learned recently, it feels important that before an investigation is finished to be able to “<a href=\"https://www.lesswrong.com/posts/t2LGSDwT7zSnAGybG/split-and-commit\"><u>split and commit</u></a>”. I want to hold onto multiple hypotheses, including</p><ul><li>that we made serious mistakes and should change a lot</li><li>that our processes need serious change</li><li>that with the information they had at the time, people acted reasonably</li><li>that people didn’t act reasonably but that the processes are basically fine, since no process is going to yield no mistakes.&nbsp;</li></ul><p>I don’t put equal weight on all those hypotheses, but I do want to be able to hold them, and at the end of the investigation, to say publicly what conclusions I’ve come to about those things.</p>", "parentCommentId": "FSiFrs9zhqEHfo2nj", "user": {"username": "ChanaMessinger"}}, {"_id": "NRGfnywMcL4kRtt69", "postedAt": "2023-02-21T19:15:41.734Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>It's now fallen off the front page, at least for me.</p><p>Pinning seems pretty important.</p>", "parentCommentId": "sKLjmZA89NQFkccoN", "user": {"username": "willbradshaw"}}, {"_id": "92DTAa2vqSBMmDzSY", "postedAt": "2023-02-21T19:33:27.696Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>ok while i'm glad someone is doing bookkeeping of sexual assault cases so that a) there is documented institutional knowledge that doesn't disappear after victims move out of EA, b) people don't interrogate victims \"why didn't you say anything then\" because they did, c) helps building cases against repeat offenders; what was the point of knowing this in 2021 if it took 2 years for him to *voluntarily* resign? this feels like \"i'm only sorry i got caught\", and of EAs in general \"i only started giving a shit about misconduct that i have known for years after it got published in mainstream media and became ~reputation risk~\". making sure people who sometimes do bad things aren't in charge isn't a bad thing to do</p>", "parentCommentId": null, "user": {"username": "perceptionportray"}}, {"_id": "mnwTiZa7i3ejpYzq2", "postedAt": "2023-02-21T20:22:52.917Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Can you comment on the scope of the external investigation EV UK commissioned being limited to the specific incident with OCB instead of a wider domain of e.g. how CH/CEA generally handles sexual misconduct and COIs or CH/CEA's processes in general?&nbsp;</p>", "parentCommentId": "CRdikDzzK2z92GLSs", "user": null}, {"_id": "qXuG4rRtwHndbserb", "postedAt": "2023-02-21T21:52:54.459Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>A quick update: the posts have been drifting in and out of the 3 top Community posts that are shown on the Frontpage, so we've expanded the Community section on the Frontpage temporarily from 3 posts to 5 to give them (and other Community posts being shared right now) a bit more visibility. We plan on reverting back to 3 posts in a few days.</p>", "parentCommentId": "xhmYthgRp84uMtMRS", "user": {"username": "Lizka"}}, {"_id": "dtYvTjfxxsTy5wuxx", "postedAt": "2023-02-21T21:55:27.312Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I shared a quick update <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=qXuG4rRtwHndbserb\">here</a> — tl;dr: we're temporarily expanding the Community section on the Frontpage from 3 posts to 5 to give the posts a bit more visibility. We plan on reverting back to 3 posts in a few days.</p>", "parentCommentId": "NRGfnywMcL4kRtt69", "user": {"username": "Lizka"}}, {"_id": "Ym76BtGmELPXad4kY", "postedAt": "2023-02-21T21:56:49.046Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I shared a quick update <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=qXuG4rRtwHndbserb\">here</a> — tl;dr: we're temporarily expanding the Community section on the Frontpage from 3 posts to 5 to give the posts a bit more visibility. We plan on reverting back to 3 posts in a few days.</p>", "parentCommentId": "BctpzcCmyk9h4sKRC", "user": {"username": "Lizka"}}, {"_id": "v7i4oCBhSGtjjnknA", "postedAt": "2023-02-21T22:55:20.026Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>If the purpose is to keep it on the front page, why not just pin it?</p>", "parentCommentId": "qXuG4rRtwHndbserb", "user": {"username": "pseudonym"}}, {"_id": "X9mieAnfxg3gxMnDb", "postedAt": "2023-02-21T23:04:11.718Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>What processes are in place that gives you this hope? <s>Or do you mean you hope that you would have spontaneously reflected on this and decided to take action after not doing so for two years?</s></p>", "parentCommentId": "tgWBFLMxqujSuGps5", "user": {"username": "pseudonym"}}, {"_id": "RDWaaggK997qvxMeJ", "postedAt": "2023-02-22T05:07:30.512Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>This seems good, both as reparation and as a reward for speaking up.</p>", "parentCommentId": "D9ktqfDYkrGfdk52D", "user": {"username": "Linch"}}, {"_id": "SG9BHAWCTCdWZiMF3", "postedAt": "2023-02-22T10:51:57.639Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>This doesn't really respond to the thrust of what you're saying here, &nbsp;but just responding to:</p><blockquote><p><i>there are no clear guidelines regarding appropriate and inappropriate behavior at different types of EA events</i>&nbsp;</p></blockquote><p>I wanted to check that you're aware that at least EA Global and EAGx events require all attendees to agree to our <a href=\"https://www.effectivealtruism.org/ea-global/faq#general\">code of conduct</a>. To save readers a click, &nbsp;it is currently:<br><br>___<br><br><strong>At EA Global and social events associated with EA Global, you agree to:</strong></p><ul><li>Respect the boundaries of other participants.</li><li>Look out for one another and try to help if you can.</li><li>Adhere to national and local health and safety regulations, as well as any additional policies we institute for EA Global.</li></ul><p><strong>This is a professional learning and networking event. These behaviors don't belong at EA Global or related events:</strong></p><ul><li>Unwanted sexual attention, or sexual harassment of any kind.</li><li>Using the event app to request meetings for romantic or sexual reasons.</li><li>Offensive, disruptive, or discriminatory actions or communication.</li></ul><p>We understand that human interaction is complex. If you feel able, please give each other the benefit of explaining behavior you find unwelcome or offensive.</p><p>If you’re asked to stop a behavior that’s causing a problem for someone, we expect you to stop immediately.</p><p>By submitting this form, you confirm that you will adhere to this Code of Conduct, which applies at the conference and all related social events.</p><p><i>You can contact us at </i><a href=\"mailto:hello@eaglobal.org\"><i>hello@eaglobal.org</i></a><i> if you have any questions.</i></p><p>All our conferences have at least one community contact person, whose role is to be available for personal or interpersonal problems that come up. Feedback can also be left anonymously on the event survey, or on the community health team’s <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScJooJD0Sm2csCYgd0Is6FkpyQa3ket8IIcFzd_FcTRU7avRg/viewform\">anonymous contact form</a>.<br><br>___</p><p>It seems plausible to me that this isn't sufficient, and we're open to input on how these could be improved.</p>", "parentCommentId": "sL2dDpn9DSAqcJcur", "user": {"username": "OllieBase"}}, {"_id": "btZGjuBGej7Y7GSok", "postedAt": "2023-02-22T11:28:19.429Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>This is definitely not sufficient. Compare it to this code of conduct for a <a href=\"https://adubhlaoich.github.io/dance-code-of-conduct/\">non-professional dance event</a>, which is way better. &nbsp;Or to the code of conduct for the other <a href=\"http://media.corporate-ir.net/media_files/irol/88/88189/GlobalCodeConduct.pdf\">EA</a> (the games company), which is the first result if you google \"EA code of conduct\". &nbsp;(The latter would probably be overlong for a conference event, but it's a good indicator of what type of things could go in there).&nbsp;</p><p>The main thing missing in your code is that there is no indication for what to do if someone feels like an offence has occurred. Whereas the dance club code has a clear indication of who to talk to about bad behaviour, where to find them, and what actions will be taken in response.&nbsp;</p><p>I'd also suggest including more examples of unwelcome behavior. For example, if someone is subjected to personal insults at an event, it's presumably unacceptable under the \"disruptive\" rule, but there's a little ambiguity there that might add to reluctance to report. Whereas if they read the <a href=\"https://effectivealtruism.uk/code-of-conduct\">EA UK</a> CoC, they can just point to the \"personal insult\" example.&nbsp;</p>", "parentCommentId": "SG9BHAWCTCdWZiMF3", "user": {"username": "titotal"}}, {"_id": "ugyidQB4qQeWYE4pC", "postedAt": "2023-02-22T17:17:40.955Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for posting this, Ollie! I had seen these guidelines, but it may be helpful to use them to elaborate on what I mean. I think this code of conduct isn't sufficient per the criteria I outlined, in that:</p><ol><li>It lacks a working definition of sexual harassment. The statement says \"unwanted sexual attention, or sexual harassment of any kind.\" This suggests that sexual harassment is different from unwanted sexual attention, but doesn't make clear what the latter is.</li><li>These guidelines don't clarify how expectations regarding appropriate behavior may differ at different kinds of EA events, since \"EA Global or related events\" are lumped together. I think there's a fair bit of consensus that norms regarding behavior should differ between, e.g., &nbsp;EAG after parties and 1-on-1 meetings. (I think <a href=\"https://forum.effectivealtruism.org/users/nathan?mention=user\">@Nathan Young</a> ran some polls that suggested people endorse something along these lines, although a more formal survey would be helpful.)&nbsp;</li><li>Taken literally, these guidelines don't seem to map onto community norms—including, I think, totally reasonable ones—regarding appropriate conduct. For instance, \"These behaviors don't belong at EA Global or related events: Unwanted sexual attention\" would seem to suggest that if Amy hit on Bob at an EAG after party (\"related event\"), and he politely rebuffed her (\"unwanted sexual attention\") and she stopped, Amy would have violated the code of conduct. In practice, I don't think the Bobs of EA would ever report the Amys for this behavior, but that's kind of the problem! &nbsp;If the code of conduct conflicts with established norms in the community—which will be much more powerful drivers of behavior—then they aren't very helpful.&nbsp;</li><li>These guidelines only apply to EAGs/EAGxs (right?), and thus wouldn't apply to, e.g., the misconduct OCB engaged in.</li></ol><p>I think the <a href=\"https://forum.effectivealtruism.org/s/s5zDhfyRPvrpeuRf8/p/yND9aGJgobm5dEXqF\">Guide to norms on the Forum</a> may serve as a useful point of comparison here: these guidlines are detailed, thorough, clear, and include helpful examples. Similarly, I think the most useful part of the EAG code of conduct is this: \"These behaviors don't belong at EA Global... using the event app to request meetings for romantic or sexual reasons.\" <i>That </i>is helpful and clear guidance. Presumably, other kinds of specific behaviors (and why they're problematic or not) could similarly be mentioned and discussed. Indeed, some of Julia's thoughts on this—which are sprinkled around <a href=\"https://forum.effectivealtruism.org/posts/fovDwkBQgTqRMoHZM/power-dynamics-between-people-in-ea\">the Forum</a>—could serve as a useful jumping-off point in developing this.</p><p>I worry that part of what's going on here is that CEA doesn't want to go on the record with a stance of \"here is when it's acceptable to hit on someone in EA\" because this isn't a stance it's seen as acceptable for a professional organization to hold. I can understand that, but if the practice of the community is to tolerate (and indeed, defend and embrace) people being able to connect romantically, then there should be clearer parameters around this.</p><p>If CEA doesn't want to go on the record with that position, perhaps it'd be worth establishing an independent committee to survey the community on the norms they'd want to see in place. Said committe could also assess and analyze other community's guidelines on this stuff (although I suspect most would be similarly vague and/or include blanket bans). These two things could then be used to develop clearer guidelines, which could be posted on the Forum and revised on the basis of community input.</p><p>Again, I know this stuff is really hard, and I do appreciate EAG having a code of conduct that makes clear that certain behaviors aren't allowed. I just think clearer guidance would be helpful.</p>", "parentCommentId": "SG9BHAWCTCdWZiMF3", "user": {"username": "hobbes"}}, {"_id": "SXsK2fmCytDwWza7Z", "postedAt": "2023-02-22T17:22:40.150Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I share Ellie’s disappointment that CEA lacks explicit public guidelines around sexual harassment. I’m glad there’s something in place for EAG, but I find the lack of discussion about power dynamics to be a glaring omission. Power dynamics seem to have been at the root of Owen’s bad behavior, and have been a <a href=\"https://forum.effectivealtruism.org/posts/hbejbRBpd6quqnTAB/red-teaming-cea-s-community-building-work-2#Severe_lack_of_professionalism\">known issue in EA programming since at least 2016</a>, when “a staff member leading [CEA’s Pareto Fellowship program] appeared to plan a romantic relationship with a fellow during the program.”&nbsp;</p><p>Side note: while that issue with the Pareto Fellowship sounded fairly innocuous, if the <a href=\"https://forum.effectivealtruism.org/posts/hbejbRBpd6quqnTAB/red-teaming-cea-s-community-building-work-2#Lack_of_program_evaluation__and_missed_commitments_to_conduct_one\">program evaluation that was promised</a> had actually been published it could have raised awareness of these issues and led to more explicit codes of conduct, potentially preventing offenses like Owen’s (which he claims were at least partially driven by a lack of awareness around power dynamics).</p>", "parentCommentId": "SG9BHAWCTCdWZiMF3", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "Lzt6LwaH9aFJ8PzKm", "postedAt": "2023-02-22T17:38:18.566Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I don't think the thrust of this comment is wrong but I think it is unkind.</p>\n", "parentCommentId": "X9mieAnfxg3gxMnDb", "user": {"username": "Michael_PJ"}}, {"_id": "uuNjmAFMELdzfvKPo", "postedAt": "2023-02-22T17:49:07.341Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Re point 4, CEA's role is different as it pertains to CEA events than for non-CEA events. Only in the former case does it speak with the power of an event organizer, which gives it a clear basis to regulate.</p>\n<p>(I would extend CEA's \"jurisdiction\" as organizer to include everything an event attendee does in the city/region of the event immediately before, during, and immediately after the event.)</p>\n<p>So any statement about conduct in non-CEA spaces should probably be separate from the code of conduct at CEA events.</p>\n", "parentCommentId": "ugyidQB4qQeWYE4pC", "user": {"username": "Jason"}}, {"_id": "bBDJ6A6s7g5MAyXJ4", "postedAt": "2023-02-22T19:06:02.416Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I notice feeling scared about setting norms across all EA events. That's not to say it's bad.</p>\n", "parentCommentId": "ugyidQB4qQeWYE4pC", "user": {"username": "nathan"}}, {"_id": "WwDD2mFKzGhbxh6MR", "postedAt": "2023-02-22T19:17:26.872Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I think it’s good to observe this! I also have some baseline wariness about trying to codify subtle human behaviors into policy; I don’t think people think good guidelines are bad, it’s just hard to develop good guidelines. But it’d also be helpful to even just make explicit what people understand existing norms to be, because then we could have a more grounded conversation about what they should be.</p>\n", "parentCommentId": "bBDJ6A6s7g5MAyXJ4", "user": {"username": "hobbes"}}, {"_id": "svvQsP7xgZLHFQuaJ", "postedAt": "2023-02-22T19:37:55.369Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>yeah that's my sense also.</p>\n<p>Minor not, I doubt CEA is ever gonna write \"you might meet someone you have great chemistry with and make out with them\". So the range of norms they can describe might be limited.</p>\n", "parentCommentId": "WwDD2mFKzGhbxh6MR", "user": {"username": "nathan"}}, {"_id": "pkTsd9MaAB6zKA7za", "postedAt": "2023-02-22T19:46:10.289Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for the feedback, Michael. I have struck out the last sentence.</p><p>I think it comes from a place of bitterness about both the community health team's inaction about this case, and what appears to be insufficient acknowledgement of the community health team's role in allowing things to have played out the way they have. Unlike you, I no longer believe the community health team should be in a <a href=\"https://forum.effectivealtruism.org/posts/vXq4ADWzBnwR2nyqE/keep-ea-high-trust\">high-trust</a> position, as that's what contributed to this problem in the first place. If the community health team wants me to trust them going forward, I want them to show me they have a process that is at least somewhat robust to individuals making human mistakes, and not to ask me to have faith in their \"hope\" that they will eventually spontaneously recognize their mistakes years later, especially ones of this nature.</p><p>I don't blame individuals for making mistakes, but I am disappointed that the comment felt more like mitigating their role here instead of acknowledgement of the problem, and wanted to point this out. I appreciate that a more empathetic approach would be reasonable; I hope you help uphold this standard to other comments and extend this empathy and support to the other women in this community.</p>", "parentCommentId": "Lzt6LwaH9aFJ8PzKm", "user": {"username": "pseudonym"}}, {"_id": "BBEGidY2BZhsetZdZ", "postedAt": "2023-02-22T20:15:42.805Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>So thanks for the comment. And please let me maybe list some of my concerns here. I was going to contact Community Health Team directly, but then I thought that maybe I should write my opinion as a comment here as it may be a generally useful. It is a purely emotional reaction but like, I don't feel fine with what's going on. And because of that, this is also a burner account. For the record, I’m a woman.</p><p>TLTR:&nbsp; I feel that the reaction to the Times and Vox articles within the community starts to be abusive and highly problematic in itself. I feel unsafe and I may resign from being a part of the EA.&nbsp;</p><p>Let me check if I understand Owen’s situation correctly – he acted in an inappropriate way multiple times. If he was told that his behavior is not ok, he always would say sorry and stop interacting in an inappropriate way with this particular person.&nbsp;</p><p>In one of the situations, a woman (let’s call her X) got hurt. X contacted Community Health Team. They reacted, in a way that X appreciated. She thanked. Owen apologized. Later on, X believed &nbsp;that the problem of sexual harassment within the community didn’t disappear, so messaged the TIMES to do something about it. She has, however, contacted Owen and i.e. helped him write his statement. He is sorry, and is going to work on himself to address the problem.</p><p>Am I right?</p><p>If no, please correct me.&nbsp;</p><p>If yes: Owen is sorry, got his consequences (life-breaking consequences), he is going to change. We know his side of the story, and if he is not lying, he seems to me as a creepy guy who really fucked up, but not uprooted rapist. And I’m saying – yes, let’s make sure he and similar people are not a danger to anyone. But I have a feeling that the community takes revenge on him for all the tension the recent events left. This is cruel. I’m honestly worried if the guy is ok. Hope he is.&nbsp;</p><p>And this is just one thing which shocks me. There are other attempts to suggest rigid rules for the whole community (i.e. suggesting not to “sleep around” in general), many comments are polyphobic, people make multiple ableist statements (“if you are socially awkward – don’t have sex”, “being tolerant to weirdness is a problem”). This post is a great example, among others: <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1\">https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1</a>&nbsp;<br>At this point I don’t feel safe in the community and sexual harassment is not my main issue. Which in the perspective of recent event <i>is an absurd</i>. In general I’m shocked by the situation.</p><p>So please help. I have a couple of concerns.&nbsp;</p><ol><li>&nbsp;I feel the community is on its best way to decide that sex is bad if it’s not in closed monogamous relationships. I don’t want to function in such community. I’m polyamorous, I definitely tend to sleep around and I feel liberated by that, as I’m from a religious, conservative culture. &nbsp;I feel that people want to impose rigid rules not where they are needed and prevent harm, but also where they stop freedom of others - my freedom - just to feel safe. I think it won't work, but it will cause harm. Also, as a poly person, I feel quite bullied and shamed. Could you please help address the issue here? At least polyphobia please.</li><li>Should I treat EA community as my workplace and not have sex with people who are just my friends? If no, what about men who are (in some, not direct ways – i.e. longer tenure in the EA) “above me” in the EA power structure, who get my enthusiastic consent? Like, would it be not appropriate to ask them out?&nbsp;</li><li>I’m not from American culture. Cultural norms in my country are quite different - also those regarding sexual behavior, and multiple -isms. I am afraid of making some mistake which hurts someone – but I always believed in this community people would communicate clearly, tell me what happened so I could apologize and address my behavior. Now, I'm afraid of being told that “everything is fine” and getting burned to the ground later on. It may be stupid, but what do I even do about that? I would be scared to talk to some people now. And usually I pride myself to be very outspoken.&nbsp;</li><li>I know it's irrational, but currently I would be scared to report sexual misconduct to people I don't know well, or even to share my experiences with people who are not really close to me, as they may react very strongly (or may feel obliged to act very strongly) without any consideration to other's side basic well-being. I would never want to destroy person's life, I just want to be safe. Health Team's reactions were what I would like to see if I ever was a victim of some misconduct(I know you think you could do more) - and yet, you got a backlash for it. People may be afraid of such backlash and may try to react very strongly each time to avoid it. What do I do?&nbsp;</li></ol>", "parentCommentId": "vjtEvaxDHFvfTXwBF", "user": null}, {"_id": "Sm9EHxb7u4unHkLD2", "postedAt": "2023-02-22T20:42:07.052Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<blockquote><p>But I have a feeling that the community takes revenge on him for all the tension the recent events left. This is cruel. I’m honestly worried if the guy is ok. Hope he is.&nbsp;</p></blockquote><p>The <a href=\"http://www.imitatio.org/ren-girards-legacy\">scapegoat mechanism</a> comes to mind:&nbsp;</p><blockquote><p>The key to Girard's anthropological theory is what he calls the scapegoat mechanism. Just as desires tend to converge on the same object, violence tends to converge on the same victim. The violence of all against all gives way to the violence of all against one. When the crowd vents its violence on a common scapegoat, unity is restored. Sacrificial rites the world over are rooted in this mechanism.</p></blockquote>", "parentCommentId": "BBEGidY2BZhsetZdZ", "user": {"username": "Milan_Griffes"}}, {"_id": "xKsPPCJLiAS2toztr", "postedAt": "2023-02-22T21:38:01.817Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>\"I know it's irrational...\"</p>\n<p>I dunno, I've noticed myself feeling the same recently and it feels pretty rational to me.</p>\n<p>As in I used to feel relatively comfortable sharing/complaining about anything that made me feel uncomfortable in EA, but now when I try to imagine myself doing so I'm like, \"Haha there's no way in <em>hell</em> I'm ever reporting anything to Community Health now and I know I have to be pretty damn careful and selective these days if I want to tell any friends.\"</p>\n<p>I think 'disproportionate reactions disincentivise openness' is a really underappreciated phenomenon in a lot of areas - thanks for highlighting it here.</p>\n<p>(I'm also a woman, for the record.)</p>\n", "parentCommentId": "BBEGidY2BZhsetZdZ", "user": null}, {"_id": "TsskAooR7YndiZe6h", "postedAt": "2023-02-22T22:12:42.499Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>To be fair, I think these kind of over-reactions are happening in lots of places. I think it's particularly pronounced in social/political movements though because they attract a lot of people who are very passionate about social justice. And like, in a way I really admire that, and I think that energy can be very valuable when targeted at the most serious forms of human/nonhuman rights abuses.</p>\n<p>But like, if the bar for resignation is the harmful actions Owen's committed.....almost everyone in the world should resign?</p>\n<p>(I realise I may have lost literally everyone reading this comment with that last sentence. I've only just noticed the extent to which I disagree with the community here and I'm pretty shocked myself, so I should flag that I'm feeling particularly skeptical of my inside view. Maybe best not to debate this in public though as I imagine a lot of details/examples could be triggering for a lot of us.)</p>\n", "parentCommentId": "xKsPPCJLiAS2toztr", "user": null}, {"_id": "bgbngzHY39euq2qGi", "postedAt": "2023-02-22T22:35:46.367Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Sorry to hear this.</p><p>And I'm glad someone said some of this.</p><p>I guess, I think that people are upset and it will become clearer what the concensus &nbsp;is in time and I am confident we as a community can do better than the first ideas we suggest.</p>", "parentCommentId": "BBEGidY2BZhsetZdZ", "user": {"username": "nathan"}}, {"_id": "X7CiBXsQeBqCfStyw", "postedAt": "2023-02-22T22:37:24.767Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Got it - I have lots of thoughts here! Overall, the team has been wanting more contact people for a long time, and I’m definitely in favor of some versions of that (subject to considerations of tractability and prioritization). I still think there might be a few things you mean, but here are some thoughts.</p><ol><li>You might mean something like “a different team doing the same work but with different funding and institutional affiliation”.&nbsp;</li></ol><p>This might be good. It does bear coordination costs, and for instance it might mean we don’t see problematic patterns as easily. I’m not sure what&nbsp;<i>us</i> setting this up would look like; it takes a lot of trust to vouch for someone to handle tradeoffs and a variety of situations with sensitivity; in general if we found someone with the same skillset as people on our team who had free time, we’d want to hire them! (And this would allow syncing up on approach and process; with more separation, we might put ourselves in a position of vouching for someone where we couldn’t mentor or observe their process; that seems potentially problematic). This would take the kind of work and effort where likely we’d have to be quite sure it was the top priority for our team.</p><p>2. You might mean something like having people who aren’t connected to Community Health but pass on information to the Community Health team, perhaps to allow for:</p><ul><li>Greater anonymity</li><li>Wider variety of people so that more of the community has someone they know and feel comfortable with</li><li>Non-CEA support, but still having important information about concerning behavior passed on.</li><li>Passing feedback to the Community Health team</li></ul><p>&nbsp;</p><p>Some considerations:</p><ul><li>To some extent this exists in the form of contact people for city and university groups, and to some extent in the form of friends - if you have a friend who tells you a concerning story, and they’d rather you convey it to Community Health with some details anonymized, that is just fine by us (and happens pretty often)</li><li>We were already looking into programs to allow real-time textual anonymous communication before this incident; that might make some people feel more comfortable talking to us and seeing what thoughts, advice or ideas we have before or instead of deanonymizing themselves</li><li>Something I wish more people knew is that contact people are happy to just give advice about sticky situations; not every call has to be a “report”</li><li>If we pay people, they do have a connection to Community Health, so supporting this financially may undermine one of the goals. That said, it’s not a blocker; it could still be a good idea on net or we could try to get outside funding</li><li>It can be hard to convey stories with enough detail to make it clear why we should take certain actions without deanonymizing people</li><li>See the point above about trust required for vouching.</li><li>I’m not yet sure how many more people would get support via doing this, despite it seeming good - seems like we’ll learn from this situation<br>&nbsp;</li></ul>", "parentCommentId": "Hx5eQ6qQJ5wZMqAPK", "user": {"username": "ChanaMessinger"}}, {"_id": "NgPu3r5NqLpxmBxRK", "postedAt": "2023-02-22T23:19:14.538Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>This post is now again out of the front page.</p>\n", "parentCommentId": "qXuG4rRtwHndbserb", "user": {"username": "Guy Raveh"}}, {"_id": "F5Zfn6MPAw3TBhmua", "postedAt": "2023-02-23T05:39:46.222Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I should add something that I forgot to include.<br><br>I’ve talked about February 3rd as the date I told the boards of EV US and EV UK, because that’s when I told everyone who’s on the current boards.<br><br>As I said, I had previously discussed some but not all of the situation with Nicole Ross, who was my manager and who is on the EV US board. And one of the staff at FHI I informed in 2021 about the situation described in TIME was Toby Ord, who at that time was on the EV UK (then called CEA UK) board. He was no longer on the board by the time I informed both boards about the full situation earlier this month. Our conversation focused on how he could reduce risk at FHI of further problems, and I don’t remember to what extent (if at all) we talked about the board. (I’m avoiding talking with him to see if he remembers more in order not to compromise the investigation.)</p>", "parentCommentId": "vjtEvaxDHFvfTXwBF", "user": {"username": "Julia_Wise"}}, {"_id": "43yRwnEN5AHEPrSih", "postedAt": "2023-02-23T06:13:59.400Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Yeah, but, where is a boundary? And how do we set it? I'm mean - it's not like things you say or do because you are upset have no effect. And in my opinion those reactions already went from \"intense\" to \"dangerous and cruel\".&nbsp;</p>", "parentCommentId": "bgbngzHY39euq2qGi", "user": null}, {"_id": "FpSjFTCNJ4BkwwaGx", "postedAt": "2023-02-23T06:24:03.864Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Ubuntu, thanks for writing it even if it's hard, I'm sending you massive hugs.&nbsp;<br>I disagree with a community to a huge extent and that's why I've created a burner account to do it. I think a lot of people are scared of speaking up now, because we have a very vocal, and pretty aggressive group. A group-think consensus is not something we agree with, and there's a strong rhetoric of you-are-a-bad-person-if-you-think-differently-than-us.<br>In a long-term, however, I'm not willing to trade personal integrity for being a part of a group, because I think the values EA exhibits right now are harmful. So it may happen that I'll leave the community, as stated in the post above.&nbsp;</p>", "parentCommentId": "TsskAooR7YndiZe6h", "user": null}, {"_id": "a5q7CP9By3zBC5wwv", "postedAt": "2023-02-23T09:09:59.586Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>This isn't a story about 'sexual harassment' because there was none / 'sexual harassment' is in fact widely and deeply rooted, as shown by this incident of 'sexual harassment'.</p>", "parentCommentId": "3BZMfJXYN3cGYprmp", "user": {"username": "timunderwood"}}, {"_id": "ncAjdKctiBL4ocW5A", "postedAt": "2023-02-23T09:17:07.277Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I don't think you disagree with the community. You disagree with a smallish number of people who are active on the forums, and who on average are younger and more newly entered the community.&nbsp;</p><p>'the community' as a whole does not have an opinion of this, but due to fear of being seen as defending bad behavior, I think there is a strong tendency to self censor on only one side of this discussion. At the very least I know I self censor.&nbsp;</p>", "parentCommentId": "TsskAooR7YndiZe6h", "user": {"username": "timunderwood"}}, {"_id": "CpnDmqqdyaf3mQ5mk", "postedAt": "2023-02-23T09:22:31.514Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Sorry I'm struggling to understand what this comment is saying. Can you reword it?</p>", "parentCommentId": "a5q7CP9By3zBC5wwv", "user": {"username": "pseudonym"}}, {"_id": "rWaY6bQysdMGMoeyc", "postedAt": "2023-02-23T09:40:27.912Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I don't think Owen did anything that requires more than a private apology and a suggestion from friends to be less of an idiot, and even that is only necessary because the people around him are idiots in a different way.</p>\n<p>However, I accept that some people think that what he did was awful and reprehensible, and I agree with them that a tendency to behaviors of that sort is likely to be common.</p>\n<p>Also, the phrase 'sexual harassment' is not a clear symbol pointing to a concept cluster that is structured the same in everyone's mind, but in fact a muddy and politically contested thing that probably links to a different set of things in my head than yours.</p>\n<p>Hence the request elsewhere in the comments for CEA to give a more precise definition of 'sexual harassment'</p>\n", "parentCommentId": "CpnDmqqdyaf3mQ5mk", "user": {"username": "timunderwood"}}, {"_id": "iyxgkJtEPZNYeo7Sy", "postedAt": "2023-02-23T16:25:28.708Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>In the first case, I initially heard about the situation from a third party, but nearly all the information I knew came from Owen. (I asked the woman if she had concerns about the situation that she wanted to discuss, and I didn’t hear back.)</p>", "parentCommentId": "yhZWWFci4r4QWFDyy", "user": {"username": "Julia_Wise"}}, {"_id": "NgAQmRtJEduewj7eN", "postedAt": "2023-02-23T16:29:05.228Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Can you please elaborate on Owen’s role with CEA (and other constituent projects of EVF) prior to his joining the board in 2020?</p><p>CEA’s website suggests Owen had a fairly significant role prior to joining the board, including during the period when some of his problematic behavior (like the incident described in Time) occurred. For instance, Owen was listed on the earliest version of CEA’s Team webpage (circa <a href=\"http://web.archive.org/web/20140326025550/http:/centreforeffectivealtruism.org/team/\">early 2014</a>) as Director of Research. He seems to have continued to work (or volunteer?) in research roles for several years. In <a href=\"http://web.archive.org/web/20180926234236/https:/www.centreforeffectivealtruism.org/team/\">2018</a>, he began being listed as an “advisor”; on the org chart he and the Executive Director were next to each other, above the rest of the organization. In <a href=\"http://web.archive.org/web/20190429003441/https:/www.centreforeffectivealtruism.org/team\">2019</a>, CEA had a new ED, but Owen occupied the same place on the org chart. His bio on the team page noted: “Owen provides strategic and research advice for&nbsp;CEA, and also works with the Events, Groups, and Grants teams” (in 2018, he apparently worked more with the “individual outreach team”.)</p><p>I recognize that sometimes team webpages are not the most accurate representations of an organization’s actual structure and responsibilities. But I think it is important to establish whether Owen was a CEA employee (or highly influential volunteer) rather than just an influential member of the EA community at the time of his infractions and whether Owen’s roles at CEA materially contributed to his perceived influence in the community (see, for example, this comment thread describing the extensive discretion and influence of the <a href=\"https://forum.effectivealtruism.org/posts/4ScGewqBqdcege85w/centre-for-effective-altruism-cea-an-overview-of-2017-and?commentId=Mcxv5WxobxZanYBeS'\">individual outreach team</a>.) This seems like important context when evaluating:</p><ul><li>Julia’s decision making after receiving the 2021 complaint about Owen (and Toby and Nicole’s decisions after Julia informed them)</li><li>The adequacy of CEA’s policies (past and present) around acceptable employee behavior, particularly with respect to power dynamics</li><li>The degree of forthcomingness of this statement from the board and Owen’s apology</li></ul>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "RjzEKs2gF7LTBFjXa", "postedAt": "2023-02-23T21:35:38.209Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Some background, which is probably pedantic but I want to err on the side of over sharing:</p><ol><li>Your question was addressed to Chana, but, despite not being involved in the initial handling of this case, she felt it would not be appropriate for someone on the community health team to limit the scope of any investigation. So this question should probably be addressed to Max, the executive director, not her.</li><li>Max has since resigned.</li><li>I, his temporary replacement, was not involved in that decision, but I believe that I have the power to override that decision if I disagreed with it. Or, at least, I could attempt to override it, and I have not tried to do so.</li><li>So this comment is <i>my</i> thoughts on having an external party review broader processes apart from this specific case. I expect it's similar to things that Max would have said, but probably not identical.</li></ol><p>We already had a proposal from an external entity to audit some of the CH team’s general processes before the news of this specific incident broke, and I expect (~70%) we will end up working with them, although I'm not sure exactly what the details will be like. We have done this kind of external review before and have had mixed results; as with any kind of peer review/best practice sharing, the median result is that there aren't major changes. Still, I think the potential upside is probably enough to justify doing something like this.</p><p>Note that this audit is “external” in the sense that it will be performed by people who don’t work at CEA, but is “internal” in the sense that it’s triggered by CEA, rather than the board. And in yet a third sense of the word “external:” I am involved, so the audit is “external” in the sense that it involves me, a person not on the community health team but who has the power to fire/reassign/etc. anyone on the community health team.</p><p>It seems like it’s best to start the investigation into this particular incident and announce it as quickly as possible, so I don't have a full plan about other audits we might do, but&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=vwLd3ne4gojqivcsB\"><u>this comment</u></a> resonates with some of my thoughts on potentially sharing information that comes out of this kind of review.&nbsp;</p>", "parentCommentId": "mnwTiZa7i3ejpYzq2", "user": {"username": "Ben_West"}}, {"_id": "BcPDypYGtswQ4oees", "postedAt": "2023-02-24T01:36:16.418Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>The strongest case for #1 is cases in which CH is conflicted out, either because the subject of the report is a friend of everyone in CH, is in their chain of command, or there are other reasons the reporter might reasonably conclude CH has a disqualifying conflict. Not only is that a bad situation for the reporter, it's a bad situation to put people in CH in.</p>\n<p>I could also argue for at least some sort of external involvement in any case involving alleged significant misconduct by a very senior leader.</p>\n", "parentCommentId": "X7CiBXsQeBqCfStyw", "user": {"username": "Jason"}}, {"_id": "2H5oTJaKiciy24Gxo", "postedAt": "2023-02-24T09:44:14.138Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for this, lilly! We really appreciate your input on the norms here, thanks for taking the time :)</p><p>Some things I think I straightforwardly agree with:</p><ul><li>I think you’re right to point out that appropriate standards will differ across a wide range of contexts. This poses a thorny challenge for setting norms.</li><li>Some language in our code of conduct might be unnecessarily vague - “related events” for example, is vague and could be worth clarifying. Thanks for this feedback.</li><li>I think it’s worth considering investigating what the community thinks about norms. I’ll suggest this to Catherine, who's&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/mEkRrDweNSdNdrmvx/plans-for-investigating-and-improving-the-experience-of\"><u>investigating the experience of women, non-binary and trans people in EA</u></a> (obviously, this is relevant to the experience of men in the community too, but that seems like a good project to consider incorporating this into).<br>&nbsp;</li></ul><p>I think there’s a tricky trade-off between clarity and scope here. This isn’t what you’re suggesting, but as a toy example to bring out this trade-off: if we state guidelines that are very specific (e.g. a list of things you mustn’t do in specific contexts), we might fail to prevent harmful behaviour that isn’t on the list. If our guidelines are something extremely wide in scope but non-specific (e.g. “Do unto others as you would have them do unto you”), they’re hard to enforce because people can bend them to justify their behaviour (“but I would have felt fine if they hit on me!”).</p><p>Here’s something related that&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/AmfKu3xB2yGA8z9aZ/ea-global-and-eagx-megathread?commentId=xPkkcDpFkQyfofv4i\"><u>Julia wrote recently</u></a>:</p><blockquote><p>My sense is that pre-specified criteria for what constitutes something like “offensive actions” or “unwanted sexual attention” and what the response should be isn’t realistic or a good idea. A lot of factors play into what constitutes a problem — words, body language, setting (the career fair vs. an afterparty vs. a deserted street outside the venue at night), power and status differences between the people, etc. Responses should be shaped by the wishes of the person who experienced the problem — people have different preferences about how much action they want us to take, whether they want us to act immediately or give them time to think over the options, etc.</p></blockquote><p>Another challenge is that CEA is the host of some events but not the host of some others associated with the conferences. We can’t force an afterparty host or a bar manager to agree to follow our guidelines though we sometimes collaborate on setting norms or encourage certain practices.&nbsp;</p><p>Again, thanks so much for engaging here.</p>", "parentCommentId": "ugyidQB4qQeWYE4pC", "user": {"username": "OllieBase"}}, {"_id": "byQzb3afcTvuKXmoQ", "postedAt": "2023-02-24T11:57:20.669Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Hey Ollie! Hope you're well.&nbsp;</p><blockquote><p>I think there’s a tricky trade-off between clarity and scope here....if we state guidelines that are very specific (e.g. a list of things you mustn’t do in specific contexts), we might fail to prevent harmful behaviour that isn’t on the list.</p></blockquote><p>I want to gently push back on this a bit - <strong>I don't think this is necessarily a tradeoff</strong>. It's not clear to me that the guidelines have to be \"all-inclusive or nothing\". As an example, just because the guidelines say you can't use the swapcard app for dating purposes, it would be pretty unreasonable for people to interpret that as \"oh, the guidelines don't say I can't use the swapcard app to scam people, that must mean this is endorsed by CEA\".</p><p>And even if it's the case that the current guidelines don't explicitly comment against using swapcard to scam other attendees, and this contributes to some degree of \"failing to prevent harmful behaviour that isn't on the list\", that seems like a bad reason to choose to not state \"don't use swapcard for sexual purposes\".</p><p><strong>RE: guidelines that include helpful examples, </strong><a href=\"https://unfccc.int/about-us/code-of-conduct-for-unfccc-conferences-meetings-and-events\"><strong>here's one</strong></a> that I found from 10secs of googling.</p><ul><li><strong>First it defines </strong><a href=\"https://unfccc.int/about-us/code-of-conduct-for-unfccc-conferences-meetings-and-events#:~:text=Harassment%20is%20any%20improper%20or%20unwelcome%20conduct%20that%20might%20reasonably%20be%20expected%20or%20be%20perceived%20to%20cause%20offence%20or%20humiliation%20to%20another%20person.\"><strong>harrassment</strong></a><strong> and </strong><a href=\"https://unfccc.int/about-us/code-of-conduct-for-unfccc-conferences-meetings-and-events#:~:text=Sexual%20harassment%20is,or%20different%20genders.\"><strong>sexual harrassment</strong></a><strong> fairly broadly.</strong> Of course, what exactly counts as \"reasonably be expected or be perceived to cause offence or humiliation\" can differ between people, but this is a marginal improvement compared to current EAG guidelines that simply state \"unwanted sexual attention or sexual harrassment\".</li><li><strong>It then gives a </strong><a href=\"https://unfccc.int/about-us/code-of-conduct-for-unfccc-conferences-meetings-and-events#:~:text=Examples%20of%20harassment%20include%2C%20but%20are%20not%20limited%20to%3A\"><strong>non-exhaustive list</strong></a><strong> of fairly uncontroversial actions</strong> for its context - CEA can adopt its own standard! But I think it's fair to say that just because this list doesn't cover every possibility it doesn't necessarily mean the list is not worth including.</li><li>Notably, it also<strong> outlines a </strong><a href=\"https://unfccc.int/about-us/code-of-conduct-for-unfccc-conferences-meetings-and-events#:~:text=assault%2C%20including%20rape.-,Complaint%20process,-A%20participant%20who\"><strong>complaint process</strong></a><strong> and details possible actions</strong> that may reasonably occur in response to a complaint.&nbsp;</li></ul><p>&nbsp;As I responded to Julia's comment that you linked, I think these lists can be helpful because most reported cases are likely not from people intentionally wishing to cause harm, but differences in norms or communication or expectations around what might be considered harmful. Having a explicit list of actions helps get around these differences by being more precise about actions that are likely to be considered net negative in expectation. &nbsp;If it's the case that there are a lot of examples that are in a grey area, then this may be an argument to exclude those examples, but it isn't really an argument against having a list that contains less ambiguous examples.</p><p>Ditto RE: different settings - this is an argument to have narrower scope for the guidelines, and to not write a single guideline that is intended to cover both the career fair and the afterparty, but not an argument against expressing what's unacceptable under one specific setting (especially when that setting is something as crucial as \"EAG conference time\")</p><p>Lastly, RE: \"Responses should be shaped by the wishes of the person who experienced the problem\" - of course it should be! But a list of possible actions that might be taken can be helpful without committing the team to a set response, but the inclusion of potential actions that can be taken is still reassuring and helpful for people to know what can be possible.</p><p>Again, this was just the first link I clicked,<strong> I don't think it's perfect</strong>, but I think there are multiple aspects of this that CEA could use to help with further iterations of its guidelines.</p><p>&nbsp;</p><blockquote><p>Another challenge is that CEA is the host of some events but not the host of some others associated with the conferences. We can’t force an afterparty host or a bar manager to agree to follow our guidelines though we sometimes collaborate on setting norms or encourage certain practices.&nbsp;</p></blockquote><p>I think it's fine to start from CEA's circle of influence and have good guidelines + norms for CEA events - if things go well this may incentivise other organisers to adopt these practices (or perhaps they won't adopt it, because the context is sufficiently different, which is fine too!) But even if other organisers don't adopt better guidelines, this doesn't seem like a particularly strong argument against adopting clearer guidelines for CEA events. The UNFCCC presumably aren't using \"oh, we can't control what happens in UN Youth events globally, and we can't force them to agree to follow our guidelines\" as an excuse to not have guidelines. But because they have their own guidelines, and many UN Youth events try to emulate what the UN event proper looks like, they will (at least try to) adopt a similar level of formality.</p><p>&nbsp;</p><p>One last reason to err on the side of more precise guidelines echoes <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=sL2dDpn9DSAqcJcur#sL2dDpn9DSAqcJcur\">point 3 </a>in what lilly shared above - if guidelines are vague and more open to interpretation by the Community Health team, this requires a higher level of trust in the CH team's track record and decision-making and management of CoIs, etc. To whatever extent recent events may reflect actual gaps in this process or even just a change in the perception here, erring on the side of clearer guidelines can help with accountability and trust building.</p>", "parentCommentId": "2H5oTJaKiciy24Gxo", "user": {"username": "bruce"}}, {"_id": "ZYkf4ihdz29DafxZi", "postedAt": "2023-03-07T10:35:25.368Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>[Sorry for delay, there were a number of retreats / conferences recently]. Looking into this atm, hoping to know better what the timeline is going to be on getting this info (some people who know more than me have some out of office time) by the end of this week, will update then on timeline for getting a comment written, feel free to ping me if I haven't.<br><br>Edit March 10: Still waiting to get records and info back. Will come back to this in a week if I haven't updated by then.<br><br>Relevant comment now <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=LaJDdLhreBDGwrdjm\">here</a>.</p>", "parentCommentId": "NgAQmRtJEduewj7eN", "user": {"username": "ChanaMessinger"}}, {"_id": "gdLQYpHHjweKGqiTr", "postedAt": "2023-03-07T13:23:53.675Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks. Can you clarify whether the investigation is being handled by EV UK or CEA? I read EV UK's statement as saying they triggered it and are responsible for it (emphasis added):&nbsp;</p><blockquote><p><strong>we are commissioning</strong> an external investigation by an independent law firm into Owen’s behaviour and the Community Health team’s response.</p></blockquote><p>But you are saying that it was triggered by CEA and not EV UK, and also that the ED of CEA is responsible for overseeing it.</p><blockquote><p>it’s triggered by CEA, rather than the board</p></blockquote>", "parentCommentId": "RjzEKs2gF7LTBFjXa", "user": null}, {"_id": "SvctiNGijoCorHv2g", "postedAt": "2023-03-10T03:25:36.048Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>I think we might be talking past each other – I understood you to be asking about Chana/CEA's thoughts on commissioning an investigation whose scope is broader than the one the board commissioned. Is that wrong?</p>", "parentCommentId": "gdLQYpHHjweKGqiTr", "user": {"username": "Ben_West"}}, {"_id": "nZPLciFozpdmjyZdX", "postedAt": "2023-03-16T16:24:59.448Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thanks for providing status updates on this Chana!</p><p>I saw a comment on another thread that raised questions for me about another specific aspect of Owen’s historical role at CEA. Jonas Vollmer <a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=coML6P3qMKhhQH5nK\">wrote</a> “Nick (together with Owen) did a pretty good job turning CEA from a highly dysfunctional into a functional organization during CEA's leadership change in 2018/2019.”&nbsp;</p><p>I’m not sure if Jonas’ impression is accurate, and if so whether he’s referring to Owen’s role on the <a href=\"https://www.centreforeffectivealtruism.org/blog/max-dalton-appointed-as-ceas-executive-director\">selection committee</a> that picked Max as Executive Director or if there was involvement beyond that. So I hope the information you’re collecting will be able to address that.</p>", "parentCommentId": "ZYkf4ihdz29DafxZi", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "ECd5HxYasWuEtj2rP", "postedAt": "2023-03-16T17:15:59.992Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<blockquote><p>&nbsp;I also didn’t seek adequate backup given that I was friends with Owen. (Owen and I live in different countries and were not close friends, but we and our families have spent social time together.) When the woman in the TIME piece told me that her concern was about Owen, I flagged to her that I was friends with him. She and I decided to proceed anyway because we couldn’t think of a better option, <strong>although she felt it was unhealthy for EA that people who had power were entwined in these ways.&nbsp;</strong></p></blockquote><p>This seems to be a recurring issue in a lot of the recent controversies, that decisions are made by a relatively small and close knit group of people. Is there any work going on on ways to reduce this problem in the future?</p>", "parentCommentId": "vjtEvaxDHFvfTXwBF", "user": {"username": "projectionconfusion"}}, {"_id": "LaJDdLhreBDGwrdjm", "postedAt": "2023-03-17T19:05:08.939Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Here’s my current understanding (certainty has been more difficult to achieve than I’d like, in part because the time period of Owen’s involvement traverses a number of changes to the structure of CEA and related organisations, possible there remain errors here but have tried to be clear about my level of certainty):</p><ul><li>Looks like in 2014 (or possibly 2013), he joined&nbsp;some part of the CEA legal entity, eventually working at the <a href=\"http://globalprioritiesproject.org/\">Global Priorities Project</a> (which was legally part of the CEA umbrella organisation) as Director of Research. He believes he was part-time, I couldn’t confirm.<ul><li>The&nbsp;<a href=\"http://globalprioritiesproject.org/about-us/\"><u>Global Priorities Project</u></a> was split between FHI and CEA, but he was on the CEA side.</li></ul></li><li>He reports he started working primarily at FHI in 2015, but may have continued to have a part-time advisory role at CEA the umbrella organisation (I couldn’t confirm).</li><li>He started working with the main part of CEA (CEA-the-project) in summer 2017, part-time (16 hours a week). His part-time contract starting then describes him as “advisor to the CEO” and reporting to the CEO<ul><li>He is described by a CEA employee there at the time as being trusted to give input on many CEA teams. This involved things like participating in staff discussions on Slack and at some meetings, and giving more input on specific projects.</li><li>At least one of the incidents that led to the woman reporting to Julia (as described in Time) happened after he started working for CEA-the-project.</li><li>The advisor position is described by a few people who have a general but not super precise sense of how things were at the time as probably signifying that he was independent from the rest of CEA, given space to think about high level things, but not likely meant to imply peers with the CEO (I hope it’s clear from my hedging words that there’s uncertainty here).</li></ul></li><li>Between 2017 and 2019, he was at a number of CEA team retreats and involved in conversations about CEA leadership.</li><li>In 2018 he was setting up the Research Scholars Program at FHI.</li><li>His last contract with CEA the project is March 2019, reporting directly to the board, still described as an advisor, with even more limited time (8 hours a week)</li><li>He was,&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=nZPLciFozpdmjyZdX\"><u>as you point out</u></a>, one of the people on the hiring committee for CEA’s executive director in 2019.&nbsp;</li><li>He stopped working at CEA-the-project July 2019, and was appointed a trustee &nbsp;(of EV, then called CEA) March 2020.&nbsp;</li><li>From descriptions by others at CEA, from 2020-2023, both in the role of trustee and more generally in the community he had big input on strategic questions and was&nbsp;a trusted senior advisor type; I don’t know how much weight goes on the CEA aspect versus the more general aspect.</li></ul><p>&nbsp;</p><p>My own interpretation is that it seems like there were two parallel tracks:</p><ol><li>Owen was doing work for Global Priorities Project, then moving to FHI, then setting up the Research Scholars Program, and ongoingly doing his own work / research</li><li>People running or high up in CEA trusted Owen quite a bit on strategic questions, and he was given roles that let him give thoughts and strategic input on CEA activity. Starting at least in 2017, he was involved in or spearheaded at least some CEA projects and was involved in important conversations about leadership at CEA. I don’t know how much advising he did beyond that, could have been a lot or a little, but was in a position where his views were given a good amount of weight.</li></ol><p>In terms of evaluation, as you mention in your original comment, I do think things in this category will be inputs to both our internal Community Health review and the <a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation\">external investigation</a> occurring.</p>", "parentCommentId": "NgAQmRtJEduewj7eN", "user": {"username": "ChanaMessinger"}}, {"_id": "F2A4XwZwLwAwuwD8z", "postedAt": "2023-03-18T15:49:56.680Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>Thank you for pulling this together Chana, I really appreciate it! I found your list very informative, and expect the internal and external reviewers will as well.</p><p>FWIW, this makes me view Owen’s <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology\">statement/apology</a>, which makes no mention of his role and associated influence at CEA, considerably more negatively. The following statements seem particularly incomplete/misleading :</p><blockquote><p>I was employed as a researcher at that time.&nbsp;My role didn’t develop to connecting people with different positions until later, and this wasn’t part of my self-conception at the time…&nbsp;I in fact had significant amounts of power. This was not very salient to me but very salient to her… I was aware that hard power (like employer relationships or grantmaking) mattered, but I was pretty blind to the implications of the soft power that came from being older and more central in the community.</p></blockquote>", "parentCommentId": "LaJDdLhreBDGwrdjm", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "tpPLEMCpmtqL8G5Sb", "postedAt": "2023-03-23T15:55:03.092Z", "postId": "9JCkkjKMNL4Hmg4qP", "htmlBody": "<p>In 2021, the woman and I discussed who she wanted to know about the situation. Our focus was on his colleagues at that time and people he might have a mentorship relationship with. I’ve clarified&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9JCkkjKMNL4Hmg4qP/ev-uk-board-statement-on-owen-s-resignation?commentId=F5Zfn6MPAw3TBhmua\"><u>here</u></a> that this did include one person who was a board member of EV UK (then called CEA UK) at the time.</p><p>When the TIME piece publicly described the situation but not either of the people’s identities, Nicole and I decided that the board should know that the account was about Owen (but not the identity of the woman).&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": "hnuWRs5LZnRtfHeCr", "user": {"username": "Julia_Wise"}}]