[{"_id": "qW3JRyuMdmsz7fhzj", "postedAt": "2017-10-20T20:05:40.539Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>Love it. You've made an offer that's hard to refuse.</p>\n", "parentCommentId": null, "user": {"username": "remmelt"}}, {"_id": "DSXtFhipMTmdnjzeo", "postedAt": "2017-10-20T23:04:27.885Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>This is fantastically helpful, thank you so much for taking the time. </p>\n<p>Makes me ponder the value of an &quot;EA Curator.&quot; There's such an overwhelming amount of mind-bending content in the EA universe and its adjacent possible. This list of podcasts clearly only scratches the surface, yet I find myself wondering how I'm going to fit this in with the dozens of other podcast episodes, audiobooks, and print books I have on my plate, let alone other modes of discovery (and worse, how this at some point impinges on the time I have to do actual work on ideas that are so important).</p>\n<p>Many EA's have lists of books.... perhaps there could be an EA Reddit thread for simply voting up or down inspiringly-EA books, articles, blog posts, podcast episodes, etc?</p>\n<p>Or, just a list of EA lists? Rob Wiblin's list of podcasts indexed along with anyone else's podcast list? Bonus for a method to vote individual lists up or down?</p>\n", "parentCommentId": null, "user": {"username": "astupple"}}, {"_id": "N6SMYDhJHAPJaaSyq", "postedAt": "2017-10-21T06:25:46.383Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>Watch this space. CEA is working on putting together a set of ~20 interesting articles and talks that have come out of EA in recent years.</p>\n<p>Speaking for myself, not CEA, I'd also encourage you and others to use the EA forum as a place for linking to great EA content. I don't think we should just flood the forum with content - one of the great things about the forum is that it tends to have higher quality posts than e.g. Facebook. But linking to good content allows both for curation and discussion. </p>\n", "parentCommentId": "DSXtFhipMTmdnjzeo", "user": {"username": "Maxdalton"}}, {"_id": "roLp5MFF7f87Kbm5D", "postedAt": "2017-10-26T20:31:19.106Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>First world problem – I usually listen to podcasts on the iOS podcast app. The EconTalk archives on that app go back to 2015, a lot of the recommended episodes are older. </p>\n<p>I can download episodes in my iPhone browser, but the in-browser player only plays at 1x. Turns out I can't stand listening to podcast audio at 1x anymore (needs to be at least 1.5x to be palatable). </p>\n<p>Any thoughts about how to access old episodes at high playback speeds on an iPhone?</p>\n", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "8RngzKiww2fvYGX4b", "postedAt": "2017-10-26T21:54:55.298Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>I've made a feed with Wiblin's top 10 episodes for easy importing into podcast apps.</p>\n<p><a href=\"http://bit.ly/econtalk-wiblin\">http://bit.ly/econtalk-wiblin</a></p>\n<p>expands to <a href=\"https://dl.getdropbox.com/s/hjdlhtv6xtklhxv/econtalk-wiblin.xml\">https://dl.getdropbox.com/s/hjdlhtv6xtklhxv/econtalk-wiblin.xml</a></p>\n", "parentCommentId": "roLp5MFF7f87Kbm5D", "user": {"username": "DominikPeters"}}, {"_id": "dH94v5CjFBChn64Ty", "postedAt": "2017-10-27T01:17:56.035Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>Looks cool, but I wasn't able to figure out how to use this after 5 minutes of trying. Have a little guidance?</p>\n", "parentCommentId": "8RngzKiww2fvYGX4b", "user": {"username": "Milan_Griffes"}}, {"_id": "mBfFsQBFKAQdBQicY", "postedAt": "2017-10-27T03:48:43.576Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>From the post:</p>\n<p>&quot;To get the old ones you need to subscribe to their archive feeds for previous years:\n2006: For <a href=\"http://itunes.apple.com/us/podcast/econtalk-archives-2006/id279314447\">iTunes</a>. Or, add <a href=\"http://files.libertyfund.org/econtalk/EconTalk2006.xml\">this feed</a>. \nEtc...&quot;</p>\n", "parentCommentId": "roLp5MFF7f87Kbm5D", "user": {"username": "Robert_Wiblin"}}, {"_id": "9J5vpE4kgQNBZ2syp", "postedAt": "2017-10-27T07:50:19.882Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>Not sure about iTunes/iOS; probably I'd need to submit the podcast to Apple for approval which I don't have enough permission to do :) Maybe there are non-Apple-protected apps? Or switch to Android.</p>\n", "parentCommentId": "dH94v5CjFBChn64Ty", "user": {"username": "DominikPeters"}}, {"_id": "Af2ikFHxr3E2rnsdc", "postedAt": "2017-10-29T22:23:39.334Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>I had this same problem and finally cracked it (navigating the iOS podcast world stumps me).</p>\n<p>Step 1: In iOS podcast app, tap &quot;search&quot; in lower right and enter &quot;econtalk&quot;\nStep 2: The app populates the archives going back to 2006, tap on the year you're looking for, such as 2007 and scroll for &quot;Weingast on Violence, Power and a Theory of Everything.&quot;\nStep 3: Tap the three dots to upper right of episode and choose &quot;Download Episode.&quot;\nStep 5: Repeat for all the other archived episodes you want.\nStep 6: Now for the trick- to locate your downloaded episodes, go to the app's main menu and tap &quot;My Podcasts&quot; at the bottom. Disregard the first appearance of &quot;EconTalk,&quot; and instead scroll down past all of the podcasts that you subscribe to. The archived talks you've downloaded will appear close to the bottom, aggregated by year.</p>\n<p>Painful. I'm sure there's a smarter way to do it, maybe Dominik's suggestion below, but this should work for you.</p>\n", "parentCommentId": "roLp5MFF7f87Kbm5D", "user": {"username": "astupple"}}, {"_id": "75KioQQTarXKyn6yG", "postedAt": "2017-11-04T19:38:15.085Z", "postId": "9jLKQK7uREK4Za4vS", "htmlBody": "<p>What an awesome list. I plan to use this in our coming meetups.</p>\n", "parentCommentId": null, "user": {"username": "EschersDemon"}}]