[{"_id": "YjoztZsP4BDd4xbFx", "postedAt": "2023-12-20T11:50:37.993Z", "postId": "9KP2qLnfutRmj6Jm9", "htmlBody": "<p>Congratulations on the preprint, that's really fantastic. Some details were quite surprising to me – I wasn't aware of the extent of shrimp trawl fishery in Northern Europe</p>", "parentCommentId": null, "user": {"username": "Amanda Hansen "}}, {"_id": "n3qNPbw5FnuTCLG6t", "postedAt": "2023-12-20T14:47:08.555Z", "postId": "9KP2qLnfutRmj6Jm9", "htmlBody": "<p>Just a thought I had when reading this post, not sure if this is the right place to suggest this: Maybe shrimp paste is a good candidate for alternative proteins? The texture seems to not be an issue so this might make for an easier engineering task. One might \"only\" need to get the taste right. This idea might be overlooked by western entrepreneurs as it is used in other cuisines than they are familiar with, but the market might be enormous and the impact significant.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "EnkqQXSxtaoE5EGgk", "postedAt": "2023-12-20T21:39:39.816Z", "postId": "9KP2qLnfutRmj6Jm9", "htmlBody": "<h1><strong>Afterword: Are they called \"shrimp\" or \"prawns\"?!</strong></h1><p>This was a great rabbit hole. Some people distinguish between \"shrimp\" and \"prawns\" on biological grounds, arguing that some species are only correctly called \"shrimp\" while others are only correctly called \"prawns\". However, I think that the only defensible conclusion is that both \"shrimp\" and \"prawns\" are terms for the same thing, and the one to use basically depends on the country you're in.</p><p>During my 2023 visit to London, when I arrived at the tattoo studio for my appointment to get a&nbsp;<a href=\"https://www.maurydecaytattoos.com/tattoos?lightbox=dataItem-ldwzq1fn\"><u>shrimp tattoo</u></a>, the first thing the artist asked was: \"So, what's actually the difference between a shrimp and a prawn?\" I realised that even with my expertise in marine ecology and shrimp welfare, I had no clue.</p><p>The Wiktionary entry for \"<a href=\"https://en.wiktionary.org/wiki/shrimp\"><u>shrimp</u></a>\" gives this definition: \"Any of many swimming, often edible, crustaceans, chiefly of the infraorder Caridea or the suborder Dendrobranchiata, with slender legs, long whiskers and a long abdomen.\"</p><p>The Wiktionary entry for \"<a href=\"https://en.wiktionary.org/wiki/prawn\"><u>prawn</u></a>\" gives these definitions:</p><ol><li>A crustacean of the suborder Dendrobranchiata.</li><li>(<i>Commonwealth</i>) A crustacean, sometimes confused with shrimp.</li><li>(<i>Australia, slang</i>) A fool, an idiot. (!!!)</li></ol><p>Both refer to the suborder Dendrobranchiata, and \"shrimp\" adds on the infraorder Caridea. These are two non-overlapping groups that are both contained within decapod crustaceans (see above in this post - Dendrobranchiata includes both penaeid and sergestid shrimp).</p><p>Those same entries also tell us a bit about the etymology:</p><ul><li><i>Shrimp</i>: From Middle English schrimpe (“shrimp, puny person”), ultimately from Proto-Germanic *skrimpaz (“shrivelled”) (compare Middle High German schrimpf (“a scratch, minor wound”), Norwegian skramp (“thin horse, thin man”)), from Proto-Germanic *skrimpaną (“to shrivel”)...</li><li><i>Prawn</i>: First attested early 1400s as various Middle English forms prayne, prane, praune, and prawne, which present no clear cognates in languages other than English. The forms suggest a hypothetical Old English form *prægn, where *æg would have evolved into Middle English *ay, but it is unclear if the word is of Germanic origin, from another European language, or loaned from a substrate.</li></ul><p>It seems fair to say that \"shrimp\" and \"prawn\" both originated with the arbitrariness and whimsy typical of word origins, and that both terms are defined today to refer to mostly the same group of animals.</p><p>I've seen some people claim that \"shrimp\" and \"prawn\" are defined biologically, with particular morphological traits distinguishing between them - such distinctions tend to make reference to minute characteristics of the gills, the shell, or how the legs are spaced. If you accept the above definitions, it does admittedly seem to be true that animals in the infraorder Caridea can be called \"shrimp\" but not \"prawns\". Perhaps biologists follow this usage. But I think it's fair to doubt that the general public, or even farmers, are in the habit of checking the gill characteristics or reading the latest taxonomy papers before they risk using the wrong word.</p><p>It seems far more plausible to me that there is a much simpler rule: people in some countries say \"shrimp\", while people in other countries say \"prawn\". I'd bet that Australians would say \"prawn\" even if you show them an animal from the infraorder Caridea. (<a href=\"https://en.wikipedia.org/wiki/Shrimp_on_the_barbie\"><u>We Australians in particular get sensitive about this.</u></a>) There's even a lobster that is called a \"prawn\" in the United Kingdom - a&nbsp;<i>lobster</i>! Furthermore, both taxonomy and word meanings change over time, and classifications of animals are frequently revised, so I'd be wary of any strict definition based on taxonomy. This is basically the same conclusion reached by Gillett&nbsp;and by Rethink Priorities.</p><p>I found this gem published in a 1969 taxonomic study: \"There has been much confusion in the usage of terms prawns and shrimps. At the Prawn Symposium of the Indo-Pacific Fisheries Council held at Tokyo in 1955 it was decided that the term prawn should be applied to the Penaeids, Pandalids and Palaemonids, while the use of the term shrimp should be restricted to the smaller forms belonging to other families. According to this most of the forms of economic importance here are to be termed prawns.\"</p><p>I love the idea of a roomful of biologists in the 1950s thinking that the best thing to do in Toyko is to have a heated debate about marine invertebrate terminology. And I thought <i>I</i> needed to get out more.</p><p>Now, do&nbsp;<i>not</i> get me started on the difference between a pigeon and a dove.</p>", "parentCommentId": null, "user": {"username": "Ren Springlea"}}, {"_id": "GPQkJBw9BC7MLF3Mj", "postedAt": "2023-12-20T21:41:31.893Z", "postId": "9KP2qLnfutRmj6Jm9", "htmlBody": "<p>I think it's definitely worth some thought, though I don't really have any hot takes beyond what has been discussed in <a href=\"https://forum.effectivealtruism.org/posts/vq5pHzrxLgABAwkhD/#comments\">the comments of this post</a>.</p>", "parentCommentId": "n3qNPbw5FnuTCLG6t", "user": {"username": "Ren Springlea"}}, {"_id": "LBjbRJgbeYZqrrkKE", "postedAt": "2023-12-21T04:26:39.638Z", "postId": "9KP2qLnfutRmj6Jm9", "htmlBody": "<p>Oh, that is potentially embarrassing. I have a feeling I might have read that post, forgot about it and felt like my idea of alternative protein shrimp paste came out of nowhere. Thanks for linking to the article which I now heavily upvoted (at least I hadn't upvoted it before!).</p>", "parentCommentId": "GPQkJBw9BC7MLF3Mj", "user": {"username": "Ulrik Horn"}}]