[{"_id": "h2tha6DXHgP8wy3NP", "postedAt": "2018-06-12T13:43:12.645Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>Thanks for writing this up. Three questions</p>\n<p>The numbers on how useful things are seem quite low to me. What did you write as the ends of the scale? I'm thinking in terms of net promoter scores where anything below a 9 or a 10 is considered neutral or bad. </p>\n<p>Can you explain Hamming circles? I couldn't find out how they worked even after a quick google. </p>\n<p>Did you ask people if there was anything they wanted to do on the weekend but didn't do? I'd be curious to see if people came up with anything. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "wDXabWWyu4efN4ZbC", "postedAt": "2018-06-12T14:14:41.251Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>1) &gt;&quot;The numbers on how useful things are seem quite low to me...&quot;</p>\n<p>On the scale 1 was &quot;Useless&quot; and 10 was &quot;Life-transforming&quot;. But just before asking for feedback, I made a change in the slides and added this meaning to the ratings of the events:</p>\n<blockquote>\n<p>&quot;3 - £100, 5 - £1,000, 8 - £10,000, 10 - £100,000 (e. g. career change)&quot;</p>\n</blockquote>\n<p>I explained it to people as well. This was... not smart. Because of this, some respondents gave low scores to all the events. E.g. someone said that the weekend was &quot;Far more valuable (10-30x the counterfactual)&quot; but did not gave any event a rating that is higher than 4. Others ignored the point and gave high ratings for all events.</p>\n<p>That's why I weighted and normalised the ratings. If someone said that the weekend was &quot;Vastly more valuable (&gt;30x counterfactual)&quot;, I multiplied all their ratings by a constant so that their highest rating would be 10. If they rated the weekend as &quot;Far more valuable (10-30x the counterfactual)&quot;, I multiplied all their ratings so that the highest rating would be 9. 8 for &quot;Much more valuable&quot;, 7 for &quot;Somewhat more valuable&quot;, and 6 for &quot;About as valuable&quot;.</p>\n", "parentCommentId": "h2tha6DXHgP8wy3NP", "user": {"username": "saulius"}}, {"_id": "GAWtGttBiay5eRrMF", "postedAt": "2018-06-12T14:44:42.253Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>2) I will ask the person who ran Hamming circles to explain it, I only participated in half of the event myself. You can get some idea from <a href=\"https://docs.google.com/presentation/d/18hXjwkBrhf89xskL3vL2MKCucChOcODkPO5mhCIEbj8/edit#slide=id.g1b85afcdacd21cc3_0\">the slides</a> (slides 21- 28).</p>\n", "parentCommentId": "h2tha6DXHgP8wy3NP", "user": {"username": "saulius"}}, {"_id": "mnahb2bSKwwQdx3LH", "postedAt": "2018-06-12T15:03:06.701Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>Yeah, I thought the ends of the scales might have been more extreme than we'd normally use. It's probably quite hard to get people to sensibly answer unfamiliar, tricky questions. </p>\n", "parentCommentId": "wDXabWWyu4efN4ZbC", "user": {"username": "MichaelPlant"}}, {"_id": "aPSaCmu5FttfiEYLH", "postedAt": "2018-06-12T15:32:34.890Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>3) Because of your question I added a link to <a href=\"https://docs.google.com/document/d/1ZYT56An4CtOWp_Hc4PCy7QMYtDWcy2msSuTs55tgExA/edit#heading=h.xspz4rc6srkn\">the summary of the responses to the feedback form</a> to the article. Here are responses I see that suggest different activities:</p>\n<ul>\n<li>Perhaps a little more discussion about actual causes e.g. what should be done about AI</li>\n<li>In addition to the 1-1s(which were really useful), the could have been some more structured socialising (eg having people come together in groups of 3 and talk about what they care about, what their problems are, etc and switch groups in eg 5 minute intervals)</li>\n<li>Maybe one minute intros could be on a post it on a wall so that people coming a day late still know who does what.</li>\n</ul>\n<p>We also had some event ideas ourselves that we decided not to include in the weekend:</p>\n<ul>\n<li>Community health session (a discussion of ways to improve the health of the EA community, be that through more diversity, more mutual support etc.)</li>\n<li>Self-care for the altruistic (discussion and support session)</li>\n<li>Discussions/anti-debate on cause prioritisation</li>\n<li>Watching a video of a talk together and then discussing it (vote on a talk to watch during the event)</li>\n<li>Values session: discussing why we have certain moral values</li>\n<li>Problem-solving circle (participants raise problems they have and others try to help them)</li>\n<li>The Humane League Work Party (Encouraging companies to commit to improving conditions on farms - writing letters &amp; emails, phone calls, petitions. Would have been an option throughout the event.)</li>\n<li>Gathering and interpreting data relating to the impact of charities for SoGive</li>\n</ul>\n", "parentCommentId": "h2tha6DXHgP8wy3NP", "user": {"username": "saulius"}}, {"_id": "DQqQnBxSGWtMtaA2i", "postedAt": "2018-06-13T07:58:05.435Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>Hi Saulius. CZEA retreat organizer here.</p>\n<p>Thank you for this report. </p>\n<p>We did &quot;concept explaining somewhat differently:</p>\n<ul>\n<li>a) people could fill out form w/ list of concepts they can/want explain several days earlier. They also had links to recommended articles for many of concepts offered.</li>\n<li>b) during activity we projected on a screen list of groups (~3 people learning, one teaching) and what is their concept for this session.</li>\n<li>c) after 15 minutes we hit the gong and projected list of new groups with new topics.</li>\n</ul>\n<p>It seems to me that Circling and Hamming circles need the people to feel close and trusting each other. We thought about doing Hamming circles on Saturday evening but decided to do something else because the atmosphere was not right. How well it worked for you?</p>\n", "parentCommentId": null, "user": {"username": "Jiri_Nadvornik"}}, {"_id": "mbMqfbkED6FK8msTa", "postedAt": "2018-06-13T12:31:25.601Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>I see, that is very different.</p>\n<p>I only know about the feedback I already presented and the one hamming circle I myself participated in. In my circle all 3 of us were quite connected already. It may have helped but I'm not sure it was necessary. Both of them didn't know what to do with their careers so it was like a mini career-coaching session. It felt productive.</p>\n", "parentCommentId": "DQqQnBxSGWtMtaA2i", "user": {"username": "saulius"}}, {"_id": "mBTBn7QfF9NLPK664", "postedAt": "2018-06-13T13:28:44.064Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>What did you think about the length of the retreat? Would people have liked to stay longer? We're planning to organize a retreat from Thursday to Sunday in The Netherlands in between Christmas and New Year's.</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "NRnHyv6mtEcbGCiRZ", "postedAt": "2018-06-13T18:11:44.197Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>I didn't attend, but someone told me the circling thing was awkward. </p>\n", "parentCommentId": "DQqQnBxSGWtMtaA2i", "user": {"username": "Khorton"}}, {"_id": "W3JwPJsxbtd7LPaE4", "postedAt": "2018-06-13T19:24:22.989Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>oh, I didn't notice that there was a question about circling as well. There are circling meetups  where I did circling with strangers and it was great. So it's not necessary to be close with people before, though the experience is quite different if you are. I imagine that many people will find circling awkward no matter what but in this case I think we simply did not have enough time to get into it. We only allocated 1 hour for it (and I'm not sure even that is enough) and then we decided to do it in the park but walking to the park took much more time than expected. It was the lowest rated activity (3.7) but I didn't include it in the table of the article because I believe that it wasn't given a fair chance.</p>\n", "parentCommentId": "DQqQnBxSGWtMtaA2i", "user": {"username": "saulius"}}, {"_id": "rv5TQe89qXD7dE8WF", "postedAt": "2018-06-13T20:03:27.080Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>I don't know, we simply didn't talk about that at all. My guess is that 4 days is not too long. EA globals sometimes last 3 days, if you include the social on Friday. I believe that a recent group organisers' retreat lasted an entire week. An <a href=\"http://effective-altruism.com/ea/1po/the_first_ai_safety_camp_onwards/\">AI camp</a> lasted 10 days. These latter two events are not quite the same, but I guess you could ask Remmelt Ellen whether they felt too long, I believe he was present in both of them. Hmm, the fact that your event is during winter could matter a bit though, because going outside is usually a refreshing change of atmoshpere during such things.</p>\n<p>By the way, this was not a retreat, we did it in an office in London and people slept elsewhere.</p>\n", "parentCommentId": "mBTBn7QfF9NLPK664", "user": {"username": "saulius"}}, {"_id": "hqCaa47os3SmE3SaS", "postedAt": "2018-06-17T13:20:20.725Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>Alright thanks! :) Remmelt is also organizing this retreat, so we have that info! </p>\n", "parentCommentId": "rv5TQe89qXD7dE8WF", "user": {"username": "SiebeRozendal"}}, {"_id": "WNvS3ayJ7CeJcM2Ki", "postedAt": "2018-06-19T20:15:30.286Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>I guess this very much depends on how individual activities are executed. We had our 2.5 day retreat in Dortmund, Germany about a month ago, and while I didn't see the evaluation results, I got a strong impression that most people agreed on these points (still, take this with a grain of salt):</p>\n<ul>\n<li><p>career discussion in small groups (~3-5) was quite useful; we had about 1 hour per group, and more would probably have been better.</p>\n</li>\n<li><p>double crux (I guess similar to productive disagreement?) was a cool concept, but a bit difficult to execute under the given circumstances (although it worked great for me), for similar reasons as mentioned by you</p>\n</li>\n<li><p>discussion about where to donate - this was, to some degree, what this weekend was primarily about for us, as we raised money on the first evening and then had to figure out where to send it. And while it started very slowly, we ended up spending many hours on Sunday on this (very open) discussion, and it was tremendously valuable. I really didn't expect this, but ultimately, judging from how engaged everybody was, how interesting our conversations were in the end, and how often each of us changed their mind over the course of the discussion, this was a great way to spend our time</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "markus_over"}}, {"_id": "phQTmn7uxqXC47xEi", "postedAt": "2018-07-11T20:29:39.571Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>Thanks for the write-up, I was wondering how concretely did you run the 1-1s. I saw the list of questions in the google slides, did you just ask people to discuss any of these? Also, did you pair people up or did they pair up themselves? </p>\n", "parentCommentId": null, "user": {"username": "Mojmir_duplicate0.24929786764781214"}}, {"_id": "2EQPhc2yWucZ35rjN", "postedAt": "2018-07-12T10:58:14.872Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>People were free to talk about anything they want. I'm pretty sure we told that using the questions was optional. I changed the post slightly to make it more clear. Personally, I didn't use the questions in any of my 1 on 1s. I know some people used the questions and they said that the first two questions (&quot;When did you know that you wanted to be altruistic and why?&quot; and &quot;When did you realise you care about effectiveness and why?&quot;) resulted in long and not very productive conversations. So I moved them to the end in the questions document. I think that the list of questions has a lot of room for improvement. Maybe next time I will say that if they want to use the questions, they should look through the list and decide which question they are the most curious about.</p>\n<p>We paired people up ourselves. We tried to pair up people who don't know each other well and have something in common (e.g. both are excited about the same cause area). We considered letting people pair themselves up but had reservations because some people might get upset if no one wants to talk with them. However, at the end of the first day we told people that if there is someone they'd like to be paired up with on the second day, they can write it on a piece of paper and put it in the box (so that only we could see their preference). But very few (2-4) people did that.</p>\n<p>Btw, we will run an event that is all about 1 on 1s (<a href=\"https://www.facebook.com/events/330349444169839/\">https://www.facebook.com/events/330349444169839/</a>) to see if it is a good stand-alone event (because it could be that it works only in the context of a weekend/conference/retreat). I'll write here about how it went, if I'll remember to do it :)</p>\n", "parentCommentId": "phQTmn7uxqXC47xEi", "user": {"username": "saulius"}}, {"_id": "7dbHwtFnTBDZPYr5P", "postedAt": "2018-07-24T11:31:54.479Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>Those are really useful comments, thanks. I wonder how did the event go?</p>\n", "parentCommentId": "2EQPhc2yWucZ35rjN", "user": {"username": "Mojmir_duplicate0.24929786764781214"}}, {"_id": "D5jbAjjWYhipbobnt", "postedAt": "2018-07-24T12:09:16.634Z", "postId": "9ozoJpPoNBL6Z5BX5", "htmlBody": "<p>It went well,  I asked ~8 people for feedback and it was all positive, almost everyone said that they liked it better than a regular social. One person said that it made them less socially anxious than regular socials. I think we'll organise these every other month or something like that (in addition to socials). </p>\n<p>We first quickly presented what topics each of us would most want to talk about, then we paired people up, based on that (though a lot of pairings were random). Each person had three one on ones and then we all had a picnic. I'm not sure how well it would work if the weather was less nice and we couldn't do it in a park (or a building with many breakout rooms like at the EA weekend).</p>\n", "parentCommentId": "7dbHwtFnTBDZPYr5P", "user": {"username": "saulius"}}]