[{"_id": "bQpciWaLQSQTQTwoH", "postedAt": "2022-09-16T03:27:33.609Z", "postId": "9psGfxocZNDn5eHgj", "htmlBody": "<p>I don't know if there's any explicit documentation, but if you can read code you can check out the relevant logic <a href=\"https://github.com/ForumMagnum/ForumMagnum/blob/master/packages/lesswrong/server/rss.ts#L43\">here</a>. &nbsp;(From digging into how <code>Posts.getParameters</code> <a href=\"https://github.com/ForumMagnum/ForumMagnum/blob/master/packages/lesswrong/lib/vulcan-lib/collections.ts#L112\">works</a> is that you can use any parameter that's used as a term in the <a href=\"https://github.com/ForumMagnum/ForumMagnum/blob/master/packages/lesswrong/lib/collections/posts/views.ts#L152\">default Posts view</a>, but I haven't actually tried it and can't guarantee that it works.) &nbsp;It is a bit gnarly though.</p><p>&nbsp;</p><p>Karma minimums are already supported, but karma maximums don't seem to be - the default Posts view constructs a selector that assumes you're looking for posts with karma greater than or equal to whatever's passed in, when you'd want the reverse operation.</p>", "parentCommentId": null, "user": {"username": "T3t"}}, {"_id": "5ekZCtEXkgmLKQFKm", "postedAt": "2022-09-16T13:27:14.419Z", "postId": "9psGfxocZNDn5eHgj", "htmlBody": "<p>This is super cool, thanks! If I'm not mistaken, I don't see anything about excluding tags in there. That would probably be somewhat too lengthy for the query string anyway.&nbsp;</p><p>I realized my \"posts below X karma\" idea wasn't particularly coherent actually, because every post starts with low karma, so, depending on how often my reader checks (and cache length) it would potentially just show all posts.&nbsp;</p>", "parentCommentId": "bQpciWaLQSQTQTwoH", "user": {"username": "captainjc"}}, {"_id": "niEHATtPFXSfFuNFe", "postedAt": "2022-09-16T13:53:41.595Z", "postId": "9psGfxocZNDn5eHgj", "htmlBody": "<p>I dug a bit deeper and tried a few out. Updating the original post with details.</p>", "parentCommentId": "bQpciWaLQSQTQTwoH", "user": {"username": "captainjc"}}]