[{"_id": "GXNGJvBE6yBhy5oXA", "postedAt": "2023-01-11T16:40:33.199Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>First off, I love the name of this post lolol. Did Mr. McLaughlin think of that one because they got me laughin.&nbsp;<br><br>Want to add some clarity as to what welfarism means as I've heard it:<br>From some I hear welfarism as \"supporting of welfare reforms\"<br>But from others I hear welfarism as \"The welfare of animals matters\"(which means at least in principle being open to considering abolitionist solutions - not sure how much this actually occurs)<br><br>Which one do you mean by welfarism?<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Daryl D'Souza"}}, {"_id": "wivAnTpwTEERQzAEZ", "postedAt": "2023-01-12T17:18:04.529Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>&gt;it has&nbsp;<i>assumed with insufficient reason that all abolitionist thinking and approaches are ineffective</i>.&nbsp;</p><p>I appreciate this post, but this statement is, IMHO, simply not true. Many of us were \"abolitionists\" at one point. Many of us have decades of experience and have studied what has and hasn't moved the needle over the years. See, for example, \"The End of Veganism\" chapter <a href=\"https://www.losingmyreligions.net/\">here</a>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "JpczD3B8mk8HnQrsC", "postedAt": "2023-01-12T20:58:42.092Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>Thanks, the title is probably the main reason I didn't give up on writing all this 😂 I came up with it and Peter approved it.</p>\n<p>In the series, I mean the first. For precisely this reason, when discussing the latter, I use the term \"animal wellbeing\" instead.</p>\n", "parentCommentId": "GXNGJvBE6yBhy5oXA", "user": {"username": "Dhruv Makwana"}}, {"_id": "WP6kEdKFEpkERuyqP", "postedAt": "2023-01-12T22:03:29.938Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>Hi Matt, thanks for commenting. I think it would be helpful if this disagreement was more specific. I list three reasons in the following sentence, go into detail about the first two reason in posts 3 and 2 respectively.</p>\n<p>From reading the chapter you pointed to, it seems like you have had some frustrating experiences with the community, who prioritise purity over effectiveness. I relate, and end up avoiding engaging in those cases.</p>\n<p>I address some of the points made in that chapter and more in the 3rd post, except for the old liberation pledge, for which the chapter assigns a pretty uncharitable motivation. Afaict the internal logic (based on the end of foot-binding girls in China) was sensible, whether or not it works is different: even they have realised it doesn't and have since changed tactics <a href=\"https://paxfauna.org/rethinking-the-liberation-pledge/\">https://paxfauna.org/rethinking-the-liberation-pledge/</a></p>\n<p>Which I think illustrates my overall point: there are advocates out there who are pragmatic, but have an abolitionist-leaning mindset (and sometimes have ideas which are worth considering)</p>\n", "parentCommentId": "wivAnTpwTEERQzAEZ", "user": {"username": "Dhruv Makwana"}}, {"_id": "givgnJpR2rHEth7oe", "postedAt": "2023-01-13T18:19:43.804Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>It's so unrealistic for people to claim the abolitionist movement has failed. It's made impressive progress, especially considering the relatively brief time it's been happening. Consider the centuries it's taken for progress with civil rights, womens' rights, gay rights. Just because things are terrible for animals doesn't mean they wouldn't have been even worse were it not for the abolitionist movement.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mary Finelli"}}, {"_id": "t9F97zyu9MwFHkxkm", "postedAt": "2023-01-13T20:02:49.393Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>Hi Dhruv! I have been waiting for your post since you told me your plans in EAG London. I'm glad it's finally public!<br><br>My thoughts:</p><ol><li>There is some additional support for your claim that \"go vegan\" asks are more effective for individual behaviour change. From <a href=\"https://www.sciencedirect.com/science/article/pii/S0195666321001847\">Mathur et al</a>.:<br>\"Results were interesting regarding the type of recommendation made: studies of interventions making a “go vegan” recommendation appeared to have larger effects than studies of interventions making no recommendation (effect modification <i>RR</i>&nbsp;=&nbsp;1<i>.</i>31; 95% CI: [1<i>.</i>06, 1<i>.</i>62]; <i>p</i>&nbsp;=&nbsp;0<i>.</i>03), and point estimates in studies whose interventions recommended “going vegetarian” (1<i>.</i>03) or “reducing consumption” (1.00) heuristically suggested some degree of dose-response such that studies with broader-scoped recommendations (e.g., “go vegan” versus “reduce meat consumption”) typically had larger effects.\"&nbsp;<br><br>However, it's important to note that many of the studies used in this meta-analysis have significant limitations, so more evidence is needed.</li><li>I believe that you underestimate the extent to which your proposed interventions are supported by the EA movement. I agree that alternative protein and welfare work receive the majority of EA animal funding, but there are other examples as well. For example:<br>-<a href=\"https://animalcharityevaluators.org/donation-advice/ace-movement-grants/\">ACE's movement grants support many different kinds of work</a><br>-ACE's former and present Standout Charities include Dansk Vegetarisk Forening, Material Innovation Initiative, xiaobuVEGAN, Sociedade Vegetariana Brasileira, Vegetarianos Hoy<strong>, &nbsp;</strong>Non-human Rights, Nonhuman Rights Project, Proveg, Vegan Outreach<br>-EA Animal Welfare Fund previously funded Veganuary<br>-Mercy for Animals has its own <a href=\"https://thetransfarmationproject.org\">Transfarmation</a> project<br>-Some high net worth individuals who identify as EAs funded several documentaries for animals.&nbsp;<br><br>Many EA-aligned organizations, including those that focus on animal welfare, do a lot of work on increasing plant-based food and education. However, it can be difficult for them to demonstrate the impact of this work to their supporters. If you look at the annual reports of different organizations, you'll see that the impact of their institutional animal product reduction work is often smaller than that of their animal welfare work.&nbsp;<br>&nbsp;</li><li>It's important to remember that EA is not the entirety of the animal advocacy movement. There are already many groups working on the interventions you propose in your last section. However, EA's focus on neglected interventions is consistent with promoting diversity in the movement. As EA becomes more dominant in animal advocacy, I agree that a greater proportion of EA funding should be spent on exploring and testing different approaches.<br>&nbsp;</li><li>Unfortunately, I don't think you provide enough evidence in your final section for the cost-effectiveness of your proposed interventions. I'm skeptical that scaling animal agriculture transitions would be a cost-effective intervention. I know of no industry that has ever disappeared because someone tried to attract its workers with more lucrative careers. Subsidizing farmers' transitions to plant-based farming seems similar to paying people to avoid animal products, and I think both approaches would be prohibitively expensive. I believe that this intervention has symbolic value, and it can be useful for pitching a story to the media. It also seems to help with finding some whistleblowers from the industry. But I don't think it's scaleable.<br><br>For street outreach, I wish that people who tried this intervention would collect contact information from the people they reached out to. The case for this intervention would be stronger if they tracked the behavior of these people. I understand that it can be expensive to demonstrate causal impact based on experimental data, but for certain interventions like Veganuary, there are some measurable results (such as the number of pledges or search traffic) that warrant further higher-quality research. However, I don't see similar evidence for the interventions you propose.<br><br>I agree with you that lack of evidence is not the proof of being ineffective. I expect that there are many interventions not tried by EAs that will be shown to be very effective. For this reason I agree that some EA budget should be spent on exploration. But there is also good reason to prioritise interventions that we currently have the strongest evidence for effectiveness.</li></ol>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "2aBydDkWZvNRMHQih", "postedAt": "2023-01-14T14:04:36.741Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>Hi Emre, thanks for remembering, waiting, and your details comments! :D</p><ol><li>Yes I link to that study and basically agree, more evidence would be great.<br>&nbsp;</li><li>I don't think I do, but &nbsp;I could have acknowledged that a little better in the writing, say by pointing to movement building getting 5-14% of funds based <a href=\"https://forum.effectivealtruism.org/posts/6H9QGZkdMzDEdKNCX/analysis-of-ea-funding-within-animal-welfare-from-2019-2021-1#Raw_totals_in___\">this table</a>. But also...<br><br>In terms of the 8 examples you give, only 3 are still considered standout: I pointed out <a href=\"https://forum.effectivealtruism.org/posts/Z2tFtS3azcxT2yyxf#No_Plans_to__Re_Visit\">here</a> that \"charities like&nbsp;<a href=\"https://animalcharityevaluators.org/charity-review/the-nonhuman-rights-project/\"><u>NHRP</u></a> or&nbsp;<a href=\"https://funds.effectivealtruism.org/funds/payouts/march-2018-animal-welfare-fund-grants\"><u>ProVeg</u></a> which were previously considered are now ignored\", and SVB, Vegetarians Hoy, Vegan Outreach are not considered to be standout charities. <strong>I think your examples point more to funding for neglected/LMICs (great!) but not to an openness to different approaches</strong>: for example, the reasoning for the <a href=\"https://funds.effectivealtruism.org/funds/payouts/november-2021-animal-welfare-fund-grants\">one-time funding of Veganuary</a> was specifically given for Latin-American staff costs.<br><br>I did not know about/come across Transfarmation, so thanks for that, and I'd be curious to hear about which documentaries and how much they cost.<br>&nbsp;</li><li>Agree with direction, though not assessment of current status quo. I think there's more to the current major strands in EAA than just \"these are neglected\": in posts 3 &amp; 4 I tried to give examples of how other are thought to be ineffective. Also, there might be \"many other groups\" working on the suggested interventions, but it's not clear any are doing it with an effectiveness mindset, which would be a valuable contribution.<br>&nbsp;</li><li><i>\"I know of no industry that has ever disappeared because someone tried to attract its workers with more lucrative careers.\"</i><br>It's not just money, but stress/wellbeing and changing social &amp; market pressures.<br><br><i>\"Subsidizing farmers' transitions to plant-based farming seems similar to paying people to avoid animal products, and I think both approaches would be prohibitively expensive.\"</i><br>I strongly disagree with this given what I said above, and the fact they could transition to profitable businesses. I don't think the charities currently helping with this are getting a huge amount of money, but could be averting quite a lot of lives. All this being said, it shouldn't be too difficult to settle this intuition joust with a cost-effectiveness analysis, which I think we both agree on.<br><br><i>\"I wish that people who tried this intervention would collect contact information from the people they reached out to. \"</i><br>I wish that people with an effectiveness mindset helped people running such interventions to do such things ;-)&nbsp;</li></ol>", "parentCommentId": "t9F97zyu9MwFHkxkm", "user": {"username": "Dhruv Makwana"}}, {"_id": "kZiDucJHAhGYRSDZ5", "postedAt": "2023-02-14T10:23:59.714Z", "postId": "9qq53Hy4PKYLyDutD", "htmlBody": "<p>Hi again! Thank you very much for your response. You can check out <a href=\"https://www.greenbaumfoundation.org\">this website</a> for documentaries.</p>", "parentCommentId": "2aBydDkWZvNRMHQih", "user": {"username": "emre kaplan"}}]