[{"_id": "HJdXF8zJwfvunoEHt", "postedAt": "2022-12-06T12:52:54.632Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Who is the most underrated critic of EA who EAs should engage with more? (one name per answer)</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "GQmtgoi2mgDbemjuj", "postedAt": "2022-12-06T12:53:27.706Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>What does a good whistleblowing process look like? Aim to write it succinctly</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "H9LbGrYMZtGdqw3Tn", "postedAt": "2022-12-06T14:04:09.113Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Can we get the Polis report* too?</p>\n<p>*I can't help but wonder if this potential pun is the reason they chose this name</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "ZruvjDn7pRBSBCyXj", "postedAt": "2022-12-06T14:04:54.099Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Can people who missed the post yesterday add more suggestions?</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "Tqxo8FmpWQgFrpbSx", "postedAt": "2022-12-06T14:21:46.869Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Yes though maybe add them to both. I may remove them though because last polis poll just had way too many suggestions so I'm trying to get those that are concensus.</p>", "parentCommentId": "ZruvjDn7pRBSBCyXj", "user": {"username": "nathan"}}, {"_id": "SXYZQiBEqZ2oRWBqq", "postedAt": "2022-12-06T14:31:09.498Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>What concrete steps could the EA community take to signal that it's not a good fit for everyone and that there are different levels of useful commitment?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "jH4w9YdCzJfomHRWh", "postedAt": "2022-12-06T19:34:02.605Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Anand Giridharadas</p>", "parentCommentId": "HJdXF8zJwfvunoEHt", "user": {"username": "Jasper Meyer"}}, {"_id": "TSFYobyuqZ3Zc3BG8", "postedAt": "2022-12-06T21:06:06.484Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Larry Temkin is a decent candidate. I think he has plenty of misunderstandings about EA broadly, but he also defends many views that are contrary to common EA approaches and wrote a whole book about his perspective on philanthropy. As far as philosopher critics go, he is a decent mixture of a) representing a variety of perspectives unpopular among EAs and 2) doing so in a rigorous and analytic way EAs are reasonably likely to appreciate, in particular he has been socially close to many EA philosophers, especially Derek Parfit.</p>\n", "parentCommentId": "HJdXF8zJwfvunoEHt", "user": {"username": "Devin Kalish"}}, {"_id": "4tCdQexgcwFGAhX6E", "postedAt": "2022-12-06T22:11:17.731Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>One day doesn't seem like very long to get topics? I guess you got a decent amount of engagement, though.</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "eqHnNeQsvWAwLhXhG", "postedAt": "2022-12-07T04:12:56.558Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>When I wrote yesterday's comment (about the core community not being a good fit for everyone), I think I had a few things in mind, one of which is captured well in the GWWC-related comment about different levels of involvement. &nbsp;The other two, which are more difficult to make concrete, were:</p><ul><li>The EA community has a certain distinct <i>culture</i> which isn't a good fit for everyone (for any number of reasons). Although I'm new and not an EA historian at all, I suggest that many of those cultural features are likely a reflection of the specific people and circles who (re?)discovered the EA principles, rather than necessary outgrowths of the core principles themselves. The culture is a means to an end, and there should be places for people to practice the core EA principles without partaking much in the EA culture.</li><li>It seems there should be more communities devoted to specializing in what one might consider facets or subsets of the \"full\" or \"well-rounded\" EA experience. There's a lot to keep up-to-date with in EA, and that might feel overwhelming (especially for those of us with non-EA jobs). Or someone might not want to identify with EA as a whole for any number of reasons; it is inevitably going to be a controversial social movement. So for instance, people could be encouraged to join (e.g.) a \"Maximizing Global Health\" community, and make that part of their social identity, if that was a better fit for them for whatever reason.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "XjB2bCdd3DPxPBshs", "postedAt": "2022-12-07T10:17:40.324Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Really weird to group together Gebru and Torres.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "exxiLCjydiuwAp2tZ", "postedAt": "2022-12-07T10:20:00.878Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Fair theoretically, but I think some core issues are missing from this poll as it is now, which I tried to fix (and got some upvotes on at least some), and I wonder how many votes they got before being removed.</p>\n", "parentCommentId": "Tqxo8FmpWQgFrpbSx", "user": {"username": "Guy Raveh"}}, {"_id": "B5g7te9wWoa3hPEFx", "postedAt": "2022-12-07T10:21:44.940Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>I agree with you in theory, but in practice I'm worried that the first bullet point will serve as an excuse to make EA culture even less inclusive.</p>\n", "parentCommentId": "eqHnNeQsvWAwLhXhG", "user": {"username": "Guy Raveh"}}, {"_id": "JEqX8ozwZWPvqJGcX", "postedAt": "2022-12-07T12:08:07.913Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>I don't think so. They often retweet and cite each other.</p>", "parentCommentId": "XjB2bCdd3DPxPBshs", "user": {"username": "nathan"}}, {"_id": "8Rg6jpznfwN5vSAJ2", "postedAt": "2022-12-07T13:54:05.134Z", "postId": "9R5eJhimR3QtjNFmP", "htmlBody": "<p>Suggestion: I think <strong>building epistemic health infrastructure</strong> is currently the most effective way to improve EA epistemic health, and is the biggest gap in EA epistemics.</p><p>I elaborated on this in my <a href=\"https://forum.effectivealtruism.org/posts/ubDKFzHtMqhqZP4am/babel-s-shortform?commentId=goDvJPCzGYDgYiXpD\">shortform</a>. If the suggestion above seems too vague, there're also examples in the shortform. (I plan to coordinate a discussion/brainstorming on this topic among people with relevant interests; please do PM me if you're interested)</p><p>(I was late to the party, but since <a href=\"https://forum.effectivealtruism.org/posts/9R5eJhimR3QtjNFmP/what-specific-changes-should-we-as-a-community-make-to-the-1?commentId=Tqxo8FmpWQgFrpbSx\">Nathan encourages late comments</a>, I'm posting my suggestion anyways. I'm posting the comment also under this post besides the previous one, because Nathan said that \"maybe add them to both\"; please correct me if that's my misunderstanding)</p>", "parentCommentId": null, "user": {"username": "TianyiQ"}}]