[{"_id": "p75M88WWFrA6ExD8T", "postedAt": "2018-06-07T09:31:17.194Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Interesting.  It would be useful to know what people did instead.  So in the AE study if people are eating less pork then what are they doing instead?  If people are reducing animal flesh consumption across the board in the reducetarian study then what are they consuming instead?  Whilst some sort of comparison with industry promotion could be interesting. So how does the cost / impact of reduction messaging compare to increase messaging of the industry?  For <a href=\"http://www.pig-world.co.uk/news/pork-midweek-meals-campaign-reaches-26-million-households.html\">example</a>.</p>\n", "parentCommentId": null, "user": {"username": "KevinWatkinson"}}, {"_id": "B9qkyyhkwb4raXHuh", "postedAt": "2018-06-07T10:28:17.020Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Thank you for this! </p>\n<p>I wonder if EAAs might think that the main effect of their animal advocacy is not necessarily the immediate meat consumption change, but more the longer term moral circle expansion. For example Jacy Reese from the Sentience Institute <a href=\"http://effective-altruism.com/ea/1l0/why_i_prioritize_moral_circle_expansion_over/\">recently argued in this direction</a>. If so, it might be more interesting to test for the level of speciesism or level of empathy towards animals before and after those interventions. I'd guess that decreasing speciesism is easier than causing a change in consumption habits, so for moral circle expansion purposes those results could be encouraging, correct?</p>\n", "parentCommentId": null, "user": {"username": "MaxRa"}}, {"_id": "57S7PRMybm7Ccr3Jn", "postedAt": "2018-06-07T14:34:27.256Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Perhaps the impact on changing the Suffering Attitude could be important here. It's not clear yet to me how enduring this attitude change is, especially extended into the far future, but you probably could put some sort of value on it? I'd be interested in further testing on this.</p>\n", "parentCommentId": "B9qkyyhkwb4raXHuh", "user": {"username": "Peter_Hurford"}}, {"_id": "H4CTtwPP2khTJRXeD", "postedAt": "2018-06-07T21:05:55.453Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>The <a href=\"http://www.jimaceverett.com/wp-content/uploads/2017/12/Caviola-Everett-and-Faber-2018-Speciesism-JPSP-Pre-Print.pdf\">speciesism scale</a> that was recently published by an EA psychologist might be useful for this purpose.</p>\n<p>Ha, cool, you were also involved in the Sentience Institute <a href=\"https://www.sentienceinstitute.org/animal-farming-attitudes-survey-2017\">study about attitudes towards US farm animals</a> that probably also contains useful methodology in this direction.</p>\n", "parentCommentId": "57S7PRMybm7Ccr3Jn", "user": {"username": "MaxRa"}}, {"_id": "BARLvcdLxC8dqWqW3", "postedAt": "2018-06-08T00:43:46.740Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p><em>Human DALYs</em> deal with positive productive years added to a human life. <em>Pig years saved</em> deal with reducing suffering via fewer animals being born. I'm not sure that these are analogous enough to directly compare them in this way.</p>\n<p>For example, if you follow negative average preference utilitarianism, the additional frustrated preferences averted through <em>pig-years-saved</em> would presumably be more valuable than an equivalent number of <em>human-disability-adjusted-life-years</em>, which would only slightly decrease the average frustrated preferences.</p>\n<p>Different meta-ethical theories will deal with the difference between DALYs and pig-years-saved differently. This may affect how you view the comparison between them.</p>\n<p>(With that said, I find these results sobering. Especially the part where video outperforms VR possibly due to a negative multiplier on VR.)</p>\n", "parentCommentId": null, "user": {"username": "EricHerboso"}}, {"_id": "isvnkix9rQp7PGa9k", "postedAt": "2018-06-08T05:18:50.816Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<blockquote>\n<p> I'm not sure that these are analogous enough to directly compare them in this way.</p>\n</blockquote>\n<p>Every time we do cost-effectiveness analysis we need to make philosophical judgment calls about what we value. I agree that these &quot;$ per thing&quot; measures can be crude and are meant more for illustrative purposes than as a rigorous, binding, rationally compelling comparison. People could feel free to disagree and think that pig years saved are far more important (perhaps due to preference utilitarianism, or thinking the suffering averted is far more intense, etc.). </p>\n<p>Despite this, we are faced with a genuine choice here and need some way to navigate that choice, even if we may do that with different values and philosophical backgrounds in mind.</p>\n<blockquote>\n<p>Especially the part where video outperforms VR possibly due to a negative multiplier on VR.</p>\n</blockquote>\n<p>I'm not sure how seriously I would take that proposition -- it appears to largely be guesswork. This study did not find any statistically significant difference in either direction between 360 VR and 2D video and both Faunalytics and Animal Equality leave open the possibility that novelty effects not captured in this study may still make 360 VR more compelling. Given my assessment that they're roughly equal in cost per person reached, I would not try to make a case for 2D video over 360 VR.</p>\n", "parentCommentId": "BARLvcdLxC8dqWqW3", "user": {"username": "Peter_Hurford"}}, {"_id": "3xQZ3eRJujjFr8Xe6", "postedAt": "2018-06-09T12:26:05.729Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>The assumptions here about the persistence of the effect seem over-optimistic.  </p>\n<p>You measure the effect after one month and then assume that it will persist for 1 to 12 years (90% CI). So, you assign a less than 10% chance that the effect will fade out within a year. You made this decision &quot;arbitrarily&quot; on the basis of an ACE meta-analysis investigating how long people who say they don't eat meat have not eaten meat without interruption. The first to say is that this is testing a very different population and so is of questionable relevance to the Animal Equality intervention. In the ACE study, the sample is people who say they have made the commitment to be vegetarian. In yours, it is people who have been shown a video who say they haven't eaten pork a month on. </p>\n<p>Given that we are working with fairly arbitrary intuitions here, I find it highly surprising that the 90% CI doesn't include fade out of the effect within a year. My <em>median</em> estimate is that the effect fades out within a year. I'd be curious to hear what other people think about this. </p>\n<p>But you think there is around a 10% chance that the effect will fade out after 12 years. The claim is that there is a 10% chance that being shown an animal advocacy video on one day will have an effect on consumption decisions 12 years down the line. I would put the chance of this at ~0%. </p>\n<p>If I am right and a more reasonable estimate of persistence seems to be closer to 6 months (I actually think I'm being conservative here - I'd guess closer to 2-3 months), this suggests you should revise your cost-effectiveness estimate down by an order of magnitude. </p>\n", "parentCommentId": null, "user": null}, {"_id": "8C2WvrKDfNdFMJxEy", "postedAt": "2018-06-11T07:49:32.589Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>The claim does not seem to be exactly, that there is a 10% chance of an animal advocacy video affecting consumption decisions after 12 years for a given individual. </p>\n<p>I'd interpret it as: there is a 5% chance of the mean duration of reduction, conditioned on the participant reporting to change their behaviour based on the video being higher than 12 years. </p>\n<p>This could for example also be achieved by having a very long term impact on very few participants. This interpretation seems a lot more plausible, although i am not certain at all, wheter that claim correct. Long term follow up data would certainly be very helpful. </p>\n", "parentCommentId": "3xQZ3eRJujjFr8Xe6", "user": {"username": "Flodorner"}}, {"_id": "6XiAtymPJN2CP856N", "postedAt": "2018-06-11T08:01:08.121Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Yes I was speaking somewhat loosely. It is nevertheless in my view very implausible that the intervention would sustain its effect for that long - we're talking about the effect of one video here. Do you think the chance of fade-out within a year is less than 10%? What is your median estimate?</p>\n", "parentCommentId": "8C2WvrKDfNdFMJxEy", "user": null}, {"_id": "8cThAALEYvw6uG4Z7", "postedAt": "2018-06-11T08:55:19.488Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Are you talking about the individual level, or the mean? My estimate would be, that for the median individual, the effect will have faded out after at most 6 months. However, the mean might be influenced by the tails quite strongly. </p>\n<p>Thinking about it for a bit longer, a mean effect of 12 years does seem quite implausible, though. In the limiting case, where only the tails matter, this would be equivalent to convincing around 25% of the initially influenced students to stop eating pork for the rest of their lives. </p>\n<p>The upper bound for my 90% confidence interval for the mean seems to be around 3 years, while the lower bound is at 3 months. The probability mass within the interval is mostly centered to the left.</p>\n", "parentCommentId": "6XiAtymPJN2CP856N", "user": {"username": "Flodorner"}}, {"_id": "cZ26K52ebfLEdg7wC", "postedAt": "2018-06-11T16:38:18.339Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<blockquote>\n<p>Despite this, we are faced with a genuine choice here and need some way to navigate that choice, even if we may do that with different values and philosophical backgrounds in mind.</p>\n</blockquote>\n<p>Of course. But we're comparing two such different things here that I wouldn't claim things like, &quot;. . . an estimate of $310 per pig year saved . . . which is worse than human-focused interventions even from a species neutral perspective&quot; - to me, that's much worse than saying things like, &quot;it costs $300 to provide biweekly CBT for a depressed Kenyan for a month and $50 to provide a daily hot meal for a homeless American for a month, so the former is worse than the latter even from a nationality neutral perspective&quot;, which you wouldn't say.</p>\n", "parentCommentId": "isvnkix9rQp7PGa9k", "user": null}, {"_id": "kt3yWRbgcEZ5jD86g", "postedAt": "2018-06-11T16:47:38.063Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<blockquote>\n<p>evidence in this study points to an estimate of $310 per pig year saved</p>\n</blockquote>\n<p>Christ, I'd give up pork for 4 years for that price. Any takers? 10% discount if it's in the next 24 hours; I'm pretty cash-strapped at the moment.</p>\n", "parentCommentId": null, "user": null}, {"_id": "LbPvi9ypvLRFmCkxL", "postedAt": "2018-06-11T17:56:20.877Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>I disagree with your analogy. I do think it's meaningful to say that I would prefer human-focused interventions at that price tradeoff and that it isn't because of speciesist attitudes. So they're at least comparable enough for people to know what I'm talking about.</p>\n", "parentCommentId": "cZ26K52ebfLEdg7wC", "user": {"username": "Peter_Hurford"}}, {"_id": "hhGHqwYuQCdArBWYG", "postedAt": "2018-06-11T18:32:43.516Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>It's meaningful to have an opinion one way or the other, but it's far from clear that one is better was my point. Like, I'd imagine people in this community would disagree a lot on the value of CBT vs hot meals in my example, so I wouldn't just claim that one is worse than the other because it costs more.</p>\n", "parentCommentId": "LbPvi9ypvLRFmCkxL", "user": null}, {"_id": "B6jCqbHDMiAms9LAx", "postedAt": "2018-06-11T18:44:24.197Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Let me try another example. GiveWell wouldn't just say &quot;AMF saves the life of a child under 5 for ~$x. GiveDirectly doubles consumption for one person for 50 years for &gt;$x. Therefore, AMF is a better marginal choice.&quot; Not without justifying or at least acknowledging the underlying trade-off there.</p>\n", "parentCommentId": "hhGHqwYuQCdArBWYG", "user": null}, {"_id": "rchL7N8fGQMLPReaW", "postedAt": "2018-06-15T01:52:51.147Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<blockquote>\n<p><em>How much pig is not eaten?</em></p>\n</blockquote>\n<blockquote>\n<p>But how many pigs are saved when people eat pork 58 times less? Well, if we assume that each time someone eats pork they are <a href=\"https://fns-prod.azureedge.net/sites/default/files/fgp_sizes.pdf\">eating 2 to 6 ounces of it</a> and that <a href=\"http://reducing-suffering.org/how-much-direct-suffering-is-caused-by-various-animal-foods/\">a typical pig produces 200-230 pounds of meat</a>, that means the typical person eating pork 58 less times will be eating one sixteenth less of a pig in their life (90% interval: 0.013 to 0.21).</p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p>Given that a typical pig lives about six months, each person in the treatment group is thus sparing ~1 week of pig suffering (90% interval: 1.3 days to 23.7 days).</p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p><em>So what’s the cost-effectiveness?</em></p>\n</blockquote>\n<blockquote>\n<p>Given that a person can be reached for ~$2 and that they spare ~1 pig week, that works out to $150 per pig saved (90% interval: $23 to $560) and, again assuming that each pig has a ~6 month lifespan, that works out to $310 per pig year saved (90% interval: $47 to $1100). To put this in context, Against Malaria Foundation can avert a year of human suffering from malaria for $39[4], this does not look very cost-effective.</p>\n</blockquote>\n<blockquote>\n<p>This is all summarized <a href=\"https://www.getguesstimate.com/models/10871\">in this Guesstimate model</a>.</p>\n</blockquote>\n<p><a href=\"http://reducing-suffering.org/how-much-direct-suffering-is-caused-by-various-animal-foods/#Appendix_Where_the_numbers_came_from\">The source</a> that you cite for the amount of meat produced by a typical pig notes that the number it is using is the carcass weight.</p>\n<p>There are <a href=\"https://www.ers.usda.gov/data-products/food-availability-per-capita-data-system/glossary/\">four different weights</a>:</p>\n<ol>\n<li><p>Primary weight: the weight of the carcass (part of which is non-edible)</p>\n</li>\n<li><p>Retail weight: the weight of what is sold at the retail level</p>\n</li>\n<li><p>Consumer weight: the weight of what is purchased by consumers (including institutions and food service establishments)</p>\n</li>\n<li><p>Loss-adjusted availability: the weight of what is eaten by consumers </p>\n</li>\n</ol>\n<p>If I understand your model correctly, it assumes that 200 to 300 fewer pounds of pork would have to be eaten in order to spare one pig. This seems wrong to me because eating x pounds fewer meat means consumers purchasing x + y fewer pounds of meat which means retailers purchasing x + y + z fewer pounds of meat which means x + y + z + w fewer pounds of pig carcass produced. To correct for this, we have to figure out how many fewer pounds of pig carcass are produced for each fewer pound of pork that is eaten. For purposes of this comment, I will assume that the ratio of the reduction in the amount of pig carcass produced to the net^ reduction in the amount of pork eaten is the same as the ratio of the amount of pig carcass produced (per person) to the amount of pork eaten (per person).</p>\n<p>^I say <em>net</em> reduction because a person who purchases less pork (due to eating less of it) will cause the price of pork to decrease which will cause others to purchase (and eat) more pork which will partially offset the reduction.</p>\n<p>According to <a href=\"https://www.ers.usda.gov/webdocs/DataFiles/50472/meat.xls?v=42942\">USDA statistics</a>, during the year 2015, 63.5 pounds of pig carcass were produced per person while only 31.4 pounds of pork were eaten per person, meaning that 2.022 pounds of pig carcass were produced per pound of pork eaten [63.5 pounds / 31.4 pounds]. Assuming that one fewer pound of pork being eaten results in 2.022 fewer pounds of pig carcass being produced, the cost of sparing one pig and of sparing one pig year is 0.495 times what you originally estimated [1 / 2.022]. This means that the cost of sparing one pig is $74.25 [0.495 <em> $150] with a 90% interval from $11.39 [0.495 </em> $23] to $277.20 [0.495 <em> $560] and the cost of sparing one pig year is $153.45 [0.495 </em> $310] with a 90% interval from $23.27 [0.495 <em> $47] to $544.50 [0.495 </em> $1,100].</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "imrgXpE2Yqzm9LPXz", "postedAt": "2018-06-15T01:55:55.647Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<blockquote>\n<p><em>But what if it were chicken?</em></p>\n</blockquote>\n<blockquote>\n<p>A key part undermining the cost-effectiveness is that each pig produces so much pork. If we re-run the numbers assuming that the study was talking about chicken instead of pork and had the same results, but adjusted all the other numbers to be about chicken, we get $5.70 per chicken spared (90% interval: $0.71 to $32) and $50 per chicken year (90% interval: 6.3 to 280). This is better, but presumably still not as good as helping humans (even from a complete species-neutral point of view). This is summarized <a href=\"https://www.getguesstimate.com/models/10897\">in this additional Guesstimate model</a>.</p>\n</blockquote>\n<p>It appears that your model for chickens assumes that the amount of chicken eaten each time is the same as the amount of pork eaten each time and that the reduction in the number of times per month that chicken would be eaten is the same as the reduction in the number of times per month that pork was eaten. One potential problem with this assumption is that people each more chicken than pork: according to <a href=\"https://www.ers.usda.gov/webdocs/DataFiles/50472/meat.xls?v=42942\">USDA statistics</a>, in 2015, people ate, on average, 51.1 pounds of chicken but 'only' 31.4 pounds of pork. For your model to be accurate, it would have to be the case that showing videos of animal mistreatment reduces the amount eaten by a similar magnitude across different products regardless of the baseline amount eaten. It seems more likely to me that videos would reduce amount eaten by a similar proportion such that the reduction would be greater for products with a higher baseline amount eaten. If this is correct, then the reduction in the amount of chicken eaten would be 1.627 times what you estimated [51.1 pounds / 31.4 pounds].^^ This means that the cost per chicken spared and the cost per chicken year spared should be multiplied by 0.615 [1 / 1.627] to account for people reducing their consumption of chicken more (in absolute terms). </p>\n<p>^^You might think the ratio should be set higher if you think that the Animal Equality audience has a higher than average chicken consumed to pork consumed ratio.</p>\n<p>We also have to account for the model using the carcass weight of chickens^^^ as the number of fewer pounds people have to eat to spare one chicken. As noted above (with respect to pigs), this approach seems wrong in that each fewer pound of chicken eaten likely results in more than one fewer pound of chicken carcass being produced. According to <a href=\"https://www.ers.usda.gov/webdocs/DataFiles/50472/meat.xls?v=42942\">USDA statistics</a>, in 2015, 103.9 pounds of chicken carcass were produced per person while only 51.1 pounds of chicken were eaten per person, meaning that 2.033 pounds of chicken carcass were produced per pound of chicken eaten [103.9 pounds / 51.1 pounds]. Assuming that one fewer pound of chicken being eaten resulted in 2.033 fewer pounds of chicken carcass being produced, the cost of sparing one chicken and the cost of sparing one chicken year need to be multiplied by 0.492 [1 / 2.033].</p>\n<p>^^^I assume that &quot;Amount of meat per chicken (lbs)&quot; in your model refers to carcass weight as it does in the pig model. I make this assumption for two reasons. First, the phrase you used in the chicken model is similar to what you used in the pig model (&quot;Amount of meat per pig (lbs)&quot;), where that phrase refers to carcass weight. Second, <a href=\"http://reducing-suffering.org/how-much-direct-suffering-is-caused-by-various-animal-foods/#Appendix_Where_the_numbers_came_from\">the source</a> you use for the pig model says that chickens have a mass of 2.5 kilograms and that their carcass after slaughter retains 75% of that mass, meaning that a chicken carcass is around 1.875 kilograms (4.134 pounds); 4.134 pounds is roughly the midpoint of your range of 3 pounds to 5 pounds, which makes me think that your number was based on the carcass number from that source.</p>\n<p>Thus, to account for videos reducing chicken consumption by more than they reduce pork consumption (due to people eating more chicken) and to account for each fewer pound of chicken being eaten resulting in more than one fewer pound of chicken carcass being produced, your estimates should be multiplied by 0.303 [0.615 <em> 0.492]. This results in the cost of sparing a chicken being $1.73 [0.303 </em> $5.70] with a 90% interval from $0.22 [0.303 <em> $0.71] to $9.70 [0.303 </em> $32] and the cost of sparing a chicken year being $15.15 [0.303 <em> $50] with a 90% interval from $1.91 [0.303 </em> $6.30] to $84.84 [0.303 * $280].</p>\n<p>You might also think that showing people a video about the treatment of chickens would reduce the amount of turkey eaten by the same proportion as it reduces the amount of chicken eaten. According to <a href=\"https://www.ers.usda.gov/webdocs/DataFiles/50472/meat.xls?v=42942\">USDA statistics</a>, Americans ate, on average, 7.9 pounds of turkey, which is 0.155 times how much chicken they ate [7.9 pounds / 51.1 pounds]. If only 0.155 times as many pounds of turkey are being saved per viewer, then you would have to show the video to 6.452 times as many viewers to save the same number of pounds of turkey [1 / 0.155]. </p>\n<p>Additionally, since turkey carcasses weigh 23.603 pounds (<a href=\"http://reducing-suffering.org/how-much-direct-suffering-is-caused-by-various-animal-foods/#Appendix_Where_the_numbers_came_from\">0.75 * 31.47 pounds</a>) (compared to 3.9 pounds for chickens^^^^), you would have to show the video to 6.052 times as many viewers to spare the same number of turkeys [23.603 pounds / 3.9 pounds].^^^^^ This means that it costs 39.048 times as much to spare a turkey [6.452 <em> 6.052], which means that the cost of sparing one turkey is $67.55 [39.048 </em> $1.73] with a 90% interval from $8.59 [39.048 <em> $0.22] to $378.77 [39.048 </em> $9.70].^^^^^^ </p>\n<p>^^^^I use 3.9 pounds because that is what is used in the <a href=\"https://www.getguesstimate.com/models/10897\">Guesstimate model for chickens</a> and I am deriving the estimates for turkeys from the estimates for chickens.</p>\n<p>^^^^^The percent of turkey carcass that is ultimately eaten (49.6%) <a href=\"https://www.ers.usda.gov/webdocs/DataFiles/50472/meat.xls?v=42942\">is similar</a> to the percent of chicken carcass that is ultimately eaten (49.1%).</p>\n<p>^^^^^^I am assuming that the cumulative elasticity factor for turkey is similar to the cumulative elasticity factor for chicken. The Animal Charity Evaluators <a href=\"https://docs.google.com/spreadsheets/d/1iNDQIt9MRD4r1ws5M_2hQ-MNjMY-bcUra0fpOmF4Am0/\">spreadsheet</a> you cite reports similar estimated cumulative elasticity factors for chicken and turkey.</p>\n<p>And since turkeys live around <a href=\"https://www.farmsanctuary.org/learn/factory-farming/turkeys-used-for-meat/\">four months</a> on factory farms, the cost of sparing one turkey year is $202.65 [3 <em> $67.55] with a 90% interval from $25.77 [3 </em> $8.59] to $1,136.31 [3 * $378.77].</p>\n<p>Combining the chicken and turkey numbers, we get that the cost of sparing one bird is $1.69 [1 / (1 / $1.73 + 1 / $67.55)] with a 90% interval from $0.21 [1 / (1 / $0.22 + 1 / $8.59)] to $9.46 [1 / (1 / $9.70 + 1 / $378.77)] and the cost of sparing one bird year is $14.10 [1 / (1 / $15.15 + 1 / $202.65)] with a 90% interval from $1.78 [1 / (1 / $1.91 + 1 / $25.77)] to $78.77 [1 / (1 / $84.64 + 1 / $1,136.31)].</p>\n<p>Finally, if you accept <a href=\"http://effective-altruism.com/ea/1pn/animal_equality_showed_that_advocating_for_diet/ekg\">Halstead's argument</a> that assuming persistence of 1 to 12 years (with a point estimate of <a href=\"https://www.getguesstimate.com/models/10871\">68 months</a>) is too optimistic and that a more reasonable point estimate would be 6 months, then you would think that it costs 11.333 times the above estimates to spare an animal and to spare an animal year [68 / 6]. This would result in the cost of sparing a pig being $841.48 [11.333 <em> $74.25] with a 90% interval from $129.08 [11.333 </em> $11.39] to $3,141.51 [11.333 <em> $277.20] and the cost of sparing one pig year being $1,739.05 [11.333 </em> $153.45] with a 90% interval from $263.72 [11.333 <em> $23.27] to $6,170.82 [11.333 </em> $544.50]. It would also result in the cost of sparing a chicken being $19.61 [11.333 <em> $1.73] with a 90% interval from $2.49 [11.333 </em> $0.22] to $109.93 [11.333 <em> $9.70] and the cost of sparing a chicken year being $171.69 [11.333 </em> $15.15] with a 90% interval from $21.65 [11.333 <em> $1.91] to $961.49 [11.333 </em> $84.84]. It would additionally result in the cost of sparing a turkey being $765.54 [11.333 <em> $67.55] with a 90% interval from $97.35 [11.333 </em> $8.59] to $4,292.60 [11.333 <em> $378.77] and the cost of sparing a turkey year being $2,296.63 [11.333 </em> $202.65] with a 90% interval from $292.05 [11.333 <em> $25.77] to $12,877.80 [11.333 </em> $1,136.31]. Lastly, it would result in the cost of sparing a bird being $19.15 [11.333 <em> $1.69] with a 90% interval from $2.38 [11.333 </em> $0.21] to $107.21 [11.333 <em> $9.46] and the cost of sparing a bird year being $159.80 [11.333 </em> $14.10] with a 90% interval from $20.17 [11.333 <em> $1.78] to $892.70 [11.333 </em> $78.77].</p>\n<p>[Throughout this comment and the parent comment, I've adjusted point estimates and 90% intervals simply by multiplying them by the adjustment factor. I'm unsure whether this approach is correct for 90% intervals.]</p>\n", "parentCommentId": "rchL7N8fGQMLPReaW", "user": {"username": "RandomEA"}}, {"_id": "z4uyPMx8639XBSb5j", "postedAt": "2018-06-15T07:45:22.806Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>It's also interesting to compare the results from this Animal Equality study to the results from the previous <a href=\"http://effective-altruism.com/ea/14g/thoughts_on_the_reducetarian_labs_mturk_study/\">Reducetarian Labs MTurk Study</a>. </p>\n<p>In the Reducetarian Labs study, you found that respondents reduced their consumption of chicken by an average of 1.127 servings a month [0.26 <em> 52 / 12]. (The estimate for the Animal Equality study is slightly higher at 1.399 servings a month [0.86 </em> 1.627].)</p>\n<p>Assuming that the effect lasted six months, respondents ate, on average, 6.762 fewer servings of chicken [6 <em> 1.127 servings]. This means they ate, on average, 25.019 fewer ounces of chicken [3.7 </em> 6.762 ounces] (or 1.564 fewer pounds of chicken [25.019 ounces / 16]). Since any reduction in consumption is partially offset by others increasing their consumption (due to the reduction in consumption lowering prices), the net reduction in amount eaten was 0.594 pounds [0.38 <em> 1.564 pounds]. Making the same assumption I made in the parent comment, this reduction results in 1.208 fewer pounds of chicken carcass being produced [2.033 </em> 0.594 pounds]. This means that, on average, each respondent spared 0.292 chickens [1.208 pounds / 4.134 pounds] and 0.035 chicken years [0.12 <em> 0.292 chickens]. (By comparison, respondents in the Animal Equality study spared, on average, 0.362 chickens [0.292 / 1.127 </em> 1.399] and 0.043 chicken years [0.035 / 1.127 * 1.399].)</p>\n<p>[The numbers used in the above paragraph are borrowed from the parent comment or your Guesstimate model.]</p>\n<p>Assuming that it costs $0.35 to reach one person through leafletting or online ads (which seems to be the number you used in reporting the Reducetarian Labs study), it would cost $1.20 to spare a chicken [$0.35 <em> 1 / 0.292] and $10.00 to spare a chicken year [$0.35 </em> 1 / 0.035]. </p>\n<p>Why are these numbers so much lower than the numbers reported for the Animal Equality study? All numbers used for the estimate were the same except for consumption reduction per respondent and cost per respondent. Additionally, consumption reduction per respondent was very similar between the two studies. Thus, the difference is almost entirely due to cost per respondent: it costs $0.35 to reach a person through leafletting or online ads while it costs $3.30* to reach a person through in-person videos. Perhaps there's a lesson here: if two interventions have a roughly similar effect size but significantly different costs per person reached, choosing the lower cost intervention can greatly increase impact per dollar.</p>\n<p>*In your Guesstimate model for pigs, you use a cost per person of $2.80 for 2D video and $2.90 for VR video. Why is the cost per person higher for chickens?</p>\n<p>Finally, it's worth noting that the above analysis of the Reducetarian Labs study is limited to the respondents' reported reduction in consumption of chicken. (The respondents also reported reducing consumption of other animal products.) </p>\n", "parentCommentId": "imrgXpE2Yqzm9LPXz", "user": {"username": "RandomEA"}}, {"_id": "HEc7YYWK4vGdRbxoA", "postedAt": "2018-07-02T17:31:23.201Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Would you increase your consumption of other animals, such that your meat consumption stayed relatively stable?</p>\n", "parentCommentId": "kt3yWRbgcEZ5jD86g", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Q6S6hwWSyagWLYZou", "postedAt": "2018-07-04T15:23:38.018Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>Hey RandomEA, just wanted to weigh in here that Marcus and I are very grateful for your comments. I've dedicated a week of my research time this month to go through them and update the post as well as do some ideas for follow-up research looking at the Reducetarian Labs study data.</p>\n", "parentCommentId": "z4uyPMx8639XBSb5j", "user": {"username": "Peter_Hurford"}}, {"_id": "5xbtq2ZtxvwvzivNn", "postedAt": "2018-07-04T16:38:19.115Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>I was joking.</p>\n<p>The point was meant to be that at that price, it seems cheaper to create selfish incentives to become vegetarian/vegan/everything-but-factory-farmed-products-ian. If that's the best deal we currently have via nudging people to be more moral, maybe philanthropists should be thinking more about funding market solutions such as subsidies for vegan products.</p>\n", "parentCommentId": "HEc7YYWK4vGdRbxoA", "user": null}, {"_id": "BXL4Ck7KQzTWiJDgC", "postedAt": "2018-07-31T20:06:04.679Z", "postId": "9ShnvD6Zprhj77zD8", "htmlBody": "<p>In this case, the text states that &quot;Against Malaria Foundation can avert a year of human suffering from malaria for $39[4]&quot;, which is just false. Going by the footnote, the $39 is the cost of extending a human life by one year. I'd recommend writing that in the main text, instead, if you want people to be able to disagree with your judgement calls.</p>\n", "parentCommentId": "isvnkix9rQp7PGa9k", "user": {"username": "Lanrian"}}]