[{"_id": "Mxpoz3qW6xLuNa7WR", "postedAt": "2023-07-21T18:21:56.319Z", "postId": "9sZic9oNLNPrTDuNt", "htmlBody": "<p>This is a phenomenal resource. Well done Aron!</p>\n", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "W2qdqZC3Kc6rKEjDt", "postedAt": "2023-07-24T19:25:27.069Z", "postId": "9sZic9oNLNPrTDuNt", "htmlBody": "<p>Thank you for doing this. However, there are some inaccuracies and misconceptions in the UVC section. I won't list them all here--chief among them is the equivocation between far-UVC and conventional UVC--but if I had comment access I could go through it.&nbsp;</p><p>I wrote a few of the reports you link to (though the executive summary is deprecated and does not represent our current thinking--<a href=\"https://docs.google.com/document/d/1gP14w3cmZ3f7lUTJKsK4IOb0_K6PYcpAKAdFSP2og5U/edit\">this one</a> does) so I will go ahead and answer the questions you asked in the doc to avoid unnecessary duplicated work:</p><blockquote><p>What makes inexpensive, energy-efficient&nbsp; <a href=\"https://uv-light.co.uk/product/uvc-17w-germicidal-tube/\"><u>UVC light</u></a> on the market ineffective?&nbsp;</p></blockquote><p>Operational difficulty. Trained technicians are required to install upper-room systems safely, and such technicians are in short supply. Installing it in-duct has the same issues, with additional validation and transparency problem. Check out <a href=\"https://forum.effectivealtruism.org/posts/q7dJz9ZaZGTSZL8Jk/obstacles-to-the-implementation-of-indoor-air-quality\">Jesse's post</a> on this subject.</p><blockquote><p>Do they emit unspecific or varying wavelengths?</p></blockquote><p>No, they emit nearly monochromatically at 254 nm.&nbsp;</p><blockquote><p>What is the efficiency of different Upper-room UVC devices?</p></blockquote><p>You've already read Zollner, so you know the base emitter efficiencies. Low-pressure mercury is around 40%, UVC LEDs aren't really in use for upper-room GUV but they vary by wavelength and commercial stage and usually hover around 1-10%--though big caveat, efficiency is not the only important factor, and the issues UVC LEDs have with reliability are much more restrictive than the efficiency itself. Check out <a href=\"https://www.osti.gov/biblio/1879172/\">this 2021 DOE report</a> for a less rosy outlook than Zollner's--personally, I think the UVC LED industry is being far too optimistic in their predictions about UVC LEDs ever getting as efficient and cheap as white LEDs.&nbsp;</p><p>However, the louvers required to use cylindrical LP mercury lamps for upper-room GUV actually cause quite significant efficiency losses, down to 10%. Check out<a href=\"https://link.springer.com/book/10.1007/978-3-642-01999-9\"> Kowalski (2009)</a> Chapter 9--there hasn't really been a ton of innovation since then.</p><blockquote><p>How can we ensure that certain light wavelengths are harmless?&nbsp;</p></blockquote><p>I won't get into the specifics of what safety studies are considered the standard of evidence here. You do it the normal way--run the intervention (exposure to UV light), and check the endpoints of interest. Here is an<a href=\"https://pubmed.ncbi.nlm.nih.gov/33471372/\"> extreme exposure</a> study, here is a <a href=\"https://pubmed.ncbi.nlm.nih.gov/35614842/\">long-term exposure</a> one in mice, there are many more--here's<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7894148/\"> a review</a>, though it is from 2021. You would also need to think about environmental effects--for example, UV wavelengths below 240nm produce small (but increasing at lower wavelengths) amounts of ozone, which can then react with compounds in the air. UV can also degrade various materials, though shorter wavelengths don't penetrate as deeply.&nbsp;</p><p>I do want to stress, however, that 'harmless' shouldn't be the bar; nothing on this earth is 'harmless'.</p><blockquote><p>What is the current cost of UVC lamps, and how have prices trended in the past? What is the expected cost reduction?&nbsp;</p></blockquote><p>I am going to assume you mean far-UVC lamps specifically. If you want to get one fast, <a href=\"https://faruv.com/disinfection-floor-lamp/faruv-store/\">$2500</a>. If you want to get one that's more reasonably priced, you can't right now, but in the imaginable future you can get them from <a href=\"https://www.acuitybrands.com/resources/featured-technologies/uv-light-disinfection-technology/filtered-222nm-far-uvc-light\">Acuity</a> or <a href=\"https://beaconlight.co/products/beacon\">Beacon</a>. Good luck actually buying the Acuity one, though--I think they're basically only B2B, and so is the source supplier <a href=\"https://www.ushio.com/product/care222-filtered-far-uv-c-excimer-lamp-module/\">Ushio</a> who actually makes the lamp that all these fixture manufacturers are selling.</p><p>They cost only a couple hundred bucks or so to produce, so that's probably what the cost floor is in the near to medium term future. Solid-state sources will have different scaling economics, but they don't exist yet.&nbsp;</p><blockquote><p>What light bulbs currently emit UVC light? How much energy do these lightbulbs require?</p></blockquote><p>Basically just those Ushio bulbs. All the alternatives are worse or don't exist yet. They consume 12 watts.&nbsp;</p><blockquote><p>Could pathogens mutate and evolve under UVC, creating resistant bacteria?</p></blockquote><p>Probably not, nobody in the UV world is really worried about this. GUV is not new. This is unlikely because the mechanism of inactivation is pretty fundamental to life (for both conventional GUV and far-UV), which is not how most antibiotics work. It is imaginable to me that constant exposure to far-UV specifically might promote biofilm-forming bacteria to form biofilms more, but I believe the Esvelt lab is currently looking at this.</p><blockquote><p>What are the projected timelines for this technology? What is the projected timeline for setting up UVC lights in offices?</p></blockquote><p>I don't know what it means to have a projected timeline for a technology; that's too general a question. If you want far-UV, you can <a href=\"https://faruv.com/contact/\">contact</a> FarUV Technologies. It will not be cheap but it will be faster than alternatives. If you want upper-room, there are plenty of suppliers you can ask. <a href=\"https://aeromedcom.wpcomstaging.com/product/upper-room-guv-fixtures/\">Here's one</a> I found on google. I know <a href=\"https://forum.effectivealtruism.org/users/kaleem\">Kaleem Ahmid</a> has done office installations in the past.</p>", "parentCommentId": null, "user": {"username": "vbelenky"}}, {"_id": "NQ7CH9kfEhm24qFmb", "postedAt": "2023-08-01T13:43:41.759Z", "postId": "9sZic9oNLNPrTDuNt", "htmlBody": "<p>Hey Aaron, the link isn't working! <a href=\"https://www.aronlajko.com/home\">https://www.aronlajko.com/home</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Erin Robertson"}}, {"_id": "o2kADFz9AaFrnbGE9", "postedAt": "2023-08-11T14:55:14.156Z", "postId": "9sZic9oNLNPrTDuNt", "htmlBody": "<p>Thanks! It's back up and should be working now!</p>\n", "parentCommentId": "NQ7CH9kfEhm24qFmb", "user": {"username": "Aron Lajko"}}]