[{"_id": "7KsiR5k9kvkRbgpAH", "postedAt": "2022-12-19T23:45:03.879Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>I think Good Ventures manages their own money so you could give some in a lump sum to them, though you'd lose control over it. If you did that you would want to make sure you didn't regret it. (A trust fund would be different because you could control where it went), but this would be less hassle.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "hM5DmnsGyXLWupSP2", "postedAt": "2022-12-19T23:52:18.901Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>You might be interested in donating to the <a href=\"https://founderspledge.com/funds/patient-philanthropy-fund\">Patient Philanthropy Fund</a>.</p><p>It's at the stage where it makes small grants (~1% of its total portfolio per year) but is primarily investing its funds with the aim of growing them.</p>", "parentCommentId": null, "user": {"username": "Michael_Townsend"}}, {"_id": "oFG9E2WfreB7t3h8k", "postedAt": "2022-12-20T00:22:22.192Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>So I think there are some preliminary questions here. (Please note that although I am a lawyer, I am not your lawyer and can't give you legal advice.)</p><p>The first question is: does the person from whom you would be inheriting know and approve of your desire to give the money away? If so, your first objective is protecting the money from taxes as effectively as possible. This is <i>definitely </i>get a tax lawyer territory, but it may be tax-advantaged for your person to leave the money to an appropriate charitable fund in their will as opposed to having it pass through you and potentially get hit with taxes. That would depend on where you live and how big your person's estate was. If the money needs to come to you first, you still want to talk to a tax lawyer about how to achieve your goals in a tax-advantaged way.</p><p>The second question is what cause area(s) you are interested in and your beliefs about what the future will look like, which will probably affect your views on the benefits of donating now vs. investing and donating later. I've not thought a lot about that, so will happily defer to others.</p><p>At least in the US, what you are probably looking for is called a \"donor-advised fund\" -- it is technically a separate charity that legally gains control of the money, but in practice allows you to tell it which non-profit organizations to re-grant it to. (That non-profit could either do direct work, or itself provide grants to others.) I do not think DAFs have minimum spend requirements, so it would be possible to donate 3% each year if that is what you wanted. You are not talking about enough money to make a private foundation cost-effective, and they have a required 5% per year spend requirement plus onerous paperwork rules.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "ziajBHqWEHoCrs2xi", "postedAt": "2022-12-20T00:23:51.498Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>A US private foundation like Good Ventures is a poor fit for what the poster wants because it is subject to a requirement to spend at least 5% of its assets each year. A donor-advised fund is a much better choice here, I think.</p>", "parentCommentId": "7KsiR5k9kvkRbgpAH", "user": {"username": "Jason"}}, {"_id": "ojKKpSLLjhKFmLcKG", "postedAt": "2022-12-20T01:32:46.843Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>Have you heard of a <a href=\"https://www.calfund.org/advisors/fund-types/#:~:text=A%20donor%20advised%20fund%20is,own%20schedule%20through%20grant%20recommendations.\">Donor Advised Fund</a>? This does like 90% of you want (tax deductability + bind your hands in that the money must eventually go to a charity). A major caveat is that you have less freedom on both the investment side and the donation side, I haven't dug through the details but a lawyer or investment professional can probably help you walk through this.<br><br>EDIT: Michael Dickens has an <a href=\"https://forum.effectivealtruism.org/posts/qYuehBsAe6Ri6PZvL/a-comparison-of-donor-advised-fund-providers\">article on the forum</a> about which Donor Advised Funds are best.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "SujiRsJ5kvXbmdrno", "postedAt": "2022-12-20T01:56:17.669Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>I'd recommend getting in touch with the folks at [Generation Pledge] (<a href=\"https://forum.effectivealtruism.org/topics/generation-pledge\">https://forum.effectivealtruism.org/topics/generation-pledge</a>), who focus on helping inheritors think through how to use their resources for good. Just send Sid an email or message on the forum!</p>\n", "parentCommentId": null, "user": {"username": "Sharang Phadke"}}, {"_id": "wCpfRZvuAEdenQXPm", "postedAt": "2022-12-20T09:50:06.441Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>This seems like the correct choice. One caveat is that this might make it harder to donate to speculative projects that don't have 503 status. But you could e.g,. partner with a 503 to run a grant round. So maybe don't donate literally all f it to the DAF?</p>", "parentCommentId": "ojKKpSLLjhKFmLcKG", "user": {"username": "NunoSempere"}}, {"_id": "hith4XXbeGwfuaYTq", "postedAt": "2022-12-20T19:36:51.343Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>If you like, I talk with lots of folks on technical aspects of giving, particularly as it also relates to balancing practical considerations like retirement. Feel free to message me.<br><br>You can also check out a number of essays I've written on this topic: https://www.aaronhamlin.com/articles/#philanthropy</p>", "parentCommentId": null, "user": {"username": "aaronhamlin"}}, {"_id": "dbpCPFQ6cWtmmHYmW", "postedAt": "2022-12-21T12:35:14.033Z", "postId": "9T5G6fZEHRKtAqD2m", "htmlBody": "<p>OK, seems like a DAF might be the way to go. Although i will look into the patient philanthropy fund and perhaps talk to a tax lawyer/aaron hamlin and generation pledge. I am afraid my parents would not be particularly pleased to know I am giving it away, so I will have to inherit it first. Then again, Norway does not have inheritance taxes atm, so any taxes would be small. Besides, most of the money is in the form of artworks. Just to be clear:I do intend to leave my son a small apartment, which in Oslo costs about 3-400000 perhaps. On the other hand, we are donating about 10% of our income each year, which I would also like to go into a fund that could increase in size rather than just being spent directly. Thanks everyone.</p>", "parentCommentId": null, "user": {"username": "Doggypile"}}]