[{"_id": "ACkdoJAQNsLGtqCjY", "postedAt": "2022-09-05T22:09:54.753Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>DC has the most equestrian statues of any city in the country, and once they erect another one it'll tie Paris for the most of any city worldwide. Another plus.</p>\n", "parentCommentId": null, "user": {"username": "ModusTrollens"}}, {"_id": "QuLQXkkoFmRJieAja", "postedAt": "2022-09-05T22:25:45.196Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>As someone who lives in DC and is part of the EA community here, I wholeheartedly agree with a lot of this! &nbsp;</p><p>To add to a couple of points:&nbsp;</p><blockquote><p><i>Non-EAs living in DC tend to be pretty impact-oriented and ambitious. </i>It’s not uncommon for my non-EA peers in DC to be really excited about the work they’re doing and enjoy talking about their ambitions for impacting the world.</p></blockquote><p>The article \"<a href=\"https://newrepublic.com/article/165215/washington-dc-not-swamp\">Washington Is Not a Swamp</a>\" does a really nice job fleshing this out, describing how (in contrast to the \"sharp elbows\" stereotypes) most people in DC are very mission-oriented and kind. Similar to the EA community, DC attracts a large number of public-spirited and service-minded individuals, and conversations with (non-EA) friends and colleagues here are often very motivating and inspiring. And though folks in DC often joke about being in a bubble, one refreshing thing about the city is that it attracts people with a wide set of worldviews — in my experience, it's much more intellectually and professionally diverse than other hubs such as the Bay Area. &nbsp;</p><blockquote><p><i>You don’t have to work in government</i>. This isn’t exactly a benefit — more of a PSA: it’s not crazy to move to DC, even if you don’t see yourself having a long career in government. It could still make sense to come to DC and work on policy issues from the outside. Jobs in lobbying and think tanks (especially the former) also offer better compensation and better hours than government work does.</p></blockquote><p>I agree, and would go even further to say \"you don't have to work in policy\". There are lots of industries with large and prestigious presences in DC, including tech (especially in the NoVa area), health care (Bethesda and surroundings), journalism, arts and music, etc. &nbsp;&nbsp;<br><br>&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "ccZe6G3XkekjgefMc", "postedAt": "2022-09-05T22:31:50.503Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>+1 for the asknots article!</p>", "parentCommentId": "QuLQXkkoFmRJieAja", "user": null}, {"_id": "Z6eTCpMBFzEQtxyRh", "postedAt": "2022-09-06T00:56:55.138Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>I spent two years in northern Virginia (not working as an EA or in policy, but rather an aerospace engineer) -- I loved it and I have always thought there should be a bigger EA/rationalist hub in DC given its obvious geopolitical significance. &nbsp;I remember being surprised when I moved to the city at how it felt so energetic and full of young people, very different from my image of how our top political leaders are all in their 80s.</p><p>I also want to reiterate how, coming from the west coast (previously lived in Colorado and northern California), the quality of the museums and sights is just <i>amazing</i> -- not only do you have a ridiculous array of totally free Smithsonian museums (and a lot of non-Smithsonian museums too... the <a href=\"https://www.usmcmuseum.com/the-museum.html\">museum of the Marine Corps</a> is very cool and underrated!), you also have a ton of assorted beautiful monuments / gardens / architectural marvels / etc all around the city, like the <a href=\"https://dynamic-media-cdn.tripadvisor.com/media/photo-o/22/ad/5a/9b/with-a-gross-floor-area.jpg?w=1200&amp;h=1200&amp;s=1\">beautifully-decorated and largest church in North America</a>, the <a href=\"https://www.nps.gov/keaq/planyourvisit/lotus-and-water-lily-festival.htm\">Lotus festival at the National Aquatic Gardens</a>, etc. &nbsp;It is not like San Fransisco where you visit the Exploratorium and maybe an art museum and then you've seen most of the cool stuff -- in DC, you can literally make it a hobby to spend every other weekend perusing a new museum full of amazing cultural treasures, and you won't run out for over a year.</p><p>Another thing that I loved about DC was the amount of interesting stuff that you could visit within a short drive of the city itself. &nbsp;In Colorado, Denver/Boulder are really fun and have great mountains, but if you want to go anywhere besides that you've basically got to drive 1000 miles. &nbsp;In DC, you can take weekend trips to Baltimore, Richmond, Pittsburgh, New York, civil war battlefields, Monticello, the historical sites and theme parks near Jamestown and Williamsburg, etc.</p><figure class=\"image\"><img src=\"https://virginiatraveltips.com/wp-content/uploads/2021/02/Monticello-in-spring-in-Virginia.jpg\"></figure><p>Two potential downsides to living in DC:</p><p>1. Lots of people are in DC for only a short time, driven by their careers. &nbsp;This reflects the city's ambition and energy, but it does mean that it might be hard to put down permanent roots there, and social relationships feel more ephemeral than they might elsewhere, because it feels like anyone might move away at any moment. &nbsp;To some extent being in the EA/rationalist community mitigates this, because you are slotting into an existing culture with so much shared background knowledge &amp; values.</p><p>2. Although it is close to lots of amazing cultural sites and world-class cities, it does not have that much access to nature. &nbsp;Shenandoah and chesapeake bay are cool (did you know NASA sometimes<a href=\"https://en.wikipedia.org/wiki/Mid-Atlantic_Regional_Spaceport\"> launches orbital rockets from Virgnia</a>?), but they are obviously a far cry from the natural beauty of Colorado or California. &nbsp;The weather in DC is also kind of meh, with hot and humid summers and winters that can get inconveniently icy/slushy. &nbsp;But the weather also has its upsides -- the <i>year-round average</i> temperature of DC is just right (unlike eg New York which is on the cold side), so you get beautiful springs and falls there, a real four seasons that you don't get on the west coast.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "7nPyeYF4jvrkSgQuF", "postedAt": "2022-09-06T04:35:54.195Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>I’d describe myself as a person that could probably work in policyish things and have been put off by the stereotype of DC - this post nudged me to reconsider. Thank you for sharing!</p>\n", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "fYjexi8wNft3zJAkg", "postedAt": "2022-09-06T06:28:01.925Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>Agree with a lot of this post. I lived in DC from 2008-2010 and various short periods before and after and overall I liked it (though I'd probably like it a bit less today and expect a lot of EAs to like it less than I did).</p>\n<p>The features of DC that most affected me:\n-DC felt like a company town. This had advantages. I liked having tons of friends who were think tank analysts or worked on the Hill and were trying to change the world (though I suspect polarization has made the vibe a bit worse). It also had disadvantages. Relative to NYC (which I knew best at the time) I knew  relatively few people living in DC because they wanted to make DC great and this meant things like a worse music scene (despite the fact that I grew up on DC punk music).\n-Lots of people, especially young people, only stay for a couple of years so it was hard to maintain a friend group. I think this was a big deal.\n-DC is small relative to a place like NY. Overall this felt like a disadvantage to me though I expect it would be a feature to some other people. DC felt like more of a bubble and there were fewer places to explore. There was a concert I'd be interested in ~once a week instead of a couple per night. On the other hand, several houses full of friends and co-workers lived within a five minute walk which was great. That said, it's still one of the biggest metro areas in the US.\n-I thought it was cool/exciting to live in a city where policy and politics were happening (though I think I'd enjoy less today).\n-I think there were some disadvantages to everybody being very networky and the culture being kind of conservative.</p>\n", "parentCommentId": null, "user": {"username": "HowieL"}}, {"_id": "3wPtezouokR9uje2a", "postedAt": "2022-09-06T13:25:02.204Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>I moved to DC in January and it's great so far. I'm now starting a new EA-aligned community center here. I'm expecting more EA momentum in DC in the next couple of years.</p>\n", "parentCommentId": null, "user": {"username": "lincolnq"}}, {"_id": "BX3RfP2TsQp3bekD2", "postedAt": "2022-09-06T13:32:10.992Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>Hell yes to all of this. I'll also add that as someone who grew up in a small town (not a universal experience but probably a shared one) I found mega-cities like New York or London to be so overwhelming in their scale that just trying to get around was stressful.</p><p>DC is, as Anon mentions, a pretty compact city, and young professionals tend to live in a small number of neighborhoods (Petworth, Shaw, Adams Morgan, Columbia Heights, Mt. Pleasant, H St — I'm probably dating myself with this list) that aren't far apart from each other. You can walk from the center of AdMo to the center of Petworth in about 40 minutes. I found that really helpful in getting used to living in a city <i>in general</i>, and getting good at living in a city is useful for doing impactful work.</p><p>Anyway, excited to see you all at EAG this month :)</p>", "parentCommentId": null, "user": {"username": "Dylan Matthews"}}, {"_id": "RJhLqvDtPgpnPEDK2", "postedAt": "2022-09-06T16:13:53.533Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>A counterpoint to the icy/slushy winters is that people and institutions here are EXTREMELY wimpy about winter precipitation and no one will expect you to go anywhere at the first sign of a flurry. &nbsp;Schools close, telework is allowed, the garbage will not be collected. Get your cup of cocoa and curl up by a fire.</p>", "parentCommentId": "Z6eTCpMBFzEQtxyRh", "user": null}, {"_id": "ZMjC8TAiTTdLZHSA8", "postedAt": "2022-09-06T20:46:27.430Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>Really glad to hear that! Stereotypes often have a grain of truth and I don’t want to sugarcoat things with my post (the comments on this post are definitely worth reading to get a more complete picture). But if you’d be open to a move I really encourage planning a visit: even just a well-planned weekend with lots of one-on-ones could give you a lot of information.</p>\n<p>Feel free to DM me if you decide to come for a visit and I might be able to help with making connections.</p>\n", "parentCommentId": "7nPyeYF4jvrkSgQuF", "user": {"username": "Anonymous_EA"}}, {"_id": "GgFizqEKrTCS2BMpy", "postedAt": "2022-09-07T01:40:02.837Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>+10 as someone making the move from Berkeley to DC :)</p>\n", "parentCommentId": null, "user": {"username": "ElikaSomani"}}, {"_id": "fGjF4TRCqaZykvnq8", "postedAt": "2022-09-07T19:49:10.517Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>I mostly agree but a few counterpoints (I've been in DC for about 1yr total now).&nbsp;</p><ol><li>The summers are absolutely miserable if you dislike humidity.&nbsp;</li><li>&nbsp;In general compared to SF and even Berlin I've found people (outside of the EA community) to be much more reactive and zero sum in their thinking than people who dream big and have visions of the future they want to build towards.</li><li>Echoing the company town comment- I feel like every conversation is about politics/policy/international affairs, which bugged me in SF about tech (there's so much more to life! ) and was one of the things I loved about Berlin where I felt there was a much better mix of artists, tech people, government workers, &nbsp;etc.</li><li>I have mixed feelings about OP's #4 as I have met quite a few mission oriented people, but I also meet a lot of very cynical and burnt out people, especially at work.&nbsp;</li><li>Many meetings feel very transactional (I see jokes all the time about people wondering if they're on a date or networking) and people cycle in and out of the city quickly and often.</li></ol><p>&nbsp;</p><p>On net however, I think it's a decent American city to live in and it certainly does punch above its weight for museums, architecture, restaurants, and even flights given its status as the capital.&nbsp;</p>", "parentCommentId": null, "user": {"username": "atlasunshrugged"}}, {"_id": "bRLuQEE46XgsS8Hon", "postedAt": "2022-09-08T03:07:04.050Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>I broadly agree, but to further add some color: if you like nature, what you have easy access to in DC is methadone compared to the Bay area, or really anywhere in the western US. Shenandoah National Park is... nice; the Chesapeake Bay is... nice. Further afield, Western Virginia has some pretty bits, and you're not <i>too</i> far from the beautiful areas of Appalachia, the South, or New England. But you're not that close either, and you certainly won't find any Yosemite. Unless outdoorsy activities are a very important part of your overall wellbeing, this probably shouldn't overrule other factors, as ultimately there are nice things around to see and do (be glad you at least have methadone!), but for some people it is in fact a clear and somewhat painful tradeoff that you will be reminded of acutely every time you go visit friends in the Bay area.</p><p>I would add that another factor in DC's favor is diversity. Of course, DC is one of the most international cities in the world, and certainly the country, in large part due to its importance to international affairs, so you will easily hear 5-6 languages spoken in a day out on the town. This is not necessarily all that different from the Bay area, though I think DC's international connections are in fact significantly more diverse due to the range of countries from which people often come to DC. In my experience, the social and professional circles of most EAs in DC are also significantly more demographically diverse than the Bay area. Personally, although I am white, I prefer living in a place where I feel like people of any race or ethnicity would feel comfortable, which is often not how the Bay area feels to me; DC seems significantly better on this dimension. If you are Black in particular, the Black community which makes up a plurality of DC's population could be a strong positive factor for you. On the other hand, it's worth noting that DC has a much smaller Asian population than the Bay area, so if those communities are important to you, this could be a downside (for example, there are very few Buddhist temples in DC).</p>", "parentCommentId": null, "user": {"username": "tarianllwyfen"}}, {"_id": "v4GdDWFAXsAnajEci", "postedAt": "2022-09-08T03:50:27.942Z", "postId": "9uPMWPZg8mqmcAhhL", "htmlBody": "<p>I just want to emphasize this point: <i>\"</i>Non-EAs living in DC tend to be pretty impact-oriented and ambitious<i>\"</i></p><p>One of the main reasons that DC has a reputation as a bad place to live is that most people find this aspect of DC culture to be annoying and off-putting. And while I disagree with those people, I agree with their judgment that it is a distinctive feature of life here. DC people talk a lot about their jobs. They very sincerely believe their work is important. People who would never in a million years identify as EAs would still tell you (and genuinely believe) that they are dedicating their lives to doing good in the world. They network quite aggressively on behalf of those goals. Lots of people really hate this and spread anti-DC rhetoric around the country. But it's important to tune out the normative judgment and focus on the object-level take. DC is full of people who care a lot about the impact they are having on the world and who will not think you are crazy if this is something you want to talk about. If that sounds attractive to you, you will like it here.</p>", "parentCommentId": null, "user": {"username": "Matthew Yglesias"}}]