[{"_id": "kHokFaBkbF8yiurTP", "postedAt": "2023-10-13T21:23:14.691Z", "postId": "9uXe6KBoNtsjQuEkt", "htmlBody": "<blockquote><p>We use evidence-based outreach to inform people of the threats that advanced AI poses to their economic livelihoods and personal safety (HOW). Our mission is to create a united front for humanity, driving national and international coordination on robust solutions to AI-driven disempowerment (WHAT).</p></blockquote><p>I'm not sure if this was the aim of the mission statement, but after reading this I still do not know what StakeOut.AI does in a concrete way.</p>", "parentCommentId": null, "user": {"username": "Joseph Miller"}}, {"_id": "NhJg4Y8cyzzcxgYMj", "postedAt": "2023-10-13T22:09:52.093Z", "postId": "9uXe6KBoNtsjQuEkt", "htmlBody": "<p>Thank you for your comment and feedback.</p><blockquote><p>use evidence-based outreach to inform people of the threats that advanced AI poses to their economic livelihoods and personal safety</p></blockquote><p>Specifically, we are looking to use cost-effective Internet messaging tools to communicate the evidence that disempowering AI poses serious dangers (to economic livelihoods and personal safety) for people of every industry, for people of every country, and for humanity as a whole.</p><p>Also, we plan to inform the public about incidents of AI-induced scams, propaganda, radicalization, etc. in order to convey the dangers posed by the ever-increasing capabilities of uncontrollable AI.</p><p>&nbsp;</p><p>We did not specify the Internet-based messaging in the mission statement because we felt we would eventually use other mediums of messaging as well.</p><p>I guess according to the following principle:</p><blockquote><p><strong>Inclusivity &amp; Specificity</strong>: Be broad enough to allow for the organization's growth and change but specific enough to provide clear direction</p></blockquote><p>We stayed on the side of more broad because we felt 'outreach' was specific enough to provide the direction of the organization (regardless of medium).</p><p>&nbsp;</p><p>Your feedback is invaluable, and getting EAs feedback is one of the primary reasons why we created the post sequence. So, thank you for your help.</p>", "parentCommentId": "kHokFaBkbF8yiurTP", "user": {"username": "Harry Luk"}}, {"_id": "tpbQSZJpsTf2XamzS", "postedAt": "2023-10-13T22:56:02.249Z", "postId": "9uXe6KBoNtsjQuEkt", "htmlBody": "<blockquote><p>Specifically, we are looking to use cost-effective Internet messaging tools to communicate the evidence that disempowering AI poses serious dangers (to economic livelihoods and personal safety) for people of every industry, for people of every country, and for humanity as a whole.</p></blockquote><p>Thanks for clarifying, I can see why you'd want to make your mission statement broad enough to encompass future activity.</p><p>What \"cost-effective Internet messaging tools\" do you imagine you will be using in the near future?</p>", "parentCommentId": "NhJg4Y8cyzzcxgYMj", "user": {"username": "Joseph Miller"}}, {"_id": "r4n7LnueiErK2Edmo", "postedAt": "2023-10-14T00:03:29.510Z", "postId": "9uXe6KBoNtsjQuEkt", "htmlBody": "<p>My background is online marketing and we plan to test a wide range of online traffic methods including video, social, paid, and organic channels to attract people's attention on what already happened to certain professions (artists, journalists, actors, and writers) and incidents of AI-induced scams, propaganda, radicalization, etc.</p><p>We plan to run a pilot to confirm proof of concept. To achieve this, we intend to create a marketing funnel and run targeted ads in the target country.</p><p>Micro-pilot testing will be done on different target audiences before full pilot is carried out. This will also provide a better view of objections and misunderstandings of AI risks from the general public’s perspective.</p><p>We hope to publish a post next week titled \"Introducing StakeOut.AI (Public Awareness of the Threats Posed by Advanced AI)\" to share more about our project and plans.</p>", "parentCommentId": "tpbQSZJpsTf2XamzS", "user": {"username": "Harry Luk"}}]