[{"_id": "cGTK8BgagDZshtx6a", "postedAt": "2023-08-02T08:27:52.923Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Thank you for sharing these reflections, Asya! And for your service as the LTFF chair!</p><p>I feel confused about the difficulty of fund manager hiring. One source of confusion comes from the importance of expertise (/doing-good-direct-work), as you touch on in the post:</p><blockquote><p>Historically, we've had trouble hiring fund managers, especially in technical AI alignment, largely for the reasons mentioned above (people generally want to focus on their work). I think there's an extent to which I've contributed to our difficulty in hiring, in that I'm not sold that people doing good direct work&nbsp;<i>should</i> be taking on additional responsibilities as fund managers (so haven’t been great at convincing people to join)</p></blockquote><p>In addition to the high opportunity cost of time for expert fund managers, I would have guessed that small differences between the EV of marginal grants pushes in the direction of expertise being less important. But then I don’t understand why hiring fund managers would be unusually challenging. Wouldn’t deemphasizing expertise increase the pool of eligible fund managers, thereby making hiring easier?</p><p>(Perhaps I‘m confusing relative and absolute difficulty — expertise being less important would make hiring relatively easier, but it’s still absolutely tough?)</p><p>The second source of confusion comes reconciling the difficulty of finding fund managers with the fact that FTXFF and Manifund seemed to find part-time grantmakers quite easily. I don’t know how many regrantors and grant-recommenders FTXFF ended up with, but the last rumour I heard was between 100 and 200. Manifund are currently on 16 and seem keen to expand. I would’ve thought that there is some intersection between regrantors with the top, say, 30% of grantmaking records by your light, those satisfying other hiring criteria you might have, and those currently willing to work with LTFF.</p><p>Is the difference in the scale of grants LTFF fund managers make vs regrantors? Or expectations around regularity of response (regrantors are more flexible)? Or you’re not excited about the records of regrantors in general? Or something else?</p>", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "fMgnHZHrqGqSxXRXA", "postedAt": "2023-08-02T22:22:42.016Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>I talked to someone from Manifund who said that it was easy to find people to put up their hand to be grantmakers, but harder to get them to actually give out grants.</p>", "parentCommentId": "cGTK8BgagDZshtx6a", "user": {"username": "casebash"}}, {"_id": "5gWGxfxBywoSKQsfw", "postedAt": "2023-08-03T07:48:26.798Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Seems like:</p><ol><li>FTXFF did move a lot of money, alas.</li><li>Speed due to indecision is a very solveable problem (e.g. tie funding that a given regrantor can give out to shorter window, or have shared pot that other regrantors could use on their preferred projects first).</li><li>The indecision is due to the ~need to actively seek out grants, which wouldn’t be a problem for LTFF.</li></ol><p>(In case relevant: I am a Manifund regrantor who just got back from holiday and plans to start working on it today! Thank you for the gentle push! :P)</p>", "parentCommentId": "fMgnHZHrqGqSxXRXA", "user": {"username": "joel_bkr"}}, {"_id": "gdkYwrLrqqfwnfkwp", "postedAt": "2023-08-03T09:51:10.529Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Random idea that just came to me – require regranters to put down a \"deposit\" (say, $2,000 if their budget is $100,000), which they only get back once they've donated at least 50% of their budget. Not only would this create an incentive for them to actually regrant, but it would also make them think a bit harder before accepting to be a regranter about whether they were actually committed. (OTOH, I can also think of negative aspects of this setup.)</p>", "parentCommentId": "fMgnHZHrqGqSxXRXA", "user": {"username": "Daniel_Eth"}}, {"_id": "jDzEK6AaatG9ogCkM", "postedAt": "2023-08-03T13:37:50.934Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>It seems that a central bottleneck for the fund is that a few key people are decision-makers, and they are very busy, which makes it hard to operate quickly at scale and be transparent.</p><p><strong>When </strong><a href=\"https://forum.effectivealtruism.org/posts/aW9ANJg7s3Q9BASgu/sogive-grants-a-promising-pilot-our-reflections-and-payout\"><strong>SoGive ran its grants programme</strong></a><strong> last year, we tackled these problems by getting more junior people to help.</strong></p><p>I.e. the structure was:</p><ul><li>most senior/expert people helped at key moments, but were mostly consultative</li><li>mid-level people (i.e. fairly experienced but non-expert) actively reviewed applications, including have a call with applicants (we actually did two rounds of calls, which might have been overkill)</li><li>junior people attended calls, wrote up notes, helped with putting the content into an accessible format for senior people to review, but also contributed thoughts and opinions&nbsp;</li></ul><p><strong>In many ways, this structure seemed to work well,</strong> since it allowed for the following:</p><ul><li><strong>call with applicants</strong>: having a video call as well as the application form was often genuinely additive and helped with decision-making; I'm therefore more positive about the quality of our grant-making</li><li><strong>feedback</strong>: we were able to provide feedback to all applicants, which many applicants stated that they appreciated</li><li><strong>transparency</strong>: we were able to exhibit a good level of transparency about our process and the outcomes of the process</li><li><strong>effects on talent pool</strong>: the junior and even mid-level people involved in the process largely felt like it was a great opportunity to learn, and got a lot out of it (which might not be true of the experienced fund manager at the LTFF)</li><li><strong>better aligned with key considerations:</strong> we generally found that lots of our decisions could be made based on junior input alone; i.e. common sense + general awareness of EA thinking + fresh perspective was often sufficient to highlight weaknesses in an application. Senior involvement was still needed in case something was missed, but often if a junior person was inclined to reject an application, it was rare for someone senior to suggest that we should resurrect the application. This meant that the way time was used was better aligned to the people involved, and there were significant time savings for senior people.</li></ul><p><strong>Here are some potential downsides:</strong></p><ul><li><strong>speed</strong>: there are more steps involved in the process; this makes it hard to have a quick turnaround time. I suspect this could be surmountable.</li><li><strong>costs</strong>: there are more people involved, which means there are more costs incurred; however arguably the most important consideration is the opportunity cost of people's time, and those with high opportunity cost are spending less time, and more junior people feel like it's a great opportunity for them to learn.</li><li><strong>dependent on junior staff</strong>: if the junior staff were not performing well, this would be problematic. In our experience, this was not a problem. I think this reflects the fact that there are lots of very bright, motivated people who are keen to get relevant experience. However it does mean that care is needed with the selection process.</li><li><strong>management capability</strong>: in order for this to work, senior and mid-level people need to be effective at managing more junior people. This did not seem to be much of a problem for us, but SoGive has experience supporting junior people (mostly volunteers) for many years.&nbsp;</li></ul><p>I'm not trying to say that EA Funds should definitely do something like this, more that if it's useful to explore what happened when someone tried something different, I'd be happy to discuss.</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "S6nwSaPhSskPkcCxd", "postedAt": "2023-08-03T17:13:51.290Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Thank you for your leadership on the LTFF Asya! I really appreciate working with and learning from you. In particular, I learned from your attitude towards candor, humility, and consistent prioritization/triage mindset in internal discussions; by default I tend to get off-track a lot and/or be perfectionist about things that don't matter as much.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "iEme9ZpWcAhqkfQAD", "postedAt": "2023-08-03T18:42:24.448Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<blockquote><p>and let us know <a href=\"https://forms.gle/6gC7ezTwbNME8J6S9\">here</a> if you might be interested in becoming a fund manager</p></blockquote><p>It seems like there should be more of a scouting and nominations system. I don't expect self-nominations to work very well for basic dunning-kreuger reasons.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "tBdiS5hDgNDtnw7vj", "postedAt": "2023-08-03T19:02:42.850Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p><i>(I was previously a fund manager on the LTFF)</i></p><p>Agree with a lot of what Asya said here, and very appreciative of her taking the time to write it up.&nbsp;<br><br>One complimentary point I want to emphasize: I think hiring a full-time chair is great, and that LTFF / EA Funds should in general be more willing to hire fund managers who have more time and less expertise. In my experience fund managers have very little time for the work (they’re both in part-time roles, and often extremely busy people), and little support (there’s relatively little training / infrastructure / guidance), but a fair amount of power. This has a few downsides:</p><ol><li><strong>Insular funding:</strong> Fund managers lean heavily on personal networks and defer to other people’s impressions of applicants, which means known applicants are much more likely to be funded. This meant LTFF had an easy time funding EAs/rationalists, but was much less likely to catch promising, non-EA candidates who weren't already known to us. (This is already a common dynamic in EA orgs, but felt particularly severe because of our time constraints.)&nbsp;</li><li><strong>Less ambitious funding: </strong>Similarly, it's particularly time-intensive to evaluate new organizations with substantial budgets, or novel theories of change. This meant that we were more likely to fund individuals, and had a harder time making large grants to new ambitious orgs. (We were also more likely to lean on OP’s evaluation of the person or org.)</li></ol><p>I left the LTFF because of capacity issues related to being on the EV board post FTX collapse, but I didn't return because I ended up feeling pretty skeptical of a funding dynamic that moved money primarily within existing social circles with relatively little supervision, especially post FTX. I think full-time fund managers &amp; more structure and support could help with this. In the past, I think we’ve been recruiting from too narrow of a pool — I think there are a fair number of people who could do this job well (and that the quality of work they can do improves if they have more time and more support), and moving in that direction could be good for the fund. (Though I haven't actually done the hiring for these roles, so I could be wrong.)</p><p>Really excited about EAF/LTFF potentially being more independent from OP &amp; having more full-time staff. I think both of those are really great directions to move in, and I'm very appreciative to Asya &amp; Caleb for putting in the time to think it through.</p>", "parentCommentId": null, "user": {"username": "Rebecca Kagan"}}, {"_id": "DJWGsAWHpHbeTibJZ", "postedAt": "2023-08-03T21:56:15.418Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>&gt;It seems that a central bottleneck for the fund is that a few key people are decision-makers, and they are very busy, which makes it hard to operate quickly at scale and be transparent.</p><p>I think this is at least somewhat true. We have tried out having more junior managers on the fund with mixed success. The EAIF currently has \"assistant fund managers\" which I think was a good experiment for us to run, and I think it's generally gone well.<br><br>My impression is that SoGive gave out something like $300k and had 26 applicants so it doesn't seem super comparable to me to the LTFF (I think last year we had ~1000 applications), and I'd guess that your methods don't scale particularly well to the kind of grantmaking the LTFF does (but I could be wrong).<br><br>I also somewhat disagree with Asya re our transparency, I think that we are falling short of where I'd like us to be, but if you compare us to other grantmaking programs that have existed for more than 1 year I think we look pretty good transparency wise (e.g. Longview, Effective Giving, Open Phil) though plausibly they don't need to be as transparent as they are raising less from the public.</p>", "parentCommentId": "jDzEK6AaatG9ogCkM", "user": {"username": "calebp"}}, {"_id": "dAQoHt3huhmfBmiFx", "postedAt": "2023-08-03T22:01:47.664Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<blockquote>\n<p>In addition to the high opportunity cost of time for expert fund managers, I would have guessed that small differences between the EV of marginal grants pushes in the direction of expertise being less important. But then I don’t understand why hiring fund managers would be unusually challenging. Wouldn’t deemphasizing expertise increase the pool of eligible fund managers, thereby making hiring easier?</p>\n</blockquote>\n<p>I think a decent number of grants are pretty high variance and quite a few grants that seem marginal to some seem pretty negative to others (particularly more experienced fund managers).</p>\n<blockquote>\n<p>I would’ve thought there is some intersection between regrantors with the top, say, 30% of grantmaking records by your light, those satisfying other hiring criteria you might have, and those currently willing to work with LTFF.</p>\n</blockquote>\n<p>I didn't quite parse this, but my impression is that we either weren't able to attract excellent fund managers, or we were looking for different things to FTXFF and Manifund such that our bar ended up looking higher. I do think that our experiments with hiring people that we are less excited about have made me less keen to hire more people close to the bar but more keen to create junior positions and increase management capacity.</p>\n", "parentCommentId": "cGTK8BgagDZshtx6a", "user": {"username": "calebp"}}, {"_id": "NaJaE86nF3ysy36wb", "postedAt": "2023-08-03T22:03:19.616Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>I think the plan is for this to be a pretty lightweight self-nomination process, we'll do a quick skim and approach people that we are really excited about. It is mostly so that people can opt in to the process and show that they are somewhat enthusiastic about becoming a fund manager.</p>\n", "parentCommentId": "iEme9ZpWcAhqkfQAD", "user": {"username": "calebp"}}, {"_id": "JcsxmencdgefmksiB", "postedAt": "2023-08-05T00:20:30.276Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p><strong>Re: deemphasizing expertise:</strong></p><p>I feel kind of confused about this-- I agree in theory re: EV of marginal grants, but my own experience interacting with grant evaluations from people who I've felt were weaker has been that sometimes they’re in favor of rejecting a grant that I think would be really good, or missing a consideration that I think would make a grant pretty bad, and furthermore it's often hard to quickly tell if this is the case, e.g. they'll give a stylized summary of what's going on with the applicant, but I won't know how much to trust that summary, so feel compelled to read the full grant application (which is bad, because I already bottleneck the process so much).</p><p>I basically feel pretty confident that lowering the bar for fund managers would lead to worse grants by my lights, but I don't think I have a great grasp on the full space of trade-offs (i.e. how much worse, exactly? is the decrease in quality worth it to be able to get through more grants in a timely way?); it's totally plausible to me there would be some set-up that would overall be better than the current one.</p><p><strong>Re: comparing to FTXFF and Manifund:</strong></p><p>I think the pitch for being a regrantor for the FTXFF or Manifund is pretty different than the one for the LTFF, both in terms of structure and raw number of hours.&nbsp;</p><p>As a regrantor, you get to opt-in to making the grants you're most excited about on your own time, whereas on the LTFF, you're responsible for spending a certain number of hours per week (historically, we've asked for a minimum of 5, though in practice people work less than that) evaluating incoming grant applications. (As a concrete instance of this,<a href=\"https://manifund.org/AdamGleave\">&nbsp;<u>Adam Gleave</u></a> is currently a regrantor at Manifund but left the LTFF a while ago -- this isn't to cast aspersions on Adam; just to illustrate that people have differing preferences between the two.)</p><p>I do think a possible restructure for the LTFF would be to switch to an opt-in regranting set-up, but that would be a pretty different way of operating. (I'd guess a bunch of good grants coming in through our application form would be missed by default, but it could still be overall preferable from the perspective of being more sustainable for fund managers.)</p>", "parentCommentId": "cGTK8BgagDZshtx6a", "user": {"username": "abergal"}}, {"_id": "t8DDsQLhsgxPjeek8", "postedAt": "2023-08-08T11:44:12.053Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Thank you for the helpful replies Asya.</p><p><strong>Re: deemphasizing expertise:&nbsp;</strong></p><p>I would imagine that some of the time saved in hiring expert grantmakers could be spent training junior grantmakers. (In my somewhat analogous experience running selection for a highly competitive program, I certainly notice that some considerations that I now think are very important were entirely missing from my early decision-making!) Should I think about your comment as coming from a hypothetical that is net or gross of that time investment?</p><p>As for improved set-ups, how about something like:</p><ol><li>Junior grantmaker receives disproportionate training on downside considerations.</li><li>Junior grantmaker evaluates grants and rates downside risk.</li><li>Above some downside risk cut-off, if the junior grantmaker wants to give funding, the senior grantmaker checks in.</li><li>Below the cut-off, if the junior grantmaker wants to give funding, the funding is improved without further checks.</li></ol><p>(If you think missing great grants is a bigger deal than accepting bad ones, analogously change the above.)</p><p>Intuitively, I would guess that this set-up could improve quite a bit on the waste-of-your-time and speed problems, without giving up too much on better-grants-by-your-lights. But I'm sure I'm missing helpful context.</p><p><strong>Re: comparing to FTXFF and Manifund:</strong>&nbsp;</p><p>Definitely makes sense that the pitches are different. I guess I would have thought of this as part of \"other hiring criteria you might have\" -- considerations that make it more challenging to select from the pool of people with some grantmaking experience, but for which some people tick the box.</p>", "parentCommentId": "JcsxmencdgefmksiB", "user": {"username": "joel_bkr"}}, {"_id": "J3psNbq7s3AYZ4mz7", "postedAt": "2023-08-08T11:45:54.484Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Thanks Caleb! Noting that my <a href=\"https://forum.effectivealtruism.org/posts/9vazTE4nTCEivYSC6/reflections-on-my-time-on-the-long-term-future-fund?commentId=t8DDsQLhsgxPjeek8\">reply to Asya</a> is relevant here too.</p>", "parentCommentId": "dAQoHt3huhmfBmiFx", "user": {"username": "joel_bkr"}}, {"_id": "kb8ogF8ncCvHmtQ79", "postedAt": "2023-08-09T13:50:22.737Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>I think having paid (part time or full time) fund managers with less expertise makes sense. Having such a high turnover of fund managers isn't great for grantees either. I'm not really sure what the cons of paid fund managers are, but I can imagine that there's a good argument against it that would change my mind. Having less expertise could be a great thing, as your mind isn't set on a particular view and you can still gather insights from people who do have expertise. And while they perhaps won't be experts in AI safety or biosecurity, they could be(come) experts at managing funds. Perhaps a pool of experts could be created that fund managers can ask questions too, as long as it won't take up more than 2 hours a week of their time (or a different cut off).</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "ZaGoZ9hYojnpFJKeN", "postedAt": "2023-08-09T20:35:31.578Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>LTFF (and I think EAIF as well) already offers pay to fund managers. Some fund managers take them up on it; I personally didn't until recently (when I started investing more time into LTFF than RP work, mostly on the communications front).&nbsp;</p>", "parentCommentId": "kb8ogF8ncCvHmtQ79", "user": {"username": "Linch"}}, {"_id": "eGJa6CsBfE3JHhG35", "postedAt": "2023-08-13T01:27:52.771Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<blockquote><p>I think both of these actions arguably trade off one theory of change for the fund, \"contributing to the epistemic commons\", for another, \"making more (good) grants\".</p></blockquote><p>I think this misses an important other theory of change: \"raising money\". In fact it seems that the EA Funds are uniquely unsuited to making anonymous grants, because unlike with OP or SFF/Lightspeed, LTFF making an anonymous grant denies the information not only to the general public but also to the donors.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "BMavrXf4r5eqoZcKL", "postedAt": "2023-08-14T10:47:07.233Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Thank you for sharing your reflections and for the work you've done on the EA Funds, Asya! I appreciate the role the Funds have played over the past years.</p><blockquote><p>our median response time from January 2022 to April 2023 was 29 days, but our current mean (across all time) is 54 days (although the mean is very unstable)</p></blockquote><p>A few questions arise from your mention of the Funds' response times. I would love to hear more about the numbers and information here. For instance, how did the median and mean change over time? What does the global distribution look like? The disparity between the mean and median suggests there might be significant outliers; how are these outliers addressed? I assume many applications become desk rejects; do you have the median and mean for the acceptance response times?</p>", "parentCommentId": null, "user": {"username": "esben-kran"}}, {"_id": "GEwiuxEYNMJEn2tEv", "postedAt": "2023-08-24T17:52:44.128Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>Thank you Asya for all the time and effort you have put in here and the way you have manged the fund. I've interacted with the LTFF a number of times and you have always been wonderful: incredibly helpful and sensible.&nbsp;</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "yJWZDMHywmjM6WQKG", "postedAt": "2023-08-30T02:04:49.735Z", "postId": "9vazTE4nTCEivYSC6", "htmlBody": "<p>I am quite confused about why keeping track of individual deadlines isn’t automated?</p>\n", "parentCommentId": null, "user": {"username": "bec_hawk"}}]