[{"_id": "WgDM4DYipiY3aR2cM", "postedAt": "2014-10-22T17:40:24.627Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>As a GWWC member, my initial reaction is that I would be strongly against this change - one of the reasons I joined was infact specifically because GWWC was committed only to the narrow cause and not a club for EA types in general. </p>\n<p>GWWC has brand equity precisely because it focuses on the specific cause within EA that has wide appeal and impeccable credentials. Making this change would basically allow other causes that may have significant philosophical and/or practical baggage to trade on that reputation while undermining the focus and work on extreme poverty.  It does nothing to help the fight against extreme poverty and may harm it, while boosting those who are seeking to advance other causes. </p>\n<p>I think it would be inevitable that in the near future - this change would also change the type of research that GWWC is focused on - if a significant number of the members of the organisation primarily gave to charities and causes unconnected to those that GWWC researched - then it seems inevitable that a shift in the priorities would occur - why only research one area when many of your new members don't care about it and think other areas are more important?</p>\n<p>To be a little rude, we don't need more ways for people looking to blur the lines between their &quot;Institute for Rich White Guys to write Harry Potter Fan Fiction&quot; (as it was described in one recent debate elsewhere)  and the reputations of charities fighting malaria in the developing world - there are more than enough other avenues within effective altruism where this happens already as a historical accident of where it first found purchase.</p>\n", "parentCommentId": null, "user": {"username": "AlasdairGives"}}, {"_id": "sL3Chxui74QAr27Q8", "postedAt": "2014-10-22T17:54:55.585Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I find myself really quite strongly against this. I'll try to find the time to compose a comment explaining why, but for now I'll simply state this as a data point.</p>\n", "parentCommentId": null, "user": {"username": "Ervin"}}, {"_id": "co844HeC6wwdMeYBD", "postedAt": "2014-10-22T18:00:40.749Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>To answer this question:</p>\n<blockquote>\n<p>if you aren’t yet a member of Giving What We Can, would you join if this change was made?</p>\n</blockquote>\n<p>I'm not a member, but I've been seriously considering joining for a while, and probably <em>wouldn't</em> join if this change was made, as a large part of the appeal of publicly joining GWWC is being part of a community focused on global poverty, rather than of singularitarians, rationalists and the like (who have their own communities).</p>\n", "parentCommentId": "sL3Chxui74QAr27Q8", "user": {"username": "Ervin"}}, {"_id": "ho3HAY6Lnu8B6dTuh", "postedAt": "2014-10-22T18:16:40.058Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>GWWC has brand equity precisely because it focuses on the specific cause within EA that has wide appeal and impeccable credentials. Making this change would basically allow other causes that may have significant philosophical and/or practical baggage to trade on that reputation while undermining the focus and work on extreme poverty. It does nothing to help the fight against extreme poverty and may harm it</p>\n</blockquote>\n<p>This seems true. If people focused on animal welfare would benefit from their own pledge, we could maintain clear messaging by having Animal Charity Evaluators revive the old Effective Animal Activism one, without muddying the GWWC pledge (which I'd find upsetting).</p>\n", "parentCommentId": "WgDM4DYipiY3aR2cM", "user": {"username": "Vincent_deB"}}, {"_id": "mhceghWjCB3zyy5qR", "postedAt": "2014-10-22T19:19:38.381Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>There is in fact already an EA system for cause neutral pledging that includes AR rights and far-future causes. <a href=\"http://effectivealtruismhub.com/donations\">http://effectivealtruismhub.com/donations</a></p>\n", "parentCommentId": "ho3HAY6Lnu8B6dTuh", "user": {"username": "Joey"}}, {"_id": "YZ9Jk8RA6KfTmb4p9", "postedAt": "2014-10-22T19:22:24.700Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I am not currently a GWWC member, but I intend to join in the future.  This change wouldn't have a large effect on me either way, but I would support it.  </p>\n<p>I have watched the EA movement evolve over the last few years, and it seems to be broadening its scope.   This has been especially evident at with GiveWell's Open Philanthropy Project (OPP).  When I first became familiar with GiveWell, my initial reaction was that they were missing the big picture. The OPP has been a big positive for me because it addresses areas that could have massive impact, even if there is more uncertainty and attributing direct impact is difficult.  I have also noticed 80,000 Hours broaden its message and career recommendations over the past year from mainly focusing on earning to give, to acknowledging that a high risk, high reward career with direct impact might also be a reasonable choice for certain people.  </p>\n<p>This broadening of scope is essential because it includes people who initially feel the movement is missing the bigger picture (even if they change their minds later).  I think the EA community will incorporate more ideas from development economics and x-risk over the coming years, and that this is a good thing. </p>\n", "parentCommentId": null, "user": {"username": "Phil_Thomas"}}, {"_id": "6YbMp28fnR2ab9SaX", "postedAt": "2014-10-22T19:49:48.563Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I don't think it's accurate to say that if the pledge were changed, GWWC would become a community of &quot;singularitarians, rationalists and the like.&quot; It would be a community of people who want to donate 10% of their income to most effectively improve the lives of others, which could <em>include</em> singularitarians and rationalists, but certainly wouldn't be defined by it. Saying you wouldn't want to take the pledge for this reason seems a bit like saying you don't want to be part of the EA community because it contains those people.</p>\n<p>Also, note that the current pledge doesn't actually exclude singularitarians, rationalists etc.: &quot;The change is not likely to make a difference to people who think that the best way to help others is to ensure that the future will go well, since the pledge already explicitly includes people who will live in the future, as well as those alive now.&quot; So it's unlikely that changing the pledge would result in the community changing in the way you're concerned about.</p>\n", "parentCommentId": "co844HeC6wwdMeYBD", "user": {"username": "Jess_Whittlestone"}}, {"_id": "QBgrtv3zfFuMXr8Hn", "postedAt": "2014-10-22T19:56:04.671Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Making this change would basically allow other causes that may have significant philosophical and/or practical baggage to trade on that reputation while undermining the focus and work on extreme poverty. It does nothing to help the fight against extreme poverty and may harm it, while boosting those who are seeking to advance other causes.</p>\n</blockquote>\n<p>This makes it sound like the causes are competing with each other, which I don't think is true. Changing the pledge isn't about undermining the focus on extreme poverty, it's about recognising that what we ultimately care about is <em>saving lives</em>, no matter where or when they are, whether they are in the developing world, the developed world, or in the future. Some people think the best way to save lives is to donate to far-future oriented causes, others think the best way is to donate to poverty causes - these people disagree, but mostly they agree that what they ultimately care about is the same and this is just a really tough question. Given that none of us can be certain that poverty is the best cause to focus on, it seems beneficial to be more inclusive of other potentially effective cause areas, so we can encourage more discussion and debate amongst the people who disagree. It is not a competition or a matter of one cause trying to crowd out the other.</p>\n<blockquote>\n<p>To be a little rude, we don't need more ways for people looking to blur the lines between their &quot;Institute for Rich White Guys to write Harry Potter Fan Fiction&quot; (as it was described in one recent debate elsewhere) and the reputations of charities fighting malaria in the developing world - there are more than enough other avenues within effective altruism where this happens already as a historical accident of where it first found purchase.</p>\n</blockquote>\n<p>Again, you're assuming that there being a link between people focused on fighting malaria and those concerned about existential risk is a bad thing. I acknowledge that there are PR issues with xrisk, and there are concerns there - but ultimately, it seems a <em>good</em> thing to me to have a community where people from both these groups can acknowledge their shared values and have productive debates with one another. </p>\n", "parentCommentId": "WgDM4DYipiY3aR2cM", "user": {"username": "Jess_Whittlestone"}}, {"_id": "5PqHMArBMj7bMWCHG", "postedAt": "2014-10-22T20:03:55.711Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks for writing this up and seeking feedback, Michelle!</p>\n<p>I'm in favour of the change - you know this, but I'm saying it here because I'm concerned that only people with strong disagreements will respond to this post, and so it will end up looking like the community is more against the change than it in fact is. </p>\n<p>I think ultimately having a broader pledge will better represent the views of those who take it and the community, and agree that having a clear action which becomes standard for all EAs could be very beneficial.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "8dNwLbpyFEGWu3NxE", "postedAt": "2014-10-22T20:27:42.324Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>&quot;it's about recognising that what we ultimately care about is saving lives, no matter where or when they are&quot; </p>\n<p>This is not why I joined GWWC. I joined because I am concerned about causes that demonstrably and effectively help human people today - not causes that may conceivably if we accept unfalsifiable/provable premises help people in the future or causes that provably help animals (because I reject the philosophical premises of that cause). </p>\n<p>I fully support cause X - effectively fighting poverty in the developing world. I find causes Y &amp; Z interesting but highly problematic, and don't want to be a part of an organisation that lends them undue credibility and support beyond discussion and debate. I signed up because I believe in cause X - if the organisation changes to be about causes XYZ I would probably leave to find somewhere that only supports the cause I actually support or just declare my donations independently or something.</p>\n<p>So this new pledge would change the whole relationship of the pledge. Currently, GGWC members make a pledge to give 10% of their income to a very narrow range of charities based on very strict criteria. Under the new pledge, all you need is a philosophical argument about why the cause you support is one that does &quot;the most good&quot; - all the rigour and testing based on actually comparable measures is gone.</p>\n<p>There are loads of other causes , not much discussed around here, which would qualify under the new pledge. For example, there are many people in the world today who believe that the best cause to help other people is to donate a significant part (10% infact) of their income towards god's plan by funding the expansion of evangelical churches across the world. Would you be comfortable with them signing the GWWC pledge and associating themselves with the organisation? What about those who feel that legalising drugs is the most important cause because they like to get high? or Hindu charities who fund sanctuaries for cows because they believe cows are sacred animals with incommensurable value above mere people? </p>\n", "parentCommentId": "QBgrtv3zfFuMXr8Hn", "user": {"username": "AlasdairGives"}}, {"_id": "XchbezGRNLxsqZeQB", "postedAt": "2014-10-22T20:37:24.418Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>one of the reasons I joined was infact specifically because GWWC was committed only to the narrow cause and not a club for EA types in general.</p>\n</blockquote>\n<p>I think that <a href=\"http://www.openphilanthropy.org/#open\">cause agnosticism</a> is probably the most important novel ingredient of effective altruism, so seeing this kind of sentiment is disheartening. (I don't have strong views on the pledge itself.)</p>\n", "parentCommentId": "WgDM4DYipiY3aR2cM", "user": {"username": "Paul_Christiano"}}, {"_id": "djFxTgGxMq9XPPJYL", "postedAt": "2014-10-22T20:40:21.516Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>For example, there are many people in the world today who believe that the best cause to help other people is to donate a significant part (10% infact) of their income towards god's plan by funding the expansion of evangelical churches across the world. Would you be comfortable with them signing the GWWC pledge and associating themselves with the organisation? What about those who feel that legalising drugs is the most important cause because they like to get high? or Hindu charities who fund sanctuaries for cows because they believe cows are sacred animals with incommensurable value above mere people?</p>\n</blockquote>\n<p>I'm not sure these people are much more easily excluded by the current pledge. You could still get people who have very bizarre beliefs about the best way to help people in poverty. This is always going to be a risk - but it seems unlikely people who are overly attached to specific causes are going to find the GWWC community that appealing.</p>\n<blockquote>\n<p>I joined because I am concerned about causes that demonstrably and effectively help human people today - not causes that may conceivably if we accept unfalsifiable/provable premises help people in the future or causes that provably help animals (because I reject the philosophical premises of that cause).</p>\n</blockquote>\n<p>Are you saying that you genuinely care more about people alive today than people who will live in the future? Or that you care about them equally but think we have much more evidence for helping the former category and so should focus our efforts there? If the former, then I think you'll find a lot of the existing GWWC community disagree with you. If the latter, then it seems that you should at least be open to considering and investigating causes that help people in the future, even if you don't currently think that the standards of evidence are anywhere near high enough, which I agree is reasonable.</p>\n", "parentCommentId": "8dNwLbpyFEGWu3NxE", "user": {"username": "Jess_Whittlestone"}}, {"_id": "S9oLBNF2s3e4uKo4g", "postedAt": "2014-10-22T20:43:23.474Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>The issue isn't one of fitting several goals in one pledge. If you take the current GWWC pledge to literally require supporting interventions in developing countries, then that's not something that a cause-agnostic donor should be willing to agree to early in their life, even if they currently think that interventions in developing countries are most promising.</p>\n<p>Which cause you support should be open to change as you learn and as the available opportunities change.</p>\n", "parentCommentId": "ho3HAY6Lnu8B6dTuh", "user": {"username": "Paul_Christiano"}}, {"_id": "AFcvyYDm6jx2SkJHv", "postedAt": "2014-10-22T20:59:24.713Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I am fairly cause agnostic to causes that have provable impact and don't rely on highly contestable philosophical premises for their justification. I consider evidence of impact (making beliefs pay rent) to be central to that. There are lots of causes (for example - open borders, x-risk also) that I think may plausibly have a large impact but don't have the evidence to show that my donations will pay rent in the way charities currently supported by GiveWell &amp; GWWC do.</p>\n", "parentCommentId": "XchbezGRNLxsqZeQB", "user": {"username": "AlasdairGives"}}, {"_id": "MPg5D8LdPqizF2XxH", "postedAt": "2014-10-22T21:07:06.385Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I was initially in favor of the change, but after reading comments from the people who are against it, I'm less sure. </p>\n<p>I do currently donate to MIRI. I do this somewhat cautiously - there are good reasons to still be skeptical. If I didn't donate to MIRI, I'd still think that global poverty would likely not be the best contender for &quot;top charity&quot;, except for PR reasons.</p>\n<p>But I do acknowledge that there are already good flagship organizations and networks for non-Global-Poverty EA, and it may be important to preserve the brand integrity of GWWC and not having it bend towards &quot;the generic EA 'donate a lot of money' charity.&quot; </p>\n<p>The flipside is it <em>is</em> good for the EA community to have a standard of giving larger amounts, and having GWWC represent that has been helpful. </p>\n<p>I'm not certain, just wanted to note that as a &quot;Future People&quot; donor, there's room to think that this is at least an open question. </p>\n", "parentCommentId": null, "user": {"username": "Raemon"}}, {"_id": "vSipvJRpXX96thDNT", "postedAt": "2014-10-22T21:13:08.314Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I don't see how this is consistent with pledging to support the cause indefinitely. (I'm not objecting to GWWC being a poverty-focused community.)</p>\n<p>It's worth noting that your stance towards evidence appears to be unusual amongst modern philanthropists, and in particular the standard of &quot;provable&quot; seems both counterproductive and radical. I hope that this stance doesn't become a standard part of what makes effective altruism distinctive. </p>\n<p>I am glad that the open philanthropy project (formerly givewell labs) exists; given that foothold, I think that overreliance on measurement is a significantly less likely failure mode than it otherwise would be. Low epistemic standards and insufficient skepticism seem like more plausible failure modes, and I think we are on the same page concerning those issues. (I agree that more openness exacerbates these difficulties, though I am skeptical that an exclusive focus on poverty per se is too helpful.)</p>\n", "parentCommentId": "AFcvyYDm6jx2SkJHv", "user": {"username": "Paul_Christiano"}}, {"_id": "TrNqE8no3rH56eJe5", "postedAt": "2014-10-22T21:24:07.629Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I remember that GWWC management asked us this in the pledgers' Facebook group, and that a lot of us expressed unhappiness about it, saying that it'd be a big rebranding, change the organisation from the one they joined, be unproductively vague, and we'd &quot;perceive it as a big loss&quot;, etc. So I'm a bit surprised and disappointed to see the apparent determination to push this through regardless of our wishes. (I apologise if I'm wrong to perceive this, and there's a chance that GWWC will stay focused on the global poor.)</p>\n", "parentCommentId": null, "user": {"username": "arrowind"}}, {"_id": "MNQFhGsgPQvXSWM7i", "postedAt": "2014-10-22T21:31:29.357Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>One thing that I didn't make sufficiently clear: It is already the case that donating to an organisation which seeks to prevent future catastrophes (whether that be climate change, global pandemics or whatever) would fulfil the pledge, if you thought that was the most effective way to help those in the developing world. The pledge specifically includes 'now and in future' to make clear that not only currently existing people are important. We already have (and I believe have for many years had) members who donate to, for example, the Future of Humanity Institute. That hasn't in the past caused problems, nor led to us evaluating those charities. This shift would be more relevant for those who think that the most effective causes are animal welfare based, than for those concerned about future risks to humans.</p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "o4ctKEHKeN4K7gkcF", "postedAt": "2014-10-22T21:37:27.269Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>The primary reason why I have not signed the GWWC pledge is that I do not want to commit myself to global poverty causes. If this change were made, I would be much more likely to sign the pledge.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "Kfdia5dXvfimegX7P", "postedAt": "2014-10-22T22:14:34.763Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Saying you wouldn't want to take the pledge for this reason seems a bit like saying you don't want to be part of the EA community because it contains those people.</p>\n</blockquote>\n<p>I see why you might say that, and understand your position, but I hope you can see how it could be a little uncharitable to those of us who feel crowded out of what was originally an organisation that made a compelling case about our obligation to help people in the developing world (with things like the calculator showing that many potential GWWC members were in the richest 1-5% of the world). You say that changing the pledge would just include <em>additional</em> groups, and that this wouldn't define it. But - without having anything against people who are focused on different causes! - I don't think we should broaden the pledge (or other global poverty pledges/groups) just because we can do so without technically excluding people who took the old version.</p>\n<p>You make it sound a bit like I'm being unwelcoming to other groups. But I think that they have their own venues (look at the size of LessWrong and its meetups), and that there's merit in having multiple venues with clear purposes. Being &quot;part of the EA community&quot; is more amorphous than having taken a pledge to help those in the developing world, so I'm happy to be in a (non-formal sense) part of a community that contains singularitarians, animal welfare activists and many others. But if I found that I'd taken a pledge which was then changed to drop its original focus on the developing world and stated rationale, I'd see that as a broadening which wasn't automatically good.</p>\n<blockquote>\n<p>[It] could include singularitarians and rationalists, but certainly wouldn't be defined by it</p>\n</blockquote>\n<p>This is true in one sense - if I've committed to doing X as the best way to do Y, then however many other people then commit to Z as the best way to do Y, that doesn't change the definition of my commitment. But, purely as a hypothetical, imagine that GWWC central made a big effort to sign up lots of new members from a particular group - either singularitarians or vegan outreach activists or something else. And imagine that they dwarfed the original member base, which might be seen as a big success. That would 'define' GWWC in _a_ sense.</p>\n<blockquote>\n<p>Also, note that the current pledge doesn't actually exclude singularitarians, rationalists etc.: &quot;The change is not likely to make a difference to people who think that the best way to help others is to ensure that the future will go well, since the pledge already explicitly includes people who will live in the future, as well as those alive now.&quot;</p>\n</blockquote>\n<p>I was initially puzzled by this, as the <a href=\"https://www.givingwhatwecan.org/pledge\">text of the pledge</a> is:</p>\n<blockquote>\n<p>&quot;I recognise that I can use part of my income to do a significant amount of good in the developing world. Since I can live well enough on a smaller income, I pledge that for the rest of my life or until the day I retire, I shall give at least ten percent of what I earn to whichever organisations can most effectively use it to help people in developing countries, now and in the years to come. I make this pledge freely, openly, and sincerely.&quot;</p>\n</blockquote>\n<p>I'm guessing that a singularitarian could read that as something she could sign up to as she's technically aiming to &quot;help people in developing countries&quot; - just by helping the entire population! It seems a bit of a stretch, but I can see that. It's less obviously something that CFAR does.</p>\n<p>Anyway, I've violated my original plan not to comment more until I had extra time, but I hope this helps you understand where I'm coming from :-)</p>\n", "parentCommentId": "6YbMp28fnR2ab9SaX", "user": {"username": "Ervin"}}, {"_id": "hDMeM3EqNDFt9gH34", "postedAt": "2014-10-22T22:28:40.756Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>My initial reaction was negative - I wanted GWWC to stay focused on global poverty both due to my personal preference of that cause plus the concern that expanding it could scare off / confuse new people. But after reading the rest of the post I don't have those concerns anymore, and I think this would be a good change. I suspect some of the others who gave negative feedback might have not read the whole thing and have an exaggerated idea of what is actually being proposed.</p>\n", "parentCommentId": null, "user": {"username": "BlakeHilliard"}}, {"_id": "Zs3bbPbrwx4oCgSnM", "postedAt": "2014-10-22T22:30:09.955Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>I think that cause agnosticism is probably the most important novel ingredient of effective altruism, so seeing this kind of sentiment is disheartening. (I don't have strong views on the pledge itself.)</p>\n</blockquote>\n<p>As I said to Jess Whittlestone, it's worth being clear that the attitude that AlasdairGives expresses isn't a narrow-minded <em>rejection</em> of people who favour other causes and more general EA types. If you read him charitably, he's saying that he joined because he sincerely thought that GWWC-recommended charities were the ones which he should support, and that he wanted to express this rather than joining a club for EA types in general. Not that he favours a commitment to a narrow cause for its own sake.</p>\n<p>I'm glad that you're open to GWWC being a poverty-focused community, so this may not ultimately be an important disagreement :-)</p>\n", "parentCommentId": "XchbezGRNLxsqZeQB", "user": {"username": "Ervin"}}, {"_id": "nxxwCNFnCx56JTCps", "postedAt": "2014-10-22T22:53:58.578Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>I'm not sure these people are much more easily excluded by the current pledge. You could still get people who have very bizarre beliefs about the best way to help people in poverty.</p>\n</blockquote>\n<p>Technically that's possible but in practice GWWC members don't currently tend to have those beliefs - the pledging community has a clear feel of being focused on evidence-based poverty charities. The new pledge that's being consulted about would certainly include more people, and AlasdairGives is right that there's nothing in it that'd exclude the large numbers of people who tithe to their churches. If they joined in mass (which is unlikely absent a concerted effort to sign them up) that would certainly change the feel of the community to me.</p>\n<blockquote>\n<p>Are you saying that you genuinely care more about people alive today than people who will live in the future?</p>\n</blockquote>\n<p>It's worth noting that many people do, and that this isn't obviously indefensible. So people can genuinely care more about existing people or existing creatures :-)</p>\n", "parentCommentId": "djFxTgGxMq9XPPJYL", "user": {"username": "Ervin"}}, {"_id": "whkw6bCCeqwWBdC7B", "postedAt": "2014-10-22T22:59:06.084Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I am a stickler for honesty, so although this is a small point, I'd be concerned about the part:</p>\n<blockquote>\n<p>now and in the years to come</p>\n</blockquote>\n<p>Because this sounds like I have to do 10% per year every year (or at least, this year, since it says &quot;now&quot;).</p>\n<p>In general, I'm just averse to binding myself to anything that could make me deviate from doing the most good. I could see situations where it's not best for me to donate &gt;=10% (like this year since I'm a student), and I feel bound to anything I sign.</p>\n<p>But I think I'm unique in being a stickler here, so don't take this comment too seriously.</p>\n", "parentCommentId": null, "user": null}, {"_id": "G4yyGfjWvffFbTSd6", "postedAt": "2014-10-22T23:12:30.283Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>I could see situations where it's not best for me to donate &gt;=10% (like this year since I'm a student)</p>\n</blockquote>\n<p>If you're a student you're not counted as having an income, and I believe you only have to give 1% of living costs (someone from GWWC can correct me if I'm wrong!). Besides that, having a pledge you have to fulfil every year seems like a valuable thing - it's good to be a stickler for honesty. If you're planning to donate or already donating but can't commit to 10% every year yet, you could always declare that rather than taking the pledge yet, and then decide whether to take it later.</p>\n", "parentCommentId": "whkw6bCCeqwWBdC7B", "user": {"username": "Ervin"}}, {"_id": "2Q2PmkpHxEJGHkbds", "postedAt": "2014-10-22T23:37:36.460Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I have been for a couple of years an interested observer of the effective altruism movement, with my primary concerns being ecosystem conservation and climate change. I would have joined GWWC already had it not been for the restrictions in the current pledge. I support the new pledge, and if it were to be adopted I would have no hesitation in taking it and joining GWWC.</p>\n", "parentCommentId": null, "user": {"username": "alw"}}, {"_id": "wFLzjqKybwsRfpk8z", "postedAt": "2014-10-22T23:51:48.313Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I would strongly consider joining GWWC if this change were made. I agree that there are a number of thorny issues to work out.</p>\n<p>EDIT: In particular, I'm really uncomfortable with the prospect of environmentalists joining GWWC.</p>\n", "parentCommentId": null, "user": {"username": "Buck"}}, {"_id": "JGPXRc9JvoB5deRG5", "postedAt": "2014-10-22T23:54:45.434Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>It's worth noting that GWWC already includes many MIRI donors. Certainly much of the CEA management thinks that Xrisk/animals/other speculative causes is more important than global poverty, and MIRI is even listed (in a very hard to see spot) on the <a href=\"https://www.givingwhatwecan.org/\">GWWC front page</a> (scroll down to the 'donated' pie chart, then hit the down arrow to scroll through the recipient charities). GWWC has accepted Xrisk charities as fulfilling the pledge at least since 2011, and perhaps longer.</p>\n<p>However, I agree with you that this would damage GWWC's brand equity. It is already a hard enough sell at the moment. Once upon a time, GWWC was concerned about being publicly associated with 80k, let alone XRisk.</p>\n", "parentCommentId": "WgDM4DYipiY3aR2cM", "user": {"username": "Dale"}}, {"_id": "MCsDoJ9JJ3MLZMNhp", "postedAt": "2014-10-23T00:02:57.131Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Potential concerns we have: </p>\n</blockquote>\n<blockquote>\n<p>New members thinking that their pledge would be fulfilled by donating to a charity in their local area, rather than considering charities on a global scale. </p>\n</blockquote>\n<p>Unfortunately, it seems that this <em>would</em> satisfy the pledge, assuming the donor genuinely thought those charities were the most effective. And there are plausible epistemic states that might lead to such a view - for example, skepticism about the reliability of reports about the impact of distant actions.</p>\n<p>This would not be a concern if GWWC was prepared to say &quot;and your donations have to be to charities we approve of.&quot; Unfortunately, because the pledge also says</p>\n<blockquote>\n<p>most effectively</p>\n</blockquote>\n<p>this would require GWWC to judge that these charities were all <em>equally</em> effective. So, for example, FHI and SCI would have to be <em>equally</em> effective. Which does not sound very plausible - while I can understand thinking that FHI is much better than SCI, or SCI much better than FHI, thinking the two are <em>equal</em> in effectiveness seems hugely implausible. I don't know of anyone who actually holds that view.</p>\n<p>So as far as I can see, either</p>\n<ul>\n<li>Donating locally <em>could</em> satisfy the new pledge</li>\n<li>GWWC should drop the word 'most'</li>\n<li>All the charities GWWC endorses as pledge-compliant must be exactly equally effective</li>\n<li>or GWWC can only recommend one charity (which is actually a sub-case of the previous option).</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "PBwMQAKzQX9M5sXRf", "postedAt": "2014-10-23T00:05:36.592Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>I have watched the EA movement evolve over the last few years, and it seems to be broadening its scope. This has been especially evident at with GiveWell's Open Philanthropy Project (OPP).</p>\n</blockquote>\n<p>This may be a semantic question about what you class under EA, but the scope's always seemed pretty broad - with LessWrong and MIRI big, and GiveWell considering areas other than poverty, before GWWC. GWWC slotted in as the poverty pledge organisation, but that didn't constrain the scope of EA. To that extent I don't think the following is quite right, because GWWC doesn't define the whole EA movement, and the movement already has plenty of visible advocates of other causes:</p>\n<blockquote>\n<p>This broadening of scope is essential because it includes people who initially feel the movement is missing the bigger picture (even if they change their minds later). </p>\n</blockquote>\n", "parentCommentId": "YZ9Jk8RA6KfTmb4p9", "user": {"username": "Vincent_deB"}}, {"_id": "9EFzYKTuRe8A5wSTS", "postedAt": "2014-10-23T00:08:39.949Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>One could be a GWWCer without being an effective altruist. Indeed, given that GWWC is focused on global poverty, a priori it seems to be inherently <em>cause-partial.</em> </p>\n", "parentCommentId": "XchbezGRNLxsqZeQB", "user": {"username": "Dale"}}, {"_id": "J3T4WR9dzvHQom85b", "postedAt": "2014-10-23T00:10:41.601Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>This makes it sound like the causes are competing with each other, which I don't think is true.</p>\n</blockquote>\n<p>Well, they are competing for time and money, both of which are scarce.</p>\n", "parentCommentId": "QBgrtv3zfFuMXr8Hn", "user": {"username": "Dale"}}, {"_id": "86i38oY4K2cEFbuYY", "postedAt": "2014-10-23T00:58:26.485Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Certainly much of the CEA management thinks that Xrisk/animals/other speculative causes is more important than global poverty</p>\n</blockquote>\n<p>That feels a bit odd given that they're recruiting people who care about poverty to GWWC :(</p>\n", "parentCommentId": "JGPXRc9JvoB5deRG5", "user": {"username": "Vincent_deB"}}, {"_id": "mjMJgvBa5jwDF2cT7", "postedAt": "2014-10-23T01:02:18.262Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I am not a member of GWWC, and the primary reason for this is that humans are not the only &quot;others&quot; I care about, so the restriction to considering only what will do the most good for humans in the developing world is not one I am willing to make. I would consider joining GWWC if the pledge were changed. This might or might not have an effect on the amount I donated or where I donated it. If GWWC requires members to disclose where and how much they donate, sharing that information would be a difference in my donation behavior.</p>\n<p>I personally think first of GiveWell when I think of &quot;global poverty EA org&quot; and of GWWC when I think of &quot;pledge to donate money EA org&quot;. I don't know how representative of others that view is, particularly given that it's not especially reflective of reality. (GiveWell spends a lot of time on their Open Philanthropy Project, which is certainly not fully focused on global poverty.) So while a change in the pledge wouldn't change GWWC's brand much in my eyes, it seems like a valid concern, though one I'd expect GWWC staff and current members to have a better handle on than I do.</p>\n", "parentCommentId": null, "user": {"username": "AllisonSmith"}}, {"_id": "LWqJNkE5fn2gQAqqG", "postedAt": "2014-10-23T01:02:26.564Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Seconding this.</p>\n<p>I am donating to global poverty causes, and do not currently foresee changing my mind about this. But I'm uncomfortable with the pledge, because I change my mind about a lot of things, and doing so about a pledge I've signed would leave me in a pretty awkward position.</p>\n<p>I would love to sign the new pledge.</p>\n", "parentCommentId": "o4ctKEHKeN4K7gkcF", "user": {"username": "Maia"}}, {"_id": "FBzcFv7PBDjw7ccbw", "postedAt": "2014-10-23T01:11:19.477Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>The pledge specifically includes 'now and in future' to make clear that not only currently existing people are important. We already have (and I believe have for many years had) members who donate to, for example, the Future of Humanity Institute.</p>\n</blockquote>\n<p>Huh, I had never realised members included people who donated to FHI. I read &quot;now and in the future&quot; to refer to donating in future years. English is an ambiguous language indeed!</p>\n", "parentCommentId": "MNQFhGsgPQvXSWM7i", "user": {"username": "Vincent_deB"}}, {"_id": "Fx4fWxns5Fd9yeCpG", "postedAt": "2014-10-23T01:22:53.169Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>I'm in favour of the change - you know this, but I'm saying it here because I'm concerned that only people with strong disagreements will respond to this post,</p>\n</blockquote>\n<p>I think it'll pull the other way - I've felt awkward about explicitly stating my disagreement, whereas it's much easier to say 'Great!'</p>\n<blockquote>\n<p>I think ultimately having a broader pledge will better represent the views of those who take it and the community, and agree that having a clear action which becomes standard for all EAs could be very beneficial.</p>\n</blockquote>\n<p>I don't find this a convincing reason, because GWWC doesn't need to represent every view in any particular community (be it 'EA' or something else altogether - and many GWWC members have identified with GWWC rather than EA as such). And there can be a clear action for EAs to take (like donating) without that going through GWWC, and conversely pledging 10% is not the best candidate for a clear next step following someone first encountering EA after reading Peter Singer's book on it.</p>\n", "parentCommentId": "5PqHMArBMj7bMWCHG", "user": {"username": "Vincent_deB"}}, {"_id": "9CMR4ufrJThAhDJBR", "postedAt": "2014-10-23T01:24:49.250Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>&quot;It's worth noting that your stance towards evidence appears to be unusual amongst modern philanthropists, and in particular the standard of &quot;provable&quot; seems both counterproductive and radical. I hope that this stance doesn't become a standard part of what makes effective altruism distinctive.&quot;</p>\n<p>I think this stance towards evidence is pretty common in GiveWell donors (which far outnumber EAs) and I agree it's not super common among general philanthropists (although pretty common in government health aid) circles but many EA concepts are not common among general philanthropists. </p>\n", "parentCommentId": "vSipvJRpXX96thDNT", "user": {"username": "Joey"}}, {"_id": "QgtDmy35979T2C78r", "postedAt": "2014-10-23T01:36:58.945Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>It is a pretty common belief among x-risk/meta focused people that poverty is a good introduction to EA and people will later switch to x-risk/meta causes.</p>\n", "parentCommentId": "86i38oY4K2cEFbuYY", "user": {"username": "Joey"}}, {"_id": "4YDRCDaxjKz5aqoBB", "postedAt": "2014-10-23T01:38:48.889Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>This is in large part the reason I didn't take the pledge.</p>\n", "parentCommentId": "S9oLBNF2s3e4uKo4g", "user": {"username": "Larks"}}, {"_id": "dmaarBtqfxHSrCaaM", "postedAt": "2014-10-23T01:41:57.342Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I think you might mean <em>prima facie</em>? <em>A priori</em> is much stronger - it entails (perhaps absolute) knowledge, rather than a mere presupposition. </p>\n", "parentCommentId": "9EFzYKTuRe8A5wSTS", "user": {"username": "Larks"}}, {"_id": "jjpfTuzgmoia4Deat", "postedAt": "2014-10-23T01:44:43.617Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Yeah, reading some of the other comments on here leads me to think I might have a misconception of what EA includes, or how others define EA.  This may be because I come from the global health/ development economics side of things.  I wasn't really sure what LessWrong or MIRI were for a long time, or how they related to the EA community.  It might be pretty common for people to have an incomplete picture of what EA is depending on the intellectual route they took to get here.  So even if the movement is more broad and inclusive, the public perception of the movement may turn people away.</p>\n<p>Also, when I say &quot;missing the bigger picture&quot; I am not solely referring to x-risk, but also to approaches to global health and poverty reduction like R&amp;D for infectious disease, infrastructure development, improving the business environment and generally trying to work around the edges of an economy to address market failures.  It seems to me that there was a gap within the EA community for these types of solutions before the OPP, unless you include J-PAL and IPA.  </p>\n<p>Some of what I'm saying may not be specifically relevant to the above GWWC wording change, but reflect broader changes in the EA movement (or my understanding of it) that I am happy to see.  </p>\n", "parentCommentId": "PBwMQAKzQX9M5sXRf", "user": {"username": "Phil_Thomas"}}, {"_id": "FX3nyfGB26ECqxoNs", "postedAt": "2014-10-23T01:50:26.677Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>But I think I'm unique in being a stickler here</p>\n</blockquote>\n<p>No, I have similar concerns, and I suspect a fair number of other analytic philosophers might too.</p>\n", "parentCommentId": "whkw6bCCeqwWBdC7B", "user": {"username": "Larks"}}, {"_id": "uTXqHWLidxi2SFdwF", "postedAt": "2014-10-23T01:58:59.947Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>As Jess Whittlestone said below, it is often the case that dissenters are much more likely to voice their dissent than agree-ers are to voice their agreement; so the comments on a Facebook group are not necessarily representative.</p>\n<p>Edit: Also, if you ask pledgers what they think about the change, your audience necessarily excludes everyone who didn't like how the pledge was written originally (because people who didn't like the pledge didn't sign it).</p>\n", "parentCommentId": "TrNqE8no3rH56eJe5", "user": {"username": "MichaelDickens"}}, {"_id": "xrJkEsLjJ5fQ5dK8J", "postedAt": "2014-10-23T02:05:41.449Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I don't think it is sufficiently obvious that environmentalism is not the most effective cause. (Just to be clear, I don't think it's the most effective cause, nor do I think it is a top contender.) Why do you feel justified excluding environmentalists?</p>\n", "parentCommentId": "wFLzjqKybwsRfpk8z", "user": {"username": "MichaelDickens"}}, {"_id": "xFcFHBJ29ju9BLpB9", "postedAt": "2014-10-23T02:15:20.176Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I think that depends strongly on the group. In some areas (programming, rationality, libertarianism, atheism) people love to disagree. In others (most charities, religions) people like agreeing. Indeed, in the origional article <a href=\"http://lesswrong.com/lw/3h/why_our_kind_cant_cooperate/\">Eliezer discussed such communities</a>. Given the frequency with which comments on this forum begin &quot;Great Post!&quot;, I think it's credible that we might have a net pro-agreement bias.</p>\n", "parentCommentId": "uTXqHWLidxi2SFdwF", "user": {"username": "Larks"}}, {"_id": "wRBFMwkpMDkHFMgrM", "postedAt": "2014-10-23T02:45:21.409Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I have been reading on EA and GWWC etc for some months now.</p>\n<p>I find it strange that again and again, many of the discussions assume that the givers are in rich countries and that &quot;giving local&quot; is essentially synonymous with &quot;giving within the rich country that the donor resides in&quot;. </p>\n<p>If GWWC/ EA is aimed only at donors residing/ earning in rich countries/ the developed world, I think the assumption should be recognized and clearly stated. </p>\n<p>If this is not an assumption, the write-ups and discussions need to recognize the possibility that donors donating locally may be the same as donors donating to (within) developing countries.  After all, there are persons living in developing countries who are earning well and/ or are committed to altruism...and what's more, they may even be in a position to evaluate &quot;local&quot; (within their developing country) causes better. </p>\n", "parentCommentId": null, "user": {"username": "skz"}}, {"_id": "eaNymqijNPXTA8Bcr", "postedAt": "2014-10-23T04:11:07.930Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>You are totally right that EAs may live in developing countries as well as developed countries. I don't think GWWC would have any problem with such a person taking the pledge and giving to local charities as long as the charities were effective. If I lived in Kenya and donated to GiveDirectly (which works in Kenya), I think that would be perfectly fine.</p>\n<p>I think the current rhetoric is not too big a problem, since about 99% of GWWC's audience lives in the developed world.</p>\n", "parentCommentId": "wRBFMwkpMDkHFMgrM", "user": {"username": "MichaelDickens"}}, {"_id": "6L8xAWEiWuB4eZvv6", "postedAt": "2014-10-23T05:24:18.688Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I'm not a GWWC member, because I don't want to lock myself in to a pledge.  (I've been comfortably over 10% for a few years, and expect that to continue, but I could imagine, e.g., needing expensive medical care in the future and cutting out my donations to pay for that.)  For that reason I wouldn't take the pledge in either its current or its proposed form.</p>\n", "parentCommentId": null, "user": {"username": "pappubahry"}}, {"_id": "3F3vLDc4hHtkfuxk7", "postedAt": "2014-10-23T07:46:54.740Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>It'd be good to discuss how this fits with the <a href=\"http://effectivealtruismhub.com/donations\">EA Donation Registry</a> which I and others spent a fair bit of time building earlier this year. We created it partly to provide a place for EAs who were interested in publicly stating their donation plans but weren't giving to global poverty charities and so might not take the GWWC or Life You Can Save pledges. (We'd earlier had a place for animal welfare donors to do this on the old Effective Animal Activism website which I built for Eitan Fischer, but this hasn't been up for a while.) We mentioned this to GWWC in April, and put the website up in May with donation plans shared by people who took the annual EA survey - there's a <a href=\"http://effective-altruism.com/ea/94/introducing_an_ea_donation_registry/\">recent EA Forum post</a> describing it, and <a href=\"https://impact.hackpad.com/EA-Donation-Registry-cause-neutral-public-record-of-past-and-planned-donations-lDH4EqYxnRv\">notes on the .impact project page</a>.</p>\n<p>Of course, it's quite different to Giving What We Can or The Life You Can Save - they're organisations with members who take a set pledge, whereas the Donation Registry is simply a website on which EAs can share any donations plans they choose to, even if they're not lifelong pledges or 10% of income, and has more public information alongside the EA Profiles. So it's not like they're in competition! People can sign up on the EA Donation Registry and then take the Giving What We Can pledge too if/when they meets its conditions, since neither's going to take fees from people who join. However, the Registry already provides a place for people who donate to other causes, and a clear action they can take in moving from initial interest in EA to donating. It's also designed to be better suited to this than the pledge, as it's more flexible and a substantially lower bar than a lifetime commitment to give 10%. </p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "yTBFurDdPC3oYBbHx", "postedAt": "2014-10-23T07:49:55.472Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I have not signed the GWWC pledge, and will very likely not while the pledge retains its current wording, but would sign if the proposed changes were made.</p>\n", "parentCommentId": null, "user": {"username": "DanielFilan"}}, {"_id": "zvXg5TTnYpmvCbYT9", "postedAt": "2014-10-23T07:53:53.316Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I don't feel strongly about this, but moderately support a switch - it won't affect my decision to pledge, which I'll do so either way as soon as I can support myself while donating. </p>\n<p>Community-wise, I support global poverty above other causes intellectually, but empathise more with transhumany types, so maybe I don't have a horse in the race. I do feel as though GWWC is and should remain an important haven for those committed to poverty, who - in other EA orgs - often seem to be looked on as incomplete or fledgling EAs, an attitude which surely wouldn't help if it developed within GWWC as well.(1)</p>\n<p>If the pledge changes, I strongly support suggest emphasising the GWWC mission statement about being committed to fixing global poverty(1) as its first priority. </p>\n<p>This is perhaps the most demanding pledge in the EA world, so it would make sense to allow EAs of all stripes to commit themselves to it, as long as the pledge stands apart from GWWC main.</p>\n<p>On to pedantry - I feel like if you're going to change the pledge at all, it would be a good time to sharpen the wording rather than just delete the word 'developing' throughout. It feels somewhat bloated, though I'm unsure about exactly how to change it. Some suggestions: </p>\n<ul>\n<li><p>I think '10%' would look much better than 'ten percent' - you could more easily pick it out when scanning the paragraph for a sense of what the org is about. </p>\n</li>\n<li><p>'whichever organisations can most effectively use it to improve the lives of others' feels wordier than it needs to be, but I can't quite see how to trim it without losing anything significant. </p>\n</li>\n<li><p>The first two clauses seem to overlap, and could probably be combined.</p>\n</li>\n<li><p>'now and in the years to come' could be shortened to 'hereafter' (or perhaps something less bureaucratic), but it's also ambiguous and perhaps superfluous. If it refers to the pledging duration, it's redundant given the 'rest of my life ... retirement' line. If it refers to 'orgs that ... improve others' then I'm not sure it adds anything anyway. Do we suppose that people would give to orgs expecting them to use the money as well as possible for 10 years then blow it on a party?</p>\n</li>\n</ul>\n<p>(1) That said, I feel like animal welfarists get even shorter shrift, with only one comparatively small organisation serving them and being the butt of similar attitudes. I wonder separately if there's something to be gained by expanding GWWC's broad remit to explicitly include them, even if in practice you leave all the research to ACE.</p>\n", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "QRPKYR7ufoLBn2hbM", "postedAt": "2014-10-23T08:01:51.100Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>I do feel as though GWWC is and should remain an important haven for those committed to poverty, who - in other EA orgs - often seem to be looked on as incomplete or fledgling EAs, an attitude which surely wouldn't help if it developed within GWWC as well.</p>\n</blockquote>\n<p>Very much agreed, that's why I was concerned to see <a href=\"http://effective-altruism.com/ea/a0/should_giving_what_we_can_change_its_pledge/161\">this comment</a>. Having an influx of people to the members groups who think that donating to poverty charities is many many times less good than giving to AI work or meta causes could create that sort of attitude, making the old members feel crowded out.</p>\n<blockquote>\n<p>I think '10%' would look much better than 'ten percent'</p>\n</blockquote>\n<p>Agreed.</p>\n<blockquote>\n<p>'now and in the years to come' could be shortened to 'hereafter'</p>\n</blockquote>\n<p>This seems a good change which clarifies the meaning.</p>\n", "parentCommentId": "zvXg5TTnYpmvCbYT9", "user": {"username": "Vincent_deB"}}, {"_id": "xTEeCevt4q6oNEohm", "postedAt": "2014-10-23T08:31:52.966Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>My suggestion is to keep GWWC poverty-focused and keep the same pledge, but have the GWWC website also direct interested parties to an '<strong>effective altruism pledge</strong>', with the informal understanding that making the GWWC pledge is tantamount to making the EA pledge, but not the other way around.</p>\n<p>[<strong><em>Edit</em></strong>: Or GWWC-pledge doesn't entail EA-pledge, because EA-pledge is cause-neutral and some GWWC pledgers may not be cause-neutral. Plus 'you secretly committed to this pledge too, surprise!' isn't the right approach. But if the GWWC-pledge is qualified to <em>permit</em> cause-neutrality, and the EA-pledge is qualified to permit <em>conditional/provisional</em> cause-specific pledges, the two can be compatible and everyone can be happy.]</p>\n<p>The EA pledge could be the 'gold standard' we use to tie the whole EA community together, without its necessarily being 'owned' by any one organization (though CEA is an obvious choice for hosting the thing). Riffing off the GWWC pledge, I'm thinking something like:</p>\n<blockquote>\n<p>&quot;I recognise that I can do a significant amount of good, by committing part of my income to those less fortunate — that I can live well enough on a smaller income — that the need is great.</p>\n</blockquote>\n<blockquote>\n<p>&quot;I recognise that I can help relieve the suffering and fulfill the promise of many lives, by allocating my gift wisely — to the worthiest causes — to the most credible interventions.</p>\n</blockquote>\n<blockquote>\n<p>&quot;I here pledge that for the rest of my life or until the day I retire, I shall give at least ten percent of what I earn to whichever initiatives can most effectively use it to improve the lives of others, now and in the years to come.</p>\n</blockquote>\n<blockquote>\n<p>&quot;I make this pledge freely, openly, and sincerely.&quot;</p>\n</blockquote>\n<p>If this is going to be our 'big-tent' pledge, and is going to bear the name 'effective altruism', it's important that it say a little more than GWWC does about, for example, epistemic rigor. The Church of Scientology might claim (perhaps even in good faith) to be an effective way to help people, but we have non-arbitrary grounds for excluding Scientology as a pledge-meeting organization if it fails the &quot;credibility&quot; test.</p>\n<p>If we went with a pledge like this, we could also have a page informally unpacking what we mean by parts of the pledge, to further guard against diluting EA. E.g., we can unpack &quot;<strong>worthiest causes</strong>&quot; as &quot;causes that purport to dramatically improve the welfare of those most in need&quot;, and unpack &quot;<strong>credible interventions</strong>&quot; as &quot;interventions whose efficacy has been argued for reasonably, explicitly, and on scientifically tenable grounds&quot;. The latter isn't meant to exclude promising new possibilities that are somewhat speculative; but it should exclude causes that have yet to be argued for, or whose only supporting arguments have been unambiguously refuted.</p>\n", "parentCommentId": null, "user": {"username": "RobBensinger"}}, {"_id": "zY8ZbF5zX5H6i8HCu", "postedAt": "2014-10-23T10:15:51.736Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I quite like the current slightly slow and ponderous language. It gives a feeling of seriousness to it, which I think is appropriate given how large the commitment is.</p>\n<p>There may well still be changes to the language I'd support, but I'm not sure without specific suggestions. I think &quot;ten percent&quot; is a bit better than &quot;10%&quot;, and &quot;now and in years to come&quot; is quite a lot better than &quot;hereafter&quot;.</p>\n", "parentCommentId": "zvXg5TTnYpmvCbYT9", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "SEmxfojuXkkQ9Koza", "postedAt": "2014-10-23T10:17:34.922Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Hi Arrowind, I'm sorry you feel we're trying to push things through! I did indeed ask the members in the member facebook group for feedback, and also people on the members mailing list. I've collated those responses, and they were around evenly split for and against. That was somewhat more positive than I would have expected, given as Jess said, that if people were against a change they would be more likely to put effort in to tell us. It was also interesting that various of the members were quite strongly in favour, not just accepting of the change. The responses did solidify in our minds that we should definitely keep the branding/vision/mission as it is now, and that we needed to approach the question of whether and how this would be done with a great deal of consideration and discussion.<br />I'd be very happy to chat more with you about it if you're interested - maybe via skype?</p>\n", "parentCommentId": "TrNqE8no3rH56eJe5", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "9jkrX6qR4iHcsqB6J", "postedAt": "2014-10-23T10:18:23.854Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>It's worth noting that many people do, and that this isn't obviously indefensible. So people can genuinely care more about existing people or existing creatures :-)</p>\n</blockquote>\n<p>Yeah, I don't mean that it's unheard of - but I do think this is a pretty rare view within the EA community.</p>\n", "parentCommentId": "nxxwCNFnCx56JTCps", "user": {"username": "Jess_Whittlestone"}}, {"_id": "YNpycbWZKg9EJjurd", "postedAt": "2014-10-23T10:22:42.577Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>That's actually quite an awkward ambiguity; whether or not the pledge receives the proposed revision it would be good to clear this up.</p>\n<p>Even just dropping the comma before &quot;now&quot; might work for that. Perhaps at that point replacing &quot;now&quot; with &quot;today&quot; would make it read better. But that's just a minimal change; it might be you can do better by rearranging it further.</p>\n", "parentCommentId": "FBzcFv7PBDjw7ccbw", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "abMLkqL7QzxuvXcAc", "postedAt": "2014-10-23T10:27:18.886Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>As Michelle pointed out in <a href=\"http://effective-altruism.com/ea/a0/should_giving_what_we_can_change_its_pledge/15k\">this comment</a>, that clause is supposed to refer to the people being helped, not your donations. But your reading is clearly common.</p>\n", "parentCommentId": "whkw6bCCeqwWBdC7B", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "qQri5CSuNJ2id777g", "postedAt": "2014-10-23T10:29:40.212Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Hey Tom! Yes, we've discussed a bunch how this relates to the donations registry, and considered whether the registry fulfils the purpose we're looking for already, or will in the future. On balance they seemed, as you say, to fulfil somewhat different purposes. It seems useful to have a place for EA profiles, which is flexible enough to allow people to challenge themselves to give whatever amount they'd like and tell others about that, as well as to make public what they've so far given. In particular, I imagine this being used by hard-core EA people to share information with each other. But it also seems sensible to have something which brings people together under one banner, in which everyone pledges to give at least 10% to the most effective causes, and are brought together into a community to do that. GWWC has also done quite a bit of work in learning how to create a cohesive community and encourage people to join, which might be quite time-consuming to replicate. I'd be very happy to discuss this more! Seems very valuable to coordinate these things thoroughly. I hear you're in my part of the world for a change? </p>\n", "parentCommentId": "3F3vLDc4hHtkfuxk7", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "4H46b2nGChoMDemsj", "postedAt": "2014-10-23T10:31:40.097Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>It really is. We spent quite a while trying to work out the best way of wording this, in particular trying to avoid weird philosophical jargon (problems of many of us being philosophers...), and this seemed the clearest. Sorry it's still not fully clear!</p>\n", "parentCommentId": "FBzcFv7PBDjw7ccbw", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "Fphh3tCt2tjEEuj7B", "postedAt": "2014-10-23T10:34:10.460Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I don't think this need stop you from taking the pledge. We think of it like making a promise to do something. It is perfectly reasonable to promise to do something (say to pick up a friend's children from school) even if there is a chance you will have to pull out (e.g. if you got sick). We don't usually think of small foreseeable chances of having to pull out as a reason not to make promises, so I wouldn't worry about that here. I think this is mentioned on our FAQ page -- if not, it should be.</p>\n<p>Another approach is to make sure you have enough health insurance (possibly supplementing your country's public insurance, though I don't think that is needed in the UK), and maybe getting income insurance too. It should be possible to have enough of both kind and still donate 10%. </p>\n", "parentCommentId": "6L8xAWEiWuB4eZvv6", "user": {"username": "Toby_Ord"}}, {"_id": "BxcABdgGSfhcZJWjq", "postedAt": "2014-10-23T10:39:13.800Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Note that you could certainly include contributions to R&amp;D for infectious diseases as part of the existing GWWC pledge. GWWC doesn't have any recommendations in that area, but we certainly see it as a plausibly very effective way of helping. The same is presumably true of your other examples. Anything J-PAL or IPA promote as effective is probably well worth looking into. I personally donate to both J-PAL and IPA themselves.</p>\n", "parentCommentId": "jjpfTuzgmoia4Deat", "user": {"username": "Toby_Ord"}}, {"_id": "J2BwSTJJ6RiPt6P3G", "postedAt": "2014-10-23T10:39:34.125Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Good point - you're right that I'm too loose with this terminology. At the moment, the vast majority of people we interact with are, as Michael says, in rich countries. But it would be best to be more inclusive in our language. Typically what I mean by donating globally rather than locally is donating without giving preference to organisations simply because they're local. If interpreted literally there's something weird about advising people giving to other countries rather than their own anyway, since SCI and AMF, for example, are based in London. \nI'll try to keep this in mind and be clearer in future!</p>\n", "parentCommentId": "wRBFMwkpMDkHFMgrM", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "rStoLTM4EvuLad556", "postedAt": "2014-10-23T10:39:59.792Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>My take on this is that it's okay to make a pledge in good faith if you intend to fulfil it and will make an effort to do so even if this becomes inconvenient.</p>\n<p>That doesn't mean committing yourself come what may. If we thought we had to carry through on our promises no matter what, nobody would make promises, and the world would be a sorrier place for that. Similarly people getting married usually intend in good faith to stay with the marriage for the rest of their life, and to make an effort to make that work, but I think the process works better by allowing the prospect of divorce.</p>\n<p>For reference, here's what the GWWC FAQ has to say on this:</p>\n<blockquote>\n<p>If someone decides that they can no longer keep the pledge (for instance due to serious unforeseen circumstances), then they can simply cease to be a member. They can of course rejoin later if they renew their commitment. Obviously taking the pledge is something to be considered seriously, but we understand if a member can no longer keep it.</p>\n</blockquote>\n", "parentCommentId": "6L8xAWEiWuB4eZvv6", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "GEp25x4wcxgCH5nfD", "postedAt": "2014-10-23T10:41:15.233Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I wouldn't see this as 'determination to push this through'. It is very much still in the information gathering stage.</p>\n", "parentCommentId": "TrNqE8no3rH56eJe5", "user": {"username": "Toby_Ord"}}, {"_id": "rhWNWwHsnjqkhReQn", "postedAt": "2014-10-23T11:43:37.868Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>OK that's reassuring to hear, I think my impression that this was going to happen regardless came from this being reposted here without much discussion of all these negatives. I certainly appreciate the effort to make sure that members are happy with this.</p>\n", "parentCommentId": "GEp25x4wcxgCH5nfD", "user": {"username": "arrowind"}}, {"_id": "RDfRiQ3gbEoMcRLKK", "postedAt": "2014-10-23T11:43:57.123Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>'Henceforth' is another possibility. Swaps bureaucratic for pompous, maybe.</p>\n", "parentCommentId": "zY8ZbF5zX5H6i8HCu", "user": {"username": "Arepo"}}, {"_id": "8nM2fezmqy29bPJ8R", "postedAt": "2014-10-23T11:46:35.280Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Very much agreed, that's why I was concerned to see this comment.</p>\n</blockquote>\n<p>FWIW, if that's the Joey I think it is, I don't think he meant to imply he agreed (IIRC he regards animal welfare causes most highly).</p>\n<p>There are also quite a few CEA staff who do support the more traditional stuff, last I heard, though they're probably a minority (but among the minority, unsurprisingly concentrated in GWWC).</p>\n", "parentCommentId": "QRPKYR7ufoLBn2hbM", "user": {"username": "Arepo"}}, {"_id": "eW8oqXSS3Pwmxoc58", "postedAt": "2014-10-23T11:50:03.742Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks for the reply. That's interesting that there was an even split, though an unrepresentative response is as you say an issue. That could cut either way though as as someone said in reply to Jess, members may feel uncomfortable disagreeing with a proposal. Unless you press a lot of members for answers, including ones who aren't very into the online community, it's hard to tell what they're comfortable with as a whole.</p>\n<p>I would feel somewhat better if the branding/vision/mission kept a focus on the case for giving some of our money to help those in extreme poverty. I may send an email about having a Skype, or at least an email exchange.</p>\n", "parentCommentId": "SEmxfojuXkkQ9Koza", "user": {"username": "arrowind"}}, {"_id": "xBFLzgsAyEe4CQYnb", "postedAt": "2014-10-23T11:54:28.046Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I don't think it is accurate to say that it includes 'many' MIRI donors. At least not compared to its total of 644 members. Note that MIRI was listed as the 42nd out of 43 listed charities in order of how much members have donated to them, which seems about as marginal as it could be. In addition, the list of charities that our members have donated to is not supposed to be any kind of endorsement of them by Giving What We Can. We allow members to donate their pledged amounts anywhere so long as it is a sincere interpretation of the pledge.</p>\n", "parentCommentId": "JGPXRc9JvoB5deRG5", "user": {"username": "Toby_Ord"}}, {"_id": "7wEuASJimPQc7XxCf", "postedAt": "2014-10-23T11:55:35.506Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>It's interesting that a number of people have said they would take the alternative pledge with the implication  they won't change their behaviour (ie they will take the enabled pledge if it reflects what they already do or plan to do). It seems to me then that including these members would  therefore be of limited value in terms of money moved., though it would allow them to feel included in the gwwc community. </p>\n<p>Weighing against this limited benefit is the risk of the amended pledge being less likely to attract new members for whom joining wild be a change of behaviour. As others have said, poverty is a cause well geared towards engaging people, and this has been vital for GWWC's growth. </p>\n<p>Additionally I'm worried that a watered down wording would risk a loss if focus and encourage people to take the pledge less seriously. In fact I am worried that good faith efforts to be inclusive in membership have already done so to some extent.  Today on the Facebook group I read one member openly saying he doesn't abide by the pledge and that he thinks that's no problem, he doesn't feel constrained by the 'literal text'. Others are arguing we should amend the pledge should become cause agnostic because some members have joined with the sincere belief that x-risk or movement building charities are the best way to help those in extreme poverty.  </p>\n", "parentCommentId": null, "user": {"username": "Bernadette_Young"}}, {"_id": "8Yn7ZPe2k4Yrv92T9", "postedAt": "2014-10-23T12:13:33.985Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>The healthcare thing was just an example (though, despite the FAQ on this topic that Owen brought up below, <em>I</em> would still feel dishonest withdrawing from a pledge for this reason).  It's the lock-in thing that I just don't feel comfortable with.</p>\n<p>I ramped up my donations after discovering GiveWell, and at the time it looked like it cost ~$500 to save a life.  Now they reckon it's roughly ten times that amount.  The overwhelming moral case for donating today feels around ten times weaker to me than it did in 2009.  If the cost per life saved(-equivalent) rises even further in the coming decade, I might decide that I'm only going to chip in a few percent of my income to MSF, say.</p>\n<p>Basically I feel more comfortable donating and being an example of someone who donates to cost-effective charities, rather than publicly pledging.</p>\n", "parentCommentId": "Fphh3tCt2tjEEuj7B", "user": {"username": "pappubahry"}}, {"_id": "kYHesikGmsZRLMHc6", "postedAt": "2014-10-23T12:21:41.795Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>there are plausible epistemic states that might lead to such a view - for example, skepticism about the reliability of reports about the impact of distant actions. This would not be a concern if GWWC was prepared to say &quot;and your donations have to be to charities we approve of.&quot;</p>\n</blockquote>\n<p>'Plausible epistemic states' in the sense of 'epistemic states someone could plausibly have' shouldn't be conflated with 'plausible epistemic states' in the sense of 'well-evidenced epistemic states'. The latter is what matters. If the evidence all suggests that GiveDirectly's reports are accurate, then it is the responsibility of pledge-takers to take that information into account in selecting their target charity.</p>\n<p>The pledge is normative about epistemic methodology; this is the third alternative we miss when we only consider the options 'anything goes' and 'the right charity is whatever GWWC says it is'. A certain minimum threshold of reasonableness is required to follow the GWWC pledge; otherwise absolutely any cause can fit the criterion. But that threshold isn't so high that everyone who follows it is sure to get the exact optimal answer; and it isn't fitted such that GWWC is defined as always being in the right.</p>\n<blockquote>\n<p>All the charities GWWC endorses as pledge-compliant must be exactly equally effective</p>\n</blockquote>\n<p>An option you don't consider is that &quot;I shall give at least ten percent of what I earn to whichever organisations can most effectively use it to help people [in developing countries]&quot; is consistent with 'We're too uncertain about which organization is most effective to give solid concise instructions on that front'. Taking the pledge means doing your best (or putting in a nontrivial effort) to figure out the best cause, and then giving to that cause; but as long as you end up with a non-ridiculous candidate, you've probably met that standard.</p>\n", "parentCommentId": "MCsDoJ9JJ3MLZMNhp", "user": {"username": "RobBensinger"}}, {"_id": "cLstWmczCJsLgCCJb", "postedAt": "2014-10-23T13:53:59.919Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I can see it's hard and I'm sure you put a lot of thought into it. I'd suggest making it as direct as possible - if &quot;people in developing countries, now and in the years to come&quot; means &quot;present and future people in developing countries&quot;, you could say that.</p>\n", "parentCommentId": "4H46b2nGChoMDemsj", "user": {"username": "Vincent_deB"}}, {"_id": "N5anzwLCTMxQRYn66", "postedAt": "2014-10-23T14:33:42.134Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks, it's useful to get perspectives from different angles! I definitely agree it seems really important to maintain the focus on poverty alleviation in terms of our mission and charity evaluation. I don't think that would be problematic. Almost all EA-interested people agree that helping those in developing countries is massively under-rated in the world at large and very important, even if they don't think it's the very best cause. So I don't anticipate pressure from people joining to change the focus of GWWC, even if it is a way to bring together EAs giving to a range of causes. </p>\n", "parentCommentId": "MPg5D8LdPqizF2XxH", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "bhoM94RuSNg42AFnF", "postedAt": "2014-10-23T14:51:05.918Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I agree that the intrinsic benefit of people joining who have said on here that it wouldn't change their behaviour would likely be minimal. You might think there would be community benefits (both for them and others), or commitment benefits. But the main reason I'm asking this question is the fact that if we want this to become the standard action people who hear about effective altruism take, and want people to feel they are working toward a common aim even if they differ on what they think the very most effective cause is, then it's important that most people currently affiiliated with effective altruism are members. \nPoverty does seem to be a good cause for engaging people, which is one of the reasons we'd continue with the vision, mission and overall focus we currently have. I think I would be somewhat surprised if people who wholly agreed with our charity recommendations etc were put off from signing the pledge because it wasn't narrow enough. That might be a difficult thing to measure though, so we'll probably try to do some testing of it, talking to people who don't know much about gwwc yet. \nYes, it would be really problematic if the pledge started being taken less seriously. We're trying hard to have more contact with our members than previously, and are currently in the process of following up with people as to whether they've been keeping up with the pledge. Hopefully having increased personal contact with members will help to keep people committed, and will allow us to discuss with people whether they really seem to be fulfilling the pledge. </p>\n", "parentCommentId": "7wEuASJimPQc7XxCf", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "9cJwNzFj2FuuMWd2i", "postedAt": "2014-10-23T14:57:29.526Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks for your feedback alw. If you haven't seen it yet, you might be interested in some research we did a while back on the effectiveness of different climate change interventions: <a href=\"https://www.givingwhatwecan.org/research/charities-area/climate-change\">https://www.givingwhatwecan.org/research/charities-area/climate-change</a></p>\n", "parentCommentId": "2Q2PmkpHxEJGHkbds", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "EkgczNtB7pSKEHbva", "postedAt": "2014-10-23T15:05:12.859Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks for taking the time to let me know your thoughts in detail, and it's useful to have a bit of your background for context. As you say, people focused on poverty sometimes seem to get a slightly short shrift in the online EA community (that's not at all my experience in person, at least in Oxford). The two books being released focus quite a bit on poverty rather than other causes though, so it's likely that the current atmosphere is temporary. It does seem important for us to keep our current focus, whether or not we change the pledge.  </p>\n", "parentCommentId": "zvXg5TTnYpmvCbYT9", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "CQhMmeoFRbjE5PdLs", "postedAt": "2014-10-23T15:07:08.498Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks Ervin, that's correct. Another option is to do 'Try Giving', which allows you to commit yourself to an amount you choose, and then work up to 10%. </p>\n", "parentCommentId": "G4yyGfjWvffFbTSd6", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "sYnQ7k4ePZdy53mZK", "postedAt": "2014-10-23T15:13:00.952Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Does that mean that the change in pledge would prompt you to join, Larks?</p>\n", "parentCommentId": "4YDRCDaxjKz5aqoBB", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "gAo2tz7TycsoXZb62", "postedAt": "2014-10-23T15:19:15.507Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I'm not convinced that statement is true, although most definitely think what the most effective cause is a really difficult question. </p>\n", "parentCommentId": "86i38oY4K2cEFbuYY", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "3v3LpPituWBSXpc2e", "postedAt": "2014-10-23T15:25:32.336Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>GWWC is definitely concerned to remain focused on poverty, and maintain its credibility as a community focused on donating to the causes which we believe help others the most, using evidence to find which causes those are. But so far we haven't had trouble with people associating it with specific charities a minority of members give to. \nWith regard to 80k, the main change was actually that they became way less controversial. ;)</p>\n", "parentCommentId": "JGPXRc9JvoB5deRG5", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "apehGbdi93PeCWCb8", "postedAt": "2014-10-23T15:29:32.519Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks Rob, these are very useful points. (Cross-posting my response from Facebook): With regard to your point about there being multiple pledges, we have been considering various options, including GWWC having multiple pledges, EAO running a pledge through the effective-altruism.com, having a pledge as part of the forum, and looking to the donation registry to fulfil this function. None of these seem nearly as promising to us. GWWC has built up quite a base of infrastructure, credibility and branding, which it would be time-consuming and difficult to replicate. (EAO is not interested in doing so, and the forum and registry don't seem terribly suited to doing so). I kind of agree with Jen that pledging is a little weird, so it would likely seem strange to have a series of different orgs with different pledges. This still leaves the option of GWWC having two - we already have the infrastructure and are seen as the 'pledging organisation'. However, we're very hesitant to have two separate pledges. When we've tried this in the past it hasn't worked at all well. </p>\n", "parentCommentId": "xTEeCevt4q6oNEohm", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "zAYYjKP2REnbRK8qA", "postedAt": "2014-10-23T15:37:35.473Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks for your clear replies.</p>\n", "parentCommentId": "LWqJNkE5fn2gQAqqG", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "i542ydCnqmSY4e7mu", "postedAt": "2014-10-23T15:38:43.977Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I just wanted to give people some background. Sorry about the long lag-time, which I imagine was mostly to blame for the weird impression. The reason is I've been on sabbatical to finish my PhD. </p>\n", "parentCommentId": "rhWNWwHsnjqkhReQn", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "wLygLABbiy6uXBJix", "postedAt": "2014-10-23T16:39:44.388Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Having an influx of people to the members groups who think that donating to poverty charities is many many times less good than giving to AI work or meta causes could create that sort of attitude, making the old members feel crowded out.</p>\n</blockquote>\n<p>You could just as easily say that x-riskers (or anyone else not explicitly covered by the pledge) <em>currently</em> feels crowded out. I personally feel excluded because the pledge does not extend its circle of caring to nonhuman animals, and others have expressed the same feeling.</p>\n<p>For that matter, a pledge that opens up to any cause with strong evidence of effectiveness still crowds out non-EAs.</p>\n", "parentCommentId": "QRPKYR7ufoLBn2hbM", "user": {"username": "MichaelDickens"}}, {"_id": "b8g3pLQKpm3STPyAs", "postedAt": "2014-10-23T17:33:34.705Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Currently I donate to poverty causes although last time we talked I think I was donating to AR. </p>\n", "parentCommentId": "8nM2fezmqy29bPJ8R", "user": {"username": "Joey"}}, {"_id": "sAhnX3n5NKPxYEJAo", "postedAt": "2014-10-23T17:45:48.122Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>&quot;Those committed to poverty, who - in other EA orgs - often seem to be looked on as incomplete or fledgling EAs,&quot;</p>\n<p>My experience matches Arepo's both online and in person. (I found it most prevalent in Oxford in fact).  Also I agree this is even more true when it comes to AR. </p>\n", "parentCommentId": "EkgczNtB7pSKEHbva", "user": {"username": "Joey"}}, {"_id": "cKj4P9YbnFnKXrHRv", "postedAt": "2014-10-23T20:02:15.952Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Hey, I'm glad to hear that, and would be happy to coordinate ways to make it clear that they're complementary, and to make them as complementary as possible (we could continue by email). I agree that having the 10% pledge serves a valuable purpose which is distinct from having a flexible donation registry, such as providing a clear benchmark and message, and also a good story for the media to pick up.</p>\n<p>I'd likewise guess that that the donation registry and EA Profiles will mainly get used by people who are 'hardcore' in the sense of already being somewhat into EA and sold on sharing their donations, as opposed to the average person who hasn't heard of EA but might get interested in pledging a share of their income to well-evidenced global poverty charities. (Re your post's question, this seems to me to be an advantage of GWWC keeping clear, relatively concrete messaging on poverty.) Though pulling against that is the fact that, as you say, the registry's flexible enough to allow people who are just starting to dip their toes into effective giving to challenge themselves to donate whatever amount they feel comfortable with.</p>\n", "parentCommentId": "qQri5CSuNJ2id777g", "user": {"username": "Tom_Ash"}}, {"_id": "hxwGJmpWGhzFkbqex", "postedAt": "2014-10-23T20:14:38.160Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p> &quot;Institute for Rich White Guys to write Harry Potter Fan Fiction&quot;</p>\n</blockquote>\n<p>I'd prefer if you were at least a little less rude - I think we generally manage a much higher level of civility here, do you mind editing this bit?  It's clear you don't feel altogether comfortable with it because you distance yourself from it in two ways, so maybe just speaking in your own words would be best. Thanks!</p>\n", "parentCommentId": "WgDM4DYipiY3aR2cM", "user": {"username": "ciphergoth"}}, {"_id": "FD4XLAp3CL897nLdJ", "postedAt": "2014-10-23T20:37:58.095Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I understand that change of pledge would broaden what people (old, young, those with no income currently and working folks) can do. However. current GWWC pledge is more specific. It specifies the percentage of donation, 10%, which is measurable and can be used as a benchmark. People with less income like students are welcomed to donate less than 10%, say 5%. </p>\n<p>Although the proposed pledge states the ultimate goal of ultraism, it lacks measurement as in how people make efforts, e.g. donating, volunteering? It is possible that some people take a vague pledge but do nothing because they could simply get satisfaction from taking a pledge and then think they indeed contribute (by just saying that &quot;I'm going to...&quot;) But effective altruism and GWWC are more about action and what we really can do and will do to improve our society. </p>\n", "parentCommentId": null, "user": {"username": "zengyiluyi"}}, {"_id": "4N9TCsPES8988yC4y", "postedAt": "2014-10-23T20:58:48.495Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>It might be possible for a coalition of donors, activists, philanthropists, and others concerned primarily about the far future and existential risk reduction to form their own advocacy organization, for which individuals make some sort of public commitment to use a portion of their living effort to help those who may or will live in the future. This may or may not include donations. One such already existing organization that might facilitate such a commitment is the Future of Life Institute.</p>\n", "parentCommentId": "MPg5D8LdPqizF2XxH", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "aH2Er52D5wTHsWwXe", "postedAt": "2014-10-23T21:27:36.694Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>One problem with this is that it's still not cause-agnostic. I'm only willing to sign a pledge if it's cause-agnostic, since in the future I may (and probably will) change my mind about which cause is most effective.</p>\n", "parentCommentId": "4N9TCsPES8988yC4y", "user": {"username": "MichaelDickens"}}, {"_id": "HPg7Pq2ijYkPY8RM4", "postedAt": "2014-10-23T21:49:36.633Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I'm strongly against changing the pledge, as well as the underlying motivation to more tightly incorporate GWWC with (cause-neutral) EA</p>\n<p>It seems part of the GWWC 'brand equity' is that basically all morally serious people agree that giving large amounts to help those in desperate poverty is a good thing to do (although some EAs would add that there might be something else that can do much better). All other causes EAs commonly endorse (i.e. animal welfare, x-risk) have much poorer common sense credentials.</p>\n<p>GWWC is a valuable intersection between Effective Altruism and the wider world. In one direction, GWWC packages some EA ideals (moral commitment, looking at evidence and data carefully, some moves towards cause agnosticism) in a manner that not-too-inferentially distant from most people, and a common route for people getting 'more EA'. Looking the other way, the wider appeal of global poverty over the currently-coalescing 'Tenets of Effective Altruism' can attract those not 'fully on board', and this group of more liminal 'EA' people can be an anchor against the EA community drifting further towards becoming an insular, epistemically overconfident and morally arrogant monoculture. </p>\n<p>Insofar as the changes to the pledge (and the ethos motivating them) pushes GWWC towards being an avowedly 'EA organisation'; insofar as their membership have less to do with commonsensically good things like 'stopping extreme poverty'; and insofar as it risks pushing away those inclined to ally with the 'EA movement', these changes threaten the goods GWWC brings to the EA movement. I also fear knock-on effects to GWWC itself and the millions of pounds it encourages and directs to good causes (is there a plan to survey the current members of GWWC about this change in the pledge?)</p>\n<p>I agree that the 'EA community' should have a cause-neutral way to make a morally serious declaration of commitment, and especially to convert what I hope to be wildly successful outreach efforts into concrete action to make the world better. One could do worse than modelling this community on GWWC, given how successful it has been. </p>\n<p>But I don't think GWWC can be this community whilst maintaining its focus on global poverty. I don't see how subtle changes to the wording of the pledge to make it in principle 'animal rights friendly' help when in practice GWWC's entire website is about global poverty and never mentions animal suffering once. Nor do I see how cause-agnosticism is squared with a tagline that exorts, &quot;Join us in the fight against global poverty&quot;. I worry about Giving What We Can's mission being incrementally hollowed out to make it a more welcoming home to EAs who think global poverty is a distraction from a far more important cause; or it being half-heartedly maintained as an atavistic facade by a cognoscenti who take it as received wisdom that fighting global poverty isn't really the most important thing GWWC does anymore. </p>\n<p>The other alternatives; of trying to construct a cause-neutral parallel to GWWC, preferably before the books launch, or a status quo devoid of a central hub new EAs can go to; are far from ideal either. Yet the former is not hopeless (c.f. Tom et al.'s work on a donation registry), and a community norm about giving could propagate without a centralized group (and perhaps we should fear a single EA group becoming too central to the movement). I'd prefer either to this.</p>\n", "parentCommentId": null, "user": {"username": "Gregory_Lewis"}}, {"_id": "e7ccBibEGduHra5hf", "postedAt": "2014-10-23T22:08:43.455Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>It's interesting that a number of people have said they would take the alternative pledge with the implication they won't change their behaviour (ie they will take the enabled pledge if it reflects what they already do or plan to do). </p>\n</blockquote>\n<p>A pledge is a commitment device. A person who is currently donating X to Xrisk might increase their chances of continuing to donate to Xrisk by taking the pledge. </p>\n<p>I don't see how that's not behavior change.</p>\n", "parentCommentId": "7wEuASJimPQc7XxCf", "user": {"username": "ChristianKleineidam"}}, {"_id": "oBX5edf7fDJ5shPxW", "postedAt": "2014-10-23T22:20:24.997Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>If you take the current GWWC pledge to literally require supporting interventions in developing countries, then that's not something that a cause-agnostic donor should be willing to agree to early in their life</p>\n</blockquote>\n<p>I guess that in this community we have people who think that they will live a long time. They might think of &quot;early in life&quot; as 200 years. </p>\n", "parentCommentId": "S9oLBNF2s3e4uKo4g", "user": {"username": "ChristianKleineidam"}}, {"_id": "gdnbhj6XRbLz33HxB", "postedAt": "2014-10-24T01:49:24.352Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Additionally I'm worried that a watered down wording would risk a loss if focus and encourage people to take the pledge less seriously. In fact I am worried that good faith efforts to be inclusive in membership have already done so to some extent. Today on the Facebook group I read one member openly saying he doesn't abide by the pledge and that he thinks that's no problem, he doesn't feel constrained by the 'literal text'. </p>\n</blockquote>\n<p>I agree that this is a massive concern. GWWC should place a high priority on maintaining the integrity of pledge. Breaking a solemn life-long pledge should have serious consequences - it should not be compatible with remaining a member of the community in good standing, especially if not caused by adverse personal circumstances.</p>\n<p>Perhaps this is difficult for utilitarians, who despite perhaps academically understanding the importance of game theory and rules, in practice often act like the stereotype of act utilitarians. </p>\n<p>I worry that switching the pledge signing from paper to online also undermines the weight of the decision. For most serious legal decisions, paper forms must be signed - the effort required to mail them back puts up a minor barrier to those lacking in resolve. And the physical act, distinct from electronic submission that we treat so casually, adds further weight to the pledge.</p>\n", "parentCommentId": "7wEuASJimPQc7XxCf", "user": {"username": "Larks"}}, {"_id": "L5u4JrJm7vbiQNEhx", "postedAt": "2014-10-24T01:52:22.005Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p> If we thought we had to carry through on our promises no matter what, nobody would make promises</p>\n</blockquote>\n<p>I don't think that's true. Historically many people have been willing to die for their oaths of fealty - despite knowledge of this possible outcome, they still took the oath, and frequently failed to run away even when they had the chance. In our less honour-bound contemporary society, this behaviour sounds alien and implausible, but it still happened. Given that GWWC is trying to impress the moral seriousness of the issue upon people, I think it is important to consider how previous groups have dealt with similar moral weights.</p>\n", "parentCommentId": "rStoLTM4EvuLad556", "user": {"username": "Larks"}}, {"_id": "hZ3i5cZMdHxQ9QqDn", "postedAt": "2014-10-24T01:56:07.114Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p> The overwhelming moral case for donating today feels around ten times weaker to me than it did in 2009.</p>\n</blockquote>\n<p>Yes, it seems that EAs have not really addressed this issue. Especially as GiveWell have said their estimates are still likely to be overly-optimistic. At this point the 'child in the pond' example fails to accurately describe the trade-off involved.</p>\n", "parentCommentId": "8Yn7ZPe2k4Yrv92T9", "user": {"username": "Larks"}}, {"_id": "uDafqB3q76pExRYTi", "postedAt": "2014-10-24T01:59:06.713Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>GWWC has built up quite a base of infrastructure, credibility and branding, which it would be time-consuming and difficult to replicate.</p>\n</blockquote>\n<p>GWWC has built up branding as an anti-poverty organisation. This is not an advantage when moving to more general causes, <em>it is a disadvantage</em>. Not only do you need to create brand equity all over again, you devalue your existing brand.</p>\n<p>Also, isn't most of the infrastructure just computer code? Surely GWWC would be willing to allow a more general EA organisation to copy that?</p>\n", "parentCommentId": "apehGbdi93PeCWCb8", "user": {"username": "Larks"}}, {"_id": "FngdRJgfhs2K7WKZ6", "postedAt": "2014-10-24T02:01:12.984Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Nope, sorry. </p>\n<p><em>edit:</em> but I think my personal requirements are sufficiently idiosyncratic that it's not worthwhile taking them into account.</p>\n", "parentCommentId": "sYnQ7k4ePZdy53mZK", "user": {"username": "Larks"}}, {"_id": "GSHh8DgHy269Y9Cy2", "postedAt": "2014-10-24T05:27:54.853Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>There are two aspects to having more impact: giving more effectively and giving more. The GWWC pledge says something about both, but I think it is only the latter that really needs the behavioral support that you get from something like a pledge. Once people have got the idea of giving effectively, I think it is unlikely that they will stop giving effectively <em>when they give</em>. It's a hard idea to unsee! But they might find it harder to keep giving as much.</p>\n<p>So I think the most important bit is the 10%, when it comes to actually affecting people's behavior.</p>\n<p>That said, there is a signaling and outreach benefit to mentioning global poverty: it makes us look more credible, and a lot of people come to effective altruism via global health and poverty. I think we could have a cause-natural pledge but still make it clear that poverty is focus of the organization:</p>\n<p>&quot;While GWWC believes that alleviating global poverty is the best way to hero the world today, we live in hope that poverty may one day be eliminated, maybe even within our lifetimes. Hence the pledge does not oblige you to give to global poverty charities, but rather to those that you believe will best help the world. Even if you disagree with us about what the best approach is at the moment, do consider taking the pledge anyway, as we would love to have anyone who is serious about effective giving in our community.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "68WG3TeDSTha8aStZ", "postedAt": "2014-10-24T06:14:44.763Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks for this - I hadn't seen those recent reports and read them with interest!</p>\n<p>For avoidance of doubt, in saying that my 'primary concerns' were ecosystem conservation and climate change, I wasn't expressing any a priori commitment to the view that interventions in these areas were the most cost-effective with respect to DALYs. Nor do I, or would I, donate only to charities that make interventions in these areas. However, those are the issues that primarily motivate my interest in EA, and I would not want to sign a pledge which did not apply to donations to these causes. Given my view of the uncertainties involved, and of the value of non-human life, I do expect to continue to give primarily to these causes.</p>\n", "parentCommentId": "9cJwNzFj2FuuMWd2i", "user": {"username": "alw"}}, {"_id": "5GpN6LwAnfRwwuRmJ", "postedAt": "2014-10-24T06:57:26.843Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Yes, it seems that EAs have not really addressed this issue. Especially as GiveWell have said their estimates are still likely to be overly-optimistic. At this point the 'child in the pond' example fails to accurately describe the trade-off involved.</p>\n</blockquote>\n<p>How come? If someone's given over 10% of their income for a few years, wouldn't we still expect them to have (in expectation) saved at least one life, or achieved something of similar magnitude? GiveWell's downgrades would only mean that they haven't saved as <em>many</em> lives.</p>\n", "parentCommentId": "hZ3i5cZMdHxQ9QqDn", "user": {"username": "Tom_Ash"}}, {"_id": "Juvj3TzKLXCFRwtZJ", "postedAt": "2014-10-24T07:29:06.072Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>Once people have got the idea of giving effectively, I think it is unlikely that they will stop giving effectively when they give. It's a hard idea to unsee!</p>\n</blockquote>\n<p>This is a good point! Though there are probably some pledge-takers who don't start off understanding the effectiveness thing; having the pledge mention it, and maybe link to some places to start reading up, is a good anti-illusion-of-transparency idea.</p>\n<blockquote>\n<p>While GWWC believes that alleviating global poverty is the best way to hero the world today</p>\n</blockquote>\n<p>I'm not sure everyone at GWWC believes that. I'm guessing this might be part of why GWWC wants a new pledge; their own object-level views are becoming more complicated, and they want their organization to reflect that complexity</p>\n<blockquote>\n<p>we live in hope that poverty may one day be eliminated, maybe even within our lifetimes</p>\n</blockquote>\n<p>I like this idea, but it doesn't seem like a standard EA line of thought. I agree we can eliminate poverty, but I wouldn't be surprised if some EAs doubt this, doubt the timeline, or think it's less helpful to focus on than more realistic best-case scenarios.</p>\n<p>I think your pledge sounds like it's carrying too much baggage. Just make the pledge(s) say what they say, and don't worry about filling them with qualifications or disclaimers.</p>\n", "parentCommentId": "GSHh8DgHy269Y9Cy2", "user": {"username": "RobBensinger"}}, {"_id": "odcSe7ZELDCft3vML", "postedAt": "2014-10-24T07:33:32.159Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>GWWC has also done quite a bit of work in learning how to create a cohesive community and encourage people to join, which might be quite time-consuming to replicate.</p>\n</blockquote>\n<p>I'm not sure how strong that rationale is. You could use the same reasoning to argue that GWWC should be the only organisation where people make commitments or donation plans, and that other pledging organisations like <a href=\"http://www.thelifeyoucansave.org/Take-the-Pledge\">The Life You Can Save</a> should be subsumed into it which does not seem plausible. What does GWWC's work on maintaining a cohesive community and encouraging people to join on the ground involve, and what are the reasons why this couldn't be done through another platform like the Donation Registry or something else cause-neutral?</p>\n", "parentCommentId": "qQri5CSuNJ2id777g", "user": {"username": "Vincent_deB"}}, {"_id": "PQyxFe5aeFfmR8Ryt", "postedAt": "2014-10-24T10:41:16.812Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks Gregory, that's a very helpful set of arguments.</p>\n", "parentCommentId": "HPg7Pq2ijYkPY8RM4", "user": {"username": "Toby_Ord"}}, {"_id": "GfDcu4W8npsEingX6", "postedAt": "2014-10-24T12:07:33.198Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>There is a not insignificant portion of rationalists who at least don't believe existing existential risk reduction research organizations are the best charities to donate to. I'm sure there are some who believe donating money to anti-poverty charities are the best option, but for all I know they could be rare among rationalists. I believe lots of rationalists aren't confident about which cause area is most worthy, but I don't know what portion of them donate anyway. I believe some people in this latter group split their donations, so I'd be interested to know if in their case they've taken the Giving What We Can pledge, and then donate additional money beyond that 10% to reducing global poverty to other types of charities.</p>\n", "parentCommentId": "Kfdia5dXvfimegX7P", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "j45rg6BFFT7zZ7Yh5", "postedAt": "2014-10-24T12:12:35.328Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Oh, well, just in addressing the above query, I meant that if existential risk reducers want a community commitment all their own, and Giving What We Can doesn't change its pledge, then there might be a way for the former group to get their own (of some sort). There are lots of them within effective altruism, so it might be worth their effort. I myself won't take any donation pledge unless it's cause-agnostic as well. However, those who are committed to a cause area, and don't intend to change their mind, have issues separate from us who want a cause-agnostic pledge.</p>\n", "parentCommentId": "aH2Er52D5wTHsWwXe", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "PgRkZjWszBkBdmH9n", "postedAt": "2014-10-24T12:16:31.199Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Technically, if the Pledge was changed, it could still be sent and returned via paper mail.</p>\n", "parentCommentId": "gdnbhj6XRbLz33HxB", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "ZkQfqFYJQyH388WT2", "postedAt": "2014-10-24T12:38:36.090Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>For me, this is an excellent revelation. I rescind the comment I made on Facebook that I wouldn't take the Pledge if it wasn't changed. In light of this knowledge, I'll consider taking the Pledge even if it isn't changed. In light of this, I am also updating in the direction that Giving What We Can shouldn't change its pledge, in order to protect its brand, to keep it independent from the (possibly misguided) tides of effective altruism in the future, and to respect the preferences of its members, as individuals and as a whole community, who joined under the impression that they took the Pledge based upon its original tenets.</p>\n", "parentCommentId": "MNQFhGsgPQvXSWM7i", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "WyrNzNfS5CCmRBBen", "postedAt": "2014-10-24T12:52:57.343Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Joey, Tom Ash and Michelle Hutchinson, among others, discussed the Effective Altruism Hub in another comment thread here. I interpreted their conclusion being that the Giving What We can pledge, in any form, as having more gravitas, i.e., feeling of moral weight and legitimacy, to it, than the Effective Altruism Hub. This seems to be because Giving What We Can is a community that is organized, and whose members keep each other to the pledge, while anyone can make a generic pledge on the Effective Altruism Hub that won't be enforced.</p>\n<p>It seems Giving What We Can wants that gravitas for the broader effective altruism community, perhaps working in tandem with Effective Altruism Outreach. Note that I don't mean this to imply that Giving What We Can <em>should</em> change their pledge. I merely mean to inform you why Giving What We can <em>might</em> perceive need to change its pledge regardless of the Effective Altruism Hub.</p>\n", "parentCommentId": "mhceghWjCB3zyy5qR", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "RNJtwHDNzr4ibPHaH", "postedAt": "2014-10-24T13:00:04.296Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>It is a pretty common belief</p>\n</blockquote>\n<p>I'm aware this is the impression you formed while living in Oxford. However, would you mind qualifying this statement a bit more? I'm curious. I mean, you don't need to name names, but do you only mean some closer to the core of the Centre for Effective Altruism, or do you just mean everyone concerned about more speculative causes?</p>\n<p>Of course, this is a request, not a demand. Feel free to not answer my question at all, as i would understand if you don't want to.</p>\n", "parentCommentId": "QgtDmy35979T2C78r", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "bLWHkNqDpeJn7Guap", "postedAt": "2014-10-24T13:09:37.633Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I consider existing online communities, and official organizations aligned with effective altruism, sufficient to host such debates (between existential risk reduction, poverty reduction, and/or other popular cause areas). If they aren't doing so already, I believe an investment of effort would make them so. Thus, I don't that as an argument in favor of Giving What We Can changing its pledge.</p>\n", "parentCommentId": "QBgrtv3zfFuMXr8Hn", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "tH9yKS4QWTiBvqzty", "postedAt": "2014-10-24T14:59:42.203Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thank you Michelle for posting this, and to the Giving What We Can staff for being willing to revise their beliefs in such an open and thoughtful manner.</p>\n<p>I support the change – My girlfriend and I are starting an EA Meetup group. We were originally going to make this a GWWC chapter but decided against that once we learned that GWWC isn't cause-neutral. So that's one behavior change which would clearly come out of the name change.</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "FwXkfFMxZk9wEpEK4", "postedAt": "2014-10-24T22:42:36.925Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I agree that</p>\n<ul>\n<li>Paper vs Electronic </li>\n</ul>\n<p>is orthogonal to </p>\n<ul>\n<li><p>Old pledge vs Proposed pledge</p>\n</li>\n<li><p>I mentioned it as another example of a way that the pledge seemed to have lost gravitas.</p>\n</li>\n</ul>\n", "parentCommentId": "PgRkZjWszBkBdmH9n", "user": {"username": "Larks"}}, {"_id": "3P36YbcbSNmXGTF8Y", "postedAt": "2014-10-24T22:43:22.652Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>There's a big difference between many lives and only one life!</p>\n", "parentCommentId": "5GpN6LwAnfRwwuRmJ", "user": {"username": "Larks"}}, {"_id": "LbdvQrAM4gQ56ChEq", "postedAt": "2014-10-25T06:37:05.594Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I would prefer see &quot;I recognise that I can use part of my income to do a significant amount of good in the developing world&quot; remain in the pledge. On similar grounds, I do not really like the language &quot;beyond poverty.&quot;</p>\n<p>Many commenters have focused on the effects of a change on GWWC's branding and its ability to attract additional members. These may be important effects. But depending on how seriously you take the pledge and on how narrowly you read it, the direct effect may also be quite important. Namely, the a narrow reading of the current pledge entails a substantial commitment to a particular cause, which does not seem compatible with a cause agnostic outlook and a reasonable degree of epistemic humility--especially not for donors early in life (including much of GWWC's current audience). Though GWWC need not and probably should not broaden its scope to be a general EA organization, I do think that being in direct tension with effectiveness would be bad.</p>\n<p>Relatedly, many future-focused EA's have signed the pledge on the basis of views such as:</p>\n<blockquote>\n<p>The change is not likely to make a difference to people who think that the best way to help others is to ensure that the future will go well, since the pledge already explicitly includes people who will live in the future, as well as those alive now. </p>\n</blockquote>\n<p>I think this is a plausible view in some cases, but in others it is a stretch. For example, I think <a href=\"http://effective-altruism.com/ea/9f/on_progress_and_prosperity/\">it is plausible</a> that our altruistic priorities may be quite different if we consider the very long-term, rather than restricting our attention to the coming centuries. One could debate whether such effects can be classified as &quot;helping people in developing countries,&quot; but (1) I suspect that for most precise definitions of developing countries, they couldn't, (2) in any case, a casual listener would be very unlikly interpret the phrase this way. I would not want to be in the position of defending this interpretation in a discussion of my own giving, and I think that many people would view it as an intentional misrepresentation.</p>\n<p>That said, I would probably not sign a modified version of the pledge either.  Though I currently give substantially more than 10% of my income away, I am not confident that donation will remain the most effective way to do good (I understand that in principle investment in profitable enterprises or in my own human capital could be carried out in a way consistent with a sufficiently broad reading of the pledge, but I would be even more uncomfortable with this than with donating to non-development causes). I suspect that (a modest probability) * (10% of my income) is more important than the possible positive effects. Hopefully my view can be informative, but I don't think it should be given much weight as such.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "sLzEdDJAXEJRLdSfb", "postedAt": "2014-10-25T07:48:03.624Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>True, but I meant that to me saving even one life seems clearly worth giving up 10% of my income for.</p>\n", "parentCommentId": "3P36YbcbSNmXGTF8Y", "user": {"username": "Tom_Ash"}}, {"_id": "oe99wNhDxxk89qhMe", "postedAt": "2014-10-25T11:47:39.851Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>The other alternatives; of trying to construct a cause-neutral parallel to GWWC, preferably before the books launch, or a status quo devoid of a central hub new EAs can go to; are far from ideal either. Yet the former is not hopeless (c.f. Tom et al.'s work on a donation registry), and a community norm about giving could propagate without a centralized group (and perhaps we should fear a single EA group becoming too central to the movement). I'd prefer either to this.</p>\n</blockquote>\n<p>I agree, and the EA donation registry looks like a fine place for people to declare cause-neutral pledges already if they'd like to. If we thought having something with a predefined pledge (eg of 10%) was better, then it wouldn't be too hard to create a way for people to sign up for that - for example, creating a Google Form which people could complete would get you a decent way there. It doesn't seem to require a centralised group to manage this.</p>\n", "parentCommentId": "HPg7Pq2ijYkPY8RM4", "user": {"username": "Nekoinentr"}}, {"_id": "BNLEetX7gsRbyreiw", "postedAt": "2014-10-25T11:49:47.950Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I would echo this - I presume the concern is that if many people not committed to effective giving joined Giving What We Can this would dilute the community, but I don't think this is likely in this case.</p>\n", "parentCommentId": "xrJkEsLjJ5fQ5dK8J", "user": {"username": "Nekoinentr"}}, {"_id": "F3t779NwfXCaGqM43", "postedAt": "2014-10-25T13:19:08.029Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Thanks very much for taking the time to explain your thoughts! \nWith regard to member consultation, we’ve done some of that via the members Facebook group and two mailing lists. We’ll likely reach out to members we know well and haven’t heard from yet. Then I was planning to write up a new doc of the considerations people had, and our revised thoughts. \nI definitely agree with your assessment of fighting extreme poverty being something basically all morally serious people care about, and that allowing GWWC to be seen as a credible, reasonable organisation. I don’t think that would be harmed by our saying that it is possible that there are other really effective causes out there though. I think the best way to conceptualise this is as follows: GWWC is trying to convince people that effectiveness in helping others is really important; that fighting poverty is amazingly effective; that we in developed countries are super lucky and should do more to help; that we should make a commitment to give and to give as effectively as we can. I’m not convinced that it detracts from that message that it does not specify that the commitment must be to, and only to, fighting extreme poverty, even though that is what we as an organisation are focused on. \nI don’t think it’s wholly fair to characterise this change as one which means that GWWC’s mission would only be half-heartedly maintained. We care deeply about eradicating extreme poverty, and will continue to do so. Having some members who think that there may be even more effective ways to help those in developing countries than fighting current poverty (whether that be by donating to Cool Earth or FHI) in any way detracted from our focus on global poverty. Nor do I think it’s fair to characterise our members who do think that as not caring deeply about extreme poverty. I believe they still think that eradicating extreme poverty through treating NTDs and malaria is hugely important, very effective, and something which we should be spreading awareness. I would expect any members who joined under the new pledge and were donating to causes other than current poverty eradication to feel the same way. Therefore, I don’t think their joining would take away from our continuing to focus on eradicating extreme poverty, and assessing charities with that purpose.</p>\n", "parentCommentId": "HPg7Pq2ijYkPY8RM4", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "YmmJ7vHbYdsF9mZJs", "postedAt": "2014-10-25T14:07:14.488Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I agree that's a good point about it being the amount of donations that really needs the commitment device. Thanks, Michael, for that suggested paragraph. I think that's just the right kind of sentiment. </p>\n<blockquote>\n<p>I'm guessing this might be part of why GWWC wants a new pledge; their own object-level views are becoming more complicated, and they want their organization to reflect that complexity</p>\n</blockquote>\n<p>This is not the case. It is true that some people in GWWC think that there are other ways to help the world which are even more effective than donating SCI or AMF, and others who think that it is difficult to know what the most effective way to help others is. This doesn't seem to be more the case than it was when GWWC started though, and it's certainly not the reason for the suggested pledge change. That's why I don't think we need to worry about the focus on poverty shifting.</p>\n", "parentCommentId": "Juvj3TzKLXCFRwtZJ", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "fK5RF52oDAiyKj63p", "postedAt": "2014-10-25T14:43:22.610Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I'm sorry Paul, I don't think I quite follow your reasoning, so my response may not be wholly on point. But to explain why the suggested wording takes out that part, the reason is that although we would expect everyone signing the pledge to agree with the statement &quot;I recognise that I can use part of my income to do a significant amount of good in the developing world&quot;, it might be seen as duplicitous to have that in a cause neutral pledge. (I'm not convinced that's the case, but I'm open to it.) The 'beyond poverty' wording is just a possible suggestion, I'd love to hear alternatives you think would be better. I assume your reason for disliking it is that it gives a flavour 'going further than' when what we really wanted was something like 'other possible candidates for the most effective thing' or something. This is something we'd put a bunch of thought into if we decided to change the pledge.\nI'd be very grateful to hear any other comments you have on this. (I've been referring back to the email you sent over the summer, which has been useful, so don't feel you need to replicate the material in that, but if you have other thoughts I'd love to hear them.)</p>\n", "parentCommentId": "LbdvQrAM4gQ56ChEq", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "HdqWR7fmHeZvdFwgM", "postedAt": "2014-10-25T14:46:51.862Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I'm not quite sure I understand you. The new pledge wording still stipulates people donating 10% of their income. It says: &quot;I pledge that for the rest of my life or until the day I retire, I shall give at least ten percent of what I earn to whichever organisations can most effectively use&quot;. We'll be following up with people to make sure they do that, as we do now. So I think it's equally action focused as the current pledge?</p>\n", "parentCommentId": "FD4XLAp3CL897nLdJ", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "gjktpWvJ7KmNKjH2e", "postedAt": "2014-10-25T15:01:42.139Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I'm not convinced this would be a disadvantage, since what we would branding as, as we do now, is an organisation which strongly encourages people to donate 10% of their income to the most effective organisations, and which highlights how amazingly effective certain global poverty eradication charities are. </p>\n<p>Of course, we would be very happy to share the computer code. We've had a lot of discussion, in particular, with EAO about how it would work if they did this. But in practice it does not seem to be just a case of sharing computer code. Aside from the technical work involved in implementing the system separately again, there is the fact that building up a pledge which is appealing to take is not just a case of having the right computer code. Having a dedicated community person who reaches out to people individually and helps them along the path to joining seems to have made a big difference. It is hard to know how much difference having a credible community of people who have already taken the pledge and have stuck with it, having a feeling of a concrete community you're joining, and an identity (of credible research into the most effective ways to help others) makes a difference. But qualitatively asking members why they have joined, what they like about being a member and why they might advise others to join these factors come up a bunch.</p>\n", "parentCommentId": "uDafqB3q76pExRYTi", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "MqoZQbzmwveBwpaHk", "postedAt": "2014-10-25T15:06:48.438Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>You might consider italicizing the word &quot;most&quot; in the phrase &quot;whichever organisations can most effectively use it&quot;. This might guard somewhat against ineffective or complacent giving.</p>\n", "parentCommentId": null, "user": {"username": "jayquigley"}}, {"_id": "vCFi6niGTeDyx44JN", "postedAt": "2014-10-25T15:11:07.960Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Good thinking, thanks Jay. I think I'd be a little hesitant to do that, because it seems rather aggressive. That would be a good thing to test though (we're working with a group of student consultants, who will hopefully be able to get us some data on questions like this).</p>\n", "parentCommentId": "MqoZQbzmwveBwpaHk", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "udRgfkMNh7a3coZGD", "postedAt": "2014-10-25T15:53:58.866Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Michelle, my great respect for work you and your organization are doing. </p>\n<p>I am not a native English speaker, and it will take me long time to get 10 karmas, unless members of this forum accelerate me.</p>\n<p>I am  not a member of  GWWC.  Not Yet. I even did not know  3 weeks ago that  EA-minded organizations exist. My  remarks to you this post are as follows:</p>\n<ol>\n<li><p>“to improve the lives of others” sounds better to me  than ” to help people in developing countries”.</p>\n</li>\n<li><p>“Pledge” sounds heavy loaded of many meanings, confusing  people and potential donors. \n<a href=\"http://www.merriam-webster.com/dictionary/pledge\">http://www.merriam-webster.com/dictionary/pledge</a> Words  like anticipate, intend, expect coordinates with more people.</p>\n</li>\n<li><p>By locking people into giving 10% or more of what they earn, you lock out people who may be willing to give less than 10%; and do not include people who may want to donate wealth they have not earned but inherited.</p>\n</li>\n<li><p>Phrase “I make this pledge freely, openly, and sincerely.” is a kind of artificial or antiquated or redundant.  People volunteer to donate, so there is no point to impose pledges, unless you wish to have an elitist club, which has merits. </p>\n</li>\n</ol>\n<p>A version of improved text becomes more democratic, readable, and friendlier.</p>\n<p>“I recognize that I can use part of my income to do a significant amount of good. Since I can live well enough on a smaller income, I anticipate that for the rest of my life or until the day I retire, I shall give percentage of what I earn, or whatever I can, to whichever organizations can most effectively use it to improve the lives of others, now and in the years to come.”</p>\n", "parentCommentId": null, "user": {"username": "Ilya"}}, {"_id": "exjaPnnybeQEp2dfu", "postedAt": "2014-10-25T16:02:14.332Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>some people in GWWC think that there are other ways to help the world which are even more effective than donating SCI or AMF</p>\n</blockquote>\n<p>So you agree that when Michael said</p>\n<blockquote>\n<p>While GWWC believes that alleviating global poverty is the best way to hero the world today</p>\n</blockquote>\n<p>he was mistaken? Or is there a sort of 'GWWC official view' that not all people in GWWC believe? The latter is quite plausible, similar to <a href=\"https://en.wikipedia.org/wiki/Cabinet_collective_responsibility\">Cabinet Collective Responsibility?</a>, or the way that couples tend instinctively back each other up in public, even to the extent of glossing over their private differences.</p>\n", "parentCommentId": "YmmJ7vHbYdsF9mZJs", "user": {"username": "Dale"}}, {"_id": "QaaMZt9izkmmAcXFu", "postedAt": "2014-10-25T16:07:35.830Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<blockquote>\n<p>If the evidence all suggests that GiveDirectly's reports are accurate, then it is the responsibility of pledge-takers to take that information into account in selecting their target charity.</p>\n</blockquote>\n<p>Right. Given the <a href=\"http://www.gwern.net/docs/1987-rossi\">strong mean reversion</a> shown in intervention effectiveness I think it is not totally unreasonable to doubt that evidence. Personally I think GiveDirectly is credible but I don't think this is the only epistemically justifiable position to take.</p>\n<blockquote>\n<p>Taking the pledge means doing your best (or putting in a nontrivial effort) to figure out the best cause, and then giving to that cause; but as long as you end up with a non-ridiculous candidate, you've probably met that standard.</p>\n</blockquote>\n<p>But the pledge isn't merely to attempt to do so - it is to actually do it!</p>\n", "parentCommentId": "kYHesikGmsZRLMHc6", "user": {"username": "Dale"}}, {"_id": "hQaD3rrCYHui6uA9F", "postedAt": "2014-10-25T16:10:02.002Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Yes - I think it is disingenuous not to acknowledge this.</p>\n", "parentCommentId": "QgtDmy35979T2C78r", "user": {"username": "Dale"}}, {"_id": "GmYBGSz283u7cfgyt", "postedAt": "2014-10-25T17:52:34.588Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>GWWC is a somewhat large community of people, and I don't speak on behalf of all of them. The important thing is that they are a community of people who are all committed to giving 10% of their income to the most effective organisations, and who acknowledge that those of us in the developed world are really lucky and are able to have an amazing impact on those in the developing world. Not every single member thinks that the best way to &quot;hero the world today&quot; is to donate to charities which alleviate the poverty of people currently living. My <em>guess</em> would be that the majority think that, and that a largish minority aren't sure what the very best way to help others is. </p>\n", "parentCommentId": "exjaPnnybeQEp2dfu", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "kHw4y68eHyZQmuzCF", "postedAt": "2014-10-25T18:00:40.230Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Whoever 'disliked' this post, I'd be interested to hear why. If it's because I've misunderstood Paul's point, apologies!</p>\n", "parentCommentId": "fK5RF52oDAiyKj63p", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "nqotdpqHEyKEhtcun", "postedAt": "2014-10-25T18:36:34.302Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I think people who believe this _do_ typically acknowledge it: from my understanding they generally think that effectiveness can be tough to get one's head around, that x-risk and meta interventions can seem weird, and that the most intelligible way to present the concept is to give concrete examples of the kinds of interventions people are already familiar with. This reasoning seems pretty plausible to me. This is similar to the fact that GWWC often starts by giving the example of different ways to treat HIV in order to illustrate cost-effectiveness: it's not that we don't think cost-effectiveness should be applied across different diseases, and indeed across different ways of alleviating poverty. Rather it's that showing the difference in effectiveness between treating Karposi's Sarcoma and condom distribution is a particularly clear way to show the importance of cost-effectiveness when it comes to helping people.</p>\n", "parentCommentId": "hQaD3rrCYHui6uA9F", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "2Joe4tc59ovJs83FN", "postedAt": "2014-10-26T01:45:00.919Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I plan EA meetups and attended the EA summit and give about 20% of my income. I haven't taken the pledge, but was thinking about it, and my guess is I will take it anyway. I would be more likely to take it and take it faster if you made the change.</p>\n<p>I wonder if you've had a a poet look at the pledge. It would be nice if it also sounded poetic. For example, you might replace  &quot;a significant amount of good&quot; with &quot;much good&quot;, and I'm sure with more wordsmithing, you could develop real beauty.</p>\n", "parentCommentId": null, "user": {"username": "John_Salvatier"}}, {"_id": "ujyJb47ZttgWy9Qfn", "postedAt": "2014-10-27T01:50:52.139Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I think your description omits a key factor. GWWC's brand is not just</p>\n<blockquote>\n<p>an organisation which strongly encourages people to donate 10% of their income to the most effective organisations</p>\n</blockquote>\n<p>but </p>\n<blockquote>\n<p>an organisation which strongly encourages people to donate 10% of their income to the most effective <strong>anti-poverty</strong> organisations</p>\n</blockquote>\n<p>Global poverty is all over the website, it's the core of GWWC's presentations, it's explicitly mentioned in the pledge. I think any neutral outsider, having spent 10 minutes on the website, would say that GWWC was an anti-poverty (and disease, etc.) organization - and be very surprised to hear that it was also anti-robot, and anti-bacon! </p>\n<p>Nor do the other factors you mention sound very convincing. The other EA organizations could hire someone to do outreach - they could even share the same person. And the 'existing community' argument is a misnomer. Firstly, there already is an existing community - I'm sure we could easily whip up a bunch of EAs to sign the new pledge. But you cannot say that the existing GWWC community could play such a role, as it is <em>not</em> a group of people who have taken the proposed pledge - it is a community of people who took the old pledge, which is quite different, many of whom seem quite unhappy about the change!</p>\n", "parentCommentId": "gjktpWvJ7KmNKjH2e", "user": {"username": "Larks"}}, {"_id": "2HR8kXrq2AQ8JXAhN", "postedAt": "2014-10-30T01:50:31.265Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I support the change. I mean, I <em>would</em>, as someone who's taken advantage of the ambiguity in the current pledge to donate to x-risk-related causes, but I think even independent of that I support the change.</p>\n<p>The GWWC pledge is a good institution. It provides a unified community norm of &quot;at least ten percent&quot; and helps keep people honest. It's a piece of &quot;social technology&quot; that makes effective altruism easier.</p>\n<p>As such, if GWWC restricted it to the developing world, I would expect and encourage the animal rights movement and the x-risk movement to get their own similar pledges so that they could benefit from the same social technology.</p>\n<p>But at that point, we would probably all wish there was just one pledge. Having multiple ones is unwieldy, unnecessarily fractures the movement, and creates new transaction costs - someone who took the animal rights pledge can't shift their giving to the developing world (or vice versa) in response to new information without unpledging and repledging. </p>\n<p>So while acknowledging that GWWC is an organization primarily donated to the developing world, I think that mission could be consistent with it providing the pledge as a service to the broader effective altruism community, especially since its privileged position as host of the pledge gives it extra credibility and standing in the movement, which helps their own cause in the end. I think this would be in keeping with the behavior of other EA organizations who both push their own causes and try to help the movement as a whole with whatever their comparative advantage is.</p>\n", "parentCommentId": null, "user": {"username": "Scott Alexander"}}, {"_id": "EhEZqRTsb3nkLWG7S", "postedAt": "2014-11-11T23:57:55.438Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>In practice all of these figures seriously underestimate the full impact because they don't consider flow-through effects such as:</p>\n<ul>\n<li>the people whose lives are saved will have more children themselves, perhaps resulting in hundreds of extra lives over the very long term (I know of people who have 100+ great grandchildren)</li>\n<li>people for centuries or millennia into the future will be richer because the country developed economically sooner as a result of having healthier, better educated, and more productive people now (this is a version of 'astronomical waste').</li>\n</ul>\n<p>If the direct impact is lower, the flow-through effects will also be lower, but '$3,000 per life saved' is still very misleading as an indication of the absolute cost-effectiveness.</p>\n", "parentCommentId": "3P36YbcbSNmXGTF8Y", "user": {"username": "Robert_Wiblin"}}, {"_id": "PAe6kdhHYQjNugGoZ", "postedAt": "2014-11-12T01:11:51.605Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>I am already a member, but I am in favour of changing the pledge because I see 'cause neutrality' as one of the most valuable and distinctive components of effective altruism.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "iMSAcSkiMEmambx7d", "postedAt": "2015-12-12T18:52:25.684Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>&quot;Perhaps this is difficult for utilitarians, who despite perhaps academically understanding the importance of game theory and rules, in practice often act like the stereotype of act utilitarians.&quot;</p>\n<p>I'm curious what you think the &quot;stereotype of act utilitarians&quot; is, unless it's &quot;hypocrite.&quot; I literally know exactly zero people who &quot;in practice often act&quot; in a manner that is most conducive to the greater good in the short term (you can probably argue about burnout and self-care, complicated game theory and signaling, etc...but then you're closer <em>in practice</em> to rule or Two-Level/Hare's utilitarianism, certainly not the stereotype of act utilitarians!) Some trivially obvious examples: </p>\n<p>-People generally think nothing of taking the bus to work instead of walking/biking, even when the time cost is about the same, or if their time outside work isn't going to be used productively anyway.</p>\n<p>-On the flip side, bikers often refuse rides, even if it'll save them time and the added costs to their friends are either a)nonexistent or b)irrelevant from the perspective of the universe (since their friends either don't donate effectively or have a separate donation budget that won't be affected)</p>\n<p>-Most people, even claimed &quot;act utilitarians&quot;, happen to have two kidneys.</p>\n<p>-People's dietary choices seem mostly to be about personal comfort, rather than careful calculations about cost vs. time savings. </p>\n<p>-People don't &quot;marry-to-give&quot; (This is probably a good thing!) </p>\n<p>-EAs spend substantially less time on strategic cause selection than a naive calculation of the value of information would suggest\n-etc, etc </p>\n<p>Speaking as someone who has two kidneys, etc, I think it's fine that people, even people who in principle agree with act utilitarianism, in practice act like Two-Level or rule utilitarians or virtue ethicists, etc., and in the long run probably optimal (burnout and signaling are very important considerations!) I'm just suggesting that you're attacking a caricature that's <em>entirely</em> nonexistent. </p>\n", "parentCommentId": "gdnbhj6XRbLz33HxB", "user": {"username": "SophiesWorld"}}, {"_id": "BB8ZCrahwcSCzMthW", "postedAt": "2015-12-12T21:36:36.991Z", "postId": "9Xp7BGoKnbSiP3Ng8", "htmlBody": "<p>Hi, so actually there are a few of us act utilitarians out there. I also don't see any reason to believe that there is a substantial difference between maximizing short term consequences and maximizing long term consequences. That's an odd distinction, since contributing to certain causes e.g. x-risk is as long-term as anything. It entirely begs the question to think that act utilitarianism vs rule utilitarianism is some kind of tradeoff between short and long term consequences.</p>\n<blockquote>\n<p>(burnout and signaling are very important considerations!) </p>\n</blockquote>\n<p>Who got all the positive media coverage a few months ago? Julia Wise and Jeff Kaufman! And they were acting like pretty standard act utilitarians. I'm also yet to find substantial examples of burnout in my own life nor from anyone else.</p>\n<p>Now the user above you claimed that act utilitarians &quot;despite perhaps academically understanding the importance of game theory and rules, in practice often act like the stereotype of act utilitarians,&quot; and although I can't say he's necessarily wrong, I can't be sure because I'd have to know more about what he means by &quot;stereotypical&quot;. Hopefully he has some examples of this behavior, although usually when people make claims about stereotypical-counterproductive-act-utilitarians it turns out that they don't have any sort of good evidence or examples of utilitarians actually acting like that.</p>\n<p>Anyway, I'd be perfectly happy to put more enforcement/formality behind the GWWC pledge. It sounds like a great idea to me, so I have an even harder time understanding what sort of motivation might underlie Larks' snark.</p>\n", "parentCommentId": "iMSAcSkiMEmambx7d", "user": {"username": "kbog"}}]