[{"_id": "TBLoEzbzxyBjr9GFS", "postedAt": "2022-12-19T17:30:33.610Z", "postId": "9YfKBHjFpkwkyNT6w", "htmlBody": "<p>Hi Vaidehi,</p><p>Some thoughts, as someone who has founded a climate protest movement<a href=\"https://www.aljazeera.com/news/2020/4/10/climate-change-activists-test-strict-singapore-protest-laws\"> (a Singapore branch of Fridays For Future)</a>, and also read a lot of research on social movements to inform my decision making, and also somewhat acquainted with community organising in EA:</p><ol><li><strong>The first difference I’ve seen between EA organising and climate organising is the initial barrier to new member participation. </strong>You’ve cited Extinction Rebellion as an example of member-led participation. From beginning to end, the main thing a Rebel needs to do as an active, contributing member is to show up to civil disobedience actions. While this requires personal risk and planning, it’s significantly more straightforward and well-defined than what Core EA members would usually go through. Even&nbsp;<i>“beginner”</i> EAs have to read incredibly lengthy introductions to EA. Of course, one could correctly point out that EA has significantly higher standards for epistemic rigour and sustained long-term contribution. As you note in your earlier posts in the sequence, more steps requiring more guidance/support/ feedback/expertise, drifts towards more centralisation.</li><li><strong>The second difference is different demands for core members.</strong> One thing that fascinates me ever since I&nbsp;<i>“transitioned”</i> from climate movement to EA movement is how, justice sensitivity and expansive altruism aside, the two select for completely different traits. EA essentially wants highly-engaged members to do one of two things: contribute by working in EA long-term (research, operations etc.), or donating, which also skews long-term. These behaviours generally fit into a “<i>normal</i>” leadership hierarchy. Climate/social cause movements, meanwhile, are generally dealing with well-defined and contentious issues, where the theory of change relies on public shows of mass support. The most highly engaged members may take on high risk of social/legal/physical repercussions, and participation correlates with risk tolerance and disagreeableness. While participation does rely on strong ties,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref44jo9jgw4av\"><sup><a href=\"#fn44jo9jgw4av\">[1]</a></sup></span>&nbsp;the selection pressure is practically polar opposite. Rebels are more inclined follow those willing to face prison for the cause,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefsuzw4m8fewo\"><sup><a href=\"#fnsuzw4m8fewo\">[2]</a></sup></span>&nbsp;while EAs select for&nbsp;<i>“potential for impact”</i>, which correlates with proxies that are high-status and suitable for hierarchies (degree qualification, technical skill, references from other EAs).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6w8dms4482y\"><sup><a href=\"#fn6w8dms4482y\">[3]</a></sup></span></li></ol><p>Anyway, I just discovered your sequence and theories of change. I agree and have had similar thoughts for quite a while. As someone who researched member-organised movement and tried to build one as a contingency for the co-founders’ imprisonment, I’d say a member-organised structure is difficult for EA to adopt.</p><p>That said, I’m a very vocal supporter of EAs learning best practices from others. The climate movement that turned climate risk from a niche x-risk into the largest mobilisation of people, capital and resources in human history, and I regularly apply its lessons to planning EA meta/longtermism projects. Would love to talk more on this!<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8uvl55z56r\"><sup><a href=\"#fn8uvl55z56r\">[4]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn44jo9jgw4av\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref44jo9jgw4av\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Sources:&nbsp;<a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/pops.12478\"><u>How Social Media Facilitates Political Protest: Information, Motivation, and Social Networks - Jost - 2018 - Political Psychology - Wiley Online Library</u></a>,&nbsp;<a href=\"https://www.newyorker.com/magazine/2010/10/04/small-change-malcolm-gladwell\"><u>Small Change | The New Yorker</u></a></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnsuzw4m8fewo\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefsuzw4m8fewo\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This also applies to some branches of FridaysForFuture where organiser status carries significant legal risks (i.e. most places outside the US and EU).</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6w8dms4482y\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6w8dms4482y\">^</a></strong></sup></span><div class=\"footnote-content\"><p>As a side note, I find that in EA, virtue signalling in the technical sense is far less prominent (see: opinions towards protests, intersectionality and veganism), and others have suggested that EA has a&nbsp;<a href=\"https://www.charityentrepreneurship.com/post/deference-culture-in-ea\"><u>Deference Culture</u></a>. There’s also the elephant in the room where<a href=\"https://forum.effectivealtruism.org/posts/ThdR8FzcfA8wckTJi/ea-survey-2020-demographics#Gender\"><u> “Core EA” is 70% male</u></a> while&nbsp;<a href=\"https://www.washingtonpost.com/science/2019/09/24/teen-girls-are-leading-climate-strikes-helping-change-face-environmentalism/\"><u>climate activists are 60-70% female</u></a>, a comparison that is very noticeable and very baffling.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8uvl55z56r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8uvl55z56r\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Now that I’m doing the&nbsp;<i>“EA networking”</i> thing I should be more structured with introductions+engaging people across multiple topics/project ideas I have. If anyone has recommendations please let me know.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "o4BbAKPZahaLABjyG", "postedAt": "2022-12-21T16:10:59.075Z", "postId": "9YfKBHjFpkwkyNT6w", "htmlBody": "<p>Thanks for this awesome comment - when I have a little more time im going to address it properly!</p>\n", "parentCommentId": "TBLoEzbzxyBjr9GFS", "user": {"username": "vaidehi_agarwalla"}}]