[{"_id": "nKPyohfCbL9YiNwD8", "postedAt": "2023-10-24T06:41:55.867Z", "postId": "9YFs8b9r5jy6GJDdJ", "htmlBody": "<p><i><strong>\"I think we would make a lot more headway in certain communities if we took certain values of the context for granted and figured out the most effective way to work&nbsp;within&nbsp;those value system</strong>s<strong>\"</strong></i></p><p>I think this is a compelling point, which was made a couple of times as well during the African EA Forum competition. Here in Uganda for example collectivism (like you say), religion (mostly Christianity and Islam) and an almost automatic extreme heirachialism of humans over animals means that regular presentations of EA usually hit a stone wall.&nbsp;</p><p>However when I have talked in isolation about scout mindset, or cost-effectiveness of some charities over other I have had some warm responses at least, and there might be the chance of EA style thinking bedding in. I can understand the many arguments against this, but if we are looking for diversity then this may be a way forward.<br><br>I do disagree with this statement though</p><p><i><strong>\"If we had found&nbsp;the most effective way&nbsp;we would not have as highly engaged EAs being near termists and long termists simultaneously\"</strong></i></p><p>Different EA people can all be trying to \"do the most good\", while still coming to different conclusions about what the best way is to do that. Me and my EA colleague can have cause neutrality and a scout mindset, yet still come to wildly different conclusions about the most important causes, through having different moral frameworks, different assumptions, or even disagreements about how to do the math</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "hqvqt6N8MkGePmnem", "postedAt": "2023-10-24T11:23:51.900Z", "postId": "9YFs8b9r5jy6GJDdJ", "htmlBody": "<p>“If this seems like drifting from EA philosophy, I want to remind you of the key idea: Doing the best we can with the resources we have. The unspoken caveat is the resources we have within the social, political and legal constraints of the context we live in.” I have always been inclined to sacrifice some “effectiveness” to make EA more palatable (especially given that once people get “on board,” they are likely to become increasingly receptive to ideas that challenge their previous assumptions) and to use more effective tactics within “less effective” cause areas. This is the best-stated argument I’ve heard for this.</p>\n", "parentCommentId": null, "user": {"username": "SamB"}}]