[{"_id": "PniyNoAjrrBTC6jit", "postedAt": "2022-09-29T02:40:00.296Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>I sometimes work with EA orgs on their job descriptions. \"not being explicit about the salary\" is a common problem, and my take is that they just aren't aware of it being important, and after I point it out they add the salary. Not some secret agenda.</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "Rd6zezLbAnWMZEgD2", "postedAt": "2022-09-29T02:46:01.693Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>I also think this is something the 80k job board could push towards.</p><p>As simple solutions:</p><ol><li>Ask orgs if they could add a salary. The orgs might be unaware of this being a problem.</li><li>Have a field of \"salary\", and let candidates decide whether to see positions that don't advertise their salary.</li></ol>", "parentCommentId": "PniyNoAjrrBTC6jit", "user": {"username": "hibukki"}}, {"_id": "Jd5MEF2gccpTLkohG", "postedAt": "2022-09-29T02:53:27.329Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>At 1Day Sooner we do generally list salary ranges in our job descriptions, but there are some significant downsides for employers that are worth considering. First, the salary we're willing to pay varies significantly by a candidate's background and quality, which 1. means an accurate range can be wide enough to not be very informative and 2. when we make an offer, the candidate knows what we're willing to pay, so we might be forced to over-pay. More broadly, listing the salary range reduces our ability to negotiate and means we'll get a worse deal on average. Like I said, we still generally reveal expected salaries, but I understand why others don't. I'd be curious for other groups' rationale.</p>", "parentCommentId": null, "user": {"username": "joshcmorrison"}}, {"_id": "2eL3fS7CAArmckqef", "postedAt": "2022-09-29T03:35:58.798Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>Inside the tech world, there's a norm of fairly transparent salaries driven by levels.fyi (and Glassdoor, to a lesser extent). I think this significantly reduces pay gaps caused by eg differential negotiating inclinations, and a similar gathering place for public EA salary metrics is one of my pet project proposals.</p>\n<p>Manifold Markets takes the somewhat unusual step of just making all of our salaries public: <a href=\"https://manifoldmarkets.notion.site/Manifold-Finances-0f9a14a16afe4375b67e21471ce456b0\">https://manifoldmarkets.notion.site/Manifold-Finances-0f9a14a16afe4375b67e21471ce456b0</a></p>\n", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "LDofBqCwSXEECrv9B", "postedAt": "2022-09-29T07:48:09.495Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<blockquote><p>Inside the tech world, there's a norm of fairly transparent salaries driven by levels.fyi (and Glassdoor, to a lesser extent). I think this significantly reduces pay gaps caused by eg differential negotiating inclinations, and a similar gathering place for public EA salary metrics is one of my pet project proposals.</p></blockquote><p>&nbsp;</p><p>This is fairly wrong to very wrong.</p><ul><li>It's somewhat true that within each \"level\" or \"band\", there's a defined salaries or comp<ul><li>But this isn't that restrictive, the ranges can be high, esp past entry bands<ul><li>Also, there can be weird sub bands or sub roles where you can evade normal bands.</li><li>Also, there can be special cases where they go out of band or other \"compensating differentials\" can be given (although the later is small at big tech companies).</li></ul></li></ul></li><li>The band is determined after the interview process, e.g. after the interviews, your band is decided and then you get an offer, you can come in say, level \"5\" or level \"6\".&nbsp;<ul><li><strong>E,g it's very possible that for people who interview for the same position, the comp ranges from 200k to 600k, maybe even 800k</strong></li></ul></li><li>This is further messed up by RSU and vesting schedules.</li></ul><p>The result is that comp ranges for each \"job posting\" is huge, 200k to 800k.&nbsp;</p><p>Overall, for various structural reasons, salary isn't transparent in almost all very successful for profit companies, except for junior roles. Tech is a particularly terrible example to use because the pay can be so different for the same role.&nbsp;</p><p>Using large ranges would result the various problems <a href=\"https://forum.effectivealtruism.org/posts/A4kpWmxCEHoSa9dxs/why-don-t-all-ea-suggested-organizations-disclose-salary-in?commentId=Jd5MEF2gccpTLkohG\">described in this comment</a>, which is excellent and I strongly support the view, because saying the pragmatic truth is an \"anti-meme\".</p><p>&nbsp;</p><p>For better or worse, the end result of transparency is probably limited increase over the current state (which is fairly good) for a number of reasons, which I think are given in Morrison's comment.&nbsp;</p><p>Another reason is optics, at least one EA org pays a salary over $1,000,000 and that's not including equity.</p>", "parentCommentId": "2eL3fS7CAArmckqef", "user": {"username": "Charles He"}}, {"_id": "hNFbgyTMRPcSvFJNR", "postedAt": "2022-09-29T08:23:54.355Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>\"one EA org pays a salary over $1,000,000\" -- high info content should be on top!</p>\n", "parentCommentId": "LDofBqCwSXEECrv9B", "user": null}, {"_id": "rrSH5eyanumcLp4yG", "postedAt": "2022-09-29T14:08:53.252Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<blockquote><p>at least one EA org pays a salary over $1,000,000 and that's not including equity.</p></blockquote><p>&nbsp;</p><p>Does this EA org publicly declare this salary, or is this a number you might know from private connections? Would love to see that job description and how they explain it.<br>I would think such a high number could turn around some people's views and more strongly consider working at non-profits - such info should be better known.</p>", "parentCommentId": "LDofBqCwSXEECrv9B", "user": {"username": "Cassidy"}}, {"_id": "D36xG3DYR8vnwjrDa", "postedAt": "2022-09-29T14:25:44.458Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>While I personally think your proposed solution sounds great, and is kind of what I meant in my post. But I didn't want it to be specifically about 80k hours job board. They already do a great job helping job applicants with their limited resources and I didn't want the post be criticism about their work (or centered around them in general). &nbsp;:)&nbsp;</p><p><br>But if there is somebody who is already in contact with them or other orgs like you, and can - with little additionally effort - push towards disclosing salaries, that'd be much appreciated.&nbsp;<br>It doesn't seem feasible or effective for outsiders/applicants to request it. For example, one organization that mentioned it was accidentally missed in the description, still doesn't disclose the salary 3 weeks later. So other than making this forum post I wasn't sure what would be &nbsp;appropriate or useful to do from my side.</p>", "parentCommentId": "Rd6zezLbAnWMZEgD2", "user": {"username": "Cassidy"}}, {"_id": "4s489CDBjNEM9bLdY", "postedAt": "2022-09-29T14:47:30.787Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>I wasn't aware of such dynamics, thank you for commenting. :)&nbsp;<br>&nbsp;I would be interested to know if you only have this problem for specific positions (and if so why those), since you say it's generally disclosed? For more senior roles, where the maximum salary can be high or uncapped, I totally understand needing to be able to negotiate better.&nbsp;</p><p>My main concern with this post was not even disclosing a minimum salary for the minimal viable candidate (e.g. junior roles) - which I'd think any organization knows up front when deciding to hire. Luckily many do list whole salary ranges or at least the base amount depending on location/seniority.&nbsp;<br>I've also seen 1 organization with a \"no negotiation policy\". According to them it ensures fair pay across roles, but potentially also with benefits for the organization?</p>", "parentCommentId": "Jd5MEF2gccpTLkohG", "user": {"username": "Cassidy"}}, {"_id": "kTqFbD2GBRqQ8jLrX", "postedAt": "2022-09-29T14:50:19.886Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>Thanks for your comment. It seems the link you posted is not accessible without signing up for Notion, is that intended?</p><p>I'm aware there's a push to disclose salaries outside EA, sometimes even by law. But since organizations in the EA community generally aren't for profit, I would think there is less incentive and reason to hide salaries or prevent pay discussions.</p>", "parentCommentId": "2eL3fS7CAArmckqef", "user": {"username": "Cassidy"}}, {"_id": "cSya6vrD5YAGeEv8p", "postedAt": "2022-09-29T14:55:37.438Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>I think the problems I mentioned exist for all roles. (Insofar as there were roles that were a commodity with known pricing, maybe it would matter less but not sure. I don't know how many of those exist). I do think disclosing just a minimum could obviate the issues I raised. (And we do consider the value of disclosing anticipated salary as high enough that we generally do publish them -- I'm just making the point here that I don't think it's a costless decision).&nbsp;</p><p>Also I should maybe &nbsp;mention that 1Day's COO Julia Murdza manages our hiring processes (I don't), and her thoughts are likely to be more sophisticated on this than mine.</p>", "parentCommentId": "4s489CDBjNEM9bLdY", "user": {"username": "joshcmorrison"}}, {"_id": "AcQ7Hio7dtJdtFoXj", "postedAt": "2022-09-29T16:31:38.035Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>Link updated, sorry about that!</p>", "parentCommentId": "kTqFbD2GBRqQ8jLrX", "user": {"username": "akrolsmir"}}, {"_id": "sTEqzzZNeEEBC5Fhn", "postedAt": "2022-09-29T16:47:35.310Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>Thanks for adding the context! I think your specific points are factually correct regarding wide variations of pay in the software industry, though I don't think that actually refutes the point that salary ranges and comp expectations are well-known and easy to look up -- certainly much more so than in EA or most other for-profit sectors. (Government/academic work is the exception here, where you can often find eg specific teacher salaries posted publicly)</p><p>If you eg look at <a href=\"https://www.levels.fyi/\">https://www.levels.fyi/</a> for Google, you can directly see what an L3 (fresh grad), L4 (1-2 years of experience), L5 (\"Senior\", typically 3-4 years) make in the industry. RSU/equity/vesting schedule does complicate things, but they are likewise shared on the site, here's Stripe's (note their L3 corresponds to Google L5)<img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_130 130w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_260 260w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_390 390w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_520 520w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_650 650w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_780 780w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_910 910w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_1040 1040w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_1170 1170w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0a7a46885fa54b2bae6b6663ed6c0337a4d0df1098b8dd48.png/w_1282 1282w\"></p><p>I acknowledge the point made in Morrison's comment, but just think that it's a bad norm that favors employers, who tend to have an informational advantage over employees in the first place, and am unsure why EA orgs and especially EA individuals/employees should want to perpetuate this norm.</p><p>On an optics level, I think you should just be up front and confident in your valuations. If someone asks why, you can mention something like \"this ML researchers makes $1m in salary because they would otherwise make $2m at Deepmind\".</p>", "parentCommentId": "LDofBqCwSXEECrv9B", "user": {"username": "akrolsmir"}}, {"_id": "xgubP83WXALgvMwmz", "postedAt": "2022-09-29T16:56:58.566Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>Fixed, thanks! Respect your approach, transparency is often underappreciated.<br>After checking the third entry I couldn't help thinking of <a href=\"https://pbs.twimg.com/media/ESGj5gWX0AIOE8A?format=jpg&amp;name=small\">\"You guys are getting paid?\" meme</a> :D<br>Interesting choice.</p><p>&nbsp;</p><p>*<i>I couldn't figure out how to add pictures to comments, sorry :(&nbsp;</i></p>", "parentCommentId": "AcQ7Hio7dtJdtFoXj", "user": {"username": "Cassidy"}}, {"_id": "jJzbKd5AoJNvRW7PL", "postedAt": "2022-09-29T20:07:04.802Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>FWIW I agree with Charles that tech industry salaries have high ranges and aren't very transparent, compared to EA orgs.&nbsp;</p><ol><li>If you look at the salary ranges posted by EA orgs (here's <a href=\"https://rethinkpriorities.org/titles\">Rethink's ranges</a>, <a href=\"https://jobs.ashbyhq.com/openphilanthropy/243da982-26bb-4412-8d48-71d6da45ea92\">here's &nbsp;a job posting by Open Phil</a>) the ranges are substantially narrower. This substantially limits the room for negotiation/favoritism.</li><li>The ranges are posted by the orgs themselves. In tech, the numbers are posted (often against a company's will) by employees and job candidates. This is a pretty adversarial dynamic. I'm tentatively glad EA does not have this (though I'm uncertain).</li></ol>", "parentCommentId": "sTEqzzZNeEEBC5Fhn", "user": {"username": "Linch"}}, {"_id": "DfX2BevW6niasmQ6q", "postedAt": "2022-09-29T20:08:26.981Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p><a href=\"https://www.nytimes.com/2018/04/19/technology/artificial-intelligence-salaries-openai.html\">2018 article</a> about OpenAI salaries on the top end, though it's unclear to me whether OpenAI should count as an EA org.</p>", "parentCommentId": "hNFbgyTMRPcSvFJNR", "user": {"username": "Linch"}}, {"_id": "eCqm7toamkSRD4HjP", "postedAt": "2022-09-29T20:58:10.460Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>Hm so the subject of salary range is actually quite different than transparency - I mostly think large ranges would be good because it allows for EA to pay market rates to highly skilled/in demand workers. Imo the current ethos of artificial/sacrificial wages in EA is pennywise, pound foolish, and leads to the problem of having very mission-aligned but not extremely competent people in EA orgs. I think it's a major reason EA struggles to attract mid to late career talent, especially leadership/managers/mentors.</p>\n<p>Re: adversarial, I don't have the sense that either 1) employers care about having their pay ranges publicized on levels.fyi or similar services, nor that 2) companies have a right to keep such information private.</p>\n", "parentCommentId": "jJzbKd5AoJNvRW7PL", "user": {"username": "akrolsmir"}}, {"_id": "NzZwuDHMXysDEtbqv", "postedAt": "2022-09-29T21:00:44.824Z", "postId": "A4kpWmxCEHoSa9dxs", "htmlBody": "<p>I'm also not sure how much work is being covered by the word \"range\" here - it's true that eg Google would hire one engineer for 200k and another for 800k, but the roles and responsibilities and day to day work of both would look completely different.</p>\n", "parentCommentId": "eCqm7toamkSRD4HjP", "user": {"username": "akrolsmir"}}]