[{"_id": "tt4QAdSAvirbe9GTb", "postedAt": "2024-02-20T11:57:09.174Z", "postId": "A5RNKz8jHjJEDjSea", "htmlBody": "<p>Excellent post Jessica, and intriguing! On the point about jobs outside the West, I would be curious to learn more if anyone has looked into it:<br>-A lot of outbreaks of disease happens in poorer countries - could there be opportunities to deliver engineered disease management tools in these locations? Might even overlap a bit with AIM/CE work.<br>-What about engineering work on semiconductors and/or chips? I am super naive about this but would guess Taiwan and the Netherlands would also be potential locations to have lots of impact as an engineer?<br><br>I also have a question which is more personal:<br>-As a mech eng myself I am curious about the mapping of engineering disciplines to cause areas? I would naively think that mech eng maps onto CC and nuclear, while bio eng maps more onto biosec and alt proteins.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "izfwQLvZGTcPF5q7o", "postedAt": "2024-02-22T15:53:43.405Z", "postId": "A5RNKz8jHjJEDjSea", "htmlBody": "<p>Thanks for your comment Ulrik! Some thoughts on your bullet points:<br><br>- I think there probably are opportunities to do biosecurity work in LMICs (e.g. Africa CDC's <a href=\"https://africacdc.org/programme/laboratory-systems-and-networks/biosafety-and-biosecurity/\">Biosafety and Biosecurity initiative</a>, the <a href=\"https://wwwnc.cdc.gov/eid/article/25/5/18-1659_article\">Southeast Asia Strategic Multilateral Dialogue on Biosecurity</a>) but these seem mostly policy-based rather than focused on technical interventions (likely because there's just more private and public money for developing technical interventions in high-income countries).<br><br>- 80k mentioned that they would be adding more technical governance jobs (i.e., more roles in semiconductors/chips) in the near future, so hopefully the geographical bias might shift somewhat. However, my intuition is that the US will continue to be a hotspot for jobs in this sector because of the sheer size and concentration of semiconductor companies (and maybe because of the higher likelihood of actually affecting governance/regulations/standards?)<br><br>- We did some mapping of engineering disciplines to cause areas, which you can see <a href=\"https://images.squarespace-cdn.com/content/v1/62c520ef9bfdd97399c20627/28109ca2-7239-4c01-a40f-7b456d0ed852/EngineersInEA+%284%29.png?format=2500w\">here</a> and on our <a href=\"https://www.highimpactengineers.org/resources\">Resource Portal</a> (it is by no means comprehensive – we even miss out nuclear!) Turns out mechanical engineers are pretty useful in a lot of cause areas. Hope that's helpful!</p>", "parentCommentId": "tt4QAdSAvirbe9GTb", "user": {"username": "Jessica Wen"}}]