[{"_id": "q4K8KWmn6RQ7nnZKG", "postedAt": "2023-09-07T10:24:38.988Z", "postId": "a6A3AC9hoEMKQvpyo", "htmlBody": "<p>Thanks Michael I really like this.</p><p>I think the easiest alternatives to minimise these issues practically might be...<br>&nbsp;<br>1) Just work in different places like you said. I doubt either AMF or Malaria consortium can cover everywhere that they want to cover, so why not just divide? Great to see they might actually be doing this for the most part already...</p><p>2) If you really have to work in the same place, at least time interventions to minimise this effect, for example if Malaria consortium has 5 countries they want to operate in, they would be better starting their interventions first in the country where AMF last distributed their nets 2-3 years ago, rather than doing chemoprevention at almost the same time as net distribution.</p><p>Nick.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "HKBSLmsTxPBNBhwtm", "postedAt": "2023-09-07T13:24:23.881Z", "postId": "a6A3AC9hoEMKQvpyo", "htmlBody": "<p>Thanks Nick!</p>\n<p>I'd guess it's actually often worth it to do both in the same places and actually doubly protect many people, despite the trickiness of accounting for both. You can use or check with more conservative assumptions to avoid overestimating impact. Otherwise you might miss out on a lot of impact by avoiding overlap.</p>\n", "parentCommentId": "q4K8KWmn6RQ7nnZKG", "user": {"username": "MichaelStJules"}}, {"_id": "hrMod8idundpaaC9n", "postedAt": "2023-09-07T13:41:28.961Z", "postId": "a6A3AC9hoEMKQvpyo", "htmlBody": "<p>Im sure its worth it to do in two at once, but if either org only has the resources to do their distributions in half the places which might have similar impact, why not split it up? Politically and practically there might be issues here but in theory it could work....</p>", "parentCommentId": "HKBSLmsTxPBNBhwtm", "user": {"username": "NickLaing"}}, {"_id": "oDP3QgPcdYsuKsnHB", "postedAt": "2023-09-07T23:09:41.119Z", "postId": "a6A3AC9hoEMKQvpyo", "htmlBody": "<p>Hi Michael,</p>\n<p>Thank you for raising these points! We’ve shared your thoughts with our research team for future consideration.</p>\n<p>If you have any other questions or concerns about our work, please feel free to reach out to us!</p>\n<p>Roman Guglielmo</p>\n<p>Donor Relations Associate</p>\n<p>GiveWell</p>\n", "parentCommentId": null, "user": {"username": "GiveWell"}}]