[{"_id": "MfPvWiHA5pyFWNLMe", "postedAt": "2023-05-27T06:53:13.565Z", "postId": "a73hab2hmXYrgKcCL", "htmlBody": "<p>We should all try to maximise our impact and there’s a good argument for specialisation.</p><p>However, I’m concerned by a few things:</p><ul><li>Its not obvious to me that spending more money on yourself will make you better at your job</li><li>There’s a danger of arrogance clouding our judgment, e.g. I don’t think 99% of people in EA should be flying business class</li><li>Donating has value for many people due to the “skin in the game” effect</li></ul>", "parentCommentId": null, "user": {"username": "Grayden"}}, {"_id": "9MecE6CmejpRBRkH9", "postedAt": "2023-05-27T19:54:06.808Z", "postId": "a73hab2hmXYrgKcCL", "htmlBody": "<p>Agree with everything here.</p>\n<p>But the argument isn’t that people should spend the money they’d otherwise donate to charity on themselves/flying business class, it’s that they should use it to further whatever their particular path to impact is.</p>\n", "parentCommentId": "MfPvWiHA5pyFWNLMe", "user": {"username": "Carter Allen"}}, {"_id": "ttf8yyLh3CWuFqqLv", "postedAt": "2023-05-27T20:12:29.725Z", "postId": "a73hab2hmXYrgKcCL", "htmlBody": "<p>It's interesting to encounter this argument against donating to charity, as I haven't come across it before. The strategy of optimizing for specialization because performance follows the statistical Pareto distributions sounds about right to me.</p><p>While this post raises valid points about the potential opportunity costs of spreading oneself too thin, I believe the traditional approach of donating a percentage of income (such as 10%) has its merits as well. It provides a scalable framework that aligns with one's earning potential, allowing individuals at different income levels to contribute meaningfully and, like Grayden said, it could provide a valuable \"skin in the game\" effect.</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}]