[{"_id": "8ayEDChNwpvDqkyYz", "postedAt": "2023-10-13T08:56:54.102Z", "postId": "A7kjjCf6rCcdiKH8Y", "htmlBody": "<p>According to <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9778186/\">this (not that rigorous) paper</a>, cataract surgery can cost about $300. It improves vision and sometimes prevents blindness. Even if it's not as cost-effective as a GiveWell-recommended charity, it can still illustrate the point about guide dogs.</p><p>As someone who has thought about cost-effectiveness, I agree that comparing willingness-to-pay-for-a-QALY/life is a more robust point. But for people who haven't thought about this much, the more visceral preventing-blindness comparison might be better.</p><p>Maybe it would be worth someone checking that cataract-surgery charities like <a href=\"https://www.sightsavers.org/\">Sightsavers </a>are passably cost-effective.</p>", "parentCommentId": null, "user": {"username": "Stan Pinsent"}}, {"_id": "cCPvYWDQDYKvAXNmt", "postedAt": "2023-10-13T11:59:22.741Z", "postId": "A7kjjCf6rCcdiKH8Y", "htmlBody": "<blockquote>\n<p>Even if it's not as cost-effective as a GiveWell-recommended charity, it can still illustrate the point about guide dogs.</p>\n</blockquote>\n<p>While it can illustrate the point I think there are two main issues:</p>\n<ul>\n<li>\n<p>If someone does get excited about what you're saying and wants to donate, we don't have anywhere with good evidence to recommend.</p>\n</li>\n<li>\n<p>We shouldn't put much stock in numbers like \"$300/surgery\" unless there's been a good evaluation: it's very common that you end up with much lower benefits than expected per dollar once you start digging in.  For example, perhaps existing funders already cover the cases where the surgery would prevent blindness, charities aren't willing to focus on the people with the worst vision, or the life expectancy of recipients is low because cataracts develop late in life.</p>\n</li>\n</ul>\n<blockquote>\n<p>it would be worth someone checking that cataract-surgery charities like Sightsavers are passably cost-effective.</p>\n</blockquote>\n<p>Note that GiveWell did actually <a href=\"https://www.givewell.org/charities/sightsavers/November-2021-version\">recommend</a> Sightsavers (before their <a href=\"https://blog.givewell.org/2022/08/17/changes-to-top-charity-criteria\">2022 criteria changes</a>), but for their deworming program, not their vision work.</p>\n<p>They also looked into cataract surgery quite a bit <a href=\"https://www.givewell.org/charities/IDinsight/partnership-with-idinsight/cataract-surgery-project\">in 2017</a> but didn't end up with anything to recommend.</p>\n", "parentCommentId": "8ayEDChNwpvDqkyYz", "user": {"username": "Jeff_Kaufman"}}, {"_id": "aT3jwTy9KdBm6AHxr", "postedAt": "2023-10-13T12:14:47.186Z", "postId": "A7kjjCf6rCcdiKH8Y", "htmlBody": "<blockquote><p>We shouldn't put much stock in numbers like \"$300/surgery\" unless there's been a good evaluation: it's very common that you end up with much lower benefits than expected per dollar once you start digging in. For example, perhaps existing funders already cover the cases where the surgery would prevent blindness, charities aren't willing to focus on the people with the worst vision, or the life expectancy of recipients is low because cataracts develop late in life.</p></blockquote><p>&nbsp;</p><p>Agree.</p>", "parentCommentId": "cCPvYWDQDYKvAXNmt", "user": {"username": "Stan Pinsent"}}, {"_id": "2JCApqY4CpGYnyW9o", "postedAt": "2023-11-17T19:38:18.597Z", "postId": "A7kjjCf6rCcdiKH8Y", "htmlBody": "<p>Thanks for posting. I've been trying to find the best place to donate in blindness prevention for a few giving cycles now.</p><p>Intuitively, it feels like interventions without the direct goal of mortality prevention, like preventing blindness, could achieve nearly as much good over the years as preventing deaths.</p>", "parentCommentId": null, "user": {"username": "dlipsitz@gmail.com"}}]