[{"_id": "NnWMYGgyJf6FKgoAi", "postedAt": "2022-12-15T17:44:51.310Z", "postId": "A8BEFGKtCEWcq7mJ6", "htmlBody": "<p>Does this mean one should reduce the expected risk for the cross-strait? I don't think so. While there is no evidence of an imminent attack, it is abundantly clear that the Chinese government would like to have the <i>option </i>of a successful attack <i>at will,&nbsp;</i> to strike at the most politically convenient time. Anyone who examines cross-strait relations from the perspective of imminence (i.e. is there going to be an attack this week, next month or next year) is mistaken in perspective. It could be five years, ten years, or 50 years. Or it could be a random soldier firing shots next week and dragging the whole world into a world war. Effective guarding against nuclear risks does not occur with an accurate expected risk timeline (impossible given the extreme opaqueness of information and randomness of war events). Instead, it happens with constant, careful, vigilant guarding. Of course, we should avoid having the US government kick-starting a nuclear war by pre-emptive strikes or panic-induced miscalculations, but that is different from saying, 'China won't bomb TW next week so let's calm down'. I don't think this is the right sentiment here.&nbsp;</p>", "parentCommentId": null, "user": {"username": "liu_he"}}, {"_id": "K7ptrJerBxqdhGmwS", "postedAt": "2022-12-15T18:07:03.341Z", "postId": "A8BEFGKtCEWcq7mJ6", "htmlBody": "<p>To my mind, the piece is a welcome response to the recent (imo) irresponsible hyping of cross-strait risk by influential US actors. To the extent that anyone's expectation of the risk of cross-strait violence was influenced by such voices, this piece should help recalibrate down. But of course the fundamental risk remains, even if there are reasons to doubt its immimence as represented by China hawks.</p><p>You could do a Straussian reading of this piece such that it is in fact saying 'China won't bomb TW next week so let's calm down' in order to \"avoid having the US government kick-starting a nuclear war by pre-emptive strikes or panic-induced miscalculations.\" To the extent that Tim Heath is respected and that WotR is widely read by US decision-makers, I think this reading makes some sense (although ofc there are very strong incentives for the US gov't to not start a war with China that have nothing to do with whether they're reading WotR or not). Your mileage may vary.</p><p>Your broader point, though, that we should take a longer/less-temporally-bound/more structural view of the risk, is one that I agree with.&nbsp;</p>", "parentCommentId": "NnWMYGgyJf6FKgoAi", "user": {"username": "Jack Cunningham"}}, {"_id": "mkvMNcEehzbZxtrES", "postedAt": "2022-12-15T20:05:17.047Z", "postId": "A8BEFGKtCEWcq7mJ6", "htmlBody": "<p>Three arguments in favor of &nbsp;war soon:</p><ol><li>Chips. While China chip industry is getting sanctioned, most of the world production of advanced chip remains on Taiwan. But this is not for long, as manufacturing start relocating in other places. Attack on Taiwan could prevent US dominance in chips and AI.</li><li>Ukraine war strained US production of some weapons, but US invested in increase of production of missiles and artillery ships. So in future situation will be less advantageous for war.</li><li>China has clear advantage now in cheap drones produced in mass, like DJI. But is is also not for long.</li></ol>", "parentCommentId": null, "user": {"username": "turchin"}}, {"_id": "qizMRrPxWMKdcWmu3", "postedAt": "2022-12-20T03:37:36.842Z", "postId": "A8BEFGKtCEWcq7mJ6", "htmlBody": "<p>John Culver's <a href=\"https://carnegieendowment.org/2022/10/03/how-we-would-know-when-china-is-preparing-to-invade-taiwan-pub-88053\">How We Would Know When China Is Preparing to Invade Taiwan</a> is also worth reading.</p>\n<blockquote>\n<p>China’s political strategy for unification has always had a military component, as well as economic, informational, legal, and diplomatic components. Most U.S. analysis frames China’s options as a binary of peace or war and ignores these other elements. At the same time, many in Washington believe that if Beijing resorts to the use of force, the only military option it would consider is invasion. This is a dangerous oversimplification. China has many options to increase pressure on Taiwan, including military options short of invasion—limited campaigns to seize Taiwan-held islands just off China’s coast, blockades of Taiwan’s ports, and economic quarantines to choke off the island’s trade. Lesser options probably could not compel Taiwan’s capitulation but could further isolate it economically and politically in an effort to raise pressure on the government in Taipei and induce it to enter into political negotiations on terms amenable to Beijing.</p>\n</blockquote>\n<p>An all-out invasion would be detected months in advance:</p>\n<blockquote>\n<p>Any invasion of Taiwan will not be secret for months prior to Beijing’s initiation of hostilities. It would be a national, all-of-regime undertaking for a war potentially lasting years.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Michael Huang"}}]