[{"_id": "fZCqjyJdejyn7uoaG", "postedAt": "2023-11-23T14:34:53.129Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>Thanks very much for sharing this, and all your good work!</p><blockquote><p>We are particularly funding constrained because&nbsp;<strong>we do not accept funding from several of the key funding sources within the effective altruism</strong>&nbsp;<strong>community</strong> due to our working hard to remain robustly impartial when it comes to the advice we provide to donors and the programs we choose to support on our donation platform. We have turned down funding for this reason and hope that we are able to grow predominantly through funding from donors and members who buy directly into our mission and see the impact of our work.</p></blockquote><p>Would you mind saying a little more about declining funding from impartiality concerns? I assume in practice this means refusing OpenPhil dollars, and I'm wondering in what way you think this would undermine your impartiality. Is the fear that you would feel under pressure to support their cause areas?</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "toQBDyMadY2Kinwec", "postedAt": "2023-11-23T18:48:22.847Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>I'm really happy to see the  “Add 10% to support our work” button and I check this every time it comes up!</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "jehftrjgmpFqhEHos", "postedAt": "2023-11-23T18:49:09.732Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>I agree with this and I'd also be curious to hear more details about where GWWC's current funding does come from, to help evaluate the extent to which GWWC is impartial (though to be clear I do think GWWC is impartial).</p>\n", "parentCommentId": "fZCqjyJdejyn7uoaG", "user": {"username": "Peter_Hurford"}}, {"_id": "ejiECikknn3dxWDXo", "postedAt": "2023-11-23T21:33:47.962Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>(Thank you!!)</p>\n<p>We take funding from Open Philanthropy (currently our largest funder) but not from the evaluators and grantmakers whose recommendations we use (eg Founders Pledge, GiveWell etc) because we don't want it to undermine people's trust in our recommendations.</p>\n<p>For various reasons both OP and us would like us to reduce the portion of funding that comes from them as time goes on.</p>\n", "parentCommentId": "fZCqjyJdejyn7uoaG", "user": {"username": "Luke Freeman"}}, {"_id": "4rMoxG6Gx5vWoFZor", "postedAt": "2023-11-23T21:35:52.490Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>Our largest funder has been OP, and we received some (now returned) money from Future Fund. Other than that it hs mostly been individuals and small foundations (eg family foundations).</p>\n", "parentCommentId": "jehftrjgmpFqhEHos", "user": {"username": "Luke Freeman"}}, {"_id": "xE2eYYLtGJ55hpor8", "postedAt": "2023-11-23T21:36:26.508Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>Thanks!! Great to hear!</p>\n", "parentCommentId": "toQBDyMadY2Kinwec", "user": {"username": "Luke Freeman"}}, {"_id": "g3xPDadfhLcyv67td", "postedAt": "2023-11-23T22:11:41.813Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>Makes sense, thanks for explaining!</p>\n", "parentCommentId": "ejiECikknn3dxWDXo", "user": {"username": "Larks"}}, {"_id": "j5azie98SZ3rksP7L", "postedAt": "2023-11-24T17:23:32.747Z", "postId": "a8wijyw45SjwmeLY6", "htmlBody": "<p>This seems like a case in which it might be helpful for OP to consider pre-committing to GWWC's funding for the next three years or so, with the exact amount of funding each year determined by an algorithm related to GWWC's non-OP funding. Optionally, each year it could announce the algorithm for the fiscal year that began three years from the current year so that there was always a three-year funding algorithm in place.</p><p>This would be vaguely similar to what it is doing for some of the EA Funds (although given GWWC's more democratic spirit the formula should factor in number of donors rather than being so heavily based on volume raised). In essence, OP would be deferring to the community's pocketbook vote as to renewal of GWWC's grant and (within bounds) adjustments to the amounts granted. There's a cost for OP there -- the algorithm might lead to a somewhat different grant amount than OP would have chosen under the traditional system, but proper construction of the algorithm should keep the amount \"on rails.\" And GWWC's budget is on the smaller side, so the possible variance should be possible despite the risks of endowment changes and similar events. (Or they could be written into the algorithm.)</p><p>This is also a more general idea for other components of what we might term \"EA Core Democratic-Leaning Infrastructure,\" which would also encompass the basic expenses of running the Forum (not the entire CEA Online Team budget request), most of CEA Community Health / Special Projects, and probably a few other things as well. These are all functions for which it would be good for the work to be funded more by a broad base of donors and less by Open Phil.</p>", "parentCommentId": "ejiECikknn3dxWDXo", "user": {"username": "Jason"}}]