[{"_id": "sjTWAAdMhvb46JdPA", "postedAt": "2022-12-16T18:13:48.696Z", "postId": "A8Wsm8Evfo3wxifxz", "htmlBody": "<p>[deleted]</p>\n", "parentCommentId": null, "user": {"username": "Steve Zekany"}}, {"_id": "T4jYrpAvqfdSb6vEg", "postedAt": "2022-12-16T19:54:20.028Z", "postId": "A8Wsm8Evfo3wxifxz", "htmlBody": "<blockquote><p>Do I view every problem in my life and my community as analogous or bearing surprising similarity to the alignment problem</p></blockquote><p>This made me laugh.</p><p>But also, as I said at the top of the post, I actually do think the alignment problem does bear surprising similarities to other things, but this is mainly because of general ideas about complex systems pertain to both.</p>", "parentCommentId": "sjTWAAdMhvb46JdPA", "user": {"username": "ThomasWoodside"}}, {"_id": "DaY5jvo8FonGr58fe", "postedAt": "2022-12-17T02:51:01.465Z", "postId": "A8Wsm8Evfo3wxifxz", "htmlBody": "<p>I think the answer is yes, primarily because I do think this is an effective strategy to do much of anything in the real world.</p>\n<p>Here's a link:</p>\n<p><a href=\"https://www.lesswrong.com/posts/firtXAWGdvzXYAh9B/paper-transformers-learn-in-context-by-gradient-descent\">https://www.lesswrong.com/posts/firtXAWGdvzXYAh9B/paper-transformers-learn-in-context-by-gradient-descent</a></p>\n<p>And here's a comment from the post.</p>\n<blockquote>\n<p>I think it's too easy for someone to skim this entire post and still completely miss the headline \"this is strong empirical evidence that mesa-optimizers are real in practice\".</p>\n</blockquote>\n<p>I'll construct 2 scenarios of where EA mesa-objectives would likely conflict with reality, and conditional on this, I expect the EA community to learn deceptive alignment with &gt;50% probability:</p>\n<ol>\n<li>Moral realism is correct, but the correct theory of ethics is non-utilitarian. Specifically, moral realism is the claim that there are mind independent facts of morality, similar to how reality is today mind independent. There is a fact of the matter on morality.</li>\n</ol>\n<p>Bluntly, EA is a numbers movement. And only utilitarianism endorses using numbers. So if dentology or virtue ethics were right, I do not expect EA to be aligned to it, and instead become deceptively aligned.</p>\n<ol start=\"2\">\n<li>Moral anti-realism is correct, that is there is no fact of the matter of which morality is correct, and everything is subjective. That is, if people are disagreeing on values, both sides are right in their own view, and that's it. There is no moral reality here.</li>\n</ol>\n<p>Again, I expect failure to transmit that fact to the public, admittedly this time EA doesn't need to justify it's values, nor does anybody else, but I do expect EA to put a front of being objective truth even if it isn't.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "ortaqmTjhuDESNirT", "postedAt": "2022-12-18T03:45:12.213Z", "postId": "A8Wsm8Evfo3wxifxz", "htmlBody": "<p>I just wanna say, if that's the best you can do for \"EA is deceptive\" then it seems like EA is significantly less deceptive than the average social movement, corporation, university, government, etc.<br><br>As for misaligned, yes definitely, in the way you mention. This is true of pretty much all human groups though, e.g. &nbsp;social movements, corporations, universities, governments. &nbsp;The officially stated goals and metrics that are officially optimized for would cause existential catastrophe if optimized at superintelligent levels.</p>", "parentCommentId": null, "user": {"username": "kokotajlod"}}, {"_id": "GXNAzpQzjp4AcyZ3f", "postedAt": "2023-01-22T00:55:33.847Z", "postId": "A8Wsm8Evfo3wxifxz", "htmlBody": "<p>I think this is probably true because it is true of all organizations. The problem seems to be EA is reluctant to define its membership and power structure, and as a result these are left up to various default incentive structures, which seem likely to produce misalignment.</p><p>I am strong up-voting and commenting to bring this to people's attention.</p><p>A snappier title might really help broaden its appeal as well.</p><p>Hope this helps!</p>", "parentCommentId": null, "user": null}]