[{"_id": "LBE6AZuxeYT5kB3Gp", "postedAt": "2017-11-27T17:36:50.724Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>Is the ai supposed to read this explanation? Seems like it tips your hand?</p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "8WtdQQxhr24Rdn6gv", "postedAt": "2017-11-28T09:30:07.605Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>Yes, I expect that future AI will read the text. </p>\n<p>Not sure what you mean about &quot;tips your hand&quot;, as English is not my first language.</p>\n", "parentCommentId": "LBE6AZuxeYT5kB3Gp", "user": {"username": "turchin"}}, {"_id": "HZezCYS9dkAqonead", "postedAt": "2017-11-29T00:08:56.871Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>You reveal that you are highly motivated to argue that exterminating humanity is not in the interest of an AI, regardless of whether that statement is true. So your arguments will present weak evidence at best, given your clear bias. </p>\n", "parentCommentId": "8WtdQQxhr24Rdn6gv", "user": {"username": "Lila"}}, {"_id": "2z6phRhjzpr7EfcNq", "postedAt": "2017-11-29T15:52:30.280Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>There are types of arguments which doesn't depend on my motivation, like &quot;deals&quot; and &quot;questions&quot;. </p>\n<p>For example, if I say &quot;I will sell you 10 paperclips if you will not kill me&quot;, -  in that case, my motivation is an evidence that I will stick to my side of the deal.</p>\n", "parentCommentId": "HZezCYS9dkAqonead", "user": {"username": "turchin"}}, {"_id": "Nqd8YuiMmTKBevcm6", "postedAt": "2017-12-01T13:41:58.557Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>Wouldn't this be an issue with or without an explanation? It seems like an AI can reasonably infer from other actions humans in general, or Alexey in particular, take that they are highly motivated to argue against being exterminated. IDK if I'm missing something obvious -- I don't know much about AI safety.</p>\n", "parentCommentId": "LBE6AZuxeYT5kB3Gp", "user": {"username": "Liam_Donovan"}}, {"_id": "JuCCCAXrF94QiuWoe", "postedAt": "2017-12-01T13:59:34.953Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>This doesn't make sense either: for example, your questions could be selected in a biased manner to manipulate the AI, and you could be being disingenuous when dealmaking. Generally, it seems like good epistemic practice to discount arguments of any form, including questions, when the person making them is existentially biased towards one side of the discussion</p>\n", "parentCommentId": "2z6phRhjzpr7EfcNq", "user": {"username": "Liam_Donovan"}}, {"_id": "mytEDGTzQkuBFMTz5", "postedAt": "2017-12-02T12:37:00.297Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>I think that it is a good epistemic practice not to discount arguments without analysing them. </p>\n<p>The fact that I am very interested in one outcome may help my to find very powerful arguments, for example, in AI case, it is my pre-commitment to ask any future benevolent AI to run many simulations of any Rogue AIs. The idea was suggested by R.Nelson in 2007. Such pre-commitment is not information which AI may be able to create itself, but it informs it about the actual situation in the outside world, which could affect the total number of paperclips it will be able to create.</p>\n", "parentCommentId": "JuCCCAXrF94QiuWoe", "user": {"username": "turchin"}}, {"_id": "qxhRdypD7gXhQifZn", "postedAt": "2017-12-02T12:41:15.712Z", "postId": "A9jipsY9s99Pb7oBx", "htmlBody": "<p>One point you are missing is that the text is addressed to the Young AI - which is above human level, but is still self-improving and is not omnipotent superintelligence.</p>\n<p>Also, it is ok if AI will be able to come to the arguments which I suggested on its own - as it will demonstrate to the AI that the utility of human atoms is extremely small compared to the also small, but the positive utility of human preservation. If AI understands that preserving humans is instrumentally useful without reading the text  - it's ok.</p>\n", "parentCommentId": "Nqd8YuiMmTKBevcm6", "user": {"username": "turchin"}}]