[{"_id": "CWrezoo9ahJSqH8wp", "postedAt": "2018-09-28T11:39:39.848Z", "postId": "a9KpNLWpSKt9LxpRp", "htmlBody": "<p>Did the group grow at all during this period?</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "uaEXpFdjhMsv3zzwR", "postedAt": "2018-09-28T12:14:59.934Z", "postId": "a9KpNLWpSKt9LxpRp", "htmlBody": "<p>Hey Sebastian &amp; Philip, thanks for this really helpful post. I'm currently helping to run Yale EA through a CEA Community Grant and there were some great tips here. There are a couple of thing's I'd be very interested to hear more about:</p>\n<ul>\n<li>Would it be possible to see a copy of the survey which sought your members' &quot;views on key bottlenecks and promising projects&quot;?</li>\n<li>If you'd be willing to share, what was the project you didn't end up doing after getting external advice on your prioritisation? Was it &quot;to find and read resources (mainly blog posts) made by other community builders&quot;? And, if so, what was the reasoning behind de-prioritising? </li>\n<li>I think an example entry for the project prio spreadsheet would be really useful for me to get a clearer sense (and as a side note - do you think your fully filled-out prio spreadsheet would be applicable to other groups, or do you think it's too Denmark-specific to be useful and thus seeing it might confuse / bias other group organisers' prios? I imagine at least some of the columns would be somewhat constant between groups.) </li>\n<li>Are there slides / instructions of some kind to potentially replicate the &quot;interactive workshops on Productivity and Effective Learning&quot;? Do have some sense of why your members found these so useful / positive aspects of these that other groups running workshops could replicate? </li>\n<li>I'm still not entirely sure I understand what you mean by &quot;Make batches of your projects&quot;, and how this model differs from assessing each individual project, and ordering them in terms of the factors you described, then going down the list in order. </li>\n</ul>\n<p>Cheers!</p>\n", "parentCommentId": null, "user": {"username": "frankieaw"}}, {"_id": "X8kJTjCAY2gExueP9", "postedAt": "2018-09-28T17:17:43.514Z", "postId": "a9KpNLWpSKt9LxpRp", "htmlBody": "<p>Hi Frankie! Happy to hear that Sebastian's post was of use to you. Great questions also!</p>\n<ul>\n<li>Here is a <a href=\"https://docs.google.com/document/d/11OM9QCoST9vDMSQ6QAmoWgMkb5MSWeh7y2uCbNwMZwc/edit?usp=sharing\">draft of the member survey</a>. There were a few minor changes when it went into survey form, but nothing major.</li>\n<li>The project that was de-prioritised was a sort of Nordic add-on to 80,000 Hours' career advice. The idea was to identify career paths that seemed comparatively strong or weak in Nordic countries for those who aren't willing or able to relocate to the traditional EA hubs. We also wanted to give location-specific actionable advice on how to follow high-impact career paths in the Nordics. I still think this is a valuable project, but was convinced that focusing on making EA Denmark a more engaging and sustainable community was much more pressing, and so it seemed more valuable to work on first.</li>\n<li>Our prioritisation sheet is probably not suitable for sharing in its current form. It's a mess not designed for other people to understand. As you mention, it's also very context specific. I've pasted an example project into another tab in the sheet Sebastian linked to, though.</li>\n<li>Sure, here are slides for <a href=\"https://docs.google.com/presentation/d/1reU74k6CfXbfXoJJuzCRvBy1OeYiw3dthXsPl9eFArc/edit?usp=sharing\">workshop 1</a>, slides for <a href=\"https://docs.google.com/presentation/d/1GGcfbs8uWP8dfvNzP-vw14FANgcLD3v6h2ZnRP1fXyA/edit?usp=sharing\">workshop 2</a>, and a <a href=\"https://docs.google.com/document/d/1HDlprxxqEiM_w_Qde8D6p5oWdvCqkUDAmHdXcpbmjRE/edit?usp=sharing\">collection of useful resources</a> on the topics. Regarding whether it's possible to replicate: We did these workshops because they were reasonably low-hanging fruits for us. We're both very interested in the topics and have spent hundreds of hours of our personal time learning about them (Sebastian is even co-author of a book on effective learning and personal productivity). However, succesful workshops can probably be carried out with much less effort than that. In those cases, I think the most important things to focus on are, a) encouraging a &quot;hypothesis -&gt; test -&gt; revise hypothesis&quot; approach from the participants to how they want to improve, b) providing at least some inspiration/ideas for forming such hypotheses, and c) making the workshops interactive in the sense that participants form their hypotheses on site and commit to testing them during some time period following the workshop.</li>\n<li>Regarding batches: Many of our projects were running simultaneously since we couldn't just do the most important project, finish it, and move on down the list. Often we had to wait for answers to surveys or feedback from others, so we had to do the 2nd or 3rd most important project during the downtime. Say you can commit to 1000 hours of work on Yale EA stuff. What we're advocating here is that you don't start 1000 expected hours worth of projects all at once, but instead start with a batch of, say, 2-300 expected hours worth of projects. The two main reasons for this are to combat planning fallacy and to give yourself a chance to update your priorities after the first batch.</li>\n</ul>\n<p>Hope that helped. Feel free to ask anything else!</p>\n", "parentCommentId": "uaEXpFdjhMsv3zzwR", "user": {"username": "philip_porter"}}, {"_id": "KitcXhHCD24ERaQ4t", "postedAt": "2018-09-28T17:23:50.993Z", "postId": "a9KpNLWpSKt9LxpRp", "htmlBody": "<p>The group grew organically by maybe a handful of members, but growth wasn't a priority for us in the work we did. Instead, we focused on boosting retention and enabling our current members. EA Denmark now has a new growth-focused workgroup. Hopefully, the results of that group's work will play nicely together with the work Sebastian and I did during our grant period.</p>\n", "parentCommentId": "CWrezoo9ahJSqH8wp", "user": {"username": "philip_porter"}}, {"_id": "E4CHEJ3FBGhEZJ87L", "postedAt": "2018-10-08T12:18:08.558Z", "postId": "a9KpNLWpSKt9LxpRp", "htmlBody": "<p>Thanks for this helpful post!\nI'm currently running EA Berlin on a part-time grant and was wondering about your thoughts on work groups, since we do a bunch of project-based work that might fit with that. Was &quot;sparking workgroups&quot; something of a side-effect or did you actively encourage that? Do members run them independently, or do you support them, and how?</p>\n", "parentCommentId": null, "user": {"username": "Ronja_Lutz"}}]