[{"_id": "CcPF45jbMeqde5Xcp", "postedAt": "2023-11-14T19:24:58.081Z", "postId": "A9o4EjFbPcgfsFtMx", "htmlBody": "<p>Regarding \"Sprout EAs\": In the world of law school admissions, it's common to see the term \"KJD\" to refer to someone who is applying to law school directly after college—in other words these people have continued their formal education in an unbroken line from <strong>K</strong>indergarten to <strong>J</strong>uris <strong>D</strong>octor --&gt; KJD.</p><p>Maybe you could use a similar term instead of \"Sprout EAs,\" like \"KEA\". I'm aware that it's not a significant improvement, just throwing it out there!</p>", "parentCommentId": null, "user": {"username": "Calum"}}, {"_id": "DLyHp3iBLhdh3hjZ3", "postedAt": "2023-11-14T20:05:33.941Z", "postId": "A9o4EjFbPcgfsFtMx", "htmlBody": "<p>How about “early-start EA (EEA)”? As a term, could sit neatly beside “highly-engaged EA (HEA)”.</p>\n", "parentCommentId": null, "user": {"username": "romanhauksson"}}, {"_id": "KdadNG2yc2yMBeLnw", "postedAt": "2023-11-15T12:27:41.014Z", "postId": "A9o4EjFbPcgfsFtMx", "htmlBody": "<p><strong>Executive summary</strong>: The post outlines two potential pitfalls when building community among young people in effective altruism: 1) Difficulty leaving EA due to youth and uncertainty, and 2) EA filling unintentional roles in young peoples' lives.</p><p><strong>Key points</strong>:</p><ol><li>Young people may stay in EA due to status quo bias and EA's ability to offer career paths, meaning, and community. This may prevent valuable \"off-boarding.\"</li><li>EA can fill holes in young peoples' lives in unintended ways. This could lead some to accept suboptimal jobs or personal costs in pursuit of EA alignment.</li><li>Some may overoptimize on \"getting an EA job\" without internalizing EA principles. This could erode epistemic rigor over time.</li><li>Worth considering if these dynamics factor into outreach to youth and university students. How to encourage reflection on if EA meets personal needs beyond stated goals.</li><li>Advice-givers should consider potential biases and pressures those new to EA may face. Highlight options beyond explicit EA alignment.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "7m7RkXi8iHWCvajqN", "postedAt": "2023-11-15T14:17:00.186Z", "postId": "A9o4EjFbPcgfsFtMx", "htmlBody": "<p>Hi Frances,<br>thanks for putting this out here, I enjoyed reading it as another Community Builder and someone who works on Community Health.&nbsp;<br>I'll give my opinions to your questions (as I don't think of these as answers). I'd be keen to read what you think :)&nbsp;<br><br>1. I can't really speak for programs reaching high schoolers, these don't currently exist in Germany. If they did, I'd want to thoroughly lace them with lots of messages about making sure to explore others paths, opinions, ideas than just EA, and having friends that don't have anything to do with EA.&nbsp;<br>For our regular outreach at universities: Our young team in Germany has taken the general attitude of developing EA as a professional environment with space for personal connection. But the focus lies on professional networking, learning and mentorship. Plus, I personally recommend and encourage people that I speak to to have non-EA friends, try out non-EA work environments, and learn from non-EA sources. I think that's one way to avoid filling a hole and get people to lock into the EA system for fear of changing gears.&nbsp;<br><br>2. I would say a mix of both. EA is a system (with the informal hierarchies and emphasis on networking, and an express focus on ambition) that is imo more likely than other systems to create people looking to stay \"inside\", or getting burnt out while trying to prove themselves. I think recent efforts to professionalize the movement more are one way of guarding against this.&nbsp;<br><br>3. Advice for younger people (all this is pretty basic, but I think important to stress especially with the non-conforming people we often attract):</p><ul><li>Follow simple rules about work, like: Don't accept work without a contract, maintain a degree of separation between work and private life, take breaks &amp; vacations to recharge.</li><li>Make sure to explore at the start of your career, and explore outside of EA too.&nbsp;</li><li>Find a mentor with more work experience than you, ideally in the field you aspire to enter.&nbsp;</li><li>This is a marathon not a sprint. If you want to make an impact with your career, make sure you can sustain one for 30-odd years.</li><li>Most of us are still pretty young and in the process of figuring it out. Some of the work culture at central EA orgs might change over time as people age and mature.</li></ul>", "parentCommentId": null, "user": {"username": "Milena Canzler"}}, {"_id": "vSekdpjYGMgJxTWbg", "postedAt": "2023-11-18T01:46:38.349Z", "postId": "A9o4EjFbPcgfsFtMx", "htmlBody": "<p>Strongly endorse this post. I &nbsp;came to the EA movement relatively late in life. And I notice that A LOT of younger EAs are really invested in getting an EA org job, to an extent that makes me uncomfortable. I think this is actually unhealthy for the movement, not just the individuals. But there's an incentives problem, where the orgs all say \"no, people should apply even though it's super-competitive; let us make the decision about who's the best fit\", and that really is optimal from the narrow perspective of that org. But especially given the time commitment required to put together a serious application, it doesn't really account adequately for all time being wasted by unsuccessful job applicants. I can't blame the orgs for following their incentives, but those of us with a more neutral perspective should probably somewhat discourage the current levels of persistence in applying to EA org jobs, and/or encourage EA orgs to use less time-consuming hiring processes.&nbsp;</p><p>&nbsp;</p><p>A few years ago I told a college-aged EA that I would be inconvenienced but not devastated if the movement collapsed, because as much as I enjoy being a part of it and having people to collaborate with or even just share ideas with, the underlying principles and not the movement are the thing that really matters, and I would still do my best to live up to the principles even if I had to do it all alone. This person was visibly offended by my comment. That's not a healthy response, and I've been worried about the young'uns ever since.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Bluefalcon"}}, {"_id": "WEwyHbpNpGov9q7n2", "postedAt": "2023-11-18T22:24:13.560Z", "postId": "A9o4EjFbPcgfsFtMx", "htmlBody": "<blockquote>\n<p>the underlying principles and not the movement are the thing that really matters</p>\n</blockquote>\n<p>I think both matter a lot. I want the principles to be acted upon, and in a coordinated fashion.</p>\n", "parentCommentId": "vSekdpjYGMgJxTWbg", "user": {"username": "SiebeRozendal"}}]