[{"_id": "TiusJXKquoEGzsRMP", "postedAt": "2023-03-16T00:38:02.650Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>\"Co-writing with&nbsp;Julia&nbsp;would be better, but I suspect it wouldn't go well. While we do have compatible views, we have very different writing styles, and I understand taking on projects like this is often hard on relationships.\"</p>\n<p>Perhaps there are ways of addressing this. For instance, you could write separate chapters, or parts; or have some kind of dialogue between the two of you. The idea would be that each person owns part of the book. I'm unsure about the details, but maybe you could find a solution.</p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "9YNMk5PJuinmHKktr", "postedAt": "2023-03-16T00:50:59.522Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>Yes this was my thought as well. I'd love a book from you Jeff but would really (!!) love one from both of you (+ mini-chapters from the kids?).</p><p>I don't know the details of your current work, but it seems worth writing one chapter as a trial run, and if you think its going well (and maybe has good feedback) considering taking 6 months or so off.</p>", "parentCommentId": "TiusJXKquoEGzsRMP", "user": {"username": "HaydnBelfield"}}, {"_id": "umisKvfH6HgMrxtaf", "postedAt": "2023-03-16T01:36:50.210Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<blockquote><p>Yes this was my thought as well. I'd love a book from you Jeff but would really (!!) love one from both of you (+ mini-chapters from the kids?).</p></blockquote><p>+1.&nbsp;</p><p>The \"mini-chapters\" idea made me think of <a href=\"https://forum.effectivealtruism.org/posts/moN5Ykv3eFMwHiigj/candy-for-nets\">Candy for Nets</a>.</p>", "parentCommentId": "9YNMk5PJuinmHKktr", "user": {"username": "Pablo_Stafforini"}}, {"_id": "CQx7NPS6b9YAipD5a", "postedAt": "2023-03-16T02:29:04.320Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>Would love a book like this to exist, and you'd be a great author of it (and Julia too!) :)</p>", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "o8AtgshbsyPuag5iG", "postedAt": "2023-03-16T02:35:50.552Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I would love to read a book written by you. I've enjoyed many of your blog posts.</p><p>Aside from my own reading preferences, I think it would be very nice to have a book written about EA &nbsp;ideas (broadly described) by someone who is not a philosophy professor, and which focuses more on the mundane aspects of everyday life, rather than distant and abstract moral aspirations.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "HheeMu4i7QHm8RLJK", "postedAt": "2023-03-16T03:29:41.980Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>It sounds brilliant. Good luck!</p>\n", "parentCommentId": null, "user": {"username": "rharris"}}, {"_id": "2nJEdLWASRpbMibiK", "postedAt": "2023-03-16T10:51:47.873Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I am fully supportive of more books coming out on EA related topics. I've also always enjoyed your writings.&nbsp;<br><br>As someone trying to write a book about the threat of AI for a broader audience, I've learned that you should have a good idea of your goal for the book's distribution. &nbsp;Meaning, is your goal to get this published by a publisher?<br>Or self-publish? &nbsp;An eCopy or audiobook?<br><br>To get something published, you typically need an agent. To get an agent you usually need a one-page pitch, a writing sample, and perhaps an outline.&nbsp;<br><br>If no agent is interested, it is a risk to write the book if you want a third party to publish it.&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Darren McKee"}}, {"_id": "9wLjpo2RWdWK2k2py", "postedAt": "2023-03-16T12:40:52.750Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I'm not sure if this fits your concept, but it might be helpful to have a guidebook that caters specifically to new EAs, to help give guidance to people excited about the ideas but unsure how to put them into practice in daily life, in order to convert top of funnel growth into healthy middle of funnel growth. This could <em>maybe</em> couple with a more general audience book that appeals to people who are antecedently interested in the ideas.</p>\n<p>A couple things I'd like to see in this are the reasoning transparency stuff, guidance on going out and getting skills outside of the EA community to bring into the community, anti-burnout stuff, and various cultural elements that will help community health and epistemics.</p>\n", "parentCommentId": null, "user": {"username": "tylermjohn"}}, {"_id": "mbAHzqhZPL38yGaRP", "postedAt": "2023-03-16T13:18:12.550Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I'm not familiar with your work so far, but there definitely is room for developing and advertising \"EA for Normal People\".\nI think there's value in addressing the very practical problems of doing EA: it's weird, it can be expensive, it's hard to stay motivated, the community is brainy, people won't believe your motivations, you have many existing commitments already.</p>\n<p>I think the book might benefit from focusing on a target audience.</p>\n<p>As a prolific writer of blogs, you seem to be in a very good position to also write a book.\nGood luck!</p>\n", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "jTRrbEKMugo9TDuHG", "postedAt": "2023-03-16T14:04:44.383Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>You asked whether you should spend time on this book <i>at the expense of going part time on your job</i>, i.e. you raised the question of the opportunity cost.</p><p>In order to assess that, we need to work out a Theory of Change for your book. Is it to support people interested in doing good, and helping them to be more effective? In that case it would be useful to see your model for this:</p><ul><li>What's your forecast for the number of people buying your book?<ul><li>What's the shape of your distribution on that? E.g. is there a fat tail on the possibility that it will sell very well?&nbsp;</li></ul></li><li>What proportion of readers do you expect would change behaviour as a result of reading your book?</li><li>How should you adjust that for counterfactuals? (i.e. what proportion of those people would have ended up reading TLYCS or DGB or something else instead?)</li><li>How valuable is a counterfactual-adjusted reader who changes their behaviour?</li><li>How much of your time needs to be given up in order to achieve these outcomes?</li></ul><p>I suspect that the cruxiest of the above questions will probably be the one about counterfactuals. Will you have a marketing strategy that enables you to reach people who would not have ended up reading another EA book anyway?</p><p>If not, my not-carefully-thought-through intuition is that it would be better for you to focus your time on your day job (assuming it's high impact, which, from memory, I think it is). Which is a shame, because I would have liked to see your book!</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "gyBmeHF4kHBPT6fXj", "postedAt": "2023-03-16T14:56:59.548Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I love the idea of a book about practical everyday altruism, and I think you absolutely have the stories to back it up!</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "BFryjBzkMe7zz3xMp", "postedAt": "2023-03-16T16:03:08.170Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>While people reading the book changing their altruistic behavior in ways that counterfactually improve the world is one way I see this book being valuable, I think a larger component of its value would be via people better understanding what EA is about, and what EAs are doing and why.  As above:</p>\n<blockquote>\n<p>Existing EA writing is also generally aimed at an elite audience. I see why some people have decided to take that approach, but I also think it's really important to have a presentation of these ideas grounded in common sense. If we ignore the general public we leave EA's popular conception to be defined by people who don't understand our ideas very well.</p>\n</blockquote>\n<p>How people who don't decide to get into EA view EA approaches to the world matters, and I think we've been neglecting this.  I'm concerned about a growing dynamic where we're increasingly misunderstood, people who don't actually substantively disagree with us reflexively counter EA efforts, and people who would find EA ideas helpful don't engage with them because their osmosis-driven impression of EA is mistaken.</p>\n", "parentCommentId": "jTRrbEKMugo9TDuHG", "user": {"username": "Jeff_Kaufman"}}, {"_id": "JcqgxnwSrRJxgz2MT", "postedAt": "2023-03-16T16:36:30.112Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>Jeff -- I think this is a wonderful idea for a book, and I'd strongly encourage you to do this.</p><p>If the focus was on 'EA for ordinary parents and families', I think you could reach a lot of people.</p><p>In particular, you could offer a lot of solace and reassurance to busy parents that a lot of the the stuff they've been told that they <i>should</i> worry about ethically (e.g. recycling, updating gas to electric cars, donating food to local shelters, getting a rescue dog, partisan national politics, etc) doesn't actually matter very much in the grand scheme, and that there are a lot of much higher-impact things they could be doing that might actually take less time and money.</p><p>In other words, for a family to 'turn EA' doesn't necessarily load them with a heavier moral burden; it might actually lighten their moral guilt if they were much more informed and scope-sensitive, and chose their moral battles more wisely.</p><p>(Consider just the issue of what to feed a family -- if you could explain that if you're worried about animal suffering, you don't have to force kids to turn full vegan; even just switching from eating chicken and small fish to eating pastured grass-fed beef could reduce animal suffering very effectively, and &nbsp;they can offset by donating a little bit to Vegan Outreach. This might lead parents to feel much less moral guilt about what they feed their kids -- and it might actually reduce animal suffering more than 'trying to be vegan' (which often, sadly, involves switching from beef to chicken).&nbsp;</p><p>I think an EA perspective could also help families better handle any misplaced eco-guilt they might have about having kids in the first place, 'contributing to overpopulation', 'burdening the planet', 'contributing to global warming', etc. This could get a bit into population ethics, but it doesn't really need to -- it could just involve reassuring parents that kids are future intellectual and moral resources for fighting against climate change and protecting the ecosphere; they're not just costs imposed on the planet.</p><p>In terms of co-authoring with Julia, bear in mind that co-authorship (especially with spouses) doesn't need to be a 50/50 effort; it can involve one author doing 90% of the initial draft, and the other adding their notes, edits, expansions, feedback, and guidance. As long as both people agree they contributed significantly to the book (and their agents, editors, &amp; publishers agree too, which they will), they can both be co-authors. And I think it adds credibility for a married couple to present a book for couples and families.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "T7NnCv9eQKZXGmLze", "postedAt": "2023-03-16T18:10:22.810Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I wonder if you could reduce the opportunity cost by farming out some of the background labor to (for lack of a better term) a research assistant? Seems like that might be a useful investment (depending on funding) to maximize your productivity and minimize time away from your object-level job.</p>\n", "parentCommentId": "BFryjBzkMe7zz3xMp", "user": {"username": "Jason"}}, {"_id": "CoxdyzeP8mNwdBiTh", "postedAt": "2023-03-16T18:37:57.172Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>Yes. <i>The Life You Can Save </i>and <i>Doing Good Better</i> are pretty old. I think it's natural to write new content to clarify what EA is about.</p>", "parentCommentId": "BFryjBzkMe7zz3xMp", "user": {"username": "Stefan_Schubert"}}, {"_id": "KZsQ5JuJ8omniCNta", "postedAt": "2023-03-17T01:03:14.084Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>Personally, I would not do this to my marriage.</p>\n", "parentCommentId": "TiusJXKquoEGzsRMP", "user": {"username": "justsaying"}}, {"_id": "5xLH6joYn5Xy8RSfT", "postedAt": "2023-03-19T21:26:08.179Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>You might want to check out <a href=\"https://www.amazon.com/New-Map-Relationships-Creating-Planet/dp/0997492317\">this </a>book on on the analogies between a personal relationship and the relationships between countries (focusing on nuclear war) by a husband and wife team.</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "6ndLcLmhyrQDtEf6K", "postedAt": "2023-03-20T03:47:19.098Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I would state that last paragraph even more strongly: my hypothesis is that the views about EA held by people who will never decide to get into EA will ultimately have a larger effect on how EA impacts the world (both in magnitude and in direction) than the views of people who are already a part of EA communities today.</p><p>General-public perception of a group pre-filters the types of people who engage with curiosity toward that group’s ideas, and I think that could be a strong enough force to make my prediction true on its own. &nbsp;I also think that general public reputation for a group can affect the types of opportunities that the group can access for acting upon their ideas, which might particularly shape the actual activities of a community that largely focuses on each person’s highest impact opportunities.</p>", "parentCommentId": "BFryjBzkMe7zz3xMp", "user": {"username": "Lucas S."}}, {"_id": "ymKhCXpp37BEyvdtx", "postedAt": "2023-03-20T09:17:04.294Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I think it's a great idea. My intuition is that you ought to exaggerate what makes your work different from the existing EA canon. For example, you might want to be <i>much</i> more accessible than the works put out by moral philosophers. To this end,<strong> I suggest partnering with someone with a track record publishing pop-science, self-help or similar</strong>.</p><p>It doesn't mean you have to water down EA ideas. But it would probably mean distilling the essence of EA thought into a few clear principles, which can then use to illustrate why EA leads to various conclusions.</p><p>For example (off the top of my head) your principles might be:</p><ul><li>The outcomes are what matters (consequentialism)</li><li>Do your best with the information available (Bayesian thinking)</li></ul><p>Then, in your chapter on personal consumption choices, you can show <i>why </i>(to borrow Geoffrey Miller's example) transitioning from chicken to grass-fed beef, with an offset donation to Vegan Outreach (a bewildering choice to most people) stems from the principles.</p><p>In short, you should aim to be accessible, but not one of those books that you have to flick back through to find the answers to each of life's questions. Readers should be left with a clear and lasting grounding in the basics.</p><p>While I'm writing about setting yourself apart from the EA canon, I feel I should point out the obvious - women, especially mothers, are not well-represented among EA authors. If you can find some way to productively collaborate with Julia, you should.</p><ul><li>On purely pragmatic grounds, having a female name on the cover will affect the readership</li><li>Poor representation is plausibly linked to increased attrition (I see the <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4943602/\">higher rates of attrition</a> among women studying math as an example of this)</li><li>Parenthood, which is essentially a lifelong commitment to favour your child over others, urgently needs discussing in the context of EA, especially by those who are both EA and parents.</li></ul>", "parentCommentId": null, "user": {"username": "Stan Pinsent"}}, {"_id": "ouCuFrEeDESNv3WMa", "postedAt": "2023-03-22T06:41:09.832Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>A late addition to this thread, but a potential name just popped into my head: 'Reasonably Good'. I like this because 'reasonably' captures two meanings here; 'being reasonable' (using reason and evidence to do good), but also 'reasonably good' in the sense of being okay with imperfection/ tradeoffs, and focusing pragmatically on the biggest wins rather than being paralysed with guilt and moral overwhelm.</p><p>Just a thought!</p>", "parentCommentId": null, "user": {"username": "Conor McCammon"}}, {"_id": "aXD2YmtGYmai6nkkK", "postedAt": "2023-03-22T16:47:46.649Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I like it!</p>\n", "parentCommentId": "ouCuFrEeDESNv3WMa", "user": {"username": "Jeff_Kaufman"}}, {"_id": "qsdYFdf57zKLpcATJ", "postedAt": "2023-03-22T18:24:29.291Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>I'd like to read this book!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Molly"}}, {"_id": "wJipcdZS6E6BhwsB3", "postedAt": "2023-03-24T00:35:34.603Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>Based on my own experience of writing a book on college scholarship strategies for low-income students, I think you could write a &lt; 200-page book fairly quickly, perhaps in &lt;2 hours a day for 40-60 days, especially since you already have a lot of writing material to pull from. (I wrote my 120-page book in a month by writing 1200 words every single weekday, about 1.5 hours of writing daily.) I used an accountability program led by a self-help author. One trick to quicken the process is to take a week to create a REALLY detailed table of contents so there's complete clarity about what you (and your coauthors) need to write next.</p><p>I think there are a number of 80% solutions that are far better than this wonderful future book not happening at all. You could probably get an EA grant to either take a month off to write it or perhaps even a ghostwriter to compile 40% of the book from your blog posts based on your detailed table of contents.</p><p>If you're open to self-publishing, you could give that 40-60 day messy first draft over to an intensive editing service at a cost of $4k-$5k. While I opted for self-publishing to update/edit it after it's live and to set the book at a lower price, a publisher would probably make this way easier with marketing and in-house editing.&nbsp;</p><p>Happy to answer more questions. I'll also potentially be making a tiny publishing LLC to publish my book that will have an EA-like name which you're free to use to buy your ISBN if you want to also self-publish.</p>", "parentCommentId": null, "user": {"username": "abiolvera"}}, {"_id": "ig4HAhviawvBQaMtp", "postedAt": "2023-04-25T19:40:20.496Z", "postId": "aBp2AozoGExn8rMwb", "htmlBody": "<p>Update: right around when I posted this my <a href=\"https://forum.effectivealtruism.org/posts/QhZPrN2kkFv4S3YSg/prevalence-to-relative-abundance\">work changed</a> in a way that really increased the opportunity cost of taking time to write, so I haven't been working on this.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}]