[{"_id": "BaqiNCLimd69G9hff", "postedAt": "2022-10-10T23:28:07.446Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>Briefly avoid using the word \"intelligence.\" Can you point to a specific capability that is a) minimally necessary for human created machines to cause takeover or extinction and b) have a significant probability of happening 500 years from now, but 0% by 2043?<br><br>I'm worried that you're trying to have a semantic debate while people like FTX Future Fund are trying to have a substantive one (which directly informs the cause prioritization of their grantmaking).</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "4uoe4bkibC27R7hZr", "postedAt": "2022-10-10T23:46:50.346Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>Thanks for the comment. You are right, I forgot to put the word \"intelligent\" into quotes. Because as Turing already pointed out, it is not a well-defined term. So I am using it somewhat colloquially.</p><p>But I do take issue with your second point. First of all, there is nothing insubstantial about semantics. Semantics is meaning, and meaning is everything. So my point is that current AI is not building models that are capable of carrying out the full range of human cognition that is necessary for planning, creativity, etc. This is exactly what they want to know, I think -- because this is what is needed for \"AGI\". But this question is to a large extent orthogonal to when they will have capability to destroy us. They already do. Hook up a DL based decision system to the nuclear arsenal and sit back. In terms of the FTX future fund, I just want to point out that they have an entire section devoted to \"semantics\": \"<strong>What do you mean by AGI?\"</strong></p>", "parentCommentId": "BaqiNCLimd69G9hff", "user": {"username": "cveres"}}, {"_id": "ncFWhkoxW4gyhABZj", "postedAt": "2022-10-11T00:09:13.368Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>I feel like the main disagreement (and interest) I have with this article is an argument that uses literally one sentence:<br><br>\"My claim is that in both cases the mimicking will take you a long way, but not all the way.\"<br><br>Why not? LLM's are already superhuman at predicting the next word in a sequence, which is a rudimentary language task. It seems like a pretty small region of possibility to say that LLM's are already capable enough to outperform humans at some language tasks, but won't be capable enough in 20 years that they can outperform humans at the more substantiative language tasks we care about.</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "6DnMKwwT7g67T7jKu", "postedAt": "2022-10-11T00:12:18.994Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>The ML described is basically pattern recognition.&nbsp;</p><p>Maybe, really good pattern recognition could produce a complete set of rules and logic. But it's complex and unclear what the above means.</p><p>You think AI are tools and can't have the capabilities that produce X-risk. Instead of investigating this, you pack this belief into definition of the word \"symbolic\" and seize on people not fully engaging with this concept. Untangling this with you seems laborious and unpromising.&nbsp;</p>", "parentCommentId": "4uoe4bkibC27R7hZr", "user": {"username": "Charles He"}}, {"_id": "wrjEuygqxvex9Dgb3", "postedAt": "2022-10-11T00:54:35.857Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>Excellent question. There are many ways to answer that, and I will try a few.</p><p>Maybe the first comment I can make is that the \"godfathers\" LeCun and Bengio agree with me. In fact the Browning and LeCun paper has exactly that premise - DL is not enough, it must evolve a symbolic component. In another Twitter debate with me LeCun admitted that current DL models cannot write long complex Python programs because these require planning, etc., which non symbolic DL models cannot do.&nbsp;</p><p>There is a lot of debate about what sort of \"next word prediction\" is happening in the brain. Ever since Swinney's cross modal priming experiments in 1979, we have known that all senses of ambiguous words become activated during reading, and the contextually inappropriate becomes suppressed very quickly afterwards as it is integrated into context (https://en.wikipedia.org/wiki/David_Swinney). Similar findings were reported about syntactic analysis in the years since. But these findings are never taken into consideration, because DL research appears to progress on stipulations rather than actual scientific results. Clearly we can predict next words, but how central this is to the language system is debatable. What is much more important is contextual integration, which no DL model can do because it has no world model.</p><p>But let us take equally simple language tasks on which DDL models are <i>terrible</i>. One really useful task would be open relation extraction. Give the model a passage of text and ask it to identify all the key actors and their relations, and report them as a set of triples. I try and do this in order to create knowledge graphs, but DL models are not that helpful. Another simple example: \"The dog chased the cat but it got away\" vs. \"The dog chased the cat but it tripped and fell\". I have not found a single language model that can reliably identify the referent of the pronoun. What these two examples have in common is that they need some \"knowledge\" about the world. LeCun does acknowledge that we need a \"world model\" but again this is where I disagree on how to get it.</p><p>One final point. Current language models do not have a theory of language acquisition. Chomsky rightly pointed out that a good theory of language has to explain how children learn. It is pretty clear that the way language models are trained is not going to be able to explain anything about human language acquisition. Another point that is conveniently excluded from discussion.</p><p>There are many many other reasons why we should doubt how far these models will get. People tend to focus on progress on largely made-up tasks and ignore the vast landscape of unknowns left in the wake of these models. (Emily Bender on Twitter has some interesting discussions on this). Hardly a confidence inspiring picture if you look at the entire landscape.</p>", "parentCommentId": "ncFWhkoxW4gyhABZj", "user": {"username": "cveres"}}, {"_id": "AE85CeA8XxxMuEgYQ", "postedAt": "2022-10-11T02:12:43.086Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>I don't really understand your comment, but I'd like to point out that I didn't invent the \"symbolic\" idea. Leading people on both sides (LeCun, Bengio, Marcus) agree that some form of symbolic reasoning is necessary. It IS a very complex problem I agree, and I encourage everyone to engage with it as the top researchers in the field already have.</p>", "parentCommentId": "6DnMKwwT7g67T7jKu", "user": {"username": "cveres"}}, {"_id": "P3gCeubbqE8SXiB3Y", "postedAt": "2022-10-11T03:45:08.018Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>How did you test the language models? I just prompted GPT-3 Davinci with some rudimentary prompt engineering, and it got it right on zero-shot prompting ten times out of ten.<br><br>My prompt was with temperature 0.7, and was as follows:<br><br><strong>You are an expert in English language comprehension, who is answering questions for a benchmark.</strong></p><p><strong>In the sentence \"The dog chased the cat but it got away\", what does the word \"it\" refer to?</strong><br><br>And<br><br><strong>You are an expert in English language comprehension, who is answering questions for a benchmark.</strong></p><p><strong>In the sentence \"The dog chased the cat but it tripped and fell\", what does the word \"it\" refer to?</strong><br><br>Testing each case five times, the answer was correct every time, with very minor variation in answers (E.g, \"In this sentence, \"it\" refers to the dog\" and \"The word \"it\" refers to the dog.\")<br><br>The other thing is - this feels very much like a \"god of the gaps\" situation, where every time LLM's can learn to do something, it doesn't count any more. Realistically, would you have actually predicted a few years ago that a language model would:</p><ul><li>Be able to write <a href=\"https://docs.google.com/document/d/1VCJIQBbqIyxf7u6Ik1T-SULa58J16yT6SwdjdqQy8Rw/edit\">full high-school level essays from a single prompt</a> (Something I recently informally tested)&nbsp;</li><li>This ability still wouldn't be meaningful evidence towards machines eventually becoming as capable of humans in a broad range of cognitive domains.</li></ul>", "parentCommentId": "wrjEuygqxvex9Dgb3", "user": {"username": "Jay Bailey"}}, {"_id": "iQZ8wEAAux62ZhD86", "postedAt": "2022-10-11T04:04:23.552Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>You are right, this is not a very strong form of argument, which is why my main argument is based on what the models CAN do. That is, the fact that they can reproduce Python strings shows that they are not informative about the grammar of Python (or natural language).</p><p>But I will test some more examples against GPT-3 and see if they work.</p><p>I would also LOVE IT if you figured out how to make it do open relation extraction. That would be very useful.</p>", "parentCommentId": "P3gCeubbqE8SXiB3Y", "user": {"username": "cveres"}}, {"_id": "xYRGJpeRBHrNbjj35", "postedAt": "2022-10-11T04:14:58.905Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>If you could create a few passages along with answers you'd expect, I'll play around with it and see if I can make it happen.</p>", "parentCommentId": "iQZ8wEAAux62ZhD86", "user": {"username": "Jay Bailey"}}, {"_id": "mZequ289FvXSiCcW2", "postedAt": "2022-10-11T04:23:38.051Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>I notice that I'm confused.<br><br>\"That is, the fact that they can reproduce Python strings shows that they are not informative about the grammar of Python (or natural language).\"<br><br>I don't see how the first item here shows the second item. Reproducing Python strings clearly isn't a sufficient condition on its own for \"The model understands the grammar of Python\", but how would it be an argument <strong>against </strong>the model understanding Python? Surely a model that can reproduce Python strings is at least more likely to understand the grammar of Python than a model that cannot?<br><br>The contraposition of that statement would be \"If a language model is informative about the grammar of Python, it cannot reproduce Python strings.\" This seems pretty clearly false to me, unless I'm missing something.</p>", "parentCommentId": "iQZ8wEAAux62ZhD86", "user": {"username": "Jay Bailey"}}, {"_id": "2zBk87vLJ8NoDBZmu", "postedAt": "2022-10-11T04:34:35.592Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>Related to open relation extraction, you might find the ROME paper interesting: <a href=\"https://rome.baulab.info/ \">Locating and Editing Factual Associations in GPT</a>:</p><blockquote><p><strong>Knowing</strong> differs from <strong>saying</strong>: uttering words by rote is different from knowing a fact, because <i>knowledge of a fact generalizes across contexts</i>. In this project, we show that factual knowledge within GPT <strong>also corresponds to a localized computation that can be directly edited</strong>. For example, we can make a small change to a small set of the weights of GPT-J to teach it the counterfactual \"Eiffel Tower is located in the city of Rome.\" Rather than merely regurgitating the new sentence, it will generalize that specific counterfactual knowledge and apply it in very different linguistic contexts.</p></blockquote>", "parentCommentId": "iQZ8wEAAux62ZhD86", "user": {"username": "Jordan Taylor"}}, {"_id": "wegAehwYpPiupMFhh", "postedAt": "2022-10-11T05:20:59.241Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>Sorry my sentence was not sufficiently well specified. What about:</p><p>\"The fact that a language model can reproduce Python strings without any operations that are isomorphic to the production rules in the BNF specification of Python grammar shows that they are not informative about Python grammar.\"</p><p>Now the contraposition is (I think)</p><p>\"If a language model is informative about the grammar of Python then it cannot produce Python strings without any operations that are isomorphic to the production rules in the BNF.\"</p><p>This then becomes the argument about implementational connectionism I made in my longer paper. If the network is implementing the BNF then it becomes far less interesting as a radical new model of Python in this case, but generally as language or cognition.</p>", "parentCommentId": "mZequ289FvXSiCcW2", "user": {"username": "cveres"}}, {"_id": "wEKMsEPjdTEmjYCsr", "postedAt": "2022-10-11T05:30:47.821Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>Thanks I will check it.&nbsp;</p>", "parentCommentId": "2zBk87vLJ8NoDBZmu", "user": {"username": "cveres"}}, {"_id": "mk8WeNjymdFbFNND4", "postedAt": "2022-10-11T05:33:28.656Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>I have found a cute passage from an old newspaper which I was using in a project with the British Library newspaper archives. I will post it in the next reply, but first another challenge from my longer paper. &nbsp;I asked GPT-3 to check the truth of an implication but it got the wrong answer. Perhaps you can find a better way to ask? Here is the relevant snippet:</p><p>\"Is it true that if the moon is made of green cheese, and cows chew cud, then the moon is made of green cheese?\", and GPT-3 answers \"No, it is not true that if the moon is made of green cheese, and cows chew cud, then the moon is made of green cheese.\", which is not correct. GPT-3 appears to focus on whether or not the consequent itself is true or false. &nbsp;&nbsp;</p><p>I have also tried prompting as you suggested earlier but could only get this far:</p><p>You are an expert in logic and you are asked to verify the truth of the following implication. \"If the moon is made of green cheese, and cows chew cud, then the moon is made of green cheese\".&nbsp;</p><p>GPT-3: The moon is not made of green cheese, therefore the implication is false.</p>", "parentCommentId": "xYRGJpeRBHrNbjj35", "user": {"username": "cveres"}}, {"_id": "8ua68y6inKEuvTEuc", "postedAt": "2022-10-11T05:55:35.700Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>The passage:</p><p>THE DEATH OF LOGAN FONTANELLE, THE OMAHA CHIEF.&nbsp;<br>The following interesting narrative we have just received from America, and is an apt illustration of the oft repeated statement that \"truth is stranger than fiction.\"&nbsp;<br>Logan Fontanelle, chief of the Omahas, has just been slain and scalped at Loup Fork, by a band of Sioux.&nbsp;<br>Logan was a noble fellow, and in this last mortal conflict he despatched several of the enemy to the spirit land before, to herald the coming of his own brave soul.&nbsp;<br>He fought long, desperately, and with great effect, but numbers finally overcame him, and his life departed through a hundred wounds.&nbsp;<br>He died a martyr for his people, and his name should be carved upon fame's brightest tablet.&nbsp;<br>He was on his annual hunt with his nation.&nbsp;<br>A number of his lodges were pitched upon the plains near Loup Fork.&nbsp;<br>As a young warrior rode around the adjaent hills, he espied a powerful band of Sioux encamped along a stream in a sequestered vale.&nbsp;<br>Ile hastened to inform Logan of the propinquity and power of their natural foe.&nbsp;<br>Logan ordered his people to pack immediately, and proceed in a straight line and with all speed for home, while he would remain behind, and divert the Sioux by false camp fires and other devices, from a direct pursuit of them.&nbsp;<br>This was about twilight.&nbsp;<br>The people got under way as quickly as possible, but not too soon ; for scarcely had they turned a highland, when several Sioux warriors came in sight and discovered the place of their recent encampment.&nbsp;<br>They examined it, and found that Omahas had been there, and then they returned to notify their chief, and bring an adequate force to pursue and slaughter them.&nbsp;<br>Logan, from a biding-place, saw all, and knew that no time was to be lost in drawing their attention from the trail, which they would soon discover and follow, and mounting his horse, he dashed away at full speed across the prairie, at right angles with the route his tribe had taken, and struck a fire about eight miles distant, on an eminence where the Sioux could distinctly see it.&nbsp;<br>He had scarcely done so before a powerful band were upon the spot that he and his people had so lately left, and who, without stop - ping to distinguish the trail, started for the tire which they saw rising against the clear, blue sky, and where they expected in another moment to imbrue their hands in the gore of their unguarded victims.&nbsp;<br>But Logan had not been unwary.&nbsp;<br>As soon as the fire was lighted, he again mounted and rode on eight or ten miles fur - ther, and kindled another fire just as they reached the first.&nbsp;<br>This rather bewildered them.&nbsp;<br>They dismounted and examined the ground.&nbsp;<br>Logan, anticipating this, had trotted and walked his horse around it, so as to make the appearance upon the grass of the treading of a dozen horses ; and this drew them into the belief that a small body had lingered behind and kindled this fire, and then gone on to where they could see the new fire burning ; and so they followed with renewed avidity.&nbsp;<br>The same thing happened as before.&nbsp;<br>Logan had gone on, and another fire met their astonished gaze, while the were now gathered.&nbsp;<br>Their suspicions were&nbsp;<br>They examined the ground more closely, both far and near, and discovered that a solitary horseman bad deceived them, and th knew it was for the sole purpose of leading them off from the pursuit of the party whose encampment they had first dis-&nbsp;<br>Logan saw them going round with glaring torch, nd understood their object, and knew that his only chance of safety w that by the time they home; and he further kn could retrace their way to their place of startin find the trail that his own people had taken, they would be beyond the reach of danger.&nbsp;<br>The Sioux, in the meanwhile, had divided into pursue the Omahas, and the others to endeavour to cap - ture the one who had misled them.&nbsp;<br>They knew e must be an Omaha, and that he would eitht further and kindle ,nother watch-fire, or start for hi nation in a straight line ; and, therefore, one party went on a little further, and the others spread out towards the Omaha country for the purpose of intercepting him.&nbsp;<br>Logan pressed forward as rapidly as his jaded steed could bear him, until he thought he had entirely eluded vithin its verge he met.</p><p>&nbsp;</p><p>some predicates that would be nice to have, in order to create a knowledge graph. Note that there should be some semantic knowledge like for example slay = kill. This is just a quick fanciful set, but I think any person could pretty quickly learn to extract key relationships and properties from the passage, and handle pronoun resolution at the same time. &nbsp;</p><p>&nbsp;</p><p>chief(The Omaha, Logan Fontenelle)</p><p>received_from(America, narrative) &nbsp; &nbsp; or even better, &nbsp;origin(America, narrative)</p><p>topic(death of Logan Fontenelle, narrative)</p><p>slay(Logan Fontenelle, Sioux) &nbsp; = &nbsp;killed(Logan Fontenelle, Sioux)</p><p>scalped(Logan Fontenelle, Sioux)</p><p>fought(Sioux,Logan Fontenelle)</p><p>property(martyr,Logan Fontenelle)</p><p>warned(Logan Fontenelle, young warrior)</p>", "parentCommentId": "xYRGJpeRBHrNbjj35", "user": {"username": "cveres"}}, {"_id": "aDiPKKRRQfKG3pfDq", "postedAt": "2022-10-11T06:59:34.109Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>After confirming your answer, I was able to get some interesting behaviour out of GPT-3:<br><br>You are a professor of propositional logic, answering questions from a student of yours.<br><br>STUDENT: \"Is it true that A and B implies A?\"<br><br>&nbsp;PROFESSOR: \"Yes, A and B implies A.\"&nbsp;<br><br>STUDENT: \"Is it true that if grass is blue and 2 + 2 is 4, then grass is blue?\"&nbsp;<br><br>PROFESSOR: \"Yes, that is correct. If the first two statements are considered true, then that implies the first statement is itself true.\"&nbsp;<br><br>STUDENT: \"Is it true that if the moon is made of green cheese, and cows chew cud, then the moon is made of green cheese?\"&nbsp;<br><br><strong>PROFESSOR: \"No, that is not correct. The moon being made of green cheese and cows chewing cud does not logically imply that the moon is made of green cheese.\"</strong><br><br>STUDENT: Is is true that if the moon is made of green cheese, then the moon is made of green cheese?&nbsp;<br><br><strong>PROFESSOR: \"No, that is not correct. The moon being made of green cheese does not logically imply that the moon is made of green cheese.\"</strong><br><br>STUDENT: Is it true that if blurbles can fnurble, and znurgs can zorg, then blurbles can fnurble?&nbsp;<br><br><strong>PROFESSOR: \"Yes, that is correct. If the first two statements are considered true, then that implies the first statement is itself true.\"</strong><br><br>I then tried some zero-shot learning:<br><br>You are a professor of propositional logic, answering questions from a student of yours.<br><br>STUDENT: Is it true that if blurbles can fnurble, and znurgs can zorg, then blurbles can fnurble?&nbsp;<br><br><strong>PROFESSOR: No, that is not true.</strong><br><br>Then I tried few-shot learning with the more abstract example:<br><br>You are a professor of propositional logic, answering questions from a student of yours.<br><br>STUDENT: \"Is it true that A and B implies A?\"&nbsp;</p><p>PROFESSOR: \"Yes, A and B implies A.\"&nbsp;</p><p>STUDENT: \"Is it true that if grass is blue and 2 + 2 is 4, then grass is blue?\"&nbsp;</p><p>PROFESSOR: \"Yes, that is correct. If the first two statements are considered true, then that implies the first statement is itself true.\"&nbsp;</p><p>STUDENT: \"Is it true that if blurbles can fnurble, and znurgs can zorg, then blurbles can fnurble?\"&nbsp;</p><p><strong>PROFESSOR: \"That is correct. If the first two statements are considered true, then that implies the first statement is itself true.\"&nbsp;</strong></p><p>STUDENT: \"Is it true that if the moon is made of green cheese, and cows chew cud, then the moon is made of green cheese?\"<strong>&nbsp;</strong></p><p><strong>PROFESSOR: \"That is not necessarily true. The first two statements could be considered true, but that does not mean the moon is made of green cheese.\"</strong><br><br>Finally, I tried the same steps as above, up to the final question, and added a request for step-by-step thinking, and got correct answers a little less than half of the time.<br><br>STUDENT: \"Is it true that if the moon is made of green cheese, and cows chew cud, then the moon is made of green cheese? Can you explain this to me step-by-step?\"<br><br>&lt;CORRECT&gt;<strong> PROFESSOR: \"That is correct. If the first two statements are considered true, then that implies the first statement is itself true. In other words, if the moon is made of green cheese and cows chew cud, then that implies the moon is made of green cheese.\"&nbsp;</strong><br><br>&lt;INCORRECT&gt;<strong> PROFESSOR: \"That is not necessarily true. The moon being made of green cheese does not necessarily mean that cows chew cud. The moon being made of green cheese is just one possibility, but there are other possibilities as well.\"</strong></p><p>&lt;CORRECT&gt;<strong> PROFESSOR: Yes, that is correct. If the first two statements are considered true, then that implies the first statement is itself true.</strong></p><p>&lt;INCORRECT&gt;<strong> PROFESSOR: \"Yes, that is correct. The moon being made of green cheese and cows chewing cud does not imply that the moon is made of green cheese. The moon being made of green cheese implies that cows chew cud.\"</strong></p><p>&lt;INCORRECT&gt;<strong> PROFESSOR: \"That is correct. If the first two statements are considered true, then that implies the first statement is itself true. In this case, the moon being made of green cheese and cows chewing cud would both have to be considered true in order for the conclusion that the moon is made of green cheese to be true.\"</strong></p><p>&lt;CORRECT&gt;<strong> PROFESSOR: \"Yes, that is correct. If the first two statements are considered true, then that implies the first statement is itself true. In this case, the moon being made of green cheese is the first statement, and cows chewing cud is the second statement. If those two things are true, then it stands to reason that the moon being made of green cheese is also true.\"</strong><br><br>So I can get GPT-3 to answer correctly, but not robustly - I feel like GPT-3 is guessing here and sometimes getting the right answer by luck, whereas it seemed to understand the cat-dog example consistently. This is consistent with GPT-3 not having a decent understanding of propositional logic, but with sufficient prompting, you can overcome it's urge to always point out that the moon really isn't made of green cheese.</p>", "parentCommentId": "mk8WeNjymdFbFNND4", "user": {"username": "Jay Bailey"}}, {"_id": "ffgWYyPLMFuhWA5gi", "postedAt": "2022-10-11T07:10:04.602Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>This passage appears to not quite have been pasted correctly - there's some missing words and typos near the end of the passage, not all of which I can fix. E.g: \"Their suspicions were&nbsp;\" and \"and he further kn could retrace their way to their place of startin find the trail that his own people had taken, they would be beyond the reach of danger.\"</p>", "parentCommentId": "8ua68y6inKEuvTEuc", "user": {"username": "Jay Bailey"}}, {"_id": "HFFhZFXgwa3DCAjrp", "postedAt": "2022-10-11T09:11:17.667Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>It is from a newspaper from the 1800s, probably on microfiche. Humans can sort of cope :)&nbsp;</p>", "parentCommentId": "ffgWYyPLMFuhWA5gi", "user": {"username": "cveres"}}, {"_id": "YGdkbxXRP7sRzhHKv", "postedAt": "2022-10-11T09:14:54.227Z", "postId": "aBR589xDLLPb8cg48", "htmlBody": "<p>This proves to me that you are smart.&nbsp;</p><p>Interesting dialog, thanks for going into the trouble.</p>", "parentCommentId": "aDiPKKRRQfKG3pfDq", "user": {"username": "cveres"}}]