[{"_id": "N9yhknTwzdzpGspx3", "postedAt": "2018-08-09T22:30:30.313Z", "postId": "ACdHpmmmtxMXxbjno", "htmlBody": "<p>I think this is quite useful, thanks for posting it publicly.</p>\n<p>Based on CZEA experience, this seems similar to what we converged at - basically</p>\n<ul>\n<li>public introductory events</li>\n<li>more in-depth meetups and advanced content workshop for members</li>\n<li>core with advanced knowledge, incubating and leading projects</li>\n</ul>\n<p>An interesting difference seem to be in the approach to workshops, where we have not much tried something small (~8h - and it was more a series of talks than a workshop) but we tried Fri-Sun retreat.</p>\n", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "zELBaLsBParPsCZj5", "postedAt": "2018-08-19T16:20:05.998Z", "postId": "ACdHpmmmtxMXxbjno", "htmlBody": "<p>Thanks for posting this! I like the model you have proposed. It seems like your group hosts many events throughout the year, and I am curious about a few statistics to help calibrate the usefulness of this model to EA Madison:\n    1) Size of public events\n    2) Number of members\n    3) Number of people in the core\n    4) Frequency of events</p>\n<p>We have a smaller group (roughly 6 - 10 regular attendees) that can attract larger numbers for Giving Games, and I am trying to determine how we can grow it into a larger group with more regular events like you describe.</p>\n", "parentCommentId": null, "user": {"username": "vegjosh"}}, {"_id": "Chna4ZDGvdfE4asoc", "postedAt": "2018-08-20T10:27:13.252Z", "postId": "ACdHpmmmtxMXxbjno", "htmlBody": "<p>Hey Josh, \nRelevant question, thanks!</p>\n<p>1) Our public meetups attract 15-30 people, varying with the theme. Sometimes there are a lot of newbies/random people.</p>\n<p>2) We currently have 83 members, our growth seems likely to continue at ~20ppl/quarter but we expect only 20-50% to become regulars and only around 10-30% to become actively involved beyond attending a meetup here and there. We currently don't have data on how many people really stay around for more than a year - we have now introduced an annual member status renewal.</p>\n<p>3) As we will run our first advanced workshop next week, this number is currently at 15 only (people actively involved whom we know have the knowledge already). We expect it to go up 2-4 fold until the end of this year and then grow more linearly.</p>\n<p>4) We have:</p>\n<ul>\n<li>1 public and 1 non-public themed social each month</li>\n<li>During semesters, monthly intro and advanced workshops</li>\n<li>One of our student groups has weekly meetups during semesters and runs an intro seminar</li>\n<li>We aim for monthly discussion dinners, this is less fixed though</li>\n<li>We meet monthly with our self-improvement group and have bi-weekly open individual debugging/training/planning/gettingshitdone sessions</li>\n<li>1-on-1s are usually at around 1-3/week per FTE, but there are weeks with double that in Fall and Spring</li>\n<li>Sub-communities and working groups have had similar monthly rhythms so far (hard to say because we only properly started those in May)</li>\n<li>We seem to have a co-organised introductory event once a quarter</li>\n</ul>\n", "parentCommentId": "zELBaLsBParPsCZj5", "user": {"username": "konrad"}}, {"_id": "Tt3BhGHXdBa6hb5Dr", "postedAt": "2019-09-01T10:11:09.476Z", "postId": "ACdHpmmmtxMXxbjno", "htmlBody": "<p>Hi Konrad,</p><p>given your comment is now a year old, could you very briefly provide an update of whether anything significantly changed since then (maybe there are some updates to how you run EA Geneva that wouldn&#x27;t justify an entire new post, but are still noteworthy)?</p><p>Also I&#x27;d be interested to know how close the growth assumptions were, and whether your member count and advanced workshop participation went up roughly as you expected.</p><p>This whole post seems very valuable by the way, so thank you!</p>", "parentCommentId": "Chna4ZDGvdfE4asoc", "user": {"username": "markus_over"}}, {"_id": "QgomK8fbdd9CpkosE", "postedAt": "2021-02-22T16:59:46.212Z", "postId": "ACdHpmmmtxMXxbjno", "htmlBody": "<p>Hi Markus, only just saw this, sorry!&nbsp;</p><p>Might still be helpful: you can find somewhat more extensive answers in <a href=\"https://eageneva.org/annual-reports\">our annual reports</a>.</p><p>In short:</p><p>We have quite good engagement data now, since starting a zulip chat server, allowing better tracking of activity. We have stopped running individual workshops and replaced them with a standardized intro seminar series and a personalized fellowship program.</p><p>The core group of heavily-involved individuals is still growing: &gt;30 people now, which is more than double what we had at the time of the previous comment. With 10-20 core members a year leaving, we have to have 20-30 new core members each year to keep up the growth, which is within the bounds of my growth projections for the most engaged member segment (people who join <a href=\"https://forum.effectivealtruism.org/posts/wv5GN9GuyXKjN7veq/ea-geneva-s-fellowship-a-fellowship-model-for-non-university\">our fellowship</a>).&nbsp;</p><p>I suspect growth will start stagnating in 0.5-2 years and deepening engagement will remain the main focus of staff, as it has been more and more so for the past ~1.5 years. This is because the community size is becoming more self-sustaining, due to a critical mass of people who provide organic outreach and retention.&nbsp;</p>", "parentCommentId": "Tt3BhGHXdBa6hb5Dr", "user": {"username": "konrad"}}]