[{"_id": "9Fb2NTxjYzJvy8rGz", "postedAt": "2023-12-06T15:59:19.802Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>I have a degree in chemistry and I can fact-check this post as true and that Eliezer is, at best, drawing up bad analogies and most likely just completely misunderstands chemical bonding in biology.&nbsp;</p><p>I also think most people with a high school knowledge of chemistry and biology would have been able to figure this out with a bit of thinking; I'd like to think I would have if I had known Eliezer had been writing this. I thus am a bit disappointed that this wasn't pointed out sooner.</p>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "ea3XoopDbvdmF7JbA", "postedAt": "2023-12-06T18:20:11.008Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Why is flesh weaker than diamond? &nbsp;Diamond is made of carbon-carbon bonds. &nbsp;Proteins also have some carbon-carbon bonds! &nbsp;So why should a diamond blade be able to cut skin?</p><p>I reply: &nbsp;Because the strength of the material is determined by its weakest link, not its strongest link. &nbsp;A structure of steel beams held together at the vertices by Scotch tape (and lacking other clever arrangements of mechanical advantage) has the strength of Scotch tape rather than the strength of steel.</p><p>Or: &nbsp;Even when the load-bearing forces holding large molecular systems together are locally covalent bonds, as in lignin (what makes wood strong), if you've got larger molecules only held together by covalent bonds at interspersed points along their edges, that's like having 10cm-diameter steel beams held together by 1cm welds. &nbsp;Again, barring other clever arrangements of mechanical advantage, that structure has the strength of 1cm of steel rather than 10cm of steel.</p><p>Bone is stronger than wood; it runs on a relatively stronger structure of ionic bonds, which are no locally weaker than carbon bonds in terms of attojoules of potential energy per bond. &nbsp;Bone is weaker than diamond, then, because... why?</p><p>Well, partially, IIUC, because calcium atoms are heavier than carbon atoms. &nbsp;So even if per-bond the ionic forces are strong, some of that is lost in the price you pay for including heavier atoms whose nuclei have more protons that are able to exert the stronger electrical forces making up that stronger bond.</p><p>But mainly, bone is so much weaker than diamond (on my understanding) because the carbon bonds in diamond have a regular crystal structure that locks the carbon atoms into relative angles, and in a solid diamond this crystal structure is tesselated globally. &nbsp;Hydroxyapatite (the crystal part of bone) also tesselates in an energetically favorable configuration; but (I could be wrong about this) it doesn't have the same local resistance to local deformation; and also, the actual hydroxyapatite crystal is assembled by other tissues that layer the ionic components into place, which means that a larger structure of bone is full of fault lines. &nbsp;Bone cleaves along the weaker fault line, not at its strongest point.</p><p>But then, why don't diamond bones exist already? &nbsp;Not just for the added strength; why make the organism look for calcium and phosphorus instead of just carbon?</p><p>The search process of evolutionary biology is not the search of engineering; natural selection can only access designs via pathways of incremental mutations that are locally advantageous, not intelligently designed simultaneous changes that compensate for each other. &nbsp;There were, last time I checked, only three known cases where evolutionary biology invented the freely rotating wheel. &nbsp;Two of those known cases are ATP synthase and the bacterial flagellum, which demonstrates that freely rotating wheels are in fact incredibly useful in biology, and are conserved when biology stumbles across them after a few hundred million years of search. &nbsp;But there's no use for a freely rotating wheel without a bearing and there's no use for a bearing without a freely rotating wheel, and a simultaneous dependency like that is a huge obstacle to biology, even though it's a hardly noticeable obstacle to intelligent engineering.</p><p>The entire human body, faced with a strong impact like being gored by a rhinocerous horn, will fail at its weakest point, not its strongest point. &nbsp;How much evolutionary advantage is there to stronger bone, if what fails first is torn muscle? &nbsp;How much advantage is there to an impact-resistant kidney, if most fights that destroy a kidney will kill you anyways? &nbsp;Evolution is not the sort of optimizer that says, \"Okay, let's design an <i>entire</i> stronger body.\" &nbsp;(Analogously, the collection of faults that add up to \"old age\" is large enough that a little more age resistance in one place is not much of an advantage if other aging systems or outward accidents will soon kill you anyways.)</p><p>I don't even think we have much of a reason to believe that it'd be physically (rather than informationally) difficult to have a set of enzymes that synthesize diamond. &nbsp;It could just require 3 things to go right simultaneously, and so be much much harder to stumble across than tossing more hydroxyapatite to lock into place in a bone crystal. &nbsp;And then even if somehow evolution hit on the right set of 3 simultaneous mutations, sometime over the history of Earth, the resulting little isolated chunk of diamond probably would not be somewhere in the phenotype that had previously constituted the weakest point in a mechanical system that frequently failed. &nbsp;If evolution has huge difficulty inventing wheels, why expect that it could build diamond chainmail, even assuming that diamond chainmail is physically possible and could be useful to an organism that had it?</p><p>Talking to the general public is hard. &nbsp;The first concept I'm trying to convey to them is that there's an underlying physical, mechanical reason that flesh is weaker than diamond; and that this reason <i>isn't </i>that things animated by vitalic spirit, elan vital, can self-heal and self-reproduce at the cost of being weaker than the cold steel making up lifeless machines, as is the price of magic imposed by the universe to maintain game balance. &nbsp;This is a very natural way for humans to think; and the thing I am trying to come in and do is say, \"Actually, no, it's not a mystical balance, it's that diamond is held together by bonds that are hundreds of kJ/mol; and the mechanical strength of proteins is determined by forces a hundred times as weak as that, the part where proteins fold up like spaghetti held together by static cling.\"</p><p>There is then a deeper story that's even harder to explain, about <i>why </i>evolution doesn't build freely rotating wheels or diamond chainmail; why evolutionary design doesn't find the physically possible stronger systems. &nbsp;But first you need to give people a mechanical intuition for why, in a very rough intuitive sense, it <i>is </i>physically possible to have stuff that moves and lives and self-repairs but is strong like diamond instead of flesh, without this violating a mystical balance where the price of vitalic animation is lower material strength.</p><p>And that mechanical intuition is: &nbsp;Deep down is a bunch of stuff that, if you could see videos of it, would look more like tiny machines than like magic, though they would not look like familiar machines (very few freely rotating wheels). &nbsp;Then why aren't these machines strong like human machines of steel are strong? &nbsp;Because iron atoms are stronger than carbon atoms? &nbsp;Actually no, diamond is made of carbon and that's still quite strong. &nbsp;The reason is that these tiny systems of machinery are held together <i>(at the weakest joints, not the strongest joints!)</i> by static cling.</p><p>And then the deeper question: &nbsp;<i>Why</i> does evolution build that way? &nbsp;And the deeper answer: &nbsp;Because everything evolution builds is arrived at as an error, a mutation, from something else that it builds. &nbsp;Very tight bonds fold up along very deterministic pathways. &nbsp;So (in the average case, not every case) the neighborhood of functionally similar designs is densely connected along shallow energy gradients and sparsely connected along deep energy gradients. &nbsp;Intelligence can leap long distances through that design space using coordinated changes, but evolutionary exploration usually cannot.</p><p>And I <i>do</i> try to explain that too. &nbsp;But it is legitimately more abstract and harder to understand. &nbsp;So I lead with the idea that proteins are held together by static cling. &nbsp;This is, I think, validly the first fact you lead with if the audience does not already know it, and just has no clue why anyone could possibly possibly think that there <i>might even be</i> machinery that does what bacterial machinery does but better. &nbsp;The typical audience is not starting out with the intuition that one would <i>naively</i> think that of course you could put together stronger molecular machinery, given the physics of stronger bonds, and then we debate whether (as I believe) the naive intuition is actually just valid and correct; they don't understand what the naive intuition is about, and that's the first thing to convey.</p><p>If somebody then says, \"How can you be so ignorant of chemistry? &nbsp;<i>Some</i> atoms in protein are held together by covalent bonds, not by static cling! &nbsp;There's even eg sulfur bonds whereby some parts of the folded-spaghetti systems end up glued together with real glue!\" then this does not <i>validly </i>address the original point because: the underlying point about why flesh is more easily cleaved than diamond, is about <i>the weakest points of flesh</i> rather than <i>the strongest points in flesh,</i> because that's what determines the mechanical strength of the larger system.</p><p>I think there is an important way of looking at questions like these where, at the final end, you ask yourself, \"Okay, but does my argument prove that flesh is in fact as strong as diamond? &nbsp;Why isn't flesh as strong as diamond, then, if I've refuted the original argument for why it isn't?\" and this is the question that leads you to realize that some local strong covalent bonds don't matter to the argument if those bonds aren't the parts that break under load.</p><p>My main moral qualm about using the Argument From Folded Spaghetti Held Together By Static Cling as an intuition pump is that the local ionic bonds in bone are legitimately as strong per-bond as the C-C bonds in diamond, and the reason that bone is weaker than diamond is (iiuc) actually more about irregularity, fault lines, and resistance to local deformation than about kJ/mol of the underlying bonds. &nbsp;If somebody says \"Okay, fine, you've validly explained why flesh is weaker than diamond, but why is <i>bone</i> weaker than diamond?\" I have to reply \"Valid, iiuc that's legit more about irregularity and fault lines and interlaced weaker superstructure and local deformation resistance of the bonds, rather than the raw potential energy deltas of the load-bearing welds.\"</p>", "parentCommentId": null, "user": {"username": "EliezerYudkowsky"}}, {"_id": "zbYxAAQoHHyq3wraB", "postedAt": "2023-12-06T20:48:22.864Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Okay. I'm going to take you at your word that you understand that biology is, at it's core, almost entirely built out of covalent bonds. In which case, I am <i>utterly flabbergasted</i> at the way you chose to communicate here.&nbsp;</p><p>I think the folded spaghetti gives the wrong impression (spaghetti is not hard to break apart). Let's instead talk about a structure which has at it's core a large steel wire (representing covalent bonds), where parallel sections are glued to each with extremely strong glue(that is obviously weaker than steel bonds) to build a backbone, and then finally those backbones are folded into a weird shape, and joined together at various points with a combination of steel welds, superglue, and sometimes bits of string (representing Van der waals forces). &nbsp;We can call this chunk a \"glorpein\".&nbsp;</p><p>Now I come around, and I want to point out the problems with glorpein. I then proceed to say statements like:</p><p>\"Glorpeins are held together by string <i>instead</i> of steel wires!\"</p><p>\"Glorpeins are held together by string, which is much weaker than steel wires! \"</p><p>\"My design has figured out how to use steel, instead of Glorpein, which sticks to string! \"</p><p>\"Perhaps, one day in the future, can we build steel equivalents to Glorpein\"</p><p>I think it's perfectly reasonable to point out that Glorpein is <i>made out of fucking steel</i>. And if you actually <i>know</i> the structure of Glorpein, then <i>these statements are lies, </i>accidental or not,<i> </i>designed to exaggerate the weaknesses involved. &nbsp;</p><p><i>Of course</i> I know that diamond is stronger than bone, and why that is. My job is to simulate crystals! This point was already included in my article:</p><blockquote><p>This is not to say that a fully diamondoid based nanobot, (if such a thing is even possible) wouldn’t be stronger than these examples. Protein is not <i>entirely</i> covalent, which introduces weaknesses. When put into extreme conditions such as high heat, they may lose their secondary and tertiary structure and unfold back to their primary covalently bonded structure, in a process called “denaturation”. Diamond can avoid this fate as all of it’s bonds are equally strong.</p></blockquote><p>My point is that by reducing biology down to \"static cling\", you greatly exaggerate it's weakness, and the comparative advantage of non-biology. As just one example, you can give a protein a blast of heat that breaks all the non covalent bonds... and then often once the heat leaves, it will reform itself right back to what it was before, because it's still <i>held together by covalent bonds</i>. This is one reason why you can't just reduce things to their weakest links, and forget about the other <i>99%</i> of what holds it together.&nbsp;</p><p>And again, while diamond is stronger than proteins, it's also a lot stiffer, less flexible, and less versatile, which is why attempts to build diamond based nanomachines have so far failed. Enzymes can do impressive things <i>because</i> they are flexible and squishy, not in spite of it.&nbsp;</p><p>In conclusion, while I understand that science communication is hard, it's not an excuse for saying things that are factually incorrect.</p>", "parentCommentId": "ea3XoopDbvdmF7JbA", "user": {"username": "titotal"}}, {"_id": "jmrp2xqEfAP8k72dk", "postedAt": "2023-12-06T21:41:39.867Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<blockquote><p>I think there is an important way of looking at questions like these where, at the final end, you ask yourself, \"Okay, but does my argument prove that flesh is in fact as strong as diamond? &nbsp;Why isn't flesh as strong as diamond, then, if I've refuted the original argument for why it isn't?\" and this is the question that leads you to realize that some local strong covalent bonds don't matter to the argument if those bonds aren't the parts that break under load.</p></blockquote><p>It's not clear to me that covalent bonds <i>aren't</i> the ones that are breaking under load when talking about flesh though.</p><p>Covalent crosslinks (such as the disulfide bond you mentioned earlier) aren't merely an irrelevant edge case, proteins like collagen (which is used in the extracellular matrix and connective tissue) and keratin (used in hair, nails, horns and hooves) also have such crosslinks.</p>", "parentCommentId": "ea3XoopDbvdmF7JbA", "user": {"username": "Thomas Pilgrim"}}, {"_id": "rhayJHz2iqqARBeos", "postedAt": "2023-12-07T02:33:53.041Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Hi, computational protein engineer and person who-thinks-biology-can-do-amazing-stuff here.</p>\n<p>Just wanted to report that while \"Proteins are like Folded Spaghetti Held Together By Static Cling\" is obviously incorrect as a matter of fact, I immediately thought it was a pretty good <em>analogy</em> for capturing some critical and often under-appreciated aspects of the functionally important character of proteins. When I read the sentences you've quoted him saying about proteins held together by covalent bonds, I (think) I understood what he was pointing at with this and roughly agree. I absolutely did not think he was saying proteins did not contain covalent bonds, but rather that you could imagine an alternative protein-like molecular structure which had all of its key structural and functional characteristics determined by covalent bonds. I believe such a \"protein\" would, among other things, be predicted to function at a much wider range of temperatures than extant proteins, maintain its structure and function in many different solvents (and probably gas phase?) etc etc.</p>\n<p>This analogy is also definitely failing to capture other important characteristics of proteins, some of which the OP mentioned and I agree with.</p>\n<p>By the way, if I was forced to say one thing which \"held together\" proteins (in the sense of \"is most responsible for determining the functional characteristics of a polypeptide chain) it would be tough but I might pick something I don't think anyone has mentioned: hydrophobicity/ hydrophilicity.</p>\n", "parentCommentId": null, "user": {"username": "eca"}}, {"_id": "Ac2HEfj96Jj7mRNfB", "postedAt": "2023-12-07T03:10:23.513Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>I'm sort of skeptical that you could write something that works as science communication for a general audience, though lord knows I'm not necessarily succeeding either. &nbsp;The key valid ideas to be communicated are:</p><ul><li>There exists a level above biology for molecular systems, greatly superior in terms of strength and energy density. &nbsp;This sets a lower bound on how a very smart and uncaring entity could kill you, which looks like it attacking you with micron-diameter robots, which looks like everyone on Earth falling over dead in the same second.</li><li>The designed micron-diameter thingies can easily kill you, where bacteria can't, because the designed thingies can more easily rip apart human cell membranes or white blood cells made of flimsier materials. &nbsp;They can do that because human cell membranes are held together by static cling, as are bacterial cells; whereas the ideal limits of what micron-sized engines can be put together are more like \"diamond\".</li><li>This design space isn't accessible to natural selection despite being physically possible, because evolutionary biology has an incredibly hard time designing systems like freely rotating wheels; for reasons that generalize to evolution not creating airborne cell-engines with solid covalently bonded shells and manipulator ports. &nbsp;My attempt to compress \"Why?\" down to something maybe overly pithy is \"Because shallow energy gradients are more densely connected in the design space of simple mutations than deep energy gradients.\"</li></ul><p>Now, instead of talking about human cell membranes being held together by static cling, I could talk about extremely thin metallic twisty-tie wires with some magnetized sections that help them fold up together into particular configurations in a barrel of magnetized ball bearings. &nbsp;Your suggestion above for science communication is that this is a great thing to mention, because it helps convey the following interesting truth: if we churn the ball bearings hard enough to unfold the twisty tie, it'll sometimes fold right back up into the same shape again once we stop churning!</p><p>This more complicated metaphor may legit add something to an explanation <i>of organic chemistry.</i> &nbsp;I don't disagree that it's cool, or important to organic chemistry proper.</p><p>From the perspective of explaining how you die when you confront an uncaring mind that thinks smarter and much faster than humanity, it doesn't add anything not already contained in \"cell membranes are held together by static cling\".</p>", "parentCommentId": "zbYxAAQoHHyq3wraB", "user": {"username": "EliezerYudkowsky"}}, {"_id": "5ej6tsp3J5wf3wEGt", "postedAt": "2023-12-07T03:16:13.770Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>I'm not sure what's a truer analogy than static cling for hydrophobia <i>as a force holding things together</i> which the general audience has any experience with. &nbsp;Macroscopic experience of hydrophobia is, like, oil collecting on the surface of water, which isn't experienced as a binding force the way that static cling is.</p>", "parentCommentId": "rhayJHz2iqqARBeos", "user": {"username": "EliezerYudkowsky"}}, {"_id": "3hwN7m7bhQXE7qDJJ", "postedAt": "2023-12-07T11:38:18.217Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Here is an explanation of my problems with each of Yudkowskys claims. I thought this was fairly obvious from the post, but perhaps it needed more explaining. I will go from most to least wrong.&nbsp;</p><blockquote><p>human technology figuring out <i><strong>how to use covalent bonds and metallic bonds, where biology sticks to ionic bonds and proteins held together by van der Waals forces</strong></i></p></blockquote><p>This is just straight up, explicitly false. Biology does not \"stick to ionic bonds and proteins\". As I pointed out, biology is made up of covalent bonds at it's very core, and uses them all the time.&nbsp;</p><blockquote><p><i><strong>covalently bonded equivalents of biology where instead of proteins that fold together and are held together by static cling, you have things that go down much sharper potential energy gradients and are bundled together</strong></i></p></blockquote><p>The phrase \"covalently bonded equivalents to biology\" implicitly states that biology is not covalently bonded. This is false.&nbsp;</p><blockquote><p><i><strong>I have mostly shifted to trying to talk about “covalently bonded” bacteria</strong></i></p></blockquote><p>The context of this claim is that Yudkowsky is trying to come up with a new name for deadly Drexler-style nanomachines. He has chosen \"covalently bonded bacteria\", implying that \"covalently bonded bacteria\" and normal bacteria are different things. Except that's not true, because bacteria is completely full of covalent bonds.&nbsp;</p><blockquote><p><strong>Algae are tiny microns-wide solar-powered fully self-replicating factories that run on general assemblers, \"ribosomes\", that can replicate most other products of biology given digital instructions.</strong></p></blockquote><p>Okay, I just saw this one, but ribosomes are not \"general\" assemblers, and they cannot replicate \"most other products of biology\". They do literally one thing, and that is read instructions and link together amino acids to form proteins.&nbsp;</p><p>For the next two. let's establish the principle that if you say \"X is held together by Y <i><strong>instead of</strong></i><strong> </strong>Z\", you are implicitly making the statement that \"X is not held together by Z\", or perhaps that \"Z is irrevelant compared to Y when talking about how X is held together\". Otherwise you would not have used the word <i><strong>instead of</strong></i>. Would you utter the phrase \"animal bodies are held together by flesh <i>instead of</i> skeletons?\"</p><blockquote><p><i><strong>proteins bound together by weak van der Waals forces instead of strong covalent bonds</strong></i></p></blockquote><p>This implicitly makes the statement \"proteins are not held together by strong covalent bonds\", which is false. Or it could be saying \"strong covalent bonds are irrelevant compared to van der waals forces when talking about how proteins are held together\", which is also false. &nbsp;</p><p><i><strong>even though the proteins are held together by van der Waals forces rather than covalent bonds, which is why algae are far less tough than diamond</strong></i></p><p>\"rather than\" means the same thing as \"instead of\", and therefore makes an implicitly false statement for the reason I said in the last quote. &nbsp;</p><blockquote><p><i><strong>proteins are held together by van der Waals forces that are much weaker than covalent bonds</strong></i></p></blockquote><p>Actually, this one is defensible, because it didn't use the phrase \"instead of\". I would still prefer more qualifying terms such \"the weakest link\". If this had been the only statement, I would not have written this post.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "DLF6Lg74jfpYfwPCe", "postedAt": "2023-12-07T12:20:48.827Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>To be clear, my main objection is that you have made statements that are implicitly or explicitly false. I go over each one in detail in the comment <a href=\"https://forum.effectivealtruism.org/posts/aCEAczDuRrZihaLNA/why-yudkowsky-is-wrong-about-covalently-bonded-equivalents?commentId=3hwN7m7bhQXE7qDJJ\">here</a>. Yes, simplification is inevitable, but at many points you crossed the line into saying things that are flat out untrue.</p><p>I am confused by the pushback and downvotes in response to pointing this out. Do you not want to be making the strongest argument you can here?&nbsp;</p><blockquote><p>I'm sort of skeptical that you could write something that works as science communication for a general audience</p></blockquote><p>I don't think it's particularly hard to explain why drexlerian nanotech, if it worked, would be powerful and dangerous, without making any implicitly or explicitly false claims.&nbsp;</p><p>\"Biology is structurally limited by what can be produced by the DNA/RNA system. For example, proteins are built by stitching together a long chain of molecules which fold into themselves to form 3d structures. The backbone is made of strong covalent bonds, but the full 3d structure has weak links where the backbone is pinned together by a variety of forces, some of which are quite weak. In contrast, Drexler style nanotech could be made factory style, layer by layer, and build densely bonded crystalline structures like diamond that are strictly covalently bonded and contain no weak links, and could therefore survive in much hardier conditions and slice through regular cells.\"</p><p>Too long? Okay, here's a quick two sentence version:</p><p>\"Proteins are made of long chains that fold together and are pinned in place by a variety of forces, some of which are weak. In contrast Drexlerian nanotech could be made out of densely bonded crystalline structures with strictly covalent bonds and no weak links\"</p><p>If you want to use these arguments, I expect payment in social capital.&nbsp;</p><p>Of course, my crux here would be that I don't think Drexlerian nanotech would actually practically work, (part of the reason being the lack of flexibility), but that's a debate for another day.&nbsp;</p>", "parentCommentId": "Ac2HEfj96Jj7mRNfB", "user": {"username": "titotal"}}, {"_id": "jseibfYeymfyPqnGd", "postedAt": "2023-12-07T13:11:53.803Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Hey, thanks for replying! I explained my issues with the wording he used in a different comment. I would rather know more about what you think about the subject.&nbsp;</p><blockquote><p>but rather that you could imagine an alternative protein-like molecular structure which had all of its key structural and functional characteristics determined by covalent bonds. I believe such a \"protein\" would, among other things, be predicted to function at a much wider range of temperatures than extant proteins, maintain its structure and function in many different solvents (and probably gas phase?) etc etc.</p></blockquote><p>What do you mean by \"protein-like\" here? Like, a stitched together chain of molecules that also folds up, but has much stronger cross-links? Or like a 2d-layering system? Or the gears and manipulators that Drexler proposed and wrote up <a href=\"https://titotal.substack.com/p/diamondoid-bacteria-nanobots-deadly\">here</a>? Do any of these sound plausible, or easily built off of regular biological systems?&nbsp;</p><p>Are you aware of any potential alternative designs for biology compared to the DNA/RNA approach?&nbsp;</p><p>Sorry if these are too many questions, I'm very interested in this subject but have reached the limit of my expertise.&nbsp;</p>", "parentCommentId": "rhayJHz2iqqARBeos", "user": {"username": "titotal"}}, {"_id": "Yh83XSL9L9GLpEuq5", "postedAt": "2023-12-07T14:32:31.268Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<blockquote><p>Would you utter the phrase \"animal bodies are held together by flesh <i>instead of</i> skeletons?\"</p></blockquote><p>Seems like weird phrasing but ultimately true. Bones give structure but they're not sticky - if you took away all the flesh (muscle, skin, ligaments etc.) the bones would just fall apart, but if you took away all the bones it would be very floppy but still would clump together. A boneless chicken thigh doesn't fall apart, but a skeleton from hundreds of years ago, where only the bones remain, is not held together.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "YFngXfYzGRf2wDNq4", "postedAt": "2023-12-07T15:11:24.567Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Yea, idk. I was thinking of the quotes where you explicitly mentioned Van der Waals forces. Tbc, my preference would be to not be forced to pick a single force</p>\n", "parentCommentId": "5ej6tsp3J5wf3wEGt", "user": {"username": "eca"}}, {"_id": "ed76WJKjjm7qqNdWw", "postedAt": "2023-12-07T16:49:29.255Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>I agree that \"biology sticks to ionic bonds and static cling\" was badly put because lignin, and I'll retire that one.</p>", "parentCommentId": "3hwN7m7bhQXE7qDJJ", "user": {"username": "EliezerYudkowsky"}}, {"_id": "iAzTK3Dn4fBeazNJS", "postedAt": "2023-12-08T18:51:56.666Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Why is horn weaker than diamond?</p>", "parentCommentId": "jmrp2xqEfAP8k72dk", "user": {"username": "EliezerYudkowsky"}}, {"_id": "7D7fYzdfxDtkys9WW", "postedAt": "2023-12-09T00:00:30.202Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>Why is crystalline silicon weaker than diamond?</p><p>They have the same type of bonds, and the exact same structure. Diamond is harder because not every type covalent bond is equally strong (as you already noted when discussing bone).&nbsp;</p><p>Diamond is (close to) the hardest material in the world, because C-C bonds are <a href=\"https://www2.chemistry.msu.edu/faculty/reusch/OrgPage/bndenrgy.htm\">quite strong</a>, and each carbon atom has four of them. Diamond has C-C bonds densely packed in every direction.&nbsp;</p><p>I don't know as much about keratin specifically. <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5808910/\">This source </a>says some keratin-associated proteins have as much as 41% of their structure consisting of cystine (the amino acid with sulfur attached), so presumably it is also densely packed with Di-Sulfide covalent bonds.&nbsp;</p><p>It also says:</p><blockquote><p>Disulfides are also a dominant structural and stabilizing element within larger proteins made up of tandem repeats of smaller, internally cross-linked units. Low density lipoprotein receptor-like repeats and epidermal growth factor-like (EGF-like) repeats are two examples of disulfide-rich modules that are linked in tandem to generate long, rod-shaped structures acting as cell-surface receptors or key components of the extracellular matrix (ECM)</p></blockquote><p>So there you go, a clearcut case of protein being held together with covalent bonds. I mean, I still think \"the primary structure is 100% covalently bonded\" is sufficient to say this, but whatever.&nbsp;</p><p>Why is this not stronger than diamond? Well, i would guess that while the dominant bonds are covalent, they are weaker covalent bonds than C-C bonds, and there are not as many of them per atom as in diamond.&nbsp;</p><p>Also, we've been talking a lot about hardness here, but it's not the only measure of \"strength\" you can use. If I cherry-picked fracture toughness, I could say that diamond is weaker than wood, because the fracture toughness of <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9182387/#:~:text=The%20tensile%20strength%20is%20arranged,1%2F2%20%5B31%5D.\">wood</a> is higher than <a href=\"https://en.wikipedia.org/wiki/Material_properties_of_diamond\">diamond</a>. Check out <a href=\"https://www.youtube.com/watch?v=XBjiEsAyNQs\">this video</a> of a diamond being shattered with a regular hammer! Being able to deform and then rebound back into place offers advantages in many situations, and it's why wood and metal doesn't similarly shatter.</p><p>To be clear, I obviously still think diamond is stronger than wood along most other measures, such as melting temp, hardness, etc. But there is not zero cost to the rigidity and stiffness of diamond.&nbsp;</p><p>This is a relatively minor (but interesting!) point though, please do not only respond to the last two paragraphs.&nbsp;</p>", "parentCommentId": "iAzTK3Dn4fBeazNJS", "user": {"username": "titotal"}}, {"_id": "YKAxC8WNaaJLXMCvC", "postedAt": "2023-12-09T01:57:38.856Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>A short and oversimplified answer is that the keratin in horn is not as densely linked with bonds as diamond is, and consequently the atoms are less confined (in a way diamond is sort of like a maximally crosslinked material, though it's not usually described that way).&nbsp;</p><p>Generally speaking, crosslinking polymers (including proteins) tends to increase their rigidity. To use a non-living example, when latex is treated with sulfur, the polymer chains also get crosslinked with those same disulfide bonds, producing \"vulcanized\" rubber which is harder and tougher.&nbsp;</p><p>The crosslinks are why you'll sometimes see people say that vulcanized rubber is \"one big molecule\" (though in practice it's hard to tell if the crosslinking was actually so complete and to link every polymer chain). This is also why vulcanized rubber doesn't really melt, increasing the temperature will cause chemical changes instead (and while I'm not sure, my educated guess it that something similar would happen if you try to melt animal horns).</p><p><br>P.S. I didn't bring it up earlier, but I don't think your earlier statement about the way the masses of the atoms affect the bond strength is accurate. As a counterexample I'd point out that the deuterium-oxygen bond in heavy water is actually a little stronger than that of the protium-oxygen bond in regular water, and in that case the only change is using a more massive form of hydrogen.</p>", "parentCommentId": "iAzTK3Dn4fBeazNJS", "user": {"username": "Thomas Pilgrim"}}, {"_id": "HShywBsok8mf7ME2c", "postedAt": "2023-12-11T06:54:23.278Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<blockquote><p>Why is flesh weaker than diamond?</p></blockquote><p>I don't think this is a fair comparison. If nature wanted skin to be harder, it can do that, for instance with scales (particularly hard in the case of turtle shells). Of course your logic explains why diamond is harder than bone. But if you want a small thing that could penetrate flesh, we already have it in the form of parasites.</p>", "parentCommentId": "ea3XoopDbvdmF7JbA", "user": {"username": "Denkenberger"}}, {"_id": "GGBy7YHWsXpsHkELd", "postedAt": "2023-12-11T14:54:35.007Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<blockquote><p>This isn’t an isolated incident either, by the way. See my write-up on the <a href=\"https://titotal.substack.com/p/an-intro-to-quantum-physics-fixing\">errors in the math in the quantum physics sequences</a></p></blockquote><p>The average physics textbook contains multiple errors of the order, “forgot to include the normalization term.”<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref4hcze17s868\"><sup><a href=\"#fn4hcze17s868\">[1]</a></sup></span>&nbsp;To me it seems incorrect to bring up Eliezer's error as strong evidence that he doesn't know what he's talking about, without acknowledging the base rate of similar errors.</p><p>(I recognize that you also point to Eliezer's economics errors. I haven't read <i>Inadequate Equilibria</i> or the post critiquing it, so I can't comment on the magnitude of the errors there, but I think a base rate assessment—e.g., how frequently do academic-level economics books turn out to have a shaky thesis?—should again apply.)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn4hcze17s868\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref4hcze17s868\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Based on my experience studying the subject at university, at least.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "9nS4iSQA3wHgCqrGu", "postedAt": "2023-12-13T22:48:47.348Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>What I'm pointing at there is that for strength/weight purposes, using big calcium nuclei to create stronger individual bonds in bone, is like making a steel beam stronger by putting more steel into it; the strength costs weight.</p>", "parentCommentId": "YKAxC8WNaaJLXMCvC", "user": {"username": "EliezerYudkowsky"}}, {"_id": "mpf7FwxxXksrqGJ4R", "postedAt": "2023-12-14T12:59:25.465Z", "postId": "aCEAczDuRrZihaLNA", "htmlBody": "<p>As a physicist, I think your understanding of bonds is a little off here.&nbsp;</p><blockquote><p>using big calcium nuclei to create stronger individual bonds in bone</p></blockquote><p>Using bigger nuclei usually makes an atom bond <i>weaker</i>, rather than stronger, for reasons to do with the quantum mechanical bond natures. See <a href=\"https://physics.stackexchange.com/questions/127890/why-are-silicon-silicon-bonds-weak\">this explanation</a> for why si-si bonds are weaker than C-C bonds. &nbsp;The simplest explanation for why is simply that the bonding electrons are much <i><strong>further out</strong></i> in heavier elements, because more atomic shells have been filled, so there is correspondingly less force of attraction between them.&nbsp;</p><p>I was a little confused learning this initially because i thought that the extra protons in the nuclei would have a bigger attractive effect, but then I remembered that the extra protons come along with extra <i>electrons, </i>so overall the effect is much more complicated and averages out to bigger atom= weaker bond.&nbsp;</p><p>But as <a href=\"https://forum.effectivealtruism.org/users/thomas-pilgrim-1?mention=user\">@Thomas Pilgrim</a> and the linked post pointed out, there are exceptions to this rule due to the intricacies of particular types of bonds, and you really have to dig into the quantum mechanical nature of things to be sure.&nbsp;</p>", "parentCommentId": "9nS4iSQA3wHgCqrGu", "user": {"username": "titotal"}}]