[{"_id": "anRdnBiGtGcJhrRmc", "postedAt": "2023-03-29T18:47:07.129Z", "postId": "Ackzs8Wbk7isDzs2n", "htmlBody": "<p>Leopold. I love your thinking here, especially that society will arise to save itself. I sent you an email at four our posterity.</p>\n", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "ibjMJ2DxT9udJQP7m", "postedAt": "2023-03-29T18:52:23.564Z", "postId": "Ackzs8Wbk7isDzs2n", "htmlBody": "<p>I think I agree with a lot of the specific points raised here, but I notice a feeling of wariness/unease around the overall message. I had a similar reaction to Haydn's recent \"<a href=\"https://www.vox.com/future-perfect/2023/3/25/23655082/ai-openai-gpt-4-safety-microsoft-facebook-meta\">If your model is going to sell, it has to be safe</a>\" piece. Let me try to unpack this:</p><p>On one hand, I do think safety is important for the commercial interests of labs. And broadly being better able to understand/control systems seems good from a commercial standpoint.</p><p>My biggest reservations can be boiled down into two points:&nbsp;</p><ol><li><strong>I don't think that commercial incentives will be enough to motivate people to solve the hardest parts of alignment</strong>. Commercial incentives will drive people to make sure their system <i>appears to do what users want</i>, which is very different than having systems that <i>actually do what users want </i>or <i>robustly do what users want even as they become more powerful</i>. Or to put it another way: near-term commercial incentives don't really cause me to put appropriate amounts of attention on things like situational awareness or deceptive alignment. I think commercial incentives will be sufficient to reduce the odds of Bingchat fiascos, but I don't think they'll motivate the kind of alignment research that's trying to handle deception, sharp left turns, or even the most ambitious types of scalable oversight work.</li><li><strong>The research that is directly incentivized by commercial interests is least likely to be neglected</strong>. I expect the most neglected research to be research that doesn't have any direct commercial benefit. I expect AGI labs will invest a substantial amount of resources to prevent future Bingchat scenarios and other instances of egregious deployment harms. The problem is that I expect many of these approaches (e.g., getting really good at RLHFing your model such that it no longer displays undesirable behaviors) will not generalize to more powerful systems. I think you (and many others) agree with this, but I think the important point here is that <i>the economic incentives will favor RLHFy stuff over stuff that tackles problems that are not as directly commercially incentivized</i>.</li></ol><p>As a result, even though I agree with many of your subclaims, I'm still left thinking, \"huh, the message I want to spread is not something like \"hey, in order to win the race or sell your product, you need to solve alignment.\"&nbsp;</p><p>But rather something more like \"hey, there are some safety problems you'll need to figure out to sell/deploy your product. Cool that you're interested in that stuff. <strong>There are other safety problems-- often ones that are more speculative-- that the market is not incentivizing companies to solve. On the margin, I want more attention paid to those problems. </strong>And if we just focus on solving the problems that are required for profit/deployment, we will likely fool ourselves into thinking that our systems are safe when they merely appear to be safe, and we may underinvest in understanding/detecting/solving some of the problems that seem most concerning from an x-risk perspective.\"</p>", "parentCommentId": null, "user": {"username": "Akash"}}, {"_id": "aNTFamWeBzc57Z5rs", "postedAt": "2023-03-29T22:17:56.974Z", "postId": "Ackzs8Wbk7isDzs2n", "htmlBody": "<blockquote><p>There are other safety problems-- often ones that are more speculative-- that the market is not incentivizing companies to solve.</p><p>&nbsp;</p></blockquote><p>My personal response would be as follows:&nbsp;</p><ol><li>As Leopold presents it, the key pressure here that keeps labs in check is <i>societal constraints on deployment</i>, not <i>perceived ability to make money</i>. The hope is that society's response has the following properties:<ol><li>thoughtful, prominent experts are attuned to these risks and demand rigorous responses</li><li>policymakers are attuned to (thoughtful) expert opinion</li><li>policy levers exist that provide policymakers with oversight / leverage over labs</li></ol></li><li>If labs are sufficiently thoughtful, they'll notice that deploying models is in fact bad for them! Can't make profit if you're dead. *taps forehead knowingly*<ol><li>but in practice I agree that lots of people are motivated by the tastiness of progress, pro-progress vibes, etc., and will not notice the skulls.</li></ol></li></ol><p>Counterpoints to 1:</p><p><strong>Good regulation of deployment is hard</strong> (though not impossible in my view).&nbsp;</p><ul><li>reasonable policy responses are difficult to steer towards</li><li>attempts at raising awareness of AI risk could lead to policymakers getting too excited about the promise of AI while ignoring the risks</li><li>experts will differ; policymakers might not listen to the right experts</li></ul><p><strong>Good regulation of </strong><i><strong>development </strong></i><strong>is much harder, and will eventually be necessary.</strong></p><p>This is the really tricky one IMO. I think it requires pretty far-reaching regulations that would be difficult to get passed today, and would probably misfire a lot. But doesn't seem impossible, and I know people are working on laying groundwork for this in various ways (e.g. pushing for labs to incorporate evals in their development process).</p>", "parentCommentId": "ibjMJ2DxT9udJQP7m", "user": {"username": "deep"}}, {"_id": "JxEGkRjdzxJ8ZFAGX", "postedAt": "2023-03-29T22:29:19.285Z", "postId": "Ackzs8Wbk7isDzs2n", "htmlBody": "<p>Like Akash, I agree with a lot of the object-level points here and disagree with some of the framing / vibes. I'm not sure I can articulate the framing concerns I have, but I do want to say I appreciate you articulating the following points:</p><ul><li>Society is waking up to AI risks, and will likely push for a bunch of restrictions on AI progress<ul><li>Sydney and the ARC Captcha example have made AI safety stuff more salient.&nbsp;</li><li>There's opportunity for substantially more worry about AI risk to emerge after even mild warning events (e.g. AI-powered cyber events, crazier behavior emerging during evals)</li></ul></li><li>Society's response will be dumb and inefficient in a lot of ways, but <i>could</i> also end up getting pointed in some good directions</li><li>The more an org's AI development / deployment abilities are constrained by safety considerations (whether their own concerns or other stakeholders'), the more safety looks like just another thing you need in order to deploy your powerful AI systems, so that safety work becomes a <i>complement</i> to capabilities work.</li></ul>", "parentCommentId": null, "user": {"username": "deep"}}, {"_id": "rXHp88DPkWwNTbwEh", "postedAt": "2023-03-30T14:44:20.883Z", "postId": "Ackzs8Wbk7isDzs2n", "htmlBody": "<blockquote>\n<p>Solving (scalable) alignment might be worth lots of $$$ and key to beating China.</p>\n</blockquote>\n<p>.</p>\n<blockquote>\n<p>I really don't want Xi Jinping Thought to rule the world</p>\n</blockquote>\n<p>.</p>\n<blockquote>\n<p>If you want to win the AGI race, if you want to beat China, [...]</p>\n</blockquote>\n<p>.</p>\n<blockquote>\n<p>Let’s not lose to China [...]</p>\n</blockquote>\n<p>The China-is-an-opponent-that-we-must-beat-in-the-AI-race is a classic talking point of AI companies in the US, that is used as an argument against regulation. Are you by any chance affiliated with an AI company, or an organization that is funded by one?</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "dPv66RzAMRfKQweBu", "postedAt": "2023-10-30T07:11:36.075Z", "postId": "Ackzs8Wbk7isDzs2n", "htmlBody": "<p>Given your position I am concerned about the arms race accelerationism messaging in this post. Substantively, the major claims of this post are \"China AI progress poses a serious threat we must overcome via AI progress (that is, we are in an arms race)\" and \"society may regulate AI such that projects that don't meet a very high standard of safety will not be deployable\". The argument is that pursuing safety follows from these premises, mostly the latter.&nbsp;<br><br>This can be interpreted in a number of ways, charitably or uncharitably. Independent of that, I do not think it is really a good idea to talk this way about AI, re: geopolitics. It has a very bad track record with other stuff such as nukes, and I'm not sure who the intended audience is (are capabilities CEOs China hawks who can only be convinced to slow down if framed in terms of beating China? big if true)</p>", "parentCommentId": null, "user": {"username": "Agrippa"}}]