[{"_id": "avrXk9uZy854q3AT5", "postedAt": "2023-11-24T12:37:07.055Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>Hi Oliver — thanks for the feedback! I agree with your general point here but want to flag a couple things on our end:</p><ol><li>Currently we are still approving travel grants (for all conferences from any location), albeit at a more limited capacity than we were approving in 2022.</li><li>The point here also stands somewhat for our other conferences, and if we were to move the London conference to say October, we'd then need to move our other conferences around. This would likely position <i>some </i>conference in April/May/June (which is exam season in other countries too), especially as we generally like to host conferences in warmer seasons.</li></ol>", "parentCommentId": null, "user": {"username": "Eli_Nathan"}}, {"_id": "REXLSLCteqmE76rDb", "postedAt": "2023-11-24T13:29:38.171Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>Ok, this makes a lot of sense! I wasn't sure if it was even a consideration.&nbsp;</p><p>However, why not the US in May/June? My impression was that finals hold a lot less weight there than in the UK, and the US academic system weighs grades a lot less in general. People care a <i>lot</i> about exams in the UK.</p>", "parentCommentId": "avrXk9uZy854q3AT5", "user": {"username": "OliverHayman"}}, {"_id": "dmCdGeQ3LaJzeKxtg", "postedAt": "2023-11-24T14:34:40.960Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>It's possible we should move the US event to May/June, though it's not obvious to me that that's the best move as finals still do have some weight there — I know it's less than the UK but I don't know that people's behavior is going to shift that much if an exam season is worth 50% of their grade vs 100%.</p><p>The US also has more potential attendees in general than the UK, which I think counts for something here. There are also just other downsides to shifting our conference schedule around too much, and most of our attendees aren't students anyway.</p>", "parentCommentId": "REXLSLCteqmE76rDb", "user": {"username": "Eli_Nathan"}}, {"_id": "KcKSw3yGNysTgYDfF", "postedAt": "2023-11-24T15:15:52.789Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>Ah, I did not realize the US ones are larger, this also makes sense.<br><br>I think my final skepticism is that US schools end much earlier than UK schools. I don't think they have finals in late May/early June (except maybe Stanford?). So I'm skeptical that there isn't a way to do this so that all final exams are avoided?</p>", "parentCommentId": "dmCdGeQ3LaJzeKxtg", "user": {"username": "OliverHayman"}}, {"_id": "fqruDP34i9zxfn4yw", "postedAt": "2023-11-24T16:50:56.720Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>What if you just pushed it back one month - to late June?</p>\n", "parentCommentId": "avrXk9uZy854q3AT5", "user": {"username": "RyanCarey"}}, {"_id": "Eq6R2fPGfX6JrpFMG", "postedAt": "2023-11-24T17:20:03.338Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>Open to it for 2025, though looks like at least <a href=\"https://www.ox.ac.uk/about/facts-and-figures/dates-of-term\">Oxford</a> will still have exams then (exams often stretch until 1–2 weeks after the end of term). But early July might work and we can look into what dates we can get when we start booking.</p>", "parentCommentId": "fqruDP34i9zxfn4yw", "user": {"username": "Eli_Nathan"}}, {"_id": "B5JvJaE65nxSXuiop", "postedAt": "2023-11-24T18:41:32.616Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>A side consideration - assuming a UK-based EAGx is being planned for next year, perhaps that could be planned to co-incide with holidays from UK univerisites, and perhaps be more favourable from applications from students who wanted to attend/apply to EAG London 2024 but didn't for the reason Oliver states?</p><p>[<strong> aside: I </strong>know organising events isn't an easy thing, just want to make it clear this is more of a consideration rather than a demand :) ]</p>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "wy8aqAmgMm2toCinC", "postedAt": "2023-11-24T19:56:47.429Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<p>In Canada my final exams finished in April</p>\n", "parentCommentId": "KcKSw3yGNysTgYDfF", "user": {"username": "Khorton"}}, {"_id": "HLZwiFDLGMJggqRHn", "postedAt": "2023-11-27T18:07:12.953Z", "postId": "aCSuyhMkMREjyFnLm", "htmlBody": "<blockquote><p>perhaps that could be planned to co-incide with holidays from UK univerisites</p></blockquote><p>Yes, this is the plan for any potential UK EAGx (though it's not yet confirmed). Other considerations include:</p><ul><li>Running it late enough in the academic year such that students new to EA in the autumn terms can benefit.</li><li>Avoiding summer because many students travel/take internships/go on holiday.</li><li>Ensuring the organisers have capacity to run it (i.e. if they're students, organising doesn't heavily affect their studies)</li><li>The availability of (cheap) venues.</li></ul><p>This means that the spring break is currently our best guess, and as early as possible in that window so as to be further from exams.&nbsp;</p><blockquote><p>perhaps be more favourable from applications from students who wanted to attend/apply to EAG London 2024 but didn't for the reason Oliver states?</p></blockquote><p>The event is already designed to be maximally favourable to UK students so they wouldn't need to flag this.<br><br>[I help run EAGx]</p>", "parentCommentId": "B5JvJaE65nxSXuiop", "user": {"username": "OllieBase"}}]