[{"_id": "8SuYsBHS4kBCqwFeK", "postedAt": "2022-08-28T16:39:50.237Z", "postId": "aCvheziKSkesbDeXC", "htmlBody": "<p>Ok, you win. &nbsp;Eight down votes and no feedback of any kind. &nbsp; This series and perhaps any that might have followed are now concluded. &nbsp; &nbsp;Have fun clicking buttons.</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "gyHmW8gm7zujDipxY", "postedAt": "2022-08-29T13:54:25.227Z", "postId": "aCvheziKSkesbDeXC", "htmlBody": "<p>In my view, downvoting this post is a little harsh (the karma is -10 with 5 votes at the time I am writing this). I understand it could be more detailed, so it might not be worth upvoting (depending on one's bar). However, downvoting on this basis makes the people who write them feel unwelcome, and discourages quick posts, which could arguably still be useful as long as they are not counterproductive or ill-intentioned.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "et3dKJhiixnLyAwR8", "postedAt": "2022-08-29T14:06:24.420Z", "postId": "aCvheziKSkesbDeXC", "htmlBody": "<p>This post series would have become far more detailed if it had continued, which it will not. &nbsp; It's no biggie. &nbsp; I have the information involved, and others are free to find it on their own should they so choose.</p>", "parentCommentId": "gyHmW8gm7zujDipxY", "user": {"username": "Phil Tanny"}}, {"_id": "S42TaxpgJ3jExEQup", "postedAt": "2022-08-30T02:21:47.273Z", "postId": "aCvheziKSkesbDeXC", "htmlBody": "<p>I may not have downvoted under normal conditions for the reasons you mentioned. Generally I upvote new posters who seem unfamiliar with EA, or leave comments to encourage further engagement. I definitely don't like to see the votes fall below 0 without explanation (unless its damaging to forum etiquette in some way). &nbsp;But three factors made me willing to discourage engagement in this present form:</p><ul><li>Two other posts by the same author were made in the span of a few days, both of which seem like they could be worked over more carefully before placing into one of the limited slots on the front page.</li><li>I don't think this forum is an appropriate space to develop one individual's philosophy, without something special it has to contribute... I'm not able to articulate this clearly, please trust I am struggling to capture something I think is important and have pattern matched from other people as well, sorry I cannot do it justice.</li><li>Especially not if all these posts are to be made without additional detail/careful consideration. In its current state I think this post is better as a shortform or a blog post while the series is being composed.</li><li>The author states they intend it to be a series and this magnified all the issues I had above. It would be welcome for a post or two, but an entire series magnifies its impact too far. I was responding to that.</li><li>It is not clear in this post how it affects EA. Especially because EA already addresses minds rather than bodies, I think?</li></ul><p>As to why I am critical of this posts quality, I think its stating something already familiar to most people on this forum, and further I believe it can be summarized in a few sentences:</p><blockquote><p>We are minds, not bodies. If we had to pick one, most of us would pick keeping our mind over keeping our body. \"Me\" is a collection of ideas, memories, opinions, personality traits and other symbolic abstractions. &nbsp;\"Me\" is made of thought.</p><p>Given that we are essentially thought, what is thought? &nbsp;(not addressed in this post)&nbsp;</p><p>We must study who we are, not just study how to invent and use technology.</p></blockquote><p>It is also not clearly relevant to EA, as it is currently written. Presumably further posts would cover that, but it wasn't delved into in this post, so I felt comfortable downvoting on those grounds.&nbsp;</p><p>My thoughts on the content of this post:<br>Personally I don't think it is clear we must study and know who we are, even though it is one of my favorite activities! It can be terribly useful, but it can also be not very influential on other domains. Its hard to tell if this will lead to something influential or something important but non-consequential.</p><p>Post script:<br>I will attempt to give similar feedback on the other posts, but I did not feel I had time to do so and was especially discouraged when there were three in a row to try to provide feedback on.</p><p>Hope this gives a face to the downvoters. I am also discouraged by lack of engagement and wonder why on earth I was downvoted. But I try to chalk it up to how it takes time to learn all the things involved in EA and I don't know what things are obvious to regulars who have worked on this for years. I understand they don't always have time to walk me through something that is already established elsewhere, even though I don't always know where the \"elsewhere\" is.&nbsp;</p><p>Try to approach disagreements with curiosity. ;)<br>I wish you the best in the development and refinement of your philosophy. And all your further conversations!</p>", "parentCommentId": "gyHmW8gm7zujDipxY", "user": {"username": "EcologyInterventions"}}, {"_id": "QNwH5EMDf8nbJW9yn", "postedAt": "2022-08-30T15:42:17.268Z", "postId": "aCvheziKSkesbDeXC", "htmlBody": "<p>I found this quite helpful, thanks!</p>", "parentCommentId": "S42TaxpgJ3jExEQup", "user": {"username": "vascoamaralgrilo"}}]