[{"_id": "fhPyYduFGpEeZqfmM", "postedAt": "2022-11-17T18:43:54.479Z", "postId": "Adfwn6JD8cLn9QE3L", "htmlBody": "<p>I quite like this. The downvotes might be because \"meta-ethics\" has a <a href=\"https://plato.stanford.edu/entries/metaethics\">distinct meaning</a> in moral philosophy, so some people may have taken one look at the title and thought, \"Um, no it isn't.\"</p><p>[Edited to add: You might have more luck arguing that deontological ethics and virtue ethics actually belong in the domain of <a href=\"https://iep.utm.edu/applied-ethics/\">applied ethics</a> - and maybe even <a href=\"https://en.wikipedia.org/wiki/Aesthetics\">aesthetics</a> in places - while <a href=\"https://en.wikipedia.org/wiki/Normative_ethics\">normative ethics</a> should just be in the business of figuring out which consequentialist theory is correct.]</p>", "parentCommentId": null, "user": null}, {"_id": "nnm8488dv5hDXpLGA", "postedAt": "2022-11-17T18:54:29.517Z", "postId": "Adfwn6JD8cLn9QE3L", "htmlBody": "<p>Thanks! Changed it to reflect this. As I said, not knowledgeable about ethics.</p>\n<p>It would be nice if  others would say something like this rather than just down-voting haha.. In any case, your comment is exactly the type of guidance I appreciate!</p>\n", "parentCommentId": "fhPyYduFGpEeZqfmM", "user": {"username": "Jordan Arel"}}, {"_id": "JKTtfGJcxXsmX4HYZ", "postedAt": "2022-11-17T22:46:43.388Z", "postId": "Adfwn6JD8cLn9QE3L", "htmlBody": "<p>I think many non-consequentialists really do disagree with utilitarians, and we should leave conceptual room for this to make sense.&nbsp;</p><p>So for a different way of conceptualizing the terrain (one that better fits with standard philosophical usage, I think, but agrees with you that utilitarianism is fundamentally an account of the moral goals), see my recent post '<a href=\"https://rychappell.substack.com/p/ethical-theory-and-practice\">Ethical Theory and Practice</a>'.</p>", "parentCommentId": null, "user": {"username": "RYC"}}]