[{"_id": "bPjQBKgDL2qDgdhLD", "postedAt": "2014-12-31T22:40:08.125Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I've just realized that a possible failure mode here would be conversation descending into a general discussion of abortion, which I've <em>avoided</em> doing so in the post. Instead, please limit any comments to the actual subject of the post:</p>\n<ul>\n<li>The impact of EA beliefs on our other beliefs</li>\n</ul>\n<p>Thus the article discusses the impact of believing in animal rights on fetus-personhood - but not the object-level issue of whether fetuses are people.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "hc5PxFSjowmCwh6sM", "postedAt": "2015-01-01T00:46:47.551Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Upvoted; good piece.</p>\n<blockquote>\n<p>I think this is a pretty repugnant attitude in general, and a particularly objectionable instance of it, but I include it here for completeness.</p>\n</blockquote>\n<p>It sounds like your statement here amounts to \"this attitude triggers a disgust response in me, therefore it's incorrect\".  I'm not persuaded.  A more persuasive argument: there's a danger that our hypothetical woman aborts her fetus, gets rich, and then uses her developing powers of rationalization to find some reason not to give very much money to charity.</p>\n<p>Thought experiment: Let's say instead of being a woman, we're dealing with a female android.  Unlike humans, androids always know their own minds perfectly, never rationalize, keep all their promises, etc.  The android tells you in her robotic voice that she's aborting her android fetus so she can make more money and save more lives, and you know for a fact that she's telling the truth.  Does your answer to her stay the same?</p>\n<p>Another thought: Maybe the reason you feel that this attitude is repugnant is because it sounds hypocritical.  In that case, it might be useful to distinguish between preferences and advocacy.  For example, maybe as an EA I would prefer that non-EA women carry their unwanted fetuses to term for the reasons you outline.  But that doesn't mean that I have to start protesting at abortion clinics.  If someone came to me and asked me whether they should carry their baby to term or not, it seems reasonable for me to respond and say \"Well, what are your opportunity costs like?  Where will the time and energy raising your baby be spent if you choose to abort it?\" and listen to her before giving my answer.</p>\n<p>In fact, I would argue that endorsing many universal moral principles, such as \"don't abort fetuses\", \"don't eat animals\", and \"borders should be open\", effectively amount to compartmentalization--the very thing you wrote this essay against.  The real world is complicated.  Our values are complicated.  Simple principles like \"don't eat animals\" are intuitively appealing and easy for groups to rally around.  But, inconveniently, the world is not simple and our moral principles will conflict.  When our moral principles conflict, we should have a process for resolving those conflicts.  I'm not sure that process should favor simplicity in the result.  In the context of discussing a single principle, the way you discuss your \"don't abort fetuses\" principle here, it's easy to compartmentalize and avoid letting the \"replaceability\" principle in to the \"don't abort fetuses\" compartment.  I wonder whether if your essay had been about replaceability instead of abortion, you would have come to the opposite conclusion.  In other words, I wonder if humans have a bias towards letting moral conflicts resolve in favor of whichever moral principle is most salient.  That seems suboptimal.</p>\n<p>Another thought: If women are morally obligated to carry unwanted babies to term, are they also obligated to pump out as many babies as possible during their fertile years?  Personally, the idea that the two cases are different strikes me as status quo bias.  (Idea based on <a href=\"http://www.nickbostrom.com/ethics/statusquo.pdf\">this paper</a>.)</p>\n", "parentCommentId": null, "user": {"username": "xccf"}}, {"_id": "9Wan6fMDmstE9PDH9", "postedAt": "2015-01-01T00:55:00.156Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>&quot;Many think EA ideas argue for vegetarianism – but did anyone come to this conclusion who had previously been passionately carnivorous?&quot;</p>\n<p>I'm not sure what it means to be passionately carnivorous, but before I was exposed to EA ideas I ate animal products, enjoyed doing so, and did not anticipate stopping. I am now a vegan, and donate to non-human animal charities. My conversion to veganism was based partly on the moral arguments to do so, and partly on moral luck. I wouldn't quite say that EA ideas argue for veganism (I think the &quot;A&quot; part suffices), but I would say that EA ideas give a strong argument for charities that promote reduction of animal product consumption.</p>\n", "parentCommentId": null, "user": {"username": "DanielFilan"}}, {"_id": "qwrSDT7ZKMF6o3Kmz", "postedAt": "2015-01-01T02:08:12.207Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>You should probably edit this into the post to make sure it's visible to everyone who comments.</p>\n", "parentCommentId": "bPjQBKgDL2qDgdhLD", "user": {"username": "Ben_Kuhn"}}, {"_id": "R7EGS5t8i2hYzBSZZ", "postedAt": "2015-01-01T15:33:43.428Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I agree with pretty much all of this, especially the last two paragraphs. </p>\n<p>That last comparison also highlights that the argument against abortion in the popular space is overwhelmingly deontological, rather than consequentialist; it revolves around whether 'foetuses are people' or not, and therefore whether 'abortion is murder' or not, with the assumption granted (on both sides) that murder is automatically wrong. Which is why the popular space doesn't make the link between women having abortions and women simply choosing not to have children.</p>\n<p>And if you are deontological in your thinking, the argument about moral uncertainty is pretty strong; a 10% chance (say) of committing murder sounds terrible.</p>\n<p>But for me personally, as I've become more consequentialist in my thinking (which EA has been a part of, though not the only part), it's actually pushed me more and more pro-abortion.</p>\n", "parentCommentId": "hc5PxFSjowmCwh6sM", "user": {"username": "AGB"}}, {"_id": "X85sBodqShjjLvw9C", "postedAt": "2015-01-01T20:21:16.589Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I'll try not to descend into object-level here, but I'll continue using your original example.  I was anti-choice before I became an EA.  EA has actually pushed me to believe, on a rational level, that abortion is of utilitarian value in many cases (though the population ethics are a bit unclear).  However, on a visceral level I still find abortion deeply distasteful and awful.  So I still &quot;oppose&quot; abortion, whatever that means.  I think as an EA, it's okay to have believies (as opposed to beliefs) that are comforting to you, as long as you don't act on them.  Many political issues fall into this category.  Since I don't vote on the issue of abortion and will probably not become accidentally pregnant, my believy isn't doing any harm.  </p>\n<p>Believies:</p>\n<p><a href=\"https://www.youtube.com/watch?v=cFsouvVdoJQ\">https://www.youtube.com/watch?v=cFsouvVdoJQ</a></p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "QZCCxSbozepdBCcgA", "postedAt": "2015-01-01T22:00:31.384Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I've just skimmed this, so sorry if any of these points are covered already.</p>\n<p>(1) On the moral uncertainty argument: I think people tend to overlook the fact that abortion can be morally obligatory according to utilitarianism. If having a child will divert the time and financial resources of people away from more effective causes then, especially if we consider the expected far future impact of those resources, someone can be strongly morally obligated to have an abortion. In general, it seems like utilitarianism is going to tend to have pretty strong recommendations either for or against abortion in a given case, depending on the particulars of that case. In cases where someone is morally obligated to have an abortion according to utilitarianism, we have a case of disagreement between moral theories and not a case of moral dominance under uncertainty. I still think that it means we should think that abortion is worse in most cases than it is typically considered, but it seems worth noting that this isn't a simple dominance case as is sometimes assumed.</p>\n<p>(2) On the QALY assessment of abortions: People have mentioned that this sort of calculation seems to entail that women should consistently get pregnant and adopt out the children throughout their fertile years. One issue here is that it's the additional QALY benefit or loss of having children compared with what the person would have done that should be considered when we try to determine how morally good it is for people to have children. And it seems like a lot of people have the ability to move more QALYs with their resources and time than would be created by having children (either by giving to effective causes, or by convincing or paying someone else to have a child). I think it's very implausible that EAs should have children instead of using those resources elsewhere. Of course, it's less clear in the case of non-EA people. But then I think &quot;if you're not going to spend your money and time more morally, then you're morally obligated to have children whenever they are able to&quot; is a view that it would probably be damaging to publicly endorse. </p>\n<p>(3) We might be worried about how the moral uncertainty argument applies in other cases. For example, homosexual acts seem to be mildly morally good on utilitarian views, but according to a lot of religious moral theories, homosexual acts are very morally bad (and very few moral theories say that they are morally good to the same degree). Does this mean that homosexual acts are a potentially prohibited under moral uncertainty? Perhaps not, but it seems worth noting that using the moral uncertainty arguments to argue against acts like abortion might lead people to this kind of example, so it's worth having something to say about them.</p>\n", "parentCommentId": null, "user": {"username": "Amanda_MacAskill"}}, {"_id": "wzsTGpQ4kwDtfSbrL", "postedAt": "2015-01-01T23:03:24.160Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I don't think this is a fair restriction on commentary for this sort of article, especially since you go into the example in such detail. You're suggesting that having EA beliefs seems to imply a higher degree of belief in the immorality of abortion than some people do have. People can respond to this by (a) retaining their abortion beliefs and changing their EA beliefs, (b) retaining their EA beliefs and changing their abortion beliefs, (c) retaining their EA beliefs and their abortion beliefs and rejecting the consistency requirement, or (d) retaining their EA beliefs and their abortion beliefs and rejecting the entailment. I don't really see why we should prevent people from defending (d) here. </p>\n", "parentCommentId": "bPjQBKgDL2qDgdhLD", "user": {"username": "Amanda_MacAskill"}}, {"_id": "3MGKDcgHzHZ5xePjL", "postedAt": "2015-01-01T23:09:30.371Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I agree with Amanda that you discuss abortion at too much length to not make it open for discussion.</p>\n", "parentCommentId": "bPjQBKgDL2qDgdhLD", "user": {"username": "Peter_Hurford"}}, {"_id": "j5rfttErokmcM7fcv", "postedAt": "2015-01-02T04:07:00.665Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p>&quot;this attitude triggers a disgust response in me, therefore it's incorrect</p>\n</blockquote>\n<p>Ironically I was partly worried about being accused of offering a straw (wo)man so wanted to distance my self from it.</p>\n<blockquote>\n<p>Does your answer to her stay the same?</p>\n</blockquote>\n<p>Good analogy. I think I'm basically concerned that this is <a href=\"http://lesswrong.com/lw/uv/ends_dont_justify_means_among_humans/\">not the sort of reasoning we can accept from fallible humans</a>, not that it is inherently wrong, so I would be much more tolerant of the android. I Earn to Give, so vaguely similar considerations come up - some activities which are generally self-serving, but are transformed into altruistic resulting donations. In general I think the potential for personal self-deception is sufficiently high that I don't endorse such activities in myself. I guess perhaps I think we're less serious about altruism than we often like to think we are.</p>\n<p>You have a good point about second-order compartmentalization. </p>\n<blockquote>\n<p>If women are morally obligated to carry unwanted babies to term, are they also obligated to pump out as many babies as possible during their fertile years? My moral intuitions suggest they are. </p>\n</blockquote>\n<p>Yeah I think this is also credible, albeit slightly less so. I frequently feel guilty about not having had children yet. Nor can I simply defend myself by arguing they are too expensive as:</p>\n<ul>\n<li>I think Bryan Caplan's argument that children can be raised with dramatically less effort than most middle-class westerners put in is correct.</li>\n<li>Jeff and Julia's recent accounts do suggest it can be done.</li>\n<li>I know my friends and family would be supportive, or even actively pleased. </li>\n<li>I reject this argument in the abortion case</li>\n<li>I am a consequentialist and am not very keen on making an omissions-act distinction.</li>\n</ul>\n<p>It's also an unusual case because it's one where I am actually falling morally short of the majority of women throughout history. I guess this is how people who think that the 20th century was a disaster because of factory farming feel.</p>\n", "parentCommentId": "hc5PxFSjowmCwh6sM", "user": {"username": "Dale"}}, {"_id": "GKKNo9YcrHbAWGNcf", "postedAt": "2015-01-02T04:09:53.213Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I meant the sort of carnivore who says things like</p>\n<blockquote>\n<p>For every animal you don't eat, I'm going to eat three <em>(<a href=\"http://www.thebestpageintheuniverse.net/c.cgi?u=sponsor\">source</a>)</em></p>\n</blockquote>\n<p>takes delight trying to persuade their vegetarian friends to try bacon, and so on.</p>\n", "parentCommentId": "9Wan6fMDmstE9PDH9", "user": {"username": "Dale"}}, {"_id": "4MhuiHsvEyDjn4RxP", "postedAt": "2015-01-02T08:17:14.616Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p>I think I'm basically concerned that this is not the sort of reasoning we can accept from fallible humans, not that it is inherently wrong, so I would be much more tolerant of the android.</p>\n</blockquote>\n<p>Cool.  I don't know how I feel about Eliezer's ethical injunctions sequence.  I'd say I basically agree with it, with the caveat that I'm maybe half as concerned about it as he is.  I'm happy to pirate books, leave lousy tips, &quot;forget&quot; to put away dishes so non-EA roommates do it, etc. in the service of EA, but I'd think very hard before, say, murdering someone.</p>\n<p>That said, I'm glad that <em>Eliezer</em> is as concerned as he is... it does a good job of making up for the fact that he's so willing to disregard the opinions of others (to his discredit, in my opinion).  You've got to have some kind of safeguard.  I guess maybe in my case I feel like I'm well safeguarded by thinking carefully before straying outside the bounds of what friends &amp; society regard as non-horrible ethical behavior, which is why I'm not concerned about aborting a baby leading to some kind of slippery slope of unethicalness... it's on the &quot;sufficiently ethical&quot; side of my &quot;publicly regarded as non-horrible&quot; <a href=\"http://lesswrong.com/lw/ase/schelling_fences_on_slippery_slopes/\">fence</a>.</p>\n<blockquote>\n<p>I frequently feel guilty about not having had children yet.</p>\n</blockquote>\n<p>I think you're only morally obligated to have kids insofar as they're the cheapest way to purchase QALYs with your time, energy, and money.  I expect existential risk reduction is the cheapest way to do this if you think future lives have value comparable to present lives.*  I'm not sure how it compares to Givewell's top charities.  If it turns out having kids really is the cheapest way to purchase QALYs, I wonder if you're best off focusing on efforts to get other people to have kids (or improving gender relations so people get married more, or something like that), and only have kids to facilitate your advocacy and make it clear that you aren't a hypocrite.</p>\n<p>* <a href=\"http://www.overcomingbias.com/2010/11/fertility-the-big-problem.html\">This</a> is the strongest argument I've seen for this perspective from a valuing-future-life perspective, but others have argued that decreased fertility and a slowing economy will be <em>good</em> for x-risk reduction--the issue seems complicated.</p>\n<p>One final point: I tend to think that even in well-developed countries, many people live lives that are full of misery (I'm wealthy and privileged and employed with hundreds of facebook friends and I still feel intense misery much more often than I feel intense joy).  That's part of the reason why I'm so bullish on H+ causes.</p>\n", "parentCommentId": "j5rfttErokmcM7fcv", "user": {"username": "xccf"}}, {"_id": "8TXfmzyyLzJzPFGg5", "postedAt": "2015-01-02T09:28:51.084Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>This is plausibly just the typical mind fallacy, but I've always read these as more &quot;being annoyed by fake moral sanctimony, and signalling opposition to it&quot; than actually being pro-omnivory.</p>\n", "parentCommentId": "GKKNo9YcrHbAWGNcf", "user": {"username": "DanielFilan"}}, {"_id": "h6fbB6TZvDsPtsnuh", "postedAt": "2015-01-02T09:32:27.801Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p>And if you are deontological in your thinking, the argument about moral uncertainty is pretty strong; a 10% chance (say) of committing murder sounds terrible. But for me personally, as I've become more consequentialist in my thinking (which EA has been a part of, though not the only part), it's actually pushed me more and more pro-abortion.</p>\n</blockquote>\n<p>I think this is missing the point of the post. I'm sure you are pretty consequentialist in your thinking, so am I. But are you certain that consequentialism is the correct moral theory? Such certainty seems implausible, there are lots of examples where consequentialism is in favour of things that seem crazy. If you do have some credence in moral theories that ban murder, and that include abortion as a case of murder, you are going to have to take that into account if you wish to act morally.</p>\n", "parentCommentId": "R7EGS5t8i2hYzBSZZ", "user": {"username": "DanielFilan"}}, {"_id": "vsTrW5QTQfLunDWCp", "postedAt": "2015-01-02T11:21:01.310Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Maybe I'm misunderstanding you, but I actually don't think I missed that point at all if you read to the end of my post. </p>\n<p>The whole point is that I'm not certain that consequentialism is correct but that my internal probability of it being so has been sharply rising, which is why &quot;as I've become more consequentialist in my thinking...it's actually pushed me more and more pro-abortion&quot;. The 'more' implies lack of certainty/conviction here both for my current and (especially) my past self.</p>\n<p>I'm claiming that deontology broadly provides more of the anti-abortion arguments than consequentialism does, certainly in the popular space. So it's reasonable for more consequentialist groups (like EAs) to be more pro-abortion.</p>\n", "parentCommentId": "h6fbB6TZvDsPtsnuh", "user": {"username": "AGB"}}, {"_id": "widZbm62AumKn8iig", "postedAt": "2015-01-02T15:58:16.479Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>This post made me rather uncomfortable. I think what got to me was a somewhat flippant expression of what it was like for 'Sarah' to be unwantedly pregnant: &quot;She has made plans which are inconsistent with being pregnant, and prefers not to give birth at the current time.&quot;, which is summarised in the table as the idea that bringing the fetus to term would be 'inconvenient'. This seems dismissive of the suffering which could be entailed by bringing it to term.</p>\n<p>While it seems quite likely that people do compartmentalise, in this particular example it's not at all clear to me that that is a bad rather than good thing. Abortion is a very hot button topic. We're not likely to get any leverage on it one way or the other, because of the resources already invested pushing both ways. It's also likely to be emotional to people (as Lila described in her comment). So actually, taking pains to think through what implications effective altruist ideas might have for abortion, and discussing it a bunch, might just have negative consequences. It might be better to start by focusing on areas where we can 'push the rope sideways'. </p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "or8GRFrNP2FyxLStL", "postedAt": "2015-01-02T16:10:59.282Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>If you don't think abortion is a good concrete application to discuss, you should probably change the original post to work through a different example.</p>\n", "parentCommentId": "bPjQBKgDL2qDgdhLD", "user": {"username": "Robert_Wiblin"}}, {"_id": "3uc5RA53jSzs62n9z", "postedAt": "2015-01-02T17:08:24.497Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I think if you want people to think about the meta-level, you would be better off with a post that says &quot;suppose you have an argument for abortion&quot; or &quot;suppose you believe this simple argument X for abortion is correct&quot; (where X is obviously a strawman, and raised as a hypothetical), and asks &quot;what ought you do based on assuming this belief is true&quot;. There may be a less controversial topic to use in this case.</p>\n<p>If you want to start an object level on abortion (which, if you believe this argument is true, it seems you ought to), it might be helpful to circulate the article you want to use to start the discussion to a few EAs with varying positions on the topic before posting for feedback, because it is on a topic likely to trigger political buttons.</p>\n", "parentCommentId": "bPjQBKgDL2qDgdhLD", "user": {"username": "William_S"}}, {"_id": "kQvFyvb8QAXAATceH", "postedAt": "2015-01-02T17:56:02.114Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>When considering a controversial political issue, an EA should also think about whether there are positions to take that differ from those typically presented in the mainstream media. There might be alternatives that EA reasoning opens up that people traditionally avoid because they, for example, stick to deontological reasoning and believe that either an act is right or it is wrong in all cases, and that these restrictions should be codified into law.</p>\n<p>For the object level example raised in the article, the traditional framing is &quot;abortion should be legal&quot; vs. &quot;abortion should be illegal&quot;. Other alternatives to this might be, for example, performing other social interventions aimed at reducing the number of abortions within a framework where abortion is legal (ie. increasing social support offered to single mothers, so that fewer people choose to have an abortion).</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "Y8DydXtecfsaenmrY", "postedAt": "2015-01-02T22:17:46.273Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>This seems to be a further example of what the OP's point that she overlooked. There are multiple principles one might use to differentiate the two views:</p>\n<ul>\n<li>It is bad to abort a foetus</li>\n<li>It is good to have children</li>\n</ul>\n<p>but many of them are not available to EAs:</p>\n<ul>\n<li>EAs tend not to believe in the acts-omissions distinction</li>\n<li>EAs tend not to hold person-effecting views of ethics</li>\n<li>EAs tend to value the welfare of those who have not even been conceived yet.</li>\n<li>EAs are unlikely to believe that having been responsibly chaste / using contraception <em>and thereby not becoming pregnant</em> relieves you of any responsibility for the unborn</li>\n</ul>\n", "parentCommentId": "hc5PxFSjowmCwh6sM", "user": {"username": "Larks"}}, {"_id": "X9Zdfx4SH5guNjJzm", "postedAt": "2015-01-02T22:24:15.874Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I remember Will bringing this up years ago in Oxford, but it's good to see the details of the QALY calculation worked out in detail. To generalise somewhat, it seems that because QALYs are bounded between 0 and 1 there's only limited room for quality-improvements. Instead, issues that involve life-and-death, either by increasing the number of people or their duration, will likely dominate the calculations - in this case the 70-odd QALYs from an entire life dominating the possible QALY-loss due to pregnancy, which is bounded inside [ 0 , 0.75 ].</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "M4GShFnZGNhPjg3kd", "postedAt": "2015-01-02T22:27:58.333Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p>We're not likely to get any leverage on it one way or the other, because of the resources already invested pushing both ways.</p>\n</blockquote>\n<p>Do you think we should give up on immigration as well? That's a pretty 'hot button topic' as well. At least in the UK it seems much more political than abortion.</p>\n", "parentCommentId": "widZbm62AumKn8iig", "user": {"username": "Larks"}}, {"_id": "A5RevSB42bRkituTh", "postedAt": "2015-01-02T22:30:30.368Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>When people like Jeff, Julia, Bryan say childrearing is cheap, they're saying that it shouldn't stop someone from doing it if they want to. Not that it's the cheapest way to make there be more people. That honour would go to existential risk reduction, or failing that to global health measures. Noone is trying to get effective altruists to have kids if they don't want to.</p>\n", "parentCommentId": "j5rfttErokmcM7fcv", "user": {"username": "RyanCarey"}}, {"_id": "YZeFx3oMtyBEKugjh", "postedAt": "2015-01-02T23:40:11.542Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>If your only point is that people with greater degrees of consequence should be more pro-abortion, then I would agree. However, I interpreted your comment as also saying or implying that you were, in fact, pro-abortion, which is of course different (and I apologise if you didn't imply this).</p>\n", "parentCommentId": "vsTrW5QTQfLunDWCp", "user": {"username": "DanielFilan"}}, {"_id": "etx9zHHfuuqW6DpEr", "postedAt": "2015-01-02T23:43:51.146Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>One relevant difference between abortion and immigration is that rival views about abortion, but not about immigration, correlate well with positions on the left-right continuum.  Pulling the rope sideways thus seems easier in the case of immigration, because you can appeal to both the left and the right, and cannot be accused of being partisan to either.</p>\n", "parentCommentId": "M4GShFnZGNhPjg3kd", "user": {"username": "Pablo_Stafforini"}}, {"_id": "hPgPADNMq8ib4Kq5z", "postedAt": "2015-01-03T00:22:17.922Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>My impression was that the left is pro-immigrant (at least more so than the right) and the far right is very xenophobic. </p>\n", "parentCommentId": "etx9zHHfuuqW6DpEr", "user": {"username": "Lila"}}, {"_id": "tFcngcvXCTKsQ5LH8", "postedAt": "2015-01-03T11:02:56.947Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>(I liked this post, but apologise for pushing into object level concerns.)</p>\n<p>It isn't wholly clear to me that 'EA concerns' will generally push against broadly liberal views on abortion - it seems to depend a lot on what considerations one weighed heavily either pro- or con- abortion in the first place. I definitely agree that common EA considerations could well undermine reasons which led someone to a liberal view of abortion, but it may also undermine reasons which led to a conservative one as well. A few examples of the latter:</p>\n<p>1) One may think that human life is uniquely sacred. Yet perhaps one might find this belief challenged (among other ways) by folks interested in animal welfare, and instead of setting humans on a different moral order to other animals, rather they should be on a continuum according to some metric that 'really' explains moral value (degree of consciousness, or similar). Although fetuses may well remain objects of moral concern, they become less sacrosanct, and so abortion becomes more conscionable.</p>\n<p>2) As Amanda alludes to, consequentialist/counterfactual reasoning will supply many cases where abortion becomes permissible depending on particular circumstances, especially where one lives in a world where QALYs are relatively cheap (suppose Sarah wants to continue her pregnancy, but I offer to give £20,000 to AMF if she has an abortion instead - ignoring all second-order effects, this is likely a good deal; more realistically, one could include factors like expected loss-of-earnings, stigma, etc. etc.). If one's opposition to abortion is motivated by deontological concerns, a move to teleological ways of thinking may lead one to accept that there will be many cases when abortion is morally preferable. </p>\n<p>3) Total views and replaceability could also be supportive, if Sarah anticipates to be in a better position to start a family later (so both her and the child stand to benefit), then the problem reduces to a different number population problem (imagine a 3x2 table - Sarah gains some QALYs by aborting over adopting, the 'current fetus' loses some QALYs by abortion, yet the 'counter factual' fetus gains even more QALYs by abortion, as it will be broad into existence and has - ex hypothesi - a better life than the current fetus would have). So the choice to abort (on the proviso to have a child in better circumstances) looks pretty good. (You are right to note there are other corrections, but they seem less significant).</p>\n<p>The all-things-considered calculus is unclear, but it is not obvious to me the 'direction of travel' after contemplating EA-related principles is generally against abortion, and I would guess even an 'EA perspective' constructed from the resources you suggest would not be considered a conservative view. It may be that the inconvenience and risk of being pregnant would be insufficient to justify an abortion by the lights of this 'EA perspective', but most women who had an abortion had weightier concerns motivating them - concerns the 'EA perspective' might well endorse as sufficient justification in the majority of cases abortions have actually occurred. </p>\n<p>There might be a regression to the mean issue where the considerations found compelling by-the-lights of one perspective will generally look less compelling when that perspective changes (so if one was 'pre-EA' strongly in favour of a liberal view on abortion, this enthusiasm would likely regress). There's also a related point that one should not expect all updates to be psychologically pleasant, and they're probably not that much more likely to comfort our prior convictions as to offend them. But I'm not sure the object-level example provides good support to the more meta considerations.</p>\n", "parentCommentId": null, "user": {"username": "Gregory_Lewis"}}, {"_id": "BgLKM8PLo99s6EAG2", "postedAt": "2015-01-03T11:38:33.075Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I certainly think we should be wary when discussing immigration: we should be aware that discussing it in detail could be destructive (eg alienate people with particular political affiliations entirely), and that it seems intractable. We might want to, for example, wait for the Copenhagen Consensus Centre to do more work on it, and see whether they come up with tractable ways to help the world based on it. On the other hand, the harm I was trying to describe in the case of abortion is far greater than immigration. While I would expect there to be somewhat few readers of the blog sufficiently emotionally attached to one view on immigration that they would experience a somewhat careless discussion of it as distressing, I would expect there to be decidedly more so on abortion. If abortion seemed a more tractable issue, it would likely still be worth having the discussion, but trying to be careful in the language used (just as when comparing the effectiveness of charities, it's important to be sensitive to the suffering relieved by charities which are <em>comparatively</em> ineffective). But given the current state of things, it doesn't seem worth it. This is compounded by the fact that effective altruism in general is sometimes seen as somewhat male dominated, and the people likely to be put off by insensitive-seeming discussion of abortion are likely to be disproportionately women. Given that, and the huge space of effective research to be done, and topics which need further analysis, it seems sensible to focus on those others rather than this one. </p>\n", "parentCommentId": "M4GShFnZGNhPjg3kd", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "kM8xt4wNSYFPMqBJX", "postedAt": "2015-01-03T12:38:55.368Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>This argument is based on an obligation to take any action that helps others more than it hurts us, but this is too strong.  There are many opportunities to help others with varying costs to ourselves and we should <a href=\"http://www.jefftk.com/p/balancing-costs-to-ourselves-with-benefits-to-others\">prioritize</a> them by the ratio of self-cost to other-benefit.</p>\n<p>You have:</p>\n<blockquote>\n<p>abortion: expected QALYs are -23.138</p>\n</blockquote>\n<blockquote>\n<p>adoption: expected QALYs are -0.247</p>\n</blockquote>\n<p>I would put the expected QALY impact of abortion as smaller and of carrying the baby to term as larger, but even taking your numbers as they are pregnancy is not as efficient as other options.  The ratio here is 93 to 1.  Lets look at some other options:</p>\n<ul>\n<li><p>Donating a <a href=\"http://www.jefftk.com/p/altruistic-kidney-donation\">kidney</a> is not as bad as pregnancy in terms of cost to yourself, so let's say -0.1 QALY.  Receiving a kidney gets someone about 10 years, and the ability of an altruistic person to enable a chain of donations means maybe this comes to 30 years on average, so say 30 QALYs.  This gives a ratio of 300 to 1.</p>\n</li>\n<li><p>Giving additional money to AMF or SCI is somewhat better than 1 QALY per $100.  The impact on a relatively well off first worlder of giving $100 is far less than 1 QALY, and would continue to be until getting down to <em>extremely</em> low levels of spending.  The ratio here is at least 1k to 1.</p>\n</li>\n</ul>\n<p>For the level of sacrifice involved in bringing an undesired child to term someone could have much more positive impact in other ways.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "xvarTAHCe74wEQkXs", "postedAt": "2015-01-03T12:51:00.294Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Perhaps kidney donation?  The sacrifice of kidney donation is smaller, the benefit is arguably larger because there's no moral uncertainty as to whether the recipients count, and a much larger fraction of us are in a position to donate one?</p>\n", "parentCommentId": "or8GRFrNP2FyxLStL", "user": {"username": "Jeff_Kaufman"}}, {"_id": "fPfR83zphZF7NxFji", "postedAt": "2015-01-03T16:43:46.924Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>It's probably not a good idea to tackle abortion for the reasons you give, but we can't know that if we never think through the implications of our beliefs ('compartmentalisation').</p>\n<p>There should probably be a private place to discuss issues like this and determine if they are worth bringing up more publicly, after taking account of the many downsides (stoking internal division, wasting effort on a mainstream issue, alienating/offending half of the political spectrum whichever position we take etc).</p>\n", "parentCommentId": "widZbm62AumKn8iig", "user": {"username": "Robert_Wiblin"}}, {"_id": "2tSCD8ieRPjEEhLsr", "postedAt": "2015-01-03T16:53:00.143Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Re use of 'inconvenient', I've also used that to describe things that are harmful, but fall short of e.g. a serious injury, for lack of a better English term. However, I've discovered that the general public thinks of inconveniences exclusively as things that wastes time or effort. So, for example, eating less tasty food is never an 'inconvenience', even if it is a modest harm.</p>\n<p>Using inconvenience this way is confusing, so I've stopped using it as a general term for medium-sized harms, and recommend others do the same.</p>\n<p>Instead we can use depending on context: loss, misfortune, modest/mild/serious harm, damage and hurt.</p>\n", "parentCommentId": "widZbm62AumKn8iig", "user": {"username": "Robert_Wiblin"}}, {"_id": "reobZ4FbEPy3S63Z7", "postedAt": "2015-01-03T17:10:59.100Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Discomfort, maybe</p>\n", "parentCommentId": "2tSCD8ieRPjEEhLsr", "user": {"username": "Lila"}}, {"_id": "GsubbkCd7JRvov33w", "postedAt": "2015-01-03T18:28:45.904Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Thanks for the post Dale. It's interesting to think about how EAs' beliefs touch on their other beliefs. It's received a bunch of criticism for focussing on a very controversial topic - abortion - and using offensive language - 'convenient', 'baby', not privately circulating drafts etc, criticism that I mostly agree with. As a moderator, it's not like I'm interesting in deleting the post here but I do hope that the information will be taken on-board to improve future posts!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "66JmnJufk2DXwk7J6", "postedAt": "2015-01-03T18:29:02.233Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>My main thought on matter is that de-compartmentalising has its disadvantages as well, as has been discussed in depth at (of-course!) LessWrong.</p>\n<p>First, here are some posts taking your old-school view that decompartmentalising is valuable: <a href=\"http://lesswrong.com/lw/2q6/compartmentalization_in_epistemic_and/\">Compartmentalisation in epistemic and instrumental rationality</a>, <a href=\"http://lesswrong.com/lw/2l6/taking_ideas_seriously/\">Taking Ideas Seriously</a>. They give similar arguments to you but in both cases, the authors have since revised their opinions. For the first piece, Anna wrote a <a href=\"http://lesswrong.com/lw/2q6/compartmentalization_in_epistemic_and/2mun\">significant comment</a> moderating her conclusions. For the latter piece, Will retracted it.</p>\n<p>Phil Goetz wrote one of LessWrong's most upvoted pieces, arguing that decompartmentalisation is often irrational, <a href=\"http://lesswrong.com/lw/18b/reason_as_memetic_immune_disorder/\">Reason as a Memetic Immune Disorder</a>.</p>\n<p>So why have people started off so in favour of compartmentalisation and now turned their positions around? If, like Dale, you're really interested in this topic, it's probably worthwhile to work through some of these original sources. But some of the general issues are that compartmentalising means treading an uncommon path, which means that you have fewer footsteps to follow in, which means that you'll end up with weird and incorrect beliefs a lot of the time. It's also very likely that decompartmentalising - letting some beliefs affect all areas of decision-making - will lead to fanaticism - overvaluing certain beliefs.</p>\n<p>It's kind-of a timeless question in rationality. But the growing consensus I'm discovering is that decompartmentalisation should be matched with what Anna calls 'safety features' - how to know when you have strange beliefs, and when to backtrack, when to think more, when to get friends to review your opinions, when to cede to the majority viewpoint, et cetera. Basically, I think that we need to work to put safety measures onto our thinking, and share these around the effective altruist community.</p>\n<p>Other posts about problems with consequentialism and rationality include <a href=\"http://lesswrong.com/lw/2aa/virtue_ethics_for_consequentialists/#more\">Virtue Ethics for Consequentialists</a> and the less relevant but also interesting <a href=\"http://lesswrong.com/lw/fyb/ontological_crisis_in_humans/\">Ontological Crises</a> though they're less directly relevant.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "yxBtr5f7JmdPog9Fd", "postedAt": "2015-01-04T07:09:58.126Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Good point. The advantage of AMF/SCI might be lower, though, considering the income and quality-of-life difference between poor and rich countries. Having a baby yourself is similar to having an extra poor-country birth <em>and then</em> increasing that person's income to rich-country levels (10-100x), although someone with a given income might be less happy in a rich country if they care about their relative wealth.</p>\n", "parentCommentId": "kM8xt4wNSYFPMqBJX", "user": null}, {"_id": "3n5HQkhW5rDEF6M38", "postedAt": "2015-01-04T18:10:34.510Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Yeah, I basically agree with this. The problem is that much of the EA movement relies on decompartmentalizing - Singer's classic Drowning Child argument basically relies on us decompartmentalizing our views on local charity from those on third world charity. </p>\n<p>Indeed, many people would argue that EAs are fanatical - imagine taking some weird philosophy so seriously you end up giving away millions of dollars! Or worse, giving up your fufilling career to become a miserable corporate lawyer!</p>\n", "parentCommentId": "66JmnJufk2DXwk7J6", "user": {"username": "Dale"}}, {"_id": "XPSuvNszjC4f4Dujm", "postedAt": "2015-01-04T18:14:08.559Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I agree with you, conditional on the person actually going on to donate a kidney, or donating a lot to AMF. Most people don't however - if they abort the fetus, they won't make a compensating kidney donation. So it seems like the right comparison for them.</p>\n<p>Obviously if utilitarianism etc. are false this argument doesn't work.</p>\n", "parentCommentId": "kM8xt4wNSYFPMqBJX", "user": {"username": "Dale"}}, {"_id": "nwxz4g44g5nkioiYF", "postedAt": "2015-01-04T18:38:01.622Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p>Although fetuses may well remain objects of moral concern, they become less sacrosanct, and so abortion becomes more conscionable.</p>\n</blockquote>\n<p>Good point. I suspect this may end up being mathematically equivalent to the moral uncertainty argument, which in practice equates to counting fetuses as having 30% of the value of an adult. In both cases EA-concerns lead to taking a midpoint between the &quot;fetuses don't matter&quot; and &quot;unborn babies are equally valuable&quot; points of view.</p>\n<blockquote>\n<p>So the choice to abort (on the proviso to have a child in better circumstances) looks pretty good. (You are right to note there are other corrections, but they seem less significant).</p>\n</blockquote>\n<p>My impression is that the largest determinant of child success is genetic, followed by shared environment - direct parental environmental influences are small. On the one hand, this suggests that simply waiting will not improve things all that much, especially as she should be uncertain as to whether her situation really will improve. On the other hand, it suggests an easy way to improve the 'quality' of the later baby - choose a higher quality father. This improvement quite possibly wouldn't be included in QALYs (as they are bounded above by 1) but seems significant nonetheless.</p>\n<blockquote>\n<p>There might be a regression to the mean issue where the considerations found compelling by-the-lights of one perspective will generally look less compelling when that perspective changes (so if one was 'pre-EA' strongly in favour of a liberal view on abortion, this enthusiasm would likely regress). </p>\n</blockquote>\n<p>That's a good point. Indeed, it seems that in basically every instance EA-considerations degrade the quality of the standard object-level arguments. They then make up for this by supplying entirely new arguments - moral uncertainty, replaceability.</p>\n<p>Do you have any cases in mind where EA considerations case psychologically unpleasant updates?</p>\n", "parentCommentId": "tFcngcvXCTKsQ5LH8", "user": {"username": "Dale"}}, {"_id": "XEM2zHXLAh7bPBWsv", "postedAt": "2015-01-04T18:40:46.079Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Yes - though perhaps this is a limitation in how QALYs are calculated.</p>\n", "parentCommentId": "X9Zdfx4SH5guNjJzm", "user": {"username": "Dale"}}, {"_id": "D3gtt7Q6f4ksgWthX", "postedAt": "2015-01-04T18:45:09.287Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p><a href=\"http://www.pewglobal.org/2014/05/12/chapter-3-most-support-limiting-immigration/\">Indeed</a>, you're <a href=\"http://www.washingtonpost.com/blogs/monkey-cage/wp/2014/09/29/a-left-right-divide-in-european-attitudes-toward-immigrants/\">right</a>.</p>\n", "parentCommentId": "hPgPADNMq8ib4Kq5z", "user": {"username": "Dale"}}, {"_id": "Q8wZjN44yDzFMdrZX", "postedAt": "2015-01-04T18:58:47.321Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p>This seems dismissive of the suffering which could be entailed by bringing it to term.</p>\n</blockquote>\n<p>The most frequently cited main motivation for aborting a fetus is</p>\n<ul>\n<li>&quot;Not ready for a(nother) child†/timing is wrong&quot; </li>\n</ul>\n<p>which does not mention suffering at all, and neither do the next two most frequently cited reasons</p>\n<ul>\n<li><p>Can’t afford a baby now</p>\n</li>\n<li><p>Have completed my childbearing/have other people depending on me/children are grown </p>\n</li>\n</ul>\n<p><em><a href=\"http://www.guttmacher.org/pubs/journals/3711005.pdf\">source</a></em></p>\n<p>Given the availability of adoption, &quot;inconvenient&quot; seems like a reasonable description for &quot;timing is wrong&quot;.</p>\n<p>I agree, however, that sometimes it might cause substantial suffering - hence why I suggested an annualized figure of 0.494 QALYs. That's a very high number! It suggests pregnant women would be almost indifferent between</p>\n<ul>\n<li><p>pregnancy and then adoption</p>\n</li>\n<li><p>a 50% chance of going into a coma for the rest of the year</p>\n</li>\n</ul>\n<p>which seems if anything to assign too great a negative weight to pregnancy. </p>\n<p>In I think we need to be very careful of <a href=\"https://en.wikipedia.org/wiki/Availability_heuristic\">availability bias</a> and <a href=\"http://lesswrong.com/lw/hw/scope_insensitivity/\">scope insensitivity</a>. Our individual preferences, and the suffering of already existing, literate people are very cognitively available - the opportunity cost is not. Doing explicit QALY calculations allows us to avoid this, but we have to actually <em>do</em> the calculations.</p>\n", "parentCommentId": "widZbm62AumKn8iig", "user": {"username": "Dale"}}, {"_id": "5v2TZgMy9C5J7e3ew", "postedAt": "2015-01-04T18:59:32.611Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Good phrase; I'll use it in future.</p>\n", "parentCommentId": "reobZ4FbEPy3S63Z7", "user": {"username": "Dale"}}, {"_id": "nZ3v5vegRvjX63ivv", "postedAt": "2015-01-04T19:08:01.461Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p>I think &quot;if you're not going to spend your money and time more morally, then you're morally obligated to have children whenever they are able to&quot; is a view that it would probably be damaging to publicly endorse.</p>\n</blockquote>\n<p>True, and it's worth breaking down what might be publcally damaging:</p>\n<ul>\n<li>the demandingness - that would take a lot of work, and people dislike being told they're immoral for not doing anything</li>\n<li>the hypocrisy - if you believed that EAs were exempt from this obligation</li>\n</ul>\n<p>But we shouldn't let considerations of what is politically correct affect what we believe. We should try to believe that which is true.</p>\n<blockquote>\n<p>We might be worried about how the moral uncertainty argument applies in other cases. For example, homosexual acts</p>\n</blockquote>\n<p>I'm not sure why this would be a worry. Yes, moral uncertainty arguments might contradict our prior beliefs. But what is the point of considering new arguments if not to change our minds? We shouldn't expect novel arguments to always yield reassuringly early-21st-century-liberal conclusions. (I say this as someone who believes gay marriage is probably a good thing).</p>\n", "parentCommentId": "QZCCxSbozepdBCcgA", "user": {"username": "Dale"}}, {"_id": "eKG7qDx6mnkRRqkGZ", "postedAt": "2015-01-05T01:07:14.397Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>In particular, QALYs don't incorporate money, only health. For large changes in health, this isn't that important, since generally people are willing to pay a lot for health ($50-100k for a 1% decreased chance of dying). In this case, however, the monetary costs of pregnancy might be comparable to the direct health costs.</p>\n", "parentCommentId": "XEM2zHXLAh7bPBWsv", "user": null}, {"_id": "DaiCX7HELu3HFBsDG", "postedAt": "2015-01-05T17:02:40.456Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I also posted this comment at Less Wrong, but I guess I'll post it here as well...</p>\n<p>As someone who's had a very nuanced view of abortion, as well as a recent EA convert who was thinking about writing about this, I'm glad you wrote this.  It's probably a better and more well-constructed post than what I would have been able to put together.</p>\n<p>The argument in your post though, seems to assume that we have only two options, either to totally ban or not ban all abortion, when in fact, we can take this much more nuanced approach.</p>\n<p>My own, pre-EA views are nuanced to the extent that I view personhood as something that goes from 0 before conception, to 1 at birth, and gradually increases in between the two.  This satisfies certain facts of pregnancy, such as that twins can form after conception and we don't consider each twin part of a single &quot;person&quot;, but rather two &quot;persons&quot;.  Thus, I am inclined to think that personhood cannot begin at conception.  On the other hand, infanticide arguments notwithstanding, it seems clear to me that a mature baby both one second before, and one second after it is born, is a person in the sense that it is a viable human being capable of feeling conscious experiences.</p>\n<p>I've also considered the neuroscience research that suggests that fetuses in the womb as far back as 20 weeks in are capable of memorizing the music played to them.  This along with the completion of the Thalamocortical connections at around 26 weeks, and evidence of sensory response to pain at 30 weeks, suggest to me that the fetus develops the ability to sense and feel well before birth.</p>\n<p>All this together means that my nuanced view is that if we have to draw a line in the sand over when abortion should and shouldn't be permissible, I would tentatively favour somewhere around 20 weeks, or the midpoint of pregnancy.  I would also consider something along the lines of no restrictions in the first trimester, some restrictions in the second trimester, and a full ban in the third trimester, with exceptions for if the mother's life is in danger (in which case we save the mother because the mother is likely more sentient).</p>\n<p>Note that in practice the vast majority of abortions happen in the first trimester, and many doctors refuse to perform late-term abortions anyway, so these kinds of restrictions would not actually change significantly the number of abortions that occur.</p>\n<p>That was my thinking before considering the EA considerations.  However, when I give thought to the moral uncertainty and the future persons arguments, I find that I am less confident in my old ideas now, so thank you for this post.</p>\n<p>Actually, I can imagine that a manner of integrating EA considerations into my old ideas would be to weigh the value of the fetus not only by its &quot;personhood&quot;, but also its &quot;potential personhood given moral uncertainty&quot;.and its expected QALYs.  Though perhaps the QALYs argument dominates over everything else.</p>\n<p>Regardless, I'm impressed that you were willing to handle such a controversial topic as this.</p>\n", "parentCommentId": null, "user": {"username": "Joseph_Chu"}}, {"_id": "sjRyNt2qLZJTCb8Wu", "postedAt": "2015-01-08T20:12:38.112Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Having experienced (a comparatively smooth and uncomplicated) pregnancy and delivery, 'discomfort' feels wildly inadequate. </p>\n<p>For example, rates of post partum depression are about 10%, higher in adverse circumstances. Depression is one illness where a person's QALY's are plausibly &lt;0</p>\n<p>As well as being woefully inadequate to describe what's involved physically, the analysis here doesn't address the other harms and distress that would be involved in term pregnancy, delivery and relinquishing of a child. The woman's family, personal and work-life would all be affected in difficult to predict and probably negative ways. For example, what if you are a casual worker with no maternity allowance? Almost certainly lose shifts as you get more pregnant, probably lose your job. </p>\n", "parentCommentId": "5v2TZgMy9C5J7e3ew", "user": {"username": "Bernadette_Young"}}, {"_id": "Ha7if2Atw8RioSo5s", "postedAt": "2015-01-09T02:12:19.084Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Haha, I now feel bad leaving this comment unanswered because it very thoughtful, so I guess I'll copy-paste my response too...</p>\n<blockquote>\n<p>   As someone who's had a very nuanced view of abortion, as well as a recent EA convert who was thinking about writing about this, I'm glad you wrote this. It's probably a better and more well-constructed post than what I would have been able to put together.</p>\n</blockquote>\n<p>Thanks! It took a long time - and was quite stressful. I'm glad you liked it.</p>\n<blockquote>\n<p>   The argument in your post though, seems to assume that we have only two options, either to totally ban or not ban all abortion,</p>\n</blockquote>\n<p>I actually deliberately avoided discussing legal issues (ban or not ban) because I felt the purely moral issues were complicated enough already.</p>\n<blockquote>\n<p>  Actually, I can imagine that a manner of integrating EA considerations into my old ideas would be to weigh the value of the fetus not only by its &quot;personhood&quot;, but also its &quot;potential personhood given moral uncertainty&quot;.and its expected QALYs.</p>\n</blockquote>\n<p>Yeah, if you want to do both you need a joint probability distribution, which seemed a little in-depth for this (already very long!) post.</p>\n", "parentCommentId": "DaiCX7HELu3HFBsDG", "user": {"username": "Dale"}}, {"_id": "8QxsX5io5KbESh8ND", "postedAt": "2015-01-12T02:42:50.161Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<p> rates of post partum depression are about 10%, higher in adverse circumstances. Depression is one illness where a person's QALY's are plausibly &lt;0</p>\n</blockquote>\n<p>Apparently even &quot;Major depressive disorder: severe episode&quot; only <a href=\"http://effective-altruism.com/ea/7g/disability_weights/\">costs 0.655 QALYs.</a>. If we generously assume every instance of post partum depression is 'major' and 'severe', and generously assume it lasts for 3 years, we get 3<em>0.1</em>0.655 = 0.1965 QALYs. As we were generous on both multiplicative assumptions, it's plausible the true number is much much lower. Yet even if it was as high as 0.1965, that's not enough to justify aborting a fetus if you ascribed even a 1% chance of it having moral value. </p>\n<p>So perhaps my wording choice could have been better - but I don't think it actually makes much difference to the object-level issue.</p>\n", "parentCommentId": "sjRyNt2qLZJTCb8Wu", "user": {"username": "Dale"}}, {"_id": "FmWyRzYwgx4R6A8xB", "postedAt": "2015-01-12T02:47:06.418Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<blockquote>\n<blockquote>\n<p>We might be worried about how the moral uncertainty argument applies in other cases. For example, homosexual acts</p>\n</blockquote>\n</blockquote>\n<p>Actually, I'd like to amend my response here. I think there is a clear division between aborting fetuses and homosexuality here. There are strong non-religious arguments for its being wrong to abort a baby, but not very many at all for homosexuality being wrong. It seems that most of the disagreement about homosexuality comes from disagreement about whether Islam is true, which is a factual disagreement, not a moral disagreement. As such, moral uncertainty is much more important for the (im)morality of aborting fetuses than for homosexuality.</p>\n", "parentCommentId": "nZ3v5vegRvjX63ivv", "user": {"username": "Dale"}}, {"_id": "K5WcbRweBpwTbRzYy", "postedAt": "2015-01-12T04:07:50.529Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>I had another thought as well.  In your calculation, you only factor in the potential person's QALYs.  But if we're really dealing with potential people here, what about the potential offspring or descendants of the potential person as well?</p>\n<p>What I mean by this is, when you kill someone, generally speaking, aren't you also killing all that person's future possible descendants as well?  If we care about future people as much as present people, don't we have to account for the arbitrarily high number of possible descendants that anyone could theoretically have?</p>\n<p>So, wouldn't the actual number of QALYs be more like +/- Infinity, where the sign of the value is based on whether or not the average life has more net happiness than suffering, and as such, is considered worth living?</p>\n<p>Thus, it seems like the question of abortion can be encompassed in the question of suicide, and whether or not to perpetuate or end life generally.</p>\n", "parentCommentId": "Ha7if2Atw8RioSo5s", "user": {"username": "Joseph_Chu"}}, {"_id": "HitpBj7DMiheY3xwn", "postedAt": "2015-05-27T13:56:21.466Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Untrained childbirth scores much higher on pain severity than almost all medical problems - at least on one pain scale <a href=\"http://www.thblack.com/links/RSD/McGill500x700.jpg\">http://www.thblack.com/links/RSD/McGill500x700.jpg</a> </p>\n", "parentCommentId": "sjRyNt2qLZJTCb8Wu", "user": {"username": "tomstocker"}}, {"_id": "egeyT84QvC3LrzMKG", "postedAt": "2015-05-27T13:57:42.822Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>there are different ways of scoring QALYs - most of the constructs seem pretty dumb on the face of it that advantage people with small issues across the board compared to people with life-cripplingly severe issues along one dimension.</p>\n", "parentCommentId": "8QxsX5io5KbESh8ND", "user": {"username": "tomstocker"}}, {"_id": "DxzWP3Gq47JKNLNYe", "postedAt": "2015-08-26T00:07:38.386Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p>Jason Brennan, a philosopher at Georgetown who is at least interested in EA, presents a similar argument <a href=\"http://bleedingheartlibertarians.com/2015/08/an-singerian-argument-against-abortion/\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "x8cxpiuckN3DQgnPY", "postedAt": "2020-09-19T22:43:00.547Z", "postId": "ADuroAEX5mJMxY5sG", "htmlBody": "<p> I agree with you  </p>", "parentCommentId": null, "user": {"username": "maria20"}}]