[{"_id": "SnjusxqaGzhrjpqGi", "postedAt": "2022-10-13T18:15:47.387Z", "postId": "AdyAr3mtyajSirqp9", "htmlBody": "<p>Hi Joe,</p><p>I find this really interesting! I'm not sure I completely understand what your view is, though, so let me ask you about a different case, not involving nihilism.&nbsp;</p><p>Suppose you assign some credence to the view that all worlds are equally good (\"indifference-ism\") . And suppose the angel offers you a gamble that does nothing if that view is false, but will kill your family if that view is true. You use statewise indifference reasoning to conclude that accepting the gamble is just as good as rejecting it, so you accept it.&nbsp;</p><p>Here are some possible things to say about this:</p><ol><li>Bite the bullet: It's perfectly OK to accept this gamble.&nbsp;</li><li>Problem with your credences: You should've been certain that indifference-ism is false.&nbsp;</li><li>Reject statewise indifference: Gambles that are equally good on every theory &nbsp;to which you assign nonzero credence are not equally good.&nbsp;</li><li>Divorce choice from value: You should've rejected the gamble even though accepting it was just as good as rejecting it—say, because you care about your family.&nbsp;</li></ol><p>Am I right that, from what you write here, you'd lean towards option 4? In that case, what would you say if you don't care about your family? Or what if you're not sure what you care about? (Replace \"indifference-ism\" with the view that you are in fact indifferent between all possible outcomes, for example.) And are you thinking more generally that what you should do depends on what your preferences are, rather than what's best? Sorry if I'm confused!&nbsp;</p>", "parentCommentId": null, "user": {"username": "jakenebel"}}, {"_id": "6yzvXriWrqBnTwdHH", "postedAt": "2022-10-13T18:45:49.480Z", "postId": "AdyAr3mtyajSirqp9", "htmlBody": "<p>Hi Jake,&nbsp;</p><p>Thanks for this comment. I discuss this sort of case in footnote 33<a href=\"https://forum.effectivealtruism.org/posts/AdyAr3mtyajSirqp9/against-the-normative-realist-s-wager#fncmvdiy1xmug\"> here</a> -- I think it's a good place to push back on the argument. Quoting what I say there:</p><blockquote><p>there is, perhaps, some temptation to say “even if I&nbsp;<i>should</i>&nbsp;be indifferent to these people burned alive, I’m not! Screw indifference-ism world! Sounds like a shitty objective normative order anyway – let’s rebel against it.” That is, it feels like indifference-ism worlds have told me what the normative facts are, but they haven’t told me about my&nbsp;<i>loyalty</i>&nbsp;to the normative facts, and the shittyness of these normative facts puts that loyalty even more in question. &nbsp;</p><p>And perhaps, as well, there’s some temptation to think that “Well, indifference-ism world is morally required to be indifferent to my overall decision-procedure as well – so I’ll use a decision-procedure that&nbsp;<i>isn’t</i> indifferent to what happens in indifference-ism world. Indifference-ism world isn't allowed to care!” &nbsp;</p><p>These responses might seem dicey, though. If they (or others) don't end up working, ultimately I think that biting the bullet and taking this sort of deal is in fact less bad than doing so in the nihilism-focused version or the original. So it’s an option if necessary – and one I’d substantially prefer to biting the bullet in all of them.</p></blockquote><p>That is, I'm interested in some combination of:&nbsp;</p><ul><li>Not taking the deal because you're uncertain of your loyalty to the normative facts (e.g., something about internalism/externalism etc)</li><li>Not taking the deal because indifference-ism world is indifferent to your decision procedure (or to your actions more generally), so whatever, let's save my family in those worlds.&nbsp;</li><li>Biting the bullet and taking the deal if it comes to that, but not taking it in the other cases discussed in the post.&nbsp;</li></ul><p>Adding a few more thoughts, I think part of what I'm interested in here is the question of what you would be \"trying\" to do (from some kind of \"I endorse this\" perspective, even if the endorsement doesn't have any external backing from the normative facts) conditional on a given world. If, in indifference-ism world, you wouldn't be trying, in this sense, to protect your family, such that your representative from indifference-ism world would indeed be like \"yeah, go ahead, burn my family alive,\" then taking the deal looks more OK to me. But if, conditional on indifference-ism, you would be trying to protect your family anyway (maybe because: the normative facts are indifferent, so might as well), such that your representative from indifference-ism world would be like \"I'm against this deal,\" then taking the deal looks worse to me. And the second thing seems more like where I'd expect to end up.</p>", "parentCommentId": "SnjusxqaGzhrjpqGi", "user": {"username": "Joe_Carlsmith"}}, {"_id": "7SHd4DGXH7AyQTzaq", "postedAt": "2022-10-14T04:45:11.707Z", "postId": "AdyAr3mtyajSirqp9", "htmlBody": "<p>Disclaimer: I didn't read the whole post</p>\n<p>But taking just this wager:</p>\n<blockquote>\n<p>If moral realism is true, I'll give you a hundred dollars. If it’s false, I’ll burn you, your family, and a hundred innocent children alive.</p>\n</blockquote>\n<p>You should accept this wager, since if moral realism is false then by definition it doesn't matter whether anyone is tortured or not.</p>\n<p>I didn't follow the meaningfulness to the argument of the natural/non-natural distinction but from this quote it looks like your view doesn't depend on it:</p>\n<blockquote>\n<p>tricky objection: namely, that this deal seems bad even if you have this pattern of credences – i.e., even if non-naturalist realism and nihilism are genuinely the only live options. That is, you may notice that you don’t want to be burned alive, even if nihilism is true, and it doesn’t matter that you’re being burned alive</p>\n</blockquote>\n<p>The perception you notice is just an intuition against moral non-realism. If moral realism isn't true, it doesn't matter what you want.</p>\n", "parentCommentId": null, "user": {"username": "ModusTrollens"}}, {"_id": "n6fJjGQhpGdmaGf6P", "postedAt": "2022-10-14T15:54:34.784Z", "postId": "AdyAr3mtyajSirqp9", "htmlBody": "<p>Hi Joe, thanks for sharing this. I enjoyed it - as I have enjoyed and learned from many of your philosophy posts recently!</p><p>A couple things:</p><p>1) I'm curious about your thoughts on the role of knowledge in epistemology and decision theory. &nbsp;You write, e.g., 'Consider the divine commands of the especially-big-deal-meta-ethics spaghetti monster...'. On pain of general skepticism, don't we get to know that a spaghetti monster is not 'the foundation of all being'? (I don't have a strong commitment here, but after talking with a colleague who works in epistemology + decision theory and studied under Williamson, I think this sort of k-first approach is at least worth a serious look.)</p><p>2) At risk of being the table-thumping realist, I wanted to press on the nihilist's response. You write that the nihilist has 'other deliberative currency available – “wants,” “cares,” “prefers,” “would want,” “would care,” “would prefer,” and so on.' We then get an example of this style of practical reasoning: '“If I untangle the deer from the barbed wire, then it can go free; I want this deer to be able to go free; OK, I will untangle the deer from the barbed wire”.'&nbsp;</p><p>The first two sentences don't in any way <i>support </i>the third (since 'supports' is a normative relation, and we're in nihilism world). The agent could just as well have thought to herself, 'If I untangle the deer from the barbed wire, then it can go free; I want this deer to be able to go free; OK, I will now read <i>Hamlet</i>.' There's nothing worse about this internal dialogue and sequence of action (assuming the agent does then read <i>Hamlet</i>) because, again, nothing is worse than anything else in nihilism world.&nbsp;</p><p>You ask, 'Who set up this court? We would presumably object if the court only accepted shoulds that were made out of e.g. divine commands, or non-natural frosting. So why not accept the currency of <i>every</i> representative?' I think the realist will want to say: 'the principled distinction is that in the other worlds there <i>some </i>sort of normativity. Whereas in nihilism world there isn't. That's why nihilism doesn't get a seat at the table.'&nbsp;</p><p>As far as I can tell (not being a specialist in metaethics), the best the nihilist can hope for is the \"Humean\" solution, namely that our natural dispositions will (usually) suffice to get us back in the saddle and keep on with the project of living and pursuing things of \"value.\" (\"...fortunately it happens, that since reason is incapable of dispelling these clouds, nature herself suffices to that purpose, and cures me of this philosophical melancholy and delirium, either by relaxing this bent of mind, or by some avocation, and lively impression of my senses, which obliterate all these chimeras. I dine, I play a game of backgammon, I converse, and am merry with my friends; and when after three or four hours' amusement, I would return to these speculations, they appear so cold, and strained, and ridiculous, that I cannot find in my heart to enter into them any farther.&nbsp;<br>Here then I find myself absolutely and necessarily determined to live, and talk, and act like other people in the common affairs of life\" (Treatise 1.4.7.8-10).) But this does nothing to address the question of whether we have reason to do any of those things. It's just a descriptive forecast about what we will in fact do.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Calvin_Baker"}}, {"_id": "tfCKY6hNkpyCpqzPP", "postedAt": "2022-10-23T19:40:37.600Z", "postId": "AdyAr3mtyajSirqp9", "htmlBody": "<p>I really liked this post! &nbsp;fwiw, I've a partial response in my latest post on '<a href=\"https://rychappell.substack.com/p/metaethics-and-unconditional-mattering\">Metaethics and Unconditional Mattering</a>'.</p>", "parentCommentId": null, "user": {"username": "RYC"}}]