[{"_id": "knmEfWfBYinWbpn4p", "postedAt": "2023-05-04T18:52:36.363Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Thank you for writing this!</p><p>I haven't spent much time thinking about this: I have a sense that maybe the most important thing to promote when it comes people keeping cats is not to make cat feed vegan, but to keep cats indoors. There are statistics showing that cats allowed outdoor kill mulitple (&gt;1) small mammal/bird per day, and often in slow and torturous ways, which makes it very easily more suffering caused than their meat consuption in a day if they consumed land animal meat.&nbsp;</p><p>Also, if cats are not fed natural meat, is there a chance they might hunt more, if allowed outdoors?</p><p>Also, maybe keeping cats indoors is easier to promote than feeding them vegan feed?&nbsp;</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "jgCnxHjzXM4BHuiMx", "postedAt": "2023-05-04T19:24:25.867Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Both can be true. We keep them more indoors and have them eat more vegan.&nbsp;</p><blockquote><p>Also, if cats are not fed natural meat, is there a chance they might hunt more, if allowed outdoors?</p></blockquote><p>Why would the \"naturalness\" of the food matter? Perhaps if it's more satiating, then cats are less inclined to hunt. But satiation is independent of whether or not it's from animal flesh.&nbsp;<br>&nbsp;</p><blockquote><p>Also, maybe keeping cats indoors is easier to promote than feeding them vegan feed?&nbsp;</p></blockquote><p>Apologies if it's not clear above. My main point is that we should strive to be making it easier to feed cats vegan.</p>", "parentCommentId": "knmEfWfBYinWbpn4p", "user": {"username": "Karthik Sekar"}}, {"_id": "W3HXs9XcpJTEckJe2", "postedAt": "2023-05-04T19:47:03.905Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Yes, both can be true. I just suspect that the priority might be reducing cat's enormous impact on wild animal suffering.</p><p>Re: Source of meat: I am not sure. I was just suspecting maybe (maybe not) cats might tell from the taste better than humans? But I hope not.</p>", "parentCommentId": "jgCnxHjzXM4BHuiMx", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "nt5sgAStqjN58EENN", "postedAt": "2023-05-04T19:53:39.803Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>Re: Source of meat: I am not sure. I was just suspecting maybe (maybe not) cats might tell from the taste better than humans? But I hope not.</p></blockquote><p>It could certainly be true with initial vegan cat food recipes, but then our goal would be to figure out why cats prefer the meat option and then to close that gap by developing new vegan formulations.</p>", "parentCommentId": "W3HXs9XcpJTEckJe2", "user": {"username": "Karthik Sekar"}}, {"_id": "oFuhacx54nSufornJ", "postedAt": "2023-05-05T05:01:02.734Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Consider buying an anti-hunting <a href=\"https://www.birdsbesafe.com/\">colar</a> or <a href=\"https://catgoods.com/\">bib</a> in case you don't know these are options! Make sure whenever they are let out to play you put the bib/colar on first.</p><p>All the joy of playing with your cat outside and feeling like a cool cat dad giving your cat-kids what they want, with none of the guilt!</p>", "parentCommentId": "knmEfWfBYinWbpn4p", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "r3JQWvRByYhKFcJKQ", "postedAt": "2023-05-05T05:32:59.565Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Of interest: <a href=\"https://forum.effectivealtruism.org/posts/QwPg6C43s6wKZ2tv7/would-a-reduction-in-the-number-of-owned-cats-outdoors-in-1\">https://forum.effectivealtruism.org/posts/QwPg6C43s6wKZ2tv7/would-a-reduction-in-the-number-of-owned-cats-outdoors-in-1</a></p>\n", "parentCommentId": "knmEfWfBYinWbpn4p", "user": {"username": "MichaelStJules"}}, {"_id": "r39ppbLY4HzXfEeuC", "postedAt": "2023-05-05T07:33:23.917Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Super interesting stuff. I'm curious about the dogs vs cats usual dichotomy here, would you say focusing on vegan cats is more effective than vegan dogs?</p>", "parentCommentId": null, "user": {"username": "Akash Kulgod"}}, {"_id": "2sBWz2HiryBAtMBqG", "postedAt": "2023-05-05T08:17:19.295Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I was just imagining being a cat with one of those on. I think I would be a very sad cat.</p>", "parentCommentId": "oFuhacx54nSufornJ", "user": {"username": "Jonathan Ng"}}, {"_id": "qiSAL8qsrKEa38e3u", "postedAt": "2023-05-05T11:07:06.237Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote>\n<p>Vegan cat owners also have more work to do. When a cat is transitioned to a vegan diet, their urine must be monitored for changes in pH. Meat-based food tends to be more acidic than vegan food, which cats are not adapted to. When a cat’s urine is too alkaline, they are prone to forming mineral crystals in their urine, which are painful to eliminate. Owners must acidify their cat’s food as needed.</p>\n</blockquote>\n<p>Why isn't the vegan cat food appropriately acidic from the manufacturer? Is this related to the limited ingredients problem you describe after?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "TnkEsGvF8ouDSi7kf", "postedAt": "2023-05-05T11:12:31.437Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote>\n<p>Replacing even a fraction of meat consumption has a sizeable impact–a study last year estimated that replacing a mere 20% of beef with microbial protein would halve the rate of deforestation. Therefore, replacing a significant fraction of the meat that cats consume would help prevent trees from being cut down. Moreover, getting cats to eat 20% less meat in terms of chicken in the United States would save nearly half a billion chicken a year from brutal livelihood and slaughter.</p>\n</blockquote>\n<p>The statistics you link are based on meat for human consumption, but as you note later current cat food is cheap waste products. While we shouldn't treat these as having no effect on the amount of animals raised and killed, it seems to me it should be quite a bit smaller than the effect of changing the demand for the expensive portions of the animals?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "yM9hvEHYHwJnZ7PfM", "postedAt": "2023-05-05T13:40:54.694Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Yes. I hesitated from forecasting an exact value for how decrease in consumption of meat by cats affects deforestation. It's hard due to the way animal agriculture divides up a carcass and sells the different parts. We almost have to look at cat food as a subsidy to eliminate from animal agriculture. The true reduction will depend on the elasticity of demand.</p><p>Furthermore, the asks here are modest: Wouldn't surprise me if even ~$1M can fund, say, 10 ingredient approvals and 1 RCT.</p>", "parentCommentId": "TnkEsGvF8ouDSi7kf", "user": {"username": "Karthik Sekar"}}, {"_id": "epFL4kytiprhG9T2j", "postedAt": "2023-05-05T13:41:40.195Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I am honestly not sure.</p>", "parentCommentId": "qiSAL8qsrKEa38e3u", "user": {"username": "Karthik Sekar"}}, {"_id": "aMq35EwERiwSvntYe", "postedAt": "2023-05-05T13:42:12.403Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>A cat I used to have would wear a collar with a bell when she went outside. It seemed to alert all of the birds around her.</p>", "parentCommentId": "oFuhacx54nSufornJ", "user": {"username": "Karthik Sekar"}}, {"_id": "LQx2RAvHqYALKqEpK", "postedAt": "2023-05-05T13:52:01.804Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Thanks for sharing!</p>", "parentCommentId": "r3JQWvRByYhKFcJKQ", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "yok8v6bdhSudRh9jJ", "postedAt": "2023-05-05T13:52:38.041Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Dogs eat more meat than cats in the United States. So in terms of magnitude, dogs are a bigger issue.</p><p>Currently, it seems to be easier to rear vegan dogs. There's more retail options and more studies. Furthermore, dogs are perceived as omnivores, and so the concerns about feeding them plant-based food are less acute.&nbsp;</p><p>As far as where to put our resources, I think, yes, in the long run, we'll probably want to focus more on dogs, but we're in a terrible place right now with respect to cat food. I think modest resources here could do much good. If we had more ingredient approvals and a few RCTs, it would open more options and trust for vegan cat food. I would anticipate these efforts costing, at most, a couple of million of dollars.&nbsp;</p>", "parentCommentId": "r39ppbLY4HzXfEeuC", "user": {"username": "Karthik Sekar"}}, {"_id": "mhmaGgu7AM7ZRaLG2", "postedAt": "2023-05-05T14:42:15.010Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Thanks!  It's pretty weird that they'd make their product harder to use in a way that should be really easy to fix.</p>\n", "parentCommentId": "epFL4kytiprhG9T2j", "user": {"username": "Jeff_Kaufman"}}, {"_id": "bQuTTdif9va8NCMup", "postedAt": "2023-05-05T15:38:01.488Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Yeah I think this is a really important part of the discussion. We won't get a world filled with vegan cats unless owners don't have to worry about constantly checking pH levels.</p>\n", "parentCommentId": "qiSAL8qsrKEa38e3u", "user": {"username": "Jeroen_W"}}, {"_id": "gxKk93eSgiRJxXodc", "postedAt": "2023-05-05T15:43:25.312Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I don't dispute that. We want to make it as convenient for folks as possible to feed their cats vegan.</p><p>I'll reach out to my vegan pet food contacts and see if they know.</p>", "parentCommentId": "bQuTTdif9va8NCMup", "user": {"username": "Karthik Sekar"}}, {"_id": "mzozgizYBnuboZWyq", "postedAt": "2023-05-05T20:01:18.103Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I love cats as much as anyone else, but I'm always mildly shocked by how unusually cruel they appear to be when they are outside (they will seemingly do anything to catch mice, birds and even insects, and then torture their prey at length, even when their owners give them plenty of food, the production of which presently also requires animals to be killed). So if it would be possible and convenient for all cats to go vegan, I this would be a major achievement for the animal advocacy movement, to say the least.</p>", "parentCommentId": null, "user": {"username": "Maxim Vandaele"}}, {"_id": "5m9mwsEtEmECJxQoA", "postedAt": "2023-05-06T15:33:20.850Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I love cats too. They're my favorite companion animal.</p><p>Yes, they tend to be sociopathic and terrorize prey. I'm reminded by what Sam Harris said on a podcast regarding sociopathy: We should look at it as a disease to intervene on. We should want to treat/mitigate sociopathy.&nbsp;</p><p>As other commenters noted, keeping cats inside or placing collars on them to alert/avoid prey are important practices.&nbsp;</p>", "parentCommentId": "mzozgizYBnuboZWyq", "user": {"username": "Karthik Sekar"}}, {"_id": "7tBLEJEcpYxjHPZyX", "postedAt": "2023-05-06T15:45:23.541Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>It's a question that bothers me since I got my cat. As a long-time vegan, I hate that I buy animal-based food for her - but I couldn't find a reliable vegan option.&nbsp;<br><br>However, I always thought about it as a minor problem in the grand scheme of things. If cat consumption of animal meat is actually significant, I see that - bear with me - as a cause for cautious optimism.&nbsp;<br><br>As cats don't have the same psychological hang-ups on food as humans do, I believe it should be easier to make the transition to plant-based food. It does require, as you wisely mention, more RCTs and research in general, so cat guardians can ensure the long-term health of their kitties.</p>", "parentCommentId": null, "user": {"username": "Noa Weiss"}}, {"_id": "vYFj6wFT7bqnuuwTd", "postedAt": "2023-05-06T15:51:02.078Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I see it differently. Hunting and playing with their food, while unfortunate, is their natural tendency - and unlike humans, they can't do better.<br><br>I sadly feed my cat meat-based food - there is no reliable vegan option available where I live. When she does go out and hunt (and I am an firm believer that cats, as all other animals, deserve freedom), while it is often upsetting to watch, I know that the quick suffering her prey goes through saves heavier, more prolonged suffering of the animals her store-bought food is made out of.</p>", "parentCommentId": "5m9mwsEtEmECJxQoA", "user": {"username": "Noa Weiss"}}, {"_id": "zr9mFysc6b93RyANt", "postedAt": "2023-05-06T15:57:34.948Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>There are statistics showing that cats allowed outdoor kill mulitple (&gt;1) small mammal/bird per day, and often in slow and torturous ways, which makes it very easily more suffering caused than their meat consuption in a day if they consumed land animal meat.&nbsp;</p></blockquote><p>I think the opposite: since that outdoor prey gets to live its life freely until that moment, those few moments of suffering are nothing compared to the suffering of an animal in the food industry, that spends its whole life caged and handled.&nbsp;<br>I also factor in the bigger animal's much higher capacity for suffering.</p>", "parentCommentId": "knmEfWfBYinWbpn4p", "user": {"username": "Noa Weiss"}}, {"_id": "HzsG9F7zBLKmHLbiG", "postedAt": "2023-05-06T16:02:34.462Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Re keeping cats indoors: I believe that all animals deserve to be free, and more specifically, that I, as the cat guardian, do not have the moral right to them confined*. I would be interested to hear your counter-arguments, if you would like to share.</p><p><br><br>* (Unless absolutely required for their own safety/well-being; I would keep a cat indoors only if I lived near a busy road, for example. Though in that case, I would strongly reconsider getting a cat in the first place, or make sure that the cat is an older one, that does not need to venture out as much to maintain their mental well-being).</p>", "parentCommentId": "knmEfWfBYinWbpn4p", "user": {"username": "Noa Weiss"}}, {"_id": "xjLnSht8sAXzMhczs", "postedAt": "2023-05-06T16:09:18.097Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Cats love veggies too, though. My cat happily munches on sweet potato, and once got my entire lunch on the floor trying to get my avocado (she succeeded :( ). I use seaweed as treats for training her, and when I sprinkle nutritional yeast on my meal she would not stop nagging until I give her some, too.&nbsp;<br><br>Point is, it's not that the only taste cats interested in is meat. They have a diverse palate :)</p>", "parentCommentId": "nt5sgAStqjN58EENN", "user": {"username": "Noa Weiss"}}, {"_id": "HYLsaieGRxrFh4vfE", "postedAt": "2023-05-07T03:33:38.669Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>There are a few things I would like to point out. And i know some of these things you have pointed out (for example you do say that pet food is made up of by-products that are not suitable for human consumption), but i would like to hear your response to these points.</p><ol><li>Lack of scientific evidence. This article claims that vegan diets can meet all the nutritional requirements of cats, but this claim is not backed up by <strong>strong </strong>scientific evidence. While there have been some studies on vegan diets for cats, they are limited in scope and do not provide conclusive evidence that such diets are safe and healthy for cats in the long term.</li><li>Overstating the environmental impact: This article suggests that feeding cats a vegan diet would significantly reduce the amount of meat consumed, thus reducing the environmental impact of meat production. However, it overlooks the fact that the majority of meat produced for pet food is made up of by-products that are not suitable for human consumption. Therefore, the environmental impact of pet food production is not as significant as this article suggests.</li><li>Ignoring the natural diet of cats: While it is possible to create nutritionally complete vegan diets for cats, it goes against their natural diet as obligate carnivores. A vegan diet may not provide all the nutrients that cats need, which could lead to health problems in the long term. And i know you have responded to this comment, however you seem to be neglecting the fact that cat's evolved to specifically eat meat. This comes back to the lack of scientific evidence as well, and we do not know the long term impacts of changing their diets. And i would just like to say that herbivores themselves eat small amounts of meat from time to time, and so if herbivores, which evolved to get the absolute most out of plants, need to eat meat sometimes, what will that say about transitioning carnivores to meat?</li><li>Overlooking animal welfare concerns: This article argues that feeding cats a vegan diet would reduce the number of animals killed for pet food production, but it overlooks the potential negative impact on the welfare of cats. Some cats may not be able to digest a vegan diet properly, leading to digestive issues and other health problems. Which again, leads to the lack of evidence on this topic.</li><li>Disregarding personal choice: This article suggests that humans should make domestic cats vegan, but it ignores the fact that cat owners may have different beliefs and preferences when it comes to feeding their pets. It is important to respect personal choice and allow cat owners to make informed decisions about what to feed their pets.</li></ol>", "parentCommentId": null, "user": {"username": "FeltSteam0"}}, {"_id": "EsGmRgPY67xFWqnHE", "postedAt": "2023-05-07T04:25:40.076Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p><strong>Repudiating what “obligate carnivore” means</strong> - Kindly, but stridently, we have to correct folks that obligate carnivore stems from observation, not a diet requirement</p></blockquote><p>&nbsp;</p><p>Could you provide a source for this? In biology, \"<a href=\"https://en.wikipedia.org/wiki/Carnivore#:~:text=.%5B4%5D-,Obligate%20carnivores,-%5Bedit%5D\">obligate carnivore</a>\" means \"obligate meat eater\". They cannot get sufficient nutrition from plants alone. This doesn't rule out an artificial diet providing the missing nutrients, or someone incorrectly classifying a non-obligate carnivore as obligate due to bad data. But it does not mean \"based on observation\". Your description holds for the order carnivora, but that is not synonymous with carnivore because biology as a field is dumb.&nbsp;</p><p>In your Opportunities section you suggest doing more rigorous RCTs on vegan cat diets (which I agree with), but the rest of your post feels like you considered the question settled. You link to sources claiming that result, but it feels like an aside rather than your focus. I wish you had gone into these in detail, because the papers look quite bad to me.&nbsp;</p><p>The main <a href=\"https://sustainablepetfood.info/vegetarian-feline-diets/#3\">website</a> you link to links to a review article in which only 4 studies with a combined 39 subjects use blood tests rather than owner reports, and more than half of those were given vegetarian diets, not vegan (even though the table header says vegan). The only RCT didn't compare with carnivorous diets. This is already not nearly enough to consider the question settled, even if the studies strongly supported no-meat diets. &nbsp; &nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/yzuqi3zd1bs2ru0mnilo\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/chlwb4il74atdx6x572n 220w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/qdufjcutqsvfuyxfswlz 440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/smzh1jsziftaufq28ptd 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/gdavjofht0n7xtd1nnzq 880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/ixechnpx8dcumsfq2nnd 1100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/rlyxxsxlntmezp3khfxc 1320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/atkcvgvhxtwiz20736ol 1540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/cfheowpcpbfkhse7trzq 1760w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/g6t9o0d3fgfow2awqkoc 1980w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/e2cklhysiirwiwtphtba 2130w\"></figure><p>&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/mhq5tt1bo4swyjtqy7xb\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/rheosvju7sucx1n3ntq7 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/nuhdmjweacserkvlltwx 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/flqulg8tbeewjqzpfyoa 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/xbbn54agyd0oghopns3o 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/kdi77jblxlvlviqramqu 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/hfbkosxt0sdtqfi03hiv 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/fii1vex4zhecj57fypdo 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/idaknmn58lj56eqkui0h 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/wgxirxj3divzhsywcn3l 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/s441yegn607z7gcd9t7c 1936w\"></figure><p>But also I can't find where this paper actually reports results for cats in an organized way? There are tables for dogs, but for cats there are only text descriptions. These mentions multiple problems, albeit one of them preventable. &nbsp;And again, these cats were mostly on vegetarian diets, not vegan (and not necessarily for very long, although 2 weeks was long enough to develop problems)</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/vf0eqjzwulwuwcphzyck\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/wtiu6rn8oywv9t1alqpp 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/drgf47lcxyjuqxz6zneg 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/whkso1gnmlaot5rta19r 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/wie17nuwqvavxyfprmne 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/nrafa5qjqxefgbf23bep 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/o6azi0mtjdxz8biokn4x 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/gei4qr2zp87ccuvupbgv 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/zbiqpaxxxyj77lwjysea 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/zohlrkuhsqsdmmstzgfz 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/hpufcayykj7okimw8eqf 1968w\"></figure><figure class=\"image\"><img></figure><figure class=\"image\"><img></figure><p>&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/quyzyoxoccsu1ogfcnhf\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/my3njegwtk0jf0eycg9g 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/wysceji949vvznnzzwyk 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/yxqwi8aytnjfc00lbt5k 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/novp2u9uzm4r3zbrby58 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/yhbp1xq9xrdwzcunrrlj 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/n0exztobrugmk5psvviv 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/zsuwenhj4njwrtvu9ez6 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/ahwk4zn3nobxyjjriqrx 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/tut3r8kjt1i63w5jv1tm 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/EsGmRgPY67xFWqnHE/afmzunfnlhvh10pvlsri 1970w\"></figure><p>&nbsp;</p><p>It very much looks like the authors of this review article wanted to say no-meat diets were harmless for cats, but the data went so strongly against their point they couldn't manage it.</p>", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "Gdk2tgmY7gbE3y8fZ", "postedAt": "2023-05-07T04:37:04.383Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>In which case you should absolutely not cause an extra pet cat to be created, given that if they are allowed to run free they will kill more small animals than they can eat.</p>", "parentCommentId": "HzsG9F7zBLKmHLbiG", "user": {"username": "orthonormal"}}, {"_id": "4MTyxno9unGnpoiD3", "postedAt": "2023-05-07T06:12:14.353Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>That is a bold statement, which I believe is also false. Do you have any support for that? As far as I can tell by observation (as well as common knowledge), cats do eat the vast majority of their prey (and in cases where they don't, there is likely to be some illness with the prey, which also means a swifter death is better for it).<br>&nbsp;</p>", "parentCommentId": "Gdk2tgmY7gbE3y8fZ", "user": {"username": "Noa Weiss"}}, {"_id": "tv8GfSdsdjYkZjesb", "postedAt": "2023-05-07T06:14:16.998Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>However, I absolutely agree that cats should be spayed or neutered, as there are plenty of rescues that need a home. This is especially true where I live, where there are perhaps 10 stray cats on each house cat (in case you were worried my cat going outdoors is damaging some fragile equilibrium).</p>", "parentCommentId": "Gdk2tgmY7gbE3y8fZ", "user": {"username": "Noa Weiss"}}, {"_id": "gfXSFQQczgcdS9m6m", "postedAt": "2023-05-07T09:02:06.034Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Having observed a cat play with a bib on outside, I have a hard time thinking most cats would be very sad with one on.<br><br>Consider also the power of operant conditioning to positively affect the valenced experience of having a bib/collar on for said cat. Our family got new cats that hated their cat harnesses at first (used to go on walks with them since we're concerned they'll run into the highway nearby). However, they REALLY like going outside. Having the harnesses on became associated with interesting walks outside, so now when I pick up the harnesses they come towards me and don't fight when I put it on.<br><br>Granted, this clearly varies by cat. I remember one cat we had that just absolutely hated his collar. Try as we might, he always fought it and was clearly constantly trying to get it off. So we gave up.</p>", "parentCommentId": "2sBWz2HiryBAtMBqG", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "WPSyohv9KRyaQxC6d", "postedAt": "2023-05-07T09:09:16.752Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I had one that we would observe stalking their prey. And then before getting closer they would move the bell such that it was behind their head, tucked so that it couldn't make noise anymore.<br><br>Clever girl.</p>", "parentCommentId": "aMq35EwERiwSvntYe", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "WBDHtLmCKSb2QA9fv", "postedAt": "2023-05-07T10:35:32.709Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Will people please remember to name the correct fallacy? The naturalistic fallacy is not the fallacy the OP is looking for here: <a href=\"https://en.m.wikipedia.org/wiki/Appeal_to_nature\">https://en.m.wikipedia.org/wiki/Appeal_to_nature</a></p>\n", "parentCommentId": null, "user": {"username": "richardhod"}}, {"_id": "J3bWGfEGi3FTwDRWM", "postedAt": "2023-05-07T13:06:06.414Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Hi, I am hoping to politely contest part of your third point - I believe it contains a factually incorrect claim.</p><blockquote><p>‘And i would just like to say that herbivores themselves eat small amounts of meat from time to time, and so if herbivores, which evolved to get the absolute most out of plants, <strong>need to eat meat sometimes</strong>, what will that say about transitioning carnivores to meat?</p></blockquote><p>You are correct that some larger herbivores do sometimes eat smaller animals, but this occurs rarely and to my knowledge only in an opportunistic fashion. However a) this is not a common behaviour and b) it is in <strong>no shape or form</strong> essential for a herbivore's well-being.</p><p>Herbivores have evolved an amazing digestive tract to acquire all their needs from plant matter. Opportunistic carnivorous behaviour is simply an advantageous behaviour for getting a bit of extra protein and nutrients, not a requirement for a healthy life. For instance, a wild ruminant may acquire a small, but useful survival advantage by munching on some ground laying bird’s eggs or even their live chicks when the ruminant happens to encounter them. But as I've mentioned this is not essential, nor particularly common. The ruminant can acquire all their nutritional needs through plant matter - their specialised anatomy, bacteria in their digestive tracts and well evolved metabolic pathways enabling them to do so.</p><p>Your claim applies even less so for herbivorous pets because humans can (and should!) ensure their pet’s diet contains everything they need for good wellbeing. Although, sadly I accept that many pet owners fail to do this.</p>", "parentCommentId": "HYLsaieGRxrFh4vfE", "user": {"username": "SamG"}}, {"_id": "aEorw3qjW5PAHJ8Wu", "postedAt": "2023-05-07T13:19:53.661Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>Re keeping cats indoors: I believe that all animals deserve to be free, and more specifically, that I, as the cat guardian, do not have the moral right to them confined*. I would be interested to hear your counter-arguments, if you would like to share.</p></blockquote><p>My main (maybe virtually sole) concern here is the suffering cats caused. It's way more than the cat's suffering being confined.</p><p>A few other comments in this post suggests that we can limit a cat's ability to hunt and kill with certain gadgets, maybe with their use we can still let cats outside without them causing too much suffering. I am not sure.</p><blockquote><p>I would strongly reconsider getting a cat in the first place</p></blockquote><p>I think this is what all cat owners in the world should have done, regarding the overal suffering owning cats causes - Cats cause a lot of suffering.</p>", "parentCommentId": "HzsG9F7zBLKmHLbiG", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "ZuppwNBup4sxeG2mG", "postedAt": "2023-05-07T13:40:02.531Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I disagree that it's \"nothing\" in comparison. It's not as long a suffering as the factory farmed animals' whole lives, but it's often very prolonged (most likely longer than the average slaughter).</p><p>I tried to search for how much canned meat a cat might eat a day and did my calculations again.<strong> I revise my position</strong>: I think if a cat only eats canned cat food that is made with a high portion of chicken (&gt;50%), eating that very likely causes more suffering than 1 small mammal/bird killed.&nbsp;</p><p>But if a cat eats canned food made from sheep or cow meat, or ones with very low proportion chicken, it remains very likely that eating these causes way less suffering than the cat's hunting behavior.</p><p>I also disagree that bigger animals always have higher capacity to suffer. I think mice are quite possible to have higher capacity to suffer than chickens.</p>", "parentCommentId": "zr9mFysc6b93RyANt", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "cEe2qFJqmLxGKHw3x", "postedAt": "2023-05-07T13:49:00.658Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Does anyone know how healthy a diet mostly consisting in simple bivalves is for a cat? I’m not a bivalvegan myself out of risk aversion, but suspect that eating bivalves is probably fine, and it could be much cheaper and easier to scale at this point.</p>\n", "parentCommentId": null, "user": {"username": "Devin Kalish"}}, {"_id": "zPyKbsNMNcGqRjS7A", "postedAt": "2023-05-07T14:13:07.296Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Hi Jeff, I heard back from Andrew Knight who researches this issue. His findings suggest that it's not actually an issue. I updated the post. He highlights this link: https://sustainablepetfood.info/vegetarian-feline-diets/#4</p>", "parentCommentId": "qiSAL8qsrKEa38e3u", "user": {"username": "Karthik Sekar"}}, {"_id": "suuT5wGWuBTukkBMZ", "postedAt": "2023-05-07T14:25:22.487Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<ol><li>Yes, I agree that we need more studies and more science here. The limitation is funding. I am campaigning for that.</li><li>Another comment brought up a similar point, see &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/AFPXXepkgitbvTtpH/getting-cats-vegan-is-possible-and-imperative?commentId=yM9hvEHYHwJnZ7PfM\">https://forum.effectivealtruism.org/posts/AFPXXepkgitbvTtpH/getting-cats-vegan-is-possible-and-imperative?commentId=yM9hvEHYHwJnZ7PfM</a></li><li>Evolution-based, appeal to nature arguments aren't good. As I suggested in the post, please see the first chapter of <i>After Meat</i> which discusses in detail. Key points: (1) Evolution doesn't select for optimal health; it selects for propagation. What cats evolved on versus what they need today are different. (2) Nutrient deficiencies are one of the easiest things to measure. Measure vitals and look for what's depleted. (3) There's nothing magical about meat. We know how metabolism and biochemistry works, so for meat to essential, there would need to be essential nutrients that are only found in meat. That has not be found after <i>decades</i> of research.</li><li>Vegan diets for cats will constantly develop and be iterated. Again, we should continue to make better and better formulations. We can get to something that cats <i>prefer</i> versus meat and that's more healthy for them.</li><li>This is not how ethics work. If someone has a personal choice to eat meat unnecessarily, I wouldn't say that's a decision to be respected. Once we get to a world where there are convenient vegan cat food options that promote better health for cats, it'd be unethical to stick with meat-based options.</li></ol>", "parentCommentId": "HYLsaieGRxrFh4vfE", "user": {"username": "Karthik Sekar"}}, {"_id": "StBFGhMswrQbPsWJj", "postedAt": "2023-05-07T14:39:17.562Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>Could you provide a source for this? In biology, \"<a href=\"https://en.wikipedia.org/wiki/Carnivore#:~:text=.%5B4%5D-,Obligate%20carnivores,-%5Bedit%5D\">obligate carnivore</a>\" means \"obligate meat eater\". They cannot get sufficient nutrition from plants alone. This doesn't rule out an artificial diet providing the missing nutrients, or someone incorrectly classifying a non-obligate carnivore as obligate due to bad data. But it does not mean \"based on observation\".</p></blockquote><p>I could have the official definition wrong--I edited the post. I'm thinking about it colloquially and repudiating how it's conceived for example <a href=\"https://www.reddit.com/r/DebateAVegan/comments/12enojo/comment/jfccico/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">here</a>.</p><p>I agree that the paper you highlighted is not making its case strong nor clear.&nbsp;</p><p>The best evidence seems to be survey based; for example, here: <a href=\"https://faunalytics.org/plant-based-cats-are-healthier-according-to-guardians/\">https://faunalytics.org/plant-based-cats-are-healthier-according-to-guardians/</a></p><p>Andrew Knight, a foremost researcher in the area, has a more definitive study publishing this year.</p><p>Otherwise, yes, I agree that we must continue to work our way up the <a href=\"https://en.wikipedia.org/wiki/Hierarchy_of_evidence\">Hierarchy of Evidence</a> and campaign for more and better \"formal\" science.</p>", "parentCommentId": "EsGmRgPY67xFWqnHE", "user": {"username": "Karthik Sekar"}}, {"_id": "iGQi7qRaqhto6tgJd", "postedAt": "2023-05-07T14:41:48.067Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>From what I have heard, keeping cats indoors is far more common in the United States than it is in Europe. American cat owners will keep their pets permanently indoors far more, even if they have a backyard and live in a place where it is unlikely the cat will be hit by a car.</p><p>So, if an animal advocacy charity would organize a campaign to promote keeping your cats indoors for the sake of animal welfare, it seems like this could be more effective in Europe than in America. In my own country, I have sometimes seen campaigns to promote spaying or neutering cats (which is also good for animal welfare), but I have never, ever seen one that suggests you keep your cat indoors to prevent it from mauling poor little mice and butterflies.</p>", "parentCommentId": "5m9mwsEtEmECJxQoA", "user": {"username": "Maxim Vandaele"}}, {"_id": "8tMivr57774bKe7Mh", "postedAt": "2023-05-07T14:51:58.363Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>It sounds intuitively right that cats are happier when they can hunt outside, but it would be interesting to see research on whether, and how, a cat that is kept indoors permanently, can still be happy.</p><p>I don't agree that the prey killed by cats go through 'quick suffering'. From what I have personally seen, they can \"play\" with their prey while it is still half-alive and twitching for quite some time. Maybe it is because of directors' editing choices, but usually when I see a lion or bear or fox kill an animal in a nature documentary, it looks like they don't torture that prey for nearly as long as the typical cat does.</p><p>But even if it is true that compared to farm animals raised for meat, mice and birds at least have happier lives before they are mauled by a cat, then it remains true that pet cats who are allowed to go outside eat both store-bought food and prey, and that reducing the demand for pet food meat by making your cat survive solely on prey is probably not that good for the cat's own wellbeing, as it may then occasionally go hungry, stressed or aggressive due to lack of food. Maybe it might even run away permanently because it no longer finds an easy source of food in your home. In any case, a cat that does not get fed by its owners probably catches more prey than a cat that does receive store-bought food. At least that's what I would expect, maybe this is not what happens in practice?</p>", "parentCommentId": "vYFj6wFT7bqnuuwTd", "user": {"username": "Maxim Vandaele"}}, {"_id": "dBbn6rCkZeHfNm4uE", "postedAt": "2023-05-07T15:37:24.646Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote>\n<p>However, neither our recent study (forthcoming), nor Dodd et al.’s 2021 study, showed any increased risk of lower urinary tract dysfunction in vegan cats. Dodd et al. included 1,026 cats whose diets were known, of whom 187 (18%) were fed vegan diets. We included 1,369 cats, of whom 127 (9%) were fed vegan diets. The prevalence of lower urinary tract dysfunction was not statistically significantly different between cats fed vegan and meat-based diets, in either study. Hence, this concern appears to have been unfounded.</p>\n</blockquote>\n<p>Dodd has:</p>\n<blockquote>\n<p>Considering the suggested increased risk of urinary tract diseases in cats fed PB diets [22], this health disorder was chosen for sample size estimation. Assuming the proportion of cats fed MB with urinary tract disorders was 4%, calculation of the sample size comparing two different proportions with the estimation that three times as many cats fed PB would have urinary tract disorders (12%), yielded a required sample size of 116 cats per diet category.</p>\n</blockquote>\n<p>If I'm reading this correctly, if urinary tract disorders were 8% in vegan cats compared to 4% in meat-eating ones they probably would have ended up with a result of \"no significant difference\"?</p>\n", "parentCommentId": "zPyKbsNMNcGqRjS7A", "user": {"username": "Jeff_Kaufman"}}, {"_id": "GiniRYDp8SxriHbbi", "postedAt": "2023-05-07T21:26:41.451Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Whoops. Thanks! Fixed</p>", "parentCommentId": "WBDHtLmCKSb2QA9fv", "user": {"username": "Karthik Sekar"}}, {"_id": "qeDXzApeHAoaPoM9G", "postedAt": "2023-05-07T21:29:59.981Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>That's how I understand it too.</p>", "parentCommentId": "dBbn6rCkZeHfNm4uE", "user": {"username": "Karthik Sekar"}}, {"_id": "uSe5qJjywNZrK58Dk", "postedAt": "2023-05-08T01:51:16.460Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>This is not a semantic issue you can fix with a minor edit. Your post rests on the assertion that cats can be healthy when fed an exclusively plant-based diet, and that these diets are already available. You are sure enough of this to say we should \"stridently correct\" people who believe they can't.&nbsp;</p><p>You can claim people are wrong to categorize cats as obligate carnivores, but you need to demonstrate that with evidence, which you absolutely have not done. You say the best evidence is survey based, but with such a motivated population and minimal reporting I consider it meaningless.</p><p>Even in this comment you act as if the linked reddit comment (copied below) is obviously false, but it is using obligate carnivore correctly and you have provided minimal evidence to even suggest reconsidering that designation.</p><p>My steel man here is that it might be possible to render cats vegan with new technology, and you think it's worth doing. I don't necessarily disagree with that, but it is such a different claim than \"cats are not obligate carnivores and can all happily live on a vegan diet today\".&nbsp;</p><p>&nbsp;</p><p>Reddit comment Karthik links to:<br><br>&gt; Hello there. Pet nutritionist here, trust me when I say cats ARE obligate carnivores. If you feed them a vegan diet they WILL die slowly and painfully, no ifs ands or buts. If you cannot cope with the idea of your cat eating what it needs to in order to survive. Give it up</p>", "parentCommentId": "StBFGhMswrQbPsWJj", "user": {"username": "Elizabeth"}}, {"_id": "LbESEykJ7o9ccLAX5", "postedAt": "2023-05-08T02:57:36.525Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>The argument isn't solely based on the survey data. It's supported by fundamentals of biochemistry, metabolism, and digestion too. I won't presume to know your biology knowledge. Earlier, you said \"biology as a field is dumb\", which may or may not be indicative of much personal study of biology. So I apologize if this is over-explaining, but I feel that I may have glossed over it when making the post:</p><p>Mammals such as cats will digest food matter into constituent molecules. Those molecules are chemically converted to other molecules--collectively, metabolism--, and energy and biomass (muscles, bones) are built from those precursors. For cats to truly be obligate carnivores, there would have to be something exceptional about meat: (A) There would have to be essential molecules--nutrients--that cannot be sourced anywhere else OR (B) the meat would have to be digestible in a way that's not possible with plant matter.&nbsp;</p><p>(A) is very easy to correct for. Just test formulations for missing nutrients (molecules) and add them. So far, there are no \"special\" meat molecules that can't be sourced from elsewhere. (B) is making a more digestible formulation. If we extract pea protein and measure the digestibility, we'll know if it'll work for a cat or not.</p><p>On (A), AAFCO is setting this already with their nutritional guidelines, e.g. minimum amount of proteins, vitamins, etc. On (B), part of the ingredient testing is making sure the food is digestible for cats (also testing for toxicity).&nbsp;</p><p>So any plant-based food that passes AAFCO guidelines is nutritionally complete for cats. Ami does, for example.</p><p>One of my points is that people's assumptions about carnivory fail to consider biochemistry. Yes, the formal scientific studies are lacking, but it really shouldn't matter based on what's known about more fundamental biology. Do we need long term studies to absolutely know that <i>Yellowclothea</i> people are safe to wear purple?&nbsp;</p><p>I agree that more formal studies higher on hierarchy of evidence would convince folks, seemingly like yourself. And to that point, I advocate for more of it. But given what I've researched and what I know about biology, I would feel comfortable raising a cat vegan healthily and recommending others to do the same.&nbsp;</p>", "parentCommentId": "uSe5qJjywNZrK58Dk", "user": {"username": "Karthik Sekar"}}, {"_id": "ZDcHL8Awh5Cd57TZE", "postedAt": "2023-05-08T06:47:47.999Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Thanks for this!\nVegan pets is awesome (even a \"not so strictly carinvore\" would be super great\", but I still think feral cats might be a worse (and more neglected) issue</p>\n", "parentCommentId": null, "user": {"username": "Ramiro"}}, {"_id": "ptkcuSbGxg8w8wkHu", "postedAt": "2023-05-08T13:20:53.454Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Then this is not the right test for the question we're talking about.  This study is saying \"we didn't find strong evidence that vegan diets increase the risk of lower urinary tract dysfunction in vegan cats\" but Knight is interpreting it as if it says \"we found strong evidence that vegan diets don't increase the risk of lower urinary tract dysfunction in vegan cats\".</p>\n", "parentCommentId": "qeDXzApeHAoaPoM9G", "user": {"username": "Jeff_Kaufman"}}, {"_id": "oHbq9YQuYsitc59zi", "postedAt": "2023-05-08T18:19:18.342Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I have a BA in biology. \"Biology is dumb\" was an attempt to be cute about the inherent messiness of living organisms and attempts to classify them.</p>\n<p>You say you've done research satisfying you that this is all biochemistry and we know everything we need. Can you write that up? How are we sure we've identified every useful nutrient? How do we know the bioavailability tests are any good? Without that this is still just an asserton, and a fairly surprising one given the state of human nutrition.</p>\n", "parentCommentId": "LbESEykJ7o9ccLAX5", "user": {"username": "Elizabeth"}}, {"_id": "ZYvjiqdNjM4Xy3Lmk", "postedAt": "2023-05-08T18:41:45.253Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>You say you've done research satisfying you that this is all biochemistry and we know everything we need.</p></blockquote><p>To be clear, this is not what I'm arguing. Biochemistry research is never complete. I'm arguing that it's safe to feed cats vegan based on what's known.</p><blockquote><p>Can you write that up?</p></blockquote><p>Here's the AAFCO list of required nutrients for cats and what I view as authoritative (pages 13-14):&nbsp;</p><p><a href=\"https://www.aafco.org/wp-content/uploads/2023/01/Model_Bills_and_Regulations_Agenda_Midyear_2015_Final_Attachment_A.__Proposed_revisions_to_AAFCO_Nutrient_Profiles_PFC_Final_070214.pdf\">https://www.aafco.org/wp-content/uploads/2023/01/Model_Bills_and_Regulations_Agenda_Midyear_2015_Final_Attachment_A.__Proposed_revisions_to_AAFCO_Nutrient_Profiles_PFC_Final_070214.pdf</a></p><blockquote><p>How are we sure we've identified every useful nutrient? How do we know the bioavailability tests are any good?</p></blockquote><p>I'm not sure. But these questions persist for Fancy Feast and any other meat cat food as much as they apply to vegan cat food. Are we sure they have every useful nutrient and that the measured bioavailability is good?</p>", "parentCommentId": "oHbq9YQuYsitc59zi", "user": {"username": "Karthik Sekar"}}, {"_id": "KYHZ68NB7WgCDorQn", "postedAt": "2023-05-10T07:00:09.039Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Okay, it sounds like your argument is \"vegan cat food is capable of meeting the same standard as meat-based food\".&nbsp;</p><p>From skimming the AAFCO document it's not obvious to me AAFCO thinks meeting its standard is sufficient for health (see screenshot below, from page 2). &nbsp;Perhaps there is something I missed, but I have put a lot of time into reading papers I found shoddy and you didn't find worth defending, so I would like to be sure this why you believe what you believe before investing more time checking it out.&nbsp;</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/rnrjdgukv7ksqbtcfwni\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/be5u8wpwtr2gck2bp0sj 130w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/osnaj7aonzihn68oxcgh 260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/yjnalaz9epyxkrgomzzi 390w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/ethu1by84tynxfmpautn 520w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/ppa9e4qpgfw7qunxfhps 650w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/gqnjfgevvoreddz0gxe1 780w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/s7vxcfzycrqdqe2wfzzv 910w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/liprlznqx4hnxe117nrk 1040w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/l6au71yalvtvpyozpeul 1170w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KYHZ68NB7WgCDorQn/aptq3jcegvwfvvmcdblt 1210w\"></p>", "parentCommentId": "ZYvjiqdNjM4Xy3Lmk", "user": {"username": "Elizabeth"}}, {"_id": "vajg8Lrjx8vQznDJv", "postedAt": "2023-05-10T09:35:56.995Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Insightful, thanks!</p>", "parentCommentId": "yok8v6bdhSudRh9jJ", "user": {"username": "Akash Kulgod"}}, {"_id": "jJKuzCjctqcrPhaGp", "postedAt": "2023-05-10T13:27:44.299Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I like your idea, but don't think getting any significant number of cats vegan is very tractable. However, here are three related ideas that might be more viable:</p><p>1) There was a debate a few years back about whether cats should eat grain-free diets versus diets with grain. Vets think eating food with grain <a href=\"https://www.petmd.com/cat/nutrition/grain-free-cat-food-better\">is fine</a> for most cats. Food with grain is liable to have less meat (since there is more other stuff in it, i.e., grain), so switching cats from grain-free diets to diets with grain would presumably reduce their meat consumption. Cat owners would likely be open to this because grain-free foods are typically more expensive and grain-free diets have been linked to <a href=\"https://www.thewildest.com/cat-nutrition/grain-free-cat-food\">heart disease</a> in dogs.</p><p>2) Slightly separate from the grain-free issue, cat foods vary significantly in terms of how much protein they have; for instance, it looks like the foods on <a href=\"https://catinfo.org/docs/SortableCatFoodChartCatinfo.org2-22-13.htm\">this chart </a>range from 26%-70% protein. So another way to reduce cats' meat consumption might be to convince pet owners to buy food with less protein (or, if necessary, do research to establish whether this is healthy for cats).</p><p>3) Cat foods have different kinds of protein—the above chart mentions lamb, beef, chicken, salmon, tuna, rabbit, duck, trout, venison, mackerel, and shrimp, among many others. So it might be worth trying to investigate which meat cats can cause the least harm by eating.</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "73hvaZcdfRfPhkeEy", "postedAt": "2023-05-10T14:08:42.942Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>Okay, it sounds like your argument is \"vegan cat food is capable of meeting the same standard as meat-based food\".&nbsp;</p></blockquote><p>Indeed.</p><blockquote><p>From skimming the AAFCO document it's not obvious to me AAFCO thinks meeting its standard is sufficient for health (see screenshot below, from page 2).</p></blockquote><p>As you pointed out earlier, we don't know everything that we could know. What do you propose we do? It sounds like your concerns are with food testing for cats period, and they're not specific to the vegan formulations.</p><p>My stance is that if it's okay to feed cats meat-based food, then it's fine to feed them vegan food.</p>", "parentCommentId": "KYHZ68NB7WgCDorQn", "user": {"username": "Karthik Sekar"}}, {"_id": "5bZzAsMoszKurxogn", "postedAt": "2023-05-10T14:39:23.019Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Thanks Lilly. FYI, as far as tractability goes, I ask for ingredient approvals and a few RCTs. These wouldn't require much in terms of cost (~1 million USD). There's millions of vegans around the world, and I bet many are relishing the opportunity to rear vegan cats, including myself.</p><p>I also want to flag another ancillary benefit that developed in the days since discussing this post with others: Many folks understand the ethical and environmental benefits to going vegan, but won't do so themselves because of <a href=\"https://forum.effectivealtruism.org/posts/wwjyynGkh9uqF4CLq/new-faunalytics-study-on-the-barriers-and-strategies-for\">perceived health concerns</a>. If \"carnivore\" cats can be vegan safely, that's quite the signal to non-vegan humans.&nbsp;</p><p>Thanks for the ideas. I do have a few concerns.</p><p>1.) Would owners be that much more receptive to switching to grain-free for ethical reasons? I would imagine similar head wind compare to vegan diets. I agree with you though about the cost point.</p><p>2.) I think this too would also be a tough sell. I'm guessing most owners think more protein is better for health.</p><p>3.) One issue here is the carcass balancing problem of animal agriculture. Cat food is generally the offal of the industry. I'm dubious of this approach without it exploding the cost.&nbsp;</p>", "parentCommentId": "jJKuzCjctqcrPhaGp", "user": {"username": "Karthik Sekar"}}, {"_id": "aBJe2EjPvh2K3dcmf", "postedAt": "2023-05-11T00:59:07.584Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>What do you propose we do?<br>&nbsp;</p></blockquote><p>Feed animals close to their natural diet while researching how to do better. You dismiss this as \"appeal to nature\", but I would describe it as \"the burden is on the attempt to change the default\".&nbsp;<br><br>&gt; It sounds like your concerns are with food testing for cats period<br><br>I assure you I am at least as obnoxious about human nutrition testing, which is better studied and features a more adaptable subject.&nbsp;</p>", "parentCommentId": "73hvaZcdfRfPhkeEy", "user": {"username": "Elizabeth"}}, {"_id": "oipnh4bwmhA9PaXjD", "postedAt": "2023-05-11T05:22:18.007Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>Feed animals close to their natural diet while researching how to do better. You dismiss this as \"appeal to nature\", but I would describe it as \"the burden is on the attempt to change the default\".</p></blockquote><p>&nbsp;\"Meeting nutritional requirements\" is a far better default standard than what's \"natural\". Few problems with the \"natural\" standard:</p><ol><li>Retail based meat cat food is far from what's \"natural\" as I covered in the post.&nbsp;</li><li>What's \"natural\" isn't more equivalent to what's healthy. &nbsp;Is a diseased bird corpse more \"natural\" than nutritionally-complete vegan cat food? Probably. Healthier? Hmmmm.</li><li>\"Natural\" is imprecise and hard to make actionable. How would an organization like AAFCO put that into words and regulations?</li></ol><blockquote><p>I assure you I am at least as obnoxious about human nutrition testing, which is better studied and features a more adaptable subject.&nbsp;</p></blockquote><p>Yep, human nutrition is better studied. There's more funding and more interest in the subject.</p><p>As discussed before, we're both in agreement for more studies. Funding is needed.</p>", "parentCommentId": "aBJe2EjPvh2K3dcmf", "user": {"username": "Karthik Sekar"}}, {"_id": "FJEfSpG5nDiw4EjXz", "postedAt": "2023-05-11T20:07:06.215Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I'm confused why the study both says this as you've highlighted, but then in the discussion and conclusion it says:</p><blockquote><p><strong>Discussion</strong></p><p>The finding of this study suggests, on the face of it, that there is <i>very little evidence of major adverse</i> effects resulting from the feeding of vegan diets in dogs or cats. The majority of the animal-based parameters were within normal reference ranges and when there were deviations from normal reference ranges, there were rarely clinical signs reported alongside the finding. In addition, whilst the broad literature in this area commonly makes reference to concerns around nutrient deficiencies, such as that of taurine, folate, and cobalamin, there were a limited number of studies that measured these outcomes (generally, only two studies for key outcomes), with limited evidence of these deficiencies arising (with some of the alterations likely being attributable to confounding; for example, as a result of secondary disease, e.g., giardiasis in a dog). These conclusions should, however, be interpreted cautiously, given the breadth and quality of the evidence presented as described below</p><p><strong>Conclusion</strong></p><p>This review has found that there is <i>no convincing evidence</i> of major impacts of vegan diets on dog or cat health. There is, however, a limited number of studies investigating this question and those studies available often use small sample sizes or short feeding durations. There was also evidence of benefits for animals arising as a result of feeding them vegan diets. Much of these data were acquired from guardians via survey-type studies, but these can be subject to selection biases, as well as subjectivity around the outcomes.</p></blockquote><p>Except, as you pointed out, convincing evidence of major adverse effects resulting from feeding cats vegan diets appear to have actually been observed as stated by the same authors saying it has not been observed. I notice I am confused given I do not think the paper is authored by bad actors.</p><p>Part I want to highlight in image below: <strong>Cats were supplemented. </strong>So the adverse affects you highlighted it sounds like you could prevent with supplements. Is this the only reason the authors conclude cats can be fed a vegan diet? But then it sounds like a better and more responsible conclusion by the authors would have been: it seems theoretically possible that a vegan cat food could exist with correct supplementation, but no healthy vegan diet for cats exists yet (all studies show specific supplementation thus far is neccesarry for existing vegan foods otherwise your cats might very quickly develop major adverse health outcomes - am I wrong?).</p><p>They also highlight they didn't review the suitability of the supplements? What does this mean - \"suitability\"? Cant find an answer for that.</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/niziu56nroyi7xnfim5x\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/lr8xilur6wv5tkgvlz4o 85w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/esn13l4g3au5ju810rbb 165w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/jkr7gf83giydibplgjsf 245w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/bk9vh5iaitlcbbredooa 325w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/mnkwdao8vxy8ajekrcbp 405w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/n4exx0gftnulpcyhadls 485w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/uhg3hpwl0z9cjsdmbitm 565w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/wa6wyphyhd8ccooyo2rc 645w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FJEfSpG5nDiw4EjXz/k9hkbatdkmhh7dnsmftd 725w\"></figure>", "parentCommentId": "EsGmRgPY67xFWqnHE", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "qnXpbrPrN6LcAYsqL", "postedAt": "2023-05-11T20:07:19.146Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>(A) There would have to be essential molecules--nutrients--that cannot be sourced anywhere else OR (B) the meat would have to be digestible in a way that's not possible with plant matter.&nbsp;</p></blockquote><p>&nbsp;</p><p>Nutrition is hella complicated. As someone who drinks a ton of Soylent, I am often surprised by how my own view of \"it shouldn't matter as long as the molecules - when you break it down - are the same\" is overly simplistic. If you have food substance A and food substance B and their molecules are organized differently, then even if you were to break them down and get the same base nutrients, this does not mean they are equally healthy for you. This is because their different initial arrangement can lead to different biochemical cascades. I recently learnt that antimicrobial mouthwash might influence your mouth bacteria to such a degree that is leads to a decrease in NO production to the point that your blood veins don't dilate as much = causally linked to increased arteriosclerosis. There is an entire scientific journal just dedicated to this pathway. See <a href=\"https://youtu.be/moKsVeL6sZs\">here</a>.</p><p>I would never have intuitively thought this could happen. I can increase my risk of heart disease by nuking the bacteria in my mouth? Lol... wat?</p><p>It really is not a stretch to imagine that even if meat and vegan food appears to be nutritionally complete and - if broken down -they yield similar macronutrients - that still because the vegan food has a different composition before being broken down that different biochemical pathways are kicked off leading to harm that the meat-based one does not lead to. Something weird and unexpected like the NO pathway could explain why cats on vegan diets still get health issues as the pro-vegan study Elizabeth linked to shows.</p><p>An escape hatch from this would of course be lab grown meat that is to the molecule identical to meat. In that case it wouldn't make sense for one to be any different from the other because they are not only to the molecule identical, but also to the molecules are arranged the same way before being broken down.</p><p>So my read is you haven't considered option C: There could be an essential arrangement of molecules in meat before they are broken down, that currently cannot be sourced elsewhere (not until we get lab grown meat anyway).</p>", "parentCommentId": "LbESEykJ7o9ccLAX5", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "bEfqM9YWCZJS6937j", "postedAt": "2023-05-11T20:16:01.562Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I think when she said \"natural diet\" she didn't mean to invoke the naturalistic fallacy.</p><p>She meant the diet that we have the most empirical evidence doesn't harm/kill them. We have some empirical evidence that vegan diets appear to quckly give cats major bad health outcomes without supplementation? The first comment in this thread by Elizabeth pointed this out.<br><br>We don't have empirical evidence of the same happening with meat-based diets. So modern nutritionally complete meat-based diets presently have a 100%-wont-cause-major-adverse-health-outcomes rate. Is this not what the studies seem to show?</p><blockquote><p>What's \"natural\" isn't more equivalent to what's healthy. &nbsp;Is a diseased bird corpse more \"natural\" than nutritionally-complete vegan cat food? Probably. Healthier? Hmmmm.</p></blockquote><p>No, but consider statistical averages rather than semantic absolutes. If you were to consider all possible meals a cat could reaonably be fed today. On average, it seems reasonable to suspect that they would be healthier if more of those meals were meat-based than plant-based. This is an empirical question, not a semantic one. The nutritionally-complete vegan cat food might be better than the diseased corpose (one single comparison). But having nothing but the nutritionally-complete vegan cat food might be far worse than nothing but meat (statistical average across many samples).</p><p>Given how nascent the field is and how we're only just finding out what supplementation we might have to give cats, it seems like if we were to tell everyone to feed their cat vegan food that we'd probably get a lot of cats with bad health outcomes.</p><p>And this would be pretty bad optics-wise for the vegan movement.</p>", "parentCommentId": "oipnh4bwmhA9PaXjD", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "CziiuEYsYeFDoY7zi", "postedAt": "2023-05-11T20:54:56.111Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>Something weird and unexpected like the NO pathway could explain why cats on vegan diets still get health issues as the pro-vegan study Elizabeth linked to shows.</p></blockquote><p>But we have the same uncertainty with retail meat-based cat food, which I've highlighted is quite distinct from what cats evolved on.</p><blockquote><p>An escape hatch from this would of course be lab grown meat that is to the molecule identical to meat.</p></blockquote><p>I don't understand the obeisance to molecularly-exact meat. Evolution doesn't select for health and well being. It selects for propagation for a specific niche in a specific environment. Our goals with domestic cats are different than what evolution optimized for.</p><p>Consider human evolution. For most of it, life expectancy was far lower than today. The diet of prehistoric times isn't by default aspirational. Instead, current nutrition studies focus on health outcomes, e.g. life expectancy, blood pressure, rate of obesity, etc.</p><p>So recommendations focus directly on cause (food eaten) and effect (health outcomes). And that's what we should do with cats. We should not put meat on a pedestal and beeline for that.</p>", "parentCommentId": "qnXpbrPrN6LcAYsqL", "user": {"username": "Karthik Sekar"}}, {"_id": "Fym5fvtogwZuugqB2", "postedAt": "2023-05-11T22:17:46.466Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>She meant the diet that we have the most empirical evidence doesn't harm/kill them.&nbsp;<br><br>We don't have empirical evidence of the same happening with meat-based diets.&nbsp;</p></blockquote><p>Do we have empirical evidence that a specific meat-based food is consistently safe over many years? My understanding is that many change constantly.<br>&nbsp;</p><blockquote><p>So modern nutritionally complete meat-based diets presently have a 100%-wont-cause-major-adverse-health-outcomes rate. Is this not what the studies seem to show?</p></blockquote><p>Not really. Check out the recall withdrawals over the year: <a href=\"https://www.fda.gov/animal-veterinary/safety-health/recalls-withdrawals\">https://www.fda.gov/animal-veterinary/safety-health/recalls-withdrawals</a></p><p>Best we can do is what AAFCO and FDA already do. AAFCO sets nutritional guidelines and ingredient requirements. FDA regulates the safety.</p><blockquote><p>We have some empirical evidence that vegan diets appear to quckly give cats major bad health outcomes without supplementation? The first comment in this thread by Elizabeth pointed this out.</p></blockquote><p>Why is that diet representative of for example nutritionally complete Ami, which has been around for years? Isn't it much better to just defer to AAFCO's and FDA's standards, which Ami meets?<br><br>The most parsimonious explanation is that the lack of supplements was the problem, not the \"vegan\"-ness. If I get sick from my potato chip diet, it doesn't mean I should avoid a plant-based diet with all required nutrients.</p><blockquote><p>If you were to consider all possible meals a cat could reaonably be fed today. On average, it seems reasonable to suspect that they would be healthier if more of those meals were meat-based than plant-based.</p></blockquote><p>Based on what? I don't intuit this at all. Furthermore, we're not saying any plant ingredients. We're saying the ones that meet nutritional, toxicity, and digestibility requirements for cats.</p><p>Both you and Elizabeth have offered something fairly distinct from AAFCO's/FDA's standards. And so far, I'm finding neither to be better.</p><blockquote><p>Given how nascent the field is and how we're only just finding out what supplementation we might have to give cats</p></blockquote><p>It's not nascent. AAFCO has been providing guidance on the nutritional requirements for cats for decades.</p>", "parentCommentId": "bEfqM9YWCZJS6937j", "user": {"username": "Karthik Sekar"}}, {"_id": "Giy85Rkp8RuGFNCxy", "postedAt": "2023-05-12T22:57:08.146Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>Based on what? I don't intuit this at all.</p></blockquote><p>&nbsp;</p><p>For me: I agreed with you and felt like my mind was being changed to being pro-vegan-cat - until I read Elizabeth's comment pointed out the issues in the study. So for me it is mostly because you haven't engaged with that specific comment and pointed out why the concerns that are highlighted in her screenshots (from the actual study!) are not something that I need to worry about.</p><p>Convince Elizabeth and you, by proxy, convince me I'm pretty sure.</p><blockquote><p>The most parsimonious explanation is that the lack of supplements was the problem, not the \"vegan\"-ness.</p></blockquote><p>Sounds reasonable to me. I didn't say that a lack of supplementation wouldn't solve it. I argued that meat would. Arguing for X doesn't mean I argued for ~Y.&nbsp;</p><p>The study came out January of this year. That's pretty recent.<br><br>Does a nutritionally complete vegan cat food exist yet that takes everything learnt from this study and all the studies it references into account without need for additional supplementation? If yes, I'd want to see a study where cats are fed it first before I place my own cats exclusively on it. Till then I'd probably be too paranoid to feed them a fully vegan diet.</p><blockquote><p>Why is that diet representative of for example nutritionally complete Ami, which has been around for years? Isn't it much better to just defer to AAFCO's and FDA's standards, which Ami meets?</p></blockquote><p>I'm confused. By \"that diet\" you mean to say the diet that was tested in the actual study you use as support for your claims should <i>not</i> be taken as an example of something nutritionally complete?</p><p>Ok, after trying to figure out what \"Ami\" was I see in your post you refer to it as vegan cat food that exists on the market.</p><p>Apparently it has also been around for 20 years after a quick Google search. Now I'm just hyper-confused why Ami wasn't used in the <a href=\"https://www.mdpi.com/2306-7381/10/1/52\">Domínguez-Oliva et al. Study</a> instead.</p>", "parentCommentId": "Fym5fvtogwZuugqB2", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "G4dMMsMh3sQh3G46Y", "postedAt": "2023-05-12T23:28:10.203Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>But we have the same uncertainty with retail meat-based cat food, which I've highlighted is quite distinct from what cats evolved on.</p></blockquote><p><br>Actually, I think we don't have the same uncertainty. Those products have been iterated on for a far longer time than vegan cat food - including multiple FDA recalls as <a href=\"https://forum.effectivealtruism.org/posts/AFPXXepkgitbvTtpH/getting-cats-vegan-is-possible-and-imperative?commentId=Fym5fvtogwZuugqB2\">you pointed out</a>. We've had much more of a \"trial-by-fire\" of retail meat-based cat food over a longer period of time.</p><p>Though in <a href=\"https://forum.effectivealtruism.org/posts/AFPXXepkgitbvTtpH/getting-cats-vegan-is-possible-and-imperative?commentId=Fym5fvtogwZuugqB2\">the other comment</a> you pointed out Ami, which given it has existed for 20 years, I imagine has gone through the same trial-by-fire. A new post that does nothing but focus on the evidence that Ami is fine for your cat would probably convince a ton more people. As I mentioned in my <a href=\"https://forum.effectivealtruism.org/posts/AFPXXepkgitbvTtpH/getting-cats-vegan-is-possible-and-imperative?commentId=Giy85Rkp8RuGFNCxy\">other comment</a> I'm very confused why Ami wasn't used in the <a href=\"https://www.mdpi.com/2306-7381/10/1/52\">Domínguez-Oliva et al. Study</a> instead.</p><blockquote><p>I don't understand the obeisance to molecularly-exact meat.</p></blockquote><p>I'm not interested in molecularly-exact meat. I'm interested in what - via strong empirical evidence - we know wont harm my cat.&nbsp;</p><blockquote><p>Our goals with domestic cats are different than what evolution optimized for.</p></blockquote><p>Couldn't agree more, which is why, if we get enough empirical evidence that some particular vegan meal will be ay-ok for cats I'm all aboard.</p><p>It is worth adding that I do think we have enough empirical evidence to place dogs on a vegan diet without issue. But my read of the study is we're not there with cats yet. I really don't understand why the study authors make the same conclusion for both cats and dogs. The evidence appears to clearly be vastly stronger for dogs than it is for cats.</p><blockquote><p>We should not put meat on a pedestal and beeline for that.</p></blockquote><p>We should put empirical evidence on a pedestal and while truth-seeking be neutral about whether that includes or excludes meat.</p>", "parentCommentId": "CziiuEYsYeFDoY7zi", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "wtq57wmrSdqGD5CyJ", "postedAt": "2023-05-13T13:56:50.750Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Thanks Cornelis, I sincerely appreciate the good will shown.</p><blockquote><p>For me: I agreed with you and felt like my mind was being changed to being pro-vegan-cat - until I read Elizabeth's comment pointed out the issues in the study. So for me it is mostly because you haven't engaged with that specific comment and pointed out why the concerns that are highlighted in her screenshots (from the actual study!) are not something that I need to worry about.</p></blockquote><p>I conceded on <a href=\"https://www.mdpi.com/2306-7381/10/1/52\">Domínguez-Oliva et al.</a>, and Elizabeth's concerns were entirely valid. However, it's one study and one diet, and I felt that Elizabeth was ignoring the basis of nutrition and biochemistry that I emphasized throughout the post. Thanks for highlighting that the food was lacking necessary, known supplements. That was a key point that would have been helpful to broach earlier.</p><p>A RCT study will likely be just a formality for something like the Ami vegan cat food. And yes, it's frustrating that this hasn't been done/published yet! As I understand from Andrew Knight, there's a better study coming out this year.</p><blockquote><p>Convince Elizabeth and you, by proxy, convince me I'm pretty sure.</p></blockquote><p>I haven't found Elizabeth willing to falsify their thinking as much as you and perceive general antagonism and defensiveness.&nbsp;</p>", "parentCommentId": "Giy85Rkp8RuGFNCxy", "user": {"username": "Karthik Sekar"}}, {"_id": "xPknout86LBy5EBqw", "postedAt": "2023-05-13T14:02:51.169Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Thanks Cornelis, I agree about the empirical evidence. And indeed, emphasizing Ami and how long it's been around would have obviated a lot of confusion here.</p><p>We seem to disagree about (1) the variance of meat-based retail products versus vegan ones and (2) whether or not the \"trial-by-fire\" standard is more helpful than just simply the criteria that AAFCO/FDA defines regarding nutritional, toxicity, digestibility, and safety.&nbsp;</p><p>(1) Sounds like your priors for the intra-variance of meat-based cat food are lower than the inter-variance between validated meat and vegan cat food. I don't share these same priors, and the best I can offer is Chapter 6 of <i>After Meat</i> where I explain in detail how I think about nutrition including the fungibility of food. Long story short, I <i>really</i> don't think there's anything special nutritionally about meat that can't be recapitulated elsewhere, but I understand that not everyone has that intuition.</p><p>(2) AAFCO updates their standards in light of new evidence. The \"trial-by-fire\" is baked into their standards. And I suspect if we had similar priors regarding (1), this point may be moot.</p><p>But I appreciate your good faith, and I'll leave it here.</p>", "parentCommentId": "G4dMMsMh3sQh3G46Y", "user": {"username": "Karthik Sekar"}}, {"_id": "RFLknwHrEst7ybZeN", "postedAt": "2023-05-13T17:06:11.371Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>It seems that we strongly differ on the importance we give to \"chronic\" vs. \"acute\" suffering. I put much more emphasis on the first one (though both are, of course, important). And while cats do often toy with their prey, it usually is just a matter of minutes, not sure if that is what you referred to.</p><p><br><br>Re mice vs. chicken: that is a good point, I haven't thought of that.&nbsp;<br><br>Re your calculations: have you read the post someone linked to in reply to one of your other comments, specifically about the suffering cats hunting causes? While I didn't read it thoroughly, it is very illuminating, and might change your mind on the number of bird/mammals the average cat hunts.<br><br>And while it is but one sample, I can tell you that my own cat (that is <i>very</i> active, has access to wildlife and is a fairly good hunter) definitely does not reach that number. Most days it is just insects. A small mammal (usually a shrew, which I hate seeing as they are adorable) - possibly once every couple of weeks, recently? And until a few months ago, none, so I guess it also varies depending the season and weather.</p>", "parentCommentId": "ZuppwNBup4sxeG2mG", "user": {"username": "Noa Weiss"}}, {"_id": "jhJfw6QPmb7LPak7m", "postedAt": "2023-05-13T17:14:26.670Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>I think this is what all cat owners in the world should have done, regarding the overal suffering owning cats causes - Cats cause a lot of suffering.</p></blockquote><p>Do you estimate that in most of the world, cats are bought? Meaning, that more adopted cats mean more cats are bred to supply that demand? Otherwise, it shouldn't make a difference. Quite to the contrary: a house cat that also goes outside does hunt significantly less than a stray cat (though the strays to have much shorter life spans...).<br><br>In Israel, where I live, it is definitely not - but I know it is not the case for all places. The vast majority of house cats here are stray cats that were adopted, some of them when they were found as deserted newborn (now <i>there's</i> an EA dilemma: is it indeed an altruistic act to then adopt the newborn, and spend the vast resources to raise them into a then-hunting cat? ;)).<br><br>I know that in Berlin, for example, cats are normally bought and paid for, and also pure-bred (which in Israel would be considered a very immoral thing to do).<br><br>What is it like where you live?</p>", "parentCommentId": "aEorw3qjW5PAHJ8Wu", "user": {"username": "Noa Weiss"}}, {"_id": "Th5ZAkymgvDqyioGa", "postedAt": "2023-05-13T17:23:31.377Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<blockquote><p>It sounds intuitively right that cats are happier when they can hunt outside, but it would be interesting to see research on whether, and how, a cat that is kept indoors permanently, can still be happy.</p></blockquote><p>Indeed. I can only attest from my own experience, as well of that of friends'. Including cases where a cat was thought to just have an irritable, discontented character, until they gained access outside (whether by the humans moving houses or the cat shawshanking his way out), and were then found to actually be happy, relaxed kitties.<br><br>Cat \"gurus\" and the likes have their recommendation as to how to keep your cat more content while still confined, but in my opinion, it will never fully give them what they need. Same as I could never be truly happy without going outside, no matter how grand and well equipped my home might be.<br><br>Re \"quick suffering\": I do not mean it is instant, only that it is still a matter of minutes (it is rare that it is over 10 minutes, and most times would not even get to that), which is infinitely less that the whole lives of animals in the meat industry.<br><br>Re not reducing demand for store-bought food, I am not sure I follow. What I say is that when a house cat also hunts and eats wild prey, they eat less of their store-bought meat.&nbsp;</p><p>Does that answer your question?<br>&nbsp;</p>", "parentCommentId": "8tMivr57774bKe7Mh", "user": {"username": "Noa Weiss"}}, {"_id": "WPo5nHXxyznnQ5Bth", "postedAt": "2023-05-15T13:27:39.945Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>I would be careful to compare cats and humans so directly. Yes, it sounds intuitively right that much like how people don't like being confined to a home, neither do cats. But remember how the typical housecat will probably not roam away much further than 200 meters from their home. I don't think most people would enjoy being confined to a radius of roughly 200 meters around their home, but for most cats, this seems perfectly fine. So I don't know how directly cats and people can be compared in that respect. Cats are in any case <i>far</i> more territorial than humans.</p><p>If it is still truly impossible to have happy indoor cats, then I think the case for exploring the option of making cats go vegan (and further focusing on spaying and neutering cats) becomes all the stronger from an animal advocacy point of view. Yes, it is true that the prey killed by cats don't suffer for <i>that</i> much longer compared to farmed animals who are killed (although I still feel like cat prey suffer more badly because of the killing method), but let's not forget that cats may catch up to ten mice per day, so the amount of animals being killed is huge, I think that also matters. Also, I really doubt that cats eat less of their store-bought meat when they are allowed to go outside and hunt. Have you not seen how often cats leave their prey behind without eating it, presumably because they have already eaten enough of their store-bought food, which they may find more enjoyable to eat?</p>", "parentCommentId": "Th5ZAkymgvDqyioGa", "user": {"username": "Maxim Vandaele"}}, {"_id": "TJGNFPoLjm8djguAB", "postedAt": "2023-07-25T07:10:41.075Z", "postId": "AFPXXepkgitbvTtpH", "htmlBody": "<p>Yes! I would love to see EA research funding in this area. I would also like to see going beyond cats and dogs and see plant based formulations for all sanctuary animals. I personally have a cat I have been feeding plant based (watered down Benevo kibble) since I got her as a kitten 2.5 years ago, she's thriving. She is also an indoor cat so doesn't terrorise the local wildlife.</p>\n", "parentCommentId": null, "user": {"username": "Mipsy"}}]