[{"_id": "Xup8gLJPnzHKKeJjY", "postedAt": "2022-10-12T11:48:08.154Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I used a model I fine-tuned to generate takes on Effective Altruism. The prompt is \"effective altruism is.\" Here are its first three:</p><blockquote><p>effective altruism is vampirism, except instead of sucking blood you suck hours and happiness from helping people who would otherwise have spent the time improving their lives.</p><p>effective altruism is parasitic. it latches onto the success of actual altruism, which is genuine and humanizing, to justify its cold calculations and make them feel virtuous too.</p><p>effective altruism is rich kid hobbyism pretending to be a moral imperative</p></blockquote><p>I'm somewhat concerned about the use of AI models to [generate propaganda? conduct information warfare?]. Here, the concern is this could be used to salt the earth by poisoning the perceived vibe to make certain demographics dislike EA before they can engage with it deeply.</p><p>I find it important to note the model was not designed to be harmful. It was finetuned to generate self-deprecating humor. Nevertheless, amplifying that capability seems to also amplify the capability to criticize EA.</p><p>I'm interested in what mitigations people have in mind. One way could be at the epistemic level: To teach people to engage kindly with new ideas.</p>", "parentCommentId": null, "user": {"username": "JoyOptimizer"}}, {"_id": "Lzf7zt52WtuvtPHPN", "postedAt": "2022-10-12T14:15:51.393Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Beautiful</p>\n", "parentCommentId": "Xup8gLJPnzHKKeJjY", "user": {"username": "edoarad"}}, {"_id": "qCnGWoLJKnXKbHPsd", "postedAt": "2022-10-14T18:49:47.774Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi, new to the forum! Asking here as it seems to small of a question for its own post:</p><p>I finished reading \"The precipice\" this week, and found the list of current/future existential risks a bit short, especially compared to natural ones. For example, AFAIK space debris might make spaceflight impossible in the near future, making it most likely* impossible to become a multiplanetary species, robbing us of lots of resources, and sooner or later meaning a natural risk will wipe us out on earth (which Ord classifies as an existential risk).</p><p>&nbsp;</p><p>I know space debris has become a hot topic over the last few years, is there any work in an EA context on it? Similarly, have people tried to compile lists with all currently conceivable/knowable existential risks?</p><p>* I dont know much about spaceflight, but it sounded impossible to build spacecraft that could withstand the level of debris that would build up once we reach a tipping point and a lot of satellites become debris.</p>", "parentCommentId": null, "user": {"username": "JanEbbing"}}, {"_id": "NZZbbn9BzcmanokkB", "postedAt": "2022-10-14T22:07:07.717Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<blockquote><p>Beautiful</p></blockquote><p>I think this comment is confusing and unseemly, as it might be supporting the negative content in the parent comment. This is a thread for newcomers, making this concern greater.</p><p>I want to downvote this comment to invisibility or report this to a moderator, but the comment is made by a moderator, and he has two cats, presumably trained to attack his enemies.</p>", "parentCommentId": "Lzf7zt52WtuvtPHPN", "user": {"username": "Charles He"}}, {"_id": "tsfy2HgT7wPcBSewq", "postedAt": "2022-10-14T23:40:56.153Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi Jan, welcome to the Forum! I don't think this answers your whole question, but if you haven't seen it before, you might find this page useful: <a href=\"https://forum.effectivealtruism.org/topics/existential-risk\">Existential risk</a> in the EA Forum Wiki.&nbsp;</p>", "parentCommentId": "qCnGWoLJKnXKbHPsd", "user": {"username": "Lizka"}}, {"_id": "dHHcC45jQBatikmsF", "postedAt": "2022-10-15T07:31:13.471Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Thanks, you may be right.&nbsp;</p><p>To be clear, I found these generated examples clearly false and misleading but still something that I can understand people who feel like this, so I found it a bit funny and uncanny, while I totally agree with JoyOptimizer's concern.</p><blockquote><p>has two cats, presumably trained to attack his enemies.</p></blockquote><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_160 160w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_320 320w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_480 480w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_640 640w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_800 800w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_960 960w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_1120 1120w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_1280 1280w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_1440 1440w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/e49f0b4245a86c630f47ad7613f877198ebdaa08c148e189.png/w_1600 1600w\"></figure><p>They are only trained to be maximally adorable and cuddle my enemies to a fluffy friendship!&nbsp;</p>", "parentCommentId": "NZZbbn9BzcmanokkB", "user": {"username": "edoarad"}}, {"_id": "HtzEFQqhwaTARCob3", "postedAt": "2022-10-15T07:33:54.961Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>(And generally, you or anyone else should feel free to report comments from moderators if you find them damaging the forum's discussion. It may well happen, and it's important to get that kind of feedback)</p>", "parentCommentId": "NZZbbn9BzcmanokkB", "user": {"username": "edoarad"}}, {"_id": "HR7mo6y7Xeqt9ww5M", "postedAt": "2022-10-15T19:38:33.608Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I have some moderately useful comments if you're interested.</p><p>Some basic questions: Are you running this on GPT-NeoX-20B? If so, how are you rolling this? Are you getting technical support of some kind for training? Are you hand selecting and cleaning the data yourself?</p>", "parentCommentId": "Xup8gLJPnzHKKeJjY", "user": {"username": "Charles He"}}, {"_id": "S64Bj8DPbajsj4sDG", "postedAt": "2022-10-16T15:44:41.928Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello! New to the forum, though I’ve been lurking the blogs/podcasts/articles around the EA community for a while!</p>\n<p>Wondering if there are any other folks out here coming from the design/technology industry space, like I am? Would love to hear from anyone about their journey and finding their niche within the community! :)</p>\n", "parentCommentId": null, "user": {"username": "MariellaVee"}}, {"_id": "SCRgdG79T2emb4Ykx", "postedAt": "2022-10-16T22:07:06.223Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Welcome Jan! There has been work done on space risks by EAs, but I don't know if the specific risk you mention has been studied. I'd check out the <a href=\"https://governance.space/\">Centre for Space Governance</a>, the <a href=\"https://spacefuturesinitiative.org/\">Space Futures Initiative</a> (especially their <a href=\"https://spacefuturesinitiative.org/research-agenda/\">research agenda</a>) and this <a href=\"https://80000hours.org/problem-profiles/space-governance/\">80k Hours problem profile</a>.</p>\n", "parentCommentId": "qCnGWoLJKnXKbHPsd", "user": {"username": "Ishan Mukherjee"}}, {"_id": "fQoazaQsCoTJCYkAc", "postedAt": "2022-10-17T19:45:35.263Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi, new to the forum. Looking forward to joining the EA community.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mayank Modi"}}, {"_id": "FSyDmcP8asXRkhtHo", "postedAt": "2022-10-18T01:50:50.712Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p><strong>I’m writing to look for people interested in participating in this contest:</strong></p><h1><strong>Ban Charles He Contest</strong></h1><p>Sort of <a href=\"https://forum.effectivealtruism.org/posts/7hCCdw8LhWFiMjCff/a-common-failure-for-foxes\">inspired by this post</a>, I’m disappointed by a lot of my forum writing because my content is minor and mentally easy and not that meaningful. (While more forum writing probably isn't the ideal solution) there is more difficult writing I can do:</p><p>Basically, I have “answers” to a number of arguments or viewpoints that are either “used against EA” or just occupy a lot of time on EA online media. I think this is bad.</p><p>These arguments or viewpoints are:</p><ul><li>Newcomb’s paradox</li><li>The repugnant conclusion</li><li>This <a href=\"https://forum.effectivealtruism.org/posts/mdbSL9o8H2Z5mjKaj/fermi-paradox-and-the-st-petersburg-paradox\">variation of the St Petersburg’s paradox</a>,&nbsp;<ul><li>Also, I think I have an answer to the \"general St Petersburg paradox\", let’s throw that in too</li></ul></li></ul><p>I think my four answers are pretty obvious.&nbsp;</p><p>I’m worried this sounds like a blogger and I want to put some skin in the game.&nbsp;</p><p><i><strong>If I’m “very wrong”, I’ll get banned</strong></i><strong>, as determined in the following way:</strong></p><p><i><strong>I’m looking for people willing to critique my answers, especially in a ruthless, crisp way. For example, if my answer is flat out logically wrong, highly irrelevant, or has been dealt with thoroughly so that about 50% of experienced EAs are answering with good knowledge of the content of my answer.&nbsp;</strong></i></p><p>Note that \"discursive\" sort of replies, with a “additional consideration” sort of flavor, should not count. Replies should undermine the substance of my answer and generally prop up the targeted argument as a valid project or objection.</p><p><strong>This is subjective, so I’ll implement this judgment of banning in this way:&nbsp;</strong></p><ul><li>I'll post my \"<strong>answer</strong>\". After I post my answers to each of the three topics, anyone can critique with a \"reply\".&nbsp;</li><li>If any single \"<strong>reply</strong>\" gets an agreement score of <strong>10</strong> or more, I’ll be banned for that number of days.&nbsp;<ul><li>Note that strong votes are fine, so just 2 people can trigger this condition.</li><li>This banning will function additively with replies with distinct arguments, e.g. I can get banned for 60 days if there are 6 replies across my four \"answers\".</li></ul></li></ul><p>I’m writing because I’m looking for people who are interested in replying to my answers, making my task harder.&nbsp;</p><p>I will wait until I get a few replies to this comment, which will be taken as a sign of interest and real chance for my ban, then write the above at some point.</p>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "pdtnytxY3wGpBm8Ms", "postedAt": "2022-10-18T13:07:48.174Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>How about changing this into some sort of a \"Change My View\" system, or commit to some reward? Not sure why someone would want to put in time to prove you wrong, or to vote correspondingly, in order to ban you.</p><p>Also, you might very well be wrong in some important way, but still add a meaningful and novel viewpoint to an important problem.</p><p>A lot of your comments have been very well received and possibly have meaningfully contributed to doing more good, but I see that you haven't made any posts. Maybe you should try more of a \"long-form\" writing first? Possibly, send it to some people for review first, and edit accordingly, and then publish it. It's really hard to do justice to any topic, and the four arguments you allude to involve deep questions that have been on the minds of many people.&nbsp;</p>", "parentCommentId": "FSyDmcP8asXRkhtHo", "user": {"username": "edoarad"}}, {"_id": "R9gfDyRDQzDMW9WK5", "postedAt": "2022-10-18T15:09:57.173Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<blockquote><p>I used a model I fine-tuned to generate takes on Effective Altruism.&nbsp;</p></blockquote><p>was unclear. It should be:</p><blockquote><p>I used a model that I fine-tuned, in order to generate takes on Effective Altruism.</p></blockquote><p>This model was not fine-tuned specifically for Effective Altruism. It was developed to explore the effects of training language models on a twitter account. I became surprised and concerned when I noticed it was able to generate remarkable takes regarding effective altruism, despite not being present in the original dataset. Furthermore, these takes are always criticism.</p><p>This particular model is fine-tuned OpenAI davinci. I plan to fine-tune GPT-EA on GPT-NeoX-20B. A predecessor to GPT-EA (GPT-EA-Forum) was trained using a third-party API. I want to train GPT-EA on a cloud platform so I can download a copy of the weights myself. I am not receiving technical support (or funding for GPU costs), it could be helpful. The dataset was selected and cleaned by myself, with input from community members, though I'm still looking for community input.&nbsp;</p>", "parentCommentId": "HR7mo6y7Xeqt9ww5M", "user": {"username": "JoyOptimizer"}}, {"_id": "wdyRsSyyXFmjEbs9Y", "postedAt": "2022-10-19T13:08:27.427Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>(Hastily written, sry)<br><br>I would love to see more of the theories of change that researchers in EA have for their own career! I'm particularly interested to see them in Global Priorities Research as its done at GPI (because I find that both extremely interesting and I'm very uncertain how useful it is apart from field-building).</p><p>Two main reasons:&nbsp;</p><ol><li>It's not easy at all (in my experience) to figure out which claims are actually decision relevant in major ways. Seeing these theories of change might make it much easier for junior researchers to develop a \"taste\" for which research directions are tractable and important.&nbsp;</li><li>Publishing their theories of change would allow researchers &nbsp;to get more feedback on their project and perhaps realise earlier why it's not that important. (This point of course applies not only to researchers). As a result of the second point, it seems less likely that EA researchers get off-track following intellectual curiosities rather than what's most important (which I suspect researchers, in general, are prone to)</li></ol>", "parentCommentId": null, "user": {"username": "Aaron__Maiwald"}}, {"_id": "xLfAGmKjM32amKa5h", "postedAt": "2022-10-20T01:09:03.871Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<h3>Greater variety of EA Newsletter emojis</h3><p>This past EA newsletter used only two emojis, a down arrow (⬇️) and an anchor (⚓), while it talked about the AI Worldview Prize &nbsp;(🤖🧠🏆), asteroids (☄️), prize-winning criticisms of effective altruism (🏅❌:ea-bulb:), articles (📃), news(📰), and announcements (📢), among others.</p><p>This communicated the following message:</p><p>'You have to scroll down, where you have to pay attention (where the anchor is).'</p><p>Rather than:</p><p>'There is a lot of interesting content in this newsletter, someone paid attention to make it visually concise and fun for you. But, don't rely on (visual) oversimplifications, see for yourself.'</p><p>The former is more conducive to limited critical thinking, while the latter can stimulate it.</p><p>Further, the arrow-anchor setup can be understood as normalizing abuse (as the only viable option) (an arrow can symbolize a direction without the request for or agreement to such and an anchor can symbolize threat of the use of force and limited consideration, since it is a heavy sharp object not related to the topics). The normalization of abuse could worsen epistemics within EA and limit the community's skills in cooperation on positive impact.</p><p>In general, viewers can pay the most attention to the portrayal of threats, even if that is not apparent or they are not consciously aware of it. Under threat/stressed, viewers may be more likely to click on content, seeking to resolve the negative feeling that compels them to action.</p><p>Another reason why viewers may be paying attention to content that can be interpreted as abusive but where that is not <i>prima facie</i> apparent is that they seek assurance in the positive intent of/ability to trust the resource (or advertisement). For example, if one feels that an ad is threatening abuse but the text is positive, they can be more likely to read it, to confirm positive intent/seek trust.</p><p>These attention captivation techniques motivate impulsive/intuitive decisionmaking (based on chemical/hormonal processes?) and limit reasoning and deep thinking. These techniques can also motivate impulsive sharing of content, because it evolutionarily makes sense to share threats first and because people seek to affirm positive intent when they share the resource with others who will likely not describe the possible abuse.</p><p>According to this theory, using setups that can be interpreted as threatening but not at first apparently is the most effective way of growing the EA community.</p><p>However, it can be also that the newsletter audience more likely engages with and shares content that is conducive to reasoning and deep thinking.</p><p>For instance, the High Impact Professionals newsletter uses descriptive emojis and the organization is popular in EA.</p><p>While conducting an RCT on the variety of emojis and readership/click-through rate/thoughtfulness of a response requested by the newsletter can be a bit too much, it is one way to test the hypothesis.</p><p>--</p><p>Let me actually also illustrate what I mean on the example of the image used in this post. The image can cause distress but that is not at first apparent.</p><p>The image has feminine symbolism, the flowers and possibly the light. The viewer has not requested or agreed to view this symbolism but viewed it (these are prominent). Highlighted is also the figure's chest. These two aspects can engage the viewer, who may be compelled to pay further attention.</p><p>The leaves on the left side of the image resemble reptiles and birds hiding with the possibility of attack. That can cause cognitive dissonance, because birds and reptiles are considered likely (due to evolution and media) to attack than mammal predators by humans. The leaves near the flower in the bottom left corner resemble a bird with its beak directed toward the figure (who does not pay attention to it). The reader can be compelled to look at the leaves to assess for any threat and freeze in the anticipation of/to prevent the bird's action.</p><p>Some of the figure's fingers can be considered as disfigured. From the perspective of the viewer, the second to the left finger on the figure's hand near the flower is bent and the thumb on the same hand elongated. The other hand is the one that would 'confirm' that there is nothing weird. The hand looks relatively normal, except for the swollen second finger from the top (that also can make one think of literal or metaphorical rotting) and the thumb with the small red pointy end.&nbsp;</p><p>That thumb can be considered as a 'hidden weapon' of the feminine figure. That can make people think of betrayal by those who are traditionally trusted (females). Another form of betrayal/weapon can be the left flower, which is 'going' from the side in the general direction of the viewer, like a snake with an open mouth. The viewer may be compelled to look at it, to make sure that it does not go at them. If you zoom in on the inside of the flower (the violet, purple, yellow, and red shapes), further attention captivation can be analyzed.</p><p>A viewer of this image can become aware of their body and consider it vulnerable. That is because of the bent back of the figure but prominent/highlighted chest. The figure's right side of the chest is the 'assurance' of limited prominence, while the left side portrays significant prominence. (This could be vice versa but that perception can be limited.) This is gender neutral, although the shape can allude to male body fat, which is portrayed as something which should be covered, due to vulnerability (often used in advertisement).</p><p>The figure looks like an authority which is practically impossible to be convinced by reason and must be obeyed, by the facial expression. One may regret engaging with this environment but can be more compelled to 'stay' since seems pointless to 'argue against.'</p><p>The vertical blue stripe on the right side of the image, which coincides with the figure's sleeve, can be interpreted as AI threat. It is like the flickering of the screen. The figure embodies the 'appropriate' reaction to this, which is to do nothing and advance the norms that one cannot argue against.</p><p>There are other things that I could and could not analyze.</p><p>Of course, one can disagree and simply say that it is a normal image of a lady.</p><p>However, I suggest that one stares at the image in peace for a few minutes and observes their emotions and impulses (including motions and intended motions). If the above can be leading, a different DALL-E or prominent advertisement image can be used. One can feel negative emotions/negatively about an environment and physical sensations (such as finger twisting). That is a good reason to understand these techniques rationally but not emotionally and avoid long emotionally focusing on state-of-art AI images (but look e. g. on groups of fashion models where techniques relate mostly to gender norms, body image judgment, and racial stereotypes).</p><p>If one is quite aware of these techniques, considered using various alternatives in the newsletter, and still choses the arrow-anchor framework, then they have the reasoning for it. However, if one is simply influenced by AI and unknowingly advances an abusive spirit, possible impact of the newsletter should be related to its intended objectives and alternatives considered.</p><p>--</p><p>It can also be argued that an arrow and an anchor is nothing like a complex advertisement but that powerful people may like a form of traditional power, while their intents are good. I watched interviews with the 100 top Forbes billionaires and while many enjoy traditional exhibits of power and their intents are good, perhaps only four would actually enjoy abusive newsletter marketing, of which two would not understand it as anything that should be felt or suboptimal for anyone, and one would not seek to advance the abuse further. Two seems vulnerable to being influenced by this marketing, if they happen to be subscribing, which is very unlikely for one and possible but not very likely for the other.</p><p>I have also listened to podcasts with prominent EA funders and while impactful work can be a must, abuse is not (rather, positive relationships and impact is). So, using abusive newsletter emoji marketing is unlikely to please EA funders but can motivate them to repeat this 'tone from the top.'</p><p>--</p><p>In conclusion, the EA newsletter emojis can be reviewed.</p>", "parentCommentId": null, "user": {"username": "brb243"}}, {"_id": "qdAXtsQSJBfpFvDcB", "postedAt": "2022-10-20T18:19:03.928Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everyone, I'm new to the forum.</p>\n<p>Having read a few forum posts over the past couple of weeks, I wanted to become a bit more active and start commenting.</p>\n<p>I've recently started the process of reviewing EA career options (over at 80k hours), and plan to pivot to a more EA-aligned role in a year or so. I've studied mechanical engineering, and I'm currently pursuing a PhD related to engineering and climate change. Also, I'm in the process of becoming a certified systemic coach (for coaching individuals and teams). I live in Braunschweig, Germany.</p>\n<p>Looking forward to get in touch with people here, to get ideas about a new job/role, and to interesting discussions!</p>\n", "parentCommentId": null, "user": {"username": "Malte Schaefer"}}, {"_id": "cYvfxqgx3xZKyJJho", "postedAt": "2022-10-21T12:44:20.713Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Malte,<br><br>welcome to the forum and to EA! We have local groups in Hannover, Göttingen and Magdeburg. Hannover has an online reading group, Göttingen has weekly meetings in person &amp; hybrid (we are doing a career workshop at the 13/11/22). Magdeburg seems to be inactive since 2020.<br><br>So, if you want to connect, this would be a possibility. I can give you the contact information for each group if you want.<br><br>Also, today is the last day to apply for the career fellowship from EA Germany:<br><a href=\"https://ea-germany.notion.site/EA-Career-Planning-Program-03cb0f1f6b9a4ae0b8d723316b558b8f\">https://ea-germany.notion.site/EA-Career-Planning-Program-03cb0f1f6b9a4ae0b8d723316b558b8f</a></p><p>Feel free to contact me if you want to know more or talk about something different. :)<br><br>Greetings from Hildesheim.</p>", "parentCommentId": "qdAXtsQSJBfpFvDcB", "user": {"username": "Felix Wolf"}}, {"_id": "5fhhDuEjhiCgdmt4J", "postedAt": "2022-10-21T17:59:35.022Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi Felix,</p>\n<p>Thank you for your kind and helpful reply! I'll send you a private message regarding your offers.</p>\n<p>Cheerio\nMalte</p>\n<p>Edit: There is now a local EA group in Braunschweig: <a href=\"https://forum.effectivealtruism.org/groups/TGgHpPNHnM4sS6Gcc\">https://forum.effectivealtruism.org/groups/TGgHpPNHnM4sS6Gcc</a>. I'm leaving this comment here mostly so that people stumble upon it if they search the forum for Braunschweig (or Wolfsburg). If you read this and are from the Braunschweig area, get in touch! =)</p>\n", "parentCommentId": "cYvfxqgx3xZKyJJho", "user": {"username": "Malte Schaefer"}}, {"_id": "fjtGn5oqStGFiha4z", "postedAt": "2022-10-21T20:36:35.185Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi all!<br>I'm Jason (Jay) Dykstra, a radiologist and adoptive dad in MI, US. I've been around EA for several years in various groups, but I haven't engaged the forum until now!<br><br>My wife and I have come to LOVE earning to give, donating 80% of our post-tax income to EA-friendly orgs and living off around $50K a year. The \"expenditure limit\" model (different limits for different folks obviously!) is easier than expected once you build the mindset and SO wonderful seeing the impact around the world, as many of you know. :)<br><br>I mentor lots of young adults in easily creating a similar, sustainable mindset for their own journey. With their help I founded blessbig.org, a free online hub like Give Well that uses EA approaches to recommend high impact orgs in more cause groups (e.g. elderly care, first responders, religious orgs) than typical EA sites. So fun to see folks learn, give, and join the world in celebrating the difference!<br><br>Thanks for every contribution YOU make to doing good better, and feel free to reach out anytime!<br><a href=\"mailto:email.jay.dykstra@gmail.com\">email.jay.dykstra@gmail.com</a></p>", "parentCommentId": null, "user": {"username": "Jason Dykstra"}}, {"_id": "n5oqmzhsFJZu9huFw", "postedAt": "2022-10-21T20:40:32.203Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Welcome to the Forum and thank you so much for your hard work donating so much!&nbsp;</p>", "parentCommentId": "fjtGn5oqStGFiha4z", "user": {"username": "Linch"}}, {"_id": "RwoYdJCk4h5NByBCd", "postedAt": "2022-10-21T20:45:58.653Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Thank you for your encouragement and your work doing good as well!&nbsp;</p>", "parentCommentId": "n5oqmzhsFJZu9huFw", "user": {"username": "Jason Dykstra"}}, {"_id": "bpzJutvPEpzXdsYXE", "postedAt": "2022-10-22T00:24:45.990Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Jason,<br><br>welcome to the forum! Nice to hear you are comfortable with earning to give as your cause area.<br><br>I have some questions regarding your donation website.<br><br>Where do you get your rating for the projects? Sometimes you are unable to find data from charity evaluation sites, and then you typically list it with:<br><br>Impact Evidence – Strong<br>Relative Need – Stronger<br>Financial Transparency &nbsp;– Strongest<br>Financial Efficiency – Strongest<br><br>The last two are usually given the best rating, even if you have no external sources which you normally use to justify the rating.<br><br>For example:<br><a href=\"https://blessbig.org/evangelism-discipleship-missions/\">https://blessbig.org/evangelism-discipleship-missions/</a><br><br>Do you have further information on the difference between strong, stronger and strongest? What qualifies for each rating?<br><br>You mention that your team spend hundreds of hours in research, but never says it anything about the conclusion and methods they used specifically. Can you please provide us with more information how you decide to list an organization and how you choose your ratings?<br><br>I have different request, please link your sources.<br>I was curious about your claim that your work (big blessing?) was mentioned in the Washington Post, and I was unable to find it via Google. Only after I used your name in the search, I found the post:<br><a href=\"https://www.washingtonpost.com/magazine/2020/09/23/effective-altruism-charity/\">https://www.washingtonpost.com/magazine/2020/09/23/effective-altruism-charity/</a><br>Bless Big was not mentioned.<br><br><br>Thank you and have a great weekend. :)<br><br>&nbsp;</p>", "parentCommentId": "fjtGn5oqStGFiha4z", "user": {"username": "Felix Wolf"}}, {"_id": "kjhfFuZ38zptxm8F5", "postedAt": "2022-10-23T11:22:46.636Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello :) &nbsp;I'm Mischi. I'm currently based in Berlin and I've first heard of EA through Will MacAskill's conversations with Sam Harris. I've been quite excited to discover just how much is going on in the movement and how many people are involved, although I realize I probably don't know the half of it yet!&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "FZeCRfgvgJwjaqnmS", "postedAt": "2022-10-26T10:28:54.866Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everybody! I'm Victoria, I'm currently based in Edinburgh and I heard about EA through LessWrong. I've been involved with the local EA group for almost a year now, and with rationalism for a few years longer than that. I'm only now getting around to being active on the forum here.&nbsp;</p><p>I was a medical student, but I'm taking a year out and seriously considering moving into either direct existential risk research/policy or something like operations/'interpreting' research. When I've had opportunities to do things like that I've really enjoyed it. I've also previously freelanced with Nonlinear and CEA for research and writing gigs.</p><p>Long-term I could see myself getting into AI, possibly something like helping build infrastructure for AI researchers to better communicate, or direct AI work (with my neuroscience degree).</p><p>See youse all around!</p>", "parentCommentId": null, "user": {"username": "brook"}}, {"_id": "WAxxrW7uBys5j9KZH", "postedAt": "2022-10-27T07:38:37.543Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Victoria,<br>welcome to the forum! Have fun participating here, maybe subscribe to the newsletter. It's a good way to stay in touch. :)<br><br>Greetings.</p>", "parentCommentId": "FZeCRfgvgJwjaqnmS", "user": {"username": "Felix Wolf"}}, {"_id": "gfy4jPijHBHwpQG28", "postedAt": "2022-10-27T07:40:42.167Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hey Mischi,<br>welcome to EA and the forum. :)<br><br>If you want to connect with the local EA scene, write me a PN and I will give you the links.<br><br>Greetings.<br><br>&nbsp;</p>", "parentCommentId": "kjhfFuZ38zptxm8F5", "user": {"username": "Felix Wolf"}}, {"_id": "gD9JC89EKbopSNuHd", "postedAt": "2022-10-30T10:36:10.297Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi Everyone.  Dominic (Dom) Leary.</p>\n<p>I read Professor MacAskill’s article on a recent flight to Ireland and was touched by his rallying cry to drive charitable initiatives that can help society address the problems that our governments, global institutions, and private sector can not do given the lack of appropriate inter-governmental legal frameworks and misaligned interests of capital markets.</p>\n<p>I don’t know how I can contribute but I do know that lone voices carry little influence so I’m reaching out to connect. I am now based in Rome, Italy after having spent the past 30+ years of my career travelling from the UK to SEA, Australasian, US, and back to Europe through the Pre-Post Brexit.</p>\n<p>I would welcome meeting other like-minded EA Forum members here in Rome.</p>\n<p>Dom Leary</p>\n", "parentCommentId": null, "user": {"username": "Dominic Leary"}}, {"_id": "tMsZNzfbBanaXaeBQ", "postedAt": "2022-10-30T13:21:35.934Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p><i><strong>Is there a central or topic-specific bounty board?</strong></i></p><p>(I'm personally looking for AI interpretability tasks). I know there are distributed opinions on what's important but I'd like a central place for them <strong>and for them to be prioritized in some way</strong>:<br>- bounty price sizes<br>- (expert) authority<br>- popularity (votes or prediction market)</p><p>I know there's a job board, but I'd like a content/problem-focused board instead.</p>", "parentCommentId": null, "user": {"username": "jo3"}}, {"_id": "94MHTWKdyPHsFtcCz", "postedAt": "2022-10-30T15:18:42.072Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Is <a href=\"https://www.super-linear.org/\">https://www.super-linear.org/</a> similar to what you're looking for?</p>", "parentCommentId": "tMsZNzfbBanaXaeBQ", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "wboLwhz9ZcbYfx4Yi", "postedAt": "2022-10-31T12:06:42.086Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Dom,<br><br>welcome to EA and welcome to the forum!<br><br>If you want to connect with the local EA scene in Rome, here have some links:<br><br>EA Italy website:<br><a href=\"https://altruismoefficace.it/\">https://altruismoefficace.it/</a><br><br>Social media:<br><a href=\"https://www.instagram.com/altruismoefficace/\">https://www.instagram.com/altruismoefficace/</a><br><a href=\"https://www.facebook.com/altruismoefficace\">https://www.facebook.com/altruismoefficace</a><br><br>Slack:<br><a href=\"http://bit.ly/AltruismoEfficace_Slack\">http://bit.ly/AltruismoEfficace_Slack</a><br><br>Rome local group:<br><a href=\"https://forum.effectivealtruism.org/groups/tqbJiq97F36tqSKEB\">https://forum.effectivealtruism.org/groups/tqbJiq97F36tqSKEB</a><br><br>\"I don’t know how I can contribute\" - read more about EA, join a fellowship and meetup with the local EA group. Find out what's your cause area could be and connect with others on an EAGX (after the intro fellowship).<br><br>You can join existing projects, create your own, or just do earning to give and be part of the community. It is very nice to see you here. For starters, maybe add a bio to your forum profile, so others can see what you are interested in. :)<br>&nbsp;<br>Feel free to contact me if you have any questions about EA or want to discuss a certain topic.</p><p><br>With kind regards<br><br>Felix Wolf</p>", "parentCommentId": "gD9JC89EKbopSNuHd", "user": {"username": "Felix Wolf"}}, {"_id": "jMcSvPuQDpLe9tMcQ", "postedAt": "2022-10-31T17:28:37.426Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everyone. My name is Dominion Alajemba, I am from Nigeria in Africa.</p>\n<p>About a month ago, I stumbled upon a status update on EA for Christians made by Daniel Ajudeonu on the WhatsApp app.</p>\n<p>My interest has been sparked, and I'm very happy to know that I can contribute my own little quota to solving the world's pressing issues. Little drops make the ocean, they say.</p>\n<p>I am a Creative, and I'm currently studying Adult Non-formal Education/English and Literature, in the University of Benin, Nigeria. I'm in my last semester.</p>\n<p>As a creative, I use graphic design as a medium/channel to express my opinions, thoughts and convictions. I infuse my storytelling, content writing/developing, photography, and video editing skills to this.</p>\n<p>I know that with what I have, and what I'll have, I can contribute immensely to this cause.</p>\n<p>Narrowing it down, I have picked particular interests in Plastic Pollution, environmental degradation and deforestation (which are major causes of Climate Change) and food wastage, which falls under Food Security. I do hope I can give my very best in these aspects.</p>\n<p>Navigating the entirety of EA and EA for Christians can be quite challenging as there's a ton of info to go through and consume, so I'd appreciate any help I can get.</p>\n<p>Thank you.</p>\n", "parentCommentId": null, "user": {"username": "Dominion Alajemba"}}, {"_id": "8nYyesnxGY8amrQGZ", "postedAt": "2022-10-31T19:15:44.626Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello everyone, my name is Dawson.</p><p>I'm a data scientist in Denver, Colorado. I got into EA a few years ago after hearing about it on Sam Harris's podcast. Thinking about earning to give and the length my dollar could go for others was extremely influential and continues to be fulfilling for me.</p><p>I would love to start participating in the conversation. I just launched a Substack--it's a bit idiosyncratic and not strictly about EA, but I think my inaugural post would be interesting to a lot of people here. Would love to hear any criticism or discussion so I can get smarter about this stuff.</p><p><a href=\"https://orbistertius.substack.com/p/morality-and-marginal-existence\">https://orbistertius.substack.com/p/morality-and-marginal-existence</a></p><p>(What's the policy on self-promotion here? Is it okay to link my own works in these threads or in posts?)</p>", "parentCommentId": null, "user": {"username": "dawsoneliasen"}}, {"_id": "MhXnuiip2tCf3MuC2", "postedAt": "2022-11-01T12:32:33.773Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>David, let’s connect - also a management consultant exploring a pivot to AI!</p>\n", "parentCommentId": "A5hazTbmP4QbRsSPc", "user": {"username": "Emily Dardaman"}}, {"_id": "aHuCz2oDg4tH6owTJ", "postedAt": "2022-11-01T22:52:13.188Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Dominion,<br><br>welcome to EA and the EA forum! :)<br><br>I organized Clean-Ups, study forestry and was into foodsharing (&gt;400k people in Germany which work against food waste), so I really like your cause areas. :D&nbsp;<br><br>I would really like to see some of your work, can you please show us some or send me a personal message?<br><br>If you need help with navigation, feel free to ask me and I will try to help out. I did not look into the EA for Christians topic in the past, but here is what I found, which could be helpful:<br><br>Website:<br><a href=\"https://www.eaforchristians.org/\">https://www.eaforchristians.org/</a></p><p>Events:<br><a href=\"https://forum.effectivealtruism.org/groups/gjCkZ4dPHs7HzM3ar\">https://forum.effectivealtruism.org/groups/gjCkZ4dPHs7HzM3ar</a><br><br>With kind regards<br><br>Felix</p>", "parentCommentId": "jMcSvPuQDpLe9tMcQ", "user": {"username": "Felix Wolf"}}, {"_id": "mABbej8yeP6wtTJrG", "postedAt": "2022-11-03T02:21:29.414Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I posted a compilation of all EA memes from October <a href=\"https://forum.effectivealtruism.org/posts/7eiGuYnka5FkFtnER/all-ea-ai-memes-from-october\">here</a>, so you don't have to wade through Facebook to encounter EA memes.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "PNs329gxavBBd4yeB", "postedAt": "2022-11-03T15:28:19.313Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I think it's fine to share your own work if it's relevant! And at a glance, that seems very relevant.&nbsp;</p><p>Re self-promotion: you can check the <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Job_ads_or_other_announcements_regarding_your_work\">guidance I wrote more specifically for advertising jobs</a> — I'd bet that it is relevant to this question.&nbsp;</p>", "parentCommentId": "8nYyesnxGY8amrQGZ", "user": {"username": "Lizka"}}, {"_id": "Cg2DMuZuBZHgJ56ep", "postedAt": "2022-11-03T15:30:44.884Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Moreover, you might want to consider <a href=\"https://forum.effectivealtruism.org/posts/8yDsenRQhNF4HEDwu/link-posting-is-an-act-of-community-service\">link-posting or cross-posting relevant content</a>.&nbsp;</p>", "parentCommentId": "PNs329gxavBBd4yeB", "user": {"username": "Lizka"}}, {"_id": "hH974tWGCPoqE69Xm", "postedAt": "2022-11-03T19:52:20.170Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Guys, I'm &nbsp;Miguel, &nbsp;creator &nbsp;of &nbsp;whitehatStoic ! That focuses on sharing my journey helping the idea of Effective Altruism grow. &nbsp;New To The Forum but have been involved to altruistic projects here in there over the years. Glad to be here and have a nice day!</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "mDukkJKbNzrozaYzZ", "postedAt": "2022-11-04T08:56:23.808Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hey Miguel,<br><br>welcome to the Forum. I am curious, in which projects were you involved so far? Always happy to learn about interesting stuff EAs do.<br><br>And one question regarding your YouTube channel, do you have the copyright permission for posting the content of other creators?<br><br>Thank you, and also a wonderful day. :)</p>", "parentCommentId": "hH974tWGCPoqE69Xm", "user": {"username": "Felix Wolf"}}, {"_id": "3CaFvNB45HbSFM5xA", "postedAt": "2022-11-05T00:25:10.593Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Both the vibes and possibly the reality of tech layoffs/demand for SWE is falling, at least on Hacker news.</p><figure class=\"image image_resized\" style=\"width:70.3%\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_806 806w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6f3008d186f6e47d5282c8d24956104377b02e58e87c8165.png/w_810 810w\"></figure><p><a href=\"https://news.ycombinator.com/item?id=33463908\">https://news.ycombinator.com/item?id=33463908</a></p><figure class=\"image image_resized\" style=\"width:81.81%\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/10f96dfffef1c140252ff96c815bd2b5b3e541a5a875d1bf.png/w_878 878w\"></figure><p><a href=\"https://news.ycombinator.com/item?id=33025223\">https://news.ycombinator.com/item?id=33025223</a></p><figure class=\"image image_resized\" style=\"width:69.49%\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_151 151w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_231 231w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_311 311w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_391 391w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_471 471w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_551 551w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_631 631w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_711 711w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/99fa92f08f426ecddaad4f974f4966472de2fa2f796e8d95.png/w_791 791w\"></figure><p><a href=\"https://news.ycombinator.com/item?id=33083279\">https://news.ycombinator.com/item?id=33083279</a></p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_130 130w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_260 260w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_390 390w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_520 520w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_650 650w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_780 780w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_910 910w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_1040 1040w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_1170 1170w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/f4c5d82ded982c3e74cea27e334a7ab8a612807168fc9d80.png/w_1219 1219w\"></figure><p><a href=\"https://news.ycombinator.com/item?id=32312303\">https://news.ycombinator.com/item?id=32312303</a></p><p>This seems useful to flag (might be big enough that it seems like an opportunity for the various orgs that are looking for SWE and other talent, even after considering fit/alignment/lemons).</p>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "TmvPbuKj9Mnoasbsh", "postedAt": "2022-11-05T16:27:30.035Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everyone, I'm Dominik.</p><p>I'm a graduate student pursuing a Master's in Public Sector Innovation from multiple different European universities. I got pointed to EA through Will MacAskill's recent book (and the entire rabbit hole of literature leading up to it). It has been astounding and encouraging to see that there is an entire community of people out here seeking to apply reason and scientific insight to doing as much good as possible!</p><p>Currently, am looking for prospective Master's thesis topics (TBD until end of November) - and I am open to pretty much everything relating to innovation, &nbsp;governance, technology management, organizational change management, etc.</p><p>So if there is a relevant EA research agenda that I could draw from, please feel free to throw any hints my way!&nbsp;</p><p>(I just skimmed through the various resources here, but also by 80k hours, etc. And it's just too much to take in at first sight :)</p><p>Greetings from Estonia</p><p>Dominik</p>", "parentCommentId": null, "user": {"username": "Dominik Braun"}}, {"_id": "mKLhZhrSLJG5jt6wa", "postedAt": "2022-11-06T01:47:35.340Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi Felix,&nbsp;</p><p>I am currently supporting two projects through donations namely Dr. Jordan B. Peterson and Huberman Lab. Currently, I'm trying to see if red teaming EA ideas, similar to those ones in Superlinear or AI x-risk is something I can be a part with moving forward.</p><p>As far as the YouTube Channel, That is an experimental project of mine - sharing what I study at a time which I know will become useful to other people too, as my goal is to share probably in this lifetime is to share useful and truthful ideas. &nbsp;I did not personally asked for permission in posting them - but have seen numerous times that Dr. Jordan Peterson encourages people to share the ideas as long as the context is complete and YouTube filters the permissions and all of the videos uploaded never had copyright &nbsp;issues.</p><p>I'm trying to learn as I go in this journey to be honest and do not have all the answers, I would appreciate guidance and comments from everybody - especially more experienced content creators in the EA Community.</p><p>Thank you Felix, Looking forward for your &nbsp;reply!</p>", "parentCommentId": "mDukkJKbNzrozaYzZ", "user": {"username": "Miguel"}}, {"_id": "4XvwJgKB7uqHj7ueC", "postedAt": "2022-11-06T15:45:38.230Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>My name is Nnaemeka Nnadi. I am a lecturer at Plateau State University and also the chief scientific officer of Phage biology and therapeutic hub, a non-profit focused on isolating phages and phage biobanks for the global phage community. &nbsp;I am also one of the co-lead for Africa Phage forum; the umbrella body for all phage researchers in Africa. &nbsp;Antibiotic resistance is a global issue and will hit Africa the most, Nigeria for example depends on external sources for their drugs. Phages are viruses that feed on bacteria, it has proven effective in Europe and America. As usual, Africa is lagging behind. My goal is to help Nigeria and by extension Africa start the revolution by developing the capacity to isolate and store phages. This I hope to achieve via the Africa Phage forum and the Phage biology and therapeutic hub</p><p>&nbsp;</p><p>I found EA after several attempts to get funded using the regular grant means, although not yet funded via EA. &nbsp;However, I am beginning to have a mind framed towards projects that impact people over and above publications. So ask me questions that relate to how to adapt and tailor your ideas to fit into resource-limited settings. &nbsp;Also if you are interested in biosecurity that relates to one-health and drug resistance. &nbsp;I look forward to learning, re-learning and unlearning on this platform.&nbsp;</p>", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "BkcD4mDPF7aGgzkDr", "postedAt": "2022-11-07T14:40:36.104Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hey all!</p><p>New to the forum and currently working as a HS Math Teacher. Really interested in the movement building side of things and through that lens have started volunteering with Giving What We Can on their Charity Election initiative.</p><p>In short, Giving What We Can wants to offer any school&nbsp;full sponsorship to host a charity election, a school-wide election among three charities. Through the election, students vote to direct up to $2,000 in fully sponsored funds to their choice of three highly impactful charities.&nbsp;</p><p>If you know of any schools, educators, or students who might like to run a charity election, you can direct them to apply for the grant <a href=\"https://www.givingwhatwecan.org/events/guides/charity-elections\">here</a> &nbsp;or alternatively put them in touch with me at <a href=\"mailto:dan.roeder@givingwhatwecan.org\">dan.roeder@givingwhatwecan.org</a></p>", "parentCommentId": null, "user": null}, {"_id": "tiKYFmDGehkXBaLQH", "postedAt": "2022-11-07T22:03:57.075Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi, everyone! I am an undergraduate student journalist. Personally, I am particularly interested in <a href=\"https://mndaily.com/273291/opinion/ericson-turn-on-the-money-hose/\">global poverty</a>. I'm something of a sympathizer to EA - I really like certain aspects, but not other ones. Right now I'm writing an opinion column about the movement and its ideas that will be partly laudatory and partly critical.</p><p>I'm looking to speak with people who are more involved in the movement than I am to get their perspective. If you want to do a brief discussion with me about your experience and thoughts about EA, I'd love to talk to you. Feel free to send me a message here or &nbsp;email me at sericson@mndaily.com.</p>", "parentCommentId": null, "user": {"username": "Sean Ericson"}}, {"_id": "tEnsBNDc5ib2BxDwH", "postedAt": "2022-11-08T09:08:56.506Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi all, I'm Michael Simm. I am a nonprofit entreprenuer focused on disruptive systems (eg, understanding and using emerging technologies to make the future better). I'd love to see how much if at all people in EA are familiar with disruptive technologies and how open they might be to learning about a new one, one that might impact EA greatly.</p><p>When I first became interested in disruptive technologies, I had my focus on climate change. I quickly identified electric cars, solar panels, and energy storage (particularly batteries) to be on the verge of upending reliance on fossil fuels and global transportation systems. Then, I ran across Dr. Tony Seba, who was one of the only people to accurately predict the massive price declines of solar, electric cars, and batteries. He’s now doing fantastic research into the coming disruptions in energy, transportation, and other areas with an organization called RethinkX.&nbsp;</p><p>RethinkX has predicted, among other things, that there will be almost no gas cars sold by 2030, &nbsp;and that the animal agriculture industry is headed into widespread bankruptcy (which would be very good for animal welfare interests). They've found that disruption generally happens when any system proves 5X better than the incumbent one, thus opening a huge opportunity space.&nbsp;</p><p>The nonprofit I founded, is designed to leverage the disruptive potential of the most cost-effective anti-poverty intervention in developed countries (guaranteed income), and use it to make a big impact against homelessness and then poverty over time. This could sound far-fetched, but I think that our pilot project is likely to outperform a lot of EA developing world interventions in cost per QALY. I'm working on a major post to introduce it later this week so <strong>please reach out</strong> <strong>if you'd be interested in contributing</strong>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Michael Simm"}}, {"_id": "7gJTvrd5wxHKcgBAT", "postedAt": "2022-11-09T06:40:02.878Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>There should be a small crack team dedicated to identifying rich people who'd be good candidates for EA benefactors and recruiting them, now that SBF and FTX are down for the count. If you're interested in doing this, message me and I can give you some names privately.</p>\n", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "CxCwysrb8sgNWPKPe", "postedAt": "2022-11-09T06:48:17.975Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Also, the EA movement really needs to diversify its assets. It's a mistake for so much of our collective assets to be tied up in Meta and crypto, although this is somewhat unavoidable – Dustin owns Dustin's assets, not the EA movement. When seeking out more big benefactors, we should look beyond tech.</p>\n", "parentCommentId": "7gJTvrd5wxHKcgBAT", "user": {"username": "evelynciara"}}, {"_id": "ZryTCznjSdpg9mj32", "postedAt": "2022-11-09T10:17:40.809Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Michael,\nwelcome to EA and the forum. :)</p>\n<p>Thank you for the teaser of your post coming next week, I am currious about your theory of change and how you plan to outperform existing high impact charities.</p>\n<p>If you want me to read your post beforehand for a short feedback I can help you.</p>\n<p>Greetings</p>\n<p>Felix</p>\n<p>PS: nice to hear you participate in the fellowship, have fun in the discussions. :) I am currently doing a longtermism fellowship organized by EA Munich from Germany.</p>\n", "parentCommentId": "tEnsBNDc5ib2BxDwH", "user": {"username": "Felix Wolf"}}, {"_id": "KCEycaeMmq4Nzxazn", "postedAt": "2022-11-09T10:22:15.575Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>My understanding is Dustin has already diversified out of Meta to some large degree (though I have no insider information).</p>", "parentCommentId": "CxCwysrb8sgNWPKPe", "user": {"username": "N N"}}, {"_id": "yhiqL3zRNz3ydS4QG", "postedAt": "2022-11-09T10:24:59.095Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hey Dan,\nwelcome to the forum. :)</p>\n<p>Yesterday I hold my first Giving Game for the local EA group and some students and I was thinking about going into the schools with such an intervention.</p>\n<p>I will write you a PN regarding this.</p>\n<p>Have a nice day and hope to see you in the comments on some other posts here too. ;)</p>\n", "parentCommentId": "BkcD4mDPF7aGgzkDr", "user": {"username": "Felix Wolf"}}, {"_id": "txbeg96P3Qp8ePPfm", "postedAt": "2022-11-12T11:07:13.707Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi all! New to the forum, but I've been aware of and thinking about EA for a while, and would like to begin engaging a bit with the community. I'm a PhD student in physics at the University of Geneva working on quantum communication.</p><p>I'm particularly interested in chatting with anyone with ideas or knowledge about humanitarian use cases for quantum computing (might start a thread about this later, especially if anyone else is interested). My education re: quantum computing has tended to focus more on principles than applications, but when applications are mentioned they tend to fall into the broad categories of finance or pharmaceutical research. I'm hoping to find some different perspectives.&nbsp;</p><p>Cheers!</p>", "parentCommentId": null, "user": {"username": "Joey Marcellino"}}, {"_id": "xhPd5JQvejQQvFPHk", "postedAt": "2022-11-13T20:42:20.204Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everyone! I'm a DPhil philosophy student at Oxford University where I write a dissertation on Longtermism (see my bio for some more info). I've been involved with EA for several years and just decided to (finally!) &nbsp;create a forum account. Looking forward to commenting on some of the great forum posts instead of just reading them as I did so far :)</p>", "parentCommentId": null, "user": {"username": "Jakob Lohmar"}}, {"_id": "kePo7noX9ghzz7HYW", "postedAt": "2022-11-14T08:11:10.088Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Jakob,<br>welcome to the forum and greetings from Germany. *wave*<br><br>MfG<br>Felix</p>", "parentCommentId": "xhPd5JQvejQQvFPHk", "user": {"username": "Felix Wolf"}}, {"_id": "dar5HBuXCF8ikxsE6", "postedAt": "2022-11-15T20:52:03.530Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi all! I connected with EA in Bonn, where I am currently a visiting researcher in the department of English, American, and Celtic Studies. I live more permanently in New Jersey, where I am professor in the English department with strong interest in environmental issues. I am interested in writing more for general audiences on sustainability and climate communication. Looking forward to getting to know more folks here.</p>", "parentCommentId": null, "user": {"username": "hestes"}}, {"_id": "GjeozAujNL85BCPGH", "postedAt": "2022-11-16T09:55:17.342Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello,</p><p>I'm a grant writer and project manager in the UK charity sector, looking to more actively engage with EA. My particular area of interest is drug-resistance and the mitigation of that X-risk. I'm pretty up on the theory behind EA ideas, but have mostly been in the \"LessWrong Diaspora\" rather than engaging with the EA space specifically.</p><p>If anyone knows of UK charities tackling drug-resistance, I'd greatly appreciated pointing in their direction.</p>", "parentCommentId": null, "user": {"username": "CWarden"}}, {"_id": "p7TJnGSvhxbSN6B3j", "postedAt": "2022-11-16T10:09:07.457Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi! I initially posted this in the 'hiring' thread, but since that's expired, I want to share it here as well.&nbsp;<br><br>I'm now working as a <a href=\"https://amber-dawn-ace.com/\">freelance writer and editor</a>, mostly for people in the EA community. I can help you get out those Forum posts that have been languishing in your drafts, or articulate ideas that are bouncing around your head. If you're interested, email me at ambace@gmail.com, or book a quick chat in my <a href=\"https://calendly.com/amber-ace/15min\">Calendly</a>. Also feel free to message me here on the Forum. There are some writing samples <a href=\"https://amber-dawn-ace.com/blog\">here</a>, <a href=\"https://contemplatonist.substack.com/\">here</a>, and on my Forum profile.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "FCpkjMHnYaGDoHvvZ", "postedAt": "2022-11-17T16:14:26.711Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I'd be happy to help however I can :)&nbsp;</p>", "parentCommentId": "7gJTvrd5wxHKcgBAT", "user": {"username": "Locke"}}, {"_id": "bu5PyX8A3sGsJGvha", "postedAt": "2022-11-17T16:41:38.725Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I'm not sure they would call it \"recruiting\", but there already are large parts of existing nonprofits that talk to current &amp; future ultra high net worth individuals, such as Longview Philanthropy, Founders Pledge, Generation Pledge, and Open Philanthropy. But there are only a very limited number of potentially sympathetic ultra high net worth individuals, and you don't want to put them off effective giving, so it's important to do it right. As such, I definitely would not suggest starting a new crack team to try to do this work. Instead, it's better to talk to the existing groups that cater to UHNWIs, first.</p>", "parentCommentId": "7gJTvrd5wxHKcgBAT", "user": {"username": "RyanCarey"}}, {"_id": "5AJ2pykAfxyytzxmM", "postedAt": "2022-11-17T16:55:38.652Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Anyone work at GiveWell? I was somewhat intrigued by the new senior researcher position though curious to learn more about the direction of the organization. Specifically, I'd be curious into how deep GiveWell is open to looking into state capacity issues. I saw the relatively recent jpal work and curious if they'd be open to doing more of that work.&nbsp;</p><p>&nbsp;</p><p>https://www.givewell.org/about/jobs/senior-researcher</p>", "parentCommentId": null, "user": {"username": "Locke"}}, {"_id": "mDX2nj5q9LTFmNtRQ", "postedAt": "2022-11-18T17:42:25.144Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Thanks for helping me edit the post that I just finished!</p><p>I wasn't kidding about having a plan to not just outperform GiveWell Top Charities, but fully fund all of them - as a side project no less...</p><h3><a href=\"https://forum.effectivealtruism.org/posts/HYRfAGwNc6jzKkWt7/introducing-the-logical-foundation-a-plan-to-end-poverty\">Introducing The Logical Foundation, A Plan to End Poverty With Guaranteed Income</a></h3><p>Please check it out (and upvote so more people see it) and try to find any holes in the plan, that's largely why I put it here.</p><p>PS: I really did have such a great time with my EA program this fall, I actually got our 501(c)(3) determination letter in the middle of it. Do you have any thoughts on the 'longtermist Implications' section? Maybe even share it with your cohort?</p>", "parentCommentId": "ZryTCznjSdpg9mj32", "user": {"username": "Michael Simm"}}, {"_id": "wPxbPkvrxypwF9Tfi", "postedAt": "2022-11-21T18:30:39.807Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi all. I've been digging through EA ideas and content over the past two years and becoming increasingly involved over the past year. Attended EAGxVirtual, which was amazing, and am looking forward to attending my first in-person group event in Manchester, UK. I've been working for a homelessness charity for nearly 5 years now (having carried out a variety of roles) and am looking to make a move into a higher-impact role. I've got a few forum posts percolating so, hopefully, I'll be posting some of these soon. Glad to be here in the community!</p>", "parentCommentId": null, "user": {"username": "AnderMorgan"}}, {"_id": "qTucsDR5HGMHFHudL", "postedAt": "2022-11-22T12:48:07.115Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Ander,<br><br>welcome to the Forum. Nice to see you here, I hope the Manchester city group is still flourishing.<br><br>Looking forward to your first post!<br><br>With kind regards<br><br>Felix</p>", "parentCommentId": "wPxbPkvrxypwF9Tfi", "user": {"username": "Felix Wolf"}}, {"_id": "3DaiJF2adteCiqS2H", "postedAt": "2022-11-24T21:07:19.548Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>So someone I know has studied social media (e.g. working advising the C-level at companies who are building tools for a state-level entity to monitor extremists in social media).&nbsp;</p><p>Someone I know has run an online community created from scratch, that grew to thousands of people. At times, there were disputes and controversies, and they came under attack and they managed it well (probably ???).&nbsp;</p><p>I'm writing to give some tools to the moderator:</p>", "parentCommentId": null, "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "tFyeo4oJiCLoYzKkd", "postedAt": "2022-11-24T21:08:37.601Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<h2>Hot spaces</h2><p>You can create hot spaces with certain looser norms than the rest of the forum. Then you can direct discussions, people to those spaces.&nbsp;</p><p>The strategy of using these spaces are useful because:</p><ul><li>This gives a natural outlet to heated discussions, and the explicit looser norms can make the discussions healthier&nbsp;</li><li>It pulls out heated discussion from other spaces, so they are less disruptive</li><li>The space gives knobs and levers for moderators<ul><li>You can control how visible these spaces are for the public, e.g. possibly in the way “community” tags have different visibility&nbsp;</li><li>You can announce that it is open for X days, will be closed in X days</li><li>You can adjust and edit the norms and discussion inside of it as you go</li></ul></li></ul><p>Making these spaces and setting these boundaries also expresses agency, control and vision for the moderator. Expression of this is healthy and builds respect and further agency.</p><p>If you want to do this, these hot spaces can be made in many different ways, e.g. posts, threads, sections, tags. Probably some thought about the form it could take is useful. Further planning beyond designing the space is usually less rewarding.</p>", "parentCommentId": "3DaiJF2adteCiqS2H", "user": {"username": "To be stuck inside of Mobile"}}, {"_id": "vjdipqktxZBt9n8QE", "postedAt": "2022-11-25T20:05:15.099Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>After graduating with a masters in economics from Oxford in July 2022, I’ve been a charity entrepreneur. This is my uncut journey on that path Follow me on my journey as I document everything behind the scenes of being a charity startup founder!</p>\n<p>YouTube playlist\n<a href=\"https://youtube.com/playlist?list=PLatl23CKLmapNvrypAYgxOHwevQY231Oq\">https://youtube.com/playlist?list=PLatl23CKLmapNvrypAYgxOHwevQY231Oq</a></p>\n<p>Twitter @simonsallstrom</p>\n<p>WHAT IS THE PURPOSE OF OUR CHARITY?</p>\n<p>DirectEd Development Foundation - direct donations for education. Our purpose is to identify high potential students in sub Saharan Africa, starting in Kenya and Ethiopia, and facilitate the resources needed for them to successfully enter a career as remote software engineers, all evaluated rigorously through close partnerships with academic researchers.</p>\n<p>We are innovating the use of emergent technologies in order to reduce costs, increase transparency and empower our students. Through the use of self-sovereign identifiers, we enable students to take agency over their identity and to build reputation. The combination of this type of privacy preserving digital identity infrastructure with smart contracts is what enables peer-smart contract-to-peer distribution of scholarship funds conditional on students reaching learning milestones, thus enhancing accountability and trust and removing costly middlemen and the leakages associated with which.</p>\n<p><a href=\"https://directed.dev/\">https://directed.dev/</a>\n<a href=\"https://linktr.ee/directeddevelopment\">https://linktr.ee/directeddevelopment</a></p>\n<p>Please feel free to reach out to me on LinkedIn,  Twitter, email, pigeon mail, snail mail… you name it!:)\n<a href=\"https://uk.linkedin.com/in/simon-s%C3%A4llstr%C3%B6m-3659b616b\">https://uk.linkedin.com/in/simon-sällström-3659b616b</a></p>\n", "parentCommentId": null, "user": {"username": "Simon Sällström"}}, {"_id": "m8rhJv4feLnPs24u6", "postedAt": "2022-11-26T09:11:35.213Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi Simon,<br><br>your playlist starts with video no. 3, 2, 1 and ends with 4. Is this the intended order?<br><br>The following documents are missing on your Google Drive:<br><br>Verification of educational institutions Kenya:<br><a href=\"https://directed.notion.site/Verification-of-educational-institutions-Kenya-d6f819c3d56e4656a5089404c1e95aea\">https://directed.notion.site/Verification-of-educational-institutions-Kenya-d6f819c3d56e4656a5089404c1e95aea</a><br><br>Risk Assessment Report - Kenya<br><a href=\"https://directed.notion.site/Risk-Assessment-Report-Kenya-aae33491da424b14a45e295b3b91df09\">https://directed.notion.site/Risk-Assessment-Report-Kenya-aae33491da424b14a45e295b3b91df09</a><br><br>I have moral and safety concerns regarding your project and especially the Cardano blockchain. In your risk assessment report, you did not acknowledge the risks of proof of stake blockchain and NFTs.<br><br>I like the progress update and github page where you list your goals and if you reached them.<br><br>In your funding proposal F6, you stated this timeline:<br>“Phase 3: August 2022 - October 2022 (12 months)</p><ul><li>Completion of both the donor side dApp and recipient mechanism for receiving funds.</li><li>First pilot testing in high schools and universities in Ethiopia. 30 students registered on the platform.&nbsp;</li><li>Finalized research proposal submitted for large grant application to properly fund the project.</li><li>Initiate meetings with larger organisations such as the World Bank, UNHCR or the Red Cross who might be interested in the technology for related uses.”</li></ul><p><a href=\"https://cardano.ideascale.com/c/idea/369558\">https://cardano.ideascale.com/c/idea/369558</a><br><br>Do you have a page where you have the track record based on the timelines you stated?<br><br>For someone reading the forum, here two articles on Cardano in the African educational system.<br><br>Why a Little-Known Blockchain-Based Identity Project in Ethiopia Should Concern Us All<br><a href=\"https://www.cigionline.org/articles/why-a-little-known-blockchain-based-identity-project-in-ethiopia-should-concern-us-all/\">https://www.cigionline.org/articles/why-a-little-known-blockchain-based-identity-project-in-ethiopia-should-concern-us-all/</a><br><br>Ethiopia’s blockchain deal is a watershed moment<br><a href=\"https://qz.com/africa/2011167/forget-bitcoin-why-ethiopias-blockchain-deal-is-pivotal\">https://qz.com/africa/2011167/forget-bitcoin-why-ethiopias-blockchain-deal-is-pivotal</a><br><br>Let's hope (?) this does not fail too badly.</p>", "parentCommentId": "vjdipqktxZBt9n8QE", "user": {"username": "Felix Wolf"}}, {"_id": "SzrywrB3ty8wuwN9y", "postedAt": "2022-11-27T05:41:17.319Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello Jay, good to see you here! (from EA for Christians). I haven't engaged the forum until now either but hope to start.&nbsp;</p>", "parentCommentId": "fjtGn5oqStGFiha4z", "user": {"username": "Alex Strasser"}}, {"_id": "WMEaKc4eAo7BYb3uz", "postedAt": "2022-11-27T10:47:06.217Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi Felix,</p><p>Thanks! I'm actually attending my first EA Manchester group next Monday. We'll be discussing the 80k episode in which Rob interviews Andrés Jiménez Zorrilla about the Shrimp welfare Project.&nbsp;</p><p>&nbsp;</p><p>Thanks for the welcome!</p><p>Ander</p>", "parentCommentId": "qTucsDR5HGMHFHudL", "user": {"username": "AnderMorgan"}}, {"_id": "dsqwWHNJi463uW4zo", "postedAt": "2022-11-28T10:44:33.259Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi All. I've known about effective altruism for quite a while and it's helped me a lot. Mostly found out about it after a breakup I had and improved how I viewed the world to be more objective and rational. I found this video and was wondering if anyone else had it. I think it raises some points but that it also has a lot of flaws which shouldn't be overlooked. I commented on my criticisms. Know they're are definitely more academic and sophisticated responses to this topic but think it's approachable and also gives insight into how people who are very much outside the community think.</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=wOtYNWd3tzg\"><div><iframe src=\"https://www.youtube.com/embed/wOtYNWd3tzg\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure>", "parentCommentId": null, "user": {"username": "Jacque"}}, {"_id": "vdttXLR5M22FvRDaN", "postedAt": "2022-12-03T02:39:58.790Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everyone.<br><br>I'm Evan Harper, a <a href=\"https://www.metaculus.com/questions/13765/introducing-community-manager-evan-harper/\">community manager at Metaculus.</a> It occurred to me that I spent way too much time writing <a href=\"https://www.metaculus.com/questions/13828/will-the-people-choose-top-gun-maverick/\">a question about Top Gun: Maverick today</a> that will probably just drop off the front page quickly, and I wanted to say hi to the EA Forums at some point anyway, so I'm taking the excuse to shamelessly promote. I can also more proudly promote <a href=\"https://www.metaculus.com/questions/13827/will-the-people-choose-raphael-warnock/\">our re-opened forecast on the Raphael Warnock / Herschel Walker Senate election in Georgia.</a> Both these are intended to help bring in new forecasters as part of the ongoing <a href=\"https://www.metaculus.com/tournament/beginner-tournament/\">Beginner Tournament</a>. And just in general, we've <a href=\"https://www.metaculus.com/questions/?order_by=-publish_time&amp;status=open&amp;main-feed\">opened something like 40 new public questions in the last 20 days</a> so there's no shortage of interesting topics in addition to the front page which many of you will already have seen. For example check out <a href=\"https://www.metaculus.com/questions/13796/1-of-aluminum-made-carbon-free-by-2030/\">this amazing one on zero-carbon aluminium smelting</a> that some mysterious stranger by \"@not_an_oracle\" just dropped on me almost exactly as-is, perfectly written. My hero.<br><br>And hey, once you've forecasted on something, then you'll be a Metaculus forecaster, and I <i>have</i> to listen to questions, concerns, ideas, and suggestions from Metaculus forecasters as part of my job. Say hi!</p>", "parentCommentId": null, "user": {"username": "Evan Harper"}}, {"_id": "BcY4vrdxTxoEFDdpC", "postedAt": "2022-12-03T09:15:12.804Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Does anyone here know why Center for Human-Compatible AI hasn't published any research this year even though they have been one of the most prolific AGI safety organizations in previous years?</p>\n<p><a href=\"https://humancompatible.ai/research\">https://humancompatible.ai/research</a></p>\n", "parentCommentId": null, "user": {"username": "LoveAndPeaceAlways"}}, {"_id": "izED7p2d7Ltswhthh", "postedAt": "2022-12-04T18:48:09.851Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>What are some negative and positive sentiments about OpenAI within the EA community?&nbsp;<br><br>I know OpenPhil made them a 30m grant in 2017, but Holden no longer seems to be on the board and a bunch of people left to create Anthropic. Whats up with that?&nbsp;</p>", "parentCommentId": null, "user": {"username": "aj_kourabi"}}, {"_id": "MmW7qNGyazMbHHPyj", "postedAt": "2022-12-08T02:36:09.060Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Really cool idea. I'll be watching eagerly</p>\n", "parentCommentId": "vjdipqktxZBt9n8QE", "user": {"username": "Henry Howard"}}, {"_id": "PSkGFamMGiqCxirHz", "postedAt": "2022-12-08T02:52:58.054Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>This is very inspiring. I think you're making an incredibly positive impact on the world, not just through charity but also by inspiring those around you. Brilliant!</p>\n", "parentCommentId": "fjtGn5oqStGFiha4z", "user": {"username": "Henry Howard"}}, {"_id": "Kf3FeyGJuE2TKkBMD", "postedAt": "2022-12-11T18:36:22.769Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>In my opinion it's ludicrous narrativizing. Sam had no incentive to do what he did he was just winging it and defrauding people and lying about everything. He's going to jail now.<br><br>There's no brilliant billionaire manipulation scheme he's just some asshole who was using a charity / philanthropic movement as cover.<br><br>He's Medoff giving to Jewish charities so that rich Jewish charity donors will trust him with their investments. Video woman is saying that refutes Jewish philanthropy somehow. Like the way to pursue the interests of Jewish philanthropy was to steal a bunch of Jews' money and put it into a ponzi scheme and then burn it down and blow everything up, because that's just what those sort of people would do.<br><br>It's a ludicrous left-wing narrative to slander rich people. Slander rich people all you want, but do it for better reasons.</p>", "parentCommentId": "dsqwWHNJi463uW4zo", "user": {"username": "Evan Harper"}}, {"_id": "h4kiqAfWZyh2AiwDW", "postedAt": "2022-12-14T23:04:16.723Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi,</p><p>My name is Andie Rodriguez, I'm a bilingual (English and Spanish) 23yo Puerto Rican, who recently graduated from college. I majored in Philosophy, Economics, and Psychology. Currently I'm looking for full time employment. Although I've used the EA job board, it was recommended that I type a post here to see if I can connect with anyone who might have job recommendations (or advice) for a recent grad like me.</p><p>I look forward to getting more involved in EA, and getting to learn more about everyone in this community!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Andie Rodriguez"}}, {"_id": "vEYHkGcwLd34QsZRQ", "postedAt": "2022-12-15T02:18:34.769Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi Andie,<br>welcome to the EA Forum. Maybe add a bio, so everyone can see what interests you have.<br><br>Is there a specific cause area which you find the most interesting?<br><br>Have a nice day. :)</p>", "parentCommentId": "h4kiqAfWZyh2AiwDW", "user": {"username": "Felix Wolf"}}, {"_id": "oHqxrCns4GFTbJp6p", "postedAt": "2022-12-15T14:21:17.798Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hello! &nbsp;My name is Manuel del Río. &nbsp;I am a 42-year old Spanish trilingual (Galician, English and Spanish) TEFL teacher and satellite school head of studies, and I have been &nbsp;working for the last twelve years in Official Language Schools of the Galician Autonomous Region (Northwestern corner of Spain ). Other work I have done was in the fields of translation and cultural journalism.</p><p>I studied at the University of Santiago de Compostela, where I took degrees in History and English Philology, and a Master's in Literary Theory, Comparative Literature and Cultural Studies.</p><p>I recently learned about Effective Altruism as an aftermath of the FTX bankruptcy affair (some marginal good can come out of the bad, I guess) and am interested in learning more about it and possibly getting engaged. I find its minimalistic program of helping others in a rationally optimized way quite appealing, and have informed myself about some of the wonderful work the people in this community are doing. I do have some intellectual qualms about strict utilitarianism as an ethical compass, and have a Confucian affinity for helping those near us and therefore, making distinctions, but I don't find them incompatible with a juxtaposed broader sweep. One can help the community AND the wider circle of humanity.</p><p>I look forward to getting to know more about EA and its community everyone in this community, and getting myself involved.</p><p>Have a nice day!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Manuel Del Río Rodríguez"}}, {"_id": "HQGBHdiMDD8jfGQbd", "postedAt": "2022-12-17T01:53:08.332Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I created an EA group for Mastodon: <a href=\"https://chirp.social/@EffectiveAltruism\">@EffectiveAltruism@chirp.social</a></p><p>The way groups work: If you follow the group and tag its handle in a Mastodon post, it will automatically boost the post so that all its followers see it.</p><p>If you have a Mastodon account, please follow the group and post some content to join the conversation!</p>", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "TeexQgAmRbfAdZ7TA", "postedAt": "2022-12-20T04:12:58.168Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hey everyone. Tristan here from Tasmania. I first heard about EA from a Peter Singer lecture at Melbourne in 2014 on his book TLYCS. Have since completed a Master of Public Health. I've &nbsp;been working as a bush walking guide for the last year but currently looking for EA related work. Applying for jobs on the 80,000 hours job board at organizations like GiveWell, GiveDirectly, and AMF.</p><p>Also looking to engage with people about EA and related topics in Tasmania, or online. Looking at potentially starting a university or other EA group in Tasmania.</p><p>Let me know if you have any advice re looking for EA work/ starting a EA group.</p>", "parentCommentId": null, "user": {"username": "Tristan D"}}, {"_id": "SxyFdLu6ZRNN32QmX", "postedAt": "2022-12-21T19:20:44.887Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Is there an EA subgroup focused on philosophical pragmatism? EA has a strong utilitarian image. There's a lot more nuance though one problem with utilitarianism is that if the ends justify the means, then sufficiently impactful ends can justify any means -- even very problematic issues like the recent SBF revelations.&nbsp;</p><p>Philosophical pragmatism offers a lot of insight for the EA movement. &nbsp;That would see ends and the cost benefit calcs that are beloved around here as one important though not all encompassing factor in decision-making.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Locke"}}, {"_id": "JXasuFFzsxA2HaQ2s", "postedAt": "2022-12-24T10:33:17.322Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>What's the GiveWell of AI Safety?</p>", "parentCommentId": null, "user": {"username": "Tenoke"}}, {"_id": "Jr6MAd98dAKpBkjDe", "postedAt": "2022-12-24T19:50:25.197Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi, I'm a management consultant who has focused on long-term strategic planning for about 20 years. In particular, I work with live teams to think 15-30 years in the future about what they want to realize. As they do so, they shift to being selfless, holistic and kind i.e. unlike the person they are in everyday office politics.</p><p>I share ideas about long-term strategic planning offsites/retreats in a newspaper column and a newsletter.</p><p>I 'm also a Cornell/AT&amp;T Bell Labs alum living in Kingston Jamaica.</p>", "parentCommentId": null, "user": {"username": "Francis Wade"}}, {"_id": "kHbs3FTKQkqZo6inG", "postedAt": "2022-12-25T02:59:28.971Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everyone! My name is Nolan and I'm a first year college student at the University of Chicago. I found out about EA through other students and just completed the intro fellowship. I'm particularly interested in animal welfare and AI safety. I'm excited to keep learning about EA and implement it into my life through my career choices and donations.</p>", "parentCommentId": null, "user": {"username": "nshaff3r"}}, {"_id": "i3twLdwgSbRp2HKkh", "postedAt": "2022-12-25T03:00:15.513Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Welcome to the forum!</p>", "parentCommentId": "kHbs3FTKQkqZo6inG", "user": {"username": "Linch"}}, {"_id": "x3Lk2EpQKuKx6b4wn", "postedAt": "2022-12-26T16:01:57.014Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hey Francis,<br>welcome to the EA Forum. :)</p>", "parentCommentId": "Jr6MAd98dAKpBkjDe", "user": {"username": "Felix Wolf"}}, {"_id": "4iy6vEXDoeih6hv2m", "postedAt": "2022-12-28T05:29:45.954Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>There isn‘t one exactly, but poking around the grants made by <a href=\"https://www.openphilanthropy.org/grants/?focus-area=potential-risks-advanced-ai\">Open Philanthropy</a> and <a href=\"https://funds.effectivealtruism.org/funds/far-future#payout-reports\">EA funds</a> will give you a good idea of what orgs and projects look promising to the experts who disburse those funds.</p>\n", "parentCommentId": "JXasuFFzsxA2HaQ2s", "user": {"username": "Tyler Johnston"}}, {"_id": "adRKQ6ZioDZJr6LsF", "postedAt": "2022-12-28T20:22:13.423Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>To complement Tyler's comment - the field of AI safety is not similar to that of global health and poverty in this regard. When looking at health interventions, you're considering solutions to widespread problems, and time scales of a few decades at most. In contrast, AI safety (from the EA perspective) mostly deals with future technologies, and has made little measurable progress in mitigating their dangers. There's no direct evidence you can use to judge AI safety orgs with high confidence. So you're going to, at maximum, get evaluations which are much less robust, and have much more disagreement about them.</p>\n", "parentCommentId": "JXasuFFzsxA2HaQ2s", "user": {"username": "Guy Raveh"}}, {"_id": "hNHebmBrD4EwhmYnJ", "postedAt": "2022-12-28T21:32:52.414Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hey everyone!</p><p>while thinking about extreme poverty I came across the thought that some people in extreme poverty might not know how to spend their money as effectively as possible to have the highest chance of survival or most healthy life.&nbsp;</p><p>Maybe EA could create guides directly for those people in order to help them on how to manage their income as effectively as possible.&nbsp;</p><p>This is just an idea that came to my mind and I have no certainty about this concept, I would love to hear other EAs opinions on it. Please tell me if I am completely wrong.</p><p>&nbsp;</p><p>greetings&nbsp;</p><p>Sebastian</p>", "parentCommentId": null, "user": {"username": "Sebastian Finken "}}, {"_id": "8LPQSKbougYB5BP66", "postedAt": "2022-12-29T14:04:49.815Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>I agree Sebastian! Your reasoning is the same as &nbsp;the popular proverb: Give a man a fish, you feed him for a day. Teach a man how to fish, and you feed him for a lifetime.</p>", "parentCommentId": "hNHebmBrD4EwhmYnJ", "user": {"username": "Tharu Olupathage"}}, {"_id": "FF9Hfj7iBM7hHwiWJ", "postedAt": "2023-01-02T22:31:37.122Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Hi everyone! It seems quite plausible to me that EA can not indefinitely prevent itself from becoming a politically charged topic, once it becomes more prominent in public awareness. &nbsp;What are the current ideas about how to handle this?</p>", "parentCommentId": null, "user": {"username": "Patric Rommel"}}, {"_id": "TsM3Dw3GNWWcvk8xc", "postedAt": "2023-01-03T22:16:02.576Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>Here's my latest thinking on making EA more effective:</p><p><a href=\"https://medium.com/@mnemko/maximally-effective-altruism-5910308265ff\">https://medium.com/@mnemko/maximally-effective-altruism-5910308265ff</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Marty Nemko"}}, {"_id": "mt6RQpiYsqnEpWsHp", "postedAt": "2023-01-09T20:52:18.281Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>This book contains studies of poor people, how they spend their money, and what could help them the most: <a href=\"https://www.goodreads.com/book/show/10245602-poor-economics?ac=1&amp;from_search=true&amp;qid=3qdox2Dpdo&amp;rank=1\">https://www.goodreads.com/book/show/10245602-poor-economics?ac=1&amp;from_search=true&amp;qid=3qdox2Dpdo&amp;rank=1</a></p><p>FYI</p>", "parentCommentId": "hNHebmBrD4EwhmYnJ", "user": {"username": "vlad.george.ardelean"}}, {"_id": "WLSeZ9cJZ3Pnd3AWr", "postedAt": "2023-01-10T16:21:38.444Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>It would be great to train a cadre of EAs in political matters, working in NGOs at different levels to accomplish EA goals. I'm kicking around the idea of what that would look like, i.e. an EA NGO that directly interacts with the United Nations, and how we would do training for said organization. That's something that conceptually is doable with current resources, although not every EA wants to wade hip deep into bureaucracy. &nbsp;I do, and it's my current job, but it is 100% definitely not for everyone.</p>", "parentCommentId": "FF9Hfj7iBM7hHwiWJ", "user": {"username": "Weaver"}}, {"_id": "GEHGRRHqhiXWmWSMG", "postedAt": "2023-02-02T03:20:02.806Z", "postId": "aFu9ejXKHxKQEpzGF", "htmlBody": "<p>&nbsp;Hey Felix!&nbsp;<br><br>Thanks for the many good comments:) As you know, there are so many things going on with a charity startup and difficult trade-offs to make. One of them being proper tracking against our roadmap and communicating what we're doing (as opposed to focusing on doing), especially at an early stage like this.</p><ol><li>The playlist order is now corrected!</li><li>(keeping in mind my caveat) I've had a look at some of the drive links and updated. We'll use PDF + Notion upload from now on so that we don't rely on individual team members (who likely ran out of drive space for his own documents but I'll have to ask Moses about it).</li><li>When it comes to risks of proof of stake and NFTs, I'd rather mention those in a more general risk assessment report (which has had low priority status). I'll look into adding that for the Q2 2023 OKRs!&nbsp;</li><li>The most recent proposal is the one for F8. Let me be very candid on this one though. Projecting 12+ months forward without virtually any experience on the ground in Ethiopia nor with dapp development was more like an exercise in wishful thinking than a proper and well-informed roadmap. The F8 one was more realistic. I'll be making a page where you can track progress against the Roadmap. Right now we have a Progress page with OKRs but the link to the roadmap isn't very well made. <a href=\"https://directed.notion.site/Progress-Updates-81f92ecebefb4f289e80e1703ff73d2a\">https://directed.notion.site/Progress-Updates-81f92ecebefb4f289e80e1703ff73d2a</a>&nbsp;</li><li>Just to give you my background on this. I met with the Project manager for the Ethiopia deal when I was in Addis two months ago. However, I lack the full technical background to explain all the details of DID/SSI/Atala Prism but I understand it on a high level, and more than the vast majority (if not all) of tech journalists who cover Cardano.&nbsp;<br><br>The Cigi-article is unfortunately written by someone who has actually no clue about what Self-Sovereign Identifiers (SSI) are and what the Ethiopia project really is about. Just to bring up the most egregious confusion that the authors illustrates: they mistakenly believe that SSI is a blockchain identity technology (and that the credentials platform IOHK has been contracted to build is &nbsp;going to have personal data on-chain). It is not. It is not a blockchain identity system (unlike so-called Soul-bound tokens). It is decentralised public key infrastructure. Blockchain only as a tiny part of it. For those interested in learning more about self-sovereign identifiers (AKA Decentralised Identifiers). Here is the official W3C standards recommendation for those who want to learn what it is, approved in July 2022 &nbsp;<a href=\"https://www.w3.org/2022/07/pressrelease-did-rec.html.en\">https://www.w3.org/2022/07/pressrelease-did-rec.html.en</a>&nbsp;<br><br>The QZ article on similarly showing very superficial understanding of the technology. The statement \"The project will build digital identity solutions on the Cardano blockchain. \" is not factually correct. I am happy to elaborate.&nbsp;<br><br>NB, Atala PRISM is not a completed product. It is in development and is not even yet registered as an official DID.&nbsp;</li><li>\"Let's hope (?) this does not fail too badly.\" I hope you don't mind me being honest but I think this comment was a bit unnecessary.&nbsp;</li></ol><p><br>We are doing the piloting of our bootcamps and the end-to-end on-chain scholarship granting in the next month and during Q1-Q2 this year!&nbsp;<br><br>Please do sign up to our monthly newsletter to get quick updates on that <a href=\"https://directed.notion.site/Newsletter-signup-34e6bced04534d3981ece8312caea717\">https://directed.notion.site/Newsletter-signup-34e6bced04534d3981ece8312caea717</a>&nbsp;</p>", "parentCommentId": "m8rhJv4feLnPs24u6", "user": {"username": "Simon Sällström"}}]