[{"_id": "RLdntemEyqFLcCeb9", "postedAt": "2023-08-29T09:24:54.348Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>This looks very exciting, thanks for posting!</p><p>I'll quickly mention a couple of things that stuck out to me that might make the CEA potentially overoptimistic:</p><ol><li><strong>IQ points lost per μg/dl of lead</strong> - this is likely a logarithmic relationship (as suggested by <a href=\"https://forum.effectivealtruism.org/posts/naTwu3xD3WFWu5fbp/global-lead-exposure-report#The_Relationship_between_Lead_Exposure_and_IQ\">Bernard and Schukraft</a>). For a BLL of 2.4 - 10 μg/dl, IQ loss from 1 μg/dl increase may be close to 0.5, but above 10, it's closer to 0.2 per 1 μg/dl increase, and above 20, closer to 0.1. Average BLL in Bangladesh seem to be <a href=\"https://www.unicef.org/bangladesh/en/press-releases/third-worlds-children-poisoned-lead-bangladesh-fourth-most-seriously-hit-terms#:~:text=According%20to%20the%20Institute%20of,eleventh%20highest%20in%20the%20world.\">around 6.8 μg/dl</a>, though amongst residents living near turmeric sources of lead, it could plausibly be (much) higher, and thus a lower IQ gain will be had from a 1 &nbsp;μg/dl reduction in lead.</li><li><strong>Income loss per IQ points loss</strong> - The CEA assumes that 1 IQ point loss leads to a 2.1% reduction in income. However, some work by GiveWell (<a href=\"https://docs.google.com/document/d/1qVCZrldHhDI3MNSVfBV66O5WjF-Xzi2dtBNasyq2BII/edit#heading=h.jb5m3s711csx\">here</a>) suggests this might be closer to 0.67% (and there might be some reasons to discount this further, e.g. due to replicability concerns)</li><li><strong>Replicability of intervention</strong> - as noted in the <a href=\"https://forum.effectivealtruism.org/posts/aFYduhr9pztFCWFpz/preliminary-analysis-of-intervention-to-reduce-lead-exposure#Where_could_our_analysis_go_wrong_\">text</a>, it's hard to estimate how much the Bangladesh program reduced lead exposure by. If Bangladesh's average BLL level is <a href=\"https://www.unicef.org/bangladesh/en/press-releases/third-worlds-children-poisoned-lead-bangladesh-fourth-most-seriously-hit-terms#:~:text=According%20to%20the%20Institute%20of,eleventh%20highest%20in%20the%20world.\">around 6.8 μg/dl</a>, then a 1.64 reduction from the intervention implies this intervention cut BLL by 25% for half of children in Bangladesh. This is great, but I can see several reasons why this may not be informative of future programs' cost-effectiveness<ol><li>Maybe Turmeric is much more prevalent in rural Bangladesh than other regions</li><li>Maybe it was unusually easy to get regulators to agree to introduce / enforce standards</li><li>Maybe it was unusually easy to get producers to switch away from lead chromate</li></ol></li></ol><p>Each of these reasons on their own is fairly weak, but the likelihood of at least one being true gives us reason to discount future cost-effectiveness analyses. More generally, we might expect some regression to the mean w.r.t reducing exposure from tulmeric - maybe everything went right for this particular program, but this is unlikely to be true in future programs. To be clear, there are likely also reasons that this analysis is too pessimistic, and thus on net it may be the case that cost-effectiveness remains at $1/ DALY (or even better). Nonetheless, I think it's good to be cautious, since $1 / DALY implies this program was &gt;800x better than cash transfers and &gt;80x better than GiveWell's top charities - a strong claim to make (though still possible!)</p>", "parentCommentId": null, "user": {"username": "22tom"}}, {"_id": "Y78nQ2DFckh9ZjNjA", "postedAt": "2023-08-29T16:05:03.502Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>Thanks so much for your response! &nbsp;This is excellent feedback and we’re grateful for the interest. &nbsp;</p><p>1. &nbsp;IQ loss: We did go to the experts to estimate based on actual numbers, so we’re reasonably confident about this. &nbsp;And even if it were out by 50 percent, the results are still strong. &nbsp;</p><p>2. &nbsp;Income loss by IQ has been a moving target in the literature. &nbsp;It could be at that lower end -- we used a mid-point of studies. &nbsp;Again, even if we are out by half, the results are positive. &nbsp;</p><p>3. &nbsp;Replicability is certainly an issue. &nbsp;We do know that turmeric is used throughout the country anecdotally, and that other sources of lead are important in Bangladesh (aluminum pots, contaminated sites, perhaps fish). Additionally, we know that no other interventions have been undertaken - expect for a small site clean up that will not impact nationally. &nbsp;We’re happy to report that the government is very engaged and committed, and have asked WB for their support for these other sources. These conditions might be less available in other countries, including Central Asia, India (northern states), Balkans (some) Middle East (some), and North Africa. &nbsp;Not all countries have the issue, but many do. &nbsp;So, yes, viability of replication of this solution will be mixed. On the plus side, a similar intervention in Georgia had the same rapid result, and without a large expense. With that, we hope to continue to repeat the success.</p><p>All, please do send more thoughts and comments! &nbsp;We’re new to this kind of assessment, and need your feedback!</p><p>Best,</p><p>Pure Earth Team&nbsp;</p>", "parentCommentId": "RLdntemEyqFLcCeb9", "user": {"username": "Kate Porterfield"}}, {"_id": "F6FhosQoDid2YMsqc", "postedAt": "2023-08-30T02:03:22.875Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p><strong>Executive summary</strong>: An intervention to reduce lead exposure from adulterated turmeric in Bangladesh had an estimated cost per DALY-equivalent averted of just under US$1.</p><p><strong>Key points</strong>:</p><ol><li>Turmeric was found to be the primary source of lead exposure in rural Bangladesh due to intentional adulteration with lead chromate.</li><li>An intervention coordinated with the Bangladeshi government successfully reduced lead in turmeric to 0% from 47% previously.</li><li>A preliminary cost-effectiveness analysis estimates approximately 1 million DALY-equivalents will be averted at a cost of $560,000.</li><li>The estimated cost per DALY-equivalent averted is under $1, which is highly cost-effective compared to other global health interventions.</li><li>There are uncertainties around attributable lead reductions and timeframe, but the analysis provides an encouraging outlook on reducing lead exposures globally.</li><li>Further interventions on contaminated spices and other sources of lead exposure in low- and middle-income countries are likely to have similarly favorable cost-benefit ratios.</li></ol><p><i>This comment was auto-generated by the EA Forum Team.</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>Contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "B36wTtF3kKszKZqEp", "postedAt": "2023-08-30T14:50:03.353Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>I might be able to help with work in this field. In addition for it to be easier for me to travel to Bangladesh (family and No Visa Required status), some relevant networks including the government and some familiarity with the customs (and even rudimentary language) I also think I have some proof points that entrepreneurship is what I can offer to EA. Please reach out if thinking about doing something here.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "dsEbmPiLjzqg24Ktm", "postedAt": "2023-08-30T22:17:53.208Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>I would not at all be surprised if lead elimination interventions (and lead in spices in particular) are better than GiveWell top charities. But the #1 concern I have is with tractability. Developing countries have lots of regulations on the books that are unenforced because of state capacity constraints. The most likely failure mode for a lead elimination intervention is that it fails to make governments actually enforce laws.</p>\n<p>This looks like an exceptionally effective advocacy campaign where government regulators were convinced to spend a lot of time and money to enforce laws. I think the best thing Pure Earth could do is open up the black box of how exactly that happened.</p>\n<ul>\n<li>How did the Bangladesh government react when you approached them?</li>\n<li>How was the crackdown implemented? How much personnel did it require?</li>\n<li>How organized was this practice? Organized vendors adulterating spices could fight against regulators more effectively than disorganized vendors.</li>\n<li>What implementation support did you provide?</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "y5Ej8xTvdPnLiQdDZ", "postedAt": "2023-09-26T10:26:44.577Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>I really appreciate cost-effectiveness analyses like this and am curating this post (despite the fact that it was shared a while back). (See also <a href=\"https://forum.effectivealtruism.org/posts/aFYduhr9pztFCWFpz/preliminary-analysis-of-intervention-to-reduce-lead-exposure?commentId=RLdntemEyqFLcCeb9\">this comment</a> &amp; discussion.)</p><p>I'm also wildly impressed by the project itself (I highlighted the project in the <a href=\"https://us8.campaign-archive.com/?e=%5BUNIQID%5D&amp;u=52b028e7f799cca137ef74763&amp;id=52ed790983\">recent EA Newsletter</a>). See <a href=\"https://undark.org/2023/07/19/the-vice-of-spice-confronting-lead-tainted-turmeric/\">the story of the research project and other work behind this</a> (let me know if you know of a better link!). Pure Earth's work here seems incredible, and I'd be really interested in learning more about it.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "guLCCpgHm9qZgznyJ", "postedAt": "2023-09-26T13:17:39.959Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>Thanks for the analysis! I'm enthusiastic about the lead reduction work Pure Earth and LEEP have been doing.<br><br>Some points for consideration:<br><br>(1) It may be that GBD underestimates the health burden - specifically, the loss in cognitive ability - insofar as the GBD examines the increased risk of intellectual disability and the consequence burden; but there is also a case to be made that loss of cognitive ability by the overall population <i>that nonetheless does not put one below the threshold of intellectual disability</i> would still be a significant loss that a fuller analysis would want to take into consideration.<br><br>(2) I would agree that 8 years is conservative. Generally, to discount for counterfactual introduction, I'm a fan of a applying an annual discount when calculating the aggregate multi-year benefits, rather than coming up with an estimate of \"years brought forward\" - partly because it's easier to calculate (by using data on past introductions of a policy etc, and comparing that against the total number of country-years in which introduction could have potentially happened), but also partly because I worry that the \"bringing forward\" model may overestimate the benefit if your other temporal discounts are significant enough. Given the lack of past policies on adulterated tumeric elimination, I would probably use the rate of introduction of anti-lead paint regulations as a baseline (and adjusting downwards given dissimilarities). In any case, I doubt the discount will be &gt;=1%, since even soda taxes (a far more widespread policy) is barely being introduced at that rate.<br><br>(3) A quick analysis (regressing DALY burden per capita of lead exposure in Bangladesh over time) suggests (surprisingly, to me) potential growth over time; this may be worth looking more into, and taking into consideration on top of the population growth effect.<br><br>(4) I think my biggest concern is just the intervention effect size given (a) reliance on pre-post data with significant potential for endogeneity and confounding. (b) I also suspect the intervention is disproportionately effective here given lead exposure in Bangladesh is extraordinarily high (9th higher per capita).<br><br>(5) Final thing that jumped out at me is the issue of how lead poisoning isn't reversible (at least from quickly scanning the old GBD Comparative Quantification of Health Risks report, so I don't think modelling the intervention as having an impact after 30 years makes sense - rather, the benefit trickles in on a year-by-year basis, as new cohorts are (counterfactually) not poisoned, and have better health/income outcomes. I can't say for sure without having done a deeper analysis, but I suspect this would improve your results, because frontloading benefits tend to increase the overall cost-effectiveness when discounts are high (and you have that 4% discount from GiveWell).<br><br>Hope that's helpful, and do let me know if you want additional inputs!</p>", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "8WHf6CtgDvXCmdjq4", "postedAt": "2023-09-26T13:27:20.890Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>Great curation. I would have missed this otherwise.</p>\n", "parentCommentId": "y5Ej8xTvdPnLiQdDZ", "user": {"username": "Joel Tan"}}, {"_id": "WuageiK6rbNwHinrT", "postedAt": "2023-11-10T15:19:46.116Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>That's brilliant - is the work being extended to other countries?</p>", "parentCommentId": null, "user": {"username": "RayTaylor"}}, {"_id": "aozZpC6NGdb2GH3tf", "postedAt": "2023-11-10T15:19:55.776Z", "postId": "aFYduhr9pztFCWFpz", "htmlBody": "<p>That's brilliant - is the work being extended to other countries?</p>", "parentCommentId": null, "user": {"username": "RayTaylor"}}]