[{"_id": "qjykRBHFcxEi6Yttm", "postedAt": "2022-12-07T17:24:52.255Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Happy to see that there's a new org getting started in this area. If you can say, who are your initial funders?</p><p>One thing I'd like to see you grapple a bit more with is the politicization of official aid. This may seriously constrain an org's ability to influence (1) top-down aid priorities and (2) in-country programme outcomes. This is based on my experience on the ground rather than a rigorous review, so may be wrong or biased in important ways. But it is my impression that official aid programmes are usually designed and implemented with much closer cooperation with and direction from the host government. I think this means that official aid orgs face more impact-political palatibility trade-offs than do NGOs, for example (though NGOs are constrained in other ways).</p><p>Another trend I think you should be aware of is the apparent pillaging of aid budgets to fund climate finance commitments. Rich countries have promised to finance projects in lower-income countries to mitigate and adapt to climate change, and pledged that they'll do so by providing additional funding on top of their aid budgets. In reality, though, they're falling well short of those taregets AND many are raising much of the climate finance money by reallocating their aid budgets!</p><p>I'd love to see more scrutiny on this decision--for example, some of the folks at CGD are <a href=\"https://www.cgdev.org/blog/whose-climate-finance-new-and-additional\">doing God's work</a> by working through tedious aid budget details. It's not at all clear that climate finance projects save more lives than traditional aid projects that are more optimized for health outcomes, so I think this trend is probably very bad compared to a counterfactual of just funding the regular aid budget (and almost certainly very bad against a counterfactual of aid funding + additional climate finance).</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "XZL3YcFHfXHoCjJRk", "postedAt": "2022-12-07T19:16:59.821Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Hey Mathias, I've work in development here in Northern Uganda for 10 years, and I think this is a fantastic idea for an org. I love your examples and I have no doubt that this issue is tractable, although I've failed in my own feeble local efforts here in Northern Uganda ;). Here's a couple of comments off the top of my head :). I could go on and on but &nbsp;it's too much &nbsp;for a comment .</p><ul><li>My experience has been that most government aid projects are terrible, either doing harm or very little good at all. &nbsp;The worst are government-to-government aid, where unfortunately most of the aid money goes as spelled out well in Dambisa Moyo's \"Dead Aid\" book. Here in Uganda there are some great high impact exceptions such as USAID's Pepfar, providing free malaria commodities, and some results based healthcare projects (although these can go both ways) but they are exceptions not the rule. &nbsp;<br><br>We currently have GIZ (<i><strong>German development &nbsp;agency with an unfortunate name</strong></i>) spending millions here in Northern Uganda doing lot's of close to zero impact projects while causing potential harm while they are at it. Their projects are so painfully bad it sometimes makes me feel physically sick, and I've failed completely in my few efforts to talk to GIZ members about what they do. I don't think local lobbying is necessarily very useful because no-one working on the ground wants to even consider the possibility that what they are doing here in Uganda might be useless or harmful, and they don't make many decisions about what they do. This kind of advocacy &nbsp;then needs to happen at a higher level. I <i><strong>understand EA is fairly active in Berlin, and this is the kind of thing that could well be lobbied on successfully.&nbsp;</strong></i><br>&nbsp;</li><li>&nbsp;My experience here in Northern Uganda is that most climate mitigation funding &nbsp;is ineffectual, &nbsp;with a surprising amount of it &nbsp;just funnelled into corrupt official's pockets and a lot of the rest spent on meaningless trainings and meetings. Like Stephen said much of it would be far better spent just on development initiatives - that will be better climate mitigation than the current useless projects. Redirecting he 100 billion of &nbsp;climate funding could be a GREAT area for advocacy, perhaps the most important at the moment. I might write a post on this even...<br>&nbsp;</li><li>I think a key factor to consider will be which governments might be willing to be nudged in the right direction. My instinct is that USAID might be a waste of time to lobby with their rigid policies more concerned with politics and accountability than impact (although they would claim otherwise), while you might be able to get more traction in European countries.&nbsp;</li></ul><p>Can't believe your Hans Neiman joke as well. About the most niche joke I've ever seen lol what percent of people here will get it haha love it!<br><br>Keen to discuss this more!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "8DkJSynPYzeFABQji", "postedAt": "2022-12-07T21:59:18.718Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Thank you for your thoughtful comment Stephen!<br><br>We are incubated through Charity Entrepreneurship, and have gotten our seed funding through their network.</p><p>When deciding on our pilot project, we did briefly look into the cost-effectiveness of climate mitigation projects funded by development aid and it was difficult to conclude much with high confidence. While it won't be our initial focus, we would be very excited to see increased measurement and the creation of better metrics for aid projects related to climate change and mitigation.</p><p>Traditional aid has benefited tremendously from the increased focus on measurement and evaluation in recent decades. I think it's especially important we don't forget the lessons learned as we start to carry out aid projects in new domains.</p>", "parentCommentId": "qjykRBHFcxEi6Yttm", "user": {"username": "MathiasKirkBonde"}}, {"_id": "awvQzYTLpfxSD9Q6Q", "postedAt": "2022-12-07T23:00:43.890Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>At least in the UK context, I think the \"pillaging\" of aid budgets to fund climate commitments isn't my top concern.</p><p>UK aid monies are <a href=\"https://committees.parliament.uk/committee/98/international-development-committee/news/174414/use-of-the-aid-budget-to-support-refugees-in-the-uk-new-inquiry-launched/\">currently used</a> by the Home Office on rehousing refugees. It looks like we're going to spend more UK aid in the UK than overseas.</p><p>Apart from the obvious concern that each pound can do more good in the world's poorest countries, it's actually <a href=\"https://www.devex.com/news/autumn-budget-uk-to-spend-an-extra-2-5b-to-help-refugee-costs-104478#:~:text=However%2C%20Home%20Office%20ODA%20spending,2021%20(provisional%20figure).%E2%80%9D\">engendering</a> exactly the kind of waste that aid critics detest. The Home Office has no incentive to use the money cost effectively, because it comes from the FCDO's budget, not theirs.</p>", "parentCommentId": "qjykRBHFcxEi6Yttm", "user": {"username": "Sanjay"}}, {"_id": "G3hDurz7jQerLsZLz", "postedAt": "2022-12-07T23:11:15.768Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Thanks Sanjay. I agree in the UK context. I think this is a great example of how every country is very different. Yes England have absolutely routed their overseas aid and might be another good example of a country not to focus on with this kind of advocacy. Which is sad because until recently UKAID had some pretty good programs.</p>", "parentCommentId": "awvQzYTLpfxSD9Q6Q", "user": {"username": "NickLaing"}}, {"_id": "mZuvBYThmyMtTyzfS", "postedAt": "2022-12-08T00:37:35.010Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Great!</p>\n<p>I think that the allocation of government aid doesn't get enough attention from effective altruists. Government aid budgets are an enormous pool of money and often don't seem to be spent in an evidence-based way. Huge potential for positive change here.</p>\n", "parentCommentId": null, "user": {"username": "Henry Howard"}}, {"_id": "LaQhG2rqw3ZJ4CfaC", "postedAt": "2022-12-08T01:13:41.198Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p><strong>Post summary</strong> (feel free to suggest edits!):<br>Wealthy countries spend a collective $178B on development aid per year - 25% of all giving worldwide. Some aid projects have been cost-effective on a level with Givewell’s top recommendations (eg.&nbsp;<a href=\"https://en.wikipedia.org/wiki/President%27s_Emergency_Plan_for_AIDS_Relief\"><u>PEPFAR</u></a>), while others have caused outright harm.</p><p>Aid is usually distributed via a several step process:</p><ol><li>Decide to spend money on aid. Many countries signed a 1970 UN resolution to spend 0.7% of GNI on official development assistance.</li><li>Government decides a general strategy / principles.</li><li>Government passes a budget, assigning $s to different aid subcategories.</li><li>The country’s aid agency decides on projects. Sometimes this is donating to intermediaries like the UN or WHO, sometimes it’s direct.</li><li>Projects are implemented.</li></ol><p>This area is large scale, tractability is unsure but there are many pathways and some past successes (eg. a grassroots EA campaign in Switzerland increased funding, and the US aid agency ran a cash-benchmarking experiment with GiveDirectly), and few organisations focus on this area compared to the scale.</p><p>The author and their co-founder have been funded to start an organization in this area. Get in touch if you’re interested in Global Development and Policy.</p><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "8uKraSBfBuMMvCuc5", "postedAt": "2022-12-08T10:45:40.472Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>I've been curious about foreign aid for a while, but never delved into researching it. I would be curious to follow more posts or a newsletter on it . Some questions off the top of my head:</p>\n<ul>\n<li>\n<p>how effective (i.e. $ per DALY/QALY) is x country's aid budget in y year, how does this compare to givewells best interventions?</p>\n</li>\n<li>\n<p>what does the talent pipeline look like for foreign aid, who works in these departments/orgs?</p>\n</li>\n<li>\n<p>what underline assumptions or biases influence foreign aid?</p>\n</li>\n<li>\n<p>case studies of projects done well. Case studies of projects done poorly.</p>\n</li>\n</ul>\n<p>Also, curious if you have any book recommendations?</p>\n", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "JBKsADffqwyeJfEnW", "postedAt": "2022-12-08T14:05:19.408Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<blockquote>\n<p>We currently have GIZ (German development  agency with an unfortunate name) spending millions here in Northern Uganda doing lot's of close to zero impact projects while causing potential harm while they are at it. Their projects are so painfully bad it sometimes makes me feel physically sick, and I've failed completely in my few efforts to talk to GIZ members about what they do.</p>\n</blockquote>\n<p>I'd be very curious to hear more about this, in particular specific projects and how they have failed or caused harm. Or is it basically all of the projects <a href=\"https://www.giz.de/en/worldwide/310.html\">in this list</a>?</p>\n", "parentCommentId": "XZL3YcFHfXHoCjJRk", "user": {"username": "Erich_Grunewald"}}, {"_id": "JubphYeoJ4yCir4Hb", "postedAt": "2022-12-08T17:29:59.845Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>For a start, read that list and see if you can find even a handful of initiatives that seem likely to have a reasonable impact. Most of these projects are not clear, potentially high impact interventions but usually a bunch of trainings, meetings, &nbsp;meaningless \"capacity building\" of government staff.<br><br>This one here really made me angry <a href=\"https://www.giz.de/en/worldwide/42196.html\">https://www.giz.de/en/worldwide/42196.html</a></p><p>\"It advises policy-makers in East African countries on the opportunities offered by carbon markets and carbon pricing instruments. In addition, the project provides expert and technical advice to government agencies on updating NDCs and long-term climate strategies.... &nbsp; In addition to this, workshops and networking meetings provide information on Article&nbsp;6 and market-based approaches in the region.\"<br><br>Uganda is run by a dictator who's Army &nbsp;and police continue to oversee the pillaging of their few remaining forests for charcoal, and here &nbsp;GIZ is pouring more money into those same thieve's pockets (as reported below).<br>&nbsp;</p><p>https://www.independent.co.ug/black-gold-report-pins-security-for-protecting-charcoal-cartels/&nbsp;<br><br>https://www.monitor.co.ug/uganda/news/national/security-forces-aiding-charcoal-trade-report-3367774</p><p><br>Obviously I only have encountered GIZ first hand here in Northern Uganda. Just to throw one concrete example in here , there's one particularly bad ongoing project here on rubbish collection (much more mundane than charcoal cartels!). I'd hardly call rubbish collection the biggest problem we have here in the first place. GIZ's mad approach was to try to get poor people here in the city to pay a fee and bring their rubbish to collection points - basically trying to conjure up huge behaviour change overnight which of course was never going to work. We even had one of their staff come to our door and announce the new program - which of course never happened. &nbsp;Who here is going to pay to bring rubbish to a collection point when they don't even see it as a problem?<br><br>And as part of the project they might have spent half a million dollars on a handful of German imported rubbish collection trucks for local government, only for them to get seized by a debt collector apparently because of some phony debt probably trumped up from inside the local government itself.<br><br>They also do a bunch of water accessibility stuff here in Gulu town which is highly dubious from an inequality perspective, as it favours only rich people in town who already are doing OK, and neglects the 80% of poorer Ugandans who live outside of town.<br><br>You'd think these kind of cliche aid mistakes would be a thing of the past, but unfortunately not.</p><p>Often GIZ &nbsp;projects don't &nbsp;even make it make sense on paper, forget even about the disasters while &nbsp;implementing them. Read this garbage, especially the \"Approach\" section. What really even is their approach it's certainly not clear t me? &nbsp;<a href=\"https://www.giz.de/en/worldwide/59817.html\">https://www.giz.de/en/worldwide/59817.html</a><br><br>It's really sad, imagine the good they could do if they instead just gave all that money they are spending driving around in fancy cars and feeding rich corrupt government officials to poor people.</p>", "parentCommentId": "JBKsADffqwyeJfEnW", "user": {"username": "NickLaing"}}, {"_id": "kgsgBw9ztFgAbuHck", "postedAt": "2022-12-08T18:02:35.597Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Zoe, this summary looks pretty good to us! The only change I would suggest is changing \"grassroots EA campaign in Switzerland redirected funding\" to \"grassroots EA campaign in Switzerland increased funding\", as the result of the campaign was an increase to the overall development cooperation budget in Zurich.</p><p>Thanks!</p>", "parentCommentId": "LaQhG2rqw3ZJ4CfaC", "user": {"username": "jacob.wood27@gmail.com"}}, {"_id": "xE7KkLAnyuscqcvct", "postedAt": "2022-12-08T18:10:04.720Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Thanks, that sounds quite bad.</p>\n", "parentCommentId": "JubphYeoJ4yCir4Hb", "user": {"username": "Erich_Grunewald"}}, {"_id": "2gWBXu7pJxoDf9vQt", "postedAt": "2022-12-08T20:37:13.233Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Edited, thanks :)</p>\n", "parentCommentId": "kgsgBw9ztFgAbuHck", "user": {"username": "GreyArea"}}, {"_id": "QwwcMdm4tvt7KKwCe", "postedAt": "2022-12-09T04:37:50.516Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Hey Elliot nice one!</p><p>Government aid projects almost never consider impact the way effective altruists do in terms of DALYs, and so comparing interventions is very very difficult.<br><br>One of the biggest problems is that most aid is \"Government to government\" aid, and so either gets eaten by corruption or is pumped into extremely inefficient government programs. An example of better aid might be money given to the Global vaccine alliance (GAVI) to fund vaccination programs.</p><p>A book I really like (although a bit old) is \"Dead Aid\" by Dambisa Moyo a Zambian born economist who worked for the world bank. She argues that government to government aid does more harm than good, which I agree with. I don't agree with everything in the book but it gives a good overview of aid and the problems with it.&nbsp;</p>", "parentCommentId": "8uKraSBfBuMMvCuc5", "user": {"username": "NickLaing"}}, {"_id": "goSnkfaFpZWZTm8ip", "postedAt": "2022-12-09T10:08:59.706Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Absolutely agree that development aid is very important and that a lot of the money is not spent on very good projects. Glad to see that the thread also notes that some of this is inevitable because major donors have many different competing priorities.</p><p>I look forward to hearing more about how this organization will be different from others which are already thinking about aid effectiveness. I think there's definitely a huge problem here and space for a new approach.&nbsp;</p><p>I think this thread might be overestimating the tractability of this problem... Aid effectiveness definitely isn't a new topic - there have been lots of lobbying efforts, Paris agreements, Accra agenda. etc. Organizations like Centre for Global Development have been looking at these issues for a long time and obviously there are lots of researchers and academics in this space.&nbsp;</p><p>In my experience development agencies are slow to update their practices (but quicker to organize interminably long workshops about updating practices). E.g. we've known for some time that cash transfers are an effective way of doing humanitarian aid in many/most contexts - and we still see that they are not the common way of doing things.</p>", "parentCommentId": null, "user": null}, {"_id": "mtLsRof99N4fNmNSh", "postedAt": "2022-12-09T10:19:15.770Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Agree that govt aid projects don't consider impact in the same way.</p><p>Dambisa Moyo (who worked for the World Bank for 2 years - before going to Goldman Sachs) is one view on how aid effectiveness... but I think it's fair to say the consensus is that govt ownership is generally seen as a GOOD thing in aid effectiveness literature.&nbsp;</p><p><a href=\"https://www.cgdev.org/blog/how-much-foreign-aid-reaches-foreign-governments\">https://www.cgdev.org/blog/how-much-foreign-aid-reaches-foreign-governments</a></p>", "parentCommentId": "QwwcMdm4tvt7KKwCe", "user": null}, {"_id": "4gLL28THNrswsZJdD", "postedAt": "2022-12-09T13:33:19.610Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Great points Finn. Interested to know your background as well ;)!</p><p>In my opinion smaller country development offices might be a lot easier to shift than the bigger ones. You could well be right that the OP and enthusiastic people like myself are overestimating &nbsp;the tractability.<br><br>I agree there are a lot of academics and researchers in this space, but that work doesn't usually lead to action. I would argue that the Paris agreement and Accra agenda were more about how countries should work together to deliver aid, and less about what aid money should actually be spent n.</p><p><i><strong>Could you give an example of an organisation which has a primary role of lobbying for better evidence based use of aid?&nbsp;</strong></i><br><br>If I look at CGD's impact report for this year, the had no numerical assessment of their progres, and their stated achievements are<br>- Increasing the number of women peacekeepers<br>- <i><strong>Increasing ID cards for development</strong></i><br><strong>- </strong>Maximising the benefits of migration<br>- Changing the conversation on China's development debt<br><i><strong>- Advance market commitments for pharmeceuticals</strong></i><br><br>Among those I would only consider the advance market comitments for pharmecuticals and perhaps ID cards are likely to be high impact intervention sfor the world's poorest. I found it interesting that the Center for Effective Altruism is one of their funders.<br><br>As a reply to your comments above</p><p>\"Dambisa Moyo (who worked for the World Bank for 2 years - before going to Goldman Sachs) is one view on how aid effectiveness... but I think it's fair to say the consensus is that govt ownership is generally seen as a GOOD thing in aid effectiveness literature. \"<br><br>Dambisa Moyo isn't against all aid (a common misconception), just against direct government to government aid. She seems to not mind NGOs so much. Yes you are correct that government ownership is generally seen as a good thing in aid effectiveness literature. I disagree with this consensus, at least I disagree that aid money should pass through government hands. Of course this would be the best approach in theory, and is a self serving opinion if you want to keep your job as a diplomat or aid practitioner. Unfortunately in practise it fails over and over again. The best &nbsp;Aid projects I have seen, work in conjunction with government systems <i><strong>while not actually giving government money or full control.</strong></i> These kind of projects include PEPFAR, Mosquito net distribution, cash transfers to refugees, building schools (underrated intervention).<br><br>\"In my experience development agencies are slow to update their practices (but quicker to organize interminably long workshops about updating practices). E.g. we've known for some time that cash transfers are an effective way of doing humanitarian aid in many/most contexts - and we still see that they are not the common way of doing things.\"</p><p>100% agree with that, well put.<br><br>Keep in mind I'm very biased living and working here in Uganda while trying to keep a broader perspective.</p>", "parentCommentId": "goSnkfaFpZWZTm8ip", "user": {"username": "NickLaing"}}, {"_id": "xrXrQDbvLjDafjfch", "postedAt": "2022-12-09T16:30:52.189Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Hi Nick,</p><p>I want to clarify I'm positive about the idea too - I think there's definitely space for this. But I think there will be more impact if it compliments existing efforts in this area and thinks hard about what is really neglected.&nbsp;</p><p>I've worked in development for about 10 years, some experience with evaluation of grass-roots projects but mainly working implementing projects funded by governments/donors. I try to stay anonymous on here, but I've lived and worked in Central, East Africa and South Asia for about 7 years. Never worked in Uganda.&nbsp;</p><p>CGD has a few work streams on aid effectiveness, I went to a presentation on their Quoda index a while back: <a href=\"https://www.cgdev.org/quoda-2021\">https://www.cgdev.org/quoda-2021</a> I would recommend anything Owen Barder has written on this topic.</p><p>I think the examples in CGD's report are where they have recommended things, and then actually seen them happen. This is really quite unusual in terms of research/policy impact.&nbsp;</p><p>They've definitely done lots more work that hasn't necessarily led to neat case studies of change. For instance, they host the IDSI who look at making cost-effective decisions in health for LMICs: https://www.idsihealth.org/our-strategy/ &nbsp; I think it's true that CGD doesn't try to compare education and health or climate and governance... but they definitely have thought hard about cost-effectiveness within health for instance.</p><p>We may be talking past each other but in my experience - diplomats and aid practitioners often dislike govt to govt direct aid (budget support) because it cuts them out... it gives govts the chance to choose their own priorities rather than having them dictated by donors/external experts.</p><p>I think you could be right that smaller country funders might be easier to influence. Generally in my experience the Scandinavian donors do better projects &amp; are able to focus more on poverty rather than being pushed around by political priorities/flashy ineffective projects.</p><p>Thanks for your comment.</p>", "parentCommentId": "4gLL28THNrswsZJdD", "user": null}, {"_id": "8JASgjrYpoBG4nLvt", "postedAt": "2022-12-10T12:05:19.443Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Thanks so much Finn again, a lot of wisdom there and good links to look at. ISDI in particular looks like a great initiative and I didn't know about it!<br><br>You might be right that we are talking past each other n the government to government aid thing given that I think it's a complete disaster and should stop, while you understandably seem to agree with the development norm that government ownership is part of aid best practise. This is definitely off topic a bit, but &nbsp;I wanted to clarify that &nbsp;I am not against govt. to govt. aid for any petty reason that it cuts anyone out, but for a lot of other reasons.</p><ol><li>Evidence of failure. (The classic Dambisa Moyo) Govt. to govt. aid has miserably failed for 50 years in Africa. Most development successes have been in either in partnership with govt. or despite governments. Why go against the evidence because it seems right?</li><li>Corruption&nbsp;</li><li>There is a strong norm that we should give governments the power to prioritise what they want. But the reality is that most low income governments don't care much about the poorest of the poor (evidenced by both rhetoric and lack of action), so they won't prioritise them with the money you give them. So why give them money to prioritise other things the aid was not intended for in the first place?</li><li>For undemocratic countries specifically, when you give aid to those governments you prop up the stranglehold of dictatorships. This can cause more harm than the good you can potentially do.<br>&nbsp;</li></ol><p>I know these are all fairly classic arguments, but I still believe that they stand. Don't feel &nbsp;you have to reply by the way, just wanted to get it out there ;)</p>", "parentCommentId": "xrXrQDbvLjDafjfch", "user": {"username": "NickLaing"}}, {"_id": "ZFQAsvrctdmvmrc5w", "postedAt": "2022-12-10T22:22:43.080Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<blockquote><p>I think this thread might be overestimating the tractability of this problem... Aid effectiveness definitely isn't a new topic ...</p></blockquote><p>As far as I can tell (as the author of the Charity Entrepreneurship report) driving short term changes to aid budgets and spending patterns is tractable, but driving long-term improvements are much less tractable. It is an inherently non-sticky area of policy where successive governments tend to rewrite the rulebook.</p><p>If this hypothesis is correct it explains the trend you identify here. It also suggest that work in this space is limited as improvements to aid quality may only last a few years. Charity Entrepreneurship still considered it high value despite this limitation.</p><p>See: https://3394c0c6-1f1a-4f86-a2db-df07ca1e24b2.filesusr.com/ugd/26c75f_9fabb713c4c245f4beab12d0b0ca491d.pdf</p>", "parentCommentId": "goSnkfaFpZWZTm8ip", "user": {"username": "weeatquince"}}, {"_id": "Eg7x7TxrPpLzwRvQM", "postedAt": "2022-12-12T14:00:07.465Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Thanks for sharing. Looks a very interesting report. I think very plausible that this is a non-sticky area of policy... or perhaps that there are strong forces which tend to make donors revert to a less-effective equilibrium.&nbsp;</p>", "parentCommentId": "ZFQAsvrctdmvmrc5w", "user": null}, {"_id": "2ixb7xhFEQZ6wpQeY", "postedAt": "2022-12-29T00:58:39.854Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>From an OG aid-industry insider:</p>\n<p>People have been trying to <em>fix</em> development aid since the 80s, and failing miserably. The reality is that very little development aid is effective. Govt-to-govt aid is largely mismanaged and wasted. Targeted aid projects are often ill-conceived. Much of aid, especially US aid, is tied to the donor country's political aims. Most people who work for large aid organizations such as the UN/UNICEF/Save the Children/etc. are jaded and mainly care about advancing their own career and their own kids' schooling.</p>\n<p>Most people I've met in development have a big ego, think they are so smart, write complex, bureaucratic analyses and reports, and pretend that their work is effective.</p>\n<p>What the underdeveloped world needs (and wants) is business and investment, not <em>aid</em>. Forget about aid and start a business in Africa, or working with Africans instead.</p>\n<p>The idea of starting an EA-inspired  lobbying group or think tank makes me want to throw up. It is only adding to the bloated, fake do-gooder, ultimately self-interested bureaucratic swamp.</p>\n", "parentCommentId": null, "user": {"username": "L. L."}}, {"_id": "iZ49bfR52f3WXrnu7", "postedAt": "2023-01-07T22:42:40.409Z", "postId": "agKFRa5qBApnfLrSh", "htmlBody": "<p>Congratulations! Looking forward to seeing where this goes.</p>\n", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}]