[{"_id": "zDujrQteRjztDFwij", "postedAt": "2023-02-22T11:40:55.352Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel sad/judged/ frustrated reading this, though that's not to say it's wrong.</p>\n<p>Some thoughts</p>\n<ul>\n<li>I flirt much less within EA than I once did, largely for these reasons</li>\n<li>Yeah, on priors this seems like a normal wise thing to do</li>\n<li>I guess there are some possible mid way norms like \"women should initiate\"</li>\n<li>I sense that that women's views on this are more complex than this suggests, after all many women choose to sleep with people like this. To deny them this option is probably a cost</li>\n<li>It feels like we might be able to do better than this</li>\n<li>I sense, like many things that the people who most need to hear this might ignore it and those that need to hear it least will enact it</li>\n<li>I note that this prescription will affect neurodivergent people more (social clumsiness is much more common among such people). I'm okay with this, but are you?</li>\n<li>Feels like we should, as everywhere else, try to quantify the harms and make a decision based on that</li>\n<li>Businesses often try to improve only one thing, not everything at once. While I think EA can build better relationships paradigms it feels important that we are trying to make the world better not design a way to have more sex in communities.</li>\n</ul>\n<p><em>adding things if I think of them</em></p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "uSuSWAwqnHcecKjTw", "postedAt": "2023-02-22T11:52:54.143Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p><em>Poll - Agreevote to agree</em></p>\n<p>Do you agree with this recommendation?</p>\n<p>\"For anyone who has at least 2 of the above traits (such as a heterosexual man who is high status in EA or is socially clumsy), I would strongly recommend considering refraining from sleeping around in the movement.\"</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "Y8Dk7AsvQrt44wMCv", "postedAt": "2023-02-22T11:57:28.732Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I would prefer to split this into seperate comments.</p>\n", "parentCommentId": "zDujrQteRjztDFwij", "user": {"username": "nathan"}}, {"_id": "r9ee9nHzxKf4kBBEg", "postedAt": "2023-02-22T12:09:06.381Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think the recommendation is good even without restricting to people with those categories, but is a bit more applicable to people with them.</p>\n", "parentCommentId": "uSuSWAwqnHcecKjTw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "2xp2XF5YN7phfKfdM", "postedAt": "2023-02-22T12:12:49.201Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I guess I do too, but A) can we do better and B) that's a shame, cos sleeping around is fun</p>\n", "parentCommentId": "r9ee9nHzxKf4kBBEg", "user": {"username": "nathan"}}, {"_id": "E5tk4Rb6mkxparqou", "postedAt": "2023-02-22T12:16:35.960Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I would even (tentatively) support the recommendation for 'at least 1 of the above traits'. And slightly less tentatively for 'at least 1 of (1) or (2)'. (In the absence of (1) and (2), on its own, (3) doesn't seem so risky.)</p>", "parentCommentId": "uSuSWAwqnHcecKjTw", "user": {"username": "HaydenW"}}, {"_id": "fKEXa2j6jTvHxTmjh", "postedAt": "2023-02-22T12:20:30.577Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think this post is missing how many really positive relationships started with something casual, and how much the 'plausible deniability' of a casual start can remove pressure. If you turn flirting with someone from an \"I'm open to seeing where this goes\" into \"I think you might the the <em>one</em>\" that's a high bar. Which means despite the definition of 'sleeping around' you're using looking like it wouldn't reduce the number of EA marriages and primary relationships I expect it would. Since a lot of EAs in those relationships (hi!) are very happy with them (hi!), this is a cost worth explicitly weighing.</p>\n<p>(Writing this despite mostly agreeing with the post and having upvoted it. And also as someone who's done very little dating and thought I was going to marry everyone I dated.)</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "Np2Ep47zvabBkPcnp", "postedAt": "2023-02-22T12:24:45.772Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>What do you think of my suggestion that it should instead be \"don't initiate or escalate\"? Feels like that removes most of the harm while leaving most of the benefit.</p>\n", "parentCommentId": "fKEXa2j6jTvHxTmjh", "user": {"username": "nathan"}}, {"_id": "zwHSjM7GwZvw4Bp9L", "postedAt": "2023-02-22T12:25:06.388Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>How much of the fun of sleeping around is retained when limited to doing it with non-EAs?</p>\n", "parentCommentId": "2xp2XF5YN7phfKfdM", "user": {"username": "Jeff_Kaufman"}}, {"_id": "itiugu5PDHtgFyzFe", "postedAt": "2023-02-22T12:33:17.065Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Even without precisely quantifying the harms each way, I think we can be pretty confident that the harms on one side are greater than on the other. It seems pretty clear that the harms of letting a non-trivial number of people experience sexual harassment and assault (or even the portion of those harms prevented by implementing a strong norm about this) are greater than the harms of preventing (even 100x as many) people from sleeping around within the community. The latter is just a far, far smaller harm per person--far less than 1/100 as great. And I think the same verdict holds even if the latter harm is concentrated mainly on neurodivergent people. And it holds even more clearly if we add on (to the first type of harm) the further harms of making the community less welcoming or uncomfortable for many more people than just those who directly experience harassment or assault.</p><p>(But, if there are at-least-as-effective ways to prevent the former harms, without imposing the latter harms, then this isn't very relevant.)</p>", "parentCommentId": "zDujrQteRjztDFwij", "user": {"username": "HaydenW"}}, {"_id": "zi85zTSLTeF3SYbQa", "postedAt": "2023-02-22T12:37:34.172Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>That only holds if these people aren't going to sexually harass anyway. Buy if they are just having sex outside EA instead then the harms have just been shifted and the question is more about people wanting to be a part of the movement.</p>\n<p>What would your suggestion to minimise harms but maximise benefits be. And it seems worth considering even quite onerous things because I imagine the people in Austin might be willing to sacrifice a lot.</p>\n<p>What about a way that people can opt in to bring hit on.</p>\n", "parentCommentId": "7TitJQwFWzutksEdB", "user": {"username": "nathan"}}, {"_id": "XrYFMrykbgysYon7J", "postedAt": "2023-02-22T12:42:09.027Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Feels like that depends on the person. I imagine for some it might reduce by like 20x filor others almost none.</p>\n<p><em>I know this is quite a cold way to talk about something so intimate but it feels relevant. I feel scared doing it though</em></p>\n", "parentCommentId": "zwHSjM7GwZvw4Bp9L", "user": {"username": "nathan"}}, {"_id": "dQA5ij9BCHEvDmqw7", "postedAt": "2023-02-22T12:43:59.637Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Many things that would be problems between EAs would not be with other people you might hook up with. Especially, the ability to recommend people for EA jobs or funding is irrelevant to almost everyone in the world but very important to many EAs.</p>\n", "parentCommentId": "zi85zTSLTeF3SYbQa", "user": {"username": "Jeff_Kaufman"}}, {"_id": "GE8qBcsMeBWqsqqwA", "postedAt": "2023-02-22T12:53:58.428Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I've felt quite saddened and distressed by this post. I deeply agree that it is right and beneficial to be more careful, restrained and generally err on the side of caution in romancing/dating, when there are work or power imbalance considerations.</p><p>But at the same time (in section \"What I mean by sleeping around\"), this post presents views that are in line with contemporary mainstream norms of sex-negativity and soft poliphobia . To quote the post itself:</p><blockquote><p>We obviously don’t want to simply unquestionably accept all of society’s norms [footnote: Historic stigmatisation of LGBT people and relationships is one example of why not]</p></blockquote><p>And I think presenting romancing/sex as something negative or potentially negative, unless it happens in a monogamous and serious relationship (or in setting intentioned for leading to one) is unfortunately similar way of stigmatisation.</p>", "parentCommentId": null, "user": {"username": "Łukasz Grabowski"}}, {"_id": "3zeBSvvHkb6NNFvg5", "postedAt": "2023-02-22T12:56:35.240Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Sure but that's not the numbers Hayden used for his calculation.</p>\n", "parentCommentId": "dQA5ij9BCHEvDmqw7", "user": {"username": "nathan"}}, {"_id": "nkjtFi7ya4QEaKKnq", "postedAt": "2023-02-22T13:00:55.084Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Did you mean your <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=zi85zTSLTeF3SYbQa\">\"that only holds\" comment</a> to be a response to <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=itiugu5PDHtgFyzFe\">Hayden's comment above</a>?</p>\n", "parentCommentId": "3zeBSvvHkb6NNFvg5", "user": {"username": "Jeff_Kaufman"}}, {"_id": "vHk5NvKBHvanXfkpk", "postedAt": "2023-02-22T13:04:43.372Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yes. :)</p>\n", "parentCommentId": "nkjtFi7ya4QEaKKnq", "user": {"username": "nathan"}}, {"_id": "igPtmiFEMdKFarN4p", "postedAt": "2023-02-22T13:05:34.849Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I guess, can you suggest a better way of guidelines. I'm certain that some exist.</p>\n", "parentCommentId": "GE8qBcsMeBWqsqqwA", "user": {"username": "nathan"}}, {"_id": "zQkMaGiny3X9vrSGA", "postedAt": "2023-02-22T13:44:15.727Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel by those numbers EAs shouldn't be dating each other at all?<br>&nbsp;</p>", "parentCommentId": "itiugu5PDHtgFyzFe", "user": {"username": "agunning"}}, {"_id": "dKTibbe7mwoGW3T9S", "postedAt": "2023-02-22T13:48:01.352Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>My personal reaction: I know you are scared and emotional, I am too. This post however, crossed my boundary.&nbsp;</p><p>I'm a woman, I'm in my late 20s and I'm going to do what you call sleeping around in the community if it's consensual from both sides. Obviously, I'm going to do my absolute best to be mature in my behaviors and choices in every way. I also believe that as the community we should do better job in protecting people from unwanted sexual behavior and abuse. But I will not be a part of community which treats conscious and consensual behavior of adult people as their business, because it hell smells like purity culture for me.&nbsp;And it won't do the job in protecting anybody.<br><br>I'm super stressed by this statement.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Liv"}}, {"_id": "vDSAHWPSWjrPENAE3", "postedAt": "2023-02-22T14:09:03.832Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel like there's an implicit prediction of something like [communities with intelligent people which have lots of causal sex are going to be worse at dealing with sexual assualt/harrassment] and I kind of want to note my reaction being 'given my personal experience i dont really believe this and all else equal I would feel safer in such communities'</p><p>like, if i had to point to an exact mechanism:<br>- you only really have so many dumb mistakes to make and I would prefer it if, unlike Owen, people could get these out of their system while young and not yet in leadership positions.</p><p>-there's a benefit of like, better gossip networks and more accumulated wisdom that could be passed on to the next generation, so they can make fewer dumb mistakes.</p><p>but mostly I'm going off empirical experience</p><p>I'll agree that there are tough problems around seniority (maybe err on the side of, the less senior person should initiate) and gender balance (this seems hard to me, although I think poly-within-the-community helps on the margin?)<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "agunning"}}, {"_id": "BdD3XqspxmEMxJdAj", "postedAt": "2023-02-22T14:30:09.911Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Some EA parties (including some EA Global afterparties) involve cuddle puddles or hot tubs. The post made me wonder if that is also problematic. I've never heard anyone say that but some people might feel pressure to comply in order to fit in and possibly make important connections. It also probably increases the probability of various problems like touching without consent. Such things might also repulse some new commers from EA, especially after all the scandals. Perhaps people should consider whether such things are appropriate for a given gathering a bit more?</p>", "parentCommentId": null, "user": {"username": "saulius"}}, {"_id": "KN7mizshBdAK3vCKi", "postedAt": "2023-02-22T14:30:21.643Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>yeah I had a \"excuse me but I will continue to be an asshole libertine\" reaction to this</p>", "parentCommentId": "dKTibbe7mwoGW3T9S", "user": {"username": "agunning"}}, {"_id": "PLGLqbazbeYSjD5Qv", "postedAt": "2023-02-22T14:30:34.921Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks for the honesty of expressing something vulnerable.</p>\n", "parentCommentId": "dKTibbe7mwoGW3T9S", "user": {"username": "nathan"}}, {"_id": "bdJsSXAu9WNHwCJhP", "postedAt": "2023-02-22T14:32:12.922Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote>\n<p>The latter is just a far, far smaller harm per person--far less than 1/100 as great.</p>\n</blockquote>\n<p>Surely it makes more sense to compare the upside-- someone forming a long lasting and loving relationship.</p>\n<p>Maybe that's extreme, but taking a balance of outcomes I doubt it would be 1/100.</p>\n<p>Also strange that you chose to say 1/100 and also 100x as many people-- surely if you have high confidence in those numbers then that would balance out by definition? Or is the somewhere where you think this sort of scale insensitivity is valid?</p>\n", "parentCommentId": "itiugu5PDHtgFyzFe", "user": {"username": "Fergus Fettes"}}, {"_id": "6k8kKuGR9Lh76uaoG", "postedAt": "2023-02-22T14:33:03.327Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I also think there should be particular care when it comes to newcomers to the movement. I think there should be a strong norm against regular members hitting on/asking out new members before they have enough time to settle into the community.&nbsp;</p><p>I'm betting there have been many people who showed up once or twice to an EA event, got hit on a bunch of times, and immediately left the movement in annoyance.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "GofHGkkEqLGTkDz5N", "postedAt": "2023-02-22T14:35:35.984Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>In this situation, under this post, and given your voting pool, it is not half as vulnerable as it could be if I was a &nbsp;man, especially a \"socially not skilled\" one (often = non - neurotypical) . So I could pretty easily write it, as in this particular position I felt in a position of power.&nbsp;</p>", "parentCommentId": "PLGLqbazbeYSjD5Qv", "user": {"username": "Liv"}}, {"_id": "2mXbtytsrsq3ampLr", "postedAt": "2023-02-22T14:45:20.856Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>uh, not quite a guy but I credit the more sexually relaxed parts of the community for solving ~most of my \"socially inept around this\" problems in a way I think is not easily replaceable, so I'm personally also pretty defensive about this</p>", "parentCommentId": "GofHGkkEqLGTkDz5N", "user": {"username": "agunning"}}, {"_id": "8YcNR55YWud4PmT7d", "postedAt": "2023-02-22T14:51:16.141Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>So honestly I meant the boundaries triggering thing.</p>\n<p>But yes, you can make that argument much more cheaply than me.</p>\n<p><em>It's a shame we use such clear language in this forum. I think \"than my cowardly ass\" would have been much funnier.</em></p>\n", "parentCommentId": "GofHGkkEqLGTkDz5N", "user": {"username": "nathan"}}, {"_id": "b5HjnMKeyNiD2p6vF", "postedAt": "2023-02-22T15:01:46.377Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>tbh I think the dichotomy of \"EA/rat culture should stick to the tried and true\" and \"EA should decide to create a sexually libertine culture for first principles\" is dumb, <i>people have tried more things than you think</i></p>", "parentCommentId": "vDSAHWPSWjrPENAE3", "user": {"username": "agunning"}}, {"_id": "qCf6fwBjLp4g9wiqh", "postedAt": "2023-02-22T15:28:03.222Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>(1) and (3) are also not yes/no variables. OP's model treats them as such, possibly for ease of conveying the idea. A more complex model would assign points from a range for those variables, and probably adjust the scope of \"sleeping around\" depending on the total point score.</p>\n<p>That might fix edge cases in which one might think the recommendation is too strict for a single yes.</p>\n", "parentCommentId": "E5tk4Rb6mkxparqou", "user": {"username": "Jason"}}, {"_id": "MbnaWAEhFb2xj2qAb", "postedAt": "2023-02-22T15:35:05.937Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote>\n<p>I will not be a part of community which treats conscious and consensual behavior of adult people as their business</p>\n</blockquote>\n<p>I may be reading you overly literally, but I think you're saying that we should not as a community,  strongly discourage, say, grantmakers from sleeping with grantees.  As long as its consensual and they're thoughtful about the power dynamics it's just their decision, right?  But this ignores issues like:</p>\n<ul>\n<li>\n<p>Other grantees would then feel pressured to sleep with grantmakers, leading to bad interactions (even ones where all the signals that the grantmaker receives are that the grantee wants this).</p>\n</li>\n<li>\n<p>The funders behind the grantmaker may reasonably worry that the grantmaker's judgement is clouded by their otherwise positive views towards this grantee or that there was quid pro quo.</p>\n</li>\n<li>\n<p>People may choose to become grantmakers with poor intentions because a norm of \"it's ok to sleep with grantees\" is very vulnerable to abuse.</p>\n</li>\n</ul>\n<p>If you think we should draw lines excluding this, however, and I hope you do, then we should be thinking about what lines we want as a community, not insisting that we refuse to be bound by any lines.</p>\n", "parentCommentId": "dKTibbe7mwoGW3T9S", "user": {"username": "Jeff_Kaufman"}}, {"_id": "fGCpQELHFEjt5cCJm", "postedAt": "2023-02-22T15:40:36.602Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>And possibly with those numbers humans shouldn't be dating in general, ignoring EA?</p>\n", "parentCommentId": "zQkMaGiny3X9vrSGA", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ib5YmvcgqvCPzFkZF", "postedAt": "2023-02-22T15:47:08.601Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>yeah</p><p>I mean, empirically women do choose to go on dates, so I'm going to trust the revealed preferences here...</p>", "parentCommentId": "fGCpQELHFEjt5cCJm", "user": {"username": "agunning"}}, {"_id": "WWjyZxjoAD26HenFP", "postedAt": "2023-02-22T15:52:20.862Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I'm not saying that age/power/money/any other differences should be ignored when it comes to consent. I believe we should, as a general rule in the community, discourage grantmakers sleeping with grantees. This post, however, doesn't stop there, at least to my understanding. And this is what I disagree with.</p>", "parentCommentId": "MbnaWAEhFb2xj2qAb", "user": {"username": "Liv"}}, {"_id": "KehHeoBgxgkJxz3i7", "postedAt": "2023-02-22T15:55:19.689Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I'd feel a lot more comfortable about this post if it were \"EAs having ~casual relationships with other EAs is a good thing generally but here's how we can limit the worse spillover effects\" than like, \"please be less horny\"</p>", "parentCommentId": "MbnaWAEhFb2xj2qAb", "user": {"username": "agunning"}}, {"_id": "Pgvukhm93AGHdANBY", "postedAt": "2023-02-22T16:08:43.353Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Note that aggressively seeking a serious monogamous relationship within EA is also problematic. For example, it might be a bad idea to ask out every other EA woman you had a nice 30 minute conversation with (e.g., see&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse?commentId=gFi5roZeJBp9xu2PY\"><u>this comment</u></a>).</p>", "parentCommentId": null, "user": {"username": "saulius"}}, {"_id": "gWcwwGwXxFnNxxgTF", "postedAt": "2023-02-22T16:16:48.667Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p><em>stares in negative utilitarian</em></p>\n", "parentCommentId": "fGCpQELHFEjt5cCJm", "user": {"username": "nathan"}}, {"_id": "6cc2qJHPwJLvkdgzf", "postedAt": "2023-02-22T16:21:52.239Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>If you think we should discourage grantmakers from sleeping with grantees but no further, what about managers and reports, highly senior and junior staff at an org who don't share a management chain, senior researchers and junior researchers in the same field, or community builders and people just joining the community? -- Possibly you were trying to say this with your first sentence; not sure?</p>\n<p>What I'm trying to get at here is that determining what sorts of interactions the community should discourage is complex, and asserting strong generic dating rights makes it harder to muddle out.</p>\n", "parentCommentId": "WWjyZxjoAD26HenFP", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ZqH685Giu8TkTPDcR", "postedAt": "2023-02-22T16:34:12.433Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yes, I was saying it in my first sentence. Everything which goes beyond that is crossing personal boundaries (at least of mine). This post in my opinion doesn't talk about the examples you've mentioned above. It talks about two people who have no professional connection, but happen to be EA, at least to my understanding.&nbsp;<br>Is my position clear to you now? If not, please let me know, I'll try to explain it better.&nbsp;</p>", "parentCommentId": "6cc2qJHPwJLvkdgzf", "user": {"username": "Liv"}}, {"_id": "jpSXpzMWNLkhJrp65", "postedAt": "2023-02-22T16:40:05.377Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thank you for posting this <strong>Patrick Sue Domin. </strong>I agree wholeheartedly that at the very least, sleeping around in the community under the circumstances stated should be seen as something that is outside of a norm and therefore necessary to do only with great caution. I’m a woman who has in the past enjoyed sleeping around and would have potentially been saddened to have slightly fewer options in the EA community (my own initiation notwithstanding). However, I think it’s important to note that I think that this loss is worth it to alleviate some of the discomfort that women can feel in this community, which applies even more to younger and more vulnerable women than me.&nbsp;</p><p>I also want to note the importance of age, which wasn’t discussed explicitly in the post. If you have more than a 6 year age gap (depending on your age group of course) or are in different stages of life (undergrads and college graduates come to mind) then you are in a position of power over that person. When I was in my early 20s and younger, I had several interactions with people where I didn’t realize that they were hitting on me because they seemed like kind, reasonable people and the power differential was very obvious to me. It was scary and saddening to realize that people who I saw as friends and mentors saw me as a sexual prospect.&nbsp;</p><p>As someone who has been interested in EA for a long time but only recently started attending in-person events, I can also concur that that being hit on constantly as a newcomer to the community is extremely frustrating and demoralizing. Imagine if many of the new connections that you were excited to make in a new group decided not to interact with you further when they found out that you had a partner, and several made you feel uncomfortable with their advances. It should be the status quo to be welcoming to newcomers but not expect them to be sexually available. While I haven’t left the community following my experiences, I can absolutely imagine other women doing so because they’re unwilling to put up with this kind of behavior - and these losses have the potential to significantly impact the entry of new perspectives, ideas, and people into EA.&nbsp;</p>", "parentCommentId": null, "user": {"username": "breadthofdebate"}}, {"_id": "Loh8JbzEeMARZbhod", "postedAt": "2023-02-22T16:51:59.322Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks!  I understand your view a lot better than I did initially!</p>\n", "parentCommentId": "ZqH685Giu8TkTPDcR", "user": {"username": "Jeff_Kaufman"}}, {"_id": "vmEy9C45WRHQyrwqq", "postedAt": "2023-02-22T16:53:25.407Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel happy you wrote this.</p><p>I worry that this is not very incentive compatible however. It would presumably create strong incentives for men to identify as only EA-adjacent, not work for EA orgs, not publicly donate to effective charities, so as to exempt themselves from the rule.</p><p>It also seems like it could worsen selection pressures. If more well behaved males abide by such a rule, this would make things easier for less moral guys by reducing competition.&nbsp;</p><p><a href=\"https://slate.com/culture/1996/07/more-sex-is-safer-sex.html\">https://slate.com/culture/1996/07/more-sex-is-safer-sex.html</a></p><p>Traditionally this incentive issue has been partially solved by stigmatizing those who violate the norm, but that doesn't work as well if the violators are not part of the community. The other part of the traditional solution is the stigmatization of women who accept such approaches, because each one who does so imposes negative externalities on other women by encouraging cadish behavior.</p><blockquote><p>Most functional institutions outside of EA, from companies to friend groups to extended families<a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1#fnpq86svg4fyg\"><sup>[1]</sup></a>, have developed norms against sleeping around within the group.&nbsp;</p></blockquote><p>Yes, although historically groups like villages, churches and ethnic groups have been keen to encourage members to date and marry each other.&nbsp;</p>", "parentCommentId": null, "user": {"username": "temp_"}}, {"_id": "SEFjmvLZzyKYsEkyW", "postedAt": "2023-02-22T16:55:13.564Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I strongly disagree with this. I've dated ~ 10 people in my life. I have also been sexually assaulted (not by someone in the community). I would quickly and without hesitation take a trade to experience 1 rape like the one I experienced (non-violent) in return to keep any of my happy relationships I've had in my life (about half of which I think wouldn't have formed absent what the author is calling \"sleeping around\"). For my best relationship (which initially formed via \"sleeping around\" and I don't think could easily have done so otherwise, and is now the love of my life), I would trade dozens of rape, easily, for the joy and love my partner brings me.&nbsp;</p><p>For sexual harassment, the ratio is even more skewed (obviously). Maybe I'm unusual, but this doesn't feel personally like a hard trade at all on the current margin.&nbsp;</p>", "parentCommentId": "itiugu5PDHtgFyzFe", "user": {"username": "Dicentra"}}, {"_id": "GcSCwC876uvyzedym", "postedAt": "2023-02-22T17:14:31.010Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>related: https://forum.effectivealtruism.org/posts/usBf4xAc2a9JYtzrr/a-modest-proposal-fixing-the-polyamory-problem</p>", "parentCommentId": null, "user": {"username": "Sol3:2"}}, {"_id": "LTYPz3SLPyHFHotii", "postedAt": "2023-02-22T17:32:45.227Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I am opposed to any norm that asks different behavior of men than women.</p>\n", "parentCommentId": null, "user": {"username": "River"}}, {"_id": "y8RJq2wHpc2tBGspL", "postedAt": "2023-02-22T17:40:55.129Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Would it leave most of the benefit? If men (the gender who, at this point in time, initiates the most) stop initiating, I imagine a number of good relationships will not be born at all.</p>\n", "parentCommentId": "Np2Ep47zvabBkPcnp", "user": {"username": "lb_rv"}}, {"_id": "khD3qmcRrirnriCd5", "postedAt": "2023-02-22T17:43:59.016Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>It's certainly true that \"Failed attempts at sleeping with someone can often lead to awkwardness or uncomfortability.\" &nbsp;However, this is also true of successful attempts. &nbsp;\"No attempts\" isn't a reasonable solution.</p><p>If there is a taboo the EA community would benefit from breaking it's the notion that something being awkward/uncomfortable is evidence, in and of itself, that something that has transpired is bad, or someone did something wrong. &nbsp;Well intentioned people acting in good faith can often lead to awkward situations even when nobody did anything explicitly wrong.</p><p>There's obviously a continuum of behaviors from very benign to potentially very serious, it's very difficult to escape nuance in these cases. &nbsp;Life isn't always so simple.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jgray"}}, {"_id": "TRP39jujJEzBPfCaJ", "postedAt": "2023-02-22T18:31:25.455Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Strongly agree with your general point – but I feel like you're not the demographic this post is aimed at (i.e. not a socially-awkward man).</p>", "parentCommentId": "dKTibbe7mwoGW3T9S", "user": {"username": "Pynchon"}}, {"_id": "pbF9B2wRzpDyHrcfg", "postedAt": "2023-02-22T18:37:40.021Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I would be cautious of spending too many weirdness points on those things (to your point about newcomers finding them a bit weird), but I don't think anyone is feeling <i>coerced</i> to join a cuddle puddle/get in a hottub at those sorts of parties.</p><p>Most of the EAG afterparties I've been to have mostly just been pretty standard drinking in someone's house or a bar.</p>", "parentCommentId": "BdD3XqspxmEMxJdAj", "user": {"username": "Pynchon"}}, {"_id": "Q2b8hwsXvxrdQWY7T", "postedAt": "2023-02-22T18:48:36.761Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I guess of the three conjunctions here \"socially awkward men\" is the one I'm least concerned about -- or at the very least I suspect a lot of people reading this underestimate the level of social competency they can get away with, and I suspect it's already a pretty self-punishing state of affairs<br><br>(I guess there's also the thing where probably a lot of socially awkward men would make people more comfortable if they were more direct about romantic/sexual interest, and I kind of worry we'll accidentally end up discouraging that)</p>", "parentCommentId": "TRP39jujJEzBPfCaJ", "user": {"username": "agunning"}}, {"_id": "M3avP27gGRSmuKEJt", "postedAt": "2023-02-22T19:34:31.904Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>HaydenW, thank you.</p>\n<p>Firstly, for trying to be a good feminist - I honestly think you should get points for trying.</p>\n<p>Secondly, for making it plain how ridiculous these arguments are. I've seen a lot of reasoning on this forum recently that goes:</p>\n<p>more sex = more harassment &amp; assault\ntherefore\npolyamory and \"sleeping around\" and friends with benefits and any other form of sexual relationship I think I can get away with policing in 2023 = bad\n(...but obviously sex before marriage and serial monogamy and any other form of serious, \"proper\" sexual relationship especially marriage - you know, the ones that actually <em>count</em> because they don't just make people <em>happy</em> they're just  <em>good</em> you know? = good)</p>\n<p>Convenient how the numbers keep working out only in favour of socially sanctioned forms of relationship.</p>\n<p>\"Sex is between one person and one other person when both people are working towards marriage and not having sex with other people in between\" <em>is</em> a lot better than \"Sex can only happen within marriage which is between one man and one woman for life,\" but there's still some way to go.</p>\n<p>What is EA coming to when I feel even more slut-shamed here than I do with my family lol.</p>\n<p>The irony is that it seems to mostly be coming from the political left.</p>\n", "parentCommentId": "itiugu5PDHtgFyzFe", "user": null}, {"_id": "GbAbYog4NccH69aMx", "postedAt": "2023-02-22T19:41:36.150Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I suspect the 'edge cases' illustrate a large part of the general problem: there are a lot of grey areas here, where finding the right course requires a context-specific application of good judgement. E.g. what 'counts' as being (too?) high status, or seeking to start a 'not serious' (enough?) relationship etc. etc. is often unclear in non-extreme cases - even to the individuals directly involved themselves. I think I agree with most of the factors noted by the OP as being pro tanto cautions, but aliasing them into a bright line classifier for what is or isn't contraindicated looks generally unsatisfactory.</p><p>This residual ambiguity makes life harder, as if you can't provide a substitute for good judgement, guidance and recommendations (rather than rulings) may not give great prospects for those with poorer or compromised judgement to bootstrap their way to better decisions. The various fudge factors give ample opportunity for motivated reasoning (\"I know generally this would be inappropriate, but I license myself to do it in this particular circumstance\"), and sexual attraction is not an archetypal precipitant for wisdom and restraint. Third parties weighing in on perceived impropriety may be less self-serving, but potentially more error-prone, and definitely a lot more acrimonious - I doubt many welcome public or public-ish inquiries or criticism upon the intimate details of their personal lives (\"Oh yeah? Maybe before you have a go at me you should explain {what you did/what one of your close friends did/rumours about what someone at your org did/etc.}, which was far worse and your silence then makes you a hypocrite for calling me out now.\"/ \"I don't recall us signing up to 'the EA community', but we definitely didn't sign up for collective running commentary and ceaseless gossip about our sex lives. Kindly consider us 'EA-adjacant' or whatever, and mind your own business\"/etc.)&nbsp;</p><p>FWIW I have - for quite a while, and in a few different respects - noted that intermingling personal and professional lives is often fraught, and encouraged caution and circumspection for things which narrow the distance between them still further. EA-land can be a chimera of a journal club, a salutatorian model UN, a church youth group, and a swingers party - these aspects are not the most harmonious in concert. There is ample evidence - even more ample recently - that 'encouraging caution' or similar doesn't cut it. I don't think the OP has the right answer, but I do not have great ideas myself: it is much easier to criticise than do better.</p>", "parentCommentId": "qCf6fwBjLp4g9wiqh", "user": {"username": "Gregory_Lewis"}}, {"_id": "rShAfAiL8m4HCcfWp", "postedAt": "2023-02-22T19:44:00.630Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel the upvotes here are very unfair.</p>\n<p>Currently in the poll comment I did, the balance of people think we should adopt the Original Poster's suggestion. Mine would still allow for a lot of sexual activity to take place. It is clearly less limiting. It's still a massive norm and I don't love it, but it's better than a ban. It feels unfair (and plain mistaken) that many people disagreed with my comment and then agree with your criticism even though my proposal is less onerous than OP's.</p>\n<p>If you all hate my idea surely you must hate OP's more, so go disagreevote with it in the poll comment below.</p>\n<p>If somehow you like OPs suggestion but hate mine, I'm confused.</p>\n", "parentCommentId": "y8RJq2wHpc2tBGspL", "user": {"username": "nathan"}}, {"_id": "8BNmBAGRWGMgee9hQ", "postedAt": "2023-02-22T19:48:04.077Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I would like a proper poll of EAs and what they want here. In particular how they trade off sexual freedom and being harmed. I am very uncertain what this poll would show.</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "mBpctbMHH5gH2SWjf", "postedAt": "2023-02-22T20:20:04.616Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>tbh I suspect that \"stuck in a long term abusive relationship\" is a more important tail risk than sexual assault and \"sleeping around\" helps people defend against it (by developing reasonable expectations of what relationships should be like)</p>", "parentCommentId": "SEFjmvLZzyKYsEkyW", "user": {"username": "agunning"}}, {"_id": "L9EY8GsanoTehL2Pg", "postedAt": "2023-02-22T20:24:20.465Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yup, I understand that it was most probably the intention, but this post doesn't do a good job stressing it enough in my opinion. It says that those are people who should consider not doing that in particular, but it's not directed only to them.<br>Plus, even if this post is directed only towards \"not socially skilled men in a high position of power\" asking them not to sleep around violates the same boundary- not mine, but it's still against my values. Consensual relationship between adult people, as long as one of them is not a supervisor/senior/grant-maker of another, is none of community's business, unless we are in church.&nbsp;</p>", "parentCommentId": "TRP39jujJEzBPfCaJ", "user": {"username": "Liv"}}, {"_id": "Nrva3ARxrjXfdidvu", "postedAt": "2023-02-22T22:13:06.725Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think there was a slight breakdown in communication and you're imagining I'm proposing more restriction than I am. Flirting can still have plausible deniability as it could be interpreted as any of “they’re just engaging in friendly banter”, “they’re flirting as flirting, but just for a spark”, “they’re feeling out whether or not they’re interested in me”, “they’re somewhat interested in me, but that could change”, “they’re secretly in love with me”, etc. If&nbsp;<i>everyone</i> in EA were to avoid sleeping around in the sense I’m using it, I think the only interpretation that would be taken away would be “they want to have sex with me but don’t want anything serious”.</p><p>I also think EAs can follow this and still casually date other EAs from the perspective of being open to seeing where it goes, though that might mean taking things a little slower physically. Personally, if I were to date someone outside of EA, I might have sex with them on the first or second date (thought process “I’m attracted to them so why not”), but if I were to date someone in EA I’d probably wait until something like the fourth or fifth date (thought process “oh wow, I’m excited by this person and I think there’s a chance we could develop into something serious”), though I could also imagine exceptions where things were clearer earlier and where I’d sleep with an EA on the first date (I’m definitely not trying to propose a community norm here of a certain specific number of dates before sex). This all also seems to be how people in most companies and other functional tight-knit communities generally approach dating within the group.</p><p>And by “serious” I didn’t mean “marriage or similar”, so I think “might be the&nbsp;<i>one</i>” is a much higher bar than I meant.</p>", "parentCommentId": "fKEXa2j6jTvHxTmjh", "user": {"username": "Patrick Sue Domin"}}, {"_id": "iJfR2q7hMXogHDMuy", "postedAt": "2023-02-22T22:27:20.273Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think this is the sort of thing that might make sense in the abstract, but that in practice would probably lead to more awkwardness and uncomfortability for many people. Imagine if you’re used to being the person on the receptive end instead of the initiating end. In that case, you may find it uncomfortable to initiate and escalate. But your system may involve this person making the move at every single step. They’d have to be the first to flirt, to ask the other person out, to go for the first kiss, and so on. This feels like it could be compounding uncomfortability for a lot of people who aren’t used to making those sort of moves. I also think asking people to take on roles they’re not used to filling would increase the amount of missed signals, which would increase awkwardness. There might also be confusion about which party should be in which role (what if there's a higher-status woman and a lower-status man, or if there's two people who are socially clumsy in different ways).</p>", "parentCommentId": "Np2Ep47zvabBkPcnp", "user": {"username": "Patrick Sue Domin"}}, {"_id": "JyXjZwbmX4hrNK3Py", "postedAt": "2023-02-22T22:39:34.157Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel frustrated. Sign.</p><p>I think those who like this idea are suggesting a huge and powerful norm. And my pretty huge and pretty powerful norm is being rejected because it would be \"awkward and uncomfortable\". I think that misses the point that the original norm is even worse. Again, I sense that a poll of women in EA might reveal that even if we only consider their preferences they aren't pro \"non-neurotypical and high status men in the community cannot have casual sex\". But that's a guess I could be wrong.</p>", "parentCommentId": "iJfR2q7hMXogHDMuy", "user": {"username": "nathan"}}, {"_id": "b7gcZLEQX4rtDAyiy", "postedAt": "2023-02-22T22:39:43.150Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I disagreed with your comment (despite obviously agreeing with my own post), so let me explain why. First (as I describe <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=iJfR2q7hMXogHDMuy\">here</a>), I think your proposal may actually increase uncomfortability and awkwardness, which is what the post was largely written to address. Second (as I described to Jeff <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=Nrva3ARxrjXfdidvu\">here</a>), I think <i>dating</i> within EA doesn't necessarily involve the issues I'm concerned with, and I think your proposal would decrease dating within EA more than mine would. Third, I think your proposal would involve spending weirdness points, while mine would involve saving weirdness points.</p><p>Also, for clarity's sake to address the comment \"it's better than a ban\", I'm not proposing an externally imposed ban. I think an explicit ban would be harmful and I do not endorse one.</p>", "parentCommentId": "rShAfAiL8m4HCcfWp", "user": {"username": "Patrick Sue Domin"}}, {"_id": "AezpCvz5ZWoZC78h6", "postedAt": "2023-02-22T22:54:33.145Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Do you think people might simply not have seen your poll? (and don't understand that by \"my suggestion\" you're referring to an actual poll). We're replying to what is currently the top comment, that might give our comments more visibility.&nbsp;</p><p>I'll signal-boost your poll in my comment above - even if to be clear I disagree with both the poster's and your suggestions.</p><p>Edit: can't find the actual comment in which you have this particular poll, if you share the link with me I'm happy to add it to comment above</p>", "parentCommentId": "rShAfAiL8m4HCcfWp", "user": {"username": "lb_rv"}}, {"_id": "bhRqie6KNwC5FpPMJ", "postedAt": "2023-02-22T23:01:35.226Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Oh that's because Jeff and I were talking before everyone else turned up</p>\n", "parentCommentId": "AezpCvz5ZWoZC78h6", "user": {"username": "nathan"}}, {"_id": "Z4a5hdwtjpCpG5f8J", "postedAt": "2023-02-22T23:18:21.022Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I don't think I'm scared and I don't think I'm particularly emotional about this issue. I do think that if more people in the community followed the points in this piece then the community as a whole would be more functional and more welcoming (though I admit there are some people who would find it less welcoming). My feelings on this issue are not recent, and I've been feeling this way since long before the TIME's article, though recent revelations regarding Owen are what tipped me over into actually writing a post about this.</p><p>I basically agree with Jeff's points<a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=MbnaWAEhFb2xj2qAb\">&nbsp;<u>here</u></a> and<a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=6cc2qJHPwJLvkdgzf\">&nbsp;<u>here</u></a>.</p><p>I understand that these are very personal issues, which is why my suggestion was for people to “consider avoiding” certain behaviours (factoring in potential negative second order effects they may not be focused on) instead of saying people should simply “avoid” these behaviours or that we should ban them outright. I notice your comment focuses on consent and abuse, so that makes me think you might think I’m placing “sleeping around” in a similar category to things like sexual assault. I absolutely do not think this (if I did, I would not have suggested that it’s fine for people to sleep around as much as they want outside the community).</p><p>I also don’t think this is about purity. The emotions I feel towards the community here are more like frustration that the current setup seems (to me) to be hurting community functionality and welcomingness, and not at all like disgust, which is what I think I’d feel if it was about purity.</p>", "parentCommentId": "dKTibbe7mwoGW3T9S", "user": {"username": "Patrick Sue Domin"}}, {"_id": "jeviq4YuuTc7Cnm33", "postedAt": "2023-02-22T23:27:51.258Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>For clarity's sake, my point isn't that people are \"bad\" if they try to sleep around, but that there can be subtle harms if people do it within a tight-knit community, and that we'd be better if people did it less within EA.</p><p>\"Taboo\" is also stronger than what I'd want here.</p>", "parentCommentId": "khD3qmcRrirnriCd5", "user": {"username": "Patrick Sue Domin"}}, {"_id": "a8GFGBGxf7BQ4RJLx", "postedAt": "2023-02-22T23:35:32.906Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>Consensual relationship between adult people, as long as one of them is not a supervisor/senior/grant-maker of another, is none of community's business, unless we are in church.&nbsp;</p></blockquote><p>But isn't this sort of relationship <i>exactly</i> the one that OCB had with an anonymous woman which people one thread over are saying they're feeling shocked, betrayed and undermined by?</p><p>There's no suggestion that there was a violation of consent, only that there was an exchange between two friends who had a very frank relationship, and that OCB said something rather crude (for which he apologised). He at the time wasn't a supervisor/grant-maker of the woman in question.</p>", "parentCommentId": "L9EY8GsanoTehL2Pg", "user": {"username": "Pynchon"}}, {"_id": "xamAuo7NEKthiTr7R", "postedAt": "2023-02-22T23:37:27.124Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I agree. I feel like there are two totally different sets of people and opinions on this thread vs <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology#comments\">https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology#comments</a> and it's making my head spin a bit.</p>", "parentCommentId": "8BNmBAGRWGMgee9hQ", "user": {"username": "Pynchon"}}, {"_id": "5XYrynqCersg8HxBC", "postedAt": "2023-02-22T23:41:29.598Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I'm sorry you feel that way. For clarity's sake, I don't think sex is \"bad\", but instead that it is often \"messy\", and that there are costs with messiness within the community. I think at the very least, more people should <i>consider </i>the potential messiness here in their personal decisions. And while I think there can be large messiness involved in being polyamorous with multiple people from within the same tight-knight community, I don't think the post is as harsh towards polyamory/nonmonogamy as your comment suggests.</p>", "parentCommentId": "GE8qBcsMeBWqsqqwA", "user": {"username": "Patrick Sue Domin"}}, {"_id": "Ko7TXDADDZbdPD2nn", "postedAt": "2023-02-22T23:47:19.061Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I'm sorry you feel those things. In particular, I'm sorry you feel judged. My intention here was not to judge anyone as being a bad person or anything like that, but to point towards behaviours that I think are harmful largely in a diffuse way given their prevalence in the community and aspects of tight-knit groups.</p>", "parentCommentId": "zDujrQteRjztDFwij", "user": {"username": "Patrick Sue Domin"}}, {"_id": "vYRjvfsrTvfwekgjJ", "postedAt": "2023-02-22T23:49:16.894Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I would agree with you in the overwhelming majority of cases, but I would make exceptions in cases where the differences are relevant and large and the issue is important (all of which I think apply here).</p>", "parentCommentId": "LTYPz3SLPyHFHotii", "user": {"username": "Patrick Sue Domin"}}, {"_id": "HTrv2rigjDypgKCmQ", "postedAt": "2023-02-22T23:52:30.354Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Strong agree, with obvious exceptions for things like \"actually I already knew this person before and was going to ask them out anyway\" (though even then it might be best to not ask them out at the event).</p>", "parentCommentId": "6k8kKuGR9Lh76uaoG", "user": {"username": "Patrick Sue Domin"}}, {"_id": "u35HXuaJ2L5JDJ86D", "postedAt": "2023-02-22T23:56:03.144Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Hot tubs at least seem fine. I can't imagine anyone feeling offended or creeped out by being asked at a party if they want to join a hot tub the way they might if they're propositioned for sex (at least, unless there's more going on in the situation). I've heard of the cuddle puddles at Bay Area parties but I'm not familiar enough with them to have an informed view there.</p>", "parentCommentId": "BdD3XqspxmEMxJdAj", "user": {"username": "Patrick Sue Domin"}}, {"_id": "f8mXd9yoEJ3oDi2js", "postedAt": "2023-02-22T23:56:40.893Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Do hot tubs require weirdness points? Don't most people just find them fun and relaxing?</p>", "parentCommentId": "pbF9B2wRzpDyHrcfg", "user": {"username": "Patrick Sue Domin"}}, {"_id": "tJjTiqS8iQxpeXtXo", "postedAt": "2023-02-23T00:01:45.833Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Realistically, I think many EAs have a much easier time sleeping around in EA than outside of EA. Unfortunately, this is probably particularly true for people that are high status in EA or socially clumsy.</p>", "parentCommentId": "zwHSjM7GwZvw4Bp9L", "user": {"username": "Patrick Sue Domin"}}, {"_id": "tFxutKdw6nqbaLFrh", "postedAt": "2023-02-23T00:14:00.414Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Since this post is a call for people to voluntarily consider avoiding some personal behaviours, I don't imagine it would cause people to stop identifying as EA as a workaround.&nbsp;</p><p>Even if there was a norm established along the lines here, it would presumably work on an informal level instead of based on whether people explicitly self-identify as EA, so I don't think it would affect identifying as an EA anyway. I also have a really hard time imagining people who would avoid working at EA orgs or donating to effective charities in order to be able to sleep around within EA without judgment. Who cares that much about being able to sleep with EAs <i>as opposed to sleeping with people outside the community</i>, but doesn't care about doing actual EA stuff? That sort of person sounds like they have an EA fetish. I suppose I could imagine a hypothetical person who is only in EA <i>because</i> the community gives them a source of people to hook up with and that they'd leave otherwise, but my honest view is if someone is actually in that boat then I'd probably want them to leave.</p><blockquote><p>historically groups like villages, churches and ethnic groups have been keen to encourage members to date and marry each other</p></blockquote><p>Right, and I don't consider that to be \"sleeping around\". I elaborate on my views on dating within EA <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=Nrva3ARxrjXfdidvu\">here</a>.</p>", "parentCommentId": "vmEy9C45WRHQyrwqq", "user": {"username": "Patrick Sue Domin"}}, {"_id": "WxFz2w8YnMofZPhec", "postedAt": "2023-02-23T00:15:55.922Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thank you for adding your perspective, I think it is valuable. I think there are probably many people who have similar views to you but who unfortunately quickly left EA, so I imagine this view is underrepresented on the forum.</p>", "parentCommentId": "jpSXpzMWNLkhJrp65", "user": {"username": "Patrick Sue Domin"}}, {"_id": "DrFJJw96GNf2XQaQ6", "postedAt": "2023-02-23T00:16:48.733Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Agree</p>", "parentCommentId": "Pgvukhm93AGHdANBY", "user": {"username": "Patrick Sue Domin"}}, {"_id": "e5goRKrXqci6pnuv5", "postedAt": "2023-02-23T00:19:46.210Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thank you, though I guess I think me talking about how I feel shouldn't mean you have to do anything. I guess given the strength of some of the responses you might feel bad and again, I'd like to move to a place where we can have feelings without a need for reactions.</p>", "parentCommentId": "Ko7TXDADDZbdPD2nn", "user": {"username": "nathan"}}, {"_id": "BhP292Ljh7NhWxkey", "postedAt": "2023-02-23T00:42:38.709Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>I feel like there's an implicit prediction of something like [communities with intelligent people which have lots of causal sex are going to be worse at dealing with sexual assualt/harrassment] and I kind of want to note my reaction being 'given my personal experience i dont really believe this and all else equal I would feel safer in such communities'</p></blockquote><p>I can see why you think that, but I actually wasn't motivated in writing this post by concerns about sexual assault. Sexual assault is obviously a huge issue, but I don't think of it as something like \"a subset of sexual behaviour\" or \"sex gone wrong\", but instead something qualitatively different. Sexual harassment is somewhat trickier as it can be more grey (what's appropriate flirting in one context can be sexual harassment in another), but the main things I was thinking of were more like people being creeped out/feeling uncomfortable or bad community dynamics as opposed to things like people being abused (I don't know that my proposals would decrease abuse).</p><blockquote><p>you only really have so many dumb mistakes to make and I would prefer it if, unlike Owen, people could get these out of their system while young and not yet in leadership positions</p></blockquote><p>I would prefer it if people made more of their awkward mistakes outside of the community. You didn't bring this up, but I'd especially prefer this if people are \"practicing their dating skills\" or similar (which is a thing some people do). I think online dating provides a place for people to make awkward mistakes with very low relative harms, as neither of you have to see each other again if it becomes awkward. This also brings up a point that the traits I mentioned aren't essentialist, as someone who is socially clumsy now might not be socially clumsy anymore within a few years.</p>", "parentCommentId": "vDSAHWPSWjrPENAE3", "user": {"username": "Patrick Sue Domin"}}, {"_id": "AxXXKCxiJXKK6spHk", "postedAt": "2023-02-23T00:45:31.804Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Agree. I would also want a poll of EA-adjacent people of their view of EA here or people who went to one EA meetup and never came back, if it could be done, since I think the community right now may have a selection effect inflating support for sleeping around.&nbsp;</p>", "parentCommentId": "8BNmBAGRWGMgee9hQ", "user": {"username": "Patrick Sue Domin"}}, {"_id": "ycncqzjMqGBWrtcqn", "postedAt": "2023-02-23T00:47:14.129Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yeah I would really like that. And indeed what do people in the global south think? What do religious folks in EA think, etc etc etc.</p>", "parentCommentId": "AxXXKCxiJXKK6spHk", "user": {"username": "nathan"}}, {"_id": "gFBom6YWw47rFa95h", "postedAt": "2023-02-23T01:06:07.817Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think most of the problems I'm thinking of go away if it's done outside of EA or a similar tight-knit group. If you go on a date with a stranger and clumsily proposition them or do something similar, they can just choose not to see you again and they also won't generally worry about how that affects their career.</p>", "parentCommentId": "zi85zTSLTeF3SYbQa", "user": {"username": "Patrick Sue Domin"}}, {"_id": "oocPpAeyWc5nH46Tx", "postedAt": "2023-02-23T01:14:35.522Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>For clarity's sake, I don't think \"socially clumsy\" and \"non-neurotypical\" are identical. There are plenty of neurotypical people who are socially clumsy, and there are also some non-neurotypical people who are not socially clumsy. People also often change in their social clumsiness (typically from clumsy to not clumsy), and it can depend on context (perhaps two people who are socially clumsy in a similar way would actually find each other to be less socially clumsy). I won't pretend there's no correlation to neurotypicality, but I just thought I'd clarify this in case anyone thought I was trying to dog whistle.</p>", "parentCommentId": "JyXjZwbmX4hrNK3Py", "user": {"username": "Patrick Sue Domin"}}, {"_id": "eR7R4LFenfuTRqkxs", "postedAt": "2023-02-23T01:22:50.884Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Also \"cannot have casual sex\" is stronger than what I think. I don't think there should be an explicit ban. I do think people should at least consider the negatives and possibly choose personally to avoid it. I'm somewhat uncertain about my views on a softer norm and I think that may depends more on the specifics.</p>", "parentCommentId": "JyXjZwbmX4hrNK3Py", "user": {"username": "Patrick Sue Domin"}}, {"_id": "rfMwHmQkzKhJGk6FZ", "postedAt": "2023-02-23T01:41:18.760Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>i mean i guess there's a whole spectrum from sexual assault to harrassment to plain old social awkwardness<br>but \"how safe i would feel\" is a pretty good proxy both for how common I believe these things are and how likely I am to feel creeped out/feel uncomfortable</p><p>like \"being creeped out/uncomfortable\" is for most people at least something of a truth-tracking thing and we should optimise for the thing it's trying to track<br><br>[quite importantly \"be legibly safe to my system 1\" is a very different thing to \"try to Goodhart on my system 1's sense of safety\"!]</p>", "parentCommentId": "BhP292Ljh7NhWxkey", "user": {"username": "agunning"}}, {"_id": "mf3X6s4ospbnWRGPn", "postedAt": "2023-02-23T01:43:55.675Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Great point about tail risks. I'm unsure if \"sleeping around\" is a good antidote. Maybe?</p>\n<p>Against: According to the point you're making, people's first (or earliest) relationships are the most risky because of not yet having developed reasonable expectations of what relationships should be like. Casual norms (and greater tolerance of dating across asymmetric power dynamics) encourage less careful selection, which makes it more likely the partner is a bad match?(As many commenters point out, casual can turn into serious/long-term unexpectedly, so it's not like casual means you don't run the risk of ending up in a bad long-term bond.)</p>\n<p>In favor: I find it hard to articulate why, but I think you still have a point. Maybe there's something about how casual norms lead to more discussions about sex and relationships? If so, maybe it's less about what you end up doing (actually \"sleeping around\") and more about seeking out advice from others around you, discussing difficult topics openly, etc.? (Sure, firsthand relationship experience is invaluable, but if the first one is bad for you and you have the sort of personality to \"get stuck\" – seems like you're in danger in environments with both types of norms?)</p>\n<p>Either way, I don't think this is the sort of thing that one can (or should) easily engineer from the top down. Feels kind of dystopian if the rules are too restricting. (I do think it's good to have rules for things that can often go really badly and are somewhat easy to work around if some people really want to date each other – e.g., about power dynamics.)</p>\n", "parentCommentId": "mBpctbMHH5gH2SWjf", "user": {"username": "Lukas_Gloor"}}, {"_id": "MTgXJLgXeexJyyXzY", "postedAt": "2023-02-23T01:49:32.889Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>I mean, empirically women do choose to go on dates,</p></blockquote><p>Not everyone. Some no longer date after particularly bad experiences. (Can also apply to men.)</p>", "parentCommentId": "ib5YmvcgqvCPzFkZF", "user": {"username": "Lukas_Gloor"}}, {"_id": "csmEEp2ew8JPEHpJA", "postedAt": "2023-02-23T01:55:41.070Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I expect this depends somewhat on attire?</p>\n", "parentCommentId": "u35HXuaJ2L5JDJ86D", "user": {"username": "Jeff_Kaufman"}}, {"_id": "pqvyrGDgAT9H3fAz9", "postedAt": "2023-02-23T02:00:33.064Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>i meant mostly about how you can get a larger sample size of what possible relationships can look like before (say) committing to monogamy. (I suspect polyamory is even better in this respect).<br>and especially when you're young you might not have a good sense of how to select people in the first place and love can be pretty dumb about these things.</p><p>although more relaxed social norms about talking about such things also helps and has positive externalities for the people more inclined to be ~prudish</p><p>but anecdotally given there's a tail of people who keep getting into these relationships again and again, i think the relationship-expectation thing is really important</p>", "parentCommentId": "mf3X6s4ospbnWRGPn", "user": {"username": "agunning"}}, {"_id": "aBksqTRnReFrdTLxk", "postedAt": "2023-02-23T02:29:33.068Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel like there's some implicit claim that only a subset of people (socially awkward men?) aren't romantically perceptive, but my understanding is that basically everyone is bad at this and if you are going to flirt with someone you should expect that you are probably unable to tell whether they want it.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref64phlkgfgyw\"><sup><a href=\"#fn64phlkgfgyw\">[1]</a></sup></span></p><p>An <a href=\"https://psycnet.apa.org/record/2011-08768-004\">example paper</a> largely chosen at random says:</p><blockquote><p>Based on a community sample of real-life speed daters we<br>were able to show that actual mate choices are not reciprocal,<br>although people strongly expect their choices to be<br>reciprocated and dating behaviour (flirting) is indeed<br>strongly reciprocal.</p></blockquote><p>I.e. people reciprocate flirting essentially independent of whether they are actually attracted to the other person, and the other person is essentially unable to distinguish \"real\" from \"fake\" flirting.</p><p>Furthermore, that paper had two \"independent, trained raters\" who watched recordings and marked if the person involved was flirting. These raters had interrater reliability of&nbsp;<span><span class=\"mjpage\"><span class=\"mjx-chtml\"><span class=\"mjx-math\" aria-label=\"\\alpha = .68\"><span class=\"mjx-mrow\" aria-hidden=\"true\"><span class=\"mjx-mi\"><span class=\"mjx-char MJXc-TeX-math-I\" style=\"padding-top: 0.225em; padding-bottom: 0.298em;\">α</span></span><span class=\"mjx-mo MJXc-space3\"><span class=\"mjx-char MJXc-TeX-main-R\" style=\"padding-top: 0.077em; padding-bottom: 0.298em;\">=</span></span><span class=\"mjx-mn MJXc-space3\"><span class=\"mjx-char MJXc-TeX-main-R\" style=\"padding-top: 0.372em; padding-bottom: 0.372em;\">.68</span></span></span></span><style>.mjx-chtml {display: inline-block; line-height: 0; text-indent: 0; text-align: left; text-transform: none; font-style: normal; font-weight: normal; font-size: 100%; font-size-adjust: none; letter-spacing: normal; word-wrap: normal; word-spacing: normal; white-space: nowrap; float: none; direction: ltr; max-width: none; max-height: none; min-width: 0; min-height: 0; border: 0; margin: 0; padding: 1px 0}\n.MJXc-display {display: block; text-align: center; margin: 1em 0; padding: 0}\n.mjx-chtml[tabindex]:focus, body :focus .mjx-chtml[tabindex] {display: inline-table}\n.mjx-full-width {text-align: center; display: table-cell!important; width: 10000em}\n.mjx-math {display: inline-block; border-collapse: separate; border-spacing: 0}\n.mjx-math * {display: inline-block; -webkit-box-sizing: content-box!important; -moz-box-sizing: content-box!important; box-sizing: content-box!important; text-align: left}\n.mjx-numerator {display: block; text-align: center}\n.mjx-denominator {display: block; text-align: center}\n.MJXc-stacked {height: 0; position: relative}\n.MJXc-stacked > * {position: absolute}\n.MJXc-bevelled > * {display: inline-block}\n.mjx-stack {display: inline-block}\n.mjx-op {display: block}\n.mjx-under {display: table-cell}\n.mjx-over {display: block}\n.mjx-over > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-under > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-stack > .mjx-sup {display: block}\n.mjx-stack > .mjx-sub {display: block}\n.mjx-prestack > .mjx-presup {display: block}\n.mjx-prestack > .mjx-presub {display: block}\n.mjx-delim-h > .mjx-char {display: inline-block}\n.mjx-surd {vertical-align: top}\n.mjx-surd + .mjx-box {display: inline-flex}\n.mjx-mphantom * {visibility: hidden}\n.mjx-merror {background-color: #FFFF88; color: #CC0000; border: 1px solid #CC0000; padding: 2px 3px; font-style: normal; font-size: 90%}\n.mjx-annotation-xml {line-height: normal}\n.mjx-menclose > svg {fill: none; stroke: currentColor; overflow: visible}\n.mjx-mtr {display: table-row}\n.mjx-mlabeledtr {display: table-row}\n.mjx-mtd {display: table-cell; text-align: center}\n.mjx-label {display: table-row}\n.mjx-box {display: inline-block}\n.mjx-block {display: block}\n.mjx-span {display: inline}\n.mjx-char {display: block; white-space: pre}\n.mjx-itable {display: inline-table; width: auto}\n.mjx-row {display: table-row}\n.mjx-cell {display: table-cell}\n.mjx-table {display: table; width: 100%}\n.mjx-line {display: block; height: 0}\n.mjx-strut {width: 0; padding-top: 1em}\n.mjx-vsize {width: 0}\n.MJXc-space1 {margin-left: .167em}\n.MJXc-space2 {margin-left: .222em}\n.MJXc-space3 {margin-left: .278em}\n.mjx-test.mjx-test-display {display: table!important}\n.mjx-test.mjx-test-inline {display: inline!important; margin-right: -1px}\n.mjx-test.mjx-test-default {display: block!important; clear: both}\n.mjx-ex-box {display: inline-block!important; position: absolute; overflow: hidden; min-height: 0; max-height: none; padding: 0; border: 0; margin: 0; width: 1px; height: 60ex}\n.mjx-test-inline .mjx-left-box {display: inline-block; width: 0; float: left}\n.mjx-test-inline .mjx-right-box {display: inline-block; width: 0; float: right}\n.mjx-test-display .mjx-right-box {display: table-cell!important; width: 10000em!important; min-width: 0; max-width: none; padding: 0; border: 0; margin: 0}\n.MJXc-TeX-unknown-R {font-family: monospace; font-style: normal; font-weight: normal}\n.MJXc-TeX-unknown-I {font-family: monospace; font-style: italic; font-weight: normal}\n.MJXc-TeX-unknown-B {font-family: monospace; font-style: normal; font-weight: bold}\n.MJXc-TeX-unknown-BI {font-family: monospace; font-style: italic; font-weight: bold}\n.MJXc-TeX-ams-R {font-family: MJXc-TeX-ams-R,MJXc-TeX-ams-Rw}\n.MJXc-TeX-cal-B {font-family: MJXc-TeX-cal-B,MJXc-TeX-cal-Bx,MJXc-TeX-cal-Bw}\n.MJXc-TeX-frak-R {font-family: MJXc-TeX-frak-R,MJXc-TeX-frak-Rw}\n.MJXc-TeX-frak-B {font-family: MJXc-TeX-frak-B,MJXc-TeX-frak-Bx,MJXc-TeX-frak-Bw}\n.MJXc-TeX-math-BI {font-family: MJXc-TeX-math-BI,MJXc-TeX-math-BIx,MJXc-TeX-math-BIw}\n.MJXc-TeX-sans-R {font-family: MJXc-TeX-sans-R,MJXc-TeX-sans-Rw}\n.MJXc-TeX-sans-B {font-family: MJXc-TeX-sans-B,MJXc-TeX-sans-Bx,MJXc-TeX-sans-Bw}\n.MJXc-TeX-sans-I {font-family: MJXc-TeX-sans-I,MJXc-TeX-sans-Ix,MJXc-TeX-sans-Iw}\n.MJXc-TeX-script-R {font-family: MJXc-TeX-script-R,MJXc-TeX-script-Rw}\n.MJXc-TeX-type-R {font-family: MJXc-TeX-type-R,MJXc-TeX-type-Rw}\n.MJXc-TeX-cal-R {font-family: MJXc-TeX-cal-R,MJXc-TeX-cal-Rw}\n.MJXc-TeX-main-B {font-family: MJXc-TeX-main-B,MJXc-TeX-main-Bx,MJXc-TeX-main-Bw}\n.MJXc-TeX-main-I {font-family: MJXc-TeX-main-I,MJXc-TeX-main-Ix,MJXc-TeX-main-Iw}\n.MJXc-TeX-main-R {font-family: MJXc-TeX-main-R,MJXc-TeX-main-Rw}\n.MJXc-TeX-math-I {font-family: MJXc-TeX-math-I,MJXc-TeX-math-Ix,MJXc-TeX-math-Iw}\n.MJXc-TeX-size1-R {font-family: MJXc-TeX-size1-R,MJXc-TeX-size1-Rw}\n.MJXc-TeX-size2-R {font-family: MJXc-TeX-size2-R,MJXc-TeX-size2-Rw}\n.MJXc-TeX-size3-R {font-family: MJXc-TeX-size3-R,MJXc-TeX-size3-Rw}\n.MJXc-TeX-size4-R {font-family: MJXc-TeX-size4-R,MJXc-TeX-size4-Rw}\n.MJXc-TeX-vec-R {font-family: MJXc-TeX-vec-R,MJXc-TeX-vec-Rw}\n.MJXc-TeX-vec-B {font-family: MJXc-TeX-vec-B,MJXc-TeX-vec-Bx,MJXc-TeX-vec-Bw}\n@font-face {font-family: MJXc-TeX-ams-R; src: local('MathJax_AMS'), local('MathJax_AMS-Regular')}\n@font-face {font-family: MJXc-TeX-ams-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_AMS-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_AMS-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_AMS-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-B; src: local('MathJax_Caligraphic Bold'), local('MathJax_Caligraphic-Bold')}\n@font-face {font-family: MJXc-TeX-cal-Bx; src: local('MathJax_Caligraphic'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-cal-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-R; src: local('MathJax_Fraktur'), local('MathJax_Fraktur-Regular')}\n@font-face {font-family: MJXc-TeX-frak-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-B; src: local('MathJax_Fraktur Bold'), local('MathJax_Fraktur-Bold')}\n@font-face {font-family: MJXc-TeX-frak-Bx; src: local('MathJax_Fraktur'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-frak-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-BI; src: local('MathJax_Math BoldItalic'), local('MathJax_Math-BoldItalic')}\n@font-face {font-family: MJXc-TeX-math-BIx; src: local('MathJax_Math'); font-weight: bold; font-style: italic}\n@font-face {font-family: MJXc-TeX-math-BIw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-BoldItalic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-BoldItalic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-BoldItalic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-R; src: local('MathJax_SansSerif'), local('MathJax_SansSerif-Regular')}\n@font-face {font-family: MJXc-TeX-sans-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-B; src: local('MathJax_SansSerif Bold'), local('MathJax_SansSerif-Bold')}\n@font-face {font-family: MJXc-TeX-sans-Bx; src: local('MathJax_SansSerif'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-sans-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-I; src: local('MathJax_SansSerif Italic'), local('MathJax_SansSerif-Italic')}\n@font-face {font-family: MJXc-TeX-sans-Ix; src: local('MathJax_SansSerif'); font-style: italic}\n@font-face {font-family: MJXc-TeX-sans-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-script-R; src: local('MathJax_Script'), local('MathJax_Script-Regular')}\n@font-face {font-family: MJXc-TeX-script-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Script-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Script-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Script-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-type-R; src: local('MathJax_Typewriter'), local('MathJax_Typewriter-Regular')}\n@font-face {font-family: MJXc-TeX-type-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Typewriter-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Typewriter-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Typewriter-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-R; src: local('MathJax_Caligraphic'), local('MathJax_Caligraphic-Regular')}\n@font-face {font-family: MJXc-TeX-cal-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-B; src: local('MathJax_Main Bold'), local('MathJax_Main-Bold')}\n@font-face {font-family: MJXc-TeX-main-Bx; src: local('MathJax_Main'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-main-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-I; src: local('MathJax_Main Italic'), local('MathJax_Main-Italic')}\n@font-face {font-family: MJXc-TeX-main-Ix; src: local('MathJax_Main'); font-style: italic}\n@font-face {font-family: MJXc-TeX-main-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-R; src: local('MathJax_Main'), local('MathJax_Main-Regular')}\n@font-face {font-family: MJXc-TeX-main-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-I; src: local('MathJax_Math Italic'), local('MathJax_Math-Italic')}\n@font-face {font-family: MJXc-TeX-math-Ix; src: local('MathJax_Math'); font-style: italic}\n@font-face {font-family: MJXc-TeX-math-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size1-R; src: local('MathJax_Size1'), local('MathJax_Size1-Regular')}\n@font-face {font-family: MJXc-TeX-size1-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size1-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size1-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size1-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size2-R; src: local('MathJax_Size2'), local('MathJax_Size2-Regular')}\n@font-face {font-family: MJXc-TeX-size2-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size2-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size2-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size2-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size3-R; src: local('MathJax_Size3'), local('MathJax_Size3-Regular')}\n@font-face {font-family: MJXc-TeX-size3-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size3-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size3-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size3-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size4-R; src: local('MathJax_Size4'), local('MathJax_Size4-Regular')}\n@font-face {font-family: MJXc-TeX-size4-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size4-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size4-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size4-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-R; src: local('MathJax_Vector'), local('MathJax_Vector-Regular')}\n@font-face {font-family: MJXc-TeX-vec-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-B; src: local('MathJax_Vector Bold'), local('MathJax_Vector-Bold')}\n@font-face {font-family: MJXc-TeX-vec-Bx; src: local('MathJax_Vector'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-vec-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Bold.otf') format('opentype')}\n</style></span></span></span>&nbsp;which isn't terrible, but isn't amazing either.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref56j9qmjzb3g\"><sup><a href=\"#fn56j9qmjzb3g\">[2]</a></sup></span></p><p>tl;dr: my guess is that most people should 1) not assume that they can reliably identify flirting and 2) even if they can, should not assume that they can reliably predict whether this flirting is indicative of romantic interest.</p><p>Of course, this also cuts the other way: people who you don't think are attracted to you are sometimes attracted to you. But whatever risk/reward calculation you are running should include the fact that you are probably going to make mistakes here.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn64phlkgfgyw\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref64phlkgfgyw\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Obviously it's possible to get reliable signals, e.g. if someone explicitly says \"I don't like you\" then probably you can accurately guess that they don't like you. This comment is referring to \"normal\" flirting signals like eye contact, touch, etc.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn56j9qmjzb3g\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref56j9qmjzb3g\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I assume these \"trained raters\" were grad students who had thought about the problem for a couple days or something, and I bet that if you actually genuinely studied this you could get good at it, but probably very few people are in that reference class.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "FcgPd9pavhLMDWurW", "postedAt": "2023-02-23T03:58:04.426Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>As has been discussed quite commonly elsewhere on this topic, the goal of the effective altruism movement is to improve the world. Not to make effective altruists happy or get them laid/married etc.</p>\n<p>Yes relationships can be good and help build social ties, but OP clearly isn’t saying people shouldn’t date at all, just that they shouldn’t casually date. I think a trade off of less relationships on the margin for less sexual harassment assault and more women In EA is a fine trade off to make.</p>\n<p>On top of this it’s not healthy to have your entire social support system within EA, and this will help prevent that too.</p>\n", "parentCommentId": "y8RJq2wHpc2tBGspL", "user": {"username": "Wil Perkins"}}, {"_id": "duTzpKhSKRij2YHtR", "postedAt": "2023-02-23T04:21:48.339Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Surprised at the amount of upvotes on the main post, versus the highly upvoted comments talking about being scared, judged, frustrated, etc.</p>\n<p>Personally I agree strongly with this post and think it’s a more than reasonable proposal. Also, just seems like common sense. I’d imagine there are quite a few people who feel similarly based on the vote count.</p>\n<p>It seems that an extremely large proportion of EAF users are die hard proponents of casual sex and polyamory, which makes this conversation fraught. I’ll also be honest - I get the sense than many defenders of these non-traditional norms  within the EA community argue from a stance of emotion and don’t really engage with the idea that promoting polyamory could massively reduce our overall utility as a movement.</p>\n<p>Using language and framing like “what if you replace poly with gay” or “personally this makes me feel…” is not compatible with calculating the utility of a norm in EA. As stated elsewhere our goal is to better the world, not make ourselves happy or help EAs find life partners.</p>\n<p>I understand this is a deeply personal topic but I would appreciate someone laying out a strong case for why polyamory and casual sex in the EA community actually leads to higher utility overall.</p>\n", "parentCommentId": null, "user": {"username": "Wil Perkins"}}, {"_id": "nEeqAJfzeixy2msPC", "postedAt": "2023-02-23T04:54:56.591Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>i mean<br>this is the point of flirting? it is plausibly deniable?&nbsp;</p><p>i think a lot of the time flirting means, say \"i'm not sure if i'm ~attracted to you and testing the waters would help me get data on this\"</p><p>(i think poor social skills often cashes out as \"not having things like this as hypotheses\" rather than \"being unable to read people\")</p><p>im honestly not sure if there's a clear line between flirting and non-flirting.</p><p>if i knew i wanted to hook up with someone i would simply tell them</p>", "parentCommentId": "aBksqTRnReFrdTLxk", "user": {"username": "agunning"}}, {"_id": "pirCnNbXPjvQx5PZA", "postedAt": "2023-02-23T05:29:12.567Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>i feel like the \"what if you replace poly with gay\" thing is saying, like<br>empirically something (some kind of instinctual conservatism towards sexual norms) caused people to say the same things about gay people.</p><p>so something like instinctual-conservatism-towards-sexual-norms when it's ~adults doing consensual things is a heuristic that failed in the past and is probably not reliable</p><p>if you want to interfere with my private life to that extent there's a very strong burden of proof upon you</p><p>also happier EAs are EAs that are better at doing EA work, generally speaking<br><br>&nbsp;</p>", "parentCommentId": "duTzpKhSKRij2YHtR", "user": {"username": "agunning"}}, {"_id": "B47bmbd9jPmhYcSdd", "postedAt": "2023-02-23T06:06:36.480Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yes, it was. Let me make it clear - there was still a significant power imbalance and he ignored it, which I believe is stupid.&nbsp;<br>Regardless, my boundary stays exactly in the the same place. And for the context, I've experienced creepy people, unwanted sexual behavior and harassment many times (not in EA, to be clear), more than three times it was serious, some of the instances were when I was a minor. Still wouldn't trade it for something I believe is (a soft version, but still) a purity culture, as such culture is something I've experienced as well and it harms more (and it would harm more not only me, but also other people if imposed, in my opinion). &nbsp;Moreover, I believe some of the harassment I've experienced was encouraged by such culture because imposing such rules also has serious, not always obvious consequences. I know that right now it may seem like a good thing to do, as many believe that recent situation was a fruit of \"too much sexual freedom\" and \"sleeping around\", and you really want to try something even extreme to be safe. I'd say - it's a trap. But feel free to try it, if you want and it's good for you and your personal integrity, I honestly wish you the best.&nbsp;<br>In the same time, I'm not going to support it, my boundary stays the same and I'm not going to change my actions. I'm going to keep sleeping around, and you have exactly the same power over it, as, for example, any type of church does - which is none or very little. If it turns out that I meet with a backlash or interacting with the community &nbsp;stops being for me, I'm ok with that.&nbsp;</p>", "parentCommentId": "a8GFGBGxf7BQ4RJLx", "user": {"username": "Liv"}}, {"_id": "iDTCcqCj4aSnSZtqi", "postedAt": "2023-02-23T06:34:54.773Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Strongly agree<br><br>Like you say it seems like many people draw a line when it comes to utility between parts of our life that can seem deeply personal (relationships), and aspects of our life that seem less personal (What job I should do, where I should give my money, what cause is best). Perhaps this is a reasonable distinction and we should be drawing that line, but I would like to see it better articulated rather than assumed.</p><p>I appreciated <a href=\"https://forum.effectivealtruism.org/users/nathan?mention=user\">@Nathan Young</a>'s comment &nbsp;above which perhaps articulates some of &nbsp;this difficulty. <i><strong>\"I feel sad/judged/ frustrated reading this, though that's not to say it's wrong.\"</strong></i></p>", "parentCommentId": "duTzpKhSKRij2YHtR", "user": {"username": "NickLaing"}}, {"_id": "Kju9sNjNAyfoBq7Nw", "postedAt": "2023-02-23T06:47:19.326Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>It's difficult to judge, but I doubt this would reduce healthy and compatable marriages and primary relationships. People who like each other &nbsp;within EA will still naturally spend time together. They will &nbsp;still become friends, and those friendships will still grow into more than platonic friendships. I don't see how the recommendations above would stop that?</p><p>Perhaps there might be a (potentially healthy) time delay that would kick in before those positive romantic relationships got started but I doubt many potentially wonderful relationships would be stymied if we followed the OPs thoughts. Perhaps the cost of lost relationships would be &nbsp;very minor or even negligible.</p><p>Perhaps this is just the hopeless romantic inside of me coming out tho...</p>", "parentCommentId": "fKEXa2j6jTvHxTmjh", "user": {"username": "NickLaing"}}, {"_id": "uAdvp2iDmmbSANKG4", "postedAt": "2023-02-23T07:54:03.841Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel like there's a problem here of like<br>people are going to have crushes, yknow<br>and this is going to affect their judgement and behaviour<br>and sometimes people notice other people have crushes<br><br>I feel like the difference between \"hey i think you're cute but no worries if you're not interested\" and not saying anything is almost the difference between a disclosed conflict of interest and an undisclosed conflict of interest</p>", "parentCommentId": "khD3qmcRrirnriCd5", "user": {"username": "agunning"}}, {"_id": "HkZryhfow7EHAy8cr", "postedAt": "2023-02-23T09:24:58.000Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>like, I feel like if you were in this movement 50 years ago you would be saying \"we shouldn't be encouraging gay relationships within this movement because it'd make the place feel uninviting for people who don't want to be hit on by people of hte same sex\"?&nbsp;</p>", "parentCommentId": "pirCnNbXPjvQx5PZA", "user": {"username": "agunning"}}, {"_id": "Lgtw7cRW4p76XECCa", "postedAt": "2023-02-23T10:12:14.891Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Here's two simple and linked cases: Weird aspie poly people are central to what the community has so far done. Also libertarian anti woke people. A sharp cultural change like the one proposed here will drive us out. Losing my part of the community will probably reduce its ability to act more than losing the part of the community that wants these changes.</p>\n<p>The impact on the global portfolio of charitable action is much less clear, because people like me will coalesce elsewhere in communities that try to be actively cringe and have a bit of a right wing reputation to avoid new comers who want to drive us out. But we'll probably still be worrying about ai, utilitarianism, and trying to make ethical concerns into real world changes.</p>\n<p>The same thing will also happen if my group stays in/ regains control of ea culture. The people who bounce or leave will end up doing good things elsewhere in communities that match their preferences better.</p>\n<p>EA is a way, not the way, and changes to the culture should be judged in utilitarian terms by how they influence the global portfolio of action, not by how they change the level of useful work directly done through EA.</p>\n<p>Second: As a poly EA, I'm more likely to bother to show up for things if I think I might get laid. It increases engagement and community cohesion. A group that is a good place to meet interesting opposite gender people is going to have an intrinsic advantage in pulling in casually interested people over one where that is strictly banned.</p>\n<p>The claim that functional groups tend to ban dating within the group seems to me to be simply untrue in general and across cultures.</p>\n<p>Of course the bouncing because hit on too often issue points in the other direction. But I don't think anyone has actually tried to measure the relative magnitudes of these effects. There is just a completely non rigorous statement that clearly the expected value calculation points against making poly people happy.</p>\n", "parentCommentId": "duTzpKhSKRij2YHtR", "user": {"username": "timunderwood"}}, {"_id": "xEejzkBx9hDfynMaj", "postedAt": "2023-02-23T11:07:09.867Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>Second: As a poly EA, <strong>I'm more likely to bother to show up for things if I think I might get laid</strong>. It increases engagement and community cohesion.</p></blockquote><p>[emphasis added]</p><p>I just want to flag that this makes me <strong>pretty uncomfortable</strong>. Not all engagement is good, and if a change in policy / culture increases engagement on the margin because it attracts people who want to show up to get laid (who otherwise wouldn't have been there), I think I'm personally okay with not having this engagement.</p><p>It's also not clear that if EA changes the dynamics of events or the movement such that there are now an extra group of people who are engaging now that there are opportunities to get laid, that this wouldn't lead to other people disengaging, so I think the extent to which this actually leads to positive engagement and community cohesion is an open question.</p><p>&nbsp;</p><blockquote><p>The impact on the global portfolio of charitable action is much less clear, because people like me will coalesce elsewhere in communities that try to be actively cringe and have a bit of a right wing reputation to avoid new comers who want to drive us out. But we'll probably still be worrying about ai, utilitarianism, and trying to make ethical concerns into real world changes.</p><p>...changes to the culture should be judged in utilitarian terms by how they influence the global portfolio of action, not by how they change the level of useful work directly done through EA.</p></blockquote><p>I'm not sure if I'm understanding you correctly. Your two claims sound like:</p><ol><li>\"If people like me are driven out of the EA community, they will coalesce elsewhere, have a cringe + right wing reputation, and continue to do work on AI / try to make ethical concerns into real world changes.\"</li><li>\"Changes to EA culture should take into account all impacts and not just the direct impact done through EA.\"</li></ol><p>If you assume that more normie / left-leaning EAs<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref9kp4xktw7bu\"><sup><a href=\"#fn9kp4xktw7bu\">[1]</a></sup></span>&nbsp; won't continue to do the \"EA-equivalent\" &nbsp;to the same extent (e.g. they go off and become a campaign coordinator for the median social justice movement), doesn't this imply EA should actively move away from \"cringe + right wing reputation\" by your own argument?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefhl9cmrpv04e\"><sup><a href=\"#fnhl9cmrpv04e\">[2]</a></sup></span></p><p>i.e. if \"cringe right wing\" EAs are going to work on AI safety regardless of their involvement in EA, and \"normie left wing\" EAs will be more impactful in EA than outside of it, this implies the counterfactual loss in impact is asymmetrical, and if you suggest taking into account all impacts and not just the direct impact through EA, then presumably this supports moving in the normie left wing direction.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn9kp4xktw7bu\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref9kp4xktw7bu\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Fwiw, I'm not the biggest fan of these labels, and I think they risk being more tribal than adding clarity to the conversation. Like I think folks on a wide range on the political spectrum can have meaningful and useful things to contribute to the EA movement. But I am using it just as antonyms to the examples you gave.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnhl9cmrpv04e\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefhl9cmrpv04e\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Again, just using your words, not necessarily reflective of any personal views of what you might refer to as \"weird aspie\" / \"libertarian anti-woke\" EAs. I'm also not necessarily advocating that EA should actually move away from this group, just trying to understand your argument.</p></div></li></ol>", "parentCommentId": "Lgtw7cRW4p76XECCa", "user": {"username": "bruce"}}, {"_id": "9e2ovKEJcvjAvy9rh", "postedAt": "2023-02-23T11:29:37.724Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I upvoted the post because I like that it tries to tackle power dynamics and sources of problems related to sex, which the community clearly has.</p>\n<p>That said, I don't actually agree. I don't think policing people's relationship choices (including casual ones) is necessary - or productive - for preventing harassment etc.</p>\n<p>Perhaps the most important point is that out of the sample of comments I've read so far, most were written by men - and I'm much more interested to hear what women in EA think here.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "fdJYM6c2PwsGZpPNv", "postedAt": "2023-02-23T12:17:05.183Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think you might be thinking about the typical case instead of the marginal case?</p>\n", "parentCommentId": "Kju9sNjNAyfoBq7Nw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "mDaptAwwcNEqgGK9b", "postedAt": "2023-02-23T12:18:08.403Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>Second: As a poly EA, I'm more likely to bother to show up for things if I think I might get laid. It increases engagement and community cohesion.</p></blockquote><p>I upvoted the comment for sharing a relevant point of view, but I personally care most about an EA community where people obsess over ideas and taking action to make the world better. So, anything that attracts people for other reasons is something I see as a risk (dilution of quality). I'm not sure it's that important to draw in lots of casually interested people (definitely not saying you fit that description – I'm just talking about the part of \"increases engagement\").</p><p>To be clear, I know some poly people or people who \"sleep around\" who seem as serious about EA as it gets, so I'm not saying one can't have both.</p><p>That said, the most committed EAs I know who \"sleep around\" mostly do so <i>outside of EA</i> because they've decided doing it within EA has more risks than benefits and they attend EA events for impact rather than socially. (And my guess is that the most committed EAs who are poly pursue more serious poly relationships rather than lots of casual ones – but I don't actually know.)&nbsp;<br><br>So, there's a sense in which I totally agree with the OP. I just don't think it's a good idea to try to do anything about this from top down. One thing we can do from the bottom up is socially encourage people for being highly dedicated and impact-oriented. (People tend to notice when someone has a high opinion of them and finds their attitude impressive.)</p><p>Edit: I guess one point that made me much more sympathetic toward the view that casual dating is not in tension with &nbsp;high dedication to (the moral inspiration of) EA is that several commenters mentioned that some of their best long-term relationships started casually. If that's the case for someone (that pursuing casual relationships is one of the best ways for finding long-term relationship happiness), then that's of course different!&nbsp;</p>", "parentCommentId": "Lgtw7cRW4p76XECCa", "user": {"username": "Lukas_Gloor"}}, {"_id": "5agsGhpepezJoCwwi", "postedAt": "2023-02-23T12:37:27.689Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>as a poly person this correlates very strongly with \"I would like to be friends with this person\"</p>", "parentCommentId": "XrYFMrykbgysYon7J", "user": {"username": "agunning"}}, {"_id": "iBQyLGYKSjw4rzkGr", "postedAt": "2023-02-23T12:42:03.758Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>It's a really difficult counterfactual - would the amazing relationship have happened if more people chose to follow the OP's guidelines? I'm not sure what you mean by the marginal case exactly.</p>", "parentCommentId": "fdJYM6c2PwsGZpPNv", "user": {"username": "NickLaing"}}, {"_id": "WgxxeRtDXsHFzZDYm", "postedAt": "2023-02-23T12:59:32.181Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I feel like I want to comment, for people that know me, that this wasn't me (same first name, the auhtor's description could probably be me, it's the type of thing I'd say (this isn't me necessarily endorsing the post)).</p>", "parentCommentId": null, "user": {"username": "PatrickL"}}, {"_id": "wxZLingg7mdcCCC8z", "postedAt": "2023-02-23T13:14:30.239Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Sorry, I was too terse. There's a thing that happens where people are trying to imagine the effect of a change where they think about how that change would affect a central example. For example, if you were trying to guess what sort of effect charging slightly more for bread would have you might reason that people who buy bread generally like it a lot and a few cents either way is unlikely to change whether it is worth it for them to make the purchase. This kind of thinking reliably gets the wrong answer, because instead of typical bread consumers the ones whose purchasing behavior is most likely to change are the ones who are most on the fence about whether to buy bread. These cases are called, at least in economics, \"marginal\", and reasoning that explicitly focuses here is called \"thinking on the margin\".</p>\n<p>So we need to think about the kind of relationships that would be most affected. For example, ones where the people were initially only in the same place together for a short time (ex: at a conference) and without moving somewhat quickly through stages of intimacy would have gone off in different directions before realizing how good a fit they are for each other.</p>\n<p>Your comment described how the typical couple would still get together, and I don't disagree there. I'm not claiming that the rate would go to zero, just that it would decrease and we should think about how much it would go down and how bad that would be.</p>\n", "parentCommentId": "iBQyLGYKSjw4rzkGr", "user": {"username": "Jeff_Kaufman"}}, {"_id": "wHWyAsQA6yF53EHJs", "postedAt": "2023-02-23T13:15:50.408Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>tbh I'm not exactly sure you ... understand poly culture here?<br>like it feels like you have primary relationships filed under \"serious\" relationships and secondary relationships filed under \"unserious\" which like ... doesn't really get it imo<br><br>for me \"good friends and people who i'd like to be friends with\" &nbsp;is pretty closely correlated with \"people i'd go out of my way to hook up with\" and it feels like you have decided that a for me is an normal human way to show affection is off limits or inadvisable?</p><p><br>i think there's a third thing that's kind of reasonable to object to which is guys in EA hitting on women in EA for no more reason than that they are women in EA, which is fair enough.</p>", "parentCommentId": "5XYrynqCersg8HxBC", "user": {"username": "agunning"}}, {"_id": "cy9n8bAqKQrdTiyfs", "postedAt": "2023-02-23T13:26:57.178Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Even if the differences you pointed to in the OP are real on average (and for some of them that is a generous assumption), what makes you think they are large? Even where men and women are different on average, the differences are usually very small, much smaller than the variation within either gender.</p>\n", "parentCommentId": "vYRjvfsrTvfwekgjJ", "user": {"username": "River"}}, {"_id": "NsR4iDixEkqaNEBG2", "postedAt": "2023-02-23T13:38:28.272Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>When it comes to intervening in people’s personal lives, I would never advocate a top down solution to something like this to be clear. If an organizer in a local group suggested we should kick out anyone who is poly or sleeps around I would be far more likely to  see that organizer as problematic than the group in question.</p>\n<p>The reason I strongly agree is that this is a community norm suggestion, and I think it’s a healthy one.</p>\n<p>To your point about the gay community fifty years ago - I agree! If there is a subset of highly taboo social norms, regardless of their moral valence, that are promoted in a community it will taint the ideas of that community to the general public. Fifty years ago I would’ve probably said something similar, like “it’s fine to have gay people in the movement and we will not judge you. However this is not a movement to promote the rights of gay people, this is a movement to make charity better and doing good more effective.”</p>\n<p>Overall I think it would be better for EA and for poly acceptance if people who were poly tried to form/stick to their own sub culture outside of EA for dating around (which absolutely exists, I practiced polyamory years before I found EA.) People who advocate polyamory could focus more on that, and many folks in EA would have less of their entire life/identity tied up in EA, which I see as a good thing.</p>\n", "parentCommentId": "HkZryhfow7EHAy8cr", "user": {"username": "Wil Perkins"}}, {"_id": "ss6srkJMMeExSdS5X", "postedAt": "2023-02-23T13:48:53.276Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Hey Tim, just want to say I really appreciate the honest response. We’ve butted heads a couple times on this topic and you rigorously stick to your values which I admire.</p>\n<p>I’ll echo what others have said in that the idea of using casual sex as a motivator to get people out to EA events makes me very uncomfortable. I agree that it’s probably a strong motivator when in play, but I’d rather we get people out because they are interested in the ideas presented.</p>\n<p>In the interest of intellectual rigor though, I’m fine with softer/different incentives like free food at events, non impact related activities, etc. I suppose sex seems more risky and messy than those other incentives but my thoughts here aren’t clearly formed yet.</p>\n<p>Weird aspie and poly people are absolutely central to what EA has done and how far we’ve come. Frankly I also just enjoy talking with them because those types of people tend to have novel ideas that are well thought out. That being said I don’t think that creating a soft norm of separating poly from EA would necessarily drive those people away.</p>\n<p>For instance, what if people in EA communities with a lot of poly folks created a separate meetup specifically for poly people? Or joined an existing one?</p>\n<p>For one this would make sexual issues in EA less abundant, and two would help people develop their identity/social network outside of EA. Not putting all their eggs in one basket, so to speak.</p>\n<p>On the EV side I agree with you that this is something which would be highly problematic and difficult to study rigorously, but I think it’s still worth looking at it from a lens of utility.</p>\n<p>My thought is that because casual sex / making people sexually uncomfortable is such a huge issue for the average person, if we can tone down that behavior a bit it will help us convince far more people to join EA. On top of that it would reduce scandals, and hopefully make decision makers more objective when giving grants or hiring.</p>\n", "parentCommentId": "Lgtw7cRW4p76XECCa", "user": {"username": "Wil Perkins"}}, {"_id": "JnGExmtJLLbQZZM32", "postedAt": "2023-02-23T13:54:52.973Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Is it true that other successful institutions generally have norms against dating within them? (I don't want to use the term \"sleeping around\", which feels derogatory in this particular context). My company  only prohibits dating people in your chain of command, and I am certainly aware of relationships within the company that have not caused any objections or issues that I know of. Though my company is tens of thousands of people, with thousands in my building, so maybe it doesn't qualify as tight-nit. I also haven't perceived any of my friend groups as having a norm against dating. Family seems obviously different, because there is that incest norm, and that impossibility of stepping away on the off chance that things go really badly. Though again, maybe you have a family with different dynamics - to the best of my knowledge, I've never met a cousin's spouse's anything. Anyway, point is, I don't think it's actually true that the rest of society operates this way.</p>\n", "parentCommentId": null, "user": {"username": "River"}}, {"_id": "8a42CJSf2xe2NzHWg", "postedAt": "2023-02-23T13:56:31.440Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I guess my objections to this are<br>-I think the median person's view of poly is like \"seems like a bad way to do relationships but also none of my business\" &nbsp;which is distinct from being weirded out by poly people</p><p>-I'm not trying to be a poly advocate, I'm trying to live a lifestyle which is poly? I object to you trying to discourage this on the grounds that discrimination is bad? Like i feel like you are saying \"it would be better for poly acceptance if<br>&nbsp;EA were less friendly to &nbsp;poly relationships\" which no?<br>&nbsp;</p><p>-A movement focused on 'doing the most good' is going to attract people with moral views pretty different to the median. We're not a political party, we are a social movement which naturally has people doing weird things in pursuit of its goals so I think it's good that we advertise ourselves &nbsp;as being tolerant of weird people?<br><br>&nbsp;</p>", "parentCommentId": "NsR4iDixEkqaNEBG2", "user": {"username": "agunning"}}, {"_id": "9fqrAgPSSBX5njTiL", "postedAt": "2023-02-23T13:56:59.887Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks for your perspective! I agree with OP that unfortunately many people similar to yourself either engage shallowly with EA or bounce off after they realize they’re being hit on a bunch. I’ve talked to a couple of people in my personal life who have expressed that exact issue when I tried to get them to join our local group.</p>\n<p>I’m surprised by the amount of people in the forum who basically react “too bad” to this idea. I hope we can get better and find a happy medium for people.</p>\n", "parentCommentId": "jpSXpzMWNLkhJrp65", "user": {"username": "Wil Perkins"}}, {"_id": "zCGBA6w2tgCrMZozH", "postedAt": "2023-02-23T14:00:07.232Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I agree with you here. I didn’t realize how dearly people held the ability to sleep around within the community. I do worry that this setup creates bad incentives where people who want casual sex are far more highly motivated to go out to in person events, which means a disproportionate number of any local groups may have quite a few people seeking casual sex.</p>\n<p>This is a very bad state of affairs for trying to grow the movement, especially if we want more “normal” people or women.</p>\n", "parentCommentId": "tFxutKdw6nqbaLFrh", "user": {"username": "Wil Perkins"}}, {"_id": "A2btxXBBRDj8LKtjt", "postedAt": "2023-02-23T14:02:02.376Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Could you clarify which two sets you’re seeing? A bit confused by this comment.</p>\n", "parentCommentId": "xamAuo7NEKthiTr7R", "user": {"username": "Wil Perkins"}}, {"_id": "Anaixsne3vheJ64Rb", "postedAt": "2023-02-23T14:03:12.100Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I’d say most people consider them fairly intimate. Also if drinks are involved and it’s an impromptu move to the hot tub, it can frequently turn into a nude experience. I can see that making many people uncomfortable.</p>\n", "parentCommentId": "f8mXd9yoEJ3oDi2js", "user": {"username": "Wil Perkins"}}, {"_id": "komNujoEDhL7KK3LN", "postedAt": "2023-02-23T14:08:56.428Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>A bit confused on your second point but my thinking goes like this - the more people we get to think rationally about morals relationships etc the better. This is urgent due to issues like value lock in.</p>\n<p>If we can get drastically more people overall to even care about morality or be open to changing their moral stances from rational argumentation, then yes that would be way better for poly acceptance! Even if on the margin there were less people in EA that are poly and/or having poly relationships in EA.</p>\n<p>Does that model make sense?</p>\n", "parentCommentId": "8a42CJSf2xe2NzHWg", "user": {"username": "Wil Perkins"}}, {"_id": "Z9B7FBXnRLnK7yxzJ", "postedAt": "2023-02-23T14:50:46.481Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote>\n<p>if i knew i wanted to hook up with someone i would simply tell them</p>\n</blockquote>\n<p>Even if you didn't know anything yet about whether they were interested in you?  That's a big part of what (mutual!) flirting accomplishes, no?</p>\n", "parentCommentId": "nEeqAJfzeixy2msPC", "user": {"username": "Jeff_Kaufman"}}, {"_id": "eAusjLg8RMWwae5Mr", "postedAt": "2023-02-23T14:55:13.068Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Varies by context and institution. In my experience, I don't perceive any norms  against \"serious dating\" of people of roughly equal rank, but a lot of casual sex with officemates would cause some people to question your judgment. Activities with someone outside of the legal department (I'm a lawyer) wouldn't raise any norm issues unless the other person was very senior.</p>\n", "parentCommentId": "JnGExmtJLLbQZZM32", "user": {"username": "Jason"}}, {"_id": "7wqDbBbNaCDmz8ikC", "postedAt": "2023-02-23T15:13:27.228Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>\"Subtle harms\" sounds like an escalation from \"awkwardness or uncomfortability\" but if we're talking about consensual adults acting in good faith I'd say these \"subtle harms\" are an inescapable consequence of normal social interaction.</p>", "parentCommentId": "jeviq4YuuTc7Cnm33", "user": {"username": "Jgray"}}, {"_id": "RLSajhcu9voD3kivx", "postedAt": "2023-02-23T15:25:59.440Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I agree with your points on poly culture. However, I find the suggestion that guys need \"a good reason\" to hit on women a bit bizarre.</p>", "parentCommentId": "wHWyAsQA6yF53EHJs", "user": {"username": "Jgray"}}, {"_id": "YGkcBYKAuiwfBzFnt", "postedAt": "2023-02-23T15:26:09.555Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Depends. I think if you’re going to a house party it’s cool. If you’ve just attended what you view as a professional conference, might be weirder/overly familiar (especially if you’re getting in a hot tub with people who might be important professional connections).</p>\n<p>I could be wrong. I know a mathematics professor who went to a math conference in Finland and they thought nothing of sauna-ing nude together, as Finns do.</p>\n", "parentCommentId": "f8mXd9yoEJ3oDi2js", "user": {"username": "Pynchon"}}, {"_id": "cf4aEvwqzdK2b54KN", "postedAt": "2023-02-23T15:30:22.213Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>One set says: OCB overstepped the mark severely, he should have known better, I am devastated, this is a huge problem that needs to be solved promptly at a community level. We need to kill our darlings, like polyamory and sleeping around in the community as a norm.</p>\n<p>Another set says: I refuse to accept any sort of restriction on who I flirt with/sleep with/date in the EA community, even a restriction that would have prevented OCB from having a flirty relationship with the woman in question.</p>\n<p>(I could be reading it all wrong; tell me what you see.)</p>\n", "parentCommentId": "A2btxXBBRDj8LKtjt", "user": {"username": "Pynchon"}}, {"_id": "bxLSnhonjnfT3A9ee", "postedAt": "2023-02-23T15:40:18.231Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>It makes sense to me - are you hitting on a given woman because you’re into them specifically, or just because you’re like ’woman: ✅, EA: ✅’</p>\n", "parentCommentId": "RLSajhcu9voD3kivx", "user": {"username": "bec_hawk"}}, {"_id": "XHDufaQbxk4bEQzRK", "postedAt": "2023-02-23T15:56:47.259Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think what I said about getting laid as an incentive to showing up was rather misunderstood. I'm not actually good at being precise, and this issue makes it harder for me to speak carefully.</p>\n<p>I'm drawing here on two core sets of background ideas, one is the ssc essay about the Fabian society, where it seems like one of the things that made them extremely effective was that the group meetings were an excellent place for people to meet a large set of their social needs (including finding marriage partners), and not just a place where they talked about socialism.</p>\n<p>The second is that I grew up in a church where one of the things everyone knew was that one reason young people went to church meetings was to meet other young Christians to date. This was part of why it worked as a cohesive community.</p>\n<p>Based on these models I expect communities where people form romantic relationships inside the community to end up more cohesive, more successful, and more functional in terms of their mission than communities where this is disallowed.</p>\n<p>Of course nothing here disagrees directly with the idea that 'sleeping around is bad.'</p>\n<p>I suppose I get to disliking that as a statement of a norm because it sounds (to me) sex puritanical, and because it is saying (in my head) that the members of our community are not adults who can make their own choices about how to live their lives and who to sleep with. And, frankly because of the whole context that makes me interpret things unchraritably.</p>\n<p>A norm of generally don't hit on newbies until they've been around for a while is probably good (though details in implementation matter!) .</p>\n<p>I think there is also a distinction between people like me who see EA primarily as a social organization built around a set of ideas, rather than those who see it as a professional network. The rules for a social network are, and should be different. But part of the strength of EA is that it is both, and unfortunately the two seem to be in tension (and not just around this issue - the whole who gets to go to EA global is another example of the same problem).</p>\n<p>I also suspect that EA without a social cloud around the professionals is dead in the long run, because the just here to hang out and talk people are where the money for those jobs come from (and if that view is correct, the way to make EA strongest in the long run is to make it a good social group, and hanging out with cool people where there is a chance you might meet someone to date really is almost always strictly better than the same social group where there is no chance of that).</p>\n<p>One last point: The current scandals are caused by visibility and maybe sbf. People out there are trying to attack EA by actively looking for the worst sort of true things they can say about the community. Taking what those attacks say as representative of the community is a serious mistake.</p>\n", "parentCommentId": "ss6srkJMMeExSdS5X", "user": {"username": "timunderwood"}}, {"_id": "G4CCoGvXSumPBunTk", "postedAt": "2023-02-23T15:58:19.397Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>we gatekeeping romantic attraction now?</p>", "parentCommentId": "bxLSnhonjnfT3A9ee", "user": {"username": "Jgray"}}, {"_id": "GuM77TfQdrpEmpL7h", "postedAt": "2023-02-23T16:17:33.808Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I'm sure some people find hot tubs a bit awkward and I'm sure most people (at least outside of EA) would find \"cuddle puddles\" a little strange. You'll never be able to please everyone, you gotta just live your life.</p>", "parentCommentId": "BdD3XqspxmEMxJdAj", "user": {"username": "Jgray"}}, {"_id": "jjKPAvdJZpFjq8b75", "postedAt": "2023-02-23T17:13:59.318Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yep I see that divide a bit myself, but I think it’s important not too rely on binary distinctions too much.</p>\n<p>My view is that there is a subset of groups/areas within EA that have much of their social lives and identities tied up in the movement. These seem to be the people defending flirting/dating etc.</p>\n<p>That being said a lot of them are the old guard, and have done and continue to do a lot of the best work in the movement. I think it’s important we try to find a reasonable compromise and reconcile these differences.</p>\n", "parentCommentId": "cf4aEvwqzdK2b54KN", "user": {"username": "Wil Perkins"}}, {"_id": "W7gJMpkjieExZWQYW", "postedAt": "2023-02-23T19:43:39.195Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think if more people followed the recommendations then the gender imbalance within the community would decrease. This might increase the number of primary relationships by more than the number of marginal relationships lost.</p>", "parentCommentId": "fdJYM6c2PwsGZpPNv", "user": {"username": "Patrick Sue Domin"}}, {"_id": "o6khmxNEm3Gem9Zyn", "postedAt": "2023-02-23T19:59:48.539Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>if you want to interfere with my private life to that extent there's a very strong burden of proof upon you</p></blockquote><p>That's why my advice was for people to consider it personally instead of suggesting a ban or something like that. For clarity's sake I think a top down ban would be bad, and I don't think anyone else is proposing a ban either.</p>", "parentCommentId": "pirCnNbXPjvQx5PZA", "user": {"username": "Patrick Sue Domin"}}, {"_id": "2XfPBCJecHJJ4fdfm", "postedAt": "2023-02-23T20:26:24.477Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think everyone agrees OCB overstepped (he's admitted as much) and people are of different opinion on how much blood they're after. &nbsp;</p><p>This, along with the time article, are seen as proof of a \"problem\" that needs a \"solution.\"</p><p>This thread offers a potential solution. &nbsp;It asks the question: would you be willing to enforce a taboo against (most?) heterosexual relationships in the community in order to almost totally eliminate sexual misconduct?</p><p>The overwhelming response is a resounding no. &nbsp;It doesn't appeal to anyone. &nbsp;Totally throwing the baby out with the bathwater.</p><p>There's a continuum: &nbsp;uncomfortable/awkward, inappropriate (misconduct), harassment, assault .</p><p>In the US at least, assault is criminal so that's the bare minimum amount of enforcement and done at the federal/legal level. &nbsp;OCB was accused of something between misconduct and harassments I think. &nbsp;I think everyone agrees that harassment and assault is bad. &nbsp;We would like to eliminate all misconduct but what is and isn't appropriate really becomes subjective quick. &nbsp;And as we've seen from this thread there is no appetite to project people from the merely uncomfortable.</p><p>So I don't think there is any \"solution\" because this isn't a problem that can be \"solved.\" Yes, we can always \"do better\" because the issue can never really 100% go away. &nbsp;The conversation should revolve around what the community's preferred trade-offs are.</p>", "parentCommentId": "cf4aEvwqzdK2b54KN", "user": {"username": "Jgray"}}, {"_id": "ZuxgYXdhbax5zgT4n", "postedAt": "2023-02-23T20:35:21.068Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>To push back on this slightly, I do think the [replace poly with gay] intuition pump works though I think I'll talk about [replace poly with Christian] so as to use a less contentious example. &nbsp;Imagine we found out that Christian EAs might be worse? Would we ask for a community-wide norm against them? I think the idea makes me pretty queasy.&nbsp;</p><p>My norm here is that to infringe upon people's liberty, you need to be much more certain than other kinds of proposals, perhaps that the benefits 5 - 10x the harms.</p><p>I am not sure of that in this case, and I don't think anyone other than <a href=\"https://forum.effectivealtruism.org/users/haydenw?mention=user\">@HaydenW</a> has attempted a quantification of this. I don't think we know what women in EA want, let alone EAs in general.&nbsp;</p><p>And likewise I think I could make a utility case, that we are trying to think clearly about things and that we are going to run into culture war concerns eventually and that we should learn to think well about them. I'm open to being wrong her, but while \"politics is the mindkiller\" if you get big enough, you need to engage with politics and at that point, having engaged positively with mindkilling topics might be positive.</p><p>All this said I'm pretty open to the idea that we should insitute such a norm (against kinds of casual sex) but I think we should be much more confident than we are and I'd like to see some number and what a representative sample of EAs/possible EAs think.</p>", "parentCommentId": "duTzpKhSKRij2YHtR", "user": {"username": "nathan"}}, {"_id": "afWAFvvPmHfkHD9zj", "postedAt": "2023-02-23T20:37:48.801Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>We already have tons of implicit norms that ask different behaviours of men and women, and these norms are the reason why it's <i>women </i>coming forward to say they feel uncomfortable rather than men. There are significant differences in how men and women approach dating in professional contexts, see power dynamics, and in the ratio of men in powerful positions versus women (as well as the gender ratio in EA generally). Drawing attention to these differences and discussing new norms that ask for different behaviours of men in these contexts (and different behaviours from the institutions/systems that these men interact with) is necessary &nbsp;to prevent these situations from happening in the future.</p>", "parentCommentId": "LTYPz3SLPyHFHotii", "user": {"username": "S.E. Montgomery"}}, {"_id": "PbmnuMSBS6TKcCkZf", "postedAt": "2023-02-23T20:59:11.169Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>I feel like there's some implicit claim that only a subset of people (socially awkward men?) aren't romantically perceptive</p></blockquote><p>I don't think that's true and I think all the claims on the next list are much more likely true and more relevant to the argument:</p><ol><li>On average men are more likely to be more assertive or aggressive when pursuing women than when the roles are reversed</li><li>On average women are more likely to be creeped out by being the target of unreciprocated sexual interest from a man than when the roles are reversed</li><li>On average women worry much more that rebuffing a man could lead to him getting angry and yelling at her than the other way around</li><li>On average women worry about being physically overpowered by a man <i>much</i> more than the other way around</li><li>On average if someone is trying to actively display uncomfortability with a situation in a subtle way, women are more likely to pick up on this than men are</li><li>On average women are more likely than men to find it very uncomfortable when subtle hints of uncomfortability are ignored</li></ol><p>I'm less confident in 5 and 6 than 1-4, but I think the argument works even if those are ignored.</p><p>I also think the gender imbalance is important here. If men outnumber women in EA <a href=\"https://rethinkpriorities.org/publications/eas2020-demographics\">by around 5 to 2</a>, then if everyone pursues X people of the opposite gender, the average man will be pursued by 2X/5 women and the average woman will be pursued by 5X/2 men. That's the difference in being pursued by 2 people at the same time and being pursued by 12 or 13 people at the same time. Whatever harms there are are magnified very much for the women, in addition to each instance possibly causing more average harm when it's towards the women due to points 1-6 above. Also simply being pursued by so many people in itself can be exhausting (I think breadthofdebate's <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=jpSXpzMWNLkhJrp65\">comment</a> demonstrates this point). Even if there's no \"bad behaviour\" and being pursued by one or two people is exciting and an ego boost, being pursued by a dozen might instead be demoralizing.</p>", "parentCommentId": "aBksqTRnReFrdTLxk", "user": {"username": "Patrick Sue Domin"}}, {"_id": "Xhisyx6CQHAEyswBM", "postedAt": "2023-02-23T21:13:47.953Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think you're misstating what the post actually says, but&nbsp;</p><blockquote><p>The overwhelming response is a resounding no</p></blockquote><p>seems wrong. The one <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=uSuSWAwqnHcecKjTw\">poll</a> shows overwhelming support for the recommendation.</p><p>I think the side that doesn't want to give up sleeping around is being louder in the comments but if you look at agreevotes of the more prominent comments on each side, the side that's <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=duTzpKhSKRij2YHtR\">agreeing</a> with this post is seeing much more support than the side that's <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=dKTibbe7mwoGW3T9S\">against</a> it.</p>", "parentCommentId": "2XfPBCJecHJJ4fdfm", "user": {"username": "Patrick Sue Domin"}}, {"_id": "xAwnKKs3iCSR9yrns", "postedAt": "2023-02-23T21:21:10.729Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Ah, <a href=\"https://en.wikipedia.org/wiki/Silent_majority\">the silent majority</a> and <a href=\"https://tvtropes.org/pmwiki/pmwiki.php/Main/VocalMinority\">the vocal minority</a>.&nbsp;</p>", "parentCommentId": "Xhisyx6CQHAEyswBM", "user": {"username": "Milan_Griffes"}}, {"_id": "FeiM2LHng3586KShN", "postedAt": "2023-02-23T21:30:32.894Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think using \"dating\" as synonymous with \"casually sleeping with\" is not a great choice since there is the option of <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=Nrva3ARxrjXfdidvu\">dating people while holding off on sleeping with them</a>. I think companies tend to have prohibitions when there are direct conflicts of interests but there are usually also more informal norms against casually sleeping with coworkers outside of that, unless it's a huge company that isn't tight-knit at all.</p>", "parentCommentId": "JnGExmtJLLbQZZM32", "user": {"username": "Patrick Sue Domin"}}, {"_id": "3cj2jsFxqWpbkpeYo", "postedAt": "2023-02-23T21:32:16.567Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I mean I think if you're attracted to like 90% of women you shouldn't be DMing 90% of women \"you up?\"<br><br>but like a friend or someone you have a crush on? my view is they're an adult and can handle hearing this and there are an astonishing number of ways people can screw up which are prevented by doing this ASAP</p><p>like if you look through the comments women are more saying \"guys do X to try to sleep with me but retain plausible deniability for doing so when I would really just like to do X for its own sake\" and less \"hearing that guys are interested in me is an infohazard\"</p><p>i think a lot of guys are rationalising about this out of a fear of getting rejected when the point is they should be making it easy to reject them.</p>", "parentCommentId": "Z9B7FBXnRLnK7yxzJ", "user": {"username": "agunning"}}, {"_id": "3kAwyWY9ymPijjnbm", "postedAt": "2023-02-23T21:32:33.663Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yes, this is a different person. I chose a pseudonym with a different first name than my real first name for the obvious reason.</p>", "parentCommentId": "WgxxeRtDXsHFzZDYm", "user": {"username": "Patrick Sue Domin"}}, {"_id": "D37dDtyGQw4vTtshr", "postedAt": "2023-02-23T21:35:05.161Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>i mean i don't really understand baseline male sexuality but like, you should be genuinely curious as to what's in someone's head to do this?<br>idk?</p>", "parentCommentId": "G4CCoGvXSumPBunTk", "user": {"username": "agunning"}}, {"_id": "qrzGsCi3tGSPR87jv", "postedAt": "2023-02-23T21:45:13.603Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Is anyone suggesting a \"community-wide norm against\" any particular group of people?</p>\n<p>The original post's recommendation has a disparate impact on different groups, which is relevant but not the same as a group-targeted norm.</p>\n", "parentCommentId": "ZuxgYXdhbax5zgT4n", "user": {"username": "Jason"}}, {"_id": "w6jaWE5F6bwfJhxge", "postedAt": "2023-02-23T21:48:34.504Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Perhaps consider minding your own business about whether or not consenting adults sleep together.</p>\n", "parentCommentId": null, "user": {"username": "justsaying"}}, {"_id": "MqbyKTdHFr4Tqiig5", "postedAt": "2023-02-23T21:55:19.402Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I mean this proposal is a conjuction of a lot of recommendations some of which seem reasonable some of which seem unreasonable to me, so I abstained ?(despite being against discouraging casual relationships more broadly)</p>", "parentCommentId": "Xhisyx6CQHAEyswBM", "user": {"username": "agunning"}}, {"_id": "LhwmmMCdcRnhcZmoG", "postedAt": "2023-02-23T21:58:31.026Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think if we can reliably target the impact of a change then it is a targeted change. Perhaps that's good, as I say, I am okay with targeted changes. But this <i>is</i> fundamentally a bit like changes targeted at other groups and our intuitions carry over, I think.</p>", "parentCommentId": "qrzGsCi3tGSPR87jv", "user": {"username": "nathan"}}, {"_id": "qi4hytaXjhNGTgrCa", "postedAt": "2023-02-23T22:03:32.475Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>differences in sex drive are about as large as gendered differences get, I think.<br>i suspect that the difference in comfort is less that women have better social skills<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefgqeeo2q13l7\"><sup><a href=\"#fngqeeo2q13l7\">[1]</a></sup></span>&nbsp; than that they have the moral luck that the median man is happy to sleep with the median woman and that they are ~less physically threatening or something.<br>(add 'on average\" to all of the above)</p><p><br>i suspect differences in ~romantic attraction are much smaller, it's just that secondary relationships ... are romantic relationships? idk about all the stuff monogamous people do.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fngqeeo2q13l7\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefgqeeo2q13l7\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I think the human social skill default is we assume other people are like ourselves</p></div></li></ol>", "parentCommentId": "cy9n8bAqKQrdTiyfs", "user": {"username": "agunning"}}, {"_id": "cGCiyuoNcvm9Scmmj", "postedAt": "2023-02-23T22:04:03.321Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>You think that dating a coworker or whatever without sleeping with them is less likely to cause problems than the reverse? That does not ring true to me at all. It does ring of Christian purity culture, which I would not have expected to encounter in EA.</p>\n", "parentCommentId": "FeiM2LHng3586KShN", "user": {"username": "River"}}, {"_id": "AjdzzrPZ3EpNxdyoe", "postedAt": "2023-02-23T22:19:10.377Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Being able to have the kind of valuable interpersonal connections that are good for me (i.e. poly relationships) is just more important to me than EA is. It's just one of my hobbies, and I'm not interested in subordinating my life to norms within them interfere with good parts of my life. EA does select for people who are unusually value-aligned with me along some axes, which is important to me romantically, but if it becomes less accepting of poly / more conventionally conservative, I'll be less aligned with the resulting community and will likely leave and focus on other interests.</p>", "parentCommentId": null, "user": {"username": "burner1"}}, {"_id": "AjtgTWY7SkxvKdHCq", "postedAt": "2023-02-24T00:44:42.572Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Wanted to comment that, as a woman quite involved in EA, I relate to your post. I didn't initially find being hit on that demoralizing, but as time progressed I've been feeling more and more like many men in EA are simplifying a good chunk of my existence to my appearance, and this has severely harmed my view of myself. I have consciously stepped back from the community so I can remind myself that my value is not in my sexual appeal, and build my self-esteem back up. Ironically, in some ways, being involved in the community (as opposed to holding EA ideals from afar) has made me less focused on impact and more focused on sexuality. I still find the community valuable and want to continue engaging in it, but I can also absolutely see why many women would completely cut themselves off after the experiences I have had.&nbsp;</p>", "parentCommentId": "jpSXpzMWNLkhJrp65", "user": {"username": "Masha Winchell"}}, {"_id": "hTH8kC8qfgGHJCvMn", "postedAt": "2023-02-24T01:11:38.317Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I'll reiterate that I'm not saying being poly is bad or that you should have to stop being poly if you want to be in EA. The point is closer to \"don't dip your pen in the company ink\" (though not that extreme) than \"don't dip your pen at all\".</p>", "parentCommentId": "AjdzzrPZ3EpNxdyoe", "user": {"username": "Patrick Sue Domin"}}, {"_id": "RrXnhNvapD22hEP5F", "postedAt": "2023-02-24T02:45:51.733Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>The main communities where I want to date are EA and EA-adjacent ones, though. It's not much of a concession if I can only be poly with outsiders I tend to not be interested in, and not with people from this well-selected, higher baseline compatibility population.</p>", "parentCommentId": "hTH8kC8qfgGHJCvMn", "user": {"username": "burner1"}}, {"_id": "xxcbiBvetcjLhD7zN", "postedAt": "2023-02-24T05:00:06.637Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>You're absolutely right, I missed that poll. &nbsp;Thanks for pointing it out.</p><p>It has very hedged language: \"strongly recommend considering refraining\" which might technically make the poll totally silly but I imagine people voted on the view the poll was representing (I mean, technically who would vote against just 'considering' something?).</p><p>I don't know how to initiate polls. &nbsp;Would love to see one broken down by gender and self-reported \"status\" in addition to the equivalent recommendation with gender-neutral language. &nbsp;It takes two for each instance of \"sleeping around\" after all.</p>", "parentCommentId": "Xhisyx6CQHAEyswBM", "user": {"username": "Jgray"}}, {"_id": "obfsJbps9riKwbZGS", "postedAt": "2023-02-24T05:13:50.993Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think the best way to think about it is that the typical male's sexual desire is axiomatic.</p>", "parentCommentId": "D37dDtyGQw4vTtshr", "user": {"username": "Jgray"}}, {"_id": "RGHAXppfpkhgpygTB", "postedAt": "2023-02-24T06:50:12.121Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks for the answer! After reading your comments, I'm a bit confused now - I'm not sure if I misinterpreted your post heavily, but we agree on some points, or I red your post correctly and we still disagree.&nbsp;</p><p>As for you being emotional, yes, I assumed that based on your answer, but shouldn't have done so, I'm sorry.</p><p>It would be helpful for me to understand, if you agree with the points below:</p><ol><li>You should consider not engaging in \"random\" and not \"well thought through\" sexual activities within the community at all</li><li>This especially holds if you a) are a cis het men b) you know you are not a master of reading social interactions c) you are in any position of power - even if you are not a direct supervisor of a person&nbsp;</li><li>In those settings relationships in which a person you sleep with is your \"the most, and if you are poly - only special person\" with whom you have a very deep connection are still fine.<br><br>This is how I understood your post, and I have multiple reasons to disagree with all points and regard them as problematic.&nbsp;<br><br>I would agree with:<br>1. You should strongly consider not engaging in \"random\" and \"not well thought through\" sexual activities within the community with anyone towards whom you are in a direct position of power.&nbsp;<br>2. While engaging in any random or not well thought through activities, please: a) if you are not a master of social interactions, do your best to learn mechanisms which prevent harm b) if you are in a position of power in EA in general, never ignore this dynamics and learn how to address it. If you are much older than the person you hook up with, remember - even if they seem mature, you are in a position of power. If you suspect you may fail to understand somebody's boundaries, stop engaging in random encounters immediately and go ask for help. This is a skill which can be learned. c) if you are not in a position of power, do your best to learn how to clearly and assertively state your boundaries. If you suspect that you'll have trouble doing that, stop engaging in random encounters immediately and ask for help. This is a skill which can be learned.&nbsp;<br>3. Poly relationships pose a set of different challenges than monogamy and our general culture provides very little guidelines on how to do them well. If you are engaging in a complex polyamorous dynamics, make sure you have mental space to do so appropriately. Take social misconceptions about polyamory and metaamorus dynamics into consideration. They can be hard, so if you are not ready to take it, consider possible monogamy/address your concerns in a safe setting.&nbsp;<br><br>In the same time, I strongly acknowledge that people have right to make mistakes and sexual interpersonal interactions are difficult and sexual usually full of emotions, so there will be conflicts, misunderstandings, mistakes. I believe no social or religious rules on the world change that, \"a culture of being more modest \" certainly doesn't. Education, communication, empathy and emotional maturity from both sides on the other hand, works wonders. So I'd like to see more of that within the community.&nbsp;</li></ol>", "parentCommentId": "Z4a5hdwtjpCpG5f8J", "user": {"username": "Liv"}}, {"_id": "LkW9MXgcTZPjrDwZZ", "postedAt": "2023-02-24T07:07:18.983Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Also, just so you know, I am going to discuss under this post today, but after that I am making a major break from discussion on the forum for some mental health :). So I may not answer to your comments.</p>", "parentCommentId": "Z4a5hdwtjpCpG5f8J", "user": {"username": "Liv"}}, {"_id": "4WbsikYEmLXYSeHWN", "postedAt": "2023-02-24T07:47:13.826Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I don't have many strong opinions on this topic, but one I do have and think should be standard practice is recusing oneself from decisions involving current or former romantic partners.</p>\n<p>That means not being involved in hiring processes and grantmaking decisions involving them, and not giving them references without noting the conflict of interest. This is very standard in professional organisations for good reason.</p>\n", "parentCommentId": null, "user": {"username": "Charles_Dillon "}}, {"_id": "tfCTyJRKkCbjtiGM7", "postedAt": "2023-02-24T13:58:32.925Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks for the explanation <a href=\"https://forum.effectivealtruism.org/users/jeff_kaufman?mention=user\">@Jeff Kaufman</a>. My inclination is that under the 3 criteria laid out above, I'm not sure marginal cases would be very many at all. Most relationships could still move on unhindered, even after a short conference meeting. &nbsp;But &nbsp;it's &nbsp;quite a wild guess I could be way off in this estimation especially not having attended EA events to observe these things first hand. I'd probably trust your judgement above mine here.</p><p>Also interesting point Patrick maybe!</p>", "parentCommentId": "W7gJMpkjieExZWQYW", "user": {"username": "NickLaing"}}, {"_id": "39a38jW7s6Jwmeykp", "postedAt": "2023-02-24T15:09:39.548Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote>\n<p>I could be way off in this estimation especially not having attended EA events to observe these things first hand. I'd probably trust your judgement above mine here.</p>\n</blockquote>\n<p>I wouldn't recommend that ;)  I haven't been to an EAG since 2018 and don't have much personal experience with people trying to get together at events.</p>\n", "parentCommentId": "tfCTyJRKkCbjtiGM7", "user": {"username": "Jeff_Kaufman"}}, {"_id": "SgtgdYwcvCrFJz9Rb", "postedAt": "2023-02-24T16:57:18.246Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>You're reading more into my comment than I intended. I don't disagree with you - I was just correcting what I believed to be a wrong deduction. If we try to create new norms, it's good to make sure that we have accurate trade-offs in mind.</p>", "parentCommentId": "FcgPd9pavhLMDWurW", "user": {"username": "lb_rv"}}, {"_id": "fwEihSDbfAmCbSy3s", "postedAt": "2023-02-24T17:47:48.320Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I totally agree with the gist of your comment t but as far as gendered differences go physical strength/size is almost certainly &nbsp;larger than differences in sex drive. &nbsp;That absolutely implies the probability a woman feels physically threatened by a man is much, much higher than the probability a man feels physically threatened by a woman. &nbsp;</p>", "parentCommentId": "qi4hytaXjhNGTgrCa", "user": {"username": "Jgray"}}, {"_id": "MJpvRZJwHs8YehszM", "postedAt": "2023-02-24T19:47:54.334Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>\"<i>I especially think people should consider refraining from sleeping around within EA if they have two or more of the following traits- high status in EA, a man who sleeps with women\"</i></p><p>Another \"progressive\" fighting the good fight for gender equality and against double standards I see...</p>", "parentCommentId": null, "user": {"username": "Alexander_Turok"}}, {"_id": "ixzJo37uAzAMWMzbt", "postedAt": "2023-02-24T20:36:40.776Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I don't think this is coming from either a leftwing or a rightwing angle. There are aspects that are more progressive and aspects that are more conservative, but the motivation is more pragmatic about how to improve the community than about trying to advance either \"side\".</p>", "parentCommentId": "MJpvRZJwHs8YehszM", "user": {"username": "Patrick Sue Domin"}}, {"_id": "iKuDC5NkiqybjuWKa", "postedAt": "2023-02-24T20:48:53.198Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>It reads like progressive/feminist/woke advocacy. If you're saying it's not, can you give an example of an issue on which you disagree with the progressive/feminist/woke viewpoint?</p>", "parentCommentId": "ixzJo37uAzAMWMzbt", "user": {"username": "Alexander_Turok"}}, {"_id": "pKvBbMiqBaABFnauB", "postedAt": "2023-02-24T21:38:40.094Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>idk man I feel like I'm pushing back on this from something close to a mainstream sex-positive feminist viewpoint? the left is not homogeneous?<br>&nbsp;</p>", "parentCommentId": "iKuDC5NkiqybjuWKa", "user": {"username": "agunning"}}, {"_id": "QhYxSHHav7xx3GD7J", "postedAt": "2023-02-24T22:18:09.039Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>tbh I always feel slightly like I want to push back when people say \"polyamory is this thing that's new and untested and that our culture does not have well established guidelines for\"<br><br>like, poly feels pretty intuitive to me from being somewhat immersed in poly culture, it's just that I don't think the norms have seeped out into the mainstream yet? Sure, the way people do poly is pretty heterogeneous but the same is true of monogamy?<br>&nbsp;</p><p>I think I do want to urge people to be &nbsp;cautious if they don't feel entirely comfortable with it/ don't feel like they <i>get</i> the norms, or it feels like they're trying to work it out from first principles. But 'this seems as simple as any other relationship structure' is a state that it's possible to get to<br>&nbsp;</p>", "parentCommentId": "RGHAXppfpkhgpygTB", "user": {"username": "agunning"}}, {"_id": "RhYAn5pSAec94Kd7Y", "postedAt": "2023-02-24T22:54:50.589Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I think the issue with \"consider\" is that like, I suspect most of the people who <i>should</i> be considering this will not<br>and I'd rather give more actionable/precise advice than this for people who are like, struggling with scrupulosity or whatever.</p><p>also the issue that people saying \"hey that sexually nonnormative thing you're doing consider not doing that\" a lot does create a hostile environment</p>", "parentCommentId": "o6khmxNEm3Gem9Zyn", "user": {"username": "agunning"}}, {"_id": "NQRAZpZaEyEhCmMn9", "postedAt": "2023-02-24T23:44:38.576Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>I suspect most of the people who <i>should</i> be considering this will not</p></blockquote><p>I think if you're focused only on reducing sexual assault then your point makes sense (I don't think an abuser will read my post and think \"oh okay I won't assault people then\"), but I think if you're focused on things like reducing the extent to which EAs feel pressured or creeped out by being subjected to certain behaviours then it's still helpful for people who are not the \"worst offenders\" to avoid these behaviours. I think both are problem worth addressing and other mechanisms are needed to address sexual assault.</p>", "parentCommentId": "RhYAn5pSAec94Kd7Y", "user": {"username": "Patrick Sue Domin"}}, {"_id": "N3ijxXTKMBseGQbuh", "postedAt": "2023-02-25T00:12:08.445Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>If you're saying it's not, can you give an example of an issue on which you disagree with the progressive/feminist/woke viewpoint?</p></blockquote><p>I've downvoted this comment. It's not explicitly against the forum norms (maybe <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_think_is_useful__but_not_as_crucial_as_the_strong_norms_:~:text=Other%20behavior%20that%20interferes%20with%20good%20discourse\">this</a>?), but my personal view is that comments like these feel like you're asking someone to prove their tribe, and are divisive without being meaningfully useful.</p><p>I think if you are making a claim that this reads like progressive / feminist / woke advocacy, the burden of proof is on you to support your claim (i.e. it's more helpful to provide excerpts from the post that you think are poorly worded or read like they seem like an advocacy piece). Otherwise someone else can come along and just say \"Ok sure, I don't think this reads like progressive / feminist / woke advocacy\".</p><p>I think a charitable interpretation of your question is that you want to know if the author is \"non-progressive / nonfeminist / nonwoke\" in order to help you decide whether this post is in fact advocacy that advances those political aims. But I don't think asking this question is even helpful for that? Perhaps they share some views on the pay gap or minimum wage or intersectionality. How do the author's position on these reliably show whether this post is \"progressive / feminist / woke advocacy\"? It just also risks going down a completely unrelated discussion. In any case, given this is a pseudonym, they could literally just lie about a position.</p>", "parentCommentId": "iKuDC5NkiqybjuWKa", "user": {"username": "bruce"}}, {"_id": "2YgZvqxn5Es5cKTCm", "postedAt": "2023-02-25T01:42:24.363Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>hrmm<br>I think the awkward thing here is 'socially awkwards around romance and inclined to listen to you' is going to correlate pretty well to 'single , insecure +not terribly sexually experienced' which is going to correlate with 'will and maybe should be seeking out a serious relationship anyway'<br>so I think Owen here is kind of the unusual case as someone in this demographic 'sleeping around'<br><br>or something&nbsp;<br><br>and I can see lots of ways increasing the ambient level of sex-negativity is going to make these people worse/more socially awkward about approaching people<br><br>also for poly &nbsp;guys starting out being a secondary partner seems like a good way to get some experience without being too subject to the gender ratio problem</p>", "parentCommentId": "NQRAZpZaEyEhCmMn9", "user": {"username": "agunning"}}, {"_id": "e88r7wmmmtRfW3L3T", "postedAt": "2023-02-25T02:47:14.109Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>The point of the top-level comment is that \"progressives\" commonly claim to be against gender discrimination and double standards, and then immediately call for gender discrimination and double standards targeted against men.&nbsp;</p><p>Perhaps I made a mistake in assuming the author was Left-wing, though I have trouble imagining that any kind of conservative, libertarian, or right-wing populist writing the piece. Could you?</p><p>Perhaps you think this is derailing discussion by introducing \"politics\" into a \"non-political\" topic. But to me this whole question is \"political.\" It doesn't involve narrow government policy questions, but it's related to the whole Left-Right culture war that began at least around 2012, if not earlier. Denying that seems like missing the forest for the trees.&nbsp;</p><p>I can understand wanting to avoid people behaving \"tribally\" and encouraging them to think through each issue individually instead of mindlessly adopting all the views of their \"tribe.\" But the bottom line is this: there seems to me to be a large group out there who say they think gender equality is a paramount value but actually think gender discrimination is fine so long as women aren't the ones being targeted. Whatever you want to label them progressive, feminist, woke, etc., they seem to exist. How should I bring up the issue without being too divisive or info-hazardy?</p>", "parentCommentId": "N3ijxXTKMBseGQbuh", "user": {"username": "Alexander_Turok"}}, {"_id": "vMTekFx5qTE3WFysA", "postedAt": "2023-02-25T03:25:32.551Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I had an implicit 'psychological' in my head when i said 'sex differences', thanks for pointing that out :)</p>", "parentCommentId": "fwEihSDbfAmCbSy3s", "user": {"username": "agunning"}}, {"_id": "epryG6eWq9hG3nrLd", "postedAt": "2023-02-25T03:29:32.801Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Telling people to \"consider not sleeping around\" does not sound like a classical left-wing position to my American political ears.</p>", "parentCommentId": "e88r7wmmmtRfW3L3T", "user": {"username": "Jason"}}, {"_id": "tnrYkSc9WmozYZxko", "postedAt": "2023-02-25T18:40:43.442Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I still mostly agree with this sentiment, but after having been poly for 8 years, I agree with it a lot less than I used to. I think poly can be very easy, and also that there a lot of pitfalls that I didn't predict until I found myself in them. I've made significant mistakes as recently as a year ago that changed my mind about how to best approach things like jealousy and commitment.</p>\n<p>Some specific ways I've changed in the last couple years: I've become more willing to change or limit my own behavior in response to my partners' insecurity (while still dispreferring \"rules\"), err towards proactively having explicit conversations with all my partners as my feelings change or develop over time, have a higher bar of interest for starting relationships than I used to, and lean more towards breaking up over \"de-escalating\" with ex-primaries (but not in all situations). I wish I'd had some of these models earlier -- I could have avoided hurting some people I cared about -- but I do think they were hard to learn without experience.</p>\n<p>I'm sure I'd have had a different set of relationship lessons to learn if I'd been monogamous for 8 years; I don't think monogamy is simple either! But I also think some of the complex situations where I was most likely to hurt others were specific to polyamory (for example, wanting to \"switch primaries\" while still dating my previous primary).</p>\n<p>ETA: still largely agree with you that it's very possible to get to the point of \"this seems as simple as any other relationship structure\", especially if you're in a pretty stable relationship configuration, or if you and your partners are all pretty chill / ok with fluidity of time and commitment</p>\n", "parentCommentId": "QhYxSHHav7xx3GD7J", "user": {"username": "Samira"}}, {"_id": "rCmvmDSbb8aNSkniw", "postedAt": "2023-02-25T19:06:46.454Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I'm not Jeff, but this example made me think you were calling for avoiding all but the most serious / \"the one\"-type relationships:</p>\n<blockquote>\n<p>Bob is polyamorous with multiple people, including Alice, AND Alice is not his primary</p>\n</blockquote>\n<p>Avoiding this <em>would</em> prevent a lot of really good (and serious!) relationships in this community. Many secondary relationships are serious and strong and long-lasting, and some primary relationships start out as secondary relationships. Conflating \"secondary relationships\" with \"sleeping around\" seems really mistaken to me.</p>\n", "parentCommentId": "Nrva3ARxrjXfdidvu", "user": {"username": "Samira"}}, {"_id": "4GzCArdmR25uLdvKD", "postedAt": "2023-02-26T05:40:52.983Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>[This comment has been heavily edited since it got a response]</p><p>[So, I'm responding to a comment asking for the utility case about casual sex and poly. But I realized I focused exclusively on consensual casual sex within the community because that is the only piece I view as possibly worth engaging with, and it is what the post is about. I don't have notable-feelings about in-company relations or COI relations so I wouldn't go out of my way to defend them, and I do NOT think anti-poly-feelings hold water so I'm not wasting my time on that. There is no reason to feel the need to defend polyamory on ethical grounds. It's as ethical as monogamy, period. That said, I <i>will</i> push back on the lumping together of poly and casual sex in the first place. In my mind, the people who have the most casual sex historically have been like... college kids and people between relationships. These are both groups who will probably end up in monogamous relationships for life. I really don't get why people conflate casual sex and poly. Casual sex and open relationships? Sure, that's kind of their thing. Casual sex and single people (both mono and poly)? Sure, that's how a lot of modern dating gets started and how people blow steam off when they aren't ready for a relationship. Casual sex and in-relationship poly people? I'm not sold because each relationship has its own rules and for the most part people do go on dates and think carefully of where to spend their time, time which is limited greatly by already having a partner.]</p><p>Why do you think casual sex is bad for utility of the movement? It actually doesn't go without proving. I admit that was my intuition too, when I started thinking about it. But tbh after considering the other hypothesis equally (my gf <i>facetiously</i> was like \"lmao EA is really gonna lose what it has going for it without sexual freedom\" and I went \"wait what\" and thought about it), I have changed my mind.</p><p>So anyway I'll make the \"sexual freedom within community is good for utility\" argument:</p><p>[At first glance and often in practice,] EA is either (pick your poison): (1) a doomery apocalypse cult or (2) a morally strict self-flagellating mass of tithers and minimalists. On the other hand, we do poly and flexible sexual connections and those of us who are engaged in those things will even try and help you figure out if it's for you. Poly is fun<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefcdxeithzrym\"><sup><a href=\"#fncdxeithzrym\">[1]</a></sup></span>. Sex is fun. Play and curiosity are fun. These are some of the major fun things our community does have going for it when comes to hedonism [and utopian way of life, over the rest of society.]</p><p>[I want to clarify the term \"fun\". I'm afraid that people will think that \"fun\", cuz it's a one-syllable word used by children, is a trivial experience. It isn't. It's a complex experience pairing joy with surprise and with acute presence and focus in the world and with lightness of being. Fun is the ultimate \"being in the present moment joyfully\" experience. It's basically the hedonic holy grail.]</p><p>I'm also, in thinking it aids impact, not talking about using sex as a lure to get people out to events or something. I'm talking about making the lifestyle sustainable and nice and liberating for the people in it. Increasing connection. Increasing joy and laughs. Sex is something special and it leads to special things, not just moans and groans. Even if you do it casually it leads to special things. It's a shortcut to connection. [More than sexual connection--I mean real human-to-human connection that comes after you've engaged intimately. Then a new type of interpersonal comfort emerges. This is very similar to the point made in the top comment of this post, but I'm trying to explain the mechanism and ground it so people who have not experienced it can see it as real and these types of casual explorations as inherently valuable. You know it yourself if you have ever had a new friend who you have stayed up all night with after hooking up, or who, the new hookup opened space in your friendship for increased texting/memesharing/asking each other big questions about the world/etc. I even know one couple in the animal welfare sector who I think are now engaged whose relationship started out with casual sex: they went on a date but it was really lame according to them and they had \"no chemistry\". But they (consensually and both knowing what it meant to go back to someone's place after a date) decided to go back to his and have a one-night stand anyway. Yano for kicks, in a may-as-well-get-some-pleasure kind of way. But then something shifted after they hooked up and they pulled an all nighter talking together. At least, this is what they told me (and some others around). As I say, IIRC they are now engaged, but either way they have been in an enriching relationship for 3+ years now which they surely treasure deeply and which has surely helped with their animal welfare impact.]</p><p>Now the apocalypse thing: Many EAs especially want this interpersonal connection shortcut and freedom when a lot of us are afraid we don't even have that many years left on this earth even. I'm sorry but I'm already hearing friends talk about reducing their interest in AI safety work because they want to cross things off their bucket list before we all die. People are literally spending down their retirement accounts and we've just begun to see real worrying AI progress. You make EA and longtermist spaces sex-negative,and I'm just not sure people are gonna keep giving it their all til the end. We may see darker nights ahead than we are now and yet those nights might still have hope and we wouldn't want people to leave EA the way normies will be flocking away from corporate jobs and stifling culture. Who keeps their 9-to-5 when the world ends ~next month? Nobody. They go and hang out with their loved ones. This will sound dramatic at first glance. But I'm not saying people will leave EA as soon as it becomes more sex negative, I'm saying that the more sex-negative EA becomes, the lower the critical mass of dread is required to abandon your post.*</p><p>Now the tithing, self-flagellation thing: Let's be real, getting involved in this community has been known to prompt onset of a lot of burnout at best and serious mental health struggles at worst. [And this might unfortunately be a bug of the philosophy. It might be stifling by nature, at least in early stages. Read the section \"Bad\" EAs Caught In a Misery Trap\" here: <a href=\"https://michaelnotebook.com/eanotes/\">https://michaelnotebook.com/eanotes/</a> So, firstly, I don't want EA to become more stifling than it already can feel, or not more stifling in a way that actually <i>feels</i> stifling (there are other norms we could adopt). This seems bad for the weirdos in it (and yup we are basically all weirdos for now). Second, the more deep connections people make with eachother in the beginning (and I argue connections are shortcutted via consensual sex, these are adults after all), the more help people can get moving from [early EA full of shame] to [experienced EA happy to make tradeoffs and prioritize their own wellbeing]. This was actually my experience. I came into EA a hardcore minimalist who was using my altruism obsession to suppress myself, so much so I was really ineffective. Then after hooking up with a certain EA which led to to-this-day friendship and an ongoing romantic relationship at-that-time with that EA, I ended up witnessing how to do EA more sustainably from that person and their friends. It was a big relief, at first I could hardly trust that it was morally okay to say, order random things on amazon or go out for fancy dinner or hire a house cleaner, I had so shamed myself about altruism and money. I think I'd have learned anyway how to make my altruism more sustainable and efficient (I'd have had to), but getting consensually involved with one person who knew the rhythm of it all probably helped me skip a lot of guilt and just move forward faster.]</p><p>That we are all high in the \"openness to new experience\" personality trait, and nonjudgmental about alternative lifestyles including dating styles, actually matters too. I think few people are gonna want to sign up to EA if it's also a constant HR meeting with the same \"you can only bring one partner to the Christmas party\" vibe. The people who stick hardest to EA are the weirdos and the people with a healthy distrust in authority and prescribed standards. Despite the ivy league outreach, I think that remains the case. For people like that, social scripts just raise question marks and side-eyes, and seem unhealthy. We want to attract early adopter types. We can't do that by trying to pattern-match everyone else. I think EA might fall into a trap of trying to \"please all of the people all of the time\" and that isn't going to work. We can't be everything. And if we can't be everything, it will be a lot more efficient to be ourselves rather than pretend to be something we are not. Give the new members caveats to reduce feelings of discomfort, and kick out the grifters trying to just get laid, but our existing members (the actual EAs tryna work on stuff, not the EAdjacents/grifters) still are served by being who they are. I don't think you can remove one of the weirdest aspects of EA and expect the other weird and good ways of thinking to flourish in the same way tbh. I really value what EA has going for it and I don't even want to risk making big cultural changes like that without really good <i>proven</i> reason. Forum reflections are not enough reason for changes so big as a swathe of people forcing themselves to change their preferences and increase their disgust reactions or whatever, anything to get themselves to uphold arbitrary norms about sexual connection within community. At least, I don't want to risk it <i>yet</i>. I might change my mind next week, but right now it feels rash. The norms of allowing casual sex within community (it's not even a huge thing tbh but my point is that it's <i>allowed</i> and many people don't look twice at you for giving it a go) evolved <i>with</i> effective altruism, in the past say half-dozen years especially. If you think EA kind of discovered a lot in that time, we should be very wary to push back on the norms we have. Maybe our growth and what has been figured out is a <i>little bit</i> due to sexual connection which created a little innovator soup that gave us a lot of great ideas and curated high-trust ingroup spaces to discuss them in. Just maybe an effect like that is enough to tip the scale toward \"these norms are actively net positive.\" I don't know that yet, but I at least won't say confidently that they are net negative so I'll stay out of people's business.</p><p>Also finally, this is maybe the best reason to destigmatize casual sex within the EA community. I want EA to be the future. I want the philosophy to spread such that almost every person is, by some degree, an EA. I know that we don't need 100% of humanity working on the world's most important problems. But I do want future humans to value doing good efficiently. I do want EA to become way way bigger than it is now. We shouldn't think EA is going to remain tiny and there will always be other people to fool around with if that's a fundamental life experience you want to have. We should take on a mantle of trying to not only impact the future, but be the future, because we can't even protect the future if our values don't spread into it and broaden to more universal ways of life. We should figure out how to live our lives coherently, when we want, within EA just fine, rather than fractioning EA into a smaller box of one's life. If people want to separate EA from their broader life, that's fine! But don't force people who don't want to, to do it. Those are the people who I think are doing the work of figuring out how to integrate EA with a vision of social utopia. We will doubtless fumble a few balls on the way to the goal, but that doesn't mean we should advocate for people to get off the field and stop trying. Sex-positivity will be an aspect of a utopia. I believe that anyway. So sex-positivity should be a part of EA. And anyway, if EA grows so big, this rule about not hooking up with community members won't even be sustainable, it would cut out too many people from the population and we'd have people twiddling their thumbs for want of people to test the waters and explore sexuality with. That would, I think, be net negative. Well, I argue it's a difference in scale, not of kind, to stigmatize casual sex today, from a moral POV.</p><p>I don't even want to see terminology like \"sleeping around\" on the forum tbh, which to me is inherently stigmatizing at worst, and at best trivializes the niceness and essential humanness of the experience people are <i>trying</i> to have. Even if they are mistaken in how they are using the tool, how can we surely say yet that the tool has little use? Sure, maybe some people are trying to have causal sex stupidly and riskfully (although I have seen nothing of the sort myself), and perhaps some people don't want casual sex and need a piece like the above post to help them consider what they really want. But maybe we can help people do what they want less stupidly and find what they really want, without stigmatizing casual sex.</p><p>You might not buy these arguments but people who have casual sex might. Let them decide. If you don't feel too awkward, you can ask people about it. Same as I might ask an EA \"Why do you eat meat?\" If they say \"I think it's better for my impact\" I will drop the question. But If they say \"yeah I'd really like to go veg actually\" I will help them with that, or if they say \"it's too hard to go veg\" I will ask them if they would like to know how easy it can be to go lactovegetarian. Similarly you can ask someone something about their casual connections (or poly) and if they say \"I think it's better for me and does no harm, we both had fun, and it's none of anyone's business also\" you can drop it. If they say \"yeah tbh I'm actually trying to find a relationship\", \"yeah I'm worried about my career and this helps me feel more sure in mentoring and the like\", or (big oof) \"IDK she's hot right?\" then you can totally offer to talk with them about those things and suggest ways of being which are kinder to themselves and others.</p><p>So let people pick what makes them happy where they can get it, I think there are better solutions if we keep looking than cultural mandates about consensual bedroom practices.</p><p>But I have other norms I think would work way better than [blanket increased finger wagging at people sleeping around] plus [increased guilt and self-suppression for those interested in sleeping around who are most vulnerable to guilt]. Those two are what I think this suggestion will amount to. I can write those alternative other norms up if people are interested.</p><p>Oh yeah, fyi I also have no horse in this race personally. Not these days for sure. I'm ambiamorous and I don't really feel a deep burning need to love and create fun sexy times with anyone but my partner, and I haven't dated (at least) anyone else basically our whole relationship. So if it were negative utility to not have casual sex in the community obviously I'd abide. But I do have an ethical compass that all people be treated well, including people with minority sexual inclinations, and people who want to dip their toe into things casually to learn about each other and learn how things work. My ethical compass demands that these people should be allowed to craft their own futures without stigmatization. Even if all that is precisely forseeable about that future at the moment of diving in is just one night of fun (again, fun being one of the most precious things ever), if there aren't blatant costs in that particular interest (again like COI or in-company relationships), let people figure it out themselves. Curiosity and freedom are both intrinsic values of mine.</p><p>*I get that if people are bouncing off right now, that's a problem that trades against this. But to me that isn't conclusively proven. We need surveys. Soon hopefully. I do not want people to use their energy or their cultural attention budget on crafting a norm that we don't even know will do any good. Not sleeping around doesn't seem to meaningfully address most of the concerns I've even gleaned.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fncdxeithzrym\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefcdxeithzrym\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Poly is fun if you are well-suited to it. Monogamy can be <i>just as fun</i> if you are suited to that! I know because I'm an ambi-amorous person who is really liking living mono for right now</p></div></li></ol>", "parentCommentId": "duTzpKhSKRij2YHtR", "user": {"username": "Ivy_Mazzola"}}, {"_id": "CXLojJBTZoKL2iqXn", "postedAt": "2023-02-26T07:15:30.720Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Since some people here have shared their personal relevant experience and mine has been different to any of the ones I’ve read, I thought I’d share mine.</p>\n<p>I have been in EA as a local group organizer and on-again-off-again student for 7 years. I’ve been to 5 in person conferences and many adjacent social events (after parties etc.) I’m a young woman, and am pretty used to attention from guys. Before creating a dating doc I had been asked out by EA guys four times. Three were very nice and respectful, and were in no position of social or professional status over me. One was in a position of social status and pressured me into making out after I had already turned him down—I certainly doubt he was the kind who would have refrained from doing this if there were a norm against sleeping around in EA, since he was a real Transgressor of Norms.  (he’s since lost his status and demoted himself to EA-adjacent, in part because of other harassment allegations).</p>\n<p>After I created a dating doc I was approached by someone who I had long admired greatly and who I absolutely considered high status. This was for the purpose of perhaps forming a serious relationship which certainly could not have been portrayed as ‘sleeping around’. However, he did ask me about my sexual preferences for purposes of determining compatibility and I somewhat exaggerated my interest in sex (I have very little &amp; generally call myself asexual) because I was starstruck. I similarly downplayed others of my relationship preferences that conflicted with his. Again, a norm against sleeping around would not have helped, and in this case I would happily take the blame for not being good enough at honestly expressing my preferences.</p>\n<p>As far as being hit on by random people at ea events: I don’t think I’ve ever knowingly experienced this? It’s possible I am very bad at knowing when I’m being hit on, as an aspie asexual. But if I were to guess I would say no, I’m only a little bad at this, since I am socially sophisticated for an aspie and have experience with guys being interested in me.  So if I have been flirted with it was probably on the subtle side and therefore unlikely to make a person uncomfortable even if they were aware of it. In general when it comes to my interactions with men in EA, I have felt very respected and treated much more as a person and intellectual discussion partner than as a sexual prospect. The idea that other women might be getting driven out of EA from being hit on or seen primarily as a sexual prospect is surprising and feels contrary to my experience (not saying anyone who reports having this experience is lying or wrong).</p>\n", "parentCommentId": null, "user": {"username": "IsabelHasse"}}, {"_id": "sKHpziDBnvDTkyA2i", "postedAt": "2023-02-26T10:42:02.285Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Yeah, in Finnish contexts (nude) sauna is a normal option for an afterparty of a professional conference or similar context :) but in these cases, there is a gender separation of sauna turns (or different saunas) for men and women, just like at Finnish public swimming pools. At EA Finland events we have so far followed a quite usual Finnish student and hobby group policy of having a sauna turns for non-men and non-women separately and a mixed turn where everyone is welcome, with the option but not obligation to wear a swimming suit.<br>&nbsp;</p>", "parentCommentId": "YGkcBYKAuiwfBzFnt", "user": {"username": "Ada-Maaria Hyvärinen"}}, {"_id": "3s4sRXF7GZ8FBcSAk", "postedAt": "2023-02-26T11:20:53.625Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks for the thought our response! I suppose the main difference is that we have very diverging ideas of what the EA community is and what it will/should become.</p>\n<p>I’ve been on the fringe of EA for years, just learning about concepts and donating but never been part of the tighter group so to speak. I see EA as a question - how do we do the most good with the resources available?</p>\n<p>Poly is definitely something historically related to the early movement, but I guess I just disagree that the trade off of reputation and attacks over sexual harassment issues etc are positive because of vague notions of fun.</p>\n<p>Also - if the EA community creates massive burnout maybe we should change the way we approach our communications and epistemics instead of accepting that and saying we’ll cope by having casual sex. That doesn’t seem like a good road to go down especially long term.</p>\n<p>Then again I don’t have short AI timelines.</p>\n", "parentCommentId": "4GzCArdmR25uLdvKD", "user": {"username": "Wil Perkins"}}, {"_id": "GFGyfRxyWECv8Gq26", "postedAt": "2023-02-26T12:04:05.191Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote>\n<p>non-men and non-women</p>\n</blockquote>\n<p>Is the idea that non binary people are welcome at either?</p>\n", "parentCommentId": "sKHpziDBnvDTkyA2i", "user": {"username": "Jeff_Kaufman"}}, {"_id": "hhT2r7HyLD95ss8AS", "postedAt": "2023-02-26T18:11:52.377Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Exactly, that's the idea!</p>", "parentCommentId": "GFGyfRxyWECv8Gq26", "user": {"username": "Ada-Maaria Hyvärinen"}}, {"_id": "GqLNtmxEaidKxZE9h", "postedAt": "2023-02-26T22:12:49.981Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks! Hm well I agree about other ways to tend to burnout I just think it might be a bit of a moot point from what I've seen and there may be <a href=\"https://michaelnotebook.com/eanotes/\">something in the nature of EA about it</a>. I have now edited my comment based on your thoughts. I think you will kinda get what I mean more about \"fun\" and of \"mitigating burnout\" now. I also added something I meant to add but had forgotten: <strong>EA as utopian testing grounds</strong>. Maybe you will agree with me that this is what the community could become?</p><p>Sorry to do you like that (edit rather than give a point by point response), but I might turn it into a big post. The new stuff is in brackets.</p><p>If you have more thoughts I'd love to hear them. I def appreciate the feedback.</p><p>A last thought is that this community seems to have trouble with slippery slope language.</p><p><strong>Morally neutral until proven otherwise and can absolutely be done in transparent ethical ways without throwing out the baby with the bathwater:</strong>&nbsp;<br>casual hookups in community&gt;&gt;&gt;casual dating in community&gt;&gt;&gt;relationships in community&gt;&gt;&gt;open relationships&gt;&gt;&gt;polyamory&gt;&gt;&gt;relationships and dating across departments (but likely not within departments and definitely not where there may be conflict of interest)</p><p><strong>Bad or risky by nature:</strong>&nbsp;<br>Professional misconduct&gt;&gt;&gt;sexism&gt;&gt;&gt;sexist preferential treatment&gt;&gt;&gt;sexist avoidant or dismissive treatment&gt;&gt;&gt;purely self-interested behavior&gt;&gt;&gt;sexual misconduct&gt;&gt;&gt;sexually-inappropriate professional misconduct&gt;&gt;&gt;conflict of interest relationships&gt;&gt;&gt;sexual harrassment&gt;&gt;&gt;sexual coercion&gt;&gt;&gt;sexual assault&gt;&gt;&gt;rape</p><p>All these are really different. I appreciated that OP was pretty careful about that, but I think I note that you are starting to slip and making connections where we really don't know there are any.</p>", "parentCommentId": "3s4sRXF7GZ8FBcSAk", "user": {"username": "Ivy_Mazzola"}}, {"_id": "2HEuCs9Fk7BgCSjY2", "postedAt": "2023-02-28T04:33:46.418Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>So as a poly/poly-adjacent EA of many years I'll start by saying I strong upvoted your post and that insofar as a vision for a better tomorrow is concerned, your comment was poetry to my ears. I am very much aligned. Beautiful stuff.</p>\n<p>However, this little nugget just keeps coming back to me and it irks me:</p>\n<p>\"On the other hand, we do poly and flexible sexual connections and those of us who are engaged in those things will even try and help you figure out if it's for you. Poly is fun. Sex is fun. Play and curiosity are fun. These are some of the major fun things our community does have going for it when comes to hedonism [and utopian way of life, over the rest of society.]\"</p>\n<p>I think you're making the poly-part of the community sound way more accessible than it actually is. You possibly have a blindspot here because you don't know what it is like to be on the outside trying to get in (?).</p>\n<p>So here's the thing. If poly for you in the community is this fantastically amazing, then it is a tragedy of a vastly worse degree than many EAs might even realize that they can't be part of it.</p>\n<p>I'm reminded of some study I read about years ago that showed that the mental health of people in third world countries decreased markedly when they were shown just how much better off people in first world countries are. Those in the control group that showed clear ignorance over how Europeans lived were... Happier.</p>\n<p>Honestly, after reading so much poly-discourse on the forum lately I'm very surprised this point hasn't been raised. An obvious model for what is going on, in my head, is that the poly-backlash is part of a larger backlash against the \"moral fulfillment and life fulfillment and career fulfillment and hedonism fulfillment and just-everything-important fulfillment\" that is perceived to be held and disproportionately concentrated among few in EA.</p>\n", "parentCommentId": "4GzCArdmR25uLdvKD", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "nxxqiEHtPwaHdyKqJ", "postedAt": "2023-02-28T15:33:55.893Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>\"not having norms\" and \"I failed to see the norms\" would look very similar from the perspective of a socially clumsy actor.</p>\n<p>I may be seeing things that don't exist, but generally the groups I belong to have really strong norms against dating. The pervasiveness of flirting (subversive, plausibly deniable way in which socially adept folks circumvent these norms) should be evidence towards this.</p>\n", "parentCommentId": "JnGExmtJLLbQZZM32", "user": {"username": "LaserShark"}}, {"_id": "ovPzo3D63CuxSpYnB", "postedAt": "2023-02-28T16:53:37.613Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Thanks, that's great feedback. I've been thinking similarly kind of and your reflections help me put it together? Like I think it ties into the fears about <a href=\"https://forum.effectivealtruism.org/posts/gwbaySuugjxJAjkgQ/why-people-use-burner-accounts-a-commentary-on-blacklists\">gatekeeping</a> which I think are maybe unconsciously comparative-resentment-based too. I think there is some counterargument to what I'm saying which goes something like: this sex positivity <i>does</i> create unequitable situations. It's the opposite problem of sexual harrassment if it is true. But I'm not sold on that counterargument either.. if I could snap my fingers and sprinkle the value created from sex-positivity/sexual connection evenly throughout the community, I would do so. But I don't think it works like that. I think there is actual new value created. Unfortunately sex-positivity is not <i>yet</i> one of those features where \"a rising tide floats all boats\". It's more like (to me) some boats are sped up by the sex positive-current and other boats miss the wave and just reach their destination the same time they counterfactually would have. That's because I don't see EA positions and social cohesion as win-lose situations, again I think value is just created. I think figuring out how to balance equity with overall prosperity, and how to frame it so no one feels jilted is a fundamental human problem I hope we keep toying with things to make it work.<br><br>That said, I will add that I've been poly for 15 years, but EA for only 5 years, so I never really <i>tried</i> to \"get in\" to EA poly or EA sex-positive spaces. I also don't really identify the EA community as specifically poly or sex-positive, I just don't want it to lose that streak it has and stifle the EAs who are living that way. Since people are now talking about it and I have had a few key experiences within the community (but more outside of it), I feel comfortable commenting on sex-positivity within the community culture. Maybe it is really hard to get into the specifically-EA poly community and that's okay. I mean it takes most people a lot of time and strategy to get integrated to any sex-positive community (kink, swingers, private parties, OKC-based polycules lmao). Maybe if people are feeling resentful about it, those people can ask us poly people what's up and we can send them links and stuff and they can do their exploring outside of the EA community. I don;t want this to be like \"an EA infrastructure project\" or something, but in my free time if people DM me I always try to help people figure out if poly is right for them.<br><br>Also, you are right that speaking in the way I have about poly is almost.. concerning. And I don't want to be one-sided. I'm actually ambiamorous (but I still say poly cuz I hold a poly ethical position about freedom of my partner, regardless of whether I care about getting a new partner that month/year).. Monogamy can be fun too! I will add a little footnote like &nbsp;\"poly is fun [if you are suited to it. Monogamy can be just as fun if you are suited to that]</p>", "parentCommentId": "2HEuCs9Fk7BgCSjY2", "user": {"username": "Ivy_Mazzola"}}, {"_id": "t3rSp9Jqi6tRrgecY", "postedAt": "2023-02-28T19:17:18.995Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Strongly agree with you on everything you wrote.<br><br>Fun-fact: even though I've been in multi-year poly relationships even I don't know if poly is right for me. I nominally identify as polyskeptic. This loosely means I believe more people than not are trying to be poly without realising that poly is sub-optimal for reaching their goals (whatever their goals are). I acknowledge I might be projecting here, because my dating life really only \"took off\" the way I wanted after I stopped trying to be poly and was nothing else other than \"single.\"&nbsp;</p><p>That said, I do also have some empirical backing for my belief: I've spoken or know of at least 2-3 long-time poly EAs (i.e. poly for most of their dating life) that have since gone mono. I think the interesting thing was one of them saying they were shocked by how much more fulfilling mono was than they expected it would be given \"poly-metaphysics\" is what they strongly subscribed to before.&nbsp;</p><p>Which also speaks to a broader point: if you're poly you're interesting and get invited to speak on the Clearer Thinking podcasts etc etc. You gain <i>status</i> just due to your private relationship preference in EA, or such is my perception. Nobody cares if you're mono.<br><br>But, this is getting to a point where I need to go to work and I'd like to talk with you over video chat instead to continue - perhaps on EA Gather.town to make it public. DM'd you :)</p>", "parentCommentId": "ovPzo3D63CuxSpYnB", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "Lovdz7n22BtDbHDY5", "postedAt": "2023-02-28T20:40:00.964Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Really depressing how many disagree votes this is getting. Calling bs on all the hand wringing about sexism in EA.  People are so worried about sexism and gender inclusion yet think that blatant double standards are just fine? How phony.</p>\n", "parentCommentId": "LTYPz3SLPyHFHotii", "user": {"username": "justsaying"}}, {"_id": "yAm53kuAfKFEExrYr", "postedAt": "2023-02-28T23:18:06.912Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>These discussions are quite enlightening. I had a gut feeling this is how things are but seeing it clearly verbalized confirms my intuition.</p><blockquote><p>It's more like (to me) some boats are sped up by the sex positive-current and other boats miss the wave and just reach their destination the same time they counterfactually would have.</p></blockquote><p>and</p><blockquote><p>Which also speaks to a broader point: if you're poly you're interesting and get invited to speak on the Clearer Thinking podcasts etc etc. You gain <i>status</i> just due to your private relationship preference in EA, or such is my perception. Nobody cares if you're mono.</p></blockquote><p>To retain competent people you need to sustain a competitive atmosphere. If success is not just a function of impact / work but also a function of sexual liaisons / sexuality, it calls for a toxic culture because one feels compelled to sleep around to get ahead. Even if you're not doing it, your peers are.&nbsp;</p><p>Do you realize how many competent women will be driven out of EA if they are not open to have sexual liaisons? They're not offered a seat on the fast boats, not because they're not smart/hard working but because they're rejecting sex/ have different relationship preference.&nbsp;</p><p>How is that equality of opportunity? How is that inclusive?&nbsp;</p>", "parentCommentId": "t3rSp9Jqi6tRrgecY", "user": {"username": "Keerthana Gopalakrishnan"}}, {"_id": "pjYRAXesKxrFcCkfM", "postedAt": "2023-03-01T09:21:58.442Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>Using language and framing like “what if you replace poly with gay” or “personally this makes me feel…” is not compatible with calculating the utility of a norm in EA. As stated elsewhere our goal is to better the world, not make ourselves happy or help EAs find life partners.</p></blockquote><p>In many other cases, such as social movement research, we look for historical analogues to inform our priors. Why is that a reasonable strategy in other cases but not this?</p><p>And why is it not helpful for people who such a norm would directly affect to say “personally this makes me feel…”, but somehow adding to the conversation for someone uninvolved to say 'Personally I agree strongly with this post and think it’s a more than reasonable proposal. Also, just seems like common sense. I’d imagine there are quite a few people who feel similarly based on the vote count.'?</p>", "parentCommentId": "duTzpKhSKRij2YHtR", "user": {"username": "Arepo"}}, {"_id": "fePb79YQLB83C7Ysw", "postedAt": "2023-03-01T10:58:27.552Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>\"They're not offered a seat on the fast boats, not because they're not smart/hard working but because they're rejecting sex/ have different relationship preference. \"</p>\n<p>I think you've completely misunderstood what Ivy means by \"fast boats.\" She is talking about fulfillment through intimate human connection. Not fulfillment through professional success. Makes more sense? By boats being \"sped up\" Ivy means that sexual positivity is allowing many people to experience a level of fulfilling human connection much sooner in their life than they otherwise might have. Ivy isn't talking about money and professional power here at all.</p>\n<p>^ Moved this paragraph to top of comment because I thought it more important than the rest of my comment below:</p>\n<p>I think you have a much higher burden of proof you haven't met yet to show your comment isn't a slippery slope fallacy you're invoking. I can go into why I think this looks like a slippery slope if you like or can you see why I'd see it that way?</p>\n<p>\"If success is not just a function of impact / work but also a function of sexual liaisons / sexuality\"</p>\n<p>Success and status are not synonymous. You can be high social status with everyone wanting to hear about your interesting polyamorous life, but at the same time you can be completely unsuccessful professionally. I can think of at least one EA woman off the top of my head who has been poly with multiple prominent EAs, who has social status because of this, and whose professional career hasn't benefited at all. If anything it hindered her professional life's growth because God knows being polyamorous means being an unpaid therapist to multiple people, which takes time and energy away from other endeavors.</p>\n<p>Just because someone gains social status from something in some group that said group thinks is cool doesn't mean that this increased status translates into easier professional success in any meaningful way we need to be worried about.</p>\n<p>People gain status in LGBTQ social circles if they come out as gay, especially if the coming out story makes for a compelling story (hell, in any social setting where you can tell a compelling story you gain status). I don't think this means we need to be worried that - for sake of argument - queer theatre productions are preferentially hiring actors with compelling stories to tell about their own private sexual history instead of hiring the most competent actors. They'll hire the most competent actors - they have tickets to sell. The EA community will hire the most competent women - they have a world to save.</p>\n<p>I don't think we're anywhere close to needing to be concerned that the social status some in EA gain from talking about poly in a compelling way leads to preferential career treatment.</p>\n<p>Because social status and professional success aren't synonymous and one isn't causally linked to the other, and because you appear to have misunderstood what is meant by \"fast boats\" I think all the chain of connections you've drawn aren't connected to anything I or Ivy have said at all.</p>\n", "parentCommentId": "yAm53kuAfKFEExrYr", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "79JwTBZvBPau86MbF", "postedAt": "2023-03-01T12:07:11.637Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I would feel surprised if people felt pressure to be part of a cuddle puddle just because there was one at a party, and inclined to say it was their problem if so. I think it's different obviously if people are verbally pressuring them to join (and I think \"awww come on! it's fun\" counts as verbal pressure). But I'd be sad if people stopped having cuddle puddles/hot tubs because of a worry that some hypothetical person might feel uncomfortable with them.&nbsp;</p>", "parentCommentId": "BdD3XqspxmEMxJdAj", "user": {"username": "Amber"}}, {"_id": "zDZ2u8rNhvaaCko24", "postedAt": "2023-03-01T12:20:53.590Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I guess I think this reply is sort of not helpful. The OP was clearly about more than grantmakers and grantees, and other situations where there's a clear power dynamic. I feel like in a lot of these interactions you are bringing up hypotheticals to refute people's firm statements, but it's hard to see what you actually think. Like do you disagree with OP? If so, why are you nitpicking people who also disagree with OP? Do you agree with OP? Or a limited form of it? If so, just say that and let other people have their emotional reactions.&nbsp;<br><br>Anyway I want to say I agree with Liv throughout this comment section.&nbsp;<br>&nbsp;</p>", "parentCommentId": "MbnaWAEhFb2xj2qAb", "user": {"username": "Amber"}}, {"_id": "cEMLLbbew88N6bqTP", "postedAt": "2023-03-01T14:26:40.175Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I wrote some thoughts on this + the whole related conversation here: https://forum.effectivealtruism.org/posts/4towuFeBfbGn8hJGs/amber-dawn-s-shortform?commentId=bHmWcHYnQkaGWjbcQ</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "BGHrHPaFkoYW6XASB", "postedAt": "2023-03-01T14:26:51.776Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>I wrote some thoughts on this + the whole related conversation here: https://forum.effectivealtruism.org/posts/4towuFeBfbGn8hJGs/amber-dawn-s-shortform?commentId=bHmWcHYnQkaGWjbcQ</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "R9vWBrKiuAvhBLSi9", "postedAt": "2023-03-01T15:03:29.910Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote>\n<p>Do you disagree with OP? ... Do you agree with OP? Or a limited form of it? If so, just say that...</p>\n</blockquote>\n<p>I did try to say what I think, in <a href=\"https://forum.effectivealtruism.org/posts/aGkLx2hfr9s3mSdng/consider-not-sleeping-around-within-the-community-1?commentId=fKEXa2j6jTvHxTmjh\">my top-level comment</a>.  To be more explicit, though, I mostly agree but think that it's missing important considerations even on its own terms. I think it's good for EAs to think over the issues raised in the post and the comments, and expect that when some people do that they'll decide to change how they approach interactions within EA.  I think on balance the ways people make decisions about who to sleep with after reading this post will lead them to be slightly personally happier, and will also lead to a slightly healthier EA community.</p>\n<blockquote>\n<p>Why are you nitpicking people?</p>\n</blockquote>\n<p>People are often responding by saying that the only acceptable norm is consent, but then it turns out that they actually are in favor of stricter norms in a variety of situations.  As someone who is interested in figuring out whether there are better norms it makes sense to try and push the community towards, I think it's important that we acknowledge that both current norms and ideal norms are more complex than \"anything consensual.\"  I followed up with <a href=\"https://forum.effectivealtruism.org/posts/rqg7PRYTvCf74TRyG/consent-isn-t-always-enough\">Consent Isn't Always Enough</a> to get into this more.</p>\n<blockquote>\n<p>Let other people have their emotional reactions.</p>\n</blockquote>\n<p>I agree it's important for people to be able to have emotional reactions and process things, but I think a Forum culture of ignoring the text of what people are actually saying would be disrespectful and harmful.</p>\n", "parentCommentId": "zDZ2u8rNhvaaCko24", "user": {"username": "Jeff_Kaufman"}}, {"_id": "pL2SzzpWFT7h7YH8S", "postedAt": "2023-03-01T22:30:34.477Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>Again begs the question, why status in a community oriented around “doing good” has anything to do with sexuality and is not uniformly distributed across all sexualities.  Status in EA should be a function of doing good and should be sexuality-neutral, period.</p>\n<p>I think you’re reframing on a technicality. Status and success are fairly related in many ways in the real world, because status opens doors and signals greater opportunity.</p>\n<p>EA might want to hire competent women but competent women might not want to stick around if they're lower status due to factors outside of their control such as sexuality/race/etc.</p>\n", "parentCommentId": "fePb79YQLB83C7Ysw", "user": {"username": "Keerthana Gopalakrishnan"}}, {"_id": "i7XabcKbYmQay7qCg", "postedAt": "2023-03-02T08:23:27.602Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<p>i think \"please do not intefere with people's dating decisions unless there is a very very good reason\" is the hard-won-of-experience cultural practice here</p>", "parentCommentId": "JnGExmtJLLbQZZM32", "user": {"username": "agunning"}}, {"_id": "TB69Hz4Y2AjCN5RmL", "postedAt": "2023-03-04T00:04:51.262Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>EA might want to hire competent women but competent women might not want to stick around if they're lower status due to factors outside of their control such as sexuality/race/etc.</p></blockquote><p>&nbsp;</p><p>I fully agree with this point, but I have a hard time drawing the line from what my and Ivy's topic of conversation is and this. What I think you're talking about is a problem where power dynamics is involved including mentor/mentee relationships and coworkers etc etc. This is a separate topic from the social status increase and feeling-dejected by it that Ivy and I are talking about.</p><p>I'll try an illustrate why with an example:</p><p>When I was at an EA party the other night a woman I had just met brought up the topic of orgies. I immediately found her more interesting and it opened the span of conversation to many other varied topics not even related to sexuality. She didn't break any norms, she didn't try to make people feel uncomfortable, she brought the topic up in a funny socially intelligent way. Her social status in the group in this setting increased. EAs trend towards being open-minded enough to talk about anything. Nothing wrong with this. Another pertinent example: When I met one of my closest EA-adjacent friends in the world for the first time: within 5 minutes we were both talking about the topic of suicide and our own personal struggles. Naturally I also immediately found her more interesting and it opened the span of conversation to many other varied topics not even related to suicide. Her openness increased her social status at said party where people were EAs and EA-adjacent open-minded types.<br><br>If these women had been at a conservative catholic social gathering their social status would have decreased with this behaviour. And there is nothing wrong with a different social setting having different status hierarchies.</p><p>I bring up this example because your comment begs the question: do you think it is problematic these women brought up these topics and that status hierarchies should be different in EA as a community, as a whole? &nbsp;Because we don't allow this kind of talk at EA conferences and it has finally come down (as it should) that where power dynamics are concerned this kind of talk between coworkers is likely to be problematic. But if what you're saying is that absent any professional setting, absent any coworker or mentee/mentor relationship, people who identify as \"EAs\" should <i>still </i>not grant anyone any social status for being interesting when the topic of sexuality is brought up... what you're effectively demanding is for thousands of people around the world to change their personality and become less sexually liberal and less open-minded.&nbsp;</p><p>Now mind you, when I was in my early twenties, <i>I would have felt left out and dejected </i>at these EA parties where people are freely talking about said sexual topics where I don't have any status because of factors outside of my control. I certainly would have <i>felt</i> like my dating life is some sort of proxy for not being good enough to be part of EA and that it was locking opportunities away from me. But how I <i>feel</i> and how things are are two different things.</p><p>It would have been <i>wrong</i> for me to make the leap from \"I feel like I'm not high status and not good enough at this EA party\" to \"EAs wont hire me because I'm not high status enough and sexually liberal enough at their EA parties.\" I think this is the mistake you are making when you say \"Status and success are fairly related in many ways in the real world, because status opens doors and signals greater opportunity.\" This is an obviously true statement in some contexts (e.g. mentor/mentee or grant/grantee relationships etc) and an obviously false statement in the context that Ivy and I are talking about.</p><p>That said, an obvious crux here that would convince me that we have a problem that requires action is if the number of women in EA does indeed dwindle or show a downward trend. I don't see that happening.</p><p>If anything the EA Community's gendar ratio over the years (including at EA casual socials) is trending towards becoming more women-heavy suggesting to me that women are feeling more comfortable as a whole in the movement rather than less so.</p><p>This doesn't mean that there haven't been incidents that have made some women feel unwelcome or unsafe. These are serious and need to be dealt with. But I'm unconvinced this is indicative of a larger trend. I talk about this view of mine more in <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=gMhcRbG6Wd4vRanGC\">this comment</a> on a post by Maya saying they are sad, disappointed and scared of the EA community.</p><p>And guess what: she updated her initial negative view towards the EA community after considering the full context of things as you can see in her comment <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=pfGG7wGjokvg5Pywm\">here</a>:</p><blockquote><p>Thanks for your comment - for all who are interested, I did reach out to Scott and he provided me with an in-depth explanation of some of the context behind Kathy's accusations and suicide. His explanation provided me with a deeper understanding of the situation and helped me realize that action was taken to check the validity of some of Kathy claims and that there was a more involved and nuanced response to the situation than I realized initially.&nbsp;</p></blockquote><p><br>Final quick point:</p><blockquote><p>Status in EA should be a function of doing good and should be sexuality-neutral, period.</p></blockquote><p>I believe sexuality can be a means of doing good. I think healthy sexuality and specifically talking about it has liberated thousands, if not hundreds of thousands, across history. It's as valid something to talk about as mental health as an EA cause area. If some are better at talking about it - even if it makes <i>me</i> feel uncomfortable and left out - it's ok for them to get social status for it.</p><p>This is not really entirely different from how when EAs talk about AI Alignment and get status for it that I also feel uncomfortable and left out for not being smart enough. Let their social status increase. It's my problem for feeling insecure, not theirs.</p><p>Likewise it is my problem for feeling like I \"need to be better at being poly to be EA.\" This is something I genuinely feel. But I know I don't have to be poly to be fully welcome and I know the feeling is my own problem, not something that is a provably strong indictment against the EA community.</p>", "parentCommentId": "pL2SzzpWFT7h7YH8S", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "PFwmaZmzTCHQbZbtc", "postedAt": "2023-03-04T11:12:55.301Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>But if what you're saying is that absent any professional setting, absent any coworker or mentee/mentor relationship, people who identify as \"EAs\" should <i>still </i>not grant anyone any social status for being interesting when the topic of sexuality is brought up... what you're effectively demanding is for thousands of people around the world to change their personality and become less sexually liberal and less open-minded.&nbsp;</p></blockquote><p>You're using the word sexually liberal / open-minded /interesting interchangeably. Catholic nuns can be interesting, monogamous people can be open minded. Private sexual preferences have nothing to do with interestingness or open minded ness.&nbsp;</p><blockquote><p>What I think you're talking about is a problem where power dynamics is involved including mentor/mentee relationships and coworkers etc etc. This is a separate topic from the social status increase and feeling-dejected by it that Ivy and I are talking about.</p></blockquote><p>I am not just talking about professional relationships. I'm also talking about what the community should value. Treating women differently as higher/lower status based on their sexuality is simply wrong. A lot of people are intentionally monogamous ( like me). Assigning them default lower status due to their private relationship preference is an awful practice that shouldn't be adopted community wide.&nbsp;</p><blockquote><p>Which also speaks to a broader point: if you're poly you're interesting and get invited to speak on the Clearer Thinking podcasts etc etc</p></blockquote><p>May be you're struggling to understand my point, so let me try to demonstrate why this sort of language is troubling. If you substitute the word \"poly\" with \"white\" ( ethnicity)/\"male\" (gender)/ \"homosexual\"(orientation) &nbsp;or other equivalents, this sentence sounds so wrong. I don't think that my choice / programming of sexuality is something that needs work, I love being monogamous, just like how I don't feel lesser because of my gender or ethnicity. All other things being equal, I want to be given equal status as someone else with a different sexuality, just like how I want the same status as a man / white person / a person of different nationality. That's all.</p><blockquote><p>Likewise it is my problem for feeling like I \"need to be better at being poly to be EA.\" This is something I genuinely feel.</p></blockquote><p>I am sorry you feel this way.&nbsp;</p><blockquote><p>This is not really entirely different from how when EAs talk about AI Alignment and get status for it that I also feel uncomfortable and left out for not being smart enough. Let their social status increase. It's my problem for feeling insecure, not theirs.</p></blockquote><p>This is actually status working the right way. Status can be used as an incentive to promote behaviors we want from people because humans are great incentive maximizers. We want alignment researchers to gain status by producing high quality alignment work, because EA thinks this work is of high impact. Conversely, we want more people to aspire to become alignment researchers because this work is highly regarded / high status in EA. Unlike promoting certain type of technical AI work over others in EA, the community should not promote a certain type of sexuality &nbsp;over others. Let EA be about doing good alone, and decoupled from sexuality / race / ethnicity / orientation.&nbsp;</p>", "parentCommentId": "TB69Hz4Y2AjCN5RmL", "user": {"username": "Keerthana Gopalakrishnan"}}, {"_id": "RCxhxSTcrhgjZRskB", "postedAt": "2023-03-09T03:48:41.681Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>You're using the word sexually liberal / open-minded /interesting interchangeably. Catholic nuns can be interesting, monogamous people can be open minded. Private sexual preferences have nothing to do with interestingness or open minded ness.&nbsp;</p></blockquote><p>&nbsp;</p><p>A valuable point I am glad you brought up so I can clarify that of course I believe Catholic nuns can be interesting and open minded and even sexually liberal in beliefs without practising. I'd hate to make anyone feel otherwise. I'm not using them interchangeably. I said \"sexually liberal and less open-minded\" indicating two separate things, not two synonymous things. Private sexual preferences can totally be related to someone's interestingness, sexually liberal mindset and open-mindedness and there is nothing wrong with that. Some things correlate and this is hardly controversial. And just because I acknowledge they correlate for me (interestingness is subjective after all) does not mean I'm saying other groups cannot be interesting, sexually liberal or open-minded. Likewise poly people can be dull and closed-minded as well.</p><p>People just aren't black-and-white enough to be easily categorized.<br><br>I kinda also just want to stop here and point out that it is a private <i>relationship </i>preferences, not sexual preferences. A lot of polyamorous people aren't even sexual. There are poly people that just sleep together cuddling, yet have full blown loving relationship polycules complete with horrendously messy breakups like any monogamous relationship.</p><p>I met a a poly man this year that - to my shock - is asexual. Mostly shocking because he presented to me as interested in sex like me but when I talked to one of the (many) women he is or has dated I found out he doesn't care much for sex.</p><p>And there is nothing wrong with me being more interested in this asexual poly man with multiple girlfriends (some of &nbsp;said girlfriends whom I might add are interested in sex) as a direct consequence of his relationship dynamics. Me assigning him more status in my social circles is no more a moral problem than traditionally monogamous people giving status to people who are traditionally married. Different social groups have different social status hierarchies. Both are as valid as any preference you might have where everyone is consenting to be a part of a social dynamic.</p><blockquote><p>I am not just talking about professional relationships. I'm also talking about what the community should value. Treating women differently as higher/lower status based on their sexuality is simply wrong.&nbsp;</p></blockquote><p>You cannot police people's preferences when nobody is being harmed. That is wrong. If there are zero problematic power dynamics (e.g. no professional relationships), consenting adults can do as they please. A woman, just like any man, has every right to assign status to different people based on whatever reasons they choose. We all do this instinctively and automatically. The problem is <strong>not</strong> that that treating women differently as higher/lower status based on whatever preference you might have is wrong - it is that doing so insensitively can hurt someone and that hurting others is wrong.</p><p>In eras long forgotten I've had brief but magical \"poly-heaven\" moments where I'm dating multiple people and everyone is happy and it is sheer bliss, but I <i>don't </i>go loudly proclaiming it all to all my friends who aren't happy with their dating lives. That would be incredibly insensitive of me. Just because someone is lower status on some subjective metric doesn't mean I want them to viscerally feel it. We should all be kindly helping lift each other up.</p><blockquote><p>A lot of people are intentionally monogamous ( like me). Assigning them default lower status due to their private relationship preference is an awful practice that shouldn't be adopted community wide.&nbsp;</p></blockquote><p>So I'll start by saying it is absolutely awful you feel like the EA community is assigning you lower status for being a monogamous woman. I have to ask though, isn't this something where you can look at the individuals who were this insensitive towards you and call them assholes without calling the EA community as a whole asshole-ish?</p><p>When I, as a poly person, hang out with my more conservative mono friends, they don't make me feel lower status. I'm their friend. However, I <strong>am</strong> lower status around them relative to their status hierarchy, <i>especially</i> when it comes to my viability as a mate. I <i>accept </i>and <i>respect </i>that I'm lower status around them.&nbsp;</p><p>A perhaps better example (\"more conservative mono\" is a bit too vague) is that when I a hang out with my death metal friends who have crazy tats and know everything about metal music and playing instruments I likewise have lower relative social status. And perhaps an illustrative example here is that yes, <i>some </i>in the death metal community do put more status on tattoos while some do not - which, like polyamory to EA, is wholly separate from what the core of the community is actually focused on, namely death metal music. I <i>accept </i>and <i>respect </i>that to some people within the metal community I'm lower status due to not having tattoos. They aren't being mean to me by assigning me lower status.</p><p>However, if a particular strictly monogamous person or death metal friend went out of their way to highlight or was insensitive about my relative low status, I'd call them an asshole. I would not however call the death metal community as a whole asshole-ish for assigning me lower status due to my private preference of not wanting to have tattoos. And I wouldn't say they are wrong to value tattoos and should only appraise my social status based on my love of death metal.</p><p>Assigning people status based on their private relationship preference is not something that is adopted community-wide in EA. Assigning status based on your tattoos is not something adopted community-wide in the death metal community. In both cases though there might be an epiphenomenon where the people you hang out within the EA/Death Metal community just happen to also be into polyamory/tattoos, but that doesn't mean their personal preference and the status hierarchies you experience because of those preferences are a community-wide practice.</p><p>You might immediately want to counter-argue that \"the sum aggregate of statuses being assigned is what takes something from individuals practising it to it being a community-wide practice.\" In anticipating this counter-argument, let's look at my death metal analogy and see how it can come crashing down:<br><br>Let's assume that women with tattoos disproportionately find themselves in favourable <i><strong>career</strong></i> positions in the death metal community which is <i>not</i> relative to their actual career skill. Women without tattoos do not see this advantage. Let's assume this is a result of increased professional networking opportunities afforded to women with tattoos as a direct result of many high in power and status in the death metal community disproportionately giving social status to women with tattoos (And it is only due to this and <i><strong>NOT </strong></i>due to problematic romantic relationships with problematic power dynamics). Consequently we enter vicious feedback loop of women without tattoos feeling dis-empowered and unfair pressure to get tattoos to get ahead. And those that wont put up with this obvious bullshit just decide to leave the Death Metal Community altogether despite their talent.</p><p>I think we are now looking dead in the eye at something much more like what you're afraid of is happening in the EA community. You're saying that even absent problematic power dynamics and the <i>appearance</i> of nobody is being harmed, actually women are still being harmed.</p><p>So I think there are a few further steps we need to take before we start calling out the entire Death Metal community:</p><ul><li>Women with tattoos actually have to be less competent than women without that aren't getting said career positions. It's totally possible that actually there are just more competent Death Metal women with tattoos and their tattoos are completely unrelated to their getting their positions<ul><li>Women who feel pressured to get tattoos might just be pattern-matching on something that isn't actually relevant to their professional success in the Death Metal Community<ul><li>In the EA community I have not seen broad evidence of poly women being treated preferentially professionally <i>because </i>they are poly</li></ul></li></ul></li><li>It has to be broadly systemic and not just a feature of some subset of the community&nbsp;<ul><li>It shouldn't be something like <a href=\"https://www.youtube.com/watch?v=BxRS5HQZgEc&amp;t=1s\">Sonia points out</a> appears to occur mostly in The Bay Area which appears to have features conducive to abusive dynamics<ul><li>If there was some city where a scandal took place in the Death Metal community where some women appeared to have gotten preferential treatment due to their tattoos, it would be pretty unthinkable for anyone to conclude \"The Death Metal Community is abusive\" instead of \"The Death Metal Community in this city is abusive\"</li></ul></li></ul></li><li>Nobody caring to course correct, no action being taken.<ul><li>I really doubt I need to make a case that concerns of women are being taken seriously. If they weren't the number of women in EA wouldn't be growing.</li></ul></li></ul><p>If &nbsp;things were true, however, we are no longer talking about individuals who are assholes but an entire community that has a deep rot.</p><p>But for sub-points I added I don't think any of them hold for the EA community.&nbsp;</p><p>Ergo, I think the correct response is to call out individuals. Which has happened in the EA community a bunch of times leading to said individuals being banned from the EA community (or other punishments that make sense)</p><blockquote><blockquote><p>Which also speaks to a broader point: if you're poly you're interesting and get invited to speak on the Clearer Thinking podcasts etc etc</p></blockquote><p>&nbsp;</p><p>May be you're struggling to understand my point, so let me try to demonstrate why this sort of language is troubling. If you substitute the word \"poly\" with \"white\" ( ethnicity)/\"male\" (gender)/ \"homosexual\"(orientation) &nbsp;or other equivalents, this sentence sounds so wrong. I don't think that my choice / programming of sexuality is something that needs work, I love being monogamous, just like how I don't feel lesser because of my gender or ethnicity. All other things being equal, I want to be given equal status as someone else with a different sexuality, just like how I want the same status as a man / white person / a person of different nationality. That's all.</p></blockquote><p>Thank you for trying to make your point clearer. I appreciate this a lot. I'm beginning to think we have an unusually high <a href=\"https://www.lesswrong.com/tag/inferential-distance\">inferential distance</a> between us, but actually at the object-level we don't disagree on a lot at all.&nbsp;</p><p>So, actually, all those do occur and frequently. Certain black (ethnicity), women (gendar), homosexual (orientation) people have interesting stories to tell because of their experience tied to their ethnicity/gendar/orientation and get invited to podcasts because of it. So the sentence doesn't strike me as \"wrong\" per se. It strikes me as <i>feeling </i>wrong.&nbsp;</p><p>But, if it isn't <i>just </i>because of some protected characteristic, it is totally ok for people to assign others more social status, in part, because of protected characteristics. People assign people who are women/black/homosexual &lt;insert-reason-here&gt; more status because their experience as a &lt;insert-category-here&gt; is essential to whatever they have to share - e.g. it is something where they are oppressed</p><p>Likewise, polyamory is quite stigmatised and we don't really have many role-models or representation. So, when someone is speaking for us and they do so eloquently, it is only natural that we assign this person more status because they can do so - and doing so is intricately tied to their identity in being poly. Someone who isn't poly that can still \"talk as well\" wouldn't get the status. This would be problematic for the same reason that we don't assign status to a white man who can \"talk as well\" about the experience of being black as someone who is black.</p><p>I guess the question then is, if you possibly don't feel it wrong to assign a women more social status for being a good role-model for women as a woman, why do you feel uncomfortable when poly people are assigned more status for being a good role-model for poly people as a poly person themselves? This, like AI Alignment in the EA community, is status working in the right way and incentivising good and worthwhile behaviour in the poly community.</p><p>I might feel bad or left out due to this, but that is not really that different from a woman feeling bad and left out when they compare themselves to other women who have gained social status in part for sharing their experiences as women.</p><p>Also I just want to explicitly state I didn't mean for anything I wrote to imply I think your programming of sexuality is something that needs work. I'll also add, in case you're worrying whether you've offended me, nothing you've written thus far has made me feel like you think my programming of sexuality is something I need to work on.&nbsp;</p><blockquote><p>This is actually status working the right way. Status can be used as an incentive to promote behaviors we want from people because humans are great incentive maximizers. We want alignment researchers to gain status by producing high quality alignment work, because EA thinks this work is of high impact. Conversely, we want more people to aspire to become alignment researchers because this work is highly regarded / high status in EA. Unlike promoting certain type of technical AI work over others in EA, the community should not promote a certain type of sexuality &nbsp;over others. Let EA be about doing good alone, and decoupled from sexuality / race / ethnicity / orientation.&nbsp;</p></blockquote><p>And some people want to meet more people who have cool tattoos or more people who are polyamorous. Humans are going to throw out incentives to get what they want. The answer is not to quash it, it is to teach people to do so maturely, tactfully and with kindness. I like big-tent EA so people with near any preference might also like doing EA stuff. They might even be EA leaders. But we shouldn't let their preferences automatically lead us to conclude that is the preference of the community as a whole.</p><p>And maybe I'm too woke but I'd caution against trying to decouple doing good from sexuality / race / ethnicity / orientation completely. A full understanding of people's identities, I think, is important to doing good better. A sex-race-ethnic-orientation blind approach might invalidate people's experiences, especially those that are marginalized.</p><p>&nbsp;</p><p>For anyone that actually read this whole damn comment, if you are in the Bay Area for the next month I'd love to meet you at the EA Taco Tuesday meetup and give you an appreciative high five, lol, even if you disagree with me. I'll be highly talkative excitable guy in the panda hat.</p>", "parentCommentId": "PFwmaZmzTCHQbZbtc", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "aiwdN4MkNx4fwiq6h", "postedAt": "2023-03-09T10:04:41.548Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": "<blockquote><p>And perhaps an illustrative example here is that yes, <i>some </i>in the death metal community do put more status on tattoos while some do not - which, like polyamory to EA, is wholly separate from what the core of the community is actually focused on, namely death metal music. I <i>accept </i>and <i>respect </i>that to some people within the metal community I'm lower status due to not having tattoos. They aren't being mean to me by assigning me lower status.</p></blockquote><p>Nice of you, but I do not accept or respect having lower status in EA due to being monogamous. They are being mean to me and thousands of monogamous women they're recruiting / want to recruit / who are dedicated EAs by assigning us lower status. I am not willing to participate in a community where I have lower status due to factors I didn't choose (race/gender/sexuality), and I'd think many self respecting others will also not put up with what you're calling \"relative lower status\". No fuck that. We want equality, equal respect, equal opportunity.&nbsp;</p><blockquote><p>So I'll start by saying it is absolutely awful you feel like the EA community is assigning you lower status for being a monogamous woman. I have to ask though, isn't this something where you can look at the individuals who were this insensitive towards you and call them assholes without calling the EA community as a whole asshole-ish?</p></blockquote><p>I am not calling the whole EA community asshole-ish, but it is big problem here because there are many such individuals. There's no push back against these people that I'm seeing widely either. I'm also confused you think individuals who assign me lower status are assholes after saying above yourself that may be I should be ok with being assigned lower status like you're ok being lower status elsewhere.&nbsp;</p><p>I'm sorry but the death metal-tattoo analogy got lost on me. You can get a tattoo if you chose to, many people can't change their sexual preference, so it's a false comparison. It's like you're saying white people have higher status and you should be ok with that, but I can't paint my face white and become a white person if I wanted to. Secondly tattoos are nothing like sex. Sex involves two people ( often) and conveys a relationship where you can benefit a higher status individual. Your getting a tattoo is not pleasurable to high status men. I do not want to get into the frame of arguing based on this analogy because the analogy doesn't model many complications.&nbsp;</p><blockquote><ul><li>I really doubt I need to make a case that concerns of women are being taken seriously. If they weren't the number of women in EA wouldn't be growing.</li></ul></blockquote><p>If you recruit more women than you hurt and if you drive out and silence the ones who speak up, number of women will grow but that doesn't mean concerns of women are taken seriously. I'm not saying this is happening but your logic is flawed in many ways. Your implied casuality, ie, evidence that women's numbers are growing means concerns of women are taken seriously, is false.&nbsp;</p><blockquote><p>Likewise, polyamory is quite stigmatised and we don't really have many role-models or representation.</p></blockquote><p>Bay area EA has around 60% poly, so I'd say monogamists are the minority here.&nbsp;</p><blockquote><p>guess the question then is, if you possibly don't feel it wrong to assign a women more social status for being a good role-model for women as a woman, why do you feel uncomfortable when poly people are assigned more status for being a good role-model for poly people as a poly person themselves?</p></blockquote><p>Your original statement said \"if you're poly you're interesting and would be invited to speak on podcasts\" so matter-of-factly. That is very different from \"if you're a good role-model for poly people as a poly person...\". Good role models should get status, I agree, but that's not what you said. The equivalent of what you initially said would be \" if you're a man you're interesting and would be invited to speak on clearer thinking podcast etc\".</p><p>&nbsp;</p><blockquote><p>Which also speaks to a broader point: if you're poly you're interesting and get invited to speak on the Clearer Thinking podcasts etc etc</p></blockquote><p>&nbsp;</p><blockquote><p>a woman feeling bad and left out when they compare themselves to other women who have gained social status in part for sharing their experiences as women.</p></blockquote><p>Inverted casual reasoning. &nbsp;But if we look carefully at your first quote the order of events is being poly gets status that converts into the opportunity to speak on podcasts. But in your justification, sharing experiences gets status. Sharing experiences should get more status, but just being poly/mono shouldn't. Being a good role model for monogamous people and sharing that experience should also get higher status, but tell me dear friend, are they getting invited to podcasts? I am amazing at monogamy, the absolute best, do get me an invite. Or are these opportunities gate-kept?</p><p>&nbsp;</p><blockquote><p>I like big-tent EA so people with near any preference might also like doing EA stuff. They might even be EA leaders. But we shouldn't let their preferences automatically lead us to conclude that is the preference of the community as a whole.</p></blockquote><p>Have you heard of the netflix quote \"The actual company values, as opposed to the nice-sounding values, are shown by who gets rewarded, promoted, or let go.\" Almost all top rationalists are poly, many top EAs are as well. &gt;50% of bay area EA is poly while base population rate is 15% or less. Tell me this is not a preference of the community once again :) Tell me what monogamous people need to do to rise the ranks.&nbsp;</p>", "parentCommentId": "RCxhxSTcrhgjZRskB", "user": {"username": "Keerthana Gopalakrishnan"}}, {"_id": "yCurke4EzKDbYFfKL", "postedAt": "2023-02-22T12:15:52.519Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": null, "parentCommentId": "uSuSWAwqnHcecKjTw", "user": null}, {"_id": "FnrWAayAdtDhowheJ", "postedAt": "2023-02-22T14:51:21.090Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": null, "parentCommentId": "zQkMaGiny3X9vrSGA", "user": null}, {"_id": "PmSQP4m8YFKQhEamg", "postedAt": "2023-02-22T19:37:28.258Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": null, "parentCommentId": "GE8qBcsMeBWqsqqwA", "user": null}, {"_id": "uYsmntLbyxfpdHAa5", "postedAt": "2023-02-23T12:24:41.859Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": null, "parentCommentId": "jpSXpzMWNLkhJrp65", "user": null}, {"_id": "PfpjYYSJBCbsAiGpz", "postedAt": "2023-02-24T00:46:08.206Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": null, "parentCommentId": "Pgvukhm93AGHdANBY", "user": null}, {"_id": "ByXaZchXMN2s9bqA4", "postedAt": "2023-02-24T21:52:48.783Z", "postId": "aGkLx2hfr9s3mSdng", "htmlBody": null, "parentCommentId": "Z4a5hdwtjpCpG5f8J", "user": null}]