[{"_id": "jqGetYLPNpReBmZGh", "postedAt": "2022-09-10T17:25:12.320Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<blockquote><p>Just to briefly indicate the horns of the paradox: in order to avoid the “recklessness” of orthodox (risk-neutral) expected utility in the face of tiny chances of enormous payoffs, you must either <i>endorse</i> <i>timidity</i> or <i>reject transitivity</i>.</p><p>(...)</p><p>And rejecting transitivity strikes me as basically just giving up on the project of coherently systematizing how we should respond to uncertain prospects; I don’t view that as an acceptable option at all.</p></blockquote><p>&nbsp;</p><p>On orthodox expected utility theory (EUT), boundedness, and hence timidity if we can conceptualize \"enormous payoffs\"*, follows from standard decision-theoretic assumptions. Unbounded EU maximization violates the sure-thing principle, is vulnerable to Dutch books and is vulnerable to money pumps, all plausibly irrational. See, e.g. <a href=\"https://www.lesswrong.com/posts/gJxHRxnuFudzBFPuu/better-impossibility-result-for-unbounded-utilities?commentId=hrsLNxxhsXGRH9SRx\">Paul Christiano's comment with St. Petersburg lotteries</a> and my response. So, it's pretty plausible that unbounded EU maximization (and perhaps recklessness generally) is just inevitably formally irrational and similarly gives up on the same project of coherent systematization. Timidity seems like the only rational option. Even if it has unintuitive implications, it at least doesn't conflict with principles of rationality.</p><p>However, I'm not <i>totally</i> sure, and I just wrote <a href=\"https://www.lesswrong.com/posts/7jZAPw5tjyfdNG6oc/unbounded-utility-functions-and-precommitment\">this post</a> to discuss one of my major doubts. I do think all of this counts against normative realism about decision theory, though, and so Harsanyi's utilitarian theorem and probably moral realism generally.</p><p>* One might instead just respond that there are no enormous payoffs. We can only talk about enormous payoffs with timid/bounded EUT because we have two kinds of value: (in the kinds of cases we're interested in) impartial additive value, and decision-theoretic utility, as a function of this impartial additive value.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "ECDAgQah8FJ79gfKt", "postedAt": "2022-09-10T18:12:16.260Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>There are other appeals of neutrality (about adding \"positive\" lives or \"goods\") besides just avoiding the RC:</p><ol><li>It can avoid the Very Repugnant Conclusion, although some of your proposed solutions like critical levels would work, too.</li><li>Adding people at the cost to existing or otherwise necessary people. See <a href=\"https://forum.effectivealtruism.org/posts/CZKHZGzxX7GqLwdfx/why-do-you-find-the-repugnant-conclusion-repugnant?commentId=pu5KjhqrnsPig7iqD\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/CZKHZGzxX7GqLwdfx/why-do-you-find-the-repugnant-conclusion-repugnant?commentId=FXLJght9HQQsAGafF\">here</a>. I pretty much have the opposite intuition on the extinction vs party example from you, but I think the use of a party may confound people with intuitions against frivolousness or hedonism and is relatively low stakes for existing people. We can imagine cases where what's at stake for existing people seems much more serious: dreams or important life goals, suffering, freedom, spending time with loved ones, their lives (including <a href=\"https://www.tandfonline.com/doi/full/10.1080/0020174X.2019.1658631\">replacement arguments</a>, and <a href=\"https://en.wikipedia.org/wiki/Replaceability_argument\">the logic of the larder</a>), and so on. The views you defend here allow all of these to be outweighed by the addition of new people. Furthermore, while there may still be strong instrumental reasons for respecting reproductive freedom regardless (which you've discussed elsewhere), neutrality seems to give a stronger <i>principled</i> reason, since the welfare of a new child wouldn't make up for a parent's overall loss in welfare on its own under any circumstance. Getting the right answer for more principled reasons is more satisfying and on firmer ground.</li><li>In intrapersonal tradeoffs on theories where preferences matter terminally, it fits liberal, pluralistic and anti-paternalistic intuitions better. Under preference views that allow the addition of new contingent preferences to outweigh the lesser satisfaction of necessary preferences (and so violate neutrality with respect to adding satisfied preferences, but in a specific way), and ignoring indirect and instrumental reasons (which of course matter substantially in practice), it would in principle be good <i>for the individual</i> for you to violate any or all of their own existing preferences in order to induce/create and satisfy sufficiently strong new preferences in them. Preference-affecting views — basically person-affecting views, but treating individual preferences like persons* — can avoid this problem, and some can avoid \"symmetric\" problems at the same time, e.g. violating preferences to eliminate or prevent frustrated preferences (at least in the cases where it seems worst to do so).</li></ol><p>* although there are more fundamental distinctions we could make if we wanted, e.g. between intrapersonal and interpersonal tradeoffs.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "xuDzf8oixSmvmW98L", "postedAt": "2022-09-11T00:04:29.660Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Hi Michael! &nbsp;Thanks for your comments.</p><ol><li>I think my dialectical strategy works similarly against appealing to the Very Repugnant Conclusion to support neutrality. &nbsp;To avoid the intra-personal VRC (compatibly with other commonsense commitments about the harm of death), we'd need a theory that assigns suitably more weight to quality than quantity. And if you've got such a theory, you don't need neutrality for interpersonal cases either.</li><li>Fair enough if you just don't share my intuitions. &nbsp;I think it would be horribly evil for the present generation to extinguish all future life, merely to moderately benefit ourselves (even in not purely frivolous ways). &nbsp;When considering different cases, where there are much graver costs to existing people (e.g. full-blown replacement), I share the intuition that extreme sacrifice is not required; but appeal to <strong>some form of partiality or personal prerogative seems much more appropriate to me than denying the value of the beneficiaries</strong>. (I develop a view along these lines in my paper, '<a href=\"https://philpapers.org/rec/CHARTA-5\">Rethinking the Asymmetry</a>'.) &nbsp;Just like the permissibility of keeping your organs inside your own body is no reason to deny the value of potential beneficiaries of organ donation.<br><br>That last point also speaks to the putative desirability of offering a \"stronger <i>principled </i>reason\". &nbsp;Protecting bodily autonomy by denying the in-principle value of people in need of organ transplants would be horrifying, not satisfying. &nbsp;So I don't think that question can be adjudicated independently of the first-order question of which view is simply right on the merits.</li><li>How to deal with induced or changing preferences is <a href=\"https://www.utilitarianism.net/theories-of-wellbeing#changing-preferences\">a real problem for preferentist theories of well-being</a>, and IMO is a good reason to reject all such views in favour of more objective alternatives. &nbsp;Neutrality about future desires helps in some cases, as you note, but is utterly disastrous in others (e.g. potentially implying that a temporarily depressed child or teenager, who momentarily loses all his desires/preferences, might as well just die, even if he'd have a happy, flourishing future).</li></ol>", "parentCommentId": "ECDAgQah8FJ79gfKt", "user": {"username": "RYC"}}, {"_id": "mHfc6gDsAichv46f2", "postedAt": "2022-09-11T08:29:47.597Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>In fact, I don't even see the immorality of human extinction for someone interested in making people happy, unless the <i>thought of our species extinction</i>, or of <i>a future without our progeny</i>, or <i>the reality of not birthing progeny</i>, somehow makes us unhappy for genetic or social or cultural reasons. And that might be true. I think there was a movie about that, a dystopian near-future where humanity suddenly loses the ability to reproduce, and society collapsed. In principle, we could simply all use birth control, never have more children, and our species would die out.&nbsp;</p><p>Do you believe that we associate value with:</p><ul><li>&nbsp;our species continuance,&nbsp;</li><li>or with procreation,&nbsp;</li><li>or with having children in society,&nbsp;</li><li>or some other feature of continuing to make people,&nbsp;</li></ul><p>whether or not we make happy people?</p><p>I ask because I believe that the intellectual support for challenging indifference to future happy people (as opposed to nonexistent people) is weak.</p>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "32ZEkJPbGBHvyjTZj", "postedAt": "2022-09-11T08:40:16.678Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<blockquote><p>appeal to <strong>some form of partiality or personal prerogative seems much more appropriate to me than denying the value of the beneficiaries</strong></p></blockquote><p>I don't think this solves the problem, at least if one has the intuition (as I do) that it's not the <i>current existence</i> of the people who are extremely harmed to produce happy lives that makes this tradeoff \"very repugnant.\" It doesn't seem any more palatable to allow arbitrarily many people in the long-term future (rather than the present) to suffer for the sake of sufficiently many more added happy lives. Even if those lives aren't just muzak and potatoes, but very blissful. (One might think <i>that </i>is \"horribly evil\" or \"utterly disastrous,\" and isn't just a theoretical concern either, because in practice increasing the extent of space settlement would in expectation both enable <a href=\"https://reducing-suffering.org/omelas-and-space-colonization/\">many miserable lives and many more blissful lives</a>.)</p><p>ETA: Ideally I'd prefer these discussions not involve labels like \"evil\" at all. Though I sympathize with wanting to treat this with moral seriousness!</p>", "parentCommentId": "xuDzf8oixSmvmW98L", "user": {"username": "antimonyanthony"}}, {"_id": "LjTdkmmnBiMMveEwL", "postedAt": "2022-09-11T08:53:28.876Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<ol><li>Agreed.</li><li>That's a good point. I'd say the organ transplant case is disanalogous for basically person-affecting reasons (in the case where these contingent people don't come to exist, they have no need or interest to further satisfy), but to evaluate this claim of disanalogy, we need to consider \"the first-order question of which view is simply right on the merits\", as you say. (I'm not sympathetic to denying impartiality, though, and I don't think it solves the problem for tradeoffs between <i>other</i> people.)</li><li>I find the alternatives to desire theories worse overall, based on the objections to them you raise in your article and similar ones.</li></ol>", "parentCommentId": "xuDzf8oixSmvmW98L", "user": {"username": "MichaelStJules"}}, {"_id": "EPCJBJzivR8FM32F9", "postedAt": "2022-09-11T13:13:43.842Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Hi Noah, just to be clear on the dialectic: my post isn't trying to argue a committed anti-natalist <i>out</i> of their view. &nbsp;Instead, the population ethics section is just trying to make clear that Setiya's appeal to the \"intuition of neutrality\" is not a cost-free <i>solution</i> for someone with ordinary views who is worried about the repugnant conclusion, and in fact there are far better alternative solutions available that don't require resorting to neutrality. &nbsp;(Here I take for granted that my target audience shares the initial intuition that \"utopia is better than a barren rock\". &nbsp;Again, this isn't targeted at committed nihilists or anti-natalists who reject that claim.)</p><p>But you raise an interesting further question, of how one might best try to challenge \"indifference to future happy people\". &nbsp;I think it's pretty difficult to challenge indifference in general. If someone is <i>insistently</i> indifferent to non-human animal welfare (or the global poor, or...), for example, you're not realistically going to be able to argue them out of that.</p><p>That said, I think some rational pressure can be put on indifference to future good lives through a combination of:</p><p>(i) showing that the putative advantages of the view (e.g. apparent helpfulness for avoiding the repugnant conclusion) are largely illusory, as I argue in the OP, and</p><p>(ii) showing that the view introduces further costs, e.g. violating independently plausible principles or axioms.</p><p>I'm not going to pursue the latter task in any depth here, but just to give a rough sketch of how it might go, consider the following dilemma for anti-natalists. Either:</p><p>(a) They deny that future good lives can have impersonal value, which is implausibly nihilistic, or<br>(b) They grant this axiological claim, but then violate the bridging principle that we always have <i>some</i> moral reason to prefer an impersonally better world to a worse one (such that, <i>all else equal</i>, we should bring about the better world).</p><p>Of course, they can always just bite the bullet and insist that they don't find (a) bothersome. I think argument runs out at that point. &nbsp;You can't argue people out of nihilism. &nbsp;All you can do, I think, is to express sadness and discourage others from following that bleak path.</p>", "parentCommentId": "mHfc6gDsAichv46f2", "user": {"username": "RYC"}}, {"_id": "5NsovYfSmudCm6anf", "postedAt": "2022-09-11T13:27:20.675Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Interesting! &nbsp;Yeah, a committed anti-natalist who regrets all of existence -- even in an \"approximate utopia\" -- on the grounds that <i>even a small proportion of very unhappy lives automatically trumps the positive value of a world mostly containing overwhelmingly wonderful, flourishing lives&nbsp;</i> is, IMO, in the grips of... um (trying to word this delicately)... values I strongly disagree with. &nbsp;We will just have very persistent disagreements, in that case!</p><p>FWIW, I think those extreme anti-natalist values are unusual, and certainly don't reflect the kinds of concerns expressed by Setiya that I was responding to in the OP (or other common views in the vicinity, e.g. Melinda Roberts' \"deeper intuition that the existing Ann must in some way come before need-not-ever-exist-at-all Ben\").</p>", "parentCommentId": "32ZEkJPbGBHvyjTZj", "user": {"username": "RYC"}}, {"_id": "jebRCvjxjtztCrQe2", "postedAt": "2022-09-11T15:48:07.678Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<blockquote><p>certainly don't reflect the kinds of concerns expressed by Setiya that I was responding to in the OP</p></blockquote><p>I agree. I happen to agree with you that the attempts to accommodate the procreation asymmetry without lexically disvaluing suffering don't hold up to scrutiny. Setiya's critique missed the mark pretty hard, e.g. this part just completely ignores that this view violates transitivity:</p><blockquote><p>But the argument is flawed. Neutrality says that having a child with a good enough life is <a href=\"https://www.ted.com/talks/ruth_chang_how_to_make_hard_choices\">on a par</a> with staying childless, not that the outcome in which you have a child is equally good regardless of their well-being. Consider a frivolous analogy: being a philosopher is on a par with being a poet—neither is strictly better or worse—but it doesn’t follow that being a philosopher is equally good, regardless of the pay.</p></blockquote>", "parentCommentId": "5NsovYfSmudCm6anf", "user": {"username": "antimonyanthony"}}, {"_id": "Fw3Lve3LN4ncfRHnc", "postedAt": "2022-09-11T16:01:41.551Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>...Having said that, I do think the \"deeper intuition that the existing Ann must in some way come before need-not-ever-exist-at-all Ben\" plausibly boils down to some kind of <a href=\"https://www.fehige.info/pdf/A_Pareto_Principle_for_Possible_People.pdf\">antifrustrationist</a> or <a href=\"https://longtermrisk.org/tranquilism/\">tranquilist</a> intuition. Ann comes first because she has actual preferences (/experiences of desire) that get violated when she's deprived of happiness. Not creating Ben doesn't violate any preferences of Ben's.</p>", "parentCommentId": "jebRCvjxjtztCrQe2", "user": {"username": "antimonyanthony"}}, {"_id": "oHovqCRHf8gG7vCAR", "postedAt": "2022-09-11T18:19:54.879Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>I don't think so. &nbsp;I'm sure that Roberts would, for example, think we had more reason to give Ann a lollipop than to bring Ben into existence and give him one, even if Ann would not in any way be frustrated by the lack of a lollipop.</p><p>The far more natural explanation is just that we have person-directed reasons to want what is good for Ann, in addition to the impersonal reasons we have to want a better world (realizable by either benefiting Ann or creating &amp; benefiting Ben).</p>", "parentCommentId": "Fw3Lve3LN4ncfRHnc", "user": {"username": "RYC"}}, {"_id": "uGnPffeYvaDio2z7e", "postedAt": "2022-09-11T18:26:05.432Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>In fairness to Setiya, the whole point of parity relations (as developed, with some sophistication, by Ruth Chang) is that they -- unlike traditional value relations -- are not meant to be transitive. &nbsp;If you're not familiar with the idea, I sketch a rough intro <a href=\"https://www.philosophyetc.net/2007/07/parity-of-value-formal-model.html\">here</a>.</p>", "parentCommentId": "jebRCvjxjtztCrQe2", "user": {"username": "RYC"}}, {"_id": "8XTGhMruArLZjqma9", "postedAt": "2022-09-12T05:36:53.171Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Thank you for the reply!</p><p>I find the comparison you draw a bit pro-natalist. I can see comparing a utopia to a dystopia, where the utopia is obviously better. However, to reasonably compare utopia to a barren rock, you should believe that people living happy lives are somehow a container of moral value, and that by there being happy people existing, there's moral value or goodness in the fact of their existence.</p><p>I am comfortable with taking &nbsp;a person with moral status who currently exists as a given, and running calculations based on their moral status from there, on the presumption that I might make their life better or worse, and a moral thing to do is to contribute to their well-being, given that I affect them somehow. However, I cannot do the same calculations in their absence from existence.</p>", "parentCommentId": "EPCJBJzivR8FM32F9", "user": {"username": "Noah Scales"}}, {"_id": "8MsWJG9HBxsw49jHL", "postedAt": "2022-09-12T06:57:04.731Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<blockquote><p>I think it would be horribly evil for the present generation to extinguish all future life, merely to moderately benefit ourselves (even in not purely frivolous ways).</p></blockquote><p>\"Extinguish\" evokes the wrong connotations since neutrality is just about not creating new lives. You make it seem like there's going to be all this life in the future and the proponents of neutrality want to change the trajectory. This introduces misleading connotations because <a href=\"https://forum.effectivealtruism.org/posts/dQvDxDMyueLyydHw4/population-ethics-without-axiology-a-framework\">some views with neutrality</a> say that it's good to create new people if this is what existing people want, but not good to create new people for its own sake.<br><br>I think using the word \"extinguish\" is borderline disingenuous. [<strong>edit:</strong> I didn't mean to imply dishonesty – I was being hyperbolic in a way that isn't conducive to good discussion norms.]<br><br>Likewise, the Cleopatra example in the OP is misleading – at the very least it begs the question. It isn't obvious that existing people not wanting to die is a reason to bring them into existence. Existing people not wanting to die is more obviously a reason to not kill them once they exist.&nbsp;</p>", "parentCommentId": "xuDzf8oixSmvmW98L", "user": {"username": "Lukas_Gloor"}}, {"_id": "zDrubycBdKTdDttom", "postedAt": "2022-09-12T13:07:18.391Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>\"Disingenuous\"? &nbsp;I really don't think it's OK for you to accuse me of dishonesty just because you disagree with my framing of the issue. &nbsp;Perhaps you meant to write something like \"misleading\".</p><p>But fwiw, I strongly disagree that it's misleading. &nbsp;Human extinction is obviously a \"trajectory change\". Quite apart from what anyone wants -- maybe the party is sufficient incentive to change their preferences, for example -- I think it's perfectly reasonable to expect the continuation of the species by default. &nbsp;But I'm also not sure that default expectations are what matters here. Even if you come to expect extinction, it remains accurate to view <i>extinction</i> as <i>extinguishing</i> the potential for future life.&nbsp;</p><p>Your response to the Cleopatra example is similarly misguided. I'm not appealing to \"existing people not wanting to die\", but rather <i>existing people being glad that they got to come into existence</i>, which is rather more obviously relevant. (But I won't accuse you of dishonesty over this. &nbsp;I just think you're confused.)</p>", "parentCommentId": "8MsWJG9HBxsw49jHL", "user": {"username": "RYC"}}, {"_id": "yaAgQwvE3Gm3MaBby", "postedAt": "2022-09-12T13:32:50.641Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Funny that you use the phrase \"a bit pro-natalist\" as though that's a bad thing! &nbsp; I am indeed unabashedly in favour of good things existing rather than nothing at all. And I'm also quite unembarrassed to share that I regard good lives to be a good thing :-)</p><p>So yes, I think good lives <i>contain</i> value. &nbsp;You might be concerned to avoid the view that people are <i>merely</i> containers of value. &nbsp;But you shouldn't deny that our lives (when good for us) are, in fact, valuable.</p><p>I think the sensible view here is to distinguish personal and impersonal value. &nbsp;Creating value-filled lives is impersonally good: it makes the universe a better place. &nbsp;But of course we shouldn't <i>just</i> care about the universe. &nbsp;We should <i>also</i> care about particular persons.</p><p>Indeed, whenever possible (i.e. when dealing with existing persons, to whom we can directly refer), our concern should be <i>primarily</i> person-directed. &nbsp;Visit your friend in the hospital for <i>her</i> sake, not just to boost aggregate happiness. &nbsp;But not all moral action can be so personally motivated. To donate to charities or otherwise save \"statistical\" lives, we need to fall back on our general desire to promote the good. &nbsp;And likewise for solving the non-identity problem: preferring better futures over worse ones (when different people would exist in either case). And, yes, this fall-back desire to promote better outcomes should <i>also</i>, straightforwardly, lead us to prefer good futures over lifeless futures (and lifeless futures over miserable futures).</p><blockquote><p>I cannot do the same calculations in their absence from existence.</p></blockquote><p>Then you would give me a lollipop even at the cost of bringing many miserable new lives into existence. &nbsp;That would clearly be wrong. &nbsp;But once you bring yourself to acknowledge reasons to <i>not</i> bring bad lives into existence (perhaps because the eventual person would regret your violating them), there's no deep metaphysical difference between that and the <i>positive</i> reasons to bring good lives into existence (which the eventual person would praise your following).</p>", "parentCommentId": "8XTGhMruArLZjqma9", "user": {"username": "RYC"}}, {"_id": "gc7G7CEqtYNxKuq2Q", "postedAt": "2022-09-12T15:28:38.429Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Sorry, I didn’t mean to accuse you of dishonesty (I'm adding an edit to the OP to make that completely clear). I still think the framing isn’t defensible (but philosophy is contested and people can disagree over what's defensible).</p><blockquote><p>Even if you come to expect extinction, it remains accurate to view&nbsp;<i>extinction</i> as&nbsp;<i>extinguishing</i> the potential for future life.</p></blockquote><p>Yes, but that’s different from extinguishing future&nbsp;<i>people</i>. If the last remaining members of a family name tradition voluntarily decide against having children, are they “extinguishing their lineage”? To me, “extinguishing a lineage” evokes central examples like killing the last person in the lineage or carrying out an evil plot to make the remaining members infertile. It doesn’t evoke examples like “a couple decides not to have children.”</p><p>To be clear, I didn’t mean to say that <strong>I</strong><i>&nbsp;</i>expect extinction. I agree that what we expect in reality doesn’t matter for figuring out philosophical views (<a href=\"https://www.lesswrong.com/posts/2yW6DkhEaoKMFbNED/against-population-ethics?commentId=hsqjDEC2fETJ54w4Z\"><u>caveat</u></a>). I mentioned the point about trajectories to highlight that we can conceive of worlds where no one wants humanity to stick around for non-moral reasons (see&nbsp;<a href=\"https://archive.nytimes.com/opinionator.blogs.nytimes.com/2010/06/06/should-this-be-the-last-generation/\"><u>this example</u></a> by Singer). (By “non-moral reasons,” I’m not just thinking of some people wanting to have children. When people plant trees in their neighbourhoods or contribute to science, art, business or institutions, political philosophy, perhaps even youtube and tik tok, they often do so because it provides personal meaning in a context where we expect civilization to stay around. A lot of these activities would lose their meaning if civilization was coming to an end in the foreseeable future.) To evaluate whether neutrality about new lives &nbsp;is repugnant, we should note that it only straightforwardly implies “there should be no future people” in that sort of world.</p><blockquote><p>Your response to the Cleopatra example is similarly misguided. I'm not appealing to \"existing people not wanting to die\", but rather&nbsp;<i>existing people being glad that they got to come into existence</i>, which is rather more obviously relevant.</p></blockquote><p>I think I was aware that this is what you meant. I should have explained my objection more clearly. My point is that there's clearly an element of&nbsp;<i>deprivation</i> when we as existing people imagine Cleopatra doing something that prevents us from coming to exist. It's kind of hard – arguably even impossible – for existing people to imagine non-existence as something different from no-longer-existence. By contrast, the deprivation element is absent when we imagine not creating future people (assuming they never come to exist and therefore aren’t looking back to us from the vantage point of existence).<br><br>To be clear, it's perfectly legitimate to paint a picture of a rich future where many people exist and flourish to get present people to care about creating such a future. However, I felt that your point about Cleopatra had a kind of \"gotcha\" quality that made it seem like people don't have coherent beliefs if they (1) really enjoy their lives but (2) wouldn't mind if people at some point in history decide to be the last generation. I wanted to point out that (1) and (2) can go together.&nbsp;</p><p>For instance, I could be \"grateful\" &nbsp;in a sense that's more limited than the axiologically relevant sense – \"grateful\" in a personal sense but not in the sense of \"this means it's important to create other people like me.\" (I'm thinking out loud here, but perhaps this personal sense could be similar to how one can be grateful for person-specific attributes like introversion or a strong sense of justice. If I was grateful about these attributes in myself, that doesn't necessarily mean I'm committed to it being morally important to create people with those same attributes. In this way, people with the neutrality intuition may see existence as a person-specific attribute that only people who have that attribute can meaningfully feel grateful about. [I haven't put a lot of thought into this specific account. Another reply could be that it's simply unclear how to go about comparing one's existence to never having been born.])</p>", "parentCommentId": "zDrubycBdKTdDttom", "user": {"username": "Lukas_Gloor"}}, {"_id": "hdyRZfyfJk2vw2j2t", "postedAt": "2022-09-12T17:54:08.749Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>As far as people being containers of value, I don't find moral goodness in the mere fact of their existence at some level of happiness. This is easiest to tolerate with the view that a suffering person is not good by the fact of their existence or that a person that inflicts suffering on others is not good by the fact of their existence. However, I apply that view to all people, suffering or not, or that do or do not cause others to suffer.&nbsp;</p><p>A person's existence at some level of happiness or altruistic behavior is not sufficient to establish that their existence is good. Instead, they might have good experiences or do good actions. They might be successfully selfish or successfully altruistic or both or neither. In general, I just don't see any person's existence as good, per se. Experiences can be good, and experiences of existent things are usually better than experiences of illusory things. Likewise, actions of people can be good, and actions with good consequences are usually better than actions with merely good intentions. So, decided in terms of experiences or actions, a person can \"be\" good, but that form of \"being\" is really a linguistic shorthand for the person's experiences or actions.</p><p>I wrote:</p><blockquote><p>I cannot do the same calculations in their absence from existence.</p></blockquote><p>and you replied:</p><blockquote><p>Then you would give me a lollipop even at the cost of bringing many miserable new lives into existence. &nbsp;That would clearly be wrong.</p></blockquote><p>I was hoping to get some clarification of the thinking behind some of these thought experiments, and I guess I got some. I don't quite get the lollipop reference, maybe that you would give me the lollipop at that cost to me, and I wouldn't care? Or are &nbsp;you writing that, <i>since I can't do any calculations, I'd take any exchange of value</i>.</p><p>I think you mistook my meaning though. I'm capable of knowing that happy or unhappy future lives <i>could</i><strong> </strong>exist and can understand when exchanges of value serve my interests and when they don't.&nbsp;</p><p>However, unless I believe that people<i> will </i>exist, I don't consider them in my moral calculations. Some I do believe will exist, some I don't believe will exist. For example, I believe that many people will continue to be conceived over the next few decades.&nbsp;</p><p>I should have written, \"I cannot do the same calculations in the eternal absence of their existence.\" which is a bit more clear than \"I cannot do the same calculations in the absence of their existence.\" In fact, I take the fact of people existing as I find it, directly or indirectly, for example, through statistics about their existence or by face-to-face meetings.</p><p>I don't agree with the presumptions that:</p><ul><li><i>some set of people that you assert <strong>will</strong> exist therefore <strong>will </strong>exist. </i>I readily agree that they could, but not that they will. I believe that many people will continue to be conceived over the next few decades, for sure.&nbsp;</li><li><i>I might make people at some cost, or with some benefit, to myself. &nbsp;</i>I'm not fertile and I don't sponsor new conceptions somehow, except through my food choices, unintentionally.</li></ul>", "parentCommentId": "yaAgQwvE3Gm3MaBby", "user": {"username": "Noah Scales"}}, {"_id": "PWFvrdyBwWrTEyAgE", "postedAt": "2022-09-13T04:56:46.860Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<blockquote><p>Neutrality about future desires helps in some cases, as you note, but is utterly disastrous in others (e.g. potentially implying that a temporarily depressed child or teenager, who momentarily loses all his desires/preferences, might as well just die, even if he'd have a happy, flourishing future).</p></blockquote><p>I think if we're already counting implicit preferences, so that, for example, people still have desires/preferences while in deep dreamless sleep and those still count, it's very hard to imagine someone losing all of their desires/preferences without dying or otherwise having their brains severely damaged, in which case their moral status seems pretty questionable. There's also a question of whether this has broken (psychological) continuity enough that we shouldn't consider this the same person at all: this case could be more like someone dying and either being replaced by a new person with a happy, flourishing future or just dying and not being replaced at all. Either way, the child has already died.</p><p>If they'd have the same desires/preferences in the future as they had before temporarily losing them, then we can ask if this is due to a causal connection from the child before the temporary loss. If not, then this again undermines the persistence of their identity and the child may have already died either way, since causal connection seems necessary. If there is such a causal connection, then our answer here should probably match how we think about destructive mind uploading and destructive teleportation.</p><p>Of course, it may be the case that a temporarily depressed child just prefers overall to die (or otherwise that that's best according to the preference-affecting view), even if they'd have a happy, flourishing future. The above responses wouldn't work for this case. But keeping them alive involuntarily also seems problematic. Furthermore, if we think it's better for them to stay alive even if they're indifferent overall, then this still seems paternalistic in a sense, but less objectionably so, and if we're making continuous tradeoffs, too, then there would be cases where we would keep them alive involuntary for their sake and against their wishes.</p><p>There's also the possibility that a preference still continues to count terminally even after it's no longer held, so even after a person dies or their preferences change, but I lean towards rejecting that view.</p>", "parentCommentId": "xuDzf8oixSmvmW98L", "user": {"username": "MichaelStJules"}}, {"_id": "hwyNGgHK8LcyLDYKY", "postedAt": "2022-09-13T13:03:41.967Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>The connection to personal identity is interesting, thanks for flagging that! &nbsp;I'd emphasize two main points in reply:</p><p>(i) While preference continuity is a <i>component</i> of person identity, it isn't clear that it's essential. Memory continuity is classically a major component, and I think it makes sense to include other personality characteristics too. &nbsp;We might even be able to include values in the sense of <i>moral beliefs</i> that could persist even while the agent goes through a period of being unable to <i>care</i> in the usual way about their values; they might still acknowledge, at least in an intellectual sense, that this is what they think they <i>ought</i> to care about. &nbsp;If someone maintained all of those other connections, and just temporary stopped caring about anything, I think they would still qualify as the same person. Their past self has not thereby \"already died\".</p><p>(ii) re: \"paternalism\", it's worth distinguishing between <i>acting</i> against another's considered preferences vs merely <i>believing</i> that their considered preferences don't in fact coincide with their best interests. &nbsp;I don't think the latter is \"paternalistic\" in any objectionable sense. &nbsp;I think it's just obviously <strong>true </strong>that someone who is depressed or otherwise mentally ill may have considered preferences that fail to correspond to their best interests. &nbsp;(People aren't infallible in normative matters, even concerning themselves. &nbsp;To claim otherwise would be an extremely strong and implausible view!)</p><p>fwiw, I also think that paternalistic <i>actions</i> are <i>sometimes</i> justifiable, most obviously in the case of literal children, or others (like the temporarily depressed!) for whom we have a strong basis to judge that the standard Millian reasons for deference do not apply.</p><p>But that isn't really the issue here. We're just assessing the <i>axiological </i>question of whether it would, as a matter of principle, be bad for the temporary depressive to die--whether we should, as mere bystanders, <i>hope</i> that they endure through this rough period, or that they instead find and take the means to end it all, despite the bright future that would otherwise be ahead of them.</p>", "parentCommentId": "PWFvrdyBwWrTEyAgE", "user": {"username": "RYC"}}, {"_id": "jd4x4B32RaLeyr9TH", "postedAt": "2022-09-14T17:16:29.716Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>I think Richard was trying to make the point that</p>\n<ul>\n<li>You believe that actions that bring about or prevent the existence of future people have no moral valence</li>\n<li>Therefore, you believe that an action that brings about suffering lives is also morally neutral</li>\n<li>Therefore, you would take any small positive moral trade (like getting a lollipop) in exchange for bringing about arbitrarily large amounts of suffering lives</li>\n</ul>\n<p>If I'm not misinterpreting what you've said, it sounds like you'd be willing to bite this bullet?</p>\n<p>Maybe it's true that you won't <em>actually</em> be able to make these choices, but we're talking about thought experiments, where implausible things happen all the time.</p>\n", "parentCommentId": "hdyRZfyfJk2vw2j2t", "user": {"username": "caleb-biddulph"}}, {"_id": "yYCB4eSxoTrzFDpBE", "postedAt": "2022-09-14T19:10:28.706Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>I think that actions that avoid the conception of future people (for example, possible parents deciding to use birth control) have no moral significance as far as the future moral status of the avoided future being goes since that being never exists. &nbsp;</p><p>Why would my thinking that actions like using birth control are morally neutral imply that I should also think that having children is morally neutral?</p><p>Perhaps I will understand this better if you explain this to me carefully like I'm not that smart.</p>", "parentCommentId": "jd4x4B32RaLeyr9TH", "user": {"username": "Noah Scales"}}, {"_id": "jpovkhvPvCJuGmAzA", "postedAt": "2022-09-16T07:14:42.639Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Sounds like there are four distinct kinds of actions we're talking about here:</p>\n<ol>\n<li>Bringing about positive lives</li>\n<li>Bringing about negative lives</li>\n<li>Preventing positive lives</li>\n<li>Preventing negative lives</li>\n</ol>\n<p>I think I was previously only considering the \"positive/negative\" aspect, and ignoring the \"bringing about/preventing\" aspect.</p>\n<p>So now I believe you'd consider 3 and 4 to be neutral, and 2 to be negative, which seems fair enough to me.</p>\n<blockquote>\n<p>Why would my thinking that actions like using birth control are morally neutral imply that I should also think that having children is morally neutral?</p>\n</blockquote>\n<p>Aren't you implying here that you think having children is <em>not</em> morally neutral, and so you would consider 1 to be positive? Wouldn't 1 best represent existential risk reduction - increasing the chances that happy people get to exist? It sounds like your argument would support x-risk reduction if anything.</p>\n", "parentCommentId": "yYCB4eSxoTrzFDpBE", "user": {"username": "caleb-biddulph"}}, {"_id": "5PG5rdBJMzQnJp7Zv", "postedAt": "2022-09-16T09:07:35.551Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>You are correct about my assessments of 2-4. I would add 5 and 6:</p><ol><li>Bringing about conception of positive lives (morally neutral)</li><li>Bringing about conception of negative lives (morally negative)</li><li>Preventing conception of positive lives (morally neutral)</li><li>Preventing conception of negative lives (morally neutral)&nbsp;</li><li>making existing lives more negative (morally negative)</li><li>making existing lives more positive (morally positive)</li></ol><p>I see having children as either morally neutral or negative toward the child, not morally positive or negative toward the child. I see having children as morally negative toward other people, in our current circumstances. Overall, any decision to have children is hard to justify as morally neutral.</p><p>I guess I would feel more inclined to add:</p><p>7. Bringing about conception of positive lives that are also positive for other people (morally positive)</p><p>for the sake of the thought experiment.</p><p>Is there some perspective or implication that I'm still missing here?</p><p>I would like to know.</p>", "parentCommentId": "jpovkhvPvCJuGmAzA", "user": {"username": "Noah Scales"}}, {"_id": "viQG9rsrwEduTPeoM", "postedAt": "2022-09-16T12:49:57.787Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>What's the basis for claiming that (1) is neutral, rather than positive?</p>", "parentCommentId": "5PG5rdBJMzQnJp7Zv", "user": {"username": "RYC"}}, {"_id": "v8nheJE2RgPbEXtCL", "postedAt": "2022-09-16T16:08:12.989Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Looking ahead, believing that I will be a necessary cause in conception of a happy life of someone else, that leaves out the consequences for other people of the creation of that happy life. If I include those consequences, the balance of contributions to the self-interests of others (their welfare) tends towards neutral or negative. I should have written:&nbsp;</p><p>&nbsp;1. Bringing about conception of positive lives (morally neutral or negative)</p><p>but qualified with \"all other things equal\", I think the conception is just morally neutral. Why not morally positive? I find it hard to convince myself that happy experience or satisfaction of self-interest is ever morally neutral, but that is what we're talking about. I actually think that it's impossible. However, for thought experiment's sake, I added in 7.</p><p>7. Bringing about conception of positive lives that are also positive for other people (morally positive)</p><p>If someone could prove to me that, on balance, a positive life also contributes to other's lives overall, and that control of that life were possible to allow both experiences and behaviors aligned with a positive life that is also positive for others, then choice of conception of such a life, with that control available and utilized, would be morally positive. However, I don't believe that that control is available, much less utilized.</p><p>I'm also not comfortable with the problem of individual harm for collective help. So, for example, a situation that I take from:</p><p>+.-.*.*.*.*.*. &nbsp; (1 positive, 1 negative, 5 neutrals, 7 total)&nbsp;</p><p>to &nbsp;</p><p>+.+.-.+.+.+.-.* (5 positives, 2 negatives, 1 neutral, 8 total)</p><p>that is, turning most neutrals into positives but some neutrals into negatives (* is neutral), does not necessarily appeal to me. Adding a person to a population could contribute positively to most lives but harm some as well. In that case, I tend to see the consequences (and so the choice) of the additional person as morally negative, depending on the details.&nbsp;</p><p>Aaron Wolff in their <a href=\"https://forum.effectivealtruism.org/posts/LADQ6dTGsQ2BBMrBv/a-case-against-strong-longtermism-1#_2__First_Order_Concerns_About_the_Size_and_Goodness_of_the_Far_Future\">red team</a> mentions eating other beings having less positive value to the consumer than negative value for the consumed. Those sorts of asymmetries are common in modern life as we live it now (for example, in goods production vs use).</p><blockquote><p>From Aaron:</p><p>There is arguably also an asymmetry between how good a universe filled with pleasure would be compared to how bad a universe filled with pain would be because it is possible for pain to be much worse than pleasure is good. As Schopenhauer put it “A quick test of the assertion that enjoyment outweighs pain in this world, or that they are at any rate balanced, would be to compare the feelings of an animal engaged in eating another with those of the animal being eaten.” If you buy this argument, then even say a 25% chance of the future being dominated by astronomical suffering could offset a 75% chance of utopia or, similarly, if the future will likely contain relatively small pockets of astronomical suffering, that could fully offset any value outside those pockets.&nbsp;</p></blockquote>", "parentCommentId": "viQG9rsrwEduTPeoM", "user": {"username": "Noah Scales"}}, {"_id": "4TCRua69JRoHmPALC", "postedAt": "2022-09-16T18:12:36.754Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>I'm just talking about intrinsic value here, i.e. all else equal.</p><p>You write: \"Why not morally positive? I find it hard to convince myself that happy experience or satisfaction of self-interest is ever morally neutral, but that is what we're talking about. I actually think that it's impossible.\"</p><p>I have no idea what this means, so I still don't know why you deny that positive lives have positive value. &nbsp;You grant that negative lives have negative (intrinsic) value. &nbsp;It would seem most consistent to also grant that positive lives have positive (intrinsic) value. To deny this obvious-seeming principle, some argument is needed!</p>", "parentCommentId": "v8nheJE2RgPbEXtCL", "user": {"username": "RYC"}}, {"_id": "R2coLwmpnafA6nKC2", "postedAt": "2022-09-16T19:39:31.592Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>I mean that our lives are not consequence-free for others, so not morally neutral to live. Our lives are something along the lines of a negative-sum game, approaching a zero-sum game, but hard to equate to a positive sum game ever for all affected.</p><p>I haven't been discussing intrinsic value intentionally, more just the value to the self-interest of oneself or others.&nbsp;</p><p>Is there no difference to you?</p>", "parentCommentId": "4TCRua69JRoHmPALC", "user": {"username": "Noah Scales"}}, {"_id": "vtBbSPinZMBysoG8S", "postedAt": "2022-09-24T21:43:13.771Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>I'm curating this post. I think it helps fight a real confusion — the idea that utilitarianism (or consequentialism) is the only moral theory that needs to grapple with extremely counterintuitive (or \"repugnant\") conclusions.&nbsp;</p><p>As the author writes, \"gaps in a theory shouldn’t be mistaken for solutions.\" (I'm not, however, nearly as confident that consequentialism is ultimately the best answer.)</p><p>I also want to highlight:</p><ul><li>A summary of a paper that's prominently linked in the post: <a href=\"https://forum.effectivealtruism.org/posts/s42GKdCb2svwya9Li/paper-summary-a-paradox-for-tiny-probabilities-and-enormous\">Paper summary: A Paradox for Tiny Probabilities and Enormous Values (Nick Beckstead and Teruji Thomas)</a>.</li><li>Michael's <a href=\"https://forum.effectivealtruism.org/posts/AgQx44vtw5bi4LmBh/puzzles-for-everyone?commentId=ECDAgQah8FJ79gfKt\">critical comment</a>, which points out other appeals of neutrality (a position this post argues against), and also remarks that the counterintuitiveness of the party vs. future people scenario might be artificially boosted by negative connotations to partying. I think this kind of intuition-check is really useful. <a href=\"https://forum.effectivealtruism.org/posts/AgQx44vtw5bi4LmBh/puzzles-for-everyone?commentId=jqGetYLPNpReBmZGh\">Another comment</a> points out tensions between rationality and unbounded expected utility maximization, suggesting that we should embrace timidity.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "rW9s4SJ2TRBZvypM3", "postedAt": "2022-09-24T22:02:15.507Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Also, I saw this cited somewhere, I think showing that there's a Dutch book that results in a sure loss for any unbounded utility function (I haven't read it myself yet to verify this, though):</p>\n<p><a href=\"https://www.jstor.org/stable/3328594\">https://www.jstor.org/stable/3328594</a></p>\n<p><a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/1467-8284.00178\">https://onlinelibrary.wiley.com/doi/abs/10.1111/1467-8284.00178</a></p>\n<p><a href=\"https://academic.oup.com/analysis/article-abstract/59/4/257/173397\">https://academic.oup.com/analysis/article-abstract/59/4/257/173397</a></p>\n<p>(All links for the same paper.)</p>\n<p>EDIT: It's an infinite sequence of bets, each of which has positive EV, so you should take each if offered in order, one at a time, but all of them together leads to a sure loss, because each bet's win condition is the lose condition for the next bet, and the loss is equal to or greater in magnitude than the win value. However, to guarantee a loss, there's no bound on the number of bets you'll need to make, although never infinitely many (with probability 0, if the conjunctions of the conditions has probability 0), like repeated double or nothing.</p>\n", "parentCommentId": "jqGetYLPNpReBmZGh", "user": {"username": "MichaelStJules"}}, {"_id": "MpfBHD4GxxWmwDn6F", "postedAt": "2022-09-25T17:02:48.799Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Richard - Thank you for a super post. A great statement of the view that problem cases held against utilitarianism would also be problems for any other theory that aimed to be systematic.</p><p>I don't entirely agree that to stop systematic theorising is to stop thinking. &nbsp;Thinking can still be applied to making good decisions in particular cases and the balance between the particular and general principles can be debated. &nbsp;&nbsp;</p><p>I totally support your arguments in your post and your replies against neutrality on creating positive lives. &nbsp;I think this blog post by <a href=\"https://handsandcities.com/2021/03/14/against-neutrality-about-creating-happy-lives/\">Joseph Carlsmith</a> also makes the case against neutrality very well.</p><p>Thank you also for the &nbsp;recent series of fine articles on your blog, <a href=\"https://rychappell.substack.com\">Good Thoughts</a>. &nbsp;I would strongly recommend this to anyone interested in moral philosophy, utilitarianism and EA.&nbsp;</p>", "parentCommentId": null, "user": {"username": "James Aitchison"}}, {"_id": "st6sKfv2xqKmBuAyg", "postedAt": "2022-09-26T09:04:45.764Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Amen, Richard. Amen.&nbsp;</p>", "parentCommentId": null, "user": {"username": "David Thorstad"}}, {"_id": "Q4Moyw7QL3iuADiwz", "postedAt": "2022-09-26T11:07:44.563Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Hi,Richard. I will try again to think this through.&nbsp;</p><p>I think I understand your idea of intrinsic value better now. If I understand you properly:</p><ul><li>when I consider improvement to a person's life quality/happiness/etc to be morally positive all other things equal, then the person has intrinsic value to me. If I consider this true regardless of the person's identity, then people have intrinsic value to me.</li></ul><p>You might be right. For me a troublesome part of the thought experiment is the \"all other things equal\" part.</p><p>If I take a life of neutral happiness .*. and change it to one with much greater happiness .+., then I seem to have improved the situation. However, I am used to transformations like this:</p><p><strong>.*.*. &nbsp; &nbsp; &nbsp; &nbsp;=&gt; &nbsp; &nbsp; &nbsp; .-.+.</strong></p><p><strong>.-.-. &nbsp; &nbsp; &nbsp; =&gt; &nbsp; &nbsp; &nbsp; &nbsp;.*.+ .</strong></p><p><strong>.+.*. &nbsp; &nbsp; &nbsp; =&gt; &nbsp; &nbsp; &nbsp; .*.+.-. &nbsp;&nbsp;</strong></p><p><strong>.*.*.-. &nbsp;=&gt; &nbsp; &nbsp; &nbsp;.-.+.</strong></p><p><strong>.+.*.-. &nbsp; =&gt; &nbsp; &nbsp; .*.+.+.-.</strong></p><p><strong>.*.*.-.-.-. &nbsp; &nbsp;=&gt; &nbsp; &nbsp;.+.*.+.-.-.-.-.-.-.</strong></p><p>I do not see things like:</p><p><strong>.*. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;=&gt; &nbsp; &nbsp; .+.+.&nbsp;</strong></p><p><strong>.-. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;=&gt; &nbsp; &nbsp; .+.</strong></p><p>The <i>making people happy vs making happy people</i> thought experiment presumes that improvement in a person's quality of life has no impact on others, or that making a person happy or making a happy person is about just one person's life. It is not.</p><p>When you write:</p><blockquote><p>&nbsp;You grant that negative lives have negative (intrinsic) value. &nbsp;It would seem most consistent to also grant that positive lives have positive (intrinsic) value.</p></blockquote><p>Let me expand my list of moral positive/negative distinctions a little:</p><ol><li>Bringing about conception of positive lives (morally neutral)</li><li>Bringing about conception of negative lives (morally negative)</li><li>Preventing conception of positive lives (morally neutral)</li><li>Preventing conception of negative lives (morally neutral)&nbsp;</li><li>Making existing lives more negative (morally negative)</li><li>Making existing lives more positive (morally positive)</li><li>Bringing about conception of positive lives that are also positive for other people (morally positive)</li><li>Bringing about conception of positive lives that are negative for other people (morally negative)</li><li>Bringing about conception of negative lives that are negative for other people (morally negative)</li><li>Bringing about conception of negative lives that are positive for other people (morally negative)</li></ol><p>and now &nbsp;generalize it:</p><ol><li>preventing conception (morally neutral toward the eternally nonconceived)</li><li>making all lives more positive (morally positive toward all)</li><li>making any lives more negative (morally negative toward some)</li><li>making some lives more positive without affecting any others negatively (morally positive toward some)</li><li>conceiving negative lives (morally negative toward the conceived)</li><li>conceiving positive lives that are positive for all (morally positive toward all)</li><li>conceiving positive lives (morally positive toward the conceived)</li></ol><p>All that I mean there by morally positive or morally negative actions is actions that serve or work against the interests of a (sub)set of who the action affects. A person with a positive life for themselves is one with positive experience. A person with a positive life for others is one who takes actions with positive consequences for others.</p><p><a href=\"https://forum.effectivealtruism.org/posts/dAh93EB2m6R9EoZuD/will-longtermists-self-efface\">I do use \"intrinsic value\" to mean something</a>, but it's just one side of a partition of value by \"instrumental\" and \"intrinsic.\" Whether a person has intrinsic value only comes up for me in thought experiments about control of others and the implications for their moral status. By \"intrinsic value\" I do not mean a value that is a property of a person's identity (e.g., a friend) or type (e.g., human).&nbsp;</p><p>Rather, intrinsic value is value that I assign to someone that is value not contingent on whether they serve my interests by the manifestation of that value. For example, some person X might go have a romance with someone else even though I'm also interested in X romantically. That might upset me, but that person X has intrinsic value, so they get to go be romantic with whomever they want instead of me and I still factor them into my moral calculations.&nbsp;</p><p>EDIT: as far as what it means to factor someone into my moral calculations, I mean that I consider the consequences of my actions for them not just in terms of selfish criteria, but also in terms of &nbsp;altruistic or moral criteria. I run the altruism numbers, so to speak, or at least I should, for the consequences of my actions toward them.</p><p>A different partitioning scheme of value is between contingent value and absolute value, but that scheme starts to test the validity of the concept of value, so I will put that aside for the moment.&nbsp;</p><p>I want to head off a semantics debate about moral status in case that comes up. For me, moral status of a person only means that they figure in moral calculations of the consequences of actions. For me, a person having moral status does not mean that the person:</p><ul><li>is a container of some amount of goodness&nbsp;</li><li>is intrinsically good</li><li>has an existence that is good, per se</li><li>is someone for whom betterment of experience is good&nbsp;</li></ul><p>... according to some concept of \"good\" that I do not believe applies (for example, approval by god).</p><p>OK, so hopefully I explained my thinking a bit more fully.&nbsp;</p><p><s>Can someone reveal the paradox in my thinking to me, if there is one (or more)?</s></p><p>EDIT: As far as I know, I have not claimed that altruistic action or an altruistic consequence of an action is good in some way distinct from the fact of serving someone else's self-interests. That is, I am treating \"morally good action\" as another way of saying \"serving someone else's self-interests.\" I have not identified any form of \"moral goodness\" that is distinct from &nbsp;serving the self-interests of entities affected by actions or events in the world.&nbsp;</p><p>I recognize that it seems naive to treat moral goodness as simply serving other's self-interests. I have to answer questions like:</p><ul><li>who defines those interests or their importance to a person? (me, ultimately, using whatever evidence or causal models I have)</li><li>what epistemological assumptions support continuing my moral calculations for entities without instrumental value to me? (I assume that real-world events and other people are unpredictable or uncontrollable. Therefore, denying moral status to people I shouldn't can unexpectedly harm me in various ways.)</li><li>is it valid to call a moral calculus \"moral\" if it is contrasts with how morality is typically decided? (If I am clear about it, then people understand my choice of terms and that my &nbsp;approach to altruism or morality is my personal one, not a description of some wider standard)</li><li>is it moral to serve my own self-interest? (No. It's selfish. I think selfishness is really interesting.)</li><li>why do I perform moral calculations? &nbsp;(For selfish reasons.)</li><li>why do I ever behave &nbsp;morally instead of selfishly? (Good question.)</li></ul><p>I'm still stuck thinking that:</p><ul><li>eternally nonexistent people have no moral status.</li><li>there is nothing morally preferable about a world of happy people as opposed to a barren rock, but there is something personally preferable about a world of happy people.</li></ul>", "parentCommentId": "4TCRua69JRoHmPALC", "user": {"username": "Noah Scales"}}, {"_id": "qxTdcPpazKF9GoMFW", "postedAt": "2022-09-26T14:24:02.554Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "vtBbSPinZMBysoG8S", "user": {"username": "RYC"}}, {"_id": "GaayvxJ2Xmqqq4nvq", "postedAt": "2022-10-02T05:58:41.389Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Maybe a more descriptive title next time e.g. \"These ethics puzzles aren't just challenges for utilitarianism\" or something?</p>\n<p>Despite this post being curated and me reading nearly all your posts, I personally ignored this one because it made me think it was something like \"I've turned some sophisticated philosophical concepts/arguments into fun, simplistic games that you all can understand!\", whereas it actually makes an extremely good point that I wish people recognised much more often. (I finally gave in and read it when I saw it on the EA UK newsletter just now.)</p>\n<p>Mostly too late now as it's no longer curated, plus I'm only one data point and not really your target audience, but maybe still worth changing and/or a general thing to bear in mind for the future.</p>\n", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "iggXTz57RZY4Q3qx4", "postedAt": "2022-10-02T10:47:50.063Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Ah, yeah that makes sense. &nbsp;Thanks for the feedback!</p>", "parentCommentId": "GaayvxJ2Xmqqq4nvq", "user": {"username": "RYC"}}, {"_id": "fCzNEsXuQeijCRbyF", "postedAt": "2022-10-03T08:52:20.745Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>Though note that infinite sequences of choices are a well known paradox-ridden corner of decision theory, so proving that a theory falls down there is not conclusive.</p><p>I feel that exotic cases like this are interesting and help build up a picture of difficult cases for theories to cover, but don't count strongly against particular theories which are shown to fail them. This is because it isn't clear whether (1) any rival theories can deal with the exotic case, or (2) whether usual conditions (or theories) need to be slightly modified in the exotic setting. In other words, it may be another area where the central idea of Richard's post ('Puzzles for Everyone') applies.</p>", "parentCommentId": "rW9s4SJ2TRBZvypM3", "user": {"username": "Toby_Ord"}}, {"_id": "NEAKJYD6hZK7uPCYc", "postedAt": "2022-10-03T14:20:12.796Z", "postId": "AgQx44vtw5bi4LmBh", "htmlBody": "<p>There are also other cases, involving St. Petersburg-like lotteries as I mentioned in my top-level comment, and possibly others that only require a bounded number of decisions. There's a treatment of decision theory here that derives \"boundedness\" (EDIT: lexicographically ordered ordinal sequences of bounded real utilities) from rationality axioms extended to lotteries with infinitely many possible outcomes:</p>\n<p><a href=\"https://onlinelibrary.wiley.com/doi/pdf/10.1111/phpr.12704\">https://onlinelibrary.wiley.com/doi/pdf/10.1111/phpr.12704</a></p>\n<p>I haven't come across any exotic cases that undermine the rationality of EU maximization with bounded utility functions relative to unbounded EU maximization, and I doubt there are, because the former is consistent with or implied by extensions of standard rationality axioms. Are you aware of any? Or are you thinking of conflicts with other moral intuitions (e.g. impartiality or against timidity or against local dependence on the welfare of unaffected individuals or your own past welfare)? Or problems that are difficult for both bounded and unbounded, e.g. those related to the debate over causal vs evidential decision theory?</p>\n<p>We could believe we need to balance rationality axioms with other normative intuitions, including moral ones, so we can favour the violation of rationality axioms in some cases to preserve those moral intuitions.</p>\n", "parentCommentId": "fCzNEsXuQeijCRbyF", "user": {"username": "MichaelStJules"}}]