[{"_id": "oGCwiByrBfcR3LG7f", "postedAt": "2024-03-23T16:45:12.018Z", "postId": "agynLdbnurzJ9xsLr", "htmlBody": "<p>Nice summarization! I generally see model registries as a good tool to ensure deployment safety by logging versions of algorithms and tracking spikes in capabilities. I think a feasible way to push this into the current discourse is by setting it in the current algorithmic transparency agenda.&nbsp;</p><p>&nbsp;</p><p>Potential risks here include who decides what is a new version of a given model. If the nomenclature is left in the hands of companies, it is prone to be misused. Also, the EU AI Act seems to take a risk-based approach, with the different kinds of risks being more or less lines in the sand.</p><p>&nbsp;</p><p>Another important point is what we do with the information we gather from these sources - I think there are \"softer\"(safety assessments, incident reporting) and \"harder\"(bans, disabling) ways to go about this. It seems likely to me that governments are going to want to lean into the softer bucket to enable innovation and have some due process kick in. This is probably more true with the US which has always favoured sector-specific regulation.</p>", "parentCommentId": null, "user": {"username": "Heramb Podar"}}, {"_id": "EPNfyKdqXNusbCapb", "postedAt": "2024-03-23T16:47:37.782Z", "postId": "agynLdbnurzJ9xsLr", "htmlBody": "<p>Also, here is a<a href=\"https://carnegieendowment.org/2022/12/09/what-china-s-algorithm-registry-reveals-about-ai-governance-pub-88606\"> link</a> if anyone wants to read more on the China AI registry which seems to be based on the <a href=\"https://arxiv.org/pdf/1810.03993.pdf\">model cards</a> paper</p>", "parentCommentId": null, "user": {"username": "Heramb Podar"}}, {"_id": "a7bQS5cBh3dHAbDCw", "postedAt": "2024-03-25T13:36:10.193Z", "postId": "agynLdbnurzJ9xsLr", "htmlBody": "<p><strong>Executive summary:</strong> Model registries are an emerging form of AI governance that require developers to submit information about AI models to a centralized database, enabling governments to track and regulate AI development.</p><p><strong>Key points:</strong></p><ol><li>Model registries require submitting basic information about AI models (purpose, size, algorithms) and sometimes more detailed data (benchmarks, risks, safety assessments).</li><li>Registries allow governments to monitor the AI industry, target regulations at specific models, and enforce an \"algorithms as entry point\" governance approach.</li><li>Precedents exist in other domains like pharmaceutical registries, which require safety testing, incident reporting, and postmarket surveillance.</li><li>China has the most comprehensive registry requirements, the EU requires registration of \"high-risk\" systems, and the US focuses on compute power thresholds.</li><li>Model registries indicate differing regulatory priorities: content control (China), citizen rights (EU), and national security (US).</li><li>Registries will enable future regulations like mandatory safety assessments, transparency, incident reporting, and postmarket evaluations.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]