[{"_id": "N3rmLfWRCoJTTJfSh", "postedAt": "2015-03-09T19:03:18.973Z", "postId": "AH9dEWDtCxsFWDEJv", "htmlBody": "<p>In what respects do we think EAs are disproportionately weird, and how problematic are they?</p>\n<p>Being rationalist and geeky spring to mind; in extreme forms, these are offputting to some people who'd otherwise be receptive to EA, but I'm not sure that that's true of the milder forms that are more common among EAs. Some causes are also offputtingly weird to parts of our audience.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "FX7xmJNt9BTfLeKLa", "postedAt": "2015-03-11T10:48:25.298Z", "postId": "AH9dEWDtCxsFWDEJv", "htmlBody": "<p>Some aspects of this broader post (mostly model #5) might also be a commentary on some recent posts on “dressing well.” Those seem to apply when you go leafleting in some very diverse locale or hold a presentation where you hardly know the audience, but usually you know where you leaflet and you know some things about your audience, and then specific forms of global weirdness may actually make you fit in with that specific group, build rapport, signal high status, etc.</p>\n<p>At a company where I worked software developer I once, on a whim, wore a single-breasted suit jacket over my turtleneck, all black. It was totally weird and drew confused looks. My colleagues thought I was going somewhere after work where that apparel would’ve been appropriate. In another locale, all the high-status people wore too-large, faded, and holey pullovers (and other such pieces) probably to signal that what they value in their apparel are its thermal properties and not the social ones (ironically).</p>\n<p>My take-away from that was that if I engage in in-person outreach efforts, I’d have to dress in various very different ways according to the audience—and that seems to be in line with the usual leafleting tips.</p>\n<p>However I don’t often engage in such outreach. It’s more common that I’m among friends and would like to influence them. Among my friends, unconscious processes will likely already have influenced my own preferences in such a way that they fit the social dynamics of the group.</p>\n<p>Then there’s also the aspect that my friends value some degree of anti-inductivity, contrarianism, and meta-contrarianism of various levels, so weirdness itself can be high-status even group-locally when it seems sensible or at least not less sensible than the social default.</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "EgfuRGmJG735Sx2d9", "postedAt": "2015-03-11T12:35:01.059Z", "postId": "AH9dEWDtCxsFWDEJv", "htmlBody": "<p>if by 'weird' we simply mean 'unusual', I would have thought being very highly educated is the strongest way in which EAs are weird.</p>\n", "parentCommentId": "N3rmLfWRCoJTTJfSh", "user": {"username": "AGB"}}, {"_id": "CHR9rsoJgSLJwsGaC", "postedAt": "2015-03-13T04:41:49.541Z", "postId": "AH9dEWDtCxsFWDEJv", "htmlBody": "<p>By that definition, plausibly (though we're even more niche than that). Being very highly educated doesn't seem to have especially concerning costs of the sorts that Katja sketched, partly because the prospects we're currently reaching are highly educated too. Also, perhaps needless to say, the highly educated are disproportionately high earning, and while we should be trying to reach everyone there's a case for prioritising these people while our reach is quite small.</p>\n", "parentCommentId": "EgfuRGmJG735Sx2d9", "user": {"username": "Tom_Ash"}}, {"_id": "NAKtgCuPH5b5HiPaz", "postedAt": "2015-03-13T10:39:27.447Z", "postId": "AH9dEWDtCxsFWDEJv", "htmlBody": "<p>Highly educated can have trouble relating to the non highly educated. This is a wierdness cost that has echoes in numbers 2-6. The good news is that we can mitigate this cost fairly easily by reaching out to people on their own terms and building a broader movement. :)</p>\n", "parentCommentId": "CHR9rsoJgSLJwsGaC", "user": {"username": "tomstocker"}}, {"_id": "LpkDZejhM7K3tayCo", "postedAt": "2015-03-15T21:54:28.982Z", "postId": "AH9dEWDtCxsFWDEJv", "htmlBody": "<p>My problem with the 'weirdness as social-rhetorical calculus cost' theory is that I think it's more valuable to see social weirdness in a different way, which is as the measure of variance between your and another person's beliefs.</p>\n<p>Weirdness, in many ways, is very very very good. We create better ideas when we a) have access to new ideas, and b) access to lots of different kinds of ideas. People with access to new ideas are often seen as weird, and you need to be weird yourself to search for or find a profusion of different perspectives, so people with better ideas are practically inevitably weird, despite all of the weird people with terrible ideas.</p>\n<p>So, rhetorically, if you have a weird idea, it's helpful to find what is integral, universal, and generic about it, such that when you try to explain it to people they don't explode over how weird it is. An example: a friend was telling his partner about creating a house built around the tree, but planting the tree as a sapling in a container above, and then training its roots as they grew through the house so that they were effectively living inside of, or underneath and within, a treehouse, but the partner thought this was very very strange until my friend mentioned that people train vines along trellises all the time, and it's the same idea.</p>\n", "parentCommentId": null, "user": {"username": "SASS"}}, {"_id": "5dD43fyuGJv77Fsbd", "postedAt": "2015-03-16T18:07:30.051Z", "postId": "AH9dEWDtCxsFWDEJv", "htmlBody": "<p>Great article addressing an important question. I've had a lot of similar concerns being active in environmental politics - thinking, did you HAVE to wear that to this interview, or did you HAVE to dye your hair that colour? This is, I think, a case of #6, specifically weirdness as a signal of a stereotype.</p>\n<p>For environmentalism, the worry is that a potential audience will switch off immediately because they can caricature the activist as part of a particular set of people who are all very alike, and as a group are very different to the audience. If all greens have green, dreadlocked hair and wear oriental patterns on their baggy trousers, the danger is that weirdness doesn't just look like an expression of honest individuality, it's actually quite the opposite - a signal of belonging to a distinct group which has little in common with many of those it ought to be seeking to persuade. </p>\n<p>For EA, I'm not sure if the same danger rears its head. I'm sure in ten years it might be possible to stereotype and caricature effective altruists, but the stereotype doesn't exist in the public mentality quite yet. For that reason, it's not so easy simply to switch off and say, &quot;Nah, that stuff is just for altruists&quot;, treating altruists as a kind of subculture. And it's fairly unlikely that we will become a subculture - as has been noted, if there's something weird that does unite EAers, it's probably a particular stance on morality, rationality and so on - things which are fairly cerebral and need not have any obvious external presence. The things that are noticeably weird about us tend not to be shared, and so don't contribute to the possibility of stereotyping. </p>\n<p>And when you have the occasional weirdness that's just an honest, personal thing, and you're a generally nice person on the whole, it's not weird at all - it's charming, it's eccentric, and it probably does an awful lot more good than being identikit and grey.</p>\n", "parentCommentId": null, "user": {"username": "Luke_Ilott"}}]