[{"_id": "H5nmMeDZSWF6uyJfQ", "postedAt": "2022-10-20T14:42:35.636Z", "postId": "AhFJkTn77GwhqDuRH", "htmlBody": "<p><i>Just wanted to share a short and rough draft version of my notes (not transcript), as it might save some people time.&nbsp;</i></p><p><i>I'm moderately confident that it covers 80% of the video's content, but am quite sure that it misses one or two important points and details.&nbsp;</i></p><p>&nbsp;</p><p><strong>How to innovate on purpose</strong></p><ul><li>It’s not useful to think it requires being a genius (Einstein)</li><li>It’s not useful to think it’s about luck (wonderful idea from within the bathtub)</li></ul><p>&nbsp;</p><p><strong>Innovative ideas need to be ...</strong></p><p><strong>a) ... impossible until now</strong></p><p>I.e. looking at existing technology and thinking about using it in new ways; e.g. Machine Learning applied to cars → Google self-driving cars</p><p>To-do:</p><ul><li>Learn promising technology very well</li><li>Ask the question: \"What industries has this technology not been applied to yet?\"</li></ul><p>&nbsp;</p><p><strong>b) ... undiscoverable to others</strong></p><p>I.e. find out what multiple topics / things you know, and thereby realising your potentially unique overlaps; e.g. programming language design + cloud computing → developing programming language specifically designed for cloud computing</p><p>To-do:</p><ul><li>Pick two unrelated topics you know a lot about</li><li>Ask the question: “What does combining them make possible?”</li></ul><p>&nbsp;</p><p><strong>c) ... stupid sounding</strong></p><p>I.e. find the overlap between ideas that seem like a bad and a good idea at the same time, because you know some secret that makes the stupid idea seem like a good one; e.g., “let’s have anonymous random people argue to decide the facts on every topic” and “let’s have everyone trust this information” → Wikipedia</p><p>To-do:</p><ul><li>Ask the question: “What's an important truth you know that few do?”</li><li>Ask the question: “What seems dumb unless you know this truth?</li></ul><p>&nbsp;</p><p><strong>d) ... tiny at first</strong></p><p>I.e. find the overlap between things people care about and weird people like you care about; e.g. “people can’t easily find Bay Area events, I will send an email list to my friends” and “I will let other people post their events too” → Craigslist</p><p>To-do:</p><ul><li>Tackle a problem had by a small group you understand</li><li>Slowly expand the features for a larger and larger group</li></ul><p><br>&nbsp;</p><p><strong>Entrepreneurial success depends on:</strong></p><ul><li>Quality of idea</li><li>Time commitment</li><li>Ability to build the product</li><li>Propensity to learn from feedback</li><li>Skill at securing funds</li><li>Relentless pursuit of success</li><li>Sales and marketing skills</li><li>Leadership</li><li>Random chance</li></ul>", "parentCommentId": null, "user": {"username": "Nils"}}]