[{"_id": "Eas9TRAgxregqKpsq", "postedAt": "2023-05-28T05:22:53.910Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<blockquote><p>I think a Russian war with a European state has probably increased simply based on Russia’s revealed willingness to go to war</p></blockquote><p>I don't think this is right- \"Russia\" doesn't make actions, Vladimir Putin does; Putin is 70, so he seems unlikely to be in power once Russia has recovered from the current war; there's some evidence that other Russian elites didn't actively want the war, so I don't think it's right to generalize to \"Russia\".</p><blockquote><p>This makes me more confused about whether China committed to a military confrontation with the West. If it has, and China believed it had more military-industrial capacity than the West (which is what I’d believe if I was China), then now is the perfect opportunity to drain Western stocks further and prop up its ally (?) by pumping weapons into Russia (see previous forecasting question).</p></blockquote><p>A US-China war would be fought almost entirely in the air and sea; Ukraine is fighting almost entirely on land. The <a href=\"https://crsreports.congress.gov/product/pdf/IF/IF12040\">weapons</a> Ukraine has receive are mostly irrelevant for a potential US-China war; e.g. the Marines have already decided to stop using tanks entirely, and the US being capable of shipping the vast amounts of artillery ammunition being consumed in Ukraine to a combat zone would require the US-China war to already be essentially won.<br><br>Weapons being sent to Ukraine are from drawdown stocks, which Taiwan itself hasn't previously been eligible to receive. Taiwan instead purchases new weapons, but there are many, many other countries purchasing similar types of weapons, and if the US were to become concerned, I'd expect it to prioritize both Ukraine <i>and</i> Taiwan over e.g. Saudi Arabia or Egypt.</p><p>(There is <i>some</i> overlap, to be clear, and this might change in the future.)</p>", "parentCommentId": null, "user": {"username": "alexrichard"}}, {"_id": "QdYprMMzsrrnBM3q5", "postedAt": "2023-05-28T08:12:35.321Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>Writing from Latvia here. One thing I've noticed is the extent to which outside observers underestimate the agency of smaller countries: either Ukraine, or newer NATO members. &nbsp;The interests and the resolve of the newer NATO members to join NATO to defend themselves is still neglected in the opinions of some prominent public intellectuals. The term \"NATO expansion\" is misleading, \"NATO enlargement\" is better.</p><p>One example how, I suspect, &nbsp;underestimation of agency did lead to wrong predictions: many predicted that the leadership of Ukraine, and the cities of Kyiv and even Lviv would quickly fall. Did not happen. (Admittedly I did not quantify predictions at the time and still feel quite ignorant about the many factors involved.)&nbsp;<br>https://www.metaculus.com/questions/9743/zelenskyy-remains-president-of-ua-by-2023/<br>https://www.metaculus.com/questions/9939/kyiv-to-fall-to-russian-forces-by-april-2022/<br>https://www.metaculus.com/questions/9899/russian-troops-in-lviv-in-2022/</p>", "parentCommentId": null, "user": {"username": "akanepajs"}}, {"_id": "HzxKiwMvP9XN8JyeX", "postedAt": "2023-05-28T10:52:04.842Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>Has this line of thinking led you to consider whether it's a good use of <i>anybody's</i> time to pay attention to geopolitical events unless they are directly connected to their life in some way - through family or work, or (at a stretch) through participation in a forecasting tournament?</p><p>A minimal level of engagement is warranted simply because we want to be citizens of the world, but diminishing returns appear to set in incredibly quickly. It seems to be, as you imply, an inefficient use of time that can actually distract us from more important activities.</p>", "parentCommentId": null, "user": {"username": "Paul Currion"}}, {"_id": "gRgRz7vxdqeKGELJA", "postedAt": "2023-05-28T11:21:44.693Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<blockquote><p>How bad is authoritarianism anyways? China and Taiwan’s life satisfaction isn’t that different.</p></blockquote><p>&nbsp;</p><p>I'm not sure why this is deeply confusing. I don't think we should be assessing whether or not authoritarian regimes are bad or not based on measures of life satisfaction, and if that is what one wants to do then certainly not contemplating it via a 1v1 comparison of just two countries.&nbsp;</p><p>Is the claim that they are not that different on this metric true - where is the source for this and how many alternative sources or similar metrics are there? If true, are all the things that feed into people's responses to a survey about life satisfaction in these different places the same (how confident are they that they can give their true opinions, and how low have their aspirations or capacity to contemplate a flourishing life become), and are the measures representative of the actual population experience within those countries (what about the satisfaction of people in encampments in China that help sustain the regime and quash dissent)?</p><p>Even granted that the ratings really reflect all the same processes going on in each country and that it is representative, Taiwan lives under threat of occupation and invasion, and there are many other differences between the two countries. The case is then just a confounded comparison of 1 country vs &nbsp;1 other, which is not an especially good comparison of whether the one variable chosen and used to define those countries makes a difference or not.</p>", "parentCommentId": null, "user": {"username": "Jamie Elsey"}}, {"_id": "HbNqd5kSteLjJfYgx", "postedAt": "2023-05-28T16:09:10.234Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<blockquote><p><strong>Conditional on Russia losing, is the world a safer place?</strong><br>I think maybe a bit, in a general “don’t reward conquest” sort of way</p></blockquote><p><br><strong>&nbsp;</strong>I would like to add another reason in favor: Russia broke the <a href=\"https://en.wikipedia.org/wiki/Budapest_Memorandum\">https://en.wikipedia.org/wiki/Budapest_Memorandum</a> where they and other states provided security guarantees to post-Soviet states (including Ukraine) to hand over their nuclear weapons. If Russia wins this war it clearly sends a message that one should never get rid of nukes since it increases the risk of an invasion. I mean it has already sent these signals since they invaded, but the message would be even stronger of they get away with the invasion. Clearly states which are not a part of NATO should get nukes if they want to be safe. This is a very bad development for global nuclear security obviously. I actually think that if one takes nuclear security seriously, Budapest Memorandum signatories have not done enough to help Ukraine considering the fact that the invasion is still ongoing over one year after the invasion started and they provided very little help when the war started in 2014.</p><p>Now I'm not even considering all the other agreements and international laws of wars broken by Russia, which also decrease global cooperation and stability. But obviously if they get away with breaking these it also sends a bad message globally.</p>", "parentCommentId": null, "user": {"username": "DaneelO"}}, {"_id": "kAzexSyoRpdQNgDM5", "postedAt": "2023-05-29T05:30:07.885Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>The Budapest Memorandum provided security assurances, not security guarantees. And I believe this war has already caused enough damage to Russia that we can't talk about Russia \"getting away with\" the invasion.</p><p>The destruction of the Russian military should be expected to make the world safer primarily because it will prevent future Russian agression.&nbsp;</p>", "parentCommentId": "HbNqd5kSteLjJfYgx", "user": {"username": "Søren Elverlin"}}, {"_id": "ZAnRiBbupu5AvXwTM", "postedAt": "2023-05-29T17:43:41.335Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>I agree that the agency of newer NATO members (or Ukraine) has been neglected. Still, I don't think this was a primary driver of underestimating Ukraine's chances -- unless I'm missing what \"agency\" means here.&nbsp;</p><p>I assume predictions were dim about Ukraine's chances at the beginning of the war primarily because Russia and the West had done an excellent job of convincing us that Russia's military was highly capable. E.g., I was disconcerted by the awe/dread with which my family members in the US Army spoke about Russian technical capabilities across multiple domains.&nbsp;</p><p>That said, I think some of these predictions came from a sense that Ukraine would just \"give up\". In which case, missing the agency factor was a mistake.&nbsp;</p>", "parentCommentId": "QdYprMMzsrrnBM3q5", "user": {"username": "JoelMcGuire"}}, {"_id": "jP3FCHNgewzZjxjhA", "postedAt": "2023-05-29T18:07:26.752Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>Fair jabs, but the PRC-Taiwan comparison was because it was the clearest natural experiment that came to mind where different bits of a nation (shared language, culture, etc.) were somewhat randomly assigned to authoritarianism or pluralistic democracy. I'm sure you could make more comparisons with further statistical jiggery-pokery.&nbsp;</p><p>The PRC-Taiwan comparison is also because, imagining we want to think of things in terms of life satisfaction, it's not clear there'd be a huge (war-justifying) loss in wellbeing if annexation by the PRC only meant a relatively small dip in life satisfaction. This is the possibility I found distressing. Surely there's something we're missing, no?</p><p>I think inhabitants of both countries probably have similar response styles to surveys with these scales. Still, if a state is totalitarian, we should probably not be surprised if people are suspicious of surveys.&nbsp;</p><p>Sure, Taiwan could be invaded, and that could put a dampener on things, but, notably, Taiwan is more satisfied than its less likely to be invaded peers of similar wealth and democracy: Japan and South Korea.</p><p>I expect one response is, \"well, we shouldn't use these silly surveys\". But what other existing single type of measure is a better assessment of how people's lives are going?&nbsp;</p><p>Taiwan has about a 0.7 advantage on a 0 to 10 life satisfaction scale, with most recently, 5% more of the population reporting to be happy.</p><figure class=\"media\"><div data-oembed-url=\"https://ourworldindata.org/grapher/happiness-cantril-ladder?region=Asia\">\n\t\t\t\t\t<div data-owid-slug=\"happiness-cantril-ladder\" class=\"owid-preview\">\n\t\t\t\t\t\t<iframe src=\"https://ourworldindata.org/grapher/happiness-cantril-ladder?region=Asia\">\n\t\t\t\t\t&lt;/div&gt;\n\t\t\t\t</iframe></div></div></figure><figure class=\"media\"><div data-oembed-url=\"https://ourworldindata.org/grapher/share-of-people-who-say-they-are-happy?country=TWN~CHN\">\n\t\t\t\t\t<div data-owid-slug=\"share-of-people-who-say-they-are-happy\" class=\"owid-preview\">\n\t\t\t\t\t\t<iframe src=\"https://ourworldindata.org/grapher/share-of-people-who-say-they-are-happy?country=TWN~CHN\">\n\t\t\t\t\t&lt;/div&gt;\n\t\t\t\t</iframe></div></div></figure>", "parentCommentId": "gRgRz7vxdqeKGELJA", "user": {"username": "JoelMcGuire"}}, {"_id": "ZH7AbpAP7wkenBaMm", "postedAt": "2023-05-29T18:12:52.273Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>Hah! Yeah, stepping back, I think these events are a distraction for most people. Especially if they worsen one's mental health. For me, reflecting on the war makes me feel so grateful and lucky to live where I do.&nbsp;</p><p>Another reason to pay attention is when it seems like it could shortly and sharply affect the chances of catastrophe. At the beginning of the war, I kept asking myself, \"At what probability of nuclear war should I: make a plan, consider switching jobs, move to Argentina, etc.\" But I think we've moved out of the scary zone for a while.&nbsp;</p>", "parentCommentId": "HzxKiwMvP9XN8JyeX", "user": {"username": "JoelMcGuire"}}, {"_id": "Tq2HnQ3QDPFpi5uFk", "postedAt": "2023-05-29T18:24:11.270Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>I must confess that I do not know enough about international law to know that there was a difference between assurances and guarantees. After reading about it I realize that the latter is stronger than the former so I suppose I was incorrect in using that word, thanks for pointing it out, learnt something new :)&nbsp;<br>My point however was that Budapest Memorandum was pretty important for nonproliferation since it reduced the amount of nuclear powers a lot, and the actions of Russia proves that it unfortunately was a mistake for Ukraine (and Belarus and Kazakstan) to agree from a self-interested point of view. If they had not agreed the invasion would most likely not have happened and this is something that I am sure many countries and leaders are considering.&nbsp;</p><p>I suppose your point about security guarantees also points to joining NATO as an important step for security for non-nuclear powers since there I am sure that you get actual security guarantees :D&nbsp;</p><p>I hope you are right that the damage caused to Russia will be enough to deter other nations and Russia from acting similarly in the future, I am not so sure considering the fact that Russia so far has shown no signs of giving up. Hopefully it will change once Ukraine start their offensive.</p>", "parentCommentId": "kAzexSyoRpdQNgDM5", "user": {"username": "DaneelO"}}, {"_id": "rdPnnXvTLF9CJz8bG", "postedAt": "2023-05-29T18:30:06.897Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<blockquote><p>I don't think this is right- \"Russia\" doesn't make actions, Vladimir Putin does; Putin is 70, so he seems unlikely to be in power once Russia has recovered from the current war; there's some evidence that other Russian elites didn't actively want the war, so I don't think it's right to generalize to \"Russia\".</p></blockquote><p>Even if it was true that many elites were anti-war before the invasion, I think the war has probably accelerated a preexisting process of ideological purification. So even when Putin kicks the can, I think the elites will be just as likely to say \"We didn't go far enough\" than \"We went too far\". I expect at least some continuity in the willingness to go to war by Putin's successor.&nbsp;</p><blockquote><p>A US-China war would be fought almost entirely in the air and sea; Ukraine is fighting almost entirely on land. The <a href=\"https://crsreports.congress.gov/product/pdf/IF/IF12040\">weapons</a> Ukraine has receive are mostly irrelevant for a potential US-China war; e.g. the Marines have already decided to stop using tanks entirely, and the US being capable of shipping the vast amounts of artillery ammunition being consumed in Ukraine to a combat zone would require the US-China war to already be essentially won.</p></blockquote><p>Why would it be fought almost entirely in the air and sea? That sounds like a best or worst-case scenario, i.e., China isn't able to actually land or China achieves air and naval superiority around Taiwan. The advanced weapons systems Ukraine has received seem very relevant: Storm shadow, HIMARs, Abrams + Leoopard, Patriot, Javelin, etc. And shipping weapons doesn't seem to require the war to be essentially won, just that the US can achieve local air and naval superiority over part of Taiwan with a harbour. Complete dominance of the skies in a conflict is rare.</p><blockquote><p>Weapons being sent to Ukraine are from drawdown stocks, which Taiwan itself hasn't previously been eligible to receive. Taiwan instead purchases new weapons, but there are many, many other countries purchasing similar types of weapons, and if the US were to become concerned, I'd expect it to prioritize both Ukraine <i>and</i> Taiwan over e.g. Saudi Arabia or Egypt.</p></blockquote><p>My concern is that these US stocks seem to be regenerating very, very slowly.</p>", "parentCommentId": "Eas9TRAgxregqKpsq", "user": {"username": "JoelMcGuire"}}, {"_id": "CQcPrufidXGqCiDZ4", "postedAt": "2023-05-30T04:23:09.093Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>Yes Russia had convinced others and FSB had convinced Putin that it's military was much better than it actually was; a key reason why the advances stalled and probably also why Putin launched the war.&nbsp;<br><br>But specifically about underestimating Ukraine's chances, I think the \"agency\" &nbsp;did impact outcomes a lot. The willingness and ability by society to decide and agree on what's best for the country and act accordingly is roughly what I mean by \"agency\" in this context.&nbsp;<br><br>Had Zelensky accepted offers to flee and had UA society and military accepted the outside views in the first days of the war, then the RU military could have advanced relatively easily. Even in the poor condition that it was in. &nbsp;But resistance had a huge backing from Ukrainians, that is why Zelensky's popularity soared from 27% to 80-90% when he declined offers to flee. Seems likely to me that Putin did not expect that, expected a large part of population to welcome his soldiers are liberators from the unpopular government.<br><a href=\"https://iwpr.net/global-voices/zelenskys-approval-ratings-soar-amid-war\">https://iwpr.net/global-voices/zelenskys-approval-ratings-soar-amid-war</a> &nbsp;<br><a href=\"https://ratinggroup.ua/research/ukraine/obschenacionalnyy_opros_ukraina_v_usloviyah_voyny_26-27_fevralya_2022_goda.html\">https://ratinggroup.ua/research/ukraine/obschenacionalnyy_opros_ukraina_v_usloviyah_voyny_26-27_fevralya_2022_goda.html</a> &nbsp;&nbsp;</p>", "parentCommentId": "ZAnRiBbupu5AvXwTM", "user": {"username": "akanepajs"}}, {"_id": "xaEHdYdzAbPuCbaK4", "postedAt": "2023-05-31T16:56:37.750Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<p>Thanks for the response and the links to these graphs. This is just a quick look and so could be wrong but looking into some files from the World Values Survey, I find this information which, if correct, would make me think I would not weight this information into my consideration of whether we should be concerned about a country being annexed even to a level of 1% weight. The population of China is ~1.4 billion. The population of Taiwan is ~24 million. The sample size for the Chinese data seems to be 2300 people. And for Taiwan about 1200. I tried to upload a screenshot which I can't work out how to do, but the numbers are in the doc \"WV6 Results By Country v20180912\" on this page <a href=\"https://www.worldvaluessurvey.org/WVSDocumentationWV6.jsp\">https://www.worldvaluessurvey.org/WVSDocumentationWV6.jsp</a>&nbsp;</p><p>I do not think we can have any faith at all that a sample of 2300 people can even come close to representing all the variation in relevant factors related to happiness or satisfaction across the population of China. The ratio of population to respondents is over 600,000, larger than some estimates for the population of Oslo, Glasgow, Rotterdam etc. (https://worldpopulationreview.com/continents/europe/cities)</p><p>I may be missing something or making some basic error there but if it is roughly correct, then I would indeed call it silly to factor in this survey result when deciding what our response should be to the annexation of Taiwan. I do not think that such a question is in principle about life satisfaction/happiness, but even if it were I would not use this information.</p>", "parentCommentId": "jP3FCHNgewzZjxjhA", "user": {"username": "Jamie Elsey"}}, {"_id": "f6CdSipzKgt2hETbu", "postedAt": "2023-07-13T07:04:22.719Z", "postId": "aHkthQrAfuyNBNFhM", "htmlBody": "<blockquote><p>Why would it be fought almost entirely in the air and sea? That sounds like a best or worst-case scenario, i.e., China isn't able to actually land or China achieves air and naval superiority around Taiwan. The advanced weapons systems Ukraine has received seem very relevant: Storm shadow, HIMARs, Abrams + Leoopard, Patriot, Javelin, etc. And shipping weapons doesn't seem to require the war to be essentially won, just that the US can achieve local air and naval superiority over part of Taiwan with a harbour. Complete dominance of the skies in a conflict is rare.</p></blockquote><p>It's unlikely that both the US <i>and</i> China can get mass numbers of supplies to Taiwan. If you can get a (slow/big/vulnerable) freighter to Taiwan you can also almost certainly get an armed military ship, a submarine, or a stealth fighter to Taiwan.</p><blockquote><p>the US can achieve local air and naval superiority over part of Taiwan with a harbour.</p></blockquote><p>I'm not sure what you mean by \"local superiority\". Virtually every modern anti-ship missile has enough range to completely cover Taiwan. Taiwan is only 150 miles wide, so the LRASM/JSM/YJ-12 etc all have enough range to go from one side to the other, and most of these have enough range to completely cover the island. It's questionable (but plausible) whether a carrier a thousand miles out can survive, let alone a (slow and vulnerable) freighter sailing right up to Taiwan.</p><blockquote><p>Complete dominance of the skies in a conflict is rare.</p></blockquote><p>The absence of complete dominance of the skies means that <i>neither</i> side can safely move around, not that <i>both</i> sides can safely move around. e.g. in Ukraine neither side has complete dominance of the skies, but that certainly doesn't mean that it's safe for either side to be flying cargo planes to the front lines.</p>", "parentCommentId": "rdPnnXvTLF9CJz8bG", "user": {"username": "alexrichard"}}]