[{"_id": "eWHJvZMEfy4wure8n", "postedAt": "2022-11-14T19:43:46.142Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<blockquote><p>If FTX leadership had refused, they should have refused to run the FTX Foundation and made it public that FTX leadership had refused the audit. Then, EA leaders should have discouraged major EA organizations from taking money from the FTX Foundation and promoted a culture of looking down on anyone who took money from the Foundation.</p></blockquote><p>&nbsp;</p><p>To continue thinking it through: the above seems like a theoretical sequence of outcomes that would never in fact materialize. More likely FTX leadership would have known ahead of time &nbsp;and wouldn't have offered funding in the first place.&nbsp;<br><br>I think it's useful to think about what useful actions would have been. But what really matters is - how to act going forward. IMHO any ad hoc decision by FTX founders to request audit for one funder but not another seems problematic. Can be influenced by conflicts of interest, private relations, and a general lack of competence/standards about such situations. Ideally I think there would be a published list of requirements, including audit/governance requirements, to which donors should adhere.&nbsp;<br><br>Then again, donors &amp; appropriate levels of &nbsp;audit scrutiny probably vary widely, so it would not be easy to specify the details needed. &nbsp;I guess much can be learned from the KYC/AML (know you client/anti money laundering) practices in banking. Also, some industries can be ruled out completely (I'm not of the opinion that crypto should, but not far from it anymore). An [old] example of an exclusion list for a bank:&nbsp;<br>https://www.ebrd.com/downloads/about/sustainability/Environmental_and_Social_Exclusion_and_Referral_Lists_15092008.pdf</p>", "parentCommentId": null, "user": {"username": "akanepajs"}}, {"_id": "so6LEGwGwXNcFLENa", "postedAt": "2022-11-14T19:44:42.551Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<blockquote><p>I have yet to hear a proposal that in my opinion satisfies all of (1)-(3). It would be nice to see some in the coming weeks</p></blockquote><p>&nbsp;</p><p>What about: \"EA should have had a policy to not be involved with or associate with cryptocurrency\"?&nbsp;</p><p>It's not like nobody <a href=\"https://forum.effectivealtruism.org/posts/KBw6wKDbvmqacbB5M/crypto-markets-ea-funding-and-optics\">pointed out</a> the problems with heavy crypto involvement. The propensity of crypto projects to end in flames has been known for many, many years. &nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "2z2vsqejtskCYSi2d", "postedAt": "2022-11-14T21:10:42.183Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>A sweeping condemnation of crypto based on FTX's failure seems about as prudent or rational as a sweeping condemnation of democracy based on bad leaders sometimes getting elected, or a sweeping condemnation of capitalism based on corporations sometimes doing bad things.</p><p>Many crypto protocols are trying to do a lot of good in the world, in terms of (1) 'banking the unbanked (the 3 billion people without access to financial services like savings or loans), (2) allowing faster, cheaper, more secure remittances, (3) providing secure decentralized property rights in countries without the rule of law, (4) allowing secure digital identities and personal control over educational credentials, employment histories, and medical records, etc., and (5) building oracle protocols that provide secure, decentralized, hard-to-fake information feeds regarding asset prices, weather reports, etc.</p><p>I worry that EAs who don't know much about crypto will over-react to FTX's fraud by doing a knee-jerk rejection of the whole crypto industry -- which boils down to a vision of a secure, decentralized, trust-minimized, economic infrastructure that doesn't rely on governments printing fiat currency, banks exploiting borrowers, and centralized corporations controlling the flow of information.</p>", "parentCommentId": "so6LEGwGwXNcFLENa", "user": {"username": "geoffreymiller"}}, {"_id": "qKKBGuuxhuoz8nYmn", "postedAt": "2022-11-14T21:20:37.350Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>I think this fails (1), but more confidently, I'm pretty sure it fails (2). How are you going to keep individuals from taking crypto money? See also: <a href=\"https://forum.effectivealtruism.org/posts/Pz7RdMRouZ5N5w5eE/ea-should-taboo-ea-should\">https://forum.effectivealtruism.org/posts/Pz7RdMRouZ5N5w5eE/ea-should-taboo-ea-should</a></p>\n", "parentCommentId": "so6LEGwGwXNcFLENa", "user": {"username": "UnexpectedValues"}}, {"_id": "wkPtxEJeTHvtSSvQy", "postedAt": "2022-11-14T23:32:30.541Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<blockquote>\n<p>A sweeping condemnation of crypto based on FTX's failure seems about as prudent or rational as a sweeping condemnation of democracy</p>\n</blockquote>\n<p>Ah, but (to be a bit of a devil's advocate here) a lot of people have been sweepingly condemning crypto since before this whole fiasco, we are just making more noise and have a higher chance to be heard now :)</p>\n<p>At risk of derailing the thread, I would argue none of your #1-5 are panning out in any substantive way. (I know a lot about 1 and 2, and claim that the entire crypto industry is at least an order of magnitude less effective than Wave and Sendwave towards these goals.) And on the flip side, most crypto things turn out to be scams and are risky to get involved with.</p>\n<p>To me, it seems entirely reasonable to collectively take this opportunity to say \"oops\" on crypto; agree that the technology has potential but that financial stuff is built on trust and crypto attracts too many get-rich-quick-ers and is thus toxic for the community, and bail.</p>\n", "parentCommentId": "2z2vsqejtskCYSi2d", "user": {"username": "lincolnq"}}, {"_id": "fniJYFEZCa8fS7oK7", "postedAt": "2022-11-15T01:51:15.650Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>I fully agree with this, and let me give a somewhat detailed story about what this culture shift might look like if we worked through some of its implications.</p><p>Right now, I think people go through a semi-unconscious thought process something like this:</p><blockquote><p>I want to make a proposal for X. But if I go on too long about X, nobody will read it because it'll be too long. And those who do will pounce on the first seeming error they can find. The longer I go on, the bigger the attack surface. And the more contingent my claims become, so the less likely the whole story is to be true. Almost certainly, nobody is going to follow up or build on what I write. &nbsp;But maybe if I keep my writing short, somebody who <i>does</i> have power and influence will view me as \"voting with my words\" for a general type of intervention that they can actually get enacted. They'll work out the details.</p></blockquote><p>And so when we see calls for \"audits,\" or what elsewhere I've called \"risk management for EA,\" we should understand that these aren't viewed by their authors as fully fleshed-out proposals. They're the seeds of ideas that could be built out by a person who has the power and influence to access money and professional human resources in the EA movement. Pollsters don't call and ask you to draft an entire bill for your favored policies. In the EA movement, we don't even call people to ask their opinion about the direction of the movement. So if people want to have input, the way they can give it is by making one-liners advocating for things like \"audits,\" and hope that somebody in authority will take them up on the suggestion.</p><p>If we want people to explain the details of their proposal in greater depth, we need to make it worth their while. Well-thought-through proposals ought to be known as the sort of thing that can result in offers of grants or jobs. Going forward, I'd reframe the \"criticism\" contest as an \"EA policy proposal\" contest, or even have a range of similar contests addressing criticism, EA policy and governance, cause areas, interventions, and so on. If we can't afford to do that for comments on the EA forum, then EA organizations like OpenPhil, 80k, CEA, and so on ought to have dedicated places for people to make proposals about EA governance, where those proposals are read, taken seriously in some kind of legible manner, and can demonstrably lead to real change even when it's not an EA insider making the proposal.</p><p>If that's not tractable, then I would actually prefer if these organizations could explicitly declare that their organizations are not open to external input or oversight, and that this is a matter of policy. Ideally, they'd explain this, but just a one-sentence declaration about the forms of openness they are or are not open to would be an improvement. For example, one proposal I heard was that EA orgs should publish all of their internal emails going forward. I'm given to understand this is a norm in the Linux community, and that one can read all of Linus Torvalds' cantankerous emails if one so desires. If OpenPhil didn't want to publish their emails, I'd understand. But it would be nice if they had a web page where they explicitly declared that they'd considered and rejected this idea, even nicer if they articulated why, and best of all if they outlined the true argument for why they rejected it, and created a form in which people could submit counterarguments. Perhaps OpenPhil could then put these counterarguments to a vote, and declare themselves obligated to published a response if a counterargument received &nbsp;a certain number of votes.</p>", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "RaKjGmvKLzutfHtDX", "postedAt": "2022-11-15T02:09:04.876Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>Crypto's failures are massive and obvious. Yet it's hard to see how it has delivered the goods. That might be a matter of how it's portrayed in the media.</p><p>So I'd ask you: how many of the unbanked has it banked? What fraction of remittances are via crypto, and how have the people using crypto remittances been affected by the volatility in crypto? &nbsp;Is it making progress on providing decentralized property rights in lawless nations, and are we pleased with the way that benefits and costs have been distributed in these populations? What control will I have over my employment history or medical records via crypto, when my doctor has my medical records and I have to publicize my employment history to get hired? Why do I need a decentralized, secure, hard-to-fake weather report?</p><p>I don't expect you to have answers to all these questions, but I will openly say I was skeptical of crypto before this crash, and it's even easier to lean into that skepticism now. The specific thing I think crypto seems good for is funding real-money prediction markets. But I'd trade that away in a heartbeat to get rid of the ills I've seen come of crypto.</p><p>Convincing people like me to come 'round will require showing that there really is a large magnitude of realized practical benefit. It takes time, I am patient, but right now, it seems right to me for EA to keep crypto at arm's length in most cases.</p>", "parentCommentId": "2z2vsqejtskCYSi2d", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "kh4wrFzyA8cHsacnJ", "postedAt": "2022-11-15T02:19:08.662Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>I understand this skepticism. You're right that crypto still has a lot to prove in terms of large-scale utility, security, reliability, and regulatory compliance.</p><p>I would just caution that in the early 2000's after the <a href=\"https://en.wikipedia.org/wiki/Dot-com_bubble\">dot-com bubble</a>, many people expressed the same kinds of skepticism about the Internet itself, and about all online businesses. From 1995 to 2002, there were too many scammers, sociopaths, and opportunists who had ridden the initial wave of hype; security protocols were not well-developed; regulation was patchy and unclear; the use cases were often dubious; VCs &amp; major investors were often naive and didn't do their due diligence; billions were lost in bad investments; the NASDAQ lost 78% of its value, etc.&nbsp;</p><p>But then, somehow, between 2002 and today, the Internet changed the global economy and created trillions of dollars of value. Maybe crypto will do something similar; maybe not.&nbsp;</p><p>But it's important to remember that the kinds of shenanigans that happen in young, small, hyped, immature, highly volatile industries aren't necessarily representative of what happens after those industries mature, and get folded into the mainstream economy.</p>", "parentCommentId": "wkPtxEJeTHvtSSvQy", "user": {"username": "geoffreymiller"}}, {"_id": "nB7dds2TypHn23sb8", "postedAt": "2022-11-15T03:29:54.243Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>Huh, useful analogy. I do think cryptocurrency has potential, I just think the expected altruism-value of the whole thing is quite negative currently, and has been for 5+ years, and this was super not true in the early days of the internet, even during the crash years.</p>\n<p>(I was a very well-connected teenager in 1999 and I remember some things about the early internet... I remember the browser wars, Netscape, AltaVista, then Google, eBay and PayPal, as well as the adware, email viruses, chain letters, worms, hoaxes, etc.)</p>\n<p>Early internet was clearly awful in so many ways but I think the benefits outweighed the drawbacks, at least as a kid -- I have so many instances of getting value from the internet -- mostly through education (by searching to solve problems, discovering forums, sharing info, etc).</p>\n<p>Similarly, I was a fairly early adopter for crypto. Again, lots of technical promise. Seemed quite a cool community early on; I sipped 0.05 btc from the Bitcoin Faucet in early 2011, then gave in and bought $100 worth (at $8). Then I waited for useful stuff to come of it. And waited. I remember making arguments like \"this is the first time computers can talk to each other and exchange value\" to my friends and family. A few other coins seemed interesting -- Namecoin seemed useful but didn't pan out; I spent some time studying Stellar when it came out too, for similar \"computers can send value\" type reasons. I had started to get bored in 2015 and missed the launch of Ethereum, which was quite a promising thing in retrospect, but I didn't miss the DAO collapse. I think it was around this time (2016-ish) that I started thinking that maybe the whole ecosystem was net negative.</p>\n", "parentCommentId": "kh4wrFzyA8cHsacnJ", "user": {"username": "lincolnq"}}, {"_id": "ArizumMCheRt397pN", "postedAt": "2022-11-15T04:23:31.571Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>I think the proposal I’ve been floating around in a few scattered comments meets your criteria:</p>\n<p>First, we build a trusted major charity donor evaluation organization analogous to GiveWell. They would be responsible for researching questions like:\nWhat sorts of projects does this donor like to fund?\nWhat size checks do they write?\nWhat level of influence do they wish to have over the projects they fund?\nWhat are our best guesses for the ethics around how this money was earned?\nHow likely is this funding to disappear?</p>\n<p>They would approach these questions with the same rigor that GiveWell brings, considering both the outside view of the industry and the inside view of any access the donor makes available, with any omissions duly noted in their report.</p>\n<p>Then, if SBF wants to start the FTX Foundation and hire whoever he wants to, he can do it. The GiveWell-analogue would evaluate it on these criteria based on the best available evidence.</p>\n<p>Prospective grantees could then look at the report and be well informed about the risks when they apply for and take the funding. If it looks especially risky, as it’s pretty clear FTX would have, they can generate appropriate backup plans or avoid applying for the funding altogether.</p>\n<p>In my opinion, no one should have been stopped from taking FTX money, but the fallout would have been much more mitigated if we had put up appropriate warning flags around it ahead of time.</p>\n", "parentCommentId": null, "user": {"username": "Sam Elder"}}, {"_id": "ipBqujpw6vS8zieBT", "postedAt": "2022-11-15T04:52:14.107Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>This is probably my favorite proposal I've seen so far, thanks!</p><p>I'm a little skeptical that warnings from the organization you propose would have been heeded (especially by people who don't have other sources of funding and so relying on FTX was their only option), but perhaps if the organization had sufficient clout, this would have put pressure on FTX to engage in less risky business practices.</p>", "parentCommentId": "ArizumMCheRt397pN", "user": {"username": "UnexpectedValues"}}, {"_id": "yfvb7u7hvDkJEDQsQ", "postedAt": "2022-11-15T08:00:09.491Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>Thanks for the post ! This is indeed useful adivce - our brain appears to think in stories, so doing this would help to grasp better a better outcome. To see in our head how that would play out, how else things could happen.</p><p>And as you said, this would improve the quality of the proposal - going beyond the surface of \"we sould do that\", but really getting to the \"how?\".</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}, {"_id": "8jtkvQKnDxuHBH4QB", "postedAt": "2022-11-15T10:55:29.835Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>If I said, \"EA should have had a policy to not be involved with or associate with the weapons industry\", would you have the same objection? (not saying crypto is as bad obviously, just that some form of divestment is obviously possible). FTX was heavily involved in the core of EA, and nothing was done to discourage them tying themselves to EA at every turn. Do you really think the reputational fallout would have been as great if SBF was a mere anonymous donor?</p>", "parentCommentId": "qKKBGuuxhuoz8nYmn", "user": {"username": "titotal"}}, {"_id": "sEWhKQgoswjPSwLYH", "postedAt": "2022-11-15T13:40:25.611Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>I don't have much hope that the charity side of things could have influenced FTX to be less risky -- from what I can tell, a high tolerance for risk was core to their business practices. I just think it could have given EA folks who aren't crypto-savvy a lot more sobriety around FTX's relationship to EA and make them consider the potential downsides of taking FTX funding. It also would have helped in the media/reputation fallout if the donor evaluator I have in mind would have clearly labeled FTX as risky or having withheld information.</p><p>Independent of this particular case to mitigate against, I also think such a donor catalog and evaluation system would be a benefit to the community, as a sort of one-stop shop for potential grantees to learn about their options for seeking funding.</p>", "parentCommentId": "ipBqujpw6vS8zieBT", "user": {"username": "Sam Elder"}}, {"_id": "FbYWriEF7QAPYbbCh", "postedAt": "2022-11-15T15:09:35.026Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>Even if you're correct about crypto becoming a mature and powerful industry someday (and i don't think you are), this doesn't change the fact that <i>right now</i>, it is utterly infested with bubbles and scams.&nbsp;</p><p>Why should EAers be involved in crypto <i>right now</i>, as opposed to distancing ourselves until crypto stabilises? Because right now I don't see any reason to be confident in the ability of EA leadership to pick out the scams from the non-scams. Imagine the reputational damage if the FTX debacle <i>happens again.&nbsp;</i></p>", "parentCommentId": "kh4wrFzyA8cHsacnJ", "user": {"username": "titotal"}}, {"_id": "9EWfGjTNffpdAC9mq", "postedAt": "2022-11-15T18:46:43.170Z", "postId": "aHPhh6GjHtTBhe7cX", "htmlBody": "<p>I hear you. I respect different assessments of the risk/reward for being linked to a young, volatile, unproven industry (such as crypto) that has been subject to many scams, hacks, and bad actors.</p><p>However. Crypto still includes&nbsp;</p><p>(1) a lot of smart, idealistic, young, technically capable people who lean towards rationalism, and who are distrustful of government do-gooding that isn't evidence-based, and thus who are potentially aligned with EA</p><p>(2) a number of visionary leaders who are committed to developing crypto in ways that reduce global poverty, and who thus seem aligned with 'classic' EA cause areas</p><p>(3) a lot of ornery older investors who aren't <i>just</i> invested in crypto, but who appreciate those who keep an open mind about it, and who might be interested in EA</p>", "parentCommentId": "FbYWriEF7QAPYbbCh", "user": {"username": "geoffreymiller"}}]