[{"_id": "iAhZZ2pjepBEi9FQY", "postedAt": "2023-11-24T15:24:33.216Z", "postId": "aHWZrQxfcTc5AKaGc", "htmlBody": "<p>Forgive me for having the IQ of a shrimp, but could you spell out a concrete problem that the odyssean process could be used to solve?</p><p>ie:</p><p>problem: \"People disagree over what colors the new metro line should be\"</p><p>hypothetical process: \"12 people sit in a room and hypothesize on color palettes. Those colour palettes are handed out to a panel of 100 randomly picked citizens to deliberate and then finally voted upon\"</p><p>I skimmed through the report and am pretty confused as to what concretely the process is.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "c9vSQJDShnaYMtyJ8", "postedAt": "2023-11-24T15:39:33.078Z", "postId": "aHWZrQxfcTc5AKaGc", "htmlBody": "<p>Hi Mathias,</p><p>To see the Process itself, Page 16 has a diagram following the tables outlining each component of it, and subsequent pages have the commentary.&nbsp;</p><p>You’re broadly accurate in your proposed case study of the metro in the form of the process, in that our Process for this problem would entail horizon scanning key uncertainties or trends in metro line design, such as comparative analysis of successful metro redesigns with measurable successes. This is then presented to the 100 citizens through an iterative process of identifying their values, possible solutions, uncertainties, and then using decision making under deep uncertainty (DMDU) to coproduce actionable pathways that fulfil their multiple criteria.</p><p>However, due to the nature and involved aspect of the process, it is geared explicitly towards challenging, or wicked problems, and existential risks or GCR - rather than simpler or more trivial policy issues.</p><p>We also have an abstract version of this process in the ‘Combining the Pictures’ section. In short - horizon scan a complex issue or trends, enable deliberation by a wider sample using this, and iterate using DMDU to facilitate finding the win-wins within the solution space that may have been neglected, increasing the tractability of the eventual recommendations. We don't want to pick too specific a use case as we see a great value in the generalisability of this across cause areas.</p><p>Furthermore, in our commentary on the process, we cite a few concrete examples of deliberation, DMDU, and EEJ and where they have been used, with citations to read further on their applications. Some examples include the Dutch Delta Commissioner's work for DMDU, Irish, Taiwanese, and American uses of deliberation, and the WHO's uses of expert elicitation and horizon scanning, as well as biorisk and ecological cases. We had to lean a little on brevity due to the range of components involved, so ideally the citations can furnish further detail where we couldn't due to length considerations.</p><p>Finally, in the Our Plans section, we also cite the Myriad-EU pilots that used multi-level multi-risk assessments that were conducted with DMDU to address more of the typical complex risk and systemic risk areas we’d look to contribute towards. Hope this helps!</p>", "parentCommentId": "iAhZZ2pjepBEi9FQY", "user": {"username": "Odyssean Institute"}}, {"_id": "5CN6tXXRGrnHpaXkk", "postedAt": "2023-11-28T09:19:09.046Z", "postId": "aHWZrQxfcTc5AKaGc", "htmlBody": "<p>This reminds me of the work on the <a href=\"https://de.wikipedia.org/wiki/Planungszelle\">Planungszelle</a> in Germany but with some more bells and whistles. One difference that I see is that afaik the core idea in more traditional deliberation processes is that the process itself is also understandable by the average citizen. This gives it some grounding and legitimacy in that all people involved in the process can cross-check each other and make sure that the outcome is not manipulated. You seem to be diverging from this ideal a little bit in the sense that you seem to require the use of sophisticated statistical techniques, which potentially cannot be understood or cross-checked by a general cross-section of the population.&nbsp;<br><br>Maybe it would make sense to use a two-stage procedure where in the first (preparation) stage you gain general agreement on what process to run in the second (work) stage? Or looking at your model to actually have the citizen assembly be involved in managing and controlling the expert modeling process or have at least multiple different expert teams provide models to the citizen assembly. Otherwise it seems like you have a single point of failure where the democratic aspect of the process can be neutralized potentially quite easily.<br><br>I am just speculating though, haven't had time to look at the white paper in detail. Maybe/probably you have thought about those aspects already!</p>", "parentCommentId": "c9vSQJDShnaYMtyJ8", "user": {"username": "alexherwix"}}, {"_id": "mZmnFJ27Y34Gky6EM", "postedAt": "2023-11-28T18:14:17.636Z", "postId": "aHWZrQxfcTc5AKaGc", "htmlBody": "<p>Thank you for a thoughtful response! Indeed, we have considered these risks and although for the sake of brevity haven't delved heavily into the range of experimental designs for an assembly in the White Paper directly, we have in conversations with strategic partners such as Missions Publiques. We agreed that a model similar to theirs on certain assemblies would be wise. This involves the public deliberating in isolation first, so they aren't overly primed by the horizon scan, before then being introduced to the findings of the panel afterwards. This allows for iterations in the Process, without overly influencing initial values and considerations from the public. So for example, the public would be consulted, help to sculpt the optimalities scan in DMDU, and then incorporate the EEJ panel's findings to refine and deepen engagement. Ultimately the assembly decides, so we are aware of the need to balance these steps to ensure they support rather than subvert this aspect.</p><p>DMDU has a considerable emphasis on translating findings effectively, and avoiding getting bamboozled by models (such as the emphasis Erica Thompson puts on caution around this in 'Escape from Model Land'). It is a positive sign that DMDU practitioners are well aware of the 'fallacy of misplaced concreteness' and the risks this poses, and a large part of their methodology is devised to keep this explicit. The education phase of an assembly would also involve familiarising participants carefully with the value and limits of the models used, with ranges of uncertainties. It also bears noting that while not all questions will require modelling, done carefully and translated with caution, certain civilisational risks will need this level of rigour.&nbsp;</p>", "parentCommentId": "5CN6tXXRGrnHpaXkk", "user": {"username": "Odyssean Institute"}}, {"_id": "DX7P6rLo6adynxAkw", "postedAt": "2023-11-29T12:54:46.898Z", "postId": "aHWZrQxfcTc5AKaGc", "htmlBody": "<p>Thanks for posting this!</p><p>I want to highlight up front that I am a big supporter of any work that aims to improve institutional decision making. I believe it’s a highly impactful area with unparalleled potential given the decision power (in both terms of spending and benefit potential) of large institutions is immense. I personally feel there’s a big moral and EA argument in supporting solutions that could practically deliver benefits (even small returns given the scale).</p><p>In terms of cleaner questions upfront which get to the heart of my uncertainties:</p><ol><li>How much will the elements combined improve the quality of decisions that are made? Tied to this - which elements could be cut if needed for time without undermining the benefits you’d expect?</li><li>Are there examples of previous decisions that have been made that have been run through this process, to show what different outcomes would have been generated?&nbsp;</li><li>Given the time investment needed to implement this process, why is it advantageous over existing solutions that have been shown to provide substantial improvements in decision making quality (under experimentation) but often face complaints over needing significant time and expertise investment (e.g. training on and aggregating Bayesian models)?&nbsp;</li></ol><p><strong>Further reflections if interested/useful</strong><br>Having read your paper, I have some concerns over how the solution can be implemented at a beneficial scale. I raise this particularly as a number of the problems you’ve mentioned in the White Paper (e.g. unstructured/limited consultations with experts or limited analysis of the problem space) are driven more by time constraints rather than a clear framework of how to do it. This is an important consideration as planning for catastrophic risks is only half of the problem - we can’t consistently (or at all) predict black swan events and thus decision making at speed in crises is incredibly (if not more) important, as Covid showed us.</p><p>Given decision science research, I query the heavy reliance on expert judgment as a key node to improve the predictive accuracy, as there’s a healthy body of evidence that suggests quality of reasoning as opposed to domain expertise is a better predictor for such accuracy. Your White Paper actually seems to account for this by proxy when it highlights specific reasoning methods to drive improved accuracy (e.g. IDEA framework).&nbsp;</p><p>In addition, I’m less sure how beneficial the democratic/deliberation process with citizens is for the risks you are targeting. The examples you note (such as abortion and LGBTQ+ issues) are primarily social issues which lend themselves well to citizen assemblies given they are moral in nature. On the other side, planning policy is quite heavily democratised in the UK and arguably has led to very bad outcomes given wider economic or societal benefits from construction are less tangible than personal concerns around changes to the local area. These externalities aren’t always accurately priced into people’s incentives and thus their judgements aren’t necessarily what’s best for society. Do you see a similar issue for catastrophic risks/how will you mitigate if so?</p>", "parentCommentId": null, "user": {"username": "JamesN"}}, {"_id": "Ttmv85NNYLcHF9dba", "postedAt": "2023-12-08T14:00:16.806Z", "postId": "aHWZrQxfcTc5AKaGc", "htmlBody": "<p>Thank you James for such a thorough response! Always pleased to see recognition of the still neglected potential of political technologies and existing best practices.&nbsp;</p><p>1. We aim to do aspects of the modelling ourselves, but by identifying in literature review existing open access models rather than building them from the data directly, time can be saved. An assembly can be conducted over a few months, as can the modelling be undertaken simultaneously with effective resourcing to parallelise phases of the Process, which is not unusual for a large policy initiative of any kind. I would emphasise that time is not the bottleneck when deciding how, from a meta- or strategic planning level, how to proceed. It is about building capacity so you are ready in future to act quickly. Badly and well prepared administration can both act quickly; the difference in what they chose to have ready is what we are aiming for with this work.&nbsp;</p><p>2. No one has combined all three components yet, however we want to test this because we see each success story and underlying logic of the components as mutually reinforcing. Some syntheses of parts of this exist: horizon scanning and public deliberation were advocated for in Kemp et al's Climate Endgame: <a href=\"https://www.pnas.org/doi/10.1073/pnas.2108146119\"><u>https://www.pnas.org/doi/10.1073/pnas.2108146119</u></a><u> </u>as well as numerous examples of DMDU (the Room for the River initiative for strategic planning of the Dutch Delta going over 40 years into the future) and participatory processes being reviewed at this year's DMDU 2023 conference. For example, DMDU is a fundamentally different ontology for modelling; rather than trying consolidative modelling (which is legitimate, but is also often used to confirm biases or flatten a complex space), DMDU accepts that we need to explore many possible futures to increase the likelihood of being prepared for uncertainty. It also works when there are deeper disagreements on what theories or uncertainties to account for:</p><p><u>Citations useful for exploratory modelling &nbsp;include:&nbsp;</u></p><p><u>- </u><a href=\"https://www.jstor.org/stable/171847\"><u>https://www.jstor.org/stable/171847</u></a><u>&nbsp;</u></p><p><u>- </u><a href=\"https://www.sciencedirect.com/science/article/pii/S2214629622001876\"><u>https://www.sciencedirect.com/science/article/pii/S2214629622001876</u></a><u>&nbsp;</u></p><p><u>- &nbsp;</u><a href=\"https://forum.effectivealtruism.org/posts/kCBQHWqbk4Nrns8P7/model-based-policy-analysis-under-deep-uncertainty\"><u>https://forum.effectivealtruism.org/posts/kCBQHWqbk4Nrns8P7/model-based-policy-analysis-under-deep-uncertainty</u></a></p><p>3. I would liken the time constraints as pertaining to the tactical level problem, which is still hindered or enabled by the quality of a pre-emptively prepared 'strategic' resilience plan. In short, due to these uncertainties, the point isn't deciding from scratch as the risk is occurring - it is having done enough horizon scanning, scenario planning, and invested enough in resilient infrastructure, backups, failsafes, public education etc. before the time so that a faster dynamic response, as with DAPPs, can occur and be iterated (think nuclear war infomercials from the Cold War - if best practice wasn't established for surviving a blast, and publicly communicated, there wouldn't be time to figure this out rapidly on the day). If we don't put in the time, work, and focus that something like our Process does before time, there will be no easy way to suddenly decide quickly because the ground wouldn't have been prepared. Similarly, Bayesian inference is only as good as it's priors, and falls apart with complex low probabilities collapse events where we had very little data to learn from Taleb N's Statistical Consequences of Fat Tails: <a href=\"https://l.messenger.com/l.php?u=https%3A%2F%2Farxiv.org%2Fftp%2Farxiv%2Fpapers%2F2001%2F2001.10488.pdf&amp;h=AT0cmc-lw0uH1pEm3_n5OOLKt6xFzBn-ZzaNSMEEPYb0_AsNPJyUZd2kOJ44ywWKDx6tPTf77racx3cL4gcI_BzIE0vyrwPbcxp53IFR1DQAmbTKMpZwVk6JWW9KmnRwEL9uLcwC29g\"><u>https://arxiv.org/ftp/arxiv/papers/2001/2001.10488.pdf</u></a></p><p>Collective intelligence, and broad and diverse sets of experts - not homogenous or narrow sets - have something to contribute to developing those models. As do the public for developing something that is viable for enforcement, not something likely to lead to social unrest if attempted. As such setting a values driven strategy that can be adjusted with different operational means when events hit is the goal, and as such time is not the only or primary bottleneck. The quality of preparations - which have also been sorely lacking as seen in Britain with the Covid-19 inquiry - is vital. Taiwan had prior experience with SARS, but also an effective test and trace system built up after that. Britain still does not - with better foresight, the need for resilience and robust decision making is seen more clearly, as we might now invest better for the next pandemic. The problem wasn't only time, it was political partiality (which can be mitigated somewhat through a wider sample of the public, rather than a slim and vested interest beholden political party) and it was a lack of transparency that also allowed for abysmal prioritisation to stay hidden. Matt Boyd's anticipatory governance paper here is solid on a range of wider recommendations for good existential and catastrophic risk policy making, including deliberation and transparency taken as essential (built from a wide sample of expert elicitation and examples of successful governance): <a href=\"https://l.messenger.com/l.php?u=https%3A%2F%2Fojs.victoria.ac.nz%2Fpq%2Farticle%2Fview%2F7313%2F6467&amp;h=AT0cmc-lw0uH1pEm3_n5OOLKt6xFzBn-ZzaNSMEEPYb0_AsNPJyUZd2kOJ44ywWKDx6tPTf77racx3cL4gcI_BzIE0vyrwPbcxp53IFR1DQAmbTKMpZwVk6JWW9KmnRwEL9uLcwC29g\"><u>https://ojs.victoria.ac.nz/pq/article/view/7313/6467</u></a></p><p>As to your last point, there is even more of a moral component to x-risks than perhaps issues of obvious social cleavage; it is a fundamental misstep to assume that how we prioritise, who we identify as more or less vulnerable, and what we want to invest in or pursue despite their risks, is not a moral question. Brushing them under the carpet and assuming we can technocratically address them is not viable. I would again refer here to a Matt Boyd paper on the need for deliberation on values, because even the 'how' questions carry deeper 'why' aspects to them: <a href=\"https://philarchive.org/rec/BOYERN\"><u>https://philarchive.org/rec/BOYERN</u></a></p><p><u>Rounds of iterated expert, modelling, and citizen deliberation can help price in exactly those externalities. This is why we don't just say 'let's save time and do just a deliberation, or let's make it more technical and do just a horizon scan' - for these issues, by taking a similar amount of time as a longer policy consultation but with broader expert, generalist, complexity modelling, and finally public collective intelligence, we ensure there are phased opportunities to consider multiple levels of knowledge and values. For the greatest risks, we think this is a huge bargain for avoiding stumbling into them or failing to enforce their mitigation due to flawed, secretive, and self-sabotaging approaches to the problem spaces.</u></p>", "parentCommentId": "DX7P6rLo6adynxAkw", "user": {"username": "Odyssean Institute"}}]