[{"_id": "2MpZBSuF3q3qDQdAk", "postedAt": "2024-01-27T10:35:57.105Z", "postId": "AHxXLSpuHcpFPBvZi", "htmlBody": "<p>Props for thinking outside the box, although there's a few challenges that jump immediately to mind:</p><p>• It's not easy to make an event prestigious. There's a chicken and egg problem. Companies won't want to enter unless it's prestigious and it won't be prestigious unless they enter.<br>• Companies racing each other for a trillion-dollar prize might not want to distract themselves by entering even if it were prestigious.<br>• The subjectivity of the competition may reduce the value that people place on this competition.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "rSHPaCTrzzMaWWWKi", "postedAt": "2024-01-30T13:40:47.482Z", "postId": "AHxXLSpuHcpFPBvZi", "htmlBody": "<p><strong>Executive summary</strong>: The author proposes establishing a biennial Human-centred AGI Olympiad tournament where teams compete with general purpose AI agents on real-world tasks designed to test whether AIs adhere to core human values like being helpful, honest, and harmless.</p><p><strong>Key points:</strong></p><ol><li>An AGI Olympiad could influence incentives driving AGI development towards safety, provide visibility into AI capabilities and risks, and open opportunities to shape policy.</li><li>Careful design and implementation focused on beneficial tasks is needed to achieve positive impacts without enabling dual use capabilities.</li><li>The proposal aims to leverage positive incentives through competition prestige and corporate sponsorship rather than just relying on punitive measures.</li><li>Tasks could span healthcare, legal services, government operations, and business management. The author cautions against areas like science, engineering and forensics that may enable systemic risks.</li><li>Success requires significant funding, partnerships with reputable organizations, participation from leading AI labs willing to accept constraints, and targeting 2026 for the first event.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]