[{"_id": "cmBqaLnt2ecbk9iZS", "postedAt": "2023-05-15T17:55:09.651Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Thanks, very interesting.</p><p>Regarding the political views, there are two graphs, showing different numbers. Does the first include people who didn't respond to the political views question, whereas the second exclude them? If so, it might be good to clarify that. You might also clarify that the first graph/sets of numbers don't sum to 100%. Alternatively, you could just present the data that excludes non-responses, since that's in my view the more interesting data.</p>", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "KPoxgDeC5QErtX6aF", "postedAt": "2023-05-15T18:26:58.644Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>On religion too, I think.</p>\n", "parentCommentId": "cmBqaLnt2ecbk9iZS", "user": {"username": "Jason"}}, {"_id": "YG2cBAGGow9A2BbGz", "postedAt": "2023-05-15T18:30:04.881Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Hi Stefan,<br><br>Thanks for the comment! I'm inclined to agree it's clearer and easier to just show the 'excluding' numbers in both cases, so this is changed now. We'll update this to be the same anywhere else in the post it applies too.</p>", "parentCommentId": "cmBqaLnt2ecbk9iZS", "user": {"username": "David_Moss"}}, {"_id": "jEEk5PAQNNmv6eRTP", "postedAt": "2023-05-15T19:18:29.833Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Thanks Stefan and Jason!</p>", "parentCommentId": "KPoxgDeC5QErtX6aF", "user": {"username": "WillemSleegers"}}, {"_id": "zdaJsZpwafKGJp9ji", "postedAt": "2023-05-15T22:56:36.497Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<blockquote><p>Highly engaged EAs were much more likely to select research (25.0% vs 15.1%) and much less likely to select earning to give (5.7% vs 15.7%)</p></blockquote><p>are you sure this isn’t just a function of the definition of highly engaged?</p>", "parentCommentId": null, "user": {"username": "Grayden"}}, {"_id": "q3dpSFQysYovqmQbx", "postedAt": "2023-05-16T00:45:09.019Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Should redefine engagement in terms of total $ donated to charity in the last year and see how the stats look.</p>", "parentCommentId": "zdaJsZpwafKGJp9ji", "user": {"username": "Larks"}}, {"_id": "n2esHy8tyaSmBxYeY", "postedAt": "2023-05-16T11:00:21.767Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<blockquote><p>are you sure this isn’t just a function of the definition of highly engaged?</p></blockquote><p>&nbsp;</p><p>No, I think it it probably <i>is</i> partly explained by that.&nbsp;</p><p>For context for other readers: the highest level of engagement on the engagement scale is defined as \"I am heavily involved in the effective altruism community, <i>perhaps helping to lead an EA group or working at an EA-aligned organization.</i> I make heavy use of the principles of effective altruism when I make decisions about my career or charitable donations.<i>\" </i>The next highest category of engagement (\"<i>I’ve engaged extensively with effective altruism content (e.g. attending an EA Global conference, applying for career coaching, or organizing an EA meetup). I often consider the principles of effective altruism when I make decisions about my career or charitable donations.\"</i>) is also included in the \"high engagement\" group, when we apply a binary division between high and low engagement).</p><p>The definition of the <i>highest</i> level of engagement may skew against people who are earning to give, even if they are highly engaged (in the ordinary sense of the term), and donating a lot, because it includes the specific example of \"<i>perhaps helping to lead an EA group or working at an EA-aligned organization\"</i> (even though a high-donating earn-to-giver <i>could</i> judge that they counted as highly engaged anyway, they might think that the category doesn't best fit them).</p><p>That said, I would expect most engaged, high-donating earning-to-givers to fit at least the second highest category, which would still count them as \"highly engaged\" in our binary analyses. Note that the next category down (the highest category in the \"low engagement\" binary division) is quite a lot weaker \"I’ve engaged with <i>multiple articles, videos, podcasts, discussions, or events on effective altruism</i> (e.g. subscribing to the 80,000 Hours podcast or attending regular events at a local group).<i> </i>I <i>sometimes</i> consider the principles of effective altruism when I make decisions about my career or charitable donations.<i>\"</i></p><p>Given that, I don't expect these definitions to dramatically skew results related to earning-to-give, so long as we're using the binary division, but the use of these specific examples is probably a part of the issue.</p><p>The engagement scale (which we didn't design ourselves, it was a requested question from 2019 onwards) definitely has some undesirable features. It's double or <a href=\"https://en.wikipedia.org/wiki/Double-barreled_question\">triple-barrelled</a> (i.e. it asks people about multiple distinct dimensions in parallel (e.g. how far <i>and/or</i> how often you consider EA principles <i>and </i>about different actions you could take)). And the characterisations of the different levels of the different dimensions are not clearly hierarchical and seem to jump between different dimensions (e.g. levels 2-4 specify engagement with different content, level 5 refers to engagement in groups or EA orgs). The ideal way to design the measures would be to have each measure specifying a distinct dimension (e.g. self-identified engagement, degree <i>or</i> frequency of considering EA principles, and engagement in different activities) and have each of these dimensions unambigiously hierarchical, and then see how these different dimensions are associated.</p><p>That said, I think the scale mostly works passably well for most purposes. When we examine the association between the self-report scale and different concrete measures and between different concrete measures themselves (<a href=\"https://forum.effectivealtruism.org/posts/z73rJbz8PNi7aFfsW/ea-survey-2019-series-engagement-levels\">2019</a>, <a href=\"https://forum.effectivealtruism.org/posts/4xczoALF6adpQk3TN/ea-survey-2020-engagement\">2020</a>), we find a fairly high level of consilience between different measures. So people who are less/more engaged on the scale are also less/more likely to engage in a suite of different activities. Granted, this is still a certain kind of EA engagement (namely engagement with EA content and activities), and so won't capture some cases of people who are very <i>dedicated</i> and do <i>high value </i>work (e.g. perhaps a high powered policy maker or donor); but most cases where people have \"engaged extensively\" with EA content, should still be captured as high engagement, regardless of their current activities.</p>", "parentCommentId": "zdaJsZpwafKGJp9ji", "user": {"username": "David_Moss"}}, {"_id": "BuL3SEkyJeGzMNWiC", "postedAt": "2023-05-16T15:16:00.710Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Thanks. I agree this is interesting to look at.</p><p>Since we didn't gather donation data this year, in order to keep the survey shorter, we have to go back to data from earlier survey years.</p><p>In EAS 2020, we asked about <i>current</i> career (rather than career strategy). This is obviously appreciably different (and more vulnerable to just reflecting the fact that people in different current careers can afford to donate different amounts, rather than reflecting the different groups), but here are the results:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/dwfh2kr9nml5peperfov\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/zjsnpua1lomawwnsquec 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/p5oq7ibpijiqfqua0slf 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/wiqiyxbv5cqurlmfxttj 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/brngroc9vbahhimaril8 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/dfzyn49fhmlwcnwlfaye 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/byylqfczo3vlwsvzekj1 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/ueejo5k2dyutg3reosud 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/t2oma7sgddmydrjizy7f 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/rkjqnmtphoepvx8l7nua 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/aslsxdf0nkjpu3njlz2m 1999w\"></figure><p>Here we can see that high donors are much more likely to be in for-profit (earning to give), though there is also a non-significant trend in the direction of higher donors being more likely to be in for-profit (not earning to give). A higher percentage of high donors also selected work at an EA non-profit (though the difference was small and not significant). Higher donors were less likely to select \"still deciding what to pursue\" and \"building flexible career capital and will decide later\" (compared to the lowest donors), but I imagine that this likely reflect these categories being more often selected by early career/student low-earning, low-donors.&nbsp;</p><p>In 2019, we asked a question which may be a more informative comparison to 2022, \"If you had to guess, which broad career path(s) are you planning to follow?\" (this may be <i>somewhat</i> less vulnerable to simply reflecting the fact that people currently in earning to give can currently donate more, but probably still reflects this to a significant degree).&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/pjq7izgvauxuirevadrd\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/vxwg8fobjod5id0rzmtw 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/ohqsy0etvvxjez8de2mt 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/jsex089bquxr4aa3gw6q 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/ismpocc19s53os4rllhq 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/tazpyuyeajfg0mck8tsk 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/gsxxuvosptfre0nrpb5u 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/aakd4o9salgv3dafend2 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/coibztb6dnn1qamlcqlh 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/gtnwlv3wtq1wl9nq4dzd 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/BuL3SEkyJeGzMNWiC/atnnfzsu5qoztekhigkm 1999w\"></figure><p>Here the highest donors are more likely to select earning to give, and they are also less likely to select academia (than the lowest donors).</p><p>As with the original graphs, these differences are likely at least partly explained by other confounding variables (e.g. how long people have been in their career etc.). If we wanted to assess what is ultimately causing the differences, we'd need to examine a more complex model.</p><p>That said, while I think this is interesting, looking at total donations as an operationalization of engagement seems less informative, since although the existing measures may be slightly skewed against E2G people counting (themselves) as highly engaged (due to giving EA orgs and community buildings as exemplars of the highest level of engagement), total donations seems very skewed towards counting E2G people as highly engaged simply in virtue of them earning more than people in other roles (or people who are students/early career).&nbsp;</p><p>My guess is that either a more neutral measure of engagement (e.g. simple self-report of low to high engagement) or some more complex ideal measure of engagement would probably find that (rightly or wrongly) higher engagement is associated with higher interest in research / EA org research over earning to give. It's possible that there'd be a different association with a good measure of EA <i>dedication</i>, which may be different from <i>engagement</i> (but that seems harder and more controversial to measure).</p>", "parentCommentId": "q3dpSFQysYovqmQbx", "user": {"username": "David_Moss"}}, {"_id": "Y23uvesAf6NQfpLZq", "postedAt": "2023-05-16T20:17:50.941Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Wow, very detailed analysis, thank you!</p>", "parentCommentId": "BuL3SEkyJeGzMNWiC", "user": {"username": "Larks"}}, {"_id": "FvYdqRAuCmLswtstT", "postedAt": "2023-05-16T22:11:51.520Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>David &amp; Willem - thanks very much for compiling this useful data.&nbsp;</p><p>The most striking result to me is EA's very strong political skew towards the left, and away from the right:</p><figure class=\"image image_resized\" style=\"width:68.53%\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/u1wunzk5ut4jxdzzkxxi\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/q2oor5goz9ygbpkvgubt 149w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/yttsbcg2q3c4rofkndus 229w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/rrq6lr7ilbshbilkedrm 309w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/umy6aizxwmv5bptftuod 389w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/tzedxpnq6vyhebrhp16e 469w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/pgwmrfzfaxzyrkrl9ezy 549w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FvYdqRAuCmLswtstT/nqxh0mhsrstc33usuxd2 629w\"></figure><p>If this was a demographic pattern (e.g. with respect to race, sex, class, etc), such a strong skew would be taken by many as prima facie evidence of active discrimination against people in the minority categories, and as something that urgently needs to be fixed. (For example, EA seems to devote a fair amount of attention to trying to equalize the male/female sex distribution, and to recruit non-white races).</p><p>When it comes to political views though, many EAs seem reluctant to accept the analogous inference, that EA discriminates against conservatives (or at least under-recruits and under-retains conservatives).&nbsp;</p><p>I've heard various EA rationales for why that inference isn't valid, such as (1) liberals are naturally more altruistic, so are more interested in Effective Altruism, (2) liberals are naturally more intelligent, rational, and open-minded, so are more interested in Rationalism, reason, and evidence applied to altruism, (3) liberals tend to be more atheist/agnostic, so are more interested in secular charities and policies, whereas religious conservatives are more focused on church charities, (4) liberals have a wider 'moral circle' than conservatives, who tend to focus more on family, tribe, and nation, (5) liberals tend to be more utilitarian, whereas conservatives are more virtue-ethical or deontological, etc.</p><p>There are some grains in truth in all these points. But, as someone in the center-right-libertarian category, I can imagine an alternative time-line in which EA was developed mostly by socially conservative libertarians who got fed up with lefty virtue-signaling and with well-intentioned but ineffective government policies. In such a time-line, we could have ended up with a strong conservative skew in EA political orientation, rather than liberal skew we currently see.</p><p>In both cases, I think the political skew should be considered a big problem -- maybe at least as big as an unbalanced sex ratio, an overly-white racial profile, or an overly-atheist attitude towards religion. &nbsp;</p><p>I'm curious what you all think about EA's extreme left-leaning political skew, and whether it represents a problem that needs some attention.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "isNwcbXFghPLeBxi8", "postedAt": "2023-05-16T22:57:58.568Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>X-axis of the university rank distribution histogram is distorted. Some bars represent 25x as many universities as other bars. Ideally it'd look like a smoothed version of the previous graph\n<img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/i9zegvjraaw7936m88ri\" alt=\"\"></p>\n", "parentCommentId": null, "user": {"username": "Pat Myron"}}, {"_id": "nW6B2GorMzehGjwPz", "postedAt": "2023-05-17T03:06:23.707Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Wait, I don't understand. Are 63.6% or 76.6% of respondents left-leaning? And 69.58% or 79.81% non-religious?</p>", "parentCommentId": "YG2cBAGGow9A2BbGz", "user": {"username": "Patricio"}}, {"_id": "D9FmwASjn8e3kg2gg", "postedAt": "2023-05-17T07:42:45.438Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>A reason why the political orientation gap might be less worrying than it appears at first sight is that it probably stems partly from the overwhelmingly young bent of EA. Young people from many countries (and perhaps especially in the countries where EA has greater presence) tend to be more left leaning than the general population.</p>\n<p>This might be another reason to try onboarding older people to EA more relative to the pool of new members, but if you thought that would involve significant costs (e.g. having less young talented EAs because less community building resources were directed towards that demographic), then perhaps in equilibrium we should have a somewhat skewed distribution of political orientations.</p>\n", "parentCommentId": "FvYdqRAuCmLswtstT", "user": {"username": "Alejandro Acelas"}}, {"_id": "pEpsinvHBB6h5gZja", "postedAt": "2023-05-17T08:15:21.972Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>79.81% of respondents who answered the religion question are atheist, agnostic or non-religious, but 69.58% of all respondents (including those who did not answer the question) are atheist, agnostic or non-religious.&nbsp;</p><p>Fortunately, there is no sign of differential non-response across these questions (i.e. similar numbers of respondents answered these questions, as answered other questions a similar length through the survey) or high non-response in general, so one can straightforwardly interpret the former sets of numbers. But, counterfactually, if there were high non-response or high differential non-response, then one might be interested in the proportion selecting from all respondents (and then need to make further inferences about the missing responses).</p>", "parentCommentId": "nW6B2GorMzehGjwPz", "user": {"username": "David_Moss"}}, {"_id": "Advs6nLHcw3wN89Fd", "postedAt": "2023-05-17T08:46:22.164Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>That's true, but by design. With that particular plot, we wanted to show clear percentages for discrete categories of interest. Categories containing even numbers of universities risk (e.g. 1-100, 101-200) being uninformative for practical purposes, by combining universities with very different characteristics, while dividing others). Of course, your mileage may vary as to which categories are practically interesting.<br><br>The previous graph (below) already shows the raw distribution, but you can also look at the cumulative percentages in the next plot below (note: this cannot show the <i>unranked</i> universities, which, as the former plot shows, account for a decent proportion of respondents).</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/eaniaroefosvpocwuqi6\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/opqu7hhsb5vbzl3mr23s 160w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/eff76hieknrsjrjtml7p 320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/zknycb67q6qjrk0hr3yb 480w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/mqofgdb4mfp7uvcos4dz 640w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/qr8u21jwf5jram7gbiaw 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/jcz34trl7rlensfnkysu 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/xyeyvnx4b4umfgwqmdbq 1120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/bxg6tf1jrmuaoyhpyi4f 1280w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/lqtxsecnyiyhrvduucel 1440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AJDgnPXqZ48eSCjEQ/weoewjxbpfmaommlur90 1600w\"></figure><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/yrpjfhh0mdd5tcpqaysf\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/bpdqcvsgjiontvim6xrv 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/wgmhtoj16mcgtmx1bjtn 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/dzxad0ujl8y5a6sqm3du 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/kgu0hxrsnhvajagcv6vp 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/ubvsojuigf4ki5htikqw 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/mvefbp7cfbd1gxwo894p 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/ldoo0pvou4dq1zk5slou 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/g7orx91ekqxcuwlkymii 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/kqz5bz5psmeg3gqjw362 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Advs6nLHcw3wN89Fd/jfoyvpccl4ispyzx49zx 1999w\"></figure>", "parentCommentId": "isNwcbXFghPLeBxi8", "user": {"username": "David_Moss"}}, {"_id": "jKMDETxLshhSqFQrg", "postedAt": "2023-05-17T11:18:02.702Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<blockquote><p>A large majority of respondents (69.58%) were atheist, agnostic or non-religious</p></blockquote><p><br>But the graph says 79.81%?</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "uRnSJhjQKFKm3f3Lv", "postedAt": "2023-05-17T11:29:46.026Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>This has already been updated per <a href=\"https://forum.effectivealtruism.org/posts/AJDgnPXqZ48eSCjEQ/ea-survey-2022-demographics?commentId=YG2cBAGGow9A2BbGz\">this thread</a>. Originally, some of the graphs showed the percentage of <i>all respondents</i> selecting each category, but in response to comments we switched to just showing the percentage of respondents who answered each question for all graphs, for simplicity.</p>", "parentCommentId": "jKMDETxLshhSqFQrg", "user": {"username": "David_Moss"}}, {"_id": "iE2ysZekD7kuFonkm", "postedAt": "2023-05-17T11:37:59.147Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>I agree this may stem partly from EA's very strong age skew, but I don't think this can explain a very large part of the difference.&nbsp;</p><p><a href=\"https://news.gallup.com/poll/397241/millennials-gen-clinging-independent-party.aspx\">Within the US</a>, Gen Z are 17% Republican, 31% Democrat (52% Independent), while Millenials are 21% Republican - 27% Democrat (52% Independent). This is, even among the younger group, only a ~2:1 skew, whereas US EAs are 77% left-leaning and 2.1% right-leaning (a ~37:1 skew). Granted, the young Independents may also be mostly left-leaning, which would increase the disparity in the general population. Of course, this is looking at party affiliation rather than left-right politics, but I think it plausible (based, in part, on LW/SSC/ACX data) that even right-leaning EAs are non-Republican voting, so the results may be more skewed than this.</p><p><a href=\"https://news.gallup.com/poll/388988/political-ideology-steady-conservatives-moderates-tie.aspx\">Looking at ideology</a>, US 18-29 year olds are around 23% Conservative, 34% Liberal (41% Moderate), which is also significantly more balanced.</p><p>Of course, there is also the education gap (with EAs being disproportionately highly educated), but among college graduates we still see only 31% conservative, 20% liberal, and 27% conservative vs 36% liberal for postgraduates.&nbsp;</p><p>One could also argue that <i>elite</i> colleges specifically are even more left-leaning. But, as we note, although the EA community is skewed towards elite colleges, a very large percentage of respondents are not from particularly highly ranked colleges (though this is likely less so looking purely within the US), so it does not seem like this could also explain a large part of the difference.</p><p>It's also worth bearing in mind that in some of these cases the explanation of the difference may flow in the reverse direction: e.g. it could be that features of the EA community make it more appealing to political liberals which cause it to attract more young people, rather than vice versa.</p>", "parentCommentId": "D9FmwASjn8e3kg2gg", "user": {"username": "David_Moss"}}, {"_id": "g3CEvMiJRPH8AMXD6", "postedAt": "2023-05-17T11:58:36.050Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Sorry - I was reading on a plane to EAG London and didn't refresh before sending.</p>", "parentCommentId": "uRnSJhjQKFKm3f3Lv", "user": {"username": "Denkenberger"}}, {"_id": "CZT5u5geGHFyxTxNZ", "postedAt": "2023-05-17T12:13:29.539Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>I do think EA's wide moral circle is key to why it doesn‘t attract conservatives (how many liberals / socialists / libertarians vs conservatives would choose to give to a more cost-effective charity abroad to people of a different ethnicity, instead of prioritising their local community?)&nbsp;</p><p>I would guess that libertarians are overrepresented in EA relative to how popular libertarianism is, but conservatives are very underrepresented.</p><p>I think it's important for EA to make more active efforts to engage with conservatives given that crudely, conservatives are in government about 50% of the time, and conservative governments can definitely be convinced to adopt specific policies which benefit foreigners, future generations and animals, especially since conservatives often form alliances with libertarians.</p>", "parentCommentId": "FvYdqRAuCmLswtstT", "user": {"username": "freedomandutility"}}, {"_id": "4L9ePf5mbwen93hXW", "postedAt": "2023-05-17T17:08:05.602Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>At some point, the statistics can almost become self-fulfilling. Many (if not most) people prefer to be in spaces where a decent fraction of the people are like them, where they feel like people like them belong. If there are few people like them, they may get the impression that this isn't a space for them. \"People like them\" could refer to race, religion, politics, socioeconomic status, or any number of identity characteristics. Thus, at some point, I would expect to see lopsided statistics in categories like race, religion, politics, or SES mostly continue <i>even if there was zero discrimination and the original causes for those lopsided statistics were no longer relevant</i>. In other words, I wouldn't expect the statistics to change that much in those categories without taking special steps to improve representation.</p><p>For instance, I don't think the width of one's moral circle would significantly predict interest in AI safety since AI doom will just as equally harm one's \"family, tribe, and nation.\" And it's plausible that conservatives (especially religious conservatives) would be overall more skeptical of AI, and big tech companies, than average.</p><p>A few other points:</p><ul><li>I wonder if conservatives feel less welcome in EA social spaces than they would in EA professional spaces, which would make this one of the places where the porous boundaries between EA as social group and EA as professional group could negatively affect impact. (I identify as a centrist, so am not in a position to answer that.)</li><li>I'd also be curious how often the people who responded as right, center-right, or even center display their right-leaning beliefs in EA spaces, versus how frequently those who responded as left or even center-left do. My guess is that a reasonable observer would think EA is even more politically concentrated on the left than the poll results would suggest. Same question for religion.</li><li>Incidentally, I do think that being coded too far on the left is an impediment to maximum impact. In addition to recruitment/retention issues with centrists and right-of-center people, I think some people in EA are prone to underestimate the importance of political action as a strategy to get certain things done . . . and at least in the US, actually getting stuff done can be easier if you're not coded too strongly on one side of the ideological spectrum.</li></ul>", "parentCommentId": "FvYdqRAuCmLswtstT", "user": {"username": "Jason"}}, {"_id": "SNm5meCAAYfweqGKC", "postedAt": "2023-05-17T17:18:35.799Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Got it, thanks.</p>\n", "parentCommentId": "pEpsinvHBB6h5gZja", "user": {"username": "Patricio"}}, {"_id": "dMC4dNcFdinfbeGxC", "postedAt": "2023-05-17T19:31:54.998Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Thanks for the comment!&nbsp;</p><p>The question of what <i>causes </i>the disparity seems somewhat empirically tractable. For example, one could assess whether conservatives (in the broader population) are lower in EA-related attitudes (the challenge, of course, would be in developing valid measures which aren't implicitly coded as either liberal or conservative).&nbsp;</p><p>We could also test different framings of EA and examine how support for EA from conservatives/liberals varies in response to these different frames. It seems very plausible that interest in EA (from different groups) might vary dramatically across different frames. I think this research should be done for different demographic groups (e.g. gender, race, age), but it would also be tractable and relevant to examine the influence of political ideology. It's possible that different framings would be dramatically more successful in reaching different groups.</p><p>It would also be interesting to examine the effect of presenting people with a view of EA which highlights its diversity (or lack thereof) on relevant dimensions and see how far this changes interest in learning more or getting involved. For example, one could present a description of EA, (such as, an account of an EAG which includes vignettes about various EAs who are all prominently liberal or which includes a mix of conservatives) and see how far this changes levels of interest in EA.</p><p>Another alternative explanation (to conservatives being turned off by some factor), could be differences in exposure to EA. Our survey on <a href=\"https://forum.effectivealtruism.org/posts/qQMLGqe4z95i6kJPE/how-many-people-have-heard-of-effective-altruism#Party_identification\">how many people have heard of EA</a> suggests that about twice as many Democrats as Republicans have encountered EA (for <a href=\"https://forum.effectivealtruism.org/posts/qQMLGqe4z95i6kJPE/how-many-people-have-heard-of-effective-altruism#Sex\">sex</a>, the gap is around 3:2, which would imply 60% men, 40% women).</p><p>Presumably the question of whether a disparity is a problem that requires attention depends, at least in part, on the causal question, although, of course, one might be concerned about epistemic and other effects regardless.</p>", "parentCommentId": "FvYdqRAuCmLswtstT", "user": {"username": "David_Moss"}}, {"_id": "FcYxxjKnSFufNMnov", "postedAt": "2023-05-18T00:15:47.697Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<blockquote><p>I'm curious what you all think about EA's extreme left-leaning political skew</p></blockquote><p>It's an artifact. What's really being measured here is EA's skew towards educated urban professionals, for whom identifying as \"left\" or \"center left\" is a signal of group membership. The actual dominant ideology is, broadly speaking, technocratic liberalism: the same cluster as \"center-right\" Rockefeller Republicans, \"centrist\" New Democrats, or \"center-left\" LibDems, but qualitatively different from the \"center-right\" CDU or \"center-left\" New Dealers.&nbsp;</p><blockquote><p>and whether it represents a problem that needs some attention</p></blockquote><p>Getting Christian conservatives to allocate their donations more effectively would be an extremely good thing but it will never ever happen under the aegis of EA. You would need a totally separate cultural infrastructure, built for (and probably by) communitarians instead of liberal universalists.&nbsp;</p>", "parentCommentId": "FvYdqRAuCmLswtstT", "user": {"username": "yefreitor"}}, {"_id": "sR5GhwEvcHHfWpRTK", "postedAt": "2023-05-18T20:03:24.534Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>David -- excellent suggestions. I agree that these are empirically tractable questions, and you outlined some good strategies for exploring them. I'm happy to collaborate with anyone who wants to push ahead with these ideas.</p>", "parentCommentId": "dMC4dNcFdinfbeGxC", "user": {"username": "geoffreymiller"}}, {"_id": "Fcgqqtse6k2T5gTf2", "postedAt": "2023-05-18T20:10:09.122Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Alejandro - I think you're right that the leftward skew is partly explained by the youth-skew in the EA age distribution, plus the commonly observed correlation between age and conservatism. I also agree that more active recruitment of older people could help balance this out somewhat. (I've critiqued EA's implicit ageism a number of times in EA Forum comments).&nbsp;</p><p>What do you mean by 'CB resources' though? Not familiar with the term.</p>", "parentCommentId": "D9FmwASjn8e3kg2gg", "user": {"username": "geoffreymiller"}}, {"_id": "NaBF4hKNpdohyvwui", "postedAt": "2023-05-19T07:15:02.865Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Thanks for putting numbers to my argument! I was expecting a greater proportion of left-leaning individuals among the college educated, so this was a useful update.</p>\n", "parentCommentId": "iE2ysZekD7kuFonkm", "user": {"username": "Alejandro Acelas"}}, {"_id": "wfeAiwA7cwTvFwnhb", "postedAt": "2023-05-19T07:16:11.790Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Oh, sorry. I'll expand the abbreviation in the original comment. It's 'Community Building resources'.</p>\n", "parentCommentId": "Fcgqqtse6k2T5gTf2", "user": {"username": "Alejandro Acelas"}}, {"_id": "3QzaXKqprjXk5xH6L", "postedAt": "2023-05-19T10:36:26.565Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>I have an intuition this is right, but why are those people picking \"left\" over \"centre-left\" then?&nbsp;<br><br>Edit: I mean not <i>all</i> of them are picking \"left\" obviously, but a considerable minority are.&nbsp;</p>", "parentCommentId": "FcYxxjKnSFufNMnov", "user": {"username": "Dr. David Mathers"}}, {"_id": "gW7oAzuMCs8fveCQH", "postedAt": "2023-05-19T14:59:06.310Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>CEA reached out to me once about this to solicit suggestions, but I think in practice it is quite hard for a left wing organization to actually take any concrete steps to stop prioritizing left wing people, and never heard any follow-up.</p>", "parentCommentId": "FvYdqRAuCmLswtstT", "user": {"username": "Larks"}}, {"_id": "9NambfB89cqvnXehD", "postedAt": "2023-05-20T17:50:52.304Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>OK! Thanks for the explanation.</p>", "parentCommentId": "wfeAiwA7cwTvFwnhb", "user": {"username": "geoffreymiller"}}, {"_id": "GBuydfFM5m2Xu77FE", "postedAt": "2023-05-20T18:00:55.400Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Larks - yes, it is hard for any organization that has a strong political leaning to develop more self-awareness about that leaning, to understand why it might be create some problems in cause area assessment and movement-building, and to develop a realistic strategy for outreach and reform that tries to balance out its partisanship.</p><p>I guess one strategy might be to frame this as a matter of understanding barriers to achieving more widespread adoption of EA values and priorities. The kinds of objections and concerns that conservatives might have about animal welfare, global public health, global poverty, and X risks might be quite different from the objections and concerns that liberals might typically have.&nbsp;</p><p>For example, in terms of geopolitics, conservatives might often have a more positive-sum view of economic growth, but a more zero-sum view of nation-state rivalries (and a more negative view of 'global coordination' through institutions such as the United Nations). This might lead to a view of global poverty issues that prioritize promoting the rule of law, efficient markets, and entrepreneurship in poor countries, rather than reallocation of existing resources (eg direct cash transfers). It might also lead to more concern about arms races between nation-states with regard to X risks (e.g. AI, nuclear weapons), and to a profound skepticism about the effectiveness of government regulation or global coordination.</p><p>Thus, if conservatives hear EAs making arguments about these issues, without understanding the conservative mind-set at all, they might be turned off from EA as talent, as donors, and as advocates -- when they might have actually contributed significantly.</p>", "parentCommentId": "gW7oAzuMCs8fveCQH", "user": {"username": "geoffreymiller"}}, {"_id": "MZZQigxWGDcGm2oen", "postedAt": "2023-05-20T20:13:51.006Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<blockquote><p>This might lead to a view of global poverty issues that prioritize promoting the rule of law, efficient markets, and entrepreneurship in poor countries, rather than reallocation of existing resources (eg direct cash transfers).</p></blockquote><p>And sometimes the re-branding could even be fairly thin. For instance, World Vision is a major NGO popular among American evangelical Christians; presumably their marketing pitches have been tested against their donor base which has significant conservative elements. IIRC, one of the classic pitches in their holiday gift catalog: your donation will purchase these chickens for a poor family, which will not only produce eggs for consumption but allow them to sell some of the eggs in the marketplace to generate income. In a certain light, that sounds like an indirect cash transfer program that is more legible to some conservatives because it partially bypasses their concern that one-time redistribution programs improve short-term welfare only. Receptiveness to this kind of value proposition might signal openness to indirect cash transfer programs with a better EV, like deworming.</p>", "parentCommentId": "GBuydfFM5m2Xu77FE", "user": {"username": "Jason"}}, {"_id": "ZCcPQpskZwxAE68Li", "postedAt": "2023-05-21T21:09:16.704Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Jason -- great example. A lot of it's in the framing!</p>", "parentCommentId": "MZZQigxWGDcGm2oen", "user": {"username": "geoffreymiller"}}, {"_id": "W4hBEQBJBpGLaKGYB", "postedAt": "2023-05-31T12:16:55.180Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>I'm happy to see that the increased community focus on gender diversity seems to be paying off, that's a healthy increase!</p>\n<p>There's still quite a way to go to gender equality though. If you want to forecast on where it will go, I have a market:\n<a href=\"https://manifold.markets/LudwigBald/in-2025-what-percentage-of-eas-are\">https://manifold.markets/LudwigBald/in-2025-what-percentage-of-eas-are</a>\nIt currently predicts 36% non-male survey respondents by 2025</p>\n", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "RMoQHd4dZo9T2JMuW", "postedAt": "2023-07-24T19:35:27.109Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>I'd be cautious drawing conclusions based on one single question about a complex topic. I think different framings would paint a more nuanced picture.</p>\n<p>For example \"left\" has different meanings in different countries. I often hear US Democrats described as left. As a Dutch person where we often have 10+ political parties to choose from, that's crazy. The current Republican Party is a far-right party. Democrats cover the whole rest of the spectrum.</p>\n<p>I still think EA would be left-leaning though. But an EA-inspired political party would look very different from left-wing parties.</p>\n", "parentCommentId": "FvYdqRAuCmLswtstT", "user": {"username": "SiebeRozendal"}}, {"_id": "deqresEpZDwrLq3gZ", "postedAt": "2023-07-24T19:41:22.377Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Also, in the spirit of inclusion: using \"liberals\" to describe leftists is very US-centric language</p>\n", "parentCommentId": "RMoQHd4dZo9T2JMuW", "user": {"username": "SiebeRozendal"}}, {"_id": "Fj3nhN3PJB2bEERfe", "postedAt": "2024-03-15T09:06:31.057Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>World Vision being a Christian charity I think dominates these other effects unfortunately.</p>\n", "parentCommentId": "MZZQigxWGDcGm2oen", "user": {"username": "bec_hawk"}}, {"_id": "qZusXmkNWkGoa42fx", "postedAt": "2024-03-18T14:23:47.348Z", "postId": "AJDgnPXqZ48eSCjEQ", "htmlBody": "<p>Definitely not recommending World Vision itself. But if you could get more American evangelical Christians to support bednet distribution by creating a new AMF-esque organization with (e.g.) Bible verses featured in its promotional materials and sewn in tags on its bednets, then I would probably be in favor of that. The Bible verses would not make the bednets less effective.</p>", "parentCommentId": "Fj3nhN3PJB2bEERfe", "user": {"username": "Jason"}}]