[{"_id": "2CwtZvkoxXHN7x64P", "postedAt": "2023-03-07T12:16:48.680Z", "postId": "AKLwHLWCkLFxqXjyj", "htmlBody": "<p>In 2015 David Roodman looked into this for OpenPhil and wrote up a <a href=\"https://blog.givewell.org/tag/geomagnetic-storms/\">four-part report</a>, but I don't know about anything more recent.</p>\n<p>The <a href=\"https://causeprioritization.org/Geomagnetic_storms\">Cause Prioritization Wiki</a> only links that work which makes me think it's the only attempt within EA.  There's probably non-EA work on this?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "etqs797M7XacHoZw7", "postedAt": "2023-03-07T15:01:36.118Z", "postId": "AKLwHLWCkLFxqXjyj", "htmlBody": "<p>Solar flares are temporary events, so I suppose that a solar flare, however bad it could be, could not be classified as an existencial risk.</p>\n", "parentCommentId": null, "user": {"username": "Eduardo Luís Carls "}}, {"_id": "ZTha7fDFjc2RpKt6c", "postedAt": "2023-03-07T17:56:42.503Z", "postId": "AKLwHLWCkLFxqXjyj", "htmlBody": "<p>There is a rich field of research into space weather and its impacts on modern technology. The 2013 Royal Academy of Engineering report on <a href=\"https://raeng.org.uk/media/lz2fs5ql/space_weather_full_report_final.pdf\">Extreme Space Weather</a> &nbsp;is a good place to start (although it is UK-focussed). The most likely impacts are on electricity networks. Widespread blackouts lasting several months, which would have extreme impacts on critical services, are expected to occur in a 100-year geomagnetic storm. Damage to satellites, satellite services (GPS, satellite timing, etc), and disruption to mobile and radio communication is also expected during such an event.<br><br>There is much less research into space weather as an existential risk. The mechanism is through depletion of atmospheric ozone due to a large influx of extremely high-energy protons, accelerated by a solar flare. &nbsp;Such superflares may have <a href=\"https://iopscience.iop.org/article/10.3847/1538-4357/aa8e96#apjaa8e96s5\">contributed to previous mass extinctions</a>. Such an extinction-level event has been estimated to have an <a href=\"https://link.springer.com/article/10.1007/s41885-022-00105-x\">annual probability of 1/20 million</a>. This estimate is based on extrapolations from radioisotope measurements in tree rings and ice-cores suggesting the existence of much larger space weather events occurring several thousands of years ago, and the observations of flares from other stars with orders of magnitude times the energy of those we observe on our Sun.<br><br>I am currently working on an updated space weather risk assessment for the UK. The focus is not on extinction-level events, but on ~100-year events. Happy to chat if anyone is interested.</p>", "parentCommentId": null, "user": {"username": "M_Allcock"}}, {"_id": "avn8XxWpyYrqG8YWW", "postedAt": "2023-03-07T18:00:09.812Z", "postId": "AKLwHLWCkLFxqXjyj", "htmlBody": "<p>The explosion of a nuclear bomb is \"temporary\", yet carries an extinction risk. Transient events can trigger long-term changes the Earth environment, transforming it into an inhospitable place. \"Temporary\" events can destroy the world.</p>", "parentCommentId": "etqs797M7XacHoZw7", "user": {"username": "M_Allcock"}}, {"_id": "XhwdaucwnWeDagdzs", "postedAt": "2023-03-08T03:41:09.103Z", "postId": "AKLwHLWCkLFxqXjyj", "htmlBody": "<p>I was unaware that solar flares could carry an extinction risk. I thought that it could at worst make silicon-based technology unusable for a few centuries.</p>\n", "parentCommentId": "avn8XxWpyYrqG8YWW", "user": {"username": "Eduardo Luís Carls "}}, {"_id": "74EvFwtoDd8kdrDAu", "postedAt": "2023-04-16T02:20:38.061Z", "postId": "AKLwHLWCkLFxqXjyj", "htmlBody": "<p>2011 there was a solar flare so powerful it shut down the airport in New Zealand.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Username christina "}}]