[{"_id": "nhhcvaTbhLYibHxqT", "postedAt": "2023-01-04T18:09:20.810Z", "postId": "aKNaCdiT6N4fhmLqz", "htmlBody": "<p>Interesting post! Thanks for sharing.</p><blockquote><p>It is possible that individuals living within low-income societies internalise this unspoken valuation that is placed on the willingness to spend to save their lives, and thereby make choices in the real world reflective of the fact that the value they place on their own life is less. This makes for a vicious circle of risky decision making, and makes it all the more difficult to change individual behaviours to look forward to the long-term.</p></blockquote><p>One way of looking at this is that they've internalised a lower valuation on <i>saving lives</i> (as you suggest). But might another way of looking at it be that they've internalised a higher valuation on improving <i>quality of life</i>?&nbsp;</p><p>i.e. if people from low-income societies are willing to spend proportionately less on life-saving interventions, that implies they are willing to spend proportionately &nbsp;more on life-improving interventions.</p><p>If so, are we sure that this needs changing?</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "94W8sZSLXqGRn4Bkw", "postedAt": "2023-01-04T19:00:27.168Z", "postId": "aKNaCdiT6N4fhmLqz", "htmlBody": "<p>Isn't that exactly what we'd expect when there is the marginal utility of consumption is diminishing? &nbsp;An additional pound in a developing country is probably more likely to be purchasing something more important to a person's welfare than someone in a developed country e.g., food or basic shelter vs video games. Furthermore, &nbsp;some of these essentials could themselves be life extending, which would bias the estimates. Finally, it's possible that life in poverty is bad enough that individuals are willing to forego less to extend it (I put the least weight on this explanation, but it is plausible).</p><p>In each of these cases, this GDP-adjusted value of a statistical life discrepancy would be completely rational and the underlying poverty driving the differences would be what needs addressing.</p>", "parentCommentId": null, "user": {"username": "Joseph Richardson"}}]