[{"_id": "edSjFK9hwZAHztfFE", "postedAt": "2023-10-14T00:41:20.837Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>Thanks for writing this; I think my org is doing all of these things - but I will raise this with our finance team just to make sure.</p>\n<p>I found this interesting:</p>\n<blockquote>\n<p>Meta note: There is serious adverse selection in financial or investment advice you encounter on the Forum. To simplify, paid investment professionals usually face insurmountable legal and employer obstacles that prevent them from commenting, so what you read tends to be by unpaid amateurs. I can post this because I am no longer a professional investor, and I am providing unpaid general advice.</p>\n</blockquote>\n<p>This might be a little awkward, but to what degree is this an observation instead of an inference - have you generally seen well-received advice on the forum be pretty bad in a way that would be obvious to most financial advisors as opposed to just expecting this pattern based on the legal obstacles? I guess you won't want to do this, but if you could provide examples of financial advice that you think is incorrect but was well received, that would be pretty interesting to me (and I expect others). You can also message me directly if that's less awkward.</p>\n", "parentCommentId": null, "user": {"username": "calebp"}}, {"_id": "tEPGDseh6e5Ght7ZS", "postedAt": "2023-10-14T01:16:11.910Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>Thanks, really appreciated this post.</p><p>In case anyone is looking for a bank recommendation, I would recommend Mercury, for their excellent UX and good pricing model. We use them for both Manifold the for-profit, and Manifold for Charity. They do provide ~5% yield to for-profits through Mercury Treasury (we use a different interest provider but if we could do it over again, we would definitely choose Mercury Treasury instead). Unfortunately, they don't provide Treasury to nonprofits. Mercury can also do payments to intl accounts with a 1% FX exchange rate (worse than Wise, but Wise is kind of a PITA and kicked us off their platform :P). Referral link if interested: <a href=\"https://mercury.com/r/manifund\">https://mercury.com/r/manifund</a></p><p>We do also have Stripe Opal for banking and other kinds of money movement, though that fits Manifold &amp; Manifund because we do a significant amount of programmatic money movements -- most EA orgs won't need that.&nbsp;</p>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "Qjm4unYhuy5MEfbaL", "postedAt": "2023-10-14T04:31:06.684Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>This is an observation, not an inference.</p><p>1) I recently compiled an (admittedly imperfect) list of the 10 senior investors most qualified to give EA investing advice. To avoid calling anyone out, [0 to 1] of the top 10 investing posts are authored by one of these senior folks, and scrolling quickly through top comments, [0 to 2] comments on these posts are by these senior folks.</p><p>2) I recently tried to gather 8 of the 10 to discuss investing strategy. 6 of us were able to meet, and our #2 and #3 deliverables coming out of that were “write a forum post on why not to get financial advice from the forum” and “create a basic advice doc”. This is #1, and when combined with the Charity Entrepreneurship book excerpt, hopefully is #2.</p><p>Some of what’s on the forum is thoughtful and interesting. But financial professionals structurally cannot refute what isn’t accurate. The most common failure mode is building castles in the sky – theorizing without a basis in reality / without chatting with any actual investors.</p>", "parentCommentId": "edSjFK9hwZAHztfFE", "user": {"username": "JueYan"}}, {"_id": "BFc2SkTrT5KJXxRuY", "postedAt": "2023-10-14T04:31:21.463Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>I’ve also heard that Mercury has a great user experience, but as you mentioned, sadly, they’re not available for nonprofits. For a for-profit, your money market sweep goes to the Vanguard Treasury Money Market Fund, which is awesome: a reputable provider, $59bn under management, and 5.24% yield*. Mercury also offers a multi-bank sweep option, where you can put your balance across say 20 banks, so you get 20x the $250k FDIC limit in government protection.</p><p>If it weren’t for these “invincibility”** features, Mercury may well have failed when Silicon Valley Bank and First Republic failed. Mercury serves mostly startups, who tend to have large balances (over the $250k FDIC limit) and who know each other (and can spark bank runs through their dense networks). Worse, it’s not a bank, and there’s no stock prices or bond prices*** to watch to see when they’re in trouble.</p><p>* note that if you got the same yield via a certificate of deposit instead of a money market account, that’s materially worse, since you’re not insulated from bank failures, and may not be able to redeem if the bank becomes distressed</p><p>** not actually invincible</p><p>*** observable measures of distress are a double-edged sword: you know when the bank is in trouble, but everyone does, so small concerns can snowball into a real large concern</p>", "parentCommentId": "tEPGDseh6e5Ght7ZS", "user": {"username": "JueYan"}}, {"_id": "nddxsrNd6kvdKDjL4", "postedAt": "2023-10-14T10:58:05.799Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>Great article. Very concise, clear and actionable!</p>\n", "parentCommentId": null, "user": {"username": "Grayden"}}, {"_id": "BceoD9BDvZKzmuqfX", "postedAt": "2023-10-14T11:13:06.940Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>This is perfectly written and very helpful -- thank you JueYan!</p>\n", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "XrFYLdgfkYBDict9D", "postedAt": "2023-10-16T01:57:37.836Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>An additional point supporting Advice 1:<br>&nbsp;</p><p>Having multiple banks reduces your vulnerability to administrative FUBAR. It is a fact of life that operating in an unusual fashion in a regulated environment can occasionally cause headaches. When thinking about your org's cash, losing <i>access</i> to all of it is often qualitatively different to losing access to <i>most</i> of it. Having funds spread across multiple banks, while some overhead applies to set up, leaves you with some redundancy in case of institutional delay.</p><p>&nbsp;If you are operating as a non-profit, or a new org that goes through rapid user or revenue growth, the likelihood that you will experience a bureaucracy or ops failure that might restrict access to your cash increases. It's not high enough to be an overriding concern, but certainly well within the likelihood window of something as catastrophic as a bank failure when considering your options.</p>", "parentCommentId": null, "user": {"username": "PipFoweraker"}}, {"_id": "fsrsYKw3ADHxiGhsh", "postedAt": "2023-10-16T19:17:50.568Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>Hi JueYan,</p><blockquote><p>The most common failure mode is building castles in the sky – theorizing without a basis in reality / without chatting with any actual investors.</p></blockquote><p>I think it would be helpful if you could give examples of wrong advice.</p>", "parentCommentId": "Qjm4unYhuy5MEfbaL", "user": {"username": "vascoamaralgrilo"}}, {"_id": "QtnoYunDrctQ4fpRD", "postedAt": "2023-10-17T17:07:34.179Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>Wise offers two services that are not that easy to differentiate. The first is a straight money transfer service, but the second is what they refer to as a \"balance\" which gives you access to a foreign bank account number.</p><p>In a tax group I've had some discussions about whether this requires FBAR reporting. Although the account is held by Wise, they are giving the user access to this account and giving the user the use of the account numbers. My personal opinion is that this requires FBAR reporting.</p><p>Also, the 10,000 limit for FBAR reporting is all accounts that a person has access to. Therefore an employee of an organization that has an account back home with 9500 USD equivalent will have to report the 500 USD in the account at work that they have access to.</p>", "parentCommentId": null, "user": {"username": "Jeff Martin"}}, {"_id": "JfGeNMrY3nyfDb44C", "postedAt": "2023-10-18T13:58:04.441Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>Thanks for that! That seems reasonable. I'd like to point out that this advice only applies to US staff, who have an obligation to report their foreign accounts (above some balance). I'd assume only the folks who have access / authority over the account have a filing requirement, not all US staff in the org. My experience is that this level of FBAR reporting isn't onerous.</p><p><a href=\"https://www.irs.gov/businesses/small-businesses-self-employed/report-of-foreign-bank-and-financial-accounts-fbar\">https://www.irs.gov/businesses/small-businesses-self-employed/report-of-foreign-bank-and-financial-accounts-fbar</a></p><p>You need this information, and only the last requires some math:<br>&nbsp;</p><blockquote><ul><li>Name on the account,&nbsp;</li><li>Account number,</li><li>Name and address of the foreign bank,&nbsp;</li><li>Type of account, and&nbsp;</li><li>Maximum value during the year.&nbsp;</li></ul></blockquote><p>(As a US citizen with a UK bank account from working abroad, I file FBARs for my personal accounts.)</p>", "parentCommentId": "QtnoYunDrctQ4fpRD", "user": {"username": "JueYan"}}, {"_id": "d37XSneheQHpgGw24", "postedAt": "2023-10-19T17:09:38.835Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<p>This is not an object-level comment, but great to see you on the Forum, JueYan!</p>", "parentCommentId": null, "user": {"username": "Lauren Gilbert"}}, {"_id": "LBkCS6eL53nkymGWp", "postedAt": "2024-01-30T21:26:03.618Z", "postId": "akSr4YXHKZcK8EnQe", "htmlBody": "<blockquote><p>Recently, an OP grantee spent 5 hours of staff time opening this&nbsp;<a href=\"https://www.chase.com/business/banking/checking/platinum-business-checking\"><u>Chase Platinum Business Checking account</u></a> which swept into this&nbsp;<a href=\"https://am.jpmorgan.com/us/en/asset-management/adv/products/jpmorgan-u-s-treasury-plus-money-market-fund-morgan-4812c2726\"><u>JPMorgan US Treasury Plus Money Market Fund</u></a>.</p></blockquote><p>I tried to open a Chase Platinum Business Checking account for a 501(c)(3) that I created recently, but it appears that they are not available for nonprofits. If one selects “Corporation” in the dropdown menu on the left, one is forced to select either “S-Corporation” or “C-Corporation” in the dropdown menu on the right, neither of which, I believe, is appropriate for a nonprofit.</p><p>Separately, I successfully opened a Wise Business account, but it has two drawbacks: (1) three months ago, Wise “<a href=\"https://wise.com/help/articles/1Rygn0gaetjmjGcOvyjRZm/were-temporarily-deactivating-wise-business-cards-in-the-us\">temporarily</a>” deactivated Business cards; and (2) their interest feature is unavailable for non-US-based customers (like me).</p><p>Other options mentioned in the post or comments are also, unfortunately, not suitable for my case: e.g. Mercury is not available for nonprofits, and Monzo is only available for UK-based businesses.</p><p>I would be grateful for any recommendations.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}]