[{"_id": "MpcrgecH6byuiyhgt", "postedAt": "2022-10-03T00:58:39.670Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Downvoted because</p><ul><li>There's little attempt to justify why Salinas is a great donation-target, much less one of the best available.</li><li>I believe supporting Salinas is quite clearly and robustly less valuable than alternatives.<ul><li>There are better donation-targets for causing Democrats to keep Congress.<ul><li>Salinas's district is substantially more Democratic than the median, so it's quite unlikely to be the tipping point.</li></ul></li><li>There are more important, tractable, and neglected causes than causing Democrats to keep Congress.<ul><li>For example, longtermism via the <a href=\"https://www.givingwhatwecan.org/charities/longtermism-fund\">Longtermism Fund</a>.</li></ul></li></ul></li><li>Miscellaneous phrases (including \"As one of the few new congressional districts in the nation\" and \"say that they value\" and \"Having tipped the balance the wrong way\") are unnecessarily misleading, rude, and anti-truth-seeking.<ul><li>E.g. it's almost totally irrelevant that this is a new congressional district, and the author presumably knows that.</li><li>Relatedly this is a one-sided pitch; I prefer posts like this to seek to <i>inform</i> rather than <i>convince</i>.</li></ul></li><li>I believe we should think in terms of marginal effectiveness rather than offsetting particular harms we (individually or as a community) cause (see the author's \"you will have contributed in a small way to this failure\" argument). If you want to offset harm that you have done or if you feel guilty, there's little reason to do good in that particular domain (in this case, by donating to Salinas) rather than doing good in a more effective manner.</li></ul><p>(Good luck to Salinas.)</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "vqvrd7qLZn8uatyvS", "postedAt": "2022-10-03T01:20:32.872Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>I initially downvoted for many of the same reasons. And tbh, I still don’t like this post, as it does give off big “give us money please” vibes without really justifying some of its key claims.</p>\n<p>But ultimately I rescinded the downvote because it (sort of) raises a good point: IF people actually believe Flynn/EA undermined Salinas enough to cost the Dems the election, it might really look bad for EA. This leads me to wonder if it isn’t worth just paying some to offset part of the (supposed) damages.</p>\n<p>Personally, I’m reluctant to caving to mud throwing and misrepresenting rhetoric used to extort money out of a good cause. Probably if Salinas came out genuinely in favor of pandemic prevention policies I’d probably be quite supportive of providing funds—but otherwise I’d be iffy on it.</p>\n<p>But it’s not my money…</p>\n<p>Update: Actually, I’m becoming much more pessimistic about funding Salinas unless she clearly supported pandemic preparedness/prevention, because otherwise it would come across as more partisan (“we’re funding this Democrat because… we were told we hurt this Democrat…”). And appeals to political slogans like “short term business success instead of long term sustainability of our world” is honestly a bit intellectually insulting to me.</p>\n", "parentCommentId": "MpcrgecH6byuiyhgt", "user": {"username": "Harrison D"}}, {"_id": "c963yPq4dd9LXhvXu", "postedAt": "2022-10-03T01:24:36.570Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>I'm not sure I understand why this is the best donation target, even for people who want to donate specifically to a political race. For one, it seems all prediction markets and forecasters like FiveThirtyEight give R's a ~75%+ chance of taking back the house, so this single race seems unlikely to be particularly impactful. What's more, the Salinas Erickson race seems relatively safe for D's and I've seen no mention of it anywhere being a tossup. This feels like something I'd get in a campaign email down to the closing line pulling on heartstrings and then immediately asking for a donation.&nbsp;</p><p>&nbsp;</p><ol><li><a href=\"https://projects.fivethirtyeight.com/2022-election-forecast/house/oregon/6/\">https://projects.fivethirtyeight.com/2022-election-forecast/house/oregon/6/</a></li><li>https://projects.fivethirtyeight.com/2022-election-forecast/house/</li></ol>", "parentCommentId": null, "user": {"username": "atlasunshrugged"}}, {"_id": "exPnYADAwodEFEaoq", "postedAt": "2022-10-03T01:35:12.906Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>(It's by no means <i>safely</i> Democratic, but it's substantially more Democratic than the median.)</p>", "parentCommentId": "c963yPq4dd9LXhvXu", "user": {"username": "zsp"}}, {"_id": "EdKBFzJq83xHiP7w2", "postedAt": "2022-10-03T01:38:59.812Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<blockquote><p>I believe we should think in terms of marginal effectiveness rather than offsetting particular harms we (individually or as a community) cause (see the author's \"you will have contributed in a small way to this failure\" argument). If you want to offset harm that you have done, there's little reason to do so by donating to Salinas rather than doing good in a more effective manner.</p></blockquote><p>I have no involvement in the Oregon race, but I disagree with this particular line of reasoning. Even setting aside traditional non-consequentialist arguments for compensating for harm (which I happen to believe in, and which I think are perfectly fine for EAs to act upon while still being EAs), this line of reasoning only works if one adopts <a href=\"https://plato.stanford.edu/entries/decision-causal/\">causal decision theory</a>.</p><p>If we instead adopt <a href=\"https://intelligence.org/2017/10/22/fdt/\">functional decision theory</a>, then there are much stronger reasons to consistently act as a harm-compensating agent. In particular, it can disincentivize harmful strategic behavior by others who try to influence you by simulating what might do in the future. If you cannot be simulated to harm some party without compensating them later, then you cannot be influenced to do so by others. It also enables co-operation with others who can now trust you will compensate them for harm (necessary even for everyday economic interactions).</p><p>I think one <i>could</i> disagree as to whether FDT applies in this case (<a href=\"https://www.lesswrong.com/posts/ySLYSsNeFL5CoAQzN/a-critique-of-functional-decision-theory\">and also disagree with FDT in general</a>), but I want to push back against the general argument that we should always be marginal thinkers, without consideration for the history of past events.</p><p>(S/O to <a href=\"https://forum.effectivealtruism.org/users/particlemania\"><strong>particlemania</strong></a><strong> </strong>for having first explained this argument to me. There's also an argument to be made that conventional morality evolved FDT-like characteristics precisely to solve these strategic problems, but I won't get into that here.)</p>", "parentCommentId": "MpcrgecH6byuiyhgt", "user": {"username": "xuan"}}, {"_id": "a7BC5LLmREfyDuLTX", "postedAt": "2022-10-03T01:49:32.338Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>I don't buy that CDT vs FDT matters here? It's seems like you'll do better to <i>always try to do what's best (and appropriately take into account how actors may try to influence you)</i> than <i>focus on compensating for harm</i>. And perfect altruists (at least) are able to cooperate without compensating one another's harms. And it's not like there's potential cooperation with Salinas here-- donating to her won't affect her actions. And there are some cases where you should act differently if you thought you were being simulated, but those seem to be the exception for general harm-offsetting decisions.</p><p>(I probably can't continue a discussion on this now, sorry, but if there's something explaining this argument in more detail I'd try to read it.)</p><p>P.S. thinking in terms of contractualism, I think rational agents would prefer good-maximizing over harm-compensation policies, e.g. from behind a veil of ignorance.</p>", "parentCommentId": "EdKBFzJq83xHiP7w2", "user": {"username": "zsp"}}, {"_id": "wfPfWjgcp3tswh2y4", "postedAt": "2022-10-03T02:07:24.809Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<blockquote><p>The choice of readers of this forum to fund &nbsp;Flynn in the primary plus the massive influx of money from PACs guided by EA principles made it more likely that she will lose this general election...</p><p>Unfortunately, &nbsp;the contributions you made plus the many millions from the PAC funded by Bankman-Fried required Salinas supporters to dig deeply in their pockets to respond to a tsunami of ads, including &nbsp;untrue attacks.</p></blockquote><p>I think giving persuasive detail about this claim would contribute to the goals of this ask, especially given how central this idea is to this post.</p><ul><li>What special actions did Salinas perform or have performed for her that resulted in depletion, in response to the Flynn candidate? For example, did she spend or deploy favors that were earmarked for the general?&nbsp;<ul><li>If Salinas has been depleted, can you explain or illustrate this with some anecdotal information (a few sentences/paragraphs) that show why Salinas has been put in a worse place?</li></ul></li><li>Are you suggesting that election funding resembles a fixed pot of spending each cycle? Doesn't the perceived closeness of elections and other specific factors strongly drive election spending?&nbsp;</li></ul><p><br>In general, can you explain how people from the EA did harm and explain what EA's duty of care is here as a result for actions?</p><ul><li><strong>Let's say that EA did not donate money and instead, Flynn did well because EAs got out the vote and worked hard for him. Salinas had to spend a lot of money as a result. Would EAs need to compensate the winning candidate Salinas then?&nbsp;</strong><ul><li>If in the scenario above, you don't think EAs need to compensate Salinas, then why would the use of money be a special case, compared to the other substantial resources used, and how fundamental money is to US political campaigns, including Salinas (exemplified by your post)?</li><li>In all close primaries, are the losing candidate's supporters expected to compensate the winner?<br>&nbsp;</li></ul></li><li>Are you asking individual EAs who made personal donations, or are you asking SBF for money?&nbsp;<ul><li>If you're asking EAs personally for money, can you explain/show why these individual donations was abnormal, and if it was abnormal, why it was \"bad\"?&nbsp;</li><li><i>As an aside, basically, no individual normal EA \"wanted or approved\" the 8 figure donation strategy.</i><br>&nbsp;</li></ul></li><li>In the aftermath, isn't it common to believe/speculate that much of the SBF money was neutral or negative to the Flynn campaign?<ul><li>The other candidates orchestrated a major press event, uniting against the Flynn campaign</li><li>The regional paper began a sustained series of hostile, critical takes on Flynn.</li><li><strong>Doesn't it seem plausible that the absolute, net result of the SBF money, was a strong reaction that unified and concentrated support behind Salinas, who has a powerful narrative that embodies many traits (background, political career) that Flynn lacked in his narrative?</strong><ul><li>There was at least one other well-funded candidate (millions of dollars of personal wealth) who literally complained that this crowded out his strategy.</li></ul></li></ul></li><li>Didn't the House PAC give $1M, comparable to the total of the EA donation amounts? Do they need to compensate for their behavior too?</li></ul>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "ofQuHuBfqSiGeCg2f", "postedAt": "2022-10-03T02:42:20.696Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>I think it's worth engaging with Carol, the Salinas campaign, and more generally people who have been adversely affected by EA efforts. If EA wants win elections in party politics, it will require working together with people who run those parties. Narrowly speaking, you might think that they're not focused on the most important issues or that you have better policy ideas, and you might be right. But the ability to build coalitions, working together despite disagreements to accomplish common goals, is a central challenge of party politics.&nbsp;</p><p>I'm not convinced that EAs should donate to the Salinas campaign. FiveThirtyEight gives her a 78% chance of winning her race, meaning that closer races would offer a better chance for donations to tip the scales. Salinas also doesn't list <a href=\"https://www.andreasalinasfororegon.com/issues/\">pandemic preparedness</a> on her Issues page, which was the key issue of the Flynn campaign and I believe an important and neglected cause. But if the argument for the cost-effectiveness of donations to the Salinas campaign were to change, or if EAs found a more cost-effective way to offset possible harms of the Flynn campaign by continuing to engage with Oregonian or Democratic politics, I would consider supporting such an effort.&nbsp;</p><p>More simply, EAs should be kind and understanding in our discussions with Carol and others affected by our work. Maybe they're interested in the EA mindset, but they're unsure how to interpret our actions. We should show them good examples of how we think.&nbsp;</p><p>&nbsp;</p><blockquote><p>I believe we should think in terms of marginal effectiveness rather than offsetting particular harms we (individually or as a community) cause (see the author's \"you will have contributed in a small way to this failure\" argument). If you want to offset harm that you have done or if you feel guilty, there's little reason to do good in that particular domain (in this case, by donating to Salinas) rather than doing good in a more effective manner.</p></blockquote><p>I think many people would disagree, and I expect that they'll interpret your unwillingness to offset direct harms as a moral failure and an inability to cooperate with others. There are some domains that call for ruthless cost-effectiveness, and others that call for building relationships and trust with people with whom you might not always agree. I think politics is the latter.&nbsp;</p>", "parentCommentId": "MpcrgecH6byuiyhgt", "user": {"username": "Aidan O'Gara"}}, {"_id": "hvgHWrrRFBdbuwnak", "postedAt": "2022-10-03T03:13:11.558Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>First, I want to say I did not donate to Carrick Flynn. Second, as someone who has been fairly involved in politics, primaries happen in every race every year and generally you shouldn't expect much more than an endorsement from your opponents should you win, and even that isn't guaranteed.&nbsp;</p><p>Third, telling another candidate's supporters it's their fault if your campaign is unsuccessful is pretty much the opposite of building a winning coalition. I think a much better strategy is to demonstrate commitment to the issue(s) those constituents care about so that they want to support you, if you truly believe their support is critical to your success.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "t5nCAKerkcgQuMbWh", "postedAt": "2022-10-03T04:33:58.123Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Wow, opinion on this post went really negative since I last checked. I figured its karma would hang out around 0–15…</p>\n", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "r4bjGMCG3jLHyW4yh", "postedAt": "2022-10-03T04:51:51.289Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Cf. your update, I'd guess the second order case should rely on things<i> being </i>bad rather than looking bad. The second-order case in the OP looks pretty slim, and little better than the direct EV case: it is facially risible supporters of a losing candidate <i>owe the winning candidate's campaign reparations </i>for having the temerity to compete against them in the primary. The tone of this attempt to garner donations by talking down to these potential donors as if they were naughty children who should be ashamed of themselves for their political activity also doesn't help. &nbsp;<br><br>I'd guess strenuous primary contests within &nbsp;a party does harm the winning candidate's chances for the general (sort of like a much watered down version of third party candidates splitting the vote for D or R), but competitive primaries seem on balance neutral-to-good for political culture, thus competing in them when one has a fair chance of winning seems fair game.&nbsp;<br><br>It seems the key potential 'norm violation you owe us for' is the significant out-of-state fundraising. If this was in some sense a 'bug' in the political system, taking advantage of it would give Salinas and her supporters a legitimate beef (and would defray the potential hypocrisy of supporters of Salinas attacking Flynn in the primary for this yet subsequently hoping to solicit the same to benefit Salinas for the general - the latter is sought to 'balance off' the former). This looks colorable but dubious by my lights: not least, nationwide efforts for both parties typically funnel masses of out-of-state support to candidates in particular election races, and a principled distinction between the two isn't apparent to me. &nbsp;</p>", "parentCommentId": "vqvrd7qLZn8uatyvS", "user": {"username": "Gregory_Lewis"}}, {"_id": "MWkNDjgdzENtn3t5a", "postedAt": "2022-10-03T09:31:25.806Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>For whatever it's worth, it looks like Carrick himself has chosen to donate $2900 to the Salinas campaign, and to publicly announce it via his official Twitter account:</p>\n<blockquote>\n<p>Today I donated the maximum amount, $2900, to #OR06's @AndreaRSalinas. I earned less than $45k last year, so my money is where my mouth is when I say that I believe she will do an excellent job representing Oregonians in DC. [1/2]</p>\n</blockquote>\n<blockquote>\n<p>This is a tight race and we must win it not only to get Andrea into office but also to keep Congress blue. Please consider digging deep and donating to her campaign here: <a href=\"https://tinyurl.com/2p8m9nwh\">https://tinyurl.com/2p8m9nwh</a>. And for those planning to help GOTV, I'm right here with you. [2/2]</p>\n</blockquote>\n<p><a href=\"https://mobile.twitter.com/CarrickFlynnOR/status/1576844821360443392\">https://mobile.twitter.com/CarrickFlynnOR/status/1576844821360443392</a></p>\n", "parentCommentId": null, "user": {"username": "xuan"}}, {"_id": "A46qRZ6KHzLntuYTB", "postedAt": "2022-10-03T12:39:46.365Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Yeah, the language in your comment really resonates with me/my emotions and also gives me a more negative view of the OP, yet I am worried about being overly influenced by 1) the quality of the OP (relative to the legitimacy of the underlying points), and 2) my emotions on this.</p>\n<p>Ultimately, I think the second order effects still dominate and warrant someone somewhere giving this request a good think-through separate from emotional reactions:</p>\n<ol>\n<li>\n<p>Does not providing some funds to Salinas hurt the chances of future EA candidates or advocacy (especially those who might run for or target the Democratic Party) due to Dem opposition/bitterness (regardless of how legitimate such feelings may be)?</p>\n</li>\n<li>\n<p>Does providing funds to Salinas hurt the chances of future EA candidates or advocacy (especially those who who might run for or target the Republican Party) due to Republicans portraying EA as a “fund blue no matter who” movement (regardless of how legitimate such a label may be)?</p>\n</li>\n</ol>\n", "parentCommentId": "r4bjGMCG3jLHyW4yh", "user": {"username": "Harrison D"}}, {"_id": "i3Ew5ipZ6EEYAc8jq", "postedAt": "2022-10-03T14:15:45.999Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Maybe it's just a matter of degree but the Protect our Future PAC spent <a href=\"https://slate.com/news-and-politics/2022/05/sam-bankman-fried-cryptocurrency-carrick-flynn-loss.html\">unprecedented levels on Carrick's campaign</a>, and, maybe this more of a principled distinguishing feature,<a href=\"https://www.fec.gov/data/independent-expenditures/?committee_id=C00801514&amp;data_type=processed&amp;is_notice=false&amp;most_recent=true&amp;candidate_id=H2OR06066&amp;support_oppose_indicator=O&amp;min_date=01%2F01%2F2021&amp;max_date=12%2F31%2F2022\"> they seem to have spent $1.75M</a> on <a href=\"https://www.youtube.com/watch?v=qDTRZp2aZF4\">attack ads against Salinas</a>, which maybe biggest 'within party' attack ad budget in a primary. Seems understandable this can be seen as a norm violation (attack ads are more sticky) and perhaps it's poor 'cooperation with other value systems'.</p>", "parentCommentId": "r4bjGMCG3jLHyW4yh", "user": {"username": "HaukeHillebrandt"}}, {"_id": "AeDgsTHNPx9JePGhN", "postedAt": "2022-10-04T01:31:18.827Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<blockquote><p>a principled distinction between the two isn't apparent to me.</p></blockquote><p>Indeed, there was <a href=\"https://thehill.com/latino/3462753-hispanic-caucus-throws-1-million-into-disputed-oregon-primary/\">an explicit tit-for-tat donation</a> of out-of-state money to Salinas intended to offset donations to Flynn:</p><blockquote><p>Bold PAC, the Congressional Hispanic Caucus (CHC) campaign arm, is preparing the seven-figure independent expenditure in favor of its endorsed candidate, state Rep. Andrea Salinas (D), in the race for Oregon’s newly created 6th District.</p><p>... The new investment is a tit-for-tat blow against the Democratic leadership PAC, House Majority PAC (HMP), which earlier this month pledged a similar investment to prop up political newcomer Carrick Flynn in that race.</p></blockquote>", "parentCommentId": "r4bjGMCG3jLHyW4yh", "user": {"username": "Ben_West"}}, {"_id": "AWWPcYzHZzzXMx5L3", "postedAt": "2022-10-12T23:44:23.560Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Thank you, Charles, these are really good questions. &nbsp;I apologize for writing in haste initially. &nbsp;With the passage of time, I can add some more information and, hopefully, answer your questions and comments. &nbsp;</p><p>Why Salinas instead of contribution to someone else in this general election?</p><p>&nbsp; &nbsp; &nbsp; &nbsp;Assuming that Carrick Flynn came to know some of Salinas during the primary and that he reflects some of the values of EA forum, his contribution to Salinas in the general election is noteworthy. &nbsp;As quoted above from Flynn's twitter feed.</p><blockquote><p>Today I donated the maximum amount, $2900, to #OR06's @AndreaRSalinas. I earned less than $45k last year, so my money is where my mouth is when I say that I believe she will do an excellent job representing Oregonians in DC. [1/2]</p></blockquote><blockquote><p>This is a tight race and we must win it not only to get Andrea into office but also to keep Congress blue. Please consider digging deep and donating to her campaign here: <a href=\"https://tinyurl.com/2p8m9nwh\">https://tinyurl.com/2p8m9nwh</a>. And for those planning to help GOTV, I'm right here with you. [2/2]</p></blockquote><p>In pursuit of answers &nbsp;to concerns about Salinas' focus on pandemic prevention, &nbsp;I talked with her. &nbsp;She would welcome consultation, lobbying, or other support from Carrick Flynn or other experts on what kind of legislation would be responsive to this issue. &nbsp;As &nbsp;vice chair of the Oregon house health care committee and majority whip, she demonstrated her skill at crafting and passing health related legislation. &nbsp;Andrea is also ready to move forward faster than many novice legislators. &nbsp;In her career she first served as an intern to Senator Dianne Feinstein in her San Francisco district office, then as legislative staff to Senator Harry Reid, as tax and trade policy advisor to Congressman Pete Stark and finally as a district aide to Congresswoman Darlene Hooley.&nbsp;</p><p>As to the probability of Andrea winning, the race is currently rated as a toss up by the Cook Political Report. &nbsp;While Fivethirtyeight's Deluxe model shows her winning by a good margin, the classic and lite models that rely more on polls and past data show either a much tighter race or her losing significantly. &nbsp;These models change daily, but have not trended well, partly because of an onslaught of negative advertising. &nbsp;&nbsp;</p><p>Finally, someone asked about examples of how the $13 million plus PAC and candidate spending for Flynn In the primary affects Salinas' &nbsp;current ability to collect money. &nbsp;I can give a personal example. &nbsp;In the primary, Salinas faced a barrage of negative ads near the end of the campaign. &nbsp;At that time, she had few funds to respond and asked for donations to make a &nbsp;low budget ad in response. &nbsp;I gave more at that time than I have ever given before to a campaign. &nbsp;She got the ad out and she won. &nbsp;Now, facing another difficult campaign with an opponent who has much personal funding as well as good outside support, I am not able to give as much as I normally would. &nbsp;I am maxed out for this year. &nbsp;I hear this from many people wishing to support this race. &nbsp;It probably doesn't make a big difference because our donations are a drop in the bucket compared to some of the large PACs, but it &nbsp;represents less discretionary money that the campaign has available.&nbsp;</p><p>I used to work on policy at a &nbsp;number of levels. &nbsp;I was drawn into also working on elections because I realized that sometimes the quickest way to achieve a policy goal is by making sure there are good, thoughtful, informed people making legislation and determining funding. &nbsp;Andrea Salinas is such a person. &nbsp;If one of the routes to achieve real pandemic preparedness is through Congress, she is a powerful candidate to achieve it. &nbsp;I urge you to help her get there. Thank you: &nbsp; &nbsp;https://www.andreasalinasfororegon.com</p>", "parentCommentId": "wfPfWjgcp3tswh2y4", "user": {"username": "Carol Greenough"}}, {"_id": "ey4hepAfNzcWXfo4P", "postedAt": "2022-10-13T00:50:36.240Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Hello Dr. Greenough,<br><br>This seems thoughtful, thank you for writing this.&nbsp;</p><p>You responded to me, but I'm one of the least influential or important people to respond to.&nbsp;</p><p>I've written some thoughts, trying to be succinct and helpful:</p><ul><li>Around sensitive issues like money or duty, EAs, like other many other conscientious people, prefer to be direct and logically exhaustive and avoid emotion—I'm not sure all the communications in this post was successful for reasons related to this. I'm not sure it makes sense to try to write something to get a lot of funding quickly.</li><li>The people involved in OR-6 genuinely want a good candidate for the district, and good &nbsp;trust and coordination on issues like pandemic preparedness.&nbsp;</li><li>I think successful involvement from EAs, requires a high level of trust and communication (and not fully achievable on an internet forum).&nbsp;<ul><li>With a somewhat uncertain chance of success, if you choose to invest time, I suggest you maybe reply or private message <a href=\"https://forum.effectivealtruism.org/users/aogara\">this person</a> or <a href=\"https://forum.effectivealtruism.org/users/haukehillebrandt\">this person</a>, who might be able to communicate offline with you?&nbsp;<ul><li>Ideally, you would already be in contact with EAs who can give you further advice.</li></ul></li><li><strong>Probably one of the most important person to coordinate with and speak to is Carrick Flynn, who I presume you are in communication with or have tried to speak to.</strong></li></ul></li></ul><p>&nbsp;</p><p>This is somewhat of a separate idea, and this would be a major time commitment, but I think your first <a href=\"https://forum.effectivealtruism.org/posts/FG9JJmAYDq9Ghuudg/some-potential-lessons-from-carrick-s-congressional-bid?commentId=iqz5mjaw5eB8MSzs4\">comment was overwhelmingly liked</a>. If you or your staff, continued to write in a way that tried to mainly educate and inform EAs, I think that would be welcome and potentially drive support to you, in a longer timeframe.</p>", "parentCommentId": "AWWPcYzHZzzXMx5L3", "user": {"username": "Charles He"}}, {"_id": "CtscQ7SP8jav5tY5a", "postedAt": "2022-10-13T01:06:20.101Z", "postId": "ALMX8BbR5HfhwbPwp", "htmlBody": "<p>Thank you, &nbsp;Charles, this &nbsp;is helpful. As I am trying to invest time as a volunteer in lieu of having much money to give to the campaign, I am afraid I can't spend much more time reaching out here - and you confirm my sense that, as someone unknown in the community, it is harder to have an impact. &nbsp;But I appreciate you taking the time to help me understand how things work. &nbsp;I am intrigued and generally supportive of what I know about EA.</p>", "parentCommentId": "ey4hepAfNzcWXfo4P", "user": {"username": "Carol Greenough"}}]