[{"_id": "RosBx4WZ73EYLqspS", "postedAt": "2023-01-12T17:28:42.595Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Someone did the right thing today. Thank you.</p>", "parentCommentId": null, "user": {"username": "David Thorstad"}}, {"_id": "A9mcfWMuRP7Rc6sMp", "postedAt": "2023-01-12T17:33:11.644Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>A short note as a moderator:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2xscgs4xk7v\"><sup><a href=\"#fn2xscgs4xk7v\">[1]</a></sup></span>&nbsp;People (understandably) have strong feelings about discussions that focus on race, and many of us found the content that the post is referencing difficult to read. This means that it's both harder to keep to <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">Forum norms</a> when responding to this, and (I think) especially important.</p><p>Please keep this in mind if you decide to engage in a discussion about this, and try to remember that most people on the Forum are here for collaborative discussions about doing good.</p><p>If you have any specific concerns, you can also always reach out to the moderation team at <a href=\"mailto:forum-moderation@effectivealtruism.org\">forum-moderation@effectivealtruism.org</a>.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2xscgs4xk7v\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2xscgs4xk7v\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Mostly copying this comment from one I made on another post.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "KWhtjqpCcdBuuAzm3", "postedAt": "2023-01-12T17:35:40.745Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Here's Bostrom's letter about it (along with the email) for context: <a href=\"https://nickbostrom.com/oldemail.pdf\">https://nickbostrom.com/oldemail.pdf</a></p>\n", "parentCommentId": null, "user": {"username": "aayush-kucheria"}}, {"_id": "oMqWhDfTMSHsiG4pN", "postedAt": "2023-01-12T17:43:47.369Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I wonder why CEA feels the need to comment on what seems to be a personal matter not relating to CEA programming. While I understand how seductive it can be to criticize someone who has said something reprehensible, especially when brought to light with a clumsily worded apology, I wonder if this really relates to CEA, or whether this would have been a good time to practice the Virtue of Silence.</p>", "parentCommentId": null, "user": {"username": "Peter Berggren"}}, {"_id": "6Zxhi2fAymmhvniCf", "postedAt": "2023-01-12T17:52:21.448Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>So CEA's gone off the deep end into left wing political partisanship over object level discussion too. At least it is out now.</p>", "parentCommentId": null, "user": {"username": "Jinx"}}, {"_id": "gP2egH4JLYmfeX9bm", "postedAt": "2023-01-12T17:55:53.655Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I appreciate this quick and clear statement from CEA.</p>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "KwBgErvqqusmpRfk4", "postedAt": "2023-01-12T18:01:26.031Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I probably suggest clarifying what you refer to with 'his words' here, as I've seen people both criticize his writing from 26 years ago and his apology letter for being racist, while I assume you only refer to his writing from 26 years ago?</p>", "parentCommentId": null, "user": {"username": "MaxRa"}}, {"_id": "9pLmbSzmmEvDRF8ZY", "postedAt": "2023-01-12T18:08:47.442Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Hello Peter, I will offer my perspective as a relative outsider who is not formally aligned with EA in any way but finds the general principle of \"attempting to do good well\" compelling and (e.g.) donates to Give Directly. I found Bostrom's explanation very offputting and am relieved that an EA institution has commented to confirm that racism is not welcome within EA. Given Bostrom's stature within the movement, I would have taken a lack of institutional comment as a tacit condonation and/or determination that it is more valuable to avoid controversy than to ensure that people of colour feel welcome within EA.&nbsp;</p>", "parentCommentId": "oMqWhDfTMSHsiG4pN", "user": {"username": "britomart"}}, {"_id": "qoR9nzp8sKpemPQg3", "postedAt": "2023-01-12T18:35:59.698Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Laying aside whether CEA commenting on this was a virtuous action (I think it was virtuous here): People draw adverse inferences when there is a matter of significant public interest involving a leading figure in a social movement, and no appropriate person or entity from that movement issues a statement. Whether or not you think people should do that, they do, and the harm to public reputation is the same whether or not the inference is justified.</p>\n<p>On the other side of the balance, it's not clear what the harm of speaking here is.</p>\n", "parentCommentId": "oMqWhDfTMSHsiG4pN", "user": {"username": "Jason"}}, {"_id": "d5QEt8y9oDdxf8ALT", "postedAt": "2023-01-12T18:50:59.539Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Ah, your title says that your statement is about Bostrom's mail, and Bostrom's apology is not a mail but a letter apologizing for his mail from 26 years ago. Might still be worth clarifying, I might not be the only one who's initially confused.</p>", "parentCommentId": "KwBgErvqqusmpRfk4", "user": {"username": "MaxRa"}}, {"_id": "46fiesXWBJAe4GAKc", "postedAt": "2023-01-12T19:10:46.552Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I think this is very related to CEA.</p>\n<p>Influential EA philosophers having used racial slurs and saying they’re unsure about IQ and race is hurtful to black EAs, hurtful to black people outside EA and bad for future diversity in EA.</p>\n<p>Although this shouldn’t be the primary concern, it is additionally also very harmful to the reputation of other individuals, organisations and initiatives associated with EA, potentially reducing their impact.</p>\n", "parentCommentId": "oMqWhDfTMSHsiG4pN", "user": {"username": "freedomandutility"}}, {"_id": "p9LPMS3G6SwwWaACw", "postedAt": "2023-01-12T19:28:10.132Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I am very confused. Did someone dig this up and <em>then</em> he wrote that in a scramble, or did he proactively come out with this unilaterally? If it's the latter, we should be <em>applauding his courage in forthrightness</em> for apologizing in his current letter and intentionally letting us know, while naturally <em>condemning</em> his words as a student 26 years ago he made on the mailing list. This post currently does not distinguish between these stances; I consider the apology to be a really important social technology if we want to be humans in a functioning community of other humans rather than subject to the vast impersonal forces of ostracism.</p>\n", "parentCommentId": null, "user": {"username": "DonyChristie"}}, {"_id": "mvkgXCnBri869Kg2Z", "postedAt": "2023-01-12T19:35:43.406Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>First sentence of the apology says \"I have caught wind that somebody has been digging through the archives of the Extropians listserv with a view towards finding embarrassing materials to disseminate about people.\" So it seems like he is trying to get ahead of a public disclosure by someone else.</p>\n", "parentCommentId": "p9LPMS3G6SwwWaACw", "user": {"username": "Jason"}}, {"_id": "Wgnxrpt5dBFyWdzH3", "postedAt": "2023-01-12T19:39:57.465Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>My read is that Bostrom had reason to believe that the email would come out either way, and then he elected to get out in front of the probable blowback.<br><br>As evidence, <a href=\"https://twitter.com/xriskology/status/1613585031850786816\">here is Émile Torres indicating that they were planning to write something about the email</a>.<br><br>That said, it's not entirely clear whether Bostrom knew the email specifically was going to be written about or knew that someone was poking around in the extropian mailing list and then guessed that the email would come out as a result.&nbsp;</p><p>In any case, I think it's unlikely that he posted his apology for the email unprovoked.&nbsp;</p>", "parentCommentId": "p9LPMS3G6SwwWaACw", "user": {"username": "Kerry_Vaughan"}}, {"_id": "eE2KG5QcWJKofYFgr", "postedAt": "2023-01-12T19:51:44.641Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I think this would be true except his apology imo is not a good one. He gets <i>some</i> points for apologizing proactively, but I don't give him many, because the apology doesn't come across to me as sincere to me (but rather defensive).&nbsp;</p>", "parentCommentId": "p9LPMS3G6SwwWaACw", "user": {"username": "Amber"}}, {"_id": "zLtmveDQ8gwSwrb5G", "postedAt": "2023-01-12T20:01:59.106Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I'm troubled by this statement. It completely fails to take Bostrom's apology into account in any form. Moreover, accusing Bostrom of racism in this manner could legitimately be viewed as borderline slanderous. The accusation of racism can destroy a persons career, career-prospects, and reputation. In effect it can be a social death sentence. An organisation which wants to uphold the values of consequentialism should be much more careful in assessing the consequences of its public actions for the affected individual.</p>\n", "parentCommentId": null, "user": {"username": "Maximilian Schlederer"}}, {"_id": "XuMFD2PW2JfMmepAo", "postedAt": "2023-01-12T20:28:04.908Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>That's not my reading of the statement (it says \"unacceptably racist language\" and then condemns the manner of discussion rather than beliefs held).&nbsp;</p><blockquote><p>It completely fails to take Bostrom's apology into account in any form.</p></blockquote><p>Yeah, but that can be okay if you think it's higher priority to make a public statement about the contents of the email.</p><p>I initially didn't think such a statement was necessary because disagreeing with the email seemed like a no-brainer, so I didn't think anyone would have any uncertainty about the views of an organization like CEA. &nbsp;But apparently some (very few) people are not only defending the apology – <a href=\"https://forum.effectivealtruism.org/posts/dPmdkjaNGFQHfWhxQ/linkpost-nick-bostrom-s-apology-for-an-old-email?commentId=zGZJBvndBWr4r6HAD\">which I've done myself</a> – but argue that the original email was ~fine(?). I don't agree with such reactions (and Bostrom doesn't agree either and I see him a sincere person who wouldn't apologize like that if he didn't think he messed up), but they show that the public statement serves a purpose beyond just virtue-signalling to make sure there are no misunderstandings. (Note that it's possible to condemn someone's actions from long ago as\"definitely not okay\" <i>without saying</i> that the person is awful or evil!)&nbsp;</p>", "parentCommentId": "zLtmveDQ8gwSwrb5G", "user": {"username": "Lukas_Gloor"}}, {"_id": "P2ksxDsaScTDLrWwz", "postedAt": "2023-01-12T20:41:32.994Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>Influential EA philosophers having used racial slurs and saying they’re unsure about IQ and race is hurtful to black EAs, hurtful to black people outside EA and bad for future diversity in EA.</p></blockquote><p>It's also pseudoscience.</p>", "parentCommentId": "46fiesXWBJAe4GAKc", "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "NgDTgCGeohJQKwbEy", "postedAt": "2023-01-12T20:55:24.861Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I'm not CEA, but in my opinion the same applies to his so-called apology.</p>\n", "parentCommentId": "KwBgErvqqusmpRfk4", "user": {"username": "Guy Raveh"}}, {"_id": "YBbxEGKDC9TGhtuzs", "postedAt": "2023-01-12T21:33:47.281Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>\"To make sure there are no misunderstandings\" it is arguably a fatal strategy not to acknowledge his apologies and not to mention that the \"recklessly flawed and reprehensible words\" stem from a very old email. As it is written, the statement simply sounds like it is calling him out for racism, which is an extremely serious accusation.</p>\n", "parentCommentId": "XuMFD2PW2JfMmepAo", "user": {"username": "Maximilian Schlederer"}}, {"_id": "NGinzdtZEYMK9ERLu", "postedAt": "2023-01-12T21:51:28.259Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>There was a time when being a nonbeliever put you at serious risk of loosing everything (in the muslim countries they'll still kill you for apostasy). So elite groups which understood that the forcefully imposed religious consensus was obviously wrong would instead setup a fake version of Christianity for new recruits, and then once these rose in the ranks tell them \"yeah it's obviously bullshit, congrats for suspecting it... but you are not allowed to say it!\"&nbsp;</p><p>Of course every once in a while, someone high up goes rogue or forgets the vow of silence, and gets caned. Everyone else at the higher ranks submits the formulaic denunciation, and the lie continues until the next person screws up (or their heresy gets revealed when they are investigated for entirely unrelated things).&nbsp;</p><p>https://slatestarcodex.com/2017/10/23/kolmogorov-complicity-and-the-parable-of-lightning/</p><p>It's not a moral fault to not finds these things out on your own but to join the mob instantly against a titan falls without wondering whether he was in fact expressing the well understood fact, which is also a taboo enforced by complete personal destruction... God, save us from these dim-witted inquisitors, for they know not what they do.&nbsp;</p><p>Well, at least now Bostrom will have his name on the same list as James Watson, Francis Kirk and Galileo.&nbsp;</p>", "parentCommentId": null, "user": {"username": "lepidus"}}, {"_id": "9QWe7A9PHcvxRk9CM", "postedAt": "2023-01-12T22:30:23.885Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Bostrom's email was horrible, but I think it's unreasonable on CEA's part to make this short statement without mentioning that the email was written 26 years ago, as part of a discussion about offending people.</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "v8akai9ejMjR98n6J", "postedAt": "2023-01-12T22:40:55.737Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I have to be honest that I’m disappointed in this message. I’m not so much disappointed that you wrote a message along these lines, but in the adoption of perfect PR speak when communicating with the community. I would prefer a much more authentic message that reads like it was written by an actual human (not the PR speak formula) even if that risks subjecting the EA movement to additional criticism and I suspect that this will also be more impactful long term. It is much more important to maintain trust with your community than to worry about what outsiders think, especially since many of our critics will be opposed to us no matter what we do.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "ksHJo4e2QdctyZaKX", "postedAt": "2023-01-13T00:19:41.508Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I don't understand the importance of CEA saying anything<i> to the community &nbsp;</i>about this particular matter. We can all read Bostrom's statement and draw our own conclusions; CEA has -- to my knowledge -- no special knowledge about or insight into this situation. The \"PR speak\" seems designed to ensure that each potentially quotable sentence includes a clear rejection of the racist language in question.</p>", "parentCommentId": "v8akai9ejMjR98n6J", "user": {"username": "Jason"}}, {"_id": "Mh8yJuK3MCqx5ik6x", "postedAt": "2023-01-13T00:24:56.328Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>In what way do you feel like CEA's statement is counterproductive to maintaining trust?</p>", "parentCommentId": "v8akai9ejMjR98n6J", "user": {"username": "pseudonym"}}, {"_id": "dJHxbkbwBDkSBiESH", "postedAt": "2023-01-13T00:33:06.743Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I would be fine if CEA hadn't put out a message at all, but this sets a bad precedent. Robotic PR messages has never been the kind of relationship that CEA has had with the community up until now.</p>", "parentCommentId": "ksHJo4e2QdctyZaKX", "user": {"username": "casebash"}}, {"_id": "9BRuLu6tb3Pm6gM7u", "postedAt": "2023-01-13T00:48:46.981Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I think Jason's point is more that CEA's statement isn't really an attempt to 'communicate with the EA community', so your criticisms don't apply in this case. E.g. this statement could be something for EAs to link to when talking about it with people looking in, who are trying to make an informed judgement (i.e. busy, neutral people lacking information, not committed critics).</p>", "parentCommentId": "dJHxbkbwBDkSBiESH", "user": {"username": "bec_hawk"}}, {"_id": "qkvmrg54c2eFkbfLD", "postedAt": "2023-01-13T00:51:51.817Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>We are not the target audience here. If the PR-speak is interferring with something CEA needs to say to the community, that's one thing. But if there's no need for a community message at all I don't see how the PR-speak message is interfering with community communication.&nbsp;</p>", "parentCommentId": "dJHxbkbwBDkSBiESH", "user": {"username": "Jason"}}, {"_id": "ysNN6buQhEzazrTfS", "postedAt": "2023-01-13T01:01:18.463Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Some context:</p>\n<ol>\n<li>\n<p>Bostrom's problematic email was written in 1996.</p>\n</li>\n<li>\n<p>Bostrom claims to have apologised for the email back in 1996, within 24 hours after sending it. If that's right, then the 2023 message is his second apology.</p>\n</li>\n</ol>\n<p>I am disappointed that the CEA statement does not include these details.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "yzstuLDuBfLfht8Wf", "postedAt": "2023-01-13T01:02:10.109Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>If the message was written for outsiders, then I would encourage them not to post it on the EA forum.</p>", "parentCommentId": "9BRuLu6tb3Pm6gM7u", "user": {"username": "casebash"}}, {"_id": "Z7kQHLvAmc6tfByqC", "postedAt": "2023-01-13T01:05:55.321Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>As a BLACK Birmingham City University Computer Science graduate who studied under Dr Carlo 'Secret Hitler' Harvey, and filed a few graphene patents, these satanic-Nazi enemies of Allah the ALL Conqueror do no surprize me.<br><br>Never heard of this particular racist moron and as a believer in Allah the most wise and just and a follower of the Shia faith (NOT the satanic Khomeini-Khamenei CIA-Satanism) idiots and racists such as this Nick weirdo are doomed to get hypersonic NUKED by Xi and Putin as we enter the age of the Global Majority.<br><br>Nick did us ALL a favour with his silly writing and satanic anti human whatever mutterings.<br><br>Silly horrible, wicked racist, waste of a human being. #getoffmyneck #VictoryisintheGRAVE</p>", "parentCommentId": null, "user": {"username": "Aston Walke #IAMBCU"}}, {"_id": "3zES6QCwfJya7SgvS", "postedAt": "2023-01-13T01:06:56.200Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Because PR messages are so standardised they effectively just follow a formula. They aren't authentic at all and it raises the question of to what extent other messages are representative of CEA's true beliefs.</p>", "parentCommentId": "Mh8yJuK3MCqx5ik6x", "user": {"username": "casebash"}}, {"_id": "PfnPJhkKXnjqyqWCM", "postedAt": "2023-01-13T01:12:32.273Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>The forum seems as good a place as any?</p>", "parentCommentId": "yzstuLDuBfLfht8Wf", "user": {"username": "bec_hawk"}}, {"_id": "ndh7g5tqF8Bkqgwd3", "postedAt": "2023-01-13T01:18:21.208Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>What even is this comment?</p>\n", "parentCommentId": "Z7kQHLvAmc6tfByqC", "user": {"username": "Dragon God"}}, {"_id": "vWfstKQLvFXSA5oBo", "postedAt": "2023-01-13T01:38:28.225Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>My gods, I don't understand why people are downvoting this, actually.</p>\n", "parentCommentId": "P2ksxDsaScTDLrWwz", "user": {"username": "Sharmake"}}, {"_id": "v5pDWGcyBotrtgGhx", "postedAt": "2023-01-13T02:19:15.391Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>This might be less than perfectly charitable, but my subjective impression of the past year or so of EA work is something like:<br>~Neartermists focusing on global poverty: \"Look at our efforts towards eradicating tuberculosis! While you're here, don't forget to take a look at what the Lead Exposure Elimination Project has been doing.\"<br>~Neartermists focusing on animal welfare: \"Here are the specific policy changes we've advocated for that will vastly reduce the amount of suffering necessary for eggs. In terms of more speculative things, we think shrimp might have moral value? Huge implications if true.\"<br>~Longtermists focusing on existential risk: \"so incidentally here's some racist emails of ours\"<br>\"also we stole billions of dollars\"<br>\"actually there were two separate theft incidents\"<br>\"also we haven't actually done anything about existential risk. you can't hold that against us though because our plans that didn't work still had positive EV\"</p><p>I recognize that there are many longtermists and existential-risk-oriented people who are making genuine efforts to solve important problems, and I don't want to discount that. But I also think that it's important to make sure that as effective altruists we are <i>actually doing things that make the world better</i>, and separately, it (uncharitably) feels like some longtermists are doing unethical things and then dragging the rest of the movement down with them.</p>", "parentCommentId": null, "user": {"username": "throwaway_account"}}, {"_id": "z3pbmCXh9vss7mhyt", "postedAt": "2023-01-13T03:36:21.853Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Consider that perhaps the reason most of us on the forum aren't agreeing with you- and the reason Bostrom himself repudiated his words- isn't the taboo around the belief, but rather that most of us think the evidence is unconvincing at best.&nbsp;</p><p>But most of us are not willing to have the object-level debate here for reasons such as politics being mindkiller, not wanting this to become a forum for debating taboo positions, and yes, internal and public perception of the community.</p><p>(I don't have survey data or anything, but I'd bet this is the case.)</p><p>If so, to the extent the majority of EA's tend to be right about things, you should update in that direction in lieu of having the thoughtful critiques of your position.</p>", "parentCommentId": "NGinzdtZEYMK9ERLu", "user": {"username": "ZachWeems"}}, {"_id": "pPFSHydjGEx9R983q", "postedAt": "2023-01-13T04:01:26.345Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>The statement is almost certainly intentionally ambiguous. That's kind of how a lot of PR works: say things directionally and let people read in their preferred details.</p>", "parentCommentId": "KwBgErvqqusmpRfk4", "user": {"username": "gworley3"}}, {"_id": "HBcvQiWFekJSoTCRq", "postedAt": "2023-01-13T07:45:41.999Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>A pretty large fraction of engaged EAs believe in HBD. Its quite common the deeper you go into the community.</p>", "parentCommentId": "vWfstKQLvFXSA5oBo", "user": {"username": "deluks917"}}, {"_id": "vYbburTEchHZv7mn4", "postedAt": "2023-01-13T08:13:56.992Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I feel really quite bad about this post. Despite it being only a single paragraph it succeeds at confidently making a wrong claim, pretending to speak on behalf of both an organization and community that it is not accurately representing, communicating ambiguously (probably intentionally in order to avoid being able to be pinned on any specific position), and for some reason omitting crucial context.&nbsp;</p><p>Contrary to the OP it is easy to come up with examples where within the Effective Altruism framework two people do not count equally. Indeed most QALY frameworks value young people more than older people, many discussions have been had about hypothetical utility monsters, and about how some people might have more moral patienthood due to being able to experience more happiness or more suffering, and of course the moral patienthood of artificial systems immediately makes it clear that different minds likely matter differently in moral calculus.&nbsp;</p><p>Saying \"all people count equally\" is not a core belief of EA, and indeed I do not remember hearing it seriously argued for a single time in my almost 10 years in this community (which is not surprising, since it indeed doesn't really hold any water after even just a tiny bit of poking, and your only link for this assertion is a random article written by CEA, which doesn't argue for this claim at all and also just blindly asserts it). It is still the case that most EAs believe that the variance in the importance of different people's experience is relatively small, that variance almost certainly does not align with historical conceptions of racism, and that there are at least some decent game-theoretic arguments to ignore a good chunk of this variance, but this does not mean that \"all people count equally\" is a \"core belief\" which should clearly only be reserved for an extremely small number of values and claims. It might be a good enough approximation in almost all practical situations, but it is really not a deep philosophical assumption of any of the things that I am working on, and I am confident that if I were to bring it up at an EA meetup, someone would quite convincingly argue against it.</p><p>This might seem like a technicality, but in this context the statement is specifically made to claim that EA has a deep philosophical commitment to valuing all people equally, independently of the details about how their mind works (either because of genetics, or development environment, or education). This reassurance does not work. I (and my guess is also almost all extrapolations of the EA philosophy) value people approximately equally in impact estimates because it looks like the relative moral patienthood of different people, and the basic cognitive makeup of people, does not seem to differ much between different populations, not because I have a foundational philosophical commitment to impartiality. If it was the case that different human populations did differ on the relevant dimensions a lot, this would spell a real moral dilemma for the EA community, with no deep philosophical commitments to guard us from coming to uncomfortable conclusions (luckily, as far as I can tell, in this case almost all analyses from an EA perspective lead to the conclusion that it's probably reasonable to weigh people equally in impact estimates, which doesn't conflict with society's taboos, so this is not de-facto a problem).</p><p>Moving on, I do not believe that this statement is speaking on behalf of the employees of CEA, many of which I am confident also feel quite badly represented by this statement, and is also not speaking on behalf of Effective Altruism. I don't know what process has produced it, but I don't think it is speaking for me or almost anyone else I know within the EA community. Organizations themselves don't have beliefs, and EA has generally successfully avoided descending into meaningless marketing and PR speech where organizations take positions despite nobody at those organizations actually believing those positions. If you want to make a statement on this matter, speak as an individual. Individuals can meaningfully have beliefs. Organizations pretending to have beliefs is usually primarily a tactic to avoid taking responsibility and creating a diffuse target.&nbsp;</p><p>Additionally, it is completely unclear from your statement whether you are referring to Bostrom's original email or whether you are referring to Bostrom's apology. I don't know why you are being ambiguous, but it seems quite plausible that you are doing so in order to not be able to be pinned on either repudiating the statements in Bostrom's apology, which seem quite reasonable to me and many other EAs (and would therefore attract ire from the community), or failing to repudiate those same statements which are attracting a lot of ire publicly due to not being explicitly anti-racist enough. If this is indeed what you are doing, then please stop. This ambiguity is toxic to clear communication. If this is not what you are doing, then please clarify, and also please get better at writing, it seems really extremely obvious that this was going to be a problem with this statement.&nbsp;</p><p>Lastly, you are also &nbsp;not linking to either Bostrom's original statement, or his apology. I don't know why. It would both clear up the ambiguity discussed above, and it would provide crucial context for anyone trying to understand what is going on, and who might have not seen Bostrom's apology. My guess is you are doing this with some other PR reason in mind. Maybe so that when people Google this topic later on this doesn't show up in search? Maybe so that the lack of context makes it less likely that other people outside of the community will understand what this statement is about? In any case, either please get better at communicating, or stop the weird PR games that you are seemingly trying to play here.&nbsp;</p><p>Overall, despite this only being a single paragraph, I think there has been little produced by CEA that has made me feel as badly represented, and that has made me feel as alienated from the EA community as this statement. Please stop on whatever course you are setting out where this is how you communicate with both the public and the community.</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "cbesHvnYJpL2saHy5", "postedAt": "2023-01-13T08:55:46.158Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>in addition to all of this, the statement compounds the already existent trust problem EA has. It was already extremely bad &nbsp;in the aftermath of FTX that people were running to journos to leak them screenshots from private EA governance channels (vide that New Yorker piece). You can't trust people in an organization or culture who all start briefing the press against each other the minute the chips are down! Now we have CEA publicly knifing a long-term colleague and movement founder figure with this unbelievably short and brutal statement, more or less a complete disowning, when really they needed to say nothing at all, or at least nothing right now. &nbsp;<br><br>When your whole movement is founded on the idea of utility maximizing, trust is already impaired because you forever feel that you're only going to be backed for as long as you're perceived useful: virtues such as loyalty and friendship are not really important in the mainstream EA ethical framework. It's already discomfiting enough to feel that EAs might slit your throat in exchange for the lives of a million chickens, but when they appear to metaphorically be quite prepared to slit each other's throats for much less, it's even worse!</p>", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "Sabs"}}, {"_id": "Y9ZyL5FTzbpJv6Dqi", "postedAt": "2023-01-13T08:58:38.426Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Could the people who are heavily downvoting this chain explain why? Is it because people disagree with the claims Mohammad/Sharmake/sapphire are making, or because they think it is violating EA forum norms?</p>", "parentCommentId": "vWfstKQLvFXSA5oBo", "user": {"username": "JWS"}}, {"_id": "gaJwJyu2QuRtvXp2m", "postedAt": "2023-01-13T09:21:30.978Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>As a moderator, I think this comment is unnecessarily rude and breaks&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_discourage__and_may_delete_or_edit_out_\"><u>Forum norms</u></a>. I’m bringing this up to the rest of the moderation team, and we’ll discuss whether to take any further action. Please don't post any more comments like this.&nbsp;</p>", "parentCommentId": "Z7kQHLvAmc6tfByqC", "user": {"username": "Lizka"}}, {"_id": "e6eXwxeazTAPuGL7E", "postedAt": "2023-01-13T10:18:58.929Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I did not downvote any comments, but I am confused by some of the claims.</p><p>How is it pseudoscience to say that one is unsure about a topic? How is it hurtful to black people to say this? I do not mean any offense with these questions.</p><p>I do understand how it is hurtful to use slurs and I think Bostrom was wrong to do so in the original email, even in context.</p>", "parentCommentId": "Y9ZyL5FTzbpJv6Dqi", "user": {"username": "S_123"}}, {"_id": "LFDo5TFnNBYyhijYk", "postedAt": "2023-01-13T11:27:57.944Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Hm, I don't much agree with this because I think the statement is basically consistent with Bostrom's own apology. (Though it can still be rough to have other people agree with your criticisms of yourself).</p>", "parentCommentId": "cbesHvnYJpL2saHy5", "user": {"username": "ChanaMessinger"}}, {"_id": "keCrLtAaS8CBamyJu", "postedAt": "2023-01-13T11:44:40.578Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Where is the evidence for this claim? The <a href=\"https://forum.effectivealtruism.org/posts/dPmdkjaNGFQHfWhxQ/linkpost-nick-bostrom-s-apology-for-an-old-email?commentId=xEyfspivkCwLFNRJh\">extensive research on this topic</a> suggests it is not pseudoscience at all.</p>\n", "parentCommentId": "P2ksxDsaScTDLrWwz", "user": {"username": "Maximilian Schlederer"}}, {"_id": "skCjGiGbBTkPrpFg6", "postedAt": "2023-01-13T11:45:42.780Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Sounds like you feel pretty strongly about this and feel like this was very poorly communicated. What would you have preferred the statement to be instead?</p>", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "pseudonym"}}, {"_id": "WrHARamkczSJj82Pb", "postedAt": "2023-01-13T11:50:33.540Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/dPmdkjaNGFQHfWhxQ/linkpost-nick-bostrom-s-apology-for-an-old-email?commentId=EBWzygRCY4tbLhf88\">Whether or to which extent it is hurtful is indeed unclear.</a></p>\n", "parentCommentId": "e6eXwxeazTAPuGL7E", "user": {"username": "Maximilian Schlederer"}}, {"_id": "JcgRwkjnsFW5N8H9f", "postedAt": "2023-01-13T11:51:14.468Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I think I <i>do</i> see \"all people count equally\" as a foundational EA belief. This might be partly because I understand \"count\" differently to you, partly because I have actually-different beliefs (and assumed that these beliefs were \"core\" to EA, rather than idiosyncratic to me).&nbsp;<br>What I understand by \"people count equally\" is something like \"1 person's wellbeing is not more important than another's\".&nbsp;<br><br>E.g. a British nationalist might <i>not</i> think that all people count equally, because they think their copatriots' wellbeing is more important than that of people in other countries. They would take a small improvement in wellbeing for Brits over a large improvement in wellbeing for non-Brits. An EA would be impartial between improvements in wellbeing for British people vs non-British people.&nbsp;<br><br>\"most QALY frameworks value young people more than older people, many discussions have been had about hypothetical utility monsters, and about how some people might have more moral patienthood due to being able to experience more happiness or more suffering, and of course the moral patienthood of artificial systems immediately makes it clear that different minds likely matter differently in moral calculus\"<br><br>In all of these situations, I think we can still say people \"count\" equally. QALY frameworks don't say that young people's wellbeing matters more - just that if they die or get sick, they stand to lose more wellbeing than older people, so it might make sense to prioritize them. This seems similar to how I prioritize donating to poor people over rich people - it's not that rich people's wellbeing matters less, it's just that poor people are generally further from optimal wellbeing in the first place. And I think this reasoning can be applied to hypothetical people/beings with greater capacity for suffering. I think greater capacity for <i>happiness</i> is trickier and possibly an object-level disagreement - I wouldn't be inclined to prioritize Happiness Georg's happiness above all else, because his happiness outweights the suffering of many others, but maybe you would bite that bullet.&nbsp;<br>&nbsp;</p>", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "Amber"}}, {"_id": "xrhXNqT8kegRGy4Sk", "postedAt": "2023-01-13T12:52:27.936Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I don't see the value in CEA not posting its press statements to the forum. That just means that people have to regularly check another website if they want to see if a statement has been issued. On the other hand, if you do not want to engage with press statements, it only takes two seconds to read the post title and decide not to engage with content you think is inappropriate for the forum. Given the historical frequency of such comments, that's.  . . thirty seconds a year?</p>\n", "parentCommentId": "yzstuLDuBfLfht8Wf", "user": {"username": "Jason"}}, {"_id": "EtsqziESfWmqr4fbq", "postedAt": "2023-01-13T12:58:07.113Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>The community needs to split. Basically high cognitive decouplers and low decouplers can't live together online anymore. And if the EA brand is going to attack the high decoupler way of thinking for the sake of making people like britomart happy - which might be the right choice, there needs to be a new community for altruists who are oriented towards working through any argument themselves, no matter what it implies.</p>\n<p>Mainly, the ea brand and community are tools for doing good, but currently the way they are functioning no longer work quite right.</p>\n<p>Probably because CEA is problematic, and because of the recent recruitment drives that brought a lot of people who weren't coming from the rationalist meme space in, abd this naturally leads to culture clashes.</p>\n<p>Also maybe things are still okay off the forums.</p>\n", "parentCommentId": "9pLmbSzmmEvDRF8ZY", "user": {"username": "timunderwood"}}, {"_id": "Cnt92CpjTcQSWdWdc", "postedAt": "2023-01-13T13:07:04.255Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>It's interesting to read this critique of a EVF/CEA press statement through the lens of EVF/CEA's own fidelity model, which emphasizes the problems/challenges with communicating EA ideas in low-bandwidth channels.</p>\n<p>I don't agree with the specific critique here, but would be curious as to how the decision to publish a near-tweet-level public statement fits into the fidelity model.</p>\n", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "Jason"}}, {"_id": "gEEnTemcdgY5wnP2Y", "postedAt": "2023-01-13T13:16:48.208Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>This seems like a very emotionally-driven response. If you look at the situation rationally, setting aside your instinctive defensiveness, I think you'll realise what a wild overreaction proposing a schism is. I know putting emotion to one side can be really challenging, especially when you feel threatened, but I really suggest making the effort so that you don't embarrass yourself with clearly overblown statements like \"high cognitive decouplers and low decouplers can't live together online anymore.\"</p>\n", "parentCommentId": "EtsqziESfWmqr4fbq", "user": {"username": "britomart"}}, {"_id": "CuQupd8F56uFvAi8S", "postedAt": "2023-01-13T13:32:03.051Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Trust does not mean circling the wagons and remaining silent about seriously bad behavior.  That kind of \"trust\" would be toxic to community health because it would privilege the comfort of the leader who made a racist comment over maintaining a safe, healthy community for everyone else.</p>\n<p>Being a leader means accepting more scrutiny and criticism of your actions, not getting a pass because you're a \"long-term colleague and movement founder figure.\"</p>\n", "parentCommentId": "cbesHvnYJpL2saHy5", "user": {"username": "Jason"}}, {"_id": "C66gk9Czvsqvu8Lr7", "postedAt": "2023-01-13T13:32:30.411Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I don't see proposing a schism as necessarily a \"wild overreaction\", but their certainty does indicate a likely emotionally driven-response.<br><br>I place a decent probability on the current state of drama being the new normal, in which case we need to do something. And there are other things we can try first, but I wouldn't be surprised if Tim turned out to be right in the end.</p>", "parentCommentId": "gEEnTemcdgY5wnP2Y", "user": {"username": "casebash"}}, {"_id": "6AuhYXEbq2gSB6D2G", "postedAt": "2023-01-13T13:50:18.736Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I downvoted it (weakly) because my impression is that \"it's pseudoscience\" is not a nuanced statement on a topic where there's bad science all over the place <i>on both sides</i>. &nbsp;Apart from the awfully racially-biased beliefs of many early scientists/geneticists, there has been a lot of pseudoscience from far right sources on this also more recently – that's important to mention – but so has there been pseudoscience in Soviet Russia (Lysenkoism) that goes in the other ideological direction and we're currently undergoing a wave of science denial where it's controversial in some circles to believe that there are any psychological differences whatsoever between men and women. &nbsp;Inheritance stuff also seems notoriously difficult to pin down because there's a sense in which <i>everything</i> is \"partly environmental\" (if put babies on the moon, they all end up dead) and you cannot learn much from simple correlation studies (there could still be environmental influences in there). &nbsp;I think a lot of the argument against genetic influences is about pointing out these limitations of the research and then concluding that, because of the limitations, it must be environmental only. But that's only half-right: if the research has all these limitations, it makes more sense to be uncertain about the causes.</p><p>When I closely followed the controversy around Sam Harris and his interview of Charles Murray and later the conflict and subsequent discussion between Sam Harris and Ezra Klein, I noticed that the side that was accusing Sam Harris of pandering to pseudoscience was lying about a bunch of easily-verifiable things. I'm not sure I would understand the science well enough to say that they're wrong about their scientific claims (and I didn't bother to read their work in detail), but I think it's good practice not to trust liars. (Ezra Klein was more of a weasel in that discussion than a liar – the people I think were lying were people whose hit piece against Harris and Murray Ezra Klein allowed to be published on Vox.)&nbsp;<br><br>Given the above, it seems possible to me that genetic influences also play a role. It seems plausible on priors (would be a coincidence if all groups are the same in all regards), we have some precedent for group differences (I think the research on Ashkenazi jews having higher average IQ is less controversial?), and it can't fill you with confidence in the other position when we can observe how some people are morally confused so they think the topic is so politically dangerous that they feel the need to lie about things (e.g., in the Sam Harris context, but also recent EA twitter threads I've seen go in that direction).</p><p>It seems clear that some group differences are environmental-only. However, note that, even if they weren't, it wouldn't have any political implications. The benefits of access to good things that underprivileged groups often have less of, like access to education, health care, infrastructure, both parents involved in upbringing (though of course many single parents do an excellent job raising their kids), etc., these benefits don't have much to do with IQ increases! Instead, access to these things is beneficial in all kinds of ways for anyone. So, politically, nothing would change and it would remain morally important to work towards more equality.&nbsp;</p><p><a href=\"https://forum.effectivealtruism.org/posts/dPmdkjaNGFQHfWhxQ/linkpost-nick-bostrom-s-apology-for-an-old-email?commentId=8ykRGK7iWnyqDsmFz\">As I said before</a>, it's totally counterproductive for the goal of fighting racism to stake your case on scientific claims that could turn out to be false. (Imagine how much of a convenient weapon you'd be handing over to racists if they can point out how the anti-racists are staking their claims on potentially flawed science and how they're punishing anyone who expresses uncertainty.) There's no reason to consider group averages morally relevant. It's a huge confusion to act as though there's a lot that morally depends on it.<br><br>I also downvoted sapphire's comments in some places (though not this thread) because they make it seem like there's some conspiracy in EA around this stuff and because I don't like their use of the term \"Scientific Racism.\" (I think the term is very appropriate for many scientists in the early 20th century or before, but very unfair to use towards people like Charles Murray or ones who say things like Bostrom said in his apology.) Regarding the alleged conspiracy, I had to look up what \"HBD\" exactly means. It might be true that some contrarian types are drawn to these topics in Bay area and via that spinoff from Slatestarcodex where people get kicks from discussing controversial topics. But that seems not particularly representative to me (and more rationalists than EAs)? In any case, I mostly talk to EAs in London and Oxford, where I've never seen anyone express any interest in these topics whatsoever, \"EA leadership\" least of all. I agree that the voting patterns maybe suggests something about EA being unusual, but to me that mostly implies stuff like \"EAs/rationalists are skeptical of making confident claims where the evidence is unlikely to support such claims.\"</p>", "parentCommentId": "Y9ZyL5FTzbpJv6Dqi", "user": {"username": "Lukas_Gloor"}}, {"_id": "vxBtpW58bjovDdjjj", "postedAt": "2023-01-13T13:55:59.211Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>IMO, I actually agree with the point that high decouplers and low decouplers can't live together very well. Pessimistically speaking, EA probably has to split because of incompatible cultures from another comment I read:</p>\n<blockquote>\n<p>Hey, I've been a follower the community for years and your post made me want to create an account and leave a thought. Full disclosure: I'm trans FtM from a not-Western country, never been to an EA meetup but have always been curious. I'm listing these characteristic as I think they're directly relevant to what I describe below. Also, I have massive Asperger's (and my English is not perfect), so I want to explicitly note that I 100% value your post, support having a discussion about this, and have no great solutions. Flagging this because the tone of my text may not convey this otherwise.</p>\n</blockquote>\n<blockquote>\n<p>Some thoughts, ordered from most to least banal:</p>\n</blockquote>\n<blockquote>\n<p>Punishment for confirmed bad sexual behavior should be swift, harsh, and very likely. Great care must be exercised to make the abused come forward.\nGreat care must be exercised to thoroughly vet accusations and protect the rights of the accused.\n#1 and #2 involve a false positive/negative tradeoff between each other, and I suspect a solution to satisfy a good chunk of people across many backgrounds is likely impossible. This is likely not news to anyone reading this, so I apologize for wasting your time so far.\nI think your post adeptly highlights the reason for why EA as a movement will almost inevitably (IMO) collapse or split.\nI want to elaborate on the last point most of all. As an observer, I always thought that core point of EA was based in recognizing the fallibility of human emotion in guiding us about priorities, as strong emotional states can cloud our thinking (AFAIK this is not very controversial and is supported by research). This is why Paul Bloom's \"Against Empathy\" is referenced relatively frequently in the community, right? My not important personal opinion is that this is a partial picture, because emotion can also be used as a driver/inspiration to care about injustices. Of course the difficult question is whether you can get the best parts of emotion into the movement without getting the worst of emotion as well.</p>\n</blockquote>\n<blockquote>\n<p>But there's something broader that concerns me, and I think spells trouble for the EA movement as a whole. I will start from a story that has to do with my FtM self. When I started hormonal therapy I noticed that some of my basic intuitions started changing, the feelings and views I wasn't even aware of existing. I kind of took them for granted, they were transparent to me. For example, before, I felt a lot of instinctive anger at injustice, and now I still feel it, but it's more detached and principled. \"Less emotional\" doesn't quite describe it, it's something about the anger becoming more calculating. Like I can be a bit more removed and hypothetical about different problems; I could turn off my empathy a bit (which actually felt scary!) to be more analytical. And to repeat, I assumed my previous emotional responses to be same as everyone's, it didn't even occur to me things could be any other way (I'm sorry if this all sounds like pseudoscience).</p>\n</blockquote>\n<blockquote>\n<p>Now a lot changed in me that could have resulted in the above, and even though other T people I know have on average followed a similar switch (depending on the direction), I didn't think much of it. So it could be totally useless anecdotally, but it did get me reading on the \"gender divide\" in Western politics. And to simplify it greatly, it seems like there's pretty convincing argument that the gradual \"feminization\" of Western cultures in the last several decades drives a lot of the conflict in politics and across institutions, being in a tension with the typical \"masculine\" culture. And this is rooted partly in that women and men, on average, have different views on things like speech/harm tradeoff: women tend to prefer to limit speech to minimize harm, whereas men lean in the other direction. (Please note that these are average, population-level statements, and the distributions of these traits do overlap a lot!)</p>\n</blockquote>\n<blockquote>\n<p>These are some of the more notable readings I've read on this divide:</p>\n</blockquote>\n<blockquote>\n<p>NYT coverage of the gender divide in American politics: <a href=\"https://archive.ph/1LAwU\">https://archive.ph/1LAwU</a>\nOne interesting highlight:\nMale students preferred protecting free speech over an inclusive and diverse society by a decisive 61 to 39. Female students took the opposite position, favoring an inclusive, diverse society over free speech by 64 to 35.</p>\n</blockquote>\n<blockquote>\n<p>A Quillette piece with a lot more stats showing patterns like in the piece above, broadly showing that women on average lean toward diversity/inclusion over speech/\"truth-seeking\" when faced with a choice, and mean lean in the other direction: <a href=\"https://quillette.com/2022/10/08/sex-and-the-academy/\">https://quillette.com/2022/10/08/sex-and-the-academy/</a>\nA bunch of Marginal Revolution posts, highlighting what the authors consider to be both \"good\" and \"bad\" parts of \"feminization\":\n<a href=\"https://marginalrevolution.com/marginalrevolution/2019/12/sex-differences-in-personality-are-large-and-important.html\">https://marginalrevolution.com/marginalrevolution/2019/12/sex-differences-in-personality-are-large-and-important.html</a>\n<a href=\"https://marginalrevolution.com/marginalrevolution/2021/09/a-simple-illustration-of-the-benefits-of-feminization.html\">https://marginalrevolution.com/marginalrevolution/2021/09/a-simple-illustration-of-the-benefits-of-feminization.html</a>\n<a href=\"https://marginalrevolution.com/marginalrevolution/2021/08/when-did-we-all-become-women.html\">https://marginalrevolution.com/marginalrevolution/2021/08/when-did-we-all-become-women.html</a>\n<a href=\"https://marginalrevolution.com/marginalrevolution/2022/03/the-complexities-of-feminization.html\">https://marginalrevolution.com/marginalrevolution/2022/03/the-complexities-of-feminization.html</a>\n<a href=\"https://marginalrevolution.com/marginalrevolution/2020/01/the-feminization-of-society-installment-1637.html\">https://marginalrevolution.com/marginalrevolution/2020/01/the-feminization-of-society-installment-1637.html</a>\n<a href=\"https://marginalrevolution.com/marginalrevolution/2017/05/much-educational-political-polarization-due-feminization.html\">https://marginalrevolution.com/marginalrevolution/2017/05/much-educational-political-polarization-due-feminization.html</a>\nA very polemical, negative, and not particularly epistemically sound piece very critical of feminization: <a href=\"https://richardhanania.substack.com/p/womens-tears-win-in-the-marketplace\">https://richardhanania.substack.com/p/womens-tears-win-in-the-marketplace</a> (including it here solely for the value of showing a clear \"anti\" voice, but I'd read this much more critically than anything else in the list)\nA similarly negative piece, but from someone I'd consider of higher integrity: <a href=\"http://www.arnoldkling.com/blog/feminized-culture/\">http://www.arnoldkling.com/blog/feminized-culture/</a>\nOkay, so what's the point of my super-rambley comment? In short, whether my and my T friends' anecdotal experiences are related to this or not, I think centuries of masculinity-type culture have not left us prepared to a world where culture becomes feminized. We are now entering this world, and have to deal with how to strike a balance between these sets of values. And the \"Effective Altruism\" movement has historically been (to my understanding) a movement that prioritizes asking difficult (even if very offensive) questions and analyzing costs/benefits in a way that increases accuracy (in part, by trying to be less emotional/swayed about the topic of the analysis). It seems to me that as designed, the movement either has to split into two, or just morph into a charity/NGO like many other.</p>\n</blockquote>\n<blockquote>\n<p>Pessimistically, I do not think there's a way to accommodate these sets of views. Having to some limited extent \"experienced both,\" I don't even know how to feel about them myself, internally, and struggle with this daily. How can we expect an entire movement to align then? Perhaps if the leaders and big thinkers of the movement come together, recognize this as the urgent problem, and figure out a way to approach it, there is some sort of resolution (a Scott Alexander megapost/initiative to organize this?). But again, my prediction is that the unobstructed, calculated, detached, low-anger-type discourse would have to give way as EA becomes more inclusive and accommodating of feminized culture.</p>\n</blockquote>\n", "parentCommentId": "C66gk9Czvsqvu8Lr7", "user": {"username": "Sharmake"}}, {"_id": "mYgEeNu8ixLQDEzn9", "postedAt": "2023-01-13T14:14:46.984Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>You should make public the details of your <a href=\"https://forum.effectivealtruism.org/posts/xBfp3HGapGycuSa6H/i-m-less-approving-of-the-ea-community-now-than-before-the?commentId=mbuB2GvXKLqdwf2j8\">early involvement with Alameda</a> and stop trying to cancel other people until you've addressed your own past mistakes and wrongdoings.</p>", "parentCommentId": null, "user": {"username": "throwaway791"}}, {"_id": "4zqKf32hArBDmmziT", "postedAt": "2023-01-13T15:00:31.459Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I mean the post was emotionally driven response to the current situation. The idea that EA should split up is something that I've &nbsp;been thinking about for a while, and nearly wrote a top level post on, before I didn't write it because I decided that I wasn't actually &nbsp;confident enough or making a sufficiently useful point in a sufficiently useful way.<br><br>The idea that anything about this should make you think less of Bostrom as a thinker is nonsense -- though his 'apology' makes me doubt his practical judgement, since it was written in a way that was not in the slightest optimized for ending the controversy.<br><br>People who see this incident as saying something &nbsp;about how interested we should be reading Bostrom's next paper, or about how much we should praise him for the important work he has done are coming from a culture that doesn't fit very well with the way my mind works.</p>", "parentCommentId": "gEEnTemcdgY5wnP2Y", "user": {"username": "timunderwood"}}, {"_id": "iXZawMeHEBn4tKzqT", "postedAt": "2023-01-13T15:10:41.024Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>It's an overreaction with a kernel of truth: there's too much difference for everyone to feel fairly \"represented\" by a single PR source.</p>\n", "parentCommentId": "gEEnTemcdgY5wnP2Y", "user": {"username": "Jason"}}, {"_id": "oGnJsujBeecK5nDgM", "postedAt": "2023-01-13T16:09:41.926Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Thank you, this is very illuminating. You argue that:</p><ul><li>Culture has become \"feminised\" (I assume this means it has started doing more of the housework)</li><li>This feminisation means that EAs are discouraged from engaging with DIFFICULT but IMPORTANT questions, such as \"Are white men the smartest of them all.\"&nbsp;</li><li>One potential solution - this, to me, was the apotheosis of your comment - is \"a Scott Alexander megapost\"</li></ul><p>Spending time on this forum has clarified for me that although I support in principle many of the stated aims of the EA movement, I don't wish to participate in the culture, which is hostile to anyone who refuses to make a fetish of rationality, while refusing to consider the ways in which such fetishisation is itself irrational. So: so long, and thanks for all the fish <a href=\"https://www.dictionary.com/e/emoji/victory-hand/#:~:text=The%20victory%20hand%20emoji%2C%20%E2%9C%8C%EF%B8%8F,representation%20of%20the%20peace%20sign.\"><u>✌️</u></a></p>", "parentCommentId": "vxBtpW58bjovDdjjj", "user": {"username": "britomart"}}, {"_id": "mA9JHKkQShdrHn3tk", "postedAt": "2023-01-13T16:25:36.620Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Thanks for writing out a reaction very similar to my own. As I wrote in <a href=\"https://forum.effectivealtruism.org/posts/vFfoqL74kmZbydKjp/?commentId=7egfSS2YkJ6Kn2dHY\">a comment on a different topic</a>, \"it seems to me that one of the core values of effective altruism is that of impartiality― giving equal moral weight to people who are distant from me in space and/or time.\"</p>\n<p>I agree that \"all people count equally\" is an imprecise way to express that value (and I would probably choose to frame in in the lens of \"value\" rather than \"belief\") but I read this as an imprecise expression of a common value in the movement rather than a deep philosophical commitment to valuing all minds exactly the same.</p>\n", "parentCommentId": "JcgRwkjnsFW5N8H9f", "user": {"username": "tessa"}}, {"_id": "r7ZTHhKGTgYFgtgLT", "postedAt": "2023-01-13T16:42:16.866Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I am <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">banning</a> this user indefinitely for violating Forum norms.</p>", "parentCommentId": "Z7kQHLvAmc6tfByqC", "user": {"username": "Ben_West"}}, {"_id": "jpQiEBsXDymKEeCac", "postedAt": "2023-01-13T17:23:47.237Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>While AI safety has sucked up a lot of attention recently, EA's most famous and most well-funded efforts have been focused in Africa- malaria bednets, deworming, vitamin supplementation, etc etc. There's a post at least monthly, maybe weekly, about how EA isn't diverse enough, that it's a tragedy, and how they can and should improve that.</p><p>I find it difficult to consider <i>the majority of EA actions</i> could possibly be outweighed by one person's terribly stupid statement almost three decades ago, no matter how high-status that person is within the community. I find it difficult to think that a movement that has spent <i>hundreds of millions of dollars</i> improving the lives of the less-fortunate (mostly in Africa, but there was also that 300M$ experiment in criminal justice reform that would mostly help black people if it worked) has a racism problem, and that their<i> hundreds of millions of dollars of actions</i>, don't speak louder than one &nbsp;goofus and his poor apology.</p><p>But if I try to put myself in that headspace, where this movement <i>does</i> have a serious racism problem despite all the evidence suggesting the contrary, one paragraph of PR-speak is not going to be the least bit comforting.&nbsp;</p><p>Could you, or any readers, help me understand that mindset better?</p>", "parentCommentId": "9pLmbSzmmEvDRF8ZY", "user": {"username": "RobertJMoore"}}, {"_id": "ArZpzNmLL2ZoL6bcQ", "postedAt": "2023-01-13T18:00:00.974Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Hello Robert, I am stepping back from this forum but as you've replied to me directly I will endeavour to help you understand my viewpoint. I will use italics as you seem to have a high level of belief in their ability to improve written communication.</p><p><i>If</i> the only form that racism took was <i>hatred</i> of black people, then the evidence you present would be persuasive<i> </i>that EA as a movement as a whole does not condone racism.</p><p>However: racism also encompasses the belief that certain races are <i>inferior</i>. Belief that black people are stupider than white people, for example, is <i>not incompatible</i> with sending aid to Africa.&nbsp;</p><p><i>Therefore, </i>I was relieved to see an EA institution explicitly confirm that it does not condone racism.</p><p>Hope this helps.&nbsp;</p>", "parentCommentId": "jpQiEBsXDymKEeCac", "user": {"username": "britomart"}}, {"_id": "M5qcPzg4ooC4WkkDm", "postedAt": "2023-01-13T18:06:06.557Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>But there is a huge difference in this case between something being a common belief and a philosophical commitment, and there is also a huge difference between saying that space/time does not matter and that all people count equally.</p>\n<p>I agree that most EAs believe that people roughly count equally, but if someone was to argue against that, I would in no way think they are violating any core tenets of the EA community. And that makes the sentence in this PR statement fall flat, since I don't think we can give any reassurance that empirical details will not change our mind on this point.</p>\n<p>And yeah, I think time/space not mattering is a much stronger core belief, but as far as I can tell that doesn't seem to have anything to do with the concerns this statement is trying to preempt. I don't think racism and similar stuff is usually  motivated by people being far away in time and space (and indeed, my guess is something closer to the opposite is true, where racist individuals are more likely to feel hate towards the immigrants in their country, and more sympathy for people in third world countries).</p>\n", "parentCommentId": "mA9JHKkQShdrHn3tk", "user": {"username": "Habryka"}}, {"_id": "Q3zuoyoSdgZghDBXF", "postedAt": "2023-01-13T18:23:31.338Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote>\n<p>In all of these situations, I think we can still say people \"count\" equally.</p>\n</blockquote>\n<p>I don't think this goes through. Let's just talk about the hypothetical of humanity's evolutionary ancestors still being around.</p>\n<p>Unless you assign equal moral weight to an ape than you do to a human, this means that you will almost certainly assign lower moral weight to humans or nearby species earlier in our evolutionary tree, primarily on the basis of genetic differences, since there isn't even any clean line to draw between humans and our evolutionary ancestors.</p>\n<p>Similarly, I don't see how you can be confident that your moral concern in the present day is independent of exactly that genetic variation in the population. That genetic variation is exactly the same that over time made you care more about humans than other animals, amplified by many rounds of selection, and as such, it would be very surprising if there was absolutely no difference in moral patienthood among the present human population.</p>\n<p>Again, I expect that variance to be quite small, since genetic variance in the human population is much smaller than the variance between different species, and also for that variance to really not align very well with classical racist tropes, but the nature of the variance is ultimately the same.</p>\n<p>And the last part of the sentence that I quoted seems also not very compatible with this. Digital people might have hugely varying levels of capacity for suffering and happiness and other things we care about, including different EMs. I indeed hope we create beings with much greater capacity for happiness than us, and would consider that among one of the moral priorities of our time.</p>\n", "parentCommentId": "JcgRwkjnsFW5N8H9f", "user": {"username": "Habryka"}}, {"_id": "TRHHWxfmXcFXseLdA", "postedAt": "2023-01-13T23:59:09.414Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Okay, if there's anyone here who actually believes in HBD, here's a couple reasons why you shouldn't:</p><p><a href=\"https://en.wikipedia.org/wiki/Population_bottleneck#Humans\">Human biodiversity is actually pretty low. Homo sapiens has been through a number of bottlenecks.</a></p><p><a href=\"https://en.wikipedia.org/wiki/Identical_ancestors_point\">Human migrations over the last thousand years have been such that literally everyone on Earth is a descendant of literally everyone that lived 7000 years ago whose offspring didn't die out. This is known as the Identical Ancestors Point.</a></p><p><a href=\"http://pscourses.ucsd.edu/ps108/4%20What%20is%20race/Achenbach%202009-%20Study%20finds%20Africans%20more%20genetically%20diverse.pdf\">Africans have more genetic diversity than literally every other ethnicity on earth taken together, so any classification that separates \"Africans\" from other groups is going to be suspect.</a></p><p><a href=\"https://www.scientificamerican.com/article/race-is-a-social-construct-scientists-argue/\">Race isn't a valid construct, genetically speaking. It's not well defined. Most of the definitions are based on self reports or continents of origin, when we know what is considered \"black\" in the US may not be so in, say, Brazil, or that many people from Africa can very well be considered \"white\".</a></p><p><a href=\"https://arxiv.org/pdf/0706.3639.pdf\">Intelligence is not well defined. There's no single definition of intelligence on which people from different fields can agree.</a></p><p><a href=\"https://en.wikipedia.org/wiki/Intelligence_quotient#Validity_as_a_measure_of_intelligence\">IQ has a number of flaws. It is by definition Gaussian without having appeared empirically first and the g construct itself has almost certainly no neurological basis and is purely an artifact of factor analysis.</a></p><p><a href=\"https://en.wikipedia.org/wiki/Twin_study#Criticism\">Twin studies are flawed in methodology</a><a href=\"https://www.smithsonianmag.com/smart-news/identical-twins-can-have-slightly-different-dna-180976736/#:~:text=Research%20published%20on%20January%207,how%20scientists%20study%20human%20development.\">. Twins, even identical twins, simply do not have exactly the same DNA.</a></p><p><a href=\"https://en.wikipedia.org/wiki/Evolution#Evolutionary_processes\">Evolution isn't just mutations and natural selection. Not every trait is an adaptation.</a></p><p><a href=\"https://en.wikipedia.org/wiki/Heritability#Controversies\">Heritability does not imply genetic determinism. Many things are heritable and do not involve genes.</a> <a href=\"https://en.wikipedia.org/wiki/Heritability#Overview\">These include epigenetic mechanisms, microbiota, or even environmental stress on germinal cells.</a></p><p><a href=\"https://www.youtube.com/watch?v=jKVowgubMEg&amp;ab_channel=RebeccaWatson\">We don't mate randomly, which is an assumption in many genetics studies.</a></p><p><a href=\"https://osf.io/preprints/socarxiv/2qfkt/\">HBD is not generally accepted in academia.</a></p><p><a href=\"https://en.wikipedia.org/wiki/Cyril_Burt#Fraud_accusations\">Many public HBD figures have been found guilty of fraud. Cyril Burt would literally forge results, while Lynn would take the average of two neighboring countries' IQ in order to derive \"data\" from a country's unknown national IQ.</a></p><p><sup>Special thanks to </sup><a href=\"https://old.reddit.com/r/SneerClub/comments/gmwst1/what_is_the_most_concise_debunking_of_hbd_if_it/\"><sup>these</sup></a><sup> </sup><a href=\"https://old.reddit.com/r/genetics/comments/unwrmh/how_long_are_we_from_raising_our_iq/\"><sup>threads</sup></a><sup> for compiling most of the information</sup></p><p>Now you might want to attack one of these (and feel free to send me a message), but even if you're right, that would still leave more than enough reasons to stay away from HBD.</p>", "parentCommentId": "HBcvQiWFekJSoTCRq", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "HB9SoprPTPDgFvXaK", "postedAt": "2023-01-14T00:55:20.279Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Adding on to this with regards to IQ in particular, I recommend <a href=\"https://www.vox.com/the-big-idea/2017/5/18/15655638/charles-murray-race-iq-sam-harris-science-free-speech\">this article</a> and <a href=\"https://www.vox.com/the-big-idea/2017/6/15/15797120/race-black-white-iq-response-critics\">it's followup</a> by academic intelligence researchers debunking misconceptions about their field. To sum up some of their points:</p><ul><li>IQ test scores are significantly affected by socio-economic and other environmental factors, to the point where one study found adoption from a poor family to a rich one causes a 12-18 point jump in IQ score.</li><li>The average IQ of the whole populace jumped 18 points in 50 years due to the Flynn effect.</li><li>The gap in test scores between races has been dropping for decades, including a 5 point drop in the IQ test score gap over 30 years.&nbsp;</li><li>With the above points in mind, the remaining IQ test score gap of 9.5 points does not seem particularly large, and does not seem to require any genetic explanation.&nbsp;</li></ul>", "parentCommentId": "TRHHWxfmXcFXseLdA", "user": {"username": "titotal"}}, {"_id": "wNt6EpMDQwJa54CGA", "postedAt": "2023-01-14T01:26:40.719Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Bostrom's 2023 letter spends more time defending his 1996 beliefs than anything else.</p>\n<p>He chose to \"get out in front\" in a way that raises far more questions than it settles,\n&amp; I think this statement rightly holds him accountable for that.</p>\n<p>Bostrom today clearly disavows using the N-word in '97.\nDoes he still believe in some form of white superiority?\nI hope not!\nBut right now, the ambivalence &amp; vagueness of his 2023 letter is working like a dog whistle to western chauvinists,\n&amp; I hope he figures that out &amp; denounces them as strongly as this statement does.</p>\n", "parentCommentId": "9QWe7A9PHcvxRk9CM", "user": {"username": "Wasserperson"}}, {"_id": "fHz2ovHPS6xrAAuTe", "postedAt": "2023-01-14T02:46:46.216Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Moderator here. The <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m#jWixx3JEurXKPx4eH\">comment you quote</a> describes the personal experience of someone who transitioned genders, but the selection you quoted doesn't make that clear (or other nuance like that the commenter has Asperger's and isn't a native English speaker), which makes your quote unnecessarily inflammatory. Could you remove the quote and instead link to the comment? (Or quote the comment in its entirety.)</p>", "parentCommentId": "vxBtpW58bjovDdjjj", "user": {"username": "Ben_West"}}, {"_id": "aGQfKPYS2HzF5v2KH", "postedAt": "2023-01-14T04:07:38.596Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Sabs -- I agree. EAs need to learn much better PR crisis management skills, and apply them carefully, soberly, carefully, and expertly.&nbsp;</p><p>Putting out very short, reactive, panicked statements that publicly disavow key founders of our movement is not a constructive strategy &nbsp;for defending a movement against hostile outsiders, or promoting trust within the movement, or encouraging ethical self-reflection among movement members.</p><p>I've seen this error again, and again, and again, in academia -- when administrators panic about some public blowback about something someone has allegedly done. We should be better than that.</p>", "parentCommentId": "cbesHvnYJpL2saHy5", "user": {"username": "geoffreymiller"}}, {"_id": "YN85c93DD3EiNLFfo", "postedAt": "2023-01-14T05:50:37.584Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I say it is pseudoscience on the grounds that there is a scientific consensus that genetic explanations for racial iq-gaps are deemed pseudoscientific.</p><p><a href=\"https://en.wikipedia.org/wiki/Scientific_racism\">https://en.wikipedia.org/wiki/Scientific_racism</a></p><p><a href=\"https://en.wikipedia.org/wiki/Race_and_intelligence\">https://en.wikipedia.org/wiki/Race_and_intelligence</a></p><p>To anyone who sincerely wonders if there's anything to the \"race-iq realism\" theory, I ask you to consider this great point point made Ezra Klein to Sam Harris when Harris embraced The Bell Curve: very rarely will you see any serious consideration of the possibility that environmental factors explain &gt;100% of the black-white iq gap. &nbsp;In other words, on a purely genetic basis that black people may be more intelligent than white people is alien to the discourse.</p><p>And of course there's all sorts of other issues that cloud this discussion about the arbitrariness of race, the poor correlation between \"race\" and genetics, black americans having substantial european ancestry owing to slavery etc etc.</p><p><a href=\"https://www.vox.com/the-big-idea/2017/6/15/15797120/race-black-white-iq-response-critics\">https://www.vox.com/the-big-idea/2017/6/15/15797120/race-black-white-iq-response-critics</a></p><p>The science is clear, it's pseudoscience folks.</p><p>Thank you Bob Jacobs for your resources.</p>", "parentCommentId": "keCrLtAaS8CBamyJu", "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "HytZf8hysZXgaJACE", "postedAt": "2023-01-14T06:10:38.036Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>One of the defining characteristics of EA is rejecting <i>certain specific</i> reasons for counting people unequally; in particular, under EA ideology, helping someone in a distant country is just as good as helping a nearby person by the same amout. Combined with the empirical fact that a dollar has much larger &nbsp;effect when spent on carefully chosen interventions in poorer countries, this leads to EA emphazing on poverty-reduction programs in poor, mainly African countries, in contrast to non-EA philanthropy which tends to favor donations local to wherever the donor is.</p><p>This is narrower than the broad philosophical commitment Habryka is talking about, though. Taken as a broad philosophical commitment, \"all people count equally\" would force some strange conclusions when translated into a QALY framework, and when applied to AI, and <i>also</i> would imply that you shouldn't favor people close to you over people in distant poor countries <i>at all,</i> <i>even if the QUALYs-per-dollar were similar</i>. I think most EAs are in a position where they're willing to pay $X/QALY to extend the lives of distant strangers, $5X/QALY to extend the lives of acquaintances, and $100X/QALY to extend the lives of close friends and family. And I think this is philosophically coherent and consistent with being an effective altruist.</p>", "parentCommentId": "JcgRwkjnsFW5N8H9f", "user": {"username": "jimrandomh"}}, {"_id": "iYKMcgZu6wAL7oEFQ", "postedAt": "2023-01-14T06:39:48.171Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>You and I have a very opposite reflection of the Sam Harris vs Ezra Klein fiasco.</p><p>I'd like to hear what you think about Klein's point that environmental factors explain may &gt;100% of the black-white iq gap, and yet this is alien in the race realism discourse. &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email?commentId=YN85c93DD3EiNLFfo\">https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email?commentId=YN85c93DD3EiNLFfo</a></p><blockquote><p><span><span class=\"mjpage\"><span class=\"mjx-chtml\"><span class=\"mjx-math\" aria-label=\"\"><span class=\"mjx-mrow\" aria-hidden=\"true\"></span></span><style>.mjx-chtml {display: inline-block; line-height: 0; text-indent: 0; text-align: left; text-transform: none; font-style: normal; font-weight: normal; font-size: 100%; font-size-adjust: none; letter-spacing: normal; word-wrap: normal; word-spacing: normal; white-space: nowrap; float: none; direction: ltr; max-width: none; max-height: none; min-width: 0; min-height: 0; border: 0; margin: 0; padding: 1px 0}\n.MJXc-display {display: block; text-align: center; margin: 1em 0; padding: 0}\n.mjx-chtml[tabindex]:focus, body :focus .mjx-chtml[tabindex] {display: inline-table}\n.mjx-full-width {text-align: center; display: table-cell!important; width: 10000em}\n.mjx-math {display: inline-block; border-collapse: separate; border-spacing: 0}\n.mjx-math * {display: inline-block; -webkit-box-sizing: content-box!important; -moz-box-sizing: content-box!important; box-sizing: content-box!important; text-align: left}\n.mjx-numerator {display: block; text-align: center}\n.mjx-denominator {display: block; text-align: center}\n.MJXc-stacked {height: 0; position: relative}\n.MJXc-stacked > * {position: absolute}\n.MJXc-bevelled > * {display: inline-block}\n.mjx-stack {display: inline-block}\n.mjx-op {display: block}\n.mjx-under {display: table-cell}\n.mjx-over {display: block}\n.mjx-over > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-under > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-stack > .mjx-sup {display: block}\n.mjx-stack > .mjx-sub {display: block}\n.mjx-prestack > .mjx-presup {display: block}\n.mjx-prestack > .mjx-presub {display: block}\n.mjx-delim-h > .mjx-char {display: inline-block}\n.mjx-surd {vertical-align: top}\n.mjx-surd + .mjx-box {display: inline-flex}\n.mjx-mphantom * {visibility: hidden}\n.mjx-merror {background-color: #FFFF88; color: #CC0000; border: 1px solid #CC0000; padding: 2px 3px; font-style: normal; font-size: 90%}\n.mjx-annotation-xml {line-height: normal}\n.mjx-menclose > svg {fill: none; stroke: currentColor; overflow: visible}\n.mjx-mtr {display: table-row}\n.mjx-mlabeledtr {display: table-row}\n.mjx-mtd {display: table-cell; text-align: center}\n.mjx-label {display: table-row}\n.mjx-box {display: inline-block}\n.mjx-block {display: block}\n.mjx-span {display: inline}\n.mjx-char {display: block; white-space: pre}\n.mjx-itable {display: inline-table; width: auto}\n.mjx-row {display: table-row}\n.mjx-cell {display: table-cell}\n.mjx-table {display: table; width: 100%}\n.mjx-line {display: block; height: 0}\n.mjx-strut {width: 0; padding-top: 1em}\n.mjx-vsize {width: 0}\n.MJXc-space1 {margin-left: .167em}\n.MJXc-space2 {margin-left: .222em}\n.MJXc-space3 {margin-left: .278em}\n.mjx-test.mjx-test-display {display: table!important}\n.mjx-test.mjx-test-inline {display: inline!important; margin-right: -1px}\n.mjx-test.mjx-test-default {display: block!important; clear: both}\n.mjx-ex-box {display: inline-block!important; position: absolute; overflow: hidden; min-height: 0; max-height: none; padding: 0; border: 0; margin: 0; width: 1px; height: 60ex}\n.mjx-test-inline .mjx-left-box {display: inline-block; width: 0; float: left}\n.mjx-test-inline .mjx-right-box {display: inline-block; width: 0; float: right}\n.mjx-test-display .mjx-right-box {display: table-cell!important; width: 10000em!important; min-width: 0; max-width: none; padding: 0; border: 0; margin: 0}\n.MJXc-TeX-unknown-R {font-family: monospace; font-style: normal; font-weight: normal}\n.MJXc-TeX-unknown-I {font-family: monospace; font-style: italic; font-weight: normal}\n.MJXc-TeX-unknown-B {font-family: monospace; font-style: normal; font-weight: bold}\n.MJXc-TeX-unknown-BI {font-family: monospace; font-style: italic; font-weight: bold}\n.MJXc-TeX-ams-R {font-family: MJXc-TeX-ams-R,MJXc-TeX-ams-Rw}\n.MJXc-TeX-cal-B {font-family: MJXc-TeX-cal-B,MJXc-TeX-cal-Bx,MJXc-TeX-cal-Bw}\n.MJXc-TeX-frak-R {font-family: MJXc-TeX-frak-R,MJXc-TeX-frak-Rw}\n.MJXc-TeX-frak-B {font-family: MJXc-TeX-frak-B,MJXc-TeX-frak-Bx,MJXc-TeX-frak-Bw}\n.MJXc-TeX-math-BI {font-family: MJXc-TeX-math-BI,MJXc-TeX-math-BIx,MJXc-TeX-math-BIw}\n.MJXc-TeX-sans-R {font-family: MJXc-TeX-sans-R,MJXc-TeX-sans-Rw}\n.MJXc-TeX-sans-B {font-family: MJXc-TeX-sans-B,MJXc-TeX-sans-Bx,MJXc-TeX-sans-Bw}\n.MJXc-TeX-sans-I {font-family: MJXc-TeX-sans-I,MJXc-TeX-sans-Ix,MJXc-TeX-sans-Iw}\n.MJXc-TeX-script-R {font-family: MJXc-TeX-script-R,MJXc-TeX-script-Rw}\n.MJXc-TeX-type-R {font-family: MJXc-TeX-type-R,MJXc-TeX-type-Rw}\n.MJXc-TeX-cal-R {font-family: MJXc-TeX-cal-R,MJXc-TeX-cal-Rw}\n.MJXc-TeX-main-B {font-family: MJXc-TeX-main-B,MJXc-TeX-main-Bx,MJXc-TeX-main-Bw}\n.MJXc-TeX-main-I {font-family: MJXc-TeX-main-I,MJXc-TeX-main-Ix,MJXc-TeX-main-Iw}\n.MJXc-TeX-main-R {font-family: MJXc-TeX-main-R,MJXc-TeX-main-Rw}\n.MJXc-TeX-math-I {font-family: MJXc-TeX-math-I,MJXc-TeX-math-Ix,MJXc-TeX-math-Iw}\n.MJXc-TeX-size1-R {font-family: MJXc-TeX-size1-R,MJXc-TeX-size1-Rw}\n.MJXc-TeX-size2-R {font-family: MJXc-TeX-size2-R,MJXc-TeX-size2-Rw}\n.MJXc-TeX-size3-R {font-family: MJXc-TeX-size3-R,MJXc-TeX-size3-Rw}\n.MJXc-TeX-size4-R {font-family: MJXc-TeX-size4-R,MJXc-TeX-size4-Rw}\n.MJXc-TeX-vec-R {font-family: MJXc-TeX-vec-R,MJXc-TeX-vec-Rw}\n.MJXc-TeX-vec-B {font-family: MJXc-TeX-vec-B,MJXc-TeX-vec-Bx,MJXc-TeX-vec-Bw}\n@font-face {font-family: MJXc-TeX-ams-R; src: local('MathJax_AMS'), local('MathJax_AMS-Regular')}\n@font-face {font-family: MJXc-TeX-ams-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_AMS-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_AMS-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_AMS-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-B; src: local('MathJax_Caligraphic Bold'), local('MathJax_Caligraphic-Bold')}\n@font-face {font-family: MJXc-TeX-cal-Bx; src: local('MathJax_Caligraphic'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-cal-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-R; src: local('MathJax_Fraktur'), local('MathJax_Fraktur-Regular')}\n@font-face {font-family: MJXc-TeX-frak-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-B; src: local('MathJax_Fraktur Bold'), local('MathJax_Fraktur-Bold')}\n@font-face {font-family: MJXc-TeX-frak-Bx; src: local('MathJax_Fraktur'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-frak-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-BI; src: local('MathJax_Math BoldItalic'), local('MathJax_Math-BoldItalic')}\n@font-face {font-family: MJXc-TeX-math-BIx; src: local('MathJax_Math'); font-weight: bold; font-style: italic}\n@font-face {font-family: MJXc-TeX-math-BIw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-BoldItalic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-BoldItalic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-BoldItalic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-R; src: local('MathJax_SansSerif'), local('MathJax_SansSerif-Regular')}\n@font-face {font-family: MJXc-TeX-sans-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-B; src: local('MathJax_SansSerif Bold'), local('MathJax_SansSerif-Bold')}\n@font-face {font-family: MJXc-TeX-sans-Bx; src: local('MathJax_SansSerif'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-sans-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-I; src: local('MathJax_SansSerif Italic'), local('MathJax_SansSerif-Italic')}\n@font-face {font-family: MJXc-TeX-sans-Ix; src: local('MathJax_SansSerif'); font-style: italic}\n@font-face {font-family: MJXc-TeX-sans-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-script-R; src: local('MathJax_Script'), local('MathJax_Script-Regular')}\n@font-face {font-family: MJXc-TeX-script-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Script-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Script-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Script-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-type-R; src: local('MathJax_Typewriter'), local('MathJax_Typewriter-Regular')}\n@font-face {font-family: MJXc-TeX-type-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Typewriter-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Typewriter-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Typewriter-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-R; src: local('MathJax_Caligraphic'), local('MathJax_Caligraphic-Regular')}\n@font-face {font-family: MJXc-TeX-cal-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-B; src: local('MathJax_Main Bold'), local('MathJax_Main-Bold')}\n@font-face {font-family: MJXc-TeX-main-Bx; src: local('MathJax_Main'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-main-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-I; src: local('MathJax_Main Italic'), local('MathJax_Main-Italic')}\n@font-face {font-family: MJXc-TeX-main-Ix; src: local('MathJax_Main'); font-style: italic}\n@font-face {font-family: MJXc-TeX-main-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-R; src: local('MathJax_Main'), local('MathJax_Main-Regular')}\n@font-face {font-family: MJXc-TeX-main-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-I; src: local('MathJax_Math Italic'), local('MathJax_Math-Italic')}\n@font-face {font-family: MJXc-TeX-math-Ix; src: local('MathJax_Math'); font-style: italic}\n@font-face {font-family: MJXc-TeX-math-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size1-R; src: local('MathJax_Size1'), local('MathJax_Size1-Regular')}\n@font-face {font-family: MJXc-TeX-size1-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size1-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size1-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size1-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size2-R; src: local('MathJax_Size2'), local('MathJax_Size2-Regular')}\n@font-face {font-family: MJXc-TeX-size2-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size2-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size2-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size2-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size3-R; src: local('MathJax_Size3'), local('MathJax_Size3-Regular')}\n@font-face {font-family: MJXc-TeX-size3-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size3-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size3-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size3-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size4-R; src: local('MathJax_Size4'), local('MathJax_Size4-Regular')}\n@font-face {font-family: MJXc-TeX-size4-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size4-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size4-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size4-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-R; src: local('MathJax_Vector'), local('MathJax_Vector-Regular')}\n@font-face {font-family: MJXc-TeX-vec-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-B; src: local('MathJax_Vector Bold'), local('MathJax_Vector-Bold')}\n@font-face {font-family: MJXc-TeX-vec-Bx; src: local('MathJax_Vector'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-vec-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Bold.otf') format('opentype')}\n</style></span></span></span>counterproductive for the goal of fighting racism to stake your case on scientific claims that could turn out to be false.</p></blockquote><p>There is so much evidence at this point against race realism/ HBD. There is no possibility of it \"could be false\" without evoking some grand conspiracy. Can we never call it pseudoscience? My goal is to fight for scientific truth, not some anti-racist agenda. Check out Ben Jacob's great resources.</p>", "parentCommentId": "6AuhYXEbq2gSB6D2G", "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "7nifKkrxMQDoAPPxW", "postedAt": "2023-01-14T07:52:44.674Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>Belief that black people are stupider than white people, for example, is <i>not incompatible</i> with sending aid to Africa.&nbsp;</p></blockquote><p>&nbsp;</p><p>EDIT: Did you mean to write \"not compatible\"? I didn't notice this until after I typed my reply. &nbsp;I thought you were claiming that sending aid to Africa was incompatible. &nbsp;If you could clarify, I'll add my wall of text back.</p>", "parentCommentId": "ArZpzNmLL2ZoL6bcQ", "user": null}, {"_id": "ZtjiSNnnbfvaENStL", "postedAt": "2023-01-14T08:11:23.295Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Hello, I did mean to type \"not incompatible\"- I think we are largely in agreement.</p>\n", "parentCommentId": "7nifKkrxMQDoAPPxW", "user": {"username": "britomart"}}, {"_id": "y2eRkzFyq5eFxqagr", "postedAt": "2023-01-14T08:27:35.695Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I don’t think one of the claims, that “Twin studies are flawed in methodology. Twins, even identical twins, simply do not have exactly the same DNA”, is true. As I see, it is not supported by the link and the study.</p>\n<p>The difference of 5.2 out of 6 billion letters that identical twins have on average is not something that makes their DNA distinct enough to make the correlations between being identical tweens or not and having something in common more often to be automatically invalid.</p>\n<p>One of the people involved in the study is cited: “Such genomic differences between identical twins are still very rare. I doubt these differences will have appreciable contribution to phenotypic [or observable] differences in twin studies.”</p>\n<p>Twin studies being something we should be able to rely on seems like a part of the current scientific view, and some EA decisions might take such studies into consideration.</p>\n<p>I think it’s important not to compromise our intellectual integrity even when we debunk foundations for awful and obviously wrong beliefs that are responsible for so much unfairness and suffering that exist in our world and for so many deaths.</p>\n<p>I think if the community uses words that are persuasive but don’t contain actually good evidence, then even if we’re arguing for the truth that’s important and impactful to spread, in the long-term, this might lead to people putting less trust in any of our words arguing for the truth and more people believing something harmful and untrue. And on the internet, there are a lot of words containing bad arguments for the truth because it’s easy for people to be in the mode of finding persuasive arguments, which don’t necessarily have to be actually good evidence.</p>\n<p>I think it’s really important for the EA community to be epistemically honest and talk about the actual reasons we have for believing something, instead of trying to find the most persuasive list of reasons for believing in what we believe in and just copying it without verifying that all the reasons are good and should update people in the claimed direction.</p>\n", "parentCommentId": "TRHHWxfmXcFXseLdA", "user": {"username": "Samin"}}, {"_id": "QXhdDiBnfJBbcrWui", "postedAt": "2023-01-14T08:41:43.182Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I just say that if you read the references I cited in the linked post you see they contradict that conclusion.</p>\n", "parentCommentId": "YN85c93DD3EiNLFfo", "user": {"username": "Maximilian Schlederer"}}, {"_id": "qs5XANPCnTkogroij", "postedAt": "2023-01-14T09:00:05.102Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>These are two separate links for two separate claims. 'Twin studies are flawed in methodology.' and 'Twins, even identical twins, simply do not have exactly the same DNA.', both of which are true. The confidence in the proposed HBD conclusions is simply not warranted by the evidence.</p><p><a href=\"https://www.sciencedirect.com/science/article/abs/pii/B978012397946900004X?via%3Dihub\">Many twin studies have the assumption that they share 100% of their DNA (which is false) </a>and<a href=\"https://www.sciencedirect.com/science/article/abs/pii/B978012397946900004X?via%3Dihub\"> </a><a href=\"https://link.springer.com/article/10.1023/A:1012896802713\">that they share the exact same environment (which is also false)</a>. <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/1745-9125.12036\">This leads to underestimating environmental factors</a> &nbsp;and <a href=\"https://www.jstor.org/stable/2826060\">underestimating non-genetic biological factors</a>.<br>Furthermore, <a href=\"https://scholar.harvard.edu/files/morris-singer/files/2008.pdf\">separated twin pairs, identical or fraternal, are generally separated by adoption. This makes them unrepresentative of twins as a whole</a> and <a href=\"https://psycnet.apa.org/record/2014-00006-005\">there can be some issues of undetected behaviors in the case of behaviors that many people keep secret presently or in their earlier lives.</a></p>", "parentCommentId": "y2eRkzFyq5eFxqagr", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "WRFiuwffaFQoknhHS", "postedAt": "2023-01-14T09:46:37.113Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>And why do you presume your sources are better.</p>\n<p>Your source is a fringe twitter account, followed by alt-right accounts, cherry picking bits and pieces from journals. It doesn't even properly link to the primary sources so I can't even examine the the weakness/ context.</p>\n<p>Worry more about my Jacobs's sources contradicting your sources.</p>\n", "parentCommentId": "QXhdDiBnfJBbcrWui", "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "xPWnKE98s2GeSA9rm", "postedAt": "2023-01-14T10:11:13.513Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Oops! Sorry, I only discovered the second link; but before writing my comment, I looked up the first myself.</p>\n<p>I’m not a biologist and will probably defer to any biologist entering this thread and commenting on the twin studies.</p>\n<p>Twins (mostly, as the linked study shows) do not have exactly the same DNA. But it doesn’t seem to be relevant. The relevant assumption is that there’s almost no difference between the DNAs of “identical” twins and a large difference between the DNAs of non-identical reared-together twins, which is true despite a couple of random mutations per 6 billion letters.</p>\n<p>The next two linked articles are paywalled. Is there somewhere to read them?</p>\n<p>The third is a review of a short book, available after a sign-up, and it says that “some studies on twins are good, some bad”, and the author feels, but “doesn’t actually know” that the reviewed one is good. The reviewed book performed a study on twins and noticed there isn’t much of a difference between the correlation of the similarity of many personality traits with whether people are identical twins, and concluded that, since you’d expect to see a difference if the traits have different degree of heritability, many personality traits are results of the environment.</p>\n<p>How is this an evidence that twin studies are flawed and shouldn’t be used? If that’s a correct study, it’s just evidence that personality traits are mostly formed by environment (which is something I already believe and have believed for the most of my life), but, e.g., why would this be relevant for a discussion of whether or not some disease has a genetic component to it, when a twin study shows that there is?</p>\n<p>It’s important to carefully compare the numbers; but obviously there are things that identical twins have in common more often then non-identical twins, because these things are heritable at to larger or lesser degree; like hair color or height.</p>\n<p>Of course, any study makes some underrepresentation of humanity. But if your study is about the degree of heredity of something and not about twins, why would this matter? If there’s a difference between adopted identical and non-identical twins that’s better explained by genetics (e.g., non-identical twins would have a different height more often), why does it matter how well they represent twins in general? Unless you’re studying how likely people are to be adopted, I don’t understand the claim.</p>\n<p>The last link is paywalled, but again, why would this affect the difference between identical twins and non-identical twins? Until a year ago, I kept secret that I’m bi and would’ve kept it secret from scientists;  but I don’t think this kind of thing affects conclusions you’d make if identical twins answered identically to some question more often than non-identical twins (e.g., imagine a society where people with green eyes are persecuted and a lot of them use contact lenses. Some would still say the truth, in confidence, to scientists; and the number of identical twins telling the same answer would be greater than the amount of non-identical twins telling the same answer, and the scientists will correctly infer this to be evidence for the heritability of eye color, even though a lot of twins would lie about their eye color).</p>\n<p>So while it’s possible to just compare full DNAs and account for lots of different factors (all sorts of various environmental conditions that might be different between the subjects of the study) to find out whether DNA correlates with eye color, it’s much easier to do a twin study, and a strong correlation there will be a strong evidence</p>\n", "parentCommentId": "qs5XANPCnTkogroij", "user": {"username": "Samin"}}, {"_id": "F24ueBhj3nhBwiTxC", "postedAt": "2023-01-14T10:19:54.637Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>So I get this mail is bad PR, but people seem to object to it beyond that and it isn't clear to me why. If it is because he claims that Blacks have a lower average IQ than mankind in general I think that would be a terrible reason as I am not aware of a single intelligence researcher who would dispute this. Or is it because he uses the word [edited: see moderators comment]?</p><p>I checked what strong forum norms Bostroms mail would have violated.</p><p>\"Unnecessary rudeness or offensiveness\"</p><p>This would make sense to me, although I will point out that his point back then was precisely that his offensiveness is not <i>unnecessary</i>.</p><p>\"Hate speech or content that promotes hate based on identity.\"</p><p>I don't think he did this:</p><p>\"They would think that I were a \"racist\": that I _disliked_ black people and thought that it is fair if blacks are treated badly. <strong>I don't.</strong>\"</p><p>&nbsp;</p><p>&nbsp;</p><h2>&nbsp;</h2>", "parentCommentId": null, "user": {"username": "Aithir"}}, {"_id": "ejC2ccYcDFWiZxmfM", "postedAt": "2023-01-14T10:28:49.261Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>Oops! Sorry, I only discovered the second link</p></blockquote><p>It's fine.<br>Studies don't just use identical twins but twins in general. You are equating my two claims and attacking claims that I haven't even made, I never talked about \"whether or not some disease has a genetic component to it, when a twin study shows that there is?\". I made a claim that twins, even identical twins, don't share exactly the same DNA and provided a link to an article that gave more information, and I made a second claim that twin studies were flawed and provided that claim with a link to an article with more information about that. All this stuff about that it can't help us find diseases or that twin studies \"shouldn’t be used\" are claims I never made.</p><p>EDIT:&nbsp;</p><blockquote><p>I’m not a biologist and will probably defer to any biologist entering this thread</p></blockquote><p>For the record my study has some biostatistics, but it isn't my strongest field and I'm mostly &nbsp;leaning on stuff my professors have explained:</p><figure class=\"image image_resized\" style=\"width:26.22%\"><img src=\"https://res.cloudinary.com/cea/image/upload/v1673693619/mirroredImages/ejC2ccYcDFWiZxmfM/dyhddsih5uecsuzortrv.jpg\" alt=\"My textbook so you know I'm not just making stuff up\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1673693620/mirroredImages/ejC2ccYcDFWiZxmfM/qvgkvoc5mwcq0eiyfxu6.jpg 410w, https://res.cloudinary.com/cea/image/upload/v1673693619/mirroredImages/ejC2ccYcDFWiZxmfM/ugcw28rmfc6267bpk7l6.jpg 820w, https://res.cloudinary.com/cea/image/upload/v1673693618/mirroredImages/ejC2ccYcDFWiZxmfM/fjgnf1jovwegiycdtkct.jpg 1230w, https://res.cloudinary.com/cea/image/upload/v1673693619/mirroredImages/ejC2ccYcDFWiZxmfM/zt5pg9motjucojpjantn.jpg 1640w, https://res.cloudinary.com/cea/image/upload/v1673693621/mirroredImages/ejC2ccYcDFWiZxmfM/etbjgskyi7r7xflytgdc.jpg 2050w, https://res.cloudinary.com/cea/image/upload/v1673693621/mirroredImages/ejC2ccYcDFWiZxmfM/rhatfcnjheic9xb5k5yy.jpg 2460w, https://res.cloudinary.com/cea/image/upload/v1673693622/mirroredImages/ejC2ccYcDFWiZxmfM/cny9rgmsrbpjtpkz5aep.jpg 2870w, https://res.cloudinary.com/cea/image/upload/v1673693620/mirroredImages/ejC2ccYcDFWiZxmfM/dfujpqluc02nimfngiwz.jpg 3280w, https://res.cloudinary.com/cea/image/upload/v1673693620/mirroredImages/ejC2ccYcDFWiZxmfM/qwsbtfhrjfhr0xqjm6wi.jpg 3690w, https://res.cloudinary.com/cea/image/upload/v1673693619/mirroredImages/ejC2ccYcDFWiZxmfM/vxisgcttzsdjjvyqpjd4.jpg 4032w\"></figure><p>&nbsp;I will also probably defer to a biologist/biostatistician.</p>", "parentCommentId": "xPWnKE98s2GeSA9rm", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "QDySwDoE93GjezKuK", "postedAt": "2023-01-14T10:36:46.868Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p><a href=\"https://extropians.weidai.com/extropians.96/0484.html\">As far as I can tell this is his \"apology\" from back then.</a></p>", "parentCommentId": "ysNN6buQhEzazrTfS", "user": {"username": "Aithir"}}, {"_id": "zbjzWQEKHBWg4mjJo", "postedAt": "2023-01-14T13:15:23.605Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>That's a cool point by Klein.</p><blockquote><p>There is so much evidence at this point against race realism/ HBD. There is no possibility of it \"could be false\" without evoking some grand conspiracy. Can we never call it pseudoscience?</p></blockquote><p>If the consensus is strong enough then yes, we should call it pseudoscience.&nbsp;</p><p>I read the Wikipedia article you linked on the topic and my feeling was that there's some remaining disagreement in many places, but overall it does read as though the science supports environmental factors much more than genetic ones. I'm not 100% on how much I should trust it given political pressure and some yellow flags in the article like their uncritical mention of the Southern Poverty Law Center, which have behaved awfully and at times tried to cancel people like Sam Harris or Maajid Nawaz, who are \"clearly good people\" in my book. (And they still have Charles Murray on their list of extremists, putting him in the same category as neo-nazis, which is awful and immoral.)<br><br>I already looked at the resources by Bob Jacobs and thought some of them seemed a bit condescending in the sense that I'd expect people who feel confident enough to downvote or upvote claims on this topic would already be familiar with them. (E.g., some of the points he makes would also speak against studying whether mammals are smarter than fish given that fish have more genetic diversity than all mammals together and are a bit of an \"unnaturally drawn group in biology\".) That said, it's good to highlight the point about African diversity and, e.g., &nbsp;Nigerians having higher education scores in some areas than Europeans (and high conscientiousness – whether it's cultural or genetic).</p><p>Other points seem overstated to me (e.g., criticism of validity of IQ). I think the Wikipedia article you linked to is a better source to convince people that genetic influences may not play much of &nbsp;role.</p><p>On the topic of the discussion as a whole, the current situation is clearly very unfortunate. It seems like there are many people who only get interested in the topic because they have the impression there's censorship and they're against such censorship. If we slightly relaxed on what inferences are defensible to draw draw from the science, then most people would lose interest, which would lower social polarization? Maybe the best message to promote is something like \"<i>If</i> there are genetic influences, they're likely no larger than environmental ones, and there may not be, and overall the question doesn't seem to have any moral or political/practical relevance.\"</p>", "parentCommentId": "iYKMcgZu6wAL7oEFQ", "user": {"username": "Lukas_Gloor"}}, {"_id": "RbKXqtzW4C9zraogj", "postedAt": "2023-01-14T14:32:11.808Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>He links to a large number of research articles. It could be cherry picking, but the same thing could be said e.g. about linking to Vox articles, a source which is known to have a strong leftist bias.</p>\n", "parentCommentId": "WRFiuwffaFQoknhHS", "user": {"username": "Maximilian Schlederer"}}, {"_id": "icFaBtCRzRAEn3kkZ", "postedAt": "2023-01-14T14:58:45.081Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Just fyi, there is an extremely strong taboo (esp. in the US) against saying “the n-word” and most people are not sympathetic to use-mention distinction arguments in this particular case, even if they would be in theory. I strongly suspect this is why your comment was downvoted.</p>\n", "parentCommentId": "F24ueBhj3nhBwiTxC", "user": {"username": "RAB"}}, {"_id": "mPzqc3o2Rj9bDYy4W", "postedAt": "2023-01-14T17:06:12.090Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Ah okay, sorry, I thought you meant the opposite. &nbsp;Thank you!</p>", "parentCommentId": "ZtjiSNnnbfvaENStL", "user": null}, {"_id": "gsiKozGdfxDHLnDxw", "postedAt": "2023-01-14T17:24:39.611Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>As a different perspective to your list, I'd like to reference <a href=\"https://twitter.com/PaoloShirasi/status/1549416261075062785\">this</a> thread of 25 threads, which provides extensive research in the opposite direction. Like you, I do not claim that this is all correct (I'm not an expert on this topic), but the evidence is certainly much less clear-cut than one might think from just reading the pieces you provided.</p>\n", "parentCommentId": "TRHHWxfmXcFXseLdA", "user": {"username": "Maximilian Schlederer"}}, {"_id": "yMahuRT9bXfjFF8yp", "postedAt": "2023-01-14T19:07:36.249Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I really don't like this post.</p>\n<p>Factually, I think it removes critical context and is sorely lacking in nuance.</p>\n<p>Crucial context that was missing:</p>\n<ul>\n<li>It was sent 25+ years ago when Bostrom was a student</li>\n<li>It was sent as part of a conversation about offensive communication styles</li>\n<li>Bostrom apologised for it at the time within 24 hours</li>\n<li>Bostrom apologised again for the email now</li>\n</ul>\n<p>Beyond the lack of nuance, this feels like it's optimised for PR management and not honest communication or representation of your fully considered beliefs. I find that disappointing. I greatly preferred <a href=\"https://forum.effectivealtruism.org/posts/8zLwD862MRGZTzs8k/a-personal-response-to-nick-bostrom-s-apology-for-an-old\">Habiba's statement on this issue</a> despite it largely expressing similar sentiments because it did feel like honest communication/representation of her beliefs (I've strongly downvoted this post and strongly upvoted that one, despite largely disagreeing with the sentiment expressed).</p>\n<p>And I don't really like the obsession with PR management in the community. I think it's bad for epistemic integrity, and it's bad for expected impact of the effective altruism community on a brighter world.</p>\n<p>&nbsp;<br>\nEmotionally, this made me feel disappointed and a bit bitter.</p>\n", "parentCommentId": null, "user": {"username": "Dragon God"}}, {"_id": "CGX7Gdb47QGTJoTSs", "postedAt": "2023-01-14T20:35:32.164Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Given my priors and respect for my leisure time I'm not going to read those giant threads. I won't downvote you since I haven't actually read it, but let me ask you a related question:</p><p>Do you think that out of the billions of possible correlations in the social sciences, the best use of our finite time on earth is to study this one?<br>The incredibly flawed measure of 'low iq' is correlated with the arbitrary socially-contingent western category of 'black people' (almost certainly because of environmental factors). But there are millions of things correlated with the western category of 'black people' and there are millions of things correlated with 'iq'.<br>Furthermore, there are so &nbsp;many more variables to study that are less flawed and less arbitrary, why should we focus on the one correlation out of billions that racist people –who want to make the world worse for out fellow human beings– want to us to talk about?</p>", "parentCommentId": "gsiKozGdfxDHLnDxw", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "2CQteZ9dCo2bvWwjS", "postedAt": "2023-01-14T21:19:42.445Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote>\n<p>Given my priors and respect for my leisure time I'm not going to read those giant threads. I won't downvote you since I haven't actually read it, but let me ask you a related question:</p>\n</blockquote>\n<blockquote>\n<p>Do you think that out of the billions of possible correlations in the social sciences, the best use of our finite time on earth is to study this one?\nThe incredibly flawed measure of 'low iq' is correlated with the arbitrary socially-contingent western category of 'black people' (almost certainly because of environmental factors). But there are millions of things correlated with the western category of 'black people' and there are millions of things correlated with 'iq'.\nAlso, there are so  many more variables to study that are less flawed and less arbitrary, why should we focus on the one correlation out of billions that racist people (who want to make the world worse for out fellow human beings) want to us to talk about?</p>\n</blockquote>\n<p>IMO, I agree with the idea that EA shouldn't invest anything in studying this, though I took a different path.</p>\n<ol>\n<li>\n<p>I think IQ differences are real and they matter.</p>\n</li>\n<li>\n<p>However, I think the conclusion that HBD and far-righters/neo-nazis wants us to reach is pretty incorrect, given massive issues with both evidence bases and motivated reasoning/privileging the hypothesis.</p>\n</li>\n</ol>\n", "parentCommentId": "CGX7Gdb47QGTJoTSs", "user": {"username": "Sharmake"}}, {"_id": "DBEDYhJZ3JzjeKhfr", "postedAt": "2023-01-14T21:44:07.628Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I think the natural move is to create a chapter within CEA that actively supports Black people. Honestly, i have been to EA conferences, and I can tell there is still work to be done on the diversity part, also including woman representation. Overall I love CEA and want to see how to be more diverse. One place to start might be supporting emerging markets like Africa, not only through donations but programs. For example 80, 000 hours is tailored for someone in the Global North, we need to rethink how does 80K look if we want to end unemployments rates in Southern Africa.&nbsp;</p>", "parentCommentId": null, "user": {"username": "monadica"}}, {"_id": "sPfumxKFLAKMdMZfu", "postedAt": "2023-01-14T22:03:10.099Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I agree with basically everything you say here, but I also think it's a bit unfair to point this out in the context of Kaspar Brandner sharing a lot of links after you did the same thing <i>first</i> (sharing a lot of links).&nbsp;:)<br><br>In any case, I think<br><br>not discussing the issue &gt;&gt; discussing the issue &gt;&gt; discussing the issue with flawed claims.&nbsp;</p><p>(And I think we're all in trouble as a society because, unfortunately, people disagree about what the flawed claims are and we get sucked into the discussion kind of against our will because flawed claims can feel triggering.)&nbsp;</p>", "parentCommentId": "CGX7Gdb47QGTJoTSs", "user": {"username": "Lukas_Gloor"}}, {"_id": "f7rAySYwZHdjyXviC", "postedAt": "2023-01-14T22:09:39.421Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I don't fault you for not reading it all, but it is a good resource for looking up specific topics. (I have summarized a few of the points <a href=\"https://forum.effectivealtruism.org/posts/dPmdkjaNGFQHfWhxQ/linkpost-nick-bostrom-s-apology-for-an-old-email?commentId=xEyfspivkCwLFNRJh\">here</a>.) And I don't think IQ is a flawed measure, since it is an <a href=\"https://twitter.com/PaoloShirasi/status/1559191714648264706\">important predictor for many measures of life success</a>. Average national IQ is also fairly strongly correlated with <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2862754\">measures of national welfare such as per Capita GDP</a>.</p>\n<p>To be clear, I'm not saying studying this question is more important than anything else, just that research on it should not be suppressed, whatever the truth may be. This point was perhaps best put in the conclusion of <a href=\"https://www.tandfonline.com/doi/full/10.1080/09515089.2019.1697803\">this great paper</a> on the topic:</p>\n<blockquote>\n<p>The strategy – advocated by some influential scholars – of stigmatizing, suppressing, or downplaying evidence in favor of hereditarianism about group differences has been tried and has not worked. Research on this topic has been done and the results are widely available. Major psychology journals continue to publish work that deals openly with group differences (though researchers still debate about the relative contribution of genes and environment, and the question has not been settled definitively). Any measures that would be effective in preventing further work, such as those advocated by Kourany (2016), would have to be so severe that they would only attract even more attention to the findings they aimed to suppress. Science will carry on, and these questions will be answered. We should prepare in advance for the possibility that the genes underlying intelligence differences will not be distributed identically among ethnic groups. Failure to do this will only create a vacuum for “cranks rather than scientists” to opine on the nature and consequences of group differences (Anomaly, 2017, p. 293). Reich (2018) warns that if scientists “willfully abstain from laying out a rational framework for discussing human differences, [they] will leave a vacuum that will be filled by pseudoscience” (p. 258).</p>\n</blockquote>\n<blockquote>\n<p>This paper has argued that the usual utilitarian reasons given for restricting intelligence research are not convincing and, in fact, there are strong reasons, both utilitarian and non-utilitarian, to favor free inquiry. For philosophers specifically, there is an additional consideration. For decades, the contribution of philosophers to this debate has consisted mostly in providing alternative explanations for evidence seeming to support hereditarianism about race differences (see Sesardic, 2000, 2005), and advocating various kinds of restriction and censorship (see Cofnas, 2016). This may be because hereditarianism is controversial, and philosophers are strongly disincentivized from pursuing lines of argument that lead to truly controversial conclusions. Testifying to how serious this problem is, Jeff McMahan, Francesca Minerva, and Peter Singer recently founded the Journal of Controversial Ideas, which will allow scholars to publish pseudonymously. Singer (2017) commented that “it’s unfortunate that such a journal should ever be considered necessary to enable controversial ideas to be published, but perhaps we have got to the point where it is.” It is not clear what kind of controversial ideas Singer had in mind, and the journal has not yet released its first issue, but it is hard to find a more controversial idea than hereditarianism about race differences in intelligence.</p>\n</blockquote>\n<blockquote>\n<p>There is a danger for the philosophical community in putting our credibility on the line over the claim that race differences are entirely environmental. If work on genetics and neuroscience within the next decade produces convincing evidence that differences in measured intelligence among groups have a significant genetic component, there will be no way to conceal this information. The hereditarian explanation will have to be accepted, and people will know that philosophers were on the wrong side of the issue both scientifically and morally: scientifically, because we are supposed to be careful, disinterested commentators on scientific controversies, not activists supporting only the politically popular side; morally, because we did not help lay the groundwork for responding in a moral way to these facts that we should have known might be coming.</p>\n</blockquote>\n", "parentCommentId": "CGX7Gdb47QGTJoTSs", "user": {"username": "Maximilian Schlederer"}}, {"_id": "R8rv52N8dp9YBCeXx", "postedAt": "2023-01-14T23:05:00.240Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>but I also think it's a bit unfair to point this out in the context of Kaspar Brandner sharing a lot of links after you did the same thing <i>first</i></p></blockquote><p>Yeah that's fair. I mean I did give summaries, but it's still fair. If I could go back in time I would've posted that comment first and I would've tried to explain my emotions/reasoning process to the HBDers on this forum more.</p><p>I would have said: I get the allure of taboo studies. I want to be a moral philosopher, but moral philosophers are very smart and they don't get a lot of funding. So even if I work very <i>very</i> hard, I probably won't get to be one. I need a way to stand out, to make people notice I would be a good researcher... oh what's this? Everyone is avoiding these taboo studies. So researching them makes me both stand out and makes me a comparatively high quality researcher since almost no one is competing with me.</p><p>It's competition/capitalism/<a href=\"https://slatestarcodex.com/2014/07/30/meditations-on-moloch/\">moloch</a> that is driving me towards these subjects and even knowing this doesn't make the allure go away. But ultimately I care about people more, and there are often good reasons these taboo's were put in place.<br>Perhaps the readers of this comment feel the same way. I empathize. The smart thing to have done was unpack these mental prioritizations immediately instead of grabbing my research. But I didn't think of it, probably because I wanted to show that I could be a good researcher. Moloch got me. Please don't spend your limited time on this subject, please don't let moloch get you too.</p>", "parentCommentId": "sPfumxKFLAKMdMZfu", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "nP9QwDe6ub2Gv5cPg", "postedAt": "2023-01-15T02:10:44.613Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Agree. At a meta-level, I was disappointed by the  seemingly panicked and reactive nature of the statement. The statement is bad, and so, it seems, is the process that produced it.</p>\n", "parentCommentId": "aGQfKPYS2HzF5v2KH", "user": {"username": "Peter_Hartree"}}, {"_id": "uGaPpZyQWox6TM3dK", "postedAt": "2023-01-15T03:33:32.816Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Comment erased due to formatting error; apologies. The correct version is <a href=\"https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email?commentId=wWrHYGnibCXA4xnah\">here</a>.</p>", "parentCommentId": "TRHHWxfmXcFXseLdA", "user": {"username": "MissionCriticalBit"}}, {"_id": "KBmfzF3sLHhbFDBaJ", "postedAt": "2023-01-15T04:18:56.254Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>There is no such consensus, though. Your links do not support your very strong claim.&nbsp;</p><p>E.g. &nbsp;Vox:&nbsp;</p><blockquote><p><strong>Do most experts think genes make a substantial contribution to the black-white difference in intelligence?</strong> There have been several surveys of expert opinion over the years. Perhaps the first was described in a 1988 book by <a href=\"https://goo.gl/4dsNtA\"><strong>Snyderman and Rothman</strong></a>. The most recent was described in a <a href=\"http://www.unz.com/jthompson/genetics-genetic-groups-intelligence/\"><strong>2013 blog post</strong></a> about a conference presentation. The survey described in that post has resulted in two <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4804158/\"><strong>published</strong></a> <a href=\"https://www.researchgate.net/publication/310315555_Survey_of_expert_opinion_on_intelligence_The_FLynn_effect_and_the_future_of_intelligence\"><strong>articles</strong></a>, neither of which presents data on opinions regarding the black-white difference. The studies do, however, report that only about 5 percent of people who were invited to participate responded to any one set of items. Given this very low response rate, along with the potential for bias in which scientists were invited in the first place, we doubt that these results are an accurate representation of the field.</p><p><br>Still, in both the Snyderman and Rothman book and in the more recent survey, more than half of respondents selected one of two response categories that included zero (one option was “0 percent of [black-white] differences due to genes” and the other was “0-40 percent of differences due to genes”). Much more important, however, is that respondents were not allowed to endorse what in my view is the only reasonable response: It is not possible to give a meaningful estimate of the percentage.</p></blockquote><p>This does not allow to claim consensus, and the way it's worded is obviously motivated by the desire to downplay the belief of experts in causal role of genetics. We have a newer survey they do not mention, too, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4804158/\">Survey of Expert Opinion on Intelligence: Causes of International Differences in Cognitive Ability Tests</a>, Rindermann, 2016:&nbsp;</p><blockquote><p>Education was rated by <i>N</i> = 71 experts as the most important cause of international ability differences. Genes were rated as the second most relevant factor but also had the highest variability in ratings</p></blockquote><p>If anything, the consensus seems to be that genes play some role here.&nbsp;</p><blockquote><p>To anyone who sincerely wonders if there's anything to the \"race-iq realism\" theory, I ask you to consider this great point point made Ezra Klein to Sam Harris when Harris embraced The Bell Curve: very rarely will you see any serious consideration of the possibility that environmental factors explain &gt;100% of the black-white iq gap. &nbsp;In other words, on a purely genetic basis that black people may be more intelligent than white people is alien to the discourse.</p></blockquote><p>I do not see why this hypothetical is impressive? The best that could be said for it is that it is logically sound and novel. But &nbsp;heritability and norms of reaction impose limits on such explanations. If X percent of a trait's variance can be explained by a factor, then there's only so much you can get by changing the sum of non-X factors. Adult intelligence has roughly 80% heritability (equally within white and black populations; actually this alone invalidates the idea). For 1 d of difference in intelligence to be explained away by the environment, the gap in environmental quality must be 2.24 d. This is implausibly large for intra-national racial differences, contradicted by direct measures of environmental quality and indirect proxies of deprivation (such as stress and self-esteem), made suspect by the fact that there's been a great deal of improvement in race relations and equalization of living standards since the 60s, yet no large narrowing of the IQ gap; and for the case where black people have higher \"genotypic IQ\", environmental deprivation must be even greater than 2.24 d.&nbsp;</p>", "parentCommentId": "YN85c93DD3EiNLFfo", "user": {"username": "MissionCriticalBit"}}, {"_id": "E8z7fnvfXxeLoCwbR", "postedAt": "2023-01-15T11:52:34.080Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>For information, CEA’s OP links to an explanation of impartiality:</p>\n<blockquote>\n<p>Impartial altruism: We believe that all people count equally. Of course it's reasonable to have special concern for one's own family, friends and life. But, when trying to do as much good as possible, we aim to give everyone's interests equal weight, no matter where or when they live. This means focusing on the groups who are most neglected, which usually means focusing on those who don’t have as much power to protect their own interests.</p>\n</blockquote>\n", "parentCommentId": "Q3zuoyoSdgZghDBXF", "user": {"username": "David Mears"}}, {"_id": "shaZ3jXcejLiNK5Lt", "postedAt": "2023-01-15T11:58:35.677Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>It’s embarrassing for Bostrom to claim this as an apology.</p>\n", "parentCommentId": "QDySwDoE93GjezKuK", "user": {"username": "David Mears"}}, {"_id": "AhbACPfLQ92rdseWY", "postedAt": "2023-01-15T12:40:56.917Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>At the risk of running afoul of the moderation guidelines, this comment reads to me as very obtuse. The sort of equality you are responding to is one that I think almost nobody endorses. The natural reading of “equality” in this piece is the one very typical of, even to an extent uniquely radical about, EA. When Bentham says “each to count for one and none for more than one”, or Sidgwick talking about the point of view of the universe, or Singer discusses equal consideration of equal interests. I would read this charitably and chalk it up to an isolated failure to read the statement charitably, but it is incredibly implausible to me that this becoming the top voted comment can be accounted for by mass reading comprehension problems. If this were not a statement critical of an EA darling, but rather a more mundane statement of EA values that said something about how people count equally regardless of where in space and time they are, or sentient beings count equally regardless of their species, I would be extremely surprised to see a comment like this make it to the top of the post. I get that taking this much scandal in a row hurts, but guys, for the love of god just take the L, this behavior is very uncharming.</p>\n", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "Devin Kalish"}}, {"_id": "BixsTmaApcakNLEFN", "postedAt": "2023-01-15T13:57:06.921Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Speaking as a moderator: the Forum currently doesn't have a policy banning any specific words, although we might change that.&nbsp;</p><p>But we do have <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">norms about kindness, avoiding unnecessary offense, and behaving with civility</a>, and many people (reasonably) find use of the n-word extremely hurtful or upsetting, even if it's used as an example or in a quote.&nbsp;</p><p>Overall, I think the word's use here is not helpful and violates those norms, so<strong> I ask you to remove it</strong>.&nbsp;</p><p>I'll continue discussing with the moderation team, both to develop an overall policy and to see if they disagree with my decision here.&nbsp;</p>", "parentCommentId": "F24ueBhj3nhBwiTxC", "user": {"username": "Lizka"}}, {"_id": "DeMpYcJJuqbdZ4ucX", "postedAt": "2023-01-15T14:31:10.935Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>While I disagree with a big chunk of the comment you're responding to (and don't really want to engage with the claims stated there), I think your comment misinterprets the parent comment in a way that is uncharitable (e.g. \"'feminised' (I assume this means it has started doing more of the housework)\" — this is not what the parent comment is talking about).&nbsp;</p><p>Please don't do that, folks.&nbsp;</p>", "parentCommentId": "oGnJsujBeecK5nDgM", "user": {"username": "Lizka"}}, {"_id": "HwgiocYgoE2JF8NLY", "postedAt": "2023-01-15T14:35:22.248Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I think what Habryka is saying is that while EA does have some notion of equality, the reason it sticks so close to mainstream egalitarianism is because humans don't differ much. If there were multiple species civilizations like those in Orion's Arm for example, where multiple orders of magnitude differences in abilities are present, than a lot of stratification and non-egalitarianism will happen solely by the value of freedom/empowerment.</p>\n<p>And this poses a real moral dilemma for EA, primarily because of impossibility results around fairness/egalitarianism.</p>\n", "parentCommentId": "AhbACPfLQ92rdseWY", "user": {"username": "Sharmake"}}, {"_id": "Rn5urQdY8XD2oC5h9", "postedAt": "2023-01-15T14:35:56.292Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I thank you for responding quickly and mitigating PR damage. We already got a big PR hit, we don't need another one so soon.</p>\n<p>To the comments who criticize it: I feel like people are underrating PR concerns right now.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "w4GsaFpDbfX7qT7kD", "postedAt": "2023-01-15T15:45:40.383Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>The parenthetical was a joke. I won't do it again.</p>\n", "parentCommentId": "DeMpYcJJuqbdZ4ucX", "user": {"username": "britomart"}}, {"_id": "QrZLmyndnioHvqo5a", "postedAt": "2023-01-15T15:54:17.968Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Ok, thank you!</p>\n", "parentCommentId": "w4GsaFpDbfX7qT7kD", "user": {"username": "Lizka"}}, {"_id": "rtSEQJ9LsohCTf8NJ", "postedAt": "2023-01-15T16:48:21.443Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Writing on such topics does the opposite of favoring your academic career. It is rather a form of career suicide, since you will likely get cancelled and ostracized. The topic is extremely taboo, as we can see with the reaction to Bostrom's old email. He didn't even support hereditarianism about IQ gaps, he just said they exist, which even environmentalists accept!</p>\n", "parentCommentId": "R8rv52N8dp9YBCeXx", "user": {"username": "Maximilian Schlederer"}}, {"_id": "MenNT6TFdXjjeHbXd", "postedAt": "2023-01-15T18:09:59.106Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I'm not aware of the two separate theft incidents (or forgot about one), can you tell me more about them?</p>\n", "parentCommentId": "v5pDWGcyBotrtgGhx", "user": {"username": "orellanin"}}, {"_id": "pzYSBDmJwQYQcnniM", "postedAt": "2023-01-15T18:42:40.207Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote>\n<p>or sentient beings count equally regardless of their species</p>\n</blockquote>\n<p>Who supports this? This is an extremely radical proposal, that I also haven't seen defended anywhere. Of course sentient beings don't count equally regardless of their species, that would imply that if fish turn out to be sentient (which they might) their moral weight would completely outweigh all of humanity right now. Maybe you buy that, but it's definitely extremely far from consensus in EA.</p>\n<p>In-general I feel like you just listed 6 different principles, some of which are much more sensible than others. I still agree that indifference to location and time is a pretty core principle, but I don't see the relevance of it to the Bostrom discussion at hand, and so I assumed that it was not the one CEA was referring to. This might be a misunderstanding, but I feel like I don't really have any story where stating that principle is relevant to Bostrom's original statement or apology, given that racism concerns are present in the current day and affect people in the same places as we are. If that is the statement CEA was referring to, then I do withdraw that part of the criticism and replace it with \"why are you bringing up a principle that doesn't seem to have much to do with the situation?\".</p>\n<p>And then beyond that, I do indeed think asserting there is no difference whatsoever in moral consideration between people seems pretty crazy to me, and I haven't seen it defended. I am not that familiar with Bentham's exact arguments here, and I don't think he is particularly frequently cited (or at least I haven't seen it). I also think I haven't seen most of the other philosopher's cited here except Singer, and I would be happy to have my first object level discussion now about whether you think a principle of perfectly equal moral consideration should hold. Singer has gone on record thinking that indeed different people have different moral weight, and this is one of his most controversial beliefs (i.e. his disability stuff is a consequence of that and has in the past gotten him cancelled at various universities), so I don't know what you are referring to here as the principle, though I also feel pretty confused about Singer's reasoning here.</p>\n<p>In-general I think we discuss the differing moral weight of different animals all the time, and I don't see us following a principle that puts sentient/conscious beings into one large uniform bucket.</p>\n", "parentCommentId": "AhbACPfLQ92rdseWY", "user": {"username": "Habryka"}}, {"_id": "kdFzusf9hsA5pBBgB", "postedAt": "2023-01-15T18:59:01.412Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>That paragraph does feel kind of confused to me, though it's hard to be precise in lists of principles like this.</p>\n<p>As jimrandomh says above, it is widely accepted in EA that time and location do not matter morally (well, moreso location, I think it's actually pretty common for EAs to think that far future lives are worth less than present lives, though I don't agree with this reasoning). But that clearly does not imply that all people count equally, given that there are many possible reasons for differing moral weights.</p>\n", "parentCommentId": "E8z7fnvfXxeLoCwbR", "user": {"username": "Habryka"}}, {"_id": "wWrHYGnibCXA4xnah", "postedAt": "2023-01-15T19:41:40.511Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>This list is a good example of the sort of arguments that look persuasive to those already opposed to HBD, but can push people on the fence towards accepting it, so it may be net-negative from your perspective. This is what has happened to me, and I'll elaborate on why – so that you may rethink your approach, if nothing else.</p><p>Disclaimer: I am a non-Western person with few traits worth mentioning. I identify with the rationalist tradition as established on LW, feel sympathy for the ideal of effective altruism, respect Bostrom despite some disagreements, have donated to GiveWell charities on EA advice, but I have not participated more directly. Seeing the drama, people expressing disappointment and threatening to leave the community, and the volume of meta-discussion, I feel like clarifying a few details that may be hard to notice from within your current culture, and hopefully helping you mend the fracture that is currently getting filled with the race-iq stuff.</p><p>All else being equal, people who hang around such communities prefer consistent models (indeed, utilitarianism itself is a radical solution to inconsistencies in other ethical theories). This discourse is suffused with intellectual inconsistency, on many levels of varying contentiousness.</p><ul><li>On the faint level of moral intuitions, there's the strange beeline from the poorly supported prior that normalization of beliefs like Bostrom's will lead to bad effects like discrimination, to the consequentialist decision against entertaining them. It is not clear that Bostrom's beliefs are harmful in this way, or more likely to encourage a net increase in discrimination than their negation. Arguments from historical precedent have big problems with them: they do not address the direction of causality, or the fact that different cultures can have different reactions to the same information. As it is not considered normal in the modern culture to equate moral worth and ability for individuals of any group, it can be expected that the same will hold should the difference in ability between groups be acknowledged. Arguments from personal distress of users are valid points with regard to community health, but obviously (I hope) incommensurate with the question of global utility, and do not directly weigh on it. So the consequentialist case for not taking Bostrom's belief in good faith is already suspect.</li><li>Perhaps the most obvious level is that specific failings Bostrom is credibly accused of (racist attitude, belief in the racial IQ difference, belief in the validity of IQ measurement) do not depend on HBD. (He has done himself no favors by bringing up eugenics). So it's bizarre to see many people denounce his beliefs <i>in toto</i>, but support this denunciation <i>with environmentalist explanations of the IQ gap</i> – in effect, conceding the specific factual claim in Bostrom's old email, or at least demonstrating that it is not beyond the pale by their own standard. To be clear: it is not in doubt that the IQ gap between Black and White Americans exists; and that it is as predictive of outcomes associated with cognitive capacity as IQ measurement is (which is to say, highly predictive – and this, too, is mainstream consensus). People who act indignant about such statements send a huge red flag, demonstrating either general unwillingness to educate themselves or irrational ideological bias on this specific matter. People who bring up irrelevant anti-HBD talking points demonstrate confused reasoning.</li><li>Less obviously, the problem is portraying this as an open-and-shut case – a portrayal which doesn't really survive scrutiny. I don't know how to put this nicely, but what your list most reminds me of is polemics of sophisticated Creationists in the heyday of New Atheism. It's a mix of true but irrelevant, misleadingly phrased, blatantly misinterpreting and patently false claims. Instrumentally they are gotchas; structurally, opening moves aimed at people who are not familiar with the debate and are not aware that all those issues had long been answered, and the debate is incredibly mature. Of course, in all such debates both sides can assert that they've solved every vulnerability, and this forum isn't some HBD Central. So I won't compete in citations, and will just address things a total layman, provided he's minimally erudite, napkin-numerate, capable of critical thought and aware of basic logical fallacies, could spot, if he were so inclined. You way \"Now you might want to attack one of these (and feel free to send me a message), but even if you're right, that would still leave more than enough reasons to stay away from HBD.\" What if we go through every one of these?</li></ul><ol><li><a href=\"https://en.wikipedia.org/wiki/Population_bottleneck#Humans\">Human biodiversity is actually pretty low. Homo sapiens has been through a number of bottlenecks.</a> – maybe true but vacuous. \"Pretty\" low relative to what baseline? How would we even tell – do we have anything like IQ for other species? Does this genetic fact establish some prior for the magnitude in differences in measurable phenotypic traits between groups? What about individuals? What we <i>do</i> know that people with a priori negligible \"biodiversity\" – as in, children in ethnically endogamous marriages, even in isolated villages – routinely have large differences in all traits of interest. So how much diversity is needed, really, to introduce some measurable population-level divergence? Likewise for the point about bottlenecks, what of it? Should our layman just conclude that this is an authoritative-sounding technical term?</li><li><a href=\"https://en.wikipedia.org/wiki/Identical_ancestors_point\">Human migrations over the last thousand years have been such that literally everyone on Earth is a descendant of literally everyone that lived 7000 years ago whose offspring didn't die out. This is known as the Identical Ancestors Point.</a> – <strong>grossly misleading/false, and doesn't pass basic sanity check</strong>. Is every single unadmixed Indigenous Australian really a descendant of \"literally everyone\" 7000 years ago, same as every single Han Chinese? But, looking it up, <a href=\"https://www.nationalgeographic.com/culture/article/aboriginal-australians\">National Geographic says</a> that <i>\"Aboriginal Australians are all related to a common ancestor who was a member of a distinct population that emerged on the mainland about 50,000 years ago\"</i>, which implies people of other populations are not all related to him. Aha, here's where your figure comes from: <i>\"Rohde, Olson and Chang showed through simulations that, <strong>given the false assumption of random mate choice without geographic barriers</strong>, the Identical Ancestors Point for all humans would be surprisingly recent, on the order of 5,000-15,000 years ago.\"</i> But it is indeed false, there <i>were</i> barriers for the entire history of our species, such as oceans; and how do migrations of the last millenium negate it? More importantly, it's a quantitative issue. Your link goes on to say: <i>\"Thus, even though the Norwegian and Japanese person share the same set of ancestors, these ancestors appear in their family tree in dramatically different proportions. A Japanese person in 5000&nbsp;BC with present-day descendants will likely appear trillions of times in a modern-day Japanese person's family tree, but might appear only one time in a Norwegian person's family tree.\"</i> Seeing as every specimen can have novel genetic variants, this should allow for arbitrary magnitude of divergence, no?</li><li><a href=\"http://pscourses.ucsd.edu/ps108/4%20What%20is%20race/Achenbach%202009-%20Study%20finds%20Africans%20more%20genetically%20diverse.pdf\">Africans have more genetic diversity than literally every other ethnicity on earth taken together, so any classification that separates \"Africans\" from other groups is going to be suspect.</a> – misleading. The money quote is: <i>\"Tishkoff and her colleagues studied DNA markers from around the planet, identifying 14 \"ancestral clusters\" for all of humanity. Nine of those clusters are in Africa. \"You're seeing more diversity in one continent than across the globe,\" Tishkoff said.\"</i> Okay, let's assume that those 9 clusters are meaningfully different (as are the other 5). When people talk of \"Africans\", in practice, whom do they refer to? <a href=\"https://razib.substack.com/p/out-of-africas-midlife-crisis\">Looking it up,</a></li></ol><blockquote><p><i>\"The very-diverse are hunter-gatherer populations who live in clusters scattered across Central and Southern Africa, in Namibia, Botswana, the Congo and a dozen other nations. They include the Khoi, the San, the Mbuti, the Mbenga, the Twa and the Hadza. [...] Save for that isolated half-million very-diverse hunter-gatherer minority, all Sub-Saharan Africans constitute the genetically in-between group of 1.14 billion not-very-diverse humans. [...] The founder population of today’s genetically not-very-diverse Sub-Saharan Africans shows signatures of a population crash, probably with a toll of 50% and probably from an effective breeding population of something like 50,000 people down to 25,000. So out of a founding population on the scale of a very small city 60,000-120,000 years ago, today’s 1.14 billion Sub-Saharan Africans have gone on to people every habitable space of that hugely varied continent. They are significantly more genetically diverse than their relatives on five other continents, but nowhere near as diverse as the neighbors in their midst. [...] 93-98.5% of the ancestry of humans outside of Sub-Saharan Africa (among those with no recent Sub-Saharan African ancestry, obviously) derives from a breeding population of 1,000 to 10,000, which expanded rapidly 60,000 years ago.\"</i><br>So this tells us that a) this measure of diversity is mostly sensitive to minimal sizes of ancient populations, b) people descending from most of those diverse clusters constitute a tiny fraction of African population, and are thus non-central cases of colloquial \"Africans\", c) the overwhelming majority of people of SSA ancestry descend from a single breeding population, which can be distinguished from other populations – including the one that had left Africa. The story is more complex, but the point is that this diversity appears not to be a good reason to not recognize [the majority of] Africans as a specific separate group.</p></blockquote><p>4. <a href=\"https://www.scientificamerican.com/article/race-is-a-social-construct-scientists-argue/\">Race isn't a valid construct, genetically speaking. It's not well defined\".</a> – but aren't we already talking of genomic ancestry? So this is a true but irrelevant objection. Now, people are of course free to believe that conventional self-reported \"races\", which are, as is often correctly said, social constructs, do not correspond to continental-level ancestry – although noisily in many cases. I think this is pretty absurd on its face, but anyway, Googling <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3285495/\">tells us</a> <i>\"In mothers self-identified as Black and White, the imputed ancestry proportions were 77.6% African and 75.1% European respectively\"</i> in a \"diverse\" NYC sample, and I'd expect less cosmopolitan groups to show higher figures. However unfit race is for purposes of cutting-edge research, in the aggregate data it is robustly aligned with ancestry, which <i>is</i> well-defined.</p><p>5. <a href=\"https://arxiv.org/pdf/0706.3639.pdf\">Intelligence is not well defined. There's no single definition of intelligence on which people from different fields can agree.</a> – blatantly misinterpreting. The cited paper states: <i>\"...Nevertheless, some definitions are clearly more concise, precise and general than others. Furthermore, it is clear that many of the definitions listed above are strongly related to each other and share many common features\"</i> and goes on to propose a unified definition: <i>“Intelligence measures an agent’s ability to achieve goals in a wide range of environments.” Features such as the ability to learn and adapt, or to understand, are implicit in the above definition as these capacities enable an agent to succeed in a wide range of environments.</i> Also it is not clear why we'd even need people from different fields (in this case, psychology and AI research!) to agree on a definition of intelligence to have a useful measurement of human smarts. And this is what has happened with IQ:</p><p>6. <a href=\"https://en.wikipedia.org/wiki/Intelligence_quotient#Validity_as_a_measure_of_intelligence\">IQ has a number of flaws. It is by definition Gaussian without having appeared empirically first and the g construct itself has almost certainly no neurological basis and is purely an artifact of factor analysis.</a> – this is just some Gish Gallop. To begin with, I don't see your link supporting your summarization – except the vague \"number of flaws\". If I may, where have you taken this list from? In any case, anything but God has a number of flaws; your link says that <i>\"According to Weiten, \"IQ tests are valid measures of the kind of intelligence necessary to do well in academic work.\"\"</i> and <i>\"clinical psychologists generally regard IQ scores as having sufficient&nbsp;statistical validity&nbsp;for many clinical purposes\".</i> It doesn't seem like there's any scientific objection as to the validity of IQ as a measurement of what's casually called smarts and understood to be smarts in the context of this discussion – even though there are weird attempts to drown this fact in caveats. Why is the part about assumed Gaussian even relevant? What would it mean for <i>g</i> to have a neurological basis, and why would that matter in the discussion of HBD? ...And the part about g being \"purely an artifact of factor analysis\" is plain false, far as I can tell. It comes from <a href=\"http://bactra.org/weblog/523.html\">Cosma Shalizi's essay</a> that misstates the reason for the existence of positive manifold. <i>\"If I take any group of variables which are positively correlated, there will, as a matter of algebraic necessity, be a single dominant general factor... Since intelligence tests are made&nbsp;to correlate with each other, it follows trivially that there must appear to be a general factor of intelligence.\"</i> This is just a lie: a great deal of effort has been devoted to making cognitive tests comprehensive and diverse assessments of ability, but positive correlations <a href=\"https://humanvarieties.org/2013/04/03/is-psychometric-g-a-myth/\">pop out on their own</a>, even in research informed by Shalizi's assumptions, e.g. <i>\"The WJ-R was developed based on the idea that the&nbsp;g&nbsp;factor is a statistical artifact with no psychological relevance. Nevertheless, all of its subtests are intercorrelated and, when factor analyzed, it reveals a general factor that is no less prominent than those of more traditional IQ tests\"</i>. And <i>\"...All 861 correlations are positive. Subtests of each IQ battery correlate positively not only with each other but also with the subtests of the other IQ batteries. This is, of course, something that the developers of the three different batteries could not have planned – and even if they could have, they would not have had any reason to do so, given their different theoretical presuppositions.\"</i></p><p>7. <a href=\"https://en.wikipedia.org/wiki/Twin_study#Criticism\">Twin studies are flawed in methodology</a><a href=\"https://www.smithsonianmag.com/smart-news/identical-twins-can-have-slightly-different-dna-180976736/#:~:text=Research%20published%20on%20January%207,how%20scientists%20study%20human%20development.\">. Twins, even identical twins, simply do not have exactly the same DNA.</a> – again, misinterpreting; there <i>are</i> flaws but the method is not summarily \"flawed\" just because a section about flaws exists. The first link is a list of objections but in no way does it show or argue that they are decisive, or even apply at all to current methods (there are \"responses to critiques\" subsections). The second is apparently irrelevant, and was already addressed by another user.</p><p>8. <a href=\"https://en.wikipedia.org/wiki/Evolution#Evolutionary_processes\">Evolution isn't just mutations and natural selection. Not every trait is an adaptation.</a> (a link to Wiki on \"Evolution – Evolutionary processes\") – ...okay but how does this even support your case? I'm honestly unsure what the idea here is. Taken literally, your summary suggests that evolution can produce maladaptive changes, so we cannot assume that all (or any) populations will be maximally fit (for their environment). This is a pro-eugenicist take, if anything. Whereas the page itself discusses mechanisms of change in allele frequency and does not have any clear impact on the validity of HBD one way or another.</p><p>9. <a href=\"https://en.wikipedia.org/wiki/Heritability#Controversies\">Heritability does not imply genetic determinism. Many things are heritable and do not involve genes.</a>&nbsp;<a href=\"https://en.wikipedia.org/wiki/Heritability#Overview\">These include epigenetic mechanisms, microbiota, or even environmental stress on germinal cells.</a> – irrelevant/false. The link is to \"Heritability – Controversies\" with some nitpicks of unclear truth value. The second is a general overview of possible issues with heritability estimates. It does not weigh in on HBD and accepts the premise of variable genetic contributions to human intelligence: <i>As a case in point, consider that both&nbsp;genes&nbsp;and environment have the potential to influence intelligence. Heritability could increase if genetic variation increases, causing individuals to show more phenotypic variation, like showing different levels of intelligence. On the other hand, heritability might also increase if the environmental variation decreases, causing individuals to show less phenotypic variation</i>. This says, concretely, that in more equal environments we will observe more true genetic effects on variation in intelligence, so whatever differences in genetic effects on this trait there are between groups, they will become more pronounced. By the way this is terrible for the anti-HBD position because it means that the state of perfect environmental equality – one could say equality of opportunity – will collapse into genetic determinism (modulo random noise). Your own idea seems to be that non-genetic mechanisms of apparent heritability can be interrupted by a positive environmental intervention. What share of \"heritable\" variance can it explain, at a maximum? Like, concretely, to what extent do you think the racial IQ gap is explained by microbiota, epigenetic mechanisms and environmental stress on germinal cells? Those are all quantifiable and falsifiable claims, but you just gesture at them. At this point, a dedicated layman looks it up and sees that they can explain very little indeed.</p><p>10. <a href=\"https://www.youtube.com/watch?v=jKVowgubMEg&amp;ab_channel=RebeccaWatson\">We don't mate randomly, which is an assumption in many genetics studies.</a> – irrelevant applause lights, \"genetics bad\". Which studies, and does this matter for HBD? I've watched the video; it discusses interactions between psychiatric disorders and such, and states that genetic correlations between traits may be inflated by assortative mating (i.e. people high in trait X marry people high in trait Y). Genetic correlation <i>\"is defined as&nbsp;the proportion of the heritability that is shared between two traits divided by the square root of the product of the heritability for each trait\"</i>. What is meant here, concretely? Ancestry is not really a \"heritable trait\", is it? And race is just a category, plus a bad proxy for ancestry, as far as HBD is concerned.</p><p>11. <a href=\"https://osf.io/preprints/socarxiv/2qfkt/\">HBD is not generally accepted in academia.</a> – this is just an appeal to authority, plus misleading. It's a single highly technical paper by some Kevin Bird, \"Department of Horticulture Michigan State University\", can it be considered an authoritative source on what academia thinks? And from the abstract, it attacks a very strong form of HBD reasoning, using data that cannot plausibly be conclusive: <i>Evidence for selection was evaluated using an excess variance test. Education associated variants were further evaluated for signals of selection by testing for excess genetic differentiation (Fst).</i> Does it strike you as plausible that we know enough about \"education associated variants\" to impute effects of prehistoric selection on intelligence? This ought to mean that the science of genetics of intelligence is vastly more mature than people think, than you suggest, too, and that within-group intelligence heritability is understood really well! Why hasn't this made the news yet? (And how does this address obvious low-tech HBD arguments, such as admixture studies and adoption studies?)</p><p>12. <a href=\"https://en.wikipedia.org/wiki/Cyril_Burt#Fraud_accusations\">Many public HBD figures have been found guilty of fraud. Cyril Burt would literally forge results, while Lynn would take the average of two neighboring countries' IQ in order to derive \"data\" from a country's unknown national IQ.</a> – That's an isolated demand for rigor. What field doesn't commit fraud? Were public anti-HBD figures never found guilty of fraud? Is the fraud rate different enough to affect our priors? And your link does not show that Burt's forgery was positively proven, but it admits that figures of heritability arrived at by independent researchers do not differ from Burt's, so why should we care? Assuming that a layman could track it down from here, I'll allow myself to quote Richard Haier (<i>The Neuroscience of Intelligence</i>, Cambridge University press, 2017): <i>Subsequent twin studies done by different investigators around the world with large samples arrive at an average value for the correlation of intelligence scores among identical twins raised apart of .75 (Plomin &amp; Petrill, 1997). Burt’s value was .77. For comparison, based on 19 studies ranging in sample sizes between 26 and 1,300 identical twin pairs, the average value for identical twins raised together is about .86 (see Loehlin &amp; Nichols, 1976, table 4.10, p. 39)... Thus, the .771 “fraud” ends with recognition of overwhelming data from independent researchers that are fully consistent with Burt’s analyses, flawed as they may have been. Any single study, or any one researcher, can be flawed, but the basic conclusion that genes play an important role in intelligence is consistently supported by data from numerous studies of twins, adoptees, and adopted twins. This is an excellent example of looking at the weight of evidence (recall my three laws from the Preface: no story is simple; no one study is definitive; it takes many years to sort out conflicting and inconsistent findings and establish a weight of evidence). ... The weight of evidence summarized in this chapter leaves no reasonable doubt. Only extreme ideologues are still in denial.</i> As for Lynn's country data, well, the same logic applies. Do we have any more trustworthy data? Does it refute Lynn's? Then why not just refer to it instead? Please don't say that it's not very interesting and nobody has bothered to collect proper measurements, IQ and race (or rather, ethnicity) is literally the most painful question in modern science, and it's evident from such dramas that a great many researchers are emotionally invested in proving the relationship wrong.</p><p>Ultimately, exposure to this sort of content has done for me what it has done for this person:</p><blockquote><p>[…] Well, OK, I could believe that; visible traits consistent over entire populations like skin color might differ systematically because of sexual selection or something, but why not leave IQ following the exact same bell curve in each population? <strong>There was no specific thing here that made me start to wonder, more a gradual undermining</strong> (Gould’s work like <a href=\"https://archive.md/o/Utkqw/en.wikipedia.org/wiki/The%20Mismeasure%20of%20Man\"><i>The Mismeasure of Man</i></a> &nbsp;being <a href=\"https://archive.md/o/Utkqw/www.plosbiology.org/article/info:doi/10.1371/journal.pbio.1001071\">completely dishonest</a> is one example - with enemies like that…) as I continued to read studies and wonder why Asian model minorities did so well, <strong>and a lack of really convincing counter-evidence like one would expect the last two decades to have produced - given the politics involved - if the idea were false.</strong> And one can always ask oneself: suppose that intelligence was meaningful, and did have a large genetic component, and the likely genetic ranking East Asians &gt; Caucasian &gt; Africans; in what way would the world, or the last millennium (eg the growth of the Asian tigers vs Africa, or the different experiences of discriminated-against minorities in the USA), look different than it does now?<br>But having said that, and admiring things like Plantinga’s free will defense, and the subtle logical issues in formulating it and the lack of any really concrete evidence for or against Jesus’s existence, do I take the basic question of God seriously? No. <strong>The theists’ rearguard attempts and ever more ingenious explanations and indirect pathways of reasons and touted miracles fundamentally do not add up to an existing whole</strong>. The universe does not look anything like a omni-benevolent/powerful/scient god was involved, a great deal of determined effort has failed to provide any convincing proof, there not being a god is consistent with all the observed processes and animal kingdom and natural events and material world we see, and so on. The persistence of the debate reflects more what motivated cognition can accomplish and the weakness of existing epistemology and debate.[…]</p></blockquote><p>I want to make it perfectly clear: those question marks in my point-by-point do not actually indicate uncertainty. They could as well have been references to papers. The field really is about as advanced as Bird's study suggests – only in the direction he disapproves of. But this isn't the place for it, surely people can go to some edgier venue and ask for receipts. The point I'm trying to make is: you say \"Okay, if there's anyone here who actually believes in HBD, here's a couple reasons why you shouldn't.\" On an ignorant but moderately skeptical person your little list can, and likely will, have an effect that's the opposite of what you intend to achieve. To \"who actually believes in HBD\", it's utterly unconvincing. If I may be so blunt, it's almost as sad as quasi-scientific gotchas of flat earthers.</p><p>And this is how all of anti-HBD rhetoric is, in my experience. It crumbles under basic scrutiny, links do not show what they are purported to show, there are simple misunderstandings of what terms mean, there is no coherent epistemology or a single model, there's suppression of inconvenient evidence, there's substitution of evidence with confident op-eds in Vox from people who are supposed to be experts (but whose legitimate work doesn't support their confident claims), there are cascades of internally inconsistent Gish Gallops and other fallacies; worst of all, the reader is assumed to just not be all that bright. It's a collection of purely reactive objections that might come across as persuasive to like-minded people, but are not battle-tested – and indicate general unwillingness to test one's beliefs.</p><p>I expect very little payoff from this labor. But it would be nice if EAs were to become a little more reserved on this topic, and at least stopped turning off potential recruits with irrefutable displays of irrationality.</p><p><br><br>&nbsp;</p>", "parentCommentId": "TRHHWxfmXcFXseLdA", "user": {"username": "MissionCriticalBit"}}, {"_id": "G9XPPktpYY7ui43TL", "postedAt": "2023-01-15T20:32:22.374Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>11. <a href=\"https://osf.io/preprints/socarxiv/2qfkt/\">HBD is not generally accepted in academia.</a></p></blockquote><p>&nbsp;</p><p>84% of surveyed intelligence researchers believe the gaps are at least partially genetic.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreffmq3r880f6\"><sup><a href=\"#fnfmq3r880f6\">[1]</a></sup></span>&nbsp; This statement is not just an appeal to authority, it is also inaccurate.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnfmq3r880f6\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreffmq3r880f6\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.sciencedirect.com/science/article/abs/pii/S0160289619301886</p></div></li></ol>", "parentCommentId": "wWrHYGnibCXA4xnah", "user": {"username": "Anon Rationalist"}}, {"_id": "hYZnQNyLmPHBnswC3", "postedAt": "2023-01-15T21:15:45.513Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I initially strongly upvoted this post but have since retracted my vote. I think the statement is vague as to which \"words\" it \"condemns\". It would be better for CEA to take a firm, concrete stance against scientific racism (\"SR\") specifically. As other people on the forum have <a href=\"https://forum.effectivealtruism.org/posts/KB8XPfh7dJ9uJaaDs/does-ea-understand-how-to-apologize-for-things\">pointed out</a>, the promotion of SR in the community is harmful for many reasons: SR ideas have directly harmed people of color, discussion of SR deters people of color from participating in the movement, it makes the movement look bad, and it distracts from the movement's actual priorities.</p>\n<p>As a step further, CEA should consider banning all promotion of scientific racism on the forum. At a minimum, CEA should make it clear that SR ideas have no place in the EA movement.</p>\n", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "TmRZGArnY4CcE7bYd", "postedAt": "2023-01-15T21:51:22.310Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Here's a VERY unharitable idea (that I hope will not be removed because it could be true, and if so might be useful for EAs to think about):</p><p>Others have pointed to the rationalist transplant versus EA native divide. &nbsp;I can't help but feel that this is a big part of the issue we're seeing here.</p><p>I would guess that the average \"EA native\" is motivated primarily by their desire to do good. &nbsp; They might have strong emotions regarding human happiness and suffering, which might bias them against a letter using prima facie hurtful language. &nbsp;They are also probably a high decoupler and value stuff like epistemic integrity - after all, EA breaks from intuitive morality a lot - but their first impulses are to consider consequences and &nbsp;goodness.</p><p>I would guess that the average \"rationalist transplant\" is motivated primarily by their love of epistemic integrity and the like. &nbsp; They might have a bias in favor of violating social norms, which might bias them in favor of a letter using hurtful language. &nbsp;They probably also value social welfare (they wouldn't be here if they didn't) but their first impulses favor finding a norm-breaking truth. &nbsp;It may even be a somewhat deolontogical impulse: &nbsp;it's good to challenge social norms in search of truth, independent of whether it creates good consequences.</p><p>I believe the EA native impulse seems more helpful to the EA cause than the rationalist &nbsp;impulse.</p><p>And I worry the rationalist impulse may &nbsp;even be actively harmful if it dilutes EA's core values. For example, in <a href=\"https://forum.effectivealtruism.org/posts/bXP7mtkK6WRS4QMFv/are-bad-people-really-unwelcome-in-ea\">this post</a> a rationalist transplant describes themself as motivated by status instead of morality. &nbsp;This seems very bad to me.</p><p>Again, I recognize that this is a VERY uncharitable view. &nbsp; I'd like to hasten to say that there are probably a great many rationalist-transplants whose commitment to advancing social welfare are equal to or greater than mine, as an EA native. &nbsp;My argument is about group averages, not individual characteristics.</p><p>...</p><p>Okay, yes, I found that last sentence really enjoyable to write, guilty as charged</p>", "parentCommentId": "v5pDWGcyBotrtgGhx", "user": {"username": "AnonymousQualy"}}, {"_id": "vy6HWpk2HFZx6t9KD", "postedAt": "2023-01-15T23:45:02.439Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>The reason why I don't say \"the n-word\" as you did is because it can be misleading. I have seen people using it to quote somebody else who just said \"negro\". So to me saying \"the n-word\" would violate another (to my mind much more important) norm:&nbsp;</p><p>\"<strong>Be honest.&nbsp;</strong></p><ul><li>Don’t mislead or manipulate.\"</li></ul><p>&nbsp;</p><p>I try to follow rules I disagree with. However if I violated any rules here then at least they should have been clearer, so I appreciate the ongoing effort.</p>", "parentCommentId": "BixsTmaApcakNLEFN", "user": {"username": "Aithir"}}, {"_id": "eSytohNzDvftHpBQj", "postedAt": "2023-01-16T00:45:34.406Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>The topic is extremely taboo</p></blockquote><p>And with good reason, out of the billions of possible correlations to talk about this is one of the very few that will help racists.</p><blockquote><p>Writing on such topics does the opposite of favoring your academic career</p></blockquote><p>True, but most people can't cut it in academia and if one fancies themselves a researcher this path will allow you to continue to keep doing that without a lot of intellectual competition. Plus you can still get funding from shady organizations like the Pioneer Fund (I call them shady because they funded the distribution of 'Erbkrank'-a Nazi propaganda film about eugenics- as one of their first projects and because they have ties to white supremacists groups, so their impartiality is suspect)</p>", "parentCommentId": "rtSEQJ9LsohCTf8NJ", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "kkuvnF3hppyPNGMBe", "postedAt": "2023-01-16T01:17:31.059Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<ol><li>SBF</li><li>Avraham Eisenberg (with the Mango Markets exploit, which he has now been arrested for)</li></ol>", "parentCommentId": "MenNT6TFdXjjeHbXd", "user": {"username": "throwaway_account"}}, {"_id": "vqrG4gaEhRFcASgmy", "postedAt": "2023-01-16T01:44:09.808Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>This list is a good example of the sort of arguments that look persuasive to those already opposed to HBD, but can push people on the fence towards accepting it, so it may be net-negative from your perspective. This is what has happened to me, and I'll elaborate on why – so that you may rethink your approach, if nothing else.</p></blockquote><p>Even if you think my reasons failed, why would that push you <i>towards</i> accepting it? HBD is a hypothesis for how the world works, so the burden of proof is on HBD and giving a bad reason not to believe in HBD is not evidence <i>for</i> HBD. To give a very clear example, if someone says 'I believe in unicorns', and I say 'no unicorns do not exist because 1+1=3' that would fail to be evidence for unicorns not existing, but that does not mean it counts <i>towards</i> evidence for unicorns existing.</p><blockquote><p>Disclaimer: I am a non-Western person with few traits worth mentioning. I identify with the rationalist tradition as established on LW, feel sympathy for the ideal of effective altruism, respect Bostrom despite some disagreements, have donated to GiveWell charities on EA advice, but I have not participated more directly. Seeing the drama, people expressing disappointment and threatening to leave the community, and the volume of meta-discussion, I feel like clarifying a few details that may be hard to notice from within your current culture, and hopefully helping you mend the fracture that is currently getting filled with the race-iq stuff.</p></blockquote><p>Thank you for donating to GiveWell! Unimportant nitpick that has always bothered me: LW has an empiricist tradition, the term 'rationalist' is a misnomer.</p><blockquote><p>All else being equal, people who hang around such communities prefer consistent models (indeed, utilitarianism itself is a radical solution to inconsistencies in other ethical theories). This discourse is suffused with intellectual inconsistency, on many levels of varying contentiousness.</p></blockquote><p>I wouldn't say other ethical theories are internally inconsistent. They might have other attributes or conclusions that you think are bad, but the major ethical theories don't have any inconsistencies as far as I can tell. Do you have an example?On the other hand I do think Eliezer has some inconsistencies in his philosophy, although it's hard to tell because he's quite vague, doesn't always use philosophical terminology (in fact he <a href=\"https://www.greaterwrong.com/posts/oTX2LXHqXqYg2u4g6/less-wrong-rationality-and-mainstream-philosophy/comment/YPPYBReJ8JknqpPqi\">is</a> <a href=\"https://www.lesswrong.com/posts/oTX2LXHqXqYg2u4g6/less-wrong-rationality-and-mainstream-philosophy?commentId=RtAG5ar6qoxGqCaDD\">very</a> <a href=\"https://www.lesswrong.com/posts/vzLrQaGPa9DNCpuZz/against-modal-logics\">dismissive</a> of the field as a whole) and has a tendency to reinvent the wheel instead (e.g his '<a href=\"https://www.lesswrong.com/posts/NEeW7eSXThPz7o4Ne/thou-art-physics\">Requiredism</a>' is what philosophers would call compatibilism). Now usually I wouldn't mind it that much, but since philosophy requires such precision of language if you don't want to talk past each other, I do think this doesn't work in his favor.</p><blockquote><ul><li>On the faint level of moral intuitions, there's the strange beeline from the poorly supported prior that normalization of beliefs like Bostrom's will lead to bad effects like discrimination, to the consequentialist decision against entertaining them.</li></ul></blockquote><p>I would like to point out that my comment was not about Bostrom.</p><blockquote><ul><li>It is not clear that Bostrom's beliefs are harmful in this way, or more likely to encourage a net increase in discrimination than their negation. Arguments from historical precedent have big problems with them: they do not address the direction of causality</li></ul></blockquote><p>I mean even if you don't know which way the arrow of causality points, that's still an unnecessarily big risk. It's not particularly altruistic to make statements that have that big a chance of helping racists. You could also spend your time... not doing that. Also even if you reject arguments from historical precedent there is still the entire field of <a href=\"https://en.wikipedia.org/wiki/Linguistic_racism\">linguistic racism</a>.</p><blockquote><ul><li>As it is not considered normal in the modern culture to equate moral worth and ability for individuals of any group, it can be expected that the same will hold should the difference in ability between groups be acknowledged.</li></ul></blockquote><p>Just because people won't publicly state it doesn't mean it doesn't influence their thinking. Take for example the stereotype of the welfare queen. While not everyone will explicitly state 'this person has a lower moral worth' (although some will) the racist stereotyping does lead to black people being<a href=\"https://en.wikipedia.org/wiki/Welfare_queen#Impact_of_the_stereotype\"> harmed both socially and economically</a>. <a href=\"https://en.wikipedia.org/wiki/Myth_of_meritocracy\">The myth of meritocracy</a> is strong, and people who are seen as unable to 'pull themselves up by their &nbsp;bootstraps' are looked down upon.</p><blockquote><ul><li>Arguments from personal distress of users are valid points with regard to community health, but obviously (I hope) incommensurate with the question of global utility, and do not directly weigh on it.</li></ul></blockquote><p>What global utility? Racists want us to talk about this stuff, there are other correlations that are both on firmer ground, have more global utility and aren't fulfilling the desires of racists.</p><blockquote><ul><li>Perhaps the most obvious level is that specific failings Bostrom is credibly accused of (racist attitude, belief in the racial IQ difference, belief in the validity of IQ measurement) do not depend on HBD. (He has done himself no favors by bringing up eugenics). So it's bizarre to see many people denounce his beliefs <i>in toto</i>, but support this denunciation <i>with environmentalist explanations of the IQ gap</i></li></ul></blockquote><p>If you had read my comments you would've seen that I both didn't respond to Bostrom, did respond to HBD and did support the environmental explantation of the IQ gap.</p><blockquote><ul><li>&nbsp;– in effect, conceding the specific factual claim in Bostrom's old email, or at least demonstrating that it is not beyond the pale by their own standard. To be clear: it is not in doubt that the IQ gap between Black and White Americans exists; and that it is as predictive of outcomes associated with cognitive capacity as IQ measurement is (which is to say, highly predictive – and this, too, is mainstream consensus). People who act indignant about such statements send a huge red flag, demonstrating either general unwillingness to educate themselves or irrational ideological bias on this specific matter. People who bring up irrelevant anti-HBD talking points demonstrate confused reasoning.</li></ul></blockquote><p>My comment didn't deny the existence of an IQ gap and my comment was responding to sapphire who was talking about HBD specifically and so it wasn't \"irrelevant anti-HBD talking point\". If you're not engaging with what I actually write I'm starting to think that spending hours on this comment wasn't the best use of my time.</p><blockquote><ul><li>what your list most reminds me of is polemics of sophisticated Creationists in the heyday of New Atheism. It's a mix of true but irrelevant, misleadingly phrased, blatantly misinterpreting and patently false claims. Instrumentally they are gotchas</li></ul></blockquote><p>Very civil. It will not surprise you to learn that this does not motivate me to keep reading.</p><blockquote><ul><li>So I won't compete in citations</li></ul></blockquote><p>Yeah I'm out.<br>*I'm going to spend my time on something else now.</p>", "parentCommentId": "wWrHYGnibCXA4xnah", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "JHoyqfjahQDppNFht", "postedAt": "2023-01-16T05:13:00.050Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Clarification: is scientific racism something like \"there is a scientific paper relating to race and IQ, [discussion on implication]\"?</p>", "parentCommentId": "hYZnQNyLmPHBnswC3", "user": {"username": "Daryl D'Souza"}}, {"_id": "NCHSetJjKqGGGecXA", "postedAt": "2023-01-16T05:19:34.556Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>+60% on scientific devaluing on poc(true or false) deterring poc from participating.<br><br>Not sure if overall would be good though. The clearerThinking podcast w/Magnus Carlson say that allowing misinformation to be voiced may be effective at reducing misinformation. Ex. can point out why the view may fall short.</p>", "parentCommentId": "hYZnQNyLmPHBnswC3", "user": {"username": "Daryl D'Souza"}}, {"_id": "LYP47L2SyegQ6Pnin", "postedAt": "2023-01-16T05:43:14.563Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Yeah I think that's a good point. An interesting perspective is that freedom of speech includes the right to <i>express</i> controversial ideas as well as the <a href=\"https://www.newyorker.com/news/the-future-of-democracy/the-right-to-listen\">right to <i>listen</i></a> to them. Members of the EA community have the right to learn about ideas that may be classified as <a href=\"https://en.wikipedia.org/wiki/Scientific_racism\">scientific racism</a> and decide for themselves whether they are true and false. (And of course, my use of the term \"scientific racism\" presumes that these ideas are pseudoscience, which other people on the forum have disputed.) However, I really think that the EA Forum is not the right place for these discussions for the reasons I gave above. At least they should be limited to the \"Personal Blog\" section.</p>", "parentCommentId": "NCHSetJjKqGGGecXA", "user": {"username": "evelynciara"}}, {"_id": "qC2okjn4aqq8Ym8SY", "postedAt": "2023-01-16T05:44:47.782Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>Scientific racism, sometimes termed biological racism, is the pseudoscientific belief that empirical evidence exists to support or justify racism (racial discrimination), racial inferiority, or racial superiority. Historically, scientific racism received credence throughout the scientific community, but it is no longer considered scientific. The division of humankind into biologically distinct groups, and the attribution of specific traits both physical and mental to them by constructing and applying corresponding explanatory models, i.e. racial theories, is sometimes called racialism, race realism, or race science by its proponents. Modern scientific consensus rejects this view as being irreconcilable with modern genetic research.</p><p>— <a href=\"https://en.wikipedia.org/wiki/Scientific_racism\">Wikipedia</a></p></blockquote><p>\"Scientific racism\" is admittedly a bit of a misnomer because \"scientific\" racism is not scientific.</p>", "parentCommentId": "JHoyqfjahQDppNFht", "user": {"username": "evelynciara"}}, {"_id": "is8TLGbPcvqR9R8gt", "postedAt": "2023-01-16T06:51:55.552Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>This looks like retconning of history. EA and rationalism go way back, and the entire premise of EA is that determining what makes more good through \"rationalist\", or more precisely, consequentialist lens is  moral. There is no conflict of principles.</p>\n<p>The quality of discussion on the value of tolerating Bostrom's (or anyone else's ) opinions on race&amp;IQ is incredibly low, and the discussion is informed by emotion rather than even trivial consequentialist analysis.  The failure to approach this issue analytically is a failure both by Rationalist and by old-school EA standards.</p>\n", "parentCommentId": "TmRZGArnY4CcE7bYd", "user": {"username": "MissionCriticalBit"}}, {"_id": "WSFijz9QmRtkgFKoL", "postedAt": "2023-01-16T09:58:51.145Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I agree that the current norms are probably not clear enough to cover this situation, we are thinking about adding more specific ones.</p><p>As a non-american, I also initially found the lack of use-mention distinction to be very counterintuitive. But it's culturally very important for a very large fraction of forum readers, so <strong>I would also ask you to edit your initial comment</strong>. If you don’t do that, we may just edit the comment for you.<br><br>Using \"n-word\" would definitely not count as \"misleading or manipulating\". If you wanted to be absolutely precise I would recommend linking to the original source.</p>", "parentCommentId": "vy6HWpk2HFZx6t9KD", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "zhqBhkQvyouEZ4o9C", "postedAt": "2023-01-16T10:25:00.115Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Did I link to an incorrect e-mail or why does this comment have -6 agreement karma? In general it would be helpful if people explained their downvote.</p>", "parentCommentId": "QDySwDoE93GjezKuK", "user": {"username": "Aithir"}}, {"_id": "GW3ych6TCijRnt2HL", "postedAt": "2023-01-16T10:40:54.737Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>My initial comment seemed completely innocent to me. I didn't expect the backlash and don't want to clog this thread further with a discussion that isn't really on topic, so this will be my last reply here. (DM me if you want)</p><p>thx @RAB for the reply</p><p>To all the people who downvoted. My comment was asking for clarification. If you then downvote it for <i>presumably</i> the same reason you took offense to the Bostrom comment without explaining why this isn't very productive.</p><p>&nbsp;</p><p>@moderators I edited my comment.&nbsp;</p><p>The effect that the rules will have won't be that I(and I assume this is true for others as well) will act the way that you think is proper, instead I will just not engage at all. This isn't just true for this instance (which would be trivial), but in general.</p>", "parentCommentId": "WSFijz9QmRtkgFKoL", "user": {"username": "Aithir"}}, {"_id": "PnjxNv9Nb2sJpyMDE", "postedAt": "2023-01-16T10:56:20.099Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Thank you for editing the comment and really thank you for the feedback.</p><p>I agree, we will need to be very careful about striking a proper balance here, but I think we can find something that's better than the status quo (which results in downvotes and off-topic discussions, and detracts from discussions on how to do the most good)</p>", "parentCommentId": "GW3ych6TCijRnt2HL", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "QumL9nZwy243u6mPZ", "postedAt": "2023-01-16T10:57:26.776Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote>\n<p>And with good reason, out of the billions of possible correlations to talk about this is one of the very few that will help racists.</p>\n</blockquote>\n<p>Strong disagree here. See the quote of the paper I posted below.</p>\n", "parentCommentId": "eSytohNzDvftHpBQj", "user": {"username": "Maximilian Schlederer"}}, {"_id": "s7C93iCc3EDvoEQC8", "postedAt": "2023-01-16T12:22:09.708Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I'm arguing not for a \"conflict of principles\" but a conflict of impulses/biases. &nbsp;Anecdotally, I see a bias for believing that the truth is probably norm-violative in rationalist communities. &nbsp;I worry that this biases some people such that their analysis fails to be sufficiently consequentialist, as you describe.</p>", "parentCommentId": "is8TLGbPcvqR9R8gt", "user": {"username": "AnonymousQualy"}}, {"_id": "JthXsgvidx3ocJJTx", "postedAt": "2023-01-16T13:50:45.260Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Equality is always “equality with respect to what”. In one sense giving a begger a hundred dollars and giving a billionaire a hundred dollars is treating them equally, but only with respect to money. With respect to the important, fundamental things (improvement in wellbeing) the two are very unequal. I take it that the natural reading of “equal” is “equal with respect to what matters”, as otherwise it is trivial to point out some way in which any possible treatment of beings that differ in some respect must be unequal in some way (either you treat the two unequally with respect to money, or with respect to welfare for instance).</p>\n<p>The most radical view of equality of this sort, is that for any being for whom what matters can to some extent matter to them, one ought to treat them equally with respect to it, this is for instance the view of people like Singer, Bentham, and Sidgwick (yes, including non-human animals, which is <a href=\"https://forum.effectivealtruism.org/posts/28GrG8iFBrKEHb27t/marginal-cases-on-trial\">my view</a> as well). It is also, if not universally at least to a greater degree than average, one of the cornerstones of the philosophy and culture of Effective Altruism, it is also the reading implied <em>by <a href=\"https://www.effectivealtruism.org/articles/introduction-to-effective-altruism#what-values-unite-effective-altruism\">the post</a> linked in that part of the statement</em>.</p>\n<p>Even if you disagree with some of the extreme applications of the principle, race is easy mode for this. Virtually everyone today agrees with equality in this case, so given what a unique cornerstone of EA philosophy this type of equality is in general, in cases where it seems that people are being treated with callousness and disrespect based on their race, it makes sense to reiterate it, it is an especially worrying sign for us. Again, you might disagree that Bostrom is failing to apply equal respect of this sort, or that this use of the word equality is not how you usually think of it, but I find it suspicious that so many people are boosting your comment given how common, even mundane a statement in EA philosophy ones like this are, and that the statement links directly to a page explaining it on the main EA website.</p>\n", "parentCommentId": "pzYSBDmJwQYQcnniM", "user": {"username": "Devin Kalish"}}, {"_id": "HqYt3mr7fg7mAX6SH", "postedAt": "2023-01-16T14:04:54.480Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote>\n<p>HBD is a hypothesis for how the world works, so the burden of proof is on HBD and giving a bad reason not to believe in HBD is not evidence&nbsp;<em>for</em>&nbsp;HBD.</p>\n</blockquote>\n<p>This logic is only applicable to contrived scenarios where there is no prior knowledge at all – but you need some worldly knowledge to understand what both these hypotheses are about.<br>\nCrucially, there is the zero-sum nature of public debate. People deliberately publicizing reasons to <em>not believe</em> some politically laden hypothesis are not random sources of data found via unbiased search: they are expected to cherrypick damning weaknesses. They are also communicating standards of the intellectual tradition that stands by the opposing hypothesis. A rational layman starts with equal uncertainty about truth values of competing hypotheses, but learning that one side makes use of arguments that are blatantly unconvincing on grounds of mundane common sense can be taken as provisional evidence against their thesis even before increasing object-level certainty: poor epistemology is evidence against ability to discover truth, and low-quality cherrypicked arguments point to a comprehensively weak case. Again, consider beliefs generally known to be kooky, and what they bring to bear on the opposition. Their standard of rigor alone is discrediting to what they believe in.</p>\n<p>Moreover, I've established that, upon checking, some of your links positively provide evidence in favor of HBD, rather than against – at least by the standard of evidence implicit in the phrasing of the list. Returning again to the Identical Ancestors Point, is presented as an Anti-HBD finding in the first place because it implies a very low prior for genetic divergence of populations, migrations somehow averaging it all out: <em>Human migrations over the last thousand years have been such that literally everyone on Earth is a descendant of literally everyone that lived 7000 years ago whose offspring didn't die out</em>. (Is this the wrong takeaway? What, then, did you mean to say by adding it?) Looking into <a href=\"http://www.stat.yale.edu/~jtc5/papers/CommonAncestors/NatureCommonAncestors-Article.pdf\">the actual paper</a>, we see: <em>...For example, a present-day Norwegian generally owes the majority of his or her ancestry to people living in northern Europe at the IA point, and a very small portion to people living throughout the rest of the world. Furthermore, because DNA is inherited in relatively large segments from ancestors, an individual will receive little or no actual genetic inheritance from the vast majority of the ancestors living at the IA point</em>. Not only does this make the original argument invalid (even in a strong absolute sense – there can be <strong>zero</strong> common inheritance!) – it directly reinforces the HBD conjecture that long-term (i.e. pre-IAP) divergent local adaptation is relevant to current genetic (and trait) differences.</p>\n<blockquote>\n<p>LW has an empiricist tradition, the term 'rationalist' is a misnomer.</p>\n</blockquote>\n<p>I agree that this is improper and irritating terminology, because doctrinally, LW asserts its allegiance to empiricism, with all the talk about Bayes-updating on evidence and how rationalists must \"win\". But in practice this isn't so clear-cut: LW is fascinated with armchair thought experiments (that routinely count as evidence to update on), and all the attention devoted to infohazards, Pascal mugging, one-boxing, AI scenarios etc. suggests that they, as a living tradition, are not resilient to speculation the way pure empiricists – say, regular natural scientists – would be. So, not necessarily a misnomer.</p>\n<blockquote>\n<p>the major ethical theories don't have any inconsistencies as far as I can tell</p>\n</blockquote>\n<p>They are internally consistent, but I think the point of ethical theory is to clarify the intuitively knowable essence of moral action for purposes of nontrivial decisionmaking, not to assert what morality is and derive an arbitrary decision rule from there. Utilitarianism is often criticized for things like the repugnant conclusion, yet non-utilitarian ethical theories routinely produce more grating outputs, because they fail to capture the most significant part of intuitive ethics, which is mostly about harm reduction under conditions of resource scarcity. They are less consistent with ethics given to us in lived experience, so to speak.</p>\n<blockquote>\n<p>even if you don't know which way the arrow of causality points, that's still an unnecessarily big risk. It's not particularly altruistic to make statements that have that big a chance of helping racists. You could also spend your time... not doing that.</p>\n</blockquote>\n<p>No, the extent of the purported risk matters. You are just falling back on the unsupported prior about cost-benefit ratio because you have preemptively excluded all factors that may change the qualitative conclusion of \"not doing that\". To give a specific example: under the assumption that HBD is wrong, we must consider disparate outcomes to be a result of some discrimination and devote resources to alleviate it; but if HBD is actually right, this'd necessarily mean that our costly attempts to help low-performing groups are suboptimal or futile (as in, not effective), and that we will have unfairly attributed blame, harming other groups psychologically and materially. Then there are knock-on effects of  harming science: for starters, fears of enabling racists can hold back genomic medicine (and population-specific treatment) by increasing hurdles to data collection and access. We do not have a priori knowledge as to which costs are negligible. On a more meta level, <a href=\"https://slatestarcodex.com/2017/10/23/kolmogorov-complicity-and-the-parable-of-lightning/\">Scott Alexander's parable comes to mind</a>.</p>\n<blockquote>\n<p>there is still the entire field of&nbsp;<a href=\"https://en.wikipedia.org/wiki/Linguistic_racism\">linguistic racism</a>.</p>\n</blockquote>\n<p>IMO it's a weak argument because for all the racism, black Americans still report <a href=\"https://journals.sagepub.com/doi/abs/10.1177/0095798406295096\">the highest self-esteem of all racial groups</a>; and theories of stereotype threat <a href=\"https://web.archive.org/web/20190212220457/https://heterodoxacademy.org/is-stereotype-threat-overcooked-overstated-and-oversold/\">are apparently unsupported by high-quality data</a>; so it isn't clear what the odds are that some HBD research or whatever would harm people substantially. But even before that – there are laws against hate speech and discrimination, and they can be strengthened if needed; it seems very suboptimal to focus on not developing neutral knowledge only to deny hateful ideologies rhetorical ammo, instead of dealing with them directly. By the way, cannot racists <a href=\"https://www.chronicle.com/article/racial-pseudoscience-on-the-faculty\">point to censorship</a>as sufficient evidence of their correctness, if their intent is to spin available facts to their benefit? Actually, doesn't this enable them to – convincingly – claim that facts are <em>much worse</em> than they are, that the genomic gap in cognitive ability is bigger than the non-zero gap we'd have found (and, I believe, <em>have</em> partially found) with proper research (which is <a href=\"https://www.city-journal.org/nih-blocks-access-to-genetics-database\">currently prohibited</a>)? And in any case, you have to put racism-driven harms in the context of costs of pretending that HBD is certainly false – that is, under the assumption that we are \"just not doing that\" and have no clue whether it is or isn't true.</p>\n<p>As an aside, I am personally puzzled by the strong conviction of many that HBD becoming common knowledge could lead to normalization of racial discrimination. This is a normative, not scientific question. Societies with Social Darwinist values do not need HBD to embrace and exacerbate the status quo of disparate power. Societies with ethnocentric values opportunistically oppose and exploit ethnic outgroups regardless of relative merit. Mainstream modern value system depends on the premise of human <em>rights</em>, not equality of capability. We do not hold that it is normal to oppress individuals who are <em>known</em> to be below average in some morally neutral trait (except maybe for an expansive definition of \"oppress\" and clinical issues having to do with lack of legal capacity), we have a strong revulsion to identity-based discrimination, and we understand the unreasonableness of treating individuals on the basis of average values.<br>\nUncharitably, in the case of EA, this concern may have to do with the strain (common to EA and LW) of conspiratorial elitism and distrust in the democratic process, and with the unconscious belief that intelligence <em>does</em> define moral worth. That's ...not a very popular belief. I would deeply hate it if my cognitive betters acted like they have greater moral worth than myself, and therefore, to be fair, I cannot deny equal moral worth to people of lower ability. Most people correctly believe that they aren't brilliant, but they're not so dull as to not arrive at this logic. There are some contingent factors that complicate the picture, but not fundamentally.</p>\n<blockquote>\n<p>the racist stereotyping does lead to black people being&nbsp;<a href=\"https://en.wikipedia.org/wiki/Welfare_queen#Impact_of_the_stereotype\">harmed both socially and economically</a>.&nbsp;<a href=\"https://en.wikipedia.org/wiki/Myth_of_meritocracy\">The myth of meritocracy</a>&nbsp;is strong, and people who are seen as unable to 'pull themselves up by their &nbsp;bootstraps' are looked down upon.</p>\n</blockquote>\n<p>Without getting into the weeds of stereotype scholarship, the extent of claimed harms, and the <a href=\"https://nationalpost.com/news/canada/minority-professor-denied-grants-because-he-hires-on-merit-people-are-afraid-to-think\">irrational denial</a> of the role of merit in achievement (reasoning in that wiki page doesn't even begin to address what would happen in a \"proper\" meritocratic society after a few generations, because it is premised on genes not contributing to achievement; this is a typical case of an unexamined anti-HBD prior leading to policy errors)... I'll just say that in my opinion both those issues, insofar as they harm anyone, have to do with beliefs about moral qualities. If \"Protestant ethic\" is alive and prescribes vilification of people of lower morally neutral ability, then that is a problem in its own right and beyond the scope of this conversation. Luckily, Protestant ethic also encourages treating people on a case by case basis.</p>\n<blockquote>\n<p>What global utility?</p>\n</blockquote>\n<p>Crucially, the search for interventions that actually close the IQ gap. As it stands, we have picked low-hanging fruit like lead exposure, malnutrition, iodine deficiency, parasites and such (in developed nations; I expect EA efforts in Africa to keep delivering on this front), and are left with pursuing dead ends of addressing iniquity like the \"food deserts\" nonsense, or doubling down on stuff like school spending, that has long ran into diminishing or zero returns and is only popular because to point out its inefficacy means to risk being labeled racist. <a href=\"https://www.tandfonline.com/doi/full/10.1080/09515089.2019.1697803\">As Nathan Cofnas argues,</a></p>\n<blockquote>\n<p>...But the reason that these programs, which Kourany rightly says ought to exist, have never been created is not because of racism but because of the taboo on talking about genetic differences among policy makers. No mainstream politician can acknowledge that there are differences that might call for the creation of a program to “work with the strengths and work on the weaknesses of every [ethnic] group to help make them the very best they can be.”&nbsp;<strong>It is hereditarians who have advocated these programs and environmentalists who have resisted them.</strong></p>\n</blockquote>\n<p>Ironically, <a href=\"https://thecritic.co.uk/my-debunked-views/\">Cofnas got in trouble for this</a>. If the suppression starts this far upstream from the object level, how can our priors be trusted?</p>\n<blockquote>\n<p>there are other correlations that are both on firmer ground, have more global utility and aren't fulfilling the desires of racists</p>\n</blockquote>\n<p>I sincerely doubt you can prove 1 or 2 (given that your critiques of relevant methodology weren't persuasive), and it looks like assigning any value to 3, on its own, is pure spite that is best left out of effective altruism. Making racists mad is not, in fact, a positive good, fun as it may be.</p>\n<blockquote>\n<p>If you had read my comments</p>\n</blockquote>\n<p>Have read some. I explicitly say I'm addressing the state of discourse here, more than just your comment. I respond to you in particular when I quote specific passages. Sorry if that was unclear.</p>\n<blockquote>\n<p>did support the environmental explantation of the IQ gap</p>\n</blockquote>\n<p>Again, this is not HBD Central, and it is sufficient to establish that there is legitimate uncertainty, so we cannot fall back on the comfortable prior that costs of repudiating HBD are negligible.</p>\n<blockquote>\n<p>Very civil. It will not surprise you to learn that this does not motivate me to keep reading.</p>\n</blockquote>\n<p>Well, I believe that misleading people, and even wasting people's time on true but irrelevant, misleadingly phrased, blatantly misinterpreting and patently false claims is a form of rudeness that's extra obnoxious, because it craftily avoids opprobrium one could earn with trivial show of disrespect. It's not fair to act indignant about an unflattering comparison after doing that. Even so, I've made peace with <a href=\"https://en.wikipedia.org/wiki/Brandolini's_law\">Brandolini's law</a>, and kept addressing those claims on the object level, to substantiate my \"very civil\" summary and so that \"EAs were to become a little more reserved on this topic, and at least stopped turning off potential recruits with irrefutable displays of irrationality.\" To be honest your reaction isn't wholly unexpected, but I did hope that I've been polite enough to merit some tolerance.</p>\n<blockquote>\n<p>Yeah I'm out.</p>\n</blockquote>\n<p>OK but please think of your stated desire is to persuade those who happen to believe in HBD to disbelieve it. Obviously you've failed in my case, but I maintain that flaming out like that is detrimental even as far as fence-sitters are concerned. I believe I've provided sufficient receipts for the purpose of showing how your list is inadequate.</p>\n<p>It is really not hard to showboat on this topic, by citing from very clearly argued stuff like <a href=\"https://cremieux.medium.com/resolute-ignorance-on-race-and-iq-courtesy-of-kevin-drum-d9cbf930f7db\">this</a> or \"authoritative\" sources like <a href=\"https://www1.udel.edu/educ/gottfredson/30years/Rushton-Jensen30years.pdf\">that review</a> or very technical <a href=\"https://www.mdpi.com/2624-8611/1/1/34\">recent papers</a> or just by gesturing in the general direction of environmentalist rhetoric that is... the way I've described, and evident in, e.g., <a href=\"https://www.tandfonline.com/doi/full/10.1080/09515089.2020.1805199\">this condemnation of Cofnas</a>, mired in (what I hope is obvious after my initial comment) logical fallacies and half-truths and raw indignation. Or one can just say that if <a href=\"https://emilkirkegaard.dk/en/2023/01/high-heritability-does-mean-that-social-interventions-likely-wont-work-well/\">this guy</a> is challenged not by rational and empirical arguments but by being repeatedly called a pseudoscientist and <a href=\"https://rationalwiki.org/wiki/Emil_O._W._Kirkegaard\">getting a page full of personal attacks</a> on him to the top of search results for his name (a page he responds to <a href=\"https://emilkirkegaard.dk/en/inaccuracies-in-rationalwikis-oliver-d-smiths-page-about-me/\">with an even pettier page</a>), then he may get a lot of uncomfortable stuff right.</p>\n<p>My point is not to showboat but to argue that people who pursue this anti-HBD rhetorical strategy, including you, are probably not succeeding, and are doing the community no favors.</p>\n", "parentCommentId": "vqrG4gaEhRFcASgmy", "user": {"username": "MissionCriticalBit"}}, {"_id": "TKxFGyRJFsvrpuTgD", "postedAt": "2023-01-16T14:38:27.389Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Why did you reply to <a href=\"https://forum.effectivealtruism.org/users/missioncriticalbit\">MissionCriticalBit</a> when it was I who made that claim? I almost didn't see it.<br>Also pointing out that the academics who study this stuff for a living don't believe in it is not fallacious, but rather a very useful piece of information.<br>Anyway, I wanted to give the HBDers another shot so I downloaded the survey (can we all agree that paywalls for publicly funded research is bullshit?) and I have two important things to note: genetic gaps is not equivalent to racial gaps, and the survey itself admits it is unrepresentative.<br>It was an internet survey:</p><blockquote><p>The EQCA was an online survey administered from May 2013 to March 2014.</p></blockquote><p>&nbsp;and had a high nonresponse rate:</p><blockquote><p>a total of 265 responses were received, which produced a response rate of 19.71%.&nbsp;</p></blockquote><p>with respondents who are different than the field as a whole:</p><blockquote><p>In the current study, the EQCA sample leaned slightly to the left (54%, Table 2). The left tilt of the EQCA sample was small compared to the left tilt observed for psychologists overall, who overwhelmingly identify as left-liberal (90% or higher, Duarte et al., 2015). [...] In addition, the EQCA sample was predominantly male (83%), far exceeding the male share of APA membership, which is mostly female (57%, APA Center for Workforce Studies, 2015).</p></blockquote><p>which heavily biases the results in favor of your position:</p><blockquote><p>In contrast, compared to female and left (liberal) experts, male and right (conservative) experts were more likely to endorse the validity of IQ testing (correlations with gender, politics: r = .55, .41), the g factor theory of intelligence (r = .18, .34), and the impact of genes on US Black-White differences (r = .50, .48).</p></blockquote><p>EDIT: To respond to missioncriticalbit below. My comment was about the sentence \"HBD is not generally accepted in academia\". The reason I can't show you a survey that shows you that is the same reason I can't show you a survey that zoologists don't believe in unicorns, they don't engage with it so there is no survey available (even the bad survey by anon rationalist is not about HBD). But I don't want to make an assertion without citing anything, so what is the best available option? How about an example of a professional biologists with no conflict of interests using publicly available data to create a well received paper that has been seen more than 12000 times that clearly rejects HBD.</p><p>Missioncriticalbit just makes assertions without citing anything. The reason I don't respond and refused to continue to read his reply is not because I am afraid, but because he hadn't cited anything, didn't engage with my writings and outright insulted me.</p><p>The reason I respond in an edit instead of a reply is because the HBDers have removed half a dozen of my latest comments from the frontpage while taking away a big chunk of my voting-power on this forum. I'm not inclined to give them another way to take away my voting-power, but I don't want to silence myself, so using the edit button is my workaround.</p>", "parentCommentId": "G9XPPktpYY7ui43TL", "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "69wHwJuP2XMwHTWQ7", "postedAt": "2023-01-16T19:04:10.993Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>First, that depends on what you mean by \"this stuff\"; Bird does not study intelligence nor behavioral genetics for a living, he's a plant geneticist. Skewed though the survey may be, it's probably more representative than a single non-expert.</p>\n<p>Second, why do you suppose the non-response rate is so high and so skewed? And might it have something in common with your own refusal to continue our conversation on merits of your list?</p>\n<p>I suspect that professionals who prefer not to respond, rather than respond in the negative about genetic contributions to the IQ gap, are driven by contradictory impulses: they believe that the evidence doesn't allow for a  confident \"100%  environmental\" response and, being scientists, have problem with outright  lying, but they also don't want to give the impression of supporting socially unapproved beliefs or \"validating\" the very inquiry into this topic. So they'd rather wash their hands of the whole issue, and allow their less squeamish colleagues to give the impression of moderate consensus in favor of genetic contribution.</p>\n", "parentCommentId": "TKxFGyRJFsvrpuTgD", "user": {"username": "MissionCriticalBit"}}, {"_id": "QdeyRxN5MwrEJYSkq", "postedAt": "2023-01-16T19:23:18.801Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>The most radical view of equality of this sort, is that for any being for whom what matters can to some extent matter to them, one ought to treat them equally with respect to it</p></blockquote><p>This feels to me like it is begging the question, so I am not sure I understand this principle. This framing leaves open the whole question of \"what determines how much capacity for things mattering to them someone has?\". Clearly we agree that different animals have different capacities here. Even if a fish managed so somehow communicate \"the only thing I want is fish food\", I am going to spend much less money on fulfilling that desire of theirs than I am going to spend on fulfilling an equivalent desire from another human.</p><p>Given that you didn't explain that difference, I don't currently understand how to apply this principle that you are talking about practically, since its definition seems to have a hole exactly the shape of the question you purported it would answer.</p>", "parentCommentId": "JthXsgvidx3ocJJTx", "user": {"username": "Habryka"}}, {"_id": "uDns2ewEvs4B6toe9", "postedAt": "2023-01-16T19:38:21.950Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Bentham’s view was that the ability to suffer means that we ought to give at least some moral weight to a being (their capacity to suffer determining how much weight they are given). Singer’s view, when he was a preference utilitarian, was that we should equally consider the comparable interests of all sentient beings. Every classical utilitarian will give equal weight to one unit of pleasure or one unit of suffering (taken on their own), regardless of the species, gender or race of the being experiencing the pleasure or suffering. This is a pretty mainstream view within EA.  If it means (as MacAskill suggests it might, in his latest book) that the total well-being of fish outweighs the total well-being of humanity, then this is not an objectionable conclusion (and to think otherwise would be speciesist, on this view).</p>\n", "parentCommentId": "pzYSBDmJwQYQcnniM", "user": {"username": "Vidur_Kapur"}}, {"_id": "bnAH6KKxKxC7WHqGy", "postedAt": "2023-01-16T19:58:26.308Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>That’s a good question, and is part of what Rethink Priorities are working on in their moral weight project! A hedonistic utilitarian would say that if fulfilment of the fish’s desire brings them greater pleasure (even after correcting for the intensity of pleasure perhaps generally being lower in fish) than the fulfilment of the human’s desire, then satisfying the fish’s desire should be prioritised. The key thing is that one unit of pleasure matters equally, regardless of the species of the being experiencing it.</p>\n", "parentCommentId": "QdeyRxN5MwrEJYSkq", "user": {"username": "Vidur_Kapur"}}, {"_id": "dJwHfnPvg6PaTzyHz", "postedAt": "2023-01-16T20:06:44.491Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Yeah, I think there are a bunch of different ways to answer this question, and active research on it, but I feel like the answer here does indeed depend on empirical details and there is no central guiding principle that we are confident in that gives us one specific answer.&nbsp;</p><p>Like, I think the correct defense is to just be straightforward and say \"look, I think different people are basically worth the same, since cognitive variance just isn't that high\". I just don't think there is a core principle of EA that would prevent someone from believing that people who have a substantially different cognitive makeup would also deserve less or more moral consideration (though the game-theory here also often makes it so that you should still trade with them in a way that evens stuff out, though it's not guaranteed).</p><p>I personally don't find hedonic utilitarianism very compelling (and I think this is true for a lot of EA), so am not super interested in valence-based approaches to answering this question, though I am still glad about the work &nbsp;Rethink is doing since I still think it helps me think about how to answer this question in-general.&nbsp;</p>", "parentCommentId": "bnAH6KKxKxC7WHqGy", "user": {"username": "Habryka"}}, {"_id": "BXztbyegbdJd3GG2D", "postedAt": "2023-01-16T20:24:31.257Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Agree that not all EAs are utilitarians (though a majority of EAs who answer community surveys do appear to be utilitarian). I was just describing why it is that people who (as you said in many of your comments) think some capacities (like the capacity to suffer) are morally relevant still, despite this, also describe themselves as philosophically committed to some form of impartiality. I think Amber’s comment also covers this nicely.</p>\n", "parentCommentId": "dJwHfnPvg6PaTzyHz", "user": {"username": "Vidur_Kapur"}}, {"_id": "x5fY3ZBAhJA5oiwNk", "postedAt": "2023-01-16T20:37:46.114Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Just to clarify, I am a utilitarian, approximately, just not a hedonic utilitarian.</p>", "parentCommentId": "BXztbyegbdJd3GG2D", "user": {"username": "Habryka"}}, {"_id": "qLqjwPupKR7ZjbbYd", "postedAt": "2023-01-17T15:25:22.549Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I don't want to engage with your arguments. I strongly think you're wrong, but it seems much less relevant to what I can contribute (or generally want to engage with) than the fact that you've posted that comment and people have upvoted it.</p><p>I don't understand how this can happen on the EA Forum. Why would anyone believing in this and wanting to do good promote this?</p><p>If anyone here does believe in ideas that have caused a great amount of harm and will cause more if spread, they should not spread them. If that's not the specific arguments that you think might be better and should be improved in such and such way but the views that you're arguing about, don't! If you want to do good, why would you ever, in our world, spread these views? If the impact of spreading these views is more tragedies happening, more suffering, and more people dying early, please consider these views an infohazard and don't even talk about them unless you're absolutely sure your views are not going to spread to people who'll become more intolerant- or more violent.</p><p>If you, as a rationalist, came up with a Basilisk that you thought actually works, thinking that it's the truth that it works should be a really strong reason <strong>not to post it or talk about it, ever</strong>.</p><p>The feeling of successfully persuading people (or even just engaging in interesting arguments), as good as it might be, isn't worth a single tragedy that will result from spreading this kind of ideas. Please think about the impact of your words. If people persuaded by what you say might do harm, don't.</p><p>One day, if the kindest of rationalists do solve alignment and enough time passes for humanity to become educated and caring, the AI will tell us what the truth is without a chance of it doing any harm. If you're right, you'll be able to say, \"I was right all along, and all these woke people were not, and my epistemology was awesome\". Before then, please, if anyone might believe you, don't tell them what you consider to be the truth.</p>", "parentCommentId": "wWrHYGnibCXA4xnah", "user": {"username": "Samin"}}, {"_id": "PhqEL64X8D6xhqshW", "postedAt": "2023-01-18T03:10:43.162Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote>\n<p>I strongly think you're wrong</p>\n</blockquote>\n<p>But can you be trusted to actually think that, given what you say about utility of public admission of opinions in question? For an external observer, it's a coin toss. And the same for the entirety of your reasoning. As an aside, I'd be terrified of a person who can willfully come to believe – or go through the motions of believing – what he or she believes to be morally prudent but epistemically wrong. Who knows  what else can get embedded in one's mind in this manner.</p>\n<blockquote>\n<p>I don't understand how this can happen on the EA Forum. Why would anyone believing in this and wanting to do good promote this?</p>\n</blockquote>\n<p>Well, consider that, as it tends to happen in debates, people on the other side  may be as perfectly sure about you being misguided and promoting harmful beliefs as you are about them; and that your proud obliviousness with regard to their rationale doesn't do your attempt at persuasion any more good than your unwillingness to debate the object level does.<br>\nConsider, further, that your entire model of this problem space really could be wrong and founded on entirely dishonest indoctrination, both about the scholarly object level and about social dynamics and relative effects  of different beliefs.<br>\nFinally, consider that some people just have a very strong aversion to the idea that a third party can have the moral and intellectual authority to tell them which thoughts are infohazards.  If nothing else, that could help you understand how this can happen.</p>\n<blockquote>\n<p>If you want to do good, why would you ever, in our world, spread these views?</p>\n</blockquote>\n<p>Personally – because I do, in fact, believe that you are profoundly wrong, that even historically these views did not contribute to much harm (despite much misinformation concocted by partisans: policies we know to be harmful are attributable to different systems of views); that, in general, any thesis about systematic relation in the pattern {views I don't like}=&gt;{atrocities} is highly suspect and should be scrutinized (e.g. with theists who attribute Stalin's brutality to atheism, or derive all of morality from their particular religion); and that my views offer a reliable way to reduce the amount of suffering humans are subjected to, in many ways from optimizing allocation of funds to  unlocking advances in medical and educational research to mitigating  slander and gaslighting heaped upon hundreds of millions of innocent people.</p>\n<p>Crucially, because I believe that, all that medium-term cost-benefit analysis aside, the process of maintaining views you assume are beneficial constitutes an X-risk (actually a family of different X-risks, in Bostrom's own classification), by comprehensively corrupting the institution of science and many other institutions. In other words: I think there is no plausible scenario where we achieve substantially more human flourishing in a hundred years – or ever – while deluding ourselves about the blank slate; that it's you who is infecting others with the \"Basilisk\" thought virus. And that, say, arguments about the terrible history of some tens of thousands of people whom Americans have tortured under the banner of eugenics – after abusing and murdering millions of people whilst being first ignorant, then in denial about natural selection – miss the point entirely, both the point of effective altruism and of rational debate.</p>\n<blockquote>\n<p>If the impact of spreading these views is more tragedies happening, more suffering, and more people dying early, please consider these views an infohazard and don't even talk about them unless you're absolutely sure your views are not going to spread to people who'll become more intolerant- or more violent.</p>\n</blockquote>\n<p>This is an impossible standard and you probably know it. Risks of a given strategy must be assessed in the context of the full universe of its alternatives; else the party that gets to cherrypick which risks are worth bringing up can insist on arbitrary measures. By the way, I could provide nontrivial evidence that your views have contributed to making a great number of people more intolerant and more violent, and have caused <em>thousands of excess deaths over the last three years</em>; but,  unlike your wholly hypothetical fearmongering, it's likely to get me banned.</p>\n<p>Indeed, I could ask in the same spirit: what makes people upvote <em>you</em>? If your logic of cherrypicking risks and demonizing comparative debate is sound, then why don't they just disregard GiveWell and donate all of their savings to the first local pet shelter that gets to pester them with heart-rending  imagery of suffering puppies? Maybe they like puppies to suffer?! This is not just manipulation: rising above such manipulation is the whole conceit of this movement, yet you commit it freely and to popular applause.</p>\n<p>To make me or anyone like me change my mind, strong and honest empirical and consequentialist arguments addressing these points are required. But that's exactly what you say is \"much less relevant\" than just demanding compliance. Well. I beg to differ.</p>\n<p>For my part, I do not particularly hope to persuade you or anyone here, and guidelines say we should strive to limit ourselves to explaining the issue. Honestly it's just interesting at this point, can you contemplate the idea of being wrong, not just about \"HBD\" but about its consequences, or are you the definition of a mindkilled fanatic who can't take a detached view at his own sermon and see that it's heavy on affirmation, light on evidence?</p>\n", "parentCommentId": "qLqjwPupKR7ZjbbYd", "user": {"username": "MissionCriticalBit"}}, {"_id": "4PB3jaxpHHuDy3jgo", "postedAt": "2023-01-19T02:06:18.751Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Thanks; what has Avraham done that makes him longtermist? Did he / does he identify as longtermist?</p>\n", "parentCommentId": "kkuvnF3hppyPNGMBe", "user": {"username": "orellanin"}}, {"_id": "wFF5dw4ScMBrtgLat", "postedAt": "2023-01-20T17:41:23.006Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Thanks for writing this up Amber — this is the sense that we intended in our statement and in the intro essay that it refers to (though I didn’t write the intro essay). We have edited the intro essay to make clearer that this is what we mean, and also to make clear that these principles are more like “core hypotheses, but subject to revision” than “set in stone”.</p>", "parentCommentId": "JcgRwkjnsFW5N8H9f", "user": {"username": "Shakeel Hashim"}}, {"_id": "Sjycz3RPbiuYWXKyE", "postedAt": "2023-01-20T17:42:01.687Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Sorry for the slow response.</p><p>I wanted to clarify and apologise for some things here (not all of these are criticisms you’ve specifically made, but this is the best place I can think of to respond to various criticisms that have been made):</p><ol><li>This statement was drafted and originally intended to be a short quote that we could send to journalists if asked for comment. On reflection, I think that posting something written for that purpose on the Forum was the wrong way to communicate with the community and a mistake. I&nbsp;<i>am</i> glad that we posted&nbsp;<i>something</i>, because I think that it’s important for community members to hear that CEA cares about inclusion, and (along with legitimate criticism like yours) I’ve heard from many community members who are glad we said something. But I wish that I had said something on the Forum with more precision and nuance, and will try to be better at this in future.</li><li>The first sentence was not meant to imply that we think that Bostrom disagrees with this view, but we can see why people would draw this implication. It’s included because we thought lots of people might get the&nbsp;<i>impression</i> from Bostrom’s email that EA is racist and I don’t want anyone — within or outside the community — to think that. Nevertheless this was sloppy, and is something that we should have caught when drafting it. Sorry.</li><li>We also intended the first sentence to have a meaning like&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email?commentId=JcgRwkjnsFW5N8H9f\"><u>Amber’s interpretation above</u></a>, rather than the interpretation you had, but we agree that this is unclear. We’ve just edited the intro essay to make clearer that this is what we mean, and also to make clear that these principles are mostly more like “core hypotheses, but subject to revision” than “set in stone”.</li><li>This statement was intended as a reaction to Bostrom’s&nbsp;<a href=\"https://extropians.weidai.com/extropians.96/0441.html\"><u>initial email</u></a> (CW that this link includes a racial slur). I agree that if we had linked to that email it would have been clearer, and at the time I posted it I didn’t even consider that this might be ambiguous. Sorry.</li></ol><p>More generally, we’re thinking about how we can improve our responses to situations like this in the future. I’m also planning to write up more about our overall approach to comms (TL;DR is that I agree with various concerns that have been raised about CEA and others in the community caring too much about PR concerns; I think truthfully saying what you believe — carefully and with compassion — is almost always more important than anything else), but it might be a little while before I get round to that.</p>", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "Shakeel Hashim"}}, {"_id": "SkezFfNYNHoLtDaNa", "postedAt": "2023-01-21T02:27:41.949Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I appreciate this</p>", "parentCommentId": "Sjycz3RPbiuYWXKyE", "user": {"username": "Holly_Elmore"}}, {"_id": "XJbjZEcedFLDjzGRG", "postedAt": "2023-01-21T18:59:57.542Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Differential response within the survey is again as bad.</p><p>The response rate for the survey as a whole was about 20% (265 of 1345), and below 8% (102) for every individual question on which data was published across three papers (on <a href=\"https://www.frontiersin.org/articles/10.3389/fpsyg.2016.00399/full\">international differences</a>, the <a href=\"https://www.sciencedirect.com/science/article/pii/S0191886916310984?ref=cra_js_challenge&amp;fr=RR-1\">Flynn effect</a>, and <a href=\"https://www.sciencedirect.com/science/article/pii/S0160289619301886\">controversial issues</a>).</p><p>Respondents attributed the heritability of U.S. black-white differences in IQ 47% on average to genetic factors. On similar questions about cross-national differences, respondents on average attributed 20% of cognitive differences to genes. On the U.S. question, there were 86 responses, and on the others, there were between 46 and 64 responses.</p><p>Steve Sailer's blog was rated highest for accuracy in reporting on intelligence research—by far, not even in the ballpark of sources that got more ratings (those sources being exactly every mainstream English-language publication that was asked about). It was rated by 26 respondents.</p><p>The underlying data isn't available, but this is all consistent with the (known) existence of a contingent of ISIR conference attendees who are likely to follow Sailer's blog and share strong, idiosyncratic views on specifically U.S. racial differences in intelligence. The survey is not a credible indicator of expert consensus.</p><p>(More cynically, this contingent has a history of going to lengths to make their work appear more mainstream than it is. Overrepresenting them was a predictable outcome of distributing this survey. <a href=\"https://en.wikipedia.org/wiki/Heiner_Rindermann\">Heiner Rindermann</a>, the first author on these papers, can hardly have failed to consider that. Of course, what you make of that may hinge on how legitimate you think their work is to begin with. Presumably they would argue that the mainstream goes to lengths to make their work seem fringe.)</p>", "parentCommentId": "TKxFGyRJFsvrpuTgD", "user": {"username": "Muireall"}}, {"_id": "b6s66K2xGds59XM6L", "postedAt": "2023-01-22T05:44:27.942Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<blockquote><p>I agree with various concerns that have been raised about CEA and others in the community caring too much about PR concerns; I think truthfully saying what you believe — carefully and with compassion — is almost always more important than anything else</p></blockquote><p>CEA's current media policy forbids employees from commenting on controversial issues without permission from leaders (including you). Does the view you express here mean you disagree with this policy? At present it seems that you have had the right to shoot from the hip with your personal opinions but ordinary CEA employees do not.</p>", "parentCommentId": "Sjycz3RPbiuYWXKyE", "user": {"username": "DevUlf"}}, {"_id": "PfRi89s2ACErBCyoB", "postedAt": "2023-01-30T22:10:52.764Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>EMs?</p>", "parentCommentId": "Q3zuoyoSdgZghDBXF", "user": {"username": "Rocket"}}, {"_id": "s9SNSa3xdQAaB9sTZ", "postedAt": "2023-01-30T22:30:37.557Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>Another statement that \"<a href=\"https://www.givingwhatwecan.org/blog/four-things-you-already-agree-with-effective-altruism?utm_source=The+EA+Newsletter&amp;utm_campaign=6fabdd6dc9-EMAIL_CAMPAIGN_2022_12_19_07_01&amp;utm_medium=email&amp;utm_term=0_51c1df13ac-b079fb81fd-%5BLIST_EMAIL_ID%5D\">people are equal</a>\" from GWWC.</p>", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "Rocket"}}, {"_id": "cJtCL3biwzvYtkZ5z", "postedAt": "2023-01-30T23:27:06.847Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p><a href=\"https://ageofem.com/\">Brain Emulations</a> - basically taking a person and running a simulation of them on a computer, where they could potentially be copied, run faster or slower, etc.</p>", "parentCommentId": "PfRi89s2ACErBCyoB", "user": {"username": "Larks"}}, {"_id": "NuKCvRDmvDo3C62AA", "postedAt": "2023-02-01T05:20:20.933Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>\"Emulated Minds\" aka \"Mind uploads\".</p>", "parentCommentId": "PfRi89s2ACErBCyoB", "user": {"username": "Habryka"}}, {"_id": "8F4ZdCfJjpY9KL4XE", "postedAt": "2023-03-15T09:48:58.731Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": "<p>I would also like to add to the other comments that <a href=\"https://forum.effectivealtruism.org/handbook\">EA Intro Fellowship</a> has included a book section titled \"All Animals Are Equal\" for quite some time.</p>", "parentCommentId": "vYbburTEchHZv7mn4", "user": {"username": "emre kaplan"}}, {"_id": "aukYrWrxxe5xJQnBt", "postedAt": "2023-01-14T15:52:07.855Z", "postId": "ALzE9JixLLEexTKSq", "htmlBody": null, "parentCommentId": "fHz2ovHPS6xrAAuTe", "user": null}]