[{"_id": "LgiHzP6LzdBpdChgP", "postedAt": "2024-01-18T21:22:06.680Z", "postId": "Am5qjkx6YMwmqfnJW", "htmlBody": "<p>Hi Abbey,</p><p>I think you are going to have a very hard time convincing EAs that this should be a core, or even peripheral, EA cause area.&nbsp;</p><p>In your previous piece, you cite Matt Desmond's estimate that 5.4 million Americans live in extreme poverty. I think this is probably an overestimate, but taking it at face value, that's less than 1% of all the people who <a href=\"https://www.worldbank.org/en/topic/poverty/overview\">live in extreme poverty globally</a>. Accordingly, if global poverty is your top priority, the <a href=\"https://80000hours.org/2020/08/misconceptions-effective-altruism/\">impartial altruism principle</a> implies that the extreme poor in America &nbsp;should receive less than 1% of the attention you devote to it. Exceeding that 1% attention budget is going to be a very high burden of proof to meet, given our strong shared commitments to on-the-margin thinking (there are many, many social programs and organizations devoted to the welfare of the poor in America) and impartiality.&nbsp;</p><p>On a different note; if you want to work on reducing poverty in America, what's to be gained by applying an EA label to it or convincing others to do so? My 2c: it's perfectly well and good to work on causes that motivate you and where your work is plausibly +EV, labels be damned.</p>", "parentCommentId": null, "user": {"username": "setgree"}}, {"_id": "3pFckHzZsy3cEPcCs", "postedAt": "2024-01-18T23:19:29.838Z", "postId": "Am5qjkx6YMwmqfnJW", "htmlBody": "<p>Hey Seth, thanks for your thoughts! I agree it's pretty uncommon as an area of excitement for EAs, and I think it's because people have the (correct) intuition that interventions are much more expensive in the US. What I wanted to point out was that the problem can be framed differently, and that the broad EA intuition might be wrong here.</p><p>I'm not sure I agree with the attention budgeting point. Givewell and OpenPhil seem to look at funding interventions on the margin (eg, what is the return for this particular intervention) and plenty of those interventions are quite small-scale, so I think these interventions are in line with others they research. Indeed, Givewell's interest in <a href=\"https://blog.givewell.org/2018/03/22/considering-policy-advocacy-organizations-givewell-made-grant-centre-pesticide-suicide-prevention/\">Policy advocacy</a> in developing nations suggests an interest in developing this muscle. Holden Karnofsky has taken US Policy intervention seriously enough to <a href=\"https://www.openphilanthropy.org/research/the-role-of-philanthropic-funding-in-politics/\">deeply research the topic</a>, and make incarceration in America (1M people) a cause area for OpenPhil. From what I've seen, he focused more on preventative health interventions more than poverty interventions in his research.</p><p>I think this topic is overlooked in the community, and I wanted to draw some attention to it. I'd like to find a way to donate to cost-effective charities for reducing poverty in America, and part of my goal in writing this post was to research and develop some ideas about what those might be.</p><p>I think a fair amount of EAs also feel compelled to donate locally, but they designate those donations as \"fuzzies.\" I don't think this has to be the case, and it would be great if more local donations went to truly cost-effective initiatives.</p><p>Anyway thanks for your thoughts, I appreciate you pointing out the relative scale and agree that poverty outside the US is much larger! I also care deeply about global health outside of the US and currently donate there.</p>", "parentCommentId": "LgiHzP6LzdBpdChgP", "user": {"username": "Abbey Chaver"}}, {"_id": "3DorSoHRkLn8khZ7q", "postedAt": "2024-01-19T05:15:31.672Z", "postId": "Am5qjkx6YMwmqfnJW", "htmlBody": "<p>I would try to improve the political system which is upstream of the dysfunctional politics which is upstream of bad policy that leads to needless policy in the US. I think you'll get better ROI be cause the dividends will affect so many other areas EAs care about.</p>\n", "parentCommentId": null, "user": {"username": "Yelnats T.J."}}, {"_id": "7fNE3iygjiAuqTxFt", "postedAt": "2024-01-19T14:04:01.757Z", "postId": "Am5qjkx6YMwmqfnJW", "htmlBody": "<p><strong>Executive summary</strong>: The post makes the case for EA investment in US policy interventions to alleviate poverty as a highly cost-effective way to improve health, then lays out a framework to assess tractability, neglectedness, and other considerations in determining priority.</p><p><strong>Key points</strong>:</p><ol><li>Impact can be evaluated similarly to global health interventions using cost-effectiveness. There is also an argument for partiality towards one's own country.</li><li>Tractability depends on cost, popular opposition, and moneyed opposition. Implementation tractability is generally high if legislation passes.</li><li>Neglectedness varies - some issues need critical momentum to pass legislation. Highly opposed issues are riskier despite neglectedness.</li><li>Pros include sense of responsibility for poor Americans and being a well-funded, coordinated group that could influence legislators.</li><li>Cons include economic uncertainty, low policy success rates, and increased perception of EA having too much power.</li><li>This cause aligns with recent EA government work and could help build US popularity. Existing research expertise also helps guide policy.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]