[{"_id": "CXhtetQy3uykzTBRH", "postedAt": "2022-12-28T19:04:27.192Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I'd love for EA Global events to become more conducive to small group conversations. Right now they feel heavily focused on 1:1s. I'd love for it to be easier to book a conversation or find a place to sit with 2-4 people I have a common interest with.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "xpdCNZ8GyeWteD8zT", "postedAt": "2022-12-28T19:17:25.642Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>A related problem I've experienced is that it's hard for a 2-person conversation to spontaneously grow, because of the problem of &nbsp;\"I want to go up and say hi, but what if I'm interrupting a booked 1:1?\"</p>", "parentCommentId": "CXhtetQy3uykzTBRH", "user": {"username": "David Mears"}}, {"_id": "cR2EDKDFMA9o9kiJk", "postedAt": "2022-12-28T19:49:30.562Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>One thing I'd love to collect — people's favorite resources on how to get the most out of EA Global and other (EA) conferences. The <a href=\"https://forum.effectivealtruism.org/topics/effective-altruism-global\">topic page for EA Global</a> (and the one for <a href=\"https://forum.effectivealtruism.org/topics/conferences\">conferences</a>) already does this a bit, but I'm wondering if people have favorite resources to share or use.&nbsp;</p><p>Off the top of my head (and looking through the topic pages), here are some of my favorites:&nbsp;</p><ol><li>&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/sxKJckCiZQyux4kCx/ea-global-tips-networking-with-others-in-mind\">EA Global Tips: Networking with others in mind</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/EkwyP3JhC6bxbixtJ/ea-global-meetings-can-be-short\">EA Global meetings can be short </a>:)</li><li><a href=\"https://forum.effectivealtruism.org/posts/5hKDjrGocGcreH3DC/how-to-get-the-maximum-value-out-of-effective-altruism\">How to Get the Maximum Value Out of Effective Altruism Conferences</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/Z7xaEWvjZA3HEqceE/how-to-find-good-1-1-conversations-at-eagx-virtual\">How to find good 1-1 conversations at EAGx Virtual</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/4QAhzGoZv9ndCCr9y/the-ultimate-guide-to-ea-conferences-repost\">The Ultimate Guide to EA Conferences</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/3kFWJLy7uBYgeQ4xs/advice-for-getting-the-most-out-of-one-on-ones\">Advice for getting the most out of one-on-ones</a></li></ol>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "ShZkbDv3BBGWodwzT", "postedAt": "2022-12-28T19:54:58.867Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Plus one to this! It would be great to eg have a designated \"no planned 1-1s here\" area where it is socially acceptable to just approach people</p>\n", "parentCommentId": "xpdCNZ8GyeWteD8zT", "user": {"username": "Neel Nanda"}}, {"_id": "NkPGyABbojtNwZnmS", "postedAt": "2022-12-28T20:41:52.248Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>There have been a few discussions recently around how to make EA a more welcoming and safer place for women. Some of these involve discussions around the appropriateness of nonprofessional <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=QKXQsQvEqTq5i4vxH#comments\">motivations</a> for swapcard / 1-1s (e.g. using swapcard to solicit romantic relationships, hitting on people at EAGs). The following includes suggestions from discussions with people interested in making EAGs a better space for women.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefxsnw8cc8nih\"><sup><a href=\"#fnxsnw8cc8nih\">[1]</a></sup></span></p><p><strong>Request:</strong></p><p><strong>Can we make it very explicit and unambiguous what the EAG + EAGx's event policies are? </strong>(apologies if this is already listed somewhere).<br><br><strong>Some other possible suggestions:</strong><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefn7azirievyb\"><sup><a href=\"#fnn7azirievyb\">[2]</a></sup></span></p><ul><li>Explicit policy, transparent criteria or examples of what would constitute a breach, and clear potential consequences of various severity of actions are made available up front.&nbsp;</li><li>A acknowledgement of these policies + consequences as a pre-requisite for attendance (e.g. a \"I acknowledge and agree to follow CEA's event policies\" checkbox during application form)</li><li>An (optionally anonymous) place to submit complaints, including for immediate action if needed<ul><li>The process should ideally allows those accused (if not anonymous) to present their perspective, though this might be deanonymising for the complainant, so this should be discussed with them.</li></ul></li><li>Updates to complainants within a pre-specified timeframe</li><li>End of conference survey that explicitly asks about things like behaviour that makes people feel subjectively unwelcome, or experiences that make people think they were being solicited for a nonprofessional purpose. These can be stratified by gender, cause area, age, and experience within EA or number of EAG attendances for both complainants as well as potential perpetrators.</li><li>&nbsp;Summary statistics, as well as anonymised log of complaints and actions taken, are anonymised and published.</li></ul><p><br>Less directly relevant / more tentative but may interact with the above:</p><p>-Clear alcohol policy during EAGs</p><p>-An official (but clearly non-endorsed) compilation of post-EAG socials that are open-invite. This serves the less professional + more social functions of EAGs for those who feel like this is an important element of EAG, and makes it easier for newcomers who wish to attend to know what might be happening instead of ad-hoc facebook groups / word of mouth / getting links to google docs from friends, while making it feel less exclusive. (Unsure about the value of this, though some previous EAGs have had slack channels within the official slack that served this purpose)</p><p>-Surveying attendees for what norms they'd prefer at EAGs (though this may be subject to selection bias)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnxsnw8cc8nih\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefxsnw8cc8nih\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Anecdotally this is a very important point of feedback for a subset of attendees, including on whether they feel like EA is the right community for them. Separately, I do think this is a low hanging fruit for the EA community (more tractable than trying to coordinate community group norms), as well as a very important place for the EA as a collective to walk the talk, as a community who supposedly unites under a shared goal of doing good better.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnn7azirievyb\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefn7azirievyb\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Apologies, haven't put much thought into how much of the following would be actually good in practice, or looked into how much of this already exists. This is a list that covers some areas I think seem important on first principles (clear + transparent processes, accountability, and data collection to allow better decision making in future), and not based on research into existing best practices.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "bruce"}}, {"_id": "pDwfGHZJ7gQ3mJHuK", "postedAt": "2022-12-28T21:29:27.871Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>A note regarding this:</p><p>In Swapcard, the app used for EAG(x) events, it is possible to schedule meeting times with more than one person (up to eight, using the same method as scheduling a 1-on-1). &nbsp;I would really like to see this feature used more regularly, but I suspect few know it exists.&nbsp;</p>", "parentCommentId": "CXhtetQy3uykzTBRH", "user": {"username": "MxLucchese"}}, {"_id": "dbFLLAdRBfgJxWuEG", "postedAt": "2022-12-29T00:34:36.324Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>My most productive conversations at EAG were small group conversations like you describe, not 1-1s and talks.</p>\n", "parentCommentId": "CXhtetQy3uykzTBRH", "user": {"username": "freedomandutility"}}, {"_id": "SL6wGJXLX9q38GQLE", "postedAt": "2022-12-29T00:36:13.111Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Would love a badge or something that people can put on that says “come talk to me” to indicate that they aren’t currently in a 1-1 / waiting for a 1-1</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "FKGnsSAMW9fvFHaDg", "postedAt": "2022-12-29T08:47:15.064Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Could be time as well: EAGx Prague had dedicated time where it was not possible to book 1:1s on SwapCard, and I think it worked well.</p>", "parentCommentId": "ShZkbDv3BBGWodwzT", "user": {"username": "Jan_Kulveit"}}, {"_id": "8hAvpwm4vxNeufWEW", "postedAt": "2022-12-29T10:22:01.118Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Hmm, that feels much more annoying to me - I personally think 1-1s tend to be a much better use of conference time, and being restricted from scheduling them at certain times in the app sounds irritating (and the kind of thing that gets me to bail on Swapcard and use Calendly). For me a space is good, because if someone no shows, or I have a break and want low-intensity chat, I can go there.</p>\n", "parentCommentId": "FKGnsSAMW9fvFHaDg", "user": {"username": "Neel Nanda"}}, {"_id": "MefPKX7wa7qJPA6kc", "postedAt": "2022-12-29T10:22:58.601Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Huh, I'm curious what people use this for? To me, scheduling a 1-1 is enough of a coordination problem, scheduling it for many more feels like a big headache (at least, if the people have packed schedules)</p>\n", "parentCommentId": "pDwfGHZJ7gQ3mJHuK", "user": {"username": "Neel Nanda"}}, {"_id": "fnmYtJ6ovpYhe3AFb", "postedAt": "2022-12-29T13:39:03.524Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I like this idea!</p>", "parentCommentId": "ShZkbDv3BBGWodwzT", "user": {"username": "Shakeel Hashim"}}, {"_id": "QNk8QYLzkX6DtxZxH", "postedAt": "2022-12-30T02:41:52.993Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Is it possible to include title and organization on name badges (ideally, this would be optional)?</p>\n", "parentCommentId": null, "user": {"username": "Kyle Lucchese"}}, {"_id": "zpWZCwhonKtutwLxu", "postedAt": "2022-12-30T15:44:11.819Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I feel like there is a lot of content about getting the most out of an EAG on the forum, but not that much on who should go (again). I understand that this is going to depend a lot on personal circumstances, but I am wondering whether there are any guidelines / tips on who should apply to EAGs? And how many EAGs are too many? &nbsp;</p><p>I have never gone to an EAG and felt I wasted my time, and have always come back with new valuable connections, but obviously going to all EAGs is too much, and you are taking away a spot from someone else who might need it more. Deciding where to draw the line is something I am struggling with a bit.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ThomasFowl"}}, {"_id": "esTCPcJCSL77N2r3i", "postedAt": "2023-01-04T14:16:31.788Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I would love this too!</p><p>We've been experimenting with a few things here, and the solution I'm most optimistic about is spaces marked \"no 1-1 meetings\". Some of these spaces are also for spontaneous/casual conversations too, but that's often where group conversations happen.</p><p>This worked particularly well at EAGxRotterdam - the space was right next to the food. stations, it was well-lit and had comfy sofas. It was almost always full! I think EAG DC did this too.</p><p>I believe Swapcard are rolling out a feature to book group meetings, but I haven't tested it out or seen it used much yet.</p>", "parentCommentId": "CXhtetQy3uykzTBRH", "user": {"username": "OllieBase"}}, {"_id": "wAsfx88qPm6weFpok", "postedAt": "2023-01-04T14:17:46.762Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>We had these at EAG SF, EAGxBerlin, EAG DC and EAGxRotterdam :) I think they often aren't obvious enough, so you'd be forgiven for missing them. It was obvious and very popular at EAGxRotterdam :)&nbsp;</p>", "parentCommentId": "ShZkbDv3BBGWodwzT", "user": {"username": "OllieBase"}}, {"_id": "KgEqK9BA2CTnuoHid", "postedAt": "2023-01-04T14:25:16.832Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Thanks for this suggestion! &nbsp;See my above comment about areas specifically designed for spontaneous conversation. My sense is a designated space is a bit more obvious and less fiddly than a badge you take on and off.</p>", "parentCommentId": "SL6wGJXLX9q38GQLE", "user": {"username": "OllieBase"}}, {"_id": "ncNajH3dywvsWnmcC", "postedAt": "2023-01-04T14:29:19.875Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Thanks for this suggestion! We want to keep a high bar for adding further questions to the application form, but it seems cheap to test this out. I'll flag this idea to the admissions team.</p>", "parentCommentId": "QNk8QYLzkX6DtxZxH", "user": {"username": "OllieBase"}}, {"_id": "YqPzsHuw7nikkFysR", "postedAt": "2023-01-04T16:14:42.169Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I was at EAG SF and didn't notice!</p>\n", "parentCommentId": "wAsfx88qPm6weFpok", "user": {"username": "Neel Nanda"}}, {"_id": "DuWzdknjB6G6K6ZDz", "postedAt": "2023-01-04T18:57:43.208Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Yep that sounds better!</p>\n", "parentCommentId": "KgEqK9BA2CTnuoHid", "user": {"username": "freedomandutility"}}, {"_id": "xPkkcDpFkQyfofv4i", "postedAt": "2023-01-04T19:44:58.222Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I agree that this is really important. When I started working at CEA in 2015, one of the main things my predecessor had been working on was developing anti-harassment practices for CEA’s conferences, and I continued her work. The conference materials from&nbsp;<a href=\"https://geekfeminism.fandom.com/wiki/Conference_anti-harassment/Policy\"><u>Geek Feminism</u></a> were helpful to us in developing our practices.&nbsp;</p><p>The place where all EAG and EAGx attendees agree to the standards is the code of conduct, which must be acknowledged when registering for an event. The text on the registration form for the upcoming EAG Bay Area is:<br><br><i>At EA Global and social events associated with EA Global, you agree to:</i></p><ul><li><i>Respect the boundaries of other participants.</i></li><li><i>Look out for one another and try to help if you can.</i></li><li><i>Adhere to national and local health and safety regulations, as well as any additional policies we institute for EA Global.</i></li></ul><p><i>This is a professional learning and networking event. These behaviors don't belong at EA Global or related events:</i></p><ul><li><i>Unwanted sexual attention, or sexual harassment of any kind.</i></li><li><i>Using the event app to request meetings for romantic or sexual reasons.</i></li><li><i>Offensive, disruptive, or discriminatory actions or communication.</i></li></ul><p><i>We understand that human interaction is complex. If you feel able, please give each other the benefit of explaining behavior you find unwelcome or offensive.&nbsp;</i></p><p><i>If you’re asked to stop a behavior that’s causing a problem for someone, we expect you to stop immediately.</i></p><p><i>By submitting this form, you confirm that you will adhere to this Code of Conduct, which applies at the conference and all related social events.</i></p><p><i>You can contact us at hello@eaglobal.org if you have any questions.</i></p><p>This text wasn’t on our website, but we’ve added it to&nbsp;<a href=\"https://www.effectivealtruism.org/ea-global/faq\"><u>our FAQ page</u></a> now. Thanks for suggesting this! It’s also referenced in the attendee guides, for example this text from the EAG DC guide: “Harassment, bullying, or unwanted romantic/sexual attention is unacceptable at our events, and we encourage you to report any of this behavior to us.”<br><br>All our conferences have at least one community contact person, whose role is to be available for personal or interpersonal problems that come up. When a problem is raised during a conference, they’re there to deal with it as soon as possible. Sometimes attendees contact us after an event with something they’ve been mulling over.</p><p>I’ve often been one of the contact people. My sense is that pre-specified criteria for what constitutes something like “offensive actions” or “unwanted sexual attention” and what the response should be isn’t realistic or a good idea. A lot of factors play into what constitutes a problem&nbsp;— words, body language, setting (the career fair vs. an afterparty vs. a deserted street outside the venue at night), power and status differences between the people, etc. Responses should be shaped by the wishes of the person who experienced the problem&nbsp;— people have different preferences about how much action they want us to take, whether they want us to act immediately or give them time to think over the options, etc.<br><br>Besides the community contact people at events, attendees can also report problems anonymously on the event survey, or on the community health team’s anonymous&nbsp;<a href=\"https://docs.google.com/forms/d/e/1FAIpQLScJooJD0Sm2csCYgd0Is6FkpyQa3ket8IIcFzd_FcTRU7avRg/viewform\"><u>contact form</u></a>.</p>", "parentCommentId": "NkPGyABbojtNwZnmS", "user": {"username": "Julia_Wise"}}, {"_id": "6ZGDtqX7FqPSTySpT", "postedAt": "2023-01-04T21:55:00.921Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Thanks for the response and clarification!</p><blockquote><p>My sense is that pre-specified criteria for what constitutes something like “offensive actions” or “unwanted sexual attention” and what the response should be isn’t realistic or a good idea. A lot of factors play into what constitutes a problem&nbsp;— words, body language, setting (the career fair vs. an afterparty vs. a deserted street outside the venue at night), power and status differences between the people, etc.</p></blockquote><p>This makes sense to me + and I agree RE: other factors that can change whether something is a problem or not. I think I was too certain in my wording of the original bullet point, and can see where it could be harmful if applied too broadly. I guess my prior here is that most people are not intentionally wanting to cause harm, but do so because of different expectations or communication norms or social abilities. If true, I wonder whether some clear examples that are generally seen to be controversially unwanted by those on the receiving end can help reduce the frequency of harmful actions - it might be helpful in getting folks on the same page in terms of what a lower bound for acceptable behaviour in this context looks like.</p><p>For example, someone might not consider an particular action \"sexual harassment\", but 80% of women on the receiving end might find it uncomfortable and would prefer it if it didn't happen. In some of these cases it's probably valuable for there to be a norm that such actions just shouldn't happen. Agreeing to the text as stated doesn't do much to reduce these \"misunderstandings\". Giving some examples (while being clear that you can report incidents that don't fit these examples) also mean that if someone then does [inappropriate action], that folks don't really have the excuse of \"sorry I didn't think this was inappropriate\" / \"didn't consider this sexual harassment, it was just a harmless joke\". It also has fairly little downside risk, because if there was some hyper-specific context where it was seen to be appropriate by the receiving party even if it fit an example given, they just simply won't report it. I'm uncertain about this though, since I don't have a clear sense of what the distribution of harm and cases look like.</p><blockquote><p>Responses should be shaped by the wishes of the person who experienced the problem&nbsp;— people have different preferences about how much action they want us to take, whether they want us to act immediately or give them time to think over the options, etc.</p></blockquote><p>Yeah, totally agree with this, hence \"potential\" action, though I think I wasn't clear enough here.</p><p>I am interested in your thoughts whether data collection at EAGs have been effective or useful for capturing these kinds of incidents, how the community health team has responded, whether any of this is share-able in a deanonymised way? Also, does the community health team expect to continue sharing summaries similar to what you published in this <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in#Appendix__12_months_of_cases\">appendix</a> going forwards? I found this quite useful personally in getting a sense of how the community health team operates and think it's somewhat useful for trust-building and accountability.&nbsp;</p>", "parentCommentId": "xPkkcDpFkQyfofv4i", "user": {"username": "bruce"}}, {"_id": "msxLerk7bL6rsSiXy", "postedAt": "2023-01-04T22:00:05.296Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Here's <a href=\"https://forum.effectivealtruism.org/posts/mtBwjfygyAudDakyC/shortform?commentId=SHmT8tAkCMETeiDhQ\">mine</a></p>", "parentCommentId": "cR2EDKDFMA9o9kiJk", "user": {"username": "hibukki"}}, {"_id": "qgpPKfmzbBwPCGnRX", "postedAt": "2023-01-05T16:20:33.580Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I agree it depends a lot on personal circumstances but also on people's goals. People who work on community-building or in roles where networking is a core part of their work (e.g. recruiting) might benefit from attending several events a year. Those who e.g. work on independent research, might only go to one a year. This is why we don't make a public recommendation.</p><p>We can see how many events people have been to so, if you want to attend an event, please apply and we can make the call as to whether we want to reserve the spot for someone who hasn't been to one before.</p>", "parentCommentId": "zpWZCwhonKtutwLxu", "user": {"username": "OllieBase"}}, {"_id": "xbGGPHukh5h9xKdWD", "postedAt": "2023-01-05T18:36:58.227Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Thank you for answering! It is reassuring to know that previous attendance is taken into account.</p>", "parentCommentId": "qgpPKfmzbBwPCGnRX", "user": {"username": "ThomasFowl"}}, {"_id": "abbPXFr2JKYD3QppL", "postedAt": "2023-01-30T12:33:12.659Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Related to some recent posts about <a href=\"https://forum.effectivealtruism.org/posts/tZbMtxQk42teAFBYs/native-english-speaker-eas-could-you-please-speak-slower\">linguistic inclusion</a> ― allow people to indicate on Swapcard if they're open to having 1:1s in non-English languages?</p>\n", "parentCommentId": null, "user": {"username": "tessa"}}, {"_id": "L9iyduNsWYLCemo7R", "postedAt": "2023-02-02T21:43:22.836Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<blockquote>\n<p>I am interested in your thoughts whether data collection at EAGs have been effective or useful for capturing these kinds of incidents, how the community health team has responded, whether any of this is share-able in a deanonymised way?</p>\n</blockquote>\n<p>Learning about what kind of problems people have experienced has led us to changes like asking attendees not to use Swapcard for dating purposes.</p>\n<blockquote>\n<p>does the community health team expect to continue sharing summaries similar to what you published in this&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in#Appendix__12_months_of_cases\">appendix</a> going forwards? I found this quite useful personally in getting a sense of how the community health team operates and think it's somewhat useful for trust-building and accountability.</p>\n</blockquote>\n<p>I’m glad you found it useful! Getting the right level of anonymity with that list was tricky, so I could imagine doing it at some interval but not every year.</p>\n", "parentCommentId": "6ZGDtqX7FqPSTySpT", "user": {"username": "Julia_Wise"}}, {"_id": "JqFC64atyHrsfwDnS", "postedAt": "2023-02-02T23:49:25.129Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>One thing that sort of did this for me at EAGxBerlin, which I wonder if we could have some kind of infrastructure for, was hosting \"unofficial office hours\" where I put my name on a piece of paper and sat in a specific place for two hours, and talked with people who came past. (I was also able to tell people &nbsp;in Swapcard that we could talk during that time as well as or instead of in a 1:1.)<br><br>I could imagine unconference-y or \"host your own conversation table\" infrastructure for this as well (instead of or in addition to \"unoffical office hours with X\").</p>", "parentCommentId": "CXhtetQy3uykzTBRH", "user": {"username": "tessa"}}, {"_id": "dBnKoMwBLxtD9jbcz", "postedAt": "2023-02-03T00:19:35.685Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Making it impossible to book 1:1s sounds annoying, but since a lot of people like to schedule a break from 1:1s for themselves and would enjoy hanging out with other people during that gap, a somewhat arbitrary \"Schelling break time\" could help them coordinate.</p>", "parentCommentId": "8hAvpwm4vxNeufWEW", "user": {"username": "ModusTrollens"}}, {"_id": "KJmPBM38Jdadz98dG", "postedAt": "2023-02-03T00:20:44.803Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>They had this at EAGx Rotterdam and it was very nice. The area was marked off with a sign and you could walk around there joining conversations when you weren't in a meeting.</p>", "parentCommentId": "ShZkbDv3BBGWodwzT", "user": {"username": "ModusTrollens"}}, {"_id": "nF3jLTdcJuCrTGNgJ", "postedAt": "2023-02-03T00:22:35.196Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>I've used this feature exactly once, to meet a group of friends who were all in DC last summer but spread out afterward. Swapcard also has a group chat feature, where we actually coordinated the timing. Scheduling the group meeting on Swapcard was just to book the time so that other attendees wouldn't try to book meetings with us then.</p>", "parentCommentId": "MefPKX7wa7qJPA6kc", "user": {"username": "ModusTrollens"}}, {"_id": "5PqgZHGGnD7ek3AGr", "postedAt": "2023-02-03T04:09:52.999Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Maybe put whiteboards in meeting areas so people can write e.g. \"Small group discussion - Wild animal welfare. Feel free to join!\" on the board and other people can see it and just join.</p>", "parentCommentId": "CXhtetQy3uykzTBRH", "user": {"username": "evelynciara"}}, {"_id": "ETPC5BcWxYpqSkBCc", "postedAt": "2023-02-14T04:20:08.647Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Will preferred names be used on badges and Swapcard? The registration form is a bit confusing as it doesn't display the user's preferred name, so while using the form it's not apparent which name will be used (though I remember this being stated on the application form).</p>", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "BZLfmpzGEvXd5rfeL", "postedAt": "2023-02-14T16:17:35.770Z", "postId": "AmfKu3xB2yGA8z9aZ", "htmlBody": "<p>Name badges should have preferred names yes — this is the first time we're doing preferred names so if there are any technical issues you'll be able to pick up a blank badge at the event itself and write whatever name you like on it.&nbsp;</p><p>Preferred names won't go onto Swapcard by default but we're looking into a way to make this happen (but anyone can change their own name on Swapcard if they like).</p>", "parentCommentId": "ETPC5BcWxYpqSkBCc", "user": {"username": "Eli_Nathan"}}]