[{"_id": "ipsvfhASv4ovWDEio", "postedAt": "2024-01-26T09:53:15.566Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>To me this post ignores the elephant in the room: OpenPhil still has billions of dollars left and is trying to make funding decisions relative to where they think their last dollar is. I'd be pretty surprised if having the Wytham money liquid rather than illiquid (or even having £15mn out of nowhere!) really made a difference to that estimate.</p>\n<p>It seems reasonable to argue that they're being too conservative, and should be funding the various things you mention in this post, but also plausible to me that they're acting correctly? More importantly, I think this is a totally separate question to whether to sell Wytham,and requires different arguments. Eg I gather that CEEALAR has several times been considered and passed over for funding before, I don't have a ton of context for why, but that suggests to me it's not a slam dunk re being a better use of money.</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "9nCByj5kDaKEjHyzA", "postedAt": "2024-01-26T12:54:38.361Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>I personally feel strongly about CEEALAR being better value, but that's just one of the many organisations listed - you can mentally delete it if your mileage varies.&nbsp;</p><p>Also, for better or worse, the mansion now belongs to EVF, so it's now up to EVF to decide whether it's the most effective path for them to keep it. Does a status quo reversal test suggest that right now, if they had £15million in cash, the best thing to spend it on would be a mansion near Oxford (let's assume that spending it on anything else would come with a couple of months' worth of admin work)?</p>", "parentCommentId": "ipsvfhASv4ovWDEio", "user": {"username": "Arepo"}}, {"_id": "LDyMaFxitmTZs3o3e", "postedAt": "2024-01-26T13:09:17.761Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>I think Neel makes a good point.</p>\n<p>And to me the sort of 'other' elephant in the room is the value of Wytham Abbey beyond thinking of it purely as an investment, i.e. in the comment that you link, Owen Cotton-Barratt tried to explain something about his belief in the value of specialist venues that can host conferences, workshops, researcher meetings etc. and that are committed to promoting a certain flavour of \"open-ended intellectual exploration\". One can obviously reasonably disagree with him (and admittedly it is very difficult to figure out the monetary value of this stuff), but it probably at least deserves rebutting explicitly?</p>\n", "parentCommentId": null, "user": {"username": "Spencer Becker-Kahn"}}, {"_id": "zTGAZ4wAJFdPkdWCb", "postedAt": "2024-01-26T17:29:15.603Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>Re your second paragraph: OP remains EVF's predominant funder, and it seems likely that OP would respond to EVF selling Wytham by reducing its own grant to EVF in the same amount. Thus, the end result of selling Wytham would be that OP has more money to spend elsewhere. OP is probably in a better position than EVF to evaluate the value of Wytham vs. whatever it would fund with the reduction in EVF's grant next year after the Wytham sale.</p>", "parentCommentId": "9nCByj5kDaKEjHyzA", "user": {"username": "Jason"}}, {"_id": "KisEE6tbEDhADJRy8", "postedAt": "2024-01-26T17:32:26.617Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>The number for HLI is also a funding gap figure. In the linked post, the potential budget presented for next year ranges from 442k to 1.073M pounds.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "ZJ3CZqek8E5CeFn9e", "postedAt": "2024-01-26T22:31:36.729Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>It would be helpful to know what events have been hosted there by now.</p>\n", "parentCommentId": "LDyMaFxitmTZs3o3e", "user": {"username": "DonyChristie"}}, {"_id": "sDS3JybmoyfMrQwLH", "postedAt": "2024-01-27T00:09:16.874Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>That's an interesting point. &nbsp;I wonder if this would also be the case if EVF (hypothetically) immediately earmarked proceeds from selling Wytham as donations to other organisations.<br><br>All of this of course is ignoring how grantmaking works in practice.&nbsp;</p>", "parentCommentId": "zTGAZ4wAJFdPkdWCb", "user": {"username": "remmelt"}}, {"_id": "5MkhLLWPgWPhJq4wi", "postedAt": "2024-02-11T09:05:05.945Z", "postId": "AMrzfTKHwHheouEDf", "htmlBody": "<p>It would also be helpful to know what their cost-benefit analysis actually consisted of, but I asked that they publish it in response to Owen's comment and never heard anything.</p>", "parentCommentId": "ZJ3CZqek8E5CeFn9e", "user": {"username": "Arepo"}}]