[{"_id": "CiPk9naMeLPGR58d2", "postedAt": "2022-12-02T02:59:30.906Z", "postId": "AmYHgwoquSBbjjkDg", "htmlBody": "<p>Heavily cosigned (as someone who has worked with some of Nick's friends whom he got into EA, not as someone who's done a particularly great job of this myself). I encourage readers of this post to think of EA-sympathetic and/or very talented friends of theirs and find a time to chat about how they could get involved!</p>\n", "parentCommentId": null, "user": {"username": "levin"}}, {"_id": "TZbSGKnQc9e7tHMyC", "postedAt": "2022-12-15T15:34:54.974Z", "postId": "AmYHgwoquSBbjjkDg", "htmlBody": "<p>I've generally had the opposite experience. I could spend ages talking to friends and family and not change their opinions, whereas just half an hour with someone who is already interested in EA can help accelerate their progress and get them connected to other people/projects/events.</p><p>I think for people interested in EA, they should mention it to their social network and see if there is any interest. But for community builders, there is much more value from finding people who are already interested in EA and are ready to get more involved.</p><p>Also once you've spoken to your social network, you can't keep on doing that in future months.</p>", "parentCommentId": null, "user": {"username": "DavidNash"}}, {"_id": "HLCMAjzyygyHJNtSq", "postedAt": "2022-12-15T15:40:10.759Z", "postId": "AmYHgwoquSBbjjkDg", "htmlBody": "<p>I also don't like the language of 'persuading' and convincing'.&nbsp;</p><p>See the 3rd point of this <a href=\"https://forum.effectivealtruism.org/posts/Rjb9oTjQ9RJMFw2Yo/heuristics-from-running-harvard-and-oxford-ea-groups\">post</a>.</p><blockquote><p>3.Avoid naive EA outreach.</p><p>Outreach is an offer, not persuasion. It can be tempting to try and persuade as many people about EA and run events that tweak the message of EA in an attempt to appeal to certain people. From our experience, this is generally a dangerous approach as it leads to low-fidelity diluted or garbled messages. Instead, think about outreach efforts as an ‘offer’ of EA where people can get a taste of what it’s about and take it or leave it. It’s OK if someone’s not interested. A useful heuristic James used for testing whether to run an outreach event is to ask “to what extent would the audience member now know whether effective altruism is an idea they would be interested in”. It turned out that many speaker events that Oxford were running didn’t fit this test, and neither did the fundraising campaign.</p></blockquote>", "parentCommentId": "TZbSGKnQc9e7tHMyC", "user": {"username": "DavidNash"}}]