[{"_id": "Esmc3vvDsKk7JTWWr", "postedAt": "2023-10-06T17:13:30.431Z", "postId": "aNKBwj6esW7RdvnwJ", "htmlBody": "<p>Thanks for this! I appreciate the write-up. Just wanted to quickly share that tried the EEM but eventually moved to a 'Must, Should, Could' system like <a href=\"https://www.lesswrong.com/posts/dJQ7BFz9ZPqstP3an/urgent-and-important-how-not-to-do-your-to-do-list\">here</a>. I use this on Google Tasks and other task management systems. Depending on the system I use a number or title to indicate the class of task. So far it has worked well for me. Of course different things will work for different people!</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "BzkJks2WrXr5KWNLd", "postedAt": "2023-10-08T19:26:19.214Z", "postId": "aNKBwj6esW7RdvnwJ", "htmlBody": "<p>Thank you so much for the comment.</p><p>The referenced article is a great write-up. Will have to dive deeper when I get the chance to see what/how I can implement some of the ideas in.</p><p>Always looking to improve to thank you for the feedback :)</p>", "parentCommentId": "Esmc3vvDsKk7JTWWr", "user": {"username": "Harry Luk"}}, {"_id": "mCKK4dAyuqhivMtwF", "postedAt": "2023-10-13T08:33:57.906Z", "postId": "aNKBwj6esW7RdvnwJ", "htmlBody": "<p>Awesome! I'd love the templates you're using now.&nbsp;</p><p>You do mention doing the tasks that require the least effort first, and progressively towards tasks that require more effort if the priority is otherwise similar. How come?</p><p>&nbsp;</p><p>Asking because I've actually tried switching that up lately for myself. I used to do the easiest things to get off the list, but realized that my mental capacity wanes as the day goes, and maybe its best to to high mental drain tasks first because low mental drain tasks I still have enough energy for late in the day. Still adjusting though!</p>", "parentCommentId": null, "user": {"username": "Andreas P"}}, {"_id": "xxmkD5B4jdRqMK4EN", "postedAt": "2023-10-13T19:08:15.414Z", "postId": "aNKBwj6esW7RdvnwJ", "htmlBody": "<p>Thanks for the comment. I private messaged you for the link to our template.</p><blockquote><p>I used to do the easiest things to get off the list, but realized that my mental capacity wanes as the day goes, and maybe its best to to high mental drain tasks first because low mental drain tasks I still have enough energy for late in the day</p></blockquote><p>Yes, I concur with you and I think it's something we have to balance personally. The idea of prioritizing the least effort first is so that we can see what's a low-hanging fruit that's still important (may or may not be urgent). Thus, doing those tasks will give us the quick wins and still make impact and move things forward.</p><p>In terms of structuring the day, I personally 'eat the frog' while my focus and mental capacity is high (mentioned in the \"<strong>Beyond Setup: The Journey to Habit Formation\" </strong>section):</p><blockquote><p>At the end of the day, look ahead to the next day and find the next most important task you need to work on tomorrow. Work on this in the morning (search ‘eat the frog’ on Google for more details).</p></blockquote><p>So, overall, we are using the EEM to see what's important to focus on, and what are the low-hanging fruits that will make impact to our projects.&nbsp;</p><p>With that information, we add and substract things from our daily task lists. Ideally, we are looking at the list the night before, so we already know exactly what to work on in the morning when we start work.</p><p>I recommend the choice of the first task to be a low-hanging fruit, or even a pre-work routine (which is what I do) to initiate the momentum and habit of getting things done.</p><p>\"Making your bed\" from the <a href=\"https://www.youtube.com/watch?v=pxBQLFLei70\">University of Texas at Austin 2014 Commencement Address - Admiral William H. McRaven</a> inspired my pre-work routine. Listening from the beginning is best because it gives you context, but the \"making your bed\" part starts at 4:45.</p><p>We want to <a href=\"https://www.developgoodhabits.com/make-your-bed/\">build good habits</a>, so that productivity is a part of our DNA and we don't even have to think about it anymore:&nbsp;</p><blockquote><p>Starting your day off by completing a task will initiate your momentum to do the next task, and then the next, and so on. It will give you a sense of accomplishment that you will want to continue to feel throughout the day.</p><p>If you can’t complete a small and mundane task each morning such as making your bed, you can’t expect yourself to be able to complete more complicated tasks moving forward.</p><p>If you end up having an unproductive or otherwise negligible day, you will still come home and be reminded that you completed that <i>one </i>task, which can instill hope that you will have a better or more productive day tomorrow.</p><p>In your life, the small task that jumpstarts your day may not literally be making your bed. But the point is to find one task that you can make into a habit that will slowly start to get to the root of a problem you’re facing or inch toward a goal for which you’re reaching.</p></blockquote><p>&nbsp;</p><p>This is just one approach, and absolutely not the only approach.</p><p>I'm sure other EAs who have gone through the process of optimizing their productivity can help give more suggestions and ideas :)</p>", "parentCommentId": "mCKK4dAyuqhivMtwF", "user": {"username": "Harry Luk"}}]