[{"_id": "izpBR6F4YtbRHmbmt", "postedAt": "2023-03-25T05:56:44.107Z", "postId": "aNsBJYpGovgJqWC9v", "htmlBody": "<p>Great article really nice job!</p><p>I really like your table at the end, and I'd like to challenge a few of your estimates there. I think we ignore and underrate \"hometown advantage\" (to steal a sports phase). This is just my limited experience and weak intuition talking - it's very hard to put numbers on comparative advantage.<br><br>Part of the reason I think we ignore hometown advantage &nbsp;that most EAs interested in global development live in such rich countries, that the multiplier for \"targeting the most vulnerable\" as you put it might be &nbsp;so high, perhaps 50-100x for work outside their countr rather than 10x as in your case which makes hometown comparative advantages largely irrelevant.&nbsp;</p><p>I love the way you put <i><strong>\"8x multiplier\" for Local network and credentials leading to a greater influence and leverage within the Colombian government. I agree with this strongly.</strong></i></p><p>To that I would potentially add other multipliers for working in Columbia<br>- Ability to leverage language and deep cultural understanding to be more effective &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; x 2<br>- Don't waste time understanding the local landscape (health system/ economy/politcal system) x 1.5<br>- Use local knowledge and networks to identify the most tractable/neglected issues &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;x 1.5<br>- Happiness/contentment of being closer to home increasing productivity &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; x 1.5</p><p>You might also consider poorer countries around you (e.g. Bolivia) where you would retain some of these competitive advantages, while also being able to target more vulnerable populations.</p><p>A couple of other comments too</p><p>I think doing a masters or something abroad, then coming back and working in Columbia might be a good option. I don't see the connection between studying abroad and working in another country</p><p>Also I don't really understand your \"Ability to choose the most effective organisations\" multiplier in your chart. Why would this increase outside of Columbia? Also you could start your own ;).</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}]