[{"_id": "qAcEBrKjiqTFPFH4c", "postedAt": "2024-02-15T23:56:20.997Z", "postId": "aNtktokq8jxjvrCYs", "htmlBody": "<h3>FAQ</h3><p><strong>This is cool! Why haven't I heard of this?</strong><br><a href=\"https://arkose.org\">Arkose</a> has been in soft-launch for a while, and we've been focused on email outreach more than public comms. But we're increasingly public, and are in communication with other AI safety fieldbuilding organizations!&nbsp;<br><br><strong>How big is the team?\u2028</strong><br>3 people: Zach Thomas and Audra Zook are doing an excellent job in operations, and I'm the founder.</p><p><strong>How do you pronounce \"Arkose\"? Where did the name come from?</strong><br>\u2028I think whatever pronunciation is fine, and it's the name of a rock. We have an SEO goal for arkose.org to surpass the rock's Wikipedia page.<br><br><strong>Where does your funding come from?</strong><br>The <a href=\"https://survivalandflourishing.fund/\">Survival and Flourishing Fund</a>.<br><br><strong>\u2028Are you kind of like the </strong><a href=\"https://80000hours.org/speak-with-us\"><strong>80,000 Hours 1-1 team</strong></a><strong>?</strong><br>Yes, in that we also do 1-1 support calls, and that there are many people for whom it'd make sense to do a call with both 80,000 Hours and Arkose! One key difference is that Arkose is aiming to specifically support mid-career people interested in getting more involved in technical AI safety.&nbsp;<br><br><strong>I'm not a mid-career person, but I'd still be interested in a call with you. Should I request a call?</strong><br>Regretfully no, since we're currently focusing on professors, PhD students, or industry researcher or engineers who have AI / ML experience. This may expand in the future, but we'll probably still be pretty focused on mid-career folks.&nbsp;<br><br><strong>Is Arkose's </strong><a href=\"https://arkose.org/resources\"><strong>Resource</strong></a><strong> page special in any way?</strong><br>Generally, our resources are selected to be most helpful to professors, PhD students, and industry professionals, which is a different focus than most other resource lists. We also think <a href=\"https://arkose.org/papers\">arkose.org/papers</a> is pretty cool: it's a list of AI safety papers that you can filter by topic area. It's still in development and we'll be updating it over time (and if you'd like to help, please <a href=\"mailto: vael@arkose.org\">contact Vael</a>!)<br><br><strong>How can I help?</strong><br>• If you know someone who might be a good fit for a call with Arkose, please pass along <a href=\"https://arkose.org\">arkose.org</a> to them! Or fill out our <a href=\"https://arkose.org/referral\">referral form</a>.<br>• If you have machine learning expertise and would like to help us review our resources (for free or for pay), please contact <a href=\"mailto: vael@arkose.org\">vael@arkose.org</a>.</p><p><br>Thanks everyone!</p>", "parentCommentId": null, "user": {"username": "Vael Gates"}}]