[{"_id": "daSceFYNG7HedzmBA", "postedAt": "2022-09-30T21:50:17.046Z", "postId": "aoAkWaMLAHSprNBko", "htmlBody": "<p>The history here is great, thanks for posting</p>\n", "parentCommentId": null, "user": {"username": "Cullen_OKeefe"}}, {"_id": "WJA3xMstexHeKpzhd", "postedAt": "2022-09-30T21:53:27.402Z", "postId": "aoAkWaMLAHSprNBko", "htmlBody": "<p>The lethal autonomous weapons (LAW) case seems fundamentally different, unfortunately, for two reasons:</p><p>In the case of CBW we had <i>the work of a dedicated group of scientists persuading Congress, the people, and the government that biological weapons would not be useful. </i>It will be a lot harder to argue that LAWs cant be useful. As devices that are wholly man-made I'd think there will always be a significant group of scientists and engineers arguing they just need to be better built to provide huge value. Unlike CBWs you don't have complicated issues of containment to worry about. Unlike CBWs, with LAWs the potential for creative fine-grained designs seems boundless since you're not restricted by what a biological agent is capable of. LAWs are only restricted by physics and how well your AI is programmed.</p><p>Secondly, the public and Congressional pressure on Nixon I see as largely stemming from the \"creep\" factor of CBWs. These are weapons that bring to the public's mind horrendous diseases gone rampant - something we as a species have deep evolutionary and culturally ingrained reasons to be creeped out about, both aesthetically and morally.&nbsp;</p><p>LAWs don't give that same creep factor. If anything, they give a \"cool\" factor, probably as a result of being wholly man-made. So I have a hard time seeing concerned scientists having anything but a very long upward battle trying to convince the public and Congress that LAWs should be banned analogously to the biological and chemical weapons conventions. This is just making me wonder if it might be intrumentally better to argue for LAWs being banned <i>without </i>arguing they are analogous to CBWs. &nbsp;I don't have expertise in this area, but this is what is coming to my mind.</p><p>sidenote: I don't believe you explicitly defined \"CBW.\" I am inferring BW = Biological Weapons. What does the C stand for? \"Conventional\"?</p>", "parentCommentId": null, "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "d8f76st2Ga5gCsr7x", "postedAt": "2022-09-30T23:54:32.463Z", "postId": "aoAkWaMLAHSprNBko", "htmlBody": "<p>First just want to flag that I don't have extremely high confidence in the last section in general, it wasn't nearly as researched as the rest.</p><p>I agree there are a number of disanalogies, most specifically that it does seem like biological weapons are straightforwardly less useful than lethal autonomous weapons. In this sense maybe LAWS are more like chemical weapons, which were at least claimed to be useful (though probably still not as useful), but were also eventually banned.</p><p>I'm not sure I agree about the creep factor. I think it's possible to make LAWS \"creepy;\" at least, watching the Slaughterbots documentary felt creepy to me. I think it's true they could be \"cooler\" though; I can't imagine a biological weapon being cool.</p><blockquote><p>I don't believe you explicitly defined \"CBW.\"</p></blockquote><p>Thanks, fixed. It stands for \"chemical and biological weapons.\"</p>", "parentCommentId": "WJA3xMstexHeKpzhd", "user": {"username": "ThomasWoodside"}}]