[{"_id": "FyAfm5ra9JsfadGpp", "postedAt": "2023-01-17T01:01:23.776Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>The Manifold Markets team participated in the program Joel ran; it was trajectory-changing. It felt more like YCombinator than YCombinator itself. We met a bunch of other teams working on adjacent things to us, collaborated on ideas and code, and formed actual friendships - the kind I still keep up with, more than half a year later. Joel was awesome, I would highly encourage anyone thinking of fellowships to heed his advice.</p><p>I was inspired afterwards to <a href=\"https://news.manifold.markets/i/61953440/mexifold\">run a mini (2 week) program for our team + community in Mexico City</a>. Beyond the points mentioned above, I would throw in:</p><ul><li>Think very carefully about who comes; peer effects are the most important aspect of a fellowship program. Consider reaching out to people who you think would be a good fit, instead of just waiting for people to apply.</li><li>The best conversations happen during downtime. E.g. the 30m bus ride between the office and the hotel; late night after a kickback is officially over.</li><li>Casual repeated interactions lead to friendships; plan your events and spaces so that people run into people again and again.</li><li>Start off as a dictator when eg picking places to get dinner, rather than polling everyone and trying to get consensus. In the beginning, people just need a single Schelling point; as they get to know each other better they'll naturally start forming their own plans.</li><li>Perhaps obvious, but maintain a shared group chat; have at least one for official announcements, and a lounge for more casual chatting. Slack or Discord are good for this.</li></ul>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "AqYe6GKSviws9igop", "postedAt": "2023-01-17T03:57:00.796Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>Thank you for such kindness Austin -- I'm glad it was helpful! :)</p>\n", "parentCommentId": "FyAfm5ra9JsfadGpp", "user": {"username": "joel_bkr"}}, {"_id": "6dndamnz4zuH3Xtyq", "postedAt": "2023-01-17T08:54:21.741Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>As someone who's run dozens of EA events and several retreats (though not fellowships) just noting that this all strikes me as good advice.</p><p>I particularly want to highlight paying attention to getting enough people to achieve the vibe you want (which may well be &gt;30 for fellowships) and sharing visit dates (huge deal but often overlooked).</p><p>I also really like the tone and structure of the post.</p><p>Thanks for sharing :-)</p>", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "uusQgPTELhwLs7yhi", "postedAt": "2023-01-17T10:53:43.379Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>Thanks for sharing Joel, those points all seem very sensible to me, and as a visitor in your program I also want to attest to how much I enjoyed the program you ran!&nbsp;</p><p>I want to +1 the part about basic amenities, especially part (2.). I remember feeling a bit helpless about accessing drinking water, and somebody saying we shouldn't overdo tapping the gym watercooler. :D&nbsp;</p><p>Also I'd like to mention how extraordinarily responsive you seemed to be all the time, and how kindly and helpfully you communicated with everyone.</p>", "parentCommentId": null, "user": {"username": "MaxRa"}}, {"_id": "6jtAq2DL3GCdXZWG3", "postedAt": "2023-01-17T12:13:20.184Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>Just for context - which programs are you referring to and have organized/ participated in? I see the term \"fellowship\" used for a range of programs</p>", "parentCommentId": null, "user": {"username": "Konstantin Pilz"}}, {"_id": "nSQTi7scSSiwepm3A", "postedAt": "2023-01-17T12:52:48.594Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>What are your intuitions regarding length? What's the minimum time needed for a fellowship to be impactful, and at what length does it hit diminishing returns?</p>", "parentCommentId": null, "user": {"username": "Rubi"}}, {"_id": "Nxu9njvhLoswsdDjb", "postedAt": "2023-01-17T14:58:06.267Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>Looking at the text's tone, it seems like this is about community-building, residential fellowships. As opposed to research fellowships which are basically jobs. What other contexts is the word ‘fellowship’ used in ?</p>\n", "parentCommentId": "6jtAq2DL3GCdXZWG3", "user": {"username": "Msaksena"}}, {"_id": "3oGzytmgmrBxFmGog", "postedAt": "2023-01-17T18:35:03.673Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>I want to leave open the possibility that fellowships are not an effective thing to do regardless of their length, so maybe the minimum time is 0.</p><p>But, conditional on thinking otherwise/going ahead with it...</p><ol><li>I think it might be helpful to think about diminishing returns for <i>participant stays</i>, vs. fellowship length. You can imagine a 10 year-long program where people only stay for 4 months max at a time. This isn't as silly as it sounds -- very few people stay from the very beginning to very end of these things anyway, so program beginning/end don't seem like very important milestones to respect (vs. participant stays).</li><li>I think participant stays hit diminishing returns at 3 months. (Much more weakly held/pulled from nowhere than claims in this post.)</li><li>I worked ~24/7 as an organizer, &nbsp;which became challenging after ~5 months.</li></ol>", "parentCommentId": "nSQTi7scSSiwepm3A", "user": {"username": "joel_bkr"}}, {"_id": "hhzotHhQJphdETHch", "postedAt": "2023-01-17T20:16:51.567Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>Thanks!<br>I think even for community building, there is a rather broad category, though most of the ones I know of are online, so they probably don't apply here. It would be helpful to have some examples.&nbsp;</p>", "parentCommentId": "Nxu9njvhLoswsdDjb", "user": {"username": "Konstantin Pilz"}}, {"_id": "ynYXDE2DEdk2PmnBr", "postedAt": "2023-01-17T22:43:49.319Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>I agree with all of your thoughts here, and want to remark in support of the intuitions.</p><p>There's a classic math question known as the handshake problem, which asks and answers things like: in a group of n people, how many unique handshakes can take place if each person shakes the hand of all the other n-1 people? If n=1, there's only one person and they can't shake anyone else's hand, so 0 handshakes take place. If n=2, the second person can shake the first person's hand, so there's 1 handshake. If n=3, the third person shakes hands with each of the first two people, who also shake hands with each other. In general, the solution for n people is (n-1) + (n-2) + ... + 2 + 1 + 0 = n*(n-1)/2. The most important insight or takeaway is that this expression is proportional to the square of the number of people, so the number of handshakes grows quadratically as more people are added.</p><p>I think fellowships strongly experience this effect, where adding one more participant to a small group will let that person meet the others in the group and provide a valuable connection to those few people, but adding one more participant to a large group provides a potential valuable connection to a lot more people. Going from 30 participants to 31 has a lot more potential upside than going from 20 participants to 21.</p><p>(These effects don't continue forever, because there are different limiting factors that become relevant. Adding one attendee to a 1500-person conference doesn't quadratically increase the value of the conference because the first 1500 people are already limited by the number of 1-on-1s they have time for during the event. And you can't just change the fellowship from 30 people to 60 and expect it to be 4x as good; at that point, you're going to start needing more space and everyone is going to be far from some of the other people, so there's an asymptotic bound to the value that is less than quadratic.)</p>", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "eE5T6H2tMFNvLFozs", "postedAt": "2023-01-18T13:29:44.730Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>(Robi mentioned this to me in person; I thought it was insightful/asked him to comment.) Thank you for the insight Robi! This is an interesting way of thinking about my numbers claim that I had not considered.</p>\n", "parentCommentId": "ynYXDE2DEdk2PmnBr", "user": {"username": "joel_bkr"}}, {"_id": "v77DtuKnWsykgTk7u", "postedAt": "2023-01-19T05:30:28.235Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>I was about to comment this too. From a brief skim I can't find any clarification about what the term \"fellowship programs\" is referring to.</p>", "parentCommentId": "6jtAq2DL3GCdXZWG3", "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "GJzW6KnaktkKg3ayx", "postedAt": "2023-01-22T19:56:05.875Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>The person in charge of the program should be unusually productive/work long hours/etc. because otherwise, they would lack the mindset, &nbsp;tacit knowledge, and intuitions that go into having an environment optimized for productivity. E.g., &nbsp;most people undervalue the time and time of others and hence significantly underinvest in time-saving/convenience/etc. stuff at work.</p><p>&nbsp;</p><p>(Sorry if mentioned above; haven't read the post.)</p>", "parentCommentId": null, "user": {"username": "Misha_Yagudin"}}, {"_id": "oXvqAtbvGKk5ywX7w", "postedAt": "2023-01-22T22:21:03.970Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>I am uncertain whether it's important for program leads to be hard-working for the reason you describe. (I am very confident that hard-working-ness helped me personally a <i>lot</i>, but it doesn't feel obvious that this went through the 'understands hard-working-ness in others' channel.)</p><p>Very, very strongly agree with the importance of an environment that values people's time very highly. Small changes/mindset shifts here can have outsized impact. Lots of room for improvement too.</p><p>(Parts of this are covered under \"<a href=\"https://forum.effectivealtruism.org/posts/AoqwhAY5faTHfYu4Z/some-intuitions-about-fellowship-programs#Basic_amenities\">basic amenities</a>\" but definitely more to add.)</p>", "parentCommentId": "GJzW6KnaktkKg3ayx", "user": {"username": "joel_bkr"}}, {"_id": "p2vxxshxXBhbmFr4x", "postedAt": "2023-01-26T01:38:18.104Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>I want to second and augment  'active programming part'.  As Rob notes, coordination is difficult.</p>\n<p>I think for EA Mexico the social opportunities and activities have been good (at least for the time I've been here). And there's been pretty good opportunities to informally chat and 1-on-1.  That's all you really might want for a short program of a day or so. But if we're going to be doing long (multi-week+) fellowships, I think we can try to do better.</p>\n<p>I think that what is lacking a bit is the opportunity to organize actual work discussions/working together. I think this merits coordination in a few ways. We need to know who is here, what they are doing, but they are interested in, what their skills are, and whether and when they were interested in working together. We also need to coordinate the social expectations of when it's OK to 'talk work' with someone or ask them for help and  feedback on work.</p>\n<p>I tried to start something in <a href=\"https://airtable.com/invite/l?inviteId=invdLjFIc0t9RKRLk&amp;inviteToken=6358fb8ef1aea1cfe7ab7981ed1ac5a967a0995cfcf9de223c82ea14a057cc98&amp;utm_medium=email&amp;utm_source=product_team&amp;utm_content=transactional-alerts\">this Airtable</a> as you know, but I shared it a bit late in the game.  But maybe it could be as an idea a template for a future fellowships and co-working, retreats etc?</p>\n<p>Some suggestions that (I think) would make a big difference (feel free to incorporate into your post, if you think it makes sense?)</p>\n<ol>\n<li>\n<p>Shared calendar <em>we can edit</em>, as you said</p>\n</li>\n<li>\n<p>Maintained database/table of <em>who is here and what they are interested in</em>, and research/impact area groups we can join</p>\n</li>\n<li>\n<p>Scheduled weekly (or 2x/week?) informal seminars, with 'post seminar discussion and collaboration time' scheduled afterwards</p>\n</li>\n<li>\n<p>A 'presentation space' with blackboards or whiteboards, and projectors</p>\n</li>\n<li>\n<p>A scheduled daily times and space (or maybe 4x per week)  for 'hackathon',  group work, and problem-solving. If you go to that space at that time, you partner up, chat, help each other, and get solutions to your problems. (Perhaps especially technical ones).</p>\n</li>\n<li>\n<p>Ambitious:  Facilitate people and groups arranging some projects and collaborations  in advance of a fellowship, and getting 'time bought off from their usual work' to do this</p>\n</li>\n<li>\n<p>Fancier: Possibly a 'podcast space' and times specifically set up for this. I think us being physically together provides a great opportunity to do and share public discussions, to communicate our work with others, to get a sense of where consensus may be, and to build information resources.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "pjMM94knrwBHNFQpq", "postedAt": "2023-01-31T18:53:17.749Z", "postId": "AoqwhAY5faTHfYu4Z", "htmlBody": "<p>The FTX Fellowship and the EA Latin America Fellowship are two central examples of what Joel is referring to.</p>", "parentCommentId": "hhzotHhQJphdETHch", "user": {"username": "robirahman"}}]