[{"_id": "WBcpM7eush7uRgrj8", "postedAt": "2022-09-29T02:57:18.789Z", "postId": "AoT98q6xrFv3K8CAk", "htmlBody": "<p>Great idea, just did this. Hopefully it gets approved.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "qgM5v5pqdL8Kx3XGq", "postedAt": "2022-09-29T03:02:42.851Z", "postId": "AoT98q6xrFv3K8CAk", "htmlBody": "<p>Note local groups can do bad if, as a naive example, they tell people donating to non-EA charities that they're bad people.</p><p>I think EA Israel has a hobby of writing lots of docs about this ;) I'll ask one of the community managers if they want to elaborate.</p><p>Anyway, my point is that I'd make sure I know about these [potential blind spots] / [potential risks] before starting, I think</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "mukkNF6eX7GorfHMS", "postedAt": "2022-10-28T07:26:52.067Z", "postId": "AoT98q6xrFv3K8CAk", "htmlBody": "<p>Great idea! Somehow I hadn't thought about the value of inactive groups vs no group.</p>\n<p>I know a few university cities in Finland with only 1-2 EAs who don't have time to commit to running a group many hours a week. I will ask them if they'd be interested in this and do a ~10-step manual on how to set up a mini group and how EA Finland can support them.  (Maybe calling it a contact group 🤔) Maybe an incentive to start the group (in addition to having a bigger impact) could be that they automatically get invited to EA Finland's organizers only-events and retreats.</p>\n<p>Adding to Yonatan Cales comment, I think I would add just a few bullet points in the manual on what to do (or not do) to avoid having a negative impact. There are lots of good posts and EA community building resources about what could go wrong and how to avoid that but I think most of them are relevant only  later, when a group is committing &gt;1 hour a month to community building.</p>\n", "parentCommentId": null, "user": {"username": "Karla Still"}}, {"_id": "arexhuxqDCaJSzdEs", "postedAt": "2022-11-24T19:25:00.308Z", "postId": "AoT98q6xrFv3K8CAk", "htmlBody": "<p>Here is now EA Finland's <a href=\"https://docs.google.com/document/d/1rEfnsJzgEuyh_rZNLiM3FLtlImYdrbWUiGQxTLGt48E/edit?usp=sharing\">Start a Mini EA Group in Finland </a>document. Tried to make it as detailed as possible to make it easy to do and added some more bonus activities like setting up posters at your campus.&nbsp;</p>", "parentCommentId": "mukkNF6eX7GorfHMS", "user": {"username": "Karla Still"}}, {"_id": "JxMiargxpcs2abQaq", "postedAt": "2022-11-27T12:41:12.045Z", "postId": "AoT98q6xrFv3K8CAk", "htmlBody": "<p>Looks very helpful, thank you Karla. :)</p>", "parentCommentId": "arexhuxqDCaJSzdEs", "user": {"username": "markus_over"}}, {"_id": "xyZYJeLuuJkXaqHb8", "postedAt": "2023-09-14T12:37:14.899Z", "postId": "AoT98q6xrFv3K8CAk", "htmlBody": "<p>Did something come of this in Dortmund or Koeln?</p>", "parentCommentId": null, "user": {"username": "RayTaylor"}}, {"_id": "jtt9miphbA7QdZn4R", "postedAt": "2023-09-16T12:34:46.679Z", "postId": "AoT98q6xrFv3K8CAk", "htmlBody": "<p>Köln does have a somewhat active local group currently (see here <a href=\"https://forum.effectivealtruism.org/groups/6BpGMKtfmC2XLeih8\">https://forum.effectivealtruism.org/groups/6BpGMKtfmC2XLeih8</a> ) - I think they mostly coordinate via Signal, which interestingly is hidden behind the \"Join us on Slack\" button on the forum page. Don't think this had much to do with this post though.</p><p>I'm not aware of anything having happened in Dortmund or the general Ruhrgebiet in the last year or so, with the exception of the Doing Good Together Düsseldorf group.</p>", "parentCommentId": "xyZYJeLuuJkXaqHb8", "user": {"username": "markus_over"}}]