[{"_id": "FsX2x2tdA35EEQPYx", "postedAt": "2014-12-24T22:12:51.789Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>I'm excited for this decentralized funding community, and I'm very grateful for the $248 I've personally collected through the service to date.  However, I feel like individual funders need to further elaborate on what they're funding needs are, what they would do with marginal funds, and a brief sketch of how they expect to have an impact.</p>\n<p>I just <a href=\"https://gratipay.com/peterhurford/\">updated my profile</a> to give an example of what I would mean (in my case, it's an example of how funding me does not lead to impact).</p>\n<p><a href=\"https://gratipay.com/diegocaleiro/\">Diego's profile</a> is the closest to what I'm looking for, though I'd want to know more about what he plans for each of his projects and why his living expenses are &gt;$50K a year.  (This is not meant to call out Diego in particular, so sorry if that's the case!)</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "QwckrmYHNRPhhJuHk", "postedAt": "2014-12-24T23:34:48.335Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>I definitely would also encourage donors to add more to their profiles!  Many are still quite minimal and could be improved.</p>\n<p>On the other hand, I think that there's not too much incentive right now with so few people donating.  This is a good reason for others to donate more, specifically to ones with nice profiles (if they want to specifically encourage such a thing).</p>\n<p>Not asking you Peter, just people reading this in general.</p>\n", "parentCommentId": "FsX2x2tdA35EEQPYx", "user": {"username": "oagr"}}, {"_id": "saqCmowsj5NGNpNoJ", "postedAt": "2014-12-25T03:21:34.832Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>In most cases I don't see a compelling reason to fund an individual rather than an organization.  I'm also worried about what kind of message this sends.  To be crass, it makes EA look like a circlejerk.</p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "Gdvjn9jWLsxuTh6ZP", "postedAt": "2014-12-25T05:36:19.747Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>There are over 1k communities on Gratipay, many doing very arguably less directly important things.  This isn't just money for anyone, it's supposed to be for projects done by people who haven't set up official nonprofits (very few people have done this).  It also does work for organizations, such as those online.</p>\n", "parentCommentId": "saqCmowsj5NGNpNoJ", "user": {"username": "oagr"}}, {"_id": "QAFxP3nKt3yHmnKzJ", "postedAt": "2014-12-25T08:00:09.486Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>The fear is, put bluntly that this is another way to turn EA people away from focusing on rigourously evidence backed projects for the poor to funding and supporting the lives of rich white people who they are internet friends with to work on speculative projects with no evidence backing. </p>\n<p>So long as the amounts and numbers remain fairly small, I think that some kind of speculative VC style funding of people or projects in the EA space is fine.  But if people did start to make a career out of gratipay - I think a lot more skepticism would be needed. </p>\n", "parentCommentId": "saqCmowsj5NGNpNoJ", "user": {"username": "AlasdairGives"}}, {"_id": "QaqascEKLtzHdFT7p", "postedAt": "2014-12-25T13:00:56.391Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<blockquote>\n<p>In most cases I don't see a compelling reason to fund an individual rather than an organization.</p>\n</blockquote>\n<p>I don't see the difference between funding individuals and organisations, since you can treat individuals as one-person organisations with a narrower range of projects, and by funding organisations you're ultimately funding individuals. Some of the things produced by .impact members, which I believe are mostly done by individuals or small groups, compare quite well with those produced by organisations.</p>\n", "parentCommentId": "saqCmowsj5NGNpNoJ", "user": {"username": "jayd"}}, {"_id": "QYqyWhQTL9PwQWXT5", "postedAt": "2014-12-27T02:20:34.853Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>I'll soon edit my profile with <a href=\"https://drive.google.com/file/d/0BxADVDGSaIVZVmdCSE1tSktneFU/view\">my EA plan</a>. </p>\n<p>My living costs are much closer to 25k a year than to 50k actually. Additional donations, far from my current funding, would go into other things that can be found described in my <a href=\"http://www.patreon.com/user?u=423163\">Patreon account</a>. I believe my Patreon account maps better into what you think people should be doing on Gratipay. I posted recently about shifting to Patreon while costs are low on the EA facebook group, and some people agreed that was a good idea. </p>\n<p>Regardless, there is a much more important issue from my point of view: donating to individuals is much cheaper than to institutions, or universities, because individuals don't have many of the fixed costs and bureocratic costs those institutions bear. Even if it were the case that a donee wanted to receive 50k for their living expenses, this is still less than the overal cost of employing an individual in most of the EA organizations to which most people make donations. Young EAs cost their institutions (and thus their donors) up to 90k per year, which is enough money to sustain three EAs even if they live in the most expensive areas of the planet. The math is simple and clear. People however are wary of donating to individuals at the moment. I suspect over time this will be much more common among EAs, since many of the donees already have, or will build, a track record of doing good work and and being accountable and reliable in a timely manner. I'm trying to spearhead this shift in part because I'm one of those who currently can, since I still have some funding for the next months, and I've been sponsoring myself as an EA for years. Most people can't afford to participate in this Beta test, which is why I invite everyone who wants to work as an EA and can still sustain themselves for a few months to join Patreon or Gratipay and help incrase the flow of EA to EA direct money on the receiving end, not just the donation end. </p>\n", "parentCommentId": "FsX2x2tdA35EEQPYx", "user": {"username": "Diego_Caleiro"}}, {"_id": "FEZpYEhsgzfdQywTo", "postedAt": "2014-12-27T02:35:10.735Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>Lila, see my comment above. Also notice the current Status quo is, as AlasdairGives mentioned, rich white people who are receiving the money through institutions, which sometimes have to pay other rich white people fees and other costs, people who are not doing EA work. Overall my best guess is that donating to institutions is about twice worse than donating to individuals in terms of cost per employee and task. It could be more. </p>\n<p>It is important that at least one or two institutions remain affiliated with high status entities. But we no longer need to guarantee this. With Singer on LYCS, Musk and Freeman suporting Superintelligence related NGOs, FHI at Oxford and CSER and FLI burgeoning, we have solved the status question almost to satisfaction. Signalling is not our problem, efficiency is. And 90k can pay one person within institutions, and three or more outside institutions. As long as the feedback and trust mechanisms are good, the next marginal dollar should go to direct donations to individuals. Furthermore since those dollars are donations, and are not conditional on any work, they can be obtained by those who are not currently in their country of citizenship, which enormously facilitates moving for those whose efforts are better allocated elsewhere.   </p>\n", "parentCommentId": "saqCmowsj5NGNpNoJ", "user": {"username": "Diego_Caleiro"}}, {"_id": "CWBEpb6Na2xtEkfzd", "postedAt": "2014-12-27T16:48:44.756Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<blockquote>\n<p>Regardless, there is a much more important issue from my point of view: donating to individuals is much cheaper than to institutions, or universities, because individuals don't have many of the fixed costs and bureaucratic costs those institutions bear.</p>\n</blockquote>\n<p>First, I'm fully in support of this kind of model, and I hope that maybe someday I am funded by it.  But I don't think your core thesis is correct, because:</p>\n<p>1.) Some organizations don't have high costs.  The only organization I have knowledge of, Charity Science, does not have such costs.</p>\n<p>2.) When you're funding an organization on the margin, you aren't funding the fixed or bureaucratic costs.</p>\n<p>3.) These costs carry with them corresponding advantages of coordination and shared access to resources.</p>\n<p>4.) Donating to an organization can be done tax deductibly, which, in the US, is often a savings of 25%.</p>\n<p>-</p>\n<blockquote>\n<p>Young EAs cost their institutions (and thus their donors) up to 90k per year</p>\n</blockquote>\n<p>Can you explain how you arrived at this figure?</p>\n", "parentCommentId": "QYqyWhQTL9PwQWXT5", "user": {"username": "Peter_Hurford"}}, {"_id": "fq8b5RkpcfWqKRNBA", "postedAt": "2014-12-29T04:30:30.923Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>I'd be interested in joining Gratipay but I don't seem well suited for it as I'm not currently working on a specific project that requires funding.</p>\n", "parentCommentId": null, "user": {"username": "Bitton"}}, {"_id": "ERrwhx6BFbxmx68HN", "postedAt": "2015-01-01T20:09:34.384Z", "postId": "aPYa87MJphdAzMKGe", "htmlBody": "<p>My concern is that feedback and trust mechanisms aren't good.  Even the best of us I think would struggle to produce quality work without a boss and coworkers and deadlines.  If organizations are actually just using gratipay to pay their employees without taxes, there are some legal concerns.  People don't take kindly to allegations of tax-dodging, and if something like this were to get out, it would probably hurt donations.  </p>\n", "parentCommentId": "FEZpYEhsgzfdQywTo", "user": {"username": "Lila"}}]