[{"_id": "ozAEZnnTtGGEu9NFK", "postedAt": "2024-02-16T21:56:14.955Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>I highly recommend this coworking space, and Mexico City!</p>\n", "parentCommentId": null, "user": {"username": "morgansimps24"}}, {"_id": "4mcmaSL7RwLT5ghRB", "postedAt": "2024-02-21T21:00:06.054Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>I would like to have some answers about the concerns that several local members, including myself, have expressed about this place, including cost, optics, etc. Additionally, in November, we were advised not to go to this space because there was not enough room. Has this changed in any way? I am very concerned that what could be the main EA Align workspace in Mexico does not represent what those of us working here are looking for. But perhaps my bias is large, and I am not understanding what should be prioritized in opening this space. I have detailed my questions more thoroughly in this<a href=\"https://forum.effectivealtruism.org/posts/zoxri8qKxCjZixpaq/ea-aligned-coworking-spaces-in-low-and-middle-income\"> inquiry.</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sandra Malagon"}}, {"_id": "GwgA9mgDXzyBheyog", "postedAt": "2024-02-21T21:25:53.582Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>I would like to suggest that EA members also evaluate the social impact that working spaces such as this can have on the local economy. There is an enormous backlash at the moment in Mexico City, particularly in the Condesa where this workspace is, because of the gentrification caused by remote workers. We all know what gentrification and its impacts are so I won’t expand on that further, but the scale of the impact in this particular area is so great that even food and menu are being changed, to not include as much chilli and be written in English.</p>\n<p>If you are part of a work space such as this please also consider what you can personally do to adapt to local habits instead of having them change around you.</p>\n", "parentCommentId": null, "user": {"username": "InvisibleGPT"}}, {"_id": "mEZz24weejfCfLxAX", "postedAt": "2024-02-21T22:47:27.295Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>It's a nice place, and we Mexicans are glad that others can come and enjoy the city. However, in Condesa and Haab, there are now several problems with the inclusion of local people. We locals would like to have the opportunity to work with international EAs in a place where discrimination couldn't be a problem, and where we don't have negative perceptions due to the current view in Mexico about places like Haab. The city is huge and there are other spaces, maybe not as beautiful but excellent, where locals could feel welcome.</p>", "parentCommentId": "ozAEZnnTtGGEu9NFK", "user": {"username": "Sandra Malagon"}}, {"_id": "4AzkHcw8Xpepidbg7", "postedAt": "2024-02-22T21:50:26.928Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>Hey Sandra, thanks for your questions. Hopefully the following clarifications will help give useful context as to why we’re excited about this space.&nbsp;</p><p>The scope of our program</p><ul><li>The office space and our broader project is a university program focused exclusively on AI. It is not an EA space, and it’s not meant to do EA community building in Mexico. Many of our fellows and visitors are not part of the EA community. We would be happy to see other initiatives aimed at EA community building in Mexico and Mexico City.&nbsp;</li><li>We would like to point out that the program is part of a Mexican university. Jaime and I (the two primary staff members) are from Colombia, and the vast majority of our colleagues at ITAM who have worked closely with us on various aspects of the fellowship are Mexicans. We're really grateful for their work and want to make sure their work is acknowledged.</li></ul><p>Some benefits of this space</p><ul><li>We have carefully considered the upsides and downsides of the current coworking space, and are now pretty confident about choosing it. This is both for logistical reasons and because we’ve had overwhelmingly positive feedback from fellows and visitors (several of them Latin Americans).&nbsp;</li><li>We’ve found the space is worth the cost and in practice cheaper than many alternatives because it offers all the operational facilities that the fellowship needs. If we had picked a different coworking space, we would have had to compensate by hiring an additional staff member to figure out things like catering, hosting talks, furniture, etc. It is worth noting that the staff curates a weekly menu for us to accommodate vegans. From our experiences with other event spaces in CDMX and LMICs, this is quite hard to find. Given this is a university program, there are additional constraints and requirements for the space(s) we use.&nbsp;</li></ul><p>We also have considered locals, and people from latam and LMICs more generally</p><ul><li>We have thought a lot about the effects of programs like these on locals, and much of our work is aimed at diversifying the pool of people working on important problems within AI.&nbsp;</li><li>The current set up of the coworking space has meant we have been able to accept visitors from LMICs and subsidize spots for those who wouldn’t be able to attend otherwise.&nbsp;</li><li>Condesa is a more gentrified and international area of Mexico City. In our experience, that has come with some benefits for a global program like ours. For example amenities as you mention, but also allowing fellows and visitors from other low and middle income countries and underrepresented backgrounds to move comfortably around the area (e.g. non-spanish speakers from other LMICs).</li><li>We were surprised to hear your concerns, as we haven’t received any similar feedback so far (just for quick context to readers: the writer of these comments has never been to our office space). We aren’t aware of any incidents of discrimination experienced during our fellowship or the co-working space more generally -&nbsp; we’ve found the staff (most are Mexican) of the broader co-working space (imagine a WeWork) to be very kind and welcoming. If there are specific incidents you’re aware of, we’d encourage you to let us, or the Community Health team know.&nbsp;</li></ul><p>While we are part of a Mexican university, and are mindful and respectful of local norms, we are also proud of having kickstarted a programme with a truly global focus in which members from various cultural backgrounds feel welcome.</p>", "parentCommentId": "4mcmaSL7RwLT5ghRB", "user": {"username": "AmAristizábal"}}, {"_id": "qRjgagaDyLrCnrarF", "postedAt": "2024-02-23T19:05:54.358Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>Hi Angela, thank you for your response. I never questioned this space for the AI fellowship, I'm glad you chose the best space for your program.&nbsp;</p><p>But now you are talking about a coworking in Mexico or Mexico City (obviously related to the EA alignment fields, that's why you are posting it on this forum). It would be naive to think that it wouldn't be the main space where people and organizations related to the themes we work on would attend, that's what you are inviting them to in the post.&nbsp;</p><p>Moreover, you know that for people in Mexico, coworking is very important; you reviewed a project presented by locals about it and know what the local community wants and our concerns about that space (And last year you believed that was not a good idea). If it's a coworking exclusively for the AI fellowship, you should clarify that and also that at least part of the community in Mexico does not feel comfortable attending. And invite you to reflect on the negative impact of this situation, again not because of the space you chose for your program but because you want this space to be \"the space in Mexico\" &nbsp;ignoring several complaints that several ones had since the last year.&nbsp;</p>", "parentCommentId": "4AzkHcw8Xpepidbg7", "user": {"username": "Sandra Malagon"}}, {"_id": "mDAr47ksJygtZfAdh", "postedAt": "2024-02-25T00:37:58.635Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>Hola Ángela,&nbsp;<br><strong>Agradecería que tu post y comentarios estuvieran en versión de español e inglés, </strong>ya que si es un proyecto llevado a cabo en CDMX me parece que es<strong> relevante que sea visible y accesible para la comunidad hispanohablante y sobre todo, mexicana y latinoamericana. </strong>De otra forma, me parece que sesgas a tus lectores a ser en su mayoría de la comunidad internacional. También recomendaría altamente que envíes a&nbsp;personas pertenecientes a grupos en México el post para preguntar sobre su opinión de este tipo de proyectos en nuestro país (en caso de que te interese).&nbsp;</p><p><br>Me gustaría hacer una serie de preguntas respecto a su propuesta ya que comparto puntos de vista que ha remarcado Sandra en su post y comentarios.&nbsp;</p><ul><li><i>Respecto a <strong>ser una buena idea</strong></i><strong>:</strong> El año pasado justo después del Fellowship se hizo una propuesta exactamente igual a la que estás haciendo pero&nbsp; llevada a cabo por miembros locales de la comunidad en México sin embargo, en su momento comentaste que veías como una propuesta inviable y de hecho el proyecto después fue negado. Me gustaría saber <strong>¿Qué ha cambiado desde entonces para que ahora se quiera llevar a cabo? ¿Qué tipo de análisis de “costo-efectividad” después de tu programa, específicamente respecto a la oficina, se hicieron para que ahora la propuesta si sea viable?</strong><br>&nbsp;</li><li><i><u>Respecto al</u><strong><u> espacio en específico escogido:</u></strong></i><strong> ¿Crees que un lugar que tiene múltiples referencias públicas sobre trato con clasismo y discriminación a mexicanos es un lugar ideal para trabajar?¿Cómo crees que se deberían de manejar estas críticas? ¿Cuál es tu threshold respecto a&nbsp; las comodidades que les ofrecen vs. este tipo de comentarios?</strong> Igualmente, sé que es un lugar que se caracteriza por no tener como clientes a mexicanos y normalmente, ni como equipo <strong>¿A qué crees que se deba esta falta de representación local en un espacio de coworking?&nbsp;</strong><br><i><strong>**Para contexto:</strong></i> Los comentarios a los que me refiero pueden verlos en las mismas reseñas de Google fácilmente. También puedo dar estos comentarios porque si he tenido oportunidad de ir al lugar el año que se estuvieron viendo opciones para el proyecto del punto uno y además, he conversado con personas que sí han ido recientemente durante el fellowship (incluso de la comunidad internacional) y me han dado comentarios similares incluso sin yo haberlos solicitado.&nbsp;</li></ul><p><strong>También considero importantísima la transparencia en su selección de espacio y ver los análisis de costo-efectividad</strong> por medio de un reporte en el foro sobre costos vs. amenidades, comodidad, etc. de este espacio comparado a otros que hayan tenido en mente escoger (sobre todo porque es particularmente caro a comparación de otros incluso en la misma zona). Al final de cuentas, este tipo de proyectos siempre suelen ser ambiciosos y por alineamiento en valores <strong>me parece fundamental considerar transparencia y objetividad al hacer la selección del espacio</strong> considerando que <strong>se está destinando inversión a esto y no a otros proyectos.&nbsp;</strong><br>&nbsp;</p><ul><li><strong>Respecto a la zona: </strong>Hace un año cuando se planteó el proyecto que se mencionó en el punto 1, se descartó la Colonia Condesa por los precios y la poca accesibilidad a las personas que vivimos en CDMx. Sé que mencionas que este es un proyecto universitario y únicamente de AI sin embargo, tienes una convocatoria abierta a la comunidad de EA Local e Internacional que no parece que coincida con tu scope. Incluso, al hablar con personas que han asistido al programa hacen referencia al lugar como “El EA Hub de México”. Me gustaría entonces saber <strong>¿Cuál es el verdadero alcance de este proyecto? ¿Por qué los asistentes, e incluso mentores parte del core team no lo tienen claro?&nbsp;&nbsp;</strong><br>Y otras cosas que me parecen relevantes son:<strong> ¿Tus proyectos están interesados en en ser accesible también a la comunidad mexicana?</strong> En caso de que sí,<strong> ¿Qué estrategias implementaron o planean implementar que busquen beneficiar a la comunidad local? </strong>En caso de que este no sea un interés de su parte, solo aclararme que México simplemente está siendo utilizado como una sede.&nbsp;<br>&nbsp;</li><li><strong>Respecto a la discusión de </strong><i><strong>concerns&nbsp;</strong></i><strong> resaltada en comentarios:</strong> Todos estos concerns que ha mencionado sandra en su comentario, anteriormente fueron discutidos durante el Fellowship de México y también en la planeación que se tuvo del “Hub” hace un año mencionada en el punto 1. Además, durante la planeación del EAGx estos mismos concerns fueron traídos nuevamente a la mesa, destacando comentarios de la comunidad local tales como:&nbsp;<ol><li>Existe una marcada <strong>falta de representación </strong>y sobre todo, de interés de escuchar a la comunidad de México al tomar decisiones sobre proyectos o eventos en la región.&nbsp;</li><li>Se remarcó que pareciera que cada vez que se hacen propuestas de un proyecto por un&nbsp; grupo de la comunidad internacional vs. un grupo local, se prioriza al internacional <strong>resaltando de forma implícita </strong>una posible consideración de <strong>falta de capacidad para liderar estos proyectos.&nbsp;</strong></li><li>Además, resaltaron la <strong>falta de espacios y eventos para la comunidad mexicana (y en general Latinoamericana)</strong> de forma global, acentuando que si se hacían proyectos en estos países deberían de tener claramente consideraciones locales y beneficios igualmente locales.<strong> ¿No consideras entonces que por temas de desatención si tendría mucho más sentido que un proyecto así tuviera consideraciones locales? ¿Consideras que el llevar a cabo tu proyecto de la manera en la que lo estás manejando, podría generar más incomodidades como las ya discutidas?&nbsp;</strong><br>&nbsp;</li></ol></li></ul><p>Entonces, una vez vuelto a resaltar esto, <strong>¿Por qué en este momento consideras que todas estas conversaciones del año pasado no cuentan como “retroalimentación similar” a tu propuesta?&nbsp;</strong></p><ul><li>Respecto a ser <strong>un grupo universitario: </strong>Me gustaría saber <strong>¿Ustedes cómo definen un proyecto universitario? </strong>Esto es porque como mencioné anteriormente, el scope entonces sigue sin ser claro. Sobre todo porque el equipo de mentores y participantes del fellowship parece no ser de la universidad y al preguntar a compañeros locales que sí están en la universidad, incluso desconocían de la existencia del programa. Entonces<strong> ¿Cuál es el valor del proyecto y su scope también con la universidad?&nbsp;</strong></li></ul><p>&nbsp;</p><p>Entre otras cosas que considero relevantes, <strong>tu </strong><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdZlL5CBVaMXhmYk8w6xF4xkK2tJ6LJiol0k8JOfyxRXKry0w/viewform\"><strong>forma de interés</strong></a><strong> está únicamente dirigida a forzosamente decir que si les interesa trabajar </strong>de alguna manera ahí y solo conocer el cómo. Creo que sería mucho más interesante que la parte exploratoria de hacer un coworking en méxico no sea simplemente hacer una lista de quién se apunta al lugar y mejor <strong>agregar preguntas como &nbsp;si &nbsp;lo consideran o no un lugar adecuado, y justificar el&nbsp; por qué de su decisión.&nbsp;</strong></p><p>Y finalmente, <strong>de forma muy personal </strong>(como miembro de la comunidad local, parte de organización con intereses igualmente de impulso regional y mexicana) uno de mis valores fundamentales y que debe representar a los proyectos a los que apoyo, es <strong>poder trabajar siempre respetando a los miembros de mi país</strong> (no únicamente de EA) <strong>y/o al país del que soy visitante. </strong><i><strong>Considero que esta propuesta agrava el actual problema de desigualdad económica y vivienda que está viviendo mi país y sobre todo la ciudad,</strong></i> al parecer ser únicamente&nbsp; considerado como un punto barato y&nbsp; geográfico conveniente para proyectos que no buscan beneficiar de ninguna manera a la población local. De hecho, me ha sorprendido que en comentarios describas que consideras que la gentrificación de la zona puede traer beneficios <strong>¿Qué implicaciones tendría para ustedes ser posiblemente considerados como un proyecto que justamente agrava esta situación?&nbsp;</strong></p><p>Espero que mis preguntas y puntos hayan sido comprendidos y si no, <strong>estoy totalmente abierta a llevar una discusión mucho más profunda al respecto</strong> (de forma presencial o virtual) invitando a más miembros de la comunidad local e internacional a dar sus aportaciones o puntos de vista.&nbsp;</p><p><strong>Todo lo que he planteado lo planteo desde un punto de vista de retrospección</strong> ya que considero que es fundamental que al hacer&nbsp; proyectos en nuevas regiones también se tenga el objetivo de promover una verdadera diversidad e inclusión. Igualmente, resaltar que para estos proyectos no ha faltado iniciativa &nbsp;de miembros en el país.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Michelle Bruno Hz"}}, {"_id": "h8zrMkkZXinnp3wHT", "postedAt": "2024-02-26T23:27:04.619Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p>Hola Angela y Jaime,&nbsp;</p><p>Según puedo entender este post (<i>sientanse libres de corregirme si entendi mal</i>), el objetivo de buscar personas interesadas en utilizar los espacios de esta oficina es para idealmente mantener en uso el espacio y no perder acceso a este.</p><p>Si entendí bien, esa decisión parece sensata si únicamente pensamos en los beneficios individuales para el fellowship (<i>ya que esto implicaría poder mantener el espacio que se ajusta a las necesidades del fellowship</i>).&nbsp;</p><p>Sin embargo, creo que hay una discusión importante a tener respecto a los <strong>efectos que esto puede tener en cuanto al desarrollo de espacios o iniciativas futuras dentro de México. </strong>Sinceramente, pienso que antes de considerar que organizaciones estarían interesadas en el espacio de la oficina, mas bien se debería explorar las <strong>expectativas y necesidades de los miembros de la comunidad mexicana principalmente</strong> (<i>ya que estas personas pienso serían las que mas se podrían beneficiar de espacios de co-work como estos!</i>).&nbsp;</p><p>Por último, entiendo por los comentarios que su objetivo <strong>no es crear un espacio de community building en México, </strong>y aprecio que sean claros en ello. Sin embargo, creo que estan en una posición donde sus decisiones pueden impulsar el desarrollo de iniciativas locales y creo que vale la pena tener discusiones abiertas y sinceras respecto a estos temas dentro de la comunidad hispanohablante.&nbsp;</p><p>P.D. Estoy consciente que mi opinión puede tener sesgos gracias a que soy Mexicano y conozco a parte de la comunidad mexicana. Por eso mismo quiero levantar mi mano y reiterar que estoy abierto a tener mas discusiones respecto al tema y elaborar en mis comentarios. Considero que esto puede llevarnos a propuestas mas fuertes que beneficien a nuestra región y podamos impulsar mayor bien! Espero que este comentario no se perciva como crítica vacía si no como un comentario sincero que busca se pueda fortalecer el desarrollo de nuestra region.&nbsp;</p><p>Espero se encuentren bien,&nbsp;</p><p>Alonso&nbsp;</p>", "parentCommentId": null, "user": {"username": "Alonso Flores"}}, {"_id": "cbGbXBeQ4TJ4CwYfu", "postedAt": "2024-02-26T23:29:24.750Z", "postId": "aPZT66Byw8mCHNnPx", "htmlBody": "<p><strong>Contexto importante: </strong>No he tenido la oportunidad de visitar este espacio. Sin embargo, mi comentario va enfocado hacia <strong>la importancia de considerar a los stakeholders</strong> que se verán indirectamente afectados por el establecimiento de un potencial espacio que reciba iniciativas EA aligned. Considero que es vital evaluar como este proyecto afecta a la región y como la región afecta al proyecto.&nbsp;</p>", "parentCommentId": "h8zrMkkZXinnp3wHT", "user": {"username": "Alonso Flores"}}]