[{"_id": "wxBParyp98pHsHBKn", "postedAt": "2022-11-13T12:55:58.722Z", "postId": "AQJ6D76CmpCjusLyf", "htmlBody": "<p>This is a super interesting idea! I like this push for more object-level thinking. I live in Kenya - may be worthwhile to do in the poorer regions here. Heading home for Christmas and maybe I will bring back a suitcase full, then travel around the northern deserts handing them out.</p><p>&nbsp;</p><p>Making this really practical, here are the things I'm thinking through on actually doing this:</p><ul><li>Deciding whether or not to do this:<ul><li>Is any other organization already doing this in the region I would be going to?</li><li>What is the most likely cause of death in the specific area I would go to? Is it easily treatable?</li><li>Do more research into these 1/100 - 1/1000 life-saving impact estimates - is this realistic?</li></ul></li><li>If I decide to do it:<ul><li>Where do I buy antibiotics in the US? What kind do I buy?</li><li>will I get in trouble at customs bringing these in?</li><li>how will I explain to people how to use these antibiotics (especially in regions where I don't speak the language, which may be the areas of highest need?</li></ul></li></ul><p>I'll report back if I go through with this!</p><p>&nbsp;</p><p>A few other thoughts:</p><p><strong>Strongly agree with your thoughts on safety.</strong></p><p><strong>\"Just directly physically doing things seems to be high-impact in general\"</strong> - interesting. Of the four top charities, seems like only Malaria Consortium physically does stuff. The other three seem to fund and support existing organizations who are doing highly effective physical things (1).</p><p>In that spirit: I can potentially fund a person or two to go around handing out antibiotics! Let me know if you are reading this and are thinking of doing it but worried about funding.</p><p><strong>\"I’d guess that each course saves more like 1/100 life rather than 1/1000\". </strong>Where does this come from? I have no intuition around how likely antibiotics are to help people, so would like to understand better!</p><p>&nbsp;</p><p>1. descriptions of four charities from a 5-minute readthrough of their summaires on GiveWell</p><ul><li><a href=\"https://www.givewell.org/charities/malaria-consortium\">Malaria Consortium</a>: Seems to actually on the ground distribute medicine</li><li><a href=\"https://www.givewell.org/charities/amf\">AMF</a>: Does not actually distribute bednets - funds already existing distributors</li><li><a href=\"https://www.givewell.org/charities/helen-keller-international\">Helen Keller</a>: \"provides technical assistance, engages in advocacy, and contributes funding to government-run vitamin A supplementation programs\" -&nbsp;</li><li><a href=\"https://www.givewell.org/charities/new-incentives\">New Incentives</a>: Provides funding to people to incentivize them to receive vaccines from already government-provided clinics</li></ul>", "parentCommentId": null, "user": {"username": "Luke Eure"}}, {"_id": "4NvNDM7ZK7HzzHxHE", "postedAt": "2023-01-15T15:27:58.005Z", "postId": "AQJ6D76CmpCjusLyf", "htmlBody": "<p>Follow up on this - I downgraded my prioritization of this as an intervention after talking to a friend in Nairobi who told me that overperscription of anti-biotics is a huge issue in Nairobi. In lots of neighbourhoods, the informal medical clinic will just prescribe you strong antibiotics for relatively mild symptoms.&nbsp;</p><p>This made me&nbsp;</p><p>1. doubt that people will use randomly distributed antibiotics correctly - so less upside</p><p>2. give more credence to the idea that passing them out randomly could increase antibody resistance - potential downside</p>", "parentCommentId": "wxBParyp98pHsHBKn", "user": {"username": "Luke Eure"}}, {"_id": "Zfeer2wueK25BejbK", "postedAt": "2023-01-15T15:42:13.539Z", "postId": "AQJ6D76CmpCjusLyf", "htmlBody": "<p>Hey man I like a lot of this sentiment! I agree that getting stuck into doing physical things can make a huge difference.</p>\n<p>I also think that healthcare provision in truly remote places (the 10 percent most remote) is a massively neglected area</p>\n<p>Also agree that need in the Sahel is really high.</p>\n<p>I'm a doctor that runs an organization that runs remote health centers in Uganda. The biggest issue in my mind isn't that antibiotics aren't around , but that the wrong medications are given all the time either because the best medications aren't there, or because the wrong diagnosis is made. That's what or org trying to fix in remote parts of Uganda.</p>\n<p>There's a multi million dollar organization called MUSO health which works along similar ish lines. They put medications like antibiotics in the hands of village health workers, who give them out for free pretty liberally, with some idea about diagnosis but not a whole lot.</p>\n<p>Anyway I don't necessarily think your specific idea is a great way to help, but theres some good ideas in there.</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "MtfjswohHmrZZfMY6", "postedAt": "2023-01-15T15:55:11.627Z", "postId": "AQJ6D76CmpCjusLyf", "htmlBody": "<p>Correct downsides! Another is that when people physically have medication already from a handout, they often just take that no matter what sickness they get, which can be really dangerous.</p>\n<p>Along a similar ish lines, there has been a bunch of research though on giving all newborns for example antibiotics and prophylactic malaria treatment, and in some high risk circumstances just swallowing antibiotics even when you are not sick may do more good than harm. It's complicated.</p>\n", "parentCommentId": "4NvNDM7ZK7HzzHxHE", "user": {"username": "NickLaing"}}]