[{"_id": "jay9xFLYSDmZwaXDQ", "postedAt": "2015-01-25T20:07:12.737Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>Thanks for sharing this Michelle! I think it's a really good example of how human connections matter for getting and keeping us motivated and involved. One aspect of effective altruism that I think can be off-putting to otherwise interested people is that we remain remote from the people we benefit. I think it's important we make up for this in other ways (not everyone feels they need this but I think sufficiently many do). I think the milestone and anniversary celebrations at GWWC have been great in this regard. This is just one reason we are so lucky to have you as the friendly face leading Giving What We Can!</p>\n", "parentCommentId": null, "user": {"username": "Bernadette_Young"}}, {"_id": "ssoKAGXFfqDSWY7sg", "postedAt": "2015-01-26T05:28:31.708Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<blockquote>\n<p>I think it's a really good example of how human connections matter for getting and keeping us motivated and involved.</p>\n</blockquote>\n<p>Yes... if anything though, I find that a bit demoralizing.  It suggests that writing books, even if they're well-marketed, won't actually create that many effective altruists and the slow grind of evangelizing to friends and bringing them in to the community will end up being what's truly necessary.</p>\n<p>If I were Will MacAskill, I would encourage the readers of my book to send me emails personally with their reactions to the book.  Starting conversations is a tactic that works well for internet marketers; it's common for emails from internet marketers to encourage recipients to reply directly to the email.  Also, designing a good &quot;call to action&quot; is key... what's the simplest, easiest way for someone who reads the book to start considering themselves a community member?  Join the EA facebook group?</p>\n", "parentCommentId": "jay9xFLYSDmZwaXDQ", "user": {"username": "John_Maxwell_IV"}}, {"_id": "NRM57RqLQepB8Wt3T", "postedAt": "2015-01-29T08:46:32.069Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>To phrase my pessimism another way, <a href=\"http://effective-altruism.com/ea/da/a_taxonomy_of_ea_origin_stories/\">1.1 million people saw Peter Singer's EA TED talk and only 43 became EAs</a>.</p>\n", "parentCommentId": "ssoKAGXFfqDSWY7sg", "user": {"username": "John_Maxwell_IV"}}, {"_id": "dwFmSihrFieiGW38R", "postedAt": "2015-01-29T10:12:18.624Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>I agree that this indicates that personal interactions and not just putting the information out there is important. That needn't be demoralising though - these seem like ideas people really want to engage with, talk about, and think through. If people want to discuss them like that, they're more likely to discuss them with people who haven't heard about the ideas yet too. It certainly shows we should be putting effort into working out how we can start conversations - that's one of the things Giving What We Can is focusing on. \nI wouldn't worry too much about that figure. The survey reached only a relatively small number of people, and was not a random sample. It got very many LW readers (who are unlikely to have come to the ideas through the TED talk). Giving What We Can alone has had around 100 people join or do Try Giving and cite Singer's TED specifically. I imagine the number of Life You Can Save pledgers who found the org through that talk, and the number who donate to GW charities because of it, is very much higher. \nI very much look forward to all the kind people we'll get to meet in the wake of Will's book! As you say, follow through and chatting to them will be key - but what a lovely opportunity.  </p>\n", "parentCommentId": "NRM57RqLQepB8Wt3T", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "HmnbmLT3iWQRgiRoE", "postedAt": "2015-01-29T12:49:13.909Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>Its a journey - the &quot;grind&quot; of accompanying people on that journey can actually have surprising personal and informational benefits and be a lot of fun? </p>\n", "parentCommentId": "ssoKAGXFfqDSWY7sg", "user": {"username": "tomstocker"}}, {"_id": "WxKdCaXWMC3hGdboE", "postedAt": "2015-01-29T12:53:08.627Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>A book or other mass-delivered set of ideas helps a lot of people to move a little bit along  - those 43 people were probably very far along that journey already or had a set of values and beliefs that fitted well with the actions they then took - but maybe there are 100,000 that are making other changes in their lives or with a 5% increased probability of becoming GWWC members later on?</p>\n<p>1.1 million people watched it - this is good. Even ignoring Michelle's point about biased survey results - 43 EAs from one talk! That's incredible! + GWWC's 100 people already... a cause for hope?</p>\n", "parentCommentId": "NRM57RqLQepB8Wt3T", "user": {"username": "tomstocker"}}, {"_id": "nYh9mrcWxxGCFioP6", "postedAt": "2015-01-30T00:45:04.813Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>Perhaps, but it's much less efficient than a successful mass-media campaign. There's a reason we're interested in mass-media hygiene campaigns and not personally flying out to Africa to educate people one on one.</p>\n", "parentCommentId": "HmnbmLT3iWQRgiRoE", "user": {"username": "Larks"}}, {"_id": "dgLNjj6fbRxG2fun5", "postedAt": "2015-01-30T00:45:13.212Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>Yes, I agree. If even members of CEA's core target audience (Oxford Philosophers) need community and friends to get involved, it does not bode well for appealing for people without such an analytic background. </p>\n", "parentCommentId": "ssoKAGXFfqDSWY7sg", "user": {"username": "Larks"}}, {"_id": "hXC6JBRMtSyLrwWXw", "postedAt": "2015-01-30T06:12:56.443Z", "postId": "aRAK6ct8AvXg3gicA", "htmlBody": "<p>Sure, maybe I should have avoided the words &quot;demoralizing&quot; and &quot;grind&quot;... I don't think we need to feel discouraged.  The world is the way it is, after all.</p>\n", "parentCommentId": "dwFmSihrFieiGW38R", "user": {"username": "John_Maxwell_IV"}}]