[{"_id": "Nc3L4LCjQPg7ieoNb", "postedAt": "2022-11-13T21:11:22.966Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>I thought I would like this post based on the title (I also recently decided to hold off for more information before seriously proposing solutions), but I disagree with much of the content.</p><p>A few examples:</p><blockquote><p>It is uncertain whether SBF intentionally committed fraud, or just <a href=\"https://nitter.net/SBF_FTX/status/1590709172936798208#m\">made a mistake</a>, but people seem to be reacting as if <a href=\"https://forum.effectivealtruism.org/posts/HyHCkK3aDsfY95MoD/cea-ev-op-rp-should-engage-an-independent-investigator-to\">the</a> <a href=\"https://forum.effectivealtruism.org/posts/XHrHsrQGyr4NnqCA7/we-must-be-very-clear-fraud-in-the-service-of-effective\">takeaway</a> <a href=\"https://forum.effectivealtruism.org/posts/txGgPvKgZFpphdkHe/my-reaction-to-ftx-appalled\">from</a> <a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx\">this</a> is that fraud is bad.</p></blockquote><p>I think we can safely say with at this point &gt;95% confidence that SBF basically committed fraud even if not technically in the legal sense (edit: but also seems likely to be fraud in the legal sense), and it's natural to start thinking about the implications of this and in particular be very clear about our attitude toward the situation if fraud indeed occurred as looks very likely. Waiting too long has serious costs.</p><blockquote><p>We could immediately launch a costly investigation to see who had knowledge of fraud that occurred before we actually know if fraud occured or why. In worlds where we’re wrong about whether or why fraud occurred this would be very costly. My suggestion: wait for information to costlessly come out, discuss what happened when not in the midst of the fog and emotions of current events, and <i>then</i> decide whether we should launch this costly investigation.</p></blockquote><p>If we were to wait until we close to fully knew \"whether or why fraud occurred\" this might take years as the court case plays out. I think we should get on with it reasonably quickly given that we are pretty confident some really bad stuff went down. Delaying the investigation seems generally more costly to me than the costs of conducting it, e.g. people's memories decay over time and people have more time to get alternative stories straight.</p><blockquote><p>Adjacently, some are arguing EA could have vetted FTX and Sam better, and averted this situation. This reeks of hindsight bias! Probably EA could not have done better than all the investors who originally vetted FTX before giving them a buttload of money!</p><p>Maybe EA should investigate funders more, but arguments for this are orthogonal to recent events, unless CEA believes their comparative advantage in the wider market is high-quality vetting of corporations. If so, they could stand to make quite a bit of money selling this service, and should possibly form a spinoff org.</p></blockquote><p>This seems wrong, e.g. EA leadership had more personal context on Sam than investors. See e.g. Oli <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=NbevNWixq3bJMEW7b\">here</a> with a personal account and my more abstract argument <a href=\"https://forum.effectivealtruism.org/posts/4zjnFxGWYkEF4nqMi/?commentId=cErPLRzAppGEzfJ5f\">here</a>.</p>", "parentCommentId": null, "user": {"username": "elifland"}}, {"_id": "xx2jqJ6b9wEYoEGxJ", "postedAt": "2022-11-13T21:24:57.210Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>I don't say this often, but thanks for your comment!</p>\n<blockquote>\n<p>This seems wrong, e.g. EA leadership had more personal context on Sam than investors. See e.g. Oli here with a personal account and my more abstract argument here.</p>\n</blockquote>\n<p>Interesting! You have changed my mind on this. You clearly know more about this than I. I want you to write a better post arguing for the same overall point if you agreed with the title, hopefully with more context than mine.</p>\n<p>The fact that we have such different pictures I think may be an effect of what I'm seeing on the forum. So many top level posts not talking about object level data made it difficult for me to know <em>what</em> object level data we had.</p>\n<blockquote>\n<p>I think we can safely say with at this point &gt;95% confidence that SBF basically committed fraud even if not technically in the legal sense (edit: but also seems likely to be fraud in the legal sense), and it's natural to start thinking about the implications of this and in particular be very clear about our attitude toward the situation if fraud indeed occurred as looks very likely. Waiting too long has serious costs.</p>\n</blockquote>\n<p>My main thought is that I don't know why he committed fraud. Was it actually to utility maximize, or because he was just seeking status, or got too prideful or what?</p>\n<blockquote>\n<p>If we were to wait until we close to fully knew \"whether or why fraud occurred\" this might take years as the court case plays out. I think we should get on with it reasonably quickly given that we are pretty confident some really bad stuff went down. Delaying the investigation seems generally more costly to me than the costs of conducting it, e.g. people's memories decay over time and people have more time to get alternative stories straight.</p>\n</blockquote>\n<p>I'd agree with this if I thought EA right now had a cool head. Maybe I should have said we should wait until EA has a cooler head before launching investigations.</p>\n", "parentCommentId": "Nc3L4LCjQPg7ieoNb", "user": {"username": "D0TheMath"}}, {"_id": "xeEdrMJfgpncsQ5PB", "postedAt": "2022-11-13T21:34:42.249Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>Appreciate the quick, cooperative response.</p><blockquote><p>I want you to write a better post arguing for the same overall point if you agreed with the title, hopefully with more context than mine.</p></blockquote><p>Not feeling up to it right now and not sure it needs a whole top-level post. My current take is something like (very roughly/quickly written):</p><ol><li>New information is currently coming in very rapidly.</li><li>We should at least wait until the information comes in a bit slower before thinking seriously in-depth about proposed mitigations so we have a better picture of what went wrong. But \"babbling\" about possible mitigations seems mostly fine.</li><li>An investigation similar to the one proposed <a href=\"https://forum.effectivealtruism.org/posts/HyHCkK3aDsfY95MoD/cea-ev-op-rp-should-engage-an-independent-investigator-to\">here</a> should be started fairly quickly, with the goal of producing an initial version of a report within ~2 months so we can start thinking pretty seriously about what mitigations/changes are needed, even if a finalized report would take longer.</li></ol><blockquote><p>My main thought is that I don't know why he committed fraud. Was it actually to utility maximize, or because he was just seeking status, or got too prideful or what?</p></blockquote><p>I think either way most of the articles you point to do more good than harm. Being more silent on the matter &nbsp;would be worse.</p><blockquote><p>I'd agree with this if I thought EA right now had a cool head. Maybe I should have said we should wait until EA has a cooler head before launching investigations.</p></blockquote><p>I'd hope that the investigation would be conducted mostly by an independent, reputable entity even if commissioned by EA organizations. Also, \"EA\" isn't a fully homogeneous entity and I'd hope that the people commissioning the investigation might be more cool-headed than the average Forum poster.</p>", "parentCommentId": "xx2jqJ6b9wEYoEGxJ", "user": {"username": "elifland"}}, {"_id": "SBucvwvgHxE4Mvncd", "postedAt": "2022-11-13T21:35:16.999Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<blockquote><p>Adjacently, some are arguing EA could have vetted FTX and Sam better, and averted this situation. This reeks of hindsight bias! Probably EA could not have done better than all the investors who originally vetted FTX before giving them a buttload of money!</p></blockquote><p>&nbsp;</p><p>I've seen this mentioned quite a few times, most prominently by Eliezer Yudowsky . I take the point that there were sophisticated investors such as Sequioa, and BlackRock who researched the company and could not detect <a href=\"https://www.nytimes.com/2022/11/11/technology/ftx-investors-venture-capital.html\">FTX's possible self-dealing with Alameda.</a> I think it's fair to say that EA probably could not have detected this FTX situation would blow up in exactly the way it did, even with more due diligence.</p><p>I also think that it's rational to expect that you apply due diligence to where you are <i>investing </i>your money than where you are <i>receiving </i>it from - and my understanding is that EA (on the whole) was not actually investing in FTX.&nbsp;</p><p>However, what I think should not be lost sight of is that FTX funding made up a very significant amount of EA's funding as a whole: <a href=\"https://80000hours.org/2021/07/effective-altruism-growing/\">in 2021, it was estimated FTX team's funding made up $16.5 billion of &nbsp;$46.1 billion</a> (roughly 36%). &nbsp;(Moskovitz's funding was even larger - roughly 49%.)&nbsp;</p><p>This is <i><strong>incredibly undiversified</strong></i>, especially given how volatile SBF and Moskovitz's wealth is . I am sure &nbsp;that this is far more undiversified than any large investor who actually put money in FTX. EA therefore stands to lose a lot more if the funding from FTX (or Moskovitz) fell away. I don't want this point to get lost in the debate.</p><p>Now, I'm not sure that the answer was that EA should have vetted its funding more. When people are offering you \"free\" money,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreffckrr6bpqxs\"><sup><a href=\"#fnfckrr6bpqxs\">[1]</a></sup></span>&nbsp;I don't think there is too much obligation to vet it (above any legal obligations that might exist). &nbsp;I think the answer is probably that EA should have thought about its risk exposure more, given how undiversified and volatile its funding is. &nbsp;In particular:</p><ul><li>what might happen if FTX or Moskovitz's funding dries up for any reason; and&nbsp;</li><li>how any negative consequences of that situation could be mitigated.&nbsp;</li></ul><p>For example, I did see somewhere that there had been a statement somewhere suggesting that EAs personally should diversify away from crypto, given how exposed EA is to it generally, but that did not seem to be a very prominent, widely-advertised piece of advice.&nbsp;</p><p>I know also that there is some general career advice for people to build up a decent financial runway for themselves. Perhaps there should have been greater emphasis to the community that if they rely on funding &nbsp;(grants, salaries) that is undiversified, they should factor that risk in and weigh it with their personal risk appetite. &nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnfckrr6bpqxs\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreffckrr6bpqxs\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I leave aside the question of whether SBF was using EA to \"launder\" his reputation and therefore arguably the money was not entirely \"free\". I don't have an informed view on that.&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Trish"}}, {"_id": "uyySDaaa2ABCk8tRd", "postedAt": "2022-11-13T21:43:32.449Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<blockquote><p>It is uncertain whether SBF intentionally committed fraud, or just <a href=\"https://nitter.net/SBF_FTX/status/1590709172936798208#m\">made a mistake</a>, but people seem to be reacting as if <a href=\"https://forum.effectivealtruism.org/posts/HyHCkK3aDsfY95MoD/cea-ev-op-rp-should-engage-an-independent-investigator-to\">the</a> <a href=\"https://forum.effectivealtruism.org/posts/XHrHsrQGyr4NnqCA7/we-must-be-very-clear-fraud-in-the-service-of-effective\">takeaway</a> <a href=\"https://forum.effectivealtruism.org/posts/txGgPvKgZFpphdkHe/my-reaction-to-ftx-appalled\">from</a> <a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx\">this</a> is that fraud is bad.</p></blockquote><p>Just because <i>you </i>feel uncertain doesn't mean the appropriate epistemic state for everyone to be in is to be uncertain too. You have to be pretty confident that you've researched all the available information if you're going to tell others that they're prematurely coming to conclusions. Sometimes it really is possible to tell with high confidence whether fraud was committed or not (in some way or another), even if the details aren't out. I think this is one such instance.</p>", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "fgMt55tnfHayHYJuF", "postedAt": "2022-11-13T21:47:59.785Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>For instance, were you aware of this WSJ article linked in this tweet: <a href=\"https://twitter.com/AutismCapital/status/1591454455203262467\">https://twitter.com/AutismCapital/status/1591454455203262467</a></p><p>(I wouldn't immediately trust anything I read on the topic since things are evolving quickly, but there's also a complete lack of exonerating information or theories about how it wasn't fraud. Also some insiders have appeared on streams by now and I haven't seen anyone defend FTX leadership so far.)&nbsp;</p>", "parentCommentId": "uyySDaaa2ABCk8tRd", "user": {"username": "Lukas_Gloor"}}, {"_id": "3NweL3BJzgqkEKqac", "postedAt": "2022-11-13T22:08:11.217Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>I agree that we should be cautious about over-correcting too quickly based on incomplete, biased, and dubious information.&nbsp;</p><p>&nbsp;There are huge numbers of unverified rumors flying around, especially on Twitter and social media. &nbsp;The exact nature and scope of the FTX/Alameda problems remain unclear. It's hard to know what the moral and organizational lessons are when many of the key facts of the matter aren't yet publicly known.&nbsp;</p><p>There's a temptation in any sudden, surprising crisis to try to react on the same time scale, with sudden, dramatic action. In response to any catastrophe, there's a bias to 'do something, anything, take action now!'&nbsp;</p><p>Partly this is an evolutionary mismatch grounded in human psychology, because prehistoric crises typically involved direct, immediate, physical threats (predators, warfare, natural disasters, plagues, starvation) that required direct, immediate, physical action.&nbsp;</p><p>Partly it's a public relations issue, where organizations are expected to respond within a few 24-hour news cycles of the crisis arising.</p><p>But I think, given the low proportion of information we have to information we'd need to have to make informed course-corrections, we should have the epistemic and moral humility to go a little slower in trying to figure out what lessons we should learn from all this.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "b3GpMhimBbhEhYZsT", "postedAt": "2022-11-13T22:25:13.464Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>This is only very loosely related to your post, but the current situation somewhat reminds me of Scott's <a href=\"https://astralcodexten.substack.com/p/a-cyclic-theory-of-subcultures\">Cyclic Theory Of Subcultures</a>. In that model, the sudden loss of resources available to EA might push the movement from the Growth phase into the Involution phase, so there are suddenly new incentives to critizice one another and vie for the remaining resources and status:</p><blockquote><p>During this phase, a talented status-hungry young person who joins the movement is likely to expect status but not get it. The frontier is closed; there’s no virgin territory to go homesteading in. The only source of status is to seize someone else’s - ie to start a fight.</p><p>Sometimes these fights are object-level: the movement’s art is ugly, its intellectual arguments are false, its politics are unjust. But along with the object level disagreements, there are always accusations that accurately reflect status-famine, ones like “the leaders of this movement are insular and undemocratic” or “the elites don’t listen to criticism”. These accusations may or may not be true. But during the Growth phase, nobody makes them, even when they are true; during the Involution phase, people always make them, even when they aren’t.</p><p>Someone with very novel and interesting criticism might start an entirely new subculture based on their ideas; their complaints might suggest a new research direction with unexplored vistas and plenty of free energy. But more likely, they’ll have more minor criticism, and end up vying for the same pool of resources and subcultural energy, only wanting it to be <i>their</i> pool rather than other people’s. This person is now a counterelite (or as they used to call it, a heresiarch).</p></blockquote>", "parentCommentId": null, "user": {"username": "tobias-daenzer"}}, {"_id": "5ZnjiczPv2BLTnvfL", "postedAt": "2022-11-14T02:28:47.919Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>Just for some perspective here, &nbsp;the DOJ could be pursuing SBF for wire fraud, which comes with a maximum sentence of twenty years. FTX's bankruptcy couldn't be construed as a mistake past the first day or so of last week, and this is still very generous. I find that this forum has consistently underestimated how grievous the actions taken by SBF, Alameda and FTX have been compared to the individuals I know who work in finance or crypto.&nbsp;</p><p>https://fortune.com/crypto/2022/11/13/could-sam-bankman-fried-go-to-prison-for-the-ftx-disaster/</p>", "parentCommentId": "xeEdrMJfgpncsQ5PB", "user": {"username": "Persona14246"}}, {"_id": "XEAsc5RbdnnTRKnPY", "postedAt": "2022-11-14T02:31:00.779Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>Which part of my comment did you find as underestimating how grievous SBF/Alameda/FTX's actions were? (I'm genuinely unsure)</p>", "parentCommentId": "5ZnjiczPv2BLTnvfL", "user": {"username": "elifland"}}, {"_id": "sAdCsnnRi3yr6Nwei", "postedAt": "2022-11-14T02:35:54.716Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>Sorry for the confusion, I was adding on to your comment. I agree with you obviously. It was more a statement on the forum over the past five-six days.&nbsp;</p>", "parentCommentId": "XEAsc5RbdnnTRKnPY", "user": {"username": "Persona14246"}}, {"_id": "LLqJxTpcf3umBbas4", "postedAt": "2022-11-14T02:51:24.099Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>EA should absolutely be vetting its funding more. &nbsp;You already gave three reasons: risk of the funding drying up (diversification being a possible solution), legal obligations (as evidenced by the possibility of clawbacks), and the reputational effects of EA laundering its funders' reputations. There are also significant reputational effects going the other way, as evidenced by the costs of SBF's fall to EA's reputation.</p>", "parentCommentId": "SBucvwvgHxE4Mvncd", "user": {"username": "Sam Elder"}}, {"_id": "kdxG9Nxqw8zX6oLDa", "postedAt": "2022-11-14T03:24:42.399Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>That's a max of 20 years per count, by the way. If there was massive fraud, hard to accomplish that in only a single count of wire fraud...</p>\n", "parentCommentId": "5ZnjiczPv2BLTnvfL", "user": {"username": "Jason"}}, {"_id": "EGiHgst8Ht8ZXDzi8", "postedAt": "2022-11-14T03:52:11.284Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>I guess it depends on what we mean by \"vetting funding\". EA should definitely do more to understand &nbsp;and manage the nature and extent of the risks it is exposed to - i.e. general risk management. I don't think we need to wait for much more information to make such an assessment - the way this has unfolded with so many grant recipients, etc seeming to have been caught completely unprepared is enough evidence that the EA community's risk management and communication were lacking.&nbsp;</p><p>But some people also seem to suggest \"vetting funding\" means EA should be trying to find fraud or other malfeasance in its donors. (That is suggested by the OP's post and is what I meant by \"vetting funding\" in my previous comment). I'm less sure about this claim. It's not clear how much due diligence is required in these cases vs how much due diligence EA actually did. So this is something that, as the OP suggests, would benefit from more information before coming to a conclusion.&nbsp;</p><p>Edit: Put another way, I think there are two questions:</p><ul><li>Should EA have conducted better risk management? I think the answer on this question is quite clearly \"yes\".&nbsp;</li><li>Would that \"better risk management\" have detected this fraud?&nbsp;</li></ul><p>I've seen some discussions conflating the two. Even if the answer to the second is \"no \"or \"unclear\", &nbsp;EA's risk management practices could still be improved. That's all I'm saying.&nbsp;</p>", "parentCommentId": "LLqJxTpcf3umBbas4", "user": {"username": "Trish"}}, {"_id": "migFPzrNWYH5aCRN6", "postedAt": "2022-11-14T15:04:18.999Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>As far as I was concerned, by 24-36 hours(D+1-D+1.5) after the liquidity crisis turned fraud, I already raised the hypothesis of outright stealing and fraud to serious attention, and 48-72 hours after the crisis first broke (D+2-D+3) I assumed fraud and stealing was happening there. I also was right to distrust crypto several months before, because it's very structure lends it to fraud, with no other legal use.</p>\n<p>Links here:</p>\n<p><a href=\"https://www.currentaffairs.org/2022/05/why-this-computer-scientist-says-all-cryptocurrency-should-die-in-a-fire\">https://www.currentaffairs.org/2022/05/why-this-computer-scientist-says-all-cryptocurrency-should-die-in-a-fire</a></p>\n<p><a href=\"https://www.currentaffairs.org/2021/04/why-cryptocurrency-is-a-giant-fraud\">https://www.currentaffairs.org/2021/04/why-cryptocurrency-is-a-giant-fraud</a></p>\n", "parentCommentId": "5ZnjiczPv2BLTnvfL", "user": {"username": "Sharmake"}}, {"_id": "NmuAqGH3i3W4wfMsd", "postedAt": "2022-11-14T15:37:21.989Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>Hi Trish,</p><p>Risk management as a field (or component of internal auditing) has ground rules where it can determine the key areas of how a certain organization should function and what are the areas where such org may fail. At its basic form, it will Risk managers are assessing inflows and outflows of cash and the policies behind those functions. They will also see how the management process is being performed and potential conflicts of interest issues.&nbsp;</p><p>Setting up an internal audit function that regularly assess the risk landscape of any EA org the soonest can help avert future fraud. As I have mentioned in my other posts, fraud is very hard to detect especially when collusion is in play - yet I again strongly point out that this is the best practice in traditional systems of conducting transactions when large sums of money are involved. Not following best practices will always leave possibilities for gaps to where fraudulent actors may exploit.</p><p>All the best,</p><p>Miguel</p>", "parentCommentId": "EGiHgst8Ht8ZXDzi8", "user": {"username": "Miguel"}}, {"_id": "9gunqoCvzqi7gpEtM", "postedAt": "2022-11-16T23:43:04.523Z", "postId": "ArDhtEcRbkwo42N9H", "htmlBody": "<p>I think we should just <a href=\"https://forum.effectivealtruism.org/posts/dMcPi5BDy5mQHZHGH/stop-overreacting-re-ftx-sbf\"><strong>stop overreacting</strong></a>, period. This guy's money doesn't mean he is EA. No one person is EA.&nbsp;</p><p>If we spent as much time figuring out how to better be more effective as we do on self-loathing and self-over-analysis, we'd be further along.</p><p>IMHO. Of course, I could be wrong.</p>", "parentCommentId": null, "user": {"username": "MattBall"}}]