[{"_id": "dZ298Qn2uTpMXqkD4", "postedAt": "2023-06-06T15:58:58.157Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Model error higher than 1%?</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "W7xLPNsWmqe8C9Rmg", "postedAt": "2023-06-06T16:19:01.549Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Cool! I mostly like your decomposition/framing. A major nitpick is that robotics doesn't matter so much: dispatching to human actuators is probably cheap and easy, like listing mturk jobs or persuasion/manipulation.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "iuAYKgjEfDyTtfZFb", "postedAt": "2023-06-06T16:40:19.404Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Agreed. AGI can have great influence in the world just by dispatching humans.</p><p>But by the definition of transformative AGI that we use - i.e., that AGI is able to do nearly all human jobs - I don't think it's fair to equate \"doing a job\" with \"hiring someone else to do the job.\" To me, It would be a little silly to say \"all human work has been automated\" and only mean \"the CEO is an AGI, but yeah everyone still has to go to work.\"<br><br>Of course, if you don't think robotics is necessary for transformative AGI, then you are welcome to remove the factor (or equivalently set it to 100%). In that case, our prediction would still be &lt;1%.</p>", "parentCommentId": "W7xLPNsWmqe8C9Rmg", "user": {"username": "Ted Sanders"}}, {"_id": "Gdi4tNE24LWfHLtop", "postedAt": "2023-06-06T16:53:56.126Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Not reading the paper, and not planning to engage in much discussion, and stating beliefs without justification, but briefly commenting since you asked readers to explain disagreement:</p><p>I think this framework is bad and the probabilities are far too low, e.g.:</p><ul><li>We probably already have \"algorithms for transformative AGI.\"</li><li>The straightforward meaning of \"a way for AGIs to learn faster than humans\" doesn't seem to be relevant (seems to be already achieved, seems to be unnecessary, seems to be missing the point); e.g. language models are trained faster than humans learn language (+ world-modeling), and AlphaGo Zero went from nothing to superhuman in three days. Maybe you explain this in the paper though.</li><li>GPT-4 inference is much cheaper than paying humans $25/hr to write similar content.</li><li>We probably already have enough chips for AGI by 2043 without further scaling up production.</li></ul><hr><p>Separately, note that \"AI that can quickly and affordably be trained to perform nearly all economically and strategically valuable tasks at roughly human cost or less\" is a much higher bar than the-thing-we-should-be-paying-attention-to (which is more like takeover ability; see e.g. <a href=\"https://www.lesswrong.com/posts/n3w3ww9Xuf8SngBfE/replacement-for-ponr-concept\">Kokotajlo</a>).</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "cKjppt39XweQvqbcj", "postedAt": "2023-06-06T16:54:14.425Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>\"If you disagree with our admittedly imperfect guesses, we kindly ask that you supply your own preferred probabilities (or framework modifications).\"</i></p></blockquote><p>Three questions for you that would help us improve our model:</p><ul><li>What important error do you think is made by our model?</li><li>What modification would you propose to address the error?</li><li>What impact do you think your modification would have on the resultant forecast?</li></ul>", "parentCommentId": "dZ298Qn2uTpMXqkD4", "user": {"username": "Ted Sanders"}}, {"_id": "noFAFixSbqgKwfPtH", "postedAt": "2023-06-06T16:59:28.782Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>\"I think this framework is bad and the probabilities are far too low.\"</i></p></blockquote><p>Setting aside assessments of the probabilities (which are addressed in the paper), what do you think is bad about the framework? How would you suggest we improve it?</p>", "parentCommentId": "Gdi4tNE24LWfHLtop", "user": {"username": "Ted Sanders"}}, {"_id": "qGG74LjgGKgq4H6tF", "postedAt": "2023-06-06T17:03:20.153Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I mean, I don't think all of your conditions are necessary (e.g. \"We invent a way for AGIs to learn faster than humans\" and \"We massively scale production of chips and power\") and I think together they carve reality quite far from the joints, such that breaking the AGI question into these subquestions doesn't help you think more clearly [edit: e.g. because compute and algorithms largely trade off, so concepts like 'sufficient compute for AGI' or 'sufficient algorithms for AGI' aren't useful].</p>", "parentCommentId": "noFAFixSbqgKwfPtH", "user": {"username": "zsp"}}, {"_id": "PcEDkmT5b8BC5YNCB", "postedAt": "2023-06-06T17:12:13.102Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Thank you for the clarification. To me, it is not 100.0% guaranteed that AGIs will be able to rapidly parallelize all learning and it is not 100.0% guaranteed that we'll have enough chips by 2043. Therefore, I think it helps to assign probabilities to them. If you are 100.0% confident in their likelihood of occurrence, then you can of course remove those factors. We personally find it difficult to be so confident about the future.</p><p>I agree that the success of AlphaZero and GPT-4 are promising notes, but I don't think they imply a 100.0% likelihood that AGI, whatever it looks like, will learn just as fast on every task.</p><p>With AlphaZero in particular, fast reinforcement training is possible because (a) the game state can be efficiently modeled by a computer and (b) the reward can be efficiently computed by a computer.</p><p>In contrast, look at a task like self-driving. Despite massive investment, our self-driving AIs are learning more slowly than human teenagers. <i>Part</i> of the reason for this is that conditions (a) and (b) no longer hold. First, our simulations of reality are imperfect, and therefore fleets must be deployed to drive millions of miles. Second, calculating reward functions (i.e., \"this action causes a collision\") is expensive and typically requires human supervision (e.g., test drivers, labelers), as the actual reward (e.g., a real-life collision) is even more expensive to acquire. This bottleneck of expensive feedback is partly why we can't just throw more GPUs at the problem and learn self-driving overnight in the way we can with Go.</p><p>Because computers are taking longer than humans to learn how to drive, despite billions invested and vast datasets, it feels plausible to us (i.e., more than 0% likely) that early AGIs will also take as long as humans to learn some tasks, particularly if those tasks cannot afford to spend billions on data acquisition (e.g., swim instructor).</p><p>In conclusion, I think it's totally reasonable to be more optimistic than we are that fast reinforcement learning on nearly all tasks will be solved for AGI by 2043. But I'd caution against presuming a 100.0% probability, which, to me, is what removing this factor from the framework would imply.</p>", "parentCommentId": "qGG74LjgGKgq4H6tF", "user": {"username": "Ted Sanders"}}, {"_id": "B2oW9r5LjiWotEK2a", "postedAt": "2023-06-06T18:09:51.948Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I don't think I understand the structure of this estimate, or else I might understand and just be skeptical of it. Here are some quick questions and points of skepticism.</p><p>Starting from the top, you say:</p><blockquote><p>We estimate optimistically that there is a 60% chance that all the fundamental algorithmic improvements needed for AGI will be developed on a suitable timeline.</p></blockquote><p>This section appears to be an estimate of all-things-considered feasibility of transformative AI, and draws extensively on evidence about how lots of things go wrong in practice when implementing complicated projects. But then in subsequent sections you talk about how even if we \"succeed\" at this step there is still a significant probability of failing because the algorithms don't work in a realistic amount of time.</p><p>Can you say what exactly you are assigning a 60% probability to, and why it's getting multiplied with ten other factors? Are you saying that there is a 40% chance that by 2043 AI algorithms couldn't yield AGI no matter how much serial time and compute they had available? (It seems surprising to claim that even by 2023!) Presumably not that, but what exactly are you giving a 60% chance?</p><p>(ETA: after reading later sections more carefully I think you might be saying 60% chance that our software is about as good as nature's, and maybe implicitly assuming there is a ~0% chance of being significantly better than that or building TAI without that? I'm not sure if that's right though, if so it's a huge point of methodological disagreement. I'll return to this point later.)</p><p>In section 2 you say:</p><blockquote><p>Transformative AGI by 2043 depends critically on the development of non-sequential reinforcement learning training methods with no real human analogue.</p></blockquote><p>And give this a 40% probability. I don't think I understand this claim or its justification. (This is related to my uncertainty about what your \"60%\" in the last section was referring to.)</p><p>It seems to me that if you had human-like learning you would be able to produce transformative AGI by 2043:</p><ol><li>In fact it looks like human-like learning would enable AI to learn human-level physical skills:<ol><li>10 years is sufficient for humans to learn most physical skills from scratch, and you are talking about 20 year timelines. So why is the serial time for learning even a candidate blocker?</li><li>Humans learn new physical skills (including e.g. operating unfamiliar machinery) within <strong>tens of hours</strong>. This requires transfer from other things humans have learned, but those tasks are not always closely related (e.g. I learn to drive a car based on experience walking) and AI systems will have access to transfer from tasks that seem if anything more similar (e.g. prediction of the relevant physical environments, predictions of expert behavior in similar domains, closed-loop behavior in a wide range of simulated environments, closed-loop behavior on physical tasks with shorter timescales, behavior in virtual environments...).</li><li>We can easily run tens of thousands of copies of AI systems in parallel. Existing RL is massively parallelizable. Human evolution gives no evidence about the difficulty of parallelizing learning in this way. Based on observations of human learning it seems extremely likely to me that parallelization 10,000 fold can reduce serial time by at least 10x (which is all that is needed). Extrapolations of existing RL algorithms seem to suggest serial requirements more like 10,000 episodes, with almost all of the compute used to run a massive number of episodes in parallel, which would be 1 year even for a 1-hour task. It seems hard to construct physical tasks that don't provide rich feedback after even shorter horizons than 1 hour (and therefore suitable for a gradient descent step given enough parallel samples) so this seems pretty conservative.</li></ol></li><li>Regardless of learning physical tasks, humans are able to learn to do R&amp;D after 20 years of experience. AI systems operate at 10x speed and most environments relevant to hardware and software R&amp;D can be sped up by at least 10x. So it seems like AI systems could be human-level at a wide range of tasks, sufficient to accelerate further AI progress, even if they just used non-parallelized human learning over 2 years. If you really thought physical tasks were somehow impossibly difficult (which I don't think is justified) then this becomes the dominant path to AGI. This is particularly important because multiple of your later points also seem to rest on the distinctive difficulty of automating physical tasks, which should just shift your probability further and further to an explosion of automated R&amp;D which drives automation of physical labor.</li></ol><p>I think you are disagreeing with these claims, but I'm not sure about that. For example, you mention parallelizable learning but seem to give it &lt;10% probability despite the fact that it is the overwhelmingly dominant paradigm in current practice and you don't say anything about why it might not work.</p><p>(This isn't super relevant to my mainline view, since in fact I think AI is <i>much</i> worse at learning quickly than humans and will likely be transformative way before reaching parity. This is related to the general point about being unnecessarily conjunctive, but here I'm just trying to understand and express disagreement with the particular path you lay out and the probabilities you assign.)</p><p>In section 3 you say:</p><blockquote><p>Software and hardware efficiencies combine to surpass current computation cost efficiency, and/or the efficiency of the human brain, by at least five orders of magnitude.</p></blockquote><p>I think you claim that each synapse firing event requires about 1-10 million floating point operations (with some error bars), and that there is only a 16% chance that computers will be able to do enough compute for $25/hour.</p><p>This is probably the part of the report I am most skeptical of:</p><ul><li>How do you square this with our experience in AI so far? Overall you seem to think it is possible that AI will be as effective as brains but unlikely to be much better. But if a biological neuron is probably ten million times more efficient than an artificial neuron, then aren't we already much better than biology in tons of domains? Is there <strong>any</strong> task for which performance can be quantified and where you think this estimate provides a sane guideline to the inference-time compute required to solve the task? Shouldn't you be putting <i>significant</i> probability on our algorithms being radically better than biology in many important ways?&nbsp;<ul><li>Replicating the human visual cortex should take millions of times more compute than we have ever used, yet we can match human performance on a range of quantifiable perceptual tasks and are making rapid progress, and I'm actually not aware of tasks where it's even plausible that we are 6 orders of magnitude away.</li><li>Learned policies for robotic control using only hundreds of thousands of neurons already seem to reach comparable competence to insects, but you should expect it to be significantly worse than a nematode. Aren't you surprised to observe successful grasping and walking?</li><li>Traditional control systems like those used by Boston Dynamics seem to produce more competent motor control than small animals despite using amounts of compute close to 1 flop per synapse. You focus on ML, but I don't know why---isn't classical control a more reasonable point of comparison to small animals that have algorithms designed directly by evolution rather than learned in a lifetime, and doesn't your argument very strongly predict that it should be impossible?</li><li>Qualitatively it's hard to compare GPT-3 to humans, but just to be clear you are saying that it should behave like a brain with ~1000 neurons. This is at least surprising (e.g. I think would have led to big misses if it had been used to make any qualitative predictions), and to me casts doubt on a story where you can't get transformative AI using less than the analog of a hundred billion neurons.</li></ul></li><li>Your biological analysis seems to hinge on the assertion that precise simulation of neurons is necessary to get similar levels of computational utility (and even from there the analysis is pretty conservative, e.g. by assuming that performing that you need to perform a very expensive computation thousands of times a second). I don't personally consider this plausible and I think the main argument given for it is that \"if not, why would we have all these proteins?\" which I don't find persuasive (since synapses are under a huge number of important constraints and serve many important functions beyond implementing computationally complex functions at inference time). I've seen zero candidates for useful purposes for such an incredible amount of local computation with negligible quantities of long-distance communication, and there are very few examples of human-designed computations structured in this way / it seems to involve an extremely implausible model of what neurons are doing (apparently some nearly-embarassingly parallelizable task with work concentrated in individual neurons?). I don't really want to argue with this at length, but want to flag that you are very confident about it and it drives a large part of your estimate whereas something like 50-50 seems more appropriate even before updating on the empirical success of ML.</li><li>In general you seem to be making the case very unnecessarily conjunctive---you are asking how likely it is that we will find algorithms as good as the brain, and then <strong>also</strong> build computers that operate at the Landauer limit (as you are apparently confident the brain does), and then <strong>also</strong> deploy AI in a way that is competitive at a $25/hour price point, and so on. But in fact one of these areas can outperform your benchmark (and if you are right in this section, then it's definitely the case that we are radically more efficient than biology on many tasks already!), and it seems like you are dropping a lot of probability by ignoring that possibility. It's like asking about the probability that a sum of 5 normal distributions will be above the mean, and estimating it's 1/2^5 because each of 5 normal distributions needs to be above its mean.</li></ul><p>(<strong>ETA: </strong>this<strong> </strong>criticism of section 3 is unfair: you do discuss the prospect of much better than human performance in the 2-page section \"On the computational intensity of AGI,\" and indeed this plays a completely central role in your bottom line estimate. But I'm still left wondering what the earlier 60% and 40% (and all the other numbers!) are supposed to represent, given that you are apparently putting all the work of \"maybe humans will design efficient algorithms that are as good as the brain\" in this section. You also don't really discuss existing experience, where your estimates already appear to be many orders of magnitude off in domains where it is easiest to make comparisons between biology and ML (like vision or classical control) and where I don't see how to argue we aren't already 1000x better than biology using your 10 million flops per synapse number. Aside from me disagreeing with your mean, you describe these as conservative error bars since they put 20% probability on 1000x improvements over biology, but I think that's really not the case given that it includes uncertainty about the useful compute done by the brain (where you already disagree by &gt;&gt;3 OOMs with plausible estimates) as well as algorithmic progress (where 1000x improvements over 20 years seem common both within software and ML).)</p><p>I'll stop here rather than going on to sections 4+, though I think I have a lot to object to along similar lines (primarily that the story is being made unreasonably conjunctive).</p><p>Overall your estimation strategy looks crazy to me and I'm skeptical of the the implicit claim that this kind of methodology would perform well in historical examples. That said, if this sort of methodology actually does work well in practice then I think that trumps some a priori speculation and would be an important thing for me to really absorb. Your personal forecasting successes seem like a big part of the evidence for that, so it might be helpful to understand what kinds of predictions were involved and how methodologically analogous they are. Superficially it looks like the SciCast technology forecasting tournament is by far the most relevant; is there a pointer to the list of questions (other info like participants and list of predictions would also be awesome if available)? Or do you think one of the other items is more relevant?</p>", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "eMSM7fJwzqLKPHvRc", "postedAt": "2023-06-06T18:23:31.538Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>One thing I find deeply unconvincing about such a low probability (&lt; 1%) and that does not require expert knowledge is that other ways to slice this would yield much higher estimates.</p>\n<p>E.g. it seems difficult to justify a less than 10% probability that there will be really strong pressures to develop AGI and it seems similarly difficult to justify a less than 10% success probability given such an effort and what we now know.</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "7xsrPGW5hBMuDWBEr", "postedAt": "2023-06-06T19:25:41.422Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>You start off saying that existing algorithms are not good enough to yield AGI (and you point to the hardness of self-driving cars as evidence) and fairly likely won't be good enough for 20 years. And also you claim that existing levels of compute would be a way too low to learn to drive even if we had human-level algorithms. Doesn't each of those factors on its own explain the difficulty of self-driving? How are you also using the difficulty of self-driving to independently argue for a <strong>third</strong> conjunctive source of difficulty?</p><p>Maybe another related question: can you make a forecast about human-level self-driving (e.g. similar accident rates vs speed tradeoffs to a tourist driving in a random US city) and explain its correlation with your forecast about human-level AI overall? If you think full self-driving is reasonably likely in the next 10 years, that superficially appears to undermine the way you are using it as evidence for very unlikely AGI in 20 years. Conversely, if you think self-driving is very unlikely in the next 10 years, then it would be easier for people to update their overall views about your forecasts after observing (or failing to observe) full self-driving.</p><p>I think there is significantly more than a 50% chance that there will be human-level self-driving cars, in that sense, within 10 years. Maybe my chance is 80% though I haven't thought about it hard. (Note that I already lost one bet about self-driving cars: in 2017 my median for # of US cities where a member of the public could hail a self-driving taxi in mid-2023 was 10-20, whereas reality turned out to be 0-1 depending on details of the operationalization in Phoenix. But I've won and lost 50-50 bets about technology in both the too-optimistic and too-pessimistic directions, and I'd be happy to bet about self-driving again.)</p><p>(Note that I also think this is reasonably likely to be preempted by explosive technological change driven by AI, which highlights an important point of disagreement with your estimate, but here I'm willing to try to isolate the disagreement about the difficulty of full self-driving.)</p><p><strong>ETA:</strong> let me try to make the point about self-driving cars more sharply. You seem to think there's a &lt;15% chance that by 2043 we can do what a human brain can do even using 1e17 flops (a 60% chance of \"having the algorithms\" and a 20% chance of being 3 OOMs better than 1e20 flops). Driving uses quite a lot of the functions that human brains are well-adapted to perform---perception, prediction, planning, control. If we call it one tenth of a brain, that's 1e16 flops. Whereas I think existing self-driving cars use closer to 1e14 flops. So shouldn't you be pretty much shocked if self-driving cars could be made to work using <i>any</i> amount of data with so little computing hardware? How can you be making meaningful updates from the fact that they don't?</p>", "parentCommentId": "PcEDkmT5b8BC5YNCB", "user": {"username": "Paul_Christiano"}}, {"_id": "WQF8aHKDn5MFnfoQS", "postedAt": "2023-06-06T20:41:53.234Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Excellent comment; thank you for engaging in such detail. I'll respond piece by piece. I'll also try to highlight the things you think we believe but don't actually believe.</p><h3>Section 1: Likelihood of AGI algorithms</h3><blockquote><p><i>\"Can you say what exactly you are assigning a 60% probability to, and why it's getting multiplied with ten other factors? Are you saying that there is a 40% chance that by 2043 AI algorithms couldn't yield AGI no matter how much serial time and compute they had available? (It seems surprising to claim that even by 2023!) Presumably not that, but what exactly are you giving a 60% chance?</i></p></blockquote><p>Yes, we assign a 40% chance that we don't have AI algorithms by 2043 capable of learning to do nearly any human task with realistic amounts of time and compute. Some things we probably agree on:</p><ul><li>Progress has been promising and investment is rising.</li><li>Obviously the development of AI that can do AI research more cheaply than humans could be a huge accelerant, with the magnitude depending on the value-to-cost ratio. Already GPT-4 is accelerating my own software productivity, and future models over the next twenty years will no doubt be leagues better (as well as more efficient).</li><li>Obviously slow progress in the past is not great evidence of slow progress in the future, as any exponential curve shows.</li></ul><p>But as we discuss in the essay, 20 years is not a long time, much easier problems are taking longer, and there's a long track record of AI scientists being overconfident about the pace of progress (counterbalanced, to be sure, by folks on the other side who are overconfident about things that would not be achieved and subsequently were). These factors give us pause, so while agree it's likely we'll have algorithms for AGI by 2043, we're not certain of it, which is why we forecast 60%. We think forecasts higher than 60% are completely reasonable, but we personally struggle to justify anything near 100%.</p><p>Incidentally, I'm puzzled by your comment and others that suggest we might already have algorithms for AGI in 2023. Perhaps we're making different implicit assumptions of realistic compute vs infinite compute, or something else. To me, it feels clear we don't have the algorithms and data for AGI at present.</p><blockquote><p><i>(ETA: after reading later sections more carefully I think you might be saying 60% chance that our software is about as good as nature's, and maybe implicitly assuming there is a ~0% chance of being significantly better than that or building TAI without that? I'm not sure if that's right though, if so it's a huge point of methodological disagreement. I'll return to this point later.)\"</i></p></blockquote><p>Lastly, no, we emphatically do not assume a ~0% chance that AGI will be smarter than nature's brains. That feels like a ridiculous and overconfident thing to believe, and it pains me that we gave this impression. Already GPT-4 is smarter than me in ways, and as time goes on, the number of ways AI is smarter than me will undoubtedly grow.</p><h3>Section 2: Likelihood of fast reinforcement training</h3><blockquote><p><i>10 years is sufficient for humans to learn most physical skills from scratch, and you are talking about 20 year timelines. So why is the serial time for learning even a candidate blocker?</i></p></blockquote><p>Agree - if we had AGI today, this would not be a blocker. This becomes a greater and greater blocker the later AGI is developed. E.g., if AGI is developed in 2038, we'd have only 4 years to train it to do nearly every human task. So this factor is heavily entangled with the timeline on which AGI is developed.</p><p>(And obviously the development of AGI is not going to a clean line passed on a particular year, but the idea is the same even applied to AGI systems developed gradually and unevenly.)</p><blockquote><p><i>We can easily run tens of thousands of copies of AI systems in parallel. Existing RL is massively parallelizable. Human evolution gives no evidence about the difficulty of parallelizing learning in this way. Based on observations of human learning it seems extremely likely to me that parallelization 10,000 fold can reduce serial time by at least 10x (which is all that is needed). Extrapolations of existing RL algorithms seem to suggest serial requirements more like 10,000 episodes, with almost all of the compute used to run a massive number of episodes in parallel, which would be 1 year even for a 1-hour task. It seems hard to construct physical tasks that don't provide rich feedback after even shorter horizons than 1 hour (and therefore suitable for a gradient descent step given enough parallel samples) so this seems pretty conservative.</i></p></blockquote><p>Agree on nearly everything here. I think the crux on which we differ is that we think interaction with the real world will be a substantial bottleneck (and therefore being able to run 10,000 parallel copies may not save us).<br><br>As I mentioned to Zach below:</p><blockquote><p>With AlphaZero in particular, fast reinforcement training is possible because (a) the game state can be efficiently modeled by a computer and (b) the reward can be efficiently computed by a computer.</p><p>In contrast, look at a task like self-driving. Despite massive investment, our self-driving AIs are learning more slowly than human teenagers. Part of the reason for this is that conditions (a) and (b) no longer hold. First, our simulations of reality are imperfect, and therefore fleets must be deployed to drive millions of miles. Second, calculating reward functions (i.e., \"this action causes a collision\") is expensive and typically requires human supervision (e.g., test drivers, labelers), as the actual reward (e.g., a real-life collision) is even more expensive to acquire. This bottleneck of expensive feedback is partly why we can't just throw more GPUs at the problem and learn self-driving overnight in the way we can with Go.</p></blockquote><p>To recap, we can of course parallelize a million self-driving car AIs and have them drive billions of miles in simulation. But that only works to the extent that (a) our simulations reflect reality and (b) we have the compute resources to do so. And so real self-driving car companies are spending billions on fleets and human supervision in order to gather the necessary data. In general, if an AGI cannot easily and cheaply simulate reality, it will have to learn from real-world interactions. And to the extent that it needs to learn from interactions with the consequences of its earlier actions, that training will need to be sequential.</p><blockquote><p><i>This isn't super relevant to my mainline view, since in fact I think AI is <strong>much</strong> worse at learning quickly than humans and will likely be transformative way before reaching parity.</i></p></blockquote><p>Agreed. Our expectation is that early AGIs will be expensive and uneven. If they end up being incredibly sample efficient, then this task will be much easier than we've forecasted.</p><p>In general, I'm pretty open to updating higher here. I don't think there are any insurmountable barriers here; but a sense that this will both be hard to do (as self-driving illustrates) as well as unlikely to be done (as all sorts of tasks not currently automated illustrate). My coauthor is a bit more negative on this factor than me and may chime in with his own thoughts later.</p><p>I personally struggle to imagine how an AlphaZero-like algorithm would learn to become the world's best swim instructor via massively parallelized reinforcement learning on children, but that may well be a failure of my imagination. Certainly one route is massively parallelized RL to become excellent at AI R&amp;D, then massively parallelized RL to become excellent at many tasks, and then quickly transferring that understanding to teaching children to swim, without any children ever drowning.</p><h3>Section 3: Operating costs</h3><p>Here, I think you ascribe many beliefs to us which we do not hold, and I apologize for not being clearer. I'll start by emphasizing what we do <i>not</i> believe.</p><blockquote><p><i>Overall you seem to think it is possible that AI will be as effective as brains but unlikely to be much better.</i></p></blockquote><p>We do not believe this.</p><p>AI is <i>already</i> vastly better than human brains at some tasks, and the number of tasks on which AI is superhuman will rise with time. We do expect that early AGIs will be expensive and uneven, as all earliest versions of a technology are. And then they will improve from there.</p><blockquote><p><i>just to be clear you are saying that [GPT-3] should behave like a brain with ~1000 neurons.</i></p></blockquote><p>We do not believe this.</p><blockquote><p><i>Your biological analysis seems to hinge on the assertion that precise simulation of neurons is necessary to get similar levels of computational utility</i></p></blockquote><p>We do not believe this.</p><blockquote><p><i>build computers that operate at the Landauer limit (as you are apparently confident the brain does)</i></p></blockquote><p>We do not believe this. We do not believe that brains operate at the Landauer limit, nor do we believe computers will operate at this limit by 2043.</p><p>Incidentally, I studied the Landauer limit deeply during my physics PhD and could write an essay on the many ways it's misinterpreted, but will save that for another day. :)</p><blockquote><p><i>It's like asking about the probability that a sum of 5 normal distributions will be above the mean, and estimating it's 1/2^5 because each of 5 normal distributions needs to be above its mean.</i></p></blockquote><p>We do not believe this.</p><p>To multiply these probabilities together, one cannot multiply their unconditional expectations; rather, one must multiply their cascading conditional probabilities. You may disagree with our probabilities, but our framework specifically addresses this point. Our <i>unconditional</i> probabilities are far lower for some of these events, because we believe they will be rapidly accelerated conditional on progress in AGI.</p><h3>Forecasting credentials</h3><blockquote><p><i>Your personal forecasting successes seem like a big part of the evidence for that, so it might be helpful to understand what kinds of predictions were involved and how methodologically analogous they are. Superficially it looks like the SciCast technology forecasting tournament is by far the most relevant; is there a pointer to the list of questions (other info like participants and list of predictions would also be awesome if available)? Or do you think one of the other items is more relevant?</i></p></blockquote><p>Honestly, I wouldn't put too much weight on my forecasting success. It's mostly a mix of common sense, time invested, and luck. I do think it reflects a decent mental model of how the world works, which leads to decent calibration for what's 3% likely vs 30% likely. The main reason I mention it in the paper is just to help folks realize that we're not wackos predicting 1% because we \"really feel\" confident. In many other situations (e.g., election forecasting, sports betting, etc.) I often find myself on the humble and uncertain side of the fence, trying to warn people that the world is more complicated and unpredictable than their gut is telling them. Even here, I consider our component forecasts quite uncertain, ranging from 16% to 95%. It's precisely our uncertainty about the future which leads to a small product of 0.4%. (From my point of view, you are staking out a much higher confidence position in asserting that AGI algorithms is very likely and that rapid self-improvement is very likely.)</p><p>As for SciCast, here's at least one publication that resulted from the project: <a href=\"https://ieeexplore.ieee.org/abstract/document/7266786\">https://ieeexplore.ieee.org/abstract/document/7266786</a><br><br>Example questions (from memory) included:</p><ul><li>What will be the highest reported efficiency of a perovskite photovoltaic cell by date X</li><li>What will be the volume of deployed solar in the USA by date X</li><li>At the Brazil World Cup, how far will the paraplegic exoskeleton kick the ball for the opening kickoff</li><li>Will Amazon offer drone delivery by date X</li><li>Will physicists discover Y by date X</li></ul><p>Most forecasts related to scientific discoveries and technological inventions and had timescales of months to years.</p><h3>Conclusion</h3><p>From your comment, I think the biggest crux between us is the rate of AI self-improvement. If the rate is lower, the world may look like what we're envisioning. If the rate is higher, progress may take off in a way not well predicted by current trends, and the world may look more like what you're envisioning. This causes our conditional probabilities to look too low and too independent, from your point of view. Do you think that's a fair assessment?</p><p>Lastly, can I kindly ask what your cascading conditional probabilities would be in our framework? (Let's hold the framework constant for this question, even if you prefer another.)</p><blockquote><p>If you disagree with our admittedly imperfect guesses, we kindly ask that you supply your own preferred probabilities (or framework modifications). It's easier to tear down than build up, and we'd love to hear how you think this analysis can be improved.</p></blockquote>", "parentCommentId": "B2oW9r5LjiWotEK2a", "user": {"username": "Ted Sanders"}}, {"_id": "LrSX7Mo5AMBEiurfk", "postedAt": "2023-06-06T21:46:01.400Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>Maybe another related question: can you make a forecast about human-level self-driving (e.g. similar accident rates vs speed tradeoffs to a tourist driving in a random US city) and explain its correlation with your forecast about human-level AI overall?</i></p></blockquote><p>Here are my forecasts of self-driving from 2018: <a href=\"https://www.tedsanders.com/on-self-driving-cars/\">https://www.tedsanders.com/on-self-driving-cars/</a><br><br>Five years later, I'm pretty happy with how my forecasts are looking. I predicted:</p><ul><li>100% that self-driving is solvable (looks correct)</li><li>90% that self-driving cars will not be available for sale by 2025 (looks correct)</li><li>90% that self-driving cars will debut as taxis years before sale to individuals (looks correct)</li><li>Rollout will be slow and done city-by-city, starting in the US (looks correct)</li></ul><p>Today I regularly take Cruises around SF and it seems decently likely that self-driving taxis are on track to be widely deployed across the USA by 2030. Feels pretty probable, but still plenty of ways that it could be delayed or heterogenous (e.g., regulation, stalling progress, unit economics).</p><p>Plus, even wide robotaxi deployment doesn't mean human taxi drivers are rendered obsolete. Seems very plausible we operate for many many years with a mixed fleet, where AI taxis with high fixed cost and low marginal cost serve baseload taxi demand while human taxis with lower fixed cost but higher marginal cost serve peak evening and commuter demand. In general it seems likely that as AI gets better we will see more complementary mixing and matching where AIs and humans are partnered to take advantage of their comparative advantages.</p><p>What counts as human-level is a bit fuzzier: is that human-level crash rates? human-level costs? human-level ability to deal with weird long tail situations?</p><p>On the specific question of random tourist vs self-driving vehicle in a <i>new</i> city, I predict that today the tourist is better (&gt;99%) and that by 2030 I'd still give the edge to the tourist (75%), acknowledging that the closer it gets the more the details of the metric begin to matter.</p><p>Overall there's some connection between self-driving progress and my AGI forecasts.</p><ul><li>If most cars and trucks are not self-driving by 2043, then it seems likely that we haven't achieved human-level human-cost AGI, and that would be a strong negative update.</li><li>If self-driving taxis still struggle with crowded parking lots and rare situations by 2030, that would a negative update.</li><li>If self-driving taxis are widely deployed across the US by 2030, but personal self-driving vehicles and self-driving taxis across Earth remain rare, that would be in line with my current worldview. Neutral update.</li><li>If self-driving improves and by 2030 becomes superhuman across a wide variety of driving metrics (i.e., not just crash rates, which can be maximized at the expense of route choice, speed, etc.), then that would be a positive update.</li><li>If self-driving improves by 2030 to the point that it can quickly learn to drive in new areas with new signage or new rules (i.e., we see a rapid expansion across all countries), that would be unexpected and a strong positive update on AGI.</li></ul><blockquote><p><i><strong>ETA:</strong> let me try to make the point about self-driving cars more sharply. You seem to think there's a &lt;15% chance that by 2043 we can do what a human brain can do even using 1e17 flops (a 60% chance of \"having the algorithms\" and a 20% chance of being 3 OOMs better than 1e20 flops). Driving uses quite a lot of the functions that human brains are well-adapted to perform---perception, prediction, planning, control. If we call it one tenth of a brain, that's 1e16 flops. Whereas I think existing self-driving cars use closer to 1e14 flops. So shouldn't you be pretty much shocked if self-driving cars could be made to work using any amount of data with so little computing hardware? How can you be making meaningful updates from the fact that they don't?</i></p></blockquote><p>Excellent argument. Maybe we should update on that, though I find myself resistant. Part of my instinctive justification against updating is that current self-driving AIs, even if they achieve human-ish level crash rates, are still very sub-human in terms of:</p><ul><li>Time to learn to drive</li><li>Ability to deal with complex situations like crowded parking lots</li><li>Ability to deal with rare situations like a firefighter waving you in a particular direction &nbsp;near a burning car</li><li>Ability to deal with custom signage</li><li>Ability to deal with unmapped routes</li><li>Ability to explain why they did what they did</li><li>Ability to reason about things related to driving</li><li>Ability to deal with heavy snow, fog, inclement weather</li></ul><p>It feels quite plausible to me that these abilities could \"cost\" orders of magnitude of compute. I really don't know.</p><p>Edit: Or, you could make the same argument about walking. E.g., maybe it engages 10% of our brain in terms of spatial modeling and prediction. But then there are all sorts of animals with much smaller brains that are still able to walk, right? So maybe navigation, at a crude level of ability, really needs much less than 10% of human intelligence. After all, we can sleepwalk, but we cannot sleep-reason. :)</p>", "parentCommentId": "7xsrPGW5hBMuDWBEr", "user": {"username": "Ted Sanders"}}, {"_id": "gdWBjodLjWnrpXBKQ", "postedAt": "2023-06-06T22:06:07.674Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>it seems difficult to justify a less than 10% probability that there will be really strong pressures to develop AGI</i></p></blockquote><p>I agree there will be really strong pressures to develop AGI. Already, many research groups are investing billions today (e.g., Google DeepMind, OpenAI, Anthropic). I'd assign 100% probability to this rather than &lt;10%. I guess it depends on how many billions of dollars of investment qualify as \"strong pressures.\"</p><blockquote><p><i>it seems similarly difficult to justify a less than 10% success probability given such an effort and what we now know</i></p></blockquote><p>Well, our essay is an attempt to forecast the likelihood of success, given what we know.</p><p>If you disagree with our estimates, would you care to supply your own? What conditional probabilities do you believe that result in a 10%+ chance of TAGI by 2043?<br><br>As I asked in the post:</p><blockquote><p>If you disagree with our admittedly imperfect guesses, we kindly ask that you supply your own preferred probabilities (or framework modifications). It's easier to tear down than build up, and we'd love to hear how you think this analysis can be improved.</p></blockquote>", "parentCommentId": "eMSM7fJwzqLKPHvRc", "user": {"username": "Ted Sanders"}}, {"_id": "KFceCFDq8Eghjx55C", "postedAt": "2023-06-06T22:09:24.109Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I appreciate the \"We avoid derailment by…\" sections – I think some forecasts have implicitly overly relied on a \"business as usual\" frame, and it's worth thinking about derailment.</p><blockquote><p>In short, we expect the typical outcome of an invasion is that TSMC’s output going to AGI will be drastically reduced for many years. This will slow transformative AGI timelines by years, as TSMC is the #1 producer of advanced semiconductor chips and makes 100% of advanced AI chips</p></blockquote><p>TSMC is obviously a market leader, but it seems weird to assume that TAI is infeasible without them? <a href=\"https://en.wikipedia.org/wiki/3_nm_process#Commercialization_history\">Samsung got to 3nm</a> before TSMC, and that headline is misleading (e.g. they reportedly had poor yields, and the entire labeling system is kind of made up) but my impression is that Samsung is only ~1 generation behind and Intel ~2?&nbsp;</p><p>If you had written your report even one year ago you wouldn't have been able to say that TSMC was responsible for cutting edge GPUs, as <a href=\"https://en.wikipedia.org/wiki/GeForce_30_series\">Nvidia was using Samsung</a>, right?</p><p>I can't tell how much of your probability mass comes from TSMC in particular versus thinking that e.g. a Taiwan invasion will likely escalate to a global conflict, but if it's coming from the former, it seems like this factor is overemphasized.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "zPCnMjSTeAKKZeFiX", "postedAt": "2023-06-06T22:25:42.949Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Thanks! We agree that a common mistake by forecasters is to equate low probability of derailment with negligible probability of derailment. The future is hard to predict, and we think it's worth taking tail risks seriously.</p><blockquote><p>it seems weird to assume that TAI is infeasible without [TSMC]?</p></blockquote><p>We do not assume TAI is infeasible without TSMC. That would be a terrible reasoning error, and I apologize for giving you that impression.</p><p>What we assume is that losing TSMC would likely delay TAI by a handful of years, as it would take:</p><ul><li>Time for NVIDIA to bid on capacity from Samsung</li><li>Time for Samsung to figure out to what extent it could get out of prior contracted commitments</li><li>Time for NVIDIA and Samsung engineers to retune GPU designs for Samsung's fab design rules</li><li>Time to manufacture the masks and put the GPUs into production</li><li>Time to iron out early manufacturing and yield issues</li><li>Time to build new fabs to absorb the tsunami of demand from TSMC customers (like Apple) and scale up to NVIDIA's original TSMC volumes</li></ul><p>And on top of this, there would massive geopolitical uncertainty that would slow things like investments into new fabs, as companies wonder whether the conflict will escalate or evaporate (both of which massively change the investment case).<br><br>What this might look like in reality will also depend on how close we are to transformative AGI.&nbsp;</p><p>Two example scenarios:<br><br>Today, for example, NVIDIA is probably not going to outbid Apple (Apple makes ~$10B in PROFIT per month, which would evaporate if they were starved of chips).</p><p>Or, imagine it's 2035 and NVIDIA is worth $10T and the semiconductor industry has been building fabs left and right to fuel the impending AGI boom. In such a world, where NVIDIA is the world's biggest chip designer, it may already dominate manufacturing on both Samsung and TSMC, meaning that if TSMC goes down, it cannot shift production to Samsung - because it already has production on Samsung.</p><p>In any case, we fully agree TAI is feasible without TSMC. But we think losing TSMC delays things by a few years, and if TAI is likely to come in the final 10 or 5 years of this period, then a few years might have a 50/50 shot of delaying things beyond 2043.</p>", "parentCommentId": "KFceCFDq8Eghjx55C", "user": {"username": "Ted Sanders"}}, {"_id": "9WAYTaseSD9Q9Hwg6", "postedAt": "2023-06-06T22:30:02.252Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p>Incidentally, I'm puzzled by your comment and others that suggest we might already have algorithms for AGI in 2023. Perhaps we're making different implicit assumptions of realistic compute vs infinite compute, or something else. To me, it feels clear we don't have the algorithms and data for AGI at present</p></blockquote><p>I would guess that more or less anything done by current ML can be done by ML from 2013 but with much more compute and fiddling. So it's not at all clear to me whether existing algorithms are sufficient for AGI given enough compute, just as it wasn't clear in 2013. I don't have any idea what makes this clear to you.</p><p>Given that I feel like compute and algorithms mostly trade off, hopefully it's clear why I'm confused about what the 60% represents. But I'm happy for it to mean something like: it makes sense at all to compare AI performance vs brain performance, and expect them to be able to solve a similar range of tasks within 5-10 orders of magnitude of the same amount of compute.</p><blockquote><p>But as we discuss in the essay, 20 years is not a long time, much easier problems are taking longer, and there's a long track record of AI scientists being overconfident about the pace of progress (counterbalanced, to be sure, by folks on the other side who are overconfident about things that would not be achieved and subsequently were).</p></blockquote><p>If 60% is your estimate for \"possible with any amount of compute,\" I don't know why you think that anything is taking a long time. We just don't get to observe how easy problems are if you have plenty of compute, and it seems increasingly clear that weak performance is often explained by limited compute. In fact, even if 60% is your estimate for \"doable with similar compute to the brain,\" I don't see why you are updating from our failure to do tasks with orders of magnitude less compute than a brain (even before considering that you think individual neurons are incredibly potent).</p><blockquote><h3>Section 2: Likelihood of fast reinforcement training</h3></blockquote><p>I still don't fully understand the claims being made in this section. I guess you are saying that there's a significant chance that the serial time requirements will be large and that will lead to a large delay? Like maybe you're saying something like: a 20% chance that it will add &gt;20 years of delay, a 30% chance of 10-20 years of delay, a 40% chance of 1-10 years of delay, a 10% chance of &lt;1 year of delay?</p><p>In addition to not fully understanding the view, I don't fully understand the discussion in this section or why it's justifying this probability. It seems like if you had human-level learning (as we are conditioning on from sections 1+3) then things would probably work in &lt;2 years unless parallelization is surprisingly inefficient. And even setting aside the comparison to humans, such large serial bottlenecks aren't really consistent with any evidence to date. And setting any concrete details, you are already assuming we have truly excellent algorithms and so there are lots of ways people could succeed. So I don't buy the number, but that may just be a disagreement.</p><p>You seem to be leaning heavily on the analogy to self-driving cars but I don't find that persuasive---you've already postulated multiple reasons why you shouldn't expect them to have worked so far. Moreover, the difficulties there also just don't seem very similar to the kind of delay from serial time you are positing here, they seem much more closely related to \"man we don't have algorithms that learn anything like humans.\"</p><blockquote><h3>Section 3: Operating costs</h3></blockquote><p>I think I've somehow misunderstood this section.</p><p>It looks to me like you are trying to estimate the difficulty of automating tasks by comparing to the size of brains of animals that perform the task (and in particular human brains). And you are saying that you expect it to take about 1e7 flops for each synapse in a human brain, and then define a probability distribution around there. Am I misunderstanding what's going on here or is that a fair summary?</p><p>(I think my comment about GPT-3 = small brain isn't fair, but the reverse direction seems fair: \"takes a giant human brain to do human-level vision\" --&gt; \"takes 7 orders of magnitude larger model to do vision.\" If that isn't valid, then why is \"takes a giant human brain to do job X\" --&gt; \"takes 7 orders of magnitude larger model to automate job X\" valid? Is it because you are considering the worst-case profession?)</p><blockquote><blockquote><p><i>Your biological analysis seems to hinge on the assertion that precise simulation of neurons is necessary to get similar levels of computational utility</i></p></blockquote><p>We do not believe this.</p></blockquote><p>I don't think I understand where your estimates come from, unless we are just disagreeing about the word \"precise.\" You cite the computational cost of learning a fairly precise model of a neuron's behavior as an estimate for the complexity per neuron. You also talk about some low level dynamics without trying to explain why they may be computationally relevant. And then you give pretty confident estimates for the useful computation done in a brain. Could you fill in the missing steps in that estimate a bit more, both for the mean (of 1e6 per neuron*spike) and for the standard deviation of the log (which seems to be about ~1 oom)?</p><blockquote><p><i>build computers that operate at the Landauer limit (as you are apparently confident the brain does)</i></p></blockquote><p>I think I misunderstood your claims somehow.</p><p>I think you are claiming that the brain does 1e20-1e21 flops of useful computation. I don't know exactly how you are comparing between brains and floating point operations. A floating point operation is more like 1e5 bit erasures today and is necessarily at least 16 bit erasures at fp16 (and your estimates don't allow for large precision reductions e.g. to 1 bit arithmetic). Let's call it 1.6e21 bit erasures per second, I think quite conservatively?</p><p>I might be totally wrong about the Landauer limit, but I made this statement by looking at Wikipedia which claims 3e-21 J per bit erasure at room temperature. So if you multiply that by 1.6e21 bit erasures per second, isn't that 5 W, nearly half the power consumption of the brain?</p><p>Is there a mistake somewhere in there? Am I somehow thinking about this differently from you?</p><blockquote><p>To multiply these probabilities together, one cannot multiply their unconditional expectations; rather, one must multiply their cascading conditional probabilities. You may disagree with our probabilities, but our framework specifically addresses this point. Our <i>unconditional</i> probabilities are far lower for some of these events, because we believe they will be rapidly accelerated conditional on progress in AGI.</p></blockquote><p>I understand this, but the same objection applies for normal distributions being more than 0. Talking about conditional probabilities doesn't help.</p><p>Are you saying that e.g. a war between China and Taiwan makes it impossible to build AGI? Or that serial time requirements make AGI impossible? Or that scaling chips means AGI is impossible? It seems like each of these just makes it harder. These are factors you should be adding up. Some things can go wrong and you can still get AGI by 2043. If you want to argue you can't build AGI if something goes wrong, that's a whole different story. So multiplying probabilities (even conditional probabilities) for none of these things happening doesn't seem right.</p><blockquote><p>Lastly, can I kindly ask what your cascading conditional probabilities would be in our framework? (Let's hold the framework constant for this question, even if you disagree with it.)</p></blockquote><p>I don't know what the events in your decomposition refer to well enough to assign them probabilities:</p><ul><li>I still don't know what \"algorithms for AGI\" means. I think you are somehow ignoring compute costs, but if so I don't know on what basis you are making any kind of generalization from our experience with the difficulty of designing extremely fast algorithms. In most domains algorithmic issues are ~the whole game and that seems true in AI as well.</li><li>I don't really know what \"invent a way for AGI to learn faster than humans\" means, as distinct from the estimates in the next section about the cost of AGI algorithms. Again, are you trying to somehow abstract out compute costs of learning here? Then my probabilities are very but uninteresting.</li><li>Taken on its own, it seems like the third probability (\"AGI inference costs drop below $25/hr (per human equivalent)\") implies the conclusion. So I assume you are doing something where you say \"Ignoring increases in demand and the possibility of supply chain disruptions and...\" or something like that? So the forecast you are making about compute prices aren't unconditional forecasts?</li><li>I don't know what level of cheap, quality robots you refer to. The quality of robotics needed to achieve transformative AI depends completely on the quality of your AI. For powerful AI it can be done with existing robot bodies, for weak AI it would need wildly superhuman bodies, at intermediate levels it can be done if humanoid robots cost millions of dollars each. And conversely the previous points aren't really defined unless you specify something about the robotic platform. I assume you address this in the section but I think it's going to be hard to define enough that I can give a number.</li><li>I don't know what massively scaling chips mean---again, it seems like this just depends crucially on how good your algorithms are. It feels more like you should be estimating multiple numbers and then seeing the probability that the product is large enough to be impactful.</li><li>I don't know what \"avoid derailment\" means. It seems like these are just factors that affect the earlier estimates, so I guess the earlier quantities were supposed to be something like \"the probability of developing AGI given that nothing weird happens in the world\"? Or something? But weird stuff is guaranteed to be happening in the world. I feel like this is the same deal as above, you should be multiplying out factors.</li></ul><blockquote><p>From your comment, I think the biggest crux between us is the rate of AI self-improvement. If the rate is lower, the world may look like what we're envisioning. If the rate is higher, progress may take off in a way not well predicted by current trends, and the world may look more like what you're envisioning. This causes our conditional probabilities to look too low and too independent, from your point of view. Do you think that's a fair assessment?</p></blockquote><p>I think this seems right.</p><p>In particular, it seems like some of your estimates make more sense to me if I read them as saying \"Well there will likely exist <i>some</i> task that AI systems can't do.\" But I think such claims aren't very relevant for transformative AI, which would in turn lead to AGI.&nbsp;</p><p>By the same token, if the AIs were looking at humans they might say \"Well there will exist <i>some</i> tasks that humans can't do\" and of course they'd be right, but the relevant thing is the single non-cherry-picked variable of overall economic impact. The AIs would be wrong to conclude that humans have slow economic growth because we can't do some tasks that AIs are great at, and the humans would be wrong to conclude that AIs will have slow economic growth because they can't do some tasks we are great at. The exact comparison is only relevant for assessing things like complementarity, which make large impacts happen strictly more quickly than they would otherwise.</p><p>(This might be related to me disliking AGI though, and then it's kind of on OpenPhil for asking about it. They could also have asked about timelines to 100000x electricity production and I'd be making broadly the same arguments, so in some sense it must be me who is missing the point.)</p><blockquote><p>I do think it reflects a decent mental model of how the world works, which leads to decent calibration for what's 3% likely vs 30% likely. The main reason I mention it in the paper is just to help folks realize that we're not wackos predicting 1% because we \"really feel\" confident. In many other situations (e.g., election forecasting, sports betting, etc.) I often find myself on the humble and uncertain side of the fence, trying to warn people that the world is more complicated and unpredictable than their gut is telling them.</p></blockquote><p>That makes sense, and I'm ready to believe you have more calibrated judgments on average than I do. I'm also in the business of predicting a lot of things, but not as many and not with nearly as much tracking and accountability. That seems relevant to the question at hand, but still leaves me feeling very intuitively skeptical about this kind of decomposition.</p>", "parentCommentId": "WQF8aHKDn5MFnfoQS", "user": {"username": "Paul_Christiano"}}, {"_id": "KifL3hz9Y4tt6XcXh", "postedAt": "2023-06-07T00:25:53.738Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Cool, I agree that, if most your probability mass is in the final few years before 2043, then a couple year delay is likely to push you over the 2043 deadline.</p>", "parentCommentId": "zPCnMjSTeAKKZeFiX", "user": {"username": "Ben_West"}}, {"_id": "vmexjHEyRK7ErH9zc", "postedAt": "2023-06-07T00:40:44.088Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>And also you claim that existing levels of compute would be a way too low to learn to drive even if we had human-level algorithms.</i></p></blockquote><p>This is not a claim we've made.</p>", "parentCommentId": "7xsrPGW5hBMuDWBEr", "user": {"username": "Ted Sanders"}}, {"_id": "mH6PpMmsWmeJys3cq", "postedAt": "2023-06-07T01:32:07.068Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I'd have to think more carefully about the probabilities you came up with and the model for the headline number, but everything else you discuss is pretty consistent with my view. (I also did a PhD in post-silicon computing technology, but unlike Ted I went right into industry R&amp;D afterwards, so I imagine I have a less synoptic view of things like supply chains. I'm a bit more optimistic, apparently—you assign &lt;1% probability to novel computing technologies running global-scale AI by 2043, but I put down a full percent!)</p><p>The table \"Examples transistor improvements from history (not cherry-picked)\" is interesting. I agree that the examples aren't cherry picked, since I had nearly the same list (I decided to leave out lithography and included STI and the CFET on imec's roadmap), but you could choose different prototype dates depending on what you're interested in.</p><p>I think you've chosen a fairly relaxed definition for \"prototype\", which is good for making the point that it's almost certain that the transistors of 2043 will use a technology we already have a good handle on, as far as theoretical performance is concerned.</p><p>Another idea would be to follow something like <a href=\"https://irds.ieee.org/images/files/pdf/2022/2022IRDS_ES.pdf#page=77\">this IRDS table that splits out \"early invention\" and \"focused research\"</a>. They use what looks like a stricter interpretation of invention—they don't explain further or give references, but I suspect they just have in mind more similarity to the eventual implementation in production. (There are still questions about what counts, e.g., 1987 for tri-gate or 1998 for FinFET?) That gives about 10–12 years from focused research to volume production.</p><p>So even if some unforseeable breakthrough is more performant or easily scalable than what we're currently thinking about, it still looks pretty tough to get it out by 2043.</p>", "parentCommentId": null, "user": {"username": "Muireall"}}, {"_id": "jgG2ii8Pix4YgWBtn", "postedAt": "2023-06-07T01:38:18.560Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>(<a href=\"https://forum.effectivealtruism.org/posts/XTNwCtsecACuARTcH/considerations-on-transformative-ai-and-explosive-growth\">Here's my submission</a>—I make some similar points but don't do as much to back them up. The direction is more like \"someone should try taking this sort of thing into account\"—so I'm glad you did!)</p>", "parentCommentId": "mH6PpMmsWmeJys3cq", "user": {"username": "Muireall"}}, {"_id": "dgqNqgfLa35fCPJpq", "postedAt": "2023-06-07T04:25:26.642Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>That's fair, this was some inference that is probably not justified.</p><p>To spell it out: you think brains are as effective as 1e20-1e21 flops. I<strong> </strong>claimed that humans use more than 1% of their brain when driving (e.g. our visual system is large and this seems like a typical task that engages the whole utility of the visual system during the high-stakes situations that dominate performance), but you didn't say this. I concluded (but you certainly didn't say) that a human-level algorithm for driving would not have much chance of succeeding using 1e14 flops.</p>", "parentCommentId": "vmexjHEyRK7ErH9zc", "user": {"username": "Paul_Christiano"}}, {"_id": "uRpnqoD66mnTsada8", "postedAt": "2023-06-07T06:18:03.465Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>It feels like you're double counting a lot of the categories of derailment at first glance? There's a highly conjunctive story of each of the derailments that makes me suspicious of multiplying them together as if they're conjunctive. I'm also confused as to how you're calculating the disjunctive probabilities because on page 78 you put \"Conditional on being on a trajectory to transformative AGI, we forecast a 40% chance of severe war erupting by 2042\". However, this doesn't seem to be an argument for derailment, it seems more likely it'd be an argument for race dynamics increasing?&nbsp;</p>", "parentCommentId": null, "user": {"username": "zichenghuang"}}, {"_id": "4j4Kr4ykT2thTRCW8", "postedAt": "2023-06-07T06:39:59.369Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I think you make a good argument and I'm open to changing my mind. I'm certainly no expert on visual processing in the human brain. Let me flesh out some of my thoughts here.</p><h3><strong>On whether this framework would have yielded bad forecasts for self-driving:</strong></h3><p>When we guess that brains use 1e20-1e21 FLOPS, and therefore that early AGIs might need 1e16-1e25, we're not making a claim about AGIs in general, or the most efficient AGI possible, but AGIs by 2043. We expect early AGIs to be horribly inefficient by later standards, and AGIs to get rapidly more efficient over time. AGI in 2035 will be less efficient than AGI in 2042 which will be less efficient than AGI in 2080.</p><p>With that clarification, let's try to apply our logic to self-driving to see whether it bears weight.</p><p>Supposing that self-driving needs 1% of human brainpower, or 1e18-1e19 FLOPS, and then similarly widen our uncertainty to 1e14-1e23 FLOPS, it might say yes, we'd be surprised but not stunned at 1e14 FLOPS being enough to drive (10% -&gt; 100%). But, and I know my reasoning is motivated here, that actually seems kind of reasonable? Like, for the first decade and change of trying, 1e14 FLOPS actually was not enough to drive. Even now, it's beginning to be enough to drive, but still is wildly less sample efficient than human drivers and wildly worse at generalizing than human drivers. So it feels like if in 2010 we predicted self-driving would take 1e14-1e23 FLOPS, and then a time traveler from the future told us that actually it was 1e14 FLOPS, but it would take 13 years to get there, and actually would still be subhuman, then honestly that doesn't feel too shocking. It was the low end of the range, took many years, and still didn't quite match human performance.</p><p>No doubt with more time and more training 1e14 FLOPS will become more and more capable. Just as we have little doubt that with more time AGIs will require fewer and fewer FLOPS to achieve human performance.</p><p>So as I reflect on this framework applied to the test case of self-driving, I come away thinking (a) it actually would have made reasonable predictions and (b) in hindsight I think we should have spent some pages modeling rates of AGI progress, as (obviously) AGI needs are not a fixed target but will decline rapidly over time.</p><p>In sum, it's not obvious to me that this logic would have generated bad predictions for self-driving, and so I'm still unconvinced that we've made a big blunder here.</p><h3><strong>On whether driving takes 1% of the human brain:</strong></h3><p>I'm going to go way outside my lane here, no pun intended, and I welcome comments from those more informed.</p><p>From my very brief Googling, sources say that something like half the brain is involved in vision, though that includes vision+motor, vision+attention, vision+spatial, etc. Going out on a limb, it seems if one knew that fact alone, they might feel reasonable saying that if we can solve vision, then AGI will only need twice as much compute, as vision is half of our brainpower. But it feels like we've made massive progress in vision (AlexNet, self-driving, etc.) without being on the cusp of AGI. Somehow even though the brain does lots of vision, these visual identification benchmarks feel far short of AGI.</p><p>My feeling is that what makes the human brain superior to today's AI is its ability to generalize from few examples. To illustrate, suppose you take an AI and a human and you train them over and over to drive a route from A to B. With 1e14 FLOPS and enough training, the AI may be able to eventually outperform the human. But now test the AI and human on route C to D. &nbsp;The human will be wildly better, as their pre-trained world model will have prevented overfitting to the features of route AB. The je ne sais quoi of our intelligence seems to be that we are better able to build models of the world that allow us to more easily reason and generalize to new situations.</p><p>To me, getting 1e14 FLOPS to drive a route AB and nothing else is a monumentally different challenge than getting 1e14 FLOPS to drive a route AB, plus any other hypothetical route you throw at it. The first is narrow intelligence. The second is general intelligence. So if we discover that an AI can self-drive route AB with only 1e14 FLOPS, should it be a giant update for how much compute AGI will need? I think it depends: if it's a narrow brittle overfit AI, then no. If it's a general (in the sense of general to any road) robust AI, then yes, it should be a big update.</p><p>So where does self-driving lay? Well, obviously self-driving cars with 1e14 FLOPS are able to generalize well to all sorts of pre-mapped and pre-simulated routes in a city. But at the same time, they appear to generalize pretty poorly overall - I wouldn't expect a Waymo vehicle to generalize well to a new city, let alone a new country.</p><p>Summarizing, I think the impressiveness of only needing 1e14 FLOPS to drive is really dependent on how well that driving generalizes. If it can generalize as well as human drivers, yes, that's a big update that AGI may need less 1e20-1e21 FLOPS. But today's self-driving doesn't cross that bar for me. It's quite brittle, and so I am less inclined to update.&nbsp;</p><p>Put another way, perhaps brittle self-driving takes 0.1% of human brainpower and robust self-driving takes 10% of human brainpower. Or something like that, who knows. It's really not clear to me that self-driving in general needs 1% of the human brain, if that self-driving generalizes very poorly to new situations.</p><p>Lastly, there is typically going to be a tradeoff between training compute and inference compute. If 1e14 FLOPS is enough to self-drive, but only with millions of miles driven and billions of miles simulated, that should far be less impressive than 1e14 FLOPS being enough to drive after only 100 miles of training. For all I know, it may be possible to get a good driver that only uses 1e12 FLOPS if we train it on even more compute and data; e.g., a billion miles of driving and a trillion miles of simulation. But even if that loosely extrapolates to AGI, it's only useful if we can afford the \"brain equivalent\" of a billion miles of training. If that's too costly, then the existence proof of a 1e12 FLOPS driver may be moot in terms of analogizing AGI inference costs. It's a pretty interesting question and we certainly could have added more modeling and discussion to our already lengthy essay.</p>", "parentCommentId": "dgqNqgfLa35fCPJpq", "user": {"username": "Ted Sanders"}}, {"_id": "jjpQ5XogBpT2G6BHP", "postedAt": "2023-06-07T06:52:38.551Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>To me, the odds of pandemic and wars and regulation feel decently independent, but perhaps I haven't thought deeply enough about pandemics causing depressions causing wars, or wars leading to engineered pandemics being released, etc.</p><p>Looking at the past 100ish years of history, the worst wars (world war I &amp; II), the worst pandemics (various flus, COVID19), and the worst recessions (great depression, great recession) all seem fairly independent.</p><p>In any case, we tried our best to come up with probabilities of each, conditional on the others not occurring.</p><p>What probabilities would you assign?</p><p>As we asked in our post:</p><blockquote><p><i>If you disagree with our admittedly imperfect guesses, we kindly ask that you supply your own preferred probabilities (or framework modifications). It's easier to tear down than build up, and we'd love to hear how you think this analysis can be improved.</i></p></blockquote>", "parentCommentId": "uRpnqoD66mnTsada8", "user": {"username": "Ted Sanders"}}, {"_id": "uXtHPKTZgudeTH76j", "postedAt": "2023-06-07T08:10:26.905Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Yeah I think I would just bin all of delay into one bucket such that they are not independent. For instance, the causal chain of WWI, Great Depression, and WWII seem quite contingent upon one another. I'll chew on how the binning works but nonetheless really appreciate this piece of work and it's really easy to read and understand -- as well as internally well reasoned. Didn't mean to come off too harsh.</p>", "parentCommentId": "jjpQ5XogBpT2G6BHP", "user": {"username": "zichenghuang"}}, {"_id": "oGLsEa3uKxrqqkoDE", "postedAt": "2023-06-07T09:23:58.949Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>This is a really impressive paper full of highly interesting arguments. I am enjoying reading it. That said, and I hope I'm not being too dismissive here, I have a strong suspicion that the central argument in this paper suffers from what Eliezer Yudkowsky calls the <a href=\"https://arbital.com/p/multiple_stage_fallacy/\">multiple stage fallacy</a>,</p>\n<blockquote>\n<p>The purported \"Multiple-Stage Fallacy\" is when you list multiple 'stages' that need to happen on the way to some final outcome, assign probabilities to each 'stage', multiply the probabilities together, and end up with a small final answer. The alleged problem is that you can do this to almost any kind of proposition by staring at it hard enough, including things that actually happen. [...]</p>\n</blockquote>\n<blockquote>\n<p>Often, people neglect to consider disjunctive alternatives - there may be more than one way to reach a stage, so that not all the listed things need to happen... So if you list enough stages, you can drive the apparent probability of anything down to zero, even if you seem to be soliciting probabilities from the reader.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Matthew_Barnett"}}, {"_id": "duhogS4Meo4XfwBtF", "postedAt": "2023-06-07T13:28:34.459Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>My quick rebuttal is the flaw you seem to also acknowledge. These different factors that you calculate are not separate variables. They all likely influence the probabilities of each other. (greater capabilities can give rise to greater scaling of manufacturing, since people will want more of it. Greater intelligence can find better forms of efficiency, which means cheaper to run, etc.) This is how you can use probabilities to estimate almost anything is extremely improbable, as you noted.</p>", "parentCommentId": null, "user": {"username": "Akmon Ra"}}, {"_id": "iph4b9zxqLW3CSZBG", "postedAt": "2023-06-07T13:53:35.694Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I think he's asking if your margin of error is &gt;.01</p>", "parentCommentId": "cKjppt39XweQvqbcj", "user": {"username": "Akmon Ra"}}, {"_id": "vfotQkraRcBTQmtvQ", "postedAt": "2023-06-07T15:50:37.561Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Thanks for the kind words.</p><p>Regarding the multiple stage fallacy, we recognize it's a risk of a framework like this and go to some lengths explaining why we think our analysis does not suffer from it. (Namely, in the executive summary, the discussion, and the appendix \"Why 0.4% might be less confident than it seems.\")</p><p>What are the disjunctive alternatives you think our framework misses?</p><blockquote><p><i>If you disagree with our admittedly imperfect guesses, we kindly ask that you supply your own preferred probabilities (or framework modifications). It's easier to tear down than build up, and we'd love to hear how you think this analysis can be improved.</i></p></blockquote>", "parentCommentId": "oGLsEa3uKxrqqkoDE", "user": {"username": "Ted Sanders"}}, {"_id": "Paf8Dk6Y5SMmWegN3", "postedAt": "2023-06-07T15:53:57.195Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>What is a margin of error, here, exactly?</p><p>The event will either happen (1) or not (0). The 0.4% already reflects our uncertainty. In general, I don't think it makes mathematical sense to discuss probabilities of probabilities.*<br><br>*although of course it can make sense to describe sensitivities of probabilities to new information coming in</p>", "parentCommentId": "iph4b9zxqLW3CSZBG", "user": {"username": "Ted Sanders"}}, {"_id": "kEeKgkrmZutoxkxvC", "postedAt": "2023-06-07T15:56:17.786Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Yep, that's admittedly a risk of a framework like this. We've tried our best to not to make that mistake, and have gone to some length explaining why we think we haven't. If you disagree, please help us by telling us which disjunctive paths you think we've missed or which probabilities you think we've underestimated.&nbsp;</p><p>As we asked in the post:</p><blockquote><p><i>If you disagree with our admittedly imperfect guesses, we kindly ask that you supply your own preferred probabilities (or framework modifications). It's easier to tear down than build up, and we'd love to hear how you think this analysis can be improved.</i></p></blockquote>", "parentCommentId": "duhogS4Meo4XfwBtF", "user": {"username": "Ted Sanders"}}, {"_id": "wEbaG4XHvJcTnApk5", "postedAt": "2023-06-07T17:01:25.913Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Like Matthew, I think your paper is really interesting and impressive.</p><p>Some issues I have with the methodology:</p><ul><li>Your framework excludes some factors that could cause the overall probability to <i>increase</i>.<ul><li>For example, I can think of ways that a great power conflict (over Taiwan, say) actually increases the chances of TAI. But your framework doesn't easily account for this.<ul><li>You could have factored it in in all or some of the other stages, but I'm not sure you have, and it seems generally like this asymmetry (the \"positive\" effect of an event is factored into various other stages if at all, but the \"negative\" effect of the same event is estimated on its own conjunctive stage) will tend to give lower overall probabilities than it should.</li></ul></li></ul></li><li>It seems like you sometimes don't fully condition on preceding propositions.<ul><li>You calculate a base rate of \"10% chance of [depression] in<br>the next 20 years\", and write: \"Conditional on being in a world on track toward transformative AGI, we estimate a ~0.5%/yr chance of depression, implying a ~10% chance in the next 20 years.\"<ul><li>But this doesn't seem like fully conditioning on a world with TAI that is cheap, that can automate ~100% of human tasks, and that can be deployed at scale, and that is relatively unregulated. It seems like once that happens, and when it's nearly happening (e.g. AIs automate 20% of 2022-tasks), the probability of a severe depression should be way below historical base rates?</li></ul></li><li>Similarly for \"We quickly scale up semiconductor manufacturing and<br>electrical generation\", it seems like you don't fully condition on a world where we have TAI that is cheap, that can automate ~100% of human tasks, and that can operate cheap, high-quality robots, and that can probably be deployed to some fairly wide extent even if not (yet) to actually automate ~all human labour.<ul><li>Like, your X100 is 100x as cost-effective as the H100, but that doesn't seem that far off what you'd get from by just projecting the Epoch trend for ML GPU price-performance out 2 decades?</li></ul></li><li>More generally, I think these sorts of things are really hard to get right (i.e. it's hard to imagine oneself in a conditional world, and estimate probabilities there without anchoring on the present world), and will tend to bias people to smaller overall estimates when using more conjunctive steps.</li></ul></li></ul>", "parentCommentId": "vfotQkraRcBTQmtvQ", "user": {"username": "Erich_Grunewald"}}, {"_id": "RbKaKp5PAPHwad6bp", "postedAt": "2023-06-07T17:43:57.406Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Thanks!</p><blockquote><p><i>Your framework excludes some factors that could cause the overall probability to <strong>increase</strong>.</i></p><ul><li><i>For example, I can think of ways that a great power conflict (over Taiwan, say) actually increases the chances of TAI. But your framework doesn't easily account for this.</i></li></ul></blockquote><p>Totally reasonable to disagree with us on some of these forecasts - they're rough educated guesses, after all. We welcome others to contribute their own forecasts. I'm curious: What do you think are the rough odds that invasion of Taiwan increases the likelihood of TAGI by 2043?</p><blockquote><p><i>But this doesn't seem like fully conditioning on a world with TAI that is cheap, that can automate ~100% of human tasks, and that can be deployed at scale, and that is relatively unregulated.</i></p></blockquote><blockquote><p><i>it seems like you don't fully condition on a world where we have TAI that is cheap, that can automate ~100% of human tasks, and that can operate cheap, high-quality robots, and that can probably be deployed to some fairly wide extent even if not (yet) to actually automate ~all human labour.</i></p></blockquote><p>Agree wholeheartedly. In a world with scaled, cheap TAGI, things are going to look wildly different and it will be hard to predict what happens. Change could be a lot faster than what we're used to, and historical precedent and intuition might be relatively poor guides relative to first principles thinking.</p><p>However, we feel somewhat more comfortable with our predictions <i>prior </i>to scaled, cheap AGI. Like, if it takes 3e30 - 3e35 operations to train an early AGI, then I don't think we can condition on that AGI accelerating us towards construction of the resources needed to generate 3e30 - 3e35 operations. It would be putting the cart before the horse.</p><p>What we can (and try to) condition on are potential predecessors to that AGI; e.g., improved narrow AI or expensive human-level AGI. Both of those we have experience with today, which gives us more confidence that we won't get an insane productivity explosion in the physical construction of fabs and power plants.</p><p>We could be wrong, of course, and we'll find out in 2043.</p>", "parentCommentId": "wEbaG4XHvJcTnApk5", "user": {"username": "Ted Sanders"}}, {"_id": "EAGGMgqBT6xhio4kF", "postedAt": "2023-06-07T17:51:48.383Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Related to this, you can only multiply probabilities if they're independent, but I think a lot of the listed probabilities are positively correlated, which means the joint probability is higher than their product. For example, it seems to me that \"AGI inference costs drop below $25/hr\" and \"We massively scale production of chips and power\" are strongly correlated.</p>\n", "parentCommentId": "oGLsEa3uKxrqqkoDE", "user": {"username": "MichaelDickens"}}, {"_id": "bvjePgjjgmoEGp2fr", "postedAt": "2023-06-07T18:16:46.388Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p>I'm curious: What do you think are the rough odds that invasion of Taiwan increases the likelihood of TAGI by 2043?</p></blockquote><p>Maybe 20% that it increases the likelihood? Higher if war starts by 2030 or so, and near 0% if it starts in 2041 (but maybe &gt;0% if it starts in 2042?). What number would you put on it, and how would you update your model if that number changed?</p><blockquote><p>However, we feel somewhat more comfortable with our predictions <i>prior </i>to scaled, cheap AGI. Like, if it takes 3e30 - 3e35 operations to train an early AGI, then I don't think we can condition on that AGI accelerating us towards construction of the resources needed to generate 3e30 - 3e35 operations. It would be putting the cart before the horse.</p><p>What we can (and try to) condition on are potential predecessors to that AGI; e.g., improved narrow AI or expensive human-level AGI. Both of those we have experience with today, which gives us more confidence that we won't get an insane productivity explosion in the physical construction of fabs and power plants.</p></blockquote><p>I think what you're saying here is, \"yes, we condition on such a world, but even in such a world these things won't be true for all of 2023-2043, but mainly only towards the latter years in that range\". Is that right?</p><p>I agree to some extent, but as you wrote, \"<i>transformative</i> AGI is a <i>much</i> higher bar than merely massive progress in AI\": I think in a lot of those previous years we'll still have AI doing lots of work to speed up R&amp;D and carry out lots of other economically useful tasks. Like, we <i>know</i> in this world that we're headed for AGI in 2043 or even earlier, so we should be seeing really capable and useful AI systems already in 2030 and 2035 and so on.</p><p>Maybe you think the progression from today's systems to potentially-transformative AGI will be discontinuous or something like that, with lots of progress (on algorithms, hardware, robotics, etc.) happening near the end?</p>", "parentCommentId": "RbKaKp5PAPHwad6bp", "user": {"username": "Erich_Grunewald"}}, {"_id": "FFkvCfCPPZMhxEtbn", "postedAt": "2023-06-07T19:04:08.982Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>The primary issue I guess is that the normal rules don't easily apply here. We don't have good past data to make predictions, so every new requirement added introduces more complexity (and chaos), which might make it less accurate than using fewer variables. Thinking in terms of \"all other factors remaining, what are the odds of x\" sounds less accurate, but might be the only way to avoid being consumed by all potential variables. Like, ones you don't even mention that I could name include \"US democracy breaksdown\", \"AIs hack the grid\", \"AIs break the internet/infect every interconnected device with malware\", etc.* You could just keep adding more requirements until your probabilities drop to near 0, because it'll be difficult to say with much confidence that any of them are &lt;.01 likely to occur, even though a lot of them probably are. It's probably better just to group several constraints together, and just give a probability that one or more of them occurs (example: \"chance that recession/war/regulation/other slows or halts progress\"), rather than trying to assess the likelihood of each one. Ordinarily, this wouldn't be a problem, but we don't have any data we could normally work with.</p><p>&nbsp;</p><p>Here's a brief writeup of some agreements/disagreements I have with the individual contraints.</p><p>&nbsp;</p><p>\"We invent algorithms for transformative AGI\"</p><p>I don't know how this is only 60%. I'd place &gt;.5 before 2030, let alone 2043. This is just guesswork, but we seem to be one or two breakthroughs away.</p><p><br>\"We invent a way for AGIs to learn faster than humans 40%\"</p><p>I don't really know what this means, why it's required, or why it's so low. I see in the paper that it mentions humans being sequential learners that takes years, but AIs don't seem to work that way. Imagine if GPT4 took years just to learn basic words. AIs also seem to already be able to learn faster than humans. They currently need more data, but less compute than a human brain. Computers can already process information much faster than a brain. And you don't even need them to learn faster than humans, since once they learn a task, they can just copy that skill to all other AIs. This is a critical point. A human will spend years in Med School just because a senior in the field can't copy their weights and send them to a grad student.</p><p>Also, I'm confused how this at .4, given that its conditional of TAI happening. If you have algorithms for TAI, why couldn't they also invent algorithms that learn faster than humans? We already see how current AIs can improve algorithmic efficiency (as just one recent example: https://www.deepmind.com/blog/alphadev-discovers-faster-sorting-algorithms). Improving algorithms is probably one of the easiest things a TAI could do, without having to do any physical world experimentation.</p><p><br>\"AGI inference costs drop below $25/hr (per human equivalent) 16%\"</p><p>I really don't see how this is 16%. Once an AI is able to obtain a new capability, it doesn't seem to cost much to reuse that capability. Example: GPT4, very expensive to train, but it can be used for cents on a dollar afterward. These aren't mechanical humans, they don't need to go through repeated training, knowledge expertise, etc. They only need to do it once, and then it just gets copied.</p><p>And, like above, if this is conditional on TAI and faster-than-human learning occurring, how is this only at .016? A faster-than-human TAI can (very probably) improve algorithmic efficiency to radically drive down the cost.&nbsp;</p><p><br>\"We invent and scale cheap, quality robots 60%\"</p><p>This is one where infrastructure and regulation can bottleneck things, so I can understand at least why this is low.</p><p><br>\"We massively scale production of chips and power 46%\"</p><p>If we get TAIs, I imagine scaling will continue or else radically increase. We're already seeing this, and current AIs have much more limited economic potential. We also don't know if we actually need to keep scaling or not, since (as I mentioned), algorithmic efficiency might make this unimportant.</p><p><br>\"We avoid derailment by human regulation 70%\"</p><p>Maybe?</p><p><br>\"We avoid derailment by AI-caused delay 90%\"</p><p>In the paper, it describes this as \"superintelligent but expensive AGI may itself warn us to slow progress, to forestall potential catastrophe that would befall both us and it.\"&nbsp;</p><p>That's interesting, but if the AI hasn't coup'd humanity already, wouldn't this just fall under 'regulation derails TAI'? Unless there is some other way progress halts that doesn't involve regulations or AI coups...</p><p><br>\"We avoid derailment from wars (e.g., China invades Taiwan) 70%\"</p><p>Possible, but I don't think this would derail things for 20 years. Maybe 5.</p><p><br>\"We avoid derailment from pandemics 90%\"</p><p>Pandemics also increase with the chances of TAI (or, maybe, they go down, depending, AI could possibly detect and predict a pandemic much better). This is one of the issues with all of this, everything is so entangled, and it's not actually that easy to say which way variables will influence each other. I'm pretty sure it's not 50/50 it goes one way or the other, so it probably does greatly influence it.</p><p><br>\"We avoid derailment from severe depressions\"</p><p>Not sure, here. It's not as though everyone will be going out and buying TPUs with or without economic worries. Not all industries slow or halt, even during a depression. Algorithmic efficiency especially seems unlikely to be affected by this.</p><p>&nbsp;</p><p>Overall, I think the hardware and regulatory constraints are the most likely limiting factors. I'm not that sure about anything else.</p><p>&nbsp;</p><p>*I originally wrote up another AI-related scenario, but decided it shouldn't be publicly stated at the moment.</p>", "parentCommentId": "kEeKgkrmZutoxkxvC", "user": {"username": "Akmon Ra"}}, {"_id": "SoHBuePb2AfuPLMc4", "postedAt": "2023-06-07T19:52:36.408Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Agreed. Factors like AI progress, inference costs, and manufacturing scale needed are massively correlated. We discuss this in the paper. Our unconditional independent forecast of semiconductor production would be much, much lower than our conditional forecast of 46%, for example.</p>\n", "parentCommentId": "EAGGMgqBT6xhio4kF", "user": {"username": "Ted Sanders"}}, {"_id": "cTuSvRurDxWkuFLvQ", "postedAt": "2023-06-07T20:06:11.064Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Not harsh at all; I genuinely appreciate the discussion. If there are good criticisms of our approach, I hope that we absorb them into an improved model rather than entrenching ourselves against them.</p>\n<p>The issue I see with grouping these factors is then how do we figure what forecast to make for the collective group? The intuitive approach I’d take is to look at the rates of pandemics, world wars, etc. So it feels like we’d still be basing the estimate on mostly independent considerations even if we smush the final product together at the end.</p>\n<p>Seems like a tricky forecasting problem in general. You don’t want a model with too many finicky specific scenarios, but you also don’t want amorphous uninterpretable blobs that arise from irreversibly blending many ingredients together.</p>\n<p>A model with 1,000 parameters isn’t going to convince anyone and neither will a model with just 1. We tried to keep to a manageable range of 10 overall factors, backed by a few dozen subfactors. But definitely room to move in either direction.</p>\n", "parentCommentId": "uXtHPKTZgudeTH76j", "user": {"username": "Ted Sanders"}}, {"_id": "SCeDp5fDsgHkfuxRG", "postedAt": "2023-06-08T05:19:20.384Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>I think in a lot of those previous years we'll still have AI doing lots of work to speed up R&amp;D and carry out lots of other economically useful tasks. Like, we know in this world that we're headed for AGI in 2043 or even earlier, so we should be seeing really capable and useful AI systems already in 2030 and 2035 and so on.</i></p><p><i>Maybe you think the progression from today's systems to potentially-transformative AGI will be discontinuous or something like that, with lots of progress (on algorithms, hardware, robotics, etc.) happening near the end?</i></p></blockquote><p>No, I actually fully agree with you. I don't think progress will be discontinuous, and I do think we will see increasingly capable and useful systems by 2030 and 2035 that accelerate rates of progress.</p><p>I think where we may differ is that:</p><ul><li>I think the acceleration will likely be more \"in line\" than \"out of line\" with the exponential acceleration we already see from improving computer tools and specifically LLM computer tools (e.g., GitHub Copilot, GPT-4). Already a software engineer today is many multiples more productive (by some metrics) than a software engineer in the 90s.</li><li>I think that tools that, say, cheaply automate half of work, or expensively automate 100% work probably won't lead to wild, extra orders of magnitude levels of progress. OpenAI has what, 400 employees?<ul><li>Scenario one: If half their work was automated, ok now those 400 people could do the work of 800 people. That's great, but honestly I don't think it's path-breaking. And sure, that's only the first order effect. If half the work was automated, we'd of course elastically start spending way much more on the cheap automated half. But on the other hand, there would be diminishing returns, and for every step that becomes free, we just hit bottlenecks in the hard to automate parts. Even in the limit of cheap AGI, those AGIs may be limited by the GPUs they have to experiment on. Labor becoming free just means capital is the constraint.</li><li>Scenario two: Or, suppose we have human-cost human-level AGIs. I'm not convinced that would, to first order, change much either. There are millions of smart people on earth who aren't working on AI research now. We could hire them, but we don't. We're not limited by brains. We're limited by willingness to spend. So even if we invent human-cost human-level brains, it actually doesn't change much, because that wasn't the constraint. (Of course, this is massively oversimplifying, and obviously human-cost human-level AGIs would be a bigger deal than human workers because of their ability to be rapidly improved and copied. But I hope it nevertheless conveys why I think AGI will need to get close to transformative levels before growth really explodes.)</li></ul></li></ul><p>Overall where it feels like I'm differing from some folks here is that I think higher levels of AI capability will be needed before we get wild self-improvement takeoff. I don't think it will be early, because even if we get massive automation due to uneven AI we'll still be bottlenecked by the things it's bad at. I acknowledge this is a pretty squishy argument and I find it difficult to quantify and articulate, so I think it's quite reasonable to disagree with me here. In general though, I think we've seen a long history of things being harder to automate than we thought (e.g., self-driving, radiology, etc.). It will be exciting to see what happens!</p>", "parentCommentId": "bvjePgjjgmoEGp2fr", "user": {"username": "Ted Sanders"}}, {"_id": "DZxAcPS3kSuk7DYyH", "postedAt": "2023-06-08T11:07:02.468Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p>For AGI to do most human work for &lt;$25/hr by 2043, many things must happen.</p></blockquote><p>I don't think this is necessarily the right metric, for the same reason that I think the following statement doesn't hold:</p><blockquote><p>transformative AGI is a much higher bar than... even the unambiguous attainment of expensive superhuman AGI</p></blockquote><p>Basically, while the contest rules do say, \"By 'AGI' we mean something like 'AI that can quickly and affordably be trained to perform nearly all economically and strategically valuable tasks at roughly human cost or less'\" they then go on to clarify, \"What we’re actually interested in is the potential existential threat posed by advanced AI systems.\" I think the natural reading of this definition is that AGI that (severely threatened to) cause human extinction or the permanent disempowerment of humanity would qualify as TAI, and I think my interpretation would further be more consistent with the common definition that TAI would be \"AI having an impact at least as large as the Industrial Revolution.\" Further, I think expensive superhuman AGI would threaten to cause an existential catastrophe in a way that would qualify it for my interpretation.<br><br>If we then look at your list, under my interpretation, we no longer have to worry about \"AGI inference costs drop below $25/hr (per human equivalent)\", nor \"We invent and scale cheap, quality robots\", and possibly not others as well (such as \"We massively scale production of chips and power\"). If we just ignore those 2 cruxes, (and assume your other numbers hold) then we're up to 4%. If we further ignore the one about chips &amp; power, then we're up to 9%.</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "wA7Q9youGTaSco3WA", "postedAt": "2023-06-08T11:31:42.051Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I like that you can interact with this. It makes understanding models so much easier.</p><p>Playing with the calculator, I see that the result is driven to a surprising degree by the likelihood that <i>\"Compute needed by AGI, relative to a human brain (1e20-1e21 FLOPS)\"</i> is &lt;1/1,000x (i.e. the bottom two options).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefgx3sbkbx5r7\"><sup><a href=\"#fngx3sbkbx5r7\">[1]</a></sup></span></p><p>I think this shows that your conclusion is driven substantially by your choice to hardcode \"1e20-1e21 FLOPS\" specifically, and then to treat this figure as a reasonable proxy for what computation an AGI would need. (That is, you suggest ~~1x as the midpoint for \"Compute needed by AGI, relative to... 1e20-1e21 FLOPS\").</p><p>I think it's also a bit of an issue to call the variable \"relative to a human brain (1e20-1e21 FLOPS)\". Most users will read it as \"relative to a human brain\" while it's really \"relative to 1e20-1e21 FLOPS\", which is quite a specific take on what a human brain is achieving.</p><p>I value the fact that you argue for choosing this figure <a href=\"https://arxiv.org/ftp/arxiv/papers/2306/2306.02519.pdf#page=27\">here</a>. However, it seems like you're hardcoding in confidence that isn't warranted. Even from your own perspective, I'd guess that including your uncertainty over this figure would bump up the probability by a factor of 2-3, while it looks like other commenters have pointed out that programs seem to use much less computation than we'd predict with a similar methodology applied to tasks computers already do.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fngx3sbkbx5r7\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefgx3sbkbx5r7\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This is assuming a distribution on computation centred on ballpark ~100x as efficient in the future (just naively based on <a href=\"https://epochai.org/trends\">recent trends</a>). If putting all weight on ~100x, nothing above 1/1,000x relative compute requirement matters. If putting some weight on ~1,000x, nothing above 1/100x relative compute requirement matters.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Kit"}}, {"_id": "ssB7zqyBCMjfRRdtT", "postedAt": "2023-06-08T15:33:40.755Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Your probabilities are not independent, your estimates mostly flow from a world model which seem to me to be flatly and clearly wrong.</p><p>The plainest examples seem to be assigning</p><figure class=\"table\" style=\"height:596.9px;width:636.338px\"><table style=\"background-color:rgb(255, 255, 255);border:1px double rgb(179, 179, 179)\"><tbody><tr><td style=\"border:1px double rgb(217, 217, 217);padding:0.4em\">We invent a way for AGIs to learn faster than humans</td><td style=\"border:1px double rgb(217, 217, 217);padding:0.4em\">40%</td></tr><tr><td style=\"border:1px double rgb(217, 217, 217);padding:0.4em\">AGI inference costs drop below $25/hr (per human equivalent)</td><td style=\"border:1px double rgb(217, 217, 217);padding:0.4em\">16%</td></tr></tbody></table></figure><p>despite current models learning vastly faster than humans (training time of LLMs is not a human lifetime, and covers vastly more data) and the current nearing AGI and inference being <i>dramatically</i> cheaper and plummeting with algorithmic improvements. There is a general factor of progress, where progress leads to more progress, which you seem to be missing in the positive factors. For the negative, derailment that delays enough to push us out that far needs to be extreme, on the order of a full-out nuclear exchange, given more reasonable models of progress.</p><p>I'll leave you with Yud's preemptive reply:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/pplonvo3meze7uqeandz\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/pq0neg0sfafjxsccyjhk 90w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/o6e6zkbladnh3icgjk47 180w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/xndcqiqx2tvzx25km2q0 270w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/bsepj2kexf1jixyumxli 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/olf8tsk8vp16sig4w0jw 450w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/idqrnmllwtfcenjopduv 540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/zc5k8j9urveqqme0pd0l 630w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/chrzkfxm98ex4oxxnxre 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/tqlhvurbbjg5micxhazl 810w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ssB7zqyBCMjfRRdtT/qoku1aqkozlzjmgpbwpy 900w\"></figure><p>Taking a bunch of number and multiplying them together causes errors to stack, especially when those errors are correlated.</p>", "parentCommentId": null, "user": {"username": "plex"}}, {"_id": "9N4dpQGqbYYmtgcXi", "postedAt": "2023-06-08T19:15:59.214Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I think canonicalizing this as a Fallacy was very premature: Yudkowsky wrote his post based on two examples:</p>\n<ul>\n<li>\n<p>Nate Silver's <a href=\"http://fivethirtyeight.com/features/donald-trumps-six-stages-of-doom/\">Trump's Six Stages of Doom</a> (which got a very-clearly-wrong-in-hindsight answer)</p>\n</li>\n<li>\n<p>My <a href=\"https://www.jefftk.com/p/breaking-down-cryonics-probabilities\">Breaking Down Cryonics Probabilities</a> (which is harder to evaluate since it's about something farther in the future)</p>\n</li>\n</ul>\n<p>I wrote a <a href=\"https://www.jefftk.com/p/multiple-stage-fallacy\">response at the time</a>, ending with:</p>\n<blockquote>\n<p>To figure out whether it tends to help or hurt in general, it would be better to get a lot more examples. It turns out, though, that this is a very common tool for people to use when estimating the efficacy of a conversion funnel. You figure out what the steps are, get estimates for each step, and that gives you an overall conversion rate. These aren't perfect, but they do pretty well, and they do a lot better than trying to estimate a conversion rate without breaking it down.</p>\n<p>Are there other examples of people using this method, yielding success or failure?</p>\n</blockquote>\n<p>In the discussion people gave a few other examples of people using this sort of model:</p>\n<ul>\n<li>\n<p>Robin Hanson in <a href=\"https://www.overcomingbias.com/p/break-cryonics-downhtml\">Break Cryonics Down</a></p>\n</li>\n<li>\n<p>Forecasters in the Good Judgement project (<a href=\"https://www.jefftk.com/p/multiple-stage-fallacy?fbclid=IwAR2ZtudZ_McQLufLI3h2MhnEpzmJ5-TU3CiyL7capH9TFW9CCsvcgavBEQo#fb-775526741072\">comment</a>)</p>\n</li>\n<li>\n<p>Animal Charity Evaluators trying to <a href=\"https://www.facebook.com/yudkowsky/posts/pfbid02sTn2SAGfJKhRgtsUCC2dUhAPC546ARHfThd14cJd6mECbGmug6SZ8qkQB6inmrobl?comment_id=10154036607769228&amp;reply_comment_id=10154037887909228\">predict the power of a planned behavior change study</a>.</p>\n</li>\n</ul>\n<p>Still, this isn't very much.  Before deciding whether this is a method that tends to lead people to give bad estimates (relative to whatever they would use instead) I'd like to see more examples?</p>\n", "parentCommentId": "oGLsEa3uKxrqqkoDE", "user": {"username": "Jeff_Kaufman"}}, {"_id": "RRiF4goJ4qtvxyb9F", "postedAt": "2023-06-08T21:33:40.381Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>I would guess that more or less anything done by current ML can be done by ML from 2013 but with much more compute and fiddling. So it's not at all clear to me whether existing algorithms are sufficient for AGI given enough compute, just as it wasn't clear in 2013. I don't have any idea what makes this clear to you.</i></p></blockquote><p>What's an algorithm from 2013 that you think could yield AGI, if given enough compute? What would its inputs, outputs, and training look like? You're more informed than me here and I would be happy to learn more.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "Eu8eSpfQjtPP7WjZ4", "postedAt": "2023-06-08T21:45:24.409Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>In addition to not fully understanding the view, I don't fully understand the discussion in this section or why it's justifying this probability. It seems like if you had human-level learning (as we are conditioning on from sections 1+3) then things would probably work in &lt;2 years unless parallelization is surprisingly inefficient.</i></p></blockquote><p>Maybe, but maybe not, which is why we forecast a number below 100%.</p><p>For example, it is very very rare to ever see a CEO hired with &lt;2 years of experience, even if they are very intelligent and have read a lot of books and have watched a lot of interviews. Some reasons might be irrational or irrelevant, but surely some of it is real. A CEO job requires a large constellation of skills practiced and refined over many years. E.g., relationship building with customers, suppliers, shareholders, and employees.</p><p>For an AGI to be installed as CEO of a corporation in under two years, human-level learning would not be enough - it would need to be superhuman in its ability to learn. Such superhuman learning could come from simulation (e.g., modeling and simulating how a potential human partner would react to various communication styles), come from parallelization (e.g., being installed as a manager in 1,000 companies and then compiling and sharing learnings across copies), or from something else.</p><p>I agree that skills learned from reading or thinking or simulating could happen very fast. Skills requiring real-world feedback that is expensive, rare, or long-delayed would progress more slowly.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "uDqujXZcxyvw3pbZg", "postedAt": "2023-06-08T21:57:29.980Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>It looks to me like you are trying to estimate the difficulty of automating tasks by comparing to the size of brains of animals that perform the task (and in particular human brains). And you are saying that you expect it to take about 1e7 flops for each synapse in a human brain, and then define a probability distribution around there. Am I misunderstanding what's going on here or is that a fair summary?</i></p></blockquote><p>Pretty fair summary. 1e6, though, not 1e7. And honestly I could be pretty easily persuaded to go a bit lower by arguments such as:</p><ul><li>Max firing rate of 100 Hz is not the informational content of the channel (that buys maybe 1 OOM)</li><li>Maybe a smaller DNN could be found, but wasn't</li><li>It might take a lot of computational neurons to simulate the I/O of a single synapse, but it also probably takes a lot of synapses to simulate the I/O of a single computational neuron</li></ul><p>Dropping our estimate by 1-2 OOMs would increase step 3 by 10%abs-20%abs. It wouldn't have much effect on later estimates, as they are already conditional on success in step 3.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "pjS4bzbwJeEepzJ7w", "postedAt": "2023-06-08T22:03:23.875Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>A floating point operation is more like 1e5 bit erasures today and is necessarily at least 16 bit erasures at fp16 (and your estimates don't allow for large precision reductions e.g. to 1 bit arithmetic). Let's call it 1.6e21 bit erasures per second, I think quite conservatively?</i></p></blockquote><p>I don't follow you here.</p><p>Why is a floating point operation 1e5 bit erasures today?</p><p>Why does a fp16 operation necessitate 16 bit erasures? As an example, if we have two 16-bit registers (A, B) and we do a multiplication to get (A, A*B), where is the 16 bits of information loss?<br><br>(In any case, no real need to reply to this. As someone who has spent a lot of time thinking about the Landauer limit, my main takeaway is that it's more irrelevant than often supposed, and I suspect getting to the bottom of this rabbit hole is not going to yield much for us in terms of TAGI timelines.)</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "kYBuxFdKTsXC8rquy", "postedAt": "2023-06-08T22:16:48.533Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>Are you saying that e.g. a war between China and Taiwan makes it impossible to build AGI? Or that serial time requirements make AGI impossible? Or that scaling chips means AGI is impossible?</i></p></blockquote><p>C'mon Paul - please extend some principle of charity here. :)<br><br>You have repeatedly ascribed silly, impossible beliefs to us and I don't know why (to be fair, in this particular case you're just asking, not ascribing). Genuinely, man, I feel bad that our writing has either (a) given the impression that we believe such things or (b) given the impression that we're the type of people who'd believe such things.<br><br>Like, are these sincere questions? Is your mental model of us that there's a genuine uncertainty over whether we'll say \"Yes, a war precludes AGI\" vs \"No, a war does preclude AGI.\"</p><p>To make it clear: No, of course a war between China and Taiwan does not make it impossible to build AGI by 2043. As our essay explicitly says.</p><blockquote><p><i>Some things can go wrong and you can still get AGI by 2043. If you want to argue you can't build AGI if something goes wrong, that's a whole different story. So multiplying probabilities (even conditional probabilities) for none of these things happening doesn't seem right.</i></p></blockquote><p>To make it clear: our forecasts are not the odds of wars, pandemics, and depressions not occurring. They are the odds of wars, pandemics, and depressions not delaying AGI beyond 2043. Most wars, most pandemics, and most depressions will not delay AGI beyond 2043, we think. Our methodology is to forecast only the most severe events, and then assume a good fraction won't delay AGI. As our essay explicitly says.</p><p>We probably forecast higher odds of delay than you, because our low likelihoods of TAGI mean that TAGI, if developed, is likeliest to be developed nearer to the end of the period, without many years of slack. If TAGI is easy, and can be developed early or with plenty of slack, then it becomes much harder for these types of events to derail TAGI.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "BHzzG7PkQX483uuxH", "postedAt": "2023-06-08T22:26:34.392Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>I don't know what level of cheap, quality robots you refer to. The quality of robotics needed to achieve transformative AI depends completely on the quality of your AI. For powerful AI it can be done with existing robot bodies, for weak AI it would need wildly superhuman bodies, at intermediate levels it can be done if humanoid robots cost millions of dollars each.</i></p></blockquote><p>Interesting - this is perhaps another good crux between us.</p><p>My impression is that existing robot bodies are not good enough to do most human jobs, even if we had human-level AGI today. Human bodies self-repair, need infrequent maintenance, last decades, have multi-modal high bandwidth sensors built in, and are incredibly energy efficient.</p><p>One piece of evidence for this is how rare tele-operated robots are. There are plenty of generally intelligent humans around the world who would be happy to control robots for $1/hr, and yet they are not being employed to do so.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "fM9iyDAptbLu9pFvh", "postedAt": "2023-06-08T22:29:44.544Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>I don't know what massively scaling chips mean---again, it seems like this just depends crucially on how good your algorithms are. It feels more like you should be estimating multiple numbers and then seeing the probability that the product is large enough to be impactful.</i></p></blockquote><p>Agree 100%. Our essay does exactly this, forecasting over a wide range of potential compute needs, before taking an expected value to arrive a single summary likelihood.</p><p>Sounds like you think we should have ascribed more probability to lower ranges, which is a totally fair disagreement.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "NPyRg6PtDLJjadbsD", "postedAt": "2023-06-08T22:32:34.121Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>I don't know what \"avoid derailment\" means. It seems like these are just factors that affect the earlier estimates, so I guess the earlier quantities were supposed to be something like \"the probability of developing AGI given that nothing weird happens in the world\"? Or something?</i></p></blockquote><p>Bingo. We didn't take the time to articulate it fully, but yeah you got it. We think it makes it easier to forecast these things separately rather than invisibly smushing them together into a smaller set of factors.</p><blockquote><p><i>But weird stuff is guaranteed to be happening in the world. I feel like this is the same deal as above, you should be multiplying out factors.</i></p></blockquote><p>&nbsp;We are multiplying out factors. Not sure I follow you here.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "BZsbJvnLGQTbMaQhN", "postedAt": "2023-06-08T22:38:19.717Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>In particular, it seems like some of your estimates make more sense to me if I read them as saying \"Well there will likely exist some task that AI systems can't do.\" But I think such claims aren't very relevant for transformative AI, which would in turn lead to AGI.&nbsp;</i></p><p><i>By the same token, if the AIs were looking at humans they might say \"Well there will exist some tasks that humans can't do\" and of course they'd be right, but the relevant thing is the single non-cherry-picked variable of overall economic impact. The AIs would be wrong to conclude that humans have slow economic growth because we can't do some tasks that AIs are great at, and the humans would be wrong to conclude that AIs will have slow economic growth because they can't do some tasks we are great at. The exact comparison is only relevant for assessing things like complementarity, which make large impacts happen strictly more quickly than they would otherwise.</i></p><p><i>(This might be related to me disliking AGI though, and then it's kind of on OpenPhil for asking about it. They could also have asked about timelines to 100000x electricity production and I'd be making broadly the same arguments, so in some sense it must be me who is missing the point.)</i></p></blockquote><p>Yep. We're using the main definition supplied by Open Philanthropy, which I'll paraphrase as \"nearly all human work at human cost or less by 2043.\"</p><p>If the definition was more liberal, e.g., AGI as smart as humans, or AI causing world GDP to rise by &gt;100%, we would have forecasted higher probabilities. We expect AI to get wildly more powerful over the next decades and wildly change the face of human life and work. The public is absolutely unprepared. We are very bullish on AI progress, and we think AI safety is an important, tractable, and neglected problem. Creating new entities with the potential to be more powerful than humanity is a scary, scary thing.</p>", "parentCommentId": "9WAYTaseSD9Q9Hwg6", "user": {"username": "Ted Sanders"}}, {"_id": "eFwbNDPRmnXdsv4Rm", "postedAt": "2023-06-09T04:26:22.529Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Am I really the only person who thinks it's a bit crazy that we use this blobby comment thread as if it's the best way we have to organize disagreement/argumentation for audiences? I feel like we could almost certainly improve by using, e.g., a horizontal flow as is relatively standard in debate.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdhpk13hdt7c\"><sup><a href=\"#fndhpk13hdt7c\">[1]</a></sup></span></p><p>With a generic example below:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/lit4ipc0b747hjbmgqkn\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/ugjdntltg1bn7qx9ulvd 100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/lkasby2zrpxyk6jpnuzq 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/m06hj4es6skps2nd5gk7 300w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/fadqncainfkbbq80tukf 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/hr7xpsusy4djfnixsz7e 500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/axlnntkuboe1zazkem7y 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/itkqreeh5myxekng1opa 700w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/gnpnxbcx9dtcr85tyhov 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/oxqgbk2z5mmpvj1ubjfz 900w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/eFwbNDPRmnXdsv4Rm/uecjuqwwu9tkp426rvo8 911w\"></figure><p>To be clear, the commentary could still incorporate non-block/prose text.</p><p>Alternatively, people could use something like Kialo.com. But surely there has to be something better than this comment thread, in terms of 1) ease of determining where points go unrefuted, 2) ease of quickly tracing all responses in specific branches (rather than having to skim through the entire blob to find any related responses), and 3) seeing claims side-by-side, rather than having to scroll back and forth to see the full text. (Quoting definitely helps with this, though!)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndhpk13hdt7c\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdhpk13hdt7c\">^</a></strong></sup></span><div class=\"footnote-content\"><p>(Depending on the format: this is definitely standard in many policy debate leagues.)</p></div></li></ol>", "parentCommentId": "B2oW9r5LjiWotEK2a", "user": {"username": "Harrison D"}}, {"_id": "WN6LMc7u8gdNj5Zer", "postedAt": "2023-06-09T07:58:27.130Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>But I don't think we could have predicted people would die into the comments like this. Usually comments have minimal engagement. There's a lesswrong debate format for posts but that's usually with a moderator and such. This seems spontaneous.&nbsp;</p>", "parentCommentId": "eFwbNDPRmnXdsv4Rm", "user": {"username": "zichenghuang"}}, {"_id": "PjPscLGgxj25ctuvj", "postedAt": "2023-06-09T14:21:37.246Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Are your referring to <a href=\"https://www.lesswrong.com/posts/kXiAGRWFquXFMi68Y/new-lw-feature-debates\">this format</a> on LessWrong? If so I can’t say I’m particularly impressed, as it still seems to suffer from the problems of linear dialogue vs. a branching structure (e.g., it is hard to see where points have been dropped, it is harder to trace specific lines of argument). But I don’t recall seeing this, so thanks for the flag.</p><p>As for “I don’t think we could have predicted people…”, that’s missing my point(s). I’m partially saying “this comment thread seems like it should be a lesson/example of how text-blob comment-threads are inefficient in general.” However, even in this specific case Paul knew that he was laying out a multi-pronged criticism, and if the flow format existed he could have presented his claims that way, to make following the debate easier—assuming Ted would reply.&nbsp;</p><p>Ultimately, it just seems to me like it would be really logical to have a horizontal flow UI,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6dnnghlqmhx\"><sup><a href=\"#fn6dnnghlqmhx\">[1]</a></sup></span>&nbsp;although I recognize I am a bit biased by my familiarity with such note taking methods from competitive debate.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6dnnghlqmhx\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6dnnghlqmhx\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In theory it need not be as strictly horizontal as I lay out; it could be a series of vertically nested claims, kept largely within one column—where the idea is that instead of replying to the entire comment you can just reply to specific blocks in the original comment (e.g., accessible in a drop down at the end of a specific argument block rather than the end of the entire comment).</p></div></li></ol>", "parentCommentId": "WN6LMc7u8gdNj5Zer", "user": {"username": "Harrison D"}}, {"_id": "JxcJkwEcaeFbiFfaN", "postedAt": "2023-06-09T14:31:11.273Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I don't know. As someone who was/still is quite good at debating and connected to debating communities I would find a flow-centric comment thread bothersome and unhelpful for reading the dialogues. I quite like internet comments as is in this UI.&nbsp;</p>", "parentCommentId": "PjPscLGgxj25ctuvj", "user": {"username": "zichenghuang"}}, {"_id": "ZCymGxS5sWzcaMfHZ", "postedAt": "2023-06-09T14:39:39.544Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Thanks for posting this, Ted, it’s definitely made me think more about the potential barriers and the proper way to combine probability estimates.</p><p>One thing I was hoping you could clarify: In some of your comments and estimates, it seems like you are suggesting that it’s decently plausible(?)<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefg23ysry8b9\"><sup><a href=\"#fng23ysry8b9\">[1]</a></sup></span>&nbsp;we will “have AGI“ by 2043, it’s just that it won’t lead to <strong>transformative</strong> AGI before 2043 because the progress in robotics, semiconductors, and energy scaling will be too slow by 2043. However, it seems to me that once we have (expensive/physically-limited) AGI, this should be able to significantly help with the other things, at least over the span of 10 years. So my main question is: <strong>Does your model attach significantly higher probabilities to transformative AGI by 2053? Is it just that 2043 is right near the base of a rise in the cumulative probability curve?</strong></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fng23ysry8b9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefg23ysry8b9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I wasn’t clear if this is just 60%, or 60%*40%, or what. If you could clarify this, that would be helpful!</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "op4mFuCfvTRwNhck9", "postedAt": "2023-06-09T14:51:47.677Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I find this strange/curious. Is your preference more a matter of “Traditional interfaces have good features that a flowing interface would lack“ (or some other disadvantage to switching) or “The benefits of switching to a flowing interface would be relatively minor”?</p><p>For example on the latter, do you not find it more difficult with the traditional UI to identify dropped arguments? Or suppose you are fairly knowledgeable about most of the topics but there’s just one specific branch of arguments you want to follow: do you find it easy to do that? (And more on the less-obvious side, do you think the current structure disincentivizes authors from deeply expanding on branches?)</p><p>On the former, I do think that there are benefits to having less-structured text (e.g., introductions/summaries and conclusions) and that most argument mapping is way too formal/rigid with its structure, but I think these issues could be addressed in the format I have in mind.</p>", "parentCommentId": "JxcJkwEcaeFbiFfaN", "user": {"username": "Harrison D"}}, {"_id": "jp6Y7jtebEWbbuYYz", "postedAt": "2023-06-09T17:25:36.545Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Agree that:</p><ul><li>The odds of AGI by 2043 are much, much higher than transformative AGI by 2043</li><li>AGI will rapidly accelerate progress toward transformative AGI</li><li>The odds of transformative AGI by 2053 is higher than by 2043</li></ul><p>We didn't explicitly forecast 2053 in the paper, just 2043 (0.4%) and 2100 (41%). If I had to guess without much thought I might go with 3%. It's a huge advantage to get 10 extra years to build fabs, make algorithms efficient, collect vast training sets, train from slow/expensive real-world feedback, and recover from rare setbacks.</p><p>My mental model is some kind of S surve where progress in the short-term is extremely unlikely, progress in the medium-term is more likely, and after a while, the longer it takes to happen, the less likely it is to happen in any given year, as that suggests that some ingredient is still missing and hard to get.</p><p>I think you may be right that twenty years is before the S of my S curve really kicks in. Twenty just feels so short with everything that needs to be solved and scaled. I'm much more open-minded about forty.</p>", "parentCommentId": "ZCymGxS5sWzcaMfHZ", "user": {"username": "Ted Sanders"}}, {"_id": "r6EqaCipyq55JoGvp", "postedAt": "2023-06-09T17:46:10.442Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>despite current models learning vastly faster than humans (training time of LLMs is not a human lifetime, and covers vastly more data)</i></p></blockquote><p><i>Some</i> models learning <i>some</i> things faster than humans does not imply <i>AGI&nbsp;</i> will learn <i>all</i> things faster than humans. Self-driving cars, for example, are taking much longer to learn to drive than teenagers do.</p>", "parentCommentId": "ssB7zqyBCMjfRRdtT", "user": {"username": "Ted Sanders"}}, {"_id": "otGY3ySKj4HLxvvJi", "postedAt": "2023-06-09T18:01:46.529Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Interesting. Perhaps we have quite different interpretations of what AGI would be able to do with some set of compute/cost and time limitations. I haven't had the chance yet to read the relevant aspects of your paper (I will try to do so over the weekend), but I suspect that we have very cruxy disagreements about the ability of a high-cost AGI—and perhaps even pre-general AI that can still aid R&amp;D—to help overcome barriers in robotics, semiconductor design, and possibly even aspects of AI algorithm design.</p><p>Just to clarify, does your S-curve almost entirely rely on base rates of previous trends in technological development, or do you have a component in your model that says \"there's some X% chance that conditional on the aforementioned progress (60% * 40%) we get intermediate/general AI that causes the chance of sufficiently rapid progress in everything else to be Y%, because AI could actually assist in the R&amp;D and thus could have far greater returns to progress than most other technologies\"?</p>", "parentCommentId": "jp6Y7jtebEWbbuYYz", "user": {"username": "Harrison D"}}, {"_id": "dRZd5AHoYL4d8mkMP", "postedAt": "2023-06-09T18:13:07.564Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>How hard do you suppose it might be to use an AI to scrub the comments and generate something like this? It may be worth doing manually for some threads, even, but it's easier to get people to adopt if the debate already exists and only needs tweaking. There may even already exist software that accepts text as input and outputs a Kialo-like debate map (thank you for alerting me that Kialo exists, it's neat).&nbsp;</p>", "parentCommentId": "eFwbNDPRmnXdsv4Rm", "user": {"username": "Joe Rogero"}}, {"_id": "FSkDosDjcXHbWxTJG", "postedAt": "2023-06-09T18:31:14.311Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>No it's not just extrapolating base rates (that would be a big blunder). We assume that the development of proto-AGI or AGI will rapidly accelerate progress and investment, and our conditional forecasts are much more optimistic about progress than they would be otherwise.</p><p>However, it's a totally fair to disagree with us on the degree of that acceleration. Even with superhuman AGI, for example, I don't think we're moving away from semiconductor transistors in less than 15 years. Of course, it really depends on how superhuman this superhuman intelligence would be. We discuss this more in the essay.</p>", "parentCommentId": "otGY3ySKj4HLxvvJi", "user": {"username": "Ted Sanders"}}, {"_id": "qkFjbB8yyXicaWPm8", "postedAt": "2023-06-09T18:32:12.160Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I'm not sure I buy '2013 algorithms are literally enough', but it does seem very likely to me that in practice you get AGI very quickly (&lt;2 years) if you give out GPUs which have (say) 10^50 FLOPS. (These GPUS are physically impossible, but I'm just supposing this to make the hypothetical easier. In particular, 2013 algorithms don't parallelize very well and I'm just supposing this away.)</p>\n<p>And, I think 2023 algorithms are literally enough with this amount of FLOP (perhaps with 90% probability).</p>\n<p>For a concrete story of how this could happen, let's imagine training a model with around 10^50 FLOP to predict all human data ever produced (say represented as uncompressed bytes and doing next token prediction) and simultaneously training with RL to play every game ever. We'll use the largest model we can get with this flop budget, probably well over 10^25 parameters. Then, you RL on various tasks, prompt the AI, or finetune on some data (as needed).</p>\n<p>This can be done with either 2013 or 2023 algorithms. I'm not sure if it's enough with 2013 algorithms (in particular, I'd be worried that the AI would be extremely smart but the elicitation technology wasn't there to get the AI to do anything useful). I'd put success with 2013 algos and this exact plan at 50%. It seems likely enough with 2023 algorithms (perhaps 80% chance of success).</p>\n<p>In 2013 this would look like training an LSTM. Deep RL was barely developed, but did exist.</p>\n<p>In 2023 this looks similar to GPT4 but scaled way up and trained on all source of data and trained to play games etc.</p>\n", "parentCommentId": "RRiF4goJ4qtvxyb9F", "user": {"username": "ryan-greenblatt"}}, {"_id": "m2fjyauydsZ7AikSt", "postedAt": "2023-06-09T21:10:57.514Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Over the past few months I have occasionally tried getting LLMs to do some tasks related to argument mapping, but I actually don't think I've tried that specifically, and probably should. I'll make a note to myself to try here.</p>", "parentCommentId": "dRZd5AHoYL4d8mkMP", "user": {"username": "Harrison D"}}, {"_id": "s58j4DkxqRCiWWr2o", "postedAt": "2023-06-10T01:49:14.408Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I asked other debaters/EAs intersecting and they agreed with my line of reasoning that it would be contrived and lead to poorly structured arguments. I can elaborate if you really want but I hesitate spending time to write this out because I'm behind on work and don't think it'll have any impact on anything to be honest.</p>", "parentCommentId": "op4mFuCfvTRwNhck9", "user": {"username": "zichenghuang"}}, {"_id": "pbsqqdAZNr5eRhc49", "postedAt": "2023-06-10T03:52:12.822Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>You seem to be missing the possibility of superhuman learning being from superhuman sample efficiency in the sense of requiring less feedback to aquire skills.\nIncluding actively experimenting in usefull directions more efectively.</p>\n", "parentCommentId": "Eu8eSpfQjtPP7WjZ4", "user": {"username": "Victor Levoso"}}, {"_id": "XpiLqarp3YiXzA7zT", "postedAt": "2023-06-10T08:36:37.398Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Disagree with example. Human teenagers spend quite a few years learning object recognition and other skills necessary for driving before driving, and I'd bet at good odds that a end-to-end training run of a self-driving car network is shorter than even the driving lessons a teenager goes through to become proficient at a similar level to the car. Designing the training framework, no, but the comparator there is evolution's millions of years so that doesn't buy you much.</p>", "parentCommentId": "r6EqaCipyq55JoGvp", "user": {"username": "plex"}}, {"_id": "jsY9RFN82FvZTKEwg", "postedAt": "2023-06-11T07:01:20.824Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>While I agree with many of the object-level criticisms of various priors that seem to be out of touch of current state of ML, I would like to instead make precise a certain obvious flaw in the methodology of the paper which was pointed out several times and which you seem to be unjustifiably dismissive of.</p>\n<p>tldr: when playing Baysian inference it is crucial to be cognizant that regardless of how certain your priors are the more conditional steps involved in your model the less credence you should give to the overall prediction.</p>\n<p>As for the case at hand, it is very natural to assign instead of a number, a distribution over time for when transformative AGI will be reached.</p>\n<p>You wil then find that as you dissect the prediction to more individual prior guesses, the mean of the overall prediction tends to go down, whereas the variance of the overall prediction tends to go up (the case of normal distributions is very instructive here).</p>\n<p>So generally, when dissecting an estimate of a probability to atomic guesses as you did, you should be cognizant that with enough steps you can drive the variance of your overall prediction to diverge while keeping the variance of each of your individual priors fixed.</p>\n<p>Regardless of how confident you are about your priors you should be quite skeptical of the overall &lt;1% estimate as it most likely fails to account for variance.</p>\n", "parentCommentId": null, "user": {"username": "BraveNematode"}}, {"_id": "GKGtksGmr9ErjLDos", "postedAt": "2023-06-11T08:28:29.989Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>It would be far far higher of course! With that many variables? Think about the uncertainty we ascribe to cost-effectiveness analysis with far less variables and far better evidence. Even calculating the error her would be close to impossible&nbsp;</p><p>95% confidence interval 0.1% to 50%? (Kind of joking here, but it might be in that range)</p>", "parentCommentId": "dZ298Qn2uTpMXqkD4", "user": {"username": "NickLaing"}}, {"_id": "9aXXwFA3BoknSxoL5", "postedAt": "2023-06-11T22:21:54.260Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p>Already a software engineer today is many multiples more productive (by some metrics) than a software engineer in the 90s.</p></blockquote><p>Do you have any material on this? It sounds plausible to me but I couldn't find anything with a quick search.</p><blockquote><p>I think that tools that, say, cheaply automate half of work, or expensively automate 100% work probably won't lead to wild, extra orders of magnitude levels of progress.</p></blockquote><p>Supposing you take \"progress\" to mean something like GDP per capita or AI capabilities as measured on various benchmarks, I agree that it probably won't (though I wouldn't completely rule it out). But also, I don't think progress would need to jump by OOMs for the chances of a financial crisis large enough to derail transformative AGI to be drastically reduced. (To be clear, I don't think drastic self-improvement is necessary for this, and I expect to see something more like increasingly sophisticated versions of \"we use AI to automate AI research/engineering\".)</p><p>I also think it's pretty likely that, if there is a financial crisis in these worlds, AI progress isn't noticeably impacted. If you look at papers published in various fields, patent applications, adoption of various IT technologies, numbers of researchers per capita -- none of these things seem to slow down in the wake of financial crises. Same thing for AI: I don't see any derailment from financial crises when looking at <a href=\"https://epochai.org/blog/compute-trends\">model sizes</a> (both in terms of parameters and training compute), <a href=\"https://epochai.org/blog/trends-in-training-dataset-sizes\">dataset sizes</a> or <a href=\"https://wiki.aiimpacts.org/doku.php?id=takeoff_speed:continuity_of_progress:historic_trends_in_chess_ai&amp;s[]=chess\">chess program Elo</a>.</p><p>Maybe capital expenditure will decrease, and that might only start being really important once SOTA models are extremely expensive, but on the other hand: if there's anything in these worlds you want to keep investing in it's probably the technology that's headed towards full-blown AGI? Maybe I think 1 in 10 financial crises would substantially derail transformative AGI in these worlds, but it seems you think it's more like 1 in 2.</p><blockquote><p>Scenario one: If half their work was automated, ok now those 400 people could do the work of 800 people. That's great, but honestly I don't think it's path-breaking. And sure, that's only the first order effect. If half the work was automated, we'd of course elastically start spending way much more on the cheap automated half. But on the other hand, there would be diminishing returns, and for every step that becomes free, we just hit bottlenecks in the hard to automate parts. Even in the limit of cheap AGI, those AGIs may be limited by the GPUs they have to experiment on. Labor becoming free just means capital is the constraint.</p></blockquote><p>Yeah, but why only focus on OAI? In this world we have AIs that cheaply automate half of work. That seems like it would have immense economic value and promise, enough to inspire massive new investments in AI companies.</p><blockquote><p>Scenario two: Or, suppose we have human-cost human-level AGIs. I'm not convinced that would, to first order, change much either. There are millions of smart people on earth who aren't working on AI research now. We could hire them, but we don't. We're not limited by brains. We're limited by willingness to spend. So even if we invent human-cost human-level brains, it actually doesn't change much, because that wasn't the constraint. (Of course, this is massively oversimplifying, and obviously human-cost human-level AGIs would be a bigger deal than human workers because of their ability to be rapidly improved and copied. But I hope it nevertheless conveys why I think AGI will need to get close to transformative levels before growth really explodes.)</p></blockquote><p>Ah, I think we have a crux here. I think that, if you could hire -- for the same price as a human -- a human-level AGI, that would indeed change things a lot. I'd reckon the AGI would have a 3-4x productivity boost from being able to work 24/7, and would be perfectly obedient, wouldn't be limited to working in a single field, could more easily transfer knowledge to other AIs, could be backed up and/or replicated, wouldn't need an office or a fun work environment, can be \"hired\" or \"fired\" ~instantly without difficulty, etc.</p><p>That feels somehow beside the point, though. I think in any such scenario, there's also going to be very cheap AIs with sub-human intelligence that would have broad economic impact too.</p>", "parentCommentId": "SCeDp5fDsgHkfuxRG", "user": {"username": "Erich_Grunewald"}}, {"_id": "yt6fhMQbEBc6wP4qt", "postedAt": "2023-06-12T03:37:04.422Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Confidence intervals over probabilities don’t make much sense to me. The probability itself is already the confidence interval over the binary domain [event  happens, event doesn’t happen].</p>\n<p>I guess to me the idea of confidence intervals over probabilities implies two different kinds of probabilities. E.g., a reducible flavor and an irreducible flavor. I don’t see what a two-tiered system of probability adds, exactly.</p>\n", "parentCommentId": "GKGtksGmr9ErjLDos", "user": {"username": "Ted Sanders"}}, {"_id": "4ds3BHgwhWso6htN6", "postedAt": "2023-06-12T03:56:51.644Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>This was an extensive debate in the 1980s and 90s between Judea Pearl, Dempster-Schafer, and a few others. I think it's trivially true, however, that in the probability centric view you espouse, it can be helpful to track second order uncertainty, and reducible versus irreducible uncertainty is critical for VoI analysis.</p>\n", "parentCommentId": "yt6fhMQbEBc6wP4qt", "user": {"username": "Davidmanheim"}}, {"_id": "yJynP7uuWNr7tu4Ci", "postedAt": "2023-06-12T21:58:26.291Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Let me replay my understanding to you, to see if I understand. You are predicting that...</p><p>IF:</p><ul><li>we gathered all files stored on hard drives</li><li>...decompressed them into streams of bytes</li><li>...trained a monstrous model to predict the next chunk in each stream</li><li>...and also trained it to play every winnable computer game ever made</li></ul><p>THEN:</p><ul><li>You are 50% confident we'd get AGI* using 2013 algos</li><li>You are 80% confident we'd get AGI* using 2023 algos</li></ul><p>WHERE:</p><ul><li>*AGI means AI that is general; i.e., able to generalize to all sorts of data way outside its training distribution. Meaning:<ul><li>It avoids overfitting on the data despite its massive parameter count. E.g., not just memorizing every file or brute forcing all the exploitable speedrunning bugs in a game that don't generalize to real-world understanding.</li><li>It can learn skills and tasks that are barely represented in the computer dataset but that real-life humans are nonetheless able to quickly understand and learn due to their general world models</li><li>It can made to develop planning, reasoning, and strategy skills not well represented by next-token prediction (e.g., it would learn to how write a draft, reflect on it, and edit it, even though it's never been trained to do that and has only been optimized to append single tokens in sequence)</li><li>It simultaneously avoids underfitting due to any regularization techniques used to avoid the above overfitting problems</li></ul></li></ul><p>ASSUMING:</p><ul><li>We don't train on data not stored on computers</li><li>We don't train on non-computer games (but not a big crux if you want to posit high fidelity basketball simulations, for example)</li><li>We don't train on games without win conditions (but not a big crux, as most have them)</li></ul><p>Is this a correct restatement of your prediction?</p><p>And are your confidence levels for this resulting in AGI on the first try? Within ten tries? Within a year of trial and error? Within a decade of trial and error?<br><br>(Rounding to the nearest tenth of a percent, I personally am 0.0% confident we'd get AGI on our first try with a system like this, even with 10^50 FLOPS.)</p>", "parentCommentId": "qkFjbB8yyXicaWPm8", "user": {"username": "Ted Sanders"}}, {"_id": "bHfmb25uMPnA3cfAt", "postedAt": "2023-06-12T22:01:31.238Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Nope, we didn't miss the possibility of AGIs being very sample efficient in their learning. We just don't think it's certain, which is why we forecast a number below 100%. Sounds like your estimate is higher than ours; however, that doesn't mean we missed the possibility.</p>", "parentCommentId": "pbsqqdAZNr5eRhc49", "user": {"username": "Ted Sanders"}}, {"_id": "6epQiEA8BWLeeD3nd", "postedAt": "2023-06-12T22:27:01.169Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p><i>Do you have any material on this? It sounds plausible to me but I couldn't find anything with a quick search.</i></p></blockquote><p>Nope, it's just an unsubstantiated guess based on seeing what small teams can build today vs 30 years ago. Also based on the massive improvement in open-source libraries and tooling compared to then. Today's developers can work faster at higher levels of abstraction compared to folks back then.</p><blockquote><p><i>In this world we have AIs that cheaply automate half of work. That seems like it would have immense economic value and promise, enough to inspire massive new investments in AI companies....</i></p><p><i>Ah, I think we have a crux here. I think that, if you could hire -- for the same price as a human -- a human-level AGI, that would indeed change things a lot. I'd reckon the AGI would have a 3-4x productivity boost from being able to work 24/7, and would be perfectly obedient, wouldn't be limited to working in a single field, could more easily transfer knowledge to other AIs, could be backed up and/or replicated, wouldn't need an office or a fun work environment, can be \"hired\" or \"fired\" ~instantly without difficulty, etc.</i></p><p><i>That feels somehow beside the point, though. I think in any such scenario, there's also going to be very cheap AIs with sub-human intelligence that would have broad economic impact too.</i></p></blockquote><p>Absolutely agree. AI and AGI will likely provide immense economic value even before the threshold of transformative AGI is crossed.</p><p>Still, supposing that AI research today is:</p><ul><li>50/50 mix of capital and labor</li><li>faces diminishing returns</li><li>and has elastic demand</li></ul><p>...then even a 4x labor productivity boost may not be all that path-breaking when you zoom out enough. Things will speed up, surely, but they might won't create transformative AGI overnight. Even AGI researchers will need time and compute to do their experiments.</p>", "parentCommentId": "9aXXwFA3BoknSxoL5", "user": {"username": "Ted Sanders"}}, {"_id": "GCA5F4ECLK9tazrXf", "postedAt": "2023-06-12T22:34:24.535Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>What is Vol analysis?</p>", "parentCommentId": "4ds3BHgwhWso6htN6", "user": {"username": "Ted Sanders"}}, {"_id": "ZWQgAiL4DGczi7ea5", "postedAt": "2023-06-13T07:49:00.976Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Value of Information<br><br>Here's my brief intro post about it:<br><a href=\"https://forum.effectivealtruism.org/posts/8w2hNT5WtDMzoaGuy/when-to-find-more-information-a-short-explanation\">https://forum.effectivealtruism.org/posts/8w2hNT5WtDMzoaGuy/when-to-find-more-information-a-short-explanation</a></p><p>And for more on the debates about second-order probabilities and confidence intervals, and why Pearl says you don't need them, you should just use a Bayesian Network, see his paper here: <a href=\"https://core.ac.uk/download/pdf/82281071.pdf\">https://core.ac.uk/download/pdf/82281071.pdf</a>&nbsp;</p>", "parentCommentId": "GCA5F4ECLK9tazrXf", "user": {"username": "Davidmanheim"}}, {"_id": "xwohn5Qnxrv8EKRNK", "postedAt": "2023-06-14T04:44:19.998Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>My point in asking \"Are you assigning probabilities to a war making AGI impossible?\" was to emphasize that I don't understand what 70% is a probability of, or why you are multiplying these numbers. I'm sorry if the rhetorical question caused confusion.</p><p>My current understanding is that 0.7 is basically just the ratio (Probability of AGI before thinking explicitly about the prospect of war) / (Probability of AGI after thinking explicitly about prospect of war). This isn't really a separate event from the others in the list, it's just a consideration that lengthens timelines. It feels like it would also make sense to list other considerations that tend to shorten timelines.</p><p>(I do think disruptions and weird events tend to make technological progress slower rather than faster, though I also think they tend to pull tiny probabilities up by adding uncertainty.)</p>", "parentCommentId": "kYBuxFdKTsXC8rquy", "user": {"username": "Paul_Christiano"}}, {"_id": "yinciqk87Rrjyzs9G", "postedAt": "2023-06-14T04:59:01.626Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I didn't mean to imply that human-level AGI could do human-level physical labor with existing robotics technology; I was using \"powerful\" to refer to a higher level of competence. I was using \"intermediate levels\" to refer to human-level AGI, and assuming it would need cheap human-like bodies.</p><p>Though mostly this seems like a digression. As you mention elsewhere, the bigger crux is that it seems to me like automating R&amp;D would radically shorten timelines to AGI and be amongst the most important considerations in forecasting AGI.</p><p>(For this reason I don't often think about AGI timelines, especially not for this relatively extreme definition. Instead I think about transformative AI, or AI that is as economically impactful as a simulated human for $X, or something along those lines.)</p>", "parentCommentId": "BHzzG7PkQX483uuxH", "user": {"username": "Paul_Christiano"}}, {"_id": "iWjmoJLfayyAHTzAa", "postedAt": "2023-06-16T23:32:45.054Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>This seems like a pretty good description of this prediction.</p>\n<p>Your description misses needing a finishing step of doing some RL, prompting, and generally finetuning on the task of interest (similar to GPT4). But this isn't doing much of the work, so it's not a big deal. Additionally, this sort of finishing step wasn't really developed in 2013, so it seems less applicable to that version.</p>\n<p>I'm also assuming some iteration on hyperparameters and data manipulation etc. in keeping with the techniques used in the respective time periods. So, 'first try' isn't doing that much work here because you'll be iterating a bit in the same way that people generally iterate a bit (but you won't be doing novel research).</p>\n<p>My probabilities are for the 'first shot' but after you do some preliminary experiments to verify hyper-params etc. And with some iteration on the finetuning. There might be a non-trivial amount of work on the finetuning step also, I don't have a strong view here.</p>\n", "parentCommentId": "yJynP7uuWNr7tu4Ci", "user": {"username": "ryan-greenblatt"}}, {"_id": "wGAWaungieghPGDjJ", "postedAt": "2023-06-16T23:43:31.292Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Here are some examples reasons why I think my high probabilities are plausible:</p>\n<ul>\n<li>The training proposal I gave is pretty close to how models like GPT4 are trained. These models are pretty general and are quite strategic etc. Adding more FLOP makes a pretty big qualitative difference.</li>\n<li>It doesn't seem to me like you have to generalize very far for this to succeed. I think existing data trains you to do basically everything humans can do. (See GPT4 and prompting)</li>\n<li>Even if this proposal is massively inefficient, we're throwing an absurd amount of FLOP at it.</li>\n<li>It seems like the story for why humans are intelligent looks reasonably similar to this story: have big, highly functional brains, learn to predict what you see, train to achieve various goals, generalize far. Perhaps you think humans intelligence is very unlikely ex-ante (&lt;0.04% likely).</li>\n</ul>\n", "parentCommentId": "yJynP7uuWNr7tu4Ci", "user": {"username": "ryan-greenblatt"}}, {"_id": "oBCBaQ3tfAXfW7NXG", "postedAt": "2023-06-16T23:48:25.650Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>My general view is 'if the compute is there, the AGI will come'. I'm going out on more of a limb with this exact plan and I'm much less confident in the plan than in this general principle.</p>\n", "parentCommentId": "yJynP7uuWNr7tu4Ci", "user": {"username": "ryan-greenblatt"}}, {"_id": "jWXbapXNiMYzCWYDF", "postedAt": "2023-06-16T23:50:44.335Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>It's worth noting that I think that GPT5 (with finetuning and scaffolding, etc.) is perhaps around 2% likely to be AGI. Of course, you'd need serious robotic infrastructure and much larger pool of GPUs to automate all labor.</p>\n", "parentCommentId": "yJynP7uuWNr7tu4Ci", "user": {"username": "ryan-greenblatt"}}, {"_id": "4a492LpA8rdu3X9xd", "postedAt": "2023-06-19T04:07:06.581Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>The end-to-end training run is not what makes learning slow. It's the iterative reinforcement learning process of deploying in an environment, gathering data, training on that data, and then redeploying with a new data collection strategy, etc. It's a mistake, I think, to focus only the narrow task of updating model weights and omit the critical task of iterative data collection (i.e., reinforcement learning).</p>", "parentCommentId": "XpiLqarp3YiXzA7zT", "user": {"username": "Ted Sanders"}}, {"_id": "3omM42GGEqAjwxgv4", "postedAt": "2023-09-27T01:35:49.019Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I put little weight on this analysis because it seems like a central example of the <a href=\"https://arbital.com/p/multiple_stage_fallacy/\">multiple stage fallacy</a>. But it does seem worth trying to identify clear example of the authors not accounting properly for conditionals. So here are three concrete criticisms (though note that these are based on skimming rather than close-reading the PDF):</p><ul><li>A lot of the authors' analysis about the probability of war derailment is focused on Taiwan, which is currently a crucial pivot point. But conditional on chip production scaling up massively, Taiwan would likely be far less important.</li><li>If there is extensive regulation of AI, it will likely slow down both algorithmic and hardware progress. So conditional on the types of progress listed under events 1-5, the probability of extensive regulation is much lower than it would be otherwise.</li></ul><p>The third criticism is more involved; I'll summarize it as \"the authors are sometimes treating the different events as sequential in time, and sometimes sequential in logical flow\". For example, the authors assign around 1% to events 1-5 happening before 2043. If they're correct, then conditioning on events 1-5 happening before 2043, they'll very likely only happen <i>just</i> before 2043. But this leaves very little time for any \"derailing\" to occur after that, and so the conditional probability of derailing should be far smaller than what they've given (62%).</p><p>The authors might instead say that they're not conditioning on events 1-5 <i>literally</i> happening when estimating conditional probability of derailing, but rather conditioning on something more like \"events 1-5 <i>would</i> have happened without the 5 types of disruption listed\". That way, their 10% estimate for a derailing pandemic could include a pandemic in 2025 in a world which was otherwise on track for reaching AGI. But I don't think this is consistent, because the authors often appeal to the assumption that AGI <i>already</i> exists when talking about the probability of derailing (e.g. the probability of pandemics being created). So it instead seems to me like they're <i>explicitly</i> treating the events as sequential in time, but <i>implicitly</i> treating the events as sequential in logical flow, in a way which significantly decreases the likelihood they assign to TAI by 2043.</p><p>I suspect that I have major disagreements with the way the authors frame events 1-5 as well, but don't want to try to dig into those now.</p>", "parentCommentId": null, "user": {"username": "richard_ngo"}}, {"_id": "Fas2RGcNubypfPEDv", "postedAt": "2023-09-30T18:06:45.490Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Great comment! Thanks especially for trying to point the actual stages going wrong, rather than hand-waving the multiple stage fallacy, which we all are of course well aware of.<br><br>Replying to the points:</p><blockquote><p>For example, the authors assign around 1% to events 1-5 happening before 2043. If they're correct, then conditioning on events 1-5 happening before 2043, they'll very likely only happen <i>just</i> before 2043. But this leaves very little time for any \"derailing\" to occur after that, and so the conditional probability of derailing should be far smaller than what they've given (62%).</p></blockquote><p>From my POV, if events 1-5 have happened, then we have TAGI. It's already done. The derailments are not things that could happen after TAGI to return us to a pre-TAGI state. They are events that happen before TAGI and modify the estimates above.</p><blockquote><p>The authors might instead say that they're not conditioning on events 1-5 <i>literally</i> happening when estimating conditional probability of derailing, but rather conditioning on something more like \"events 1-5 <i>would</i> have happened without the 5 types of disruption listed\". That way, their 10% estimate for a derailing pandemic could include a pandemic in 2025 in a world which was otherwise on track for reaching AGI. But I don't think this is consistent, because the authors often appeal to the assumption that AGI <i>already</i> exists when talking about the probability of derailing (e.g. the probability of pandemics being created). So it instead seems to me like they're <i>explicitly</i> treating the events as sequential in time, but <i>implicitly</i> treating the events as sequential in logical flow, in a way which significantly decreases the likelihood they assign to TAI by 2043.</p></blockquote><p>Yes, we think AGI will precede TAGI by quite some time, and therefore it's reasonable to talk about derailments of TAGI conditional on AGI.</p>", "parentCommentId": "3omM42GGEqAjwxgv4", "user": {"username": "Ted Sanders"}}, {"_id": "zKLHPystNtBgaTEE3", "postedAt": "2023-10-01T01:10:09.027Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>If events 1-5 constitute TAGI, and events 6-10 are conditional on AGI, and TAGI is very different from AGI, then you can't straightforwardly get an overall estimate by multiplying them together. E.g. as I discuss above, 0.3 seems like a reasonable estimate of P(derailment from wars) if the chip supply remains concentrated in Taiwan, but <i>doesn't</i> seem reasonable if the supply of chips is on track to be \"massively scaled up\".</p>", "parentCommentId": "Fas2RGcNubypfPEDv", "user": {"username": "richard_ngo"}}, {"_id": "Zfnq8ezL232Lv3heC", "postedAt": "2023-10-01T01:46:45.530Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>I think that's a great criticism. Perhaps our conditional odds of Taiwan derailment are too high because we're too anchored to today's distribution of production.</p><p>One clarification/correction to what I said above: I see the derailment events 6-10 as being conditional on us being on the path to TAGI had the derailments not occurred. So steps 1-5 might not have happened yet, but we are in a world where they will happen if the derailment does not occur. (So not really conditional on TAGI already occurring, and not necessarily conditional on AGI, but probably AGI is occurring in most of those on-the-path-to-TAGI scenarios.)<br><br>Edit: More precisely, the cascade is:<br>- Probability of us developing TAGI, assuming no derailments<br>- Probability of us being derailed, conditional on otherwise being on track to develop TAGI without derailment</p>", "parentCommentId": "zKLHPystNtBgaTEE3", "user": {"username": "Ted Sanders"}}, {"_id": "B3ucrt8jLEsXWLgjD", "postedAt": "2023-10-01T05:33:44.135Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<blockquote><p>More precisely, the cascade is:<br>- Probability of us developing TAGI, assuming no derailments<br>- Probability of us being derailed, conditional on otherwise being on track to develop TAGI without derailment</p></blockquote><p>Got it. As mentioned I disagree with your 0.7 war derailment. Upon further thought I don't necessarily disagree with your 0.7 \"regulation derailment\", but I think that in most cases where I'm talking to people about AI risk, I'd want to factor this out (because I typically want to make claims like \"here's what happens if we don't do something about it\").&nbsp;</p><p>Anyway, the \"derailment\" part isn't really the key disagreement here. The key disagreement is methodological. Here's one concrete alternative methodology which I think is better: a more symmetric model which involves three estimates:</p><ol><li>Probability of us developing TAGI, assuming that nothing extreme happens</li><li>Probability of us being derailed, conditional on otherwise being on track to develop TAGI</li><li>Probability of us being rerailed, conditional on otherwise <i>not</i> being on track to develop TAGI</li></ol><p>By \"rerailed\" here I mean roughly \"something as extreme as a derailment happens, but in a way which pushes us over the threshold to be on track towards TAGI by 2043\". Some possibilities include:</p><ol><li>An international race towards AGI, akin to the space race or race towards nukes</li><li>A superintelligent but expensive AGI turns out to good enough at science to provide us with key breakthroughs</li><li>Massive economic growth superheats investment into TAGI</li></ol><p>Suppose we put 5% credence on each of these \"rerailing\" us. Then our new calculation (using your numbers) would be:</p><p>The chance of being on track assuming that nothing extreme happens: 0.6*0.4*0.16*0.6*0.46 = 1%</p><p>P(no derailment conditional on being on track) = 0.7*0.9*0.7*0.9*0.95 = 38%</p><p>P(rerailment conditional on not being on track) = 1 - 0.95*0.95*0.95 = 14%</p><p>P(TAGI by 2043) = 0.99*0.14 + 0.01*0.38 = 14.2%</p><p>That's over 30x higher than your original estimate, and totally changes your conclusions! So presumably you must think either that there's something wrong with the structure I've used here, or else that 5% is way too high for each of those three rerailments. But I've tried to make the rerailments as analogous to the derailments as possible. For example, if you think a depression could <i>derail</i> us, then it seems pretty plausible that the opposite of a depression could <i>rerail</i> us using approximately the same mechanisms.</p><p>You might say \"look, the chance of being on track to hit all of events 1-5 by 2043 is really low. This means that in worlds where we're on track, we're probably barely on track; whereas in worlds where we're not on track, we're often missing it by decades. This makes derailment much easier than rerailment.\" Which... yeah, conditional on your numbers for events 1-5, this seems true. But the low likelihood of being on track also means that even very low rerailment probabilities could change your final estimate dramatically—e.g. even 1% for each of the rerailments above would increase your headline estimate by almost an order of magnitude. And I do think that many people would interpret a headline claim of \"&lt;1%\" as pretty different from \"around 3%\".</p><p>Having said that, speaking for myself, I don't care very much about &lt;1% vs 3%; I care about 3% vs 30% vs 60%. The difference between <i>those </i>is going to primarily depend on events 1-5, not on derailments or rerailments. I have been trying to avoid getting into the weeds on that, since everyone else has been doing so already. So I'll just say the following: to me, events 1-5 all look pretty closely related. \"Way better algorithms\" and \"far more rapid learning\" and \"cheaper inference\" and \"better robotic control\" all seem in some sense to be different facets of a single underlying trend; and chip + power production will both contribute to that trend and also be boosted by that trend. And so, because of this, it seems likely to me that there are alternative factorizations which are less disjoint and therefore get very different results. I think this was what Paul was getting at, but that discussion didn't seem super productive, so if I wanted to engage more with it a better approach might be to just come up with my own alternative factorization and then argue about whether it's better or worse than yours. But this comment is already too long so will leave it be for now.</p>", "parentCommentId": "Zfnq8ezL232Lv3heC", "user": {"username": "richard_ngo"}}, {"_id": "eDR9in5MZQqz4Tah7", "postedAt": "2023-10-01T07:26:37.357Z", "postId": "ARkbWch5RMsj6xP5p", "htmlBody": "<p>Great comment. We didn't explicitly allocate probability to those scenarios, and if you do, you end up with much higher numbers. Very reasonable to do so.</p>", "parentCommentId": "B3ucrt8jLEsXWLgjD", "user": {"username": "Ted Sanders"}}]