[{"_id": "kbyuE3Fm4uJz2fcvR", "postedAt": "2023-09-22T11:00:27.484Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Hi Spencer and Amber,</p>\n<p>There's a pretty chunky literature on some of these issues in metaethics, e.g.:</p>\n<ul>\n<li>Moral fictionalism, or why it could make sense to talk in terms of moral truths even if there aren't any</li>\n<li>Moral antirealism/constructivism, or why there can be moral \"shoulds\" and \"oughts\" even if these are just mental attitudes</li>\n<li>Why even if you're a pluralist, utilitarian considerations dominate your reasoning on a range of psychologically typical value systems given how much welfare matters to people compared to other things, and how much we can affect it given effective altruism</li>\n<li>How there can be different ways of valuing things, some that you endorse and some that you don't (especially among constructivists like Street, Korsgaard, and Velleman), and why it could make sense to only act on values you endorse acting on</li>\n<li>Relatedly, how your moral theory might be different from your spontaneous sentiments because you can think through these sentiments and bring them into harmony (e.g. the discussion of reflective equilibrium)</li>\n</ul>\n<p>Obviously it would be a high bar to have to have a PhD level training on these topics and read through the whole literature before posting on the EA Forum, so I'm not suggesting that! But I think it would be useful to talk some of these ideas through with antirealist metaethicists because they have responses to a bunch of these criticisms. I know Spencer and I chatted about this once and probably we should chat again! I could also refer you to some other EA folks who would be good to chat to about this, probably over DM.</p>\n<p>All of that said, I do think there are useful things about what you're doing here, especially e.g. part 2, and I do think that some antirealist utilitarianism is mistaken for broadly the reasons you say! And the philosophers definitely haven't gotten everything right, I actually think most metaethicists are confused. But especially claims like those made in part 3 have a lot of good responses in existing discussion.</p>\n<p>ETA: Actually if you're still in NYC one person I'll nominate to chat with about this topic is Jeff Sebo.</p>\n", "parentCommentId": null, "user": {"username": "tylermjohn"}}, {"_id": "wgjA8XyTBkJ5jcLbX", "postedAt": "2023-09-22T12:18:53.527Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p><strong>Executive summary</strong>: The author argues that Effective Altruists (EAs) should adopt Valuism, a philosophy recognizing multiple values, rather than focusing solely on utility, as this single-minded focus can lead to unhappiness, burnout, and may not align with individual's actual values.</p><p><strong>Key points</strong>:</p><ol><li>Most effective altruists likely intrinsically value things besides maximizing utility, like truth and loved ones' well-being, so claiming they only value utility is empirically false.</li><li>Denying one's other intrinsic values can lead to burnout.</li><li>Without moral realism, it's incoherent to claim one \"should\" prioritize utility above all else.</li><li>Valuism acknowledges effective altruists' values of both utility and truth-seeking.</li><li>Adopting Valuism may reduce burnout while still dedicating effort to effective altruism.</li><li>Valuism avoids awkward implications of ethical monism like valuing strangers over loved ones.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "hpXgPHtwc7bdQgRfd", "postedAt": "2023-09-22T15:13:20.201Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Hi Tyler, thanks for your thoughts on this! Note that this post is not about the best philosophical objections, it's about what EAs actually believe. I have spoken to many EAs who say they are utilitarian but don't believe in objective moral truth (or think that objective moral truth is very unlikely) and what I'm responding to in this post is what those people say about what they believe and why. I also have spoken to Jeff Sebo about this as well!&nbsp;</p><p>&nbsp;</p><p>In point 1 and 2 in this post, namely, \"<strong>1. I think (in one sense) it’s empirically false to say that \"only utility is valuable\" </strong>and<strong> \"2. It can be psychologically harmful to deny your intrinsic values\" </strong>I'm making a claim about human psychology, not about philosophy.</p><p>So it sounds like you're mainly respoding to this point in my essay: \"<strong>3. I think (in one sense) it’s incoherent to only value utility if you don't believe in moral realism\"</strong></p><p>That's totally fair, but please note that I actually solicited feedback on that point from tons of people, including some philosophers, and I wrote a whole essay just about that claim in particular which is linked above (of course, I wouldn't have expected you to have read it, but I'm just pointing that out). &nbsp;Here is that essay:</p><p><a href=\"https://www.spencergreenberg.com/2022/08/tensions-between-moral-anti-realism-and-effective-altruism/\">https://www.spencergreenberg.com/2022/08/tensions-between-moral-anti-realism-and-effective-altruism/</a></p><p>I will update the post slightly to make it clearer that I have a whole essay discussing objections to that point.</p><p>Note that at the bottom of that other essay I discuss every single reasonable-ish objection I've heard to that argument, including some from philosophers. Perhaps you have other objections not mentioned there, but I do delve into various objections and have sought a lot of feedback/criticism on that already!</p><p>I would be very happy to discuss this topic more with you, and hear your more detailed objections/points you think I am getting wrong - let me know if you'd like to do that!&nbsp;</p><p>&nbsp;</p><p>Finally, I will note though that most of the objections you mention in your comment above are NOT the many EAs I've spoken to use to defend their beliefs, so even if they are strong arguments I don't think they are doing work in why most EAs (who deny objective moral truth but say they are utilitarians) believe what they do.<br>&nbsp;</p>", "parentCommentId": "kbyuE3Fm4uJz2fcvR", "user": {"username": "spencerg"}}, {"_id": "rcNepWwTEsD6McKWP", "postedAt": "2023-09-22T15:34:50.057Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>I've only skimmed the essay but it looks pretty good! Many of the ideas I had in mind are covered here, and I respond very differently to this than to your post here.</p>\n<p>I don't know what most EAs believe about ethics and metaethics, but I took this post to be about the <em>truth</em>, or <em>desirability</em> of these metaethical, ethical, and methodological positions, not whether they're better than what most EAs believe. And that's what I'm commenting on here.</p>\n", "parentCommentId": "hpXgPHtwc7bdQgRfd", "user": {"username": "tylermjohn"}}, {"_id": "DMm6PMFveQr5NBAHu", "postedAt": "2023-09-22T19:07:57.184Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Thanks for sharing this post and pointing out some of the inconsistencies and confusions you see around you! I think being curious and inquisitive about such matters and engaging in open and constructive dialog is important and healthy for the community!&nbsp;<br><br>Interestingly, I actually made a related post just slightly earlier today, which was trying to spark some discussion around a <a href=\"https://forum.effectivealtruism.org/posts/p35hXxr36b4Z9dfaT/what-do-we-care-about-at-the-end-of-time\">thought experiment</a> I came up with to highlight some similar concerns/observations. I think your post is much more fleshed out, so thank you for posting!</p>", "parentCommentId": null, "user": {"username": "alexherwix"}}, {"_id": "oWDiGc3H4FyiRJZ3F", "postedAt": "2023-09-22T22:12:23.278Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>As you anticipate, I don’t find this very compelling because I’m a moral realist. It’s true that people can have preferences that run counter to hedonism, but I think those preferences are irrational. For example, someone might have a preference to sit and count blades of grass even though it doesn’t make her happy. I think her friends should do everything they can (within reason) to persuade her to see a movie she’d enjoy.</p>\n<p>I also already feel “comfortable investing in [my] own happiness and the happiness of [my] loved ones at the same time” because I know that it reduces burnout and that I wasn’t born a perfect utilitarian and that needs to be taken into consideration.</p>\n", "parentCommentId": null, "user": {"username": "JBentham"}}, {"_id": "9eMzdj54SJpRmDccn", "postedAt": "2023-09-23T09:40:46.152Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>A few provocative questions: What is your yardstick for measuring the effectiveness of your theory compared to other theories? How much work have you done to figure out how to falsify utilitarianism and consider alternatives? How do you deal with the objections to utilitarianism and the fact that there is no expert consensus on what moral theory is \"right\"?</p><p>I mean do what floats your boat as long as you don't hurt other people (and beings) and behave in otherwise responsible ways (i.e., please don't become the next SBF) but I am always pretty surprised and confused when people voice very strong confidence in their moral theory. In particular if you are a moral realist, it should be in your own interest to not treat ethics like a horse race or football match where you are rooting for the team you like best.</p>", "parentCommentId": "oWDiGc3H4FyiRJZ3F", "user": {"username": "alexherwix"}}, {"_id": "iNb6HnL4H8rnHzsYF", "postedAt": "2023-09-23T11:49:24.229Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Thank you for the reply. As in mathematics and logic, rational intuition is ultimately my yardstick for determining the truth of a proposition. I think it self-evident that the good of any one individual is of no more importance than the good of any other and that a greater good should be preferred to a lesser good. As for what that good is, everything comes down to pleasure on reflection. The objections to this view fall prey to numerous biases (scope insensitivity, status quo bias), depend on knee-jerk emotional reactions, or rest on misunderstandings of the theory (for example, attacking naive as opposed to sophisticated utilitarianism). Some are even concerned with the practicality of the theory, which has no bearing on its truth.<br><br>There is no consensus in part because philosophers are under great pressure to publish. If Henry Sidgwick had figured most things out in his great 19th Century treatise The Methods of Ethics (the best book on ethics ever written, even according to many non-utilitarians), then that would rather spoil the fun. If you are interested in a painstaking attempt by a utilitarian to consider the alternatives, then have a read. It is extremely dense, but that is what's required. A good companion is the volume published nine years ago by Singer and Lazari-Radek.</p><p>Hurting other sentient beings is the antithesis of utilitarianism, as you know. Mr Bankman-Fried's alleged actions should serve as a warning against naive utilitarianism and are a reminder that commonly accepted negative duties should almost always be followed (on utilitarian grounds). We don't know whether these alleged actions were the product of his philosophical beliefs, or whether it had more to do with the pernicious influence of money and power. Regardless, that he went down such a career path in the first place was the result of his philosophical beliefs and we should therefore take some responsibility as a community.<br><br>But I'm far more concerned about avoiding the (in)actions of virtually everyone in recent history, who fail to do anything about the plight of hundreds of billions of sentient beings (human and non-human) or who actively exacerbate their suffering. Most of these people are under the pernicious influence of \"common-sense morality\", which tells them that they have few positive duties toward others. Others think that being or feeling \"virtuous\" is sufficient. A few are recognised as evildoers for violating the admirable negative duties of common-sense morality that most at least accept. Such evildoers have almost always subscribed to profoundly anti-utilitarian ideologies, whether it be fascism, Stalinism, racism or nationalism.</p>", "parentCommentId": "9eMzdj54SJpRmDccn", "user": {"username": "JBentham"}}, {"_id": "DkjmR4JeoXibmdx3L", "postedAt": "2023-09-23T13:02:52.366Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Call me naive but your argument doesn't go through for me. You write...</p><blockquote><p>As in mathematics and logic, rational intuition is ultimately my yardstick for determining the truth of a proposition. I think it self-evident that the good of any one individual is of no more importance than the good of any other and that a greater good should be preferred to a lesser good. As for what that good is, everything comes down to pleasure on reflection.</p></blockquote><p>So your standard for adjudicating the \"truth\" of propositions is <i>your</i> \"rational intuition\". <i>You </i>think your position \"self-evident\" but what about others? How do you view their objections? Are they simply feeble attempts to pull you to the dark side or may they also be interpreted as evidence against the \"self-evidence\" of your intuition? Later you write...&nbsp;</p><blockquote><p>Most of these people are under the pernicious influence of \"common-sense morality\", which tells them that they have few positive duties toward others.</p></blockquote><p>How is your claim to \"correctness\" different from theirs? Is it not conceivable that you may also be \"under the pernicious influence of a utilitarian morality\"? How do you ground your theory in a way that precludes this possibility? If you claim to have the \"right\" definition and the \"right\" standard for judging ethical behavior, you better continue to challenge and evaluate it so as to continuously produce evidence that maintains its warranted assertibility beyond a reasonable doubt, wouldn't you agree? Otherwise, what makes your belief \"truer\" than, for example, catholic dogma?</p><p>P.S.: I have nothing against considering utilitarianism as an informative theory for guiding ethical behavior, I just think we should remain reasonable about the claims we make and curious and humble about the positions we advocate for. I don't know you personally or your positions in detail but based on the thrust of your comments, I felt it important to raise this point.</p>", "parentCommentId": "iNb6HnL4H8rnHzsYF", "user": {"username": "alexherwix"}}, {"_id": "jnGZNwstTyZhXgxcz", "postedAt": "2023-09-23T14:56:43.399Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>I don’t consider the intuitions of adherents to competing moral theories to be strong evidence against the detailed, painstaking process of reflection that I and other utilitarians have been through. I also think that utilitarianism best accommodates and explains our common-sense moral intuitions, as Sidgwick argued in detail. Therefore, there is not as much disagreement between the broad mass of people and utilitarians as there might seem to be at first glance. Those who have invented ‘rights’ and ‘virtues’ out of thin air have much more serious disagreements with common-sense morality, which is a problem for them.</p>\n<p>If most people thought that an object can simultaneously be red and green all over, their intuitions here wouldn’t be strong evidence against the fact that this is self-evidently absurd. For many centuries, Europeans rejected the idea that you could work with negative numbers. In cultures where negative numbers were being used, I don’t think this disagreement would have been good evidence against the self-evidence of negative numbers being useful in mathematics.</p>\n<p>I fully accept that others can say similar things to me. That is fine. To use the example from your other post, you can say that it’s self-evident that Alice should take the morphine; I will say that it would be self-evidently wrong of Alice to deprive Bob of such a special experience. All utilitarians can do is trust that, in time, reason will prevail. Pinker and Singer have both written about this. This is why we have been ahead of our time, while Kant’s views, for example, on various object-level issues are recognised as having been horribly wrong.</p>\n<p>It is certainly conceivable that I am “under the pernicious influence of utilitarianism”, in which case I would by default become a nihilist and abandon any attempt to reduce the suffering of sentient beings.</p>\n", "parentCommentId": "DkjmR4JeoXibmdx3L", "user": {"username": "JBentham"}}, {"_id": "uG3a4j6LwXRGwKHfr", "postedAt": "2023-09-23T17:02:42.178Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<blockquote><p>It is certainly conceivable that I am “under the pernicious influence of utilitarianism”, in which case I would by default become a nihilist and abandon any attempt to reduce the suffering of sentient beings.</p></blockquote><p>You certainly lost me here. All I am asking for is humility regarding our ability to \"know\" things, in particular regarding ethics. Every part of your argument could have been made by catholic dogmatists, who have likely engaged for much longer and deeper in painstaking reflection. For me that would be a worrying sign but I certainly did not intend for this contemplation of our own fallibility to drive you into not caring about other sentient beings. I think the parent post makes a good case for caring about lots of things we value.</p>", "parentCommentId": "jnGZNwstTyZhXgxcz", "user": {"username": "alexherwix"}}, {"_id": "CaQuqBhE5EmPwbtSh", "postedAt": "2023-09-23T17:19:57.651Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Cool, thanks for checking it out! I'll update the post slightly to make it clearer that I'm talking about beliefs rather than the truth.</p>", "parentCommentId": "rcNepWwTEsD6McKWP", "user": {"username": "spencerg"}}, {"_id": "46Kiqd8XTrxvh6LCW", "postedAt": "2023-09-23T17:40:51.828Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Catholics make empirical claims about the natural world. Logical and moral truths do not fit into that category, so I disagree with the comparison.</p>\n<p>The parent post makes no case whatsoever for caring about the things we value! All it does is assert that we ought to value everything that we already care emotionally about. Why should we act on everything we care emotionally about? How do we know that everything we care about is worth acting on? More humility may be required in all quarters!</p>\n<p>Don’t worry, I still aim to maximise the well-being of all sentient beings because I think the very nature of pleasure gives me strong reason to want to increase it and that there are no other facts about the universe which give me similar reasons for action. The table in front of me certainly doesn’t. “Virtues” and “rights” are man-made fictions, not facts. Conscious experiences in general seem like a better bet, but the ‘redness’ of an object also doesn’t give me reason to act. It is only valenced experiences which do. Hypothetically, though, were I to reject utilitarianism, I would by default become a nihilist precisely because I am humble about our ability to know things! I might still care about the suffering of sentient beings, but my caring about something is not a reason to act on it. Parfit is very good on this.</p>\n", "parentCommentId": "uG3a4j6LwXRGwKHfr", "user": {"username": "JBentham"}}, {"_id": "FpCqmxJvdtDpxjozi", "postedAt": "2023-09-23T18:15:48.665Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>I think you are misrepresenting a few things here.&nbsp;</p><p>First, Catholics talk a lot about ethics. Please come up with a better excuse to brush away the critique I made. I am almost offended by the laziness of your argument.&nbsp;</p><p>Second, you are misrepresenting the post. It does not assert that we should \"value everything that we already care emotionally about\". It argues for reflecting about what values we actually hold dear and have good reason to hold dear. This stands in contrast to your position, which amounts to arguing for a premature closing of this process of reflection by deferring to the supremacy of welfare under all circumstances and for all time.&nbsp;</p><p>Besides those misrepresentations, I think there is value in discussing reasons for actions and reflecting about values and my hope is you will stay open to this in the future. I personally feel drawn to a critical pragmatist perspective and I believe that at some point we could have a nice discussion about it. There are certainly other perspectives besides utilitarianism that are worth discussing. All I want to do, is to encourage you to keep an open mind.</p>", "parentCommentId": "46Kiqd8XTrxvh6LCW", "user": {"username": "alexherwix"}}, {"_id": "A5WPn8ZG9qXFS4cH4", "postedAt": "2023-09-23T18:50:47.143Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>It wasn’t clear which aspect of Catholic dogma you were referring to. Catholic claims about ethics seem to crucially depend on a bunch of empirical claims that they make. Even so, I view such claims as just a subset of claims about ethics that depend on our intuitions.</p>\n<p>As above, these conflicting intuitions can only be resolved through a process of reflection. I am glad that you support such a process. You seem disappointed that the result of this process has, for me, led to utilitarianism. This is not a “premature closing of this process” any more than your pluralist stance is a premature closing of this process. What we are both doing is going back and forth saying “please reflect harder”. I have sprinkled some reading recommendations throughout to facilitate this.</p>\n<p>The post does not mention whether we have reasons to hold certain things dear. It actually rejects such a framing altogether, claiming that the idea that we “should” (in a reason-implying sense) hold certain things dear doesn’t make sense. This is tantamount to nihilism, in my view. The first two points, meanwhile, are psychological rather than normative claims. As Sidgwick stated, the point of philosophy is not to tell people what they do think, but what they ought to think.</p>\n<p>I am always very happy to examine the plural goods that some say they value, but which I do not, and see whether convergence is possible.</p>\n", "parentCommentId": "FpCqmxJvdtDpxjozi", "user": {"username": "JBentham"}}, {"_id": "nytLSASLRvnpyRAqn", "postedAt": "2023-09-23T20:22:49.594Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<blockquote><p>As above, these conflicting intuitions can only be resolved through a process of reflection. I am glad that you support such a process. You seem disappointed that the result of this process has, for me, led to utilitarianism. This is not a “premature closing of this process” any more than your pluralist stance is a premature closing of this process. What we are both doing is going back and forth saying “please reflect harder”. I have sprinkled some reading recommendations throughout to facilitate this.</p></blockquote><p>I am only disappointed if you stop reflecting and questioning your position based on the situations you find yourself in and start to pursue it as dogma that cannot be questioned. I don't face the same concern as I am committed to continue on my open-minded and open-ended quest to better understand what it means to do good in particular situations and to act accordingly. In that sense, I am not \"just\" value pluralist nor a monist but agnostic as to what any particular situation may demand of me.</p><blockquote><p>The post does not mention whether we have reasons to hold certain things dear. It actually rejects such a framing altogether, claiming that the idea that we “should” (in a reason-implying sense) hold certain things dear doesn’t make sense. This is tantamount to nihilism, in my view. The first two points, meanwhile, are psychological rather than normative claims. As Sidgwick stated, the point of philosophy is not to tell people what they do think, but what they ought to think.</p></blockquote><p>Just because one is moral anti-realist doesn't mean one is automatically a nihilist. The post argues for Valuism and suggests there can be more than moral reasons for acting such as biological or psychological reasons. One may even argue that these are primary. But I guess that's bound to become too long of a conversation for this thread. I tried to make my case and I hope we both got something out of it.&nbsp;</p>", "parentCommentId": "A5WPn8ZG9qXFS4cH4", "user": {"username": "alexherwix"}}, {"_id": "76Xteya9YEhr7wiQo", "postedAt": "2023-09-23T20:56:26.118Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<p>Being “agnostic” in all situations is itself a dogmatic position. It’s like claiming to be “agnostic” on every epistemic claim or belief. Sure, you can be, but some beliefs might be much more likely than others. I continue to consider the possibility that pleasure is not the only good; I just find it extremely unlikely. That could change.</p>\n<p>I do not think biological and psychological “reasons” are actually reasons, but you’re right that this gets us into a separate meta-ethical discussion. Thank you for the discussion!</p>\n", "parentCommentId": "nytLSASLRvnpyRAqn", "user": {"username": "JBentham"}}, {"_id": "2hfNkGDCTEj8omeec", "postedAt": "2023-09-23T21:27:37.484Z", "postId": "arSvZ4mT7bpBxyEeM", "htmlBody": "<blockquote><p>Being “agnostic” in all situations is itself a dogmatic position. It’s like claiming to be “agnostic” on every epistemic claim or belief. Sure, you can be, but some beliefs might be much more likely than others. I continue to consider the possibility that pleasure is not the only good; I just find it extremely unlikely. That could change.</p></blockquote><p>If you read what I have written, you will see that I am not taking a dogmatic position but simply advocate for staying open-minded when approaching a situation. I tried to describe that as trying to be \"agnostic\" about the outcome of engaging with a situation. It's not my goal to predict the outcome in advance but to work towards a satisfying resolution of the situation at hand. I would argue that this is the opposite of a dogmatic position but I acknowledge that my use of the term \"agnostic\" may have been confusing here.</p><p>Thank you as well, it was thought provoking and helped me reflect my own positions.</p>", "parentCommentId": "76Xteya9YEhr7wiQo", "user": {"username": "alexherwix"}}]