[{"_id": "zhMqgdo4NyYQnFXi9", "postedAt": "2024-01-23T13:12:29.647Z", "postId": "AS5Boa4q3ia4hXRBE", "htmlBody": "<p>Hi, as an anti-natalist: while I saw the climate change branded as the leading motivation for anti-natalism, I don't think that anti-natalists should first and foremost be regarded as motivated in their views by the climate change concerns.</p>", "parentCommentId": null, "user": {"username": "Michał Zabłocki"}}, {"_id": "GxuqEmRDtvrnThYmv", "postedAt": "2024-01-23T19:18:04.946Z", "postId": "AS5Boa4q3ia4hXRBE", "htmlBody": "<p><a href=\"https://www.youtube.com/watch?v=LBudghsdByQ\">This kurzgesagt video</a> argues against anti-natlism in a way that was convincing to me. It says that fewer babies eventually lead to an ageing population where a small number of working-age people have to support a lot of pensioners and that this is already happening. This can cause loads of problems, like poverty and democraticly-elected governments representing pensioners leading to focus on short-term thinking. That does not sound like the kind of population that would deal well with the effects of climate change because it needs massive investment and fresh ideas. It also claims that having fewer children would shrink the population too slowly for climate change because the world population is going to grow for at least 60 more years.</p>", "parentCommentId": null, "user": {"username": "saulius"}}, {"_id": "pYAQvFNwSDXpsor8d", "postedAt": "2024-01-27T19:52:20.477Z", "postId": "AS5Boa4q3ia4hXRBE", "htmlBody": "<p>I think this is sort of right - while climate change is often the main ideological reason people quote for not wanting to have children, typically personal reasons for the would-be parents come first (lifestyle, housing etc.). <a href=\"https://theharrispoll.com/briefs/birth-rates/\">See for example</a>:</p><blockquote><p><strong>Those who do not have children and do not want to have a child in the future more often express concern about their personal situation, compared to external factors, as influencing their decisions:</strong></p><ul><li>Personal independence: 54%</li><li>Personal financial situation: 46%</li><li>Work/life balance: 40%</li><li>Housing prices: 33%</li><li>Safety: 31%</li><li>US politics: 31%</li><li>Climate change: 28%</li></ul><p><strong>Younger adults more frequently than the general population agree that people should not have children due to anticipated harm it causes to others and the planet.</strong></p><p>One in 5 US adults (20%) agree with the statement that people should stop having children because of the harm it causes (i.e. to other people, animals, or the environment). That number climbs to 1 in 4 among young adults (25%).</p><p>While one-third of US adults (34%) agree that “people should stop having children because their children’s quality of life will be poor,” that number increases among young adults (42%).</p><p>Lastly, while more than half of US adults (52%) are concerned about the impact of overpopulation on the planet, 58% of young adults share that concern.</p></blockquote>", "parentCommentId": "zhMqgdo4NyYQnFXi9", "user": {"username": "Larks"}}]