[{"_id": "apZ44LJAceNrDhyNG", "postedAt": "2024-01-26T22:58:00.133Z", "postId": "asi4mi7xJj7ue8DhX", "htmlBody": "<p>Any reason why anyone would compare the effectiveness of the regulated drug market with something which is very unlike the drug market (the high-cost-of-delivery litigation-magnet that is surgery) and not something which is very similar to an unregulated version of the drug market like, say, the supplement or alternative medicine industry?</p>\n", "parentCommentId": null, "user": {"username": "David T"}}, {"_id": "34mcr3i64YrcDSWCi", "postedAt": "2024-01-27T01:38:03.121Z", "postId": "asi4mi7xJj7ue8DhX", "htmlBody": "<p>Thanks for sharing your post!</p><blockquote><p>Pharmaceutical companies won't go and release hundreds of dud or dangerous drugs just because they can. That would ruin their brand and shut down their business.&nbsp;</p></blockquote><p>I briefly skimmed through the <a href=\"https://en.wikipedia.org/wiki/List_of_withdrawn_drugs\">wikipedia list of withdrawn drugs</a>. I looked at those withdrawn in the US or worldwide since 2007 (only eleven).&nbsp;</p><p>As far as I could tell (and I easily could have missed something) none of the associated pharma companies seem to have been financially ruined. The only ones who no longer existed (Wyeth and Celltech) were bought out by other pharma companies for princely sums (Wyeth by Pfizer for $68billion and Celltech by UCB for £1.5billion) before the recalls happened. &nbsp;</p><p>I guess doesn't seem clear to me that pharma companies face threatening risks of ruining their brands and shutting down their business if they produce more inefficient or even more dangerous drugs than already. Even thalidomide didn't destroy its parent company (Grünenthal).</p><p>I'm sure someone who knows more can correct me, but the only example of this happening in recent times Purdue Pharma. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Scipio Africanus"}}, {"_id": "6iWH8McqENhNCiNDZ", "postedAt": "2024-01-27T05:24:31.082Z", "postId": "asi4mi7xJj7ue8DhX", "htmlBody": "<p>I think the FDA and other regulatory bodies are critically important, market economies don't work well for medicine and that surgery is not a great comparator. Here are some scattered thoughts</p><ol><li>Surgery outcomes generally have <i><strong>short feedback loops. </strong></i>With medication, it can take years to understand potential harms, with surgery you usually know quickly whether outcomes are good or bad. The classic example of unexpected harms with a long feedback loop is Thalidomide, which caused severe birth defects in <a href=\"https://embryo.asu.edu/pages/us-regulatory-response-thalidomide-1950-2000\">tens of thousands of babies.</a> Regulation tightened up after this and we haven't had a similar scale problem since<br>&nbsp;</li><li>The medical field is built on <i><strong>trust. </strong></i>The general public expect that there has been a hypervigilant, rigorous process that ensures they are <i><strong>very</strong></i> likely to gain benefit from medication, but more importantly that the chance of catastrophic negative results is as close to zero as possible. This ensures we get vaccinated, go to doctors and take medication which increases the quality of our lives.<br><br>The second order and potentially catastrophic negative effects to harm-causing medications slipping through less regulation could also be immense. <i><strong>I think if a similar issue to thalidomide happened now, there could be a wholescale breakdown of trust in the medical field in general</strong></i><strong> &nbsp;</strong>which could lead to &nbsp;delays in seeking medical care, drops in vaccine rates around the world and increase in predatory non evidence-based predatory medical providers.<br>&nbsp;</li><li>I won't get into the weeds of why treating medicine as a regular commodity in the market can lead to disaster, but the obvious example is the opioid crisis in the U.S.A. The market-friendly policies allowed heavy marketing of opioid medication both to patients and doctors <i><strong>(most countries in the world don't allow this) </strong></i>which, along with poor regulation of doctor prescription practises (and a bunch of other reasons) contributed to the U.S.A being one of the first high income countries in the world to have a<a href=\"https://www.vox.com/science-and-health/2018/11/29/18117906/opioid-epidemic-drug-overdose-deaths-2017-life-expectancy\"> reduction in life expectancy</a>.&nbsp;</li></ol><p><i><strong>Sure there might be some people (like you) that are willing to take higher risks with medication to perhaps get higher rewards</strong></i>, but I don't think its a good idea to design our system around a minority of people who are willing to ride the lightening, when most people want a close to failsafe system with far less risk and less reward.&nbsp;</p><p>These are just a few thoughts, there are other important functions like good oversight of clinical trials and monitoring of side effects &nbsp;which I won't weigh into here. I don't know much about the FDA in its current form, and I'm sure there's plenty of room for improvement, but the potential downsides of doing away with medical regulators seem to outweigh the potential benefits of faster and cheaper medication.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "igY4uSYSdDJEYZJyd", "postedAt": "2024-01-27T22:16:16.427Z", "postId": "asi4mi7xJj7ue8DhX", "htmlBody": "<blockquote><p>The WHO claims that “surgical interventions account for 13% of the world’s total disability-adjusted life years.”</p></blockquote><p>DALYs are bad. Averting them is good.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefq6as8pn2nc\"><sup><a href=\"#fnq6as8pn2nc\">[1]</a></sup></span>&nbsp;This means that 13% of the world's <i>loss</i> of healthy life years is caused by the outcomes of surgery interventions. This is probably better than the counterfactual (no surgery), but it's kind of a weird metric to cite when defending the safety of surgery?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnq6as8pn2nc\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefq6as8pn2nc\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Ironically, we often use DALYs to mean \"averted DALYs\", especially in EA. This annoys me.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "QQDsTYzgAxDNaqcMC", "postedAt": "2024-01-28T01:21:51.744Z", "postId": "asi4mi7xJj7ue8DhX", "htmlBody": "<p>Yes to that footnote but the original abbreviation is confusing. It should be something like “disease <em>adjustments to</em> life years” .. not “disease <em>adjusted</em> life years”. Bc life years are <em>good</em> in general.</p>\n", "parentCommentId": "igY4uSYSdDJEYZJyd", "user": {"username": "david_reinstein"}}]