[{"_id": "EwLoGeENn79YeKbnB", "postedAt": "2022-09-01T16:37:08.397Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>Note: TikTok embeds don't seem to work fully here – if you can't see the video, try refreshing the page.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "kGigada4XFycqsLWw", "postedAt": "2022-09-01T17:59:03.295Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>Note: I couldn't find anyone making this specific response to Toby anywhere, but the basic idea has been around for quite some time, maybe originating in <a href=\"https://reflectivedisequilibrium.blogspot.com/2012/03/are-pain-and-pleasure-equally-energy.html\">this 2012 blog post</a> from Carl.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "GwZZhvaxC2nuzyNwB", "postedAt": "2022-09-01T18:04:55.772Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>What exchange rate could you infer from the happiest N particles and the most suffering N particles? I feel like a step is missing. Are you assuming they're equally great in absolute value?</p>\n<p>Related:</p>\n<p><a href=\"https://reflectivedisequilibrium.blogspot.com/2012/03/are-pain-and-pleasure-equally-energy.html?m=1\">https://reflectivedisequilibrium.blogspot.com/2012/03/are-pain-and-pleasure-equally-energy.html?m=1</a></p>\n<p><a href=\"https://www.simonknutsson.com/reply-to-shulmans-are-pain-and-pleasure-equally-energy-efficient/\">https://www.simonknutsson.com/reply-to-shulmans-are-pain-and-pleasure-equally-energy-efficient/</a></p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "qvoHdqQGXsb2yPnF8", "postedAt": "2022-09-01T18:31:14.550Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>I consider it an open question how functionally similar suffering and pleasure are, e.g. if the functions for suffering are all identical or opposite/symmetric to the functions for pleasure, in bijection, even in minds optimized for each.</p>\n", "parentCommentId": "GwZZhvaxC2nuzyNwB", "user": {"username": "MichaelStJules"}}, {"_id": "XkczhEQ5JGNFe6dbm", "postedAt": "2022-09-01T19:24:36.742Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>Thanks for the question!</p><p>I'm merely claiming that statements like \"one unit of suffering is worth two units of happiness\" are coherent because \"unit\" can be defined in reference to particles. I'm not claiming that any particular ratio is correct, only that it's coherent to talk about ratios other than 1:1.</p>", "parentCommentId": "GwZZhvaxC2nuzyNwB", "user": {"username": "Ben_West"}}, {"_id": "KHHgRNen6LzSAATur", "postedAt": "2022-09-01T21:14:58.762Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<blockquote>\n<p>Toby Ord argues that this is incoherent because there are no natural units in which to measure happiness and suffering, and therefore it's unclear what it even means to put them on the same scale.</p>\n</blockquote>\n<p>One problem might be that there are no natural units on which to measure happiness and suffering. Another is that there are too many. If there are a hundred thousand different  ways to put happiness and suffering on the same scale and they all differ in the exchange rate they imply, then it seems you've got the same problem. Your example of comparisons in terms of elementary particles feels somewhat arbitrary, which makes me think this may be an issue.</p>\n", "parentCommentId": null, "user": {"username": "Derek Shiller"}}, {"_id": "yWDDa5Hk3mnsJAPtL", "postedAt": "2022-09-01T21:36:33.385Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>If amount of happiness (or suffering) possible is not linear in the number of elementary particles, what number of elementary particles do you suggest using?</p>", "parentCommentId": null, "user": {"username": "prattle"}}, {"_id": "G7g9G4axx7dqfJLFh", "postedAt": "2022-09-01T22:12:52.127Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>This is a good point, I agree</p>", "parentCommentId": "KHHgRNen6LzSAATur", "user": {"username": "Ben_West"}}, {"_id": "GERZDhBZRrjouPGLL", "postedAt": "2022-09-01T22:43:01.041Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>I am not familiar with this particular domain, although I know what utilons are, so uh... if this was meant for me, this was not immediately convincing? Or elucidating??</p><p>Play by play of my gut reactions: (this is for the sake of imagining what strangers might think, not meant to be taken as serious criticism)</p><p>\"Negative utilitarians:\" okay this is some kinda obscure philosophy thing, isn't it. I'd probably skip it if this were interrupting my fun tiktok videos, but I want to know what an EA tiktok looks like.<br>:\\</p><p>\"Graph that doesn't illustrate anything I understand immediately\" okay, this is about math, hopefully that's all I need to get.&nbsp;<br>:\\</p><p>\"1 unit of suffering , 1 unit of happiness\" okay, simple, cool, lets figure things out!&nbsp;<br>:D</p><p>1\" unit of suffering per 2 units of happiness\" uh kinda weird, but okay. Where does this lead.&nbsp;<br>:)</p><p>\"elementary particles\" ??? &nbsp;<br>o_0</p><p>\"elementary particles, happy brain, sad brain, elementary particles, therefore measure\" &nbsp;NO. This is dumb and jargon obfuscation of nonsense.<br>D&lt;</p><p>Afterwards: (still stream-of-conscious reaction) Why does introducing \"elementary particles\" have anything to do with measuring the amount of happiness and suffering? That doesn't solve anything! Why are we trying to use the same set of particles to create a happy brain and a sad brain? Are you saying that if it takes more particles to make a happy brain then its worth more sad brains? Isn't it the arrangement that matters? &nbsp;What? What???<br>&gt;:/</p><p>I assume there is a lot more to what you are getting at and that you have a very good theory here! But this part didn't capture the vital bit I need to understand the basic concept and why it works. (Or clearly understand what you are driving at.) I would say it needs some rephrasing, maybe the context doesn't matter as much to stating your concept? \"Happiness is hard to measure\" might be enough?</p>", "parentCommentId": null, "user": {"username": "EcologyInterventions"}}, {"_id": "ZDyxHjxcyj8Ec7sCo", "postedAt": "2022-09-01T22:55:58.546Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>I am not sure, and I think this implies a good objection to my suggestion</p>", "parentCommentId": "yWDDa5Hk3mnsJAPtL", "user": {"username": "Ben_West"}}, {"_id": "xrwqM5dxAaArZKfvW", "postedAt": "2022-09-02T00:04:44.159Z", "postId": "ASmtarf3ADYb2Xmrt", "htmlBody": "<p>Thanks! I appreciate the detailed feedback.</p>", "parentCommentId": "GERZDhBZRrjouPGLL", "user": {"username": "Ben_West"}}]