[{"_id": "M3fuG6LEemrGauiHD", "postedAt": "2022-10-31T16:55:05.032Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I like it!</p>\n", "parentCommentId": null, "user": {"username": "Cesar Scapella"}}, {"_id": "otqzwgQLamoTqJ6ib", "postedAt": "2022-10-31T17:38:11.838Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I love it! Also having a tag all the time for drafts and unfinished thoughts would be nice too?&nbsp;</p>", "parentCommentId": null, "user": {"username": "ElikaSomani"}}, {"_id": "H7GFonWoczG6bCq8K", "postedAt": "2022-11-01T00:10:37.926Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>My guess is it will be hard to maintain a significant distinction between normal posts and these posts, so <i>de facto</i> if this policy succeeds it will be by just lowering standards.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "S3MseeWnnXCvBdTr5", "postedAt": "2022-11-01T00:39:06.222Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>Yeah, for butterfly ideas it definitely would need more space/slots to maximize evaluation instances.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "HMhSoiCRjKbnTHy2p", "postedAt": "2022-11-01T06:16:53.209Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>Pretty cool! I wonder if</p>\n", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "vNibSwmfGDfJ2usrz", "postedAt": "2022-11-01T07:45:49.203Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I would prefer one post where users leave unfinished ideas as comments</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "L9JSPgoGdjvGAktqi", "postedAt": "2022-11-01T08:23:01.834Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I like the idea of encouraging feedback on drafts. Maybe by sharing only summaries and getting feedback on those, like in <a href=\"https://www.lesswrong.com/posts/EeTq9vbzMT4Zb4oWo/all-the-posts-i-will-never-write\">All the posts I will never write</a>.</p><p>I'm slightly worried the proposed event could clutter the homepage and bury more useful posts, might be nice to have viewing them opt-in. Also, if there are dozens of posts in a single day it will be unlikely for all of them to get feedback.</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "Tc7tkRfTzQPzJHCTJ", "postedAt": "2022-11-01T09:44:40.029Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>Right. On the current margin, we need interventions that increase quality and decrease volume, not the opposite.</p>\n", "parentCommentId": "vNibSwmfGDfJ2usrz", "user": {"username": "RyanCarey"}}, {"_id": "f6rgYTzYziLjrqrCd", "postedAt": "2022-11-01T13:43:37.109Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>Agreed. I still think it’s important for people without time to write high quality posts (like myself) to share unfinished ideas, so I’m envisioning a weekly pinned post where people put unfinished ideas as comments</p>\n", "parentCommentId": "Tc7tkRfTzQPzJHCTJ", "user": {"username": "freedomandutility"}}, {"_id": "TMEdXfsL5mhEcgtgP", "postedAt": "2022-11-01T15:48:32.839Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I wouldn't personally benefit from it,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefja1i44p5d5d\"><sup><a href=\"#fnja1i44p5d5d\">[1]</a></sup></span>&nbsp;but I think it could be a very good idea anyway? Haven't thought much on it, though.</p><ol><li>Readers may learn to recognise when they derive value from unpolished work, which may knock them out of the delusion that only stuff which looks high-effort is high-value.<ol><li>(the meta-skill of learning to notice what you're actually learning from is necessary for being able to get better at learning)</li></ol></li><li>Might nudge some people above the threshold of posting anything at all, which may help give them the confidence boost (or at least wet feet) to be motivated to post more later. The motivation to post more later can be usefwl for having motivation to find ideas to post about, which is good!</li><li>I'm strongly in favour just because it reminds people that this isn't a journal, it's not academia, and we shouldn't be goodharting on professionalism.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref9hu67t8x4v9\"><sup><a href=\"#fn9hu67t8x4v9\">[2]</a></sup></span></li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnja1i44p5d5d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefja1i44p5d5d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Courage to post or fear of embarrassment isn't my bottleneck to getting things written.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn9hu67t8x4v9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref9hu67t8x4v9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I realise I may sound like a stuck record at this point, but it's an important thing to say! :p</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "boxvzEajLb5umq9Bv", "postedAt": "2022-11-01T15:56:09.752Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>\"<a href=\"https://distill.pub/2017/research-debt/\">Research debt</a>\" is only a problem if the community has the problem of <a href=\"https://forum.effectivealtruism.org/posts/4NkXP2bPfGn3rrFbt/please-tag-your-posts#fnbj19m5hwp7b\">feeling like they need to read everything/keep up with the literature</a> in the first place. Well, mostly. Rather than limiting people's willingness to communicate, should instead innovate on filtering higher-quality and lower-quality posts, for the dimensions you care about.</p><p>Alternatively/additionally, should split (self-sorted or not) into bubbles where newcomers feel safer to post, but still have an audience and a chance at prestige if they produce good work. I suggested something like that <a href=\"https://www.lesswrong.com/posts/dEnKkYmFhXaukizWW/aisafety-community-a-living-document-of-ai-safety?commentId=uYLNNXGbpWzRng7o5\">here</a>... although most of the things I have to say about this <i>is in my goshdang drafts</i>. :p</p>", "parentCommentId": "Tc7tkRfTzQPzJHCTJ", "user": {"username": "Emrik"}}, {"_id": "ETba6qGvbCjRJmqQq", "postedAt": "2022-11-01T16:02:55.519Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>My only worry will be that there will be more things posted in a short time than anyone will have time to read. I'm still working my way through all the cause area reports. Some system to distribute the posts out to prevent fatigue might be warranted for events like these and future writing contests.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "BFBfCcBSge8LNNEYw", "postedAt": "2022-11-02T01:37:33.708Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I think Ryan Carey has a valid point. Current issues are valid and need to be respected.</p><p>However, I want to raise the thought: <i><strong>Maybe posting decisions should be mainly guided by &nbsp;its impact on posts in the long term future.</strong></i></p><p><img src=\"https://lh3.googleusercontent.com/bECAEXvzrwzOMtVd56Do0olPZoyLT5XI8rl_yS-U3opEpeGYozigBR3ngsyJJSz-_y5eZiAt0n_3VaJ6xYhTjSqUWS2DyRfeWzj4NF2TRUC03fTSJXg63s0iat_Do_Zs3623vuPQrnnlcirNhXWi3g9Iobk2_ZifZxQ3W-hSWTnJVYCbUVBWoRCo_w\"></p><p>If you consider this diagram, it’s clear that, as an EA blogger put it: “<i>out of a staggering number of [posts that] will ever exist, our [posts] will be among the first</i>.”</p><p>If the forum moderator runs an event that decreases forum quality for 1 month, I think this is a small price to pay for the chance this increases long term posting quality/quantity.</p>", "parentCommentId": "Tc7tkRfTzQPzJHCTJ", "user": {"username": "Charles He"}}, {"_id": "HkgR2eBpo9BL7hEme", "postedAt": "2022-11-05T00:47:07.218Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I feel like this is equivocating between different types of quality in a way that makes the statement confusing?</p><p>I think there are a number of people who could make a thrown together bullet point list that would be very valuable. E.g. <a href=\"https://forum.effectivealtruism.org/posts/QYH9yJ4WfHRs3ftJD/some-personal-thoughts-on-ea-and-systemic-change\">this \"off the cuff thoughts\" post</a> from Carl is still maybe one of the best references on EA and systemic change to this day?</p><p>These posts might be \"poor quality\" in some senses (lots of grammar/spelling mistakes, unclear narrative, etc.) but \"high-quality\" in the sense of having important ideas.</p><p>I understand DAD to be encouraging this kind of post, which I would argue we need more of on the margin.</p>", "parentCommentId": "Tc7tkRfTzQPzJHCTJ", "user": {"username": "Ben_West"}}, {"_id": "bqdniaioAkcQTHtZF", "postedAt": "2022-11-05T02:08:27.264Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I agree that there have been some high-quality posts that are lacking in regard to polish (the same is true for any other dimension of quality). But will the average unpolished draft that you attract be good? Highly doubt it.</p>", "parentCommentId": "HkgR2eBpo9BL7hEme", "user": {"username": "RyanCarey"}}, {"_id": "c8dxuGBn6tqF3wdCD", "postedAt": "2022-11-05T17:10:13.286Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>Maybe I'm unusual, but my drafts are usually in draft stage not because I am uncertain about the conclusion but rather because of \"polish\".</p><p>If other people are like me, I think I would be interested to see their unpolished thoughts.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvfb67chomh\"><sup><a href=\"#fnvfb67chomh\">[1]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvfb67chomh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvfb67chomh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>At least, I would like to spend a week giving it a try. At the end of that week I might decide it was a bad idea.</p></div></li></ol>", "parentCommentId": "bqdniaioAkcQTHtZF", "user": {"username": "Ben_West"}}, {"_id": "fWDKQiJJsAdZpHoGA", "postedAt": "2022-11-05T22:48:51.120Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I think this should be acommpanied by a message/prompt in the comment text field that tells people that this post was a draft and to be err in favour of not giving any negative feedback</p>\n", "parentCommentId": null, "user": {"username": "maxeonyx"}}, {"_id": "9Q2ohaoLFLjkirp86", "postedAt": "2022-11-10T16:41:24.002Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I think the intent is great, but maybe if people find the forums so intimidating or unfriendly that they are reluctant or unwilling to post their ideas, there is a different problem that needs looking at? &nbsp;</p><p>Obviously there is information overload in all of our lives, so a digest of draft posts could be helpful in getting eyes on those, but the mechanism for exploring those ideas may be more limited.&nbsp;</p><p>Could you consider creating a permanent sub forum for idea development instead. One that is specifically for the submission of early ideas by those who are seeking editorial assistance or a sort of pre-screening from a friendly audience geared towards helpfulness , mentoring, or even just editorial support? This is an approach that is already used effectively in writing and storytelling sites. This forum could provide only notifications to those who sign up to provide support, but anyone could participate.</p><p>This could also provide a more permanent method for people to build reputation and ease into more full participation while also being more encouraging to the sharing of new ideas on a permanent basis. It feels like a way to provide a transition into the EA community without as much risk of alienating or having members not speak up.&nbsp;</p><p>If someone has naive ideas and enthusiasm, an unfiltered takedown of that idea can permanently put them off or squelch their enthusiasm. Every one of us has had those ideas at some point (and probably still do, but hopefully we get better self-screening them as we get older). If they have an area where there is a tailored community to help them refine or kindly guide them to understanding why their idea may not work, you can cultivate them and help build excellence.</p><p>I would say regardless of the mechanism, it would be useful to provide a guide on some basic/minimum information that should be included to open discussion.</p>", "parentCommentId": null, "user": {"username": "Zach Hughes"}}, {"_id": "dozsC8uhnBfRunuGT", "postedAt": "2022-11-10T18:18:07.223Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>I like the idea! In addition, I would say people should feel free to publish such posts more than once a year!</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "gcY9MyRuvJ3e8TQ4r", "postedAt": "2022-12-19T05:40:11.974Z", "postId": "ASycTczbzNgSSMYHo", "htmlBody": "<p>This is a good pilot - remind me of open source code publishing that encourage exchanging ideas while helping someone to get better at certain skill, highly support! Its especially for people like me who is new to posting articles online without having someone reviewed and critiqued before publishing. I also wonder what are some main topic of interest the community is interested to read about in the upcoming year, like is there a poll and a word cloud that generate the common theme?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Kate Trang Tran"}}]