[{"_id": "Z6RM2XEW7DdNnem5J", "postedAt": "2023-01-10T09:35:27.876Z", "postId": "aTMgGL3gwKt7j2ZJG", "htmlBody": "<p>Thanks for this! I liked the typology of biosurveillance systems. I was confused though by the 'Human / Animal Monitoring' category: why are there humans in this category? If we are testing humans exposed to farm animals, I thought this would fit in the 'sentinel' category. It would make more sense to me if this category was just for testing animals.</p>\n", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "4FSo6CdCrYukLvGrr", "postedAt": "2023-01-15T01:26:41.257Z", "postId": "aTMgGL3gwKt7j2ZJG", "htmlBody": "<p>This is a really great summary and reference document, thanks for writing this! I have two comments:</p><p>1. There is a difference between detectable levels of RNA/DNA/Antigen and an active, transmissible infection. While most of the time this is not important when thinking about a global surveillance system, it is good to keep in mind especially in PoP testing.&nbsp;</p><p>Edit: You address my point 1 in your Part 2</p><p>2. You write:&nbsp;</p><blockquote><p>However, while we can use animal surveillance systems to regularly monitor animals’ health and collect samples, we lack the capability of characterizing the pathogens effectively so as to predict their virulence and transmissibility to humans. This is a serious problem as it is infeasible to analyze and monitor every single pathogen strain found in animals. Microbiologists are working on this problem, but until then, zoonotic surveillance may not be suitable as an early-warning system</p></blockquote><p>Kevin Esvelt has convincingly argued that we should not do this, because this would publish what and where viruses or pathogens are that could cause a pandemic to bad actors. &nbsp;It seems related to your point on \"Potential for Dual-Use by Bad Actors\". While the technology itself may not be used by bad actors, the information gathered would immediately be an information hazard which could be used by bad actors.<br><br>Again, thanks a lot for this overview of the topic!</p>", "parentCommentId": null, "user": {"username": "James Montavon"}}, {"_id": "eBmQvrKRGRJDDJQgY", "postedAt": "2023-01-17T16:50:08.439Z", "postId": "aTMgGL3gwKt7j2ZJG", "htmlBody": "<p>Interesting read, thank you.</p>\n<p>I think your categorisation of surveillance systems could benefit from being done on two axes: the population/environment being tested and the method used for detection. You can basically combine any of these with any of the others, and evaluate their pros/cons orthogonally.</p>\n<p>Environments/populations:</p>\n<ul>\n<li>Symptomatic individuals (eg: hospitalised patients with respiratory symptoms or primary care patients reporting ILI)</li>\n<li>High-risk individuals (eg: farm or healthcare workers)</li>\n<li>Convenience populations (eg: residual samples from primary care or app users)</li>\n<li>General population (eg: randomly sampled individuals, similar to an opinion poll)</li>\n<li>Wastewater</li>\n<li>Livestock</li>\n<li>Other environmental surveillance (eg: high-touch areas in built environments)</li>\n</ul>\n<p>Testing technologies:</p>\n<ul>\n<li>Pathogen-specific point-of-person (eg: antigen, CRISPR)</li>\n<li>Pathogen-specific point-of-care (eg: LAMP)</li>\n<li>Pathogen-specific lab-based (eg: PCR). You have these under point-of-care, but normally point-of-care means <a href=\"https://en.wikipedia.org/wiki/Point-of-care_testing\">at or near the point the sample was taken</a> while PCR normally needs to be sent off to a lab (some hospitals have labs and treatment on the same site which does complicate this a little).</li>\n<li>Pathogen-agnostic lab-based (eg: metagenomics)</li>\n<li>Pathogen-agnostic point-of-person or point-of-care (no current technologies AFAIK)</li>\n<li>Symptom-based (eg: ZOE app or count of hospital admissions)</li>\n<li>Novel data (eg: Tweets or search trends)</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "xD6QWi6TkXDgbKoAy", "postedAt": "2023-01-18T01:21:47.871Z", "postId": "aTMgGL3gwKt7j2ZJG", "htmlBody": "<p>Great read, thanks for posting! A quick heads up that many of the links in the table of contents are broken (either linking to start of post, or to non-existent websites).<br><br><strong>Summary of this post, </strong>and the sequel post Technological Bottlenecks for PCR, LAMP, and Metagenomics Sequencing (feel free to suggest edits!)<br>Biosurveillance systems help early identification of pathogens that could cause pandemics. The authors weighted existing methods on 10 criteria including usefulness, quality of evidence, feasibility and potential risks.</p><p><br>High scoring methods included: Point-of-person (non-lab tests eg. rapid antigen), clinical (lab tests eg. PCR), digital (reporting cases to a database), and environmental methods (eg. monitoring in wastewater). Technological developments in point-of-person and clinical surveillance (ie. faster, easier, cheaper, home-based tests) is seen as promising. Environmental surveillance would benefit from increasing sensitivity of wastewater testing equipment, and developing new concentration techniques that work for a wide variety of pathogens (bacteria, virus, fungi). Specific bottlenecks and potential solutions (eg. improving performance of LAMP, a cheaper PCR alternative, under cold temperatures) are discussed in the second post.<br><br>Slightly lower scoring methods were: animal (frequent sampling and wearable devices) and syndromic (monitoring symptoms). Data sharing between key parties (and preferably cross-country) could assist with syndromic and digital methods. Animal monitoring is less promising as, while 60% of known infectious diseases are zoonotic, we lack the capability to predict virulence and transmissibility to humans.<br><br>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}]