[{"_id": "PPAPqdCGA4wRLu9Gd", "postedAt": "2022-09-08T00:18:08.232Z", "postId": "AuewiZayG6xBeQfKK", "htmlBody": "<p>Didn't read Ben's post so sorry if this was in it - How do you go about valuing the person who came up with the idea/valuing the creation of an idea?&nbsp;</p><p>In this case It's not clear if you two developed this idea in tandem or one of you came up with it, but I'd be interested to hear how you would think through that.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Charles_Guthmann"}}, {"_id": "3X9t9YBdLpXh6utMF", "postedAt": "2022-09-08T03:50:17.718Z", "postId": "AuewiZayG6xBeQfKK", "htmlBody": "<p>In this case it was very mutual so it was easy. &nbsp;If that hadn't been true: standard start up advice is that ideas are cheap, execution is what matters, so don't credit the inventor very much. &nbsp;That definitely holds in our case. Moreover this specific starting idea just wasn't very specific or actionable: it's only becoming so via a lot of work from both of us. So 0 credit to either of us for idea &nbsp;seed seems about right here, although I might owe a different person a few shares for a small catalyst.</p><p>I think it would be different for something like the Charity Entrepreneurship's idea library, where there are non-founders who put substantial work into vetting and developing the idea.&nbsp;</p>", "parentCommentId": "PPAPqdCGA4wRLu9Gd", "user": {"username": "Elizabeth"}}, {"_id": "tinfRRBLcTA28hXBW", "postedAt": "2022-09-09T16:27:37.309Z", "postId": "AuewiZayG6xBeQfKK", "htmlBody": "<p>I would generally agree with the notion that ideas are cheap. Part of the reason I asked the question actually is because I feel like that notion is at odds with the way grant making is done. Like, if ideas are essentially a worthless part of the process, grant makers should just be buying out organizations or individuals, rather than buying them w/their ideas (I know this post is about impact certificates not mainstream grant making but I thought this was relevant).&nbsp;</p><p>I might not be thinking through this clearly but if your decision to fund someone is highly contingent on the idea they propose, it seems to imply that you are giving a significant value to the idea part.&nbsp;</p>", "parentCommentId": "3X9t9YBdLpXh6utMF", "user": {"username": "Charles_Guthmann"}}, {"_id": "t4ttqmPPW9jAb6NXc", "postedAt": "2022-09-09T16:28:13.795Z", "postId": "AuewiZayG6xBeQfKK", "htmlBody": "<p>Re CE library, it seems like you aren't valuing the creation of the idea but the vetting of the idea. Or are you saying that if you propose and idea and it makes it through the vetting process and gets picked up then you should be valued for that?</p>", "parentCommentId": "3X9t9YBdLpXh6utMF", "user": {"username": "Charles_Guthmann"}}, {"_id": "KKgDYoNbA8fd5KAyJ", "postedAt": "2022-09-09T18:41:50.720Z", "postId": "AuewiZayG6xBeQfKK", "htmlBody": "<p>Depends on how you're defining idea. This one was both not very specific and had multiple sources (not just Jasen and I), so I think all the value is in the execution. But part of the execution is defining the idea more specifically; I've seen ideas shared later in the process, that had no implementation but were quite specific and drew on a lot of specialized knowledge, that I think would deserve some recognition. Not necessarily a lot, but &gt;0.</p>", "parentCommentId": "t4ttqmPPW9jAb6NXc", "user": {"username": "Elizabeth"}}, {"_id": "pu2D2N7NtoL5iDkkm", "postedAt": "2022-09-09T19:08:14.502Z", "postId": "AuewiZayG6xBeQfKK", "htmlBody": "<p>My sense is most grantmakers are okay with pivots in response to new information, and the specific project idea is serving the purpose of \"identify the area the kind of problem you are trying to solve\" and \"information about your reasoning and execution skills\".&nbsp;</p><p>One reason I didn't want funding for this yet is I didn't think I could write something sufficient to check alignment between myself and funders- the chance I'd want to pivot in ways they didn't like was unacceptably high. I have a grant for a different project that feels very different: I'm not following the plan I laid out at the beginning but I feel very confident the funders won't feel misled by my application, that they'll be happy I found options better than my original plans, and that any disappointment they feel will be because reality was disappointing rather than because I made bad choices.</p><p>(I have informed my regrantor of major changes and the feedback was \"whatever you think is best\")</p><p>I do think there would be advantages if funders either gave individual unrestricted funding, or paid a premium to cover the uncertainty of living from one short-term grant to the next. But there would also be advantages to stronger funder feedback, so I don't know what the right move is.</p>", "parentCommentId": "tinfRRBLcTA28hXBW", "user": {"username": "Elizabeth"}}, {"_id": "yCGJrnqP5WfAwLStb", "postedAt": "2022-09-22T23:23:56.895Z", "postId": "AuewiZayG6xBeQfKK", "htmlBody": "<p>Interesting. I think there are still some alarm bells ringing in my head.&nbsp;</p><ul><li>To the extent that giving a specific project idea is for \"information about your reasoning and execution skills\", I worry that this seems like some sort of status quo bias. It seems like the most obvious weeding out question to give for getting a grant to work on an issue but I'm not sure why it's clearly the best. It seems like the equivalent of picking PHD students primarily based on what they said they want to research. Leaves a lot of room open for copycat signaling.&nbsp;</li><li>To the extent that it is to \"identify the area the kind of problem you are trying to solve\", again is this the best way? It might be, but there are other plausible alternatives. Did you write about some problem or class of problems or solution or class of solutions? Did you attend talks about this thing? What did you study, etc. Also, there are tons of people who actually don't care that much within a range of things what they are solving. It seems like you are sneaking in an implicit assumption that it is important to line people up with the problem they are trying to solve but from my own experience my passions are not that robust.&nbsp;</li></ul><p>Basically, it seems almost too perfect that writing a grant proposal is actually the best signaling mechanism for who is best served to work on such a problem/solution. I'm interested in how grant makers came to this conclusion and definitely have a sense that many just assumed this is how you do it.&nbsp;</p>", "parentCommentId": "pu2D2N7NtoL5iDkkm", "user": {"username": "Charles_Guthmann"}}]