[{"_id": "L2qYSHkhWLtcX6kN2", "postedAt": "2014-12-05T05:55:02.082Z", "postId": "AuPXwvGHrXmSQQczM", "htmlBody": "<p>Both in this post and in the certificates of impact one I don't see exactly where you want to get with all this. If the goal is to figure out how to share pies, it seems that the mental trigger we use to think of that is not only economic, but moral too. The whole book Moral Tribes is an attempt to give us a currency that can be used to trade among agents who think that the &quot;right way to share pies&quot; is different. </p>\n<p>Finding elegant mathematical solutions for altruistic problems may be an interesting topic for a successor of Freakonomics, or for a successor of those complex economic theories that only physicists who become economists understand: occasionally they end up giving them Nobel prizes, but the theories rarely have any practical outcome. </p>\n<p>These two posts seem different in fundamental ways from most of your writings at Ordinary Ideas and Rational Altruist, and I would like to know where are you trying to make progress, and what you would expect if progress was made in that area (by you or others who further develop these ideas). </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "tQFidHSRNYygrw4rs", "postedAt": "2014-12-05T08:32:07.543Z", "postId": "AuPXwvGHrXmSQQczM", "htmlBody": "<p>Have you heard about how Beeminder cofounders Danny and Bethany use exactly this to split up chores between them? <a href=\"http://messymatters.com/autonomy\">http://messymatters.com/autonomy</a></p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "q2o8zwy7Sfn9xm5xu", "postedAt": "2014-12-05T10:21:47.507Z", "postId": "AuPXwvGHrXmSQQczM", "htmlBody": "<p>Of relevance, my house - four aspiring effective altruists - split our rent using <a href=\"http://www.nytimes.com/interactive/2014/science/rent-division-calculator.html?_r=0\">this fair division calculator</a></p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "updmqS8cnqEPCBfnp", "postedAt": "2014-12-09T11:44:07.038Z", "postId": "AuPXwvGHrXmSQQczM", "htmlBody": "<p>Thanks for not stopping at the short post. The second half did good work in stopping me spending too long exploring the issues with the idea.</p>\n<p>I think this is a fruitful direction to think in.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}]