[{"_id": "QNpEGENeNsXQJDn7c", "postedAt": "2015-07-02T07:34:04.868Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>Thanks for sharing! \nWe recently started EA Canberra, so it's useful to hear all of this.</p>\n<p>You said &quot;advertising in-person to interested groups&quot; is effective. I'm quite interested - can you elaborate on how you go about doing this? </p>\n", "parentCommentId": null, "user": null}, {"_id": "yjGrveqAkEuRT6fYe", "postedAt": "2015-07-02T11:07:57.922Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>Sure!</p>\n<p>There are two broad groups we targeted. One was relevant classes; e.g. anything dealing with ethics, Peter Singer, etc. We would approach professors and ask permission to pitch our group to the class at a relevant point in the curriculum.</p>\n<p>The other was other student groups. IIRC, we went to a local LW meetup (which only met once) and the Stanford Transhumanist Society, and had a joint Skype call to Rob Mather with Stanford's chapter of Resource Generation. (There are likely others I'm forgetting about.) For the first two, we just showed up at meetings; for Resource Generation, it was a joint event arranged with their leadership.</p>\n", "parentCommentId": "QNpEGENeNsXQJDn7c", "user": {"username": "AlexRichard"}}, {"_id": "Az9FpawhLgpqtJ6Q4", "postedAt": "2015-07-02T19:33:18.336Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>The partnership with Resource Generation hasn't been very fruitful so far--I think only one person from there showed up to Rob Mather's talk.</p>\n<p>I would add to this that we got two new regular members from a Slate Star Codex meetup. One recruiting strategy may be to try to get Scott Alexander to come to your school and host a meetup.</p>\n", "parentCommentId": "yjGrveqAkEuRT6fYe", "user": {"username": "MichaelDickens"}}, {"_id": "i8PgRt4sxoZEPXTGb", "postedAt": "2015-07-03T01:48:23.249Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>Thanks</p>\n", "parentCommentId": "yjGrveqAkEuRT6fYe", "user": null}, {"_id": "yhjrdqx4znH6NgNsd", "postedAt": "2015-07-03T10:44:51.855Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>Thanks for this Alex- a really great post for EA chapters who are just starting out! </p>\n", "parentCommentId": null, "user": {"username": "jonathancourtney"}}, {"_id": "mFHk9TBNmM8G8TMts", "postedAt": "2015-07-03T11:37:08.849Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<blockquote>\n<p>Be very, very careful about implying (or even hinting) that other groups are less than optimally effective. We may (or may not? memory is difficult) have done so at our first meeting, which left university staff very reluctant to approve us.</p>\n</blockquote>\n<p>Yeah, I'm not clear on why EAs have been attacking donations to university endowments (e.g. Rob Wiblin <a href=\"http://www.vox.com/2015/6/3/8726051/sentences-greece-debt-europe\">here</a>).  That's a good way for the EA movement to make a powerful enemy.  I would rather let people figure out that university endowments are a bad donation opportunity themselves instead of us pointing it out explicitly.  I would actually advise EAs applying for admission to elite universities to avoid mentioning EA on their applications at all at this point, given <a href=\"http://www.overcomingbias.com/2010/06/what-thinkers-needed.html#comment-518300772\">rumors</a> that elite universities choose applicants on the basis of projected donations to their endowment.  Keep your EA status on the DL, kids.</p>\n", "parentCommentId": null, "user": {"username": "xccf"}}, {"_id": "B8jyk49ZJmbbkQPF9", "postedAt": "2015-07-05T03:48:19.891Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<blockquote>\n<p>Check whether your school explicitly desires or opposes affiliation with an outside organization.</p>\n</blockquote>\n<p>Do you happen to know why Stanford didn't like the affiliation with external organizations?</p>\n", "parentCommentId": null, "user": {"username": "riceissa"}}, {"_id": "tPYviSPfwkhYFAaLx", "postedAt": "2015-07-05T19:07:40.529Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>I think they were concerned that the Stanford brand name would be used for publicity and /or fundraising by organizations outside their control.</p>\n", "parentCommentId": "B8jyk49ZJmbbkQPF9", "user": {"username": "Kelsey Piper"}}, {"_id": "mSLCwfXLJ2Gr8QRRu", "postedAt": "2015-08-23T07:38:52.580Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>Great summary, thanks. I've recently started a TLYCS chapter in Adelaide; I'll report back on how it goes!</p>\n", "parentCommentId": null, "user": {"username": "MichaelDello"}}, {"_id": "35MjYRSEcTuzLnzCq", "postedAt": "2015-08-23T07:43:02.525Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<p>I've found that people in Australia with no exposure to EA get upset when I bring up the 'curing blindness in developing countries for $60 a pop compared to training a guide dog for $40,000' example, especially since Guide Dogs Australia is a large and well supported charity here. I agree that being too 'in your face' about putting down some charities/orgs for being less effective is probably not a good way to attract people to the movement. It worked for me, but not for many others.</p>\n<p>I'd be careful about keeping EA on the DL. It may be necessary for some people early in certain careers, but if we all did that we'd never build the movement! &quot;The loudest voice is always right&quot;, and we have to be loud - but not obnoxiously so!</p>\n", "parentCommentId": "mFHk9TBNmM8G8TMts", "user": {"username": "MichaelDello"}}, {"_id": "mXF94LCj2Euxr6AQP", "postedAt": "2015-09-09T22:36:33.057Z", "postId": "avr2q6cSKzPN4fpSZ", "htmlBody": "<blockquote>\n<p>I'd be careful about keeping EA on the DL. It may be necessary for some people early in certain careers, but if we all did that we'd never build the movement! &quot;The loudest voice is always right&quot;, and we have to be loud - but not obnoxiously so!</p>\n</blockquote>\n<p>Yes, I only recommended it to &quot;kids&quot; (who are applying to college).</p>\n", "parentCommentId": "35MjYRSEcTuzLnzCq", "user": {"username": "xccf"}}]