[{"_id": "divv9a9nJjkqGDJrs", "postedAt": "2022-12-05T21:52:23.486Z", "postId": "aW9ANJg7s3Q9BASgu", "htmlBody": "<p>Wow thanks so much for this effort - &nbsp;as someone who runs a small charity, it's so encouraging to see smallish EA aligned organisations getting a look in for some funding and going through this great process. &nbsp;I have a couple of comments :).</p><p>1. As someone working in a global health charity, I often find it strange how little weighting delivery is given in Effective Altruism in general. There are a million good ideas that could have great impact, what matters more is whether the intervention will happen or not. It almost feels like delivery could almost be a <i><strong>multiplier &nbsp;</strong></i>for other scores rather than a smaller score on it's own, or at least it could have a higher weighting maybe?. Does the fidelity of all the other scores not depend in a sense on the project actually playing out as planned?<br><br>2. I also have questions about how good a measure importance, tractability and neglectedness translate as a measure for rating an <i><strong>intervention, </strong></i>when I think they emerged in effective altruism for rating a <i><strong>problem. </strong></i>Were the judges using these criteria to rate the problem being addressed or the solution itself? For example on neglectedness some of the solutions (Nuclear winter one, Existential risk one) might be the only people doing that exact thing to contribute to the issue (say a score 10/10), while the issues themselves might be neglected but less so (e.g. 7/10).<br><br>3. (Selfish question!) Do you know of other EA organisations or grantees doing anything vaguely similar - smaller grants to smaller organisations? Is there any online database or list on the forum of EA aligned donor orgs?</p><p>Thanks so, so much I found your whole process and system very interesting and informative - must be the most transparent grantee of all time ;). Was very encouraging</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "eevNaKAJ7rQbHkppL", "postedAt": "2022-12-06T01:10:24.704Z", "postId": "aW9ANJg7s3Q9BASgu", "htmlBody": "<p>I really appreciate that you not only gave feedback to your applicants, but also included common pitfalls in this article!</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "HooEBYzuNn8eH8ZvN", "postedAt": "2022-12-07T15:48:28.280Z", "postId": "aW9ANJg7s3Q9BASgu", "htmlBody": "<p>1. This is a &nbsp;good point, I hope that we weighted heavily enough on delivery but it's not certain. &nbsp;I imagine that sometime next year when we review the progress and impact of grantees this will be something we consider more thoroughly, and will adjust accordingly.&nbsp;<br><br>2. Yep - I should have been more specific, the I and N were applied to the problem area as a whole and the T was applied to the proposed intervention. In hindsight, maybe we could have weighted this more heavily in favour of the actual intervention being assessed.&nbsp; This was in part exacerbated by us taking a sort of worldview diversification approach and not having a specific cause area focus. I imagine more tailored funders avoid this problem as they pick a cause area they deem to be important ahead of time and then are only evaluating on the merit of the intervention, whereas we had to incorporate assessments of both the problem area <i><strong>and&nbsp;</strong></i> the proposed project.&nbsp;<br><br>3. Hmm - unfortunately not really in the global health space. The Effective Thesis database <a href=\"https://airtable.com/shrAhiA5DZqkgpwh1/tblXkLQ2WqPI8au1M\">here </a>has some sources of funds I hadn't heard of, and the <a href=\"https://forum.effectivealtruism.org/topics/funding-opportunities\">funding opportunities tag </a>might be useful, but they tend to be more longtermist focused. If you message me with details of your project then I'd be happy to think about people I could connect you with.&nbsp;</p>", "parentCommentId": "divv9a9nJjkqGDJrs", "user": {"username": "happy_pig"}}, {"_id": "hAjsC6Qnc94cNAHKg", "postedAt": "2022-12-09T09:20:16.030Z", "postId": "aW9ANJg7s3Q9BASgu", "htmlBody": "<p><strong>Post summary</strong> (feel free to suggest edits!):<br>SoGive is an EA-aligned research organization and think tank. In 2022, they ran a pilot grants program, granting £223k to 6 projects (out of 26 initial applicants):</p><ul><li>Founders Pledge - £93,000 - to hire an additional climate researcher.</li><li>Effective Institutions Project - £62,000 - for a regranting program.</li><li>Doebem - £35,000 - a Brazillian effective giving platform, to continue scaling.</li><li>Jack Davies - £30,000 - for research improving methods to scan for neglected X-risks.</li><li>Paul Ingram - £21,000 - poll how nuclear winter info affects nuclear armament support.</li><li>Social Change Lab - £18,400 - 2xFTE for 2 months, researching social movements.</li></ul><p>The funds were sourced from private donors, mainly people earning to give. If you’d like to donate, contact isobel@sogive.org.</p><p>They advise future grant applicants to lay out their theory of change (even if their project is one small part), reflect on how you came to your topic and if you’re the right fit, and consider downside risk.</p><p>The give a detailed review of their evaluation process, which was heavy touch and included a standardized bar to meet, ITN+ framework, delivery risks (eg. is 80% there 80% of the good?), and information value of the project. They tentatively plan to run it again in 2022, with a lighter touch evaluation process (extra time didn’t add much value).</p><p>They also give reflections and advice for others starting grant programs, and are happy to discuss this with anyone.</p><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}]