[{"_id": "aRGMt8XvPrECXkJza", "postedAt": "2023-01-05T11:25:15.061Z", "postId": "aWr4rMf7ZhoCAtoMc", "htmlBody": "<p>Thanks!</p><p>Is there a list anywhere of ways to upskill in ML for AI Safety Engineering, such as MLAB too?</p><p>Do you have an opinion on when someone should pick your course over some other course?</p><p>(I'm asking because I often hear from people trying to upskill in ML and I'm not sure what to tell them, I hope someone can comment here and help)</p><p>&nbsp;</p><p>I'll refer someone to this post right now</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "eE9hF6jR3aN6gj4Qe", "postedAt": "2023-01-06T07:43:53.882Z", "postId": "aWr4rMf7ZhoCAtoMc", "htmlBody": "<p>I originally helped design the course and I ran the first iteration of a similar program. I'm not really involved with the course now but I think I'm qualified to answer. However, I did AGI safety fundamentals a long time ago and haven't done MLAB, so my knowledge of those could be wrong (though I don't think so).</p>\n<p>In comparison to AGI Safety Fundamentals, this course a lot more technical and less conceptual. AGISF is not going to include the latest in machine learning on a technical level, and this course doesn't include as many conceptual readings.</p>\n<p>In comparison with MLAB, this course is more focused on reading papers and understanding research, and less focused on teaching particular frameworks or engineering skills.</p>\n<p>There's a bit of overlap between all, but it's pretty minimal. I think anyone who has done any of these programs would learn something from doing the others. It mostly depends on what people want to take out of the course: knowledge of a lot of different conceptual research directions (AGISF), skills in engineering with Pytorch (MLAB), or knowledge of the frontier of ML safety research and paper reading skills (Intro to ML Safety).</p>\n", "parentCommentId": "aRGMt8XvPrECXkJza", "user": {"username": "ThomasWoodside"}}, {"_id": "HKygQQb9AdgLorvuf", "postedAt": "2023-01-10T23:46:08.382Z", "postId": "aWr4rMf7ZhoCAtoMc", "htmlBody": "<p>I wanted to mention that I went through the first week's lectures and exercises and I was really impressed at the quality!</p>", "parentCommentId": null, "user": {"username": "dan.pandori"}}]