[{"_id": "jvFtQQPchHaTDz2FR", "postedAt": "2024-03-25T17:17:36.807Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>I'm sorry that you had to go through this terrible event, but thanks for writing this - I found it really moving and I think the lesson is a good one. I think you conveyed the value of moth wellbeing, and your respect for it, in a touching way.</p>\n", "parentCommentId": null, "user": {"username": "Kaleem"}}, {"_id": "gsufexPvy3YKsgBnv", "postedAt": "2024-03-25T19:22:38.786Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>Thanks for writing this, Bella. I relate: I lived with mice recently and spent a lot of time fretting about their well-being as the landlord closed in.</p><p>I think that sympathy towards small, liminal animals speaks to an expanded moral circle and that, when we feel powerless to save the animals, bearing witness to their deaths as you've done here might be an important way of paying respect to them.</p>", "parentCommentId": null, "user": {"username": "Ben Stevenson"}}, {"_id": "KyvoiomtQDmL2FhER", "postedAt": "2024-03-26T04:06:28.344Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>I had to deal with this about a year ago and ended up setting sticky traps that would also lure them in. I'd then check the traps periodically and crush them while they were alive and writhing. I can't tell if this is a better option though?<br><br>Separately, I'd like to see more content like this on the forum. I'm sure many of us have had thoughts / experiences like this!</p>", "parentCommentId": null, "user": {"username": "Yanni Kyriacos"}}, {"_id": "yX23BCMCyMvmwn5zT", "postedAt": "2024-03-26T04:56:23.794Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>Thanks for sharing, it sucks that you went through this (and sucks that the moths went through this :( ). As uncomfortable as thinking about these topics is, I am glad to be part of a community of people who take ethics seriously and try to act with compassion and consideration.\nLet's hope market forces take effect and enough people inquiring about low-suffering ways to kill insects creates a market for companies to offer this :)</p>\n", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "CM6zt5e6YBJNkn8fH", "postedAt": "2024-03-26T09:33:43.433Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>I wrote a post on moth traps. It makes a rather different point, but I still figure I'd better post it here than not. &nbsp;<a href=\"https://www.lesswrong.com/posts/JteNtoLBFZB9niiiu/the-smallest-possible-button-or-moth-traps\">https://www.lesswrong.com/posts/JteNtoLBFZB9niiiu/the-smallest-possible-button-or-moth-traps</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Neil Warren"}}, {"_id": "EmZ9vEGcqFYHNvS2N", "postedAt": "2024-03-26T15:30:24.503Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>If the lives of pests are net negative,* I think a healthy attitude is to frame your natural threat/disgust reaction to them as useful. The pests you see now are a threat to all the future pests they will create. It's imperative to the suffering of those future creatures that the first ones don't live to create them. Our homes are fertile breeding grounds for enormous suffering. I think creating these potential breeding grounds gives us a responsibility to prevent them from realizing that potential.&nbsp;</p><p>I take the central (practical) lesson of this post to be that that responsibility should spark some urgency to act and overcome guilt when we notice the first moth or mouse. We've already done the guilty thing of creating this space and not isolating it. The only options left are between more suffering and less. &nbsp;</p><p>Thank you for the post!</p><p>&nbsp;</p><p>*I mean this broadly to include both cases where their lives are net negative in the intervention-never scenario and in (more likely) scenarios like these where the ~inevitable human intervention might make them that way.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mjreard"}}, {"_id": "GQ2iNgNpLHCHa7MF9", "postedAt": "2024-03-26T22:11:17.908Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>I'd like actual feedback on this approach if anyone has any. Where is Brian Tomasik when you need him.</p>", "parentCommentId": "KyvoiomtQDmL2FhER", "user": {"username": "Yanni Kyriacos"}}, {"_id": "dewdEkyiitpuHuqyv", "postedAt": "2024-03-26T22:51:22.075Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>I guess I feel a lot of things:</p><ul><li>Empathy - I try to save slugs and snails etc, so I get this feeling that we should take all lives mattering seriously. There is something caring and beautiful in this and I like this intuition</li><li>Confusion - I have felt this about veganism a bit recently. I don't really think it's worth the amount of stress it caused me to be vegan in terms of animal lives saved. Perhaps I should do it for a month a year to remind me of the cost, but I until I hit diminishing returns on my work I should probably do that. I used to think \"if I were in slave owning times I should have divested entirely\" but I dunno these days. Probably my anti-slavery resources were better spent first and foremost funding abolitionists. I don't know the exact costs</li><li>Frustration - I find this story sort of a bit insane. It's about someone I know who is very kind tying themselves in knots over over a few hundred hours of micro-consciousness. I have a voice of a friend in my head being like \"that's an insane story\" and for myself I'd allow it a bit but at some point I think I'd say that it isn't the best way to help moths or all consciousness and that most minds would agree with the parts of me that want to throw in the towel</li><li>Sadness - I'm sad that you are sad, especially after trying to be so kind. And I agree that it's weird how we behave to people who we maybe think are doing bad things like the insect guy.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "Nyd76mGeiBLADoERJ", "postedAt": "2024-03-27T00:04:32.989Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>\"I used to think \"if I were in slave owning times I should have divested entirely\" but I dunno these days. Probably my anti-slavery resources were better spent first and foremost funding abolitionists. I don't know the exact cost\"<br><br>- I appreciate this level of honesty and skepticism ❤️</p>", "parentCommentId": "dewdEkyiitpuHuqyv", "user": {"username": "Yanni Kyriacos"}}, {"_id": "jTvcvRfTACBdtgCcX", "postedAt": "2024-03-28T19:13:21.560Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>This post was moving, thank you for writing it. I have dealt with a similar situation, and found it impossible. I've dealt with that impossibility by trying to justify what I've done, and absolve myself. Your post is forthright: you killed the moths. We can move on from it, but we don't need to rationalize it.</p>", "parentCommentId": null, "user": {"username": "Masha Winchell"}}, {"_id": "ZnptscGcJtqLutua2", "postedAt": "2024-03-29T10:25:30.914Z", "postId": "Ax5PwjqtrunQJgjsA", "htmlBody": "<p>My prior would be that unless you check <i>extremely frequently</i>, this sounds like a lot of suffering. But not sure about the other options.</p>", "parentCommentId": "KyvoiomtQDmL2FhER", "user": {"username": "Corentin Fressoz"}}]