[{"_id": "uAFGxuXHRfxJaCZoj", "postedAt": "2024-03-20T05:55:36.924Z", "postId": "AXhC4JhWFfsjBB4CA", "htmlBody": "<p>Thanks for the insights! I'm wondering how you think about self-funding charities, i.e. those which produce a product or service which they sell to users that can pay (or whose health insurers / governments can), and donate to users which can't (or for whom it would be very cost-effective to give to). Have any applied to or gone through AIM before?</p>", "parentCommentId": null, "user": {"username": "huw"}}, {"_id": "yjkRBt6Z7pnWhhfx3", "postedAt": "2024-03-20T19:09:02.891Z", "postId": "AXhC4JhWFfsjBB4CA", "htmlBody": "<blockquote><p>However, we have received more and stronger applications over time both from within and outside of EA. We think this trend is not highly reliable, but our best guess is that it's happening.</p></blockquote><p>Do you have any informed speculation as to why this may be happening?</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "TYh6Zn7YHCk6F2mfe", "postedAt": "2024-03-21T02:50:43.743Z", "postId": "AXhC4JhWFfsjBB4CA", "htmlBody": "<p>One thought re self-funding charities is that it might best for entities to focus on what they are best at: charities on interventions and for-profit businesses on providing goods and services to consumers or businesses.&nbsp;<br><br>A model that funds charities while enabling entities to focus on what they do best is Profit for Good, in which charities are in the vast majority shareholder position of for-profit companies. I explain why I believe that this model could be quite powerful in my TEDx Talk here:<br><br>&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=GL6gcZAdiHI\"><div><iframe src=\"https://www.youtube.com/embed/GL6gcZAdiHI\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure>", "parentCommentId": "uAFGxuXHRfxJaCZoj", "user": {"username": "Brad West"}}, {"_id": "38oBxn6jdECt5RjAz", "postedAt": "2024-03-21T13:20:52.926Z", "postId": "AXhC4JhWFfsjBB4CA", "htmlBody": "<p>I have a couple of guesses:</p><p>Every year, we generally become more well-known, particularly within the communities we consistently reach out to (e.g., EA, animal welfare, etc.). This creates natural momentum and credibility within those communities.</p><p>Our previous outreach efforts build up the applicant pool for the current year (e.g., someone who heard about us from a talk two years ago might only apply today).</p><p>We have done a lot more active outreach to non-EA communities. I think these communities are particularly affected by the visible success of our graduates, so they become a more viable audience as we acquire more prominent success markers (e.g., being featured on <a href=\"https://www.vox.com/23892694/joey-savoie-karolina-sarek-charity-entrepreneurship-future-perfect-50-2023\">Vox's top 50</a> list).</p>", "parentCommentId": "yjkRBt6Z7pnWhhfx3", "user": {"username": "Joey"}}, {"_id": "qt9nTojsmfJxuqqyo", "postedAt": "2024-03-21T13:55:52.902Z", "postId": "AXhC4JhWFfsjBB4CA", "htmlBody": "<p>Thanks!&nbsp;</p><p>To me, one of the major stories here is that you have managed to break free of an important limiting factor, at least for the present. That is worth celebrating and learning from.</p>", "parentCommentId": "38oBxn6jdECt5RjAz", "user": {"username": "Jason"}}, {"_id": "MsrvjeahMbLGuxzQM", "postedAt": "2024-03-22T02:19:10.418Z", "postId": "AXhC4JhWFfsjBB4CA", "htmlBody": "<blockquote><p>it might best for entities to focus on what they are best at</p></blockquote><p>Off the top of my head it seems like there would be reasonable exceptions to this. I think the necessary conditions would be in markets where a handful of companies control global development &amp; distribution of a necessary thing that affects people across the globe (usually due to economies of scale &amp; intensive development costs + IP control).</p><p>Insulin manufacturers, for example, might be justified in charging richer consumers (or more likely charging their governments &amp; insurers), but would also be the best-placed actors to donate their products to poorer people. Specifically, they would be better-placed than separate organisations which use donations to buy &amp; distribute insulin at low margins, because they're still paying for the manufacturer's margins. It equally doesn't make sense for an insulin manufacturer to just target poorer people and run entirely on donations because of the cost-effectiveness they'd achieve by scaling globally.</p><p>But I'm not super sure on this. There are definitely advantages to having focus and I'm not sure really how many orgs fit this criteria, or, indeed, how many would practically do this given the overwhelming force of the profit motive.</p>", "parentCommentId": "TYh6Zn7YHCk6F2mfe", "user": {"username": "huw"}}]