[{"_id": "6xQgnuC45hMBMWZFy", "postedAt": "2014-09-11T01:27:31.452Z", "postId": "AXkbKxw2znzRcDEcS", "htmlBody": "<blockquote>\n<p>Precisely what our concern or consideration requires us to do may vary according to the characteristics of those affected by what we do</p>\n</blockquote>\n<p>This conception of equality seems very far from the conventional one. For example, a defender of slavery in the antebellium south might argue that she <em>was</em> taking the interests of blacks into account - as a naturally subservient race, slavery was in their best interests. Contemporary egalitarians would not agree that such a person was an egalitarian with some mistaken <em>positive</em> views; they would regard her as a non-egalitarian, with a fundamentally <em>normative</em> mistake. So it seems that at the very least you are using the phrase here in a very different way from most contemporary egalitarians. Perhaps they are wrong in this regard, but I think it is important for EAs to recognize these are two fundamentally different conceptions, and should not be conflated, as so many people tend to.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "Y5vmu48k4RRQv3bTK", "postedAt": "2014-09-19T01:22:16.520Z", "postId": "AXkbKxw2znzRcDEcS", "htmlBody": "<p>I don't think Singer is committing himself to either of the two conceptions of equality that you distinguish in your comment. Rather, he is merely making the uncontroversial point that giving equal consideration to the interests of different beings doesn't require one to treat these beings equally. All plausible forms of egalitarianism agree with this basic idea. The passage immediately following the sentence you quote makes this clear:</p>\n<blockquote>\n<p>concern for the well-being of children growing up in America would require that we teach them to read; concern for the well-being of pigs may require no more than that we leave them with other pigs in a place where there is adequate food and room to run freely. But the basic element-the taking into account of the interests of the being, whatever those interests may be-must, according to the principle of equality, be extended to all beings, black or white, masculine or feminine, human or nonhuman.</p>\n</blockquote>\n", "parentCommentId": "6xQgnuC45hMBMWZFy", "user": {"username": "Pablo_Stafforini"}}, {"_id": "4cxeCSP3ZHRDkYj2D", "postedAt": "2014-09-19T09:53:36.945Z", "postId": "AXkbKxw2znzRcDEcS", "htmlBody": "<p>Many authors, in particular Hofstadter and Joshua Greene, have made the case for a principle of moral distribution in which the fundamental unit is not the individual human mind. Hofstadter talks about soul sizes, and how some people have larger souls, whereas Joshua Greene advocates a new and sophisticated understanding of moral exchange in cases of Us versus Them (not Me versus Us). Their reasoning seems more consistent and effective than Singer's to me. \nI suppose all of them can be considered consequentialist, so that property alone cannot be what distinguishes the arguments at hand from those brought forth by Singer and Bentham. \nI highly recommend Moral Tribes for Effective Altruists and Ineffective non-altruists alike. </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}]