[{"_id": "yCTkmN6LusksjEhpJ", "postedAt": "2022-11-09T11:15:29.563Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>I think there is a lot we don't know, and speculating on this at this moment is probably net-negative.</p><p>I would encourage people to<a href=\"https://forum.effectivealtruism.org/posts/yjGye7Q2jRG3jNfi2/ftx-will-probably-be-sold-at-a-steep-discount-what-we-know?commentId=JweE9JHDBwBBuh2it\"> wait a few weeks for the dust to settle</a> before speculating or even forming an opinion.</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "WF7t8uFd4xKb7b5zs", "postedAt": "2022-11-09T11:54:09.679Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Given how fast crypto markets can move, I think this is liable to be quite time-sensitive?</p>\n<p>Additionally, in terms of consumer confidence in FTX, I imagine the brand impact of \"FTX withdrawals didn't work for 48 hours\" is fairly different from that of \"FTX withdrawals didn't work for 3 weeks\".</p>\n", "parentCommentId": "yCTkmN6LusksjEhpJ", "user": {"username": "John_Maxwell_IV"}}, {"_id": "2LWhrfXdKTv92iz3G", "postedAt": "2022-11-09T12:06:12.238Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>I definitely think it is worth considering.  And Dustin merely announcing that he's considering a purchase of FTX could help consumer confidence and/or give FTX a better bargaining position vs Binance.  Such an announcement could <em>conceivably</em> backfire if Binance sees their offer to purchase FTX as a charitable gesture, or merely wants to maintain consumer confidence in crypto?  But overall, making such an announcement ASAP seems like a fairly clear win to me?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "bjfezthDFxDkCCzFD", "postedAt": "2022-11-09T12:10:56.685Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>No. This would be a bad idea. This is financial advice.</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "cvpqz4WaDyYqNLpGM", "postedAt": "2022-11-09T12:14:16.243Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>How can it be a credible bid unless you have a lot of spare billions to cover the lost customer funds? At least 5bn or so, judging by the size of the funds FTX were apparently trying to raise yesterday.</p>", "parentCommentId": "2LWhrfXdKTv92iz3G", "user": {"username": "Sabs"}}, {"_id": "EaXDLZNAQymABzrtK", "postedAt": "2022-11-09T12:37:37.537Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>I think it's very likely that the people involved are aware of this, and have <i>a lot</i> more information than we do.</p><p>Also I don't see how discussing this on the forum would help, given that it's not action relevant for us.</p>", "parentCommentId": "WF7t8uFd4xKb7b5zs", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "PeAuCfCnJ5PRnJy9p", "postedAt": "2022-11-09T12:51:42.862Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>I used to interview software engineers for a living.  Something I noticed often in interviews: \"stress-induced tunnel vision\".  The candidate being interviewed would react to the pressure of the interview by going depth-first when they should've gone breadth-first in their problem solving.</p>\n<p>On the other hand, John Cleese did <a href=\"https://www.youtube.com/watch?v=Pb5oIIPO62g\">this great talk</a> about how a relaxed frame of mind is key for creativity.</p>\n<p>The FTX team has more information than we do.  (I don't think I understand what's going on myself.)  But they are probably also very stressed out.</p>\n<p>If they're stressed in a way that impairs lateral thinking, the idea of talking to Dustin Moskovitz might not have occurred to them.  Even if it did, this thread could surface considerations that relevant parties hadn't thought of.</p>\n<p>More generally, if EAs outside FTX are less stressed out, they might be better positioned to think of an idea out of left field that saves the company.  IMO, for the next 48 hours we should be \"all hands on deck\", brainstorming ideas to save FTX (assuming they don't object).  Seems like it's worth a try at least.</p>\n", "parentCommentId": "EaXDLZNAQymABzrtK", "user": {"username": "John_Maxwell_IV"}}, {"_id": "fCEg8mFpZwojGFuut", "postedAt": "2022-11-09T12:59:11.295Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Maybe he could get together with a few wealthy friends?</p>\n", "parentCommentId": "cvpqz4WaDyYqNLpGM", "user": {"username": "John_Maxwell_IV"}}, {"_id": "mMcx9fzjWidQWFDSp", "postedAt": "2022-11-09T13:04:39.466Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Why? To light 5 billion on fire because....?</p><p>When Full Tilt Poker collapsed in 2011 after it turned they also had not segregated customer funds, Pokerstars bought them out and made their depositors whole. But Pokerstars did this because they were getting kicked out of the US market by the regulators and needed to buy some goodwill so they'd be let back in the event of eventual regulatory change (which is slowly happening, state by state). No one actually has a meaningful incentive to save FTX unless either a) you want to curry favour with crypto regulators &nbsp;or b) you're worried about contagion in the wider crypto market affecting your own assets. Both of these things might be true for Binance - maybe - but they surely aren't true for anyone else. Even Coinbase was asked to buy FTX and just straight up turned them down, presumably because the losses are far too large for Coinbase to safely cover.</p>", "parentCommentId": "fCEg8mFpZwojGFuut", "user": {"username": "Sabs"}}, {"_id": "j4ZqkMrKHZ58omGZh", "postedAt": "2022-11-09T13:06:23.823Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>SBF was reportedly ringing about the billionaire world yesterday asking for emergency funds. Coinbase was definitely approached to see if they'd buy FTX: their CEO has confirmed this. If Binance are the only ones buying (maybe, perhaps unlikely the deal actually goes through) it's because no one is touching this hot garbage even with a fifty foot bargepole.</p>", "parentCommentId": "PeAuCfCnJ5PRnJy9p", "user": {"username": "Sabs"}}, {"_id": "FwpGpet2W3XajyNqD", "postedAt": "2022-11-09T13:13:44.916Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>It seems likely SBF rang Moskovitz if he also rang the founder of Coinbase.&nbsp;</p><p>@Lorenzo I agree with John there is some value in debating this, this question is not meant as speculation. We know FTX wants to be bought and we are merely debating whether Dustin could be a buyer. Having someone EA related buy out/help another EA related company or person could be high EV, especially if you consider this a hostile takeover from Binance.&nbsp;</p>", "parentCommentId": "j4ZqkMrKHZ58omGZh", "user": {"username": "BOAS"}}, {"_id": "8asceiRcix4SoGfc2", "postedAt": "2022-11-09T13:22:23.559Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>If they aren't true for Binance, why would they even be considering buying FTX? (Genuine not rhetorical question, I have no understanding of this space at all.)&nbsp;</p>", "parentCommentId": "mMcx9fzjWidQWFDSp", "user": {"username": "Dr. David Mathers"}}, {"_id": "bePBKJJsKtkvvXX2j", "postedAt": "2022-11-09T13:24:24.510Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Can you give a source or calculation for the 5bn? If it's that much Dustin won't be able to cover it alone and you have a valid point.</p><p>I'm not sure if it's a fair comparison to Full Tilt Poker. There are certainly more incentives than your A and B. An investor with enough money can cover the withdrawals and get FTX for pennies on the dollar. Most money can be made when there's blood in the streets and Binance knows that (and possibly even caused it with the CEO selling and tweeting FTX into catastrophe). I think you saying \"they surely aren't true for anyone else\" is false. Again, anyone with money to save FTX could see this as an incredible business opportunity for the right price.&nbsp;</p><p>Having a buyer will also help FTX possibly become stable again. I hold crypto on FTX and knowing that there is possibly a buyer can persuade me and others not to withdraw.&nbsp;</p><p>Having Dustin saying he is considering buying FTX could imo also be high EV, because it increases the leverage FTX has over Binance if there's another buyer.&nbsp;</p>", "parentCommentId": "mMcx9fzjWidQWFDSp", "user": {"username": "BOAS"}}, {"_id": "TXhxdT35vKHzFQ2uR", "postedAt": "2022-11-09T13:51:29.780Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Trying to brainstorm...  I noticed <a href=\"https://twitter.com/cz_binance/status/1589374530413215744\">this tweet</a> from CZ, which states:</p>\n<blockquote>\n<p>We gave support before, but we won't pretend to make love after divorce. We are not against anyone. But we won't support people who lobby against other industry players behind their backs.</p>\n</blockquote>\n<p>Maybe SBF can hire an apology coach (if that exists? I might know someone kinda like that actually -- but someone SBF knows is probably better) and find it in his heart to apologize to CZ for \"lobbying against other industry players behind their backs\", and anything else he may have done that CZ resents?  Is there a way FTX can, legally or otherwise, commit to avoid lobbying CZ dislikes in the future?</p>\n<p>It'd be a shame if humanity's future was derailed due to our oversized egos...</p>\n", "parentCommentId": "PeAuCfCnJ5PRnJy9p", "user": {"username": "John_Maxwell_IV"}}, {"_id": "yHYabFHTHz2XmMXY4", "postedAt": "2022-11-09T13:54:46.158Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Pretty sure Pokerstars also bought Full Tilt for pennies on the dollar, and in fact later relaunched the site under their ownership before eventually shuttering it again. But the brand value of these failed businesses is generally not great, especially when fraud is involved.</p>", "parentCommentId": "bePBKJJsKtkvvXX2j", "user": {"username": "Sabs"}}, {"_id": "FWQauoxKTqNMTqmrs", "postedAt": "2022-11-09T13:55:10.126Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>See <a href=\"https://www.semafor.com/article/11/08/2022/before-deal-with-rival-ftx-scoured-wall-street-silicon-valley-billionaires-for-1-billion-lifeline\">https://www.semafor.com/article/11/08/2022/before-deal-with-rival-ftx-scoured-wall-street-silicon-valley-billionaires-for-1-billion-lifeline</a> for the size of the hole being around 5bn. Could well be higher tbh.</p>", "parentCommentId": "bePBKJJsKtkvvXX2j", "user": {"username": "Sabs"}}, {"_id": "jwyjssanzvvKE7D2X", "postedAt": "2022-11-09T14:06:44.835Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Additional <i>pro:</i></p><ul><li><strong>Possible loss of the unique prospect to make the world critically thinking and cooperative (extremely high WALY): </strong>FTX uniquely uses marketing that motivates critical thinking and cooperation, while Binance (just like almost any other company) uses fear, shame, perception of deprivation, and other negative emotions to attract and keep customers. Assuming the global expansion of the metaverse, whether people are enjoying cooperation and thought processes versus assume an aggressive/hateful environment which they have to pay attention to makes a decisive difference in the global quality of life.<ul><li><i>Con:</i> <strong>Uncertainty in FTX marketing success:</strong> It is uncertain whether FTX would have successfully scaled up this marketing and norms. Possibly, if a prospective trader/NFT collector sees a Binance ad that uses almost subliminal techniques to motivate the impulse to participate (e. g. subconsciously gaining the power to abuse while protecting oneself) and after sees an FTX ad that shows a complex critique on the initial skepticism around well-known innovations, they may just use Binance because, without critical thinking, it is the more powerful/threatening actor.</li><li><i>Con:</i> <strong>FTX cannot oversee a decentralized ecosystem:</strong> Decentralized ecosystem does not allow for product standardization. Since hundreds of new products emerge, FTX cannot effectively oversee most marketing and product development.</li><li><i>Con:</i> <strong>Meta to an extent optimizes for attention so would likely use normal marketing.</strong> Since Meta largely optimizes for attention, it is likely that if its stakeholders acquire FTX, the marketing would become normal, similar to that of Binance.</li><li><i>Con:</i> <strong>FTX.us is unaffected.</strong> The <a href=\"https://www.youtube.com/playlist?list=PLLDdsQN_5incW0Vv_Z2GLhdP948rEnYfL\">marketing</a> that I was referring to was used in the US. FTX.us is unaffected by the purchase. Thus, it can be argued that the sale does not affect FTX (US) marketing substantially.</li></ul></li></ul><p><i>Additional con:</i></p><ul><li><strong>Counterfactual investment opportunities for Dustin Moskovitz and SBF:</strong> With the sale to Binance, both Dustin Moskovitz and SBF will be able to invest into other ventures. These ventures can be more profitable and/or impactful than FTX. Thus, 'Profit for Good' could be maximized.</li><li><strong>CZ is in it to donate to charity:</strong> According to <a href=\"https://youtu.be/W0vEdn2jwyI?t=257\">this video</a> (which is similar to the <a href=\"https://www.youtube.com/watch?v=pVlkFW43820\">one with SBF</a>), CZ \"plans to donate his wealth to charity.\" Thus, this development can be truly seen as 'competitive cooperation' rather than 'taking the money to buy yachts.'</li></ul><p>This would suggest that Dustin Moskovitz should not buy FTX. However, that is only a guess.</p>", "parentCommentId": null, "user": {"username": "brb243"}}, {"_id": "vQvs9T2Nc9ABBejq9", "postedAt": "2022-11-09T14:24:19.964Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Clawback suits. FTX cannot declare chapter 11 because of these. Dealing in unregistered securities is unprotected by the FDIC but also subject to very strong anti-Ponzi laws. Binance is covering up, not buying.</p>", "parentCommentId": "8asceiRcix4SoGfc2", "user": {"username": "cookiecut"}}, {"_id": "GySB5mmjTBGfiiP65", "postedAt": "2022-11-09T14:28:01.433Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>That is basically meaningless to me as a non-finance person, but why would Binance want to cover up a rival's crimes?&nbsp;</p>", "parentCommentId": "vQvs9T2Nc9ABBejq9", "user": {"username": "Dr. David Mathers"}}, {"_id": "PqDNckKRacxzdf8Lz", "postedAt": "2022-11-09T15:02:21.370Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Even if that has extremely low odds of working that seems like it could be worth a try. Ego's have caused many catastrophe's before.&nbsp;</p>", "parentCommentId": "TXhxdT35vKHzFQ2uR", "user": {"username": "BOAS"}}, {"_id": "TMvrJtMCgtFAuSvoc", "postedAt": "2022-11-09T15:07:08.054Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Thanks, I want to clarify that Dustin buying FTX would not be the same as Meta buying FTX.&nbsp;<br><br>I didn't know about CZ wanting to donate his wealth, that's insightful. Perhaps EA can try and talk with him about his charitable giving.&nbsp;<br><br>The counterfactual is a good reason against the takeover, thanks for als bringing that up. Even if the EV of the takeover is high, but the probability of success low, a failed acquisition might mean EA loses most of its money.&nbsp;</p>", "parentCommentId": "jwyjssanzvvKE7D2X", "user": {"username": "BOAS"}}, {"_id": "bQpvCgSA4KXBoQJrL", "postedAt": "2022-11-09T15:57:53.332Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>I'm not very knowledgeable about the crypto exchange space. What advantages might FTX becoming a Profit for Good Company create? Could crypto investors go with them instead of competitors because the profits generated are for the benefit of effective charities?</p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "mJXFzpM28nhiq9QyK", "postedAt": "2022-11-09T18:27:18.240Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>Possibly to reduce overall regulation of crypto and subsequent heat on Binance.</p>", "parentCommentId": "GySB5mmjTBGfiiP65", "user": {"username": "Greg_Colbourn"}}, {"_id": "9fpBxxHcLYJ9hHxMp", "postedAt": "2022-11-10T00:33:19.733Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p><s>It's 8 billion now. </s>The ask might be $4 billion.</p><p><a href=\"https://www.wsj.com/livecoverage/stock-market-news-today-11-09-2022/card/ftx-needs-8-billion-bankman-fried-tells-investors-2RSa5oqZyZZ5YrPLuZuL\">https://www.wsj.com/livecoverage/stock-market-news-today-11-09-2022/card/ftx-needs-8-billion-bankman-fried-tells-investors-2RSa5oqZyZZ5YrPLuZuL</a></p><p><a href=\"https://www.reuters.com/technology/ftx-needs-emergency-funding-amid-withdrawal-requests-wsj-2022-11-09/\">https://www.reuters.com/technology/ftx-needs-emergency-funding-amid-withdrawal-requests-wsj-2022-11-09/</a></p><p>&nbsp;</p><p>\"Crypto exchange Binance reversed course on a rescue offer for FTX Wednesday, leaving the prominent digital firm with an uncertain future as it faces a shortfall of up to $8 billion, according to people familiar with the matter.</p><p><br>Binance chose not to go ahead with the nonbinding offer following a review of the company’s finances, the exchange said. “In the beginning, our hope was to be able to support FTX’s customers to provide liquidity, but the issues are beyond our control or ability to help,” Binance said in a statement.<br>In a call Wednesday with investors in FTX, founder and Chief Executive Sam Bankman-Fried said he needs emergency funding due to customer withdrawal requests received in recent days, the people familiar with the matter said. Those requests sparked a debilitating liquidity squeeze.</p><p>FTX told investors that it was hoping to raise up to $4 billion in equity to fill the shortfall, people familiar said.</p><p>The implosion of the Binance rescue deal weighed on financial markets already rattled by uncertainty around the outcome of U.S. midterm elections. The Nasdaq dove around 2.5% Wednesday while the Dow Jones Industrial Average and S&amp;P 500 both fell around 2%.</p><p>Bitcoin, the biggest and best-known cryptocurrency, fell around 16%, bringing its value below $16,000 for the first time since November 2020. It is now down around 75% from an all-time high reached in November 2021.</p><p>Also on Wednesday, Securities and Exchange Commission Chairman Gary Gensler issued a stern warning to crypto platforms, after more than a year of encouraging them publicly to register with his agency. He also likened the broader crypto market to a stack of Jenga blocks that gets weaker with each failure.<br>Once seen as a shining survivor in a struggling industry, FTX’s fall has sent shockwaves through the cryptocurrency industry. Just months ago, Mr. Bankman-Fried committed nearly a billion dollars to bail out struggling cryptocurrency lenders and was an active lobbyist considered widely to be the face of crypto in Washington.&nbsp;</p><p>Binance’s retreat now leaves FTX’s fate unclear; the cause and full extent of FTX’s financial problems are unknown. FTX declined to comment.</p><p>In an internal FTX slack channel, Mr. Bankman-Fried on Wednesday wrote, “We obviously just saw Binance’s statement; they relayed that to the media first, not to us, and had not previously informed us or expressed those reservations,” according to a copy of the message reviewed by The Wall Street Journal.<br>Mr. Bankman-Fried wrote that he was working on next steps and doing what he can to protect customers, employees and investors. “I’m deeply sorry that we got into this place, and for my role in it. That’s on me, and me alone, and it sucks, and I’m sorry, not that that makes it any better.”</p><p>Besides the firm and Mr. Bankman-Fried, well-known institutions that invested in the exchange are on the hook for potentially big losses. Among investors in a $900 million fundraising last year were SoftBank Group Corp., Sequoia Capital, hedge fund Third Point and tech-oriented private-equity firm Thoma Bravo.</p><p>Individual traders could also lose funds. FTX has halted withdrawals of both crypto and fiat currencies from the exchange, according to a pinned post in its official Telegram channel.</p><p>Michael Turský, a European crypto trader, said he hasn’t been able to withdraw his nearly $11,000 from FTX since midday Wednesday. Those funds represented around 70% of his liquid net worth, he said.</p><p>He said he tried to withdraw his cash multiple times, to no avail. “Knowing FTX’s brand and name, I would have never thought it would go under in a few days,” Mr. Turský said. “Even if it did, I would have never expected them to stop all withdrawals”</p><p>Losses related to FTX spread beyond the firm itself. Stock investors dumped shares of publicly-traded companies that are tied to cryptocurrencies with holdings of them or that derive fees from trading them.</p><p>Shares in Coinbase Global Inc. fell almost 10% despite assurances from its chief executive on Twitter that the company has sufficient assets for customer withdrawals and doesn’t have any material exposure to FTX. Coinbase closed at its lowest level since going public last year when it fetched an $85 billion valuation. Its market value Wednesday was around $10 billion.</p><p>Shares of Silvergate Capital Corp., the closest U.S. bank to the crypto world, dropped 12% and have shed some 75% of their value this year. Shares of MicroStrategy Inc., which pivoted from business software into largely a buy-and-hold vehicle for bitcoin, fell nearly 20%.</p><p>Brokerage app Robinhood Markets Inc., which offers trading in more than just crypto, was burned by fears that one of its biggest shareholders, Mr. Bankman-Fried, would have to dump his shares. Robinhood shares dropped nearly 14% on Wednesday, bringing losses for the week to more than 30%.</p><p>The cause of the FTX liquidity squeeze still isn’t known, but some investors and crypto holders are asking if links between the exchange and a related company, Alameda Research, could have contributed to the crisis. Alameda is majority owned by Mr, Bankman-Fried, and he founded both FTX and Alameda.</p><p>Questions about the depth and extent of FTX and Alameda’s financial relationship grew last week after CoinDesk published a report that indicated much of Alameda’s balance sheet was made up of FTT, a cryptocurrency created by FTX.</p><p>Cryptocurrency exchanges, like their counterparts in the world of traditional, regulated finance, rely on a mix of partners to provide digital assets for trading, like bitcoin or ether. So-called market makers help traders buy and sell. They get paid by collecting a small difference between the bid and offer price.</p><p>Having ties between an exchange and market maker raised governance issues and the potential for conflicts of interest. In theory, such ties could allow a market maker to potentially trade on privileged information or use the exchange to inflate or deflate prices of a given security.</p><p>“These related-party relationships are all red flags that any regulator would recognize,” said Larry Harris, a finance professor at the University of Southern California’s Marshall School of Business and a former Securities and Exchange Commission chief economist.</p><p>In traditional financial markets for equities and futures, exchanges are required to be neutral platforms. Regulators discourage them from being intertwined with trading firms. In the unregulated world of crypto, though, there aren’t any such constraints.</p><p>There were other links between FTX and Alameda, which besides being a market maker traded for its own purposes. The firm used FTX’s FTT tokens as collateral for loans it took out from other crypto lenders, according to people familiar with the matter.</p><p>FTT went into freefall in the days after the CoinDesk report and has lost around 90% of its value.</p><p>Mr. Bankman-Fried previously rebutted the idea Alameda was intertwined with FTX, saying to the Journal in February that none of FTX’s market makers have access to any nonpublic market data. And while Alameda trades on FTX, he said, “their volume is a very small fraction of overall exchange volume, and their account’s access is the same as others.\"\"</p>", "parentCommentId": "FWQauoxKTqNMTqmrs", "user": {"username": "Charles He"}}, {"_id": "qnaKwKsaEsJLL6HpJ", "postedAt": "2022-11-10T09:12:23.017Z", "postId": "axMM3wzqetWwtbXis", "htmlBody": "<p>At this point FTX turning into a PFG would be very bad optics for the movement and maybe a net negative.&nbsp;<br><br>I turned to FTX because I knew what SBF would do with the profits, but many don't know that, and I think they could have done better if they advertised that fact to consumers. FTX has loads of external for-profit capital so that makes it very hard for them to turn to the PFG model in practice though.&nbsp;</p>", "parentCommentId": "bQpvCgSA4KXBoQJrL", "user": {"username": "BOAS"}}]