[{"_id": "wD8ExiHZJ5dNDfBm3", "postedAt": "2023-11-12T01:04:27.819Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I've thought about similar things to this before. Thanks for writing it out for the community. I think there are few reasons for this change.</p><ol><li>The average EA today is far less \"committed\" to EA than in 2016. By committed, I mean making personal sacrifices for altruism. Here is a website I found for <a href=\"https://www.jefftk.com/donations#footnote1\">Jeff Kauffman and Julia Wise</a> where you can see them giving 50% of their income since ~2012. If I'm not mistaken, they've had a family for most of that time. This behavior is significantly less common nowadays, particularly as a proportion of people in the movement where I suspect a good fraction of people in the community donate relatively little, let alone 50% of their income.</li><li>Salaries at EA organizations have grown a lot. People used to take massive pay cuts to do EA non-profit work. Hopefully people from the early days can fill in some numbers here but there is a <a href=\"https://forum.effectivealtruism.org/posts/cfdnJ3sDbCSkShiSZ/ea-and-the-current-funding-situation\">picture</a> here of an office in the basement of an estate agent, salaries being 15k/year pre-tax and lunch being the same every day. In the OP, Abraham talks about a $500 donation allowing him to hire a contractor and being able to hire staff after ~75k of donations. Apart from a select few CE incubated charities, 75k doesn't even cover a single person's salary for a year at most EA orgs. Most salaries I see today for EA positions are 100k+, particularly at longtermist organizations.</li></ol><p>There are a few solutions to this:</p><ol><li>EA gets more frugal. We might not go back to 15k (20k or so with CPI adjustment) but a typical salary could become 50-60k. Catered lunches, generous expense policies, <a href=\"https://www.openphilanthropy.org/research/new-roles-on-our-gcr-team/#2-about-working-at-open-philanthropy\">large benefits packages and ample + flexible + paid time off</a> become a pot luck once a week, basic healthcare coverage and 2 weeks of vacation. All of a sudden, running a 10 person organization takes $1M instead of $10M and it becomes much more feasible to get 30 x $10-30k with a couple of 50-100k donations to cover the cost of the organization.</li><li>A general decentralization of the funding landscape. Open Phil (and maybe SFF) get divided into ~5 orgs. A significant amount of regranting gets done on the order of ~100k-1M per regrantor who otherwise do other things.</li></ol><p>I think there are costs to both approaches. There will be a lot less work done by \"less committed\" EAs if sacrifices compared to the private sector become expected. Furthermore, there are many efficiency gains to be had by not having several grantmaking orgs duplicate the same work + a bunch of less skilled and trained regrantors might on average make worse grants.</p><p>Still something to consider.</p>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "XLgnHmMo8HoLeAyBe", "postedAt": "2023-11-12T11:47:52.658Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks for writing this up! One problem with this proposal that I didn't see flagged (but may have missed) is that if the ETG donors defer to the megadonors you don't actually get a diversified donor base. I earn enough to be a mid-sized donor, but I would be somewhat hesitant about funding an org that I know OpenPhil has passed up on/decided to stop funding, unless I understood the reasons why and felt comfortable disagreeing with them. This is both because of fear of unilateralist curse/downside risks, and because I broadly expect them to have spent more time than me and thought harder about the problem. I think there's a bunch of ways this is bad reasoning, grantmaker time is scarce and they may pass up on a bunch of good grants due to lack of time/information/noise, but it would definitely give me pause.</p>\n<p>If I were giving specifically within technical AI Safety (my area of expertise), I'd feel this less strongly, but still feel it a bit, and I imagine most mid-sized donors wouldn't have expertise in any EA cause area.</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "3g9yozzw34tuCAfAJ", "postedAt": "2023-11-12T12:13:34.501Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I've found that if a funder or donor asks, (and they are known in the community,) most funders are happy to privately respond about whether they decided against funding someone, and often why, or at least that they think it is not a good idea and they are opposed rather than just not interested.</p>", "parentCommentId": "XLgnHmMo8HoLeAyBe", "user": {"username": "Davidmanheim"}}, {"_id": "YMzYr7a8m7f8YPegk", "postedAt": "2023-11-12T15:58:42.504Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>It's definitely true that, holding everything equal, spending less on salaries means it's easier to fundraise, and organizations can get more done for a given amount of money. But of course if you ask someone who could be earning $500k to work for $50k most of them (including me!) will say no, and even people who say yes initially are more likely to burn out and decide this is not what they want to do with their life.</p>\n<p>There are also other costs to pushing hard on frugality: people will start making tradeoffs that don't really make sense given how valuable their time is to the organization. For example, in 2015 when our first child was refusing to eat at daycare it would have been possible for us to hire someone to watch them, but this would have been expensive. Instead, <a href=\"https://thewholesky.wordpress.com/2015/05/28/two-working-parents-no-daycare/\">we chose a combination of working unusual hours and working fewer hours</a> so she wouldn't need to be in daycare. We were both earning to give then, so this was fine, but if we had been doing work that was directly valuable I think it would probably have been a false economy.</p>\n<blockquote>\n<p>if sacrifices compared to the private sector become expected</p>\n</blockquote>\n<p>I think this general area is quite subtle and confusing, where people have really different impressions depending on their background. From my perspective, as someone making about 1/3 as much in a direct work job as I was making (and expect I could still make) in industry, this is already a relative sacrifice. On the other hand, I also know people at EA orgs who would be making less money outside of EA. I don't at all have a good sense of which of these is more typical? And then the longer someone spends within EA, developing EA-specific career capital and foregoing more conventional career capital, the lower a sacrifice it looks like they are making (relative to the highest comp job they could get right now) but also the higher a sacrifice there actually making (relative to a career in which they had optimized for income).</p>\n<p>(And, as always, when people give us as examples of people making large sacrifices, I have to point out that the absolute amount of money we have kept has been relatively high. I expect most EAs who spent a similar period in direct work were living on less and have much lower savings than we can. And I think this would still be true even if current direct work compensation had been in place since 2012.)</p>\n", "parentCommentId": "wD8ExiHZJ5dNDfBm3", "user": {"username": "Jeff_Kaufman"}}, {"_id": "DLsHfiHHnh3HmMJjM", "postedAt": "2023-11-12T16:47:02.937Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks Neel, I get the issue in general, but I'm a bit confused about what exactly the crux really is here for you?</p>\n<p>I would have thought you would be in one of the best positions of anyone to donate to an AI org - you are fully immersed in the field and I would have thought in a good position to fund things you think are promising in on the margins, perhaps even new and exciting things that AI funds may miss?</p>\n<p>Our of interest why aren't you giving a decent chunk away at the moment? Feel free not to answer if you aren't comfortable with it!</p>\n", "parentCommentId": "XLgnHmMo8HoLeAyBe", "user": {"username": "NickLaing"}}, {"_id": "e2eMetiJkxazDkuye", "postedAt": "2023-11-12T17:03:03.130Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>EDITED HEAVILY RESPONDING TO COMMENTS BELOW</p>\n<p>I have a little bit of a different perspective on that it doesn't feel or appear good to label \"only\" earning 70k a \"sacrifice\", even if it is technically correct. Maybe using language like \"trade-off\" or \"tough choice\" might feel a little better.</p>\n<p>70k (OPs suggested salary) still puts you very close to the top 1 percent of global earners. Imagine being a Ugandan interested in effective altruism looking at this discussion. The idea that a salary of 70k US being a 'sacrifice' could seem grating and crass, even if the use of the word is correct. Everyone earning 70k doing a satisfying job that is making a difference in the world, is super fortunate with a whole lot of factors that have come together to make that possible.</p>\n<p>Even just having the choice to be able to make the decision whether to earn to give or do direct work for \"only\" 60 or 70k is a privilege most of the world doesn't have. I think it could be considered insensitive or even arrogant to talk in terms of sacrifice while being among the richest people around. To take it to the extreme (perhaps straw man tho) how would we feel about a sentence like \"Bill Gates sacrificed an hour of his valuable time to serve in a soup kitchen\"</p>\n<p>Yes it may be psychologically hard to earn a while lot less than you could be doing something else, but I'm not sure \"sacrifice\" is the best terminology to be using.</p>\n", "parentCommentId": "YMzYr7a8m7f8YPegk", "user": {"username": "NickLaing"}}, {"_id": "6QtfY8BxE3vA6xxiE", "postedAt": "2023-11-12T17:15:55.155Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>I have a little bit of a different perspective on that I don't really consider earning \"only\" 70k a \"sacrifice\". Maybe it could be considered a \"relative sacrifice\"? But even that language makes me uncomfortable.</p></blockquote><p>Any sacrifice is relative. You can only sacrifice something if you had or could have had it in the first place.</p>", "parentCommentId": "e2eMetiJkxazDkuye", "user": {"username": "Erich_Grunewald"}}, {"_id": "8fpzmyA7ddiCNBgsb", "postedAt": "2023-11-12T17:38:40.897Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I agree - all else equal - you'd rather have a flatter distribution of donors for the diversification (various senses) benefits. I doubt this makes this an important objective all things considered.</p><p>The main factor on the other side of the scale is scale itself: a 'megadonor' can provide a lot of support. This seems to be well illustrated by your original examples (Utility Farm and Rethink). Rethink started later, but grew much 100x larger, and faster too. I'd be surprised if folks at UF would not prefer Rethink's current situation, trajectory - and fundraising headaches - to their own.</p><p>In essence, there should be some trade-off between 'aggregate $' and 'diversity of funding sources' (however cashed out) - pricing in (e.g.) financial risks/volatility for orgs, negative externalities on the wider ecosystem, etc. I think the trade between 'perfectly singular support' and 'ideal diversity of funding sources' would be much less than an integer factor, and more like 20% or so (i.e. maybe better getting a budget of 800k from a reasonably-sized group than 1M from a single donor, but not better than 2M from the same).</p><p>I appreciate the recommendation here is to complement existing practice with a cohort of medium sized donors, but the all things considered assessment is important to gauge the value of marginal (or not-so-marginal) moves in this direction. Getting (e.g.) 5000 new people giving 20k a year seems a huge lift to me. Even if that happens, OP still remains the dominant single donor (e.g. it gave roughly the amount this hypothetical cohort would to animal causes alone in 2022). A diffuse 'ecosystem wide' benefits of these additional funders struggles by my lights to vindicate the effort (and opportunity costs) of such a push.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Gregory_Lewis"}}, {"_id": "E9H7YbFfhs5GbgcGF", "postedAt": "2023-11-12T18:28:34.108Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>The sense in which I'm using \"sacrifice\" is just \"giving something up\": it's not saying anything about how the situation post-sacrifice compares to other people's. For example, I could talk about how big or small a sacrifice it would be for me go vegan, even if as a vegan I would still be spending more on food and having a wider variety of options than most people globally. I think this is pretty standard, and looking through various definitions of \"sacrifice\" online I don't see anyone seeming to use it the way you are suggesting?</p>\n", "parentCommentId": "e2eMetiJkxazDkuye", "user": {"username": "Jeff_Kaufman"}}, {"_id": "YcumShzLekojnc32k", "postedAt": "2023-11-12T19:03:17.525Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Yes I've googled and I think you are right, the word sacrifice is mainly used in the way you were using it in your comment. I've edited my comment to reflec t this.</p><p>I still think using the concept of sacrifice, when we are talking people at the absolute top of the chain deciding between a range of amazing life options doesn't feel great and perhaps could not look great externally either. I would rather talk positively about choosing the best option we have, or perhaps talking about \"trade offs\" rather than \"sacrifices\".</p>", "parentCommentId": "E9H7YbFfhs5GbgcGF", "user": {"username": "NickLaing"}}, {"_id": "MkmgapHrizxE5ddH3", "postedAt": "2023-11-12T19:07:37.180Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Yes I agree with this, Jeff used the words \"relative sacrifice\", and I was wondering if it would be better words to use, as it somewhat softens the \"sacrifice\" terminology. But I think I'm wrong about this. Have deleted it from the comment.</p>", "parentCommentId": "6QtfY8BxE3vA6xxiE", "user": {"username": "NickLaing"}}, {"_id": "bi2rdbnWjfHv8qaWB", "postedAt": "2023-11-12T20:03:32.945Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I've seen a number of conversations about salary in EA where people talk past each other. Below is a list of what I think are some key cruxes- not everywhere people disagree, but where they are most likely to have different implicit assumptions, and most likely to have disagreements stemming only from definitions. I'd love if everyone arguing about salary in this thread would fill this out.&nbsp;</p><ol><li><s>What salary are you proposing?</s> (US$70k ?)</li><li>What living conditions do you expect this to buy people?<ol><li>Housing?</li><li>Location?</li><li>Kids?&nbsp;</li><li>Food?</li><li>Savings rate?</li></ol></li><li>What is your bar for “enough” money? Not keeling over dead? Peak productivity but miserable? Thriving?&nbsp;</li><li>What percentage of people can reach that state with your suggested salary?<ol><li>Some issues that might raise people's expenses: health issues (mental and physical), kids, introversion, far flung family.</li></ol></li><li>What do you expect to happen for people who can’t meet the condition set in question 3 with the salary set in question 1?</li><li>If you lose your top choice due to insufficient salary, how good do you expect the replacement to be?&nbsp;</li><li>What is your counterfactual for the money saved on salary?</li></ol>", "parentCommentId": "e2eMetiJkxazDkuye", "user": {"username": "Elizabeth"}}, {"_id": "nbKHoAoTLYBfREx77", "postedAt": "2023-11-12T20:07:34.760Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks Elizabeth can you clarify what you mean by no. 6?</p>", "parentCommentId": "bi2rdbnWjfHv8qaWB", "user": {"username": "NickLaing"}}, {"_id": "MXwoHc9JFd7jjWwn4", "postedAt": "2023-11-12T22:14:15.456Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>OP doesn't have the capacity to evaluate everything, so there are things they don't fund that are still quite good.</p>\n<p>Also OP seems to prefer to evaluate things that have a track record, so taking bets on people to be able to get more of a track record to then apply to OP would be pretty helpful.</p>\n<p>I also think orgs generally should have donor diversity and more independence, so giving more funding to the orgs that OP funds is sometimes good.</p>\n", "parentCommentId": "XLgnHmMo8HoLeAyBe", "user": {"username": "Peter_Hurford"}}, {"_id": "4aSuoif4XshbF9Sab", "postedAt": "2023-11-12T22:37:39.832Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I'm in a relatively similar position to Neel. I think technical AI safety grant makers typically know way more than me about what is promising to fund. There is a bunch of non-technical info which is very informative for knowing whether a grant is good (what do current marginal grants look like, what are the downside risks, is there private info on the situation which makes things seem sketchier, etc.) and grant makers are generally in a better position than I am to evaluate this stuff.<br><br>The limiting factor [in technical ai safety funding] is in having enough technical grant makers, not in having enough organizational diversity among grantmakers (at least at current margins).<br><br>If OpenPhil felt more saturated on technical AI grant makers, then I would feel like starting new orgs pursing different funding strategies for technical AI safety could look considerably better than just having more people work at grant making at OpenPhil.<br><br>That said, note that I tend to agree to reasonable extent with the technical takes at OpenPhil on AI safety. If I heavily disagreed, I might think starting new orgs looks pretty good.</p>", "parentCommentId": "DLsHfiHHnh3HmMJjM", "user": {"username": "Ryan Greenblatt"}}, {"_id": "9DPgS8hzHfi5Gdazw", "postedAt": "2023-11-12T22:39:02.471Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>OP doesn't have the capacity to evaluate everything, so there are things they don't fund that are still quite good.</p><p>Also OP seems to prefer to evaluate things that have a track record, so taking bets on people to be able to get more of a track record to then apply to OP would be pretty helpful.</p></blockquote><p>IMO, these both seem like reasons for more people to work at OP on technical grant making more than reasons for Neel to work part time on grant making with his money.</p>", "parentCommentId": "MXwoHc9JFd7jjWwn4", "user": {"username": "Ryan Greenblatt"}}, {"_id": "AS7ek2FPq2Svje62b", "postedAt": "2023-11-12T22:52:28.080Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Suppose you want to hire Alice, but she won't accept the salary, so you go to your second choice, Bob. How good is Bob, relative to Alice? Indistinguishable? 90% of impact? 50% of impact?&nbsp;</p>", "parentCommentId": "nbKHoAoTLYBfREx77", "user": {"username": "Elizabeth"}}, {"_id": "PLxzAHL4EDDu6Jm8n", "postedAt": "2023-11-12T23:11:32.291Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Why not both? I assume OP is fixing their capacity issues as fast as they can, but there still will be capacity issues remaining. IMO Neel still would add something here that is worth his marginal time, especially given Neel's significant involvement, expertise, and networks.</p>\n", "parentCommentId": "9DPgS8hzHfi5Gdazw", "user": {"username": "Peter_Hurford"}}, {"_id": "ZZQsARMwLTiniydL3", "postedAt": "2023-11-12T23:18:41.643Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>The underlying claim is that many people with technical expertise should do part time grant making?<br><br>This seems possible to me, but a bit unlikely.</p>", "parentCommentId": "PLxzAHL4EDDu6Jm8n", "user": {"username": "Ryan Greenblatt"}}, {"_id": "qSE9uprAJg9R3Fo4B", "postedAt": "2023-11-12T23:30:41.884Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I think it's worth considering. My guess is that doing so would not necessarily be very time consuming. Could also be interested for them to pool donations to limit the number of people who need to do it, form a giving circle, or donate to a fund (e.g., EA Funds).</p>\n", "parentCommentId": "ZZQsARMwLTiniydL3", "user": {"username": "Peter_Hurford"}}, {"_id": "foPCczM8CWeg8whJw", "postedAt": "2023-11-13T02:26:18.607Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>In many cases you just don't end up hiring anyone. There is no Bob.</p>", "parentCommentId": "AS7ek2FPq2Svje62b", "user": {"username": "Ian Turner"}}, {"_id": "eBy9cXLts7BsuhrYF", "postedAt": "2023-11-13T05:09:23.785Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>OP doesn't have the capacity to evaluate everything, so there are things they don't fund that are still quite good.</p></blockquote><p>Maybe there should be some way for OP to publicize what they don't evaluate, so others can avoid the adverse selection.</p>", "parentCommentId": "MXwoHc9JFd7jjWwn4", "user": {"username": "Larks"}}, {"_id": "zjk5ipkqdPtB4pYHf", "postedAt": "2023-11-13T11:12:27.821Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I disagree with this (except unilateralist curse), because I suspect something like the <i>efficient market hypothesis </i>plays out when you many medium-small donors. I think it's suspect that one wouldn't make the same argument as the above for the for-profit economy.</p>", "parentCommentId": "XLgnHmMo8HoLeAyBe", "user": {"username": "ElliotJDavies"}}, {"_id": "hAFGRPanebHALLmqx", "postedAt": "2023-11-13T11:17:35.532Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I know we are moving to absurdity now a little, but I feel like at 70,000 dollars in a position where people are doing meaningful work that aligns with their values, 90 percent Bob is probably there.</p>\n", "parentCommentId": "foPCczM8CWeg8whJw", "user": {"username": "NickLaing"}}, {"_id": "w8LJvKQjQjcfm9zqx", "postedAt": "2023-11-13T11:23:56.109Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>Getting (e.g.) 5000 new people giving 20k a year seems a huge lift to me. [...] A diffuse 'ecosystem wide' benefits of these additional funders struggles by my lights to vindicate the effort (and opportunity costs) of such a push.&nbsp;</p></blockquote><p>One problem I have with these discussions, including past discussions about why national EA orgs should have fundraising platform, is the reductionist and zero-sum thinking given in response.&nbsp;<br><br>I identified above, how an argument stating less donors results in more efficiency, would never be made in the for profit world. Similarly, a lot of the things we care about (talent, networks, entrepreneurship) become stronger the more small/medium donors we have. For the same reason that eating 3 meals in a day makes it easier to be productive - despite it taking more time compared to not eating at all - having more of a giving small-donor ecosystem will make it easier to achieve other things we need.&nbsp;</p>", "parentCommentId": "8fpzmyA7ddiCNBgsb", "user": {"username": "ElliotJDavies"}}, {"_id": "WA3uBPHbsZPX5zQgr", "postedAt": "2023-11-13T11:45:58.655Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<ol><li><s><strong>What salary are you proposing?</strong></s><strong> (US$70k ?)</strong><br>Obviously there's lots of different countries, and lot's of different cause areas. But just focusing on one in particular. I think CEA employees in the UK, could largely pay teacher salaries (24-30K GBP) and basically be fine, not lose lots of talent.&nbsp;</li><li><strong>What living conditions do you expect this to buy people?</strong><br>Pretty good conditions. Good apartment, good savings.</li><li><strong>What is your bar for “enough” money? Not keeling over dead? Peak productivity but miserable? Thriving?&nbsp;</strong><br>As soon as you're saving for pension, you're in a good spot I'd say.&nbsp;</li><li><strong>What percentage of people can reach that state with your suggested salary?</strong><ol><li><strong>Some issues that might raise people's expenses: health issues (mental and physical), kids, introversion, far flung family.</strong><br><br>&gt;85% I'd guess. Keep in mind median UK salary is 38k GBP, and median UK age of work force is significantly older than CEA employees (older people need more money).&nbsp;</li></ol></li><li><strong>What do you expect to happen for people who can’t meet the condition set in question 3 with the salary set in question 1?</strong></li></ol><p>The same as the for-profit world, if they're good enough they're paid more. But that there's a downward pressure on people's salaries, not just a upwards pressure (as I believe we currently have).</p><p><strong>If you lose your top choice due to insufficient salary, how good do you expect the replacement to be?&nbsp;</strong></p><p>For CEA, I'd likely guess they'd be indistinguishable for most roles most of the time.&nbsp;</p><p><strong>What is your counterfactual for the money saved on salary?</strong></p><p>Half of one more employee, and a marginal effect resulting in more of an agile ecosystem (i.e. more entrepreneurship, more commitment).</p>", "parentCommentId": "bi2rdbnWjfHv8qaWB", "user": {"username": "ElliotJDavies"}}, {"_id": "6PousSLS7wRoid3b4", "postedAt": "2023-11-13T12:02:00.983Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks for writing this!<br>I find this vision compelling, but I wonder how far away we are from it. As Gregory Lewis mentions in another comment, 5,000 donors giving $20,000 is ambitious in the short term (under 10,000 people <a href=\"https://www.givingwhatwecan.org/about-us/members\">have signed the GWWC pledge</a>, for example).&nbsp;<br>To get a slightly more concrete view of the tractability here: In the case of Rethink, what portion of donations would need to come from small/medium-sized donors before it had appreciable effect on Rethink's ability to:</p><blockquote><p>worry less about what specific people in power think, and respond more to what the community at large thinks, and to rely more on their own on-the-ground judgment of the best way to do their work.</p></blockquote><p>(PS- no worries if you'd rather not share your opinions on your employer specifically, I only mention them because you bring them up in the body of the post).</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "YvTuGu6QrjHyCu4Qn", "postedAt": "2023-11-13T12:05:16.009Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I agree with this post. One mechanism that's really missing in this discussion, is the value of marginal grants. Large grant makers claim to appreciate the value of marginal grants, but in practice I have rarely seen it. Instead, for small org at least, a binary decision is made to fund or not fund the project.&nbsp;<br><br>For smaller and upstarting projects, these marginal grants are really important (as highlighted in your story). A donor might not be able to fund an office space, but they can fund the deposit. Or they can't fund the deposit, but they can fund the furniture. These are small coordination problem, but they make up most of what it means to get small and medium sized organizations off the ground.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "sYdAyFK8rfdjHyDBi", "postedAt": "2023-11-13T19:25:04.075Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p><strong>If you lose your top choice due to insufficient salary, how good do you expect the replacement to be?&nbsp;</strong></p></blockquote><blockquote><p>For CEA, I'd likely guess they'd be indistinguishable for most roles most of the time.&nbsp;</p></blockquote><p><br>I'm CEA's main recruitment person and I've been involved with CEA's hiring for 6+ years. I've also been involved in hiring rounds for other EA orgs.<br><br>I don't remember a case where the top two candidates were \"indistinguishable.\" The gap very frequently seems quite large (e.g. our current guess is the top candidate might be twice as impactful, by some definition of expected impact). There have also been many cases where the gap is so large we don't hire for the role at all and work we feel is important&nbsp; simply doesn't happen. There have also, of course, been cases where we have two candidates we are similarly excited about. This is rare. If it does happen, we'd generally be happy to be transparent about the situation, and so if you have been offered a role and are wondering about your own replacability, I'd encourage you to just ask.</p>", "parentCommentId": "WA3uBPHbsZPX5zQgr", "user": {"username": "Cait_Lion"}}, {"_id": "gyWriEp67R6z5aQji", "postedAt": "2023-11-13T22:12:39.809Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I disagree, because you can't short a charity, so there's no way for overhyped charity \"prices\" to go down</p>\n", "parentCommentId": "zjk5ipkqdPtB4pYHf", "user": {"username": "Neel Nanda"}}, {"_id": "L98ybwHyQcmxCYXXa", "postedAt": "2023-11-13T23:04:10.320Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks for responding, it has really helped me clarify my understanding of your views.&nbsp;</p><p>I do think the comparison to teacher wages is a little unfair. In the US teaching jobs are incredibly stable, and stable things pay less. Unless the UK is very different, I expect that EA jobs would need to pay more just to have people end up with the same financial situation over time, because instability is expensive. But this is maybe a 10% difference, not so not that important in the scheme of things.&nbsp;</p><p>I think a big area of contention (in all the salary discussions, not just this one) stems from a disagreement on questions 6 and 7. For fields like alignment research, the answers may be \"replacement is 1/10th as good\" and \"there is nothing else to spend on the money on\". But for fields like globally health and poverty, salary trades off directly against work\". So it's not surprising those fields look very different.</p><p>I'm not sure where CEA falls in this spectrum. In a <a href=\"https://forum.effectivealtruism.org/users/cait_lion\">sister comment</a> Cait says that for CEA their number two candidate is often half as impactful as their top choice, and sometimes they choose to forego filling a role entirely if the top choice is unvailable. &nbsp;I'm surprised by that and a little skeptical that it's unfixable, but I also expect they've put a lot of thought into recruitment. If CEA is regularly struggling to fill roles, that certainly explains some of the salary explanation.</p><p>Cait didn't mention this but I believe I read elsewhere that CEA didn't want too big a gap between programmers and non-programmers, and solved this by ~overpaying non-programmers. I don't know how I feel about this. I guess tentatively I think that it was awfully convenient to solve the problem by overpaying people rather than expecting people to become comfortable with a salary gap, and it might have been good to try harder at that, or divide the orgs such that it wasn't so obvious. My understanding is that CEA struggled to find programmers<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefv3m2gpb7v1m\"><sup><a href=\"#fnv3m2gpb7v1m\">[1]</a></sup></span>, so paying less is a nonstarter.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnv3m2gpb7v1m\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefv3m2gpb7v1m\">^</a></strong></sup></span><div class=\"footnote-content\"><p>There was a <a href=\"https://www.lesswrong.com/posts/XWthiR3mg9FpSgd8m/becoming-a-staff-engineer?commentId=wJJehPg4NwyoBSpdp\">long LW thread</a> on this that left me with the impression that CEA's main problem was it was looking for the wrong thing, and the thing it was looking for was extremely expensive. But I imagine that even if they were looking for the cheaper right thing, they couldn't get it with teacher wages.&nbsp;</p></div></li></ol>", "parentCommentId": "WA3uBPHbsZPX5zQgr", "user": {"username": "Elizabeth"}}, {"_id": "kQzb2kkFmJwvesqhs", "postedAt": "2023-11-14T04:36:54.017Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>All of a sudden, running a 10 person organization takes $1M instead of $10M</p></blockquote><p>&nbsp;</p><p>Do you mean these numbers literally? You think people are being paid $1m a year, and all expenses are staff expenses?</p>", "parentCommentId": "wD8ExiHZJ5dNDfBm3", "user": {"username": "Elizabeth"}}, {"_id": "eDK5TjEMB4oNBcLL6", "postedAt": "2023-11-14T05:07:46.644Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>One problem I have with these discussions, including past discussions about why national EA orgs should have fundraising platform, is the reductionist and zero-sum thinking given in response.&nbsp;</p></blockquote><p>Wait, but it might actually have opportunity cost? Like those poeple could be doing something other than trying to get more medium sized donors? There is a cost to trying to push on this versus something else. (If you want to push on it, then great, this doesn't impose any cost on others, but that seems different from a claim that this is among the most promising things to be working on at the margin.)</p><blockquote><p>I identified above, how an argument stating less donors results in more efficiency, would never be made in the for profit world. Similarly, a lot of the things we care about (talent, networks, entrepreneurship) become stronger the more small/medium donors we have. For the same reason that eating 3 meals in a day makes it easier to be productive - despite it taking more time compared to not eating at all - having more of a giving small-donor ecosystem will make it easier to achieve other things we need.&nbsp;</p></blockquote><p>Your argument here is \"getting more donors has benefits beyond just the money\" (I think). &nbsp;But, we can also go for those benefits directly without necessarily getting more donors. Like maybe trying to recruit more medium sized donors is the best way to community build, but this seems like sort of a specific claim which seems a priori unlikely (it could be true ofc) <i>unless</i> having more small donors is itself a substantial fraction of the value and that's why it's better than other options.</p><p>So, recruiting donors is perhaps subsidized by causing the other effects you noted, but if it's subsidized by some huge factor (e.g. more like 10x than 1.5x) than directly pursuing the effects seems like probably a better strategy.</p>", "parentCommentId": "w8LJvKQjQjcfm9zqx", "user": {"username": "Ryan Greenblatt"}}, {"_id": "gwkuhMrsQE4Tnru6X", "postedAt": "2023-11-14T11:37:44.002Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>My claim is that your intuitions are the opposite of what they would be if applied to the for-profit economy. You're response (if I understand correctly) is questioning the veracity of the analogy - which seems not to really get at the heart of the <i>efficient market </i>heuristic. I.e. you haven't claimed that bigger donors are more likely to be efficient, you've just claimed efficiency in charitable markets are generally unlikely?<br><br>Besides this, shorting isn't the only way markets regulate (or deflate) prices. \"Selling\" is the more common pathway. In this context, \"selling\" would be medium donors changing their donation to a more neglected/effective charity. It could be argued, this is more likely to happen under a dynamic donation \"marketplace\", &nbsp;with lot's of medium donors, than in a less dynamic, fewer but bigger donors, donation \"marketplace\"</p>", "parentCommentId": "gyWriEp67R6z5aQji", "user": {"username": "ElliotJDavies"}}, {"_id": "SW9o4kjAFhXBiiFAN", "postedAt": "2023-11-14T11:47:32.944Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>In the US teaching jobs are incredibly stable, and stable things pay less. Unless the UK is very different, I expect that EA jobs would need to pay more just to have people end up with the same financial situation over time, because instability is expensive</p></blockquote><p>I agree that there should be a premium for instability.&nbsp;</p><blockquote><p>I'm not sure where CEA falls in this spectrum. In a <a href=\"https://forum.effectivealtruism.org/users/cait_lion\">sister comment</a> Cait says that for CEA their number two candidate is often half as impactful as their top choice</p></blockquote><p>I agree this is a crux. To the extent you're paying more for better candidates, I am pretty happy.&nbsp;</p><blockquote><p>Cait didn't mention this but I believe I read elsewhere that CEA didn't want too big a gap between programmers and non-programmers, and solved this by ~overpaying non-programmers.</p></blockquote><p>Related to this, I have an intuition that salaries get inflated by EA's being too nice.&nbsp;</p><p>Also related to this point, a concern I have with paying little, or paying competitive salaries in workplaces which have an ideologically driven supply/demand mismatch (i.e. the game industry, or NGOs) often leads to toxic workplaces. If paying a premium avoids these, it could definitely be worth it. Although I am sceptical how much it helps, over other things (like generally creating a nice place to work, making people feel safe, hiring the right people ect.).&nbsp;</p>", "parentCommentId": "L98ybwHyQcmxCYXXa", "user": {"username": "ElliotJDavies"}}, {"_id": "s84r4ZEdHio29HCNB", "postedAt": "2023-11-14T11:55:12.070Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks for clarifying, and I am certainly inclined to defer to you.&nbsp;<br><br>One concern I would have, is to what extent are these subjective estimations born-out by empirical data. Obviously you'd never deliberately hire the second best candidate, so we never really test our accuracy. I suspect this is particular bad with hiring, where the hiring process can be really comprehensive and it's still possible to make a bad hire.&nbsp;</p>", "parentCommentId": "sYdAyFK8rfdjHyDBi", "user": {"username": "ElliotJDavies"}}, {"_id": "4ce4Z6PMdnDAriuRg", "postedAt": "2023-11-14T12:07:40.291Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>Wait, but it might actually have opportunity cost? Like those poeple could be doing something other than trying to get more medium sized donors? There is a cost to trying to push on this versus something else.</p></blockquote><p>Most of the people working on giving platforms, are pretty uniquely passionate about giving. The donation platform team we have, isn't that excited about EA-community building in general. This is a good, concrete example of one way a 0 sum model breaks down.&nbsp;<br>&nbsp;</p><blockquote><p>But, we can also go for those benefits directly without necessarily getting more donors. Like maybe trying to recruit more medium sized donors is the best way to community build, but this seems like sort of a specific claim which seems a priori unlikely (it could be true ofc) <i>unless</i> having more small donors is itself a substantial fraction of the value and that's why it's better than other options.</p></blockquote><p>Just be clear, the mechanism I think at play here is A) Meeting people where they are B) Providing people with Autonomous ways to take action. These mechanisms are good for reaching a subset of people, and getting them engaged.&nbsp;<br><br>I am inlined to lean towards multiple axis of engagement, i.e. let's promote prediction markets (including the gamification model that manifold uses) to reach people and get people engaged. Let's throw intensive career discussions at those that would find that interesting. Likewise, let's not forget about donations as an important part of participating in this community.</p>", "parentCommentId": "eDK5TjEMB4oNBcLL6", "user": {"username": "ElliotJDavies"}}, {"_id": "T5LCTM29oWmkp9Fif", "postedAt": "2023-11-14T12:55:39.824Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>FWIW, my experience (hiring mostly operations roles) is often the opposite - I find for non-senior roles that I usually reach the end of a hiring process, and am making a pretty arbitrary choice between multiple candidates who both seem quite good on the (relatively weak) evidence from the hiring round. But, I also think RP filters a lot less heavily on culture fit / value alignment for ops roles than CEA does, which might be the relevant factor making this difference.</p>", "parentCommentId": "sYdAyFK8rfdjHyDBi", "user": {"username": "abrahamrowe"}}, {"_id": "x3zbwd5M5xjCdAzXB", "postedAt": "2023-11-14T13:25:41.987Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Minor downvoted because this comment seems to take Marcus's comment out of context / misread it:</p><blockquote><p>Catered lunches, generous expense policies, <a href=\"https://www.openphilanthropy.org/research/new-roles-on-our-gcr-team/#2-about-working-at-open-philanthropy\">large benefits packages and ample + flexible + paid time off</a> become a pot luck once a week, basic healthcare coverage and 2 weeks of vacation. All of a sudden, running a 10 person organization takes $1M instead of $10M and it becomes much more feasible to get 30 x $10-30k with a couple of 50-100k donations to cover the cost of the organization.</p></blockquote><p>I don't think the numbers are likely exactly right, but I think the broad point is correct. I think that likely an organization starting with say 70% market rate salaries in the longtermist space could, if it pursued fairly aggressive cost savings, reduce their budget by much more than 30%.&nbsp;</p><p>As an example, I was once quoted on office space in the community that cost around $14k USD / month for a four person office, including lunch every day. For a 10 person organization, that is around $420k/year for office and food. Switching to a $300/person/mo office, and not offering the same perks, which is fairly easily findable, including in large cities (though it won't be Class A office space) would save $384k, which is like, 4 additional staff at $70k/year, if that's our benchmark.</p><p>FWIW, I feel uncertain about frugality of this sort being desirable — but I definitely believe there are major cost savings on the table.</p>", "parentCommentId": "kQzb2kkFmJwvesqhs", "user": {"username": "abrahamrowe"}}, {"_id": "XQtKpJczsRjhvmBgq", "postedAt": "2023-11-14T13:29:56.466Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Yeah, I think there is an open question of whether or not this would cause a decline in the impact of what's funded, and this reason is one of the better cases why it would.</p><p>I think one potential middle-ground solution to this is having like, 5x as many EA Fund type vehicles, with more grant makers representing more perspectives / approaches, etc., and those funds funded by a more diverse donor base, so that you still have high quality vetting of opportunities, but also grantmaking bodies who are responsive to the community, and some level of donor diversity possible for organizations.</p>", "parentCommentId": "XLgnHmMo8HoLeAyBe", "user": {"username": "abrahamrowe"}}, {"_id": "qfLiMHLqGYmb4PtGZ", "postedAt": "2023-11-14T13:37:00.052Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I think that one thing I reflect on is how much money has been spent on EA community building over the last 5 years or so. I'm guessing it is several 10s of millions of dollars. My impression (which might not be totally right) is that little of that went to promoting earning to give. So it seems possible that in a different world, where a much larger fraction was used on E2G outreach, we could have seen a substantial increase. The GWWC numbers are hard to interpret, because I don't think anything like massive, multi-million dollar E2G outreach has been tried, at least as far as I know.</p><p>I think broadly, it would be healthy for any organization of RP's size to not have a single funder giving over 40% of their funding, and ideally less. I assume the realistic version of this that might be possible is something like an $10M org. having $4M from one funder, maybe a couple of $500k-$1M donors, a few more $20k-$500k donors, and a pretty wide base of &lt;$20k donors. So in that world, I'm guessing an organization would want to be generating something like 15%-20% of it's revenue from these mid-size donors? So definitely still a huge lift.</p><p>But, I think one thing worth considering is that while ideally there might be tens of thousands of $20k donors in EA, doing the outreach to get tens of thousands of $20k donors, if successful, will probably also bring in hundreds of &lt;$100k donors, and maybe some handful of &lt;$1M donors. This might not meet the ideal situation I laid out above, but on the margin seems very good.</p>", "parentCommentId": "6PousSLS7wRoid3b4", "user": {"username": "abrahamrowe"}}, {"_id": "fsBcW53YSzrWAbKkZ", "postedAt": "2023-11-14T13:52:41.079Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote>\n<p>Downvoted because this comment seems to take Marcus's comment out of context / misread it ... I don't think the numbers are likely exactly right, but I think the broad point is correct.</p>\n</blockquote>\n<p>I think it depends a lot on whether you think the difference between 10x ($10M vs $1M) and 1.4x (30% savings) is a big deal? (I think it is)</p>\n", "parentCommentId": "x3zbwd5M5xjCdAzXB", "user": {"username": "Jeff_Kaufman"}}, {"_id": "qShHBKZskyWNyCrRm", "postedAt": "2023-11-14T14:00:18.633Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote>\n<p>The GWWC numbers are hard to interpret, because I don't think anything like massive, multi-million dollar E2G outreach has been tried, at least as far as I know.</p>\n</blockquote>\n<p>I’m pretty sure that GWWC, Founders Pledge, Longview and Effective Giving all have operating costs of over $1M per year. It seems like quite a lot of effort has gone into testing the e2g growth hypothesis.</p>\n", "parentCommentId": "qfLiMHLqGYmb4PtGZ", "user": {"username": "calebp"}}, {"_id": "gajLf7pd8zBGcBhvk", "postedAt": "2023-11-14T14:23:03.620Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>That doesn't seem quite right to me - Longview and EG don't strike me as being earning to give outreach, though they definitely bring funds into the community. And Founders Pledge is clearly only targeting very large donors. I guess maybe to be more specific, nothing like massive, multi-million dollar E2G outreach has been tried for mid-sized / every day earning to give, as you're definitely right that effort has gone into bringing in large donors.</p>", "parentCommentId": "qShHBKZskyWNyCrRm", "user": {"username": "abrahamrowe"}}, {"_id": "FJNPA2CLGiwtLcKuq", "postedAt": "2023-11-14T14:29:06.799Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>The main out of context bit is that Elizabeth's comment seemed to interpret Marcus as only referring to salary, when the full comment makes it very clear that it wasn't just about that, which seemed like a strong misreading to me, even if the 10x factor was incorrect.</p><p>I suspect the actual \"theoretically maximally frugal core EA organization with the same number of staff\" is something like 2x-3x cheaper than current costs, if salaries moved to the $50k-$70k range.</p>", "parentCommentId": "fsBcW53YSzrWAbKkZ", "user": {"username": "abrahamrowe"}}, {"_id": "ifFXeRrqpehusWrdA", "postedAt": "2023-11-14T14:53:02.792Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>To add to what Caitlin said, my experience as a hiring manager and as a candidate is that this often is not the case.<br><br>When I was hired at CEA I took roles on two different teams (Head of US Operations at CEA and the Events Team role at EAO, which later merged into CEA). My understanding at the time is that they didn’t have second choice candidates with my qualifications, and I was told by the EAO hiring manager that they would have not filled the position if I didn’t accept (I don’t remember whether I checked this with the CEA role).<br><br>I should note that I was applying for these roles in 2015 and that the hiring pool has changed since then. But in my experience as a hiring manager (especially for senior/generalist positions), it can be really hard to find a candidate that fits the specific requirements. Part of this is that my team requires a fairly specific skillset (that includes EA context, execution ability, and fit with our high energy culture) but I wouldn’t be surprised if other hiring managers have similar experiences. I think as the team grows and more junior positions become available this might be more flexible, though I think “indistinguishable” is still not accurate.</p>", "parentCommentId": "WA3uBPHbsZPX5zQgr", "user": {"username": "AmyLabenz"}}, {"_id": "iDHZLcsLXs6i2EJLe", "postedAt": "2023-11-14T15:48:40.959Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote>\n<p>Elizabeth's comment seemed to interpret Marcus as only referring to salary</p>\n</blockquote>\n<p>I see Elizabeth as saying \"all expenses are staff expenses\", which is broader than salary and includes things like office and food?</p>\n<p>I think why Elizabeth was pointing out that the calculation implies only staff costs contribute to the overall budget because if you have expenses for things other than staff (ex: in my current org we spend money on lab reagents and genetic sequencing, which don't go down if we decide to compensate more frugally) then your overall costs will drop less than your staff costs.</p>\n", "parentCommentId": "FJNPA2CLGiwtLcKuq", "user": {"username": "Jeff_Kaufman"}}, {"_id": "pbKGJtEGgJXuQEZAn", "postedAt": "2023-11-14T17:01:19.880Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>To clarify, I don't think salaries are anywhere near $1M. I do think there are a lot of people at EA organizations who make $150-200k per year or so. When you add benefits, lunches, office space, expense policies, PTO, full Healthcare packages/benefits, staff retreats, events, unnecessary software packages, taxes etc. a typical organization might be spending 1/3rd of their budget on salaries so something like $5-6M, not $10M. I wasn't being exact with numbers and I should have been.</p>\n<p>I think many EA organizations could reduce their budgets by ~50%, drastically turn up the frugality and creativity and remain approximately as effective.</p>\n<p>I'm not sure the effects this would have. I suspect less \"exodus from EA\" than people think.</p>\n<p>I'm also just speaking to what happened as to why we don't have a robust earning to give ecosystem. It's much different having 50 people fund a 100-500k org than a 5M org.</p>\n", "parentCommentId": "kQzb2kkFmJwvesqhs", "user": {"username": "MarcusAbramovitch"}}, {"_id": "hGdQTAAg4guognPAt", "postedAt": "2023-11-14T17:04:34.308Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I definitely had roles I've hired for this year where the top candidate was <em>significantly</em> better than the second place candidate by a large margin</p>\n", "parentCommentId": "ifFXeRrqpehusWrdA", "user": {"username": "Peter_Hurford"}}, {"_id": "houcAuLcEJEbTBJy4", "postedAt": "2023-11-14T19:14:28.618Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I'm not just talking about salaries when I talk about the costs of orgs (as i said, my original comment is a diagnosis, not a prescription). To use the example of lab reagents and genetic sequencing, I've worked in several chemistry labs and they operate very differently depending on how much money is available. When money is abundant (and frugality is not a concern), things like buying expensive laptops/computers (vs. thinking about what is actually necessary) to run equipment, buying more expensive chemicals, re-use of certain equipment (vs. discarding on single use), celebrations of accomplishments, etc. all are different.</p><p>The way I see it, from 2016 to 2022, EA (and maybe specifically longtermism) got a bunch of billionaire money that grew the movements \"money\" resource faster than the other resource like talent and time etc. and so money could be used more liberally, especially when trading it off vs. time, talent, ingenuity, creativity, etc.</p>", "parentCommentId": "iDHZLcsLXs6i2EJLe", "user": {"username": "MarcusAbramovitch"}}, {"_id": "KhkRD4RmuiYzeayiH", "postedAt": "2023-11-14T19:41:36.154Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>I guess I don’t really know what you have in mind. I’m particularly confused as to what definition of outreach you’re using if it excludes Longview.</p>\n<p>Gwwc almost certainly has an annual budget of over $1m per year and is also pretty clearly investing in e2g.</p>\n<p>I don’t think there’s much e2g as a career stuff since 80k pivoted away from that message - but that’s obviously much narrower than e2g outreach.</p>\n", "parentCommentId": "gajLf7pd8zBGcBhvk", "user": {"username": "calebp"}}, {"_id": "PnfPc64stbSW3QghM", "postedAt": "2023-11-14T20:11:18.728Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Happy to answer these</p><ol><li>Not a specific salary, there should definitely be ranges. I guess I would say the average EA salary should be ~60-80k/year right now. I think this is less than many could make in the private sector but not necessarily all. I acknowledge this is a sacrifice or reduction.</li><li>I think a reasonable condo/apartment. I think they would cook most of their own meals, could have kids, still save like 10% of income. I don't think it's necessary to live in London, NY, SF.</li><li>Able to live a ~middle class life. Not sure what peak productivity but miserable means.</li><li>Virtually all. This is above the median income in the richest country in the world.</li><li>I think a small ~5% or so may do work outside of EA on the side. I'm also not opposed to higher salaries than this. I don't know what you mean I would expect to happen to them.</li><li>Usually I expect this to be not a lot of a drop. Maybe an average of 10%. Sometimes i realize this will be more.</li><li>Well, depends. I think a baseline reasonable counterfactual is Givewell Top Charities Fund.<br><br>I suppose 6 and 7 are for an individual hire and not for EA as a whole.</li></ol>", "parentCommentId": "bi2rdbnWjfHv8qaWB", "user": {"username": "MarcusAbramovitch"}}, {"_id": "ryBeLys5uivyt97iF", "postedAt": "2023-11-14T21:21:34.259Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Ah, gotcha. If I understand correctly you're arguing for more of a \"wisdom of the crowds\" analogy? Many donors is better than a few donors.</p>\n<p>If so, I agree with that, but think the major disanalogy is that the big donors are professionals, with more time experience and context, while small donors are not - big donors are more like hedge funds, small donors are more like retail investors in the efficient market analogy</p>\n", "parentCommentId": "gwkuhMrsQE4Tnru6X", "user": {"username": "Neel Nanda"}}, {"_id": "fX8AwAj9YPxNcuuyF", "postedAt": "2023-11-14T21:22:33.205Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Yeah, that intermediate world sounds great to me! (though a lot of effort, alas)</p>\n", "parentCommentId": "XQtKpJczsRjhvmBgq", "user": {"username": "Neel Nanda"}}, {"_id": "ZEZJcACKBng3LfHpi", "postedAt": "2023-11-14T22:16:34.893Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Can you elaborate on this? What's your data source?</p>", "parentCommentId": "foPCczM8CWeg8whJw", "user": {"username": "Elizabeth"}}, {"_id": "wpxQGv5ZoEoMdjpL9", "postedAt": "2023-11-14T22:23:22.253Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>How senior was this position? or, can you say more about how this varies across different roles and experience levels?</p><p>Based on some other responses to this question I think replaceability may be a major crux, so the more details the better.</p>", "parentCommentId": "hGdQTAAg4guognPAt", "user": {"username": "Elizabeth"}}, {"_id": "csyZjqBwZT87YbCXa", "postedAt": "2023-11-15T00:33:38.337Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>No data source, just personal experience.</p>\n<p>Maybe a more common outcome is eventually you find Bob but it’s 18 months later and you had to do without Alice for that time.</p>\n", "parentCommentId": "ZEZJcACKBng3LfHpi", "user": {"username": "Ian Turner"}}, {"_id": "z8sqnt4MghatcPTrq", "postedAt": "2023-11-15T02:06:24.428Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Longview is interested in courting those who are already interested in donating at least seven figures annually. Their primary goal is to provide guidance to those who are already committed to donating on how they can use that money to do the most good.</p><p>An ETG outreach organization would be looking to get people to A. donate a significant portion of their money that they are not already giving to effective charities and/or B. start making career decisions that enable them to make more money so that they can ETG.&nbsp;</p>", "parentCommentId": "KhkRD4RmuiYzeayiH", "user": {"username": "Brad West"}}, {"_id": "wHpxmirMFax3WoeJ3", "postedAt": "2023-11-15T03:03:10.116Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>So there are organisations spending more than $1m per year who have encouraged people to donate a significant fraction of their income (for example founders pledge, GWWC and OFTW though I’m not sure of OFTWs budget).</p>\n<p>80k hours have also looked into which careers pay the best (e.g. writing about quant trading and being an early startup employee) - I think they have a budget of around $5m/year. So it sounds like the ETG outreach organisation would need to do both of these things and focus on e2g rather than other things. “How do I optimise my career make money” is a pretty common question and I think you should be somewhat sceptical of EAs ability to beat non-EA resources.</p>\n<p>It’s worth noting that there aren’t any multimillion dollar organisations that I’m aware of that do the equivalent thing (outreach + career advice) for solely AI safety, biosecurity or global health.</p>\n", "parentCommentId": "z8sqnt4MghatcPTrq", "user": {"username": "calebp"}}, {"_id": "FHBrBkcbb4AoYCHQA", "postedAt": "2023-11-15T10:01:51.494Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks, this makes sense. I also have the impression that E2G was deprioritised. In some cases, I've seen it actively spoken against (in the vein of \"I guess that could be good, but it is almost no one's most impactful option\"), mostly as pushback to the media impression that EA=E2G. I also see the point that more diversified funding seems good on the margin- to give organisations more autonomy and security.&nbsp;</p><p><br>One thing that isn't mentioned in this piece is the risks that come from relying on a broader base of donors. If the EA community would need to be much, much larger in order to support the current organisations with more diversified funding, how would this change the way the organisations acted? In order to keep a wider range of funders happy, would there be pressures to appeal to a common denominator? Would it in fact become harder to service and maintain relations with a wider range of donors? I presume that the ideal is closer to the portfolio you sketch for an organisation like RP in this comment.&nbsp;</p>", "parentCommentId": "qfLiMHLqGYmb4PtGZ", "user": {"username": "tobytrem"}}, {"_id": "mrmwELvwAugPhQ5DL", "postedAt": "2023-11-16T00:07:51.536Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>rephrase: where is your personal experience from?</p><p>I'm not asking for survey data and suspect EA is too weird to make normal surveys applicable. So personal anecdotes or at best the experiencing of people involved in lots of hiring is the most we can hope for.&nbsp;</p>", "parentCommentId": "csyZjqBwZT87YbCXa", "user": {"username": "Elizabeth"}}, {"_id": "bvxtregTMRkkaiqGN", "postedAt": "2023-11-16T19:46:11.628Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote>\n<p>I also think orgs generally should have donor diversity and more independence, so giving more funding to the orgs that OP funds is sometimes good.</p>\n</blockquote>\n<p>I'd be curious to hear more about this - naively, if I'm funding an org, and then OpenPhil <em>stops</em> funding that org, that's a fairly strong signal to me that I should also stop funding it, knowing nothing more. (since it implies OpenPhil put in enough effort to evaluate the org, <em>and</em> decided to deviate from the path of least resistance)</p>\n<p>Agreed re funding things without a track record, that seems clearly good for small donors to do, eg funding people to do independent research or start a small new research group, if you believe they're promising</p>\n", "parentCommentId": "MXwoHc9JFd7jjWwn4", "user": {"username": "Neel Nanda"}}, {"_id": "hBryd5gg7BQr4HrfD", "postedAt": "2023-11-16T20:09:03.349Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Sorry Elizabeth, I hope you’ll understand if I don’t want to share more about this in a public forum. Happy to speak privately if you like.</p>\n", "parentCommentId": "mrmwELvwAugPhQ5DL", "user": {"username": "Ian Turner"}}, {"_id": "tYrsbFD9xcGvAKxky", "postedAt": "2023-11-17T02:10:44.736Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><ol><li>The average EA today is far less \"committed\" to EA than in 2016. By committed, I mean making personal sacrifices for altruism. Here is a website I found for <a href=\"https://www.jefftk.com/donations#footnote1\">Jeff Kauffman and Julia Wise</a> where you can see them giving 50% of their income since ~2012. If I'm not mistaken, they've had a family for most of that time. This behavior is significantly less common nowadays, particularly as a proportion of people in the movement where I suspect a good fraction of people in the community donate relatively little, let alone 50% of their income.<br>&nbsp;</li></ol></blockquote><p>&nbsp;</p><p>Given how much the community has grown, isn't this just what you'd expect? There are way more people than there were in 2016, which pushes down how weird the community is on average due to regression to the mean. The obvious solution is that EA should just be smaller and more selected for altruism (which I think would be an error).<br>&nbsp;</p><blockquote><ol><li>Salaries at EA organizations have grown a lot. People used to take massive pay cuts to do EA non-profit work. Hopefully people from the early days can fill in some numbers here but there is a <a href=\"https://forum.effectivealtruism.org/posts/cfdnJ3sDbCSkShiSZ/ea-and-the-current-funding-situation\">picture</a> here of an office in the basement of an estate agent, salaries being 15k/year pre-tax and lunch being the same every day. In the OP, Abraham talks about a $500 donation allowing him to hire a contractor and being able to hire staff after ~75k of donations. Apart from a select few CE incubated charities, 75k doesn't even cover a single person's salary for a year at most EA orgs. Most salaries I see today for EA positions are 100k+, particularly at longtermist organizations.</li></ol></blockquote><p>I think the simplest explanation for this is that there are just more roles with well-paying counterfactuals e.g. ml engineering. Excluding those roles, after you adjust for the cost of living, most EA roles aren't particularly well paid e.g. Open Phil salaries aren't much higher <a href=\"https://smartasset.com/retirement/average-salary-in-san-francisco\">than the median in SF</a> &nbsp;and maybe less than the BART <a href=\"https://www.reddit.com/r/bayarea/comments/16dqm0m/bart_ad_displaying_salary_range_for_police/\">(Bay Area metro) police</a>.</p>", "parentCommentId": "wD8ExiHZJ5dNDfBm3", "user": {"username": "calebp"}}, {"_id": "WvZkJBi4rN5n7hSts", "postedAt": "2023-11-17T08:24:02.803Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Thanks for pointing that out, Neel. It is also worth having in mind that GWWC's donations <a href=\"https://forum.effectivealtruism.org/posts/EipE75vsDuD7bdJar/gwwc-s-2020-2022-impact-evaluation-executive-summary\">are</a> concentraded in a few dozens of donours:</p><blockquote><p>Less than 1% of our [GWW] donors account for 50% of our recorded donations.</p></blockquote><p>Given the donations per donor are so heavy-tailed, it is very hard to avoid organisations being mostly supported by a few big donors. In addition, GWWC <a href=\"https://www.givingwhatwecan.org/en-GB/best-charities-to-donate-to-2023?slug=best-charities-to-donate-to-2023\">recommends</a> donating to funds for most people:</p><blockquote><p>For most people, we recommend donating through an expert-led fund that is focused on effectiveness.</p></blockquote><p>I agree with this. Personally, I <a href=\"https://forum.effectivealtruism.org/users/vascoamaralgrilo\">have</a> engaged a significant time with EA-related matters, but continue to donate to the Long-Term Future Fund (<a href=\"https://funds.effectivealtruism.org/funds/far-future\">LTFF</a>) because I do not have a good grasp about which opportunities are best within AI safety, even though I have opinions about which cause areas are more pressing (I also rate animal welfare quite highly).</p><p>I am more positive about people working on cause area A to decide on which interventions are most effective within A (e.g. you donating to AI safety interventions). However, people earning to give may well not be familiar with any cause area, and it is unclear whether the opportunity cost to get quite familiar would be worth it, so I think it makes sense to defer.</p><p>On the other hand, I believe it is important for donors to push funds to be more transparent about their evaluation process. One way to do this is donating to more transparent funds, but another is donating directly to organisations.</p>", "parentCommentId": "XLgnHmMo8HoLeAyBe", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ajKDdjow6Y8XtAtBT", "postedAt": "2023-11-17T22:56:30.340Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<p>Not Peter, but looking at the last ~20 roles I've hired for, I'd guess that during hiring, maybe 15 or so had an alternative candidate who seemed worth hiring (though perhaps did worse in some scoring system). These were all operations roles within an EA organization. For 2 more senior roles I hired for during that time, there appeared to be suitable alternatives. For other less senior roles there weren't (though I think the opposite generally tends to be more true).<br><br>I do thing one consideration here is we are talking about who looked best during hiring. That's different than who would be a better employee - we're assuming our hiring process does a good job of assessing people's fit / job performance, etc., and we know that the best predictors during hiring are only <a href=\"https://infogram.com/1p9zelp0zeg5pyi72nknnymj2xsd27wzv9\">moderately correlated</a> with later job performance, so it's plausible that often we think there is a big gap between two candidates, but they'd actually perform equally well (or that someone who seems like the best candidate isn't). Hiring is just a highly uncertain business, and predicting long-term job performance from like, 10 hours of sample work and interviews is pretty hard — I'm somewhat skeptical that looking at hiring data is even the right approach, because you'd also want to control for things like if those employees always meet performance expectations in the future, etc, and you never actually get counterfactual data on how good the person you didn't hire was. I'm certain that many EA organizations have hired someone who appeared to be better than the alternative by a wide margin, and easily cleared a hiring bar, but who later turned out to have major performance issues, even if the organization was doing a really good job evaluating people.</p>", "parentCommentId": "wpxQGv5ZoEoMdjpL9", "user": {"username": "abrahamrowe"}}, {"_id": "X9yEdCAZWXJKL9BgF", "postedAt": "2023-11-18T17:45:33.816Z", "postId": "AyLF2KQ8AqQuiuDLz", "htmlBody": "<blockquote><p>Given how much the community has grown, isn't this just what you'd expect? There are way more people than there were in 2016, which pushes down how weird the community is on average due to regression to the mean. The obvious solution is that EA should just be smaller and more selected for altruism (which I think would be an error).</p></blockquote><p>Sure, I'm not suggesting we become smaller but I don't think it's completely either or. A bit more altruistic pressure/examples seems good.</p><blockquote><p>I think the simplest explanation for this is that there are just more roles with well-paying counterfactuals e.g. ml engineering. Excluding those roles, after you adjust for the cost of living, most EA roles aren't particularly well paid e.g. Open Phil salaries aren't much higher <a href=\"https://smartasset.com/retirement/average-salary-in-san-francisco\">than the median in SF</a> &nbsp;and maybe less than the BART <a href=\"https://www.reddit.com/r/bayarea/comments/16dqm0m/bart_ad_displaying_salary_range_for_police/\">(Bay Area metro) police</a>.</p></blockquote><p>SF is among the most expensive cities in the world. Above median salary in the most expensive parts of the world seems quite high for non-profits. I think the actual simplest explanation is that EA got billions of dollars (a lot of which is now gone) and that had upward pressure on salaries.</p><p>Again, my comment mainly answered the question of why we don't have a robust earning to give ecosystem in EA. Not nearly enough people &nbsp;make enough money to give the type of sums that EA organizations spend.</p>", "parentCommentId": "tYrsbFD9xcGvAKxky", "user": {"username": "MarcusAbramovitch"}}]