[{"_id": "jvHQdmLwQDug6QCKb", "postedAt": "2023-02-20T21:30:12.620Z", "postId": "AyXPe55d8gMA8Djux", "htmlBody": "<p>Thanks for writing this; I am definitely interested in perspectives on what influence (if anything) people feel the ideals of the EA movement should have on one's personal family/community life.<br><br>The modern American culture that I grew up in is at a low ebb in terms of filial piety, which is /mostly/ fine by me (more individual freedom for people to do whatever!) but which I worry might be sabotaging not only people's connection to the past, but also to their children and to the future in general. &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/WF5GDjLQgLMjaXW6B/the-narrowing-circle-gwern\">Per a comment of mine on Gwern's post \"The Narrowing [Moral] Circle\"</a>:</p><blockquote><p>As I see it, the strongest part of the argument for a \"narrowing circle\" is the \"Ancestors\" and \"Descendants\" sections. &nbsp;It seems plausible to me that <a href=\"http://www.overcomingbias.com/2010/10/two-types-of-people.html\">preindustrial \"farmer\" culture</a> placed nigh-obsessive emphasis on pleasing the wishes of your ancestors and securing a promising future for your descendants. &nbsp;(I suspect this is probably because, in a world where income came from farming the land rather than hunting/gathering or performing skilled industrial-age work for wages, inheritance of farmland from one generation to the next becomes crucially important.) &nbsp;Much of the modern world seems to have essentially abandoned the idea that we should place much weight on the values of our ancestors, which should be concerning to longtermists since valuing the lives of ancestors seems very close to valuing the lives of unborn generations (see for instance <a href=\"https://classicalu.com/courses/teaching-the-great-books/lessons/lesson-6-how-to-teach-great-books-part-ii/topic/the-democracy-of-the-dead/\">Chesterton's quote about how \"tradition is the democracy of the dead\"</a>).<br><br>The idea that concern for descendants has also decreased is certainly a worry worth investigating -- perhaps a logical place to start would be by investigating &nbsp;how much the recent worldwide decline in fertility rates really reflects a decreased desire for children. &nbsp;A drop in respect for ancestors might also directly cause a drop in concern for descendants -- it might be logical to disregard the lives of future generations if we assume that they (just like us) will ignore the wishes of their ancestors!</p></blockquote>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "ki3mfXrbBtMRpkN7u", "postedAt": "2023-02-21T08:08:33.405Z", "postId": "AyXPe55d8gMA8Djux", "htmlBody": "<p>I'm glad to see this being talked about; I'm glad to see non-western cultures exploring what they can make of EA.</p><p>For me, Filial Piety is the other 'F word' - I have seen it used to normalize a level of abusiveness towards children that, even in the context of typing a post from the comfort of my home, is making me furious.</p><p>And yet, I recognise it seems to be part of the recipe that empowers collectivism in Asian cultures, that has protected them from the Randian individualist race to the bottom that Western cultures are engaged in.</p><p>No good answers, no conclusion, no clear message; reality is messy, don't romanticise ideals.</p>", "parentCommentId": null, "user": {"username": "Stavros"}}]