[{"_id": "ji9pJMiG8Kr6PnwKe", "postedAt": "2023-08-18T18:07:02.046Z", "postId": "azezpsWKkcPJd2Hfy", "htmlBody": "<p>Edit: <strong>I now believe knowledge of fungal pathogens to be an information hazard</strong> and <i>do not</i> endorse publicising it outside of relevant communities.&nbsp;</p><p>I strongly agree to the fact that we should take fungal pathogens seriously and that awareness of potentially existential risk from fungal pathogens is scarce.&nbsp;</p><p>The facts laid out in this post are quite shocking and I expect that many people would take fungal pathogens seriously after being presented with them. Thus I believe it might be useful to start raising awareness outside of EA circles as well in order to <strong>attract more biosecurity researchers.</strong></p><p>One way of attempting this would be to reach out to major youtube channels who cover this kind of content such as <a href=\"https://www.youtube.com/user/Kurzgesagt\">Kurzgesagt</a> and see whether they would be willing to release videos on fungal pathogens.</p>", "parentCommentId": null, "user": {"username": "Elias Malisi"}}, {"_id": "v8kS3GrCANquWzHLj", "postedAt": "2023-08-18T19:03:41.543Z", "postId": "azezpsWKkcPJd2Hfy", "htmlBody": "<p>Thanks for your comment. I agree with you fungi infection are very shocking. We breathe these pathogenic fungi everyday in the air. Azole resistant Aspergillosis is becoming a global issue in the US and around the globe. This is an important cause area.</p>\n<p>My graduate students are working on looking for any jump.</p>\n", "parentCommentId": "ji9pJMiG8Kr6PnwKe", "user": {"username": "emmannaemeka"}}, {"_id": "dke5oHDHReqtybj6b", "postedAt": "2023-08-22T22:40:21.084Z", "postId": "azezpsWKkcPJd2Hfy", "htmlBody": "<p>Do we want popular YouTubers to be spreading awareness of this given it also increases some of the risk of bad actors getting ideas?</p>\n<p>Related: <a href=\"https://forum.effectivealtruism.org/posts/3a6QWDhxYTz5dEMag/how-can-we-improve-infohazard-governance-in-ea-biosecurity\">https://forum.effectivealtruism.org/posts/3a6QWDhxYTz5dEMag/how-can-we-improve-infohazard-governance-in-ea-biosecurity</a></p>\n", "parentCommentId": "ji9pJMiG8Kr6PnwKe", "user": {"username": "DonyChristie"}}, {"_id": "ccnXuKGrznL3kHzvW", "postedAt": "2023-08-23T13:34:28.685Z", "postId": "azezpsWKkcPJd2Hfy", "htmlBody": "<p>I agree with you on this. It is true we need awareness of the importance of this, however such sensitive topic should be carefully communicated because of bad actors that might exploit this for negative use. <a href=\"https://forum.effectivealtruism.org/users/dc?mention=user\">@DC</a> What do you think is the line between science communication and feeding bad actors with useful information?</p>", "parentCommentId": "dke5oHDHReqtybj6b", "user": {"username": "emmannaemeka"}}]