[{"_id": "vi7TY7xCHrXHwAi9o", "postedAt": "2018-04-02T11:23:19.295Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>This is very interesting thanks!</p>\n<p>These projections of cost-effectiveness seem promising. I have a nagging related worry about what these campaigns have achieved so far, both in order to estimate a lower bound of their effectiveness, but which might also be relevant for future effectiveness. This worry resulted from the hypothesis that there is a displacement effect so that consumers and companies who buy cage free, will lower the price of caged eggs and thus increase demand from other consumers and retailers (in the US and potentially abroad).</p>\n<p>Looking very briefly at the data it seems that the number of US cage free hens seem to have gone up in absolute terms by 25.8 million between Jan 2016-Oct 2017. However, it seems that total layer hens in the very similar time period from Dec '15 to Dec '17 have gone up by 37 million ( <a href=\"https://docs.google.com/spreadsheets/d/198tJqdycA3X5qxUcJwvV2hy8jI5pnmSCoFPicaG3AZ0/edit?usp=sharing\">spreadsheet with sources</a> ). \nIn other words, the absolute number of caged hens seems to be increasing and corporate campaigns might have not had any effect at all so far. This seems to be <a href=\"https://www.foodnavigator-usa.com/Article/2017/10/30/A-huge-sense-of-uncertainty-has-soured-the-cage-free-egg-market-says-Urner-Barry\">in line with industry news</a>. </p>\n<p>This is also worrying especially if processed eggs from caged eggs might be exported to other countries in the future if the prices for eggs are further pushed down, or if processed eggs from caged hens are imported into the US.</p>\n<p>But I'm not an export on this topic, so I would really like to hear someone to tell me what's wrong with this argument.</p>\n", "parentCommentId": null, "user": {"username": "HaukeHillebrandt"}}, {"_id": "CRZpeEZgMoMTWJs8b", "postedAt": "2018-04-02T17:52:44.666Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>Wouldn't you need to look at the price elasticity of egg consumption rather than absolute trends to conclude whether / to which degree the reduced demand by some is moderated by replacement effects?</p>\n<p>It also seems that, at least in the medium term, lower prices cannot necessarily support the same scale of egg production so the market would, hopefully, shrink, no?</p>\n", "parentCommentId": "vi7TY7xCHrXHwAi9o", "user": {"username": "jackva"}}, {"_id": "yF6qi9SrnkLudKAkS", "postedAt": "2018-04-02T19:04:40.579Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>A useful exploration, thank you. I hadn't really thought of the cost effectiveness estimates not taking account for previous efforts, so this is useful. It reinforces the importance of really thinking carefully about how different organisations interrelate before we make judgements about comparative effectiveness - and especially before we make important decisions (either as a movement, or as individuals, developing career paths etc) in the light of these judgements. This is something I've been thinking a lot about since reading Harish Sethu's post for The Humane League Labs on a similar topic. [1]</p>\n<p>In line with Hauke Hillebrandt's comment about nagging related worries about the campaigns, I feel it's worth re-emphasising the real uncertainty about the long-term implications of these campaigns, summarised by Sentience Institute [2] (and expressed by many upset abolitionists, whenever welfare campaigns or organisations are mentioned): will they lengthen the existence of factory farming by encouragin humanewashing? </p>\n<p>Combined with information suggesting that &quot;cage free&quot; isn't actually much of a real welfare improvement [3], it makes me sceptical of the overall value of welfare interventions. And now Hauke Hillebrandt's comment has made me even more sceptical!</p>\n<p>All these things combined might make considerations of cost efficiency of the intervention type fairly irrelevant - potentially these are even consideartions of the efficiency of increasing total animal suffering?</p>\n<p>I'm possibly being overly negative here - but when THL is the only charity that ACE has recommended in all review periods, and has previously recommended MFA (who run similar programmes), it seems pretty fundamental to EAA.</p>\n<p>[1] <a href=\"http://www.humaneleaguelabs.org/blog/2018-01-30-how-ranking-of-advocacy-strategies-can-mislead/\">http://www.humaneleaguelabs.org/blog/2018-01-30-how-ranking-of-advocacy-strategies-can-mislead/</a></p>\n<p>[2] <a href=\"https://www.sentienceinstitute.org/foundational-questions-summaries#momentum-vs.-complacency-from-welfare-reforms\">https://www.sentienceinstitute.org/foundational-questions-summaries#momentum-vs.-complacency-from-welfare-reforms</a></p>\n<p>[3] <a href=\"https://www.openphilanthropy.org/blog/new-report-welfare-differences-between-cage-and-cage-free-housing\">https://www.openphilanthropy.org/blog/new-report-welfare-differences-between-cage-and-cage-free-housing</a></p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "zw74Ld6j9G5oogPDC", "postedAt": "2018-04-03T04:32:26.153Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>Jamie,</p>\n<p>I worry that people might misunderstand the views of Sentience Institute from your comment. The Sentience Institute report summarizes arguments for both positive (momentum) and negative (complacency) long-term effects of welfare reforms. But Jacy and Kelly, who run Sentience Institute, are in favor of welfare reforms, although they do believe anti-speciesism has more positive expected value in the long term. [1]  And Sentience Institute's survey [2] of EAA researchers similarly indicates strong support for momentum rather than complacency in the long-term.</p>\n<p>More broadly, the sign of the long-term effects of all EA interventions are uncertain, and this is not a problem specific to welfare reforms. (Even the sign of the short-term effects of most animal interventions are uncertain.)</p>\n<p>I also don't think the statement that &quot;'cage-free' isn't actually much of a real welfare improvement&quot; is a fair summary of the Open Philanthropy's report. The blog post says, for instance: &quot;We continue to believe our grants to accelerate the adoption of cage-free systems were net-beneficial for layer hens ... In addition, it seems clear to us that cage-free systems have much higher welfare potential than battery cage systems – that is, the theoretical highest-welfare hen housing system would not contain cages.&quot;</p>\n<p>That being said, I think it is fair to say that ACE regards cage-free as a small improvement, since their 2017 cost-effectiveness model assumes that moving one hen to a cage-free facility reduces only 5% as much suffering as preventing the hen from existence. But it's also notable that ACE's cost-effectiveness models still place corporate campaigns and engagement for welfare reforms as the most cost-effective of the interventions in their estimates, even though they adjust for this pessimism.</p>\n<p>(Of course the effects could go negative as you suggest, i.e. if they change their mind and decide cage-free increases 5% as much suffering. But again, this problem is not unique to welfare reforms, as evidenced by the observation that ACE's estimates of most interventions have confidence intervals that span the negatives.)</p>\n<p>For what it's worth, my own view is that ACE's cost-effectiveness estimates are far too pessimistic about the benefits of cage-free vs battery cages. (Though I also think they're too optimistic about some other assumptions.)</p>\n<p>Avi</p>\n<p>[1] This is from memory and hopefully I've characterized their positions accurately.</p>\n<p>[2] <a href=\"https://www.sentienceinstitute.org/blog/eaa-researcher-survey-june-2017\">https://www.sentienceinstitute.org/blog/eaa-researcher-survey-june-2017</a></p>\n", "parentCommentId": "yF6qi9SrnkLudKAkS", "user": {"username": "AviN"}}, {"_id": "Wcqz2SQHbM3qBvz2P", "postedAt": "2018-04-03T09:31:14.430Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>Yes, absolutely, but the elasticity is somewhat hard to calculate (somewhat should try this though!).\nMy example from above is just making a conservative assumption that the replacement effect is extreme. Of course it could be that there would have been a 37 million hen increase independent of corporate campaigns and that corporate campaigns have moved 25.8 million of those hens out of cages.</p>\n", "parentCommentId": "CRZpeEZgMoMTWJs8b", "user": {"username": "HaukeHillebrandt"}}, {"_id": "c79gW2zsTsffCqpWZ", "postedAt": "2018-04-03T13:29:51.266Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>Hauke,</p>\n<p>The layer hen <a href=\"https://snag.gy/p6M0wv.jpg\">flock size</a> in December 2015 was unusually low because of an <a href=\"https://www.ers.usda.gov/webdocs/publications/86282/ldpm-282-02.pdf?v=43089\">avian flu outbreak</a>, so I don't think changes between December 2015 and December 2017 tell us much about the transition to cage-free.</p>\n<p>It's also not clear why we should expect a transition to cage-free to increase the total number of layer hens based on price effects. If a buyer buys one less conventional egg, the expected supply of conventional eggs should fall by less than one because of price effects. On page 223 of <a href=\"https://smile.amazon.com/Compassion-Pound-Economics-Animal-Welfare/dp/0199551162/\">Compassion by the Pound</a>  (2011), Norwood and Lusk estimate a decline of 0.91 eggs. But correspondingly, if a buyer buys one more cage-free egg, the increase in supply should increase by less than one, let's say 0.91 as well. I think it's a mistake to only consider price effects for the fall demand for conventional eggs for but not for the increase in demand for cage-free eggs. Of course it's fair to be on the lookout for evidence that one effect is stronger than the other, but the increase in egg supply from 2015 to 2017 is far better explained by a recovery from an avian influenza outbreak so I don't think it provides any meaningful evidence on this issue.</p>\n<p>And if we consider price effects overall, the fact that cage-free egg production is somewhat more expensive than conventional egg production should cause a small decline in overall demand for eggs.</p>\n<p>I think there is a risk that food corporations will renege on their pledges, perhaps arguing that the cage-free egg supply is insufficient. The parameter &quot;Probability that groups will follow through on the pledges that they made&quot; in ACE's estimates appear intended to capture this risk, and this is assigned a probability of 0.75 for THL in 2017. I think this risk underscores the importance of the work the animal organizations plan on follow-up with food corporations to ensure they follow through on their pledges, and that they start the transition early. I think this need for follow-up represents another limitation of ACE's cost-effectiveness estimates, since they assign all the benefits to the year of the pledges even though follow-up work will be required in future years.</p>\n<p>Avi</p>\n", "parentCommentId": "vi7TY7xCHrXHwAi9o", "user": {"username": "AviN"}}, {"_id": "yDEgwqDWHWakaxnRm", "postedAt": "2018-04-03T15:20:59.412Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>I mentioned this in a previous comment, but in case readers missed it:</p>\n<ul>\n<li><p>The increase in <a href=\"https://snag.gy/p6M0wv.jpg\">flock size</a> from December 2015 to December 2017 is far better explained by the US egg industry's recovery from an avian influenza outbreak than by cage-free pledges.</p>\n</li>\n<li><p><a href=\"https://smile.amazon.com/Compassion-Pound-Economics-Animal-Welfare/dp/0199551162/\">Norwood and Lusk</a> (2011) estimate based on price elasticity data that, on the margin, a reduction in demand for 1 conventional egg causes a reduction in supply of 0.91 conventional eggs. But correspondingly, an increase in demand for 1 cage-free egg should lead to an increase in supply of less than 1 cage-free egg. So it's unclear why we should expect the transition to cage-free to increase the number of layer hens. If anything, the increase in prices caused by the transition should reduce the number of layer hens.</p>\n</li>\n</ul>\n", "parentCommentId": "Wcqz2SQHbM3qBvz2P", "user": {"username": "AviN"}}, {"_id": "ri6Zk4XzjRK55ZTQc", "postedAt": "2018-04-05T18:40:25.446Z", "postId": "aZFzgsipkAqd95CBd", "htmlBody": "<p>Thanks for this. The true cost-effectiveness estimate should still be reduced by whatever the displacement effect is, even if it isn't large. If we expect 9% of a conventional egg to be consumed for switching demand to 1 cage-free egg, then we should adjust the impact of the campaign downward by whatever the welfare effect of 9% of a conventional egg is. </p>\n", "parentCommentId": "yDEgwqDWHWakaxnRm", "user": null}]