[{"_id": "DjJjqMJBM92fuw7vk", "postedAt": "2022-09-09T15:24:48.096Z", "postId": "aZhQhsHX4PyxCCpkz", "htmlBody": "<p>I am curious whether funds which were previously allocated to the <i>Maximum Impact Fund</i>, before you added the \"high confidence\" modifier, will now be allocated to your this other set, rather than to the grants you expect to have the highest expected impact.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "FswTKtkFDRJcQm4YW", "postedAt": "2022-09-12T15:08:06.824Z", "postId": "aZhQhsHX4PyxCCpkz", "htmlBody": "<p>Hi, Nuno,</p><p>To clarify, \"Maximum Impact Fund\" was our previous name for the fund that we allocated toward the highest-priority gaps within our top charities. The name of that fund is now \"Top Charities Fund,\" and it'll continue to be used to fill top-charity funding gaps. The function hasn't changed, only the name (and now, given our <a href=\"https://forum.effectivealtruism.org/posts/H6D6QYRLaaZikcGaN/changes-to-our-top-charity-criteria-and-a-new-giving-option-3\">recent update to our criteria for top charities</a>, it will be distributed among a smaller set of programs).</p><p>We think the All Grants Fund and Top Charities Fund will likely be of similar cost-effectiveness, since we are using the same cost-effectiveness bar (currently 10x cash) for grants from both funds. But because the All Grants Fund may be used for higher-expected-value opportunities that don't necessarily meet the \"confidence\" criterion, it's possible that All Grants Fund will be higher-expected-value overall.<br><br>I'm not 100% sure I'm interpreting your query correctly, so please let me know if I can clarify anything further!<br><br>Best,<br>Miranda</p>", "parentCommentId": "DjJjqMJBM92fuw7vk", "user": {"username": "GiveWell"}}, {"_id": "cd6HHC6EHTTrfrAyW", "postedAt": "2022-09-13T12:09:40.029Z", "postId": "aZhQhsHX4PyxCCpkz", "htmlBody": "<p>Received, cheers</p>", "parentCommentId": "FswTKtkFDRJcQm4YW", "user": {"username": "NunoSempere"}}]