[{"_id": "GMwkMMuXeLhnXv2Bs", "postedAt": "2015-01-05T19:41:08.865Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Great topic!</p>\n<p>I think you missed this one from Rhys Southan which is lukewarm about EA: <a href=\"http://aeon.co/magazine/philosophy/art-is-a-selfish-waste-of-time-says-effective-altruism/\">Art is a waste of time says EA</a></p>\n<p>I don't see the Schambra piece as particularly vitriolic.</p>\n<p>I don't know where to find good outside critics, but I think there's still value in internal criticism, as well as doing a good job processing the criticism we have. (I was thinking of creating a wiki page for it, but haven't got around to it yet).</p>\n<p>Some self-centered internal criticism; I don't know how much this resonates with other people:</p>\n<ul>\n<li>I posted some things on LW back in 2011 which were badly received (and which I'm too embarrassed to link to). This was either a problem with me, or the LW community, or more likely both</li>\n<li>I spend a lot of time on EA social media when I could be doing more productive stuff</li>\n<li>I feel like a standard-issue generic EA - like I've internalized all the memes but don't have huge amounts of unique ideas or abilities to bring to the table</li>\n<li>Similarly my mental model of people in the EA movement is that they're fairly interchangeable, rather than each having their own strengths, weaknesses and personalities</li>\n<li>In particular, I haven't really managed to make <em>friends</em> with anyone I met through EA</li>\n<li>I spend a lot of time talking about EA but haven't actually donated much to charity yet</li>\n<li>In the past I've felt strong affiliation to an EA subtribe (xrisk), viewing the poverty and animal people as outgroups</li>\n</ul>\n<p>Also:</p>\n<ul>\n<li>We mostly speak English and are not as ethnically diverse as we could be</li>\n<li>One of the central premises of EA, that some charities are so very many times more effective than others, seems pretty bold. I'd like to be able to point to a mountain of evidence to back it up but I'm not sure where this is to be found.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "ANWusTauhy7AXPEFx", "postedAt": "2015-01-05T21:00:39.974Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>There's also the feedback we get in talks, and the comments on all the articles and media attention we've gotten, which is very extensive. I've also presented on these topics in an academic setting. </p>\n<p>And I asked for feedback here:\n<a href=\"https://www.facebook.com/wdcrouch/posts/10100610793427240?stream_ref=10\">https://www.facebook.com/wdcrouch/posts/10100610793427240?stream_ref=10</a></p>\n<p>From this, I feel I know the most common criticisms of EA (as practiced, rather than in theory) pretty well.</p>\n<ul>\n<li>doesn't appreciate the importance of systemic change</li>\n<li>too focused on the measurable rather than unquantifiable benefits</li>\n<li>smuggles utilitarian assumptions under the table (e.g. that you can aggregate small benefits and weigh them against large benefits; e.g. that you shouldn't be much more concerned with avoiding causing harm than with actively doing good)\n...</li>\n</ul>\n<p>However, I haven't seen a smart outside person spend a considerable amount of time to evaluating and criticising effective altruism. These objections are just the ones that people think of off the top of their head. I'd really like to see what someone who spent e.g. a week investigating EA and criticising it would say.</p>\n", "parentCommentId": null, "user": {"username": "William_MacAskill"}}, {"_id": "xMnGrMYp4EGX7Bxdr", "postedAt": "2015-01-05T21:54:28.651Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p><a href=\"https://www.facebook.com/groups/effective.altruists/permalink/802909099765449/\">Here's the link to the Facebook group post</a> in case people add criticisms there.</p>\n<p>Glad you linked to Holden Karnofski's MIRI post. Other possibly relevant posts from the GiveWell blog:</p>\n<ul>\n<li><p><a href=\"http://blog.givewell.org/2011/08/18/why-we-cant-take-expected-value-estimates-literally-even-when-theyre-unbiased/\">Why we can't take expected value estimates literally even when they're unbiased</a> (I remember this causing a stir on LW)</p>\n</li>\n<li><p><a href=\"http://blog.givewell.org/2014/06/10/sequence-thinking-vs-cluster-thinking/\">Sequence vs cluster thinking</a></p>\n</li>\n</ul>\n<p>There are more on a similar philosophical slant (search for &quot;explicit expected value&quot;) but the above seem the most criticismy.</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "b4PNNN7AGQLFn83pz", "postedAt": "2015-01-05T22:13:07.071Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I agree with these but they also reinforce the fact that &quot;Effective altruism&quot; as a category is quite unwieldy. &quot;too focused on the measurable rather than unquantifiable benefits&quot; - well,  we have a huge chunk of people calling themselves EA's who mostly care about totally unquantifiable GCR research. Simiarly for Ultilitarianism and comparing animal and human suffering or other such notions. The &quot;4 causes&quot; commonly identified with EA have quite distinct weaknesses and it would be good (in my view) if people started assessing them on their own merits and not lumping them under one banner. </p>\n", "parentCommentId": "ANWusTauhy7AXPEFx", "user": {"username": "AlasdairGives"}}, {"_id": "YtRyt7Rv68cxY8RNh", "postedAt": "2015-01-05T22:42:10.992Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I agree that we get heaps of feedback from talks and media so i imagine you personally encounter as much criticism of EA as any other single person, and since it's often brief spots with a big audience, that a lot of it feels like it's not well thought through.</p>\n<blockquote>\n<p>doesn't appreciate the importance of systemic change - too focused on the measurable rather than unquantifiable benefits - smuggles utilitarian assumptions under the table.</p>\n</blockquote>\n<p>Mightn't there be value in these criticisms?</p>\n<p>The systemic change criticism seems valid for EA five years ago. Now, GiveWell have started seriously analysing advocacy, GoodVentures have started funding it and FHI/CEA have started engaging policymakers so we've decided that these activities are crucial. Next time we could listen sooner right?</p>\n<p>Regarding smuggling in utilitarianism - well, there are related objections about to moralising, demandingness and self-sacrifice, which we've started to address in the last year or two, and which seem important. When we write in research articles or books, it seems like we are starting to get more careful about stating ethical assumptioms, which seems good.</p>\n<p>So, as non-smart or poorly-considered as this criricism may be, we've reasons to expect gold there, and any discussion should help the movement's self-awareness, psychological health and resiliency to further criticism. </p>\n", "parentCommentId": "ANWusTauhy7AXPEFx", "user": {"username": "RyanCarey"}}, {"_id": "ihuhBjeiocxLdM9e9", "postedAt": "2015-01-05T22:46:54.590Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Nitpick: You can't count the global catastrophes (yep, still zero for this decade) but you might be able to tell if it's working in other ways... Maybe. But yeah, I agree that that's the big weakness of GCR research.</p>\n", "parentCommentId": "b4PNNN7AGQLFn83pz", "user": {"username": "RyanCarey"}}, {"_id": "4965eRSWaBwSs9NMX", "postedAt": "2015-01-05T23:33:00.352Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I wonder what you would get if you offered a cash prize to whoever wrote the &quot;best&quot; criticism of EA, according some criteria such as the opinion of a panel of specific EAs, or online voting on a forum. Obviously, this has a large potential for selection effects, but it might produce something interesting (either in the winner, or in other submissions that don't get selected because they are too good).</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "N8SxtzkjoRRJ3wDxm", "postedAt": "2015-01-05T23:50:09.442Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Might be better to put up a cash prize for a suggested improvement rather than a critique then but maybe that's me being weak-spirited.</p>\n", "parentCommentId": "4965eRSWaBwSs9NMX", "user": {"username": "RyanCarey"}}, {"_id": "cjrwbHnkuPxxd9nSi", "postedAt": "2015-01-06T00:19:18.901Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>It seems worthwhile to differentiate between </p>\n<ul>\n<li>criticisms of EA as an idea </li>\n<li>criticisms of EAs, as individuals and as a movement</li>\n</ul>\n<p>For example, EA individuals tend to have a left-wing bias (and when the survey's results are released hopefully we'll have data on this) but this isn't inherent to EA ideals - many EA ideals are quite right wing.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "XJvLNH8BoeKcctKDC", "postedAt": "2015-01-06T00:32:19.500Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Criticisms: </p>\n<p>Manageable, with further work:</p>\n<ul>\n<li>Sorting out the ethics of animal suffering and catastrophic risk.</li>\n<li>Weights marginal benefit heavily over systematic change.  This may be inappropriate for very wealth philanthropists, or a group of pooled funders that may achieve the same effect. </li>\n<li>Doesn't give appropriate weight to stopping problems before they become a crisis, especially for inter-generational effects.  E.g., there hasn't been a lot of rigor in how EAs assess family planning.  </li>\n</ul>\n<p>Difficult to overcome: </p>\n<ul>\n<li>devaluing of systematic change, and ignoring the biggest money flows.  E.g., the amount of money that goes to aid is a fraction of a percent of the capital flight, foreign debt repayments, and natural resource capital/wealth that leaves poor countries.  EA asks people to give, but doesn't approach the problem of stopping the biggest leaks of wealth from where it is needed most.  This has a lot to do with challenging wealth directly and supporting systematic change.   </li>\n</ul>\n<p>Crippling, if true: </p>\n<ul>\n<li><a href=\"http://en.wikipedia.org/wiki/The_Limits_to_Growth\">Limits to growth</a> is more or less the reality, meaning <a href=\"http://en.wikipedia.org/wiki/Weak_and_strong_sustainability\">strong sustainability is a much better model than weak sustainability</a>.  Lack of sufficient effort locks us in an <a href=\"http://physics.ucsd.edu/do-the-math/2011/10/the-energy-trap/\">Energy Trap</a> and makes us likely to suffer an <a href=\"http://www.sciencedirect.com/science/article/pii/S0921800914000615\">irreversible (Type-N) collapse</a>.  Uncertainties would dominate such a scenario, weakening the usefulness of a lot of EA tools and techniques.  </li>\n</ul>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "vxvgXdi3ptpSrXPBv", "postedAt": "2015-01-06T00:40:22.129Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>What sort of criticism is the effective altruism community seeking? I notice much of the prior criticism cited are medium- or high-profile media criticism to effective altruism, in the form of a response to, e.g., William MacAskill's articles publised on Medium, or Peter Singer's TED talk. However, from the perspective of effective altruism itself, there isn't an incentive for it to be popular, or widely read. The important thing to effective altruism is that the criticism of its ideas are noted, and that its critics are engaged.</p>\n<p>I ask because I have friends, or others in my network, who might have criticisms of effective altruism. They wouldn't be as high-profile as some of the published ones above, nor from individuals who have as much professional experience. However, given the low quality of some of the above criticisms, this wouldn't seem to be a prior concern in its own right. I mean, present university students, and other young adults, are largely responsible for founding effective altruism, so they should be just as capable in making valuable criticism of it.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "JdTG4uh9E2igiCLJY", "postedAt": "2015-01-06T00:44:33.295Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Scott Alexander writes about the motte and bailey doctrine: <a href=\"http://slatestarcodex.com/2014/11/03/all-in-all-another-brick-in-the-motte/\">http://slatestarcodex.com/2014/11/03/all-in-all-another-brick-in-the-motte/</a></p>\n<p>Basically, people will retreat to obvious platitudes (the motte) when defending their position, when in fact they're actually trying to promote more controversial ideas (the bailey).  The motte for EA is &quot;doing the most good&quot; and the bailey is, well, everything else we promote.  Ideally the place to launch criticism is the bailey.  Unfortunately, a lot of the criticism has been directed to the motte, which leads to bizarre statements like &quot;well maybe suffering isn't bad, we don't want everyone to be happy all the time&quot; or &quot;it's impossible to know which things are better than others&quot;.  This may be part of the reason much of the criticism has fallen flat so far.  </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "BAgQNECG28Spm2Tg3", "postedAt": "2015-01-06T00:44:36.789Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>You make criticisms of EA as individuals out like it's not interesting. But if you called it &quot;EA in practice&quot;, then it would seem like something that can also be usefully criticised.</p>\n", "parentCommentId": "cjrwbHnkuPxxd9nSi", "user": {"username": "RyanCarey"}}, {"_id": "WquzFSqmCPAYQwLKP", "postedAt": "2015-01-06T01:11:48.395Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>&quot;Giles has passed on some thoughts from a friend&quot; is one of the things cited, so if a particular criticism isn't listed we can assume it's because Ryan doesn't know about it, not that it's inherently too low status or something. I definitely want to hear what your friends have to say!</p>\n", "parentCommentId": "vxvgXdi3ptpSrXPBv", "user": {"username": "Giles"}}, {"_id": "egCv7yGmSminoHW4D", "postedAt": "2015-01-06T01:18:05.005Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>We have been criticised by people who have encountered us briefly for things like:</p>\n<ul>\n<li>Being excessively critical of others, especially too quickly and without establishing a relationship first</li>\n<li>Not being friendly, focussing too much on trying to prove how smart we are</li>\n<li>Not being diverse enough (especially on gender, racial or religious lines, and to a lesser extent socioeconomic, political, cultural and academic discipline)</li>\n<li><ul>\n<li>As a result, being unwelcoming to people who are either superficially or substantively different to existing participants</li>\n</ul>\n</li>\n<li><ul>\n<li>As a result, converging prematurely on ideas that people from other backgrounds or fields would have good counterarguments for.</li>\n</ul>\n</li>\n</ul>\n<p>These seem like pretty serious concerns that we must address. They certainly all don't apply to everyone, but looking at how we collectively come across I am not surprised some people react this way.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "YiX9sALmmpahvp9WM", "postedAt": "2015-01-06T01:22:10.953Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Another criticsm: the movement isn't as transparent as you might expect. (Remember, GiveWell was originally the Clear Fund - started up not necessarily because existing charitable foundations were doing the wrong thing, <a href=\"http://www.givewell.org/about/story\">but because they were too secretive</a>).</p>\n<p>When compiling <a href=\"http://effective-altruism.wikia.com/wiki/Comparison_of_Organizations\">this table of orgs' budgets</a>, I found that even simple financial information was difficult to obtain from organizations' websites. I realise I can just ask them - and I will - but I'm thinking about the underlying attitude. (As always, I may be being unfair).</p>\n<p>Also, what <a href=\"http://www.leverageresearch.org/\">Leverage Research</a> are up to is anybody's guess.</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "5vTwXQFFtvfsXh5La", "postedAt": "2015-01-06T01:22:33.197Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I always find it quite strange to find people asserting that there are strong limits to growth when:</p>\n<p>i) most technologies that are possible haven't been invented yet\nii) humans only occupy a tiny spec of the universe.</p>\n<p>It's more accurate to say there are limits to the rate of growth we can achieve - limits set by our ingenuity at any point in time.</p>\n", "parentCommentId": "XJvLNH8BoeKcctKDC", "user": {"username": "Robert_Wiblin"}}, {"_id": "aY86BabKzunYT7KGw", "postedAt": "2015-01-06T02:13:51.686Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Sanctimony.</p>\n<p>I have not publicized my support of Effective Altruism at this point due to a fear of appearing arrogant.</p>\n<p>One could argue that this applies as well to any altruistic or charitable movement but that isn't true: with EA there is also the tacit and easily verbalized assumption that my method of charitable giving is more effective than and thus superior to other people's, and that I'm therefore not only more generous but also more edified and generally intelligent than proponents of Ineffective Altruism, of which there are legion.</p>\n<p>An example: I was considering posting a comment on the Facebook thread dealing with this same issue. I didn't because I knew my friends would see it.</p>\n<p>Another example: I originally liked the EA Facebook page in the dead of night, when the least number of friends would be likely to see it. A calculation on my part.</p>\n<p>I've had conversations about EA with a few people to whom I'm very close, and responses have been mixed-to-positive so far, but I cannot see myself broadcasting my stance in regards this issue in any public forum.</p>\n<p>From a grassroots/proselytization perspective, I seriously doubt that I am in a marginal minority when it comes to this qualm. I'm surprised to have not seen this criticism in the post above but would be happy to know that I am in a marginal minority on this issue. Since people telling other people about EA is <em>ahem</em> useful to the movement, I see this as an important and inhibiting issue that has, for better and worse, been hardboiled into the name and concept.</p>\n", "parentCommentId": null, "user": {"username": "SASS"}}, {"_id": "Zupn4wXjrZW5abLXx", "postedAt": "2015-01-06T02:25:20.346Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Is there any particular topic, or set of ideas, from effective altruism criticism is being sought for? Alternatively, is there a particular format for the criticism that's being preferred? In particular, if I know some folks who might criticize effective altruism, I could ask them to publish their perspective on this forum. On the other hand, the threat of receiving downvotes, and being in the element of an intellectual opponent, seems to me a (fair) reason one might not want to publish criticism(s) of effective altruism on this forum.</p>\n<p>I believe if it's explained to potential critics that effective altruism is based upon a tenet of self-reflection, and rationality, so it's earnestly seeking criticism of its ideas so that it can change and improve itself, those critics might be more willing to specify their focus. After Holden Karnofsky published his critique of the MIRI, MIRI temporarily hired former Givewell analyst Jonah Sinick to assess the validity of their organizational strategy relative to the organization's goals. Additionally, Luke Muehlhauser and Holden Karnofsky in particular have maintained a dialogue on what Holden, or Givewell, might think of the MIRI's ongoing work, and how they've improved over time. If the MIRI as an organization can solicit what criticism it receives in pursuit of self-improvement to be tailored to specific subject matter, perhaps effective altruism as a whole can do the same.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "eKc8v6ok3nDNoyTAR", "postedAt": "2015-01-06T02:33:20.022Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>To develop the effective altruist movement, it's essential that we ask people how we've failed, or how our ideas are inadequate.\n[...]\nSo an important challenge for all of us is to find better critics.\n[...]\nLet me know if there's any big criticism that I've missed, or if you know someone who can engage with an poke holes in our ideas.</p>\n</blockquote>\n<p>On the important challenge of finding better critics, my personal strategy is going to be to seek a greater quantity of critics. My rationale for this is that we won't know which criticism(s) is or are the best until they're received, so it's worth courting many critics to widen the net of criticism effective altruism receives. I don't intend to seek as many critics as possible, broadcasting the request as publicly as possible across my social networks, because that seems to be casting a net so wide as to attract poor criticism. However, if there is someone I know who expresses, or has previously expressed, a perspective on effective altruism, even a negative one, I will invite them to generate a criticism of effective altruism. </p>\n<p>This still seems like a strategy that will bring in poor criticisms. However, I believe an aversion to courting more criticism rather than less is the same attitude that's led to effective altruism thinking it's received too little criticism in the first place. If effective altruism receives more poor criticisms, its not anything the movement can't bear. Honestly, I perceive it difficult to believe anyone who might make great effort to criticize effective altruism sincerely could report something of much lesser quality than the worst drivel effective altruism has already received. Also, it seems biased, disingenuous, and hypocritical to seek more critics, but pick and choose specific critics we might like more in particular.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "o6beffYmXLc68nqKW", "postedAt": "2015-01-06T03:15:16.259Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I don't think there is enough information to rule out the strong sustainability hypothesis. (This is not to say it is true, just that there isn't enough information to go either way).  </p>\n<p>It's not just about what technologies we have to discover, it's about how fast they can be discovered, developed, and implemented to overcome problems.  Technology is value-neutral; sometimes it solves problems, sometimes is makes new one, sometimes it does both.  There are good reasons to think that we are much more robust to pressures that collapsed a lot of earlier civilizations, but the scale of the problems we face is also unprecedented.  Biocapacity and energy throughput concerns have proved impressively stubborn to technical solutions in the last several decades.  And we don't have a infinite amount of time to figure them out before they become serious collapse pressures.   </p>\n", "parentCommentId": "5vTwXQFFtvfsXh5La", "user": {"username": "MatthewDahlhausen"}}, {"_id": "9yquQMehzqiQakeEx", "postedAt": "2015-01-06T10:53:56.238Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I think that it's useful to hear what people think of the whole idea. For reference, there's Singer's TED talk, Will's 'What is Effective Altruism?', and lots more <a href=\"http://effective-altruism.com/ea/6x/introduction_to_effective_altruism/\">intoductory essays</a>. Apart from that, my suggestions for new critics would be:</p>\n<ul>\n<li>It's probably better <em>not</em> to read a lot existing critiques at this stage because it might make you less imaginative.</li>\n<li>To keep it constructive, it often helps if you can suggest what would count as an improvement.</li>\n<li>You can email criticism to me or post it here (as a comment or as a new thread)</li>\n<li>If you're writing something more substantial, you can get people to give feedback by sending it around as a google doc.</li>\n</ul>\n", "parentCommentId": "Zupn4wXjrZW5abLXx", "user": {"username": "RyanCarey"}}, {"_id": "dtdqAMpRo5HWHhntw", "postedAt": "2015-01-06T15:16:40.809Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>However, I haven't seen a smart outside person spend a considerable amount of time to evaluating and criticising effective altruism.</p>\n</blockquote>\n<p>Would they do it if we paid them?</p>\n", "parentCommentId": "ANWusTauhy7AXPEFx", "user": {"username": "Giles"}}, {"_id": "ChjNAkiHm5WpqYnqv", "postedAt": "2015-01-06T16:02:09.430Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>Eliezer Yudkowsky has challenged utilitarianism and some forms of moral realism in the Fun Theory sequence, the enigmatic (or merely misunderstood) Metaethics sequence and the fictionalised dilemma Three Worlds Collide. </p>\n</blockquote>\n<p>I'm confused. AFAIK Yudkowsky's position is utilitarian, and none of the linked posts and sequences challenge utilitarianism. 3WC being an obvious example where only one specific branch - average preference utilitarianism - is argued to be wrong. The sequences are attempts to specify parts of the utility function and its behavior - even going so far as to argue for deontological laws as part of utilitarianism for corrupt humans - not refutations.</p>\n<blockquote>\n<p>the enigmatic (or merely misunderstood) Metaethics sequence</p>\n</blockquote>\n<p>This looks like mind projection fallacy. If so, the obvious explanation is that you don't understand Yudkowsky's position properly.</p>\n", "parentCommentId": null, "user": {"username": "Philip_W"}}, {"_id": "t7H2j2GtWBz4nTuaj", "postedAt": "2015-01-06T17:00:27.419Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>This piece by George Monbiot represents one strand of potential deep criticism, which is that many goods are incommensurable in value: <a href=\"http://www.monbiot.com/2014/07/24/the-pricing-of-everything/\">http://www.monbiot.com/2014/07/24/the-pricing-of-everything/</a></p>\n<p>This is a pretty common view in philosophy, and it would make the EA project much more limited in what it could achieve.</p>\n", "parentCommentId": null, "user": {"username": "William_MacAskill"}}, {"_id": "pwPri8dp2LpZN4bF3", "postedAt": "2015-01-06T17:32:55.412Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>AFAIK Yudkowsky's position is utilitarian, and none of the linked posts and sequences challenge utilitarianism.</p>\n</blockquote>\n<p>I've added the word 'hedonistic' and fixed a duplicate link. Maybe he's an atypical <a href=\"http://lesswrong.com/lw/n9/the_intuitions_behind_utilitarianism/\">utilitarian</a>, depending on our definitions. He's consequentialist and I think he endorses following <em>a utility function</em> but he certainly opposes simple hedonistic utilitarianism, or the maximisation of <a href=\"http://lesswrong.com/lw/lp/fake_utility_functions/\">any simple good</a>.</p>\n<blockquote>\n<blockquote>\n<p>the enigmatic (or merely misunderstood) Metaethics sequence</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>This looks like mind projection fallacy. If so, the obvious explanation is that you don't understand Yudkowsky's position properly.</p>\n</blockquote>\n<p>Yes, I found Eliezer's Metaethics sequence difficult but so did <a href=\"http://lesswrong.com/lw/435/what_is_eliezer_yudkowskys_metaethical_theory/\">lots of people</a>. Eliezer <a href=\"http://lesswrong.com/lw/t8/you_provably_cant_trust_yourself/\">agrees</a>:</p>\n<blockquote>\n<p>I've been pondering the unexpectedly large inferential distances at work here—I thought I'd gotten all the prerequisites out of the way for explaining metaethics, but no.  I'm no longer sure I'm even close.  I tried to say that morality was a &quot;computation&quot;, and that failed; I tried to explain that &quot;computation&quot; meant &quot;abstracted idealized dynamic&quot;, but that didn't work either.  No matter how many different ways I tried to explain it, I couldn't get across the distinction my metaethics drew between &quot;do the right thing&quot;, &quot;do the human thing&quot;, and &quot;do my own thing&quot;.</p>\n</blockquote>\n", "parentCommentId": "ChjNAkiHm5WpqYnqv", "user": {"username": "RyanCarey"}}, {"_id": "KrTDe6Li9Y6tx94Ed", "postedAt": "2015-01-06T18:56:50.718Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>If many things are incommensurable at least we wouldn't be doing harm - our actions would often be merely neutral.</p>\n", "parentCommentId": "t7H2j2GtWBz4nTuaj", "user": {"username": "Robert_Wiblin"}}, {"_id": "PEvwGNpM6gwENpNZB", "postedAt": "2015-01-07T00:20:10.213Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Sorry, that wasn't my intention. I think both can be valuable.</p>\n", "parentCommentId": "BAgQNECG28Spm2Tg3", "user": {"username": "Larks"}}, {"_id": "9bQay8pjAK3TKLLPp", "postedAt": "2015-01-07T01:09:58.784Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>Another example: I originally liked the EA Facebook page in the dead of night, when the least number of friends would be likely to see it. A calculation on my part.</p>\n</blockquote>\n<p>If your friends would be that opposed, just don't like the page! Page likes just aren't valuable enough to cause you distress. Their main value is broadcasting to your friends anyway.</p>\n", "parentCommentId": "aY86BabKzunYT7KGw", "user": {"username": "Larks"}}, {"_id": "sKeiBCihuqHjCpT7a", "postedAt": "2015-01-07T01:18:27.291Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>There is also <a href=\"http://www.philanthropydaily.com/earnest-but-inhumane/\">this</a> post by Scott Walter which I thought had some pretty good points.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "56xKRwu9A9ESeSBN7", "postedAt": "2015-01-07T20:13:54.428Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>One way we can invite constructive criticism is by our response to criticisms we receive. That's difficult for an amorphous 'group', but perhaps some invited posts on the forum trying yo vine to grips with these? Perhaps CEA could publish their current thinking on areas where they have encountered criticism (both from 'inside' and 'outside' the organisation)?</p>\n", "parentCommentId": "egCv7yGmSminoHW4D", "user": {"username": "Bernadette_Young"}}, {"_id": "7AhdiQixc57vgpZfD", "postedAt": "2015-01-08T01:52:09.038Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>If you ever find .impact or Charity Science insufficiently transparent, let me know.  I think the reason why you might have trouble finding income and expenses for those two orgs is that their official income and expenses are both essentially $0.  You can see some of the financial flow into both orgs <a href=\"http://www.peterhurford.com/other/donations.html\">here</a>.</p>\n", "parentCommentId": "YiX9sALmmpahvp9WM", "user": {"username": "Peter_Hurford"}}, {"_id": "KbfDgss76hz8vhKXG", "postedAt": "2015-01-08T09:56:11.099Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Here is someone's initial exploration of a potential criticism: <a href=\"https://www.facebook.com/groups/effective.altruists/805005126222513/?notif_t=group_activity\">https://www.facebook.com/groups/effective.altruists/805005126222513/?notif_t=group_activity</a></p>\n<p>(A poll about whether a nonprofit with a charismatic and intelligent leader and an unfalsifiable premise of how their charities does good would succeed in getting funding from the EA community.)</p>\n", "parentCommentId": null, "user": {"username": "Vincent_deB"}}, {"_id": "a6228wpfTMozYJCnr", "postedAt": "2015-01-09T06:09:29.795Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>A thought: It seems like the EA community has a pretty strong focus on criticism, whether it's internal or external.  Is it possible that this can itself be counterproductive?  If the EA community is a fun place to be, that's good for both recruiting and retention, right?</p>\n<p>Or to steelman <a href=\"http://www.overcomingbias.com/2015/01/on-exposing-hypocrisy.html\">Robin Hanson</a>'s recent post, if the EA community is ever to expand beyond high-scrupulosity, taking-abstract-moral-arguments-seriously, relentlessly-self-criticizing folks, it may need to find a way to help people achieve conventional self-interested goals like making friends, finding mates, and signaling desirable qualities.</p>\n<p>(I don't necessarily agree with this position but it seems like an interesting one.  There may be some kind of quality vs quantity tradeoff where we can either have a smaller movement full of dedicated, careful, effective nerds or a larger movement that could spin out of the control of its founders.)</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "HkicXSQKa3zrkvJ8d", "postedAt": "2015-01-09T17:57:29.050Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I don't know if this is relevant to the criticism theme, but I found it was necessary for me to take some of Hanson's ideas seriously before becoming involved in EA, but his insistence on calling everything hypocrisy was a turn-off for me. Are there any resources on how we evolved to be such-and-such a way (interested in self+immediate family, signalling etc.) but that that's actually a <em>good</em> thing because once we know that we can do better?</p>\n", "parentCommentId": "a6228wpfTMozYJCnr", "user": {"username": "Giles"}}, {"_id": "2gRFxkcGuEnc2C7Hk", "postedAt": "2015-01-09T22:35:58.405Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Off the top of my head:</p>\n<ul>\n<li>The Selfish Gene by Richard Dawkins</li>\n<li>The Origins of Virtue by Matt Ridley</li>\n<li>Moral Tribes by Joshua Greene</li>\n<li>Darwin's Dangerous Idea by Dennett</li>\n<li>Freedom Evolves by Dennett</li>\n<li>The Expanding Circle by Peter Singer</li>\n</ul>\n<p>They might mean that our evolved morality is &quot;good&quot; in a different sense than you're looking for.</p>\n<p>I haven't read them yet but The Ant and the Peacock, Moral Minds, Evolution of the Social Contract, Nonzero, Unto Others, and The Moral Animal are probably good picks on the subject.</p>\n", "parentCommentId": "HkicXSQKa3zrkvJ8d", "user": {"username": "Bitton"}}, {"_id": "fv6b772NNmN5Rowvw", "postedAt": "2015-01-10T12:27:05.667Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I think one of my concerns with this would be the consistency and commitment effect created by incentivising a criticism, leading to someone seeing herself as an EA critic, or opposed to these ideas. Similar to companies having rewards for customers writing why it's their favourite company or product in the world. See also the American prisoners of war of China in the Korean war (I think), having small incentives to write criticisms of America or Capitalism. \nIf it were being seriously considered, it'd be good to see some more done to work out if this would be a real consequence. </p>\n<p>Source: <em>Influence</em>, Cialdini.</p>\n", "parentCommentId": "N8SxtzkjoRRJ3wDxm", "user": {"username": "Peter McIntyre"}}, {"_id": "YprtFYf4Xu2WEHoZh", "postedAt": "2015-01-10T22:52:20.797Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>You can find all the data on 80k in our latest financial report and summary business plan:\n<a href=\"https://80000hours.org/about/credibility/evaluations/\">https://80000hours.org/about/credibility/evaluations/</a></p>\n<p>Some even more current updates also here: <a href=\"https://groups.google.com/forum/#!forum/80k_updates\">https://groups.google.com/forum/#!forum/80k_updates</a></p>\n", "parentCommentId": "YiX9sALmmpahvp9WM", "user": {"username": "Benjamin_Todd"}}, {"_id": "3GqerqJijzHjgb9vT", "postedAt": "2015-01-12T06:12:18.254Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Full disclosure: below, I endorse the actions of the foundation called Charity Science, which is run by personal friends of mine, which is an issue aside from what would be my otherwise detached admiration of their work.</p>\n<blockquote>\n<p>I have not publicized my support of Effective Altruism at this point due to a fear of appearing arrogant.</p>\n</blockquote>\n<p>My support of effective altruism isn't very publicized yet, either, for this reason. Actually, I'm not only afraid of <em>appearing</em> arrogant, but also I don't want to push ideas on others that I'm also afraid really <em>are</em> arrogant. That is, if my friends pointed out the arrogance of effective altruism, I wouldn't be too surprised if they were right about that. On the other hand, this fear may be more due to shame than humility. I might be afraid of looking too weird, <em>and</em> arrogant, but learning that sooner rather than later if it's rightly so I'm pursuing wrong ideas, I'd be wasting less time on them. Temporary embarrassment may be a small price to pay for learning a hard and proper lesson to not waste my time trying to do good on the wrong sort of lifestyle or activism.</p>\n<p>Peter Hurford has achieved relative success in direct research efforts, movement coordination, earning to give, and career decisions, among supporters of effective altruism. As far as I can tell, he is quite public with his support of effective altruism. However, he's engaged in other intellectual endeavors, sometimes criticizes effective altruism, and may court outside criticism from his social network as well. Additionally, in the past he's expressed an aversion to public-facing activism (at least off the Internet), e.g., leafleting for animal rights or veganism, and other causes. This is despite the fact that he supports animal welfare, and other causes embraced by effective altruism. I'm not aware if his aversion to activism directed toward strangers is for the same reasons that you and I don't publicize our support of effective altruism generally.</p>\n<p>I publicize my support of effective altruism by sharing links on the subject I like on social media, by bringing up object-level causes within effective altruism, e.g., the Against Malaria Foundation, and spreading ideas by word of mouth among friends. <a href=\"http://www.charityscience.com/\">Charity Science</a> is an organization which runs fundraisers. Moreover, they act as an online donation portal which coordinates and allows individuals to run their own fundraisers, for their birthdays or Christmas. <a href=\"http://www.effective-altruism.com/ea/cs/how_i_raised_501032_for_amf_and_how_you_can_too/\">Peter Hurford</a> is one such individual who's been quite successful. Of course, even if it seems too stressful or presumptuous to cast a net as wide as Mr. Hurford did, one can experiment by sending emails only to closer friends and family who you feel won't react harshly to such a request. This may be one way of expanding a comfort zone with effective altruism, while also raising money.</p>\n<blockquote>\n<p>From a grassroots/proselytization perspective, I seriously doubt that I am in a marginal minority when it comes to this qualm. I'm surprised to have not seen this criticism in the post above but would be happy to know that I am in a marginal minority on this issue. Since people telling other people about EA is ahem useful to the movement, I see this as an important and inhibiting issue that has, for better and worse, been hardboiled into the name and concept.</p>\n</blockquote>\n<p>Agreed. This strikes me as substantial enough of a concern that it could merit a couple of questions in the next effective altruism survey. I know Tom Ash, the fellow who ran the survery this year, so I'll ask him about it. </p>\n", "parentCommentId": "aY86BabKzunYT7KGw", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "pYJwcXad7AGKxCFMF", "postedAt": "2015-01-12T06:38:32.542Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>not being diverse enough (especially on gender, racial or religious lines, and to a lesser extent socioeconomic, political, cultural, and academic discipline)</p>\n</blockquote>\n<p>One explanation for this I've encountered is just that effective altruism has been packaged by people of one sort that's intuitive to people of the same sort. For example, the emphasis on quantification of social goods appeals to students of economics, and the idea of using new methods of reasoning and calculation to uncover greater effectiveness appeals to students of computer science, mathematics, and philosophy. Those groups tend to be largely dominated by young, white men to begin with. Additionally, effective altruism originated with an academic and secular approach to ethics, a discipline that tends to be followed by less religious people. Further, it doesn't seem a coincidence that effective altruism, what with its focus on philanthropy, has primarily gained traction in wealthier countries in the Anglosphere.</p>\n<p>In essence, the communites which first fed the numerical growth of effective altruism aren't, and haven't been, very diverse to begin with. So, effective altruism may not be so much at fault by this point for failing to be diverse. Going forward, it's the responsibility of the movement to reach out, and broaden its horizons, with nuance and respect, to other communities. When poiting out the lack of diversity, do critics point out:</p>\n<ul>\n<li>A) effective altruism doesn't appear diverse, so this image problem leads to miscommunication wherein a more diverse crowd never joins the movement, because they fear feeling awkward, or out of place?</li>\n</ul>\n<p>or </p>\n<ul>\n<li>B) because of its lack of diversity, whether explicity or implicity, effective altruism seems to be offensive or ignorant of the needs and perspectives of individuals from more diverse or differentiated backgrounds?</li>\n</ul>\n<p>An early impression I had of effective altruism, in getting to know it, one might find it elitist, based on its community origins in elite universities, such as the Oxbridge school in Britain, or the Ivy League universities in the United States. HIstorically, I'd figure racial minorities, some religious minorities, and poorer people, or ones of less elite classes, generally, don't have access to this level of education. Some of my own discomfort with effective altruism is because others have access to this elite education, and I feel like I never did, and <em>I'm</em> a white man from Canada who was raised by a middle-class family. If I feel a bit left out already having so much opportunity, it must feel more awkward for those with less privilege than myself.</p>\n<p>The heavier emphasis on earning to give a couple of years ago might have turned away a greater diversity of people who otherwise might have found effective altruism convincing or appealing in its ideas. To acquire a middle-class income, let alone a very high one that would be ideal for earning to give, requires access to acquire money to education, which is getting more expensive. To have that money, and access to a better education, is likelier the domain of people who were raised wealthier. Additionally, being raised in poverty is correlated with personal needs, such as poor health in the family, or lack of access to good resources, which might need to be persistently addressed. If I was in such a less privileged position, I might think earning to give is a lofty, 'pie-in-the-sky' goal beyond my means when I have enough trouble taking care of myself and my loved ones in a society that won't prevent me from falling through its cracks. So, I won't fault someone else in such a position for thinking the same.</p>\n<p>This effect compounds with how marginalized groups such as women and minorities tend to have less access to opportunities to pursue a lifestyle that enables one to live life relatively risk-free, and in comfort, while still giving more of oneself that effective altruism requires. I'm not versed in the factors of all that, so I'll stop here.</p>\n", "parentCommentId": "egCv7yGmSminoHW4D", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "J952DTpS6Qc8EvrRQ", "postedAt": "2015-01-12T07:17:45.468Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Having met Geoff Anders, the executive director of Leverage Research, and its other employees multiple times, and taking it upon myself specifically to ask pointed questions attempting to clarify their work, I can informally relay the following information[1]:</p>\n<ul>\n<li><p>Leverage Research has and continues to successfully raise funds for its own financial needs without doing broad-based outreach to the effective altruism community at large. Leverage Research seems confident in its funding needs for the future to the point at which they won't be sourcing funds from the effective altruism community at large anytime soon.</p>\n</li>\n<li><p>Given that Leverage Research considers itself an early-stage, non-profit research organization, whose research goals pivot rapidly as its researchers update their minds on what is the best work they can do in the face of new evidence and developments, Leverage Research perceives it as difficult to portray their research at any given time in granular detail. That is, Leverage Research is so dynamic an organization at this point that for it to maximally disclose the details of its current research would be an exhaustive and constant effort.</p>\n</li>\n<li><p>Because of the difficutly Leverage Research has in expressing its research agenda accurately and precisely at any point in time, and because they've sourced their funding needs from private donors who were provided information to their own satisfaction, Leverage Research doesn't perceive it as absolutely crucial that they make specific financial or organizational information easily accessible, e.g., on its website. Personally, I haven't ever privately contacted Leverage Research seeking a disclosure of, or access to, such information. I have no knowledge of how such interactions may or may not have gone between other third parties, and Leverage Research.</p>\n</li>\n<li><p>The information available under the 'Our Team' heading on Leverage Research's website seems to overview only its employees who head its executive functioning, and individuals who oversee its largest projects. At any given time, Leverage Research works with several researchers, both from within and from outside of the effective altruism community, who pursue projects. Leverage Research allows researchers it takes on as part of its team, either temporarily or permanently, to pursue their own research agenda. Based on its own goals, Leverage Research lets its associated researchers pursue their research in a freeform manner, rather than assigining tasks and measured goals with a heavy hand. Leverage Research seems to do this on the basis of the belief that enabling researchers with this greater independence will, directly or indirectly, more effectively lead to the fulfiilment of the organization's medium- and long-term goals. </p>\n</li>\n<li><p>Leverage Research often hires a number of interns, or researchers, on a trial basis, to assess whether the independent research goals and findings of its prospective associates will be consistent with the goals and mission of the organization. The changing nature of its team, and the relative independence of each (subgroup of) researcher(s), is in large part why Leverage Research finds it difficult to do justice in expressing its research goals.</p>\n</li>\n<li><p>Much of Leverage Research's time and human resources is taken up by helping build the effective altruism movement. Effectively, this breaks down to Leverage Research assisting or collaborating with other organizations on events and projects. Such organizations include the Machine Intelligence Research Institute, the Center for Applied Rationality, and the Centre for Effective Altruism. The details of such projects and events could be confirmed by representatives from either Leverage Research, or another of these organizations. </p>\n</li>\n<li><p>Additionally, Leverage Research has taken sole responsibility for organizing the Effective Altruism Summit for the years 2013 and 2014, an undertaking which delivered with impressive results. Personally, I believe the 2014 Effective Altruism Summit was quite successful. These Summits have been unusual conference-style events for a unique social movement for which there is no prior infrastructure, or logistical support, for organizing events so ambitious in attendance, and diverse in content. In hindsight, it's my impression the effective altruism community at large underestimated how much effort, dedication, and person-hours worth of work were required of Leverage Reserach to wholly plan and throw such events.</p>\n</li>\n</ul>\n<p>[1] I take full responsiblity for any of this information if it's incorrect, inaccurate or mistaken. This is from my memory alone, based on personal correspondence with individuals affiliated with, but not necessarily employed by, Leverage Research. I will defer to representatives of Leverage Research on this information, and redact or correct this comment accordingly. I remain reticent out of concern not to misrepresent Leverage Research, so all further questions should be addressed to a representative of that organization, and not my person. I have no past or present affiliation with Leverage Research.</p>\n", "parentCommentId": "YiX9sALmmpahvp9WM", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "fnZMGudviD59EwtaF", "postedAt": "2015-01-12T08:52:28.006Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>My whole response to this essay was to be here in a single comment. However, it was too long for a single comment. I have thus decided I may share it on this forum as a post in its own right at a later date. I'm not sure it's really worth the effort, as it's of mild concern. Also, frankly, I'm afraid Mr. Walter might return to this forum, take what written here out of context and yet again conflate effective altruism as a slippery slope to Nazi-level eugenicism because of Peter Singer's association with effective altruism[1].</p>\n<p>I agree Mr. Walter raises some serious points of concern, and legitimate criticism, such as effective altruism perhaps being too demanding of what personal lifestyle choices we its adherents may feel some peer pressure to make.</p>\n<p>[1] The full argument doesn't seem much less bizarre.</p>\n", "parentCommentId": "sKeiBCihuqHjCpT7a", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Laom7nwMiMTpsCAsJ", "postedAt": "2015-01-12T09:29:27.722Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I've recently been considering the analogy between Effective Altruism and the movement towards Evidence Based Medicine. The strongest similarity is that they both seek to use the conscientious application of high quality evidence to guide decision making. EBM has been criticised extensively, and many of its critics care deeply about the 'project' of medicine. It strikes me that these critiques could provide useful points to consider for EA. Maybe gathering and considering these would be a useful project for a CEA intern or similar. </p>\n", "parentCommentId": null, "user": {"username": "Bernadette_Young"}}, {"_id": "wpYG6TFXg3gbKh9HT", "postedAt": "2015-01-13T07:14:38.785Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>This past summer I was introduced to the Effective Altruism movement via The Center for Applied Rationality (CFAR). I love the CFAR crew and found a few kindred spirits who are also EA's. </p>\n<p>I became interested in EA because I'm constantly running into charitable or grassroots organizations that are incredibly ineffective with fighting poverty and misinformation within minority communities, specifically in urban spaces like the Southside of Chicago. I believe that I've found some of the root causes and was hoping to glean some information or techniques for improving the effectiveness of these efforts, bring this information back to our communities and in return, provide value to the EA movement. </p>\n<p>Though I'm deeply interested in the core tenants of Effective Altruism, I find the vocabulary, culture, and causes very distant from my own. I'm an African-American grassroots female hacktivist from the Southside of Chicago. I have a Master's and a dual degree in Economics and Urban Planning and 99% of the time have no idea how to decipher what the hell is coming out of these forums. </p>\n<p>From reading a few of the comments below, I can tell that you've already run into the diversity issue, so I won't harp on that. Otherwise, here are some other more urgent questions I have and imagine others will have as well.</p>\n<p>Other than donating to effective charities,</p>\n<ul>\n<li>What can I DO to contribute digitally?</li>\n<li>What can I DO to contribute physically?</li>\n<li>What can I DO to contribute locally?</li>\n<li>Give me 5 foundational articles/videos/books, etc. that I should consume to be a beginning EA.</li>\n<li>Are there any upcoming events that I can attend?</li>\n</ul>\n<hr />\n<p>I feel like these are common denominators that may even catalyze a solution for the diversity problem. </p>\n", "parentCommentId": null, "user": {"username": "astclaire"}}, {"_id": "PzqrFLAFqpCwA389H", "postedAt": "2015-01-13T09:59:38.677Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Hey AstClaire.\nTahnks for your thoughts.</p>\n<p>If you're in San Francisco, with CFAR, then there are definitely events there, which will be announced on Facebook or here. If you're in Chicago, there are people there, and I'm not sure whether they meet.</p>\n<p>For what to contribute, <a href=\"http://effective-altruism.com/ea/7k/what_small_things_can_an_ea_do/\">here</a> is one collection of activities.\nFor foundational articles, if you click <a href=\"http://effective-altruism.com/ea/6x/introduction_to_effective_altruism/\">More on Effective Altruism</a> in the sidebar, you will see a bunch. To pick 5: Efficiency Measures Miss the Point, Efficient Charity,- Do Unto Others, To Save the World... Go Work on Wall Street, Your Dollar Goes Further Overseas, Preventing Human Extinction.</p>\n<p>It'd be good to know what vocabulary, culture and causes are distant, to figure out whether there's some divide that's fundamental, or it's just the way we talk about things. EAs have  usually thought about the causes a lot, so those views there are fairly stable, but people often aren't very careful about culture and vocabulary, so that could have a lot of room to change.</p>\n", "parentCommentId": "wpYG6TFXg3gbKh9HT", "user": {"username": "RyanCarey"}}, {"_id": "HjrsiK3Tw5FDRYLL6", "postedAt": "2015-01-13T18:55:12.377Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Thanks - most of those names ring a bell but the Selfish Gene is the only one I've read. I guess some of the value of reading them is gone for me now that my mind is already changed? But I'll keep them in mind :-)</p>\n", "parentCommentId": "2gRFxkcGuEnc2C7Hk", "user": {"username": "Giles"}}, {"_id": "EnXeDqgEMBhyJKMJX", "postedAt": "2015-01-13T19:05:46.380Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Thanks - I knew they were involved in the EA Summit but I didn't know they were the sole organizers. I also knew they weren't soliciting donations. I partially retract my earlier statement about them! (Also I hope I didn't cause anyone any offense - I've met them and they're super super nice and hardworking too)</p>\n", "parentCommentId": "J952DTpS6Qc8EvrRQ", "user": {"username": "Giles"}}, {"_id": "Zz9Y8uuFfMQf8MGD9", "postedAt": "2015-01-13T20:40:15.375Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Great to hear from you, St. Claire!</p>\n<p>I sympathize with you in not understanding or being able to relate to the culture of the EA community. I feel the same way (ie. I'm religious, do industrial work, etc) and at first I was turned off of the community for that reason until I realized that the community will not grow and become more mainstream – and therefore it's ideas won't receive widespread acceptance – unless more diverse people join it.  I also had a hard time understanding what people were talking about on this forum, but after a while you learn the terminology/unorthodox views and it becomes comprehensible. Actually, I've noticed the writing on the forum gradually becoming better and easier to read. </p>\n<p>Sounds like the NGO's you deal with aren't adequately measuring and evaluating their impact, and need technical assistance in that department. Unfortunately, I don't know where to get this information but hopefully someone on the forum can point you in the right direction.</p>\n", "parentCommentId": "wpYG6TFXg3gbKh9HT", "user": {"username": "Austen_Forrester"}}, {"_id": "KWikogbpEFZnNs6PJ", "postedAt": "2015-01-14T02:30:10.568Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>Those groups tend to be largely dominated by young, white men to begin with. </p>\n</blockquote>\n<p>Most social movements are lead by young white men - EA is nothing special here. </p>\n<blockquote>\n<p>To acquire a middle-class income ... requires access to acquire money to education, which is getting more expensive.</p>\n</blockquote>\n<p>That's not true - at least in the US the government provides essentially unlimited credit to people who want to go to college, and furthermore it is possible to earn a very good living without having gone to college. Furthermore if you are the <a href=\"http://www.nytimes.com/roomfordebate/2012/12/19/fears-of-an-asian-quota-in-the-ivy-league/statistics-indicate-an-ivy-league-asian-quota\">right kind of minority</a> you will even benefit from affirmative action in admissions/scholarships.</p>\n", "parentCommentId": "pYJwcXad7AGKxCFMF", "user": {"username": "Dale"}}, {"_id": "4XWpJcQCWX233FyyS", "postedAt": "2015-01-14T12:57:08.685Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I originally posted this on the Facebook thread that linked to this discussion, but that thread was deleted, so I'm reposting it here.</p>\n<p>The strongest counterargument against EA that I know of is an attack on its underlying methodological individualism. By &quot;individualism&quot; here I mean analysing our actions as those of individuals deciding and acting in isolation. That is, looking at what we ought to do regardless of how this correlates with the behaviour of others.</p>\n<p>To see why this could be a problem, take Downs paradox of voting, as illustrated <a href=\"http://www.learnliberty.org/videos/why-are-voters-so-uninformed/\">here</a>. In that video, Diana Thomas argues—persuasively in my view—that voting (and being an informed voter) is irrational if seen solely as an individual act. Some have attempted to counter this by saying that voters are acting altruistically, rather than egoistically. I think such explanations are insufficient because they ignore the irreducibility of voting. The impact of voting for a specific candidate is an emergent property of sufficiently many doing it. Voting only makes sense when seen as a collective, rather than individual, act.</p>\n<p>The fundamental question underlying EA is &quot;how can I have the most impact?&quot; Turning this question into a movement, thus changing the &quot;I&quot; into a &quot;we&quot;, doesn't necessarily mean that the answer stays the same.</p>\n", "parentCommentId": null, "user": {"username": "GabrielEhrnstGrundin"}}, {"_id": "3MNxJZ5nNJRGt9Wwg", "postedAt": "2015-01-16T05:37:55.926Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I was googling &quot;effective altruism arrogant&quot; and it turned up a few links which I'm posting here so I don't lose them:</p>\n<ul>\n<li><a href=\"http://blog.westaf.org/2013/12/the-want-vs-need-discussion-thoughts-on.html\">Barry's blog on want vs. need</a></li>\n<li><a href=\"http://effective-altruism.com/ea/7m/open_thread/hd\">A comment on this forum from vipulnaik on hubris/arrogance</a> with responses</li>\n<li><a href=\"http://www.3quarksdaily.com/3quarksdaily/2014/04/attacking-the-value-of-art-is-not-a-good-strategy-for-altruists.html\">Attacking the value of art is not a good strategy</a> by Dwight Furrow on 3quarksdaily</li>\n<li><a href=\"http://atheistethicist.blogspot.ca/2013/06/effective-altrusim.html\">Not all lives saved are good</a> by Atheist Ethicist</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "FgpwZGvWdFQwhz2vv", "postedAt": "2015-01-17T20:17:03.291Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I suppose I could be counted among those &quot;outside critics&quot; the topic mentioned. What surprised me, however, was that I expected to find an article eschewing the role of criticism and suggesting ways of removing critics, inside and outside the ranks of its members.  This is what one often encounters in organizations that feel threatened by anything but the most complementary remarks on what they are doing.  In addition, I stopped by this site for one, and only one, purpose. To briefly describe my thoughts about a world where &quot;altruism&quot; would be a superfluous term, not to criticize anything about what people are, perhaps must, do in the world we have now, as it is given. In that, I always regard any tasks which even temporarily mitigate the amount of suffering or damage caused on this planet as essential if we are even to tread water for awhile. </p>\n<p>Actually, however, I don't regard myself as a critic at all. I don't really know enough about your group to even begin to presume I could judge it in any general or particular way.  I also did not regard my one, and only, post (a comment on the topic &quot;What is effective altruism&quot;) as a &quot;critique&quot; in any real sense of that term.  But I did think it might be useful to offer a view of a world beyond charity and altruism.  I've always regarded such portraits as useful, if for no other reason than the opportunity permitting one to check what they are doing to be sure they are not closing important doors to the future even as they open doors in the present.  So, that was my reason for coming and making that post.</p>\n<p>My own job however, as I define it, is not related to the here and now, except as I and the newspaper I steward suggest things that might be done in the here and now that would substantially alter the underlying reality we have all come to accept as the normative script for the future. That I think is a mistake that is made all too often.  We refer to the reality of the present as if it were the only possible reality, and often refer to it in invariant terms such as &quot;human nature&quot;.  I don't agree with that position at all, and regard it as one of the most persistent and pernicious obstacles to changing our reality and the obvious future it offers us.  I happen to think reality is an alterable feature of the human project, and subject to rewrite if we wish to do that.  The old scripts, the ones that have been written for us and handed to us, are only 'real' as long as we accept them as reality and tacitly consent to them.  In any case, that's how I view the matter.</p>\n<p>On a personal level, I might actually offer a critique on the concept of &quot;altruism&quot; but I won't. I'll only briefly mention that for me, altruism (our habits and practices of it) implies a dependency on unaccountable individuals and institutions to set the priorities and provide for the essentials of survival to the people of the world.  My view is that, when it comes to essentials, that is a job societies and civilizations as a whole should be doing. Whether they do it or not is beside the point. The fact remains, they should be. I regard it as a core function of having a society in the first place. And so, you will understand that I view charity and altruism as an obstacle to understanding that and rewriting the scripts of reality that would make it so.  All, without for one minute disregarding how essential charity and altruism are at the moment and that they need to at least be supported even in the midst of demanding that we transfer large swatches of what they do to the public responsibility form managing and delivering such basic services.</p>\n<p>But that's just my personal view on these matters, and I've really no intention of posting anything to that effect or arguing the case further.  But I did think the piece on omoiyari and a world without need for welfare or altruism or anything like those might be useful in some way.  I hope it is, and wish you all the best.  omoiyari, Red Slider   </p>\n", "parentCommentId": null, "user": {"username": "redslider"}}, {"_id": "FBSeMfSwNe6QJZWb5", "postedAt": "2015-01-20T06:13:40.246Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>By &quot;group&quot; in my initial comment, I meant the populations composing students of the formal sciences, economics, and philosophy. However, I concur most social, i.e., activist, advocacy, etc., movements are led by young white men. My point was that since this is true of many groups, not just effective altruism, I don't believe effective altruism is somehow especially exclusionary relative to other social movements. I believe this point still stands.</p>\n<p>I fully concede the point your rebuttal on income level, access to education, and social privilege. I should have qualified that I meant to acquire a high-class income is easier with more access to finances and other social privileges, but lack of access doesn't preclude one. I admit I don't know as much about how the American government funds post-secondary education. </p>\n<p>I'm from Canada. In Canada, public post-secondary institutions are funded by the federal government such that a university education is much cheaper for Canadian students than it is for our counterparts in the US. However, in my personal experience, and that of my friends, access to credit is more restricted. So, if one is poorer, one can't access loans <em>and</em> is less likely to have saved enough money to pay tuition out of pocket. I assumed things were the same in the United States, but apparently they're not.</p>\n", "parentCommentId": "KWikogbpEFZnNs6PJ", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "57PYEMmkLLD26uZE7", "postedAt": "2015-04-10T02:43:07.061Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Asteroid/comet impact, super volcanic eruptions, and even nuclear war risks are quantifiable within an order of magnitude or two: <a href=\"https://drive.google.com/viewerng/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxkYXZpZGRlbmtlbmJlcmdlcnxneDo1MTg1ZDQ4NGI1MDMxN2Q0\">link</a>. There are additional uncertainties in the cost and efficacy of interventions such as storing food or alternate foods. However, if you value future generations, one-three orders of magnitude uncertainty is not a significant barrier to making a quantified case.</p>\n", "parentCommentId": "ihuhBjeiocxLdM9e9", "user": {"username": "Denkenberger"}}, {"_id": "ZRdrEdq5kNcF5PQZg", "postedAt": "2015-04-10T23:04:26.354Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I have a background in energy and I have studied these issues extensively, so I could write many pages, but I will try to be brief. We actually already have the technology to support 10 billion people at the US standard of living sustainably. It is good to think about the dynamics and embodied energy. But because typical renewable energy pays back the energy investment in about three years, if we just took the energy output of renewable energy and reinvested it, the amount of renewable energy production would grow at about 30% per year. Therefore, if we just reinvested our current renewable energy production, we would be at 100% renewable in a couple decades. The energy payback time of nuclear energy power plants (not mining) is more like one third of a year, so this is even more favorable. \nThe HANDY paper does not consider technological improvement, which is probably appropriate for the timescale of past collapses (but note that in the longer term, our carrying capacity has gone from millions as hunter gatherers to billions now even with higher consumption per capita, so technological change is key). However, now that we have markets and R&amp;D, we don't need the government to intervene to get to a sustainable solution quickly. The book &quot;Limits to Growth&quot; does consider technological improvement. But for some reason it estimates the carrying capacity of the earth is much below current consumption, perhaps because it does not recognize we can make nitrogen fertilizer with renewable hydrogen. I think the carrying capacity issue is why &quot;Limits to Growth&quot; nearly always predicts collapse.\nIt is conceivable that we will overreact to these slow problems much more so than we did in 2008, and this could turn into a catastrophe. But more likely these resource constraints could reduce our resilience slightly to actual catastrophes. From a food perspective, there is around a 10% chance of nuclear winter this century, and when you include lesser catastrophes like regional nuclear war, volcanic eruptions, abrupt climate change, pandemics disrupting food trade, etc., it is greater than even chance. So I am worried much more about these catastrophes than resource constraints.</p>\n", "parentCommentId": "o6beffYmXLc68nqKW", "user": {"username": "Denkenberger"}}, {"_id": "LJ2TwKoiMnuycLXHB", "postedAt": "2015-04-22T14:20:31.802Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I'm new to EA (and so effectively an outsider), and here are a few critiques that immediately come to mind, and which I have not seen mentioned elsewhere. The first two are simply aspects of EA that might render it unpalatable or too counter-intuitive for the masses:</p>\n<ol>\n<li><p>It would seem to follow that robbing from the rich and giving to the poor is ethically required. Imagine a man eating a feast with two dozen turkeys, and right next to him is a family full of starving children. If you could steal a turkey and give it to the family without anyone noticing, shouldn't you? If so, then EA folks should really be entering into an alliance with Anonymous.</p>\n</li>\n<li><p>Not only are rich people ethically compelled to give away money, but people are ethically compelled to take reasonable steps to become rich. That means that all of those Ivy league graduates who went to work in the charity industry were behaving unethically.</p>\n</li>\n<li><p>Assuming a set amount of money available for charities, it's utility-maximizing for that money to come from the richest people (given the decreasing marginal utility of money). EA's focus on students giving away a few percent of their stipend is therefore a wildly inefficient way to maximize utility. (The response, of course, is that it's not a zero-sum game, but it is to the extent the EA movement is focusing resources on anyone but the wealthiest people.)</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "mhpage"}}, {"_id": "bxzHB5G5mythEksob", "postedAt": "2015-04-22T15:10:23.043Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Hey mhpage. I think these are reasonable sorts of questions that lots of people are likely to suggest, so it's good to tackle them straight away. My responses would be:</p>\n<ol>\n<li><p>Do you think that stealing from the rich is likely to be effective? It seems to me that it would probably lead you to get arrested and muck up your chances of helping for decades to come. At any rate, the idea that it would be compulsory would arise if you believed in 'utilitarianism' or had a related view that there are no 'supererogatory acts'. So that issue is central to those philosophies, rather than to effective altruism.</p>\n</li>\n<li><p>Effective altruists would be committed to the idea that it's a <a href=\"https://80000hours.org/earning-to-give/\">good way of helping people</a>, and they promote it. Whether there's any 'ethical compulsion' is something that people will vary on depending on their philosophies.</p>\n</li>\n<li><p>There are still reasons to focus on students, even for the trivial reason that some of them will be wealthy later. There's also other ways of helping than donating funds. And effective altruists are pretty interested in meeting high-net-worth individuals anyhow.</p>\n</li>\n</ol>\n", "parentCommentId": "LJ2TwKoiMnuycLXHB", "user": {"username": "RyanCarey"}}, {"_id": "5hB8cNx2daiCEDkqe", "postedAt": "2015-04-22T15:42:22.091Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Thanks, Ryan. The distinction between EA and utilitarianism is not one I've sufficiently focused on, and it's a useful one to bear in mind. (With that said, I do think there are effective ways certain people could steal from the rich and give to the poor -- e.g., hackers.)</p>\n", "parentCommentId": "bxzHB5G5mythEksob", "user": {"username": "mhpage"}}, {"_id": "SEbaoGceeRypuwvLn", "postedAt": "2015-04-22T19:17:39.466Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>If there were I'd expect them to be well-researched and discussed by non-altruists. I haven't heard of any, and would expect to have.</p>\n", "parentCommentId": "5hB8cNx2daiCEDkqe", "user": {"username": "Vincent_deB"}}, {"_id": "QhSP8pNCWZLRT5coZ", "postedAt": "2015-04-22T19:18:53.259Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>all of those Ivy league graduates who went to work in the charity industry were behaving unethically.</p>\n</blockquote>\n<p>It's better to say they were behaving suboptimally.</p>\n", "parentCommentId": "LJ2TwKoiMnuycLXHB", "user": {"username": "Vincent_deB"}}, {"_id": "vfPJE9z6Ci8eZ86Zb", "postedAt": "2015-04-22T22:35:07.215Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Vincent, your comment goes to the point I was trying to make. If a rich person has two options: (a) give money to charity; or (b) buy a yacht, and chooses (b), we (or at least I) don't say he is behaving sub-optimally but that he is behaving unethically. Putting aside whether the Ivy league grad would enjoy working for a charity more than working in finance, how is her choice any different from the rich person's choice? If she takes a job at a charity (assuming one for which she is entirely replaceable), rather than taking a job in finance and giving away half of her salary, she is effectively throwing away the money should could have made in finance rather than donating it to charity. How is that different than taking the job and buying a yacht? It seems intuitively different because her motives are different, but that's irrelevant if you're a consequentialist (which seems like part of EA's fabric).</p>\n<p>From a marketing perspective, I see why we don't want to encourage stealing (which I still think could be done in a utility-maximizing manner) or claims that charity-minded Ivy league grads are as bad as yacht-buying millionaires, but if the only reason we don't go there is for marketing reasons, that seems like a problem.</p>\n<p>As to why this is a critique: I worry that the marketing strategy for EA whitewashes how radical its underlying premise truly is: that we owe the same duty to someone across the world as we do to someone right in front of us. Fully embracing that premise can lead us to extraordinarily counterintuitive (and unpalatable for many) places.</p>\n", "parentCommentId": "QhSP8pNCWZLRT5coZ", "user": {"username": "mhpage"}}, {"_id": "sodxXAzaH8fcJiR6F", "postedAt": "2015-04-23T00:26:29.388Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>Imagine a man eating a feast with two dozen turkeys, and right next to him is a family full of starving children. If you could steal a turkey and give it to the family without anyone noticing, shouldn't you?</p>\n</blockquote>\n<p>No, because stealing is morally wrong in itself. Being an EA does not mean you have to endorse utilitarianism! (though some people do neglect the distinction). There are other aspects of morality, and respecting people's rights is one of them.</p>\n", "parentCommentId": "LJ2TwKoiMnuycLXHB", "user": {"username": "Larks"}}, {"_id": "cLjZajnrLYDWKdcJx", "postedAt": "2015-04-23T02:20:55.385Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>As to why this is a critique: I worry that the marketing strategy for EA whitewashes how radical its underlying premise truly is: that we owe the same duty to someone across the world as we do to someone right in front of us. Fully embracing that premise can lead us to extraordinarily counterintuitive (and unpalatable for many) places.</p>\n</blockquote>\n<p>That I agree with. Obscuring/whitewashing it may be tactically wise however, and I think there's been some posts here about whether EA really is consequentialist.</p>\n", "parentCommentId": "vfPJE9z6Ci8eZ86Zb", "user": {"username": "Vincent_deB"}}, {"_id": "h9sYoX9w2mBRsoWiT", "postedAt": "2015-04-23T18:06:38.763Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>EA is about (in part) extrapolating from what you would do in the near to what you should do in the far. The classic introduction hypothetical is the person drowning right in front of you. Most people's moral instincts are that they should suffer some costs to save the person's life. Ergo, they should suffer some costs to save starving people across the world.</p>\n<p>If you were to poll the world about whether people think it's right or wrong to steal one of the two dozen turkeys from the rich man and give it to the starving family, I suspect a sizable percentage would say it's right--or at least not wrong. You might not, but I hardly think that would be a rare response. My point is that extrapolating from that moral premise leads you to very counter-intuitive places.</p>\n", "parentCommentId": "sodxXAzaH8fcJiR6F", "user": {"username": "mhpage"}}, {"_id": "N4WpaoKC4SbzYMWXq", "postedAt": "2015-04-24T02:33:09.976Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Patri recently linked to a post that was basically written directly to EAs:</p>\n<p><a href=\"http://www.moreright.net/on-saving-the-world-and-other-delusions/\">On Saving the World and Other Delusions</a></p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "hTkiKTNACYhzA4pTG", "postedAt": "2015-06-24T08:47:42.240Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p><a href=\"https://jsteinhardt.wordpress.com/2014/01/05/another-critique-of-effective-altruism/\">This post</a> seems pretty good to me, although I don't agree with all of it.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "H3aBSiAEWzTiLMWdt", "postedAt": "2015-07-08T18:42:53.871Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>The Boston Review held a <a href=\"http://bostonreview.net/forum/peter-singer-logic-effective-altruism\">Forum on Effective Altruism</a> with some excellent criticism by academic, non-EAs.</p>\n", "parentCommentId": null, "user": {"username": "AABoyles"}}, {"_id": "KRFXenf89amhQpGew", "postedAt": "2015-08-22T18:43:35.633Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<blockquote>\n<p>But because typical renewable energy pays back the energy investment in about three years, if we just took the energy output of renewable energy and reinvested it, the amount of renewable energy production would grow at about 30% per year.</p>\n</blockquote>\n<p>How many scarce materials would be needed? How much land area? How much toxic waste would be produced, e.g. from solar elecontronic components? Energy investment is not the only input needed for renewables.</p>\n<p>(If you have a link that answers these and similar questions, that would be good.)</p>\n", "parentCommentId": "ZRdrEdq5kNcF5PQZg", "user": {"username": "DisposableUsername"}}, {"_id": "XuagTFscSeGMewBRL", "postedAt": "2016-03-03T14:08:19.768Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Thanks for the good questions. Wind power can use scarce materials, like rare earth permanent magnet generators. But it is possible just to use copper. Some photovoltaic technologies use scarce materials, but silicon is abundant.\nUS per person primary energy use is ~10 kW: Energy Information Administration. “Annual Energy Review 2007.” If we start with renewable electricity, we need less primary energy, 4-8 kW, so say 6 kW. So 10 billion people require 60 trillion watts (TW). Current wind technology could provide 72 TW: Archer, C. and M. Jacobson. “Evaluation of global wind power.” JOURNAL OF GEOPHYSICAL RESEARCH, VOL. 110, D12110, doi:10.1029/2004JD005462, 2005. Solar maximum on land is ~6,000 TW, but practical ~600 TW: Lewis, N.S. “Powering the Planet” California Institute of Technology presentation. If solar is 10% efficient and average solar radiation is 200 W/square meter, this requires ~0.1 acre/person: 5% of <a href=\"https://en.wikipedia.org/wiki/Ecological_footprint\">ecological footprint</a> quota, but could be in desert or on rooftops.\nOf course we need to be careful with toxic waste, but landfills take up a negligible amount of land.</p>\n", "parentCommentId": "KRFXenf89amhQpGew", "user": {"username": "Denkenberger"}}, {"_id": "kBoL5BPMHMDmfxEF4", "postedAt": "2016-12-24T09:25:23.454Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>I think that you dismiss the critiques of Moyo and Easterly to quickly.  They are critiques of top down aid, which EA is a champion of.  Easterly in particular is critical of organizations which plan without understanding or asking the needs of the communities.  Yes, this means that more research is needed, but of a drastically different kind.  The problem with allowing organizations to assess themselves, is that they will not look for faults that they know exist.  AMF, for example, stops testing communities for malaria after the lifespan of the donated nets run out, since this would demonstrate how ineffective their programs are.  The problem is that currently EA is convinced they are doing sufficient research to identify top charities when the charities that they promote (like AMF) are not merely ineffective, they are actively doing more harm than good.  You want a critique of the methods of EA for assessing effective charities, <a href=\"https://www.youtube.com/watch?v=cmzTAJUspc8\">here it is</a></p>\n", "parentCommentId": null, "user": {"username": "carneades"}}, {"_id": "pG2QX2PuQfDKKyiNg", "postedAt": "2021-02-22T16:45:19.030Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>Running across this post quite a few years later, but <a href=\"https://forum.effectivealtruism.org/posts/m65rH3D3pfJzsBMfW/the-upper-limit-of-value\">our paper on the upper limit of value</a> &nbsp;addresses this incommensurability a bit, and cites Chang's \"Incomparability and practical reason\" which (we feel) addresses this fairly completely.<br><br>Secondarily, Mobiot's claim isn't really incommensurability, it's that those with power (mostly economic power,) value things he cares about too little, that the environment, which is a public good, is underprotected by markets, and that humanity isn't cautious enough of the environmental risks. &nbsp;All reasonable points, but not really incommensurability.</p>", "parentCommentId": "t7H2j2GtWBz4nTuaj", "user": {"username": "Davidmanheim"}}, {"_id": "bq3Kvjf3mWRNNogx9", "postedAt": "2021-02-22T16:54:31.084Z", "postId": "B3fYvmwJLRiDeM6Cd", "htmlBody": "<p>But you can still have a partial ordering for incommensurable goods - if the natural world is incommensurable with money, you can have states that are strictly worse/better, as well as incommensurable ones. And that still isn't neutral - it's better and worse on different dimensions.</p>", "parentCommentId": "KrTDe6Li9Y6tx94Ed", "user": {"username": "Davidmanheim"}}]