[{"_id": "cFJYQRmPRzTNX9dKK", "postedAt": "2022-09-21T18:13:33.172Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>A summary, you say..<br><br><i>(I like summaries)</i></p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "g8chrPmAbbmiaH6oA", "postedAt": "2022-09-21T18:27:44.887Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>A concept this reminds me of \"Cheems<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref3mk4x9wq11q\"><sup><a href=\"#fn3mk4x9wq11q\">[1]</a></sup></span>&nbsp;mindset\". This is the notion that many people just want to say why things will fail in order to justify why they don't have to try.<br><br>I'm not sure if this is a useful concept (upvote downvote). I guess I think that something might inspire these people to change their minds, but right now they neither agree nor disagree and aren't doing much.&nbsp;<br><br>I also link this to <a href=\"https://en.wikipedia.org/wiki/The_Myth_of_the_Rational_Voter\"><i>The Myth of the Rational Voter</i></a><i> </i>which suggests that people are rationally irrational. In this example. The readers of the New York Times have a lived experience that not much changes and that most grand plans fail. Of course William MacAskill will not be sucessful. It's very cheap to say so, since they don't deep down expect that to affect anything.<br><br>From <a href=\"https://normielisation.substack.com/p/cheems-mindset\">https://normielisation.substack.com/p/cheems-mindset</a>:&nbsp;</p><blockquote><p>To be clear, cheems mindset isn’t arguing that a policy is a bad idea because it leads to bad outcomes. A policy like rent control is bad <a href=\"https://www.adamsmith.org/blog/rent-control-increases-rents\">because it leads to lower supply of rental properties and increases prices outside the rent controlled area</a>. On that basis, it would not be cheems mindset to oppose it.</p><p>Instead, cheems mindset is automatically dismissing an idea on the basis that it cannot be done, or would be hard to do- it would be cheems mindset to oppose introducing rent control legislation because you were worried about staffing levels in [the housing department], for example.</p></blockquote><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn3mk4x9wq11q\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref3mk4x9wq11q\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The two most famous internet dogs two Shiba Inus who the intnet names Doge and Cheems. Doge (Dogecoin, much wow etc) is brave and strong. Cheems is cowardly and useless.<br><br><img src=\"https://i.kym-cdn.com/photos/images/newsfeed/001/854/302/8ec.jpg\"></p><p>I would resize this image if I could. And yes, I know the image resize option exists. But it isn't actually resizing.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "XFW6H6B3w6dRp99gi", "postedAt": "2022-09-21T20:16:23.721Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>People should do shit like this more often!</p>", "parentCommentId": null, "user": {"username": "One-time pad"}}, {"_id": "j5W6zZ6t39dpGhCbp", "postedAt": "2022-09-21T20:18:54.068Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>I saw the 6 \"Animals matter too\". I am really glad they raised this. (but could they be EAs? I mean some of them seem certainly not EAs judging from their content, but they could fake it)</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "jxTGFNQZrWBZSzbPX", "postedAt": "2022-09-21T22:23:12.043Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>This reinforces a thought I've had for quite a while: the main advantage of EA is the optimism it brings, and the messaging should incorporate that optimism. \"See all these problems in the world? Let's fix them. seriously. Come join us\"</p>\n", "parentCommentId": null, "user": {"username": "Bary Levi"}}, {"_id": "hBnHvq7XvFXfb8a75", "postedAt": "2022-09-22T03:07:08.832Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>Techno pessimism is trendy, snark is trendy, climate doomerism is trendy. There’s also a time honored tradition of using newspaper comment boards specifically for complaining, which predates digital papers (see: letters to the editor). I’d be hard pressed to find anything that moves far off that base rate.</p>\n<p>That said, I expected 60/40 positive to negative. This is a super helpful way to see sentiment at a glance and I’d be so excited to see a compilation extended across other articles (ex: the negative Salon piece) and maintained over time.</p>\n", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "wPYwRYDQuxcqNPezN", "postedAt": "2022-09-22T03:09:40.365Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>Many EAs think there’s a large chance of extinction by 2100, so it’s a qualified optimism at most. Not to rain on your parade - I feel optimism that EA exists and it’s my own optimism that drew me to EA.</p>\n", "parentCommentId": "jxTGFNQZrWBZSzbPX", "user": {"username": "Emily Dardaman"}}, {"_id": "v5Y5R3rNTfNJkuCEH", "postedAt": "2022-09-22T07:40:05.997Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>I'm not sure if I expected more positive comments. Some of the comments certainly disagree heavily (\"ivory tower BS\", \"future people don't matter\"), but most of the skeptical clusters don't seem to fundamentally disagree with longtermism. Maybe learned helplessness (or Cheems mindset, sure), or something akin to a filter bubble where you learn about global problems but are not exposed to the (admittedly) fringe approaches to solving them. The climate movement is, for example, very good at spreading doom despite a non-catastrophic outlook. I wonder how much future optimism/progress propaganda à la OWID would help to move the opinion of young, liberal, academic people</p>", "parentCommentId": null, "user": {"username": "JasperGeh"}}, {"_id": "4YAizbymcZ7o6GaYP", "postedAt": "2022-09-22T16:37:58.228Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>That's a great point. This probably says as much about the psychology of news commenters as it does opinions about longtermism. Comparing comments of different articles would be great for understanding the bias of each. But ultimately, the important messaging questions are probably best answered with proper surveys.</p>", "parentCommentId": "hBnHvq7XvFXfb8a75", "user": {"username": "Westward"}}, {"_id": "tHHomKws6zWCZugSP", "postedAt": "2022-09-23T22:29:27.745Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>Nice!</p>\n<p>Most of the sceptic ideas look quite good to me, except for the doomerism.</p>\n<p>These really made me chuckle:</p>\n<blockquote>\n<ul>\n<li>1 - This idea is un-American</li>\n<li>1 - This is all the fault of boomers</li>\n<li>1 - Stop blaming boomers</li>\n</ul>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "Xf5xNdafjvPPCkMQo", "postedAt": "2022-09-24T14:29:23.021Z", "postId": "b4wJcm2LaWCjsKswF", "htmlBody": "<p>The problem here is that crisis and things going wrong dominates the news, and even if all the stories are true and unbiased (Which is at least weakly the case for the mainstream media.), you will still be horribly wrong about what things matter more, or the prevalence of things going wrong.</p>\n<p>Combine this with non-prioritization of crisis, and the doomerism bias explains itself.</p>\n", "parentCommentId": "tHHomKws6zWCZugSP", "user": {"username": "Sharmake"}}]