[{"_id": "5HSJjA8xkCGJGH8gw", "postedAt": "2014-09-17T06:49:07.355Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>We live during the hinge of history. Given the scientific and technological discoveries of the last two centuries, the world has never changed as fast. We shall soon have even greater powers to transform, not only our surroundings, but ourselves and our successors. If we act wisely in the next few centuries, humanity will survive its most dangerous and decisive period. Our descendants could, if necessary, go elsewhere, spreading through this galaxy.</p>\n</blockquote>\n<p>Derek Parfit, <em>On What Matters</em>, vol. 2, Oxford, 2011, p. 616</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "h5yBYTHE8xdZEggvZ", "postedAt": "2014-09-17T06:51:31.703Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>Why do we save the larger number? Because we give equal weight to saving each. Each counts for one. That is why more count for more.</p>\n</blockquote>\n<p>Derek Parfit, 'Innumerate Ethics', <em>Philosophy &amp; Public Affairs</em>, vol. 7, no. 2, p. 301</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "i4fgEk6vwkikpP89v", "postedAt": "2014-09-17T06:53:47.638Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>Lay off with the ‘You reason, so you don’t feel’ stuff, please. I feel, but I also think about what I feel. When people say we should only feel […] I am reminded of Göring, who said ‘I think with my blood.’ See where it led him.</p>\n</blockquote>\n<p>Peter Singer, ‘Reflections’, in J. M. Coetzee, <em>The Lives of Animals</em>, Princeton, 1999, p. 89</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "XwcF9igJsvX9HhfKu", "postedAt": "2014-09-17T06:54:40.262Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>My students often ask me if I think their parents did wrong to pay the $44,000 per year that it costs to send them to Princeton. I respond that paying that much for a place at an elite university is not justified unless it is seen as an investment in the future that will benefit not only one’s child, but others as well. An outstanding education provides students with the skills, qualifications, and understanding to do more for the world than would otherwise be the case. It is good for the world as a whole if there are more people with these qualities. Even if going to Princeton does no more than open doors to jobs with higher salaries, that, too, is a benefit that can be spread to others, as long as after graduating you remain firm in the resolve to contribute a percentage of that salary to organizations working for the poor, and spread this idea among your highly paid colleagues. The danger, of course, is that your colleagues will instead persuade you that you can’t possibly drive anything less expensive than a BMW and that you absolutely must live in an impressively large apartment in one of the most expensive parts of town.</p>\n</blockquote>\n<p>Peter Singer, <em>The Life You Can Save: Acting Now to End World Poverty</em>, London, 2009, pp. 138-139</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "DRWMFFav7BWwqMgbs", "postedAt": "2014-09-17T09:11:09.097Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>Relevant, from a recent article by Steven Pinker entitled <a href=\"http://www.newrepublic.com/article/119321/harvard-ivy-league-should-judge-students-standardized-tests\">The Trouble With Harvard</a>: </p>\n<blockquote>\n<p>It’s true that many off-brand institutions in the matchless American university system are bargains. The honors program of a 50,000-student campus is likely to have an aggregation of talent that rivals that of the Ivies. Liberal-arts colleges in the boondocks, with their paucity of non-academic diversions, can nurture a student culture that is more engaged with ideas and books. The PhD glut has sent brilliant scientists and humanists into every outpost of the academic archipelago. And in many fields the best programs are at lesser-known universities, which can nimbly expand into new intellectual frontiers while their Ivy League counterparts, stultified by tradition and cushioned by reputation, become backwaters.</p>\n</blockquote>\n<blockquote>\n<p>Still, there are no grounds for the sweeping pronouncements about the virtues of non-Ivy students (“more interesting, more curious, more open, and far less entitled and competitive”) that Deresiewicz prestidigitates out of thin air. It’s these schools, after all, that are famous for their jocks, stoners, Bluto Blutarskys, gut-course-hunters, term-paper-downloaders, and majors in such intellectually challenging fields as communications, marketing, and sports management. In another use of the argument “If I say it, it’s true,” Deresiewicz decrees that obscure religious colleges “do a much better job” in teaching their students “how to think,” and that they “deliver a better education, in the highest sense of the word” than elite universities—and then, breathtakingly, elevates an assertion that was based on nothing but his say-so (and that is almost certainly false) into an “indictment of the Ivy League and his peers.</p>\n</blockquote>\n<blockquote>\n<p>But the biggest problem is that the advice in Deresiewicz’s title is perversely wrongheaded. If your kid has survived the application ordeal and has been offered a place at an elite university, don’t punish her for the irrationalities of a system she did nothing to create; by all means send her there! The economist Caroline Hoxby has shown that selective universities spend twenty times more on student instruction, support, and facilities than less selective ones, while their students pay for a much smaller fraction of it, thanks to gifts to the college. Because of these advantages, it’s the selective institutions that are the real bargains in the university marketplace. Holding qualifications constant, graduates of a selective university are more likely to graduate on time, will tend to find a more desirable spouse, and will earn 20 percent more than those of less selective universities—every year for the rest of their working lives. These advantages swamp any differences in tuition and other expenses, which in any case are often lower than those of less selective schools because of more generous need-based financial aid. The Ivy admissions sweepstakes may be irrational, but the parents and teenagers who clamber to win it are not.</p>\n</blockquote>\n", "parentCommentId": "XwcF9igJsvX9HhfKu", "user": {"username": "RyanCarey"}}, {"_id": "5B5wGHiAHxRJPwkJP", "postedAt": "2014-09-17T09:31:38.694Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>&quot;In view of the fact that in any future world war nuclear weapons will certainly be employed, and that such weapons threaten the continued existence of mankind, we urge the Governments of the world to realize, and to acknowledge publicly, that their purpose cannot be furthered by a world war, and we urge them, consequently, to find peaceful means for the settlement of all matters of dispute between them.&quot; - <a href=\"http://www.umich.edu/~pugwash/Manifesto.html\">The Russel-Einstein Manifesto</a></p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "TwXs7JnJw26bg7ScA", "postedAt": "2014-09-17T09:54:25.197Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>We should reward the charities that we believe do the most good, not those that have the best marketing strategy, otherwise the most successful charities will be those that are best at soliciting funds, not those that are best at making the world a better place.</p>\n</blockquote>\n<p><a href=\"http://qz.com/250845/this-week-lets-dump-a-few-ice-buckets-to-wipe-out-malaria-too/\">William MacAskill</a></p>\n", "parentCommentId": null, "user": {"username": "HelenToner"}}, {"_id": "CmWTw7eATCjtzbF57", "postedAt": "2014-09-17T10:01:38.398Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>A contrasting note on the limits of instrumental rationality (which Adorno thought led to the holocaust):</p>\n<p>&quot;Bourgeois society is ruled by equivalence. It makes the dissimilar comparable by reducing it to abstract quantities. To the enlightenment, that which does not reduce to numbers, and ultimately to the one, becomes illusion.&quot;</p>\n<p>Adorno, Dialectic of Enlightenment (Cummings trans.), p.7</p>\n", "parentCommentId": "i4fgEk6vwkikpP89v", "user": {"username": "Geuss"}}, {"_id": "iXxabuwBtNYkLuMzc", "postedAt": "2014-09-17T10:04:05.802Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>&quot;Though he has made a swift ascent of the ivory tower, Bostrom didn’t always aspire to a life of the mind. ‘As a child, I hated school,’ he told me. ‘It bored me, and, because it was my only exposure to books and learning, I figured the world of ideas would be more of the same.’ Bostrom grew up in a small seaside town in southern Sweden. One summer’s day, at the age of 16, he ducked into the local library, hoping to beat the heat. As he wandered the stacks, an anthology of 19th century German philosophy caught his eye. Flipping through it, he was surprised to discover that the reading came easily to him. He glided through dense, difficult work by Nietzche and Schopenhauer, able to see, at a glimpse, the structure of arguments and the tensions between them. Bostrom was a natural. ‘It kind of opened up the floodgates for me, because it was so different than what I was doing in school,’ he told me.</p>\n<p>But there was a downside to this epiphany; it left Bostrom feeling as though he’d wasted the first 15 years of his life. He decided to dedicate himself to a rigorous study programme to make up for lost time. At the University of Gothenburg in Sweden, he earned three undergraduate degrees, in philosophy, mathematics, and mathematical logic, in only two years. ‘For many years, I kind of threw myself at it with everything I had,’ he told me.&quot;</p>\n<p>Ross Anderson's piece in Aeon on Bostrom (2013).</p>\n<p>It reminds me of and inspires myself; I was politicised at a similar period, and always feel like I'm 'catching up'.</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "SRaWC8iNyQxr7db9X", "postedAt": "2014-09-17T10:56:41.896Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>The following quote from Thomas Mann's <a href=\"http://en.wikipedia.org/wiki/The_Magic_Mountain\"><em>The Magic Mountain</em></a>, is not an Effective Altruist quote in the narrow sense, but it exhibits a spirit that is similar to that of the EA movement. I find Mann's slightly ironizing depiction of a certain kind of didacting rationalist both amusing and spot on.</p>\n<p><em>The Magic Mountain</em> is viewed as one of the greatest 20th century novels on the theme of progressive rationalism vs conservative irrationalism. I much recommend it.</p>\n<blockquote>\n<p>Herr Settembrini had delivered a private lecture, almost whispered it into his ear, with his back to the rest of the people in the room; it had been so pointed, so unsocial, so little conversable in its nature, that merely to command its eloquence seemed lacking in tact. One does not tell a schoolmaster that he has expressed himself well. Hans Castorp, indeed, had done so once or twice in the early days of their acquaintance, probably from an instinct to preserve the social equilibrium; but the humanist's utterances had  never before reached quite such a didacting pitch. There was nothing for it but to pocket the admonition, feeling as embarrassed as a schoolboy at so much moralizing. Moreover, one could see by Herr Settembrini's expression that he had not finished his train of thought. He still stood so close to Hans Castorp that the young man was constrained to bend a little backwards; and his black eyes gazed fixedly into the other's face.</p>\n</blockquote>\n<blockquote>\n<p>&quot;You suffer, Engineer,&quot; he went on. &quot;You are like one distraught - who could help seeing it? But your attitude could be a European attitude; it should not be the oriental, which in its soft abandonment inclines so readily to seek this spot. The oriental attitude toward suffering is one of pity and a boundless patience - that cannot, it ought not to be ours, to be yours! - Look - we were speaking of what the post had brought us, look at these! Or better, come with me, it is impossible here - let us withdraw, and I will disclose to you certain matters. Come with me!&quot;</p>\n</blockquote>\n<p>...</p>\n<blockquote>\n<p>&quot;These papers&quot;, he said, &quot;bear the stamp, in French, of the International League for the Organization of Progress. I have them from Lugano, where there is an office of a branch of the League. You inquire after its principles, its scope? The League for the Organization of Progress deduces from Darwinian theory the philosophic concept that man's profoundest natural impulse is in the direction of self-realization. From this it follows that all those who seek satisfaction of this impulse must become co-labourers in the cause of human progress. Many are those who have responded to the call; there is a considerable membership, in France, Italy, Spain, Turkey, and in Germany itself. I myself have the honour of having my name inscribed on the roll. A comprehensive and scientifically executed programme has been drawn up, embracing all the projects for human improvement conceivable at the moment. We are studying the problem of our health as a race, and the means for combating the degeneration which is a regrettable accompanying phenomenon of our increasing industrialization. The League envisages the founding of universities for the people, the resolution of the class conflict by means of social ameliorations which recommend themselves for the purpose, and finally the doing away with national conflicts, the abolition of war through the development of international law. You perceive that the objects toward which the League directs its efforts are ambitious and broad in their scope. Several international periodicals are evidence of its activities - monthly reviews, which contain articles in three or four languages on the subject of the progressive evolution of civilized humanity. Numerous local groups have been established in the various countries; it is expected that they will exert an edifying and enlightening influence by means of discussion evenings and appropriate Sunday observances. Above all, the League will strive its utmost to aid with the material at its disposal the political party of progress in every country. You follow me, Engineer?&quot;</p>\n</blockquote>\n<blockquote>\n<p>Herr Settembrini appeared satisfied. &quot;I assume that these are new and surprising ideas to you?&quot;</p>\n</blockquote>\n<blockquote>\n<p>&quot;Yes, I confess this is the first time I have heard of these - these endeavours.&quot;</p>\n</blockquote>\n<blockquote>\n<p>&quot;Ah, Settembrini murmured, &quot;ah, if you had only heard of them earlier! But perhaps it is not yet too late. These circulars - you would like to know what they say? Listen.</p>\n</blockquote>\n<p>...</p>\n<blockquote>\n<p>[T]he League for the Organization of Progress, mindful of its task of furthering human happiness - in other words, of combating human suffering by the available social methods, to the end of finally eliminating it altogether; mindful also of the fact that this lofty task can only be accomplished by the aid of sociology, the end and aim of which is the perfect State, the League, in session at Barcelona, determined upon the publication of a series of volumes bearing the  general title <em>The Sociology of Suffering</em>. It should be the aim of the series to classify human suffering according to classes and categories, and to treat it systematically and exhaustively. You ask what is the use of classification, arrangement, systematization? I answer you: order and simplification are the first steps toward the mastery of a subject - the actual enemy is the unknown. We must lead the human race up out of the primitive stages of fear and patient stupidity, and set its feet on the path of conscious activity. We must enlighten it upon two points: first, that given effects become void when one first recognizes and then removes their causes; and second, that almost all individual suffering is due to disease of the social organism. Very well; this is the object of the <em>Sociological Pathology</em>. It will be issued in some twenty folio volumes, treating every species of human suffering, from the most personal and intimate to the great collective struggles arising from the conflicting interests of classes and nationals; it will, in short, exhibit the chemical elements whose combination in various proportions results in all the ills to which our human flesh is heir. The publication will in every case take as its norm the dignity and happiness of mankind, and seek to indicate the measures and remedies calculated to remove the cause of each deviation. Famous European specialists, physicians, psychologists, and economists will share in the composition of this encyclopedia of suffering, and the general editorial bureau at Lugano will act as the reservoir to collect all the articles which shall flow into it.&quot;</p>\n</blockquote>\n<p>Thomas Mann, <em>The Magic Mountain</em>, London 1924/1999, pp. 243-246.</p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "CwCs52yeMjpPdrxcq", "postedAt": "2014-09-17T12:48:56.560Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>I always feel like I'm catching up too.</p>\n<p><a href=\"http://aeon.co/magazine/philosophy/ross-andersen-human-extinction/\">Link to the article, for the lazy</a></p>\n", "parentCommentId": "iXxabuwBtNYkLuMzc", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "kJToXvoPc4BugBcnj", "postedAt": "2014-09-17T12:55:48.720Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p><strong>Oskar Schindler</strong>: I could have got more out. I could have got more. I don't know. If I'd just... I could have got more.</p>\n<p><strong>Itzhak Stern</strong>: Oskar, there are eleven hundred people who are alive because of you. Look at them.</p>\n<p><strong>Oskar Schindler</strong>: If I'd made more money... I threw away so much money. You have no idea. If I'd just...</p>\n<p><strong>Itzhak Stern</strong>: There will be generations because of what you did.</p>\n<p><strong>Oskar Schindler: I didn't do enough!</strong></p>\n<p><strong>Itzhak Stern</strong>: You did so much.</p>\n<p>[Schindler looks at his car]</p>\n<p><strong>Oskar Schindler</strong>: This car. Goeth would have bought this car. Why did I keep the car? Ten people right there. Ten people. Ten more people.</p>\n<p>[removing Nazi pin from lapel]</p>\n<p><strong>Oskar Schindler</strong>: This pin. Two people. This is gold. Two more people. He would have given me two for it, at least one. One more person. A person, Stern. For this.</p>\n<p>[sobbing]</p>\n<p><strong>Oskar Schindler</strong>: I could have gotten one more person... and I didn't! And I... I didn't!</p>\n<p><a href=\"http://www.imdb.com/title/tt0108052/quotes?item=qt0234852\"><em>Schindler's List</em>, (1993)</a></p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "s9PfFXSDcvAmyWoPZ", "postedAt": "2014-09-17T13:57:55.592Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>I think most of the people who would upvote this quote would not argue that it portrays a mindset that EAs are lacking (they don't need don't more guilt as it is generally unhelpful) but because they're appreciating that it's tragic.</p>\n", "parentCommentId": "kJToXvoPc4BugBcnj", "user": {"username": "RyanCarey"}}, {"_id": "mpYwixEnNs2F5ngmk", "postedAt": "2014-09-17T15:07:14.376Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<p>Exactly. It reminds me of <a href=\"http://www.givinggladly.com/2013/06/cheerfully.html\">Cheerfully</a> in that Schindler does exactly what Cheerfully says you shouldn't do. I think the trait worth imitating here isn't the guilt, but the deep sense of caring and desire to do everything possible.</p>\n", "parentCommentId": "s9PfFXSDcvAmyWoPZ", "user": {"username": "MichaelDickens"}}, {"_id": "bWJZA3fGAEcQsiwje", "postedAt": "2014-09-17T15:56:15.537Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>I was raised Catholic. On my eighth birthday, having received my first communion about a year prior, I casually asked my priest how to reaffirm my faith and do something for the Lord. The memory is fuzzy, but I think I donated a chunk of allowance money and made a public confession at the following mass.</p>\n</blockquote>\n<blockquote>\n<p>A bunch of the grownups made a big deal out of it, as grownups are like to do. ‘Faith of a child’, and all that. This confused me, especially when I realized that what I had done was rare. I wasn’t trying to get pats on the head, I was appealing to the Lord of the Heavens and the Earth. Were we all on the same page, here? This was the creator. He was infinitely virtuous, and he had told us what to do.</p>\n</blockquote>\n<blockquote>\n<p>And yet, everyone was content to recite hymns once a week and donate for the reconstruction of the church. What about the rest of the world, the sick, the dying? Where were the proselytizers, the missionary opportunities? Why was everyone just sitting around?</p>\n</blockquote>\n<blockquote>\n<p>On that day, I became acquainted with civilizational inadequacy. I realized you could hand a room full of people the literal word of God, and they’d still struggle to pay attention for an hour every weekend.</p>\n</blockquote>\n<p>From: <a href=\"http://lesswrong.com/lw/jl3/on_saving_the_world/\">&quot;On Saving the World&quot;</a> by Nate Soares.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "gBRRawdAop4HdjjjB", "postedAt": "2014-09-17T20:42:43.842Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>&quot;The secret to happiness: Find something more important than you are and dedicate your life to it.&quot;</p>\n</blockquote>\n<p>Dan Dennett - <a href=\"https://www.youtube.com/watch?v=KzGjEkp772s\">TED talk</a></p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "RPidnrPMjdhJ373nx", "postedAt": "2014-09-17T20:47:21.666Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>Love and knowledge, so far as they were possible, led upward toward the heavens. But always pity brought me back to earth. Echoes of cries of pain reverberate in my heart. Children in famine, victims tortured by oppressors, helpless old people a burden to their sons, and the whole world of loneliness, poverty, and pain make a mockery of what human life should be. I long to alleviate this evil, but I cannot, and I too suffer.</p>\n</blockquote>\n<p>Bertrand Russell - <a href=\"http://www.humanities.mcmaster.ca/~bertrand/misc.html\">What I have lived for</a></p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "DuHGWKRKTE33egmnz", "postedAt": "2014-09-17T20:52:55.804Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>We should probably divide people into more than one plane, to prevent existential risk. </p>\n</blockquote>\n<p>Anna Salamon - about one of the first distance travels between the Berkeley hub of effective altruism and the Oxford one. Aprox 2011. </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "S6irx6ajNSh2vgef3", "postedAt": "2014-09-18T00:50:21.484Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>What about the rationalization that charitable extracurricular activities teach kids important lessons of moral engagement? There are reasons to be skeptical. A skilled professional I know had to turn down an important freelance assignment because of a recurring commitment to chauffeur her son to a resumé-building “social action” assignment required by his high school. This involved driving the boy for 45 minutes to a community center, cooling her heels while he sorted used clothing for charity, and driving him back—forgoing income which, judiciously donated, could have fed, clothed, and inoculated an African village. The dubious “lessons” of this forced labor as an overqualified ragpicker are that children are entitled to treat their mothers’ time as worth nothing, that you can make the world a better place by destroying economic value, and that the moral worth of an action should be measured by the conspicuousness of the sacrifice rather than the gain to the beneficiary.</p>\n</blockquote>\n<p>-- Steven Pinker, <a href=\"http://www.newrepublic.com/article/119321/harvard-ivy-league-should-judge-students-standardized-tests\">&quot;The Trouble With Harvard&quot;</a></p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "aN7sRKEJvtzF9YsKZ", "postedAt": "2014-09-18T06:19:15.892Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>Charity ain’t giving people what you wants to give, It’s giving people what they need to get.</p>\n</blockquote>\n<p>-Terry Pratchett, &quot;Hogfather&quot;</p>\n", "parentCommentId": null, "user": {"username": "Erica_Edelman"}}, {"_id": "RiRiNfhbGHJnQeEx9", "postedAt": "2014-10-02T06:25:33.012Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>Be brave and valiant agents of reason and kindness</p>\n</blockquote>\n<p>-Critch (from CFAR!)</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "DGhmgCFoJoHoL29dz", "postedAt": "2017-03-30T10:17:50.249Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>Philosophy would attain to perfection when the mechanical labourers shall have philosophical heads, or the philosophers shall have mechanical hands.</p>\n</blockquote>\n<p>Thomas Spratt, <em>History of the Royal Society of London</em></p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "yF7ZLuZyBv7SjQAeG", "postedAt": "2017-04-10T15:25:10.566Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote>\n<p>&quot;Unrestricted altruism is not so common that we can afford to fritter it away on a plethora of feel-good projects of suboptimal efficacy.&quot; </p>\n</blockquote>\n<p>Nick Bostrom, <a href=\"http://www.existential-risk.org/concept.html\">Existential Risk Prevention as Global Priority</a></p>\n", "parentCommentId": null, "user": {"username": "MaxRa"}}, {"_id": "CuMaCa8CAW4AJ8ddv", "postedAt": "2021-08-02T18:17:46.250Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote><p>I love these nature shows. I'll watch any kind of nature show. And it's amazing how you can always relate to whatever they're talking about. You know, like, you're watching the African dung beetle and you're going, \"Boy, his life is a lot like mine.\" And you always root for whichever animal is the star of the show that week. Like, if it's the antelope, and there's a lion chasing the antelope, you'll go, \"Run, antelope, run! Use your speed. Get away.\" Then next week, it's the lion and then you're going, \"Get the antelope. Eat him. Bite his ass! Trap him. Don't let him use his speed.\"</p><p>— <a href=\"https://tvquot.es/seinfeld/quote/39hiu7dr/?fbclid=IwAR0gTWnfA6wNw_GjnN44FZcdIYlGRmEvY68HQCfyhU8b_1FXbiz5KI3GCGY\">Jerry Seinfeld</a></p></blockquote>", "parentCommentId": null, "user": {"username": "aarongertler"}}, {"_id": "TAxmBwAsky2PG4bNT", "postedAt": "2022-01-06T20:09:08.691Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote><p>In the sphere of secular politics, a sober-minded philanthropist gradually learns to divide into three classes the reforms which he is anxious to bring about: those which he can begin to carry out himself, trusting to the direct effect of his individual energy and the indirect influence of his example; those which it is worthwhile to attempt, if a sufficiently powerful private organization can be set on foot; and those which necessitate the intervention of the State, and, consequently, a great stirring of the public mind on the subject.</p></blockquote><p>— Henry Sidgwick, <a href=\"https://www.google.com/books/edition/The_Ethics_of_Conformity_and_Subscriptio/c0wOAAAAYAAJ?hl=en&amp;gbpv=0\">The Ethics of Conformity and Subscription</a></p>", "parentCommentId": null, "user": {"username": "aarongertler"}}, {"_id": "Qw26TjArNGp9MrmYb", "postedAt": "2022-10-02T07:11:24.882Z", "postId": "B57HTYam9yi7p67nd", "htmlBody": "<blockquote><p>\"As the area of our knowledge grows, so does the perimeter of our ignorance.\"</p></blockquote><p><a href=\"https://www.masterclass.com/classes/neil-degrasse-tyson-teaches-scientific-thinking-and-communication/chapters/the-frontier-of-science\">Neil DeGrasse Tyson</a></p>", "parentCommentId": null, "user": {"username": "Happydeb"}}]