[{"_id": "SWvSqrbiaanseehGT", "postedAt": "2022-12-23T00:01:25.284Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>The first place I hit a wall with this post was when you said that climate change, unlike pandemics, is demonstrably killing people today. That’s clearly just not true, and it makes me not feel eager to continue reading because it’s just such a clearly wrong statement.</p>\n", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "btsuNYEh6296w7aQ4", "postedAt": "2022-12-23T02:09:51.829Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<blockquote><p>The problem is that spending is dominated by a narrow focus on technical solutions, including carbon capture, improving currently existing energy technologies and infrastructure, and the clean energy transition.</p></blockquote><p>Just to clarify: As far as I can tell, the money is mostly <i>not</i> spent on developing technologies and e.g. carbon capture development is a tiny fraction of spend. Rather it's mostly going towards deploying technologies we already have (which is rather different). My guess is that climate change is more neglected than the $640 billion figure suggests if you focus on \"what technologies would be most impactful to develop?\".</p><blockquote><p>the widely marketed message that we can ‘technology’ our way out of the climate crisis is misleading, and highly improbable.</p></blockquote><p>It seems like the options are \"develop and deplwoy the technology\" or \"convince everyone on Earth to take a massive lifestyle hit\", and the latter just seems implausible to me (as well as undesirable)?</p><blockquote><p>annual deaths related to fuel combustion alone (i.e., outside air pollution) are estimated to be 8.7 million</p></blockquote><p>This is not the same thing as climate change, and would be happening even if e.g. we had perfect carbon capture. So seems wrong to lump these in together?</p><blockquote><p>One approach I have not seen addressed in EA fund literature and offers the potential to be a game-changer, is degrowth. The principles of degrowth&nbsp;critique the global capitalist system which pursues growth at all costs, resulting in human exploitation and ecological destruction.</p></blockquote><p>I can only speak for myself, but degrowth seems (1) politically untenable (as noted above), and (2) requires that people accept much lower living standards. That seems bad to me? I generally want people to have higher living standards, not lower.</p>", "parentCommentId": null, "user": {"username": "Adam Jermyn"}}, {"_id": "wynZF6SZgWsGH2qxy", "postedAt": "2022-12-23T18:36:15.897Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>Thank you Adam for your response.<br><br>My guess is that climate change is more neglected than the $640 billion figure suggests if you focus on \"what technologies would be most impactful to develop?\".<br><br><i>You may be right. Funding for clean energy projects, R&amp;D supporting the commercialization of new technologies (From the World Economic Forum: \"About 60% of </i><a href=\"https://www.iea.org/articles/etp-clean-energy-technology-guide\"><i><u>400 technologies listed by the International Energy Agency as key to carbon neutrality</u></i></a><i> globally aren’t yet commercially available\"), &nbsp;and supporting investment in the infrastructure needed to support those new technologies (i.e. supply chains, storage, transportation, etc.) &nbsp;does appear to be a major focus of spending though.</i><br>&nbsp;</p><p>It seems like the options are \"develop and deplwoy the technology\" or \"convince everyone on Earth to take a massive lifestyle hit\", and the latter just seems implausible to me (as well as undesirable)?<br><br><i>This is what people most frequently react to when discussing degrowth. To clarify, degrowth does not imply \"everyone on earth.\" There is a distinction to be made between the affluent global north (the primary source of environmental impact) where consumption is excessive, and the global south where development is still needed to create an equitable living standard. And while there is certainly more research to be done on how to practically implement a degrowth methodology (thus the need for funding), there is existing research which indicates a \"comfortable\" life style could still be possible under this approach. &nbsp;There is no doubt the paradigm shift required is significant. But the same could have been said for woman's suffrage, labor unions, and civil rights at different points in history.</i><br><br>This is not the same thing as climate change, and would be happening even if e.g. we had perfect carbon capture. So seems wrong to lump these in together?</p><p><i>I think you make a fair point. While air pollution is impacting climate change, it is distinct from climate change as it relates to mortality. &nbsp;If I carve out the 8.7 &nbsp;million linked to air pollution then climate change would fall to the no.2 overall risk with 292.5 &nbsp;million deaths (using the same assumptions), behind the engineered pathogen risk (5% probability &nbsp;with 95% of the population wiped out) at 532 million. Still, a BIG number.</i><br><br>I can only speak for myself, but degrowth seems (1) politically untenable (as noted above), and (2) requires that people accept much lower living standards. That seems bad to me? I generally want people to have higher living standards, not lower.<br><br><i>Much more to be explored here &nbsp;which I hope to write about later and more in-depth , but my top line thoughts are as mentioned above.</i></p>", "parentCommentId": "btsuNYEh6296w7aQ4", "user": {"username": "Ted Shields"}}, {"_id": "GGRaBcgiRNWdwTcBY", "postedAt": "2022-12-23T18:39:03.698Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>To clarify, I should have said, \"future pandemic risks.\" You are certainly correct in that we have seen tremendous death and suffering as a result of Covid-19. I apologize for the confusing language.</p>", "parentCommentId": "SWvSqrbiaanseehGT", "user": {"username": "Ted Shields"}}, {"_id": "uBTrbtbLziEjLTRo3", "postedAt": "2022-12-23T19:45:20.699Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>One of the challenges is that you're only tautologically correct if you say \"future pandemic risks,\" which by definition haven't happened yet. We could likewise say that the risks from climate change that we're worried about are also \"future climate risks\" which haven't happened yet.</p>", "parentCommentId": "GGRaBcgiRNWdwTcBY", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "36JKuvbmFeHvAvWMh", "postedAt": "2022-12-24T02:00:49.536Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>That's exactly why I compared the relative future risks of climate change, nuclear war, and pandemics in my writing.</p>", "parentCommentId": "uBTrbtbLziEjLTRo3", "user": {"username": "Ted Shields"}}, {"_id": "5PMtMeZQyaJL7nfHF", "postedAt": "2022-12-24T02:39:44.991Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>It sounded to me like you were shifting from proposing that pandemics hadn’t killed anyone yet (false) to proposing that <em>future</em> pandemics were less risky because they hadn’t killed anyone yet (tautologically true of both future pandemics and future climate deaths). So I remain unclear about what it is about climate risk you’re claiming is riskier than pandemics.</p>\n", "parentCommentId": "36JKuvbmFeHvAvWMh", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "S5TeErqHLPZyZLmR4", "postedAt": "2023-05-09T10:41:45.123Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>Hi, I agree with your arguments and linked your text to a petition entitled \"Tell the UN climate conference: Defend the right to life of two billion children\"</p><p>change.org/cop28reform</p><p>Could you help me promote or improve the petition?</p><p>Yours sincerely</p><p>Richard Parncutt</p><p>Graz, Austria</p><p><a href=\"www.parncutt.org\">www.parncutt.org</a></p><p>parncutt at uni-graz.at</p>", "parentCommentId": null, "user": {"username": "Parncutt"}}, {"_id": "ec4ERunHZugibCB4o", "postedAt": "2023-05-15T00:12:52.435Z", "postId": "b6kJ7gQRkwuvnHoLn", "htmlBody": "<p>Hi Richard,</p><p>Thank you for your message. Is there another way to access the petition other than FB? I am not on FB.</p>", "parentCommentId": "S5TeErqHLPZyZLmR4", "user": {"username": "Ted Shields"}}]