[{"_id": "sBL6uFunb7d9FgB98", "postedAt": "2023-03-15T12:48:47.876Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><i>Edited to just be the markets.</i></p><p>Prediction markets are pretty well calibrated and help us see a median view on things.</p><p>Before this article was published the below market was at 15%. Though it should be noted that I am the second largest holder of \"No\" and Naia, featured in the article is the third largest holder of \"Yes\"</p><p>We can see how much this shifts the market.<br>&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/IsaacKing/by-the-end-of-2023-will-substantial\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/IsaacKing/by-the-end-of-2023-will-substantial\">\n\t\t\t\t&lt;/div&gt;\n\t\t\t</iframe></div></div></figure><p>Also:</p><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/NathanpmYoung/will-core-eas-respond-publicly-in-d\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/NathanpmYoung/will-core-eas-respond-publicly-in-d\">\n\t\t\t\t&lt;/div&gt;\n\t\t\t</iframe></div></div></figure><p>Finally: Will SBF plead guilty. if he doesn't then there is gonna be a public trial and that's gonna be pretty punishing for us.</p><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/Gigacasting/will-sbf-plead-guilty\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/Gigacasting/will-sbf-plead-guilty\">\n\t\t\t\t&lt;/div&gt;\n\t\t\t</iframe></div></div></figure>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "iMK5esSwew4jgXnjo", "postedAt": "2023-03-15T13:09:28.485Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><strong>Personal feelings</strong> (which I don't imply are true or actionable)</p><p>I am annoyed and sad.</p><p>I want to feel like I can trust the leaders of this community are playing by a set of agreed rules. Eg I want to hear from them. And half of me trusts them and half feels I should take an outside view that leaders often seek to protect their own power. The disagreement between these parts causes hurt and frustration.</p><p>I also variously feel hurt, sad, afraid, compromised, betrayed.</p><p>I feel ugly that I talk so much about my feelings too. It feels kind of obscene.</p><p>I feel sad that saying negative things, especially about Will. I sense he's worked really hard. I feel ungrateful and snide. Yuck.</p><p><strong>Object level</strong></p><p><s>I don't think this article moves me much </s>This article moves me a bit on a number of important things:</p><ul><li>We have some more colour around the specific warnings that were given</li><li>It becomes much more likely that MacAskill backed Bankman-Fried in the aftermath of the the early Alameda disagreements which was ex-ante, dubious and ex-post disasterous. The comment about threatening Mac Auley is very concerning.</li><li>I update a bit that Sam used this support as cover</li><li>I sense that people ought to take the accusations of inappropriate sexual relationships more seriously to be consistent, though I personally I am uncertain cos we don't have much information</li><li><i>edit </i>mainly after talking to Naia in the comments, I update towards being uncertain about whether we knew SBF was unusually badly behaved (from being confident he wasn't). ie maybe we <i>did&nbsp;</i> have the information required to be pretty sure he wasn't worth funding or to keep him at arms length. As I say I am <i>uncertain</i> but previously I dismissed this</li><li>The 80k interview feels even worse researched/too soft than I previously thought</li><li>I still sense that core EAs take this seriously</li><li>I still think they don't think they can talk</li><li>I still don't understand why they can't give a clear promise of when they will talk and that the lack of this makes me trust them less</li><li><s>I think we had lots of info that sam was a bit dodgy before the FTX crash, but that this was not above normal the levels of many CEOs of rapidly growing business (I have read most about Google's early days and it was very shifty)</s><ul><li><s>Perhaps EA should have higher standards, but I sense not.</s></li><li><s>I still think that we should have been much more careful linking ourselves reputationally to FTX</s></li></ul></li><li>I think the big thing here to note is that even those who saw sam at his worst did not expect the FTX crash, so I guess the question is \"should sam have been lauded, given his early behaviour at alameda\". I think no, but given what we knew I am uncertain whether he should have been condemned&nbsp;<s> not condemned either</s></li><li>I think not talking while there is in investigation is reasonable</li><li>I have made both criticisms and defences of MacAskill and Beckstead and stand by them<ul><li>I still think they are <a href=\"https://forum.effectivealtruism.org/posts/3NYdEcJhxhjkybXHb/nathan-young-s-shortform?commentId=vCJZGyDcxJkEZqij6\">both very talented</a>, perhaps more so as a result of the growth and wisdom this will engender in them (I have often thought it was dumb that people remove leaders who make mistakes) <i>edit </i>Though this article does add additional concerns</li><li>I would still like an argument that they shouldn't be <a href=\"https://forum.effectivealtruism.org/posts/aFGzLDwPrepQLevu6/should-evf-consider-appointing-new-board-members?commentId=P25fK9oM87fcPeJCe#qA2Whn6pEMtsyPnQb\">removed from boards</a>, when almost any other org would. I would like the argument made and seen to be made.&nbsp;</li></ul></li><li>I have noticed how hard it is to talk publicly about these things. Recently I've updated more in favour that there just <i>are</i> emotional, social and some career costs (and benefits) to trying to have accurate semi-public discussions about these things. People DM me. I hear people are annoyed, I build both social credit and debt. I think less than some say, but more than none.<ul><li>I cannot deny that I am tempted to mediate my comments so that people will like me and probably do a bit</li></ul></li></ul><p>Missing context</p><ul><li>I have a reasonable amount of time for the notion that EA leaders should have an independent investigation and I don't think the article gives that enough credit</li><li>Many business leaders are disagreeable people who do grey things. Uber's activities were deliberately illegal in many countries and I probably on balance support that. edit <i>I am less in agreement with my tone here.</i> The article mentions this, but in my opinion it should be written in big letters in the top that:&nbsp;</li></ul><blockquote><p>None of the early Alameda employees who witnessed Bankman-Fried’s behavior years earlier say they anticipated this level of alleged criminal fraud. There was no “smoking gun,” as one put it, that revealed specific examples of lawbreaking. Even if they knew Bankman-Fried was dishonest and unethical, they say, none of them could have foreseen a fraud of this scope.</p></blockquote><ul><li>If even they didn't think this, I don't think we should be surprised that core EAs didn't either.</li></ul><p>Relevant things people may or may not have known:</p><ul><li>In the early days of Alameda, SBF reneged on deals with other EAs and had very poor financial management. Many core EAs knew this</li></ul><p>Other:</p><ul><li>My gut says that Naia Bouscal is telling the truth, since before I knew her in relation to this, I thought she was a pretty straight shooting twitter account.</li></ul><p><i>Edited to combine two comments (one personal one more general) into one and add points as I think of them.</i></p><p>How do you feel?<br>&nbsp;</p><p>What do you think?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "H6776RFFafo8NwhQi", "postedAt": "2023-03-15T13:11:52.274Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I'm curious if this:</p><blockquote><p>In emails among senior EA leaders, which TIME reviewed...</p></blockquote><p>is another update for you in the direction of <a href=\"https://forum.effectivealtruism.org/posts/oosCitFzBup2P3etg/insider-ea-content-in-gideon-lewis-kraus-s-recent-new-yorker?commentId=HY3M9jv5DYGsq9vjj\">not being able to communicate freely</a> given that:</p><blockquote><p>No one has alleged criminal behavior on the part of top EA figures.</p></blockquote><p>(E.g. Lawrence Newport <a href=\"https://forum.effectivealtruism.org/posts/oosCitFzBup2P3etg/insider-ea-content-in-gideon-lewis-kraus-s-recent-new-yorker?commentId=mdQDsEjfvDoxnh6Cd\">says</a>, \"I will now have to update against how open I am in discussions with other EAs - which is a shame as the intellectual freedom, generosity, honesty and subtlety are what I love about this community - but it seems I will have to consider \"what may a journalist think of this if this person leaked it?\" as a serious concern.\" Although I guess this case is more relevant to senior EA leaders being able to communicate freely with one another rather than the rest of us?)</p>", "parentCommentId": "sBL6uFunb7d9FgB98", "user": null}, {"_id": "zAfoB39cw8Qz9dojt", "postedAt": "2023-03-15T13:17:59.385Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I don't know what the emails contained. My general stance:</p><ul><li>Only share private messages if there was serious wrongdoing</li><li>I would support those who warned sharing their emails</li><li>I would not support general email sharing</li></ul><p>I sense Lawrence and I disagree on this a bit.</p>", "parentCommentId": "H6776RFFafo8NwhQi", "user": {"username": "nathan"}}, {"_id": "bJwRqszek2qhF7Bwq", "postedAt": "2023-03-15T13:50:04.928Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I'm similar. In general I'm noticing a mismatch between how the article leaves me <i>feeling</i> versus what it leaves me <i>thinking</i>. E.g. concerns about the other half of the FTX/Alameda split are labelled as just \"internal politics,\" but when EA leaders treat the concerns about SBF as \"typical startup squabbles\" that's labelled \"downplaying,\" \"rationalizing,\" or \"dismissing.\" (Obviously with the benefit of hindsight we think that's fair, but we don't know how different the two sides actually looked to outsiders at the time.)</p><p>By the way, I really like your approach of separating out feelings and thoughts.</p>", "parentCommentId": "iMK5esSwew4jgXnjo", "user": null}, {"_id": "ABx6F2homKpYT6Bcm", "postedAt": "2023-03-15T15:16:03.338Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think youre right to think about the specific email contents here. For example, disclosing an email that shows Person A was aware of certain facts generally poses fewer concerns about interference with deliberative processes and reasonable expectations of trust than does disclosure of deliberations, evidence relating to an individual's thinking or internal mental processes, etc.</p>\n", "parentCommentId": "zAfoB39cw8Qz9dojt", "user": {"username": "Jason"}}, {"_id": "BgGqFM8XgmDaxBNX7", "postedAt": "2023-03-15T15:23:54.157Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote>\n<p>this was not above normal levels for the CEO of a rapidly growing business</p>\n</blockquote>\n<p>It was, and we explicitly said that it was at the time. Many of those of us who left have a ton of experience in startups, and the persistent idea that this was a typical “founder squabble” is wrong, and to be honest, getting really tiresome to hear. This was not a normal startup, and these were not normal startup problems.</p>\n<p>(Appreciate the words of support for my honesty, thank you!)</p>\n", "parentCommentId": "iMK5esSwew4jgXnjo", "user": {"username": "nbouscal"}}, {"_id": "XsfZKQHm3Ktmshvqu", "postedAt": "2023-03-15T15:30:23.802Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>MacAskill declined to answer a list of detailed questions from TIME for this story. “<strong>An independent investigation has been commissioned to look into these issues; I don’t want to front-run or undermine that process by discussing my own recollections publicly</strong>,” he wrote in an email. “I look forward to the results of the investigation and hope to be able to respond more fully after then.” Citing the same investigation, Beckstead also declined to answer detailed questions.</p></blockquote><p>How long do investigations like these typically take?</p><p><i>Feelings:</i></p><p>My patience is running out. If the response of EA leaders after the investigation is lacking, I'm not sure I would still want to be part of this community. I'm also not sure what to do or feel in the meantime while we wait for their responses.</p>", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "DbbdKx6cwAyQkviMX", "postedAt": "2023-03-15T15:33:25.204Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>It really must feel awful to report serious misconduct and have it not be taken seriously. I've had a similar experience and it crushed me mentally.</p>\n<p>I've been thinking about this situation a lot. I don't know many details, but I'm trying to sort through what I think EA leadership should have done differently.</p>\n<p>My main thought is, maybe in light of these concerns, they should have kept taking his money, but not tied themselves to him as much. But I don't know many details about how they tied themselves to him. Its just, handling misconduct cases gets complicated when the misconduct is against one of the 100 richest people in the world. And while it's clear Sam treated people poorly, broke many important rules and lied frequently, it was not clear he was stealing money from customers. And so it just leaves me confused. But thank God I am not in charge of handling these sorts of things.</p>\n<p>I know it's also not your responsibility to know what to do in situations like this, but I'd be curious to hear what you wished EA leadership/infrastructure had done differently. I think that might help give shape to my thoughts around this situation.</p>\n<p>I don't known if communicating super clearly here. So want to clarify. This is not meant as a critical comment at all! I hope it doesn't read as downplaying your experience, because I do feel super alarmed about everything and get the sense EA fucked up big here. I feel fully on support of you here, but I'm worried my confusion makes that harder to read.</p>\n<p>Retracting because on reflection I'm like, no one knew he was stealing funds, but I think leadership knew enough of the ingredients to not be surprised by this. It's not just Sam treating employees poorly, but leadership heard that he would lie to people (including investors), mix funds, play fast and loose with the rules. They may not have known the disastrous ways these would combine. Even so, it seems super bad and while I'm still confused as to how the ideal way to handle it would be. It does seem clear to me it was egriously mishandled.</p>\n", "parentCommentId": "BgGqFM8XgmDaxBNX7", "user": {"username": "Masha Winchell"}}, {"_id": "7BXE6CXPQdif2W8dx", "postedAt": "2023-03-15T15:35:59.091Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Agree. I thought the article implied that more was shared with TIME than just the emails from the people concerned to senior EA leaders given their use of \"among\" rather than \"to\" <s>and quoting a reply from a leader</s>:</p><blockquote><p>In emails among senior EA leaders, which TIME reviewed, one person wrote that they had raised worries about Bankman-Fried’s trustworthiness directly with MacAskill, and that MacAskill had dismissed the concerns as “rumor.”</p></blockquote><p>(I wouldn't have mentioned it if I'd thought otherwise, although it's encouraging that you and Nathan Young seem to be implying that you didn't interpret that part like I did - I was genuinely curious to get Nathan's take.)</p><p>Still, it's one thing to share private emails from others with a journalist and another for the journalist to quote said emails extensively - the latter would have been a much larger breach of trust.</p><p><i>Edit: I now see that the person quoted is the person raising concerns, not the leader - the person described the leader's response as 'dismissing it as a rumor.'</i></p>", "parentCommentId": "ABx6F2homKpYT6Bcm", "user": null}, {"_id": "jRdpNpmqJQRRhEPSc", "postedAt": "2023-03-15T15:42:40.673Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Thanks for giving honest quotes on a serious crime. On balance I'm in favour of your giving quotes here and that can't have been easy (though I feel the article is inaccurate in tone).</p><p>I'm sad to hear that this is tiring, though I still am gonna say things I think. Feel free to DM me if you think I'm wrong but don't want to engage publicly.</p><p>My error, By normal I don't mean good, I mean \"not usual\".&nbsp;<br><br>I sense there were this level of concern externally about facebook, that google did some pretty shifty shit, that Gates and Bezos were similarly cutthroat.</p><p>Do you disagree.</p>", "parentCommentId": "BgGqFM8XgmDaxBNX7", "user": {"username": "nathan"}}, {"_id": "8xza6TJvxYBXygi6u", "postedAt": "2023-03-15T15:43:22.855Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>One important thing to note is that when we first warned everyone, he was not yet in the richest 100 people in the world. If they had taken our warnings seriously at the start, he may never have become that rich in the first place.</p>\n", "parentCommentId": "DbbdKx6cwAyQkviMX", "user": {"username": "nbouscal"}}, {"_id": "QZRsf5pexv4NuyBL5", "postedAt": "2023-03-15T15:44:18.181Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Yes, I disagree. My understanding of what happened at each of those four companies in the early days is qualitatively, categorically different from what happened at Alameda.</p>\n", "parentCommentId": "jRdpNpmqJQRRhEPSc", "user": {"username": "nbouscal"}}, {"_id": "A5PN9vTzNPnpAqbvu", "postedAt": "2023-03-15T15:49:21.351Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>I still don't understand why they can't give a clear promise of when they will talk and that the lack of this makes me trust them less</p></blockquote><p>fwiw I will probably post something in the next ~week (though I'm not sure if I'm one of the people you are waiting to hear from).&nbsp;</p>", "parentCommentId": "iMK5esSwew4jgXnjo", "user": {"username": "Ben_West"}}, {"_id": "SfZRAi2bDdjrdQ4cF", "postedAt": "2023-03-15T15:51:09.177Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I feel glad.</p><p>Personally it doesn't need to be soon, but I appreciate something I can hold you to a lot, that makes me not worry that this trying to minimise.</p>", "parentCommentId": "A5PN9vTzNPnpAqbvu", "user": {"username": "nathan"}}, {"_id": "nQC7pfd7e7TEj9oWx", "postedAt": "2023-03-15T15:58:01.348Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Agree. And also worth noting it seems like he may have never actually been that rich, but just, you know, lied and did fraud.</p>\n<p>The general thing I'm hearing is, with a lot of people who do misconduct, you/CEA will hear about this misconduct relatively early on, and they should take action before things get too large to correct. That, early &amp; decisive action is important. Leadership should be taking a lot more initiative in responding to misconduct.</p>\n<p>This tracks with my experience too. I've reported professional misconduct, have it not be taken seriously, and have that person continue to gain power. The whole experience was maddening. So, yeah, +1 to early intervention following credible misconduct reports.</p>\n", "parentCommentId": "8xza6TJvxYBXygi6u", "user": {"username": "Masha Winchell"}}, {"_id": "Wi2Zx6D6afGyivynT", "postedAt": "2023-03-15T16:05:30.813Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Feel free to DM me, I've complained before, I'll complain again.</p><p>Unless somehow it is me, in which case get someone to make a prediction market and bet it up using a newly created google account.</p>", "parentCommentId": "nQC7pfd7e7TEj9oWx", "user": {"username": "nathan"}}, {"_id": "w2MhJE4K9BHmLCuJh", "postedAt": "2023-03-15T16:16:19.028Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Lol not you. I deleted most detail I included in that comment because I feel like it's distracting from SBF discussion (like, this convo should not be used as a soapbox for me), the case has recently been reopen (which means probably best if I don't talk about it and also there might be a good outcome). And I also just worry about pissing people off.</p>\n<p>It's also like, what are people supposed to do with an anonymous comment with a very vague allegation.</p>\n", "parentCommentId": "Wi2Zx6D6afGyivynT", "user": {"username": "Masha Winchell"}}, {"_id": "tWPihWhbAZEeTdFJR", "postedAt": "2023-03-15T16:21:16.473Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Well I'd still like to know. My general stance is that information about misdeeds should more often be public. I wish that I'd known what many knew about SBF.</p>", "parentCommentId": "w2MhJE4K9BHmLCuJh", "user": {"username": "nathan"}}, {"_id": "4mbGY5rkBP5qQyj23", "postedAt": "2023-03-15T16:32:06.370Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Hm maybe, I'm not sure. I like to have a professional atmosphere, and public sharing of misdeeds can lead to a culture of like gossip. But, I think it is appropriate to speak publicly about it if the situation was mishandled (in my case, unclear as it's been reopened) or if the person should be blacklisted (I do not think this is the case here).</p>\n", "parentCommentId": "tWPihWhbAZEeTdFJR", "user": {"username": "Masha Winchell"}}, {"_id": "Lcw53fqDM8vw9SeZ6", "postedAt": "2023-03-15T16:35:49.349Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p><strong>Will basically threatened Tara,</strong>”<br><br>I would <i>VERY</i> much like to get more information on &nbsp;this (though I understand if Naia feels she can't say more.) This sounds, really really bad, but also like a lot turns on exactly how far 'basically threatened' is from 'threatened' without qualifier.&nbsp;</p></blockquote>", "parentCommentId": null, "user": {"username": "Dr. David Mathers"}}, {"_id": "YcFtgtBhJYTvbMfg3", "postedAt": "2023-03-15T16:47:51.574Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>What's new here, I think, is not only the level of specificity in general but that the concerns included things that raised the specter of what was to come. I submit that refusal \"to implement standard business practices,\" concealment of \"dangerous and egregious shortcuts,\"  lack of \"a distinction between firm capital and trading capital,\" especially when combined with evidence of general lack of ethics, would make someone manifestly and obviously unfit to serve as a de facto trustee for over a million depositors of [edit: eleven!] figures in deposits. There are also references to what sounds a lot like repeated allegations of fraud against investors -- I know investors properly get less sympathy than depositors, but that would still be serious criminal conduct.</p>\n<p>If one accepts the statements in the article and draws certain inferences from them -- mainly that leaders knew about as much as was in the article -- then it seems more likely to me than not that those leaders knew or should have known there was a substantial probability SBF had committed or would commit significant fraud of <em>some</em> sort (although probably not fraud against depositors specifically).</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "ybkfaQFK5bM9XEm5p", "postedAt": "2023-03-15T16:50:54.730Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote>\n<p>E.g. concerns about the other half of the FTX/Alameda split are labelled as just \"internal politics,\"</p>\n</blockquote>\n<p>What do you mean by \"concerns about the other half of the FTX/Alameda split\"?</p>\n", "parentCommentId": "bJwRqszek2qhF7Bwq", "user": {"username": "orellanin"}}, {"_id": "bC6dwfDSPyASirZbm", "postedAt": "2023-03-15T16:54:18.780Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I'm struggling to see how releasing information already provided to the investigation would obstruct it. A self-initiated investigation is not a criminal, or even a civil, legal process -- I am much less inclined to accept it as an adequate justification for a significant delay, especially where potentially implicated people have not been put on full leaves of absence.</p>\n", "parentCommentId": "XsfZKQHm3Ktmshvqu", "user": {"username": "Jason"}}, {"_id": "Kp3aDynb2muLs8Kea", "postedAt": "2023-03-15T17:02:22.731Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>\"[Name], who had perhaps raised the loudest concerns about Bankman-Fried, was distrusted by some EA leaders because of internal politics during her time at the Centre for Effective Altruism\"</p>", "parentCommentId": "ybkfaQFK5bM9XEm5p", "user": null}, {"_id": "mYzayemjkFQpaYo3E", "postedAt": "2023-03-15T17:13:01.214Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I tried to address this argument with the point about every other long-time EA leaving Alameda for the same reasons. I’ve avoided naming those other EAs out of respect for their privacy, but they include multiple very core and well-respected EAs. The parallel you’re trying to draw here just really doesn’t hold up.</p>\n", "parentCommentId": "Kp3aDynb2muLs8Kea", "user": {"username": "nbouscal"}}, {"_id": "bQc8CThBJHqhWkiWz", "postedAt": "2023-03-15T17:25:02.438Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Again, I think I'd like more public sharing on professional misdeeds, on the margin. Many EA orgs have mistakes pages for this reason and that's good.&nbsp;</p>", "parentCommentId": "4mbGY5rkBP5qQyj23", "user": {"username": "nathan"}}, {"_id": "nGxkHbrikGeTxrLjZ", "postedAt": "2023-03-15T17:53:03.025Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I thought the <a href=\"https://forum.effectivealtruism.org/posts/JCyX29F77Jak5gbwq/ea-sexual-harassment-and-abuse\">previous article by Charlotte Alter</a> on sexual misconduct in EA was pretty misleading in a lot of ways, as the top comments have pointed out, since it omitted a lot of crucial context, primarily used examples from the fringes of the community, and omitted various enforcement actions that were taken against the people mentioned in the article, which I think overall produced an article that had some useful truths in it, but made it really quite hard for readers to come to a good map of what is actually going on with that kind of stuff in EA.</p><p>This article, in contrast, does not have, as far as I can tell, any major misrepresentations in it. I do not know the details about things like conversations between Will and Tara, of course, since I wasn't there, and I have a bit of a feeling there is some exageration in the quotes by Naia here, but having done my own investigation and having talked to many people about this, the facts and rough presentation of what happened here seems basically correct.&nbsp;</p><p>It still has many of the trapping of major newspaper articles, and think continues to not be amazingly well-optimized for people to come to a clear understanding of the details, and is more optimized to tell a compelling story, but at least my perception is that the rough narrative of the story lines up pretty well with what I think indeed happened. When I found out similar details in early 2022, I also had quite a strong reaction that nobody seemed to be acting on all of these warning flags.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "EBBs2FNdMgiArvDub", "postedAt": "2023-03-15T17:53:15.725Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Was this was all private individual warnings, or were the also public components?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "skaE32XuGEubsgEfH", "postedAt": "2023-03-15T18:08:29.267Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think the main problem being faced again and again is that <i>internal</i> reporting lacks teeth.&nbsp;</p><p>I think public reporting is an inadequate alternative. It's a big demand to ask people to become public whistleblowers, especially since most things worth reporting aren't always black and white. It's hard to publicly speak out about things if you're not certain about them (eg because of self-doubt, wondering if it's even worth bothering, creating a reputation for yourself, etc).</p><p>Additionally, the subsequent discourse seems to put additional burden on those speaking out. If I spoke up about something just to see a bunch of people doubt what I've said is true (or, like in previous cases, have to engage with the wrongdoer and proofread their account of events) I'd probably regret my choice.</p>", "parentCommentId": "bQc8CThBJHqhWkiWz", "user": {"username": "finnhambly"}}, {"_id": "rxygjsZM8vmJNGhR2", "postedAt": "2023-03-15T18:19:55.667Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think that the wiki could solve this. Having public records that someone hard nosed (like me) could write on others behalf.</p><p>I know that my messing with prediction markets around this hasn't always gone well (sorry) but I think there is something good in that space too. I think Sam's \"chance of fraud\" would have been higher than anyone else's.</p>", "parentCommentId": "skaE32XuGEubsgEfH", "user": {"username": "nathan"}}, {"_id": "tXLvhCGbMEWopQXNW", "postedAt": "2023-03-15T18:22:22.375Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>My interpretation of the refusal was that the investigation hadn’t got to hearing all that information yet.</p>\n", "parentCommentId": "bC6dwfDSPyASirZbm", "user": {"username": "bec_hawk"}}, {"_id": "4nv9TtvkxLxw9JcAf", "postedAt": "2023-03-15T18:29:19.302Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Some points I think need mentioning:</p><p>(1) Everything we read here needs to be adjusted for hindsight bias. I have no idea what the baserate for messy breakups among early-stage start-ups are, but I assume it's significant. &nbsp;So \"had a messy start-up breakup\" is not a super reliable signal of a future scammer.&nbsp;</p><p>(2) We have only heard one sight of the story. We don't know the reasons given by the people that didn't quit. We don't know how SBF explained the story at the time to Will. &nbsp;I think it's likely that those details will make some of the EA Leader's behaviour sound a bit more understandable.&nbsp;</p><p>That being said, some of the details reported in the article certainly sound concerning and gives us significant reasons to believe in serious wrongdoing. &nbsp; All of this should be seriously be investigated and we need to think carefully about how we can avoid things like that in the future.&nbsp;</p><p>I agree with other commenters that a CEA response is long overdue. I understand that they are involved in a trial and have they reasons, but they should try to say as much as they can, since the downsides of remaining silent are significant.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Yannick_Muehlhaeuser"}}, {"_id": "gXznCwcHiXJgGfacs", "postedAt": "2023-03-15T18:34:14.439Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I don't think gossip ought to be that public or legible.&nbsp;</p><p>Firstly, I don't think it would work for achieving your goals; I would still hesitate about having my opinions uploaded without feeling very confident in them (rumours are powerful weapons and I wouldn't want to start one if I was uncertain).</p><p>Secondly, I don't think it's worth the costs of destroying trust. A whole bunch more people will distance themselves from EA if they know their public reputation is on the line with every interaction. (I also agree with <a href=\"https://forum.effectivealtruism.org/posts/oosCitFzBup2P3etg/insider-ea-content-in-gideon-lewis-kraus-s-recent-new-yorker?commentId=mdQDsEjfvDoxnh6Cd\">Lawrence on the Slack leaks</a>, FWIW).</p><p>I see why you might want public info (akin to scandal markets) when people are more high-profile, but I don't think Sam Bankman-Fried would have passed that bar in 2018.</p>", "parentCommentId": "rxygjsZM8vmJNGhR2", "user": {"username": "finnhambly"}}, {"_id": "NwXqgMs5mGm7BtXto", "postedAt": "2023-03-15T18:49:07.028Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<ol><li>I disagree. I upload 60% opinions all the time. I would about gossip if I thought I could control it.&nbsp;</li><li>I think we could build systems to handle this. I think there is something whistleblower marketty&nbsp;</li><li>I think he would have as FTX got going. Also he <i>might</i> in 2018.&nbsp;</li></ol>", "parentCommentId": "gXznCwcHiXJgGfacs", "user": {"username": "nathan"}}, {"_id": "sj8ZHaoM3vadxo2nj", "postedAt": "2023-03-15T18:53:32.118Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p><i>edit </i>mainly after talking to Naia in the comments, I update towards being uncertain about whether we knew SBF was unusually badly behaved (from being confident he wasn't). ie maybe we <i>did&nbsp;</i> have the information required to be pretty sure he wasn't worth funding or to keep him at arms length. As I say I am <i>uncertain</i> but previously I dismissed this</p></blockquote><p>I am quite confident we knew he was unusually bad behaved by EA standards. I think a bunch of people thought he was not that far of an outlier by Silicon Valley founder standards, though I think they were wrong.</p><blockquote><p>I still sense that core EAs take this seriously</p></blockquote><p>I do indeed a bunch of people are taking this quite seriously. I do think that in-general the FTX explosion is hugely changing a lot of people's outlook on EA and how to relate to the world.</p><blockquote><p>I still think they don't think they can talk</p></blockquote><p>To be clear, I am quite confident the legal consequences for talking would be quite minor and have talked to some people with extensive legal experience about this. At this point there is no good legal reason to not talk.&nbsp;</p><blockquote><p>I still don't understand why they can't give a clear promise of when they will talk and that the lack of this makes me trust them less</p></blockquote><p>I think people aren't talking because it seems stressful and because they are worried being more associated with FTX would be bad for PR. I also think a lot of people kind of picked up on a vibe that core people aren't supposed to talk about FTX stuff because it makes us look bad and because there used to be a bunch of organizational policies in-place that did prevent talking, but I think those are mostly gone by now.&nbsp;</p>", "parentCommentId": "iMK5esSwew4jgXnjo", "user": {"username": "Habryka"}}, {"_id": "McX3dnKz5AucMtwZC", "postedAt": "2023-03-15T19:06:05.478Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Fair enough! It could be useful, so I'd be happy to be wrong here.</p>", "parentCommentId": "NwXqgMs5mGm7BtXto", "user": {"username": "finnhambly"}}, {"_id": "hoRbrcPZ3LJRxoXWd", "postedAt": "2023-03-15T19:23:31.068Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Asking people to turm over relevant emails is close to day-one stuff. And if the investigators haven't conducted significant enough interviews with Will and Nick yet to have figured out the gist of what Time figured out, this is going to be a very slow investigation.</p>\n", "parentCommentId": "tXLvhCGbMEWopQXNW", "user": {"username": "Jason"}}, {"_id": "coML6P3qMKhhQH5nK", "postedAt": "2023-03-15T19:33:32.441Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>I would still like an argument that they shouldn't be <a href=\"https://forum.effectivealtruism.org/posts/aFGzLDwPrepQLevu6/should-evf-consider-appointing-new-board-members?commentId=P25fK9oM87fcPeJCe#qA2Whn6pEMtsyPnQb\">removed from boards</a>, when almost any other org would. I would like the argument made and seen to be made.&nbsp;</p></blockquote><p>&nbsp;</p><p>Here's my tentative take:</p><ul><li>It's really hard to find competent board members that meet the <a href=\"https://www.cold-takes.com/nonprofit-boards-are-weird-2/\">relevant criteria</a>.&nbsp;</li><li>Nick (together with Owen) did a pretty good job turning CEA from a highly dysfunctional into a functional organization during CEA's leadership change in 2018/2019.&nbsp;</li><li>Similarly, while Nick took SBF's money, he didn't give SBF a strong platform or otherwise promote him a lot, and instead tried to independently do a good (not perfect, but good enough!) job running a philanthropic organization. While SBF may have wanted to use the philanthropy to promote the FTX/SBF brand, Nick didn't do this. [Edit: This should not be read as me implying that Will did those things. While I think Will made some mistakes, I don't think this describes them.]</li><li>Continuity is useful. Nick has seen lots of crises and presumably learnt from them.</li></ul><p>So, while Will should be removed, Nick has demonstrated competence and should stay on.&nbsp;</p><p>(Meta note: I feel frustrated about the lack of distinction between Nick and Will on this question. People are a bit like \"Will did a poor job, therefore Nick and Will should be removed from the board.\" Please, discuss the two people separately.)</p>", "parentCommentId": "iMK5esSwew4jgXnjo", "user": {"username": "Jonas Vollmer"}}, {"_id": "9Qhw5qKwDjbyxkdfn", "postedAt": "2023-03-15T19:46:01.476Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Seems like we're in for a very slow investigation. <a href=\"https://forum.effectivealtruism.org/posts/TeBBvwQH7KFwLT7w5/william_macaskill-s-shortform?commentId=ACDPftuESqkJP9RxP\">Per Will</a>, looks like \"a minimum of 2 months\" before the investigation is completed.</p>", "parentCommentId": "hoRbrcPZ3LJRxoXWd", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "JPqczPQrqDNuNhJYG", "postedAt": "2023-03-15T19:59:12.404Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>That still implies it's over half complete, I think? Rather unusual not to talk to the most knowledgeable people by that point.</p>\n", "parentCommentId": "9Qhw5qKwDjbyxkdfn", "user": {"username": "Jason"}}, {"_id": "dJ3m85GuW5pCosdAc", "postedAt": "2023-03-15T19:59:38.037Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Some miscellaneous takeaways from this article…</p><p>New (to me) information included:</p><ul><li>The specificity of Naia’s allegations (the part about “Will basically threatened Tara” seems particularly important/bad)</li><li>The quotes from the planning document for the meeting between SBF and other Alameda execs. These give important specifics, and seem highly credible (since the four other members of the management team all agreed with them).</li><li>Holden being one of the people who was told about concerns with Sam (not shocking to me, and I think Holden was in a worse position to act on this info than e.g. Will, but still an update)</li><li>CEA doing “an internal investigation relating to CEA and Alameda” sometime in 2019. I’d love to know more about this, e.g. did the full board review the findings? Who besides Will conducted the investigation?</li></ul><p>&nbsp;</p><p>Thoughts after reading the article and comments:&nbsp;</p><ul><li>I agree with Nathan that “The 80k interview feels even worse researched/too soft than I previously thought”</li><li>I think EA dodged a bullet in that FTX collapsed relatively soon after CEA had shored up a deficiency in PR expertise (which was done largely in anticipation of Will’s book release as I understand it). I imagine that CEA’s response, while imperfect, would have been significantly worse if that PR capacity were not in place. I also think it’s fair to wonder whether CEA leadership should have added PR expertise sooner given what they apparently knew about SBF (even if you think getting in bed with a &nbsp;possibly sketchy billionaire is the right move, giving yourself more protection if he does turn out to be really sketchy seems reasonable way to hedge risk.)</li><li>I’m really glad Ben West is planning to write something in the relatively near future as I think some sort communication from CEA/EVF leadership is overdue.</li></ul>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "RzfkqsKgNDwkkjpWE", "postedAt": "2023-03-15T20:37:30.493Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Yeah I would certainly think/hope investigators would've talked to the most knowledgeable people and already uncovered everything in the Time article.&nbsp;</p>", "parentCommentId": "JPqczPQrqDNuNhJYG", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "CN8dDn6P5tDT9ieBT", "postedAt": "2023-03-15T20:37:50.413Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I’m assuming part of it is that they didn’t want to bias other people’s recollections who may not have been spoken to, but that’s a moot point now with this article.</p>\n", "parentCommentId": "JPqczPQrqDNuNhJYG", "user": {"username": "bec_hawk"}}, {"_id": "s3okjET5LSSsGg7T4", "postedAt": "2023-03-15T20:52:33.642Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>EA leaders should be held to high standards, and it's becoming increasingly difficult to believe that the current leadership has met those standards. I'm open to having my mind changed when the investigation is concluded and the leaders respond (and we get a better grasp on who knew what when). As it stands now, I would guess it would be in the best interest of the movement (in terms of avoiding future mistakes, recruitment, and fundraising) for those who have displayed significantly bad judgement to step down from leadership roles. I recognize that they have worked very hard to do good, and I hope they can continue helping in non-leadership roles.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "tzSbLPRWsLWP7rhqa", "postedAt": "2023-03-15T20:58:12.300Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Adding: I think this article also raises my level of concern that no one seems to have been looking out for the grantees.  I'd like to think that this information would have caused people to be much more careful and self-protective around SBF/FTX adjacent stuff at a minimum, like incorporating an organization to receive any grants rather than exposing oneself to liability. But did grantees know about these concerns so they could protect themselves?</p>\n", "parentCommentId": "YcFtgtBhJYTvbMfg3", "user": {"username": "Jason"}}, {"_id": "tgrLLmuYfH7LRN2bA", "postedAt": "2023-03-15T23:01:09.234Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Based on conversations with people at the time, it seems plausible to me that this is true. However, this is not as serious a concern as you might think: IMHO it was reasonable to consider <strong>both SBF and Tara highly untrustworthy at the time. Will trusted SBF too much, but his skepticism of Tara seems justified.</strong> Tara's hedge fund suffered a major loss later, and I heard she showed low integrity in communicating with stakeholders about the loss.</p><p>Relevant quote from the article:</p><blockquote><p>“He was treating it like a ‘he said-she said,’ even though every other long-time EA involved had left because of the same concerns,” Bouscal adds.</p></blockquote>", "parentCommentId": "Lcw53fqDM8vw9SeZ6", "user": {"username": "ftxthrowaway33"}}, {"_id": "LSBpfiEbPEcRezsGW", "postedAt": "2023-03-15T23:11:04.064Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Overall, I think Nick did the right thing ex ante when he chose to run the Future Fund and accept SBF's money (unless he knew specifics about potential fraud).&nbsp;</p><p>If he should be removed from the board, I think we either need an argument of the form \"we have specific evidence to doubt that he's trustworthy\" or \"being a board member requires not just absence of evidence of untrustworthiness, but proactively distancing yourself from any untrustworthy actors, even if collaborating with them would be beneficial\". I don't buy either of these.</p>", "parentCommentId": "coML6P3qMKhhQH5nK", "user": {"username": "Jonas Vollmer"}}, {"_id": "th4697SpaWwkozp4g", "postedAt": "2023-03-15T23:15:41.656Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Note Will MacAskill has written a <a href=\"https://forum.effectivealtruism.org/posts/TeBBvwQH7KFwLT7w5/william_macaskill-s-shortform?commentId=ACDPftuESqkJP9RxP\">shortform</a> today saying among other things: \"I won’t comment publicly on FTX at least until the independent investigation commissioned by EV is over. Unfortunately, I think that’s a minimum of 2 months, and I’m still sufficiently unsure on timing that I don’t want to make any promises on that front. I’m sorry about that: I’m aware that this will be very frustrating for you; it’s frustrating for me, too.\"</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "oLWqtwfjiEE4us3oz", "postedAt": "2023-03-15T23:30:00.347Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><blockquote><p>None of the early Alameda employees who witnessed Bankman-Fried’s behavior years earlier say they anticipated this level of alleged criminal fraud. There was no “smoking gun,” as one put it, that revealed specific examples of lawbreaking. Even if they knew Bankman-Fried was dishonest and unethical, they say, none of them could have foreseen a fraud of this scope.</p></blockquote><ul><li>If even they didn't think this, I don't think we should be surprised that core EAs didn't either.</li></ul></blockquote><p>While I agree with a strict reading of this comment, I want to point out that there was another red flag around FTX/Alameda that several people in the EA leadership likely knew about since at least late 2021, &nbsp;which in my opinion was more severe than the matters discussed in the Time article and which convinced me back in 2021 that FTX/Alameda were putting a lot of effort into consistently lying to the public.&nbsp;</p><p>In particular, in October 2021, I witnessed (sentence spread across bullet points to give emphasis to each part of it):</p><ul><li>A high-status, important EA (though not one of the very top people)</li><li>who had worked at Alameda after FTX was founded, and left before October 2021</li><li>publicly offhandedly implying that \"FTX\" was the new name for Alameda (seemingly unaware that they were supposed to be distinct companies)</li><li>in a place where another very high-status EA (this time probably one of the very top people, or close to it) clearly took note of it&nbsp;</li></ul><p>I won't give more details publicly, in order to protect the person's privacy, but this happened in a very public place.&nbsp;</p><p>It wasn't just me who was aware of this. Nate Soares <a href=\"https://forum.effectivealtruism.org/posts/BNKBJs4RJsA8FtdWE/a-personal-reflection-on-sbf?commentId=CpsqyA2iHAmHpjpFv\">reported</a> having heard the rumor that \"Alameda Research had changed its name to FTX\" as well, though I think he left out one important aspect of it: that this rumor was being shared by <i>former</i> <i>insiders</i>, not by e.g. random clueless crypto people.&nbsp;</p><p>In case you don't understand why the rumor was a big deal, I explained it in <a href=\"https://forum.effectivealtruism.org/posts/BNKBJs4RJsA8FtdWE/a-personal-reflection-on-sbf?commentId=CpsqyA2iHAmHpjpFv\">my comment</a> in Nate Soares's post. Quoting from it:</p><blockquote><p>Everywhere on the public internet, Alameda Research and FTX had painted themselves as clearly different companies. Since October 2021, they've ostensibly had disjoint sets of CEOs. By late 2021 I had watched several interviews with SBF and followed his output closely on Twitter, and saw people talking about Alameda and FTX in several crypto Discord servers. Nowhere did anyone say that Alameda had changed its name to FTX or otherwise act as if they were the same company (though everyone knew they were close).&nbsp;</p></blockquote><blockquote><p>[...]&nbsp;</p><p>How could [the former Alameda employee] &nbsp;know less about FTX and Alameda than me, who had never worked at either company and was just watching everything by the sidelines? &nbsp;If it was possible for this person to think that FTX was merely the new name for Alameda, that almost certainly implied that the FTX/Alameda leadership was putting a lot of effort into consistently lying to the public.&nbsp;</p></blockquote><p>I suspect you will not be very impressed by this, and ask me why I didn't share my concerns widely at the time. But I was just a low-status person with no public platform and only one or two friends. I shared my concerns with my partner (in fact, more than once, because I was so puzzled by that comment) but not with people I'm not close to. [ETA: in retrospect, I think a more correct explanation would be to say that I probably stayed silent because I &nbsp;guessed I'd lose status if I'd spoken up. 🙁]</p><p>I'm not sure why this wasn't taken seriously by the EA leadership. This seems to be a pretty clear example of the FTX/Alameda leadership blatantly lying to the public about their internal workings and prominent EAs <i>knowing about that.</i></p>", "parentCommentId": "iMK5esSwew4jgXnjo", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "MsbpLRvE8syBwYjDS", "postedAt": "2023-03-15T23:31:27.413Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>\"every other long-time EA involved had left because of the same concerns\" is significant corroboration though (and a direct quote from an on-the-record source).</p>\n", "parentCommentId": "tgrLLmuYfH7LRN2bA", "user": {"username": "Jason"}}, {"_id": "789zhsNiEhGDb6CxJ", "postedAt": "2023-03-15T23:38:53.589Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>From my DMs:<br><br>\"Publicly commenting on who knew what when means a significant risk of being subpoenaed or having to appear in court as a witness, which would be a huge hassle and time cost for whoever speaks out (and possibly also for their employer and other people they're connected to). I believe this is one of the main reasons why senior figures aren't commenting on this.\"</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "o9uGZsAmLgz54ATkD", "postedAt": "2023-03-16T00:04:34.445Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I disagree.&nbsp;</p><p>I just think being a leader would be really hard. I am much less public that these people and I find dealing with that difficult. Now imagine billions of $ and 1000s of poeple looking to you to be a good role model.</p><p>I think we should hold our leaders to high standards, but we should be gracious when they fail. While I have criticisms of Will MacAskill, I think he's one of the best we have.&nbsp;</p><p>I think I'd prefer to see us discuss what the errors were and see if he can work on them, because he's already way ahead of most of us in terms of relevant competences. I am open to people stepping down, but I don't think permanently. We all make errors, it's about whether we can credibly convince relevant people that we won't make them again.</p>", "parentCommentId": "s3okjET5LSSsGg7T4", "user": {"username": "nathan"}}, {"_id": "JunnhYgbtpfFLkqBW", "postedAt": "2023-03-16T00:37:17.053Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>\"[K]new specifics about potential fraud\" seems too high a standard. Surely there is some percentage X at which \"I assess the likelihood that these funds have been fraudulently obtained as X%\" makes it unacceptable to serve as distributor of said funds, even without any knowledge of specifics of the potential fraud.&nbsp;</p><p>I think your second paragraph hinges on the assumption that Nick merely had sufficient reason to see SBF as a mere \"untrustworthy actor[]\" rather than something more serious. To me, there are several gradations between \"untrustworthy actor[]\" and \"known fraudster.\"</p><p>(I don't have any real basis for an opinion about what Nick in particular knew, by the way . . . I just think we need to be very clear about what levels of non-specific concern about a potential bad actor are or are not acceptable.)</p>", "parentCommentId": "LSBpfiEbPEcRezsGW", "user": {"username": "Jason"}}, {"_id": "SEF923PX2dLxrinur", "postedAt": "2023-03-16T02:02:39.850Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>\"which would be a huge hassle and time cost for whoever speaks out\"</p><p>Wait - so if leaders were complicit, yet admitting to that would be a hassle, then it's better that they not mention their complicity? I'm afraid of a movement that makes such casual justifications for hiding malefactors and red flags. I'm going to keep showing outsiders what you all say to each other! :O</p>", "parentCommentId": "789zhsNiEhGDb6CxJ", "user": {"username": "Anthony Repetto"}}, {"_id": "hFfPM2TKktYooFA5x", "postedAt": "2023-03-16T02:29:18.106Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>In most cases, I think the being-dragged-into-legal-proceedings risk of a random person speaking out is considerably less than this quote would imply. First, you'd need a litigant who cared enough about what you had to say to issue a subpoena -- the FTX debtors, presumably. Even then, they would only care if they were litigating a suit for which the information would be relevant and which didn't settle quickly enough. Unless the person on the other end denied the facts, it's doubtful they would want to burn one of their limited number of depositions on a third party who heard something. And they'd likely get any relevant e-mails from the other person anyway. &nbsp;There are restrictions on subpoenas -- for instance, in the US gederal context, they generally cannot command attendance more than 100 miles away from where the person lives, regularly conducts business, etc. [<a href=\"https://www.law.cornell.edu/rules/frcp/rule_45\">FRCP 45</a>; <a href=\"https://www.law.cornell.edu/rules/frbp/rule_9016\">FRBP 9016</a>.] If you're in a non-US country and are not an employee or agent of a party, international process is often very, very slow to the point it is a last resort for getting information like that.</p><p>None of that is legal advice, and people who have questions about their potential exposure for speaking out should consult with an appropriate lawyer.&nbsp;</p>", "parentCommentId": "789zhsNiEhGDb6CxJ", "user": {"username": "Jason"}}, {"_id": "a95BeaTYk2zjXhaxk", "postedAt": "2023-03-16T02:37:34.184Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think the quote is saying that speaking out would saddle<i> the person who spoke out </i>about what someone else knew with significant costs. Although I think the quote overstates the risk, I don't think your reasoning holds. It's not clear to me why anyone has a duty to voluntarily burden themselves with costs to aid the litigation interests of a third party.</p><p>If the statement is actually about a senior leader's own knowledge, and their organization received significant funds from FTX/Alameda-linked sources, they are very going to be involved in litigation whether they speak or not.</p>", "parentCommentId": "SEF923PX2dLxrinur", "user": {"username": "Jason"}}, {"_id": "F6RjLCbKuNxBiE5ko", "postedAt": "2023-03-16T02:52:07.126Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>At least I know of basically nothing public until FTX became very high-profile, and then it was so high-profile that it was kind of expected you would get some public warnings anyway even if they were false. I do think some of the public warnings in 2021 and early 2022 were actually pretty real and played a role in some of my beliefs in early 2022, but I think you did actually have to dig into the details of them to find it out, and I wouldn't have bothered to even look if I hadn't heard rumors of things, and even then, none of the public warnings were that informative.</p>", "parentCommentId": "EBBs2FNdMgiArvDub", "user": {"username": "Habryka"}}, {"_id": "KffmPKhHZaA6yc6Wm", "postedAt": "2023-03-16T03:06:49.614Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think I agree with both of these, actually: EA needs unusually good leaders, possibly better than we can even expect to attract.</p>\n<p>(Compare EA with, say, being an elite businessperson or politician or something.)</p>\n", "parentCommentId": "o9uGZsAmLgz54ATkD", "user": {"username": "NicholasKross"}}, {"_id": "MDs8SFtb8nb5gh8ML", "postedAt": "2023-03-16T03:08:12.223Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Isn't Caroline Ellison an obvious exception?</p>\n", "parentCommentId": "MsbpLRvE8syBwYjDS", "user": {"username": "DanielFilan"}}, {"_id": "AoXrvLo2hzniWH5Xu", "postedAt": "2023-03-16T03:20:47.614Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><strong>Personal feelings</strong>:\nI thought Karnofsky was one of the good ones! He has opinions on AI safety, and I agree with most of them! Nooooooooooo!</p>\n<p><strong>Object-level</strong>:\nMy mental model of the rationality community (and, thus, some of EA) is \"<a href=\"https://www.lesswrong.com/posts/bRGbdG58cJ8RGjS5G/no-really-why-aren-t-rationalists-winning?commentId=8FLGydotT2sXr4zwt\">lots of us are mentally weird</a> people, which helps us do unusually good things like increasing our rationality, comprehending big problems, etc., but which also have predictable downsides.\"</p>\n<p>Given this, I'm pessimistic that, in our current setup, we're able to attract <em>the absolute</em> \"best and brightest and also most ethical and also most epistemically rigorous people\" that exist on Earth.</p>\n<p>Ignoring for a moment that it's just hard to find people with all of those qualities combined... what about finding people with actual-top-percentile <em>any</em> of those things?</p>\n<p>The most \"ethical\" (like professional-ethics, personal integrity, not \"actually creates the most good consequences) people are probably doing some cached thing like \"non-corrupt official\" or \"religious leader\" or \"activist\".</p>\n<p>The most \"bright\" (like raw intelligence/cleverness/working-memory) people are probably doing some typical thing like \"quantum physicist\" or \"galaxy-brained mathematician\".</p>\n<p>The most \"epistemically rigorous\" people are writing blog posts, which may or may not even make enough money for them to do <em>that</em> full-time. If they're not already part of the broader \"community\" (including forecasters and I guess some real-money traders), they might be an analyst tucked away in government or academia.</p>\n<p>A broader-problem might be something like: promote EA --&gt; some people join it --&gt; the other competent people think \"ah, EA has all those weird problems <em>handled</em>, so I can keep doing my normal job\" --&gt; EA doesn't get the best and brightest.</p>\n", "parentCommentId": null, "user": {"username": "NicholasKross"}}, {"_id": "6g5ZdofhquX5YwsTW", "postedAt": "2023-03-16T03:25:00.412Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>That assumes their level of ‘public leader-ness’ is fixed. You might prefer to have no one trying to represent EA publicly than to have people doing it sub-optimally.</p>\n", "parentCommentId": "o9uGZsAmLgz54ATkD", "user": {"username": "bec_hawk"}}, {"_id": "LL8ee9CtvmKKkKKvn", "postedAt": "2023-03-16T03:29:14.106Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I very much want this not to be true, but I suspect that if the Time editorial staff has done their due diligence, the odds of that are low. Thus it needs to be said:</p><p>Anyone who was publicly proclaiming to care about long-termism but then secretly ignoring <a href=\"https://en.wikipedia.org/wiki/Missing_stair\">the broken step</a> that was SBF—effectively trading ethics and morality for money and power—is not only a hypocrite but has done far more damage to EA than their lifetime contributions could ever offset.</p><p>I have argued previously that conflating the actions of a person with the values of a group is a fallacy. However, when a subset of that group—especially ones in leadership roles—conspires to bury unseemly information, it starts to look like the whole group is specious, tainted, and untrustworthy.</p><p>I look forward to the independent investigation report. But as resilient as I've been to the SBF implosion thus far, <strong>this</strong> is making me seriously reconsider how closely I want to associate with EA.</p>", "parentCommentId": null, "user": {"username": "DaveC"}}, {"_id": "yn3xMDrL2ngCNHhed", "postedAt": "2023-03-16T06:49:55.343Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Yeah, I think it’s probably fair to say that I worded that a bit too strongly. I do think she fits the reference class significantly less well than many of the other EAs who left (notably, she was only 23 at the time), but I should have been more precise.</p>\n", "parentCommentId": "MDs8SFtb8nb5gh8ML", "user": {"username": "nbouscal"}}, {"_id": "oaBjRbkA44vGByi62", "postedAt": "2023-03-16T07:35:09.229Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Look, I think Will has worked very hard to do good and I don’t want to minimize that, but at some point (after the full investigation has come out) a pragmatic decision needs to be made about whether he and others are more valuable in the leadership or helping from the sidelines. If the information in the article is true, I think the former has far too great a cost.&nbsp;</p><p>This was not a small mistake. It is extremely rare for charitable foundations to be caught up in scandals of this magntiude, and this article indicates that a signficant amount of the fallout could have been prevented with a little more investigation at key moments, and that clear signs of unethial behaviour were deliberately ignored. I think this is far from competent.&nbsp;</p><p>We are in the charity business. Donors expect high standards when it comes to their giving, and bad reputations directly translate into dollars. And remember, we want new donors, not just to keep the old ones. I simply don’t see how “we have high standards, except when it comes to facilitating billion dollar frauds” can hold up to scrutiny. I'm not sure we can \"credibly convince people\" if we keep the current leadership in place. The monetary cost could be substantial.&nbsp;</p><p>We also want to recruit people to the movement. Being associated with bad behaviour will hurt our ability to recruit people with strong moral codes. Worse though, would be if we encouraged “vultures”. A combination of low ethical standards and large amounts of money would make our movement an obvious target for unethical exploiters, as appears to have already happened with SBF.</p><p>Being a brilliant philosopher or intellectual does not necessarily make you a great leader. I think we can keep the benefits of the former while recognizing that someone is no longer useful at the latter. Remaining in a leadership position is a privilege, not a right.</p>", "parentCommentId": "o9uGZsAmLgz54ATkD", "user": {"username": "titotal"}}, {"_id": "ivporhmhoDPjPMBaH", "postedAt": "2023-03-16T08:00:17.848Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I'm guessing that the worry is that if Will said he thinks X then that might create pressure for the independent investigation to conclude X since the independent investigators are being paid by CEA and presumably want to be hired by other companies in the future.</p>", "parentCommentId": "bC6dwfDSPyASirZbm", "user": {"username": "casebash"}}, {"_id": "tCDyjXc6rxnMkeyCE", "postedAt": "2023-03-16T08:54:42.274Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Threats are  (usually) very bad, even if the person threatened later does something bad.  But I still don't actually feel I know \"Will did something really bad to Tara\"*, because it's so vague how far a stretch  \"basically threatenrd\" is  from \"threatened\".</p>\n<p>*I'm already convinced he made a major error of judgment in backing Sam given the existence of thr doc listing his misdeeds mentioned in the Time article.</p>\n", "parentCommentId": "tgrLLmuYfH7LRN2bA", "user": {"username": "Dr. David Mathers"}}, {"_id": "aPr99Af9jhSuDhLao", "postedAt": "2023-03-16T09:05:55.213Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think a common maladaptive pattern is to assume that the rationality community and/or EA is unusually good at \"increasing our rationality, comprehending big problems\", and I really, really, really doubt &nbsp;that \"the most \"epistemically rigorous\" people are writing blog posts\".&nbsp;</p>", "parentCommentId": "AoXrvLo2hzniWH5Xu", "user": {"username": "BenStewart"}}, {"_id": "o7vsWcbKQ6Hn9Qw2Z", "postedAt": "2023-03-16T09:10:02.784Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Personally, this solidifies my negative update over the past 6 months &nbsp;on the judgment and trustworthiness of the bulk of senior EAs. I mean trustworthiness on the basis of competence, not motive.&nbsp;</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "d4jY2HLg5nF9tQjGv", "postedAt": "2023-03-16T13:03:03.794Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Is this the time to bring up better governance again? Why do we allow CEA to be part of a foundation, controlling community assets without community oversight?</p>\n<p>If there was functional community oversight (like e.g. EA Germany has), we would know exactly why SBF was forced out of EVF (then CEA) board.</p>\n", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "iPkSAhsuoDPkuuJuy", "postedAt": "2023-03-16T13:45:27.873Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>If a global health organization made a mistake in judgment that caused [its] effectiveness to permanently decline by (say) 30%, and it was no longer effective in comparison to alternatives we could counterfactually fund, I suspect very few of us would support continuing to fund it. I would find it potentially concerning, from a standpoint of impartiality, if we do not apply the same standard to leaders. After all, we didn't protect the hypothetical global health organization's beneficiaries merely out of a sense of fairness.</p><p>I see the argument that applying such a standard to leaders could discourage them from making EV-positive bets. However, experiencing an adverse outcome on most EV-positive bets won't materially impact a leader's long-term future effectiveness. Moreover, it could be difficult to evaluate leaders from a 100% ex ante perspective. There's a risk of evaluating successful bets by their outcome (because outsiders may not understand that there was a significant bet + there is low incentive to evaluate the ex ante wisdom of taking a risk if all turned out well) but unsuccessful bets from an ex ante perspective. That would credit the leader with their winnings but not with most of their losses, and would <i>over</i>incentivize betting.</p>", "parentCommentId": "oaBjRbkA44vGByi62", "user": {"username": "Jason"}}, {"_id": "2nZsGPtkDbFr6DDrg", "postedAt": "2023-03-16T14:07:07.363Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Presumably they have interviewed Will and/or have done enough work to reliably figure out what he thinks secondhand.</p>\n<p>Independent investigators have incentives both for and against whitewashing for whoever is paying the bills. A reputation for whitewashing causes a loss in interest by organizations who want/need outsiders to view the results as unbiased.</p>\n", "parentCommentId": "ivporhmhoDPjPMBaH", "user": {"username": "Jason"}}, {"_id": "WvBStLEiv54iveFyt", "postedAt": "2023-03-16T15:01:30.126Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I am also eager to see what the investigation concludes, but I'm pretty convinced at this point that EA leaders made big mistakes.</p><p>It's not obvious to me (yet) that they should've known not to take Sam's money—non-profits accept donations from dubious characters all the time. Even if EA leaders thought Sam was sketchy (which it appears some did), it's not clear to me they should've known Sam was don't-take-money-from-this-person bad. This is a line non-profits walk all the time, and many have erred on the side of taking money from people they shouldn't have taken money from.</p><p>But I cannot wrap my head around why—knowing what it appears they knew then—anyone thought it was a good idea to put this guy on a pedestal; to elevate him as a moral paragon and someone to emulate; to tie EA's reputation so closely to his. It really feels like they should've (at least) known not to do that.</p>", "parentCommentId": "s3okjET5LSSsGg7T4", "user": {"username": "hobbes"}}, {"_id": "3N7EkmuMCoHEGR7dh", "postedAt": "2023-03-16T16:19:17.468Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><ul><li>The specificity of Naia’s allegations (the part about “Will basically threatened Tara” seems particularly important/bad)</li></ul></blockquote><p>To the contrary, this strikes me as really <i>unspecific</i>. What does it mean to \"basically threaten\" someone? What was the implied consequence of going against Will and/or Sam? What did Will say? The article raises a lot of questions.</p>", "parentCommentId": "dJ3m85GuW5pCosdAc", "user": {"username": "robirahman"}}, {"_id": "QaC6DpmisivPFKXbW", "postedAt": "2023-03-16T16:40:01.896Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Yeah, while I thought Naia provided a bunch of specifics the thing about Will threatening Tara is definitely an area where I'd find more specifics very informative.</p>", "parentCommentId": "3N7EkmuMCoHEGR7dh", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "xKsfDTuKHAKT5M27b", "postedAt": "2023-03-16T16:46:37.867Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I agree with you: When I wrote \"knew specifics about potential fraud\", I meant it roughly in the sense you described.&nbsp;</p><p>To my current knowledge, Nick did not have access to evidence that the funds were likely fraudulently obtained. (Though it's not clear that I would know if it were the case.)</p>", "parentCommentId": "JunnhYgbtpfFLkqBW", "user": {"username": "Jonas Vollmer"}}, {"_id": "CQsebP3yueCgrEiod", "postedAt": "2023-03-16T17:08:40.445Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Nathan - thanks for sharing the Time article excerpts, and for trying to promote a constructive and rational discussion.</p><p>For now, I don't want to address any of the specific issues around SBF, FTX, or EA leadership. I just want to make a meta-comment about the mainstream media's feeding frenzy around EA, and its apparently relentless attempts to discredit EA.</p><p>There's a classic social/moral psychology of 'comeuppance' going on here: any 'moral activists' who promote new and higher moral standards (such as the EA movement) can make ordinary folks (including journalists) feel uncomfortable, resentful, and inadequate. This can lead to a public eagerness to detect any forms of moral hypocrisy, moral failings, or bad behavior in the moral activist groups. If any such moral failings are detected, they get eagerly embraced, shared, signal-amplified, and taken as gospel. This makes it easier to dismiss the moral activists' legitimate moral innovations (e.g. focusing on scope-sensitivity, tractability, neglectedness, long-termism), and allows a quicky, easy return to the status quo ante (e.g. national partisan politics + scope-insensitive charity as usual).</p><p>We see this '<a href=\"https://www.amazon.com/Comeuppance-Altruistic-Punishment-Biological-Components/dp/0674032284\">psychology of comeuppance</a>' in the delight that mainstream media took when televangelists who acted greedy, lustful, and/or mendacious suffered various falls from grace over the last few decades. We see it in the media's focus on the (relatively minor) moral mis-steps and mis-statements of 'enemy politicians' (i.e. those in whatever party the journalists don't like), compared to the (relatively major) moral harms done by bad government policies. We see it throughout cancel culture, which is basically the psychology of comeuppance weaponized through social media to attack ideological enemies.</p><p>I'm not positing an organized conspiracy among mainstream journalists to smear EA. Rather, I'm pointing out a widespread human psychological propensity to take delight in any moral failings of any activist groups that make people feel morally inadequate. This propensity may be especially strong among journalists, since it motivates a lot of their investigative reporting (sometimes in the legitimate public interest, sometimes not).</p><p>I think it's useful to recognize the 'comeuppance psychology' when it's happening, because it often overshoots, and amplifies moderately bad moral errors into looking like they're super-bad moral errors. When a lot of credible, influential media sources are all piling onto a moral activist group (like EA), it can be extremely stressful, dispiriting, and toxic for the group. It can lead the group to doubt their own valid ideas and values, to collapse into schisms and recriminations, to over-correct its internal moral norms in an overly puritanical direction, and to ostracize formerly valued leaders and colleagues.&nbsp;</p><p>I've seen EA do a lot of soul-searching over the last few months. Some of it has been useful, valid, and constructive. Some of it has been self-flagellating, guilt-stricken, and counter-productive. I think we should take the Time article seriously, learn what we can from it, and update some of our views of issues and people. But I think our reactions should be tempered and contextualized by understanding that the media's 'comeuppance psychology' can also lead to hasty, reactive, over-corrections.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "KERbqSZt2fPtsTCxr", "postedAt": "2023-03-16T17:15:54.290Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think I'd bet at like 6% that evidence will come out in the next 10 years that Nick knew funds were likely fraudulently obtained. I think by normal definitions of those words it seems very unlikely to me.</p>", "parentCommentId": "xKsfDTuKHAKT5M27b", "user": {"username": "nathan"}}, {"_id": "JBK8eafr5ngT3je4w", "postedAt": "2023-03-16T17:38:39.705Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote>\n<p>... no longer effective in comparison to alternatives we could counterfactually fund ...</p>\n</blockquote>\n<p>I suspect a big part of the disagreement here is whether this aspect of the analogy holds?</p>\n", "parentCommentId": "iPkSAhsuoDPkuuJuy", "user": {"username": "Jeff_Kaufman"}}, {"_id": "DuW28srDTvbSW3qHG", "postedAt": "2023-03-16T17:46:08.619Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Can you say more about how this works with organizations like EA Germany?  I don't know anything about SBF leaving the CEA board, but here's a plausible case:</p>\n<ol>\n<li>\n<p>Some people have concerns about him.</p>\n</li>\n<li>\n<p>They talk quietly among each other.</p>\n</li>\n<li>\n<p>Someone respected quietly takes SBF aside and says they think he should resign.</p>\n</li>\n<li>\n<p>He resigns, looking externally like anyone else who leaves the board including for reasons like \"I don't have time for this now that my company is growing rapidly\".</p>\n</li>\n</ol>\n<p>In this case I think we probably wouldn't learn about 1-3 or the motivation for 4 even if there was community oversight, unless the people with the concerns or the people they shared them with decided to make them public.  And this doesn't seem like a question of governance?</p>\n<p>I do see how governance might affect what the community learned if he didn't want to step down and was voted out, but even people who don't want to leave projects often will do it without being officially forced to go if they can see how the official process would turn out and leaving voluntarily lets them save face or get concessions.</p>\n", "parentCommentId": "d4jY2HLg5nF9tQjGv", "user": {"username": "Jeff_Kaufman"}}, {"_id": "h67EHcHsEGgXrDr2p", "postedAt": "2023-03-16T17:48:16.361Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/nathan?mention=user\">@Nathan Young</a> &nbsp;This is interesting, but I'm struggling to understand how it is helpful or would change things. Can you help me understand?</p>", "parentCommentId": "sBL6uFunb7d9FgB98", "user": {"username": "more better "}}, {"_id": "ry3doMuuBmgcmL7KC", "postedAt": "2023-03-16T18:04:19.916Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Right -- I think a major crux between Nathan and Titotal's comments involve assumptions or beliefs about the extent to which certain leaders' long-term effectiveness has been impaired. My gut says there will ultimately be very significant impairment as applied to public-facing / high-visibility roles, less so for certain other roles.</p>\n<p>If almost all current leaders would be better  than any plausible replacement, even after a significant hit to long-term effectiveness, then I think that says something about the leadership development pipeline that is worth observing.</p>\n", "parentCommentId": "JBK8eafr5ngT3je4w", "user": {"username": "Jason"}}, {"_id": "ThFivbLG75Lfv7nyD", "postedAt": "2023-03-16T18:58:15.764Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Although my feelings are broadly more optimistic about EA's ability to improve its institutions and move forward than many stances I've seen, the entire trajectory of the FTX blowup has made me prefer the idea of a career that takes me farther away from insular EA bubbles, rather than a career that immerses me in EA bubbles. It's not a huge change--I just used to think that I wouldn't particularly care if I stayed in an EA bubble professionally, and now that seems unwise, making some career choices even more favorable than previously. This article specifically didn't cause the change, but it's something I've been mulling over for a while and I think this simply crystallized the thought for me.</p>", "parentCommentId": null, "user": {"username": "Gavriel Kleinwaks"}}, {"_id": "pXaWuWeQzcajcmNSq", "postedAt": "2023-03-16T19:00:15.390Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>If almost all current leaders would be better than any plausible replacement, even after a significant hit to long-term effectiveness, then I think that says something about the leadership development pipeline that is worth observing.</p></blockquote><p>I think it's relatively obvious that there's a dearth of competent leadership/management in EA. I think this is even more extreme for EA qua EA, since the personal costs : altruistic rewards tradeoff for EA qua EA work is arguably worse than e.g. setting up an AI governance initiative or leading a biosecurity project.</p>", "parentCommentId": "ry3doMuuBmgcmL7KC", "user": {"username": "Linch"}}, {"_id": "jooqAt7rDTjD5JR5s", "postedAt": "2023-03-16T21:02:56.912Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>EA Germany board members are voted into office by members (aka the community). The board is formally responsible to ordinary community members, and they need to explain their actions. So the remaining board members would at the very least face questions. It's not a complete fix of course, but I think it could have helped.</p>\n", "parentCommentId": "DuW28srDTvbSW3qHG", "user": {"username": "ludwigbald"}}, {"_id": "RuPZfXpKkjJXsNy4d", "postedAt": "2023-03-16T21:58:27.287Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Would the board normally face questions if someone left?  Especially if they [edit: as in \"the person leaving\"] clearly had other big things they were working on?</p>\n", "parentCommentId": "jooqAt7rDTjD5JR5s", "user": {"username": "Jeff_Kaufman"}}, {"_id": "EyajaEsk7Z5E5J4Sa", "postedAt": "2023-03-16T22:22:30.590Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>That doesn’t create the same pressure as a public statement which signals “this is the narrative”.</p>\n", "parentCommentId": "2nZsGPtkDbFr6DDrg", "user": {"username": "casebash"}}, {"_id": "kWFAYp2ARCaHbydvu", "postedAt": "2023-03-16T22:39:18.966Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>That sounds like a very sensible set-up (aside from anything else, presumably it significantly lessens the chances of a \"surprise! we bought an abbey\" moment).</p>", "parentCommentId": "jooqAt7rDTjD5JR5s", "user": {"username": "britomart"}}, {"_id": "HTSBfKGqy2iQFsKDE", "postedAt": "2023-03-16T22:43:53.217Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Thanks for making the case. I'm not qualified to say how good a Board member Nick is, but want to pick up on something you said which is widely believed and which I'm highly confident is false.</p>\n<p>Namely - it isn't hard to find competent Board members. There are literally thousands of them out there, and charities outside EA appoint thousands of qualified, diligent Board members every year. I've recruited ~20 very good Board members in my career and have never run an open process that didn't find at least some qualified, diligent people, who did a good job.</p>\n<p>EA makes it hard because it's weirdly resistant to looking outside a very small group of people, usually high status core EAs. This seems to me like one of those unfortunate examples of EA exceptionalism, where EA thinks its process for finding Board members needs to be sui generis. EA makes Board recruitment hard for itself by prioritising 'alignment' (which usually means high status core EAs) over competence, sometimes with very bad results (e.g. ending up with a Board that has a lot of philosophers and no lawyers/accountants/governance experts).</p>\n<p>It also sometimes sounds like EA orgs think their Boards have higher entry requirements than the Boards of other well-run charities. Ironically, this typically produces very low quality EA Boards, mainly made up of inexperienced people without relevant professional skills, but who are thought of as 'smart' and 'aligned'.</p>\n<p>Of course, it will be hard to find new Board members right now, because CEA's reputation is in tatters and few people will want to join an organisation that is under serious legal threat. But it seems at best a toss up whether it's worth keeping tainted Board member(s) because they might be tricky to replace, especially when they have recused themselves from literally the single biggest issue facing the charity.</p>\n", "parentCommentId": "coML6P3qMKhhQH5nK", "user": {"username": "jlewars"}}, {"_id": "xMQnjwLAsbizqch87", "postedAt": "2023-03-16T22:51:38.237Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Isn't part of this considering whether Will's comparative advantage is as a Board member? It seems very unlikely to me that it is, versus being a world class philosopher and communicator.</p>\n<p>So I agree with your general point that leaders who make mistakes might not need to resign, but in the specific case I can't see how Will is most impactful by being a Board member at really any org, as opposed to e.g. a philosophical or grant-making advisor.</p>\n", "parentCommentId": "o9uGZsAmLgz54ATkD", "user": {"username": "jlewars"}}, {"_id": "wocXakjCqAm6deRkr", "postedAt": "2023-03-16T23:12:50.357Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>And even if one really values \"alignment,\" I suspect that a board's alignment is mostly that of its median member. That may have been less true at EVF where there were no CEOs, but boards are supposed to exercise their power collectively.</p>\n<p>On the other hand, a board's  level of legal, accounting, etc. knowledge is not based on the mean or median; it is mainly a function of the most knowledgeable one or two members.</p>\n<p>So if one really values alignment on say a 9-member board, select six members with an alignment emphasis and three with a business skills emphasis. (The +1 over a bare majority is to keep an alignment majority if someone has to leave.)</p>\n", "parentCommentId": "HTSBfKGqy2iQFsKDE", "user": {"username": "Jason"}}, {"_id": "mkJ6fizucgBaqdBFc", "postedAt": "2023-03-16T23:33:48.340Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>This is a really good comment!</p>", "parentCommentId": "wocXakjCqAm6deRkr", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "uoXqFf5Bb5A45yYM5", "postedAt": "2023-03-16T23:42:15.919Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Alignment is super-important for EA organisations, I would put it as priority number 1, because if you're aligned to EA values then you're at least trying to do the most good for the world, whereas if you're not, you may not be even trying to do that.</p><p>For an example of a not-for-profit non-EA organisation that has suffered from a lack of alignment in recent times, I would point to the Wikimedia Foundation, which has regranted excess funds to extremely dubious organisations: <a href=\"https://twitter.com/echetus/status/1579776106034757633\">https://twitter.com/echetus/status/1579776106034757633</a> (see also: https://en.wikipedia.org/wiki/Wikipedia:Wikipedia_Signpost/2022-10-31/News_and_notes ). This is quite apart from the encyclopedia project itself arguably deviating from its stated goals of maintaining a neutral point of view, which is a whole other level of misalignment, but I won't get into that here.</p>", "parentCommentId": "HTSBfKGqy2iQFsKDE", "user": {"username": "Robin_Green"}}, {"_id": "tGMfSricSn6RfHJhY", "postedAt": "2023-03-17T03:52:55.228Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Are they issuing comeuppance because you've positioned yourselves above them morally and they're waiting to pounce on any mistake, or are they issuing comeuppance because EA didn't listen to anyone who warned them about obvious scams? I don't think the only reason there is a widespread media attack on EA (which is not really even true), is because you're simply more morally active than them and they are uncomfortable with that. Plenty of journalists are activists themselves who think EA isn't even doing enough, so the witch hunt argument doesn't really make sense does it?</p>", "parentCommentId": "CQsebP3yueCgrEiod", "user": {"username": "Apples to Apples"}}, {"_id": "HFEwB4Jn6GjEbKGBa", "postedAt": "2023-03-17T06:39:18.172Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/jeff_kaufman?mention=user\">@Jeff Kaufman</a> &nbsp;technically you might be right that even if board members were voted in and were responsible to members, they wouldn't <i><strong>have to</strong></i> disclose their information of explain their actions.&nbsp;</p><p>But if you are voted in and therefore formally accountable to members, you are likely to both feel obligated to explain things like this, and also be motivated to explain important goings on to keep your support to ensure you have a mandate in the community to stay on the board.</p><p>Whether we agree or disagree with boards being more democratic (a different question) assuming a board is voted in it's hard to imagine they wouldn't be far more likely to publicly explain their actions and face questions.&nbsp;</p><p>I'm also often confused by this common argument I see on the EA forums that people might not have time, or might consider other things more important than responding to critical governance issues or decision making - I remember this argument touted on the open phil thread. It seems a convenient excuse for not publicly responding to issues, which seems like a key function of any management body. There may be other good legal or confidentiality reasons not to respond, but I find the \"workingother things\" or \"not enough time\" reasoning weak.&nbsp;</p>", "parentCommentId": "RuPZfXpKkjJXsNy4d", "user": {"username": "NickLaing"}}, {"_id": "HLsvJGDDWAxn8Xy68", "postedAt": "2023-03-17T07:52:17.955Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/jacklewars?mention=user\">@Jack Lewars</a> is spot on. If you don’t believe him, take a look at the list of ~70 individuals on the EA Good Governance Project’s <a href=\"https://www.eagoodgovernance.com/\">trustee directory</a>. In order to effectively govern you need competence and no collective blindspots, not just value alignment.</p>", "parentCommentId": "HTSBfKGqy2iQFsKDE", "user": {"username": "Grayden"}}, {"_id": "Lr5BQv9stgvnLNpoG", "postedAt": "2023-03-17T07:55:14.441Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>There are so many parallels to the Christian church</p>\n", "parentCommentId": "CQsebP3yueCgrEiod", "user": {"username": "Grayden"}}, {"_id": "ucjL2tmkeg9nsjcrY", "postedAt": "2023-03-17T08:02:28.172Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>There are some very competent leaders within EA so I don’t think we should make sweeping assumptions. I think we need to make EA a meritocracy</p>\n", "parentCommentId": "o7vsWcbKQ6Hn9Qw2Z", "user": {"username": "Grayden"}}, {"_id": "BqJY36R64DhJwwuQ3", "postedAt": "2023-03-17T08:46:57.484Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Thanks for sharing this, I already knew about the phenomena and had vague thoughts this might be a significant contributor, but appreciate you spelling it out.&nbsp;</p><p>I'm suspecting that the comeuppance-related behavior is not only about EA being a movement emphasizing ethical innovation, but also about EA recently gaining a lot in more visible influence and social status, e.g. via more public outreach campaigns leading to features in cover stories. My &nbsp;impression is that the distribution of social status of public actors and social movements is fairly zero sum (actually probably even negative sum because of the incentives to invest in and stick to defensive PR). This, combined with the public discourse being relatively scatterbrained and not very optimized for truth-seeking leads to a lot of distorted publications that aim more at lowering the social standing of an actor than giving a clear impression of what is really going on.</p>", "parentCommentId": "CQsebP3yueCgrEiod", "user": {"username": "MaxRa"}}, {"_id": "YbjJFEGHFvC9JWgiQ", "postedAt": "2023-03-17T09:29:50.182Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Hi Robin - thanks for this and I see your point. I think Jason put it perfectly above - alignment is often about the median Board member, where expertise is about the best Board member in a given context. So you can have both.</p>\n<p>I have also seen a lot of trustees learn about the mission of the charity as part of the recruitment process and we shouldn't assume the only aligned people are people who already identify as EAs.</p>\n<p>The downsides of prioritising alignment almost to the exclusion of all else are pretty clear, I think, and harder to mitigate than the downsides or lacking technical expertise, which takes years to develop.</p>\n", "parentCommentId": "uoXqFf5Bb5A45yYM5", "user": {"username": "jlewars"}}, {"_id": "cz3RnPPffvMg4ag9H", "postedAt": "2023-03-17T09:40:01.766Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Sure, but my impression of the number of them and their competence has decreased. It’s still moderately high. And meritocracy cuts both ways - meritocracy would push harder on judging current leaders by their past success - Ie harshly - and not be as beholden to contingent or social reasons for believing they’re competent</p>\n", "parentCommentId": "ucjL2tmkeg9nsjcrY", "user": {"username": "BenStewart"}}, {"_id": "kSWgBphCyZoDxBnhv", "postedAt": "2023-03-17T10:28:09.740Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I don't think we actually want to incentivise positive-EV bets as such? Some amount of risk aversion ought to be baked in. Going solely by EV only makes sense if you make many repeated uncorrelated bets, which isn't really what Longtermists are doing.</p>\n", "parentCommentId": "iPkSAhsuoDPkuuJuy", "user": {"username": "Guy Raveh"}}, {"_id": "uuQLFCm3soCcMWbpJ", "postedAt": "2023-03-17T10:53:07.232Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Sorry, edited my comment to clarify what I meant by being busy here. The idea isn't that people might not have time to respond to questions, it's that the CEO of a fast growing startup deciding they don't have time to be on the board of a foundation isn't likely to generate questions.</p>\n", "parentCommentId": "HFEwB4Jn6GjEbKGBa", "user": {"username": "Jeff_Kaufman"}}, {"_id": "KQhRuN9LCnKLT3C2s", "postedAt": "2023-03-17T11:34:40.417Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Fair enough -- my attempted point was to acknowledge concerns that being too quick to replace leaders when a bad outcome happened might incentivize them to be suboptimally conservative when it comes to risk.</p>\n", "parentCommentId": "kSWgBphCyZoDxBnhv", "user": {"username": "Jason"}}, {"_id": "FfsxRcRuWmJtqRGME", "postedAt": "2023-03-17T13:10:44.350Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote>\n<p>to put this guy on a pedestal; to elevate him as a moral paragon and someone to emulate; to tie EA's reputation so closely to his</p>\n</blockquote>\n<p>I always find this claim a bit confusing: did we actually do those things? Are there some specific examples of doing this?</p>\n<p>I can think of... the 80k interview and that's about it? I guess engaging with the FTX Foundation was somewhat positive but I don't think it was putting him on a pedestal. In fact when I look back I feel like a lot of the content linking Sam to EA came from <em>people talking to Sam</em>. I may well just not be remembering stuff though!</p>\n<p>I don't deny that Sam <em>was</em> perceived in that way, but it's not clear to me that this was something that was done (even accidentally) by \"EA leaders\".</p>\n", "parentCommentId": "WvBStLEiv54iveFyt", "user": {"username": "Michael_PJ"}}, {"_id": "ijcsatT4WXik6ZijT", "postedAt": "2023-03-17T14:19:05.582Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>The nature of most EA funding also provides a check on misalignment. An EA organization that became significantly misaligned from its major funders would quickly find itself unfunded. As opposed to Wikimedia, which had/has a different funding structure as I understand it.</p>\n", "parentCommentId": "YbjJFEGHFvC9JWgiQ", "user": {"username": "Jason"}}, {"_id": "nCLhHZFHhTTCMteYA", "postedAt": "2023-03-17T14:40:42.820Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I agree with you're first half. I wonder if a startup or even a non-EA non-profit would be so self-flagellating for taking his money, even given they had heard some troubling reports. If not, I think EAs should chill out on thinking we could have been expected to do a deep investigation [Edit: apparently CEA did one on CEA/Alameda relations in 2019 but no comment yet on how it went] or hold-off on taking money. I mean everyone else had his expected net worth wrong too (Billionaire lists for example, and FTX's own investors who should have been much more interested in internals than donation recipients). [Some data/insider info on how much big charities like WWF or Doctors Without Borders investigate donors would be great here, but without seeing that I'm assuming it was normal to accept money from SBF]</p>\n<p>But as for the idea he was framed as a moral paragon by leaders, idk. I never got that vibe. Was I missing it? It seems more like he was framed, by news outlets and everyman EAs, and maaaybe some EA leaders on occasion but I actually don't even remember this except for from Sam's promos himself, as more of a cool-but-humble industrious  guy than a moral leader or rep of the movement itself if anything. I mean did he ever speak at an EAG or something? What would it even look like if EA leaders were tying EA's rep to his? Maybe he was mentioned some (usually non-EA) places as a notable personality in the movement.? But that doesn't to me say \"this guy's put on a pedestal by leaders\" and \"emulate this guy\" (in fact EAs wanted people to not emulate him and try direct work first).  I honestly wonder if I missed something.</p>\n<p>My weakly-held take is: You can't help it if cool-seeming billionaires get fans, and it is hard to help it if those cool billionaires get associations with the things they fund and <em>themselves talk about</em>. Ex: Elon who people associate with AI safety even though he has never worked on it himself. Associations in the eyes of the public, and news outlets/bloggers/Twitter bumping those associations are gonna happen. I'm not sure EA leaders did anything to boost (or stem!) this effect (fine with being proven wrong though). I do hope/demand that next time, EA leaders are more protective of the EA brand and do try to stem this potential association effect. Like \"Hey buddy, <em>we</em> already weren't gonna put you on a pedestal for being associated with our brand, but actually you don't get to do that either. Please keep involvement with us out of your public talks and self-promotion. We want to be known for the work we do, not who funds us\" Dustin does this (keeps EA out of his professional brand). And most wealthy people prefer to donate discretely so it was maybe a red flag that SBF leaned right into being associated with EA, and would be a red flag in future too. Idk.</p>\n<p>[Edit: You might consider the last part negligence, that EA leaders didn't give SBF a slap on the wrist for EA-associating. If so maybe you still aren't happy with leadership. But I just want to flag that if that is what happened that is still much better than leaders actively boosting him (could be wrong that the latter happened though) and would likely warrant different response. I guess  I view the former as \"mistakes of medium-size (but small for most leaders due to diffuse responsibility <em>if</em> there was no one whose job it clearly was to talk to Sam about this), passively made, not-unusual-behavior\" whereas I'd view active pedestalling or active tying-EA-rep-with-SBF to be \"big mistakes, actively made, unusual behavior\"]</p>\n", "parentCommentId": "WvBStLEiv54iveFyt", "user": {"username": "Ivy_Mazzola"}}, {"_id": "Eikjsmqme6PfDZaJy", "postedAt": "2023-03-17T15:08:37.502Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>MaxRa - I agree this is also part of the mainstream media's anti-EA mind-set: a zero-sum view of influence, prestige, and power. There are many vested interests (e.g. traditional political institutions, charities, think tanks, media outlets) that are deeply threatened by EA, because they simply don't care about scope-sensitivity, tractability, neglectedness, or long-termism. Indeed, these EA values directly challenge their day-to-day partisanship and virtue-signaling.</p><p>The EA movement may have naively under-estimated the strength of these vested interests, and their willingness to play dirty (through negative PR campaigns) to protect their influence.</p>", "parentCommentId": "BqJY36R64DhJwwuQ3", "user": {"username": "geoffreymiller"}}, {"_id": "Jp7oy68K5FrY4x8Kc", "postedAt": "2023-03-17T15:10:47.806Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>There is the whole vouching for SBF as prospective purchaser of Twitter:</p>\n<p><em>You vouch for him?</em></p>\n<p><em>Very much so! Very dedicated to making the long-term future of humanity go well.</em></p>\n", "parentCommentId": "FfsxRcRuWmJtqRGME", "user": {"username": "Jason"}}, {"_id": "rCwLiK7r2QaBfCGoh", "postedAt": "2023-03-17T16:02:57.475Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>How was he to know that was going to be made public? That's not \"to put this guy on a pedestal; to elevate him as a moral paragon and someone to emulate; to tie EA's reputation so closely to his,\" that's \"I think these two should talk and it seems like that comes down to how much I vouch for him. And honestly I do vouch for him in this context [given what I know at this point].\"</p>", "parentCommentId": "Jp7oy68K5FrY4x8Kc", "user": null}, {"_id": "bcaENHEotzpsFAFu7", "postedAt": "2023-03-17T16:04:12.948Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I of course knew that FTX and Alameda were very closely related, that Sam and Caroline were dating and that the two organizations had very porous boundaries. But I did not know that the rest of the world did not know this, and I had no idea that it mattered much legally. They were both located in the Bahamas, and I definitely did not know enough finance law to know that these two organizations were supposed to operate at arms length.</p>\n<p>Maybe there was someone else who did successfully put the pieces together and then stayed quiet, but I would definitely not treat this as a \"smoking gun\" since I saw it myself, as did many people I know, and neither me nor other people realized that this was actually pretty shady.</p>\n<p>And legally there were actually distinct companies, at least the same way GiveWell and OpenPhil were different companies back in 2018 when they still worked in the same office and shared some leadership, and that itself doesn't raise any flags for me. FTX and Alameda definitely actually were different companies with some offices being just for Alameda (like the one in Berkeley), though they definitely did not operate \"at arms length\" as I think the legal situation required.</p>\n", "parentCommentId": "oLWqtwfjiEE4us3oz", "user": {"username": "Habryka"}}, {"_id": "SKcsadvNYJQG4hXz6", "postedAt": "2023-03-17T16:12:15.062Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Also the 80k interview was done by 80k...has anyone claimed that Rob Wiblin or anyone at 80k knew Sam was \"sketchy\"? Apparently Rob <a href=\"https://forum.effectivealtruism.org/posts/RPTPo8eHTnruoFyRH/some-important-questions-for-the-ea-leadership?commentId=Xr27yCbC72ZPh5Fzn\">wasn't even corrected about Sam's non-frugality</a> - he sounds kind of out of the loop.</p>", "parentCommentId": "FfsxRcRuWmJtqRGME", "user": null}, {"_id": "kgakhtnrMWjE4FSSs", "postedAt": "2023-03-17T16:31:16.160Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>@Michael_PJ offered a comment about \"content linking Sam to EA.\" That last sentence is hard to read as anything but.</p>\n<p>One should know that conversations with someone as famous and unfiltered as Elon Musk about the year's most-talked about acquisition could go public. There are also other non-public boosts like the quote at the end of the article. But even if not, the private vouch still goes to @lilly 's point about why anyone would boost/vouch for SBF \"knowing what it appears they knew then.\"</p>\n", "parentCommentId": "rCwLiK7r2QaBfCGoh", "user": {"username": "Jason"}}, {"_id": "g55iNDKx8xACGoDzs", "postedAt": "2023-03-17T16:53:36.643Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Maybe he knew there was a chance his text would end up being publicly revealed in court (I wouldn't, but okay), but that's quite different from public promotion. And I wouldn't consider this \"content linking Sam to EA\" either, and anyway the context of Michael_PJ using those words was the thing I quoted - that's the relevant thing we're discussing here. And again, the quote at the end of the article doesn't read to me as \"to put this guy on a pedestal; to elevate him as a moral paragon and someone to emulate; to tie EA's reputation so closely to his\" (although granted maybe \"friend\" was unnecessary for a simple \"thanks for hosting\"). And if I was him, I think I'd have vouched for SBF to Musk too: \"You're both cut-throat businessmen, both insanely good at making money, both very dedicated to making the long-term future go well...I think you'll get on just fine.\"</p>", "parentCommentId": "kgakhtnrMWjE4FSSs", "user": null}, {"_id": "eQGiTouEWfXjNaov3", "postedAt": "2023-03-17T16:58:20.370Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>What \"organization\" do you currently have evidence is \"running\" a negative PR campaign against us because we directly threaten its interests? We're not a threat to TIME magazine in any way I can see.&nbsp;</p>", "parentCommentId": "Eikjsmqme6PfDZaJy", "user": {"username": "Dr. David Mathers"}}, {"_id": "93Lqdmzv6a8XSdBdu", "postedAt": "2023-03-17T17:02:44.554Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Hm you say \"EA didn't listen to anyone who warned them about obvious scams\", but the article says:&nbsp;</p><blockquote><p>None of the early Alameda employees who witnessed Bankman-Fried’s behavior years earlier say they anticipated this level of alleged criminal fraud. There was no “smoking gun,” as one put it, that revealed specific examples of lawbreaking. Even if they knew Bankman-Fried was dishonest and unethical, they say, none of them could have foreseen a fraud of this scope.</p></blockquote><p>And</p><blockquote><p>No one has alleged criminal behavior on the part of top EA figures. None of the people who raised concerns about Bankman-Fried to EA leaders in 2018 and 2019 say they warned about specific criminal activity, nor did they foresee the size and scope of the alleged fraud at the heart of the FTX collapse. In charging documents, federal prosecutors identify the start of Bankman-Fried’s alleged fraud as 2019.</p></blockquote><p>So I'm not sure you can say there were warnings of \"obvious scams\".<br><br>Also</p><blockquote><p>Sometime [in 2019], the Centre for Effective Altruism did an internal investigation relating to CEA and Alameda, according to one person who was contacted during the investigation, and who said it was was conducted in part by MacAskill. Bankman-Fried left the board of the organization in 2019. The Centre for Effective Altruism did not respond to repeated requests from TIME to discuss the circumstances leading to his departure; MacAskill and others declined multiple opportunities to answer questions about those events.</p></blockquote><p>So I'm not sure it is accurate to say that \"EA didn't listen to\" the warnings which <i>were</i> given. I'm certainly curious about the quality of the internal investigation by CEA. I wouldn't be surprised if there were gaps/it was of low quality. But I <i>also</i> wouldn't be surprised if it was of expected/good quality given the nature of the complaints made. And I wouldn't be surprised to find that Sam would have fooled a non-EA, commissioned investigation too, enough that non-EA nonprofits would have felt comfortable taking his money. I mean, I assume Sam would have refused to give internal financial documents to independent investigators, and such a refusal to engage thoroughly from Alameda (\"Um, no you can't see our internal documents? Who do you think you are..?\") would be so normal for an investment firm that it can't even be seen as a red flag.&nbsp;<br><br>I'm not surprised that CEA is refusing to comment til after the commissioned independent investigation is complete, whether or not their 2019 internal investigation was of high, decent, or low quality. I'm not sure which it was yet. I guess I'll wait to see.&nbsp;<br><br>[Edit: In general I'm against pushing to make others responsible for the sins of others &nbsp;without a lot of proof. &nbsp;Especially when the \"sinners\" had dark triad traits who could have been trying to manipulate the others. I know the general population and journalists don't think that way or have as much patience in that regard, but I'd like it if EAs did. Judge leadership for competence, and replace them if needed, sure, but comeuppance here is still likely to be punishment for trying and failing. And I think punishment should be reserved for the actual sinners themselves. I'm not at all sure anyone who didn't work directly with SBF at Alameda \"sinned\" here. And if they didn't, EA itself and EA leaders don't \"deserve\" comeuppance, IMO.&nbsp;<br><br>I find comeuppance as journalistic motivation plausible, but I also admit that comeuppance might <i>not</i> be the journalist's intention with this article, even subconsciously. But it sounds like you are also arguing that comeuppance would be warranted for other reasons here, and I just don't think so. Comeuppance is moral punishment. I'll reiterate that it would be fine to push that leadership should be changed (after the investigation). But let the actual sinners, and the sinners alone, be punished for their sins. [[I don't want to suppress discussion, so sure, <a href=\"https://manifold.markets/IsaacKing/by-the-end-of-2023-will-substantial\">place your bets</a>, but please don't <i>assume </i>moral fault yet.]]<br><br>Finally, I agree with you that many journalists are activists themselves. But I'll also note that when journalists and others say that \"EA isn't doing enough\", they are still potentially using another way to shame moral actors who otherwise appear to be doing more than them. It is a frame that EA has more agency and privilege than them (perhaps unjustly given), <i>but still has less actual goodness and merit than them</i>. So I still find it very plausible that the recent journalists are (consciously or unconsciously) doling out extra blame and shame to put aspiring altruists in their place. And if it is not the journalists themselves doing this, perhaps, as a business, they are catering to the many, many readers who click for and revel in \"comeuppance\".]</p>", "parentCommentId": "tGMfSricSn6RfHJhY", "user": {"username": "Ivy_Mazzola"}}, {"_id": "RAjaHFCN3MGqmqxxi", "postedAt": "2023-03-17T17:20:08.368Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Yes, I think that him, e.g. being interviewed by 80K didn't make much of a difference. I think that EA's reputation would inevitably be tied to his to an extent given how much money they donated and the context in which that occurred. People often overrate how much you can influence perceptions by framing things differently.</p>", "parentCommentId": "FfsxRcRuWmJtqRGME", "user": {"username": "Stefan_Schubert"}}, {"_id": "9rdNoSnfwBxosvCKK", "postedAt": "2023-03-17T18:38:00.354Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>TL;DR: You're incorrectly<strong> </strong>assuming I'm into Nick mainly because of value alignment, and while that's a relevant factor, <strong>the main factor is that he has an unusually deep understanding of EA/x-risk work that competent EA-adjacent professionals lack.</strong></p><p>I might write a longer response. For now, I'll say the following:</p><ul><li>I think <strong>a lot of EA work is pretty high-context</strong>, and most people don't understand it very well. E.g., when I ran EA Funds work tests for potential grantmakers (which I think is somewhat similar to being a board member), I observed that highly skilled professionals consistently failed to identify many important considerations for deciding on a grant. But, after engaging with EA content at an unusual level of depth for 1-2 years, they can improve a lot (i.e., there were some examples of people improving their grantmaking skills a lot). Most such people never end up attaining this level of engagement, so they never reach the level of competence I think would be required.</li><li>I agree with you that too much of a focus on high status core EAs seems problematic.</li><li>I think value-alignment in a broader sense (not tracking status, but actual altruistic commitment) matters a great deal. E.g., given the choice between personal prestige and impact, would the person reliably choose the latter? I think some high-status core EAs who were on EA boards were <strong>not</strong> value-aligned in this sense, and this seems bad.</li></ul><p>&nbsp;</p><p>EDIT: <a href=\"https://www.cold-takes.com/nonprofit-boards-are-weird-2/\">Relevant quote</a>—I think this is where Nick shines as a board member:</p><blockquote><p>For example, if a nonprofit's mission is \"Help animals everywhere,\" does this mean \"Help as many animals as possible\" (which might indicate a move toward focusing on farm animals) or \"Help animals in the same way the nonprofit traditionally has\" or something else? How does it imply the nonprofit should make tradeoffs between helping e.g. dogs, cats, elephants, chickens, fish or even insects? How a board member answers questions like this seems central to how their presence on the board is going to affect the nonprofit.</p></blockquote>", "parentCommentId": "HTSBfKGqy2iQFsKDE", "user": {"username": "Jonas Vollmer"}}, {"_id": "z3sdJkNkaGC3NQC3v", "postedAt": "2023-03-17T18:41:24.854Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>You seem to imply that it's fine if some board members are not value-aligned as long as the median board member is. I strongly disagree: This seems a brittle setup because the median board member could easily become non-value-aligned if some of the more aligned board members become busy and step down, or have to recuse due to a COI (which happens frequently), or similar.&nbsp;</p>", "parentCommentId": "wocXakjCqAm6deRkr", "user": {"username": "Jonas Vollmer"}}, {"_id": "XeN8vuFxi33boAMyB", "postedAt": "2023-03-17T18:44:33.288Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I would be willing to take the other side of this bet, if the definition of \"fraud\" is restricted to \"potentially stealing customer funds\" and excludes thinks like lying to investors.</p>", "parentCommentId": "KERbqSZt2fPtsTCxr", "user": {"username": "Jonas Vollmer"}}, {"_id": "sP8ZBYBg7z4jfxdvq", "postedAt": "2023-03-17T18:50:27.838Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>no lawyers/accountants/governance experts</p></blockquote><p>I have a fair amount of accounting / legal / governance knowledge and as part of my board commitments think it's a lot less relevant than deeply understanding the mission and strategy of the relevant organization (along with other more relevant generalist skills like management, HR, etc.). Edit: Though I do think if you're tied up in the decade's biggest bankruptcy, legal knowledge is actually really useful, but this seems more like a one-off weird situation.</p>", "parentCommentId": "HTSBfKGqy2iQFsKDE", "user": {"username": "Jonas Vollmer"}}, {"_id": "NEpwDbqBBsvYqDRt2", "postedAt": "2023-03-17T19:20:25.865Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I don't agree with that characterization.</p>\n<p>On my 6/3 model, you'd need four recusals among the heavily aligned six and zero among the other three for the median member to be other; three for the median to be between heavily aligned and other. If you're having four of six need to recuse on COI grounds, there are likely other problems with board composition at play.</p>\n<p>Also, suggesting that alignment is not the \"emphasis\" for each and every board seat doesn't mean that you should put misaligned or truly random people in <em>any</em> seat. One still should expect a degree of alignment, especially in seat seven of the nine-seat model. Just like one should expect a certain level of general board-member competence in the six seats with alignment emphasis.</p>\n", "parentCommentId": "z3sdJkNkaGC3NQC3v", "user": {"username": "Jason"}}, {"_id": "uqcCAo4noFeEy5Woe", "postedAt": "2023-03-17T20:30:29.988Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>So: excludes securities fraud?</p>\n", "parentCommentId": "XeN8vuFxi33boAMyB", "user": {"username": "Jason"}}, {"_id": "GZKrpahoKminuzntY", "postedAt": "2023-03-17T21:33:27.097Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>It's clear to me that the pre-FTX collapse EVF board, at least, needed more \"lawyers/accountants/governance\" expertise. If someone had been there to insist on good governance norms, I don't believe that statutory inquiry would likely have been opened - at a minimum it would have been narrower. Given the very low base rate of SIs, I conclude that the external evidence suggests the EVF UK board was very weak in legal/accounting/governance etc. capabilities.</p>\n", "parentCommentId": "sP8ZBYBg7z4jfxdvq", "user": {"username": "Jason"}}, {"_id": "XfFxRuGFMmhuWBJns", "postedAt": "2023-03-17T22:06:31.382Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think 9-member boards are often a bad idea because they tend to have lots of people who are shallowly engaged, rather than a smaller number of people who are deeply engaged, tend to have more diffusion of responsibility, and tend to have much less productive meetings than smaller groups of people. While this can be mitigated somewhat with subcommittees and specialization, I think the optimal number of board members for most EA orgs is 3–6.</p>", "parentCommentId": "NEpwDbqBBsvYqDRt2", "user": {"username": "Jonas Vollmer"}}, {"_id": "BxKvRdBbGunSh5pZ7", "postedAt": "2023-03-17T22:09:23.454Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>That was an example; I'd want it to exclude any type of fraud except for the large-scale theft from retail customers that is the primary concern with FTX.</p>", "parentCommentId": "uqcCAo4noFeEy5Woe", "user": {"username": "Jonas Vollmer"}}, {"_id": "QFGFDegypEHev78S7", "postedAt": "2023-03-17T23:00:59.201Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Although at that point -- at least in my view -- the bet is only about a subset of knowledge that could have rendered it ethically unacceptable to be involved with FTXFF. Handing out money which you believed more likely than not to have been obtained by defrauding investors or bondholders would also be unacceptable, albeit not as heinous as handing out money you believed more likely than not to have been stolen from depositors. (I also think the ethically acceptable risk is less than \"more likely than not\" but kept that in to stay consistent with Nathan's proposed bet which used \"likely.\")</p>", "parentCommentId": "BxKvRdBbGunSh5pZ7", "user": {"username": "Jason"}}, {"_id": "JnoTKuDHDndGZJFry", "postedAt": "2023-03-17T23:26:41.765Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>It seems intuitive that your chances of ending up in a one off weird situation are reduced if you have people who understand the risks properly in advance. I think a lot of what people with technical expertise do on Boards is reduce blind spots.</p>\n", "parentCommentId": "sP8ZBYBg7z4jfxdvq", "user": {"username": "jlewars"}}, {"_id": "Dt2vBoWp4fAhNhnBW", "postedAt": "2023-03-17T23:30:05.292Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I'm very surprised that you think a 3 person Board is less brittle than a bigger Board with varying levels of value alignment. How do 3 person Boards deal with all the things you list that can affect Board make up? They can't, because the Board becomes instantly non-quorate.</p>\n", "parentCommentId": "z3sdJkNkaGC3NQC3v", "user": {"username": "jlewars"}}, {"_id": "ZnfRqReyMA62Jjxuj", "postedAt": "2023-03-18T10:27:42.949Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think that's a good example of \"why would people do this given what they knew?\", I'm not sure it's an example of pedestalising etc. I'm being a bit fussy here because I do think I've seen the <em>specific</em> claim that there was lots of public promotion of Sam and I'm just not sure if it's true.</p>\n", "parentCommentId": "Jp7oy68K5FrY4x8Kc", "user": {"username": "Michael_PJ"}}, {"_id": "WYKnfqF66S5fvrHgD", "postedAt": "2023-03-18T11:30:17.117Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>I do think I've seen the <i>specific</i> claim that there was lots of public promotion of Sam</p></blockquote><p>Fuss away. E.g.</p><ol><li><a href=\"https://forum.effectivealtruism.org/posts/oiEArRjkajAKayMCp/what-might-ftx-mean-for-effective-giving-and-ea-funding\">Jack Lewars</a> \"to avoid putting single donors on a huge pedestal inside and outside the community\" and<a href=\"https://forum.effectivealtruism.org/posts/7o8foiTKYdRrgtzyE/if-professional-investors-missed-this#6gHC2PyELpTG84BcA\"> again</a> \"putting [SBF] on a pedestal and making them symbolic of EA\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/RPTPo8eHTnruoFyRH/some-important-questions-for-the-ea-leadership?commentId=SsXtygownkdxR9g3E\">Gideon Futerman</a> \"making and encouraging Will (and I guess until recently to a lesser extent SBF) the face of EA\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=zFCaioEZJunCuccSi\">tcheasdfjkl</a> \"while a lot of (other?) EAs are promoting him publicly\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/dMcPi5BDy5mQHZHGH/stop-overreacting-re-ftx-sbf?commentId=wteAsdPBnSEpnyeBS\">Peter S. Park</a> \"But making SBF the face of the EA movement was a really bad decision\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=eqkGWPh5yPmCmHdD7\">Devon Fritz</a> \"EA decided to hold up and promote SBF as a paragon of EA values and on of the few prominent faces in the EA community\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx?commentId=cKbbBz8ffRcDBeSkw\">Dean Abele</a> \"I don't know if I should stay in EA. I would feel very sad if [Will] publicly praised someone who turned out to be morally bankrupt. Of course, everyone makes mistakes. But still, some trust has been lost.\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/aFGzLDwPrepQLevu6/should-evf-consider-appointing-new-board-members?commentId=92Aaa8befh8RpE6P4\">Peter Wildeford</a> \"The other clear mistake was promoting Sam so heavily as the poster child of EA.\" [This comment is no longer endorsed by its author]</li><li><a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=GZuvTjrvnQfEr5Bnj\">David_Althaus</a> \"I think it's clear that we put SBF on a pedestal and promoted him as someone worth emulating, I don't really know what to say to someone who disagrees with this.\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1#D5tcqafcnikFLabTh\">Habryka</a> \"Some part of EA leadership ended up endorsing SBF very publicly and very strongly despite having very likely heard about the concerns, and without following up on them (In my model of the world Will fucked up really hard here)\" and<a href=\"https://forum.effectivealtruism.org/posts/rsnrpvKofps5Py7di/shutting-down-the-lightcone-offices#8LoPH39ZGcGqm3amn\"> again</a> \"[Will] was the person most responsible for entangling EA with FTX by publicly endorsing SBF multiple times\"</li><li><a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=coML6P3qMKhhQH5nK\">Jonas Vollmer</a> \"while Nick took SBF's money, he didn't give SBF a strong platform or otherwise promote him a lot...So...Will should be removed\"</li></ol>", "parentCommentId": "ZnfRqReyMA62Jjxuj", "user": null}, {"_id": "4aqc8ASnFfLh586zA", "postedAt": "2023-03-18T16:56:13.771Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><strong>ETA July: </strong>I regret posting the following comment for several reasons, partly because I got crucial information wrong and failed to put things into context and prevent misunderstandings. <i>Please consider reading my longer explanation at the top of my </i><a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=hJmpQv2CZbZg7W5jh\"><i>follow-up comment here</i></a><i>. I'm sorry to anyone I upset.</i><br><br>------------------------------------------------------------------<br><br>At EAG London 2022, they [ETA: this was an individual without consent of the organizers] distributed hundreds of stickers depicting Sam on a bean bag with the text \"what would SBF do?\". To my knowledge, <strong>never</strong> before were flyers depicting individual EAs at EAG distributed.&nbsp;(Also, such behavior seems generally unusual to me, like, imagine going to a conference and seeing hundreds of flyers &nbsp;and stickers all depicting one guy. Doesn't that seem a tad culty?)<br><br>On the 80k website, they had several articles mentioning SBF as someone highly praiseworthy and worth emulating.&nbsp;<br><br>Will vouched for SBF \"very much\" when talking to Elon Musk.<br><br>Sam was invited to many discussions between EA leaders.&nbsp;<br><br>There are probably more examples.<br><br>Generally, almost everyone was talking about how great Sam is and how much good he has achieved and how, as a good EA, one should try to be more like him. &nbsp;</p>", "parentCommentId": "FfsxRcRuWmJtqRGME", "user": {"username": "David_Althaus"}}, {"_id": "YbPtSmNAJFBPqq3cu", "postedAt": "2023-03-18T16:58:46.418Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Some specific examples of EA leaders putting SBF on a pedestal that I found with a bit of brief digging:</p><ul><li>At the time FTX blew up, SBF was featured on <a href=\"https://web.archive.org/web/20221101001908/https:/80000hours.org/\">80k’s homepage</a>. Also, if you clicked “start here” on that homepage (the first link aside from a subscription form) you were brought to an <a href=\"https://web.archive.org/web/20221105153101/https:/80000hours.org/start-here/\">article</a> that featured SBF as one of three individual profiles.<ul><li>Both of these mentions linked to a more <a href=\"https://web.archive.org/web/20221107045927/https:/80000hours.org/stories/sam-bankman-fried/\">in depth profile</a> of SBF that had been created in 2014 and regularly updated, and clearly “puts him on a pedestal” (“This approach — where he donates a significant proportion of his income to organisations aiming to make the world a better place as effectively as possible — is allowing Sam to have a pretty staggering impact.”)</li></ul></li><li>When <a href=\"https://forum.effectivealtruism.org/posts/cfdnJ3sDbCSkShiSZ/ea-and-the-current-funding-situation\">Will wrote about how the EA Funding situation had changed</a>, he praised SBF not just for his donations but also his personal virtue “I think the fact that Sam Bankman-Fried is a vegan and drives a Corolla is awesome, and totally the right call.”&nbsp;</li><li>In Will’s appearance on the 80k podcast, he <a href=\"https://80000hours.org/podcast/episodes/will-macaskill-ambition-longtermism-mental-health/#having-a-life-outside-of-work-004645\">uses SBF</a> as the exemplar of earning to give, and says convincing SBF to pursue ETG was “really the important impact.” He also <a href=\"https://80000hours.org/podcast/episodes/will-macaskill-ambition-longtermism-mental-health/#a-culture-of-ambition-within-effective-altruism-005950\">uses SBF</a> to illustrate “fat tails” of impact. On another 80k podcast, 80k staff <a href=\"https://80000hours.org/podcast/episodes/michelle-hutchinson-habiba-islam-themes-from-careers-advising/#how-large-a-role-the-1-1-team-is-playing-004904\">talks about SBF</a> to illustrate the impact of their 1:1 team.</li><li>In a <a href=\"https://80000hours.org/2021/11/growth-of-effective-altruism/\">talk</a> at EAG London 2021, Ben Todd argues “that the recent success of&nbsp;<a href=\"https://80000hours.org/stories/sam-bankman-fried/\">Sam Bankman-Fried</a>&nbsp;is an additional reason to aim high.” (Ben also mentions SBF in a variety of posts discussing EA’s funding levels, but that seems to me like an unavoidable part of discussing that issue and less like putting him on a pedestal.)</li></ul><p>All those examples come from the period after concerns about SBF had been raised to EA leaders. Prior to that, there are plenty more examples especially for 80k (e.g. SBF was on the 80k homepage from <a href=\"https://web.archive.org/web/20141201201140/https:/80000hours.org/\">late 2014</a> to late <a href=\"https://web.archive.org/web/20170901114657/https:/80000hours.org/\">2017</a>.)</p><p>As far as I can tell, EA leaders started promoting SBF in 2014 or so, seeing him as a great example of altruistic career choice in general, and of ETG (a counterintuitive model of altruistic career choice that originated in EA) specifically. Then leaders kept promoting SBF despite the warnings they got from Alameda co-founders, and continued to do so until FTX blew up.</p>", "parentCommentId": "FfsxRcRuWmJtqRGME", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "x4sKSatxGYk8sgKKp", "postedAt": "2023-03-18T18:01:54.092Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Yes, the Corolla comment looks less innocent if the speaker has significant reasons to believe Sam was ethically shady. If you know someone is ethically shady but decide to work them with anyway, you need to be extra careful not to make statements that a reasonable person could read as expressing a belief in that person's good ethics.</p>", "parentCommentId": "YbPtSmNAJFBPqq3cu", "user": {"username": "Jason"}}, {"_id": "iwkxN6vEbb5A7Hkxy", "postedAt": "2023-03-18T18:22:32.054Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>[Edit: Okay it sounds like the stickers were done by attendees. That's much less surprising.]</p><p>Woah what's the story behind the stickers, what the hell? Is this a dank memes thing? I assume it's meant to be funny but I don't get it.</p><p>I still genuinely don't know if the <a href=\"https://forum.effectivealtruism.org/posts/MrgBXqkqAepQs49Xf/signed-huel-bottle-by-william-macaskill-how-much-can-i\">signed Huel thing</a> was meant to be a joke.</p>", "parentCommentId": "4aqc8ASnFfLh586zA", "user": null}, {"_id": "CLEJQmzLwWExNxS3D", "postedAt": "2023-03-18T18:25:19.611Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I expect a 3-person board with a deep understanding of and commitment to the mission to do a better job selecting new board members than a 9-person board with people less committed to the mission. I also expect the 9-person board members to be less engaged on average.</p><p>(I avoid the term \"value-alignment\" because different people interpret it very differently.)</p>", "parentCommentId": "Dt2vBoWp4fAhNhnBW", "user": {"username": "Jonas Vollmer"}}, {"_id": "BL8gkXBTGesoYQeHZ", "postedAt": "2023-03-18T18:27:04.325Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think that's false; I think the FTX bankruptcy was hard to anticipate or prevent (despite warning flags), and accepting FTX money was the right judgment call ex ante.</p>", "parentCommentId": "JnoTKuDHDndGZJFry", "user": {"username": "Jonas Vollmer"}}, {"_id": "ziDi7CLL5wG8nJiR6", "postedAt": "2023-03-18T18:28:06.063Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>When I see agreevotes [racking up quickly on contextless statements] like above, I always feel weird. Do people agree that that counts as pedestalling by leaders? Or they agree that all that happened? IDK, but I feel weird because I actually think I disagree (with all those people I guess) that these are fair for the point being made:</p><blockquote><p>At EAG London 2022, they distributed hundreds of flyers and stickers depicting Sam on a bean bag with the text \"what would SBF do?\".</p></blockquote><p>I was at EAGL 22, but I never saw this, so it was not a universal handout. However I remember ppl talking about it, and it was not by EA leaders or offical conference ppl. It was (if I heard correctly) <i><strong>some kind of joke by some attendee(s)</strong></i>. I still believe this because EAG conference staff are pretty serious about making the event professional, so even if they thought it was secretly funny I'd have a hard time believing they would do that. Worth noting I think this was also a meta-injoke about claims of EA being a cult, obviously by riffing on the WWJD and giving \"glorious leader\" vibes. (Trying to avoid sounding harsh, but to whoever likes this type of thing, here's a reason not to do rogue, injoke stuff like that at an official event. Now we are dealing with it as submitted evidence of potential leadership corruption a year later, and unfortunately it did make EA look more like a cult even though that was actually the punchline not the truth. I imagine some attendees at the time felt icky about it too. Expect the injoke to make it to the outgroup, and anticipate how it will look. Save it for the unofficial afterparty, at most please.)</p><blockquote><p>On the 80k website, they had several articles mentioning SBF as someone highly praiseworthy and worth emulating.&nbsp;</p></blockquote><p>Honestly that just seems normal to me, idk. I have met a couple other people who have profiles on that website. They weren't being put on a pedestal, and 80K couldn't be fairly seen as tying 80k (let alone EA's) rep to theirs (because they aren't billionaires who would assume that). But it did make sense to list Sam as a notable <i>example</i> for earning-to-give, which is a recommended career path. It isn't like this was unwarranted use. Bad luck IMO. Seems like maybe what we are seeing in this instance is that if you want to use a billionaire like a normal example of something in a different talking point you are trying to make, society won't \"let\" you in the long run, because the billionaire's rep is actually bigger than yours and bigger than the rep of the point you are trying to make. So the billionaire's rep will swallow yours up whether you meant it to or not. EAs would do well to keep this lesson in mind for future prominent people even if those people are angels-on-earth. Still bad luck I say, I mean keep in mind SBF was likely trying to <i>actively fool</i> people (including himself methinks) as to his competence. [Edit: And as Ubuntu adds below, they aren't really EA leaders who had heard anything negative about SBF. Hence &nbsp;bad luck/big oof moment.]</p><blockquote><p>Will vouched for SBF \"very much\" when talking to Elon Musk.</p></blockquote><p>This was discussed elsewhere better than I can (I will hunt for the link and edit in shortly [Edit: I didn't want to dig for it so I just made this section longer]), but essentially anybody would do this for their friend or trusted acquaintance when they think something will be mutually beneficial, it was not a professional EA capacity and it was also in private text messages, not public. That it was shared publicly was tbh pretty uncool. I mean it's obvious Macaskill misjudged Sam's character/potential, but he actually wasn't trying to recommend Sam publicly there, and this sounds more like \"person-to-person, I think it's very much worth you guys having a conversation! You care about the same stuff and I know that stuff is why you both are interested in Twitter! Give it a go!\" than \"I, an EA leader, vouch for Sam, also an EA leader\" type of exchange. Will got duped but I'm pretty unclear he was acting inappropriately here in his own personal life. I mean when you have two fabulously wealthy acquaintances, and one wants to do a business deal with the other, you introduce them, and yes you vouch for the first if you know them reasonably well just so they give each other the time of day. There's no expectation that a deal will move forward without due diligence occurring, or that your vouch will become law. Musk knows that Will is not a finance professional, so he should know that Will can only vouch character. And no harm, no foul. But if there was harm for the EA brand here, it was by Musk making the private messages public which like, huh I'd never have expected that if I was Will. <s>It looks to me like Musk did so for a bit of clout to show he is hard-to-dupe.[I was incorrectly pairing this with another Elon text but the rest stands].&nbsp;</s> I don't think he wanted to make a dig at<i> </i>Macaskill<i> </i>for vouching tbh. Musk's financial professional (Michael Grimes) vouched for SBF too with about the same level of confidence. If I were Musk I'd prefer that people I like and respect (which it sounds like Will is one) keep trying to make connections for me when they believe the connections are of potential high value, and I/Musk would still always do my own due diligence. So it feels kind of weird to me that EAs are against Will having tried to connection-make when maybe even Musk wouldn't be so hard on him?&nbsp;</p><p>[Edit: I now realize that maybe some people are upset that Will was cool with arranging for \"possibly EA money\" to be spent on Twitter. To that, it's worth noting that <a href=\"https://forum.effectivealtruism.org/posts/zuqpqqFoue5LyutTv/the-ea-community-does-not-own-its-donors-money\">EA doesn't own it's donor's money,</a> helping out your major donors and acquaintances in their goals is prosocial and normal, there <i>are</i> EAs who view social coordination and combatting misinformation as important cause areas, and it would have been a business move not a donation]</p><blockquote><p>Sam was invited to many discussions between EA leaders.&nbsp;</p></blockquote><p>Sounds normal for a truly-massive donor who at least understood the movement or was thought to, and who people roughly enjoyed talking to as well. Again, keep in mind that SBF was likely actively trying to fool people here. I wonder if anyone reading this can say \"No, having Sam involved in discussion would have just absolutely been a hard-no from me. No way he could convince me that he, a huge donor, deserves a seat at the table. And if anybody felt he gave them good input in the past... their opinions wouldn't matter, I'd have said 'No, don't invite him.' In fact even if he gave <i>me</i> good input over the years in my leadership, controlled half my funding, and he was possibly expecting an invite, I would definitely still never have invited him.\" [This sounds so strong that it almost looks like I'm strawmanning the other side, I'm giving so little wiggle-room. But I do genuinely think to be able to judge leaders harshly here, you have to believe a claim as watertight as that quote would have been said by other experienced leaders, because I'm only confident a claim as watertight as that keeps competent actors and the rest &nbsp;from &nbsp;inviting Sam.] IDK I just find it quite surprising that readers are acting like disengaging with Sam, a major donor, was so black and white and easy. The majority of people got sucked in... it's easy to say what should have happened now.&nbsp;</p><blockquote><p>Generally, almost everyone was talking about how great Sam is and how much good he has achieved and how, as a good EA, one should try to be more like him. &nbsp;</p></blockquote><p>This perhaps yes. Lot of injokes and stuff in EA culture about SBF generally, too. But how much of this was grassroots in origination, because having a heckin billionaire in your extended crew is cool and interesting, vs how much of this was done by leaders publicly? Should people really not have felt excited and expressed it within their ingroup based on what they thought?</p><blockquote><p>There are probably more examples.</p></blockquote><p>I'd be interested to see them. In general I feel like what I'm seeing listed here is pretty human and normal and I wouldn't call it putting him on a pedestal, or tying EA's rep to his (intentionally or even in ways ppl necessarily could have anticipated would end up very entangled), or elevating him as moral paragon publicly.</p>", "parentCommentId": "4aqc8ASnFfLh586zA", "user": {"username": "Ivy_Mazzola"}}, {"_id": "ZkgkHsbPLRs5ETFcm", "postedAt": "2023-03-18T18:29:35.329Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I mean, that's not how I read it. The whole paragraph is:</p><blockquote><p>Heavily considering what you <i>show</i> as well as what you do, especially if you’re in a position of high visibility. “Signalling” is often very important! For example, the funding situation means I now take my personal giving more seriously, not less. I think the fact that Sam Bankman-Fried is a vegan and drives a Corolla is awesome, and totally the right call. And, even though it won’t be the right choice for most of us, we can still celebrate those people who do make very intense moral commitments, like the many kidney donors in EA, or a Christian EA I heard about recently who lives in a van on the campus of the tech company he works for, giving away everything above $3000 per year.</p></blockquote><p>I can see how some people might read it that way though.</p>", "parentCommentId": "x4sKSatxGYk8sgKKp", "user": null}, {"_id": "xbHAtEyAwoYzyxt5k", "postedAt": "2023-03-18T19:08:35.741Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>+1 to basically all of this and thanks for adding context to the stickers thing.</p><p>I also want to add - <a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=SKcsadvNYJQG4hXz6\">Again</a>, Beckstead, MacAskill and Karnofsky are not 80k. So going back to the <a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=WvBStLEiv54iveFyt\">original claim</a> that we're discussing (and <a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=WYKnfqF66S5fvrHgD\">others like it</a> I guess):</p><blockquote><p>But I cannot wrap my head around why—knowing what it appears they knew then—anyone thought it was a good idea to put this guy on a pedestal; to elevate him as a moral paragon and someone to emulate; to tie EA's reputation so closely to his.</p></blockquote><p>Well, \"they\" are not 80k, so I'm really not surprised 80k featured SBF positively on their website. \"EA leaders\" are not a single shadowy entity, they're a group of individuals who get packaged together in a variety of combinations when people realise <a href=\"https://forum.effectivealtruism.org/posts/RPTPo8eHTnruoFyRH/some-important-questions-for-the-ea-leadership?commentId=qDopueKWQnDNEySHq\">there are no adults in the room</a>.</p>", "parentCommentId": "ziDi7CLL5wG8nJiR6", "user": null}, {"_id": "ozdJFLHrqZ6SxPq3H", "postedAt": "2023-03-18T19:30:10.243Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>What if the investor decided to invest knowing there was an X% chance of being defrauded, and thought it was a good deal because there's still an at least (100-X)% chance of it being a legitimate and profitable business? For what number X do you think it's acceptable for EAs to accept money?</p><p><a href=\"https://forum.effectivealtruism.org/posts/5mghcxCabxuaK4WTs/ycombinator-fraud-rates\">Fraud base rates are 1-2%</a>; some companies end up highly profitable for their investors despite having committed fraud. Should EA accept money from YC startups? Should EA accept money from YC startups if they e.g. lied to their investors?</p><p>I think large-scale defrauding unsuspecting customers (who don't share the upside from any risky gambles) is vastly worse than defrauding professional investors who are generally well-aware of the risks (and can profit from FTX's risky gambles).</p><p>(I'm genuinely confused about this question; the main thing I'm confident in is that it's not a very black-and-white kind of thing, and so I don't want to make my bet about that.)</p>", "parentCommentId": "QFGFDegypEHev78S7", "user": {"username": "Jonas Vollmer"}}, {"_id": "mAYdW9u2ZrMbnRRSD", "postedAt": "2023-03-18T21:51:22.471Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I don't know the acceptable risk level either. I think it is clearly below 49%, and includes at least fraud against bondholders and investors that could reasonably be expected to cause them to lose money from what they paid in.</p><p>It's not so much the status of the company as a fraud-commiter that is relevant, but the risk that you are taking and distributing money under circumstances that are too close to conversion (e.g., that the monies were procured by fraud and that the investors ultimately suffer a loss). I can think of two possible safe harbors under which other actors' acceptance of a certain level of risk makes it OK for a charity to move forward:</p><ul><li>In many cases, you could imply a maximum risk of fraud that the bondholders or other lenders were willing to accept from the interest rate minus inflation minus other risk of loss -- that will usually reveal that bondholders at least were not factoring in more than a few percent fraud risk. The risk accepted by equity holders may be greater, but usually bondholders take a haircut in these types of situations -- and the marginal dollars you're spending would counterfactually have gone to them in preference to the equity holders. However, my understanding is that FTX didn't have traditional bondholders.</li><li>If the investors were sophisticated, I think the percentage of fraud risk they accepted at the time of their investment is generally a safe harbor. For FTX, I don't have any reason to believe this was higher than the single digits; as you said, the base rate is pretty low and I'd expect the public discourse pre-collapse to have been different if it were believed to be significantly higher.</li></ul><p>However, those safe harbors don't work if the charity has access to inside information (that bondholders and equity holders wouldn't have) and that inside information updates the risk of fraud over the base rates adjusted for information known to the bond/equity holders. In that instance, I don't think you can ride off of the investor/bondholder acceptance of the risk as low enough.</p><p>There is a final wrinkle here -- for an entity as unregulated as FTX was, I don't believe it is plausible to have a relatively high risk of investor fraud and a sufficiently low risk of depositor fraud. I don't think people at high risk of cheating their investors can be deemed safe enough to take care of depositors. So in this case there is a risk of investor fraud that is per se unacceptable, and a risk of investor fraud that implies an unacceptable risk of depositor fraud. The acceptable risk of investor fraud is the lower of the two.</p><p>Exception: If you can buy insurance to ensure that no one is worse off because of your activity, there may be no maximum acceptable risk. Maybe that was the appropriate response under these circumstances -- EA buys insurance against the risk of fraud in the amount of the donations, and returns that to the injured parties if there was fraud at the time of any donation which is discovered within a six-year period (the maximum statute of limitations for fraudulent conveyance in any U.S. state to my knowledge). If you can't find someone to insure you against those losses at an acceptable rate . . . you may have just found your answer as to whether the risk is acceptable.</p>", "parentCommentId": "ozdJFLHrqZ6SxPq3H", "user": {"username": "Jason"}}, {"_id": "iATuKzEFsuXARyiEG", "postedAt": "2023-03-18T22:17:01.915Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>At EAG London 2022, they distributed hundreds of flyers and stickers depicting Sam on a bean bag with the text \"what would SBF do?\".&nbsp;</p></blockquote><p>These were not an official EAG thing — they were printed by an individual attendee.</p><blockquote><p>To my knowledge, <strong>never</strong> before were flyers depicting individual EAs at EAG distributed.&nbsp;(Also, such behavior seems generally unusual to me, like, imagine going to a conference and seeing hundreds of flyers &nbsp;and stickers all depicting one guy. Doesn't that seem a tad culty?</p></blockquote><p>Yeah it was super weird.&nbsp;</p>", "parentCommentId": "4aqc8ASnFfLh586zA", "user": {"username": "matthew.vandermerwe"}}, {"_id": "eBmQePALeszhCz9xo", "postedAt": "2023-03-18T23:11:05.032Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think Jack's point was that having some technical expertise reduces the odds of a Bad Situation happening at a general level, not that it would have prevented exposure to the FTX bankruptcy specifically.</p><p>If one really does not want technical expertise on the board, a possible alternative is hiring someone with the right background to serve as in-house counsel, corporate secretary, or a similar role -- and then listening to that person. Of course, that costs money.</p>", "parentCommentId": "BL8gkXBTGesoYQeHZ", "user": {"username": "Jason"}}, {"_id": "ES9ozzAiMtqAPMMZC", "postedAt": "2023-03-18T23:34:09.038Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I read his comment differently, but I'll stop engaging now as I don't really have time for this many follow-ups, sorry!</p>", "parentCommentId": "eBmQePALeszhCz9xo", "user": {"username": "Jonas Vollmer"}}, {"_id": "FDwsDDJfyG5CNsucB", "postedAt": "2023-03-19T05:16:31.971Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Sounds like an individual attendee might have done this. I don't see this as a big deal. I don't think that we should be so concerned about possible bad PR that we kill off any sense of fun in the community. I suspect that doing so will cost us members rather than gain us members.</p>", "parentCommentId": "4aqc8ASnFfLh586zA", "user": {"username": "casebash"}}, {"_id": "L2Hs4msxLXsjcBDh2", "postedAt": "2023-03-19T10:05:12.562Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Ah thanks, I didn't know that! Sorry, could have noticed my confusion here. I edited the above comment.</p>", "parentCommentId": "iATuKzEFsuXARyiEG", "user": {"username": "David_Althaus"}}, {"_id": "GZuvTjrvnQfEr5Bnj", "postedAt": "2023-03-19T10:21:05.846Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>(ETA: Sorry for not engaging with everything you wrote. I'm short on time and I'll try to elaborate on my views in a week or so.)<br><br>Just to clarify my position: I think it's clear that we put SBF on a pedestal and promoted him as someone worth emulating, I don't really know what to say to someone who disagrees with this. (Perhaps you interpret the phrase \"put someone on a pedestal\" differently; yes, we didn't built statues of SBF, I agree.)&nbsp;<br><br>But I also think that basically almost all of this has been completely understandable. I mean, guy makes 10B dollars and wants to donate it all? One needs to be deranged to not try to emulate him, to not want to learn from him and to not paint him as highly morally praiseworthy. I certainly tried emulating that and learning from SBF (with little success obviously). At the time, I didn't think that we went too far. I even thought the sticker thing was kinda funny (if weird and inadvisable), but I didn't really give it much thought at all at the time.</p>", "parentCommentId": "ziDi7CLL5wG8nJiR6", "user": {"username": "David_Althaus"}}, {"_id": "qdrweZL2BA2Cx3LDD", "postedAt": "2023-03-19T14:09:00.168Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I agree with what others have said re: pedestal, so am not going to produce more quotes or anecdotes. I stand by the claim, though.&nbsp;</p><p>I think people may have been inclined to put SBF on a pedestal because earning to give was the main thing people criticized about early EA. People were otherwise pretty supportive of early EA ideas; I mean, it's hard not to support finding more cost-effective global health charities. When SBF emerged, I think this was a bit of a \"see, we told you so\" moment for EAs who had been around for a long time, especially because SBF had explicitly chosen to earn to give because of EA. So it wasn't just: \"look this guy is earning to give and has billions of dollars!\" The subtext was also: \"EA is really onto something with its thinking and advice.\" He became a poster boy for the idea that we <i>can</i> actually intellectualize our way to making the world better (so fuck the haters).</p><p>I think a more plausible defense of senior EAs is not that this pedestal thing didn't happen, but that (as <a href=\"https://forum.effectivealtruism.org/users/stefan_schubert?mention=user\">@Stefan_Schubert</a> suggests) it may not have made that much of a difference. EAs might well have rallied around SBF even if senior people hadn't promoted him. And this is definitely possible, but I wonder if things would've played out pretty differently if senior EAs had been like \"look, we'll take your money, and we'll recommend some great people to work for you, but we don't want to personally serve on the board of FTX Foundation/vouch for you/have you on our podcast, etc because we have heard rumors about X, Y, and Z, and think they pose reputational risks to EA.\"</p><p>Lastly: it looks like the three former Alameda employees accused SBF of having \"inappropriate sexual relationships with subordinates\" around the beginning of the #MeToo movement. Alameda launched in the fall of 2017 and the confrontation with Sam occurred in April of 2018. The NYT published its article about Harvey Weinstein on October 5th, 2017, and <a href=\"https://www.nytimes.com/interactive/2018/10/23/us/metoo-replacements.html\">dozens of men</a> were accused of harassment between then and February 2018. The fact that SBF's alleged inappropriate sexual behavior occurred around the height of the #MeToo movement doesn't make me think &nbsp;EA leaders had<i> less</i> of a reason to worry about the reputational risks of promoting him.</p>", "parentCommentId": "FfsxRcRuWmJtqRGME", "user": {"username": "hobbes"}}, {"_id": "D7uKotwLkjEMXZ2eH", "postedAt": "2023-03-19T17:03:03.882Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>That's fair but next time I strongly recommend you include context and thoughts so lurkers don't latch onto what you say as proof that leaders or anyone else did anything unreasonable. Lilly's comment is:</p><blockquote><p>\"I am also eager to see what the investigation concludes, but I'm pretty convinced at this point that EA leaders made big mistakes....</p><p>...I cannot wrap my head around why—knowing what it appears they knew then—anyone thought it was a good idea to put this guy on a pedestal; to elevate him as a moral paragon and someone to emulate; to tie EA's reputation so closely to his. It really feels like they should've (at least) known not to do that.\"</p></blockquote><p>This comment has a negative connotation, and is arguably the opposite connotation of the comment you wrote just now. So when you jump in to provide examples of that without context, it appears you support the negative conclusion.</p><p>Additionally, maybe this is a cultural difference, but \"put someone on a pedestal\" is only used negatively where I am from. It's about putting someone in a position above that where they'd naturally belong. I argue that if you think his treatment was normal, you also don't think he was \"put on a pedestal\" in a colloquial interpretation.<br><br>Here's a slightly different point I couldn't quite word well before: From my perspective, I am not even sure that anything EA did about him was anything they didn't do about other prominent people to the extent it made sense. Like, I don't pay that much attention and suck at names tbh, but I still know with high confidence that essentially everything people name as proof that SBF was unjustly elevated, anything an EA leader did toward/about SBF, they also did toward/about many others they have respected over the years. I just don't see it as unusual or bad (yet) at all. If ppl think that things like named above count as \"putting someone on a pedestal\" and \"tying EA's rep to theirs\" (implied=bad), then there are dozens, maybe 100+ who could be counted as such<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref04wsipl9pek5\"><sup><a href=\"#fn04wsipl9pek5\">[1]</a></sup></span>. &nbsp;I honestly wonder if it just looks like SBF was boosted a lot because he is a billionaire (who wanted to be boosted) and the general public think that is so cool. And EAs do too, like I think maybe EAs forget about other names who got boosted over the years but maybe who just didn't stick in our consciousness or public consciousness because they got little media fanfare? If the public had wanted to hear about something other than billionaires, wouldn't other peeople have been mentioned much more? If people wanted to hear about the founding of &nbsp;Givewell, wouldn't Karnofsky and Hassenfeld been boosted more than SBF? But we live in &nbsp;bugged world where people want to hear about billionaires instead (and the public or at least journalistic consciousness may have been tying him to EA no matter what) and I think that would have shaped almost <i>any</i> person's way of talking, including other electable leaders--leaders we might want to tell ourselves wouldn't have done as Will did, but I'll probably never feel confident of that.<br><br>So, yeah, I suppose the crux is that people think \"I or [other leaders we can elect now] wouldn't have spoken well of Sam if [we] had known what was said in 2018 or 2019 about Sam.\" But CEA did at least do an internal investigation into CEA/Alameda in 2019 and yet here we are. So I find it a little weird to say that.&nbsp;<br><br>Especially expecting that Sam is quite manipulative and EA leaders are just a bunch of high-trust humans (who I wouldn't change if I could press a button btw, because whatever way they think about things is literally why the movement got started). To me, idk, saying EA leaders made mistakes feel a bit like \"you guys shouldn't be the way you are as people, you should expect some people to try to grift\" and I disagree with that.&nbsp;<br><br>Maybe we shouldn't have such high-trust people in leadership? I'm not sold. Actually I'm not even sold we can find people who would have noticed and investigated SBF's actual financial fraud who have anything close to a typical human psychology (Gladwell's book \"Talking toStrangers\" has a great section about Bernie Madoff's reception in this regard, but I digress). IDK. I feel so bad thinking that these people I know try so, so hard are being told they made mistakes which basically amount to them being kind and excited about a person, one person among many others they have been kind and excited about. Maybe this time it wasn't deserved, but, sigh, Will and the others are philosophers and altruists, not psychologists and business moguls who might be primed to spot a manipulative person or reputational risk. It feels like to me, as of right now, adding a new person(s) into the mix with more expertise in spotting manipulators and hazards, makes more sense than removing \"EA leaders\" including Nick or even Will from their posts.&nbsp;<br><br>But I will wait to see from the investigation! I worry that submitting lists of things without context to show that \"SBF was put on a pedestal\" (whether or not you view that term with negative connotation), will lead to entrenched opinions, more upset, and possibly even <strong>more</strong> <strong>news pieces being written</strong>, which may not be right in the longrun.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn04wsipl9pek5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref04wsipl9pek5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Like, there are 153 eps of 80K podcast, the 80K website profiles have been rotated many times throughout the years, there have been so many people shouted-out by Will at various times in his talks and interviews--especially EAG talks, there are for sure dozens of prominent EAs who people bring up repeatedly again and again in conversation etc, there are lots of EAs who news profiles have done features on, lots of non-leader EAs and non-EAs who get invited to private discussions between leaders. I could go on</p></div></li></ol>", "parentCommentId": "GZuvTjrvnQfEr5Bnj", "user": {"username": "Ivy_Mazzola"}}, {"_id": "6mF2LijwcWz364rXZ", "postedAt": "2023-03-19T17:22:00.149Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Hm I wouldn't have thought of your second paragraph. I'm not sure I agree that was an intention, but interesting.<br><br>IDK, CEA did do an investigation in 2019 into CEA/Alameda relations, according to the news article, so I'm not sure (yet!) they behaved unreasonably here given the nature of the complaints made. (I'm also not sure they behaved reasonably). Somebody tried a bit to actually figure things out at least. And I prefer that than just saying \"Hey, SBF, check out these rumors. Rather than try to figure out which side is right, we will do some sort of average thing where we take your money and help you out in some ways but not others, and possibly leave a lot of value on the table or keep a lot of risk, not sure which, but oh well\". That doesn't seem like the optimal outcome for either possible situation.&nbsp;<br><br>I'm reminded of <a href=\"https://www.lesswrong.com/posts/t2LGSDwT7zSnAGybG/split-and-commit\">split and commit</a>. If I see something that looks like a 10-ft alligator on my property, but it might also be a log, is it an optimal strategy to continue the yardwork anyway but give it a wide berth? Or am I going to investigate further to see whether it is an alligator (and if so call animal control and have it removed) or if it is a log (and if so I can mow my grass right up to the base, even take a rest on it if I want). It's not a perfect analogy but you get the idea.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref5rinkrkvn5w\"><sup><a href=\"#fn5rinkrkvn5w\">[1]</a></sup></span><br><br>Anyway, it looks possible that people thought about this to the extent it seemed reasonable at the time, given the scale of the complaints made (which the article admits never implied anything like what happened or even implied fraud for sure--perhaps lazy accounting that they'd hopefully grow out of as they professionalized, yes). They came to the wrong conclusions, but I might be okay with this tbh. (but we'll see how reasonable the conclusion was)<br><br>Were the claims about inappropriate sexual relationships either by the women themselves, or at least about nonconsensual relationships? Without commenting on how appropriate the relationships were otherwise, I'm not in favor of consensual relationships (consensual meaning, the women themselves would say they were consensual) being <s>branded part of</s> lumped in with episodes of harassment and the #metoo movement. You can't really create a #metoo moment for someone else.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn5rinkrkvn5w\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref5rinkrkvn5w\">^</a></strong></sup></span><div class=\"footnote-content\"><p>[Edit: Maybe if I try to make the analogy better, maybe 2019 CEA investigated to the extent they could (I very much doubt they were allowed to feel the actual shape of the alligator/see many of Alameda's internal documents) and (reasonably?) decided that SBF was not either an alligator or a log, but an alligator statue (that people keep complaining is an alligator), or a dead alligator (that people were right to complain about before but it looks like things have changed), or a crippled alligator you aren't worried about, or an otherwise-chill alligator protecting it's babies which you don't want to move. IDK. But then in 2022 we all learned that this was wrong too, and he was actually a frickin T-Rex pretending (excellently) to be an [alligator statue etc]. Because actually the fiasco that ended up happening was way out of scale with what even the complainants said, and the Time piece notes that in multiple places. Nobody expected a sneaky T-Rex!]</p></div></li></ol>", "parentCommentId": "qdrweZL2BA2Cx3LDD", "user": {"username": "Ivy_Mazzola"}}, {"_id": "j6GzRmDZT9dkpPyfd", "postedAt": "2023-03-19T18:04:38.561Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>David - TIME magazine for decades has promoted standard left/liberal Democrat-aligned narratives that prioritize symbolic partisan issues over scope-sensitive impact.&nbsp;</p><p>From the viewpoint of their editors, EA represents an embarrassing challenge to their America-centric, anthropocentric, short-termist, politicized way of thinking about the world's problems.&nbsp;</p><p>We may not be a direct threat to their subscription revenue, newsstand sales, or ad revenue.&nbsp;</p><p>But we are a threat to the ideology that their editors have strong interests in promoting -- an ideology that may seem invisible if you agree with it, but which seems obviously biased if you don't agree with it.</p><p>This is how partisan propaganda operates in the 21st century: it tries to discredit rival ideologies and world-views with a surprising ferocity and speed, once they sense a serious threat.&nbsp;</p><p>&nbsp;IMHO, EA needs to get a bit less naive about what people and institutions are willing to do to protect their world-views and political agendas.&nbsp;</p>", "parentCommentId": "eQGiTouEWfXjNaov3", "user": {"username": "geoffreymiller"}}, {"_id": "Sn5D3FeLHZCGouu9K", "postedAt": "2023-03-19T18:09:56.521Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I feel like  an equally informative version of this is \"people are more critical about the bad behavior of those they disagree with politically \",  and then it sounds relevant yes, but far less sinister and discrediting.</p>\n", "parentCommentId": "j6GzRmDZT9dkpPyfd", "user": {"username": "Dr. David Mathers"}}, {"_id": "YzWNxeDBqhDQfMqBq", "postedAt": "2023-03-19T18:41:47.007Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I think that's a somewhat different point. It's often true that people are more critical about bad behavior by their political opponents'.&nbsp;</p><p>But most of the news stories I read in mainstream media that are critical of EA go far beyond demonizing EA individuals. I sense that these editors &amp; journalists are feeling a panicky, uneasy, defensive reaction to the EA movement's epistemics and ethics, not just to EA individuals. It reminds me of the defensive, angry reactions that meat-eaters often show when they encounter compelling vegan arguments about animal welfare.&nbsp;</p><p>Admittedly this is a rather vague take, but I think we do under-estimate how much the EA perspective threatens many traditional world-views.</p>", "parentCommentId": "Sn5D3FeLHZCGouu9K", "user": {"username": "geoffreymiller"}}, {"_id": "53LDSmMRZZrdodcPf", "postedAt": "2023-03-19T23:30:14.224Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>You may indeed believe that and have said that, but the question for us is: Was it reasonable for EA leaders to think this degree of bad behaviour was particularly out of the ordinary for the early days of a startup?</p><p>To take Nathan Young's four examples, looking at some of what major news outlets said prior to 2018 about these companies' early days...it doesn't seem that unusual? (Assuming we now know all the key accusations that were made - there may of course have been more.)</p><ul><li>Facebook<ul><li>\"The company and its employees have also been subject to litigation cases over the years...with its most prominent case concerning allegations that CEO Mark Zuckerberg broke an oral contract with Cameron Winklevoss, Tyler Winklevoss, and Divya Narendra to build the then-named \"HarvardConnection\" social network in 2004, instead allegedly opting to steal the idea and code to launch Facebook months before HarvardConnection began... The original lawsuit was eventually settled in 2009, with Facebook paying approximately $20&nbsp;million in cash and 1.25&nbsp;million shares.\" (<a href=\"https://en.wikipedia.org/wiki/Criticism_of_Facebook\">Wikipedia</a>, referencing articles from 2007 to 2011)</li><li>\"Facebook co-founder, Eduardo Saverin, no longer works at Facebook. He hasn't since 2005, when CEO Mark Zuckerberg diluted Saverin's stake in Facebook and then booted him from the company.\" (<a href=\"https://www.businessinsider.com/how-mark-zuckerberg-booted-his-co-founder-out-of-the-company-2012-5?r=US&amp;IR=T\">Business Insider, 2012</a>)</li><li>\"we also uncovered two additional anecdotes about Mark's behavior in Facebook's early days that are more troubling...— an apparent hacking into the email accounts of Harvard Crimson editors using data obtained from Facebook logins, as well as a later hacking into ConnectU\" (<a href=\"https://www.businessinsider.com/how-facebook-was-founded-2010-3?r=US&amp;IR=T#:~:text=The%20primary%20dispute%20around%20Facebook's,taking%20their%20idea%20and%20building\">Business Insider, 2010</a>)</li></ul></li><li>Google<ul><li>“Asked about his approach to running the company, Page once told a Googler his method for solving complex problems was by reducing them to binaries, and then simply choosing the best option,” Carlson writes. “Whatever the downside he viewed as collateral damage he could live with.” That collateral damage sometimes consisted of people. In 2001, frustrated with the layer of managers overseeing engineers, Page decided to fire all of them, and publicly explained that he didn’t think the managers were useful or doing any good.\" (<a href=\"https://qz.com/202710/larry-pages-lost-decade-was-the-best-thing-to-ever-happen-to-google\">Quartz, 2014</a>)</li><li>\"Page encouraged his senior executives to fight the way he and Brin went at it. In meetings with new hires, one of the two co-founders would often provoke an argument over a business or product decision. Then they would both sit back, watching quietly as their lieutenants verbally cut each other down.\" (<a href=\"https://www.businessinsider.com/larry-page-the-untold-story-2014-4?page=2&amp;r=US&amp;IR=T\">Business Insider, 2014</a>)</li></ul></li><li>Gates<ul><li>\"Allen portrays the Microsoft mogul as a sarcastic bully who tried to force his founding partner out of the firm and to cut his share in the company as he was recovering from cancer.\" (<a href=\"https://www.theguardian.com/technology/2011/mar/30/microsoft-paul-allen-bill-gates\">Guardian, 2011</a>)</li><li>\"...he recalls the harsher side of Gates's character, anecdotes from the early days...Allen stopped playing chess with Gates after only a few games because Gates was such a bad loser he would sweep the pieces to the floor in anger; or how Gates would prowl the company car park at weekends to check on who had come in to work; or the way he would browbeat Allen and other senior colleagues, launching tirades at them and putting them down with the classic denigrating comment: \"That's the stupidest fucking thing I've ever heard!\" (<a href=\"https://www.theguardian.com/technology/2011/may/02/paul-allen-microsoft-bill-gates-ideas\">Guardian, 2011</a>)</li><li>\"They met in 1987, four months into her job at Microsoft...meeting her in the Microsoft car park, he asked her out\" (<a href=\"https://www.independent.co.uk/tech/office-romance-how-bill-met-melinda-855292.html\">Independent, 2008</a>)</li></ul></li><li>Bezos<ul><li>Obviously his treatment of workers is <a href=\"https://web.archive.org/web/20230103195211/https://www.nytimes.com/2015/08/16/technology/inside-amazon-wrestling-big-ideas-in-a-bruising-workplace.html\">no secret</a> (and it seems natural for people to think he's probably always been this way)</li></ul></li></ul><p>It's not surprising to me if EA leaders thought most startups were like this - we just only hear stories about the ones that make it big.</p><p>I've only worked for one startup myself and I wasn't privy to what went on between executives, but: one of them said to a (Black, incidentally) colleague upon firing him \"You'll never work again,\" another was an older married man who was grinding up against young female colleagues at an office party (I actually suggested he go home and he said, \"No - I'm having fun\" and laughed and went back to it), and another made a verbal agreement with some of us to pay us overtime if we worked 12-hour days for several weeks and then simply denied it and never did. [edit: I should clarify this was not an EA org]</p>", "parentCommentId": "BgGqFM8XgmDaxBNX7", "user": null}, {"_id": "ob68gA5wP3d9qtefD", "postedAt": "2023-03-20T15:16:04.353Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>That doesn't seem to match with EA being a <a href=\"https://time.com/6204627/effective-altruism-longtermism-william-macaskill-interview/\">front cover story last year</a>, and being shown in a positive light.</p>", "parentCommentId": "j6GzRmDZT9dkpPyfd", "user": {"username": "DavidNash"}}, {"_id": "vFJpcDMvMJFd4Xw5e", "postedAt": "2023-03-21T13:06:53.563Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Non-profit boards have 100% legal control of the organisation– they can do anything they want with it.</p><p>If you give people who aren't very dedicated to EA values legal control over EA organisations, they won't be EA organisations for very long.</p><p>There are under 5,000 EA community members in the world – most of them have no management experience.</p><p>Sure, you could give up 1/3 of the control to people outside of the community, but this doesn't solve the problem &nbsp;(it only reduces the need for board members by 1/3).</p>", "parentCommentId": "HTSBfKGqy2iQFsKDE", "user": {"username": "Benjamin_Todd"}}, {"_id": "kP4D4nXEoC4WCvwK9", "postedAt": "2023-03-21T16:07:57.325Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>The assumption that this 1/3 would come from outside the community seems to rely on an assumption that there are no lawyers/accountants/governance experts/etc. in the community. It would be more accurate, I think, to say that the 1/3 would come from outside what Jack called \"high status core EAs.\"</p>\n", "parentCommentId": "vFJpcDMvMJFd4Xw5e", "user": {"username": "Jason"}}, {"_id": "ERJpX3fwBBkyy92qR", "postedAt": "2023-03-21T18:45:27.629Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>This is textbook Gell-Mann amnesia&nbsp;</p>", "parentCommentId": "nGxkHbrikGeTxrLjZ", "user": {"username": "burner"}}, {"_id": "4gxvzcznucvaW5tLh", "postedAt": "2023-03-22T01:16:55.727Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Ultimately, if you think there is enough value within EA arguments about how to do good, you should be able to find smart people from other walks of life who have: 1) enough overlap with EA thinking (because EA isn't 100% original after all) to have a reasonable starting point along with 2) more relevant leadership experience and demonstrably good judgement, and linked to the two previous 3) mature enough in their opinions and / or achievements to be less susceptible to herding.</p>\n<p>If you think that EA orgs won't remain EA orgs if you don't appoint \"value aligned\" people, it implies out arguments aren't strong enough for people who we think should be convinced by them. If that's the case, it's a real good indicator your argument might not be that good and to reconsider.</p>\n<p>To be concrete, I expect a board of 50% card-carrying EAs and 50% experienced high achievement non-EAs with good understanding of similar topics (e.g. x-risk, evidence based interventions) to appraise arguments of what high-/lower-risk options to fund much better than a board of 100% EAs with the same epistemic and discourse background and limited prior career / board experience.</p>\n<p>Edit- clarity and typos</p>\n", "parentCommentId": "vFJpcDMvMJFd4Xw5e", "user": {"username": "howdoyousay?"}}, {"_id": "26NPnMYykYYnJKrwE", "postedAt": "2023-03-22T17:22:50.766Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>How so? Aren't these both cases where Habryka has similar amounts of professional knowledge?  If not, which case do you think he knew more about?</p>\n", "parentCommentId": "ERJpX3fwBBkyy92qR", "user": {"username": "Jeff_Kaufman"}}, {"_id": "p2z5uCfSmpGTwwRMa", "postedAt": "2023-03-22T18:17:33.960Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I've read this comment a few times, and my brain goes \"???\" whenever I get to your last clause: \"I also had quite a strong reaction that nobody seemed to be acting on all of these warning flags\"<br><br>I just don't get it in a way that connects to my reading of the article. What are \"all these warning flags\" and what counts as \"inaction\"? I don't want to say your take is wrong because you are sort of sharing feelings, but like.... according to the article, ex-Alameda employees don't seem to think that those flags were warning flags for the massive fraud and crash-and-burn failure that was to come. And re: inaction, the article says CEA did an internal investigation in 2019 (it drops the info kinda randomly. As you say, the article isn't well-optimized to come away with an understanding of the details). And idk what new warning flags came after 2019, I'm not seeing any in the article.<br><br>I mostly like your comment, but I'm also left wondering... Do you know things not in the article? Did I miss something? [Is this just a \"vibe\" we will disagree on regardless?] I can't quite reconcile your take.<br><br>[Edit: I had been thinking about asking this over DM for a couple days, but now that this post is no longer an active topic, I figured, \"what the hay, ask it in thread\". However you can answer over DM if you prefer, or ignore cuz the post is giving dying breaths, np.]</p>", "parentCommentId": "nGxkHbrikGeTxrLjZ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "zJxbHuaHMEWE8o6S2", "postedAt": "2023-03-22T18:31:46.908Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Sorry that's what I meant. I was saying there are 5,000 community members. If you want the board to be controlled by people who are actually into EA, then you need 2/3 to come from something like that pool. Another 1/3 could come from outside (though not without risk). I wasn't talking about what fraction of the board should have specific expertise.<br><br>Another clarification, what I care about is whether they deeply grok and are willing to act on the principles – not that they're part of the community, or self-identify as EA. Those things are at best rough heuristics for the first thing. I was using the number of community members as a rough indication for how many people exist who actually apply the principles – I don't mind if they actively participate in the community or not, and think it's good if some people don't.</p>", "parentCommentId": "kP4D4nXEoC4WCvwK9", "user": {"username": "Benjamin_Todd"}}, {"_id": "NeGMzcED3viWrnZrv", "postedAt": "2023-03-22T18:33:14.282Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I'm definitely not saying value alignment is the <i>only</i> thing to consider.</p>", "parentCommentId": "HLsvJGDDWAxn8Xy68", "user": {"username": "Benjamin_Todd"}}, {"_id": "8SkZdxKQdDrcag28i", "postedAt": "2023-03-22T18:48:35.062Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>I agree that there's a broader circle of people who get the ideas but aren't \"card carrying\" community members, and having some of those on the board is good. A board definitely doesn't need to be 100% self-identified EAs.</p><p>Another clarification is that what I care about is whether they deeply grok and are willing to act on the principles – not that they're part of the community, or self-identify as EA. Those things are at best rough heuristics for the first thing.&nbsp;</p><p>This said, I think there are surprisingly few people out there like that. And due to the huge scope differences in the impact of different actions, there can be huge differences between what someone who is e.g. 60% into applying EA principles would do compared to someone who is 90% into it (using a made up scale).</p><p>I think a thing that wouldn't make sense if for, say, Extinction Rebellion, to appoint people to their board who \"aren't so sold on climate change being the world's biggest problem\". Due to the point above, you can end up in something that feels like this more quickly than it first seems or is intuitive.</p>", "parentCommentId": "4gxvzcznucvaW5tLh", "user": {"username": "Benjamin_Todd"}}, {"_id": "xgTe5LtoJystgzHyc", "postedAt": "2023-03-22T20:29:08.130Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>I don't want to say your take is wrong because you are sort of sharing feelings, but like.... according to the article, ex-Alameda employees don't seem to think that those flags were warning flags for the massive fraud and crash-and-burn failure that was to come. And re: inaction, the article says CEA did an internal investigation in 2019 (it drops the info kinda randomly. As you say, the article isn't well-optimized to come away with an understanding of the details). And idk what new warning flags came after 2019, I'm not seeing any in the article.</p></blockquote><p>I don't know what you mean by this. I've definitely talked to many ex-Alameda employees and they totally think this was a warning flag for the massive fraud. Nobody assigned huge probability to the specific scenario that happened but \"Sam causes some kind of huge explosion, or does something pretty fradulent or at the very least builds a highly unethical organization\" was totally the kind of thing many people were worried about (which is indeed why some of them went around warning others).</p><p>I've written about this in many of my other comments. Also, CEA doing an investigation in 2019 seems I think wrong, or at least I have never heard of this investigation, and if there was an investigation it seems like it was worse than useless by creating a sense that \"something\" had been done, but really without any actual consequences as far as I can tell.</p>", "parentCommentId": "p2z5uCfSmpGTwwRMa", "user": {"username": "Habryka"}}, {"_id": "8wSzn8wYpDLQgRdQe", "postedAt": "2023-03-22T22:44:40.700Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Re: \"In the weeks leading up to that April 2018 confrontation with Bankman-Fried and in the months that followed, Mac Aulay and others warned MacAskill, Beckstead and Karnofsky about her co-founder’s alleged duplicity and unscrupulous business ethics\" -</p>\n<p>I don't remember Tara reaching out about this, and I just searched my email for signs of this and didn’t see any. I'm not confident this didn't happen, just noting that I can't remember or easily find signs of it.</p>\n<p>In terms of what I knew/learned 2018 more generally, I discuss that <a href=\"https://forum.effectivealtruism.org/posts/mCCutDxCavtnhxhBR/some-comments-on-recent-ftx-related-events?commentId=nQuoY3XAjK3R3C8k4\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "HoldenKarnofsky"}}, {"_id": "ccmbMnAgwuPaMGDtN", "postedAt": "2023-03-22T23:15:48.686Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Isn't the point of EA that we are responsive to new arguments? So, unlike Extinction Rebellion where belief that climate change is a real and imminent risk is essential, our \"belief system\" is rather more about openness and willingness to update in response to 1) evidence, and 2) reasonable arguments about other world views?</p>\n<p>Also I think a lot of the time when people say \"value alignment\", they are in fact looking for signals like self-identification as EAs, or who they're friends with or have collaborated / worked with. I also notice we conflate our aesthetic preferences for communication with good reasoning or value alignment; for example, someone who knows in-group terminology or uses non-emotive language is seen as aligned with EA values / reasoning (and by me as well often). But within social-justice circles, emotive language can be seen as a signal of value alignment. Basically, there's a lot more to unpack with \"value alignment\" and what it means in reality vs. what we say it ostensibly means.</p>\n<p>Also to tackle your response, and maybe I'm reading between the lines too hard here / being too harsh on you here, but I feel there's goalpost shifting in your original post about EA value alignment and you now stating that people who understand broader principles are also \"value aligned\".</p>\n<p>Another reflection: the more we speak about \"value alignment\" being important, the more it incentivises people to signal \"value alignment\" even if they have good arguments to the contrary. If we speak about valuing different perspectives, we give permission and incentivise people to bring those.</p>\n", "parentCommentId": "8SkZdxKQdDrcag28i", "user": {"username": "howdoyousay?"}}, {"_id": "hf9QL2H6bQoTLD4Jb", "postedAt": "2023-03-23T11:28:33.362Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<blockquote><p>Isn't the point of EA that we are responsive to new arguments? So, unlike Extinction Rebellion where belief that climate change is a real and imminent risk is essential, our \"belief system\" is rather more about openness and willingness to update in response to 1) evidence, and 2) reasonable arguments about other world views?</p></blockquote><p>&nbsp;</p><p>Yes - but the issue plays itself out one level up.</p><p>For instance, most people aren't very scope sensitive – firstly in their intuitions, and especially when it comes to acting on them.</p><p>I think scope sensitivity is a key part of effective altruism, so appointing people who are less scope sensitive to boards of EA orgs is similar to XR appointing people who are less concerned about climate change.</p><blockquote><p>Also I think a lot of the time when people say \"value alignment\", they are in fact looking for signals like self-identification as EAs, or who they're friends with or have collaborated / worked with. I also notice we conflate our aesthetic preferences for communication with good reasoning or value alignment; for example, someone who knows in-group terminology or uses non-emotive language is seen as aligned with EA values / reasoning (and by me as well often).</p></blockquote><p>I agree and think this is bad. Another common problem is interpreting agreement on what causes &amp; interventions to prioritise as 'value alignment', whereas what actually matters are the underlying principles.</p><p>It's tricky because I think these things do at least <i>correlate</i> with with the real thing. I don't feel like I know what to do about it. Besides trying to encourage people to think more deeply, perhaps trying one or two steps harder to work with people one or two layers out from the current community is a good way to correct for this bias.</p><blockquote><p>Also to tackle your response, and maybe I'm reading between the lines too hard here / being too harsh on you here, but I feel there's goalpost shifting in your original post about EA value alignment and you now stating that people who understand broader principles are also \"value aligned\".</p></blockquote><p>That's not my intention. I think a strong degree of wanting to act on the values is important for the majority of the board. That's not the same as self-identifying as an EA, but merely understanding the broad principles is also not sufficient.</p><p>(Though I'm happy if a <i>minority</i> of the board are less dedicated to acting on the values.)</p><p>(Another clarification from earlier is that it also depends on the org. If you're doing an evidence-based global health charity, then it's fine to fill your board with people who are really into global health. I also think it's good to have <i>advisors</i> from clearly outside of the community – they just don't have to be board members.)</p><blockquote><p>Another reflection: the more we speak about \"value alignment\" being important, the more it incentivises people to signal \"value alignment\" even if they have good arguments to the contrary. If we speak about valuing different perspectives, we give permission and incentivise people to bring those.</p></blockquote><p>I agree and this is unfortunate.</p><p>To be clear I think we should try to value other perspectives about the question of how to do the most good, and we should aim to cooperate with those who have different values to our own. We should also try much harder to draw on operational skills from outside the community. But the question of board choice is firstly a question of who should be given legal control of EA organisations.</p>", "parentCommentId": "ccmbMnAgwuPaMGDtN", "user": {"username": "Benjamin_Todd"}}, {"_id": "9dtddyNuR5EBBwuGP", "postedAt": "2023-03-23T12:52:57.553Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Now having read your reply, I think we're likely closer together than apart on views. But...</p><blockquote><p>But the question of board choice is firstly a question of who should be given legal control of EA organisations.</p></blockquote><p>I don't think this is how I see the question of board choice in practice. In theory yes, for the specific legal, hard mechanisms you mention. But in practice in my experience boards significantly check and challenge direction of the organisation, so the collective ability of board members to do this should be factored in appointment decisions which may trade off against legal control being put in the 'safest pair of hands'.</p><p>That said, I feel back and forth responses on the EA forum may be exhausting their value here; I feel I'd have more to say in a brainstorm about potential trade-offs between legal control and ability to check and challenge, and open to discussing further if helpful to some concrete issue at hand :)</p>", "parentCommentId": "hf9QL2H6bQoTLD4Jb", "user": {"username": "howdoyousay?"}}, {"_id": "Ran7FGa2QupiKqNoa", "postedAt": "2023-03-24T06:58:14.947Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Thanks, Ben. I agree with what you are saying. However, I think that on a practical level, what you are arguing for is not what happens. EA boards tend to be filled with people who work full-time in EA roles, not by fully-aligned talent individuals from the private sector (e.g. lawyers, corporate managers) who might be earning to give having followed 80k’s advice 10 years ago</p>\n", "parentCommentId": "zJxbHuaHMEWE8o6S2", "user": {"username": "Grayden"}}, {"_id": "oktyzmmpWKaixHGoT", "postedAt": "2023-03-24T07:05:55.018Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>Two quick points:</p><ol><li>Yes, legal control is the first consideration, but governance requires skill not just value-alignment</li><li>I think in 2023 the skills you want largely exist within the community; it’s just that (a) people can’t find them easily (hence I founded the <a href=\"https://eagoodgovernance.com\">EA Good Governance Project</a>) and (b) people need to be willing to appoint outside their clique</li></ol>", "parentCommentId": "9dtddyNuR5EBBwuGP", "user": {"username": "Grayden"}}, {"_id": "FSdrQsDjcrsvkhuRF", "postedAt": "2023-03-25T14:33:42.141Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p>(Sorry I took so long to come back) Thanks for clarifying. Hm I'm surprised then that it really seems like the journalist didn't turn up such quotes about fraud. I do think you are right that many of them expected a crash-and-burn... of some sort. I feel like I should have written something more precise like \"crash and burn 3 years later, after making 15B on paper\" which comes with so many signals over the years that if I were such a person I'd end up discounting my early suspicions. If I were in their or CEA's shoes I'd probably have expected something like what happened with Tara's company, a crash and burn pretty soon after (2019?), so I'd be assuming something got fixed along the way if not. Especially given how an ex-employee(s?) talked about burning through the Asian arbitrage dollars with bad trade decisions.. they'd have had to fix it, right, or they'd have gone belly-up way sooner?&nbsp;I guess crypto was just that much of a gold rush and so few \"adults in the room\" that they could keep fudging their numbers for that long..?<br><br>Maybe the investigation was worse than useless in the end, but reasonably any action taken was going to start with an investigation. It depends the quality of the investigation, but for now I'm much more comfortable considering this a bug of the world than something to blame CEA for.<br><br>[Edit: This isn't to say that I think no mistakes were made. But my complaints are not focused on EA leaders specifically (I'm hesitant to call out any single person til CEA's commissioned investigation is complete), and are different from what the article discusses. I discuss that in <a href=\"https://forum.effectivealtruism.org/posts/R7cBZEw9N5jgzr6EY/ivy_mazzola-s-shortform?commentId=eA2RjRXgPgy5ePWiD\">shortform</a>]</p>", "parentCommentId": "xgTe5LtoJystgzHyc", "user": {"username": "Ivy_Mazzola"}}, {"_id": "hJmpQv2CZbZg7W5jh", "postedAt": "2023-03-26T10:41:32.517Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": "<p><strong>ETA July</strong>:</p><p>I regret posting my comments for several reasons. I'm sorry to anyone I upset.</p><p>Specifically, I regret not putting more effort into ensuring that&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=4aqc8ASnFfLh586zA\"><u>my first comment</u></a> is not going to be misinterpreted, and ensuring to put things into context, e.g., that \"putting SBF on a pedestal\", if meaning something like “holding SBF up as a role model”, was—<i>certainly</i>&nbsp;<i>for those who didn’t know him well in person</i>!—in the vast majority of instances reasonable and understandable at the time, and I would have easily done the same! (Some things like e.g. tying EA’s reputation to SBF to such a close extent were perhaps not super wise but much of this is probably hindsight bias).</p><p>I feel also bad about mentioning the flyers, mostly because I got important information wrong which is a grave mistake in such a situation, and partly because my phrasing was too harsh/critical (if the person who created those flyers is ever reading this, I'm sorry, you had good intentions and it wasn't a big deal at all!).</p><p>I wrote the comment because I was disconcerted by the&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=FfsxRcRuWmJtqRGME\"><u>original comment</u></a> (and its initial high Karma count) which seemed to seriously question whether we “elevated [SBF] as a moral paragon and someone to emulate “, or “tied EA's reputation closely to his”, and asked for specific examples. I still feel like it’s a no-brainer that EAs, in general,&nbsp;<i>obviously&nbsp;</i>and<i> understandably</i> elevated SBF as a role model and someone worth emulating! Seriously questioning this still strikes me as defensive motivated reasoning and concerning. Many people seemed to agree with the commenter which made me worry that EAs would refuse to learn any lessons from this whole scandal which might risk repeating a similar monumental catastrophe. (Me being upset<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref73cesy0xaht\"><sup><a href=\"#fn73cesy0xaht\">[1]</a></sup></span>&nbsp;is not meant to be an excuse but if anything a further reason why I should have written this comment differently. As a general rule, it's simply bad to write comments when one is upset because it clouds one's judgment and reduces compassion, and this is an obvious mistake which I should not have made.)</p><p>So why did the FTX scandal happen? One simplistic perspective is (ignoring many other, more important causal factors!): someone with&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/LpkXtFXdsRd4rG8Kb/reducing-long-term-risks-from-malevolent-actors\"><u>dark triad/malevolent traits</u></a> got more and more power and ended up doing something extremely bad. Other people did not realize that this person is malevolent, or suspected it and didn’t speak up (e.g., because of fear, miscalculation, or motivated reasoning, or opportunism). I’ve seen that story before and it really shaped my outlook on life.&nbsp;</p><p>That’s why I wanted to make the following argument: let’s not put too much faith in the character judgment of the people who championed SBF (<i>and</i> have known him very well) going forward, to make sure that something like this doesn’t happen again. Let’s not be like “oh well, there is nothing we can learn from this, no need to change anything”. That does seem like a very important point to me and I stand by that.&nbsp;</p><p>Now, importantly, I wasn’t trying to imply that any EA leader knew about the fraud or did something illegal. I also wasn’t trying to imply that mistakes like ‘suboptimal character judgment’ are&nbsp;<i>even remotely comparable</i> to the mistakes that SBF made. Of course, it’s not even close. In some sense, it’s a minor mistake that probably more than 95% of people would have made (because lots of things would have to come together to not make such mistakes). In fact, in my experience, many amazing people don’t have great character judgment.&nbsp;</p><p>But on the other hand, it’s still substantial and worth keeping in mind and should be factored in when making, e.g., board decisions (as board members appoint executive directors and those should have good character) or when trusting these people’s character judgment in the future. (Also, I feel like some comments seemed to suggest that being naive and overly trusting is just cute but not worth worrying about which I don’t agree with.)</p><p>As I also wrote in the original comment, I’m not even sure that EA leaders, including Will, made any mistakes ex ante given the enormous uncertainty and complexity of the whole situation and all the important trade-offs involved. I do think that it’s&nbsp;<i>plausible</i> though that some mistakes were made, including significant ones.&nbsp;</p><p>I also regret having singled out Will and I’m sorry if this comment upset anyone. I worry that others may have interpreted my comment as trying to put&nbsp;<i>all</i> the blame on him which I really didn’t want to. I did it, because, to my knowledge, Will was really the EA leader who championed SBF the most and had the closest personal connection to him (aside from people like Caroline, etc., of course). And generally, I think it’s valuable to give specific examples when possible. It’s important to note that many others were involved in this too and could have stepped in!&nbsp;</p><p>To be perfectly clear, I think EA leaders, including Will, have done tremendous good and worked very hard to make the world a better place. I don’t want to belittle their extraordinary contributions.</p><p>Last, I worry that my comment was interpreted as taking the side of EA critics which is not the case. I think that much criticism of EA and EA leaders in the media has been unfair and exaggerated.</p><p>There is more I could write about all of this but this issue is emotionally taxing and I already spent several days on this comment, and I’m trying to move on. (Several days for just writing this crappy comment? Yeah, most of this was just feeling guilty without being able to do anything else productive. This ties to the general issue of how much time to put into comments. FWIW, in the months before writing the comments in March, I was actively challenging myself to write comments more quickly (and often). In hindsight, this could have been a mistake since I may lack the necessary verbal intelligence to pull this off.)<br><br>--------------------------------------------------------------------<br>[Original comment.]<br><br>Thanks, these are good points.&nbsp;<br><br>I do think it's plausible that (some!) EA leaders made substantial mistakes. Spotting questionable behavior or character is hard but not impossible, especially if you have known them for 10 years and work very closely with them and basically were in a mentee-mentor relationship (like e.g. Will, is my impression). I don't fault other people, e.g. those who rarely or never interacted with SBF, for not having done more.<br><br>Either people ignored warning signs -&gt; clear mistake. Or they didn't notice anything even though others had noticed signs (like e.g. Habryka)-&gt; suboptimal character judgment. I think the ability to spot such people and don't let them into positions of power is extremely important.<br><br>Of course, the crucial question is what could have been done even if you know 100% that SBF is not at all trustworthy. It's plausible to me that not much could have been done because SBF already accumulated so much power. So it's plausible that no one made substantial mistakes. On the other hand, no one forced Will to write Musk and vouch for SBF which perhaps wasn't wise if you have concerns about SBF. On the other hand, it's perhaps also reasonable to gamble on SBF given the inevitable uncertainty about other's character and the large possible upsides. Perhaps I'm just suffering from hindsight bias.<br><br>Also, just to be clear, I agree that much of the criticism against EAs and EA leaders we see in the media is unfairly exaggerated. I'm wary of contributing to what I perceive as others unjustly piling-on a movement of moral activists, probably fueled by do-gooder derogation, and so on (as Geoffrey mentions <a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=CQsebP3yueCgrEiod\">in his comment</a>.)&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn73cesy0xaht\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref73cesy0xaht\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Why have I been so upset? The usual. The ideals of EA are very close to my heart so it made me very sad to see so many people (outside of EA) hate on EA ideals and to ridicule so many important values and concepts. That's a terrible sign for the long-term trajectory of humanity and it has reduced the global level of good-will, cooperation, and trust. It made many people more cynical about the very ideas of altruism and truth-seeking itself.</p></div></li></ol>", "parentCommentId": "D7uKotwLkjEMXZ2eH", "user": {"username": "David_Althaus"}}, {"_id": "7ogijrhKm2NfoDGiD", "postedAt": "2023-03-15T15:51:56.153Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": null, "parentCommentId": "8xza6TJvxYBXygi6u", "user": null}, {"_id": "PghsBooYk9hznpf4b", "postedAt": "2023-03-15T21:41:27.696Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": null, "parentCommentId": "9Qhw5qKwDjbyxkdfn", "user": null}, {"_id": "ijomS4cBMfbddrnmn", "postedAt": "2023-03-25T15:00:37.023Z", "postId": "b83Zkz4amoaQC5Hpd", "htmlBody": null, "parentCommentId": "xgTe5LtoJystgzHyc", "user": null}]