[{"_id": "dDLWuETkxBviQnMyo", "postedAt": "2024-01-26T13:26:59.492Z", "postId": "BaoA3gz7xRaqn764J", "htmlBody": "<p><strong>Executive summary</strong>: The Gaia Network is proposed as a decentralized system for connecting causal models to improve scientific efficiency, decision-making, and AI safety via collective intelligence.</p><p><strong>Key points</strong>:</p><ol><li>The Gaia Network allows causal models to share information on parameters through posterior distribution updates. This facilitates real-time meta-analysis.</li><li>By tracking information flow between models, the network credits contributions and measures epistemic impact. This enables quantified assessment for funding and prizes.</li><li>Decision engines can query models in the network to simulate outcomes, factoring in uncertainties and dependencies. This aids organizations in strategy and operations.</li><li>For AI safety, the network serves as a distributed world model and gatekeeper to evaluate actions, incorporating preferences and constraints.</li><li>Rather than a standalone project, the network emerges from incremental economic incentives for better science and decisions. Contributions are possible with today's technology.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "C8ExAjxFNYGKoKCoB", "postedAt": "2024-01-27T22:58:55.117Z", "postId": "BaoA3gz7xRaqn764J", "htmlBody": "<p><strong>TLDR:</strong> This proposal claims to be able to solve a wide range of problems (including AI Safety and, apparently, <a href=\"https://explorer.gitcoin.co/#/round/10/0xb6be0ecafdb66dd848b0480db40056ff94a9465d/0xb6be0ecafdb66dd848b0480db40056ff94a9465d-33\">defeating Moloch</a>) by implementing an extremely ambitious proposal that would require large amounts of unprecedented coordination. I'm deeply skeptical.</p><p>I get that this is not particularly deep feedback, but after spending about two hours going through the old and the new post, my impression is that this a complex, very technical and extremely ambitious proposal, and for this reason, I would be very surprised if this project grew beyond the uptake of a few niche stakeholders.</p><p>As far as I understand it, if this system were to be implemented successfully, it would require not only fully transforming the way we plan, fund, do and publish science<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefigq76tuyyd\"><sup><a href=\"#fnigq76tuyyd\">[1]</a></sup></span>, but also convincing varied stakeholders in society (like businesses and individuals) to use this complicated system for their own decision-making, all under AI safety deadlines.</p><p>This feels extremely untractable on the surface, and I'm worried about how this parallels the general form of similar proposals in the world of crypto, DeFi, DAOs, etc.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefsbmg63cpfj\"><sup><a href=\"#fnsbmg63cpfj\">[2]</a></sup></span>&nbsp;There's usually an ambitious, highly-technological proposal for changing the fundamental way we do things in broad sectors of society, with little to no actionable plan for getting there, and dealing with all the complexities of society along the way.</p><p>I'm also skeptical of the theory of change. Even if AI Safety timelines were long, and we managed to pull this Herculean effort off, we would <i>still</i> have to deal with problems around AI Safety governance. Why would AGI companies want to stick to this way of developing systems?&nbsp;</p><p>It's also the case that this project also claims to be able to basically be able to slay Moloch<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvr866eac55j\"><sup><a href=\"#fnvr866eac55j\">[3]</a></sup></span>.&nbsp;This seems typical of solutions looking for problems to solve, especially since apparently this proposal <a href=\"https://www.digitalgaia.earth/#gaia-network\">came from a previous project that wasn't related to AI Safety at all.</a></p><p>I hope I'm wrong, and maybe I'm just being uncharitable as a result of being initially very confused by reading the old article (this is a great improvement!), but I also felt like I should share <i>some</i> feedback after having spent this much time going through everything.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnigq76tuyyd\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefigq76tuyyd\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Most scientists barely know about Bayesian methods, and even less want to use them; why would they completely change how they work to “join” the network? (Especially at the start, when the network doesn't provide much value yet)</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnsbmg63cpfj\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefsbmg63cpfj\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I later found that Digital Gaia's Twitter account <a href=\"https://twitter.com/_digitalgaia\">seems full of references to blockchain, DeFI and DAOs too</a>. I don't get how they're related.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvr866eac55j\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvr866eac55j\">^</a></strong></sup></span><div class=\"footnote-content\"><p><a href=\"https://explorer.gitcoin.co/#/round/10/0xb6be0ecafdb66dd848b0480db40056ff94a9465d/0xb6be0ecafdb66dd848b0480db40056ff94a9465d-33\">See here.</a> Apparently the project has existed for a few years.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "i58gjF6yHdzHyqAfQ", "postedAt": "2024-01-31T08:14:38.863Z", "postId": "BaoA3gz7xRaqn764J", "htmlBody": "<p>Hello Agustín, thanks for engaging with our writings and sharing your feedback.</p><p>Regarding the ambitiousness, low chances of overall success, and low chances of uptake by human developers and decision-makers (I emphasize \"human\" because if some tireless near-AGI or AGI comes along it could change the cost of building agents for participation in the Gaia Network dramatically), we are in complete agreement.</p><p>But notice Gaia Network could be seen as a much-simplified (from the perspectives of mathematics and Machine Learning) version of Davidad's OAA, as we framed it <a href=\"https://forum.effectivealtruism.org/posts/iMGSyGvgeyjFBcc3h/gaia-network-a-practical-incremental-pathway-to-open-agency\">in the first post</a>. Also, Gaia Network tries to leverage (at least approximately and to some degree) the existing (political) institutions and economic incentives. In contrast, it's very unclear to me how the political economy in the \"OAA world\" could look like, and what is even a remotely plausible plan for switching from the incumbent political economy of the civilisation to OAA, or \"plugging\" OAA \"on top\" of the incumbent political economy (and hasn't been discussed publicly anywhere, to the best of our knowledge). We also discussed this in the first post. Also, notice that due to its extreme ambitiousness, Davidad doesn't count on humans implementing OAA with their bare hands, it's a deal-breaker if there isn't an AI that can automate 99%+ of technical work needed to convert the current science into Infra-Bayesian language.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefepco4k2kmg5\"><sup><a href=\"#fnepco4k2kmg5\">[1]</a></sup></span>&nbsp;And yes, the same applies to Gaia Network: it's not feasible without massive assistance from AI tools that can do most of the heavy lifting. But if anything, this reliance on AI is less extreme in the case of Gaia Network than in the case of OAA.</p><p>The above makes me think that you should therefore be even more skeptical of OAA's chances of success than you are about Gaia's chances. Is this correct? If not, what do you disagree about in the reasoning above, or what elements of OAA make you think it's more likely to succeed?</p><h3>Adoption</h3><p>The \"cold start\" problem is huge for any system that counts on network effect, and Gaia Network is no exception. But this also means that the cost of convincing <i>most</i> decision-makers (businesses, scientists, etc.) to use the system is <i>far smaller</i> than the cost of convincing the first few, multiplied by the total number of agents. We have also proposed how various early adopters could get value out of the \"model-based and free energy-minimising way\" of doing decision-making (we don't need the adoption of Gaia Network right off the bat, more on this below) very soon, in absolutely concrete terms (monetary and real-world risk mitigation) <a href=\"https://www.lesswrong.com/posts/AKBkDNeFLZxaMqjQG/gaia-network-a-practical-incremental-pathway-to-open-agency?commentId=JYvCLMNfAe9gSzJWA#JYvCLMNfAe9gSzJWA\">in this thread</a>.</p><p>In fact, we think that if there are sufficiently many AI agents and decision intelligence systems that are model-based, i.e., use some kinds of executable state-space (\"world\") models to do simulations, hypothesise counterfactually about different courses of actions and external conditions (sometimes in collaboration with other agents, i.e., <i>planning together</i>), and deploy regularisation techniques (from Monte Carlo aggregation of simulation results to amortized adversarial methods suggested by Bengio on slide 47 <a href=\"https://slideslive.com/39014230/towards-quantitative-safety-guarantees-and-alignment\">here</a>) to permit <i>compositional</i> reasoning about risk and uncertaintly that scales beyond the boundary of a single agent, the benefits of collaborative inference of the most accurate and well-regularised models will be so huge that something like Gaia Network will emerge pretty much \"by default\" because a lot of scientists and industry players will work in parallel to build some versions and local patches of it.</p><h3>Blockchains, crypto, DeFi, DAOs</h3><p>I understand why the default prior when hearing anything about crypto, DeFi, and DAOs now is that people who propose something like this are either fantaseurs, or cranks, or, worse, scammers. That's unfortunate to everyone who just wants to use the technical advances that happen to be loosely associated with this field, which now includes almost anything that has to do with cryptography, identity, digital claims, and zero-knowledge computation.</p><p>Generally speaking, zero-knowledge (multi-party) computation is the only solution to make some proofs (of contribution, of impact, of lack of deceit, etc.) without compromising privacy (e.g., proprietary models, know-how, personal data). The ways to deal with this dilemma \"in the real world\" today inevitably come down to some kind of surveillance which many people become very uneasy about. For example, consider the present discussion of data center audits and compute governance. It's fine with me and most other people except for e/accs, for now, but what about the time when the cost of training powerful/dangerous models will drop so much that anyone can buy a chip to train the next rogue AI for 1000$? How does compute governance look in this world?</p><h3>Governance</h3><blockquote><p>I'm also skeptical of the theory of change. Even if AI Safety timelines were long, and we managed to pull this Herculean effort off, we would <i>still</i> have to deal with problems around AI Safety governance.</p></blockquote><p>I don't think AI Safety governance is that special among other kinds of governance. But more generally on this point, of course, governance is important, and Gaia Network doesn't claim to \"solve\" it; rather, it plans to rely on some solutions developed by other projects (see numerous examples in <a href=\"https://docs.google.com/spreadsheets/d/18qCNZtoR_zh6Izpkx3N_YHCkCPdWgEBMguxh2QhCPJE/edit#gid=0\">CIP ecosystem map</a>, OpenAI's \"Democratic Inputs to AI\" grantees, etc.).</p><p>We just mention in passing <i>incorporating preferences</i> of system's stakeholders into Gaia agents' subjective value calculations (i.e., building reward models for these agents/entities, if you wish), but there is <i>a lot</i> to be done there: how the preferences of the stakeholders are aggregated and weighted, <i>who can claim to be a stakeholders of this or that system in the first place</i>, etc. Likewise, on the general Gaia diagram in the post, there is a small arrow from \"Humans and collectives\" box to \"Decision Engines\" box labelled \"Review and oversight\", and, as you can imagine, there is a lot to be going on there as well.</p><blockquote><p>Why would AGI companies want to stick to this way of developing systems?</p></blockquote><p>IDK, convinced that this is a safe approach? Being coerced (including economically, not necessary by force) by the broader consensus of using such Gaia Network-like systems? This is a collective action problem. This question could be addressed to any AI Safety agenda and the answer would be the same.</p><h3>Moloch</h3><blockquote><p>It's also the case that this project also claims to be able to basically be able to slay Moloch<a href=\"https://forum.effectivealtruism.org/posts/BaoA3gz7xRaqn764J/gaia-network-an-illustrated-primer#fnvr866eac55j\"><sup>[3]</sup></a>.&nbsp;This seems typical of solutions looking for problems to solve, especially since apparently this proposal <a href=\"https://www.digitalgaia.earth/#gaia-network\">came from a previous project that wasn't related to AI Safety at all.</a></p></blockquote><p>I wouldn't say that we \"claim to be able to <i>slay</i> Moloch\". Rafael is more bold in his claims and phrasing than me, but I think even he wouldn't say that. I would say that the project looks very likely to <i>help</i> to counteract Molochian pressures. But this seems to me almost a self-evident statement, given the nature of the proposal.</p><p>Compare with <a href=\"https://cip.org/\">Collective Intelligence Project</a>. It has started with the mission to \"fix governance\" (and pretty much \"help to counteract Moloch\" in the domain of political economy, too, they barely didn't use this concept, or maybe they even did, I don't want to check it now), and now they \"pivoted\" to AI safety and achieved great legibility on this path: e.g., they partner with OpenAI, apparently, on more than one project now. Does this mean that CIP is a \"solution looking for a problem\"? No, it's just the kind of project that naturally lends to helps both with Moloch and AI safety. I'd say the same could be said of Gaia Network (if it is realised in some forms) and this lies pretty much in plain sight.</p><p>Furthermore, this shouldn't be surprising in general, because AI transition of the economy is evidently an accelerator and a risk factor in the Moloch model, and therefore these domains (Moloch and AI safety) almost merge in my overall model of risk. Cf. Scott Aaronson's reasoning that AI will inevitably be in the causal structure of any outcome of this century so \"P(doom from AI)\" is not well defined; I agree with him and only think about \"P(doom)\" without specification what this doom \"comes from\". Again, note that it seems that most narratives about possible good outcomes (take OpenAI's superalignment plan, Conjecture's CoEm agenda, OAA, Gaia Network) all rely on developing very advanced (if not superhuman) AI along the way.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnepco4k2kmg5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefepco4k2kmg5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Notice here again: you mention that most scientists don't know about Bayesian methods, but perhaps at least two orders of magnitude still fewer scientists have even <i>heard</i> of Infra-Bayesianism, let alone being convinced it's a sound and a <i>necessary</i> methodology for doing science. Whereas for Bayesianism, from my perspective, it seems there is quite a broad consensus of its soundness: there are numerous pieces and even <a href=\"https://www.amazon.com/Book-Why-Science-Cause-Effect/dp/046509760X\">books</a> written about how P-values are a bullshit value of doing science and that scientists should take up (Bayesian) causal inference instead.<br><br>There are a few notable voices that dismiss Bayesian inference, for example, David Deutsch, but then no less notable voices, such as Scott Aaronson and Sean Carroll (of the people that I've heard, anyway), that dismiss Deutsch's dismissal in turn.</p></div></li></ol>", "parentCommentId": "C8ExAjxFNYGKoKCoB", "user": {"username": "Roman Leventov"}}, {"_id": "evTgisJB6NucHsYKN", "postedAt": "2024-01-31T18:31:54.696Z", "postId": "BaoA3gz7xRaqn764J", "htmlBody": "<blockquote><p>The above makes me think that you should therefore be even more skeptical of OAA's chances of success than you are about Gaia's chances.</p></blockquote><p>I am, but OAA also seems less specific, and it's harder to evaluate its feasibility compared to something more concrete (like this proposal).&nbsp;</p><blockquote><p>In fact, we think that if there are sufficiently many AI agents and decision intelligence systems that are model-based, i.e., use some kinds of executable state-space (\"world\") models to do simulations, hypothesise counterfactually about different courses of actions and external conditions (sometimes in collaboration with other agents, i.e., <i>planning together</i>), and deploy regularisation techniques (from Monte Carlo aggregation of simulation results to amortized adversarial methods suggested by Bengio on slide 47 <a href=\"https://slideslive.com/39014230/towards-quantitative-safety-guarantees-and-alignment\">here</a>) to permit <i>compositional</i> reasoning about risk and uncertaintly that scales beyond the boundary of a single agent, the benefits of collaborative inference of the most accurate and well-regularised models will be so huge that something like Gaia Network will emerge pretty much \"by default\" because a lot of scientists and industry players will work in parallel to build some versions and local patches of it.</p></blockquote><p>My problem with this is that it <i>sounds</i> good, but this argument relies on many hidden premises, that make me inherently skeptical of any strong claims like “(…) the benefits of collaborative inference of the most accurate and well-regularised models will be so huge that something like Gaia Network will emerge pretty much 'by default'”.</p><p>I think this could be addressed by a convincing MVP, and I think that you're working on that, so I won't push further on this point.</p><blockquote><p>It's fine with me and most other people except for e/accs, for now, but what about the time when the cost of training powerful/dangerous models will drop so much that anyone can buy a chip to train the next rogue AI for 1000$? How does compute governance look in this world?</p></blockquote><p>The <a href=\"https://arxiv.org/abs/2303.11341\">current best proposals</a> for compute governance rely on very specific types of math. I don't think throwing blockchain or DAOs at the problem makes a lot of sense, unless you find an instance of the very specific set of problems they're good at solving.</p><p>My priors against the crypto world comes mostly from noticing a lot of people throwing tools to problems without a clear story of how these tools actually solve the problem. This has happened so many times that I have come to generally distrust crypto/blockchain proposals <i>unless </i>they give me a clear explanation of why using these technologies makes sense.</p><p>But I think the point I made here was kinda weak anyway (it was, at best, discrediting by association), so I don't think it makes sense to litigate this particular point.</p><blockquote><p>Compare with <a href=\"https://cip.org/\">Collective Intelligence Project</a>. It has started with the mission to \"fix governance\" (and pretty much \"help to counteract Moloch\" in the domain of political economy, too, they barely didn't use this concept, or maybe they even did, I don't want to check it now), and now they \"pivoted\" to AI safety and achieved great legibility on this path: e.g., they partner with OpenAI, apparently, on more than one project now. Does this mean that CIP is a \"solution looking for a problem\"? No, it's just the kind of project that naturally lends to helps both with Moloch and AI safety. I'd say the same could be said of Gaia Network (if it is realised in some forms) and this lies pretty much in plain sight.</p></blockquote><p>I find this decently convincing, actually. Like, maybe, I'm pattern matching too much on other projects which have in the past done something similar (just lightly rebranding themselves while tacking a completely different problem).</p><p>Overall, I still don't feel very good about the overall feasibility of this project, but I think you were right to push back on some of my counterarguments here.</p>", "parentCommentId": "i58gjF6yHdzHyqAfQ", "user": {"username": "agucova"}}, {"_id": "p4kptBfmScTGMxphv", "postedAt": "2024-02-07T13:38:20.513Z", "postId": "BaoA3gz7xRaqn764J", "htmlBody": "<p>Thanks <a href=\"https://forum.effectivealtruism.org/users/agustin-covarrubias?mention=user\">@Agustín Covarrubias</a> . Glad to hear that you feel this is concrete enough to be critiqued and cross-validated, that was exactly our goal in writing and posting this. From your latest responses, it seems like the main reason why you \"still don't feel very good about the overall feasibility of this project\" is the lack of a \"convincing MVP\", is that right? We are indeed working on this along a few different lines, so I would be curious to understand what kind of evidence from an MVP it would take to convince you or shift your opinion about feasibility.</p>", "parentCommentId": "evTgisJB6NucHsYKN", "user": {"username": "Rafael Kaufmann"}}]