[{"_id": "vxDRXzvA3HLiFnorm", "postedAt": "2022-12-23T11:55:24.732Z", "postId": "bbAzJ33DDw6EmxekP", "htmlBody": "<p>It's great to see more thoughtful posts proposing new global health and development interventions. Upvoted.</p><p>Just sharing as an FYI - one of the key papers you cite for the cost-effectiveness analysis issued a <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7266554/\">correction</a>, and the <a href=\"https://academic.oup.com/ije/article/48/4/1113/5366950?login=false\">revised estimate</a> of DALYs averted is 149 thousand rather than 14.9 million. It looks like there was an order of magnitude error somewhere along the way in their calculations.</p>", "parentCommentId": null, "user": {"username": "mpt7"}}, {"_id": "Hude5JboRZqKKDizD", "postedAt": "2022-12-23T12:13:20.528Z", "postId": "bbAzJ33DDw6EmxekP", "htmlBody": "<p>Thanks for letting me know! I'll change the takeaways. Yes, that is a key change. I thought it seemed very high, but I am not an expert in DALY estimation, and it's easy to get reckless with numbers plucked from other people's work...</p>\n<p>I'm still concerned because 149,000 DALYs seems very low when compared to the GBD's estimate of 66,000 premature deaths. Even if those deaths were all elderly people who would have lived only one year, that means only 83,000 DALYs were lost from exposure of (a comparable number of) children, pregnant women, etc to massive spikes in pollution. That doesn't seem right - the rest of that study seems to indicate that a large fraction of the burden comes from disease rather than death. I suppose I don't understand this kind of study enough!</p>\n", "parentCommentId": "vxDRXzvA3HLiFnorm", "user": {"username": "therealslimkt"}}, {"_id": "XzLuCr7p6dJ2BSCyF", "postedAt": "2022-12-24T00:25:35.312Z", "postId": "bbAzJ33DDw6EmxekP", "htmlBody": "<p>This 100x change is huge, and I think deserves a prominent note in the main text, either significantly rewriting the cost-effetiveness section based on this number, or at least putting something like [EDIT: this cost-effectiveness calculation is no longer endorsed by the author, due to a mistake in the paper cited].\nThat said, I think this is not as irreconcilable as it seems, as the new 149k DALYs figure is only referring to Punjab, Haryana and Delhi, which account for ~5% of India's population, whereas the 66k deaths figure is for India as a whole.  It is not as simple as just multiplying through by ~20 to get the DALYs for the whole country, as the impression i get is that those states are unusually bad for crop residue burning.\nGreat post though, I would be excited to see more work on this :)</p>\n", "parentCommentId": "Hude5JboRZqKKDizD", "user": {"username": "Oscar Delaney"}}, {"_id": "HzDbWJNgPEjsGKegL", "postedAt": "2022-12-24T03:40:25.567Z", "postId": "bbAzJ33DDw6EmxekP", "htmlBody": "<p>Yes, I will make the change prominently after Christmas. Even though it's in three states, those are the states that experience the vast majority of pollution, so I'm still very surprised.</p>\n", "parentCommentId": "XzLuCr7p6dJ2BSCyF", "user": {"username": "therealslimkt"}}, {"_id": "kWjXvTTjNAnD9gzND", "postedAt": "2022-12-31T13:40:40.407Z", "postId": "bbAzJ33DDw6EmxekP", "htmlBody": "<p>Excellent!<br>I was wondering, for cases like this, is there a sort of standard RCT-to-implementation pipeline/toolkit that can help?<br>Seems like there could be a real benefit in an organization that can accelerate these sorts of things, taking promising research-backed interventions and getting them on the right path to implementation at scale.<br>Activities could include providing a &nbsp;replicable framework for what the different steps in the process are, and helping at each stage, whether it's funding and logistics for the replication study, setting up the nonprofit and so on.<br>If something like this exists I'd be glad to know. If not could be a promising area to explore?</p>", "parentCommentId": null, "user": null}, {"_id": "uwk8wgrLFNNJhseBJ", "postedAt": "2022-12-31T21:20:39.557Z", "postId": "bbAzJ33DDw6EmxekP", "htmlBody": "<p>My guess is that any organization that might consider implementing an RCT should first replicate that RCT in their setting, at least as a pilot. My experience with RCTs is that they really feel like mini-NGOs, in that the implementation details are <em>really</em> important. I imagine the authors would be quite willing to share their experience with all of the implementation details. An RCT to implementation pipeline could be useful but I imagine most of the value could be attained by just talking to the authors of any particular RCT, who have spent years with the implementation details.</p>\n", "parentCommentId": "kWjXvTTjNAnD9gzND", "user": {"username": "therealslimkt"}}]