[{"_id": "vocyxZmPeB9T3iwfk", "postedAt": "2023-02-16T19:45:40.576Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>The relevant part of the Cowen talk:</p><blockquote><p>I think for virtually all social movements, I have a saying, and that is “demographics is destiny”. And you may like this or you may not like it. But it is also true for people in effective altruism. It's been true for people who are libertarianism. So if you look at early libertarianism, say in the 1970s, it had a very particular logical structure. But the actual descriptive fact of the matter was that a lot of libertarians were nerdy white males and some other set of libertarians were non-nerdy, somewhat rural, kind of gun owning anti-authoritarian, very US American white males who had a particular set of grudges. And what you end up getting from libertarianism is some evolution of those socioeconomic groups, which again, you might like or you might not like. But if you're evaluating libertarianism, you have to think a bit, well, what are the natural constituencies? What will those demographics get you? Do you like all of that? And are you ready for the stupider version of the theory?&nbsp;</p><p>So there's like the Robert Nozick super smart, very sophisticated libertarianism. But of course, that's not what you get. You get the stupider version. So you have to ask with effective altruism, well, what is the stupider version of effective altruism and what are its demographics and what does that mean is its destiny? I have limited experience in the EA movement, but at least in the United States, and I would readily admit other countries may differ. In the United States, it's quite young, very high IQ, very coastal, very educated, but broadly people with the social conscience. None of that should be surprising, right? But I think the demographics of the EA movement are essentially the US Democratic Party. And that's what the EA movement over time will evolve into. If you think the existential risk is this kind of funny, weird thing, it doesn't quite fit. Well, it will be kind of a branch of Democratic Party thinking that makes philanthropy a bit more global, a bit more effective. I wouldn't say it's a stupider version, but it's a less philosophical version that's a lot easier to sell to non-philosophers. Just so you end up telling people you should think more broadly about how you should give money at the margin, I agree with that. I'm fine with it. But it's simply another way of thinking about what effective altruism really is, just as it is with libertarianism, just to understand that demographics is destiny.&nbsp;</p><p>I gave a talk to an EA group lately, and I'm always like a troll when I give these talks. That's on purpose, but I'm saying things I believe, to be clear. I'm not making up stuff I don't believe. So I said to them all, you EAers, you should be more religious, and a lot of you should be social conservatives, because social conservatism is actually better for human welfare. I didn't mean that in the sense of government coercively enforcing social conservatism on people, but just people voluntarily being more socially conservative. I said a lot of you should do a lot more to copy the Mormons. Maybe now I would say the Quakers, other groups too. What was striking to me was how shocked everyone was by this point. I'm not saying they should have agreed or not agreed, but they hadn't ever heard it before. Will McAskill said this in his podcast with me. He said, oh, where are all social liberals? That doesn't really follow at all. It's something you can debate. But the fact that so many people took it for granted to me gets back at this point. When it comes to EA, demographics is destiny, and the future of socially conservative EA is really not that strong, but it should be. And after my talk, a woman went up to me and she came over and she whispered in my ear and she said, you know, Tyler, I actually am a social conservative and an effective altruist, but please don't tell anyone. I thought that was awesome. And of course, I didn't tell anyone who she was. But the mere fact that she felt the need to whisper this to me gets back to demographics is destiny.&nbsp;</p><p>So in part, when you think about EA, don't just think about the philosophic propositions. Think about what it is, what it is becoming. And again, in the United States, at least, it is a very specific set of sociological connections that will shape its future. I like many of those trends at the margin, but I would say not all of them. And just looking at EA that way would be another way in which I differ from a lot of the effective altruists themselves, noting that when I mentioned social conservatism, they just all were shocked. I don't think they agreed with me, but for me, the important point was that they were shocked that I would bring up such a thing. They just took it for granted that effective altruist people ought to be social liberals.&nbsp;</p></blockquote>", "parentCommentId": null, "user": {"username": "ModusTrollens"}}, {"_id": "wnjW6DkGMMiMHXfpJ", "postedAt": "2023-02-16T20:29:06.745Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Almost every \"bad\" thing said here about \"Woke EA\" sounds good to me, while the \"good\" things EA would otherwise be able to achieve sound absolutely horrible.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "wjLAhA9KrmmxmbNBp", "postedAt": "2023-02-16T20:47:26.047Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Could you expand on this? What do you find horrible about the ability to recreate the success of Ashekenazi Jews among different populations, for example?</p>", "parentCommentId": "wnjW6DkGMMiMHXfpJ", "user": {"username": "Anon Rationalist"}}, {"_id": "yC2pLqXCQusDnsXQi", "postedAt": "2023-02-16T21:34:57.157Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Strong downvoted because it's obviously a troll question on face but even rhetorically dumb because you asked it of an Israeli math olympiad medalist.</p>", "parentCommentId": "wjLAhA9KrmmxmbNBp", "user": {"username": "zichenghuang"}}, {"_id": "k8RkAg3mtwsaTCjcr", "postedAt": "2023-02-16T21:46:08.616Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>I treat posts based on their content rather than the author. I have no idea who different posters are, nor do I care much on issues unrelated to specific experience or expertise.</p><p>You are correct that my question was uncharitable and posted in frustration at a comment that I found detrimental to discussion. I should have said, and pose this as an open question:&nbsp;</p><p>I agree that applying cost-benefit analysis in a manner consistent with EA principles to areas like zoning, drug approval, and nuclear energy are good. I do not agree that increased credentialism or additional taboos are beneficial to the stated goals of EA, for the reasons outlined in the article.</p><p>I would ask that you state specifically what you find horrible, what cause areas should be exempt from cost-benefit analysis, and why? The current comment, as posted, does not contribute to meaningful discussion by way of its vagueness.</p>", "parentCommentId": "yC2pLqXCQusDnsXQi", "user": {"username": "Anon Rationalist"}}, {"_id": "Ze9HJPKuXEaucmbfg", "postedAt": "2023-02-16T21:59:03.848Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<blockquote>\n<p>EA should be willing to explore all potentially fruitful avenues of mission fulfillment without regard to taboo.</p>\n</blockquote>\n<p>In general, where it doesn't directly relate to cause areas of principle concern to effective altruists, I think EAs should strive to respect others' sacred cows as much as possible. Effective Altruism is a philosophy promoting practical action. It would be harder to find allies who will help us achieve our goals if we are careless about the things other people care a lot about.</p>\n", "parentCommentId": null, "user": {"username": "Derek Shiller"}}, {"_id": "XGb5s3vqPrps4KbSx", "postedAt": "2023-02-16T22:22:27.021Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>I generally agree that being palatable and well-funded are beneficial to effective altruism, and palatability and effectiveness exist on a utility curve. I do not know how we can accurately assess what cause areas should be of principle concern if certain avenues are closed due to respect for others' sacred cows. I think the quote from Scott Alexander addresses this nicely; if you could replicate Jewish achievement, whether culturally or genetically, doing so would be the single most significant development for human welfare in history. Regardless of taboos, that should be a cause area of principle concern, and would be if EA held such ideas to cost-benefit analyses instead of sacred beliefs. And as the lists of sacred beliefs grow, it further hampers other cause areas that would benefit from a rationalist mindset.</p>", "parentCommentId": "Ze9HJPKuXEaucmbfg", "user": {"username": "Anon Rationalist"}}, {"_id": "7rKQmSpPvKLLpQuDa", "postedAt": "2023-02-16T22:38:52.010Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>To be clear I strong downvoted your comment for the reasons I posted. I think my main disagreement with Hanania's post is that it aims to be persuasive rather than explanatory in a way that I think are the hallmarks of politics being a mind-killer. I also downvote tribalist \"wokism\" posts for the same reason. &nbsp;</p><p>I also think anti-wokism is detrimental to object level goals with regards to alignment as we've currently seen the discourse be eaten alive in a miasma of \"alignment is just about censorship\" and \"EAs are right wing and appropriated the work of bias people and called it AI Safety\".</p><p>I do empathise your comment came from a place of frustration but I don't think it's a productive one nonetheless.&nbsp;</p>", "parentCommentId": "k8RkAg3mtwsaTCjcr", "user": {"username": "zichenghuang"}}, {"_id": "ZmXKjizTEfCNF3oyw", "postedAt": "2023-02-16T22:57:49.813Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>dspeyer <a href=\"https://forum.effectivealtruism.org/posts/sDaXKQCKHmX5DKhRy/ea-community-builders-commitment-to-anti-racism-and-anti?commentId=MBPLkDgeSKNgHZiZc\">brought up an interesting example</a> in another thread:</p>\n<blockquote>\n<p>In early 2020, people were reluctant to warn about covid-19 because it could be taken as justification for anti-chinese racism.</p>\n</blockquote>\n<p>Hanania writes:</p>\n<blockquote>\n<p>One path [EA] can take is to be folded into the Democratic coalition. It’ll have to temper its rougher edges, which means purging individuals for magic words, knowing when not to take an argument to its logical conclusion, compromising on free speech, more peer review and fewer disagreeable autodidacts, and being unwilling to engage with other individuals and communities that are too non-conformist to avoid having any heretical strains.</p>\n</blockquote>\n<p>It seems likely to me that if EA were \"folded into the Democratic coalition\" in this way, we would've been much slower to recognize the importance of COVID-19.</p>\n<p>It's only <a href=\"https://www.lesswrong.com/posts/WnheMGAka4fL99eae/hindsight-devalues-science\">with the benefit of hindsight</a> that we know COVID-19 was going to be a huge pandemic.  A question to think about: What's the COVID-19 pandemic probability such that we should be indifferent between discussing the virus and staying silent -- the pandemic probability such that the expected downside from anti-Chinese racism equals the expected upside from pandemic preparedness?</p>\n<p>IMO the benefit of EA getting folded into the Democratic coalition is limited, because people who think it's racist to discuss low-probability pandemics are already well-served by existing groups in the Democratic coalition.  EA shouldn't try to be all things to all people.  It's OK to leave EA and switch to antiracism advocacy if that's the cause that really speaks to you.</p>\n", "parentCommentId": "wnjW6DkGMMiMHXfpJ", "user": {"username": "Aptdell"}}, {"_id": "tN9cjYKkbKiRngGS7", "postedAt": "2023-02-17T04:18:32.079Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Strongly downvoted.</p>\n<p>This post quotes Scott Alexander on a tangent about as much as it does Richard Hannania to bolster minor points made in Hannania's post by appealing to a bias in favour of Scott Alexander among effective altruists.</p>\n<p>By linking to and so selectively quoting Hanania prominently, you're trying to create an impression that the post should be trustworthy to effective altruists in spite of the errors and falsehoods about effective altruism in particular and just in general. Assuming you've made this post in reinforcing a truth-seeking agenda in a truth-seeking agenda, you've failed by propagating an abysmal perspective.</p>\n<p>There are anti-woke viewpoints that have been well-received on the EA Forum but this isn't one of them. Some of them haven't been anonymous, so the fact that you had no reason to worry  more about your reputation than 'truth-seeking' isn't an excuse.</p>\n<p>You would, could and should have done better if you had shared an original viewpoint really more familiar with effective altruism than Hannania is. May you take heed of this lesson for the next time you try to resolve disputes.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "wLosHpNnPRqBsnmaA", "postedAt": "2023-02-17T04:48:53.589Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>\"Group differences in IQ is right around the corner, and if you’re going to maintain any kind of commitment to rationalism you’re going to have to either stop yourself before getting on that train or take it to its logical destination.\"</p>\n<p>Yikes.</p>\n<p>Eugenics or \"human biodiversity\" isn't a new idea and is incredibly toxic to most people. It has no place in the EA movement. If you let it anywhere near the movement, the only people that will remain are contrarian right-wingers that care more about being edgy and provocative than helping people or other animals. And also those who enjoy hanging around contrarian right-wingers (maybe they find them endearing or something? idk).</p>\n<p>Speaking as a group leader for a local EA group, if someone tried to start a conversation on HBD and its assumed \"logical destination\" at a group meetup, I would immediately and permanently ban them from the group.  It is incredibly hard to bring in different perspectives that lead to good decisions and better normative ethics. One conversation like that is enough to permanently lose many people I want in my group. If banning a few disagreeable right-wing \"rationalists\" who like to talk about HBD means lots of other people stay, I'll gladly take that trade-off.</p>\n<p>For those who think a ban is too harsh: go read the article linked to in this post, read several other top posts from the author, and read the comments from the blogs followers.</p>\n<p>There are plenty of contributions right-wing ideas and disagreeable rationalists can make to the EA movement.  Many of the movements best ideas come from those who identify that way. Just not the kind demonstrated in this post.</p>\n<hr>\n<p>[EDIT] I'm puzzled by the disagreement votes, so adding some more context:\nIn the linked blog post, Richard Hanania writes <em>\"A free market in ideas is like a free market in any other good or service. It ends up with Asian and white men on top who are there because they’re simply better than everyone else. Movements uncomfortable with this naturally get swallowed by wokeness.\"</em></p>\n<p>I think it's pretty clear that what Richard Hanania and the post author mean when they say \"anti-woke\" is that they think EA should entertain operationalized racism and sexism. Anti-racism and anti-sexism are commitments <a href=\"https://docs.google.com/document/d/1BVTuCn7NKdUZAA8DWR9eCsPD7Gcja0fWPnDs_Hy8R9Q/edit?usp=sharing\">wildly shared by EA community builders</a>. If being anti-racist and anti-sexist is \"woke\", the majority of EA has been \"woke\" for a long time and does better because of it.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "snMzPBhS2iESdnxDw", "postedAt": "2023-02-17T09:35:18.108Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>I don't think EA should be folded into a democratic coalition either, but this comment is a massive strawman.&nbsp;</p><p>Being in a coalition does not mean agreeing with the majority of the coalition at every time. There is in fact a huge degree of disagreement within said coalition, as becomes obvious around primary time.</p><p>Nobody was kicked out of the democratic party for being concerned about covid-19. At worst, there was mild social pressure within the coalition on the subject, which I hope EA would have been able to resist.&nbsp;</p>", "parentCommentId": "ZmXKjizTEfCNF3oyw", "user": {"username": "titotal"}}, {"_id": "thSNk7gcaDSN4w3JW", "postedAt": "2023-02-17T13:03:20.623Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Guy said:</p>\n<blockquote>\n<p>Almost every \"bad\" thing said here about \"Woke EA\" sounds good to me</p>\n</blockquote>\n<p>So I quoted a particular \"bad\" thing that Hanania brought up, and explain why I thought it was, in fact, bad.</p>\n<p>I'm unclear on who you believe to be strawmanning who.  My best guess is that you believe Hanania to be strawmanning the idea of \"being folded into the Democratic coalition\".  However, that's not much of a strawman -- it's a phrase he invented, and he immediately explains what he meant by it.</p>\n<p>I'm not reassured by your observation that disagreements within the Democratic coalition only tend to be apparent around primary time.</p>\n<p>Nor am I reassured by your \"Nobody was kicked out\" observation -- being kicked out is often the result of ignoring accumulated \"mild social pressure\".</p>\n<p>Again, benefit of hindsight -- suppose COVID-19 turned out to be a dud, and EA suffers the racism accusation without any corresponding vindication.  How many dud pandemics before enough \"mild social pressure\" has accumulated that we are <em>de facto</em> no longer part of the coalition?  My suspicion is less than ten -- we'd get an image as \"those racists who are always warning about pandemics from other countries\".  So if EAs were significantly motivated by staying in the coalition, I think we could easily end up paying too little attention to pandemics.</p>\n<p>I certainly hope EA would've been able to resist such social pressure if we were part of the coalition.  But pro-woke EAs make me nervous, because they aren't providing a blueprint for when and how such social pressure should be resisted -- and I observe that social pressure has a tendency to create self-reinforcing spirals.</p>\n<p>According to my model, being part of a political coalition means giving something up.  I think anyone who wants EA to join a political coalition should explain what, specifically, EA should give up relative to a pure focus on doing the most good, and why this is a worthwhile sacrifice.  I found your comment a bit frustrating because you seem to imply that joining a coalition is cost-free, and I don't think that's true.</p>\n", "parentCommentId": "snMzPBhS2iESdnxDw", "user": {"username": "Aptdell"}}, {"_id": "qksuJgeqmzfB2AryN", "postedAt": "2023-02-17T13:27:31.734Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<blockquote><p>I'm not reassured by your observation that disagreements within the Democratic coalition only tend to be apparent around primary time.</p></blockquote><p>Okay, now you're strawmanning <i>me</i>. Disagreements within the democratic coalition are continuous, they are simply most fervent and visible during primary season when the impacts are greatest.&nbsp;</p><p>If you're in the democratic coalition, being called racist on a flimsy basis by people on twitter is actually fairly inevitable. I can't think of a single politician or faction this hasn't happened to. And yet somehow, they keep on trucking.&nbsp;</p><p>The actual response to warning about the pandemic would be a handful of twitter weirdos calling you racist, most people going \"that seems unreasonable\", and everyone continuing on with their lives. this is mainly because warning about pandemics <i>isn't actually racist</i>.&nbsp;</p><p>I still don't think being in the coalition is a good idea, but the portrayal here makes it seem like being loosely affiliated with a political movement makes you a dogmatic zombie.&nbsp;</p>", "parentCommentId": "thSNk7gcaDSN4w3JW", "user": {"username": "titotal"}}, {"_id": "7xXTRpZTZcczMsqJb", "postedAt": "2023-02-17T14:29:02.912Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>\"Eugenics or 'human biodiversity' isn't a new idea and is incredibly toxic to most people.\"</p><p>&gt;right, calling an idea \"toxic\" is literally the same thing as calling it \"taboo.\" &nbsp;Hanania argues rationalism is the belief that \"fewer topics...should be considered taboo...and not subject to cost-benefit anaysis.\"</p><p>It sounds like your argument isn't explicitly saying that you consider this topic off limits personally, but rather too many others view it as &nbsp;taboo so as a practical matter you will lose more people than you'll gain (or lose the right people, gain the wrong people).</p><p>This sounds like a cop-out to me. &nbsp;Do you feel these ideas, in and of themselves, &nbsp;are too \"toxic\" to justify a cost benefit-analysis or is your argument simply that the ideas are currently too unpopular to consider for practical reasons?</p>", "parentCommentId": "wLosHpNnPRqBsnmaA", "user": {"username": "Jgray"}}, {"_id": "acMNn9Pz2e3WTo5AY", "postedAt": "2023-02-17T18:44:44.194Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Strongly downvoted.</p><p>This doesn't appear to be a good faith response. &nbsp;It doesn't address any of the ideas presented, just takes issue with OP \"selectively quoting\" &nbsp;and being Anon, which based on your contemptuous and dismissive response seems totally understandable to me .</p><p>You would, could, and should have done better with an honest response of an upvote and a comment, \"yep, these ideas are way too taboo for us to touch.\" &nbsp;</p>", "parentCommentId": "tN9cjYKkbKiRngGS7", "user": {"username": "Jgray"}}, {"_id": "4QWAnuGzMfFr7ayJi", "postedAt": "2023-02-17T19:10:32.001Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Considering an EA group leader said that they would permanently ban anyone who brought up some of these topics, I am content in my choice of anonymity.</p>\n", "parentCommentId": "tN9cjYKkbKiRngGS7", "user": {"username": "Anon Rationalist"}}, {"_id": "AC5A2TgaifimqqxJa", "postedAt": "2023-02-17T19:27:19.130Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>I think you have misread and misused the quote. It does not suggest following HBD to its \"logical destination\" (which in my mind evokes things like genocide and forced sterilization), it suggests that if EA were to accept different biological bases for observed phenomena, such as men disproportionately occupying positions of leadership, EA would then naturally progress to the idea that other observed phenomena (Asian and Jewish overrepresentation in cognitively demanding fields, for example) could be reflections of biological reality.</p><p>I think Jgray's comment addresses my other notion that your position on a topic being too toxic to even discuss in good faith perfectly fits Hanania's framework of the taboo.</p>", "parentCommentId": "wLosHpNnPRqBsnmaA", "user": {"username": "Anon Rationalist"}}, {"_id": "EkqyF49pRjvFEJd97", "postedAt": "2023-02-17T22:17:17.599Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>I'll only answer with a small point: I'm from a different country, and we don't have a \"Democratic coalition\", neither do we have racism against Chinese people because there are barely any Chinese people here (hence, we didn't have this pressure against making a big deal of COVID). I don't see EA through an American perspective, and mostly ignore phrases like that.</p>\n<p>Still, generally speaking, I would side with US democrats on many things, and am sure the mild disagreements needed wouldn't be an actual problem. Progressivism is perceived by conservatives as something that creates extreme homogeneity of thought, but that doesn't really seem the case to me.</p>\n", "parentCommentId": "ZmXKjizTEfCNF3oyw", "user": {"username": "Guy Raveh"}}, {"_id": "hDckxhcAt5sm462ft", "postedAt": "2023-02-17T22:23:17.893Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<ol>\n<li>\n<p>Ideas that you talk about don't stand on their own. They exist within a historical and social context. You can't look at the idea without also considering how it affects people. I imagine Matthew personally finds the idea toxic too, as do I - but that's not really the point.</p>\n</li>\n<li>\n<p>Perhaps Rationalism really argues that fewer ideas should be taboo, or perhaps that's just Hanania's version of it. But EA isn't synonymous with Rationalism, and you don't need to adopt one (certainly not completely) to accept the other.</p>\n</li>\n</ol>\n", "parentCommentId": "7xXTRpZTZcczMsqJb", "user": {"username": "Guy Raveh"}}, {"_id": "LztTmaKApRYYaiCqi", "postedAt": "2023-02-18T01:51:39.498Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<blockquote>\n<p>Progressivism is perceived by conservatives as something that creates extreme homogeneity of thought, but that doesn't really seem the case to me.</p>\n</blockquote>\n<p>You say you happen to already agree on most things, perhaps you therefore wouldn't experience much pressure.</p>\n<p><a href=\"https://web.archive.org/web/20220407033207/https://www.canceledpeople.com/cancelations\">https://web.archive.org/web/20220407033207/https://www.canceledpeople.com/cancelations</a></p>\n", "parentCommentId": "EkqyF49pRjvFEJd97", "user": {"username": "Aptdell"}}, {"_id": "oQtAi4FkjjuGRfiK9", "postedAt": "2023-02-18T02:10:08.402Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<blockquote>\n<p>If you're in the democratic coalition, being called racist on a flimsy basis by people on twitter is actually fairly inevitable. I can't think of a single politician or faction this hasn't happened to. And yet somehow, they keep on trucking.</p>\n</blockquote>\n<p>Do you think this is an incentive that people don't respond to?</p>\n<blockquote>\n<p>The actual response to warning about the pandemic would be a handful of twitter weirdos calling you racist, most people going \"that seems unreasonable\", and everyone continuing on with their lives. this is mainly because warning about pandemics isn't actually racist.</p>\n</blockquote>\n<p>See <a href=\"https://news.google.com/search?q=pandemic%20racist%20before%3A2020-03-01\">this search</a> of pandemic news articles prior to March 2020.  You can see lots of news outlets downplaying the virus in favor of racism concerns.</p>\n<p>I'm curious just how many people reacted to these articles at the time by saying \"that seems unreasonable\".  I don't remember much of anyone publicly reacting that way.  This would be a good test of the degree to which \"being called a racist\" is an <a href=\"https://twitter.com/patio11/status/1625637476160372736\">incentive</a> people respond to, if you can find a number of prominent examples of people saying \"that seems unreasonable\" within the Democratic coalition.</p>\n<p>My model is that if the coronavirus caused just as much damage, but in some complicated semi-hidden way that wasn't directly attributable to a pandemic, people would still be just as focused on the racism aspect of coronavirus discussion.</p>\n<blockquote>\n<p>I still don't think being in the coalition is a good idea, but the portrayal here makes it seem like being loosely affiliated with a political movement makes you a dogmatic zombie.</p>\n</blockquote>\n<p>As far as I can tell, Peter Thiel went from being an interesting and intelligent person I had a ton of respect for (he donated lots to MIRI and gave a couple of <a href=\"https://www.youtube.com/watch?v=h8KkXcBwHec\">EA summit keynotes</a>) to a dogmatic zombie, primarily due to loose affiliation with a couple of political movements (neoreaction and the Republican party).</p>\n<p>If someone who's famously contrarian and independently wealthy can't resist the pull of polarization, I'm not betting on anybody.</p>\n<p>Edit: Here's something <a href=\"https://betonit.substack.com/p/leave-anger-behind\">from Bryan Caplan</a></p>\n<blockquote>\n<p>Who fears the left? Strangely, the main answer seems to be: leftists. I talk to a wide range of people in academia about left-wing anger and the fear it sustains. As you’d expect, the people who are most outraged by the climate of fear are non-leftists. But the people who personally experience the most fear are leftists themselves. In my private conversations, some of the most boring milquetoast technocratic leftist scholars have grimly foretold that somehow, someday, a mob of their own ideological persuasion will come for them.</p>\n</blockquote>\n", "parentCommentId": "qksuJgeqmzfB2AryN", "user": {"username": "Aptdell"}}, {"_id": "C7cg3Awa5wBNdKPmY", "postedAt": "2023-02-18T02:17:57.568Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<blockquote>\n<p>Ideas that you talk about don't stand on their own. They exist within a historical and social context.</p>\n</blockquote>\n<p>See <a href=\"https://en.wikipedia.org/wiki/Genetic_fallacy\">https://en.wikipedia.org/wiki/Genetic_fallacy</a></p>\n<p>As a concrete example, suppose that 100 years ago, a bunch of racist politicians passed a minimum wage law <a href=\"https://www.forbes.com/sites/carriesheffield/2014/04/29/on-the-historically-racist-motivations-behind-minimum-wage/\">in order to price a local ethnic minority out of the labor market</a>.  The minimum wage exists within that historical and social context.  However, if more recent research shows definitively that the minimum wage is now improving employment outcomes for that same ethnic minority, the historical and social context would appear to be irrelevant.</p>\n", "parentCommentId": "hDckxhcAt5sm462ft", "user": {"username": "Aptdell"}}, {"_id": "dcjur4aJesXRAaKYQ", "postedAt": "2023-02-18T03:07:32.228Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<ol><li>&nbsp;So are you saying \"within our current historical and social context\" yeppers, too toxic to consider for cost-benefit analysis? &nbsp;This is a totally acceptable answer -- just means Hanania is right and we can end the convo here.</li><li>So are you saying you disagree with Hanania's conceptualization of rationalism? &nbsp;Are subjections being off-limits to cost-benefit analysis fine with you? Sounds like again the answer is yes.</li></ol>", "parentCommentId": "hDckxhcAt5sm462ft", "user": {"username": "Jgray"}}, {"_id": "XwFaAqiLHnB53HgNK", "postedAt": "2023-02-18T16:46:42.120Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>I didn't understand (1).</p>\n<ol start=\"2\">\n<li>I don't know if his characterization is right or not, I'm not a Rationalist. But of course subjects being taboo because of the harm discussing them does is fine. Why wouldn't it be?</li>\n</ol>\n", "parentCommentId": "dcjur4aJesXRAaKYQ", "user": {"username": "Guy Raveh"}}, {"_id": "riGmhRXR8LmyjfpHh", "postedAt": "2023-02-18T20:01:08.727Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Why would it not be fine for topics to be off limit for discussion?</p><p>The first principle of EA discusses the need for a \"'scout mindset' - seeking the truth, rather than to defend our current ideas.\"</p><p>You may be aware that at one point the idea the earth revolves around the Sun was taboo. &nbsp;</p><p>What is taboo varies widely over time and by culture. Even the idea that having an open honest discussion about anything could ever be construed as \"causing harm\" (beside from being a terrible one imo) is a very new concept and one that would have been universally dismissed maybe even 15 years ago.</p><p>At any rate, it sounds like you are fine with topics being absolutely off limits to discuss. &nbsp;This is a bit of a surprising admission to me considering the core principles of EA but you are, apparently, certainly not alone in this belief.</p>", "parentCommentId": "XwFaAqiLHnB53HgNK", "user": {"username": "Jgray"}}, {"_id": "C8jczkE2tiDFKghqs", "postedAt": "2023-02-18T20:07:01.372Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Traditionally, thought leaders in EA have been careful not to define any \"core principles\" besides the basic idea of \"we want to find out using evidence and reason how to do as much good as possible, and to apply that knowledge in practice\". While it's true that various perceptions and beliefs have creeped in over the years, none of them is sacred.</p>\n<p>In any case, as far as I understand the \"scout mindset\" (which I admit isn't much), it doesn't rule out recognising areas which would be better left alone (for real, practical reasons - not because the church said so).</p>\n", "parentCommentId": "riGmhRXR8LmyjfpHh", "user": {"username": "Guy Raveh"}}, {"_id": "aPw8zFkjdHwQKRqmt", "postedAt": "2023-02-18T20:30:48.715Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>To me, \"better left alone\" and \"sacred\" are two sides of the same coin. &nbsp;</p>", "parentCommentId": "C8jczkE2tiDFKghqs", "user": {"username": "Jgray"}}, {"_id": "GRnmMEuwccG47G8f6", "postedAt": "2023-02-18T22:51:46.763Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>Anon Rationalist - thanks for posting some excerpts from this Richard Hanania piece. &nbsp;I would encourage EAs to read the entire original piece for full context.</p><p>I'll just add two comments for now:</p><p>First, Hanania is writing as a trollish edgelord. He uses crude, sweeping generalizations, deliberately provocative language, and emotionally inflammatory criticisms of wokeness. Brace yourselves for that. He's not using the usual rhetorical style and rationalist epistemics of EA Forum posts. He's writing to get your attention, and you probably won't like at least half of what he says.</p><p>Second, despite all that, I agree with Hanania that wokeness is an existential threat to EA, to utilitarianism, and to rationalism, and we should take the threat more seriously. &nbsp;</p><p>I've noticed a tendency in EA to show exactly the kind of gutless, cringing, defensive deference to woke critiques of EA that Hanania talks about. Whenever a critic of EA (whether inside or outside the movement) uses woke argument styles, deploys woke terms, and invokes woke values (e.g. 'diversity, equity, inclusion'), most EAs seem too frightened to challenge them, for fear of suffering the usual fate of the anti-woke: dogpiling, brigading, ostracism, and cancellation.&nbsp;</p><p>If we don't develop robust defenses against wokeness, we will suffer the same fate as every other organization that values emotional victimization rhetoric over scope-sensitive rationality.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "scywMrqopgGXR2CCG", "postedAt": "2023-02-18T23:16:28.101Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>How can we “find out using evidence and reason how to do as much good as possible, and to apply that knowledge in practice\" if some avenues to well-being are forbidden? The idea that no potential area is off limits is inherent in the mission. We must be open to doing whatever does the most good possible regardless of how it interacts with our pre-existing biases or taboos.</p>\n", "parentCommentId": "C8jczkE2tiDFKghqs", "user": {"username": "Anon Rationalist"}}, {"_id": "HtPgoqrDnQCmuu8zC", "postedAt": "2023-02-19T03:07:47.150Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>&nbsp;100%</p><p>This would not have been a remotely controversial statement in a community like this 20 years ago.</p><p>The fact that this was downvoted several times without any counter argument is a pretty clear signal that we've reached the end of rational discussion here.</p>", "parentCommentId": "scywMrqopgGXR2CCG", "user": {"username": "Jgray"}}, {"_id": "XLpNCzK6EHRMwGXZt", "postedAt": "2023-03-16T17:44:02.174Z", "postId": "bBJmZp3oQhF6PDQjw", "htmlBody": "<p>How do you define \"wokeness\"? The term is often used very broadly as a placeholder for vaguely culturally left things the writer dislikes, broad enough that anyone in the audience can feel like its referring to specifically the things they dislike. And there's often a degree of strategic ambiguity/motte and bailey in how its used.&nbsp;</p>", "parentCommentId": null, "user": {"username": "projectionconfusion"}}]