[{"_id": "k2zPmD2ixAHxKMJwF", "postedAt": "2021-12-02T19:25:09.125Z", "postId": "BbKSHJbZpgsCeE4pN", "htmlBody": "<p>I don't think Scott would endorse this post today. His attitude now is that most people should commit to donate at least 10%, and then feel okay about doing whatever they like with the rest of their income.</p>", "parentCommentId": null, "user": {"username": "tjohnson314"}}, {"_id": "7Q52Z3NjNshaKCK5C", "postedAt": "2021-12-02T19:30:01.496Z", "postId": "BbKSHJbZpgsCeE4pN", "htmlBody": "<p>This post does not advocate fanatical altruism. It's to show how we don't think in terms of opportunity costs by default, and to show that something is going wrong with our reasoning if our attitudes depend on how salient those opportunity costs are.</p>\n", "parentCommentId": "k2zPmD2ixAHxKMJwF", "user": {"username": "zsp"}}, {"_id": "iX6gfnM6q2NMPxQ7J", "postedAt": "2021-12-07T17:00:00.804Z", "postId": "BbKSHJbZpgsCeE4pN", "htmlBody": "<p>This is my favorite post for making the opportunity costs of our spending feel real and urgent.</p>\n<p>The most compelling empirical observations have some kind of normative implications. For example, Peter Singer observed that almost everyone strongly believes that we are obligated to save a child drowning nearby, even if it requires some personal sacrifice. Combined with the basic normative principle that distance doesn't matter morally, that observation tells us that something is wrong with our moral instincts. This post presents another such empirical fact: our attitudes and choices depend greatly on the salience of opportunity costs. Combined with the principle that such salience shouldn't matter morally,  we can deduce that something is wrong with our moral instincts.</p>\n<p>If you appreciate this post, you should also read Scott Alexander's  <a href=\"https://www.lesswrong.com/posts/pC47ZTsPNAkjavkXs/efficient-charity-do-unto-others\">Efficient Charity</a> and maybe <a href=\"https://slatestarcodex.com/2013/05/17/newtonian-ethics/\">Newtonian Ethics</a>.</p>\n", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "hmruT3bP9JacPMFdT", "postedAt": "2022-04-15T21:25:57.839Z", "postId": "BbKSHJbZpgsCeE4pN", "htmlBody": "<p>I assume you intend this in the direction of \"opportunity costs aren't sufficiently salient, so we don't take them into account as much as we should\". Which seems true. But I also think part of the difference is that <i>super-duper salient &nbsp;</i>opportunity costs make normal spending feel pathologically unacceptable, particularly to altruistically-minded folks.</p><p>I agree with above that Scott <a href=\"https://slatestarcodex.com/2014/12/19/nobody-is-perfect-everything-is-commensurable/\">seems to favor</a> framings of limited altruism, after which you can spend your money on whatever frivolous things you feel like.</p>", "parentCommentId": "7Q52Z3NjNshaKCK5C", "user": {"username": "Bryce Woodworth"}}]