[{"_id": "GfS5D79Dc3ui3bbij", "postedAt": "2022-12-29T11:34:43.756Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I love this.</p><p>I feel like <i>do good better.</i> on a t-shirt gives off 'holier than thou' vibes. Especially with that period. It's easy to read it as 'better than other people' rather than 'better than me in the past'.</p>", "parentCommentId": null, "user": {"username": "David Mears"}}, {"_id": "N9AczzNBpR7CBniKH", "postedAt": "2022-12-29T13:18:55.271Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>This is great! I wanted to buy a few laptop stickers but shipping was €46 to Ontario. Hopefully NA shipping prices eventually come down somehow.</p>\n", "parentCommentId": null, "user": {"username": "Dan Valentine"}}, {"_id": "DnKvWHbLyZYkJxueH", "postedAt": "2022-12-29T13:46:07.560Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Try again now!</p>", "parentCommentId": "N9AczzNBpR7CBniKH", "user": {"username": "Ines"}}, {"_id": "JCGwweALfQQcswJKv", "postedAt": "2022-12-29T13:56:06.032Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Hm, this may be right. We will change it if this comment gets enough upvotes. Also, if you had the same issue as Dan (shipping was too expensive), try again now!</p>", "parentCommentId": "GfS5D79Dc3ui3bbij", "user": {"username": "Ines"}}, {"_id": "qeSdePQYxK5W9tAaM", "postedAt": "2022-12-29T14:02:28.192Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>You might also be interested in the <a href=\"https://www.zazzle.com/store/givingwhatwecan\">Giving What We Can merch store</a></p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "XPeB8noNyagHEBTmS", "postedAt": "2022-12-29T14:18:32.810Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Much better now, thanks!</p>\n", "parentCommentId": "DnKvWHbLyZYkJxueH", "user": {"username": "Dan Valentine"}}, {"_id": "AjuDgHgP5XGNMjhSL", "postedAt": "2022-12-29T14:38:06.094Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<blockquote><p>All products are priced at 0% markup</p></blockquote><p>It seems likely that a nonzero markup makes it likelier that this project continues existing for longer. I'd encourage you people to increase it.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "At9MHkEEHFfPkFXKH", "postedAt": "2022-12-29T14:54:26.425Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>The reason we are not charging a markup is because it could lead to tax-related complications, but this may change in the future.</p>\n", "parentCommentId": "AjuDgHgP5XGNMjhSL", "user": {"username": "Ines"}}, {"_id": "aTDHTWJXn6RdrJavR", "postedAt": "2022-12-29T16:43:45.785Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<blockquote><p>... we are operating on a one-time independent grant for the time being. We will seek long-term funding in the future contingent on demand.</p></blockquote><p>This project seems like a plausible fit for being a for-profit company, which could be good as it would help ensure you make products that people really value. The argument against this would be that the merch has positive externalities through branding so warrants a subsidy, but in practice I think the 'avoid waste by subjecting projects to the market test' argument is stronger. My impression (though maybe I am wrong) is that selling merch is a profit center for a lot of organisations, online content creators, etc.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "6DqPoWPrwtxWTwGKN", "postedAt": "2022-12-29T16:50:12.187Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>In addition to positive externalities from merch, another important reason not to be for-profit is that that causes higher prices. Raising prices increases deadweight loss and transfers money from EAs to the company.</p>", "parentCommentId": "aTDHTWJXn6RdrJavR", "user": {"username": "zsp"}}, {"_id": "w3gbuWajm4RiXogMQ", "postedAt": "2022-12-29T18:44:44.816Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>The Pascal's Mug is so clever. The shrimp sticker and \"moral consideration for all sticker\" are great too. That plus an EA sticker sheet is what I'm buying! I look forward to more designs.</p>\n<p>My only nitpick is I had trouble keeping the price in USD. They kept switching back to EUR for me.</p>\n<p>I also second Nuno's call for some markup, maybe on the basis of half to support the continued existence of the store and half to be donated to GiveWell or something? I definitely found myself willing to pay more than the prices I did pay.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "w72zmS3DHTKAR7oku", "postedAt": "2022-12-29T19:17:22.320Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I would prefer markups not to be justified on the basis of GiveWell donations. That increases deadweight loss, not to mention likely resulting in worse allocation of donations than the counterfactual.</p>", "parentCommentId": "w3gbuWajm4RiXogMQ", "user": {"username": "zsp"}}, {"_id": "2QL6qHDphvKkk6kmj", "postedAt": "2022-12-29T19:22:35.282Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>This is great! I agree with other commenters who say it would be reasonable in the longer-term to think about charging enough of a markup that the project is fully self-sustaining (including salary costs). But I'm thrilled this exists now!</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "Kcv3eueo4CtkqLCLD", "postedAt": "2022-12-29T20:01:30.635Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Thanks!</p><p>Yeah, we are aware of this bug and unfortunately don't know how to fix it yet, but hopefully we'll solve it in the next few days</p>", "parentCommentId": "w3gbuWajm4RiXogMQ", "user": {"username": "Ines"}}, {"_id": "2ogrgdSDPrTkbejaa", "postedAt": "2022-12-29T21:15:40.048Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Yeah this seems plausible to me, but it also just feels weird not having EA merch raise money for EA charity. Maybe just keep this amount very small / trivial / symbolic?</p>\n", "parentCommentId": "w72zmS3DHTKAR7oku", "user": {"username": "Peter_Hurford"}}, {"_id": "jk4HENjAgsmvKfbPK", "postedAt": "2022-12-30T00:55:51.941Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Yeah, this seems like the kind of project that might need a grant for getting off the ground, but should then be self-supporting after that.</p>\n", "parentCommentId": "aTDHTWJXn6RdrJavR", "user": {"username": "casebash"}}, {"_id": "GDA3BKHEGzcoKYted", "postedAt": "2022-12-30T01:18:19.527Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<blockquote>\n<p>Merch helps EAs express themselves and fosters a sense of community. It can also help EAs recognize each other within the same setting or act as a conversation-starter at a function. But most importantly, it’s fun!</p>\n</blockquote>\n<p>How confident are you that encouraging members of the EA community to wear EA merch is a good idea?</p>\n<p>I've not thought about this much but my inside view is somewhat against EA merch.</p>\n<p>Some ways that merch might backfire:</p>\n<ol>\n<li>\n<p>Merch may encourage some individuals towards excessive identification with EA as a body of ideas or as a community.</p>\n</li>\n<li>\n<p>The merch, or the people who wear the merch, may come across as low status, off-putting or otherwise unattractive.</p>\n</li>\n<li>\n<p>Merch may contribute to unhelpful perceptions of EA (e.g. as a youth movement).</p>\n</li>\n<li>\n<p>People may unwittingly wear merch in contexts where it undermines their goals (e.g. damages their credibility).</p>\n</li>\n<li>\n<p>SBF might wear your merch.</p>\n</li>\n</ol>\n<p><img src=\"https://res.cloudinary.com/cea/image/upload/v1672363503/mirroredImages/GDA3BKHEGzcoKYted/afjrvjdusn1ijjqjphgc.jpg\" alt=\"https://pbs.twimg.com/media/FlME0pyX0AAmAf7?format=jpg&amp;name=large\"></p>\n<p>Personally, I have a strong aversion to the idea of people wearing EA merch (I'm somewhat negative for startup merch and somewhat positive about band merch).  I'm not sure where this comes from and how much to weigh it.</p>\n<p>I've briefly discussed this with 5-10 people over the years. On a personal level, several shared my strong aversion to EA merch, while several others were neutral or strongly positive. I don't recall anyone having a confident overall view about whether merch should be encouraged.</p>\n<p>I'd be interested to hear your thoughts on this, and especially your own steelman of the case that merch is, in fact, best discouraged.</p>\n<p>If I thought about this more I guess that I'd end up moderately opposed to merch that uses the EA logo but neutral and relaxed about merch that is more oblique. Several of the items on your store are in the latter category and seem nicely done to me.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "BTG2kkqtLdsR4TS9q", "postedAt": "2022-12-30T01:40:05.804Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Anecdotally, in November I noticed that \"being someone who regularly wears EA t-shirts\" was somewhat predictive of \"being very upset by the FTX blow up\". Obviously the merch won't be causing the upset, but the decision to wear merch may be part of a pattern of relating that leaves some people in a less than ideal position.</p>\n", "parentCommentId": "GDA3BKHEGzcoKYted", "user": {"username": "Peter_Hartree"}}, {"_id": "J9D3xATtopxNgGGhe", "postedAt": "2022-12-30T07:12:12.455Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>\"... the people who wear the merch, may appear low status, off-putting or otherwise unattractive.\" seems like an extremely pointless and bad thing to consider.</p>\n", "parentCommentId": "GDA3BKHEGzcoKYted", "user": {"username": "tugbazsen"}}, {"_id": "SbQ8BDZbm2SuLNzSA", "postedAt": "2022-12-30T07:54:25.994Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Can you say why?</p>\n<p>I've just edited my comment to replace \"appear\" with \"come across as\" because maybe the original phrasing makes the point sound more focused on physical appearance than I intended.</p>\n", "parentCommentId": "J9D3xATtopxNgGGhe", "user": {"username": "Peter_Hartree"}}, {"_id": "Gp9nSpPKTvhoviZEn", "postedAt": "2022-12-30T08:07:32.794Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>How about <em>better do good</em>;)</p>\n", "parentCommentId": "GfS5D79Dc3ui3bbij", "user": {"username": "Michał Zabłocki"}}, {"_id": "n4YdsWiB8n65mKCJP", "postedAt": "2022-12-30T08:37:23.433Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Appear did make me think that it was at least partially focused on physical appearance. Although I'm not sure that it reads very differently still, since I'm not how else to take it, especially the \"low-status\" part. Arguing to gatekeep who can outwardly associate themselves with a social movement based on how they come across or who seems low-status or off putting feels needlessly exclusionary, particularly because those impressions are highly tied into social, racial, gendered and economic prejudices and, unavoidably, physical appearence.</p>\n<p>I'm not a fan of merch generally and will avoid branded clothing as much a possible, and I don't think selling EA merchandise is a good idea overall, but objecting to it on the grounds of how attractive the person wearing it may be, physically or otherwise,  seems wrong-headed.</p>\n", "parentCommentId": "SbQ8BDZbm2SuLNzSA", "user": {"username": "tugbazsen"}}, {"_id": "uxiDobjKWTsXH2fNe", "postedAt": "2022-12-30T09:06:55.272Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Sorry for critical feedback, but</p><ul><li>Not sure if this is best run as a non-profit on a grant. I think people who want to buy this should preferably pay for it in price of the merch.</li><li>Also, the products are somewhat expensive, compared to manufacturing costs. This is because it's actually for profit, just the profits are with Printful</li><li>The design of the website is quite bad, in my opinion. Have you considered hiring a professional?</li><li>Also the designs of majority products which try to do something more complicated than just print the logo on something is ...mediocre at best</li></ul><p>Overall I think from a brand perspective, your shop currently communicates something like 'we are a youth movement where people identify with the brand and &nbsp;this is more important for them than other consideration, like &nbsp;taste or design' ... and is a step back in EA visual culture.</p>", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "XCxCesZxLHae28kGp", "postedAt": "2022-12-30T12:56:09.568Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<blockquote><p>The design of the website is quite bad</p></blockquote><p>Why do you consider it bad? Nothing jumps out to me that makes me think \"this is bad/ugly\". Your other points make more sense to me though.</p>", "parentCommentId": "uxiDobjKWTsXH2fNe", "user": {"username": "Writer"}}, {"_id": "FPyqvdyxBioKGmctn", "postedAt": "2022-12-30T14:06:57.255Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Pascal's Mug(ging) and the Scout Mindset Hat are absolutely incredible. Excited to see more designs!</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "kiTwxyJfWANFobhma", "postedAt": "2022-12-30T14:57:57.187Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I also think the website design seems a bit off to me</p>", "parentCommentId": "uxiDobjKWTsXH2fNe", "user": {"username": "james_aung"}}, {"_id": "aXS6AdbjFxo6Ljwzw", "postedAt": "2022-12-30T15:01:15.494Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I thought the team behind the EAGx designs were really great and I loved them. Have you considered reaching out to them to make designs for your store?</p>", "parentCommentId": null, "user": {"username": "james_aung"}}, {"_id": "ZAs9p9qzH9Nfcesn9", "postedAt": "2022-12-30T15:26:04.838Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I disagree that the design of the products, or the website, are bad.</p><p>This is just my personal aesthetic opinion, of yours, but so is yours. I think your comment should have been phrased with more humility &amp; awareness that you were just reporting your aesthetic taste. &nbsp;I also object to the statement about this being a \"step back in EA visual culture\", which I think is just mean.</p><p>ETA: Also, I just checked the prices and they are almost all surprisingly cheap, so the second point seems wrong to me.</p>", "parentCommentId": "uxiDobjKWTsXH2fNe", "user": {"username": "willbradshaw"}}, {"_id": "jaqayJuBonJ5K7rjp", "postedAt": "2022-12-30T19:42:17.952Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Cool project! I suggest that the shrimp heart should be a different color, as most shrimp usually are not pink and only turn pink after cooking (although there are some exceptions to this so maybe this is too nitpicky and it's fine?). I am also not sure whether or not a living shrimp typically would have a curled up pose. Alternatively if you'd rather not do a full image redesign, or if there is a concern that people will not realize it is a shrimp if it looks too different from what they're used to seeing, it might help to instead have go vegan! text or something to clarify that it isn't that the sticker bearer likes eating shrimp.</p>\n", "parentCommentId": null, "user": {"username": "ishaan"}}, {"_id": "RBsawaihdjHqPxgJs", "postedAt": "2022-12-30T19:59:16.713Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I thought the same thing when I read it. I got similar vibes from some of the other merch (but “do good better” the strongest).</p>\n<p>I think that “moral consideration for all” reads similarly. Especially since most people reading it will read it out of context.</p>\n<p>Also “maximise impact” a little bit.</p>\n", "parentCommentId": "GfS5D79Dc3ui3bbij", "user": {"username": "Evie Cottrell"}}, {"_id": "Fptguy4bCy938f7BL", "postedAt": "2022-12-30T20:00:42.268Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Maybe imperative sentences will always tend read as preachy. I’m not sure.</p>\n", "parentCommentId": "RBsawaihdjHqPxgJs", "user": {"username": "Evie Cottrell"}}, {"_id": "nBH24xFLaR4ZBkwuZ", "postedAt": "2022-12-31T02:22:17.616Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>One of my first thoughts when reading was 'I hope this is not a grant'. Additional details about grant size and this being for setup may be a fair given further thought, and I cannot properly comment without knowing more details, but given that this was my first reaction says something about potential optics. I am very happy to pay for a markup on t-shirts (if I didn't want the particular t-shirt I would not buy it at cost anyway, and there seems to be a lot of EA stash going around from EAGs etc which can be used to spot EAs) if this enables more money to go to other projects. This seems like an obvious thing that can be monetised if enough people are keen to buy it.</p>\n", "parentCommentId": "aTDHTWJXn6RdrJavR", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "umYod5js9Le2zMCJM", "postedAt": "2022-12-31T11:47:15.106Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>One of the co-founders from Shrimp Welfare Project here :)&nbsp;</p><p>I agree - it was a real priority for us to not have a curled shrimp in our logo (which was tricky!) for this reason. And you're right, most shrimps that are farmed are whiteish or brownish (though there are over 2,000 species of shrimps, and some are very colourful!). Finally, as an alternative to the \"go vegan\" message that could accompany it, you could also explore an \"expanding the moral circle\" message (though as it's been noted previously with the \"do good better\" message, that this could come off as preachy without context).</p><p>I'd be happy to share the shrimp we used in our logo if you wanted to use that instead, though I don't want this to seem like we're pitching Shrimp Welfare Project specifically rather than shrimp welfare in general :)&nbsp;</p>", "parentCommentId": "jaqayJuBonJ5K7rjp", "user": {"username": "AaronBoddy"}}, {"_id": "CPKJThGNT4ZJfH27m", "postedAt": "2022-12-31T16:37:38.584Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>FWIW, I get a bit of a holier-than-thou vibe from the \"do good better\" shirt but don't see a problem with the \"moral consideration for all\" stickers.</p>", "parentCommentId": "RBsawaihdjHqPxgJs", "user": {"username": "MHR"}}, {"_id": "jAEbWu4XD98ydEdGa", "postedAt": "2022-12-31T16:54:38.131Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I appreciated this comment! I was tempted by the sticker but didn't know the facts you raise here (and that Aaron confirms below). I'll probably hold off now until/unless this is changed.</p><p>(That said, I wouldn't buy it with a \"go vegan!\" message added.)</p>", "parentCommentId": "jaqayJuBonJ5K7rjp", "user": {"username": "willbradshaw"}}, {"_id": "ZHaRrd8PSpm9Gnye5", "postedAt": "2023-01-01T14:34:05.360Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Thank you so much for this feedback! Will fix.</p>", "parentCommentId": "jaqayJuBonJ5K7rjp", "user": {"username": "Ines"}}, {"_id": "p58aLbck2mz8ASK9D", "postedAt": "2023-01-01T14:34:46.171Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Possibly in the future!</p>", "parentCommentId": "aXS6AdbjFxo6Ljwzw", "user": {"username": "Ines"}}, {"_id": "EFTkQhK6NPyKRcn96", "postedAt": "2023-01-01T15:18:20.040Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>It's an MVP—we will upgrade to a better website in due time. Hopefully the release of more products will mean there will be more options to suit a greater variety of tastes. If you have any ideas for designs or aesthetic styles that would appeal to you, I encourage you to submit them.</p><p>Unfortunately the products cannot get any cheaper than they are as we cannot operate the store without using a service like Printful, and products may in fact go up in price in the future if we change the funding model.&nbsp;</p>", "parentCommentId": "uxiDobjKWTsXH2fNe", "user": {"username": "Ines"}}, {"_id": "Q87zbjJJaLzBH5p8u", "postedAt": "2023-01-01T16:53:09.624Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Would getting a grant-loan to produce a bunch of copies at once (which would be significantly lower cost than a create on demand service) with pickup at something like EAGs or EAGxs be potentially viable to reduce costs or allow this to operate at current prices without a permanent subsidy?</p>\n<p>ETA: The minimum viable trial for this idea might be stickers -- produce a few hundred at once at half(?) your current cost, set them on a table at a conference (with organizer permission), and post a sign asking people to Zelle/Venmo/whatever an amount somewhat higher than the bulk production cost. I'm not too concerned about a mass sticker heist (or even other merchandise heist), and studies of honor-system payment (eg on mass transit systems) suggest the amount of payment evasion would be acceptable.</p>\n", "parentCommentId": "EFTkQhK6NPyKRcn96", "user": {"username": "Jason"}}, {"_id": "GCe5ehveMZtevzbX6", "postedAt": "2023-01-01T20:02:22.611Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Will look into this</p>\n", "parentCommentId": "Q87zbjJJaLzBH5p8u", "user": {"username": "Ines"}}, {"_id": "LMztTgzofKG7DfBrB", "postedAt": "2023-01-01T21:54:09.458Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I've got a few hundred lightbulb logo on white circle stickers in Germany.\nI've offered them to the shop for free, but they can't stock and ship stuff.\nIf you pay for postage I can send some to anyone.</p>\n", "parentCommentId": null, "user": {"username": "Lukas Zeidler"}}, {"_id": "BNATCeoLZyzreJKjD", "postedAt": "2023-01-02T13:19:55.828Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>A more humility-flavoured slogan, with a dash of self-deprecating humour, could be “it’s quite good”.</p>\n<blockquote>\n<p>Effective Altruism: it’s quite good!</p>\n</blockquote>\n<p>Modulo the difference between American and British English use of ‘quite’: in British English ‘quite’ usually means ‘fairly, moderately’ but in American English it usually is an intensifier akin to ‘very’ (I think). This national difference in interpretations is not unwelcome given British culture is more into self-abnegation and American culture is more into exaggeration!</p>\n", "parentCommentId": "GfS5D79Dc3ui3bbij", "user": {"username": "David Mears"}}, {"_id": "YYu5xjanAqbj3vmwC", "postedAt": "2023-01-04T14:22:26.759Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>nit: when I visit <a href=\"https://www.eamerch.co/shop-1\">https://www.eamerch.co/shop-1</a> it shows prices in euros instead of detecting that I'm visiting from the US and showing dollars.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "RSvfLYZzQgffzsBcD", "postedAt": "2023-01-04T17:27:26.432Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Cool. I made some GWWC merch way back in 2011 on Zazzle. I see some of it is <a href=\"https://www.zazzle.com/store/greg_colbourn\">still there</a> :)</p>", "parentCommentId": "qeSdePQYxK5W9tAaM", "user": {"username": "Greg_Colbourn"}}, {"_id": "WFv7jaddwiB68nGKW", "postedAt": "2023-01-05T07:53:15.114Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>A domain name, a wix store with and a print on demand platform attached to it is something you can set up in a day for less than 50 dollars and in my opinion does not need a grant, unless that grant is 50 dollars. I assume the grant is larger and would support those working on it, but I would have also like that to be for-profit to see if the market demands this. I personally would love to know what the grant size is with a rough breakdown of how it's going to be spent.&nbsp;</p><p>Apart from that I'm not against this. The website needs a bit of work if you ask me (I've been an ecommerce marketeer for 8 years). I'm not a fan of the design and I think there are off the shelve themes on wix that would look a lot better, but I know this is just an MVP and things will improve and it's great you're getting this out there early.&nbsp;</p>", "parentCommentId": "jk4HENjAgsmvKfbPK", "user": {"username": "BOAS"}}, {"_id": "pmztq5Z5pubdufd5Q", "postedAt": "2023-01-08T18:37:12.684Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>This is dope! I've been needing a new backpack and I just ordered one! Love the Moral Consideration for All and the lightbulb galaxy stickers, too!&nbsp;</p>", "parentCommentId": null, "user": {"username": "aaronmayer"}}, {"_id": "KBvEFxGPqGF2s6EKF", "postedAt": "2023-01-09T02:33:26.794Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I wonder if this project could also provide merch for various EA Groups? E.g. a university group could request a design specific to their university. A centralized merch system would be less work overall than having each EA group make its own merch.<br><br>Similar to some of the other comments, I think EA groups should pay for this service.</p>", "parentCommentId": null, "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "RByemzh6p4vdubLp7", "postedAt": "2023-01-14T05:41:28.193Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>I think the store should probably deemphasize merch that focuses on individual thought leaders or their words, such as quotes from Jeremy Bentham. Hero worship, especially of current thought leaders in the EA movement, is not healthy for our community. This is a weakly held view, so I leave it to you guys and the community to think about what kinds of merch promote unhealthy forms of hero worship.</p>", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "9yyyPvPvxgv8FQTWj", "postedAt": "2023-01-14T06:36:25.170Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Hero worship is useful for building institutional loyalty. Dead heroes like Bentham are ideal because they can't abuse their cult status or do anything embarrassing.</p>", "parentCommentId": "RByemzh6p4vdubLp7", "user": {"username": "SantaRedux"}}, {"_id": "jf5FbLJhtYtNik5Tz", "postedAt": "2023-01-14T07:45:41.727Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>Thanks for including this! I really liked the shrimp sticker, and partly I liked it because it simply came across as friendly. I honestly didn't know that live shrimp have different ordinary posture and color compared to cooked shrimp, and that makes the sticker feel a lot less friendly to me!<br><br>I'd ideally like a sticker with what looks like a happy shrimp. &nbsp;A live shrimp in a circle with something like 'expanding the moral circle' feels like almost exactly the vibe I'd love to send out, for what it's worth.<br><br>Separately, I get that making merch/art/anything like this is difficult, so I appreciate the work that has already gone into putting the store together.</p>", "parentCommentId": "umYod5js9Le2zMCJM", "user": {"username": "dan.pandori"}}, {"_id": "xB6HEo6SqhzXmgnFq", "postedAt": "2023-05-28T12:39:56.522Z", "postId": "bBoKBFnBsPvoiHuaT", "htmlBody": "<p>See also: <a href=\"https://www.emilydamstra.com/please-enough-dead-butterflies/\">https://www.emilydamstra.com/please-enough-dead-butterflies/</a></p>", "parentCommentId": "jaqayJuBonJ5K7rjp", "user": {"username": "Rasool"}}]