[{"_id": "MGgi7quFvwwf4wuzP", "postedAt": "2024-03-11T15:44:51.934Z", "postId": "BbzpDsfxu8Gzn3AD4", "htmlBody": "<p><strong>Executive summary:</strong> The author creates 20 prediction markets on Manifold Markets to forecast which new EA cause areas will receive significant funding ($10M+) by 2030, in order to spark conversations and identify promising areas for future work.</p><p><strong>Key points:</strong></p><ol><li>The markets cover potential new EA cause areas across animal welfare, global health, institutional improvements, investing, existential risk, AI, transhumanism, and moral philosophy.</li><li>Funding of $10M+ from EA sources between 2023-2029 is the criteria for a cause area being considered \"mainstream\".</li><li>The author hopes these markets will help create common knowledge around promising cause areas and inspire people to start new projects in likely-to-be-funded areas.</li><li>The $10M threshold is chosen to indicate a cause area has moved beyond exploratory research to serious real-world interventions.</li><li>The author provides examples of cause areas that have already received &gt;$10M from OpenPhil alone in the past decade for comparison.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "qMgopD9M3wm9gqD7a", "postedAt": "2024-03-11T17:32:52.679Z", "postId": "BbzpDsfxu8Gzn3AD4", "htmlBody": "<p>Removed</p>", "parentCommentId": null, "user": {"username": "abrahamrowe"}}, {"_id": "LgDBdvvLQQTokZGcY", "postedAt": "2024-03-12T08:25:15.209Z", "postId": "BbzpDsfxu8Gzn3AD4", "htmlBody": "<p>Yeah, I wondered what threshold to set things at -- $10m is a pretty easy bar for some of these areas, since of course some of my listed cause areas are more niche / fringe than others.  I figure that for the highest-probability markets, where $10m is considered all but certain, maybe I can follow up with a market asking about a $50m or $100m threshold.</p>\n<p>I agree that $10m isn't \"mainstream\" in the sense of joining the pantheon alongside biosecurity, AI safety, farmed animal welfare, etc.  But it would still be a big deal to me if, say, OpenPhil doubled their grantmaking to \"land use\" and split the money equally between YIMBYism and Georgism.  Or if mitigating stable totalitarianism risk got as much support as \"progress studies\"-type stuff.  $10m of grants towards studying grabby aliens or the simulation hypothesis or etc would definitely be surprising!</p>\n", "parentCommentId": "qMgopD9M3wm9gqD7a", "user": {"username": "Jackson Wagner"}}]