[{"_id": "d5HDtX3EqysjHHHr7", "postedAt": "2022-08-28T08:15:37.734Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Thanks for addressing what is, imho, the most important existential risk.</p><p>If &nbsp;you're willing, there are simpler ways to look at nuclear weapons.</p><p>First, there isn't really any credible evidence that either activists or technical experts are capable of removing this threat, at least at the present time. &nbsp; You know, the nuclear weapons threat has not meaningfully changed since the day I was born in 1952. &nbsp; In fact, it's gotten worse, as more countries, and less stable countries, now have access to these weapons.</p><p>Imho, if everyone had your level of technical expertise on this subject it wouldn't really matter because such knowledge is all a big pile of abstractions, and few of us are capable of converting intellectual abstractions in to the emotional experience which is typically needed to fuel sustained effective action. &nbsp; Evidence: &nbsp;the overwhelming majority of people, even the uneducated, already know the necessary simple facts, and it's not made any meaningful difference.</p><p>Imho, there is a \"secret weapon\" which has the potential to change this super sleepy status quo for the better. &nbsp; The next detonation. &nbsp;</p><p>At this point almost nobody alive today was alive at the time of Hiroshima. &nbsp;If they were alive at that time they were probably a toddler, incapable of experiencing the event. &nbsp;A great many people are probably not entirely sure which came first, Hiroshima, or WWI.</p><p>When the next detonation in anger comes, and I'm convinced it will sooner or later, the event will receive wall to wall coverage for months by the media. &nbsp;The media coverage will be like 9/11, except far more intense. &nbsp;For at least months, horrific video will be pumped in to every home with a television, over and over and over again. &nbsp; How many times did we see the twin towers come down? &nbsp;Hundreds?</p><p>Again, there is no credible evidence that technical experts or activists can solve this problem. &nbsp; The people who MIGHT be able to turn the tide are terrorists. &nbsp; Our best hope is probably an event that is large enough to shake public consciousness to the core, and small enough to do the least possible damage.</p><p>What we might learn from nuclear weapons is that human beings typically don't learn things this huge through reason. &nbsp; It's usually pain that is our teacher. &nbsp;</p><p>A constructive question that activists and technical experts might be working on is this. &nbsp; What will be our role once the next detonation comes, and conscious raising is no longer necessary? &nbsp; When the social environment changes from us never being interested in nuclear weapons, to be interested in nothing else, what contribution can effective altruists make at that moment? &nbsp;</p><p>Sorry to say, nothing meaningful is going to happen on nuclear weapons until after the next detonation. &nbsp;At that point, anything can happen, for the much better, and the much worse.</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "bRrcrz7acpBbZ73py", "postedAt": "2022-08-28T20:23:10.126Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>I would strongly disagree that nuclear weapons are any sort of existential risk. &nbsp;There aren't nearly enough to wipe out humanity directly, and haven't ever been, and nuclear winter risk is massively overblown, for reasons I explain in the link I just added to the post.</p><p>\"You know, the nuclear weapons threat has not meaningfully changed since the day I was born in 1952.\"<br><br>This, I would disagree with quite strongly. The nuclear threat has changed several times since then. &nbsp;At that point, arsenals were quite limited. &nbsp;By the late 50s, the US had a huge arsenal, but delivery was by bombers only. &nbsp;The arrival of the ICBM meant that warning times dropped from hours to minutes, which had all sorts of impacts, but the early ICBMs took a while to launch. &nbsp;At about the same time, you see SSBNs, which make it a lot harder to squish the enemy's deterrent. &nbsp;And since the end of the Cold War, you see a massive decrease in arsenals worldwide.</p>", "parentCommentId": null, "user": {"username": "bean"}}, {"_id": "PsAw8JmppSwDpypsx", "postedAt": "2022-08-28T22:47:42.918Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<blockquote><p>I would strongly disagree that nuclear weapons are any sort of existential risk.</p></blockquote><p>&nbsp;</p><p>Ok, I suppose that's a useful semantic clarification. &nbsp;I agree they don't pose an X risk to humanity, but they do pose an X risk to modern civilization.</p><p>Sorry, but the nuclear &nbsp;threat has not meaningfully changed since the day I was born in 1952. &nbsp;It would only take about 50 nukes to destroy America's largest cities, which would collapse the food distribution system, leading to mass starvation, &nbsp;social and political chaos. &nbsp; &nbsp;</p><p>If you have a gun pointed at my head, it doesn't matter how big or small the gun is, how many guns you have, and all of that.</p><p>There's no meaningful difference between the Russians having 50 nukes, 1500 nukes, 5000 nukes, or 5 million nukes. &nbsp;Once they have 50, X risk to America is in play. &nbsp;As example, North Korea will soon have enough nukes to demolish America. &nbsp;They just need to get the long range delivery systems working.</p><p>All these fancy calculations the experts love to make are really meaningless, they're mostly just attempts to position themselves as experts. &nbsp;&nbsp;</p>", "parentCommentId": "bRrcrz7acpBbZ73py", "user": {"username": "Phil Tanny"}}, {"_id": "CH9s2LcA5xa2AeBBS", "postedAt": "2022-08-29T01:58:18.382Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>I agree nuclear winter risk is overblown and I'm glad to see more EAs discussing that. But I think you're also overrating the survivability of SSBNs, especially non-American ones. They are not a One Weird Trick, Just Add Water for unassailable second strike capability, with upkeep/maintenance only being one aspect of that. Geography plays a huge role in how useful they are, with the US deciding to base most of its warheads on SSBNs because they have the most favourable conditions for them (unrestricted access to and naval dominance of two oceans). In contrast, Russia has much less room to play with (mainly some parts of the Arctic ocean) and suitable ports to deploy the subs from, and China's situation is even worse. The seas surrounding it have unfavourable bathymetry (very shallow) and the only paths to open ocean are chokepoints.<sup class=\"footnote-ref\"><a href=\"#fn-Cagh6hdoWJzQxPJDn-1\" id=\"fnref-Cagh6hdoWJzQxPJDn-1\">[1]</a></sup> It's not as hard to detect a submarine as one might think, otherwise noise-quieting measures like pumpjets, reactor cooling design and tiles as you mentioned wouldn't be such a huge deal. Most importantly, the US has a large fleet of advanced attack subs (SSNs) the others lack, which pose an enormous threat to SSBNs. They could pick up a tail without knowing it and be destroyed before they can launch their missiles.<sup class=\"footnote-ref\"><a href=\"#fn-Cagh6hdoWJzQxPJDn-2\" id=\"fnref-Cagh6hdoWJzQxPJDn-2\">[2]</a></sup></p>\n<p>OTOH American SSBNs should be fine at least for the time being as long as they don't do anything stupid like <a href=\"https://www.cbsnews.com/news/russia-warship-us-submarine-encounter-pacific-islands/\">try to sneak up close to another country</a>. But emerging technologies like Magnetic Anomaly Detectors and such will make concealing SSBNs even more difficult and increase reliance on land-based forces in the future.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-Cagh6hdoWJzQxPJDn-1\" class=\"footnote-item\"><p>In fact from what I know about Chinese nuclear strategy, SSBNs aren't expected to play a major role in the nuclear force at least until Taiwan is taken and the first island chain is broken, granting unrestricted access to the Pacific. <a href=\"#fnref-Cagh6hdoWJzQxPJDn-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-Cagh6hdoWJzQxPJDn-2\" class=\"footnote-item\"><p>Which is why the concept of \"bastion operations\" was developed, a sanitized area of water close to the coast where SSBNs can operate relatively safely, supported by friendly air and naval ASW assets to keep hostile SSNs out. Yes China and Russia can do this but it's still suboptimal for many reasons. <a href=\"#fnref-Cagh6hdoWJzQxPJDn-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": "bRrcrz7acpBbZ73py", "user": {"username": "abukeki"}}, {"_id": "5NBm8gTjBzAjpnhax", "postedAt": "2022-09-01T15:21:38.906Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Bean, any chance I can get your thoughts on the recent Xia et al study on nuclear winter? Would be curious what you make of it. It makes nuclear winter sound catastrophic beyond even Sagan scenarios (5 billion dead due to famine etc). Would love an expert’s take.</p>\n", "parentCommentId": null, "user": {"username": "Henry Shevlin"}}, {"_id": "YMHed4rRSdnEcqrix", "postedAt": "2022-09-01T15:22:29.449Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p><a href=\"https://www.nature.com/articles/s43016-022-00573-0\">Link to the study here</a></p>\n", "parentCommentId": "5NBm8gTjBzAjpnhax", "user": {"username": "Henry Shevlin"}}, {"_id": "wzPeAx3JX3mJd8BHs", "postedAt": "2022-09-01T20:04:48.412Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Hey. Thanks for pointing these out and we appreciate your engagement with our work! I'm not the original author, though I did help review and evaluate this research at Rethink Priorities.</p>\n<p>We received feedback from many experts at the time, and didn't run into any issues with people not taking us seriously. I also think the details you mentioned, while important, don't do much to undermine our reports' various bottom-line conclusions. Unfortunately we often lack time to properly vet every detail, but we're very happy to have our errors pointed out and correct our posts.</p>\n<p>Also I do generally think the dynamic you describe can be a concerning one. There is a tricky balance to start between bringing a new perspective to a space you've never worked in before vs. spending a lot of time on deep solicitation from experts. I think that there can be a lot of value from someone outside a field coming in and evaluating something from a new angle, but it comes with all of the downsides you list. Now at Rethink Priorities we encourage our staff more to take time to build expertise, and that we're less pressured to produce fast output, relative to when this post was published.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "9Qzj4NgguAWqAwati", "postedAt": "2022-09-03T12:52:28.073Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>In retrospect, I should have been more clear in my claim on submarine invulnerability, which was mostly meant to apply to the sort of thing you could reliably do during an attempt to preemptively take out a nuclear arsenal. &nbsp;And yes, obviously more to the US than elsewhere. &nbsp;But note that the link you provide is to an SSN, not an SSBN, and MAD is not a new technology. &nbsp;The first deployment of that I'm aware of was to guard the Straits of Gibraltar in WWII, and if anything it's being phased out these days. &nbsp;</p>", "parentCommentId": "CH9s2LcA5xa2AeBBS", "user": {"username": "bean"}}, {"_id": "Cjy9Ad7Y5JpL6bmfJ", "postedAt": "2022-09-03T12:54:44.823Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Robock is second author, Toon is also on the author's list. &nbsp;It's the same people who have been poisoning this particular well for decades, so I'd toss it right there. &nbsp;I have no reason to trust them to actually be doing science, and lots of reason to believe that they're being driven by ideology.</p>", "parentCommentId": "5NBm8gTjBzAjpnhax", "user": {"username": "bean"}}, {"_id": "wivCS3tNTTwxwRBoC", "postedAt": "2022-09-03T13:02:30.359Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>&gt;Sorry, but the nuclear &nbsp;threat has not meaningfully changed since the day I was born in 1952.</p><p>This simply isn't true. &nbsp;Even if we take your claim that it would only take 50 nukes to destroy America's largest cities at face value and that that in turn would be enough to destroy the US, in 1952, the Soviets had only 50 nukes total, and very limited capability to deliver them to targets in US. &nbsp;Most would instead be going to Europe, and a lot of them wouldn't go off because the planes carrying them would be shot down. &nbsp;And this is pre-H-bomb, so you're going to need more than 50 bombs to do the same destruction that you could do with 50 today. &nbsp;(And to be clear, I don't accept that 50 bombs is nearly enough to pose an X-risk to America.) &nbsp;</p><p>&gt;As example, North Korea will soon have enough nukes to demolish America. &nbsp;They just need to get the long range delivery systems working.</p><p>China has cut them off at six missiles, which are aimed at cities where US decision-makers and their families live. &nbsp;</p>", "parentCommentId": "PsAw8JmppSwDpypsx", "user": {"username": "bean"}}, {"_id": "wKq8KtgpxkFFgnTiC", "postedAt": "2022-09-03T16:03:57.860Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Meaning of SSBN according to <a href=\"https://en.wikipedia.org/wiki/Ballistic_missile_submarine\">Wikipedia</a>:</p><blockquote><p>The <a href=\"https://en.wikipedia.org/wiki/United_States_Navy\">United States Navy</a>'s <a href=\"https://en.wikipedia.org/wiki/Hull_classification_symbol#Submarine_type\">hull classification symbols</a> for ballistic missile submarines are <strong>SSB</strong> and <strong>SSBN</strong> – the <i>SS</i> denotes submarine, the <i>B</i> denotes <a href=\"https://en.wikipedia.org/wiki/Ballistic_missile\">ballistic missile</a>, and the <i>N</i> denotes that the submarine is <a href=\"https://en.wikipedia.org/wiki/Nuclear_submarine\">nuclear powered</a>.</p></blockquote>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "ASKLvKzujFygnncvR", "postedAt": "2022-09-20T14:38:54.906Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Just to respond to the nuclear winter point.</p><p>I actually think the EA world has been pretty good epistemically on winter: appropriately humble and exploratory, mostly funding research to work out how big a problem it is, not basing big claims on (possibly) unsettled science. The argument for serious action on reducing nuclear risk doesn't rely on claims about nuclear winter - though nuclear winter would really underline its importance. The Rethink Priorities report you critique talks at length about the debate over winter, which is great. See also 80,000 Hours <a href=\"https://80000hours.org/problem-profiles/nuclear-security/\">profile</a>, which is similarly cautious/hedged<a href=\"https://80000hours.org/problem-profiles/nuclear-security/\">.</a>&nbsp;</p><p>The EA world has been the major recent funder of research on nuclear winter: OpenPhil in <a href=\"https://www.openphilanthropy.org/grants/rutgers-university-nuclear-conflict-climate-modeling/\">2017</a>, <a href=\"https://www.openphilanthropy.org/grants/rutgers-university-nuclear-conflict-climate-modeling-2020/\">2020</a>, perhaps <a href=\"https://forum.effectivealtruism.org/posts/M7wNHbpqnLfDzmDK9/new-nuclear-security-grantmaking-programme-at-longview\">Longview</a>, and soon <a href=\"https://futureoflife.org/nuclear-war-grant-rfp/\">FLI</a>. The research has advanced considerably since 2016. Indeed, most of the research <i>ever published</i> on nuclear winter has been published in the last few years, using the latest climate modelling. The most recent papers are getting published in <a href=\"http://www.nature.com/articles/s43016-022-00573-0\">Nature</a>. I would disagree that theres a \"reliance on papers that have a number of obvious flaws\".</p>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "ZCEsvFHrACuFZ7GMZ", "postedAt": "2022-09-20T14:42:10.170Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Oof this comment was a shame to read - I downvoted it. Ad hominem attack and no discussion of the content of the paper.&nbsp;</p><p>Also, the paper has ten authors and got through <i>Nature</i> peer-review - seems a stretch to write it off as just two people's ideology.</p>", "parentCommentId": "Cjy9Ad7Y5JpL6bmfJ", "user": {"username": "HaydnBelfield"}}, {"_id": "9gKw5cHTekaTiGzxX", "postedAt": "2022-09-20T18:19:47.131Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Appreciate you explaining the downvote. While a more legible argument than \"I don't trust X because of what I perceive to be a long pattern of bad behavior I'm not going to specify much\" would be much more useful, I still find this more useful than not commenting at all, so others have at least a pointer to investigate further themselves.</p><p>I suppose the downside of purely ad hominem arguments is that it often just smears the target for too often unjustified reasons. But for me a charitable interpretation is that the author of the ad hominem wants to be helpful/informative and just doesn't have the time (or maybe legible or non-confidential information) to do more than say they don't trust the person.&nbsp;</p>", "parentCommentId": "ZCEsvFHrACuFZ7GMZ", "user": {"username": "MaxRa"}}, {"_id": "hr2vANuCdFkBHXDZ9", "postedAt": "2022-09-21T04:37:21.936Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>I was perhaps unclear in my original comment. &nbsp;I wrote up a long explanation the many, many errors those two have made in their nuclear winter models at <a href=\"https://www.navalgazing.net/Nuclear-Winter,\">https://www.navalgazing.net/Nuclear-Winter,</a> which I assumed that Henry had read. &nbsp;A quick glance at the paper in question turns up that they're using the very models of soot production I critique. &nbsp;My expertise in agriculture is quite limited, so I can't say anything about how a given amount of soot will affect crop production. &nbsp;I can say that they're relying on a model so terrible that I genuinely don't think a good-faith effort would produce anything that bad. &nbsp;It's pretty hard to explain how the models get worse at exactly the rate that arsenals shrink, so the nuclear war situation stays the same otherwise. &nbsp;The stuff in the 80s was probably exaggerated somewhat, but it's clear nonsense with arsenals an order of magnitude smaller today.</p>", "parentCommentId": "ZCEsvFHrACuFZ7GMZ", "user": {"username": "bean"}}, {"_id": "mdES2Lu5KATmsNi34", "postedAt": "2022-09-21T04:46:31.977Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>Wait. &nbsp;OpenPhil gave money to Toon and Robock? &nbsp;Wow. &nbsp;If I'd know that, I would have written a very sharp criticism of that particular decision. &nbsp;</p><p>&gt;Indeed, most of the research <i>ever published</i> on nuclear winter has been published in the last few years, using the latest climate modelling.</p><p>The problem isn't climate modeling. &nbsp;The problem is that one of the inputs to the model is wrong by, conservatively, a factor of 50.&nbsp;</p><p>&gt;The most recent papers are getting published in <a href=\"http://www.nature.com/articles/s43016-022-00573-0\">Nature</a>. I would disagree that theres a \"reliance on papers that have a number of obvious flaws\".</p><p>Peer review is a useful process, but not perfect, hence the existence of the replication crisis. &nbsp;In this case, there's a couple of papers that keep popping up in more recent literature as the source for soot estimates that are extremely bad. &nbsp;But a typical peer reviewer for nature would have no reason to critique those papers, and doesn't have the expertise to realize how bonkers some of the assumptions in them are.</p>", "parentCommentId": "ASKLvKzujFygnncvR", "user": {"username": "bean"}}, {"_id": "HtxSeazZQ9oX5Fk3p", "postedAt": "2022-09-21T04:50:26.854Z", "postId": "bCB88GKeXTaxozr6y", "htmlBody": "<p>I think my point should have been phrased less as \"people will definitely not take you seriously\" and more as \"people might not take you seriously\". &nbsp;If I was looking for a reason to toss something, the sort of errors here would provide excellent ammo.&nbsp;</p><p>More broadly, I'm glad that you guys are trying to address this. &nbsp;I do think that defense is particularly tricky, for reasons I'm still trying to write up, but I also don't have the expertise to critique other areas.</p>", "parentCommentId": "wzPeAx3JX3mJd8BHs", "user": {"username": "bean"}}]