[{"_id": "m2CKzGXjuvcELzxDy", "postedAt": "2023-03-21T21:32:51.487Z", "postId": "BcbmKitFms6NbTMKt", "htmlBody": "<p>Hey James, thanks for posting this! I really liked your steelman of \"Complexity-inclined James\". I think EAs should always be considering other perspectives, and being able to understand where others come from is incredibly important - especially critics, and especially those where both sides can be made better off through good-faith dialogues, even if we still disagree.</p><p>I get that this is the very tip of the iceberg, but I've got a few points that I'd like to hear your thoughts on:</p><ul><li>In practice, those on the side of CIJ are usually a lot less epistemically humble and more vitriolic than he is. Not all of them, of course, but many of them aren't calling for a 'portfolio approach' at all, but <i>their </i>approach. Cluelessness cuts both ways! And many activist critics of EA don't seem to apply cluelessness concerns to their own theories of change.</li><li>I don't quite think \"looking under the streetlight\" is a fair characterisation of the problem. I think it's more like a Multi-Armed Bandit approach, where AMF is the top-scoring bandit<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefx5w4uwdyehh\"><sup><a href=\"#fnx5w4uwdyehh\">[1]</a></sup></span>&nbsp;and it does pretty well, and options CIJ is looking at moving towards ('protest', 'building class consciousness', 'put the whole system on trial') look quite dubious in comparison. <strong>Tl;dr:</strong> Saving someone's life from malaria is not a 'narrow metric' imo</li><li>Finally, I think you underestimate the extent to which a significant part of the community would actually be in favour of various kinds of systemic changes and interventions! My intuition is that people are very uncertain about what to propose here, cautious about backfiring effects from them, and in general may lack the experience and skills to make significant progress on them at the moment.</li></ul><p>In any case, I liked the post, and look forward to seeing more posts from you along these lines :)</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnx5w4uwdyehh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefx5w4uwdyehh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Adjusted to your most-effective option accordingly</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "yqWZxCtuPJZcwi4cj", "postedAt": "2023-03-21T23:53:09.624Z", "postId": "BcbmKitFms6NbTMKt", "htmlBody": "<p>Hi James, I just wanted to say that I think this post is great and is a helpful way to understand the different perspectives! I think it's critical for us to be listening to other groups who are also trying to create a better world.&nbsp;</p><p>One idea I have in my mind (that is probably not well thought out at all) is that having a mix of activists and pragmatists might actually be the best solution to create change. In my mind, the activists are the visionaries who paint a picture of how the world could be, and the pragmatists in many cases are slowly making the change happen, across many fronts. Just a stray thought :)</p><p>I really enjoy reading your work and think it makes a valuable contribution!</p>", "parentCommentId": null, "user": {"username": "GraceAdams"}}, {"_id": "sEajHKnbJkux4DHLJ", "postedAt": "2023-03-22T16:44:20.147Z", "postId": "BcbmKitFms6NbTMKt", "htmlBody": "<p>Adding that when I first did EV estimates of successful protest/activist movement that:</p>\n<p>Activism is never really convenient or \"high-EV\". I think the public generally holds contradictory and unrealistic expectations of activism. For one, it's very easy to put off activism as \"not a priority\" because it doesn't lead to obvious career/monetary benefit and always costs time and poses perceived reputation risk. Whenever I hear someone say they care about a cause but don't have time to advocate for it, I just tell them they'll never find a better time. A busy, career-focused 20 year old becomes a busy, career-focused 30 year old becomes and busy, career-focused 40 year old then they forget whatever they cared about. There's a reason EA skews so young, time works against wanting to do meaningful things.</p>\n<p>Activism is almost always either controversial/untractable or unnecessary. For the simple reason that if everyone's already convinced of an idea, you don't really need activism. Progress would, by definition, be crucial on issues that seem controversial or so niche that it seems people will \"never understand\". So when someone tells me that issue [X] is unpopular/controversial/too obscure, I'm like ... yeah, that's the point. Of course the current discourse makes progress seem untractable, that's how all activism starts out and aims too induce beliefs away from. Perhaps more annoying is when activists spend years being harassed and dismissed, then when the Overton Window finally shifts, people just accept the ideas as obvious/default and go back to dismissing the value of activism for the next topical issue, without acknowledging the work done to raise the sanity waterline.</p>\n<p>I think these paradoxes are hard to explain to people, because if one never engages/participates in activism, it's very easy to be cynical and dismiss activism as frivolous/misguided/performative. Which is as true as dismissing EA orgs with \"I read somewhere that nonprofits are just a way for rich people to launder money while claiming admin costs\".</p>\n<p>Sigh, oh well.</p>\n", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "pcRuwLEmgGWjQtera", "postedAt": "2023-03-24T07:24:09.030Z", "postId": "BcbmKitFms6NbTMKt", "htmlBody": "<p>I agree that activism in particular has a lot of idiosyncrasies, even within the broader field of systems change, that make it harder to model or understand but do not invalidate its worth. I think that it is worthwhile to attempt to better understand the realms of activism or systems change in general, and to do so, EA methodology would need to be comfortable engaging in much looser expected value calculations than it normally does. Particularly, I think a separate system from  ITN may be preferable for this context, because \"scope, neglectedness, and tractability\" may be less useful for the purpose of deciding what kind of activism to do than other concepts like \"momentum, potential scope, likely impact of a movement at maximum scope and likely impact at minimum or median scope/success, personal skill/knowledge fit, personal belief alignment\" etc.</p>\n<p>I think it's worth attempting to do these sorts of napkin calculations and invent frameworks for things in the category of \"things that don't usually meet the minimum quantifiability bar for EA\" as a thought exercise to clarify one's beliefs if nothing else, but besides, regardless of whether moderately rigorous investigation endorses the efficacy of various systems change mechanisms or not, it seems straightforwardly good to develop tools that help those interested in systems change to maximize their positive impact. Even if the EA movement itself remained less focused on systems change, I think people in EA are capable of producing accurate and insightful literature/research on the huge and extremely important fields of public policy and social change, and those contributions may be taken up by other groups, hopefully raising the sanity waterline on the meta-decision of which movements to invest time and effort into. After all, there are literally millions of activist groups and systems-change-focused movements out there, and developing tools to make sense out of that primordial muck could aid many people in their search to engage with the most impactful and fulfilling movements possible.</p>\n<p>We may never know whether highly-quantifiable non-systems change interventions or harder-to-quantify systems change interventions are more effective, but it seems possible that to develop an effectiveness methodology for both spheres is better than to restrict one's contributions to one. For example, spreading good ideas in the other sphere may boost the general influence of a group's set of ideals and methodologies, and also provide benefits in the form of cross-pollination from advances in the other sphere. If EA maximizes for peak highly-quantifiable action, ought there to be a subgroup that maximizes for peak implementation of \"everything that doesn't make the typical minimum quantifiability bar for EA\"?</p>\n", "parentCommentId": "sEajHKnbJkux4DHLJ", "user": {"username": "Sam Battis"}}, {"_id": "n5meRXqmzJbEA5JpF", "postedAt": "2023-03-24T17:11:33.654Z", "postId": "BcbmKitFms6NbTMKt", "htmlBody": "<p>Great post, James! I think you described the 2 positions well.</p><p>Some notes:</p><ul><li>I like to distinguish between implicit and explicit quantification (which is a matter of degree, not a binary). Whenever we say an intervention A is better, worse or as good as an intervention B, we are implicitly quantifying the goodness of interventions A and B, even if we do not use any numbers, or do any cost-effectiveness analyses.</li><li>In this sense, it is possible to quantify the effects of any intervention at least explicitly.</li><li>The optimal degree of explicit quantification can vary greatly. For each individual factor which influences the effects of an intervention, I think explicit quantification requires more time, but also leads to better results. So there is a trade-off:<ul><li>Less quantitative methods allow us to cover more factors, but do not cover them as well as more quantitative ones.</li><li>More quantitative methods cover factors better, but cover fewer of them.</li></ul></li><li>I believe it is imporant to have in mind the portfolio approach (or something similar to it) should apply to whole world, not just to the EA community, and definitely not just to each individual. I would say it makes sense for each individual to fully work on / donate to the areas whose marginal cost-effectiveness is higher, because those are the ones whose share in the global porfolio should be increased.</li></ul>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]