[{"_id": "CZLX7iKAyDFc4nqnG", "postedAt": "2023-05-16T15:08:09.509Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>If you're interested in impact, try to find potentially h impact organizations that are in early stages and lack funding and see if there is some secretarial/organizational work that you can volunteer for. Helping organizations at early pre-funding stages with simple tasks can free up a lot of time and doesn't necessarily require you to be brilliant.</p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "SvGw8rMhECCMzFLHb", "postedAt": "2023-05-16T15:11:46.710Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>seems to be too complicated an option, 1) I wouldn't know where to look and 2) probably couldn't help with anything im really useless.</p>\n", "parentCommentId": "CZLX7iKAyDFc4nqnG", "user": {"username": "Anon777"}}, {"_id": "2w67xXKtajJR7h4JJ", "postedAt": "2023-05-16T15:40:05.484Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>I'm going to be annoying and not really answer your question.</p><ol><li>I think you should focus on yourself and your mental health. Go to therapy, build some skills, and ultimately help yourself before you try to help others.</li><li>I firmly believe IQ really does not matter. In my view, different people simply have different strengths and weaknesses. There are aspects of me that made it possible for me to complete a PhD, but those same aspects (and others) made me a poor worker in a traditional work environment. It is critical that you identify the things you <i>like </i>and are <i>good at</i>. Every person has something to offer, you just have to figure out what that thing is. There is a career that makes sense for you.<ol><li>Below you say you are really useless, I can assure you that you are not.</li></ol></li></ol>", "parentCommentId": null, "user": {"username": "Kyle Smith"}}, {"_id": "AbhkPHy69wwb98gRF", "postedAt": "2023-05-16T18:07:49.316Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>Honestly, I know many people that aren't smart but still are dedicated and get things done. I would take a dedicated person who can make things happen over someone who sounds great on paper but isn't the best at getting people to understand what they mean.&nbsp;</p><p>On the more pressing idea, I think that you should look into becoming a junior operations manager: <a href=\"https://80000hours.org/articles/operations-management/\">https://80000hours.org/articles/operations-management/</a> Operations touches all aspects of EA and if you can make someone work more efficiently, then you're on the right path. This would hopefully give you more exposure to other career paths.</p><p>Also don't discount the ability to speak Polish, English, and French. Just having that skillset will help you out a ton. I don't know what the EA community is like in Poland or France, but I'm sure there is someone.</p>", "parentCommentId": "2w67xXKtajJR7h4JJ", "user": {"username": "Weaver"}}, {"_id": "KLrbHJgEkkZY7FXzp", "postedAt": "2023-05-16T19:33:13.572Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>Look at Charity Entrepreneurship's incubated charities</p>", "parentCommentId": "SvGw8rMhECCMzFLHb", "user": {"username": "freedomandutility"}}, {"_id": "CZ6t2MXYYmsW3RA7c", "postedAt": "2023-05-16T19:34:57.967Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>Personal assistant roles?</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "FRKXC3rnmS9BzfpLE", "postedAt": "2023-05-16T20:43:33.141Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>Is there anything you feel drawn to, in life in general, or in work? I would suggest following what you like and are interested in, and don't think about how much it helps or doesn't help other people, at least for as long is it's getting you down. If it helps you, that's a win! And if you want to go to France, go to France :)&nbsp;<br><br>By the way, it's okay to be stupid and useless, but I don't think you even are - you have been given money in exchange for your time and skills at all of those jobs you've done, for example. I'd agree with the therapy/self-help suggestion. Lots of therapists and techniques won't work for you, but keep trying, researching and experimenting because something almost certainly will. Some general advice that may or may not be applicable is to find more uplifting social contact, exercise more, and maybe volunteer for something in order to build skills and feel more useful and connected.</p>", "parentCommentId": null, "user": {"username": "AnnieAB"}}, {"_id": "CzcNFxq2XYyenEEMd", "postedAt": "2023-05-17T11:49:08.412Z", "postId": "bCCG7HTMjCahk4tGX", "htmlBody": "<p>I very much agree with what Kyle said.&nbsp;</p><p>Please consider focusing on improving your mental health as priority, because your wellbeing matters, and you deserve to live a flourishing and joyful life.&nbsp;</p><p>I also agree that IQ is not particularly important in certain jobs, and there is something impactful for everyone if you enjoy it and your heart is in the right place.&nbsp;</p><p>Good luck :)&nbsp;</p>", "parentCommentId": "2w67xXKtajJR7h4JJ", "user": {"username": "Lucas Lewit-Mendes"}}]