[{"_id": "Eafvj5kMzHjKCDcMd", "postedAt": "2024-01-14T20:51:45.046Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>I don't mean to be discouraging, but it would help me greatly if you added some sources to the post and/or added some explanation of how this qualifies as \"probably the current most effective altruism\". In its current form, I find this quite unconvincing. While I do donate blood, I don't think it's a priority over other work, and superficial googling did not convince me that it should be.</p>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "fQEv6ojARemy2FmTG", "postedAt": "2024-01-14T21:07:49.031Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Sources:<br><a href=\"https://www.redcross.org/about-us/news-and-events/press-release/2024/red-cross-declares-emergency-blood-shortage-calls-for-donations-during-national-blood-donor-month.html\">https://www.redcross.org/about-us/news-and-events/press-release/2024/red-cross-declares-emergency-blood-shortage-calls-for-donations-during-national-blood-donor-month.html</a><br><br>Furthermore, I talked to a person who took my blood. Can't provide a source on that, but I am guessing the person who took my blood wouldn't lie just like that.</p>", "parentCommentId": "Eafvj5kMzHjKCDcMd", "user": {"username": "dstudioscode"}}, {"_id": "XBrv27AxwfeNuebLp", "postedAt": "2024-01-15T16:45:45.063Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>This source helps me see that now is a time where blood donations are especially needed, but it does not give me the means of evaluating that it would be more effective than alternative courses of action. Thank you for adding it in comments and post!</p>", "parentCommentId": "fQEv6ojARemy2FmTG", "user": {"username": "mhendric"}}, {"_id": "kFcKXuNFnsNmiDkHu", "postedAt": "2024-01-16T03:36:15.548Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Why wouldn't it be more effective? If there is a shortage, and blood is needed, wouldn't donating once save a life? Apparently, one blood donation can like affect like 3 people. If there is a shortage, lives are being saved. This is much easier - and cheaper - than paying 5000 bucks to Give Directly.</p>", "parentCommentId": "XBrv27AxwfeNuebLp", "user": {"username": "dstudioscode"}}, {"_id": "9uk9xQqdtcEqEdB7J", "postedAt": "2024-01-16T13:25:22.877Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>If one donation would save a life, I would expect the news updates to be different, e.g.<br>\"People are dying left and right from a blood shortage\"<br>and to see a significant spike in mortality in the US.&nbsp;<br>I also would be surprised if such a problem could not be addressed by e.g. US health providers importing blood from other countries, which countries do quite routinely in times of shortages, to my knowledge.<br>I am not aware of any of these.&nbsp;<br><br>Generally, I take it that the burden of proof for effectiveness should lie on the new intervention. If you want people to switch from e.g. supporting AMF to e.g. supporting blood, you should provide compelling evidence. I don't think the above is sufficient as compelling evidence. It lacks crucial information (e.g. how many people are dying from a shortage right now? how much of a shortage is there? what alternative means are being used to avert a shortage? has there even been one death yet directly caused from said shortage? how much does my donating alleviate this shortage? what is the % chance of my donation saving a life that would otherwise be lost due to the shortage?), and rests more on abstract vibe-based back-of-the-envelope calculations, rather than an explicit attempt at establishing the value of blood donations (which, I think, would be a lot of work but also be a valuable thing for the forum!). &nbsp;</p>", "parentCommentId": "kFcKXuNFnsNmiDkHu", "user": {"username": "mhendric"}}, {"_id": "YsFFme5sYSaggX5d5", "postedAt": "2024-01-18T02:29:15.066Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Does that mean there is no value in blood/platelet donation? Does it matter if I do not donate?<br><br>Also, it is said that life-saving surgeries have been postponed due to lack of blood/platelets. I guess it is hard to say if the postponement results in death.</p><p>&nbsp;</p><p>Furthermore, I'm not entirely sure the shelf-life of blood/platelets is even long enough for there to be an importation from another country (ig it depends on the country).&nbsp;<br><br>And also, why do blood donation groups then incentivize blood donation quite excessively, if its not that big of a problem right now?</p>", "parentCommentId": "9uk9xQqdtcEqEdB7J", "user": {"username": "dstudioscode"}}, {"_id": "hGGinn3CeerLXg6E2", "postedAt": "2024-01-18T09:51:00.873Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>\"Does that mean there is no value in blood/platelet donation?\" Of course not, I don't know why you would think that I hold that position. Do donate! I donate myself.<br>&nbsp;</p><p>\"Also, it is said that life-saving surgeries have been postponed due to lack of blood/platelets. I guess it is hard to say if the postponement results in death.\" I did not spot that in the source!<br><br>\"Furthermore, I'm not entirely sure the shelf-life of blood/platelets is even long enough for there to be an importation from another country (ig it depends on the country).\" The US is the biggest importer of blood, with roughly 20% of global imports going to the US. <a href=\"https://trendeconomy.com/data/commodity_h2/3002\">https://trendeconomy.com/data/commodity_h2/3002</a><br><br>Why do blood donation groups incentivize blood donation? I am not as familiar with the US; in Germany it is much cheaper to acquire blood by paying a donor $50 or giving them some food and drink than to buy it elsewhere. The Red Cross in Germany, to my knowledge, gives donors food and drink and then sells the blood to hospitals to make some money for their other charitable ventures.<br><br>Again, I do think it is good to donate blood! You should donate blood. I should donate blood. Others should donate blood.&nbsp;<br>I do not think it is probably the current most effective altruism. &nbsp;<br>&nbsp;</p>", "parentCommentId": "YsFFme5sYSaggX5d5", "user": {"username": "mhendric"}}, {"_id": "DicFJDA9LWszABZJ5", "postedAt": "2024-01-19T07:28:53.307Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Technically the live-saving surgery part was told by the person who drew my blood.<br><br>What's the point of donating blood if I am not saving lives though?</p>", "parentCommentId": "hGGinn3CeerLXg6E2", "user": {"username": "dstudioscode"}}, {"_id": "GmHWbGaz3kqmxhEmJ", "postedAt": "2024-01-19T09:53:05.490Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Whats the point of resuscitating a stranger with an emergency while in your absence, another person may have done it? It is good to help; it may save the strangers life (even if someone else would have saved them in your absence); it builds character etcetc. It also saves money for the hospital!</p>", "parentCommentId": "DicFJDA9LWszABZJ5", "user": {"username": "mhendric"}}, {"_id": "wFr8KLqpKGnF2tg4h", "postedAt": "2024-01-20T19:14:19.007Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Well in this context, you pretty much said its guaranteed that another person would have saved such person's life. I don't really care about \"building character\" and whatnot considering this is about consequentialism, not about displaying virtue. Regarding saving money for hospital, you are saying that donating blood leads to hospitals to not have to use extraneous measures (that are expensive) to get blood, right?</p>", "parentCommentId": "GmHWbGaz3kqmxhEmJ", "user": {"username": "dstudioscode"}}, {"_id": "FrXHCPiJWs5AkPvTe", "postedAt": "2024-01-20T21:23:43.374Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Yes that seems right. I'd argue that a good consequentialist should devote quite some time to their character - it will affect their future behaviour and consequences thereof, after all!&nbsp;</p>", "parentCommentId": "wFr8KLqpKGnF2tg4h", "user": {"username": "mhendric"}}, {"_id": "PkZk797M6BWkzctqh", "postedAt": "2024-01-21T22:28:53.725Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>I guess then I'll continue to donate then but take it less seriously. Out of curiosity though, which position do you think is more important - veganism or blood/platelet/plasma donation? I have recently been not having enough iron to donate, and it really seems that the only way to solve this is to start eating meat. What would you recommend?<br><br>Edit: For context, I heard in some countries like India, there do seem to be genuine blood/platelet/plasma shortages where people can't get blood when they need it. I heard this from word of mouth, not from a source.</p>", "parentCommentId": "FrXHCPiJWs5AkPvTe", "user": {"username": "dstudioscode"}}, {"_id": "RyQRvE5XdpwiWGvzd", "postedAt": "2024-01-22T11:28:11.399Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>I'd prioritize veganism. You may want to look into iron supplements (and generally supplement strategies for vegan diets), regardless of the blood donation issue - your health is of great importance.</p><p>Thats interesting - I know of similar arguments in e.g. wartorn countries like Ukraine. If those hold up to scrutiny, donating blood in these countries would indeed be shockingly effective.&nbsp;</p>", "parentCommentId": "PkZk797M6BWkzctqh", "user": {"username": "mhendric"}}, {"_id": "4DLDShv2jG9eFfuG4", "postedAt": "2024-01-22T19:08:35.681Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>How is veganism effective then? Like blood/platelet/plasma donation is ineffective because there are already lots of blood donations out there, but somehow veganism if effective despite there being plenty of meat eaters out there?<br><br>Furthermore, earlier on regarding saving hospitals money, I have been thinking if that really saves any lives in a very indirect manner. For context, I live in the US in a for-profit healthcare system. Should I care about saving hospitals money? Who receives the benefit in this scenario? Maybe hospital has more money to save more people, or maybe the admins in charge gets a bigger payraise...</p>", "parentCommentId": "RyQRvE5XdpwiWGvzd", "user": {"username": "dstudioscode"}}, {"_id": "mDocTJhxxfoPpoGgP", "postedAt": "2024-01-22T21:06:30.695Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Doing good Better has some estimates on the effect of individual consumption choices on animal production, and takes them to be positive. I think its widely believed that they matter - raising animals costs money, and if corporations sell less animal products, they will produce less animals.<br><br>I have no especially interesting answers to the healthcare question.<br><br>Both actions will be much less effective than e.g. developing a regular donation habit, getting a good degree and choosing a world-improving career etc. But I don't think its healthy (or common!) for EAs to focus only on the most life-saving choices in their lives. Many EAs are vegan because they (rightly!) think it is just wrong for animals to be held in horrible conditions. Many EAs donate blood because they (probably rightly) think its an easy and positive way to help someone. I think its a good practice to not only focus on the highest-impact choices, but also to aim for a lifestyle in which we can integrate some lower-effort prosocial habits that one believes holds moral value.<br>&nbsp;</p>", "parentCommentId": "4DLDShv2jG9eFfuG4", "user": {"username": "mhendric"}}, {"_id": "nA5jRwWPvFdFjTHWf", "postedAt": "2024-01-28T05:48:46.775Z", "postId": "bch9qJNzfCmJ4PzzB", "htmlBody": "<p>Agreed that the article doesn't provide an in-depth data analysis the provides a compelling evidence-based conclusion. It wasn't that type of article.</p><p>Importing blood from other countries as an alternative solution to donating blood doesn't make any sense at all though because the blood from other countries comes from donors too.&nbsp;</p>", "parentCommentId": "9uk9xQqdtcEqEdB7J", "user": {"username": "Schlermie"}}]