[{"_id": "8XSyxwkHR8TE7TQqP", "postedAt": "2024-01-03T19:35:56.490Z", "postId": "BcjqfECWBvhtBMZou", "htmlBody": "<p>This is a program I'm incredibly interested in applying for, but I work full-time. Do you have any plans to offer a longer-duration but part-time version of this program in the near- to medium-future?</p>", "parentCommentId": null, "user": {"username": "elizabethcooper"}}, {"_id": "q4TH4TGhQACcXjmsp", "postedAt": "2024-01-04T09:13:15.201Z", "postId": "BcjqfECWBvhtBMZou", "htmlBody": "<p>Hi Elizabeth, thanks for your interest! There is, unfortunately, no plan in the near future to offer this program on a part-time basis, but we are working towards making some of the material from the program publicly available for self-study or for people to use it in a way that serves them.&nbsp;</p>", "parentCommentId": "8XSyxwkHR8TE7TQqP", "user": {"username": "Leonie Falk"}}, {"_id": "CxRyGdFiM9EnDNRGA", "postedAt": "2024-01-08T07:29:10.087Z", "postId": "BcjqfECWBvhtBMZou", "htmlBody": "<p>Excellent news for enthusiasts like me. Making actionable information resources more accessible is in and of itself an action with a great positive impact on people like me.</p>", "parentCommentId": "q4TH4TGhQACcXjmsp", "user": {"username": "Nirmal George"}}, {"_id": "vWSzT7oyLEFxRsd8B", "postedAt": "2024-01-22T08:58:16.058Z", "postId": "BcjqfECWBvhtBMZou", "htmlBody": "<p>Hi Leonie,</p><p>I realise the timing is going to line up badly for recruiting for this round, but I'd really like to see some data from previous grads once you get it in - where do they end up, what was their general feedback like, etc?</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "3t2oy9QJ4MADBKEEw", "postedAt": "2024-01-23T10:20:55.377Z", "postId": "BcjqfECWBvhtBMZou", "htmlBody": "<p>To quickly chip in with some data I have, people who were pretty happy with the program, scoring it 4.45/5. About half of them received a job offer, placement, or internship following the program, most of which were facilitated or recommended by us. We have not done a full counterfactual estimate yet, though, as I do think talented people often get offers anyway, even without the extra skills/credentials that the program provides. So, it might be counterfactually closer to 33%.</p>", "parentCommentId": "vWSzT7oyLEFxRsd8B", "user": {"username": "Joey"}}, {"_id": "pHvgdBBt3F9FeaabH", "postedAt": "2024-01-25T16:32:44.738Z", "postId": "BcjqfECWBvhtBMZou", "htmlBody": "<p>This seems like a great opportunity. It is now live on the <a href=\"https://ea-internships.pory.app/board\">EA Opportunity Board</a>!</p>", "parentCommentId": null, "user": {"username": "EA Oppportunity Board"}}, {"_id": "8jsnDErthTQD3A5nM", "postedAt": "2024-03-10T09:58:58.916Z", "postId": "BcjqfECWBvhtBMZou", "htmlBody": "<p>Thanks for the update, Leonie! I would be pretty interested in checking the handbook.</p>", "parentCommentId": "q4TH4TGhQACcXjmsp", "user": {"username": "vascoamaralgrilo"}}]