[{"_id": "uovA6wNEjwMHH8ju3", "postedAt": "2024-03-22T00:13:35.448Z", "postId": "bdJjGxGzWLHadp8zv", "htmlBody": "<p>For evidence-based personality tests, check out <a href=\"https://en.wikipedia.org/wiki/Big_Five_personality_traits\">The Big Five (OCEAN)</a> or its updated sibling, <a href=\"https://en.wikipedia.org/wiki/HEXACO_model_of_personality_structure\">HEXACO</a>.</p>", "parentCommentId": null, "user": {"username": "DaveC"}}, {"_id": "hkxeF5ibfym5iRsHJ", "postedAt": "2024-03-22T12:56:49.839Z", "postId": "bdJjGxGzWLHadp8zv", "htmlBody": "<p><strong>Executive summary:</strong> Green, a perspective that values harmony with nature, tradition, and joy in otherness, is often missing from AI risk discourse but has important wisdom to offer.</p><p><strong>Key points:</strong></p><ol><li>Green values attunement with nature, respect for tradition and lineage, and taking joy in otherness rather than seeking total control.</li><li>AI risk discourse and related ideologies like rationalism and effective altruism tend to be \"green-blind\" and miss green's perspective.</li><li>Green's emphasis on respect, humility and preserving what exists is relevant to concerns about advanced AI systems disrupting the world.</li><li>Green points to the importance of finding joy in engaging with an \"Other\" that exceeds our full understanding and control.</li><li>In the age of AGI, green raises the concern that the pursuit of power and yang could come at the cost of valuable forms of yin and otherness.</li><li>A good future should preserve green values like connection with nature while still wisely using technology to improve the world.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]