[{"_id": "YkTgyTXu8qeMwt6Mr", "postedAt": "2022-09-11T18:15:40.868Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Thank you, this is fascinating stuff!<br><br>One quick question on the policy implication as I (as a climate philanthropist) often ask myself whether or not to fund geoengineering advocacy.<br><br>While your argument -- if correct -- pushes strongly in the direction of worlds where we would want to use geoengineering by making an emergency situation much more likely in expectation, even the lowest estimate you cite &nbsp;in term of the transition (four years) still seems like plenty of time if the global community decided geo-engineering was &nbsp;a global priority (like, say, in a way that vaccine development was for COVID-19).&nbsp;<br><br>I.e., does it really change something in term of optimal action now re geo-engineering?<br><br>(I do think your argument has strong force re optimal climate policy more generally, I am just less sure it affects geo-engineering prioritization within the portfolio).&nbsp;</p>", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "rRC6Cds22eW4wCjjn", "postedAt": "2022-09-11T19:10:31.952Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I think, yes. We need a completely new science of \"urgent geoengineering\" - that is something like creating artificial nuclear winter by controlled fires in forests which will give us a few years of time to develop better methods or to reverse the dangerous trend.</p><p>I tried 6 years ago to create a more detailed plan (it may obsolete, but that is what I have) here</p><p><a href=\"http://immortality-roadmap.com/warming3.pdf\">http://immortality-roadmap.com/warming3.pdf</a> it is a chart</p><p>and it is its explanation <a href=\"https://forum.effectivealtruism.org/posts/C3F87C8r6QFXwnwqp/the-map-of-global-warming-prevention\">https://forum.effectivealtruism.org/posts/C3F87C8r6QFXwnwqp/the-map-of-global-warming-prevention</a>&nbsp;</p>", "parentCommentId": "YkTgyTXu8qeMwt6Mr", "user": {"username": "turchin"}}, {"_id": "xiEB62BK3Genpvg5x", "postedAt": "2022-09-12T16:17:31.840Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Thanks, will have a look!</p>", "parentCommentId": "rRC6Cds22eW4wCjjn", "user": {"username": "jackva"}}, {"_id": "oNTB2ztSXuhBwQvDE", "postedAt": "2022-09-25T23:46:03.665Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I agree with this assessment insofar as we might be far closer to climate tipping points than it at first seems. I am curious about how a society might use and recover from urgent geo-engineering.</p><p>It seems like any scenario where urgent geo-engineering is used would have drastic effects. Who do you imagine would make this decision? If it is the governments like the UN what efforts might be made to get them to seriously consider this proposal? If you Imagine that it would be individual actors this seems like it might do more harm than good insofar as it violates the principle of conformity.</p><p>On a separate note, it doesn't seem like it would be easy to recover from the use of urgent geo-engineering in such a way that doesn't put us past the tipping point again. It seems like the use of such technology would drastically reduce our ability to research after its use, as it seems like it would totally destroy the supply chain. I am curious if I am missing anything there.&nbsp;</p><p>As a result, I wonder if urgent geoengineering might not be a solution even if we are very close to tipping points.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ember Reed"}}, {"_id": "GhuojLwwmYrtuJ7J2", "postedAt": "2022-09-28T15:08:08.610Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>If we create artificial nuclear winter - it could be created by one strong actor unilaterally. No coordination is needed.&nbsp;</p><p>Such nuclear winter may last few years and naturally resolve to normality. During this process two things could happen: &nbsp;either the tipping point conditions also stop, like methane leakage ends. Or we create more permanent solution to our problem like more stable form of geoengienering.</p><p>The artificial nuclear winter doesn't need to be very strong (in -2-3 C range), so no major disruption of food production will happen.</p>", "parentCommentId": "oNTB2ztSXuhBwQvDE", "user": {"username": "turchin"}}, {"_id": "rt2GtzJg65tEkFqsx", "postedAt": "2022-09-30T17:33:17.563Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I understand it could be done by one strong actor unilaterally, I simply wonder if I could reasonably support such an action being taken unilaterally. This paper is what sold me on this position https://nickbostrom.com/papers/unilateralist.pdf</p><p>I think you are overestimating what could be accomplished during this time period, I imagine that most people would become hostile to any movement which just intentionally triggered a nuclear winter.&nbsp;</p><p>Do you have a source on how disruptive nuclear winters would be to food production, I am skeptical.</p><p>&nbsp;</p><p>On an unrelated note, I see that you sight \"Nuclear war near misses and anthropic shadows\" which is marked as being in preparation. I wrote an essay that I imagine is similar titled \"Nuclear fine-tuning\". I am wondering if you have access to this document and if you could send it my way, as I would like to read it to see what gaps in my arguments it might fill in.</p><p>My essay can be found here: https://forum.effectivealtruism.org/posts/Gg2YsjGe3oahw2kxE/nuclear-fine-tuning-how-many-worlds-have-been-destroyed</p>", "parentCommentId": "GhuojLwwmYrtuJ7J2", "user": {"username": "Ember Reed"}}, {"_id": "FajEHzJMuGqQhiDJu", "postedAt": "2022-10-06T14:09:11.329Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>If there will obvious global runaway global warming, like +6C everywhere and growing month by month, people will demand \"do something\" about it and will accept attempts to use nuclear explosions to stop it.&nbsp;</p><p>I don't have access now to the document \"Nuclear war near misses and anthropic shadows\"</p>", "parentCommentId": "rt2GtzJg65tEkFqsx", "user": {"username": "turchin"}}, {"_id": "cqRDQxDCTDfgmcgSn", "postedAt": "2022-10-10T21:12:11.615Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Interesting post!&nbsp;</p><p>I think the extent to which the following claim is true is quite important (emphasis mine):</p><blockquote><p>However, <strong>the idea of anthropic fragility means that we should lower our estimates for around an order of magnitude</strong>, which, given all uncertainties, means that the tipping point could lie not in tens but in <i>single digits</i> of temperature increase (that is, between 1.5C and 4.5C, if we just divide on 10 the above estimate).</p></blockquote><p>From what I understand, the above is based on the Appendix.</p><blockquote><p>6. Over simplification of all said above is the following rule of thumb: Anthropic shadow lowers future life expectancy for no more than 1 order of magnitude in most plausible cases.</p></blockquote><p>Even if this is true, why would the toy example of an old man apply to humanity?</p><blockquote><p>Normally distributed anthropic shadow</p></blockquote><p>I do not think the lifespan of humanity follows a normal distribution:<br>&nbsp;</p><ul><li>I think the life expectancy of humanity is at least of the order of 10^15 years:<ul><li>Star formation will continue for 10^15 to 10^17 years (see <a href=\"https://phys.org/news/2015-09-fate-universeheat-death-big-rip.html#:~:text=Somewhat%20more%20pressing%20is%20the,gas%20needed%20will%20be%20exhausted.\">here</a>).</li><li>Toby Ord guesses in The Precipice that the total existential risk is 0.5.</li><li>So there is arguably a chance of 0.5 of humanity surviving at least 10^15 years, which means its life expectancy is at least 10^15 years.</li></ul></li><li>However, the median lifespan of humanity seems to be very short:<ul><li>Based on the estimate of the total x-risk of 0.5, there is a chance of 0.5 of humanity not surviving the <a href=\"https://forum.effectivealtruism.org/topics/time-of-perils\">Time of Perils</a>.</li><li>Is such time ends in e.g. about 1 k years, the median lifespan of humanity is also about 1 k years.</li></ul></li><li>The mean and median are similar for a normal distribution, but for humanity lifespan, I would say the mean is at least 10^(15 - 3) = 10^12 times as high as the median. So normality does not seem to apply.</li></ul>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "W6jDMHPxYScJ37Fyv", "postedAt": "2022-10-10T21:12:42.438Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I would appreciate your thoughts on the shape of the relationship between existential risk due to climate change and global warming. For example, would it be reasonable to assume it is linear, i.e. that the x-risk linked to an increase of 2 ºC relative to today's temperature is 2 times as large as the x-risk linked to an increase of 1 ºC?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "difeJ3hhK6awBZHYg", "postedAt": "2022-10-14T21:38:39.826Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Ah, that's too bad, do you have the email of anyone who would?</p>", "parentCommentId": "FajEHzJMuGqQhiDJu", "user": {"username": "Ember Reed"}}, {"_id": "wMGMz9rrKqe7J3nyq", "postedAt": "2022-10-15T14:40:21.672Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Image as a toy example a tense spring which is described by Hooke's law. Fs = kx.</p><p>Imagine also that we can observe only those springs that are tensed far beyond their normal breaking point = it is a model of anthropic shadow.</p><p>From logarithmic nature of the relation between remaining life expectancy and &nbsp;the power (probability of past survival) of anthropic shadow follows that for almost any anthropic shadow the remaining life expectancy is between 5-20 per cent of past survival time, lets call it dA.</p><p>For a tensed spring it means that its additional length beyond the breaking point is around 5-20 percent of total length (with several linearity assumptions which &nbsp;will not list here for simplicity).</p><p>Now, the fragility of the spring could also be measured in its additional length increase which will cause its breakdown, dL.&nbsp;</p><p>dL can't be more than the dA, as dA is already improbable event, and dA is less than 5-20 per cent of total length of the spring. Therefore, dLis less than 0.05-0.2 of L.</p><p>This seems to work only for the situation when the relation of the main parameter L is <i>linear</i> with the force of tension. But even for non-linear parameters they could be approximated by linear ones near the point.</p><p>TL;DR: Fragility is delta L (increase) of the main parameter of the system which causing its catastrophe. Fragility is proportional to anthropic shadow in a system similar to tensed spring or overinflated ballon, but in most cases of anthropic shadow it is independent of initial parameters an is around 10 per cent change. In the case of climate, it is not very clear what is main parameter, but likely it is means temperature.&nbsp;</p>", "parentCommentId": "cqRDQxDCTDfgmcgSn", "user": {"username": "turchin"}}, {"_id": "zTBeqkqpmPu2T5dLp", "postedAt": "2022-10-15T14:49:42.484Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Anthropic shadow applies not to humanity, but to underlying conditions on which we can survive.&nbsp;</p><p>For example, the waves of asteroid bombardment are every 30 million years, but not exactly 30 mln.&nbsp;</p><p>The next wave is normally distributed around 30 with mean deviation, say, 1 mln years. If 33 mln years have gone without it, it means that we are 3 sigmas after the mean.&nbsp;</p>", "parentCommentId": "cqRDQxDCTDfgmcgSn", "user": {"username": "turchin"}}, {"_id": "jspbRrFikuhizW2jc", "postedAt": "2022-10-15T15:01:58.875Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>We don't know where is the tipping point, so uninformed prior gives equal chances for any T between 0 and, say, 20 C additional temperature increase. In that case 2C is 2 times more likely.&nbsp;</p><p>But the idea of anthorpic shadow tells us that tipining point is likely to be 10 per cent of the whole interval. And for 40C before moisture greenhouse it is 4C. But, interestingly, anthropic shadow tells us that smaller intervals are increasingly unlikely. So 1C &nbsp;increase is orders of magnitude less likely to cause a catastrophe than 4 C increase.</p><p>I will illustrate this as following example:</p><p>Imagine you are buying a used car which had run 300K miles. It is a unique survivor for its age.</p><p>If the car had 1 in 1000 chance to survive until its age, then doubling period of the probability of death (aka half-life) for it is 30K miles (10 doublings); if it had 1 in 1 000 000 chances to survive until current age, it has 20 doubling or 15K miles. The 1000 times growth of anthropic shadow lower car's life expectancy only 2 times.</p><p>Future survival declines very slowly:</p><p>Anthropic shadow power 1 in 1000 = survival 10 per cent more</p><p>Anthropic shadow power 1 in 1000 000 = survival 5 per cent more.</p>", "parentCommentId": "W6jDMHPxYScJ37Fyv", "user": {"username": "turchin"}}, {"_id": "BMnXiNJbzDLijq3dj", "postedAt": "2022-10-15T15:07:02.867Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Sanberg recently published its summary in twitter. he said that he uses the frequency of near-misses to estimate the power of anthropic shadow and found that near misses was not suppressed during the period of large nuclear stockpiles and &nbsp;it is evidence against anthropic shadow. I am not sure that it is true, as in early times the policy was more risky.&nbsp;</p>", "parentCommentId": "difeJ3hhK6awBZHYg", "user": {"username": "turchin"}}, {"_id": "vrwxusheoyjQfu6ns", "postedAt": "2022-10-16T16:54:05.059Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Thanks for the reply!</p><p>Your calculations apply to an <a href=\"https://en.wikipedia.org/wiki/Exponential_distribution\">exponential distribution</a>. Do we have reasons to choose an exponential prior over a uniform/loguniform prior for the location of the existential tipping point? I guess one possible disadvantage of the exponential prior is the lack of a maximum (which should arguably be assumed given our knowledge about moisture greenhouse), but this could be solved by using a truncated exponential.</p>", "parentCommentId": "jspbRrFikuhizW2jc", "user": {"username": "vascoamaralgrilo"}}, {"_id": "QvyR9E4uTLams5GeW", "postedAt": "2022-10-16T18:47:17.911Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Thanks for clarifying!</p><p>Let me see if I have understood your argument:</p><ul><li>If the probability of having avoided existential catastrophe due to climate change until now is smaller than p_max = 0.1 %, the \"half-warming\" is smaller than HW_max = 0.100 (= -1/log2(p_max)).&nbsp;</li><li>So, given the <a href=\"https://en.wikipedia.org/wiki/Exponential_distribution#Memorylessness\">lack of memory of the exponential distribution</a>, the mean additional warming until existential catastrophe due to climate change is smaller than 14.5 % (= HW_max/log(2) = 1/log(1/p_max)) of the maximum historical warming until now.&nbsp;</li><li>Based on <a href=\"https://www.science.org/content/article/500-million-year-survey-earths-climate-reveals-dire-warning-humanity\">this</a> article, temperature was 18 ºC (=(90-58)/1.8) higher than now 250 Myear ago. This means the existential additional warming is smaller than 2.61 ºC (=18*14.5 %). This is in agreement with your conclusion that \"the tipping point could lie not in tens but in single digits of temperature increase (that is, between 1.5C and 4.5C, if we just divide on 10 the above estimate)\".</li></ul><p>However, why should the anthropic shadow be smaller than 0.1 %?&nbsp;</p><ul><li>As the anthropic shadow tends to 1, the existential warming tends to infinity.</li><li>Given that we are still here, I think the probability of 18 ºC of warming not having led to an existential catastrophe 250 Myear ago should be larger than 50 % (instead of smaller than 0.1 %). In this case, the existential additional warming relative to today's temperature would be larger than 26.0 ºC (= 18/log(1/0.5)) for an exponential prior.</li></ul>", "parentCommentId": "wMGMz9rrKqe7J3nyq", "user": {"username": "vascoamaralgrilo"}}, {"_id": "n5wC3ANQHX9mxpMbC", "postedAt": "2022-10-16T19:18:28.203Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I see, thanks!</p>", "parentCommentId": "zTBeqkqpmPu2T5dLp", "user": {"username": "vascoamaralgrilo"}}, {"_id": "usCeMKosMwzafgsgc", "postedAt": "2022-10-18T14:32:28.399Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I use exponential prior to illustrate the example with a car. For other catastrophes, I take the tail of normal distribution, there the probability declines very quickly, even hyperexponentially. The math there is more complicated. But it does not affect the main result: if we have anthropic shadow, the expected survival time is around 0.1 of the past time in the wide range of initial parameters.&nbsp;<br><br>And in the situation of anthropic shadow we have very limited information about the type of distribution. &nbsp;Exponential and normal seems to be two most plausible types for catastrophes. There is also semi-periodic ones, but they could be described as a sum of periodic plus normal.&nbsp;</p><p>But obviously there is more to dig here.</p>", "parentCommentId": "vrwxusheoyjQfu6ns", "user": {"username": "turchin"}}, {"_id": "2mRDwBtCGYBnoW4Fd", "postedAt": "2022-10-18T15:00:53.104Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>From climate point of view, we need to estimate not only the warming, but also the speed of warming, as higher speed gives high concentration of methane (and this differential equation has exponential solution). Anthropogenic global warming is special as it has very high speed of CO2 emission never happened before. We also have highest ever &nbsp;accumulation of methane hydrates. We could be past tipping point but do not know it yet, as exponential growth is slow in the beginning.&nbsp;</p><p>From SIA counteragrument follows that anthropic shadow can't be very strong: we are unlikely to observe the world with a very strong anthropic shadow. However, some anthropic effects on climate likely to exist as we observe the &nbsp;preservation of habitability &nbsp;of the Earth despite changes а Sun luminosity. This gives us some range of values there anthropic shadow can be, and 0.1 per cent seems to be a reasonable estimate inside it. Though exact number or range is difficult to estimate. May be Sandberg's work on near-misses in nuclear war would help - when we will have a chance to see it.&nbsp;</p><p>I feel that I didn't answer the whole your question, so can you point what exactly is your point of disagreement.&nbsp;</p>", "parentCommentId": "QvyR9E4uTLams5GeW", "user": {"username": "turchin"}}, {"_id": "ubKKyjGhLNsHdTeDo", "postedAt": "2022-10-18T16:34:11.866Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I agree there is a difference between:</p><ul><li>The current temperature (T0).</li><li>The maximum temperature which would be achieved if we reached net zero today (T1).</li></ul><p>The 2nd of these is higher, so the lower bound for the existential additional warming is smaller than the 26.0 ºC I estimated above (for an anthropic shadow larger than 50 %). I also understand T1 may be a function of not only T0, but also of the current composition of the atmosphere, and the rate at which it has been changing.&nbsp;</p><p>However, how large do you think is the difference between T0 and T1? If it is of the order of magnitude of the warming until now relative to pre-industrial levels of <a href=\"https://www.climate.gov/news-features/understanding-climate/climate-change-global-temperature#:~:text=Earth's%20temperature%20has%20risen%20by,0.18%C2%B0%20C)%20per%20decade.\">1 ºC</a>, there is still a margin of about 25.0 ºC (= 26.0 - 1) to the existential tipping point.</p><p>You mention that we may already have passed the existential tipping point, but that would imply a difference between T1 and T0 of more than 25.0 ºC, which seems very hard to believe.</p>", "parentCommentId": "2mRDwBtCGYBnoW4Fd", "user": {"username": "vascoamaralgrilo"}}, {"_id": "TnZK7u3wa97YhvmCm", "postedAt": "2022-10-19T14:12:58.305Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>I think that the difference between tipping point and existential temperature should be clarified. Tipping point is the temperature after which self-sustaining loop of positive feedback starts. In the moisture greenhouse paper it is estimated to be at +4C, after which the temperature jumps to +40C in a few years. If we take +4 &nbsp;C above preindustrial level, it will be 1-3 above current level.&nbsp;</p>", "parentCommentId": "ubKKyjGhLNsHdTeDo", "user": {"username": "turchin"}}, {"_id": "nYqntqBMsq3oSrgQj", "postedAt": "2022-10-19T14:28:03.615Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Thanks for clarifying. I had understood that difference, but for me it is unclear from what you discuss <a href=\"https://forum.effectivealtruism.org/posts/bdSpaB9xj67FPiewN/a-pin-and-a-balloon-anthropic-fragility-increases-chances-of#3_2_3__CO2_concentrations_which_could_start_runaway_warming\">here</a> that the tipping point is only 4 ºC above pre-industrial temperature. Could you link to the specific paper you are referring to?</p>", "parentCommentId": "TnZK7u3wa97YhvmCm", "user": {"username": "vascoamaralgrilo"}}, {"_id": "KLfiCna2Bfa695eDX", "postedAt": "2022-10-21T09:49:14.840Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>\"Transition to a Moist Greenhouse with CO<sub>2</sub>&nbsp;and solar forcing”&nbsp;<a href=\"https://www.nature.com/articles/ncomms10627\">https://www.nature.com/articles/ncomms10627</a></p>", "parentCommentId": "nYqntqBMsq3oSrgQj", "user": {"username": "turchin"}}, {"_id": "eYDiJH2m2Zi6ysjyk", "postedAt": "2022-10-21T11:20:55.880Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>Thanks. The results of that article cannot be applied directly to the situation we are in, because the initial temperature of their aqua-planet &nbsp;is 6 ºC higher than today's mean global temperature. From note (6.93) of What We Owe to the Future (see <a href=\"https://whatweowethefuture.com/notes/\">here</a>):</p><blockquote><p>Hansen et al. 2013, 17. Popp et al. (2016) [the studied you linked to just above] found that if carbon dioxide concentrations reached 1,520 parts per million, a simulated planet would transition to a moist greenhouse state. If we burned all of the fossil fuels, then carbon dioxide concentrations would reach 1,600 parts per million (Lord et al. 2016, Figure 2).</p><p>However, the simulated planet’s initial climate was six degrees warmer than today’s Earth. This means that Earth would require a carbon dioxide concentration significantly higher than on the simulated planet to transition to a moist greenhouse.</p></blockquote><p>Indeed, from the Discussion of the article you mention:</p><blockquote><p>A recent study using the same model but in a different version found that the Earth’s climate remains stable for CO2 concentrations of at least 4,480 p.p.m. (ref. 17), whereas our study suggests that such concentrations would lead to a climate transition. Studies of Earth with other GCMs [global climate models] also found the climate to remain stable for higher CO2 concentrations than we do.&nbsp;</p><p>However, the initial climate of our aqua-planet is ~6K warmer than the one of present-day Earth.</p><p>...</p><p>If we account for the difference in the initial climates, the results of the two studies are not in contradiction. Indeed, the climate of the model version used in ref. 17 was recently shown to become unstable when the CO2 concentrations were increased from 4,480 to 8,960 p.p.m.</p></blockquote><p>These concentrations of 4,480 and 8,960 p.p.m are 16.0 (=4480/<a href=\"https://ourworldindata.org/explorers/climate-change?time=1..2018&amp;facet=none&amp;hideControls=true&amp;Metric=CO%E2%82%82+concentrations&amp;Long-run+series%3F=true&amp;country=~OWID_WRL\">280</a>) and 32.0 (=8960/280) times the pre-industrial concentration, which suggests the existential CO2 concentration is 22.6 (= (16.0*32.0)^0.5) times as high as the pre-industrial one. Given the warming until now relative to pre-industrial levels of <a href=\"https://www.climate.gov/news-features/understanding-climate/climate-change-global-temperature#:~:text=Earth's%20temperature%20has%20risen%20by,0.18%C2%B0%20C)%20per%20decade.\">1.04 ºC</a>, and the current concentration of CO2 is 1.48 (= <a href=\"https://www.co2.earth/daily-co2#:~:text=413.79%20ppm&amp;text=This%20table%20presents%20the%20most,parts%20per%20million%20(ppm).\">414</a>/280) times the pre-industrial one, <strong>it seems reasonable to expect the existential warming relative to the pre-industrial temperature is about 20 ºC</strong> (22.6/1.48*1.04 = 15.9), <strong>not 4 ºC</strong>.</p>", "parentCommentId": "KLfiCna2Bfa695eDX", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ydjuCAxr2SCP9LiPK", "postedAt": "2022-10-23T14:08:09.305Z", "postId": "bdSpaB9xj67FPiewN", "htmlBody": "<p>The relation between warming and CO2 is exponential, s we need to count the number of doublings of CO2. Every doubling gives a constant increase of the temperature. Assuming that each doubling gives 2C and 22= 2exp4.5, we get around 9C above preindustrial level before we reach tipping point.</p><p>&nbsp;In the article the tipping point is above 4C (in the chart) plus 6C from warmer &nbsp;world = 10C, which gives us approximately the same result as I calculated above.&nbsp;</p>", "parentCommentId": "eYDiJH2m2Zi6ysjyk", "user": {"username": "turchin"}}]