[{"_id": "dAfTWtLDSib8mGvh2", "postedAt": "2022-11-25T10:01:48.848Z", "postId": "bDWNb7LcbJLBAz7Gd", "htmlBody": "<p>Cross-posting with multiple authors is broken as a feature.</p><p>When Matthew had to approve co-authorship, the post appeared on the home page, but if clicked on, it only showed an error message.</p><p>Then I moved the post to drafts, and when I interacted with it using the three dots on the right side, there was another error message.</p><p>Now Matthew doesn't appear as a coauthor here.</p>", "parentCommentId": null, "user": {"username": "Writer"}}, {"_id": "vFKeGMB8cGstyLsB7", "postedAt": "2022-11-25T13:15:39.511Z", "postId": "bDWNb7LcbJLBAz7Gd", "htmlBody": "<p>Great job once again! Loved it :)</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "n5wy9SKcEx4KjjceX", "postedAt": "2022-11-25T13:19:02.525Z", "postId": "bDWNb7LcbJLBAz7Gd", "htmlBody": "<p>Thanks :)</p>", "parentCommentId": "vFKeGMB8cGstyLsB7", "user": {"username": "Writer"}}, {"_id": "iGTGXRi9yzgHDxct2", "postedAt": "2022-11-25T13:57:26.165Z", "postId": "bDWNb7LcbJLBAz7Gd", "htmlBody": "<p>Haven't read the post, but my answer to the title is \"yes\". SETI seems like a great example for researchers unilaterally rushing to do things that might be astronomically impactful and are very risky; driven by the fear that someone else will end up snatching the credit and glory for their brilliant idea.</p>\n<p>[EDIT: changed \"not net-positive\" to \"very risky\".]</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "46rTzF676fDjecKdE", "postedAt": "2022-11-25T22:39:52.819Z", "postId": "bDWNb7LcbJLBAz7Gd", "htmlBody": "<p>Since we're already in existential danger due to AI risk, it's not obvious that we shouldn't read a message that has only a 10% chance of being unfriendly, a friendly message could pretty reliably save us from other risks. Additionally, I can make an argument for friendly messages potentially being quite common:</p><p>If we could pre-commit now to never doing a SETI attack ourselves, or if we could commit to only sending friendly messages, then we'd know that many other civs, having at some point stood in the same place as us, will have also made the same commitment, and our risk would decrease.<br>But I'm not sure, it's a nontrivial question as to whether that would be a good deal for us to make, would the reduction in risk of being subjected to a SETI attack be greater than the expected losses of no longer being allowed to do SETI attacks?</p>", "parentCommentId": null, "user": {"username": "MakoYass"}}]