[{"_id": "Y39udH6RLXWyHNL8g", "postedAt": "2023-12-13T02:12:41.284Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>AISC 6 was what got me into the field, the research I worked on there is still an influence on what we're doing at Apollo Research now, and <s>three</s> five other people currently at Apollo are alumni of the camp as well.&nbsp;<br><br>I'm also currently not seeing the LTFF grant(s) for the project we started at AISC listed in that table, so I suspect others might be missing as well.</p><p>I think the counterfactual impact for me was probably high here. Certainly, no other formal program active then or now I am aware of seems like it could have replaced AISC for onboarding me into AI Safety.</p>", "parentCommentId": null, "user": {"username": "Laplace"}}, {"_id": "NFzh3jkwiu8GqCtFW", "postedAt": "2023-12-13T22:52:17.964Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>This is good to know!  I’m glad that the experience helped you get involved in AI Safety work.</p>\n<p>Could you search for the LTFF grant <a href=\"https://funds.effectivealtruism.org/grants?fund=Long-Term%2520Future%2520Fund&amp;sort=round\">here</a> and provide me the link? I must have missed it in my searches.</p>\n<p>(Also, it looks I missed two of the four alumni working at Apollo. Will update!)</p>\n<p>I appreciate you sharing this. I’ll add it to our list of <a href=\"https://docs.google.com/spreadsheets/d/1xfxx-15zAF5QfIMpxf17LDN9GvfPzIj_hVzESxwxHRM/edit#gid=1554885061\">anecdotes</a>.</p>\n<p>Also welcoming people sharing any setbacks or negative experiences they had. We want to know if people have sucky experiences so we find ways to make it not sucky next time.  Hoping to have a more comprehensive sense of this from Arb Research’s survey!</p>\n", "parentCommentId": "Y39udH6RLXWyHNL8g", "user": {"username": "remmelt"}}, {"_id": "mnShTid4uAPpdNQXX", "postedAt": "2023-12-14T10:02:33.288Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>I'm sad to hear that AISC is lacking in funding and somewhat surprised given that it's one of the most visible and well-known AI safety programs. Have you tried applying for grant money from Open Philanthropy since it's the largest AI safety grant-maker?</p>", "parentCommentId": null, "user": {"username": "Stephen McAleese"}}, {"_id": "Fitq77tM5xjTvWjfE", "postedAt": "2023-12-14T10:53:26.200Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>It turns out there are <s>five</s> <strong>six</strong> AI Safety Camp alumni working at Apollo, including the two co-founders.&nbsp;<br><br>I got to go through alumni's LinkedIn profiles to update our records of <a href=\"https://docs.google.com/spreadsheets/d/1xfxx-15zAF5QfIMpxf17LDN9GvfPzIj_hVzESxwxHRM/edit#gid=1273480402\">post-camp positions</a>.<br>It's on my to-do list.</p>", "parentCommentId": "NFzh3jkwiu8GqCtFW", "user": {"username": "remmelt"}}, {"_id": "S3SKhjN4BAdiuEypJ", "postedAt": "2023-12-14T16:21:00.847Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>Thanks, we’ll give it a go.\nLinda is working on sending something in for the “Request for proposals for projects to grow our capacity for reducing global catastrophic risks”</p>\n<p>Note though AISC does not really fit OpenPhil’s grant programs because we are not affiliated with a university and because we don’t select heavily on our own conceptions of who are “highly promising young people”.</p>\n", "parentCommentId": "mnShTid4uAPpdNQXX", "user": {"username": "remmelt"}}, {"_id": "LHqawzeiaEiARYsJN", "postedAt": "2023-12-14T16:51:32.598Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>My current understanding is that OpenPhil is very unlikely to give us money.&nbsp;</p>", "parentCommentId": "mnShTid4uAPpdNQXX", "user": {"username": "Linda Linsefors"}}, {"_id": "SGvWiwmrhqohqsEhk", "postedAt": "2023-12-15T13:12:28.848Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>Helpful comment from you Lucius in the sheet:<br><br>\"I think our first follow-up grant was 125k USD. Should be on the LTFF website somewhere. There were subsequent grants also related to the AISC project though. And Apollo Research's interpretability agenda also has some relationship with ideas I developed at AISC.\"<br><br>--&gt; I updated the <a href=\"https://docs.google.com/spreadsheets/d/1xfxx-15zAF5QfIMpxf17LDN9GvfPzIj_hVzESxwxHRM/edit#gid=1554885061\">sheet</a>.</p>", "parentCommentId": "Fitq77tM5xjTvWjfE", "user": {"username": "remmelt"}}, {"_id": "pdcC3mE5jtdFGMTDZ", "postedAt": "2024-02-14T20:05:41.805Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>I have read the posts related to your funding situation, and I still haven't fully figured out why OF wouldn't fund you. Would you like to bring light to the reason why, if you know?&nbsp;</p>", "parentCommentId": "LHqawzeiaEiARYsJN", "user": {"username": "バルス"}}, {"_id": "fPdnKH2vnpctxNwFy", "postedAt": "2024-02-17T01:24:38.455Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>Do you mean OP, as in Open Philanthropy?</p>\n", "parentCommentId": "pdcC3mE5jtdFGMTDZ", "user": {"username": "remmelt"}}, {"_id": "LE34dCGrdtiDuyAhR", "postedAt": "2024-02-17T10:24:56.670Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>Apologies. Yes, I mean Open Philanthropy. &nbsp;</p>", "parentCommentId": "fPdnKH2vnpctxNwFy", "user": {"username": "バルス"}}, {"_id": "ohpsJqENtWuxheXAA", "postedAt": "2024-02-17T15:51:35.806Z", "postId": "be2zpvXqYPncYJKoc", "htmlBody": "<p>Three reasons come to mind why OpenPhil has not funded us.</p><ol><li>Their <a href=\"https://www.openphilanthropy.org/how-to-apply-for-funding/\">grant programs</a> don't match, and we have therefore not applied to them.They have fund individuals making early career decisions, our university-based courses, or programs that selectively support \"highly talented\" young people, or \"high quality nuanced\" communication. We don't fit any of those categories.<ol><li>We did sent in a brief application early 2023 though for a regrant covering our funds from FTX, which was not granted (same happened to at least one other field-building org I'm aware of).</li></ol></li><li>AISC wasn't contacted for bespoke grants – given OpenPhil's fieldbuilding focuses shown above, and focus on <a href=\"https://www.openphilanthropy.org/grants/?q=&amp;focus-area%5B%5D=potential-risks-advanced-ai\">technical research, academic programs, and governance organisations </a>for the rest.<ol><li>Also, even if we engage i with OpenPhil staff, I heard that another AIS field-building organisation had to make concessions and pick research focusses OpenPhil staff like, in order to ensure they get funding from OpenPhil. &nbsp;Linda and I are not prepared to do that.</li></ol></li><li>I did not improve things by <a href=\"https://x.com/RemmeltE/status/1712915503155450319?s=20\">critiquing OpenPhil</a> online for supporting AGI labs. I personally stand by the content of the critiques, but it was also quite in your face, and I can imagine they did not like that.&nbsp;<ol><li>Whatever I critique about collaborations between longtermist orgs and AGI labs can be associated back to &nbsp;AI Safety Camp is &nbsp;or the area I run at AI Safety Camp. I want to be more mindful how I word my critiques in the future.<br>&nbsp;</li></ol></li></ol><p>Does that raise any new questions?</p>", "parentCommentId": "LE34dCGrdtiDuyAhR", "user": {"username": "remmelt"}}]