[{"_id": "CucoYqmadzqs6dvNu", "postedAt": "2023-07-25T20:35:17.335Z", "postId": "Ber8nHACqN8swESsN", "htmlBody": "<p>As the primary author who looked for citations, I want to flag that while I think it is great to cite sources and provide quantitative evidence when possible, I have a general wariness about including the kinds of links and numbers I chose here when trying to write persuasive content.</p><p>Even if one tries to find true and balanced sources, the nature of searching for answers to questions like “What percentage of US philanthropic capital flows through New York City based institutions?” or “How many tech workers are based in the NYC-metro area compared to other similar cities?” is likely to return a skewed set of results. Where possible, I tried to find sources and articles that were <i>about</i> a particular topic and just included NYC among all relevant cities over sources that were <i>about NYC</i>.</p><p>Unfortunately, in some cases the only place I could find relevant data was in a piece trying to make a story about NYC. I think this is bad because of incentives to massage or selectively choose statistics to sell stories. You can find a preponderance of news stories selling the idea that “X city is taking over the Bay as the new tech hub” catering to the local audience in X, so the existence of such an article is poor evidence that X is actually the important, up-and-coming, tech hub. That said, if X <i>actually was</i> a place with a reasonable claim to being the important, up-and-coming, tech hub, you would expect to see those same articles, so the weak evidence is still in favor.&nbsp;</p><p>I am trying to balance the two conflicting principles of “it is good to include evidence” and “it is difficult to tell what is good evidence when searching for support for a claim” by including this disclaimer. The fundamental case made in the sequence is primarily based on local knowledge and on dozens-to-hundreds of conversations I’ve had after spending many years in both the Bay and NYC EA communities, not on the relatively-quickly sourced links I included here to try to help communicate the case to those without the direct experience.</p>", "parentCommentId": null, "user": {"username": "Arthur Malone"}}, {"_id": "ijKiPZHGtLbJiedHz", "postedAt": "2023-07-30T10:46:21.523Z", "postId": "Ber8nHACqN8swESsN", "htmlBody": "<p>I have been excited about NYC having more of a longtermist presence for a long time ;) Thanks for pointing out some of NYC's unique features/comparative advantages.<br><br>I would also add: there are just a ton of people who live within commuting distance to central NYC (like 20 million).&nbsp;<br>-Having a strong EA presence in a populous city seems like an efficient way to market our ideas to a bunch of people.&nbsp;<br>-NYC being high population density makes it an attractive place for people to live; odds are you can live near a bunch of your friends/family, and there will be lots of employment opportunities for non-EA partners.&nbsp;<br>-36% of NYC residents were not born in the USA. NYC is super friendly to immigrants, which makes it an attractive place for the world's best and brightest.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}]