[{"_id": "ufweTExr7RdxpE332", "postedAt": "2023-08-03T09:12:43.888Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>I had also heard anecdotally from some AI orgs that they might not be able to hire as many people as they would like. This seems surprising given how this seems like a pivotal time for AI safety research and the field is still very young and neglected.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "x3TmpZ9mWQStyPjHY", "postedAt": "2023-08-03T12:22:07.512Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>I've always been surprised that there is no fund you can donate to that is only for AI Alignment. You can either donate directly to an org or project or you can donate to a longtermist fund which is broader than just alignment.</p>\n<p>I've tried to argue before that plenty of people are just not that cause neutral and would want to donate to a fund just for alignment. And now that alignment has gone much more mainstream it is even more important that we actually have a legible place for people to donate.</p>\n<p>AI Safety has gone mainstream but most people in the world wouldn't have a clue what “longtermism” is.</p>\n", "parentCommentId": null, "user": {"username": "JJ Hepburn"}}, {"_id": "pR8EkPp5fq2Mgy6JT", "postedAt": "2023-08-03T12:42:52.218Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>This is interesting but not so surprising to me. Increasing attention to AI work means growing orgs and more people working on it.<br><br>AI safety work (outside of big AI companies) is funded almost entirely by donations (as far as I know), with hardly any government money. The large majority of this is probably EA affiliated donations too.<br><br>So if the number of AI safety orgs increase and people wanting to working on AI safety increases rapidly (including people outside EA), but the donation growth doesn't keep up with this then work will stall.</p><p>Also this rings true from the OP<br><i>\"Grants for upskilling, training junior people, and recruitment make a lot less sense right now from grantmakers' perspective. \"</i></p>", "parentCommentId": "ufweTExr7RdxpE332", "user": {"username": "NickLaing"}}, {"_id": "A9yQHccNG5X9T8XsC", "postedAt": "2023-08-04T01:11:45.506Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>FWIW, the LTFF is considering spinning off a fund focused on AI alignment (though no promises at this point in time).</p>", "parentCommentId": "x3TmpZ9mWQStyPjHY", "user": {"username": "Daniel_Eth"}}, {"_id": "fFgrZSvtp9r7aT3Fa", "postedAt": "2023-08-04T12:24:50.586Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>Agreed. Lots of people aren't longtermist.</p>", "parentCommentId": "x3TmpZ9mWQStyPjHY", "user": {"username": "casebash"}}, {"_id": "xaJvCycTJbtSATQna", "postedAt": "2023-08-09T22:58:42.152Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>Judging by the <a href=\"https://funds.effectivealtruism.org/stats/overview\">stats page</a> LTFF currently has 2M in the bank, which is an evidence against being funding constrained. If LTFF have distributed ~all the funds and managers put up a post saying e.g. : “here are 20 more grants totalling 10M we’d really like to see funded”, the argument would have sounded more persuasive, and i would predict the funding gap could get closed relatively quickly by some crypto magnate.&nbsp;</p><p>I appreciate the author starting this conversation and would really love to see comment from LTFF here</p>", "parentCommentId": null, "user": {"username": "Mckiev"}}, {"_id": "XxALMeu7ACu595MWf", "postedAt": "2023-08-10T11:03:32.860Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>Hi Anton,</p><p>Trusting what Caleb Parikh <a href=\"https://forum.effectivealtruism.org/posts/zt6MsCCDStm74HFwo/ea-funds-organisational-update-open-philanthropy-matching\">said</a> 1 week or so ago, it looks like the LTFF is funding constrained:</p><blockquote><p><strong>LTFF funding gap</strong></p><ul><li>The LTFF has a funding gap of $1M/month.<a href=\"https://forum.effectivealtruism.org/posts/zt6MsCCDStm74HFwo/ea-funds-organisational-update-open-philanthropy-matching#fn-Frur7HS8hrB56Acyb-7\"><sup>[7]</sup></a></li><li>Based on donations over the past few months, I estimate that each fund will receive (by default) roughly $120k per month (720K over the next six months), which will be matched at a 2:1 rate, by Open Philanthropy to give us a total of $360k/month.</li><li>This means we expect to be unable to fund around $640k/month of projects we believe should be funded.</li><li>This could be filled by an additional $213k in public donations each month (or $1.27M over the next six months).</li></ul></blockquote><p>On the other hand, the LTFF might still not be funding constrained if the above gap is expected to be easily filled thanks to its announcement.</p>", "parentCommentId": "xaJvCycTJbtSATQna", "user": {"username": "vascoamaralgrilo"}}, {"_id": "TJfQvb7kwefJNgiTG", "postedAt": "2023-08-10T16:17:11.669Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>\"For those applying for grants, asking for less money might make you more likely to be funded\"&nbsp;<br><br>My guess is that it's good to still apply for lots of money, and then you just may not be funded the full amount? And one can say what one would do with more or less money granted, so that the grantmakers can take that into account in their decision.</p>", "parentCommentId": null, "user": {"username": "Vael Gates"}}, {"_id": "nyCaKeeJFKrJdxojB", "postedAt": "2023-08-10T21:46:09.321Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>Hi Mckiev!&nbsp;</p><p>We consider LTFF to be funding constrained because we're still giving out more in grants monthly than we're receiving in donations, despite having raising our internal bar twice since November 2022 (the first time because of an assessment of changes in the LT funding landscape overall, the second time due to worries about our own liquidity constraints).&nbsp;</p><p>If you're interested, you might like my new post on <a href=\"https://forum.effectivealtruism.org/posts/7RrjXQhGgAJiDLWYR/what-does-a-marginal-grant-at-ltff-look-like-funding\">marginal grants at different levels of funding</a> here, which might help you get a useful sense of whether donations to LTFF are valuable relative to your best counterfactual use of money elsewhere.</p><p>Re: \"2M in the bank,\" I think it is literally true that we have 1.8M in the bank, but the number listed is a lagging indicator, because we have a number of grants that were promised or effectively promised but not actually paid out.&nbsp;</p><p>In this <a href=\"https://forum.effectivealtruism.org/posts/7RrjXQhGgAJiDLWYR/what-does-a-marginal-grant-at-ltff-look-like-funding#Appendix_A__Donation_smoothing_saving\">appendix</a>, I also wrote some notes on our current approach to how much we save/donation smoothing (mostly we don't do it that much).</p>", "parentCommentId": "xaJvCycTJbtSATQna", "user": {"username": "Linch"}}, {"_id": "Lv7TnA3cvZMr8QLwL", "postedAt": "2023-08-11T05:53:40.629Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<blockquote><p>On the other hand, the LTFF might still not be funding constrained if the above gap is expected to be easily filled thanks to its announcement.</p></blockquote><p>I definitely hope so! On the other hand, we at least haven't received sufficiently high donations in the last week. But of course it's very possible/likely that people very reasonably need to take a while to decide whether donating to us is worth it, so the situation will look less scary in the coming weeks.</p>", "parentCommentId": "XxALMeu7ACu595MWf", "user": {"username": "Linch"}}, {"_id": "Ke3WE6mJjDiwceh8q", "postedAt": "2023-08-12T13:10:48.207Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>Thank you for pointing me to this post, now I better understand the situation. I hope you'll figure out how to distribute approved grants faster, and also how raise more funds - I'd love to see most net-positive longtermist grants funded, and believe it's achievable.</p><p>&nbsp;</p><p>I think you laid out a very compelling reason to donate to LTFF and I'm sorry I didn't see it earlier. Am I unusual in this regard? What share of current LTFF donors do you think are up to date on this?&nbsp;</p>", "parentCommentId": "nyCaKeeJFKrJdxojB", "user": {"username": "Mckiev"}}, {"_id": "nt2gxhDEGQJkuHN9C", "postedAt": "2023-08-12T23:03:25.328Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<blockquote><p>I think you laid out a very compelling reason to donate to LTFF and I'm sorry I didn't see it earlier.</p></blockquote><p>Thanks for your kind words! And as for being sorry, hardly your fault, given that the relevant public writings are between a few days and 2 weeks old!</p><blockquote><p>Am I unusual in this regard? What share of current LTFF donors do you think are up to date on this?&nbsp;</p></blockquote><p>I'm not sure. We've always been low on grantmaking capacity at least since I've joined in early 2022, and the relative capacity: applications ratio has gotten even worse this year. This resulted in us prioritizing our limited LTFF time on grant evaluations rather than donor engagement or big picture strategic calls. It has also resulted in a number of other deficiencies in LTFF like lack of reliability in responding to time-sensitive applications, see some of Asya's reflections <a href=\"https://forum.effectivealtruism.org/posts/9vazTE4nTCEivYSC6/reflections-on-my-time-on-the-long-term-future-fund\">here</a>.</p><p>We've onboarded a few more guest fund managers (grantmakers) so hopefully the grant evals will be faster. I've also decided recently to devote a significantly higher percentage of time on EA Funds/LTFF rather than my historical \"day job\" at Rethink Priorities, at least until the situation is a bit more stable.</p><p>Anyway, one of my bigger priorities in the upcoming weeks/months is to understand donor concerns, communicate with donors and the EA public more, possibly pitch specific donors about our funding needs, etc. Hopefully this will give us more clarity into whether my tentative assessment (that LTFF's current marginal grant is equal to or better than other marginal longtermist expenditures) is accurate, vs donors are correctly responding to changes in the funding landscape by prioritizing other, better, longtermist donation opportunities.</p>", "parentCommentId": "Ke3WE6mJjDiwceh8q", "user": {"username": "Linch"}}, {"_id": "vceHAubPy9bD8qqF6", "postedAt": "2023-08-13T15:08:08.206Z", "postId": "BErC24s77fdo93ghi", "htmlBody": "<p>Glad to hear that you are increasing capacity!\nIn regards to understanding donor concerns and pitching them: seems like it should be relatively easy to hire someone for this role (unlike hiring a grant evaluator)</p>\n", "parentCommentId": "nt2gxhDEGQJkuHN9C", "user": {"username": "Mckiev"}}]