[{"_id": "Dg6nmYhWJQu8xoMXQ", "postedAt": "2023-09-07T20:54:45.980Z", "postId": "beRtXkMpCT39y8bPj", "htmlBody": "<p>Maybe a slightly better title for this post would be \"There is little evidence on question decomposition\"? Because the evidence against question decomposition seems equally weak as the evidence for it (based on your source).</p>", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "wyzFvshYtJ3MFFuaG", "postedAt": "2023-09-07T21:30:59.450Z", "postId": "beRtXkMpCT39y8bPj", "htmlBody": "<p><strong>Executive summary</strong>: The evidence that multiplicative decomposition improves binary probability forecasts is weak.</p><p><strong>Key points</strong>:</p><ol><li>Conceptual arguments question whether decomposition improves accuracy.</li><li>Empirical research finds limited evidence for decomposition benefits.</li><li>Time series decomposition seems quite different from binary probability decomposition.</li><li>A small experiment could help determine if decomposition helps binary forecasts.</li><li>Recent literature should be reviewed for more evidence on the technique.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "38n6ufufzmmQ3udAw", "postedAt": "2023-09-08T01:39:28.880Z", "postId": "beRtXkMpCT39y8bPj", "htmlBody": "<p>Seems like a question where the answer has to be \"it depends\".</p><p>There are some questions which have a decomposition that helps with estimating them (e.g. Fermi questions like estimating the mass of the Earth), and there are some decompositions that don't help (for one thing, decompositions always stop somewhere, with components that aren't further decomposed).</p><p>Research could help add texture to \"it depends\", sketching out some generalizations about which sorts of decompositions are helpful, but it wouldn't show that decomposition is just generally good or just generally bad or useless.</p>", "parentCommentId": null, "user": {"username": "Dan_Keys"}}, {"_id": "fqjzhP322uG454Lik", "postedAt": "2023-09-08T13:19:15.483Z", "postId": "beRtXkMpCT39y8bPj", "htmlBody": "<p>Good point, will change the title.</p>\n", "parentCommentId": "Dg6nmYhWJQu8xoMXQ", "user": {"username": "niplav"}}, {"_id": "rFdcxzcfYH7ywzXq6", "postedAt": "2023-09-08T17:15:38.509Z", "postId": "beRtXkMpCT39y8bPj", "htmlBody": "<p>Although I'd consider the counter-arguments against multiplicative decomposition to be decent evidence against it.</p>\n", "parentCommentId": "fqjzhP322uG454Lik", "user": {"username": "niplav"}}]