[{"_id": "vskBbihTNkau79TQw", "postedAt": "2022-11-10T11:59:59.088Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>This is great. I’m glad stuff like the community health team exists.</p>\n", "parentCommentId": null, "user": {"username": "AryanYadav"}}, {"_id": "aZD97h6pxC44vYxuj", "postedAt": "2022-11-10T13:15:50.310Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>The FTX Future Fund recently finished a large round of regrants, meaning a lot of people are approved for grants that have not yet been paid out. <a href=\"https://twitter.com/scifiagenda/status/1590690875189121025\">At least one person has gotten word from them that these payouts are on hold for now.</a> This seems very worrisome and suggests the legal structure of the fund is not as robust or isolated as you <a href=\"https://forum.effectivealtruism.org/posts/2mx6xrDrwiEKzfgks/announcing-the-future-fund-1?commentId=qtJ7KviYxWiZPubtY\">might have thought</a>. I think a great community support intervention would be to get clarity on this situation and communicate it clearly. This would be helpful not only to grantees but to the EA community as a whole, since what is on many people's minds is not as much what will happen to FTX but what will happen to the Future Fund. (From the few people I have talked to, many were under the impression that funds committed to the Future Fund were actually committed in a strict sense, e.g. transferred to a separate entity. If that turns out not to be the case, it's really bad.)</p>", "parentCommentId": null, "user": {"username": "peppersghost"}}, {"_id": "gHeC6xvG6FLtDhK9k", "postedAt": "2022-11-10T13:18:50.416Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "", "parentCommentId": null, "user": {"username": "Gideon Futerman"}}, {"_id": "wj2rS2uizqPD4SoBM", "postedAt": "2022-11-10T14:21:29.001Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<blockquote><p>At least one person has gotten word from them that these payouts are on hold for now. This seems very worrisome and suggests the legal structure of the fund is not as robust or isolated as you might have thought.</p></blockquote><p>If it turns out that committed funds were not liquid, that the legal structure wasn't robust, and that grants promised won't be honoured, that won't just be 'really bad' - it will be egregious.&nbsp;</p>", "parentCommentId": "aZD97h6pxC44vYxuj", "user": {"username": "Alex Catalán Flores"}}, {"_id": "kHcMXQHd3ELdcbsDx", "postedAt": "2022-11-10T14:26:28.107Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Hi Julia,&nbsp;</p><p>Thank you for the post, I think the Community health team is quite resourceful in situations like this.</p><p>My personal belief is that the community health team should be most concerned about about changes in views towards EAs after SBF's downfall. In <a href=\"https://youtu.be/gd5o3mIfO4w\">this video</a> this person probably lost faith in EA due to the incident (or at least became more averse to it). I am not concerned about this one non aligned person losing faith in EA however since EA has closely associated itself with SBF due to his funds, it might lead to an overall bad image of EAs when FTX is bankrupt. Also agree with comments about Future Fund.</p><p>That said we need some robust milestones about SBF's case before we can comment on the situation. I believe the community health team should craft some strong answers to enable key community members (like university organizers and employees of EA orgs) answer tough questions over the coming days.</p><p>I personally want FTX to make a comeback somehow given that I trusted SBF a lot (and so did many community members). But yeah otherwise it is a tough situation that needs to be managed effectively.</p><p>~Arghya</p>", "parentCommentId": null, "user": {"username": "arghya"}}, {"_id": "uc7WsAFffB42vffzd", "postedAt": "2022-11-10T14:31:47.559Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I wouldn't conclude much from the future fund withholding funds for now. Even if they are likely in the clear, freezing payments until they have made absolutely sure strikes me as a very reasonable thing to do.</p>", "parentCommentId": "aZD97h6pxC44vYxuj", "user": {"username": "MathiasKirkBonde"}}, {"_id": "7m65cupECMNA3Tv5R", "postedAt": "2022-11-10T15:25:34.031Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Is there any official guidance about how groups should address the SBF/funding situation with community members? Any official stance?</p>\n", "parentCommentId": null, "user": {"username": "weuer"}}, {"_id": "JuRtc2KEQq5tBt68b", "postedAt": "2022-11-10T16:14:38.043Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>That a situation where they are not \"absolutely sure\" can even occur is one of the major causes of worry here, regardless of the conclusions that can be drawn at this point.</p>", "parentCommentId": "uc7WsAFffB42vffzd", "user": {"username": "peppersghost"}}, {"_id": "Ez8CNuSpPg7M8vsGe", "postedAt": "2022-11-10T16:53:35.891Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I'm sure it's going to be a challenging time for community health. Thank you so much for all the amazing work you guys do. (Evergreen, but especially pertinent this week.)</p>\n", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "uNfCcEGFEeNjaoBDi", "postedAt": "2022-11-10T17:13:34.145Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I don't know how the criminal law works. But if it turns out that the money in the FTX Future Fund was obtained fraudulently, would it be ethical to keep spending it, rather than giving it back to the victims of the fraud?</p>", "parentCommentId": "gHeC6xvG6FLtDhK9k", "user": {"username": "Kevin Lacker"}}, {"_id": "ACteJ7Hq3ZjSQZrok", "postedAt": "2022-11-10T18:05:27.446Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>It's worth noting that in the Bernie Madoff Ponzi scheme, victims were compensated largely by clawing back money previously withdrawn by people with no knowledge that Madoff was operating a Ponzi.</p>\n<p>Hopefully, someone with more legal knowledge about this situation can comment, but given that fact, I wouldn't consider clawbacks out of the question.</p>\n", "parentCommentId": "gHeC6xvG6FLtDhK9k", "user": {"username": "Kerry_Vaughan"}}, {"_id": "QjHkjCRTcpSjAq9Ws", "postedAt": "2022-11-10T18:09:18.710Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "", "parentCommentId": "uNfCcEGFEeNjaoBDi", "user": {"username": "Gideon Futerman"}}, {"_id": "jF6oF2rdxPfLtsEMc", "postedAt": "2022-11-10T19:21:20.008Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I feel pretty sure that you are not ethically obliged to pay anything out of your savings. And you haven't done anything wrong so I don't think you have anything to feel guilty about.</p>\n", "parentCommentId": "QjHkjCRTcpSjAq9Ws", "user": {"username": "Pagw"}}, {"_id": "CCQppBZcnKo5jABPC", "postedAt": "2022-11-10T20:10:28.622Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Edit: see Cate Hall's <a href=\"https://forum.effectivealtruism.org/posts/BesfLENShzSMeb7Xi/community-support-given-ftx-situation?commentId=QrEB5q35LxCAPqFvH\">comment </a>for a better summary of the position under US law, and Molly's <a href=\"https://forum.effectivealtruism.org/posts/BesfLENShzSMeb7Xi/community-support-given-ftx-situation?commentId=y7hEdxGhjsYzpg6p3\">comment</a> re further information OP intends to share from its external counsel shortly.<br><br><i>Epistemic status: I am not a lawyer in either the United States, or in Antigua and Barbuda (where FTX Trading Ltd &nbsp;was registered). I'm also <u>not</u> an insolvency expert. Take all this with a grain of salt. This comment is <strong>not</strong> legal advice.</i></p><p>There are lots of things that might make answering this question in theory tricky, including identifying:</p><ul><li>which FTX entity paid your grant;</li><li>which jurisdiction's insolvency law applies;</li><li>whether that FTX entity was insolvent at the time it paid you;</li><li>whether the relevant insolvency law allows for clawing back payments made prior to filing for bankruptcy/liquidation/etc.</li></ul><p>There are also practical questions - if there is a multibillion dollar hole arising from illegitimate payments from FTX entities to Alameda, then would the liquidator/US trustee (etc) bother coming after small amounts (e.g. a $25,000 grant)? This isn't me suggesting that they wouldn't - I genuinely do not know.</p><p>It looks as though the law in Antigua and Barbuda differs quite a bit from the United States law. <a href=\"https://www.grantthornton.vg/insights/pursuing-net-winners-of-ponzi-schemes--choice-of-jurisdiction/\">This article suggests</a> that Antigua and Barbuda law is that losses lie where they fall once the music stops.</p><p>I received a grant in March 2022, and I don't feel especially worried right now. Even if it turns out that some FTX entities were insolvent then, my rough sense is that either Antigua and Barbuda law applies and losses lie where they fall or that if US law applies then the transfer won't be considered a preferential transfer subject to clawback because it occurred more than 90 days before any filing for bankruptcy. (<i>I don't know if I am understanding the 90 day rule correctly, so please seek advice or look for yourself before making any decisions - this comment isn't legal advice.</i>)</p><p>If I had received a grant more recently, then I would feel less confident. I might avoid spending the grant until learning more.</p><p>If any insolvency lawyers read this, consider commenting (even if not under your actual name) - or PM me to suggest any corrections/clarifications.</p>", "parentCommentId": "gHeC6xvG6FLtDhK9k", "user": {"username": "Tyrone Barugh"}}, {"_id": "QrEB5q35LxCAPqFvH", "postedAt": "2022-11-10T20:25:09.793Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Quick thoughts -- this isn't intended to be legal advice, just pointing in a relevant direction. There are a couple types of \"clawbacks\" under bankruptcy law:</p><ul><li>Preference action (<a href=\"https://www.law.cornell.edu/uscode/text/11/547\">11 USC 547</a>): Generally allows clawback of most transfers by an insolvent entity or person made within 90 days of filing for bankruptcy. The concept here is that courts don't want people to be able to transfer money away to whoever they want to have it just before filing for bankruptcy. My <i>GUESS </i>(this really really isn't legal advice, I'm really not a bankruptcy lawyer) is that any money transferred to a grantee before ~early August won't be able to be clawed back in a preference action. Caveat: There are special rules around transfers to insiders, so the situation might be more complicated for grantees that have multiple types of relationships to FTX.</li><li>Fraudulent transfer action (<a href=\"https://www.law.cornell.edu/uscode/text/11/548\">11 USC 548</a>): Generally allows clawback of transfers made within 2 years of a bankruptcy filing in cases where the transfer was meant to help conceal or perpetrate the fraud (very rough characterization -- trying to balance precision and comprehensibility here). This is the classic Madoff/Ponzi case, where a person/company will pay out some creditors in order to encourage others to invest, meaning that the clawed-back transfers were ones that helped the fraudulent scheme itself work. There's a special provision (subsection (a)(2)) that says charitable donations usually can't be clawed back this way, but it doesn't seem like grant money was necessarily flowing through a 501c3 entity, so I wouldn't assume this applies. Still, my <i>GUESS </i>(this really really isn't legal advice, I'm really not a bankruptcy lawyer) is that grants won't be treated as the kinds of transfers addressed by section 548 because they don't help perpetuate fraud.</li></ul><p>This leaves the situation somewhat unclear for grantees who received funds between August and now. I would <i>GUESS </i>(this really really REALLY isn't legal advice) that disbursed grants being clawed back isn't super likely because of a cluster of factors that I won't be able to clearly describe. This is not very helpful but it's all I can offer. If I get a better understanding of the situation in the next few days I will post an update.</p><p>Because of the specter of a bankruptcy proceeding looming over all of this, I would be surprised if additional grant funds were disbursed in the near future. I'm not sure if any bankruptcy petition has already been filed (I've heard conflicting things), but once it is money <a href=\"https://www.law.cornell.edu/uscode/text/11/549\">is effectively frozen</a>.</p>", "parentCommentId": null, "user": {"username": "catehall"}}, {"_id": "qEZjLwEewTuKJsDsB", "postedAt": "2022-11-10T20:38:17.243Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Where are you getting 90 days from? &nbsp;I found <a href=\"https://higgsjohnson.com/the-extraterritorial-effect-of-clawback-claims-in-insolvency-proceedings-the-bahamas-experience/#:~:text=Bahamian%20insolvency%20law%20permits%20a,the%20commencement%20of%20its%20liquidation.\">six months</a>, although this was very quick and I could easily have missed something.</p>", "parentCommentId": "CCQppBZcnKo5jABPC", "user": {"username": "Elizabeth"}}, {"_id": "8yLrvkrJtcS7pd3oX", "postedAt": "2022-11-10T20:45:12.513Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>See the first bullet point in <a href=\"https://forum.effectivealtruism.org/posts/BesfLENShzSMeb7Xi/community-support-given-ftx-situation?commentId=QrEB5q35LxCAPqFvH\">this comment</a></p>", "parentCommentId": "qEZjLwEewTuKJsDsB", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "KKwCEzBzY4GWgjjAK", "postedAt": "2022-11-10T20:47:17.939Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>that's pointing to US law, yes?</p>", "parentCommentId": "8yLrvkrJtcS7pd3oX", "user": {"username": "Elizabeth"}}, {"_id": "DTFeE8rjiDY2JpxhN", "postedAt": "2022-11-10T20:52:53.807Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>This looks like the position under Bahamian law (which <i>might</i> be the relevant law, not Antigua and Barbuda law or US law, given FTX was operating in the Bahamas - I just don't know how this actually works).&nbsp;</p><p>Re the 90 day rule in the United States, see here &nbsp;under the heading 'Avoidable Transfers': &nbsp;<a href=\"https://www.uscourts.gov/services-forms/bankruptcy/bankruptcy-basics/chapter-11-bankruptcy-basics\">https://www.uscourts.gov/services-forms/bankruptcy/bankruptcy-basics/chapter-11-bankruptcy-basics</a></p><p>Just to reiterate, I'm not a US, Antigua+Barbuda or Bahamas lawyer, and this isn't legal advice.</p>", "parentCommentId": "qEZjLwEewTuKJsDsB", "user": {"username": "Tyrone Barugh"}}, {"_id": "gdZpj2Xm63zRmatb7", "postedAt": "2022-11-10T20:55:14.124Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Yes, as was the part of Tyrone-Jay Barugh's comment referencing the 90 day rule.</p>", "parentCommentId": "KKwCEzBzY4GWgjjAK", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "w8ZhMutZctyjszyx2", "postedAt": "2022-11-10T21:00:09.938Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Do you know how likely it is that United States law applies? I haven't thought about this properly, but it seems like the main entity that is insolvent is a Antigua and Barbuda company doing business in the Bahamas? And I'm also uncertain which FTX entities were actually distributing the grants.</p>", "parentCommentId": "QrEB5q35LxCAPqFvH", "user": {"username": "Tyrone Barugh"}}, {"_id": "fSoR58R3W6CwAT85i", "postedAt": "2022-11-10T21:50:44.764Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>My suggestion is that, at this point, the CEA should have a detailed account of the funds from FTX and where they went to. Sterilise the FTX Future Fund from other EA funding. Why? Because the regulatory drag net will get here and when it does, we want to be prepared.</p>", "parentCommentId": null, "user": {"username": "QuadBee_Aderonke"}}, {"_id": "BHsqYRTkKFKxRxeNL", "postedAt": "2022-11-10T21:57:09.671Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>You're most likely right due to the precedents you stated here. I wouldn't rule out a clawback either because the government has to be able to restore/maintain trust in the system.&nbsp;</p><p>It's why a thorough audit of EA's finance is in order. Any auditor among us could reach out to CEA to help with this.</p>", "parentCommentId": "ACteJ7Hq3ZjSQZrok", "user": {"username": "QuadBee_Aderonke"}}, {"_id": "65XrfaweJoCfyCa3P", "postedAt": "2022-11-10T22:06:53.258Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I do not think this will apply to grantees. I think the people most liable are the members of the team running the FTX Fund at CEA. They would have to prove that they have no knowledge of the fraud, if the verdict so says.</p>", "parentCommentId": "QjHkjCRTcpSjAq9Ws", "user": {"username": "QuadBee_Aderonke"}}, {"_id": "y7hEdxGhjsYzpg6p3", "postedAt": "2022-11-10T22:15:42.092Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Quick response to comments about potential clawbacks: OP expects to put out an explainer about clawbacks tomorrow. It'll be written by our outside counsel and probably won't contain much in the way of specifics, but I think generally FTX grantees should avoid spending additional $$ on legal advice about this just yet.</p><p>Also, please don't take this as evidence that we expect clawbacks to happen, just that we know it's an issue of community concern.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Molly"}}, {"_id": "vCi4PuA7ww6dyG62g", "postedAt": "2022-11-10T22:38:47.830Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Hello, if you plan on making further interactions on the forum, you might consider it useful to add your role to your profile, this would make your interactions more clear to a wider audience.<br><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/27ce1e1f82e5abc8dc3e938c222cd1d59ed5bb989101e1f9.png/w_870 870w\"></p><p>The link is probably here: <a href=\"https://forum.effectivealtruism.org/profile/molly/edit\">https://forum.effectivealtruism.org/profile/molly/edit</a> (this only works for you obviously).</p>", "parentCommentId": "y7hEdxGhjsYzpg6p3", "user": {"username": "Charles He"}}, {"_id": "TNwsuPEekwaTWJzzw", "postedAt": "2022-11-10T22:42:08.116Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Thanks! Updated.&nbsp;</p>", "parentCommentId": "vCi4PuA7ww6dyG62g", "user": {"username": "Molly"}}, {"_id": "CfQ4dzuau5BsbfFkQ", "postedAt": "2022-11-10T23:04:43.954Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>(This is not legal/tax advice, also I'm not familiar with U.S tax law)</p><p>In case of fraud (of course hope it's not), It could be helpful for people who invested in FTX, to check if any tax deduction/relief could apply in his case (some brief info you can get&nbsp;<a href=\"https://news.bloombergtax.com/tax-insights-and-commentary/victims-of-crypto-and-nft-fraud-can-take-theft-loss-deductions\">here</a>).</p><p>However, in some cases, there could be no way to compensate for losses because of a lack of capital gains.</p><p>I'm also curious whether there is any chance for EA orgs funded by FTX, to make any deduction or apply a relief for financial support withheld.</p><p>It's just a tiny prompt for further exploration. I hope any U.S tax lawyer can explain it.</p><p>If I am misleading anyone, please let me know (I will then delete/adjust the comment).</p>", "parentCommentId": null, "user": {"username": "Daniel_Polak"}}, {"_id": "PbHGBpWejcSbQon5A", "postedAt": "2022-11-10T23:07:45.891Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>\"Fraudulent transfer\" under 11 USC 548 is a bit of a misnomer. Subsection (a)(1) explains what makes a transfer \"fraudulent.\" One option, subparagraph (A), requires intent to mess over creditors. But subparagraph (B) does not require any ill intent at all -- it only requires that the debtor \"received less than a reasonably equivalent value in exchange\" for the transfer (check), and that one of four criteria concerning the debtor's financial condition is met (e.g., &nbsp;that the debtor \"was engaged in business or a transaction, or was about to engage in business or a transaction, for which any property remaining with the debtor was an unreasonably small capital\"). The underlying idea is that if a company that is insolvent, on the brink of insolvency, etc. has no business handing out money to favored entities or persons in preference to the claims of its creditors.</p><p>For the curious, the shorter \"preference\" period is more about favoring creditors close to the bankruptcy filing date. &nbsp;So, e.g., if I owe my friend and the bank 100K each, I can't make a big payment to my friend and then file for bankruptcy, because that violates the bankruptcy norm of treating like creditors alike.</p><p>A trustee can also seek clawbacks under 11 USC 544(b) if allowed under applicable state law, which can sometimes look back up to six years.</p><p>Of course, the relevance of this discussion is dependent on whether a US bankruptcy court would apply US law if an FTX debtor filed in US bankruptcy court (for which the standards are low -- <a href=\"https://www.skadden.com/insights/publications/2021/06/quarterly-insights/international-companies-turn-to-us-restructurings)\">https://www.skadden.com/insights/publications/2021/06/quarterly-insights/international-companies-turn-to-us-restructurings)</a> or sought ancillary proceedings under Chapter 15 (which I know very little about). If the target of a clawback isn't in the US, there is also a question of whether the target is effectively beyond the reach of a US court order.</p><p>Complicated stuff, and I'm not qualified to offer an opinion beyond \"consult with your lawyer if you think you have exposure.\"</p>", "parentCommentId": "QrEB5q35LxCAPqFvH", "user": {"username": "Jason"}}, {"_id": "Z7eux57N2mKbHWpBt", "postedAt": "2022-11-10T23:17:29.989Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>As I commented to Cate, I would also think about whether any transfer could fall under 11 USC 548(a)(1)(B) which does not require actual intent to defraud creditors for something to be a \"fraudulent transfer.\" That is not an opinion on whether there are fraudulent transfers here, which (although a lawyer) I am not qualified to give.</p>", "parentCommentId": "CCQppBZcnKo5jABPC", "user": {"username": "Jason"}}, {"_id": "hGzg4ctf3XzCW5PNa", "postedAt": "2022-11-10T23:37:08.856Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Since people are discussing the legal situation: one practical thing the EA community could <i>potentially </i>do is make it clear that if a bankruptcy trustee came after smaller grantees, the community would arrange for the grantee's legal representation. &nbsp;Maybe this offer would be limited to grantees who offered to return &nbsp;grant funds that were not spent or irrevocably committed as of this week (or some later date when the community feels that grantees should know to stop commiting grant funds). Litigation is expensive, which means (1) smaller grantees could be at risk of being bullied into giving back monies they should not have to, but also (2) a credible commitment by the community to fund legal defense would make it unprofitable to litigate against certain smaller grantees (meaning the community shouldn't even have to spend money on their representation at all).</p><p>(I cannot represent anyone due to the nature of my employment, by the way.)</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "8npGtewp8tEgeZuur", "postedAt": "2022-11-11T00:22:40.783Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Expecting a non-profit to be so \"robust\" or \"isolated\" as to be invulnerable to potential clawback claims that all of its funding was the proceeds of recent fraudulent activity by insiders isn't realistic. Maybe the FTX Foundation's setup is more fragile than advertised in other ways, but I can't imagine that any lawyer advising the Foundation would tell them it was OK to keep paying out on grants at the moment. If their in-house or outside counsel had researched in advance what should happen to this specific foundation if all the donations appeared to be linked to fraudulent activity &nbsp;. . . &nbsp;that attorney's licensing authority would have some pointed questions about what the attorney knew and when! So the pause on payouts doesn't really tell me anything useful.</p><p>As for the donor advised funds mentioned in the linked post, the monies legally belong to the DAFs and any potential clawback liability would be against the DAFs (not just against the FTX-aligned person's account at the DAF). If I'm running a DAF in which an FTX-aligned person has an account, I am not releasing any money until I am <i>absolutely</i> sure I don't have any clawback exposure. The admin fee on a large DAF account is a very low percentage of assets, and one cannot reasonably expect a DAF to justify running even a small risk of clawback.</p>", "parentCommentId": "aZD97h6pxC44vYxuj", "user": {"username": "Jason"}}, {"_id": "hrwLejEGsj8NQYr38", "postedAt": "2022-11-11T01:44:35.483Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I received a small grant from the FF. I was conflicted on whether to take it anyway, given that I didn't see FTX (or any crypto company) in a good light even before this story. Now I feel somewhat worse about it.</p>\n<p>I think there are a few things that would come into play here:</p>\n<ol>\n<li>If we give the money back, assuming that's even an option, does it go to someone in need or to someone rich?</li>\n<li>Can we afford it? I think I could, so there's a big chance I would choose to do this if requested. But I don't expect anyone to burn their savings for this like Gideon said.</li>\n</ol>\n<p>I'm currently participating in a program which was also funded by the FF, and which paid a much larger sum than my personal grant for things like my housing during the time of the program. So on the one hand this is something that for me would be harder to pay back. On the other hand:</p>\n<ol start=\"3\">\n<li>At some point we have to consider ourselves far enough removed from the action - it's not like we chose to get specifically FF money by participating. It's not even like someone receiving a grant from the FF chose to participate in fraud.</li>\n</ol>\n", "parentCommentId": "uNfCcEGFEeNjaoBDi", "user": {"username": "Guy Raveh"}}, {"_id": "xqhJqZJTKrBhRJyak", "postedAt": "2022-11-11T05:21:15.839Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>My understanding is that FTX US was unaffected. It's only investors from other jurisdictions potentially at risk. (I don't know how the law works if a US citizen invests from a foreign jurisdiction.)</p>\n", "parentCommentId": "CfQ4dzuau5BsbfFkQ", "user": {"username": "Ben_West"}}, {"_id": "83XRyjdfzuSE4cpJe", "postedAt": "2022-11-11T10:21:23.437Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>A related post from Damon that I like: <a href=\"https://forum.effectivealtruism.org/posts/ReexceojC5mwDQwzX/for-the-mental-health-of-those-affected-by-the-ftx-crisis\">For the mental health of those affected by the FTX crisis</a></p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "eNeTmiteFJ2qs5Bc5", "postedAt": "2022-11-11T12:15:54.003Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Note that the Future Fund team do not work at CEA, they're a separate organisation</p>\n", "parentCommentId": "65XrfaweJoCfyCa3P", "user": {"username": "Neel Nanda"}}, {"_id": "JAdXacEuE6h4aysYW", "postedAt": "2022-11-11T19:22:41.392Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I think, if grant money has been spent in good faith, then it makes ethical sense to treat it as gone and not needing to be repaid. I don't think anyone should make themselves financially worse off for having received a grant.</p>\n", "parentCommentId": "hrwLejEGsj8NQYr38", "user": {"username": "Pagw"}}, {"_id": "vdL4bmft5JK3PoWQo", "postedAt": "2022-11-12T01:35:07.725Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Update that I don't think I'm going to be able to meet the timeline I set myself and have a product I think is worth sharing. Given that this is a holiday weekend it might be hard to find good advisors who are willing to work on this before Monday, but I'm going to try.&nbsp;</p>", "parentCommentId": "y7hEdxGhjsYzpg6p3", "user": {"username": "Molly"}}, {"_id": "KL4CJCtvFRoTSzajG", "postedAt": "2022-11-12T11:36:43.684Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Hey KenC, CEA's groups team has created <a href=\"https://docs.google.com/document/d/1ZIKZp4graSQHpWvAQ6MEy51HEjNeHxFvXOgMZm0_dY4/edit#\">this document with some information and guidance</a>.&nbsp;<br>There is no official stance, but the info might help a bit. Feel free to reach out with more questions.&nbsp;</p>", "parentCommentId": "7m65cupECMNA3Tv5R", "user": {"username": "cafelow"}}, {"_id": "mWu9A6nNMpFCtBstu", "postedAt": "2022-11-12T12:24:41.342Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I presume this advice will be tailored for the legal situation in the US, since that is (I guess) the majority of grantees?</p>", "parentCommentId": "vdL4bmft5JK3PoWQo", "user": {"username": "David Mears"}}, {"_id": "ASfjL3x87ges6PRDe", "postedAt": "2022-11-12T14:21:41.991Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>It'll be an explainer about how US clawbacks work, yes.&nbsp;</p><p>(and mandatory disclaimer: it'll be an explanation of legal context but not legal advice)&nbsp;</p>", "parentCommentId": "mWu9A6nNMpFCtBstu", "user": {"username": "Molly"}}, {"_id": "P2x6pnvxcwHXYkvjo", "postedAt": "2022-11-12T16:17:54.275Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Edit: I threw the below together pretty quickly and now think it was wrong (because i hadn't reviewed the whole statute closely). Sorry about that...</p>\n<p>\"For what it’s worth (and I haven’t been licensed/practiced as an attorney in a while) , My intuition is the charitable exception here seems pretty solid (for the grants that took the form of charitable donations to 501c3s/other charitable entitities. The key question to me doesn’t seem like if granting entity was a 501c3/foundation but whether the recipient was a charity/purpose of the donation was charitable. (The money given to individuals may be dicier but 1. I think it’s still fine and 2. It’s not that much in absolute terms such that I can’t imagine a bankruptcy trustee going hard after it). \"</p>\n", "parentCommentId": "QrEB5q35LxCAPqFvH", "user": {"username": "joshcmorrison"}}, {"_id": "cCvrvp6XBR3EzkrAs", "postedAt": "2022-11-13T17:07:44.686Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Post is now up here: <a href=\"https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation\">https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation</a>&nbsp;</p><p>(links to more resources including the explainer in the post)</p>", "parentCommentId": "y7hEdxGhjsYzpg6p3", "user": {"username": "Molly"}}, {"_id": "5kjLvwZXQhHkzAsSM", "postedAt": "2022-11-14T17:26:25.972Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>This one kinda hurts. I love this podcast but…..</p>\n<p><a href=\"https://open.spotify.com/episode/5OmjGWETh0SG4S3TuV0Ydv?si=wSW-x6zpTGmIY_I_bu9o0g\">https://open.spotify.com/episode/5OmjGWETh0SG4S3TuV0Ydv?si=wSW-x6zpTGmIY_I_bu9o0g</a></p>\n", "parentCommentId": null, "user": {"username": "Catsoncatsoncats"}}, {"_id": "gnTRwLAszbDnwGCax", "postedAt": "2022-11-17T16:13:47.204Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Anyone questioning participating in the movement given these revelations?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dem0sthenes"}}, {"_id": "7RJd9fDe6dPgd45oE", "postedAt": "2022-11-17T16:21:15.308Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Anyone questioning participating in the movement given these revelations?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dem0sthenes"}}, {"_id": "vBzDCeRKNHqJ9GmSt", "postedAt": "2022-11-17T23:05:22.706Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I can't say the actions of Bankman-Fried and his friends make me question my involvement in EA. But I was troubled by the governance of EA before this, and I'm somewhat more troubled now, especially after reading <a href=\"https://forum.effectivealtruism.org/posts/sEpWkCvvJfoEbhnsd/the-ftx-crisis-highlights-a-deeper-cultural-problem-within?commentId=jFgHz8sRqTm5bcfm9\">this comment</a>. On the other hand, I'm also more optimistic of change given the many discussions now happening.</p>\n", "parentCommentId": "7RJd9fDe6dPgd45oE", "user": {"username": "Guy Raveh"}}, {"_id": "3bxGW6MoAcXRHhHn8", "postedAt": "2022-11-18T06:17:10.027Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>here's your support: COPE. learn to trade. it's a free market. if you lost money you NEED to suck it up and move on. blaming sam or any element of this assemblage is babymode cope. stop trying and start over with something you understand .</p>\n", "parentCommentId": null, "user": {"username": "gum"}}, {"_id": "zMFNT4Yf4rMA3hJuR", "postedAt": "2022-11-18T10:50:20.121Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>As a moderator, I think this comment is rude and breaks&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_discourage__and_may_delete_\">Forum norms</a>. Please don't leave any more comments like this or you might be banned from the Forum.&nbsp;</p>", "parentCommentId": "3bxGW6MoAcXRHhHn8", "user": {"username": "Lizka"}}, {"_id": "nTrY4MFSxS95WhJyu", "postedAt": "2022-11-19T19:07:55.647Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>I have now noticed that the user's profile was insulting and contained a slur. The moderation team is banning them permanently and I have cleared their profile. This is not appropriate for the Forum.</p><p>Please let us know at <a href=\"mailto:forum-moderation@effectivealtruism.org\">forum-moderation@effectivealtruism.org</a> if you're concerned.</p>", "parentCommentId": "zMFNT4Yf4rMA3hJuR", "user": {"username": "Lizka"}}, {"_id": "e2SzAbAYTqhGqEKFB", "postedAt": "2022-11-28T17:21:46.435Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>As far as I know only one member has questioned the movement and departed the ranks, and continued to publicly criticize it, and their writing is now explicitly unwelcome here. The movement controls the bounds of dissent. (You can disagree, but only within the framework of EA stated principles and methodology.) Read Chomsky to see how this works.&nbsp;</p>", "parentCommentId": "gnTRwLAszbDnwGCax", "user": {"username": "Max Utility"}}, {"_id": "Dn9kEPGhEqM226dLa", "postedAt": "2022-11-28T17:24:10.449Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>There are lots of people who previously considered themselves EA and have moved away, or are EA adjacent, and still post here sometimes. I don't know of any such cases related to the FTX situation though.</p>\n", "parentCommentId": "e2SzAbAYTqhGqEKFB", "user": {"username": "Khorton"}}, {"_id": "zgjoLjiNhHszyXb3z", "postedAt": "2022-11-28T19:49:24.577Z", "postId": "BesfLENShzSMeb7Xi", "htmlBody": "<p>Yes my comment was not specific to the FTX situation, but pointing to the fact that I've seen how the most vocal ex-EAer's writing is received here. That there aren't any known cases of departures due to the FTX situation is itself extremely troubling.&nbsp;</p>", "parentCommentId": "Dn9kEPGhEqM226dLa", "user": {"username": "Max Utility"}}]