[{"_id": "n49KWuWPtzngvfhTK", "postedAt": "2023-03-29T03:18:43.162Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>Phib - I really like this idea.&nbsp;</p><p>I agree that deepfakes could be a potential amplifier of global catastrophic risks such as warfare, assassinations, political instability, civil war, religious outrage, terrorism, etc. Especially if people haven't really caught up to how realistic and deceptive they can be.</p><p>I'm also not sure of the best way to 'inoculate' people against deepfakes. As you mention, older people might be especially susceptible to them. As would any young people with strong ideological confirmation biases to accept that apparent misbehavior X by individual or group Y might have plausibly happened.&nbsp;</p><p>I expect that in the 2024 US election cycle, we'll see an absolute deluge of partisan deepfakes that aim to discredit, mock, and satirize various candidates, analogous to the surge of social media memes in the 2016 election cycle. I don't think voters are at all prepared for how vicious, surreal, and damaging these could get.&nbsp;</p><p>To most EAs, deepfakes might sound like a weird branch of the porn industry, or a minor political annoyance, compared to flashy AI developments like GPT. However, I think they really could have an utterly corrosive effect on public discourse, partisanship, and trust in news media. Overall, this seems like a moderate-scope, largely neglected, but somewhat tractable issue for EAs to give a bit of attention to.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "qognHoqTsCHyGb8YH", "postedAt": "2023-03-29T04:02:10.669Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>Hi Geoffrey, thanks for taking the time to respond so thoughtfully.</p><p>Agree with the younger people demographic comment, as someone who identifies as young, I'm super fallible, annoyingly. Interestingly, I do have the impression that much of the current 'entertainment deepfake' content might be more targeted toward younger people.</p><p>I hadn't thought of the 2024 election and I think you're very right in bringing it up (thanks again), it does seem like a 'first' big inflection point for this emerging tech to be used...</p><p>I'm tempted to say that the awful deepfakes of this political cycle could be that terrible pill to inoculate people from the worst-case scenarios involving x-risk... but it's hard to imagine how bad these could be and I have this idea that the deepfakes lose quite a bit of their 'oomph' if they are ramped up over time or even overused (per 'desensitization' again).</p><p>In my mind what might separate an x-risk deepfake from the political cycle ones is that the most dangerous a deepfake might be is when it is not analyzed over time (like in a long political campaign*), but rather incorporated into or even causing an immediate decision... unsure.</p><p><i>*interesting to think of the new arena of (deep)fake news...</i></p>", "parentCommentId": "n49KWuWPtzngvfhTK", "user": {"username": "Phib"}}, {"_id": "LNgdfbrLFfRq3wQGz", "postedAt": "2023-03-29T05:58:02.003Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>Thanks for bringing this to light. I think awareness around deepfakes really does need to be considered more.&nbsp;</p><blockquote><p>So maybe spamming content for significant figures doing whacky things is effective for updating people's models for the probability of a deepfake.&nbsp;</p></blockquote><p>I would be slightly concerned about spamming people with deepfakes. I don't know if the average adult knows what a deepfake is. If spammed with deepfakes, people might think the world is even crazier than it actually is and I think that could get ugly. I think a more overtly educational or interactive exchange might have a better outcome.</p><p>I tend to mentally categorize deepfakes in a \"discernment of truth\" bucket alongside misinformation, disinformation. I think that bucket may already be impacting the average adult a fair amount. Social media bots have been fueling these for a while, and (personally, I feel that) there has been a fairly dramatic increase in quantity of scams, spam, phishing and clickbait augmented by ChatGPT and SEO changes. How do others think about this framing and what have others observed?</p><p>I agree that this issue is likely to get much worse if it's not acted upon in a well coordinated, scaled and rapid manner.</p>", "parentCommentId": null, "user": {"username": "more better "}}, {"_id": "eqSzieqrjYLyk8bwh", "postedAt": "2023-03-29T16:13:58.178Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>Yeah discernment of truth makes sense to me - and fair, spam is probably not productive, but it got across my intention of ‘desensitizing’ people to this strategy of playing on our ‘discernment of truth’. I think Geoffrey’s comment on the next political cycle is really interesting for thinking about how that ‘spam’ may end up looking.</p>\n", "parentCommentId": "LNgdfbrLFfRq3wQGz", "user": {"username": "Phib"}}, {"_id": "dkFC5bArWjcogwcJT", "postedAt": "2023-03-29T16:39:27.406Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>I agree. This seems like an important problem.</p>\n<p>Several existing technologies can wreak havoc on epistemics / perception of the world and worsen polarization. Navigating truth vs. fiction will get more difficult. This will continue to be a problem for elections and may sow seeds for even bigger global problems.</p>\n<p>Anyone know what efforts exist to combat this?</p>\n<p>Is this a subcategory of AI safety?</p>\n", "parentCommentId": "eqSzieqrjYLyk8bwh", "user": {"username": "more better "}}, {"_id": "vGmWPhdaoCBdagHJw", "postedAt": "2023-03-29T22:14:17.991Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>Yeah, I have no idea, unfortunately. And yes it seems quite attached to AI capabilities.</p>\n", "parentCommentId": "dkFC5bArWjcogwcJT", "user": {"username": "Phib"}}, {"_id": "pFniE6HtdCfBbjYxL", "postedAt": "2023-05-02T09:01:58.705Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>I agree. This seems like an important problem.</p><p>Several existing technologies can wreak havoc on epistemics / perception of the world and worsen polarization. Navigating truth vs. fiction will get more difficult. This will continue to be a problem for elections and may sow https://apkinu.com/minecraft-apk/ for even bigger global problems.</p><p>Anyone know what efforts exist to combat this?</p><p>Is this a subcategory of AI safety?</p>", "parentCommentId": null, "user": {"username": "henry james"}}, {"_id": "GxgAY8EJxJH9PPMZT", "postedAt": "2023-05-02T17:11:04.300Z", "postId": "bfDke8yv6sX94jF4R", "htmlBody": "<p>This is odd, you copied 'more better's comment?</p>\n", "parentCommentId": "pFniE6HtdCfBbjYxL", "user": {"username": "Phib"}}]