[{"_id": "TGfoiFjbaFiudmxtp", "postedAt": "2022-10-29T21:50:20.839Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<p>To give some additional context, China emitted <a href=\"https://edgar.jrc.ec.europa.eu/report_2021\">11680 MT</a> of Co2 in 2020, out of 35962 MT globally. In 2022 it plans to mine <a href=\"https://www.washingtonpost.com/world/2022/04/22/china-coal-climate-change-xi-energy/\">300 MT more coal</a> than the previous year (which also added 220 MT of coal production), causing an additional 600 MT of Co2 from this alone (might be a bit higher or lower depending on what kind of coal is produced). Previously, China <a href=\"https://www.nytimes.com/2021/09/27/business/economy/china-electricity.html\">tried to reduce its coal consumption</a>, but that caused energy shortages and rolling blackouts, forcing the government to reverse direction.</p>\n<p>Given this, it's really unclear how efforts like persuading Canadian voters to take climate change more seriously can make enough difference to be considered \"effective\" altruism. (Not sure if that line in your conclusions is targeted at EAs, or was originally written for a different audience.) Perhaps EAs should look into other approaches (such as <a href=\"https://www.foreignaffairs.com/world/time-geoengineering-now-climate-change\">geoengineering</a>) that are potentially more neglected and/or tractable?</p>\n", "parentCommentId": null, "user": {"username": "Wei_Dai"}}, {"_id": "rsK6dacojqXiSxcfR", "postedAt": "2022-10-29T22:04:19.797Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<p>Hi Stephen,</p><p>First of all, I appreciate the effort you've put into this post. I suspect it is going to get less attention than you might have hoped, given that effort and the importance you put on the issue. Here's what I'd suggest, either for a revamp of this post or for future posts:</p><ol><li>Paragraphing needs to be improved, with full spaces between paragraphs.&nbsp;</li><li>Be more specific about what EA is getting wrong on climate change. You speak about \"perceptions\" and \"assessments\" of climate change within the EA movement, but don't link, cite, or quote any such material. It would also help if you tried to research what (if anything) EA does about climate change right now, and showed how we ought to reprioritize it relative to other causes. For example, do you think climate change is more important than malaria bednets? If so, why? Although you've clearly spent a lot of time researching climate change, your post does not come across as engaging very deeply with EA arguments about climate change, despite that being ostensibly the key goal of your post.</li><li>Include a summary that hits not only your core claim (EA should put more resources into climate change), but the argumentative beats you use to defend that claim. I want to be able to read the first 1-2 paragraphs and decide if reading the rest is worth my time.</li><li>Overall, I'm just not clear on why Canadian climate policy has such central relevance to your core claim that EA should work harder on climate change.</li></ol><p>If EA is getting this wrong, I'm sure everybody wants to know! Best of luck if you decide to continue researching and writing about this issue.</p>", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "NnD8biBJx53tyqid3", "postedAt": "2022-10-29T22:19:58.362Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<p>I could get on board with \"Climate change is not neglected, but humanity is still terrible at dealing with it with pretty severe consequences, so it makes sense for EAs who are interested or have a comparative advantage to work on it\". I'm not sure if I understand the focus on Canadian policy and voters, either. I think it's because there's a lot of pieces of the puzzle between voters caring about climate change (and I think most of them do!) and humans being good at reversing climate change. For example, what does good policy look like? Does it exist already or does it need to be made? How can a voter tell what is good? And then zooming out from that: Are the proper industry supports in place to fully reap the benefits of good policy? Are the proper technological research, R&amp;D, entrepreneurial energy, removal of red tape for building things, and investment dollars there to flesh out the industry?</p>", "parentCommentId": null, "user": {"username": "ruthgrace"}}, {"_id": "nmFre4bJzjQQjQSN9", "postedAt": "2022-10-30T19:57:10.458Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<blockquote><p>When these factors are combined with the high population growth predicted in hotter countries, one report finds that 3.0 degrees celsius of averaged global warming translates to an average temperature increase as felt per individual of 7.5 degrees celsius.<a href=\"https://docs.google.com/document/d/1fRLmtuJGrKheEII403uJ80eQna2zZg9V788SMii6VYQ/edit#bookmark=id.9jxewhrxiew0\"><sup><u>1</u></sup></a> The same report estimates that 30% of the world’s predicted population will then be living in areas with an average temperature equal to or above the hottest parts of the Sahara desert by 2070.</p></blockquote><p>It's very unclear how someone can on the one hand expect this kind of damage to be caused by climate change and on the other hand expect that people in the future won't do geoengineering that leads to different temperatures. Or expect that this isn't supposed to be an important element of any modal that predict the future of global warming.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "4E2DJxxtBiJRHf46q", "postedAt": "2022-10-31T10:59:13.654Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<p>I agree with some other commenters, some better paragraphing would make it an easier read and it doesn't discuss the existing EA stance enough.</p><p>I do think you're onto something here though: \"EA assessments of climate change tend to be far too simplistic, failing to grasp how the interplay between felt temperature rises, soil fertility collapse, fresh water depletion and biodiversity loss are creating the perfect conditions for a major collapse in global food production. \"</p><p>In general, and understandably, there seems to be a hyper focus on carbon emission driven CC given this is a prime driver of CC. However, &nbsp;underlining the issue is our extractive and destructive approach to nature that ultimately destabilises various earth systems (biochemical flows, habitat destruction and land-use change, ocean acidification, etc etc) .&nbsp;</p><p>For this reason I really like the Planetary Boundaries framework which takes a more systems-oriented view <a href=\"https://www.stockholmresilience.org/research/planetary-boundaries.html\">https://www.stockholmresilience.org/research/planetary-boundaries.html</a></p><blockquote><p>\"The scientists proposed quantitative planetary boundaries within which humanity can continue to develop and thrive for generations to come. Crossing these boundaries increases the risk of generating large-scale abrupt or irreversible environmental changes. Since then the planetary boundaries framework has generated enormous interest within science, policy, and practice.\"</p></blockquote>", "parentCommentId": null, "user": {"username": "Darren_Tindall"}}, {"_id": "KiZca6cizoF7za6tv", "postedAt": "2022-11-01T16:04:19.957Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<p>Thanks for sharing your thoughts on the forum.</p>\n<p>In the introduction, you make 3 claims:</p>\n<ul>\n<li>A) \"Climate change is a low priority issue within EA, with little focus or funding being directed towards this cause area.\"</li>\n<li>B) \"EA assessments of climate change tend to be far too simplistic, failing to grasp how the interplay between felt temperature rises, soil fertility collapse, fresh water depletion and biodiversity loss are creating the perfect conditions for a major collapse in global food production.\"</li>\n<li>C) \"In addition to this there seems to be a perception that climate change is not neglected, perhaps driven by the large amount of media coverage that it receives.  However, media coverage is in no way translating into meaningful funding or the implementation of effective solutions, as my Canadian case study will highlight.\"</li>\n</ul>\n<p>You seek to support these claims by considering two things:</p>\n<ul>\n<li>D) \"I will first discuss some alarming trends at a global level, so as to show the true probable severity of climate change.\"</li>\n<li>E) \"I will then present a summary of my assessment of Canadian climate policy, which will serve as a case study for showing the huge gap between official policy targets and realistic outcomes.\"</li>\n</ul>\n<p>The structure of your argument is to use D) and E) to show A), B), and C) are true, supporting your conclusion that \"EA has gotten it very wrong on climate change\". The argument fails for two reasons. First, D) and E) seem unrelated to A), B), and C). Second even if A), B), and C) are supported, you need to explain how the conclusion follows. It could be the case the EAs are wrong on any or all of A), B), and C), but not by very much, so the relative ranking climate changes in terms of EA priorities doesn't change. Some attempt at scope or size of the variance is necessary.</p>\n<p>On the individual claims:</p>\n<ul>\n<li>A) seems mostly correct, though it would be incorrect to say there is no interest in the cause area.  Climate change has middling interest among EAs <a href=\"https://forum.effectivealtruism.org/posts/83tEL2sHDTiWR6nwo/ea-survey-2020-cause-prioritization\">https://forum.effectivealtruism.org/posts/83tEL2sHDTiWR6nwo/ea-survey-2020-cause-prioritization</a>, though is weighted as less important the longer someone spends in the EA community.  Including some citations here as evidence would help support A).</li>\n<li>B) is the most important claim you make, and covers quite a few areas.  It's not clear how B is supported by D) and E). The IPCC reports give a lengthy treatment to the impacts on global food production from climate change, and the effects are modest when considered across all crops.  The variance in expected meat consumption for instance is more significant than stressors from climate change. You don't seem to be claiming that the studies comprising the IPCC report are wrong here, but it seems like you would need to do so to show there is a significant likelihood of \"a major collapse in global food production\".</li>\n<li>C) is a criticism of an accurate EA perception.  The perception that climate change isn't neglected comes from it being a top election issue, the UNFCCC existing, and ~$10 billion/yr in climate philanthropy (<a href=\"https://www.climateworks.org/report/funding-trends-2022/\">https://www.climateworks.org/report/funding-trends-2022/</a>).  The follow-up claim is media coverage isn't effective, which may be true, but it would be wrong to say it is neglected.  I also think it is incorrect to say that all $10 billion/yr of climate philanthropy is ineffective.</li>\n</ul>\n<p>In the future, it may be worth having someone review a draft of your post to evaluate the logical structure and provide readability edits as others have suggested.  You spent considerable time on this, but it seems unlikely to change minds given those issues.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "HtmWsQjBJ7DFtgg2H", "postedAt": "2022-11-04T17:09:28.926Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<p>I'm largely in agreement with other commenters, but see two points worth adding.<br><br>1. Project Drawdown's list of solutions is prioritized only by their emission aversion potential, and this is not the only possible framework for prioritizing climate solutions. <a href=\"https://www.youtube.com/watch?v=6JJvIR1W-xI&amp;ab_channel=StanfordExistentialRisksInitiative\">If we try to minimize climate damage rather than maximize emissions reductions it may lead to a different ordering of solutions</a>, likely one which better addresses the worst-case possibilities of climate change (e.g. the catastrophic or existential risks associated with very high warming which EAs are especially likely to see as important).<br><br>2. Canada (and Western economies in general) &nbsp;account for a very small fraction of remaining emissions this century. Whether or not Canada fails to meet its policy targets will have a very small effect on overall emissions this century, &nbsp;which is a factor I'd be interested in seeing considered in future posts.&nbsp;<br><br>Thanks for taking the time to write up your thoughts.</p>", "parentCommentId": null, "user": {"username": "violet"}}, {"_id": "ZtuFqroshb4sLDSAj", "postedAt": "2022-11-09T19:36:51.166Z", "postId": "BFvtrhaea85CDYhBQ", "htmlBody": "<p>I find it very worrying that I discovered this post on negative karma. The concerns of the commenters seem to approximate to</p><ol><li>Presentation is bad</li><li>Canadian focus is too specific to justify EA action</li></ol><p>On 1: ok. That doesn't seem like it should be a major blocker to people who take the subject &nbsp;seriously.</p><p>On 2: I agree one case study shouldn't change our behaviour, but since when are case studies not <i>useful</i>? Ok, the title overgeneralises from a single case study, but if we had examples like this from multiple developed or high population country we would be some way to understanding &nbsp;the incredibly complex issue rather than dismissing it on the ground of a single person's assessment (for the record I'm a big fan of Halstead's analysis - I just think it's exceptionally dangerous to treat it as the last word on the subject). But we're unlikely to get such engagement if our response as a community is to shun and even downvote work that's been as carefully researched as this.</p>", "parentCommentId": null, "user": {"username": "Arepo"}}]