[{"_id": "Sz7JprmnXB6z7eSYS", "postedAt": "2023-08-31T10:09:26.708Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>Thanks for sharing this — it feels like you really didn't \"have to\" in some sense, but I appreciated some of the insight into how the process is going and reading your learnings!</p>\n", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "DBLejAdcmQjWATJNp", "postedAt": "2023-08-31T15:15:35.231Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>Thank you, this is enlightening and helps understand the thinking process when you have been on the other side of the counter as an applicant. So you got 35% of people having experience as senior managers. Is that a confirmation that EA lacks people with experience as senior managers? At EA Sweden we are targeting mid-career professionals for this reason among others, so would be nice to see confirmed or infirmed.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "BProrhdWyj5tNXiPJ", "postedAt": "2023-08-31T16:12:05.763Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>Thanks for sharing this!</p><p>At a few points here, you say things like:</p><ol><li>You learned a lot from talking to \"professional recruiters\" or \"people with more experience of executive recruitment.\"</li><li>\"I’m not sure how avoidable this was, but I expect that if I had done this type of executive search many times in the past I would have found this easier to navigate.\"&nbsp;</li><li>\"Overall I felt more frequently confused working on this project than I have in most prior pieces of work I’ve done. It felt fairly different from running a standard recruitment round.\"</li></ol><p>Given this, I'm led to believe that: a) experienced executive recruiters were not directly involved in the selection process and b) the three of you (Claire, Max, and Michelle) don't have a lot of experience <i>recruiting</i> executive directors (though I know you have substantial experience <i>being </i>executive directors, and I assume this experience helps you identify others who might be well-suited to the role). Is that impression correct? If so, why was the decision made not to involve someone who does have substantial experience doing executive recruitment?</p><p>In the interest of candor: I can think of a bunch of reasons why it wouldn't make sense to directly involve an experienced executive recruiter in this process—maybe there aren't too many of these, or they charge $1,000/hour, or they wouldn't be much of a value add, given your knowledge of what being an executive director takes, or they know nothing about EA, etc. But I think EA does tend to do this thing I'll call \"delegating hard, important tasks to very competent people who have a deep knowledge of EA, even when those people lack experience in the relevant domain (in this case: recruiting executive directors).\" Sometimes it seems totally reasonable to do this, and sometimes it seems less reasonable. So my broader question is: do you think that's what happened here, and if so, do you think this was a reasonable approach?</p><p>Again, I really do appreciate your transparency. I raise this question mainly because I think EA differs from other organizations/sectors/social movements in its tendency to prioritize ability and familiarity with EA over domain-specific expertise or formal training in something, so I think it's worth flagging this when it may be occurring, so we can consider whether and when this tendency makes sense.</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "h3j5Nv5ht2NsrFgnC", "postedAt": "2023-09-01T04:05:29.805Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>Would you be willing to describe your approach to reference checks to get more useful information? Questions you ask, etc.</p>", "parentCommentId": null, "user": {"username": "Masha Winchell"}}, {"_id": "tsd3TBRzqqos24oSc", "postedAt": "2023-09-01T16:10:59.969Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>Context: I’m an advisor to the search committee, not a member so I have some insight but not complete visibility.<br><br>My guess is the set of people with significant EA context who have been involved in appointing 3+ leaders of EA and EA-aligned organisations is a very small set of people, many of whom would not have been willing and/or appropriate members of the search committee. I also think Max's description may have been misleading in terms of how much/what kind of experience was brought to bear during this process:</p><ul><li>Max has previously run the hiring rounds for two executive directors (EA Funds and GWWC). Claire participated in decision-making for both of those decisions. These were smaller, less complex processes, though.</li><li>Max consulted ~a dozen people with more experience hiring executives.</li><li>Max met ~weekly with an advisor who had more experience hiring executives.</li><li>We paid an external consultant to help generate candidates and found it a bit useful, although we think we would have found most of the top candidates without their assistance.</li><li>In terms of recruitment generally, Max and I have both been involved in dozens of hiring rounds at CEA and the others folks involved also bring significant recruitment experience (which I know a bit less about).</li></ul><p>Still, I agree that this is still not the same as having someone who has done this activity at this scale many times actually leading the process.</p><p>If you are wondering about whether we should have hired an external firm to run the process/help us run the process, what I’d say is that when we’ve tried to hire professional firms or experts for guidance in high context decision making in the past, it has often been either unhelpful or actively harmful. My personal experience has been that their normal customers have such different desires/incentives that their guidance to us feels wildly off base. HR people, for example, assume we are in an adversarial relationship with our employees and become confused when we want to e.g. share more of certain types of information with them. Similarly, we often don’t seem to be able to get on the same page about valuing integrity or transparency for their own sake, not just the appearance of such things. So, if prior experience is applicable, I personally expect a big headhunting firm would have had some very different ideas about what makes a good CEO and we’d have spent a lot of time trying to close a large inferential gap for a small outcome difference.</p><p>All of that said, I think it's possible we should have explored what executive search firms might be able to offer in more depth. While I expect them to be of limited use in terms of candidate generation, and expect some of their guidance to be wildly off target, it's possible they might have brought advice about conducting the recruitment process or about candidate assessment that might have complimented the perspectives the committee members brought to the process. That said, given the degree to which this increases coordination costs, it seems plausible but not obvious it would have been the right call to invest effort into this.</p><p>Also pulled from Max’s quick notes:</p><blockquote><p>As Caitlin says context is pretty useful and a lot of my experience trying to hire external people to do stuff has been net-unhelpful (e.g. PR firms).</p><ul><li>E.g. I could imagine an exec search firm recommending that we edit the job ad to be less transparent, and this putting some of our top candidates off.</li><li>I’ve been part of hiring rounds that did use an exec search firm, and the exec search firm added little-to-no value (didn’t make much progress, wasted time)</li></ul></blockquote><p>&nbsp;</p><blockquote><p>On the more general point - does EA undervalue expertise? - I think that this is directionally true, but complicated for the reasons that Caitlin says. I think it’s a pretty complicated question when and where and how to use external experts vs. people with more context. For instance, I think ex-consultants can often be quite good at quickly gathering context, stakeholder management, and crisis management, but are generally less well-suited to being agile and building longer-term working relationships. (Obviously consultants vary a tonne, these are just patterns that I think I've seen.) I’m probably not handling this question perfectly - I think that with more experience and expertise, I’ll handle it better!</p></blockquote>", "parentCommentId": "BProrhdWyj5tNXiPJ", "user": {"username": "Cait_Lion"}}, {"_id": "zuNfod4qNhy8dewsL", "postedAt": "2023-09-03T14:37:01.619Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>Thanks for your thoughtful response! This is helpful and makes sense.</p><p>A few reactions:</p><ol><li>It does seem like you/Max/the search committee have a lot of relevant experience, and I appreciate that Max erred on the side of understating this.</li><li>I am not shocked that EA organizations often haven't found consulting outside firms to be super helpful, but I am surprised by <i>how bad </i>these experiences seem to have been.</li></ol><blockquote><p>My personal experience has been that their normal customers have such different desires/incentives that their guidance to us feels wildly off base. HR people, for example, assume we are in an adversarial relationship with our employees and become confused when we want to e.g. share more of certain types of information with them. Similarly, we often don’t seem to be able to get on the same page about valuing integrity or transparency for their own sake, not just the appearance of such things.</p></blockquote><p>Three reactions: First, even if a lot of companies function in the way you describe, I assume there are a lot of non-profits that do <i>not </i>have adversarial relationships with their employees/donors? I also find it a bit implausible that EA organizations <i>uniquely </i>value integrity and transparency for their own sake (even if EA organizations do tend to place more of a premium on these things than other non-profits, which again, I think one could reasonably contest). Second, it seems like a good outside consultant could modify its approach in light of CEA saying \"hey, we value these things.\" I would assume that a critical part of the consultant's role is understanding an organization's specific values and goals—since doing so is paramount to, e.g., them being able to find an effective executive—and if they can't do this effectively, then presumably they're pretty bad at their jobs. Maybe I have too much faith in the free market, but I assume that if these external firms were charging a ton of money to be useless, organizations would stop relying on their services. And third, it seems possible for an external firm to a) not totally understand the importance of things like integrity and transparency to EA organizations but b) still be able to say what traits are important in an executive (in general), and help vet potential candidates (which it sounds like you maybe agree with).&nbsp;</p><p>&nbsp; &nbsp; &nbsp; &nbsp;3. A broader (more speculative) takeaway: my sense from your response is that EA organizations have, by and large, not figured out how to work effectively with outside consultants/firms. One might conclude that such efforts are doomed to fail because (some more nuanced version of) \"they don't get us.\" But an alternate conclusion one might draw is that it's hard to figure out how to work well with outside actors, and so there's a learning curve that needs to be climbed here, but EA organizations need to find a way to climb this learning curve, because a) a tiny fraction of the talented/knowledgeable/experienced people in the world are involved in EA b) the EA community has important blind spots. So even if we expect that consulting an outside firm on any given project isn't going to be super helpful to achieving the goals of that project (e.g., hiring a CEO), I'm still left thinking that EA organizations should err on the side of doing this, because it's important to figure out how to do this well, and that requires practice.&nbsp;</p>", "parentCommentId": "tsd3TBRzqqos24oSc", "user": {"username": "hobbes"}}, {"_id": "LSKjaRLaNbmFmnsK3", "postedAt": "2023-09-05T21:09:53.623Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>Max - thanks very much for sharing this comprehensive, candid, and transparent overview of the process. It all sounds very reasonable, reflective, and effective.&nbsp;</p><p>Just wanted to express my appreciation to you and the other members of the search team.&nbsp;</p><p>(PS I wish the search for university administrators was this open and honest!)</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "RjwHjopvj86FLKy4Q", "postedAt": "2023-09-16T22:44:09.991Z", "postId": "Bg6qxLGhsn7pQzHGX", "htmlBody": "<p>A hard thing here:\nFor any project where “learn to work with external partners and train them to work with us” might be a good goal, there is usually a clear, higher priority and time-sensitive outcome in play, like “Make a hire for this role.” The time trade-offs are real, so the lower-priority goal doesn’t happen.</p>\n<p>This may be the wrong long-term play.\nI am inclined to agree with you that more successful external partnerships would be  valuable, but I see why orgs take the more obvious win in the short-term.</p>\n", "parentCommentId": "zuNfod4qNhy8dewsL", "user": {"username": "nananana.nananana.heyhey.anon"}}]