[{"_id": "MdXwypKzjj9iGQHHg", "postedAt": "2024-01-07T14:09:55.298Z", "postId": "bGHyYbLJbZXFoysbk", "htmlBody": "<p>This is discussed under the \"argument from potential\" in ethics. One problem in that argument is if potential matters when babies have it, it seems like it should also matter when other things have it. For instance, a fertilized embryo, a man and woman in a room who could start making a baby, or even a pile of organic matter that, with the help of highly-advanced future technology, could be assembled correctly into a fully-functioning adult ((let's suppose we had such technology now: would we then think piles of organic matter are similarly important as existing people?)). Those things don't seem like they carry the same value as a person.</p><p>There's a separate question on whether it's good to make new happy people and add \"life years\" to the world's total. <i>Even if one thought this was the case</i>, it seems like more of a \"morality for global policy\" rather than \"morality for small-scale decisions.\" Unless you think individual humans have a duty to have children (assuming enough resources are available to make them reasonably happy), then it seems crazy inconsistent to think the added life years of a surviving baby make up for the total violation of a person's life goals. (Exception: If the adult person doesn't care about their life.) Besides, the view that it's important to bring new people into existence is controversial, even though many EAs believe it. (I wrote a post on population ethics <a href=\"https://forum.effectivealtruism.org/posts/dQvDxDMyueLyydHw4/population-ethics-without-axiology-a-framework\">here</a> that discusses more of it. The way I see it, this is a view individuals can have for \"What should be our global policy for the future?,\" but it's not some deep truth of ethics that everyone has to endorse.)<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "D4yXtJyt8aoEBqujZ", "postedAt": "2024-01-07T17:24:47.267Z", "postId": "bGHyYbLJbZXFoysbk", "htmlBody": "<p>Note that although this specific situation rarely arises, there are population ethics questions such as the relative value of 3-month-olds and 5-year-olds that are material when deciding how to give.</p>\n<p>GiveWell calls this question “moral weights” and has written about it (for example) <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/comparing-moral-weights\">in this blog post</a>.</p>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "K3Qzkge44F7RpeDuQ", "postedAt": "2024-01-10T08:29:13.231Z", "postId": "bGHyYbLJbZXFoysbk", "htmlBody": "<p>I mean I guess the problem is that commonsense morality can sort of contradict. I feel like most mothers would sacrifice themselves to save their babies (and this is not just some Harry Potter thing). Sure, it may indeed be due to hormones and not rationality. Still, one can argue from intuition that there must be a reason to value the lives of babies over just simple sperm.&nbsp;<br><br>I mean most people that support abortion would be horrified of infanticide.&nbsp;<br><br>I'm not sure of this, but baby-killing itself generally seems to be a worse crime than killing an adult (though I guess it may seem so due to the sheer unneccessariness of it).&nbsp;</p>", "parentCommentId": "MdXwypKzjj9iGQHHg", "user": {"username": "dstudioscode"}}, {"_id": "ymaLd6q75zsSqpehc", "postedAt": "2024-01-10T14:05:47.479Z", "postId": "bGHyYbLJbZXFoysbk", "htmlBody": "<p>Your \"most mothers\" example is confounded because mothers are related to their children. They wouldn't readily accept death if it meant that someone else's infant got to live.</p><blockquote><p>Still, one can argue from intuition that there must be a reason to value the lives of babies over just simple sperm.</p></blockquote><p>That speaks in favor of a gradual increase of intrinsic moral relevance as the infant becomes more aware of the world and its own point of view in it, forming life plans and so on.</p><p>I assumed that what we were talking about is whether an adult person's life is equally worth saving under triage conditions as an infant's. I don't think we're discussing whether adults should have different <i>legal protection</i> than infants.</p><p>Baby killing seeming worse than killing an adult: You might be right that some people have that intuition. Personally, I find both similarly intuitively horrifying, which, admittedly, somewhat goes to your point. There are many potential confounders like \"it's particularly bad to be abusive to beings who depend on you.\" Let's try to envision an example where the circumstances are similar. For instance, a mother with brain defect around rage shakes a baby too hard when she got overwhelmed with the difficulties of parenting. She deeply regrets it later. Or, a girlfriend with a similar brain defect around rage drives over boyfriend with a car after getting jealous for no good reason, and she also regrets it later. I think those are similarly tragic in what they say about the killer. However, if I had to assess \"In which circumstance was more that is of moral value lost directly?,\" I'd say in the boyfriend's case because he had not just sentience, but also life goals and (presumably) friendships.</p>", "parentCommentId": "K3Qzkge44F7RpeDuQ", "user": {"username": "Lukas_Gloor"}}]