[{"_id": "GcmchvvAsGPEi2inB", "postedAt": "2023-09-19T21:28:20.037Z", "postId": "bGzwWYfXgKqdurdmb", "htmlBody": "<p><strong>Executive summary</strong>: Anthropic has introduced a Responsible Scaling Policy (RSP) to manage risks associated with increasingly capable AI systems, and a Long-Term Benefit Trust (LTBT) to ensure that corporate governance decisions align with the long-term benefits of humanity.</p><p><strong>Key points</strong>:</p><ol><li>Anthropic's Responsible Scaling Policy defines safety levels for AI models, with stricter requirements at higher levels to manage catastrophic risks.</li><li>Anthropic will pause development if scaling outpaces ability to meet safety requirements, incentivizing solving key problems.</li><li>The Long-Term Benefit Trust helps align Anthropic's governance to its mission by granting a disinterested body authority over board selection.</li><li>The Trust will phase in its board control based on time and funding milestones.</li><li>The Trust structure aims to balance stockholder interests, public benefit, and long-term externalities in AI development.</li><li>The governance innovations are experiments intended for refinement based on experience.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "S3Fb94c9T7oQ2fhKQ", "postedAt": "2023-09-20T02:20:33.470Z", "postId": "bGzwWYfXgKqdurdmb", "htmlBody": "<p>Thanks very much for sharing this!</p><blockquote><p>The Anthropic board chose these initial Trustees after a year-long search and interview process to surface individuals who exhibit thoughtfulness, strong character, and a deep understanding of the risks, benefits, and trajectory of AI and its impacts on society. Trustees serve one-year terms and future Trustees will be elected by a vote of the Trustees.&nbsp;</p></blockquote><p>I am curious about the decision for one-year terms. Given that the board chooses its own successors, and no-one on the board is full-time, I worry that the search for successors will end up occupying a huge fraction of their time. Also, non-overlapping terms might mean a loss of institutional memory. Did you consider a staggered setup?</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "QGEpGmXmxY22MhBug", "postedAt": "2023-09-20T02:34:18.866Z", "postId": "bGzwWYfXgKqdurdmb", "htmlBody": "<p>An Anthropic staff member <a href=\"https://www.lesswrong.com/posts/6tjHf5ykvFqaNCErH/anthropic-s-responsible-scaling-policy-and-long-term-benefit?commentId=m5QqGivHwTKkEmZ9j\">says</a>:</p><blockquote><p>One year is actually the typical <i>term length</i> for board-style positions, but because members can be re-elected their <i>tenure</i> is often much longer. In this specific case of course it's now up to the trustees!</p></blockquote>", "parentCommentId": "S3Fb94c9T7oQ2fhKQ", "user": {"username": "zsp"}}, {"_id": "gjvjBYf2iDiTRgyHN", "postedAt": "2023-09-20T02:45:07.412Z", "postId": "bGzwWYfXgKqdurdmb", "htmlBody": "<p>Thanks for the explanation!</p>", "parentCommentId": "QGEpGmXmxY22MhBug", "user": {"username": "Larks"}}]