[{"_id": "QYCWFzdKkunfgWgWz", "postedAt": "2021-11-09T22:46:04.319Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>I got to read this before it got published, but I'm really happy to get the chance to read how you rate and structure your career opportunities.\nGenerally I wonder if there's a way to do a survey for employees in big tech companies and find methodically these \"do good\" teams.</p>\n", "parentCommentId": null, "user": {"username": "CBelle"}}, {"_id": "7e3hQHkYPKXLANmAc", "postedAt": "2021-11-10T03:07:08.344Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>Great Questions! One idea would be to help specific EAs become accredited investors (experienced investors in UK/Europe). Accredited Investors can join Angel Investment Networks and other exclusive communities that provide unique opportunities for high impact.<br><br>The specific idea of using Monday as a platform for ESG investors seems interesting. &nbsp;Especially if you can tailor it for evaluating non-public startups such as <a href=\"https://redetec.com/\">ReDeTec</a>, a plastics filament recycler</p>", "parentCommentId": null, "user": {"username": "--alex--"}}, {"_id": "NbSvuRstyNWQsWLBK", "postedAt": "2021-11-10T09:07:34.370Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>\"Accredited Investors can join Angel Investment Networks and other exclusive communities that provide unique opportunities for high impact.\"</p><p>&nbsp;</p><p>Can you expand on this, what kinds of opportunities are you thinking of? Funding startups that have potential to do good in an EA sense? Influencing high net worth individuals' donations? Making lots of money to donate?</p>", "parentCommentId": "7e3hQHkYPKXLANmAc", "user": {"username": "Leksu"}}, {"_id": "c5ezfxxhSBavAv5Z8", "postedAt": "2021-11-10T14:05:24.204Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<h3>How useful is it to help a large number of<a href=\"https://www.givingwhatwecan.org/charity-comparisons/\"><u> ineffective charities</u></a>?</h3><p>How to even approach this calculation?<br><br>====<br><br>The way I would probably approach the calculation is this:<br><br>- Roughly how effective is the average charity compared to GiveWell's top charities? 10%? 1%?&nbsp;<br>- What is the <strong>mean</strong> annual revenue of these charities? (Mean, not median, remember the power law)<br>- How many charities do I expect to be able to help with this?<br>- How much more effective do I think I can make them?<br><br>I'm not sure how to find out the answers, but that would be a way to approach it. Since the questions are difficult, it might be good to have three calculations - optimistic, average, and pessimistic for plugging in the variables.</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "6nCspTvGsrAnovksr", "postedAt": "2021-11-10T16:51:59.159Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>(Founder of Wave here, who employs Ben Kuhn who you linked to.)</p>\n<p>You should probably try to find early-stage projects locally that you can contribute to. If you find projects you like, you can make them succeed and it will be a rewarding experience. Don't index too heavily on expected EA impact early on -- it's worth considering whether the thing you're putting time into can be big/impactful someday, but I think it'll be better to just focus on things where you think you will resonate and can make a big difference to the project/company's success. Look specifically for team fit: you should enjoy working with the colleagues, but also complement their skills in a useful way.</p>\n<p>(I'm writing all this based on our experience hiring Ben -- I think he complements our founding/exec team's skills in a really unique way, and that's why Wave is so resonant for him.)</p>\n<p>If you can't do that or it doesn't satisfy, you should at least consider working remotely for Wave :). You won't make as much impact as Ben, but you will get to work on satisfying things for real people; depending on what it is that you like/don't like about remote work, you might get a lot of what you're looking for in social connection from our retreats (every couple of months you see teammates for a fairly intense week).</p>\n", "parentCommentId": null, "user": {"username": "lincolnq"}}, {"_id": "aCxfpwRRGczcKoQud", "postedAt": "2021-11-11T00:24:02.925Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>Based on your preferences, it seems like working on EA projects funded by grants might be your best bet, since you don't need to found a whole company or charity, and it can be done with a local team in Israel. Maybe there are existing EA charities with people working from Israel you could join, although I don't know the situation there well. I only know of EA Israel, and some animal groups like Animals Now (<a href=\"https://animalcharityevaluators.org/charity-review/animals-now/\">ACE review</a>, <a href=\"https://forum.effectivealtruism.org/posts/bxqMGCLNaz8Cbq7Yr/cost-effectiveness-analysis-of-a-program-promoting-a-vegan\">EA Israel review</a>) and plant-based or cultured meat startups.</p><p>You could check out <a href=\"https://funds.effectivealtruism.org/apply-for-funding\">what the EA Funds are looking to make grants to support</a> (also see past grants), and apply with a project in their scope. Maybe you can ask the managers if they have any fairly specific projects they'd like to fund, and apply with one such project.</p><p>I would also consider setting up an EA co-working space in Israel (or join an existing co-working space, EA or not) so you can more happily work remotely for an EA org from Israel.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "mybiQnkaPgyq65633", "postedAt": "2021-11-11T12:04:24.233Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>I agree this is a calculation that would produce a correct result, but it multiplies a lot of numbers that I'm highly unconfident in.</p><p>I assume there's some clever approach such as:</p><ol><li>Ignoring all the ~zero-impact charities.</li><li>Asking Givewell:<ol><li>How many kind-of-ok charities exist?</li><li>Did Givewell talk to ~10/~100 such charities? If so, do these charities need help with their tech at all? How important is that problem?</li><li>How many charities would I be able to reach? (This specifically is a B2B-sales question, where I have better priors)</li></ol></li></ol><p>There are other blind spots I might have.&nbsp;<br>I'll give you some examples that I've already thought of, but the point is that I assume there are more:</p><ol><li>If I help The Association of Pavement Sweepers (I just made them up) more efficient in raising funds and volunteers, will that be at the expense of better charities?</li><li>If I help charities advertise their ESG metrics<ol><li>Am I promoting a bad metric that is \"competing\" with better ones, such as QALYs (<a href=\"https://clearerthinkingpodcast.com/episode/076\">or something else</a>)?</li><li>Is this something that capitalizm would have handled anyway, since there is a strong financial incentive for it from the impact investing movement? <a href=\"https://www.bloomberg.com/opinion/newsletters/2019-11-11/money-stuff-esg-stocks-are-graded-on-a-curve\">Unclear</a>, but if so, I prefer pushing <a href=\"https://equilibriabook.com/\">the other</a> problems</li></ol></li><li>Could I nudge charities to do better impact evaluations? Maybe create a community where they help each other be more effective with their resources? (Seems hard)</li><li>The founder of Wave <a href=\"https://forum.effectivealtruism.org/posts/BH6uKrkdrHDKexmqn/give-me-career-advice?commentId=6nCspTvGsrAnovksr\">replied here</a> that maybe I'm focusing on impact too much, and considering remote-working too little</li><li>Maybe there is a specific \"class\" of charities that if I only help them, it is already easily worth it. Specifically, I'm thinking about:<ol><li>Advocating for governments to do different things. (Though, would I also help the \"wrong side\"?)</li><li>Meta organizations such as the world bank (though, I imagine they're really tidy already.. they must be, right?)</li><li>Disaster relief: Monday helped with an earthquake and with covid vaccinations. I think this is something they do regularly, even though they don't seem to consider it a focus right now.</li></ol></li></ol><p>I hope this paints the picture of why I see so much potential in getting outside advice on this. There are so many ways to approach the problem, and I totally might be thinking inside some kind of box without being aware of it. Of course, when it's time to make a decision, I'll make it with whatever uncertainty remains. So far I passed their technical interview, there are a few more steps in the process.</p>", "parentCommentId": "c5ezfxxhSBavAv5Z8", "user": {"username": "hibukki"}}, {"_id": "3X3cJgLNkhns5jNDk", "postedAt": "2021-11-11T12:05:19.755Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>All of the above. I went to the Angel Investors Ontario meeting yesterday and invited 5 founders to attend as guests. Only one was from EA; 2 were from Complexity Weekend. I introduced them to angels, VCs, someone who works for the Ontario Premier and someone who has met Obama multiple times.</p>\n<p>At the event, the head of Angel Investors Ontario interviewed the CEO of Sanofi and the Conservative Finance Minister for Ontario. The Liberal Federal Finance Minister / Deputy Prime Minister also presented (she is a Rockstar! I say that as someone who is about to renew my Conservative Party membership)</p>\n<p>I'm not sure if someone needs to run an RCT on this...</p>\n", "parentCommentId": "NbSvuRstyNWQsWLBK", "user": {"username": "--alex--"}}, {"_id": "8JD83J9p83XBBvhfn", "postedAt": "2021-11-11T12:24:04.641Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>TL;DR: I reached out, didn't hear back yet, thanks for this comment</p><hr><p>So the embarrassing truth is that I reached out to them years ago, they didn't get back to me, and I was left with some vague impostor syndrome about not being important enough for 80000 hours' time. I don't think I was really aware of this until your comment just now.</p><p>Following your comment, I looked back at the email exchange and it seems to have been a technical problem in their computer systems, not even a person rejecting me. OMG my brain over (or under?) thought this way too much. I hope some of my mentees will see this comment and remember that I'm human too.</p><p>So my first lesson is that maybe 80000 hours need technical help ;)</p><p>But also: In the last day of EAG, I talked to someone from the 80000 hours team. No concrete advice beyond \"the side projects sound good\", \"I can think bigger with some of them\", some surprisingly effective words of encouragement, and I didn't ask about Monday.</p><p>I emailed this person as soon as I posted this, I hope they'll get back to me.&nbsp;</p><p>I guess the takeaway here is that I should nudge them some more?</p>", "parentCommentId": "p7n8JRtkrzDn5PEpk", "user": {"username": "hibukki"}}, {"_id": "cvtfgnumvWnhCjRYS", "postedAt": "2021-11-11T13:12:56.144Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<h1>Working on EA projects funded by grants</h1><p>TL;DR: Yes. (Which?)</p><h2>Animal groups</h2><p>I'm already <a href=\"https://forum.effectivealtruism.org/posts/FkWHn6WaFGzrzqb9P/i-m-offering-free-coaching-for-software-developers-in-the-ea\">talking</a> to a very senior developer (20+ years of experience) who's done a lot of work with Animals Now and is interested to do more in the same/similar area (also climate change, if you hear about something! I have another eager developer for that too!), so if we'll find a good opportunity, he'd probably be the first to take it, I think.</p><p>Also, working on animal welfare is less close to my heart than meta/rationality/systematic causes. I know this might sound strange. But it's how my brain is wired, and I think there's an advantage in working on things that come easily to me.</p><h2>Projects that are already funded</h2><p>I agree this would be good, but I'll say this this happens not to be a limitation for me. I think I might even have an edge in being able to start early stage unfunded projects, without being dependent on grant makers having the capacity to evaluate them first.</p><p>The way I really think about this is like a startup, where I expect to show actual impressive relevant metrics before I go fundraising.</p><p>But maybe I'm mistaken. Maybe I should already fundraise for \"Effective Developers\"? Maybe it would at least elicit some unfiltered feedback from people who often evaluate such initiatives?</p><hr><h1>What the EA Funds are looking to make grants to support</h1><p>Going over their list:</p><h2>Animal welfare</h2><p>See the \"animal groups\" title above.</p><h2>Infrastructure: Access to talent</h2><p>This would be a good fit for me, but it seems like a lot of people are starting to work on it, and I'm somewhat involved in part of it (I'm very grateful for the people approaching me about this! This is close to my heart).</p><p>I'm considering focusing on a smaller niche where I think I have some extra good fit: Startups and Software Developers.</p><h2>Global health and development</h2><p>Not accepting applications. &nbsp;</p><p>Also, there are other reasons I probably wouldn't start a project here (such as, I could just work for Wave), unless it would be starting a mental health app with a specific approach that I don't understand why nobody else is doing (disclaimer: I didn't actually research this).</p><h2>Longtermism</h2><p>See <a href=\"https://forum.effectivealtruism.org/posts/BH6uKrkdrHDKexmqn/give-me-career-advice#EA___Improving_the_world\">this section</a>.</p><hr><h1>Co working space in Israel</h1><h2>Non EA workspace, like WeWork</h2><p>TL;DR: Not so good</p><p>I tried this when I was a freelancer. Note I'm an extroverted person who wears colorful cat shirts and who probably shares many common interests with the other founders and developers over there, but still the atmosphere was mostly each person has their own space. I did meet some nice people, but orders of magnitude less than I do in a regular job that has an office.</p><h2>EA workspace</h2><p>TL;DR: HELL YES!</p><p>I <a href=\"https://www.facebook.com/groups/EffectiveAltruismIsrael/posts/4234258186650078\">proposed this</a> [Hebrew link] ~3 months ago and there seems to be interest, I wonder if our community manager would be interested in pursuing this project, they'd probably be good at it.</p><p>I think this has the potential to free up Israelis to work remotely on way more impactful projects, if it's done right. And once we have a critical mass (which is the hard part), more and more people could join easily.&nbsp;</p><p>I'm not sure I could pull this off, the temptation to work at home \"just today\", everyday, would exist for everyone.</p><p>I wonder if</p><ol><li>Someone has already tried this</li><li>Some org would sponsor an experiment</li></ol>", "parentCommentId": "aCxfpwRRGczcKoQud", "user": {"username": "hibukki"}}, {"_id": "Ya3WaExDYBRvwLgn7", "postedAt": "2021-11-13T01:37:13.413Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>I'd be excited to see a career advising service helping tech EAs earning-to-give select, interview at, negotiate with, and read the equity terms of, top startups. I don't know you well (read: at all), but based on your profile on the Forum, I think it's plausible you'd be great at this.<br><br>I believe more EAs should transition from BigTech work to top startups based on the expected <a href=\"https://forum.effectivealtruism.org/posts/kGbHxYhfqttQZx2QD/should-earners-to-give-work-at-startups-instead-of-big\">earnings analysis here</a> (which I advised) and the <a href=\"https://forum.effectivealtruism.org/posts/ejaC35E5qyKEkAWn2/early-career-ea-s-should-consider-joining-fast-growing#comments\">career capital arguments here</a>.&nbsp;</p><p>I think this can be worth a fair amount of money and career capital in expectation for your advisees, and you can also leverage skills you build doing this into helping technical EAs transitioning to doing important software work for EA startups or ML safety projects.&nbsp;</p><p>More generally, 80000 Hours is very oversubscribed, and I'm excited for a future with (at least a few attempts at) doing career-specific coaching.&nbsp;</p><p>If you're interested in this, you may want to coordinate with Michael Dickens (or somebody else who understands startup equity) and the Training for Good people.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "mnKPdsztBQePwuDxz", "postedAt": "2021-11-16T21:58:54.351Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>Hey!</p><h1>Negotiation advice</h1><blockquote><p>I'd be excited to see a career advising service helping tech EAs earning-to-give select, interview at, negotiate with, and read the equity terms of, top startups</p></blockquote><p>I (A) <a href=\"https://forum.effectivealtruism.org/posts/FkWHn6WaFGzrzqb9P/i-m-offering-free-coaching-for-software-developers-in-the-ea\">do this</a> (except for the equity-terms part!), and (B) agree this is a really low hanging fruit, there is so much optimization that can be done in most job searches.&nbsp;</p><h2>Training for good</h2><p>I talked to them (to Steve) at EAG and we exchanged a few emails since, comparing our approaches. Thank you for the advice, indeed relevant.</p><h2>Equity terms:</h2><p>I don't read them since I'm not a lawyer and don't even know how those things work outside of Israel. I give my mentees my priors, and for the Israeli ones, I offer them to talk to a lawyer I trust (my lawyer. Though he does charge. I don't get percents or anything of course).</p><p>I don't know Michael Dickens [edit: Ah, he wrote the earning-to-give post], but if I could maybe refer people to him for reviewing equity terms, I think this would be useful</p><h1>Aiming for startups instead of BigTech</h1><p>I'm not convinced, and this is very relevant for me so I'd be really happy to discuss it [edit: I see you replied to some of it, thanks!].</p><p><a href=\"https://forum.effectivealtruism.org/posts/kGbHxYhfqttQZx2QD/should-earners-to-give-work-at-startups-instead-of-big?commentId=QKiesKA8tgmsQt8rC\">Here</a> is my main kind-of-objection, and <a href=\"https://forum.effectivealtruism.org/posts/kGbHxYhfqttQZx2QD/should-earners-to-give-work-at-startups-instead-of-big?commentId=RTTb8WurmrDMg3wj7\">here</a> are some thoughts about the financial calculations (though I defer to you/michael on anything financial).</p><p>I'm also curious to explore the Meta Options model, which I didn't yet.</p><p>&nbsp;</p><p>P.S</p><p>I am convinced enough to point people to the post. Also, calculations such as <s>you</s> he did there are really good tools/resources for me, just so you know I actually care about it</p>", "parentCommentId": "Ya3WaExDYBRvwLgn7", "user": {"username": "hibukki"}}, {"_id": "82yjGtninJgtyepwa", "postedAt": "2021-11-19T17:55:18.720Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>I would say that, given that you're already doing some projects in the EA &amp; software development space, that you should consider <a href=\"https://forum.effectivealtruism.org/posts/HCbfyHnsebJ9pDtWS/focusing-on-career-and-cause-movement-building\">building that network more comprehensively</a>.</p><p>&nbsp;</p><p>At the moment you are coaching, creating a volunteer board and listing impactful companies which is&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/ZnvE2i6E8hdQ7Y4cK/ecosystems-vs-projects-in-ea-movement-building\"> a few projects but you could build the ecosystem</a> for EA &amp; Software. This could be similar to what the <a href=\"https://www.eac-network.com/\">EA Consulting Network</a> is doing, with their recent hire of a full time person.</p><p>I think this would hit a few of your requirements of being meta, not earning to give, involves software knowledge, early stage project but not as stressful as a startup and with coaching/advising. Although it would involve remote work but that could be solved by having an EA Israel coworking space. Potentially this could also grow to more than 1 person if you're seeing signs of impact.</p><p>&nbsp;</p><p>Some things I think you could do as part of building the EA Software ecosystem.</p><ul><li>You could be the go to person when someone involved in software wants to get more involved in EA</li><li>The go to person when someone at an EA org wants to find software people or know more about the space</li><li>You could set up a mentorship network similar to WANBAM</li><li>You could have more in depth research on how to have impact in tech. 80,000 hours can only dedicate so much time and limited knowledge of the global tech ecosystem to this area, some of their <a href=\"https://80000hours.org/career-reviews/software-engineering/\">software articles haven't been updated since 2015</a></li><li>Newsletter updating people in EA &amp; software on job/volunteer opportunities, startup ideas, stories of impact</li></ul><p>&nbsp;</p><p>If this sounds potentially interesting let me know and we can chat in more depth about ways of making this happen.</p>", "parentCommentId": null, "user": {"username": "DavidNash"}}, {"_id": "NvfJkcwFc9DfWHhfW", "postedAt": "2021-11-20T19:47:33.424Z", "postId": "BH6uKrkdrHDKexmqn", "htmlBody": "<p>This sounds very interesting. I'm moving in that direction slowly</p>", "parentCommentId": "82yjGtninJgtyepwa", "user": {"username": "hibukki"}}]