[{"_id": "3mPwhqqZc7QnEztGg", "postedAt": "2024-03-14T10:42:57.409Z", "postId": "BHCjijbDnHJCkGB9n", "htmlBody": "<p>Thanks so much for this work! I think it’s high quality and useful. Some thoughts:</p><ul><li>I’m curious, why you are not also suggesting corporate campaigns against pet stores that sell feeder mice? Pet owners who shop there probably think of themselves as animal lovers so it might work. Is it because most feeder rodents are ordered online? Also, whether you campaign against pet stores or zoos, there might be a need to include third-party auditing in the commitment, just like it’s included in the&nbsp;<a href=\"https://betterchickencommitment.com/uk/policy/\"><u>Better Chicken Commitment</u></a>. If campaigns against zoos or pet stores were successful and attracted public attention, perhaps even legislative changes would eventually be feasible.</li><li>There might be a market for higher welfare feeder rodents. I was told that&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/pGwR2xc39PMSPa6qv/rodents-farmed-for-pet-snake-food\"><u>my 2019 article</u></a> on the issue that you mentioned was the 2nd most read on the Rethink Priorities website (that was years ago, probably no longer the case). I received multiple emails about it from non-EA snake owners, despite no outreach. This makes me think that some snake owners might care about feeder rodent welfare and might already feel some guilt about it. Unlike when dealing with processed meat used for food, snake owners have to deal with rodent carcasses, or even live mice, which might make it more difficult to ignore the fact that this was/is a sentient being.</li><li>Gosh, the stuff you observed during the breeder visit is just so cruel and sad</li><li>I wonder if a significant number of mice are also fed to other pets. E.g.,&nbsp;<a href=\"https://www.kiezebrink.co.uk/category/61-mice#:~:text=Frozen%20mice%20are%20suitable%20for,balanced%20diet%20as%20nature%20intended.\"><u>this website</u></a> claims “Frozen mice are suitable for a wide range of pets, most notably for snakes and other reptiles, as well as cats and birds of prey.”</li><li>If you get another chance to speak with feeder rodent industry professionals, I’d be interested in what they’d say is the average age of feeder mice and rats at slaughter. The scale of the problem depends on that quite a lot. The number of rodents killed per year might overstate the scale of the issue a bit because they seem to be slaughtered when they are just a few weeks old, or often even a few days old for pinkies.</li><li>Huh, I didn’t know that there was such a large-scale operation in Lithuania, which is where I’m from. I sent your article to someone who runs an animal advocacy org there.</li><li>It looks like you weren't paid by anyone to write this. If that's the case, I want to thank you even more. I'm amazed at how people in this community do stuff like that.</li></ul>", "parentCommentId": null, "user": {"username": "saulius"}}, {"_id": "d8QyRM5tXt72YQLwn", "postedAt": "2024-03-14T11:25:05.496Z", "postId": "BHCjijbDnHJCkGB9n", "htmlBody": "<p>This was a really great &amp; informative report; thanks for your work here.</p><p>You're almost certainly already aware, but just in case you're not (since AFAICT you didn't mention it directly) there's <a href=\"https://9475dbf4-555e-4808-9886-5f8ee815cc82.usrfiles.com/ugd/9475db_eb7241bc20dd485ea5a58b064a7ac7cf.pdf\">a CE report on this topic</a>!</p><p>(Edit: mentioning just because my first thought on reading this report was 'huh, I wonder if CE have considered recommending this idea to cofounders? If not, they probably should!')</p>", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "xXtSnvwSit7B2sZcA", "postedAt": "2024-03-14T13:54:07.384Z", "postId": "BHCjijbDnHJCkGB9n", "htmlBody": "<p><strong>Executive summary:</strong> This post provides an overview of the global feeder rodent industry, estimating 200-650 million rodents are farmed annually, and proposes two concrete ways to help improve their welfare: public pressure campaigns against zoos to enforce welfare standards on suppliers, and developing alternative sausage-based feeder products.</p><p><strong>Key points:</strong></p><ol><li>The feeder rodent industry is a large-scale, consolidated form of factory farming, with major producers in China, the US, and Europe.Welfare concerns include lack of space, shelter, and enrichment, as well as inhumane slaughter methods like live freezing of neonates.</li><li>An estimated 2-20% of feeder rodents are supplied to zoos, which could be pressured to enforce welfare standards on suppliers.</li><li>Developing sausage-based alternative feeder products could replace whole frozen rodents and reduce suffering.</li><li>Challenges include snake nutrition concerns, cost competitiveness, and triggering predatory feeding response.</li><li>The rise of in-ovo sexing may increase demand for feeder rodents, adding urgency to pursue these interventions.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "C56k3fQnFxFuEqb6n", "postedAt": "2024-03-14T21:25:44.493Z", "postId": "BHCjijbDnHJCkGB9n", "htmlBody": "<p>Thank you for writing this! I love rats and found this -- and especially watching the video of the rodent farm and reading your account of the breeder visit -- distressing and pitiful.</p>", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "SCCwdTozYbjQRoBX7", "postedAt": "2024-03-14T21:43:20.915Z", "postId": "BHCjijbDnHJCkGB9n", "htmlBody": "<p>This is great work on a really sad topic. Well done putting this together&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}]