[{"_id": "yBQzQCDoe3KgrsgWn", "postedAt": "2023-10-02T14:48:39.850Z", "postId": "bhrKwJE7Ggv7AFM7C", "htmlBody": "<p>Interesting post! In general, I think the field of computer security has lots of good examples of adversarial setups in which the party that can throw the most intelligence at a problem wins.</p><p>Probably not central to your main points, but on this:</p><blockquote><p>If we assume no&nbsp;<i>qualitative capability leaps</i> from a regular human to a skilled human hacker, then we can say something like ‘X humans with regular hacking capability will be able to replace one skilled human hacker’. The effect of this on the attack workload is to&nbsp;<i>increase it</i> - i.e, we’d need a&nbsp;<i>more capable system (</i>higher N,V, lower F<i>)&nbsp;</i>to execute the attack in the same calendar time.<strong> By ignoring the&nbsp;</strong><i><strong>skilled hacker v.s regular human</strong></i><strong> distinction, the analysis here considers a worst case scenario world.&nbsp;&nbsp;</strong></p></blockquote><p>I think there's at least one thing you're overlooking: there is a <i>lot</i> of variance in human labor, and hiring well to end up on the right side of that variance is really hard. 10x engineers are real, and so are 0x and -5x engineers and -50x managers, and if you're not careful when building your team, you'll end up paying for 10,000 \"skilled\" labor hours which don't actually accomplish much.&nbsp;<br><br>An AI comprised of a bunch of subagents might have vaguely similar problems if you squint, but my guess is that the ability to hire and fire relatively instantaneously, clone your most productive workers, etc. makes a pretty big difference. At the very least, the variance is probably much lower.<br><br>Another reason that I suspect 10,000 labor hours is on the high end for humans: practical offensive cybersecurity isn't exactly the most prestigious career track. My guess is that the most cognitively-demanding offensive cybersecurity work &nbsp;is currently done in academia and goes into producing research papers and proofs-of-concept. Among humans, the money, prestige, and lifestyle offered by a career with a government agency or a criminal enterprise just can't compete with the other options available in academia and industry to the best and brightest minds.</p>", "parentCommentId": null, "user": {"username": "Max H"}}, {"_id": "zD489tiYHg2nmvR7s", "postedAt": "2023-10-04T10:15:20.953Z", "postId": "bhrKwJE7Ggv7AFM7C", "htmlBody": "<p>Yep, the variance of human worker teams should definitely be stressed. It’s plausible that a super team of hackers might have attack workloads on the scale of 100s to 1000s of hours&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefemja35js7wp\"><sup><a href=\"#fnemja35js7wp\">[1]</a></sup></span>, whereas for lower quality teams, this may be more like 100,000s of hours.</p><p>Thinking about it, I can probably see significant variance amongst AI systems due to various degrees of finetuning on cyber capabilities&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefs75qpblx9xs\"><sup><a href=\"#fns75qpblx9xs\">[2]</a></sup></span>(though as you said, not as much variance as human teams). E.g: A capable foundational model may map to something like a 60th percentile hacker and so have attack workloads on the order of 10,000s of hours (like in this piece). A finetuned model might map to a 95th percentile hacker and so a team of these may have workloads on the scale of 1000s of hours.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnemja35js7wp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefemja35js7wp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Though 100s of hours seems more on the implausible side - I'm guessing this would require a very large team (100s) of very skilled hackers.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fns75qpblx9xs\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefs75qpblx9xs\">^</a></strong></sup></span><div class=\"footnote-content\"><p>And other relevant skills, like management</p></div></li></ol>", "parentCommentId": "yBQzQCDoe3KgrsgWn", "user": {"username": "Iyngkarran Kumar"}}]