[{"_id": "JLaiLxs7omBWuhHgp", "postedAt": "2023-05-31T11:10:10.893Z", "postId": "birs7oFGkCTkrD4x4", "htmlBody": "<p>Is it possible to edit the title so it says \"Deadline June 5th\" instead of \"Deadline 6/5\" as many people who could potentially be interested in this might look at the title and think the deadline was the 6th of May and thus scroll past the post? Most of the world uses the DD/MM/YY (sometimes also YY/MM/DD) format, so I would imagine that this small change could help a lot and attract more potential applicants.</p>\n<p>This seems like a really fantastic opportunity and it would be a great pity if some were to ignore it who otherwise would have been interested in applying simply because they misinterpreted the deadline as being the 6th of May instead of the 5th of June.</p>\n", "parentCommentId": null, "user": {"username": "Oisín Considine"}}, {"_id": "tbemFs6ogFcAJg6RD", "postedAt": "2023-05-31T11:40:06.091Z", "postId": "birs7oFGkCTkrD4x4", "htmlBody": "<p>The edit has been made! Thank you for helping me overcome my Americo-centric framework of the world. :)</p>", "parentCommentId": "JLaiLxs7omBWuhHgp", "user": {"username": "Constance Li"}}, {"_id": "wiJ2rwjQP2vnTQqQg", "postedAt": "2023-06-01T06:12:25.029Z", "postId": "birs7oFGkCTkrD4x4", "htmlBody": "<p>Thanks Constance!&nbsp;</p><p>Let me know if you're looking to apply and want to do something together. I have a few ideas around this area as someone that has worked in Sub Saharan Africa for 10+ years now, and actually wrote a small post around this subject (<a href=\"https://www.thegpi.org/p/large-language-models-for-development\">(1) Large Language Models for Development: Why Information Matters (thegpi.org)</a>)&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Arno"}}, {"_id": "fJrsJFNW9gvoNpHRC", "postedAt": "2023-06-01T11:18:34.889Z", "postId": "birs7oFGkCTkrD4x4", "htmlBody": "<p>Arno,<br><br>Thanks for your engagement and your past writing on LLM's and LDC's. I was not personally looking to apply, but if I have the right partner I would consider it. I have many thoughts about this topic in general too and would be happy to chat. I'll dm you my calendly.<br><br>I'm already getting a AI use-case brainstorming session together for animal advocates. Perhaps this can be done for global health/development as well. I recently went to a webinar by deeplearning.ai that demonstrated how to train 2 different LLM's in under 1 hour using a highly efficient tech stack. I think that the problem with outdated info that you mentioned in your blog post can easily be overcome by training up a targeted LLM with up to date information and then assessing it against benchmark data.&nbsp;<br><br>If you are interested, <strong>here is the full webinar:</strong> <a href=\"https://www.youtube.com/watch?v=eTieetk2dSw\"><strong><u>Building with Instruction-Tuned LLMs: A Step-by-Step Guide</u></strong></a> by Deep Learning AI<br><br>And here is a <strong>summary of the webinar </strong>I made using the following tech stack:<br><a href=\"http://otter.ai/\"><i><u>otter.ai</u></i></a><i> speech to text (STT) tool for transcribing --&gt; GPT3.5 for summarizing the large amount of transcribed text due to it's larger context window --&gt; Google docs for finding and replacing typos for transcribing errors like QLoRA --&gt; GPT 4 for summarizing on a more advanced level</i><br><br>~~start of AI content<br><br>The video demonstrated the process of building and fine-tuning two large language models (LLMs). It highlighted the importance of instruction tuning, which aligns the model with human expectations in terms of bias, truthfulness, toxicity, etc., and fine-tuning, which refines the model for specific tasks.Several tools and methods were mentioned for the fine-tuning process:</p><ul><li>Dolly 15k, a dataset with 15,000 high-quality human-generated prompt-response pairs.</li><li>Open Llama, a commercial language model that can be fine-tuned.</li><li>QLoRA, a fine-tuning method that reduces the model's complexity, and is useful for tasks with lower dimensions.</li><li>The supervised biometric tuning trader library, a tool that facilitates the fine-tuning process.</li><li>They also talked about the use of quantization, which reduces the size of weight matrices, optimizing computing resources. This is particularly useful when using limited resources such as Google Colab, which was mentioned as a viable platform for training these models.</li><li>Two methods of fine-tuning were discussed: supervised and unsupervised. Supervised fine-tuning involves using clearly labeled instructions to train the model, while unsupervised fine-tuning allows the model to learn without specific targets or labels. Both methods have their advantages and drawbacks: supervised fine-tuning requires more time to organize the dataset, while unsupervised fine-tuning can be done faster.</li><li>The presenters demonstrated the process of fine-tuning using both real and synthetic data. Synthetic data, generated by GPT-4, was used to demonstrate the process of fine-tuning a model for generating marketing emails.</li><li>The webinar concluded with the reminder to continuously monitor metrics and evaluate the performance of the models for specific tasks, emphasizing that building LLMs can be done by anyone without needing vast computational resources, especially with tools like QLoRA. They provided a GitHub repo for resources and examples for prompt engineering and fine-tuning.</li></ul><p>This instructional video demonstrated the value of building and fine-tuning Large Language Models, and how this can be achieved even with limited resources. It provides a comprehensive guide on how to approach this complex task, and offers insights on optimizing performance and efficiency.<br><br>~~end of AI content<br><br>Please note that I have no tech background whatsoever and only recently started seriously diving into AI 1 month ago so any errors in phrasing or concepts is a result of me still coming up on the learning curve. If anyone has any corrections to the stuff I said here, PLEASE let me know!</p>", "parentCommentId": "wiJ2rwjQP2vnTQqQg", "user": {"username": "Constance Li"}}]