[{"_id": "t8phgH9RC5CKpKFeb", "postedAt": "2024-02-18T01:49:36.676Z", "postId": "bJCgKPXG6H3augQpx", "htmlBody": "<p>You raise some minor objections but I think the biggest problem with charter cities (apart from the lack of empirical evidence of their effectiveness<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefd6f9qbc1z5r\"><sup><a href=\"#fnd6f9qbc1z5r\">[1]</a></sup></span>) is the <a href=\"https://en.wikipedia.org/wiki/Free-rider_problem\">free-rider problem</a>. Society uses taxes to invest in common goods such as education, healthcare, research... If rich people use these common goods to generate their wealth, but then once it's time to start paying their taxes, opt to create a tax haven charter city instead, we will have an underinvestment in these public goods and we'll get a race to the bottom. For an eventual endpoint of this race you can look at the old company towns, or worse, slave plantations.</p><p>Similarly, while this system disincentivizes creating common goods, it also <i>incentivizes</i> destroying certain common goods. For example, we already have great difficulty getting existing countries to act on climate change. Imagine that rich people could just create a new city without any laws against pollution/greenhouse gases; you'd get another race to the bottom. You can construct a similar scenario for any type of <a href=\"https://en.wikipedia.org/wiki/Externality\">negative externality</a>.</p><p>Of course this is only what would happened were they able to be freely created. In reality they will probably never even get to the stage where they can do much of anything, including damage, because even starting one is fraught with <a href=\"https://devpolicy.org/why-charter-cities-have-failed-20190716/\">political problems</a>. (For more information, see the linked rethink priorities report).</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnd6f9qbc1z5r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefd6f9qbc1z5r\">^</a></strong></sup></span><div class=\"footnote-content\"><p><a href=\"https://rethinkpriorities.org/publications/intervention-report-charter-cities\">https://rethinkpriorities.org/publications/intervention-report-charter-cities</a></p></div></li></ol>", "parentCommentId": null, "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "99eGiPDJjuLoYoqeJ", "postedAt": "2024-02-18T19:04:05.226Z", "postId": "bJCgKPXG6H3augQpx", "htmlBody": "<p>There are definitely a lot of examples of places where some rich people wanted to try to create a kinda dumb, socially-useless tax haven, and then they accomplished that goal, and then the resulting entity had either negative impact or close-to-zero impact on the surrounding area. (I don't know much about Monaco or the Cayman Islands, but these seem like potentially good examples?) &nbsp;But there have also been times when political leaders have set out to create sustained, long-term, positive-sum economic growth, and this has also occasionally been achieved! &nbsp;(Dubai, South Korea, Guangzhou... I'm not as familiar with the stories of places like Rwanda or Botswana or Bangladesh, but there are a lot of countries which are trying pretty hard to follow <a href=\"https://www.noahpinion.blog/p/do-poor-countries-need-a-new-development\">a kind of best-practices economic development playbook</a>, and often seeing decent results.)</p><p>Both these phenomena predate the \"charter cities\" concept... as I understand it, the goal of orgs like the Charter Cities Institute is not to blindly cheerlead the creation of new cities of all kinds (as we mention in the video, lots of new cities are being built already, across the rapidly-urbanizing global South), but rather to encourage a specific model of development that looks more like the Dubai / South Korea / etc story, rather than simply building more cities as relatively useless tax-havens, or small and limited SEZs that won't be able to build their own economic momentum, or as mere infrastructure projects with no economic/legal reform aspect.</p><p>I could definitely see myself agreeing with a criticism like \"Sure, charter cities advocates do a LITTLE bit of work to avoid accidentally letting their ideas get used as an excuse to actually create useless tax havens, but actually they need to do a LOT MORE work to guard against this failure mode\". &nbsp;Right now I guess I feel like I don't know enough about the status of specific projects to confidently identify what exact mistakes various charter-city groups are making. &nbsp;But we did try to allude to this failure mode in the video when we talked about Paul Romer's complaints about the Honduras charter cities law.</p><p>&nbsp;</p><p>Re: the idea that creating more competition can lead to more good things, but also makes it harder to coordinate to prevent negative externalties -- yup, this is definitely something that I think about. &nbsp;I tend to think that since there are already almost 200 countries in the world, coordination on the most important topics -- stuff like nuclear nonproliferation, the ongoing global moratorium on slavery, international agreements about climate or potentially soon about AI -- already has to deal with lots of competing stakeholders, and hopefully won't be impeded too much by adding some charter cities to the mix. &nbsp;(This is one area where it definitely helps that, at the end of the day, charter cities ultimately lack top-level national sovereignty!) &nbsp;I think charter cities in particular have a lot of potential benefits that could even help with these risks, namely by helping pioneer new styles of governance / regulation / institutions that could find better ways of dealing with some of these problems. &nbsp;Nevertheless, I agree it's a real trade-off... we're actually working on a draft script about \"<a href=\"https://80000hours.org/problem-profiles/risks-of-stable-totalitarianism/\">risks of stable totalitarianism</a>\" at RationalAnimations, and in that video we're planning to spend a lot more time talking about a similar tradeoff space. &nbsp;It's obviously extremely helpful to have global coordination / relatively unified world governance to solve important problems, so the best ways of reducing stable totalitarianism risk are things like differential technological development, or maybe influencing cultural norms or etc, not just decentralizing stuff, since blindly decentralizing stuff makes coordination harder!</p>", "parentCommentId": "t8phgH9RC5CKpKFeb", "user": {"username": "Jackson Wagner"}}, {"_id": "onByEMChJwbK6uqap", "postedAt": "2024-02-19T19:01:36.314Z", "postId": "bJCgKPXG6H3augQpx", "htmlBody": "<p><strong>Executive summary</strong>: Charter cities are semi-autonomous urban areas designed from scratch with new rules and institutions modeled on successful developed countries. They aim to boost economic growth and could inspire wider reforms.</p><p><strong>Key points</strong>:</p><ol><li>Economic growth has lifted billions out of poverty, but developing countries often struggle with poor institutions.</li><li>Charter cities are designed and governed independently within a country to have business-friendly rules.</li><li>They face political obstacles, but could drive growth and inspire national reforms.</li><li>Benefits include governance competition, policy experimentation, and spreading best practices.</li><li>If charter cities succeed, the model could spread like democracy did centuries ago.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "rinFvjGtqY2qo6a3A", "postedAt": "2024-02-21T16:16:55.611Z", "postId": "bJCgKPXG6H3augQpx", "htmlBody": "<p>I think that's an interesting and very open-minded reply. But I think the problem with the proposed model in practice isn't <i>just</i> that competition limits the ability to coordinate to prevent negative externalities, it's that the specific type of competition that \"charter cities\" are designed to stimulate (making undeveloped land in a poor country with severe governance problems into an attractive opportunity for business investment) is naturally geared towards <i>lower taxes than elsewhere </i>because it's one of the few things they can credibly commit to. Pretty much everyone agrees that \"better institutions\" matter to economic development, but good institutions are composed of people and culture and stability, and a startup entity with no existing infrastructure, limited sovereignty and a problematic parent country doesn't have any of that. What it can offer is \"really low taxes\". This also tends to be the carrot for the governments setting up the zones (the Honduran government doesn't really have an interest in demonstrating that it's doing a terrible job of regulating, but Prospera's plans to pay them a very small percentage of some expat millionaires' income sounded like a good deal at the time. Same logic as the tax havens). So the \"race to the bottom\" dynamics would exist even if the intellectual and financial core of the movement was considerably less libertarian.</p><p>I agree there's plenty of potential value for humanity in studying what went well in Singapore and Dubai and the Guangdong SEZs that might actually be replicable, but one thing they definitely don't have in common is being set up by foreigners as greenfield projects to explore the regulations and city planning that most suit them. In that respect, Itana as a project set up by Nigerians with the stated goal of boosting Nigeria might be more interesting, but a quick glance suggests that<a href=\"https://www.itana.africa/faq/taxation\"> generous tax exemptions</a> are the real draw there too. And Prospera's low and regressive tax rates and corporate appointees' veto over elected candidates' decisions don't really seem like evidence-based development hypotheses for the Honduras worth testing. Having some wealthy foreigners around will create some local jobs, as in all the other \"socially-useless tax havens\" and generic holiday resorts and it looks <i>really pretty</i> but it's notable that the regulations its founders are publicly critiquing aren't Honduran ones (apart from the tax). The reason the rest of the Honduras isn't characterised by \"modern, eco-friendly\" Zahra Hadid-designed architecture has nothing to do with US-style zoning laws which aren't present in the rest of the Honduras or most of the rest of the world.</p><p>Admittedly Romer only proposed charter cities in 2009, but the relative abundance of \"socially useless\" tax havens and SEZs and primarily extractive colonies set up by foreign investors throughout history isn't coincidental; its the default model. And having Prospera Inc as an example is particularly unhelpful as it doesn't really seem to be deviating from that: having lost the support of Romer, local people and the national government <a href=\"https://www.prospera.co/news/10-775-billion-claim-filed-against-government-of-honduras\">it's currently threatening to sue them for around the total annual Honduran govt budget </a>based on theoretical profits its investors are supposed to make if it continues. Hard to imagine anything less altruistic (or likely to inspire a resolution to the endemic corruption in the Honduras) than foreign investors threatening to bankrupt a developing country for attempting to repeal their sweetheart tax deal a predecessor forced through after kicking four objectors off the Supreme Court.&nbsp;</p>", "parentCommentId": "99eGiPDJjuLoYoqeJ", "user": {"username": "David T"}}]