[{"_id": "55oc8JzNWQoSmY5k7", "postedAt": "2024-02-10T09:23:23.455Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Small question: Do you want anyone to fill in the form or only people working for EA related organisations?</p>", "parentCommentId": null, "user": {"username": "Jeroen De Ryck"}}, {"_id": "zMm2ty9WL3d5vHkz9", "postedAt": "2024-02-10T13:00:13.729Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Thanks for asking, Jeroen! From my perspective, everyone is welcome to fill the form. Then people can specify the name of their organisation, just whether it is aligned with effective altruism or not, or none of these.</p>\n", "parentCommentId": "55oc8JzNWQoSmY5k7", "user": {"username": "vascoamaralgrilo"}}, {"_id": "CAFyAZiJzx9wpuzzA", "postedAt": "2024-02-10T14:04:36.268Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>There is some nuance to the case that seems to get overlooked in the poll. I feel completely free to express opinions in a personal capacity that might be at odds with my employer, but I also feel that there are some things it would be inappropriate to say while carrying out my job without running it by them first. It seems like you're interested in the latter feeling, but the poll is naturally interpreted as addressing the former.</p>\n", "parentCommentId": null, "user": {"username": "Derek Shiller"}}, {"_id": "cMjepeCXCJJiJJ4Yp", "postedAt": "2024-02-10T14:14:23.172Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>One thing I think missing from the form IMO -- there can be many forms of pressure. Those include pressure not to expressing views that dont align with the organization's, pressure not to express controversial views, and pressure not to express one's own personal views in domain-related fields at all.</p>\n<p>You seem to be mainly focused on the first type, but the second and the third types often cause or imply the first. I suspect that what to do about a reluctance will differ on whether it is fundamentally of the first, second, or third types. But if I filled out the survey, I don't think the results would convey that my non-EA org doesn't really want personal commentary on job-relevant issues at all (whether it diverges from the party line or not).</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "oAdqZF9bcDgHhxihH", "postedAt": "2024-02-10T16:13:28.048Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Thank you, Vasco, for this, and also for the way you went about this.&nbsp;</p><p>Transparent discussions around any issue are important to have and generally helpful, especially when motivated by truth-seeking and creating a better world.</p><p>It is something to be generally encouraged and not to limit or curtail.&nbsp;</p><p>As you have yourself discovered, we are quite willing to engage in such conversations at ALLFED (on both personal and organisational level). You have suffered no repercussions for voicing not-quite-aligned opinions and, indeed, stimulated a whole bunch of healthy debates.</p><p>It is good to acknowledge that such conversations are rarely easy and usually uncomfortable. But the ability to gracefully engage in the difficult and the uncomfortable is in itself something to aspire to and in itself something of a measure of personal and organisational maturity.</p><p>In such conversations, a lot depends on the organisations’ - and one’s managers’ - willingness and ability to listen and to be disagreed with, and a lot also depends on the manner in which such issues are brought up.&nbsp;</p><p>Speaking on behalf of ALLFED and with regard to this particular post, we appreciated the heads-up and not being surprised by it. This simple (?) act of care and courtesy can now, in turn, further facilitate conversations, and help build trust in everyone’s good will, and also in our collective ability and competence to have difficult conversations (on whatever subject).&nbsp;</p><p>Personally - and here comes my “personal opinion” piece - I think that periodic shake-ups to any status quo are generally healthy and necessary for growth. I appreciate your courage to pursue your truth, especially taken your awareness that this is not “how things normally are done.”&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sonia_Cassidy"}}, {"_id": "AQ7WY3n4su7fmbepg", "postedAt": "2024-02-10T20:05:37.027Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Thanks, Sonia, I appreciate the way you handled the situation too!</p>", "parentCommentId": "oAdqZF9bcDgHhxihH", "user": {"username": "vascoamaralgrilo"}}, {"_id": "NeaMpaQaMpxMhBZbp", "postedAt": "2024-02-10T20:11:34.331Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Thanks for commenting, Derek!</p><blockquote><p>It seems like you're interested in the latter feeling, but the poll is naturally interpreted as addressing the former.</p></blockquote><p>I think both the types of pressure you mention are interesting. Feel free to elaborate on your experience in the answer to the question \"What is your experience?\".</p>", "parentCommentId": "CAFyAZiJzx9wpuzzA", "user": {"username": "vascoamaralgrilo"}}, {"_id": "mBaH4qSCgsQn7kzHS", "postedAt": "2024-02-10T20:14:32.655Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Nice points, Jason!</p><blockquote><p>But if I filled out the survey, I don't think the results would convey that my non-EA org doesn't really want personal commentary on job-relevant issues at all (whether it diverges from the party line or not).</p></blockquote><p>Feel free to elaborate on your experience in the answer to the question \"What is your experience?\".</p>", "parentCommentId": "cMjepeCXCJJiJJ4Yp", "user": {"username": "vascoamaralgrilo"}}, {"_id": "8qvA5CegZ8mCsaWKy", "postedAt": "2024-02-10T20:34:09.896Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>As a government employee, I have a duty to speak candidly internally and not to share restricted information externally. I suspect most organisations have weaker but similar norms about the difference between how you speak to colleagues and externals.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "oNm9d9MDcxp2t3xkC", "postedAt": "2024-02-10T21:32:47.792Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Thanks for sharing, Kirsten!</p>", "parentCommentId": "8qvA5CegZ8mCsaWKy", "user": {"username": "vascoamaralgrilo"}}, {"_id": "cu5axfTwbns9n5779", "postedAt": "2024-02-10T22:14:42.271Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Thanks for the context, Juan!</p><blockquote><p>In <a href=\"https://forum.effectivealtruism.org/posts/SZZdYwYvkJjus2vGp/increase-in-future-potential-due-to-mitigating-food-shocks\">this post</a> he built a model that estimates that <strong>preventing people from starving</strong> in close to half the countries of the world after a food shock <strong>would be net negative</strong> for the long-term future.</p></blockquote><p>I no longer endorse the methodology of that post. Currently, I think:</p><ul><li>The nearterm extinction risk from nuclear war is so low that it is better to assess interventions which aim to decrease famine deaths in a nuclear winter based on standard cost-benefit analysis (<a href=\"https://forum.effectivealtruism.org/topics/cost-benefit-analysis\">CBA</a>), where saving lives is assumed to be good.</li><li>From a neartermist perspective, one can assume saving lives is good despite the <a href=\"https://forum.effectivealtruism.org/posts/T3P4oX6F8tMh4h55s/the-meat-eater-problem\">meat eater problem</a>.</li></ul><p>I plan to post about both of the above in the coming weeks or months.</p><blockquote><p>Which, in his defense, is <i>technically not exactly</i> advocating for genocide.</p></blockquote><p>I have changed my mind about many things, but I have always strongly opposed killing people. Deciding not to save statistical lives is very different from killing people:</p><ul><li>By donating 10 % of one's income to <a href=\"https://www.givewell.org/charities/top-charities\">GiveWell's top charities</a>, which save a life for around 5 k$, one could save many lives through one's career.</li><li>However, not doing the above is not as bad as being a serial killer.</li></ul><p>I also find it interesting that many people support the continuation of wars, thus plausibly increasing deaths, while claiming that can be good longterm (e.g. by supposedly preventing authoritarian countries from gaining power). I generally oppose supporting the continuation of wars based on the simple heuristic that killing people is very bad on priors (<a href=\"https://forum.effectivealtruism.org/posts/rPFzhhmjip8FyavSh/bryan-caplan-on-pacifism\">relatedly</a>).</p>", "parentCommentId": "S5nYKsB2RRWgae7Np", "user": {"username": "vascoamaralgrilo"}}, {"_id": "QMge2bjadrGsRjzJG", "postedAt": "2024-02-10T22:42:13.027Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Sorry, did this always say externally? Maybe I just need better reading comprehension!</p>\n", "parentCommentId": "oNm9d9MDcxp2t3xkC", "user": {"username": "Khorton"}}, {"_id": "YDT7uowHxDccAAFbL", "postedAt": "2024-02-10T22:47:59.161Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>I have not changed the text since I posted.</p>", "parentCommentId": "QMge2bjadrGsRjzJG", "user": {"username": "vascoamaralgrilo"}}, {"_id": "5RrAk4SPjxvCK8TKc", "postedAt": "2024-02-10T22:48:47.095Z", "postId": "BjqQqrgZKeDiusEZA", "htmlBody": "<p>Okay, sorry for misreading, the poll makes much more sense now! I've edited the first part of my comment at it doesn't make much sense</p>\n", "parentCommentId": "YDT7uowHxDccAAFbL", "user": {"username": "Khorton"}}]