[{"_id": "9YT3rk7heRE6vcwu7", "postedAt": "2018-01-30T02:42:29.443Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>Agree. We might ask: why do we care about scale in the first place? Presumably because, in many cases, it means our efforts can help more. But in cases where larger scale does not mean that our efforts can help more (because we cannot help beyond a certain scale), we should not care about the larger scale of the problem.</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "qw9feuwKuWkp6i72T", "postedAt": "2018-01-30T12:14:47.925Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>[Writing personally]\nThis post seems to argue (at least implicitly) that scale is bad if it is the only metric that is used to assess a cause area or intervention. I think this is clearly correct. </p>\n<p>But I don't think anyone has used scale as the only metric: 80,000 Hours very explicitly modify it with other factors (neglectedness, solvability), to account for things like the &quot;bottlenecking&quot; you discuss.</p>\n<p>There's a separate thing you could mean, which is &quot;Scale, neglectedness, solvability is only one model for prioritisation. It's useful to have multiple different models for prioritising. One alternate model is to assess what the biggest bottleneck is for solving a problem.&quot; (Note that this does not really support the claim that scale is misused: it's just that other lenses are also useful.)</p>\n<p>I respect the inclination to use multiple models, and I think that thinking in terms of bottlenecks is useful for e.g. organizational prioritization. I think it's harder to apply to cause prioritization because we face so many problems and potential solutions that it's hard to see what the bottlenecks are. It may be useful for prioritizing how to use resources to pursue an intervention, which seems to be how you are mostly using it in this case. </p>\n<p>Overall, I worry that your title doesn't really reflect what you show in the text. </p>\n", "parentCommentId": null, "user": {"username": "Maxdalton"}}, {"_id": "r7Pec8euNi4eHvaj2", "postedAt": "2018-01-30T18:33:33.852Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>I didn't read the post as meaning either &quot;scale is bad if it is the only metric that is used&quot; _or_ &quot;Scale, neglectedness, solvability is only one model for prioritisation. It's useful to have multiple different models....&quot;</p>\n<p>When looking at scale in a scale, neglectedness, tractability, framework, it's true that the other factors can offset the influence of scale. e.g. if something is large in scale but intractable, the intractability counts against the cause being considered and at least somewhat offsets the consideration that the cause is large in scale. But this doesn't touch on the point this post makes, which is that looking at scale itself as a consideration, the 'total scale' may be of little or no relevance to the evaluation of the cause, and rather 'scale' is only of value up to a given bottleneck and of no value beyond that. I almost never see people talking of scale in this way in the context of a scale, neglectedness, tractability, framework: dividing up the total scale into tractable bits, less tractable bits and totally intractable bits. Rather, I more typically see people assigning some points for scale, evaluating tractability independently and assigning some points for that and evaluating neglectedness independently and assigning some points for that. </p>\n", "parentCommentId": "qw9feuwKuWkp6i72T", "user": {"username": "David_Moss"}}, {"_id": "ng2w8HH73GXy3fDZL", "postedAt": "2018-01-30T19:31:49.448Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>You've scooped me! I've got a post on the SNT framework in the works. On the scale bit:</p>\n<p>The relevant consideration here seems to be systemic vs atomic changes. Former affects all of the cause, or has a chance of doing so. Latter just affects a small part with no further impacts, hence 'atom'. Example of former would be curing cancer, example of latter would be treating one case of it.</p>\n<p>Assessing the total scale of a cause is only relevant if you're calculating the expected value of systemic interventions. I generally agree it's a mistake to force people to size up the entire cause - as 80k do, for instance - because it's not necessary if you're just look at atomic interventions.</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "gK47pkHm64rNbzqem", "postedAt": "2018-01-30T20:27:33.177Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>I read this the same way as Max. The issue of cost to solve (eg) all cases of malaria is really tractability, not scale. Scale is how many people would be helped (and to what degree) by doing so. Divide the latter by the former, and you have a sensible-looking cost-benefit analysis, (that is sensitive to the 'size and intensity of the problem', ie the former). </p>\n<p>I do think there are scale-related issues with drawing lines between 'problems', though - if a marginal contribution to malaria nets now achieves twice as much good as the same marginal contribution would in 5 years, are combatting malaria now and combatting malaria in five years 'different problems', or do you just try to average out the cost-benefit ratio between somewhat arbitrary points (eg now and when the last case of malaria is prevented/cured). But I also think the models Max and Owen have written about on the CEA blog do a decent job of dealing with this kind of question.</p>\n", "parentCommentId": "r7Pec8euNi4eHvaj2", "user": {"username": "Arepo"}}, {"_id": "DJZhB5ChaJCoKBpTi", "postedAt": "2018-01-31T01:14:07.118Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>Do people really think of scale as a bottleneck? I take this article to mean &quot;maybe scale isn't really important to think about if you're unlikely to ever reach that scale&quot;. </p>\n<p>Perhaps scale could be thought as the inverse of the diminishing returns rate (e.g., more scale = less diminishing returns = more ability to take funding). This seems useful to think about to me.</p>\n<p>Maybe the argument should be that when thinking about scale, neglectedness, and tractability, we should put more emphasis on tractability and also think about the tractability of attracting funding / resources needed to meet the scale?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "PRJqNmZHYoLNMzCcn", "postedAt": "2018-01-31T14:44:59.245Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>For an atomic intervention, the relevant scale is the amount of good that can be done by a given amount of money, the relevant tractability is whether there is good evidence that the intervention works, and the relevant neglectedness is room for more funding. (This is the <a href=\"https://www.givewell.org/how-we-work/criteria\">GiveWell framework</a>.)</p>\n<p>For a systemic intervention, the relevant scale is the amount of good that can be done by solving the problem, the relevant tractability is how much of the problem would be solved (in expectation) by increasing the resources going towards it by X%, and the relevant neglectedness is the amount of resources it would take to increase by X% the amount of resources devoted to the problem. (If there are increasing marginal returns or diminishing marginal returns, then X should be chosen based on the amount that the prospective donor/prospective employee would increase resources. If there are constant marginal returns, X can be set based on what would make it easier to predict how much of a problem would be solved (e.g. choosing a 50% increase even though your donation would only amount to a 0.1% increase because it's easier to get a sense of how much of a problem would be solved by a 50% increase). (This is the <a href=\"https://80000hours.org/articles/problem-framework/\">80,000 Hours framework</a>.)</p>\n<p>When EAs discuss scale, they generally mean scale in the sense that the term is used for systemic interventions (i.e. the scale of the problem, not the scale of the good the intervention would do). When EAs discuss tractability, they generally mean tractability in the sense that the term is used for atomic interventions (i.e. whether the intervention would be successful, not how much of the problem it would solve in expectation). EAs should avoid mixing and matching scale and tractability in this way.</p>\n<p>See my previous comment <a href=\"http://effective-altruism.com/ea/1ge/against_neglectedness/cj7\">here</a> for a lengthier discussion of this issue.</p>\n", "parentCommentId": "ng2w8HH73GXy3fDZL", "user": {"username": "RandomEA"}}, {"_id": "kiEX9sqDuteGd3tHN", "postedAt": "2018-02-02T18:20:34.455Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>Your argument does not suggest that there is a problem with the commonly used conception of scale, but rather with how it is combined with tractability and neglectedness. Thus, it does not support the claims made in the main piece. </p>\n", "parentCommentId": "r7Pec8euNi4eHvaj2", "user": null}, {"_id": "wFgLPzD95Z4HFaG3j", "postedAt": "2018-02-03T00:43:07.432Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>I disagree on both counts. I think my comment is recapitulating the core claims of the main piece (and am pretty confident the author would agree). </p>\n<p>In my comment I mention the total S/T/N framework only because MaxDalton suggested that when properly viewed within that framework, the concerns with 'scale' Joey raised, don't apply. I argued that that Joey's concerns apply <em>even if</em> you are applying the full S/T/N framework, but I don't think they apply <em>only</em> if you are applying the full framework.</p>\n", "parentCommentId": "kiEX9sqDuteGd3tHN", "user": {"username": "David_Moss"}}, {"_id": "7uB45v8u9u4ScBATL", "postedAt": "2018-02-03T12:07:08.711Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>OK, but then the issue is problem individuation, not the conception of scale used.</p>\n", "parentCommentId": "wFgLPzD95Z4HFaG3j", "user": null}, {"_id": "GDXaXJHTPoo2mfEJd", "postedAt": "2018-02-04T21:08:38.710Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>Thanks, David. Your interpretation is indeed what I was trying to get across.</p>\n", "parentCommentId": "r7Pec8euNi4eHvaj2", "user": {"username": "Joey"}}, {"_id": "WqhtsxBnq5c9zzfTT", "postedAt": "2018-02-10T03:36:15.171Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<p>Quick comment: note that you can apply INT to any fraction of the problem (1% / 10% / 100%). The key is just that you use the same fraction for N and T as well. That's why we define the framework using &quot;% of problem solved&quot; rather than &quot;solve the whole problem&quot;.\n<a href=\"https://80000hours.org/articles/problem-framework/\">https://80000hours.org/articles/problem-framework/</a></p>\n<p>If you run into heavily diminishing returns at the 10% mark, then applying INT to 10% of the problem should yield better results.</p>\n<p>This can mean that very narrowly defined problems will often be more effective than broad ones, so it's important to compare problems of roughly the same scale. Also note that narrowly defined problem areas are less useful - the whole point of having relatively broad areas is to build career capital that's relevant to more than just one project.</p>\n<p>Finally, our overall process is (i) problems (ii) methods (iii) personal fit. Within methods you should think about the key bottlenecks within the problem area, so it partly gets captured there. Expected impact is roughly the multiple of the three. So, I agree people shouldn't use problem selection as an absolute filter, since it could be better to work on a medium-ranked problem with a great method and personal fit.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "46fGuKs5sTf3k48nX", "postedAt": "2018-02-10T03:37:19.073Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<blockquote>\n<p>Perhaps scale could be thought as the inverse of the diminishing returns rate (e.g., more scale = less diminishing returns = more ability to take funding). This seems useful to think about to me.</p>\n</blockquote>\n<p>Yes, this is why you need to consider the ratio of scale and neglectedness (for a fixed definition of the problem).</p>\n", "parentCommentId": "DJZhB5ChaJCoKBpTi", "user": {"username": "Benjamin_Todd"}}, {"_id": "BRiBwhGpaJru2rds7", "postedAt": "2018-02-10T03:37:47.979Z", "postId": "BJrdKZHTkgmhmjDDC", "htmlBody": "<blockquote>\n<p>I generally agree it's a mistake to force people to size up the entire cause - as 80k do</p>\n</blockquote>\n<p>We don't - see my comment above.</p>\n", "parentCommentId": "ng2w8HH73GXy3fDZL", "user": {"username": "Benjamin_Todd"}}]