[{"_id": "K9crQSGFqdoqJdTzz", "postedAt": "2023-12-29T22:29:14.362Z", "postId": "bkchwgNL9zh44o3oe", "htmlBody": "<p>What's the timeline you're after for firm committal? I might be interested but need to prioritise what I'm do long over the next 2-3 months so would not be able to commit immediately.</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "DvG7beDxNwEH2kKj2", "postedAt": "2023-12-29T22:43:47.825Z", "postId": "bkchwgNL9zh44o3oe", "htmlBody": "<p>A month at a time so just January at this point</p>\n", "parentCommentId": "K9crQSGFqdoqJdTzz", "user": {"username": "joshcmorrison"}}, {"_id": "N3sDHCMjxMn7xJBht", "postedAt": "2023-12-30T07:50:42.429Z", "postId": "bkchwgNL9zh44o3oe", "htmlBody": "<p>OK, I can't commit right now, but I'll look out for if you're advertising again for February (or feel free to get in touch with me). Good luck, great project!</p>\n", "parentCommentId": "DvG7beDxNwEH2kKj2", "user": {"username": "jooke"}}, {"_id": "op9weXtDhcFwRdoi7", "postedAt": "2024-01-03T10:27:56.654Z", "postId": "bkchwgNL9zh44o3oe", "htmlBody": "<p>Hi Josh, apologies if this was detailed elsewhere, but do you have any skills you're after for pool members? I'd be keen to help out if you thought I could.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mitchell Laughlin"}}, {"_id": "qPAo5Shbk9M5cze3n", "postedAt": "2024-01-03T14:39:53.934Z", "postId": "bkchwgNL9zh44o3oe", "htmlBody": "<p>Thanks for your interest! I've copied a description of the pool work below to give a better sense, but basically it's mostly research tasks that are like \"research how vaccine distribution (not purchasing doses) is normally funded for new vaccines and write a 3-5 paragraph summary)\" or \"take a 3-5 paragraph summary someone wrote and create 3-6 sentences of suggested text to include in the status report\" or \"cite-check a section of talking points to make sure all the facts mentioned have citations and that those citations actually support the facts.\"&nbsp;</p><p>Overall, we're very much in a \"more the merrier\" stage and would love your help.&nbsp;</p><p>Here are more details on the scheme:</p><p>&nbsp;</p><p><u>Plan for a Pool System to Handle Research/Talking Points&nbsp;</u></p><p><br>&nbsp;</p><p>Our&nbsp;<a href=\"https://docs.google.com/document/d/1uDITA5JAOFzajN7hE2OVovvvRTqdmlBhjfDfL9rkl6Y/edit#heading=h.thhsqfw2yo71\"><u>talking points</u></a> are intended to be a live, continually updated document representing our best understanding of malaria vaccination and how to improve rollout. In a sense it is intended to be a “global workspace” for our campaign thinking, where new research on key questions is inputted and accurate and relevant information about vaccination is shared across the campaign. Stylistically the talking points are intended to emphasize brevity, simplicity, and ease of use by a general audience.</p><p><br>&nbsp;</p><p>To create a manageable process to continually update and improve the document (i.e. by executing&nbsp;<a href=\"https://docs.google.com/document/d/1rxPYUlFO8NWFLcUwFMWklsLSAfVRYggVW-5_7lYfFC4/edit\"><u>this rolling punch list</u></a> of tasks), we propose a pool system where volunteers sign up for a five days per month where they are “on-call” and will be assigned a 1-2.5 hour task per day, with assignments going out the night before and due the following morning (e.g. a Monday pool task would go out Sunday night and be due Tuesday morning). The expectation would be pool members would ideally sign up for two 2-day blocks and one 1-day block in a month or 3-day and 2-day blocks. The blocks are so that larger tasks (3-5 hours) can be assigned over a two day period.&nbsp;</p><p>&nbsp;</p><p>We’d aim to have at least eight pool members and one pool manager.</p><p><br>&nbsp;</p>", "parentCommentId": "op9weXtDhcFwRdoi7", "user": {"username": "joshcmorrison"}}, {"_id": "JsiuGguzLiYZvLCwa", "postedAt": "2024-01-04T18:03:42.310Z", "postId": "bkchwgNL9zh44o3oe", "htmlBody": "<p>This sounds like a great project! I am not sure if the Op-Ed venues have already been finalized. But I wanted to flag this as a possible venue for an op-ed/policy brief-type entry as FAS seems to have a lot of federal policymakers as their audience - <a href=\"https://fas.org/accelerator/innovations-for-global-development/\">https://fas.org/accelerator/innovations-for-global-development/</a> Also, this particular idea page might have USAID, USDA, etc. as the audience, not sure if that's a good target but just wanted to flag it.</p>", "parentCommentId": null, "user": {"username": "MaithGopalan"}}]