[{"_id": "PgF7zhY4yHjAJmsNN", "postedAt": "2022-12-12T06:10:59.789Z", "postId": "bkF4jWM9pbBFxnCLH", "htmlBody": "<p>Hi! Singaporean here. Just sharing my thoughts on this.<br><br>&gt; Some countries have less traction with English &amp; worry about EA being presented as Western concept (e.g. Japan &amp; Iran). Translation of key texts seems important, and could be a way to engage newer EAs with a concrete project<br><br>Yes, this is a big bottleneck. A lot of EA terms do not have compelling equivalents in English, let alone local languages. Given how much of EA is very textually dense and jargon-filled, this can be quite awkward. I imagine translation takes up a lot of bandwidth for small EA chapters. Not to mention, a lot of the overseas valuable resources/connections EAs tend to take for granted are practically only for English-speakers.<br><br>What you said \"EA being Western\" is very true. Even though Singapore is very Westernised, I try as much as possible not to introduce concepts that are associated with the West. Because then EA is mentally categorised as \"this Western idea\" instead of its own thing.&nbsp;<br><br>&gt; A Turkey CB mentioned that the fact that another group from Iran was able to get traction was inspiring, since they perceived Iran as having worse problems<br><br>I think it's also about shared experiences. There's some ideas such as freedom of speech or secularism that Western EAs tend to assume to be true, that are not as established in other regions.</p>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "xJm3p2LWKiGTCnohC", "postedAt": "2023-02-19T05:25:16.263Z", "postId": "bkF4jWM9pbBFxnCLH", "htmlBody": "<p>As an organizer of EA Kathmandu University, &nbsp;I particularly found the insights on focusing on cities and attracting a talent pool, as well as the importance of finding early adopters, to be valuable takeaways. It's great to hear about the unique challenges and opportunities faced by our fellow EA groups in Asia, and I appreciate the emphasis on good over perfect, as there is no one-size-fits-all approach to building EA groups, and we need to be willing to learn and iterate as we go.</p>", "parentCommentId": null, "user": {"username": "sujaanaryal"}}]