[{"_id": "z9zofua2SskYDKiKh", "postedAt": "2022-08-24T17:56:06.457Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>Hi Rob,</p><p>Sounds like a good idea! In fact, something similar has been proposed by Elliot Olds on the EA Forum: <a href=\"https://forum.effectivealtruism.org/posts/LCJa4AAi7YBcyro2H/proposal-impact-list-like-the-forbes-list-except-for-impact\">Proposal: Impact List -- like the Forbes List except for impact via donations</a>.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "jWksgwteqcuENwy3J", "postedAt": "2022-08-24T19:09:30.576Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>Thanks Vasco! Will reach out to that team.</p>\n", "parentCommentId": "z9zofua2SskYDKiKh", "user": {"username": "Rob Percival"}}, {"_id": "RBWBWp4mbEbYJYoAb", "postedAt": "2022-08-24T20:54:25.098Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>Perhaps &nbsp;more effort should be directed at questioning why any human &nbsp;being needs to be a billionaire? &nbsp;By encouraging billionaires to donate we are in effect legitimizing their hoarding of vast resources far beyond the needs of any person. &nbsp;Instead of asking them to give, perhaps we might be discussing how we will reclaim these resources?</p><h1><strong>Soaring markets helped the richest 1% gain $6.5 trillion in wealth last year, according to the Fed</strong></h1><p><strong>https://www.cnbc.com/2022/04/01/richest-one-percent-gained-trillions-in-wealth-2021.html#:~:text=%E2%80%9CThe%20pandemic%20wealth%20boom%20certainly,end%20of%202021%2C%20data%20show.</strong></p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "aPuojFG2eZafBw9Yy", "postedAt": "2022-08-24T21:16:28.441Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>I think this is a good idea as a neutral tracking resource, but I might be against it if it had the effect of heaping additional praise on the billionaires. (I don't like Elliot's Impact List idea.) I think transparency is good.</p>", "parentCommentId": null, "user": {"username": "sawyer"}}, {"_id": "E7gsxoLksCgTBdEeJ", "postedAt": "2022-08-24T22:03:39.246Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>I expect much of the data is out there, because the majority of billionaires either want to give publicly, or they need to disclose when they change their shareholdings in their main source of wealth (in the case of the typical company founder) due to regulations, and donating to charity is seen as a good excuse to do this.</p>\n<p>It may be rather difficult to gather though, as I don't expect there to be a nice centralised source.</p>\n", "parentCommentId": null, "user": {"username": "Charles_Dillon "}}, {"_id": "PQ6nsCadJaWtJhZdP", "postedAt": "2022-08-25T02:16:37.581Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>If you're curious about &nbsp;arguments for (or rather against against) why billionaire philanthropy you might check out this <a href=\"https://slatestarcodex.com/2019/07/29/against-against-billionaire-philanthropy/\">SSC post</a>. <a href=\"https://rychappell.substack.com/p/billionaire-philanthropy\">This post</a> by &nbsp;Richard Chappell is pretty good too.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Berke"}}, {"_id": "4exSK2962hobD2b9q", "postedAt": "2022-08-25T07:25:12.444Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>Thanks Sawyer - having read Elliot's post I like the idea but think collecting the data will be very difficult. An advantage of this 'simpler' system is that fewer (although not zero) judgement calls need to be made in the collection/presentation of the data.</p>", "parentCommentId": "aPuojFG2eZafBw9Yy", "user": {"username": "Rob Percival"}}, {"_id": "v7PJEkFfuLFffBnPR", "postedAt": "2022-08-25T07:26:07.057Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>I guess the harder the data is to gather the more valuable the resource would be! If it is actually something people are interested in that is...</p>", "parentCommentId": "E7gsxoLksCgTBdEeJ", "user": {"username": "Rob Percival"}}, {"_id": "Prb85nMHJAomd4JvL", "postedAt": "2022-08-25T07:27:53.484Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>Thanks Berke - I broadly agree with those posts, and would hope that this project would engender more discussion of that nature.</p>", "parentCommentId": "PQ6nsCadJaWtJhZdP", "user": {"username": "Rob Percival"}}, {"_id": "fQ5zZRjgJkvbdLDGL", "postedAt": "2022-08-25T07:31:51.447Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>Maybe! I don't think it's one or the other though. I suspect a 'them versus us' approach is not going to be helpful - making worldwide laws forcing people to give away wealth over a certain amount seem both unlikely and problematic. I think working with the ultra rich to make 'improving education' as cool as 'having the biggest yacht' is more likely to have a positive outcome.</p>", "parentCommentId": "RBWBWp4mbEbYJYoAb", "user": {"username": "Rob Percival"}}, {"_id": "89WBwuJFRkfoSLf2k", "postedAt": "2022-08-25T11:20:59.941Z", "postId": "BKhfT2hwscAGNZKmL", "htmlBody": "<p>Hi Rob,</p><p>I agree we shouldn't demonize most of the rich as \"the enemy\" assuming they made their fortune legally, which most did. &nbsp; &nbsp; However, when a tiny fraction of the population is, well, hoarding 30-40% of the nation's wealth if we're serious about ambitiously funding altruistic projects we have to look to where the real money is, and that's where it is, &nbsp;held by the super rich. &nbsp;</p><p>I agree that laws which reduce the wealthy from being super rich to just comfortable are highly problematic, and that's largely because the super rich will use their vast resources to buy the U.S. Congress so as to prevent such laws.</p><p>Most of that money goes to buying TV ads for incumbents, so one change we might consider would be to \"make it cool\" as you say to not vote for any candidate who runs TV ads. &nbsp; That could be a place to start.</p><p>Another approach could be to target rich people who have made their money in a highly anti-social manner, such as tobacco company executives for example. &nbsp; These rich guys kill roughly 1,000 Americans a day, just so they can get even richer, so I see no good reason to have mercy on them.</p>", "parentCommentId": "fQ5zZRjgJkvbdLDGL", "user": {"username": "Phil Tanny"}}]