[{"_id": "sniPaFHM5i8D9HDKP", "postedAt": "2018-06-05T13:27:16.786Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>Thank you for sharing this Holly. Have you read Strangers Drowning by Larissa MacFarquhar? It's a book full of stories of extraordinarily committed &quot;do-gooders&quot; (some effective altruists, some not), as well as some interesting analysis on the mixed reaction that they receive from society. I think there's a lot of overlap with some of what you've written and the experiences of the individuals in Strangers Drowning, so you're definitely not alone.</p>\n<p>I suppose the extent that anyone experiences any of these 8 challenges really depends on how motivated they are by morality. I think most people think it's important that they have a positive impact on the world (or at least, don't have a negative one), but they think it's less important to maximize their positive impact. Even being convinced of EA doesn't necessarily change this: it might just lead you to conclude that you can have a much greater positive impact on the world at little cost to yourself, so you might as well...</p>\n<p>I guess personally I think that morality should be my most important motivator abstractly, but just looking at my behaviour, it clearly isn't in practice (at least right now). I suppose I'm glad that I don't find altruism very emotionally difficult, but I also suppose that I feel slightly guilty about not feeling very guilty about not doing more.</p>\n", "parentCommentId": null, "user": {"username": "bwildi"}}, {"_id": "6zZqKLQHJQKCmekez", "postedAt": "2018-06-05T21:20:40.710Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>Thanks for the recommendation, I've actually never gotten round to reading it and have added to my Christmas list ^_^</p>\n<blockquote>\n<p>I also suppose that I feel slightly guilty about not feeling very guilty about not doing more</p>\n</blockquote>\n<p>I did worry a bit about people reading this as a &quot;How saintly are you?&quot; quiz, and possibly that outweighs the benefits of acknowledging what some people go through. I think all I can say is that this is not a competition you want to win. <a href=\"http://www.givinggladly.com/2013/06/cheerfully.html\">Walk cheerfully</a> :-)</p>\n", "parentCommentId": "sniPaFHM5i8D9HDKP", "user": null}, {"_id": "rwMz5Goyc2jA8hoPM", "postedAt": "2018-06-15T20:15:03.405Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>Thank you so much for this! You are right that putting labels on these things and realising it's pretty normal to feel like this is already surprisingly helpful.\nI still haven't really figured out how similar advice could be used to support other altruists, especially when it's people in your own group whom you don't know too well. Is there anything more than to say &quot;oh, and this is a thing, come talk to me if you want&quot;?</p>\n", "parentCommentId": null, "user": {"username": "Ronja_Lutz"}}, {"_id": "KY6ytfGFSmnAwcsZ6", "postedAt": "2018-06-18T12:36:48.606Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>I thought this was a really great post! I think giving because “it is the right thing to do” works in the short run but not in the long run. </p>\n<p>I firmly believe that there is no such thing as true altruism ( to act in selflessness and disinterest).</p>\n<p>If you will, allow an assumption inspired by neoclassical economic theory that rational people act in their own self interest. Well, if I am rational (as I would like to believe) then I would not give unless it benefits me in some way. And I would also not trust someone who tells me they give selflessly because that would mean (s)he is not a rational person. </p>\n<p>And if you entertain these ideas, it leaves one with an extremley uncomfortable question. If I want to give -and I am a rational person, what is it then that I am getting in return for giving? </p>\n<p>I think that it is extremely important for effective altruists to understand what they get in return for giving. It is even dangerous to say that we should give because it is “the right thing to do” for the following reasons: </p>\n<ol>\n<li><p>Selflessness is a vulnerable motive. A person who gives because it is the “right thing to do” may truly have these “good” intentions. But if self interest is not involved, how long will selflessness last? </p>\n</li>\n<li><p>Selflessness is a cover for ulterior preferences. Efficiency is met when full preferences are expressed. If a person acts selflessly without preferences how can we have confidence that effective solutions are being met and that the selfless agent does not have hidden preferences? </p>\n</li>\n</ol>\n<p>There are so many ways that giving effectively serves our self interests. For example, I am inspired by cures for diseases. And I would like to see as many diseases cured as possible in my lifetime. So, I wonder, what if every human has the capacity and surplus energy to put towards finding cures? That is one reason I want to help end global poverty. And because I have expressed self interest, I think people can trust my motives. </p>\n<p>I strongly believe in the effective altruism movement and I also strongly believe that effective altruists should give selfishly not selflessly for the long term ( health and sustainability being two reasons). I think EAs should spend energy on helping others find their self interests in giving. </p>\n", "parentCommentId": null, "user": {"username": "jvanhaaften"}}, {"_id": "E3sXLjBqwrMefJqvE", "postedAt": "2018-07-01T23:53:16.610Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>Thank you!</p>\n<blockquote>\n<p>If you will, allow an assumption inspired by neoclassical economic theory that rational people act in their own self interest. </p>\n</blockquote>\n<p>No, I will not :P (not for me anyway; you are of course perfectly welcome to disagree).</p>\n<p>I weakly think that we can have genuinely selfless goals, and also that no one's behaviour is entirely driven by such goals. So I do agree that finding self-interest in giving is extremely important.</p>\n", "parentCommentId": "KY6ytfGFSmnAwcsZ6", "user": null}, {"_id": "avCK9MpvCmSJjooHy", "postedAt": "2018-07-02T00:26:43.447Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>&lt;3</p>\n<p>I haven't come up with any better ideas yet for supporting other altruists* than saying &quot;oh, and this is a thing, come talk to me if you want&quot;, but that's something :-)</p>\n<p>Maybe framing/inspiring/storytelling/comraderie has a role to play too. When Samwise is like &quot;Everything's shit&quot; I'm like &quot;Yes, everything's shit! 😭&quot; And then he's like &quot;There's some good in this world...and it's worth fighting for&quot; and I'm like &quot;Yeeeeaaahhh! F*** you, Mother Nature! ✊&quot;</p>\n<p>Thanks for prompting me to sum up my current thoughts on what can be done here.</p>\n<p>*beyond, of course, the kind of support that's often helpful for anyone e.g. active listening, coaching/ideas/advice to improve situations (that's a good order to do them in, incidentally), helping to destigmatise professional support for more serious problems with the simple act of suggesting it</p>\n", "parentCommentId": "rwMz5Goyc2jA8hoPM", "user": null}, {"_id": "HDwSeXuJHj2jEh5AE", "postedAt": "2018-07-02T17:45:57.324Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>You're definitely not alone - I've felt a lot of these things. Thank you for writing this. I think a lot of people are going to get a lot of good out of it.</p>\n", "parentCommentId": null, "user": {"username": "jai"}}, {"_id": "zicrofpH7FTgT37iS", "postedAt": "2018-07-05T22:42:12.873Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>Thank you also for what you write. We've included 500 Million at most of our London Secular Solstices and I loved Only Human...I'm tearing up just rereading it now (&quot;The rebels who defy the world they were made for, who never stop dreaming and working for a better tomorrow.&quot; &lt;3 &lt;3 &lt;3)</p>\n", "parentCommentId": "HDwSeXuJHj2jEh5AE", "user": null}, {"_id": "4xvG4x64eFBYdFKT4", "postedAt": "2018-07-25T04:35:40.905Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>Thanks for this Holly. </p>\n<p>I plan to share your article and talk about in an upcoming workshop I am doing on Self Care for the Altruistic (which will mostly consist of using 80k's strategies in addition to taking suggestions from participants and others EA folks  <a href=\"https://80000hours.org/career-guide/how-to-be-successful/#1-dont-forget-to-take-care-of-yourself)\">https://80000hours.org/career-guide/how-to-be-successful/#1-dont-forget-to-take-care-of-yourself)</a>.</p>\n<p>I resonated with most of what you wrote about. You are definitely not alone in having those feelings. (I have also been thinking and writing about sustaining altruistic motivation, and I found your article to be a helpful addition).</p>\n<p>Another feeling that I come across might be an extension of 'social approval and connection' along with 'other values'. I'll call it Representing EA (or EA brand/perception management). Especially as a community builder, a mixed feeling comes up in moments where I think that I am helping shape someone's early perception of EA yet I know that the ideas and practical realities are more complex, challenging, and individualised than I can easily portray in words, especially when I am, at the same time, trying to honestly mention the appealing parts of EA to someone who seems to be really interested in the EA ideas and values. \nA feeling kind of like: \nI cannot do a good job of explaining this to you until you see more for of it for yourself \nyet I still feel the need to do a good job of explaining this to you \nand I hope I don't give you the wrong ideas \neven though the decisions are ultimately up to you.</p>\n", "parentCommentId": null, "user": {"username": "ColinBested"}}, {"_id": "fYwGLimjAuNRswywe", "postedAt": "2018-09-10T20:20:21.638Z", "postId": "bkjNa2WAZvqahqpoH", "htmlBody": "<p>Just seen this!</p>\n<p>Cool idea with the workshop :-) I think Julia Wise is putting together a template Self Care event for EA group organisers, if there are any takeaways you'd like to share with her.</p>\n<p>I think I experience something similar to what you do with Representing EA. I have always hated doing anything that resembles a pitch, and unfortunately I think people usually can see my heart sink when they say, &quot;So tell me more about effective altruism.&quot; Actually the last time I was asked to do something like this, my list of caveats, clarifications and nuances was getting so long that I consciously skipped one and when this later became apparent I got cut off with &quot; - because you were trying to manipulate me?&quot; In some ways, I think online is higher fidelity than offline. Conversation doesn't have footnotes ;-) </p>\n", "parentCommentId": "4xvG4x64eFBYdFKT4", "user": null}]