[{"_id": "f4JMkGgDNvesvLCMn", "postedAt": "2023-08-27T13:33:57.171Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Great initiative! It's good to see that charities outside of the anglosphere are also being analysed and in some cases, even turn out to be very effective.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jeroen De Ryck"}}, {"_id": "KaKJaGcn65HrBWtGT", "postedAt": "2023-08-27T18:21:11.532Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Thanks! I guess GW's top charities will remain my go-to, but happily, we found some promising options for local donations</p>", "parentCommentId": "f4JMkGgDNvesvLCMn", "user": {"username": "Yonatan Schoen"}}, {"_id": "Nz8yKRaqxCNGETHYX", "postedAt": "2023-08-28T10:27:49.640Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>This is incredible ! I'm very happy about this initiative and hope other national orgs will draw inspiration from it. I think this is also a wonderful way of making EA known. Courage for the rest !</p>", "parentCommentId": null, "user": {"username": "Camille"}}, {"_id": "fnqk3ytaHesYgTmQb", "postedAt": "2023-08-28T15:32:59.967Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Some questions/comments from a quick reading of this and the link, hope it's OK.</p>\n<ol>\n<li>\n<p>Does this analysis assume that Smoke Free Israel's campaign was <em>pivotal</em> in the tax reform? How can that be justified? Did you consider that it might have just led the reform to occur slightly earlier?</p>\n</li>\n<li>\n<p>How confident are you that there is really room-for-more-funding for the next campaign, or will SFI likely get enough funds to run it even without EA involvement?</p>\n</li>\n</ol>\n<p>Given what (I think) is limited room for more funding, perhaps you should be highlighting and boosting the other highly rated charities a bit more? Consider also that people may not look literally at all your details and may use it as a loose proxy. The 'Smoke Free Israel is the best' charity might get interpreted as 'charities that work on domestic Israeli politics/health issues are among the most effective.' Whereas I suspect that in general, health interventions in poor countries, and perhaps also the alternative proteins work, may be more effective as a general recommendation.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "yJnwWRGJkBGnvqKJE", "postedAt": "2023-08-28T22:55:47.573Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Fantastic work! It’s awesome to see a national EA chapter taking on such an ambitious project and having the follow through to make it happen.</p>\n<p>I just want to clarify what you mean when you say “most of our research is empirical and quasi-experimental designed (and RCTs when possible) based on the outputs of each nonprofits”:\nI assume this means that your research uses existing empirical (preferably quasi-experimental or better yet RCT) evidence . You don’t mean you’re actually conducting or funding any primary research, right? I ask because that would be insanely cheap and fast</p>\n", "parentCommentId": null, "user": {"username": "Aidan Alexander"}}, {"_id": "cGnQAYjsYhJuNmCAr", "postedAt": "2023-08-29T15:17:50.073Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Good point, thanks for bringing this up.&nbsp;<br>&nbsp;</p><p>As you've mentioned, with the time constraints of the program, it was unreasonable for all data collection to occur within the program timeframe. So in most cases, we relied on high-quality evidence from prior research conducted by the nonprofits. So yes, the cost per nonprofit I mentioned doesn't include data collection in most cases (which can be VERY costly, specifically when doing RCTs)</p><p>Some assessments did leverage experiments that had started before and continued during the program. And in select cases, we assisted nonprofits with parts of their data collection and experiment implementation through facilitation.</p>", "parentCommentId": "yJnwWRGJkBGnvqKJE", "user": {"username": "Yonatan Schoen"}}, {"_id": "zcaGuaaRTARmTkPiL", "postedAt": "2023-08-29T15:18:52.791Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Happy to hear that, Thanks!</p>", "parentCommentId": "Nz8yKRaqxCNGETHYX", "user": {"username": "Yonatan Schoen"}}, {"_id": "uuWyNXKotFd3z5bxF", "postedAt": "2023-08-29T15:44:01.575Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>On SFI's room for more funding - they've said they're not looking to expand internationally right now. So with their current scope, I agree their funding capacity seems limited, even maintaining effectiveness. We've noted that for potential donors.</p><p>The tax reform question - <a href=\"https://forum.effectivealtruism.org/users/edoarad?mention=user\">@EdoArad</a> &nbsp;was the internal reviewer for SFI's report. He'd be the best person to speak to that.</p><p>And I totally agree with encouraging local donors to give across each of the top nonprofits we identified, without focusing on SFI.&nbsp;<br>Within this forum, we highlighted SFI since they were the only one we found already competitive internationally. But absolutely, spreading support across all 3-5 effective charities we identified is ideal for local donors.</p>", "parentCommentId": "fnqk3ytaHesYgTmQb", "user": {"username": "Yonatan Schoen"}}, {"_id": "ubdXLaNPAjjf3Drh5", "postedAt": "2023-08-30T11:25:15.478Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Regarding the first question, I just briefly looked again at the <a href=\"https://drive.google.com/file/d/1acppOGtYGNdt2bIGhG5E8cvsEBBjfs-T/view\">report</a> and indeed I don't see that explicitly taken into account. I only vaguely remember thinking about that, and I'm not sure how that was resolved.&nbsp;</p><p>I think the main causal pathway they used in their report is QALY gains from people quitting smoking, so that sounds like it wouldn't change drastically if the intervention was delayed by, say, a couple of years. So I agree that this is a good question to look into further, and I expect that could indeed reduce the cost effectiveness by 3x-10x. Great catch David!</p>", "parentCommentId": "fnqk3ytaHesYgTmQb", "user": {"username": "edoarad"}}, {"_id": "zf3SkNMHFaPR6DLoH", "postedAt": "2023-08-31T07:42:45.126Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Hi!<br><br>From what I understand from conversations with SmokeFree Israel's staff (which admittedly might be biased) is that they were the only body pushing the legislation forward, and they had to work AGAINST the existing legislation. SFI wokred to fix problematic loopholes in the update to the tobacco taxation policy that had recently been passed, and petitioned to external legal bodies to help force the government to put the policy back on the agenda. They also provided the data and expert opinions that were pivotal in the discussions within the legislature once the issue had returned to the agenda.<br><br>Regarding room for funding - that point is entirely valid. We don't think that SFI replaces AMF or MC as a top charity that everyone should donate to, but is evidence that more highly cost-effective opportunities exist if you look for them.</p>", "parentCommentId": "fnqk3ytaHesYgTmQb", "user": {"username": "ezrah"}}, {"_id": "YiemmQcFakH5aNg6z", "postedAt": "2023-08-31T12:25:46.265Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Impressive work you have done and clearly written report! Looking forward to follow how you scale it up/duplicate your effort to other countries :)</p>", "parentCommentId": null, "user": {"username": "Karla Still"}}, {"_id": "rsdikubfuSnGDoBZw", "postedAt": "2023-09-06T12:01:41.607Z", "postId": "BLqJdZAgsvyWX7fug", "htmlBody": "<p>Hello! Want to chat with you about your project. It could help EA Armenia that has quite a similar goals. Please replay in dm or share you contacts)</p>", "parentCommentId": null, "user": {"username": "Oleg N"}}]