[{"_id": "fBmDpMokaDQ7vCCAq", "postedAt": "2022-10-20T16:58:26.037Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<blockquote><p>Some behavioral traits such as general intelligence show very high heritability – over <a href=\"https://www.cambridge.org/core/journals/twin-research-and-human-genetics/article/wilson-effect-the-increase-in-heritability-of-iq-with-age/FF406CC4CF286D78AF72C9E7EF9B5E3F\">0.70</a> – in adults, which is about as heritable as human <a href=\"https://www.nature.com/articles/d41586-019-01157-y\">height</a>.</p></blockquote><p>I'm very confused about what numbers such as this mean in practice, since the most natural interpretation (\"70% of the trait is genetically determined\") is wrong, but there aren't very many clear explanations of what the correct interpretation is. When I <a href=\"https://www.lesswrong.com/posts/YpsGjsfT93aCkRHPh/what-does-knowing-the-heritability-of-a-trait-tell-me-in\">tried asking this on LW</a>, the top-voted answer was that it's a number that's mostly useful if you're doing animal breeding, but probably not useful for much else.</p><p>You mention a lot of heritability numbers, could you clarify what it is that we're intended to infer from them? (It seems to me that the main thing we can infer from heritability numbers is that if a trait has heritability above zero, then there's some genetic influence on it, but since you mention some traits having \"very high\" heritability, I presume that you find there to be some other information too.)</p>", "parentCommentId": null, "user": {"username": "Kaj_Sotala"}}, {"_id": "JBTx4YFjtZuhyTbZb", "postedAt": "2022-10-20T19:38:51.609Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>This is also <a href=\"https://www.lesswrong.com/posts/dRsrfC8LN4z2oehJg/the-heritability-of-human-values-a-behavior-genetic-critique\">on LessWrong</a>.</p>", "parentCommentId": null, "user": {"username": "tkwa"}}, {"_id": "nNeWKjzth8Fk7WHd5", "postedAt": "2022-10-20T20:44:18.546Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>Hi Kaj,</p><p>There's a lot of politically motivated misinformation about heritability, mostly so people feel comfortable ignoring and dismissing the results of behavior genetics.</p><p>IMHO, if one knows that the heritability of a psychological trait is fairly high, and the long-term effect of shared family environment is fairly low, this has big practical implications in a number of real-life domains:</p><ol><li>Mate choice. It's really important to pay attention to highly heritable trait when choosing a mate to have kids with, because their genes will have a big impact on their kids, and their parenting won't (within the range of parenting observable in one's population</li><li>Parenting. If a trait is highly heritable, but parenting doesn't make much difference, then parents can relax, enjoy their kids, and not try to push them, hothouse them, or try to shape them into someone they're not. Bryan Caplan, Steven Pinker, and others have emphasized that behavior genetics is very liberating for anxious parents. COnversely, if a kid gets a serious mental disorders that's highly heritable (e.g. schizophrenia, bipolar), then parents should feel less guilt that they messed up or caused the disorder (vs. 1950s theories that mothers caused schizophrenia)</li><li>Education. If intelligence is highly heritable, and conscientiousness is moderately heritable, within a population with a wide range of educational opportunities, then education won't do very much to boost intelligence or conscientiousness; this has implications for parents trying to decide whether to spend an extra few hundred thousand dollars on private school (vs public school)</li><li>Embryo selection. As polygenic scores get more accurate in predicting traits, parents will be able to choose among fertilized embryos to influence their offspring traits. (This will be much less effective than choosing a good mate, for the next couple of decades, but it will become important eventually).</li></ol><p>Those are just a few examples; behavior geneticists have discussed many others.</p>", "parentCommentId": "fBmDpMokaDQ7vCCAq", "user": {"username": "geoffreymiller"}}, {"_id": "etAJYX7XdyDTqiBRz", "postedAt": "2022-10-21T03:58:38.566Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>I recommend Making Sense of Heritability by Neven Sesardić.</p>\n", "parentCommentId": "fBmDpMokaDQ7vCCAq", "user": {"username": "Parrhesia"}}, {"_id": "R2G35h4KfmWSaDKxe", "postedAt": "2022-10-21T15:40:53.968Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>Yes, that's a good book on this issue.</p>", "parentCommentId": "etAJYX7XdyDTqiBRz", "user": {"username": "geoffreymiller"}}, {"_id": "2Z55s48HEaGGqPmwk", "postedAt": "2022-10-22T17:44:31.426Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>I'm going to take the implication of Kaj's comment and strengthen it: This is quite a bad post, primarily because the statistic cannot make the claims you want to infer, and for a non-EA, they'd likely get it massively wrong.</p>\n<p>This is a post that could be much better, but needs much more work in choosing metrics that align with what you want to say.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "wvK9o8qhFTsYJDStK", "postedAt": "2022-10-22T17:58:01.854Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>OK, if you don't like heritability as a metric of genetic influence that challenges Shard Theory's relatively Blank Slate assumptions, what other metric of genetic influence would you suggest?</p>", "parentCommentId": "2Z55s48HEaGGqPmwk", "user": {"username": "geoffreymiller"}}, {"_id": "tsXJevLwXabu7vG2D", "postedAt": "2022-10-22T20:46:32.696Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>PS, Gary Marcus at NYU makes some related points about Blank Slate psychology being embraced a bit too uncritically by certain strands of thinking in AI research and AI safety.</p><p>His essay '<a href=\"https://garymarcus.substack.com/p/5-myths-about-learning-and-innateness\">5 myths about learning and innateness</a>'&nbsp;</p><p>His essay '<a href=\"https://garymarcus.substack.com/p/the-new-science-of-alt-intelligence\">The new science of alt intelligence</a>'</p><p>His 2017 <a href=\"https://www.youtube.com/watch?v=aCCotxqxFsk\">debate</a> with AI researcher Yann LeCunn 'Does AI need more innate machinery'&nbsp;</p><p>I don't agree with Gary Marcus about everything, but I think his views are worth a bit more attention from AI alignment thinkers.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "yEWHLczF3wCa4YwKc", "postedAt": "2022-10-23T13:30:18.140Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>I don't have a metric immediately on hand.</p>\n<p>I think that human values/behavior is largely genetic, even if it's not true for AI. My goal was to focus on the fact that your statistic can't support the claims you want it to, even if the conclusion is actually true.</p>\n<p>In other words, I'm focus on how you got to the conclusion here, not it's ultimate truth value.</p>\n", "parentCommentId": "wvK9o8qhFTsYJDStK", "user": {"username": "Sharmake"}}, {"_id": "AYxq3PinpLrHAHAMw", "postedAt": "2022-10-25T17:54:38.523Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>PS the developers of Shard Theory, Quintin Pope and Alex Turner, have just offered (Oct 25, 2022) some comments and replies on my post, over at LessWrong <a href=\"https://www.lesswrong.com/posts/dRsrfC8LN4z2oehJg/the-heritability-of-human-values-a-behavior-genetic-critique\">here</a> (scroll down to comments).</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "2qwBihsecoLknoadf", "postedAt": "2022-10-25T23:02:34.970Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>Update: there's some interesting discussion about my post over on LessWrong, including some replies from the developers of Shard Theory, Quintin Trout and Alex Turner. &nbsp;See the comments after the post <a href=\"https://www.lesswrong.com/posts/dRsrfC8LN4z2oehJg/the-heritability-of-human-values-a-behavior-genetic-critique\">there</a>.&nbsp;</p><p>(My post is also up on AI Alignment Forum <a href=\"https://www.alignmentforum.org/posts/dRsrfC8LN4z2oehJg/the-heritability-of-human-values-a-behavior-genetic-critique\">here</a>, but there are no comments there yet, as of Oct 25).&nbsp;</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "cLCPFvMxXTHWQXiyq", "postedAt": "2022-11-19T00:14:44.895Z", "postId": "bm4qeNJcc82BKJnWk", "htmlBody": "<p>My understanding is that the technical translation is: 70% of the variance in that trait is attributable to genes, given the time and place of the studied population.&nbsp;</p><p>For example, 70% of the variance in intelligence is attributable to genes, given a white American population, living in non-abusive homes, from the 1960s to the 1990s. (The specifics are just to provide a concrete example.)</p><p>The farther one gets from the originally studied population, the less one can extrapolate exact findings. And vice versa.&nbsp;</p>", "parentCommentId": "fBmDpMokaDQ7vCCAq", "user": {"username": "Kevin_Cornbob"}}]