[{"_id": "PSmANmE2obGEQQwnm", "postedAt": "2024-02-01T04:07:59.396Z", "postId": "bm7iRhMynNbbwaMh4", "htmlBody": "<p>Are you familiar with scalar consequentialism? That's the idea that there's no arbitrary threshhold of 'right-ness' on one side of which an action is right and on the other of which it's wrong, but that we can at best talk about whether an action is better or worse, according to the relative amounts of value they produce.</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "zdm3iK9QxhXGGPxxE", "postedAt": "2024-02-01T04:33:57.466Z", "postId": "bm7iRhMynNbbwaMh4", "htmlBody": "<p>I don't quite understand your objection to Timmerman's thought experiment. You say it's \"ad hoc\" and \"justifies our complacency <i>arbitrarily</i>\", but it's unclear what you mean by these terms. And it's unclear why someone should agree that it's ad hoc and arbitrary.</p>", "parentCommentId": null, "user": {"username": "nathan98000"}}, {"_id": "79zxGXshWAszr3C95", "postedAt": "2024-02-03T21:27:01.003Z", "postId": "bm7iRhMynNbbwaMh4", "htmlBody": "<p>I have never heard of this term but I am quite familiar with the idea! I am sympathetic to the position, but feel it too counter-intuitive to suppose that there are no rights or wrongs, or at least that prescribing some rights and wrongs (dos and don’ts) as distinct from things that are merely better or worse is useful.</p>\n", "parentCommentId": "PSmANmE2obGEQQwnm", "user": {"username": "JacobBowden2023"}}, {"_id": "NRrDzFc7RMHdFs5j6", "postedAt": "2024-02-03T21:29:14.080Z", "postId": "bm7iRhMynNbbwaMh4", "htmlBody": "<p>This is a fair criticism, my construction of this post was fairly rushed and I did consider this as an issue with it myself. I think what I am trying to get at is that it is all well and good to throw doubt upon Singer’s principle with another thought experiment, but what is required of the philosopher is also to provide grounding or to think about grounding upon which the intuitions pointed to by a thought experiment are consistent - Singer does this, but I do not think that Timmerman does.</p>\n", "parentCommentId": "zdm3iK9QxhXGGPxxE", "user": {"username": "JacobBowden2023"}}, {"_id": "FqhXcLNrRKaSYAfft", "postedAt": "2024-02-04T05:33:33.859Z", "postId": "bm7iRhMynNbbwaMh4", "htmlBody": "<blockquote><p>[What] is required of the philosopher is also to provide grounding or to think about grounding upon which the intuitions pointed to by a thought experiment are consistent.</p></blockquote><p>Why can't a philosopher just present a counterexample? In fact, it seems arguing from a <i>specific</i> alternative grounding would make Timmerman's argument weaker. As he notes (emphasis mine):</p><blockquote><p>I have purposefully not made a suggestion as to how many (if any) children Lisa is obligated to rescue. I did so to make my argument as neutral as possible, as <strong>I want it to be consistent with any normative ethical view</strong> ranging from moral libertarianism to a view that only permits Lisa to indulge in a comparably insignificant good a single time.</p></blockquote><p>As an analogy, if you make a general claim such as: \"All marbles are blue,\" it's enough to point to a single counterexample to show that that claim is false. I don't <i>also </i>have to have my own view about what colors marbles come in.<br><br>Also, as a matter of interpreting <i>Famine, Affluence, and Morality</i>, Singer <i>doesn't</i> justify his principles based on any inferences from the drowning child thought experiment. Instead, he only uses that thought experiment as an <i>application</i> of his principles, which he takes to simply be common-sense. And although Singer is himself a utilitarian, he <i>doesn't </i>make any argument for utilitarianism in that paper, largely for the same reason as Timmerman! He wants diverse people to agree with him <i>regardless of their grounding</i> for the principles he discusses.</p>", "parentCommentId": "NRrDzFc7RMHdFs5j6", "user": {"username": "nathan98000"}}]