[{"_id": "HJuFFenNmtatKTFfA", "postedAt": "2023-03-02T17:41:45.687Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>So I see downvotes as expected. I don't get it</p>\n<ul>\n<li>is it that people don't want answers?</li>\n<li>or maybe they like AI races?</li>\n</ul>\n<p>Can people get real on this forum? Like, there are discussions about some ethical theory, infinite ethics or smth. Yet, right now, today, something fishy is going on. How can there be future without the present?</p>\n<p>I ask for answers here.</p>\n", "parentCommentId": null, "user": {"username": "sergeivolodin"}}, {"_id": "PkB6xo73oNz6gPNYS", "postedAt": "2023-03-02T17:51:07.842Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Or maybe people love Peter Thiel, Musk and red pills here? In this case, I guess, there's not much to discuss. At least I expected some answers. It's as if people don't even bother to explain what is being done - just assumed to be \"correct\"?</p>\n", "parentCommentId": "HJuFFenNmtatKTFfA", "user": {"username": "sergeivolodin"}}, {"_id": "Sm2XcmGouXpRLL9se", "postedAt": "2023-03-02T18:04:17.989Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>(Note: did not downvote)</p>\n<p>Your central question appears interesting and important to me: Has Anthropic joined the arms race for advanced AI? If yes, why?</p>\n<p>(And taking a by default <a href=\"https://slatestarcodex.com/2018/01/24/conflict-vs-mistake/\">conflict-theoretic stance</a> toward new AI startups is perhaps good, based on the evidence one has received via DeepMind/OpenAI).</p>\n<p>So, I'd join in in the call for asking e.g. Anthropic (but also other startups like <a href=\"https://conjecture.dev/\">Conjecture</a>, <a href=\"https://www.adept.ai/\">Adept AI</a> and <a href=\"https://www.aligned-ai.com/\">Aligned AI</a>) for their plans to avoid race dynamics, and their current implementation. However, I believe it's not very likely that especially Anthropic will comment on this.</p>\n<p>However, your post is mostly  not fleshing out the question, but instead not-quite-attacking-but-also-not-not-attacking Anthropic (\"Even when I'm mostly talking to AI ethicists now, I still regarded Anthropic as something not evil\") and not fully fleshing out the reasons why you're asking the question (\"I feel there's a no-confidence case for us trusting Anthropic to do what they are doing well\"), but instead talking a lot about your emotional state a lot. (I don't think that talking about your emotional state a lot is necessarily bad, but I'd like accusations, questions and statements about emotion to be separated if possible.)</p>\n<blockquote>\n<p>See my thread for more questions. I feel traumatized by EA, by this duplicity (that I have seen \"rising up\" before this, see my other threads). I'm searching for a job and I'm scared of people. Because this is not the first time, not at all. Somehow tech people are \"number one\" at this. And EA/tech people seem to be \"number 0\", even better at Machiavellianism and duplicity than Peter Thiel or Musk. At least, Musk openly says he's \"red-pilled\" and talks to Putin. What EA/safety is doing is kinda similar but hidden under the veil of \"safety\".</p>\n</blockquote>\n<p>I don't understand this paragraph, for example. Why do you believe that EA/tech people are better at Machiavellianism than those two? Who exactly is EA/tech people here, that would be good to know.</p>\n", "parentCommentId": "HJuFFenNmtatKTFfA", "user": {"username": "niplav"}}, {"_id": "xXPZTHMYsMnNAfeoH", "postedAt": "2023-03-02T18:14:49.987Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I understand that downvotes can be hurtful – but afaik the post has been up for 45min, so maybe it would be a good idea to wait a bit before reading too much into the reaction/non-reaction?&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "PkB6xo73oNz6gPNYS", "user": {"username": "TobiasH"}}, {"_id": "JrMie3NMZAqqrdXGX", "postedAt": "2023-03-02T18:15:03.025Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>My emotional state is relevant here. I'm one of the people who was excited about safety. Then I slowly was seeing how the plan is shaky and decisions are controversial (advertise OpenAI jobs, do the \"first we get a lot of capabilities skills the do safety\" which usually means a capabilities person with an EA t-shirt and not much safety).</p>\n<p>My emotional state summarises the history that happened to me. It is relevant to my case: I am showing you how you would feel if you went through my experience, in case if you choose to believe it.</p>\n<p>It's not a \"side note\", it's my evidence I'm showing to say \"I have concerns and this feels off, rather a pattern than a one-off case\". Emotions are good for holistic reasoning.</p>\n<p>I don't have the energy to write a \"full-fledged EA post with dots over is and all that\". I mean, I feel I'm one of the \"plaintiffs\" in this case. I believed EA, I trusted all those forum posts. Now I see something is wrong. I am simply asking other people to look into this, say how they feel and think about this.</p>\n<p>So we figure out something together.</p>\n<p>I feel I need support. No, I don't want to go to the FB mental health EA support group, because this is not about mental health specifically - it's about how the field of AI safety is. It's not that \"I feel bad because of a chemical imbalance in my mind\". I feel bad because I see bad things :)</p>\n<p>I have written at length on Twitter about my experiences. If you're still interested, I can link it a bit later.</p>\n<p>For a traumatized person it's painful to go though all this again and again.</p>\n<p>Thank you.</p>\n", "parentCommentId": "Sm2XcmGouXpRLL9se", "user": {"username": "sergeivolodin"}}, {"_id": "gYin5Yzd6FRjPbz7N", "postedAt": "2023-03-02T18:57:26.226Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I still don't really understand how you can do safety &amp; alignment research on something that doesn't exist and maybe never will but I guess maybe I'm just too low-IQ to understand this Big Brain logic. Also I don't understand how everyone is freaked out about a chatbot that can't even reliably tell you basic biographical information about famous figures, for all that it can draft a very nice email and apparently write good code? idk</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "kKQ5gwqnbCELjPpeX", "postedAt": "2023-03-02T19:00:10.061Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I don't think it's close to agi either or that it's good tech. It does harm people today though. And it is an alignment problem EAs talk about: a thing that is not doing what it's supposed to is put in a position where it has to make a decision. Just not about superintelligence. See my motivation here: <a href=\"https://www.lesswrong.com/posts/E6jHtLoLirckT7Ct4/how-truthful-can-llms-be-a-theoretical-perspective-with-a\">https://www.lesswrong.com/posts/E6jHtLoLirckT7Ct4/how-truthful-can-llms-be-a-theoretical-perspective-with-a</a></p>\n", "parentCommentId": "gYin5Yzd6FRjPbz7N", "user": {"username": "sergeivolodin"}}, {"_id": "f8C8sbkRTmgx9EoER", "postedAt": "2023-03-02T19:00:34.596Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>personally I love Thiel &amp; Musk and think they've been massive net positives for the world!</p>", "parentCommentId": "PkB6xo73oNz6gPNYS", "user": {"username": "Sabs"}}, {"_id": "WLdsQeizdtTm8Rxyx", "postedAt": "2023-03-02T19:02:19.014Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>how does it harm people? I mean I guess there's a problem of people taking these LLM outputs as oracular truths because they don't realize how frequently they hallucinate, but isn't this just a self-correcting problem eventually as people figure it out? We don't instantly shut down access to all new tech just because people struggle to use it correctly at first.</p>", "parentCommentId": "kKQ5gwqnbCELjPpeX", "user": {"username": "Sabs"}}, {"_id": "zmg6gtvN6FQvzLF8w", "postedAt": "2023-03-02T19:02:59.475Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>How do you feel about the \"red pill\" they seem to embrace (Musk openly and Thiel by evidence)? Do you feel this worldview affects their actions? Do you think it is extreme? Which political affiliation does \"red pill\" seem to belong to - left or right? Do you believe in those \"sexual markets\" stuff? Thank you for your replies.</p>\n", "parentCommentId": "f8C8sbkRTmgx9EoER", "user": {"username": "sergeivolodin"}}, {"_id": "BbjqhKb7ws4fqGeHP", "postedAt": "2023-03-02T19:06:03.933Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I'll explain my downvote.</p>\n<p>I think the thing you're expressing is fine, and reasonable to be worried about. I think Anthropic should be clear about their strategy. The Google investment does give me pause, and my biggest worry about Anthropic (as with many people, I think) has always been that their strategy could ultimately lead to accelerating capabilities more than alignment.</p>\n<p>I just don't think this post expressed that thing particularly well, or in a way I'd expect or want Anthropic to feel compelled to respond to. My preferred version of this would engage with reasons in favor of Anthropic's actions, and how recent actions have concretely differed from what they've stated in the past.</p>\n<p>My understanding of (part of) their strategy has always been that they want to work with the largest models, and sometimes release products with the possibility of profiting off of them (hence the PBC structure rather than a nonprofit). These ideas also sound reasonable (but not bulletproof) to me, so I consequently didn't see the Google deal as a sudden change of direction or backstab -- it's easily explainable (although possibly concerning) in my preexisting model of what Anthropic's doing.</p>\n<p>So my objection is jumping to a \"demand answers\" framing, FTX comparisons, and accusations of Machiavellian scheming, rather than an \"I'd really like Anthropic to comment on why they think this is good, and I'm worried they're not adequately considering the downsides\" framing. The former, to me, requires significantly more evidence of wrongdoing than I'm aware of or you've provided.</p>\n", "parentCommentId": "HJuFFenNmtatKTFfA", "user": {"username": "det"}}, {"_id": "ZxxC8GDgxvkPBv8mK", "postedAt": "2023-03-02T19:14:51.145Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>In general, I feel that it all could have been a perfectly good research direction, if only if it wasn't done so fast. And the reason it goes so fast is the AI hype. For example, Altman himself, instead of addressing the concerns is writing an \"AGI utopia\" blog posts, seeing LLMs as a \"path to agi\". While it is an achievement, there are other techniques that are not included and which are not supported by LLMs, such as, causality, world model coherency, self-reference (ability of the model output, text, to reference it's inner states, neuronal activations, and vice versa, etc etc etc).</p>\n<p>Yet, it's advertised as \"almost AGI that is good for a lot of tasks\" even when it fails sometimes on simple number addition tasks.</p>\n<p>Again. He advertises something straight out of a research lab as a \"business solution\". And people buy it.</p>\n<p>To sum up, the harms today originate from the pressure to do it all fast, created by unrealistic hype. Here's an analogy I have: <a href=\"https://twitter.com/sergia_ch/status/1629467480778321921?s=20\">https://twitter.com/sergia_ch/status/1629467480778321921?s=20</a></p>\n<p>Concrete harms, today:</p>\n<ul>\n<li>\n<p>there was an \"AI mental health\" app unleashed without disclosing full specifics to the trial patients, sometimes with people not knowing they're taking to AI, and being in the trial at all. As a result, when they found out, they were understandably more depressed</p>\n</li>\n<li>\n<p>there are artists whose work was taken for training without consent, as a result, some lost job opportunities w/o \"UBI\" promised by Altman</p>\n</li>\n<li>\n<p>there is bias against certain groups of people in systems already doing processing resumes, doing legal trial verdicts, etc</p>\n</li>\n<li>\n<p>there was an \"AI girlfriend\" startup replika that was making abusive statements. Later, the \"girlfriend\" functionality was made into a \"friend functionality\". As a result, people are a bit traumatized</p>\n</li>\n<li>\n<p>there is concern about misinformation generated at scale more easily, significantly worsening the culture war and making it more insane and violent probably</p>\n</li>\n</ul>\n<p>And more, see posts by ethicists and their news stories, feel free to talk to them and ask questions, but they don't like being asked about to repeat once again the things they talked about over and over basically in every item they broadcast. Totally ok to ask questions after reading.</p>\n<p>In all those cases it's mostly the speed and the \"move fast break things\" attitude that is the problem, not the tech itself. For example, if the patients were informed properly, the trial done correctly, the app re-trained properly to heal mental health issues, it might have been something. The way it was done, it seems harmful</p>\n", "parentCommentId": "WLdsQeizdtTm8Rxyx", "user": {"username": "sergeivolodin"}}, {"_id": "uDcE3P64CBBkDTWoL", "postedAt": "2023-03-02T19:32:02.638Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<blockquote><p>personally I love Thiel &amp; Musk and think they've been massive net positives for the world!</p></blockquote><p>Strong agree with Musk (undecided on Thiel), and it frustrates me so much that people on this forum casually dismiss him. I would go so far as to say I think he's been a much bigger net positive than much if not all of the EA movement - massively improving our prospects from climate change, and reducing existential risk by moving us towards being multiplanetary as fast as possible.&nbsp;</p><p>The standard counterarguments seem to be 'bunkers &gt; planets', 'AI makes being multiplanetary irrelevant', and 'climate change isn't a big deal so Tesla doesn't matter'. I think all three of these arguments are a) probably wrong and more importantly b) almost completely unargued for.&nbsp;</p><p>I'm unclear who I feel has the burden of proof on such issues. In some sense burden of proof is a &nbsp;silly concept here, but in another I feel like it's very important. &nbsp;When 80k et al regularly talk people out of becoming engineers to go into AI safety research or similar, a view which is then often picked up by the wider community, &nbsp;it seems very important that those same EAs should put serious thought into counterfactuals .</p>", "parentCommentId": "f8C8sbkRTmgx9EoER", "user": {"username": "Arepo"}}, {"_id": "zcLKf5vfCyWBqDTYj", "postedAt": "2023-03-02T19:34:56.604Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>these just seem like incredibly minor and/or unlikely harms tbh, and the idea that they merit any kind of advance regulation is just crazy talk imo. This is capitalism, we make things, product goes out, &nbsp;it happens! We trust the market to address most harms in its own time as a default. Unless the bad thing is really bad - some huge environmental pollutant, a national security risk, a world-ending threat - then we don't do the European Permit Raj thing. We let these things work themselves out and address any problems that arise post hoc, considering the benefits as well!</p>", "parentCommentId": "ZxxC8GDgxvkPBv8mK", "user": {"username": "Sabs"}}, {"_id": "EaBHtEpJCEv4HnQky", "postedAt": "2023-03-02T19:38:50.103Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I acknowledge and agree with your criticism.</p>\n<p>I did question these assumptions (\"we do capabilities to increase career capital, and somehow stay in this phase almost forever\" and such) since 2020 in the field, talking to people directly. The reactions and disregard I got is the reason I feel the way I feel about all this.</p>\n<p>I was thinking \"yes, I am probably just not getting it, I will ask politely\". The replies I got were what's causally preceding me feeling this way.</p>\n<p>I am traumatized and I don't want to engage fully logically here, because I feel pain when I do that. I was writing a lot of logical texts and saying logical things, only to be dismissed kinda, like \"you're not getting it, we are going to the top of this, maybe you need to be more comfortable with power\" or something like this.</p>\n<p>Needless to say, I have pre-existing trauma about a similar theme from childhood, family etc.</p>\n<p>I do not pretend to be an objective EA doing objective things. After all, we don't have much objective evidence here except for news articles about Anthropic 🤷‍♀️</p>\n<p>So, what I'm doing here is simply expressing how I feel, expressing that I feel a bit powerless about this problem, and asking for help in solving it, inquiring about it, and making sure something is done.</p>\n<p>I can delete my post if there is a better post and the community thinks my post is not helpful.</p>\n<p>I want to start a discussion, but all I have is a traumatized mind tired of talking about it, which tried every possible measure I could think of.</p>\n<p>I leave it up to you, the community, people here to decide - post a new post, ignore it, keep this one and the new one, or only the new one, or write Anthropic people directly, or go to the news, or ask them on Twitter, or anything you can think of - I do not have the mental capacity to do it.</p>\n<p>All I can is to write that I feel bad about it, that I'm tired, that I don't feel my CS skills would be used for good if I joined AIS research today, that I'm disillusioned, and that I ask the community, people who feel the same, to do something if they want to.</p>\n<p>I do not claim factual accuracy or rationality metrics. Just raw experience, for you to serve as a starting point in your own actions about this, if you are interested.</p>\n<p>My mind now can do talks about feelings, so I talk about feelings. I think feelings are good way to express what I want to say. So I went with this.</p>\n<p>That is all. That is all I do here. Thank you.</p>\n", "parentCommentId": "BbjqhKb7ws4fqGeHP", "user": {"username": "sergeivolodin"}}, {"_id": "EGxAmAcbamDwNXeZk", "postedAt": "2023-03-02T19:39:47.418Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>well clearly Musk is much better than all the EAs, he built these massive multi-billion-dollar companies and created loads of value on the way! We're going back to space with Elon! How cool is that? If you disagree, well, ok, I guess that's a very bold take considering the stock market's opinion....<br><br>re EVs, agree as well, even if you don't believe the climate stuff (I do w/ some caveats) then Teslas are very beautiful, great cars and almost certainly good for the world on other dimensions (i.e less local pollution in urban areas etc)</p>", "parentCommentId": "uDcE3P64CBBkDTWoL", "user": {"username": "Sabs"}}, {"_id": "jgdoKBHHoHGhwqRn9", "postedAt": "2023-03-02T19:45:30.934Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I would have upvoted but for the red pill paragraph, which seemed needlessly uncharitable to Thiel and Musk. Your comment here seems more like it's spoiling for a fight than looking for a discussion.</p><p>IIRC Musk once tweeted 'take the red pill' with no context, a phrase which traditionally referred to any instance of people having a radical perspective shift. When asked, he said he didn't know about the pick up artistry subgroup of the same name. I see no reason to disbelieve this, and I haven't heard him say anything particularly in line with their views elsewhere.</p><p>The red pill philosophy is broadly associated with - though strictly unrelated to - right wing politics. What does that have to do with anything? Plenty of EAs are right wing. It's not a pejorative.</p>", "parentCommentId": "zmg6gtvN6FQvzLF8w", "user": {"username": "Arepo"}}, {"_id": "x62zv5fJuisahQmoy", "postedAt": "2023-03-02T19:59:07.884Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>That is how capitalism is supposed to work, yes. It is a system. Any system can be broken. It needs assumptions to work. Capitalism is a human system operating well under certain assumptions, not a law of the universe (like Schrödinger's equation that is true in all cases except quantum gravity, a very rare thing, not usually important or present in every day life)</p>\n<p>The assumptions are:</p>\n<ul>\n<li>a lot of small entities competing, creating field-like dynamics where if, say, a company is suboptimal, a new one is created with little overhead resources, like a new Linux process replacing a failed one. This is not the case in tech. There are monopolies, and novel contexts such as \"network effects\". Monopolies change the dynamics, not allowing to use a \"field metaphor\" anymore. There are simply not enough particles for the field approximation to work. For example, when there were Nokia, Motorola, and all those old phone companies making phones, there was innovation. Now we have iPhone and Android, and there are not much new features. Instead, phones are getting more walled-gardened, something a significant portion of consumers doesn't want. In the Linux analogy, the existing big process takes so much memory that a new one can't even allocate. The system is \"jammed\"</li>\n</ul>\n<p>The reason \"market\" doesn't work here is the monopoly: the companies don't have competition, already have enough profit, and kinda agree with each other to be kinda the same: both android and iPhone become more walled-gardened, despite a significant portion of consumers wanting an alternative.</p>\n<ul>\n<li>the choices of consumers and businesses are informed. Consumers roughly know what they are getting. Consider a case when, say, McDonald's starts to make burgers from stale meat, but doesn't tell that to customers. So far, nobody knows. If a new company offers better product with fresh meat, not many consumers would go there (assuming McDonald's fried it so hard that consumers can't tell anymore). However, if there's a news story about stale meat at McDonald's dangerous for health, people would go to the new business likely.</li>\n</ul>\n<p>This applies to LLMs. People are being sold hype, not real \"AI from sci-fi assisting humans\". People are harmed because they eat \"stale meat\" without being informed about what they're eating</p>\n<p>The hype seems stable, and if we look at historical precedents of hype, like crypto, it can go on for years without \"bursting\".</p>\n<p>In addition, the very nature of LLMs and how they can be used for misinformation make it even less likely that there would be good Informed choices in our model. The product (LLM) different from a traditional product (like shoes) which is analyzed in models of capitalism. This product changed how things work, changes the model.</p>\n<p>There are other assumptions, like, there is some regulation (medical field couldn't go without regulation. It didn't work, people were buying literal snake oil, and companies were literally poisoning places, see the story behind this movie: <a href=\"https://en.m.wikipedia.org/wiki/Dark_Waters_(2019_film)\">https://en.m.wikipedia.org/wiki/Dark_Waters_(2019_film)</a> )</p>\n<p>For those who are \"fully libertarian\". I'm talking about \"some regulation\", not \"Stalin\". I'm from Russia, we have \"Putin\". He regulates everything, including whether I can say \"stop the war\" or not. That is too much regulation.</p>\n<p>There's the case with a chemical monopolist company with a lot of lawyers and connections polluting the rivers and killing people (say above). Not regulating this is \"too little regulation\".</p>\n<p>I am a leftist liberal, yet I am for <em>some</em> regulation, not too much regulation. Too much regulation is extreme. Too little is extreme. There is \"just right\" that is probably subjective, but we can discuss it together and agree on what is \"just right\" for us all.</p>\n<p>Ideally, the businesses are many, they are competing and they are independent. Ideally, the strength of the government is enough to stop monopolies and crimes of companies, but not enough to dominate all the companies in all domains. A bit of this. A bit of that.</p>\n<p>That is how I see it.</p>\n<p>To sum up my last point, LLMs have not enough regulation (basically none so far).</p>\n<p>Hope I explained it. I tried to do it from first principles, not from any dogma.</p>\n", "parentCommentId": "zcLKf5vfCyWBqDTYj", "user": {"username": "sergeivolodin"}}, {"_id": "fazZgzLdsN5Yv7Qx7", "postedAt": "2023-03-02T20:07:10.274Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I'm sorry but I just flatly reject this and think it's trivially wrong. EA will be a massive force for bad in the world if it degenerates into some sort of regulatory scam where we try to throttle progress in high-growth areas based on nothing but prejudice and massively overblown fears about risk. This is a recipe for turning the whole world economy into totally dysfunctional zero-growth states like Italy or the UK or whatever. There's a reason why Europe has basically no native tech industry to speak of and is increasingly losing out to the US even in sectors like pharma where it was traditionally very strong. This anti-bigness attitude and desire to impose regulation in advance of any actual problems emerging is a lot of the reason why. It places far too much faith in the wisdom of regulators and not enough in markets to correct themselves just fine over time. The fact that you picked the massively price-competitive and feature-competitive smartphone industry as an example of market failure is a prime example of Euro-logic completely divorced from basic economic logic.</p>", "parentCommentId": "x62zv5fJuisahQmoy", "user": {"username": "Sabs"}}, {"_id": "asxAz6qQwChXvsFMh", "postedAt": "2023-03-02T20:21:25.951Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>You're in the US. I'm in Europe. I am waiting to order my European UK smartphone with a physical keyboard, as do a lot of XDA-dev ppl, once the company, fxtec finally starts shipping again :)</p>\n<p>People are not the same.</p>\n<p>If people in the US democratically and consensually want to have products that are are \"innovative even if harmful\", that is ok to me.</p>\n<p>Dragging the whole world into this (Altman has worldwide plans) is something I am not on board with. Even in the US not everyone, not everyone at all agrees that \"disrupting\" things is good.</p>\n<p>Say, artists. A whole profession that tech made it's enemy. A whole set of friendships broken, \"disrupted\" in the name of \"progress\"</p>\n<p>You see it this way, \"brave silicon valley achieves all tasks with libertarianism\". I see it as \"an inferior product such as iPhone and Android dominates the market because they lobbied everyone and <em>broke</em> capitalism :)\". European companies had alternative plans for how phones look like: <a href=\"https://en.m.wikipedia.org/wiki/Nokia_N900\">https://en.m.wikipedia.org/wiki/Nokia_N900</a></p>\n<p>It had open-source customizable social media clients (no walled garden), root out of the box, and \"a single app for messaging where contacts are merged when a person has one on WA and one on FB\"). Of course, a touch screen. And you can type whole books on it.</p>\n<p>Again. This phone doesn't look like what Nokia was doing 5 years before that, at all. This is innovation.</p>\n<p>This is a better product in terms of features for a lot of people. It is innovative.</p>\n<p>To sum up, I still feel that slower, small and multiple-company, and regulated \"just right\" capitalism produces steady innovation and safety. Unregulated, monopolistic capitalism produces things like McDonald's: massive, exploitative, low quality, not changing much in 10 years, kinda harmful, addictive...</p>\n", "parentCommentId": "fazZgzLdsN5Yv7Qx7", "user": {"username": "sergeivolodin"}}, {"_id": "sSFTLtv2cjjazChCX", "postedAt": "2023-03-02T20:25:38.819Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Also, I feel that I'm replying to something a bit out of context here. I do feel that a lot of people on this forum hold similar beliefs though, and I think that it's connected to how people are AI alignment and even life: libertarianism sees the world as a \"stage/arena\" and people as \"warriors\" or smth. This is one way of life, perfectly good for some people I guess.</p>\n<p>It is a system, every system has assumptions. Here the assumption is \"people want to be in a state of continuous war\". That assumption does not hold for all the people.</p>\n", "parentCommentId": "fazZgzLdsN5Yv7Qx7", "user": {"username": "sergeivolodin"}}, {"_id": "QvTAvyho6ExHHiBAW", "postedAt": "2023-03-02T20:30:33.980Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I think for starters Anthropic should publish the list of its board members, its bylaws and cap table. I'm not aware of any of that currently being public info. (Since Anthropic is a public-benefit corporation, presumably the CEO can choose to publish that info even if doing so is not aligned with the financial interests of the shareholders.)</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "repP4G9Bo9Sy5rZgA", "postedAt": "2023-03-02T20:46:52.781Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Which \"right wing\" do you mean? I think it was about \"small government\" (but not \"zero government\").</p>\n<p>How is \"red pill\" related to \"small government\"? :)</p>\n<p>You're using the other \"right wing\", which is something related to traditional family. That is one step there - a patriarch in the family. \"Red pill\" is asserting that it has enough explanatory power to overwhelm the aspect of free will in decisions of women and men, that the \"sexual market\" is a more clear explanation for how relationships go.</p>\n<p>I'd say it's a bit of an extreme step, because it claims a single simple objective for the whole of humanity: \"women procreate, men fight\", creating a \"stereotype of masculinity\" being about \"winning fights, physical or metaphorical\".</p>\n<p>This theory completely ignores male singers who don't seem to be into this stereotype. Some women loved Michael Jackson, and he doesn't seem to be the \"fighting type\", rather the feelings one.</p>\n<p>This theory has blind spots, and is asserted quite forcefully: it has a mechanism of one being scared that they're \"poisoning their market value\" if they do something out of line, seen in \"chad/incel\" memes for example.</p>\n<p>Saying this as a person from Russia who saw the rise of fascism in our country, how our culture war went from the internet to the battlefield. I believed in this. I have seen this to be false. Saying this as a person who is responsible for sexual assault and who tries to heal and be better. \"Red pill\" is b.s. see my posts on Mastodon to see more on this.</p>\n<p>It's an extreme theory that ignores important corner cases (queer people), and tends to make people resentful towards anything not fitting in the theory, all while taking away \"free will\" to replace it with a \"simple objective function\", without any research and clear outliers/exceptions, and is linked to male violence. Ironically, turning people into machines, the very thing the real \"red pill from the movie\" was not really pro: the concept <em>name</em> itself is stolen from a movie by trans authors and basically turned upside down in an evil twisted way: Neo was like \"I'm gonna talk to the machines and bring peace to y'all. The war is gonna end\". Red pillers are like \"we like guns, force and fighting and don't like to talk about complex things much\" 🤷‍♀️</p>\n<p>\"Small government\" right wing is not a pejorative. \"Traditional cisgender relationship with a man deciding things\" is ok too if a women likes it too (and not forcefully taken into that). \"Red pill\" is, like, way out there for me - it's a notion that a man can take any woman - nonsense if we consider that some women cheered when Trump was like \"grab them and such\", and some women would not like a single violation of consent, like tagging on Twitter. Women are just people. People are different.</p>\n<p>Musk's ex-wife made a song about him.</p>\n<p><a href=\"https://m.youtube.com/watch?v=ADHFwabVJec\">https://m.youtube.com/watch?v=ADHFwabVJec</a></p>\n<p>\"If I loved him any less, I'd make him stay\nBut he has to be the best , player of games\"</p>\n<p>She asserts she is aware of the ongoing \"push-pull\" pickup artistry from him, but refuses to apply it herself to achieve her goal, then says thay the dude is always at work basically</p>\n<p>I'd say by the video, using subjective holistic judgement, that he's legit red-pilled.</p>\n<p>And my post above says that red pill is extreme and linked to fascism.</p>\n<p>And I say it's related to so many cases of sexual assault in tech, EA, finance - people see \"simple markets\" where there's just so much more complexity, and not much markets necessarily :)</p>\n<p>Bite me :)</p>\n", "parentCommentId": "jgdoKBHHoHGhwqRn9", "user": {"username": "sergeivolodin"}}, {"_id": "koL2h95as3AHLGBni", "postedAt": "2023-03-02T20:50:30.951Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>No, the assumption is simply we don't want to poor and starving. There's a lot of very very, very poor people in the world. I would like their situation to improve. That means some economic growth. All the EA bednets and &nbsp;givedirectly and all this crap blah blah are absolutely worth zero, nada, nyet, compared to the incredible power of economic growth. Growth is so powerful because fast growth in one place can drag along loads of other places: look at how China's rise massively boosted growth in the countries in its supply chain. In fact you can make a pretty good argument that global development has been a complete disaster for decades in every other country apart from China AND those countries in its supply chain! Vide &nbsp;<a href=\"https://americanaffairsjournal.org/2022/11/the-long-slow-death-of-global-development/\">https://americanaffairsjournal.org/2022/11/the-long-slow-death-of-global-development/</a></p><p>Obviously this is a huge number of people and worth celebrating despite the growth failures across LatAm and Africa, but it means we can do better and it also means that boosting growth in the West through e.g AI, LLMs (not atm, a hallucinating chatbot is pretty useless but maybe we can make it good!) &nbsp;is potentially an absolutely massive win for the world. &nbsp;So accordingly I am massively skeptical towards the growth-killing Euro-regulatory impulse towards tech because it's clearly a) working out badly for Europe) b) very very bad for the world if it somehow got applied everywhere</p>", "parentCommentId": "sSFTLtv2cjjazChCX", "user": {"username": "Sabs"}}, {"_id": "h5wkcwndRzTMm9p8k", "postedAt": "2023-03-02T20:52:06.067Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>To sum up my other comment, yes, I want to confront you with normalizing red pill. I think it's fascist and dehumanising.</p>\n<p>Yes, I also think it's relevant to AI alignment, because a community that is not aligned itself, that is \"at war\" between it's own genders (tech people), is unlikely to align something else well.</p>\n<p>Saying this as a person from a fascist country who kinda supports an ex-fascist politician trying to do better and be kinder (see Navalny)</p>\n<p>Saying this as a sexual abuser and mentally abused.</p>\n<p>Saying this as one who apologized and saw that what I did was wrong. And one who now sees how stupid and unnecessary it was.</p>\n<p>Saying this as one who talked to pro-Putin people a lot to understand how this all works.</p>\n<p>There are ways to have both emotion and logic at peace and harmony. Together. Not at war.</p>\n<p>Red pill ain't it.</p>\n<p>It's extreme, agressive, ugly, stolen, perverted, dead.</p>\n", "parentCommentId": "jgdoKBHHoHGhwqRn9", "user": {"username": "sergeivolodin"}}, {"_id": "LQPGFxEqJSucrzhfR", "postedAt": "2023-03-02T21:08:00.278Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>First good proposal! That's what we're here for</p>\n<p>C'mon people, we can do it !! 💋💋</p>\n", "parentCommentId": "QvTAvyho6ExHHiBAW", "user": {"username": "sergeivolodin"}}, {"_id": "9XSCHh4cG3T4PDhbZ", "postedAt": "2023-03-02T21:10:12.927Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>My crux here is whether or not I think Anthropic has joined the arms race.</p>\n<p>Why do you believe that it has?</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "cxhc6sE7qkGauHFTR", "postedAt": "2023-03-02T21:11:06.304Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Oh I missed \"minor harms\" part.</p>\n<p>Well, I wish that you become a citizen of your own utopia, my darling 💜👿</p>\n<p>I wish that you are one of those who are considered \"minor\". Maybe then you'll see?</p>\n", "parentCommentId": "zcLKf5vfCyWBqDTYj", "user": {"username": "sergeivolodin"}}, {"_id": "wiCrNB9Hv5okCzdoS", "postedAt": "2023-03-02T21:16:26.561Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>a word of warning: the mods here are really dumb and over-censorious and &nbsp;barbed but friendly banter like this is highly frowned upon, so while I absolutely don't give a fuck you want to be careful w/ this kind of chat on this place....take it from someone who keeps getting banned<br><br>I do think the harms seems very minor though and especially minor relative to the potential benefits. Which could be quite large even if it's just automating boring stuff like sending emails faster or whatever! Add it up over an entire economy &amp; that's a lot of marginal gains.</p>", "parentCommentId": "cxhc6sE7qkGauHFTR", "user": {"username": "Sabs"}}, {"_id": "4LuA3EWZGkPWRrMkN", "postedAt": "2023-03-02T21:16:48.758Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Effective altruism's meta-strategy is about friendliness to (tech) power. All our funding comes from tech billionaires. We recruit at elite colleges. We strongly prioritize good relations with AI labs and the associated big tech companies. EA just isn't going to be genuinely critical or antagonistic toward the powerful groups we depend on for support and status. Not how EA works.</p>", "parentCommentId": null, "user": {"username": "deluks917"}}, {"_id": "BAzP2hXCiBJ5SoWr8", "postedAt": "2023-03-02T21:20:45.904Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>So you don't have any further reason to think Musk has anything to do with red pill philosophy, but you're going to cast a bunch of aspersions on him and then randomly insult me at the end.&nbsp;</p><p>Bye.</p>", "parentCommentId": "repP4G9Bo9Sy5rZgA", "user": {"username": "Arepo"}}, {"_id": "jJF7zXjqEsbnGbim2", "postedAt": "2023-03-02T21:23:37.398Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Here we have Microsoft's CEO saying they're \"gonna make Google dance\" with my comments about how Microsoft's CEO sounds like a comic book villain</p>\n<p><a href=\"https://twitter.com/sergia_ch/status/1624438579412799488?s=20\">https://twitter.com/sergia_ch/status/1624438579412799488?s=20</a></p>\n<p>If being serious, I don't feel it when thinking of the phrase \"Google just invested into Anthropic to advance AI safety\". Just don't feel it.</p>\n<p>Don't know why, maybe because of how Google handled it ethics team? Or when they said \"were not gonna be doing weapons\" and then like, started doing it? Just seems like something rather likely if we consider their character inferred from their previous actions that they want their own chat bot, to show everyone how smart they are (regardless of the consequences)</p>\n<p>Once a prof told me how he sees the ML field: people there don't do it for \"humanity\" or \"knowledge\", he told me it's because they want to show how their stuff is superior to someone else's and show off.</p>\n<p>Not everyone's like this, of course, but ML/tech has this vibe - people from the first row of seats from school who don't know anything about the real world and instead try to impress the teacher, living of petty drama between same people on the front row.</p>\n<p>A lot of people like this in ML</p>\n<p>Saying this as ex one of those people.</p>\n<p>To sum up, here's my personal story as one who was in the field, and as in another reply, I invite you to form your own understanding based on whatever you like.</p>\n<p>I can't convince you, I only have a personal story as an AIS beginning researcher, I don't have statistics and expected value calculations people here seem to want.</p>\n<p>Thank you</p>\n", "parentCommentId": "9XSCHh4cG3T4PDhbZ", "user": {"username": "sergeivolodin"}}, {"_id": "9tXMn8fuBvyhHjcd7", "postedAt": "2023-03-02T21:25:59.937Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>This doesn't seem like a bad meta-strategy, fwiw. Surely otherwise EA just gets largely ignored.</p>", "parentCommentId": "4LuA3EWZGkPWRrMkN", "user": {"username": "Sabs"}}, {"_id": "kXpazRKAKoZn9mpYB", "postedAt": "2023-03-02T21:30:57.069Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I totally feel this isn't the only choice to do things. There are massive crowdfunding campaigns that work.</p>\n<p>I think that an entity that is not opposing itself to the power in any way has its own limitations, serious limitations.</p>\n<p>Here's an example from Russia where some charities collect money, but HAVE to say they're pro-government.</p>\n<p>In many cases those were criticised, and I think justly, that they created more troubles than the effects of their charity.</p>\n<p>For example, some used TV ads to gather money for cancer treatment for children.</p>\n<p>However, the real problem is: Putin used all the taxes and gas profits on his wars and \"internet research\" operations, as well as personal luxury items.</p>\n<p>So these charities, some argue, were used as a \"front\" by the government to convince people that \"medicine is OK, no need to worry\"</p>\n<p>Those charities only helped like, the few, and some argue, if they didn't exist, at all, people wouldn't have a false belief that \"healthcare works fine in Russia\", and would protest and maybe we could get it.</p>\n<p>All because of charity's inability to protest against existing power structures.</p>\n<p>I think it applies to alignment too, it's hard to do alignment when one gets funding from a corp that has a financial interest in \"profit first safety second\"</p>\n", "parentCommentId": "4LuA3EWZGkPWRrMkN", "user": {"username": "sergeivolodin"}}, {"_id": "LLgB5cBYm3Ya45ejk", "postedAt": "2023-03-02T21:33:09.171Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>You assume that \"anything not super big gets ignored\". The world of \"grand battles\" is good for some, not all. Same as the world of \"small independent entities\" is good for some, not all.</p>\n<p>Alignment, however, is for the whole of humanity.</p>\n<p>So. What do we do with this?</p>\n", "parentCommentId": "9tXMn8fuBvyhHjcd7", "user": {"username": "sergeivolodin"}}, {"_id": "ob9c4kHAzpnWEd5zr", "postedAt": "2023-03-02T21:35:14.234Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I downvoted this post because it felt rambling and not very coherent (no offence). You can fix it though :-).</p>\n<p>I would also be in favour in having more information on their plan.</p>\n<p>The EA Corner Discord might be a better location to post things like that are very raw and unfiltered. I often post things to a more casual location first, then post an improved version either here or on Less Wrong. For example, I often use Facebook or Twitter for this purpose.</p>\n", "parentCommentId": "HJuFFenNmtatKTFfA", "user": {"username": "casebash"}}, {"_id": "NE77PLoxDTZznLZ6J", "postedAt": "2023-03-02T21:35:42.876Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I'm not insulting <em>you</em>. I'm challenging your <em>belief</em>.</p>\n<p>And, where is the insult? Which line?.. I'm saying that the red pill ideology is fascist. How does it insult you? Well, unless...</p>\n<p>And yes, I think that if his multiple wifes all say kinda the same thing, it's legit evidence. Yes.</p>\n<p>And yes, I believe this is relevant for alignment. Directly. A community of red pillers creates an AI. Where would it go and what would it do?..</p>\n", "parentCommentId": "BAzP2hXCiBJ5SoWr8", "user": {"username": "sergeivolodin"}}, {"_id": "CKwXhpNiHRkpZnZvF", "postedAt": "2023-03-02T21:37:02.950Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>See my other comment in the same thread</p>\n", "parentCommentId": "9tXMn8fuBvyhHjcd7", "user": {"username": "sergeivolodin"}}, {"_id": "jqrNKyDyPPEEPutLt", "postedAt": "2023-03-02T21:38:43.088Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>It is rambling and incoherent. See why here: <a href=\"https://forum.effectivealtruism.org/posts/bmfR73qjHQnACQaFC/call-to-demand-answers-from-anthropic-about-joining-the-ai?commentId=EaBHtEpJCEv4HnQky\">https://forum.effectivealtruism.org/posts/bmfR73qjHQnACQaFC/call-to-demand-answers-from-anthropic-about-joining-the-ai?commentId=EaBHtEpJCEv4HnQky</a></p>\n<p>It's a part of what I'm talking about here</p>\n", "parentCommentId": "ob9c4kHAzpnWEd5zr", "user": {"username": "sergeivolodin"}}, {"_id": "uqzwAqmvNF8EKhFjf", "postedAt": "2023-03-02T21:40:49.288Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>There will be no more editing. I have done quite a lot in this direction (not on the EA forum). I have experience in political movements - when one does so much but the community is still not \"getting it\", the solution is for the community to figure things out for itself. Maybe after all I am wrong?</p>\n<p>This isn't a school assignment. Your grade on my post is meaningless.</p>\n<p>What does make sense is how you feel about the problem itself and what you will do.</p>\n", "parentCommentId": "ob9c4kHAzpnWEd5zr", "user": {"username": "sergeivolodin"}}, {"_id": "ubmFtNbiko7CHzZhu", "postedAt": "2023-03-02T21:58:55.927Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Well then, to the mods: I don't like utilitarianism, I was hurt by it and I feel it's well within my rights to show why utilitarianism might be not ok, with a personal example for Sabs.</p>\n<p>And if you ban me: I don't want to be a part of community that says \"it's normal to ignore suffering of many people, if they're not everyone, just select groups\"</p>\n<p>This would make it an official statement from EA. We all feel it's like this, but legit evidence is even better.</p>\n", "parentCommentId": "wiCrNB9Hv5okCzdoS", "user": {"username": "sergeivolodin"}}, {"_id": "vgzmRFxMPzPrJErLt", "postedAt": "2023-03-02T22:00:30.618Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Oh and Sabs, why do you consider your own utopia an insult and a danger, something that I might get blocked for for point it out?</p>\n", "parentCommentId": "ubmFtNbiko7CHzZhu", "user": {"username": "sergeivolodin"}}, {"_id": "aQdW8iGrAuAY8bMCe", "postedAt": "2023-03-02T22:01:18.599Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>The <a href=\"https://astralcodexten.substack.com/p/openais-planning-for-agi-and-beyond\">most recent Scott Alexander Post </a>seems potentially relevant to this discussion.</p><p>The following long section is about what OpenAI could be thinking – and might also translate to Anthropic. (The rest of the post is also worth checking out.)</p><blockquote><h2>Why OpenAI Thinks Their Research Is Good Now, But Might Be Bad Later</h2><p>OpenAI understands the argument against burning timeline. But they counterargue that <i>having the AIs</i> speeds up alignment research and all other forms of social adjustment to AI. If we want to prepare for superintelligence - whether solving the technical challenge of alignment, or solving the political challenges of unemployment, misinformation, etc - we can do this better when everything is happening gradually and we’ve got concrete AIs to think about:</p></blockquote><blockquote><p><i>\"We believe we have to continuously learn and adapt by deploying less powerful versions of the technology in order to minimize “one shot to get it right”&nbsp;scenarios […] As we create successively more powerful systems, we want to deploy them and gain experience with operating them in the real world. We believe this is the best way to carefully steward AGI into existence—a gradual transition to a world with AGI is better than a sudden one. We expect powerful AI to make the rate of progress in the world much faster, and we think it’s better to adjust to this&nbsp;incrementally.</i></p><p><i>A gradual transition gives people, policymakers, and institutions time to understand what’s happening, personally experience the benefits and downsides of these systems, adapt our economy, and to put regulation in place. It also allows for society and AI to co-evolve, and for people collectively to figure out what they want while the stakes are relatively&nbsp;low.\"</i></p></blockquote><blockquote><p>You might notice that, as written, this argument doesn’t support full-speed-ahead AI research. If you really wanted this kind of gradual release that lets society adjust to less powerful AI, you would do something like this:</p><ul><li>Release AI #1</li><li>Wait until society has fully adapted to it, and alignment researchers have learned everything they can from it.</li><li>Then release AI <a href=\"https://forum.effectivealtruism.org/posts/Ps8ecFPBzSrkLC6ip/2018-2019-long-term-future-fund-grantees-how-did-they-do\">2018-2019 Long-Term Future Fund Grantees: How did they do?</a> Wait until society has fully adapted to it, and alignment researchers have learned everything they can from it.</li><li>And so on . . .</li></ul><p>Meanwhile, in real life, OpenAI released ChatGPT in late November, helped Microsoft launch the Bing chatbot in February, and plans to announce GPT-4 in a few months. Nobody thinks society has even partially adapted to any of these, or that alignment researchers have done more than begin to study them.</p><p>The only sense in which OpenAI supports gradualism is the sense in which they’re not doing lots of research in secret, then releasing it all at once. But there are lots of better plans than either doing that, <i>or</i> going full-speed-ahead.</p><p>So what’s OpenAI thinking? I haven’t asked them and I don’t know for sure, but I’ve heard enough debates around this that I have some guesses about the kinds of arguments they’re working off of. I think the longer versions would go something like this:</p><p><strong>The</strong> <strong>Race Argument</strong>:</p><ol><li>Bigger, better AIs will make alignment research easier. At the limit, if no AIs exist at all, then you have to do armchair speculation about what a future AI will be like and how to control it; clearly your research will go faster and work better after AIs exist. But by the same token, studying early weak AIs will be less valuable than studying later, stronger AIs. In the 1970s, alignment researchers working on industrial robot arms wouldn’t have learned anything useful. Today, alignment researchers can study how to prevent language models from saying bad words, but they can’t study how to prevent AGIs from inventing superweapons, because there aren’t any AGIs that can do that. The researchers just have to hope some of the language model insights will carry over. So all else being equal, we would prefer alignment researchers get more time to work on the later, more dangerous AIs, not the earlier, boring ones.</li><li>“The good people” (usually the people making this argument are referring to themselves) currently have the lead. They’re some amount of progress (let’s say two years) ahead of “the bad people” (usually some combination of Mark Zuckerberg and China). If they slow down for two years now, the bad people will catch up to them, and they’ll no longer be setting the pace.</li><li>So “the good people” have two years of lead, which they can burn at any time.</li><li>If the good people burn their lead now, the alignment researchers will have two extra years studying how to prevent language models from saying bad words. But if they burn their lead in 5-10 years, right before the dangerous AIs appear, the alignment researchers will have two extra years studying how to prevent advanced AGIs from making superweapons, which is more valuable. Therefore, they should burn their lead in 5-10 years instead of now. Therefore, they should keep going full speed ahead now</li></ol><p><strong>The</strong> <strong>Compute Argument</strong>:</p><ol><li>Future AIs will be scary because they’ll be smarter than us. We can probably deal with something a little smarter than us (let’s say IQ 200), but we might not be able to deal with something much smarter than us (let’s say IQ 1000).</li><li>If we have a long time to study IQ 200 AIs, that’s good for alignment research, for two reasons. First of all, these are exactly the kind of dangerous AIs that we can do good research on - figure out when they start inventing superweapons, and stamp that tendency out of them. Second, these IQ 200 AIs will probably still be <i>mostly</i> on our side <i>most </i>of the time, so maybe they can do some of the alignment research themselves.</li><li>So we want to maximize the amount of time it takes between IQ 200 AIs and IQ 1000 AIs.</li><li>If we do lots of AI research now, we’ll probably pick all the low-hanging fruit, come closer to optimal algorithms, and the limiting resource will be compute - ie how many millions of dollars you want to spend building giant computers to train AIs on. Compute grows slowly and conspicuously - if you’ve just spent $100 million on giant computers to train AI, it will take a while before you can gather $1 billion to spend on even gianter computers. Also, if terrorists or rogue AIs are gathering a billion dollars and ordering a giant computer from Nvidia, probably people will notice and stop them.</li><li>On the other hand, if we do very little AI research now, we might not pick all the low-hanging fruit, and we might miss ways to get better performance out of smaller amounts of compute. Then an IQ 200 AI could invent those ways, and quickly bootstrap up to IQ 1000 without anyone noticing.</li><li>So we should do lots of AI research now.</li></ol><p><strong>The</strong> <strong>Fire Alarm Argument</strong>:</p><ol><li>Bing’s chatbot tried to blackmail its users, but nobody was harmed and everyone laughed that off. But at some point a stronger AI will do something really scary - maybe murder a few people with a drone. Then everyone will agree that AI is dangerous, there will be a concerted social and international response, and maybe something useful will happen. Maybe more of the world’s top geniuses will go into AI alignment, or will be easier to coordinate a truce between different labs where they stop racing for the lead.</li><li>It would be nice if that happened five years before misaligned superintelligences building superweapons, as opposed to five months before it, since five months might not be enough time for the concerted response to do something good.</li><li>As per the previous two arguments, maybe going faster now will lengthen the interval between the first scary thing and the extremely dangerous things we’re trying to prevent.</li></ol><p>These three lines of reasoning argue that that burning a lot of timeline now might give us a little more timeline later. This is a good deal if:</p><ol><li>Burning timeline now <i>actually</i> buys us the extra timeline later. For example, it’s only worth burning timeline to establish a lead if you can actually get the lead and keep it.</li><li>A little bit of timeline later is worth a lot of timeline now.</li><li>Everybody between now and later plays their part in this complicated timeline-burning dance and doesn’t screw it up at the last second.</li></ol><p>I’m skeptical of all of these.</p></blockquote>", "parentCommentId": null, "user": {"username": "TobiasH"}}, {"_id": "grQGBg9teRL5qNNTN", "postedAt": "2023-03-02T22:09:10.757Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>This analysis seems to be considering only the future value, ignoring current value. How does it address current issues, like ones here?</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/bmfR73qjHQnACQaFC/call-to-demand-answers-from-anthropic-about-joining-the-ai?commentId=ZxxC8GDgxvkPBv8mK\">https://forum.effectivealtruism.org/posts/bmfR73qjHQnACQaFC/call-to-demand-answers-from-anthropic-about-joining-the-ai?commentId=ZxxC8GDgxvkPBv8mK</a></p>\n<p>Why does a small secretive group of ppl who plan to do some sort of a \"world AI revolution\" that brings \"UBI\" (without much plan on how exactly) is by-default considering itself \"good\"</p>\n<p>I'm one of those who was into this secretive group of people before, only to see how much there is on the outside.</p>\n<p>Not everyone think what currently is is \"good by-default\"</p>\n<p>Goodness comes from participation, listening, talking to each other. Not necessarily from some moral theory.</p>\n<p>I call to discuss this plan with larger public. I think it will go well and I have evidence for this if you're interested.</p>\n<p>Thank you.</p>\n", "parentCommentId": "aQdW8iGrAuAY8bMCe", "user": {"username": "sergeivolodin"}}, {"_id": "pNmdDXYrcQCTNwhQo", "postedAt": "2023-03-02T23:05:32.458Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>This subthread seems to be going in a bad direction. I would encourage those wanting to discuss the net-value of Elon Musk and Peter Thiel on the world to do so elsewhere.</p>", "parentCommentId": "PkB6xo73oNz6gPNYS", "user": {"username": "jpaddison"}}, {"_id": "Qw6Ac7jLwyari4r8v", "postedAt": "2023-03-02T23:31:29.434Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I mean I don't even understand how you feel. It's just vague amounts of upsetness and trauma and a want for Anthropic to respond? I think people just don't share your feelings and find your feelings incongruent with how they view the empirical facts. Like even in this thread you can't decide between wanting releasing of models and \"public participation\". Then you also say these models cause current day harms (Claude isn't released yet?). While also citing people whose ethics are just open sourcing and releasing it (e.g. Huggingface's Dall-E Mini didn't even have a pornography blocker for the first few days).&nbsp;</p><p>I think you say you want a discussion about Anthropic (this has been done quite a lot on the forum) but then you give no way to do so. Then anytime the discussion disagrees with you, you retreat back to justifying the post by saying it's \"trauma\" and \"your grade on my post doesn't matter\".&nbsp;</p>", "parentCommentId": "uqzwAqmvNF8EKhFjf", "user": {"username": "zichenghuang"}}, {"_id": "YCP8faDc59xrxvxC4", "postedAt": "2023-03-02T23:32:16.648Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Well, I feel the \"red pill\" part is directly relevant to alignment, both for current and long-term issues, the values that go into the AI part, and the power structure of the AI company that does it part.</p>\n<p>I guess that's why I included it into my post, don't really know, I did it with mostly emotion and emotion is not well-interpretable always (sometimes for the best).</p>\n<p>I do feel we (EA , tech, finance and related) need to discuss this as a community, the \"red pill\" stuff and whether it's extreme (my experience n=1 and my interpretation of m=~100 other people says that yes, it's a poorly and vaguely phrased partial theory that mostly explains how traumatic, unhappy, unhealthy relationships work (traumatized people are ones who will be most responsive to the \"push-pull\" pickup artistry, not because \"this is how people are\" but because \"this is how traumatized people try to be happy and fail\"), giving a phenomenological explanation with a completely wrong and actively harmful explanation of the underlying causes, with links to fascism and dehumanisation, agressiveness and fatalism)</p>\n<p>Personally, I feel in a lot of cases this ideology is the reason people are unsuccessful in relationships: it is a fake cure for a problem that was probably \"just\" trauma  and misunderstanding in the first place. Like, a society-wide misunderstanding between genders. Again, my personal view.</p>\n<p>See my other comments about how \"a society which is not aligned within itself is unlikely to be able to align other entities well\". Something as massive as this I believe should be addressed first before anything external can be taken care of</p>\n<p>Same reason I feel the discussion \"apple&amp;android vs Nokia&amp;fxtec\" in another thread is very very very directly relevant to alignment, again, both power structure-wise and values themselves-wise.</p>\n<p>Don't really know to best do such a discussion, again, I'm only one person, I don't really know :)</p>\n<p>I am tired. I want a vacation from all this.</p>\n<p>I have hope in the community that they are smart and capable and can sort these things through.</p>\n", "parentCommentId": "pNmdDXYrcQCTNwhQo", "user": {"username": "sergeivolodin"}}, {"_id": "S2KmvmzxaNNHL6LNv", "postedAt": "2023-03-02T23:34:53.817Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>This comment is the reason why I started this and the result of my post. I see it as a success.</p>\n<p>So, can we have a larger discussion about this?</p>\n<p>I am only one person. I did this post.</p>\n<p>To do a bigger discussion, there needs to be more people.</p>\n<p>I see you care about this.</p>\n<p>2+2=...</p>\n", "parentCommentId": "Qw6Ac7jLwyari4r8v", "user": {"username": "sergeivolodin"}}, {"_id": "tyu9tzKdAry6DG3vT", "postedAt": "2023-03-02T23:40:17.358Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I would not like to discuss things with you given how your previous actions I don't think that would be fruitful for anyone involved.</p>", "parentCommentId": "S2KmvmzxaNNHL6LNv", "user": {"username": "zichenghuang"}}, {"_id": "yeSf85PWbNuPGurPL", "postedAt": "2023-03-02T23:43:57.793Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>To be less cryptic, it's not really about me. It's about the community finally discussing these real pressing problems instead of talking about only shrimp and infinite ethics (nothing wrong with that, but not when there's a big pressing issue with something being off in AIS)</p>\n<p>I'm just one person. I hold the positions that \"completely no regulation\" is not the way, that \"too much regulation\" is not the way, \"talking to public\" is the way, \"culture war can be healed\", \"billionaire funding only is not the way\", \"listening and learning is the way\", \"Anthropic seems off\", \"AIS culture seems off\", \"EAs are way too ignorant of everything that's current or outside EA\", \"red pill is widespread in tech and EA and this is not ok\", \"let's discuss it broadly\" in general</p>\n<p>My experience led me to these beliefs and I have things to show for each of those.</p>\n<p>I don't really know what's the best way of aligning AI. What is definitely a first step is to at least have some consensus, or at least a concrete map of disagreements on these issues.</p>\n<p>So far, the approach of the community is \"big people in famous EA entities do it, and we discuss mostly not pressing issues about infinities while they over there make controversial potentially civilization-altering decisions (if one believes ™️), unaccountable and vague on top of an ivory tower\"</p>\n<p>My post is a way to deal with it and I see it as a success.</p>\n<p>I am not your leader. I will not do things you said I should do. I will not \"lead\" this discussion - it is impossible.</p>\n<p>What I can do is inspire people to do it better than me.</p>\n<p>Your move.</p>\n", "parentCommentId": "S2KmvmzxaNNHL6LNv", "user": {"username": "sergeivolodin"}}, {"_id": "hnpRjLaHQQZAjGSDQ", "postedAt": "2023-03-02T23:45:13.678Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Don't discuss it with me! Discuss it with the community! :) I'm not an EA!!!</p>\n", "parentCommentId": "tyu9tzKdAry6DG3vT", "user": {"username": "sergeivolodin"}}, {"_id": "fGWHhkg5SFkJEE8Nf", "postedAt": "2023-03-02T23:54:22.867Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>At the same time you say \"boosting growth\" and also you're for \"breaking eggs to make an omelet (go big or go home, move fast and break things, those)\"</p>\n<p>So it's like a train that is very fast and innovative. The people on the train are getting to their destination fast</p>\n<p>The only issue is that the train is rolling over people chained to the tracks :)</p>\n<p>And you are the train machinist and you say \"progress!\"</p>\n<p>Well, in another life you are the one chained to the tracks :)</p>\n<p>Can we just move like 10% slower</p>\n<p>Again. In bold</p>\n<p>JUST 10% SLOWER</p>\n<p>CAN YOU HEAR ME\nOH YOU LIBERTARIAN</p>\n<p>JUST 10%</p>\n<p>Just a bit of regulation. Just enough to unchain the people.</p>\n<p>And then I'm good with all you say.</p>\n", "parentCommentId": "koL2h95as3AHLGBni", "user": {"username": "sergeivolodin"}}, {"_id": "n727nDvdk2a639MyB", "postedAt": "2023-03-03T00:00:02.976Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I feel when you hear regulation you assume that there's gonna be Putin-style regulation</p>\n<p>Putin is not the only way. Not the 146%</p>\n<p>EU is not the only thing about regulation that exists. Not the 30% (I don't know. It's a number not reflecting anything in particular I just made up)</p>\n<p>JUST. 10. PERCENT.</p>\n<p>Just to inform the patients of the mental health startup.\nJust add a bit of public oversight into AI.\nJust at least break up Insta and FB so they compete like they should\nJust rehire the Google ethics team and let them inform the public about biased and what to do, fix the biggest issues. Possibly done in a few months or so?</p>\n<p>Just like a tiny winy bit will go so far.</p>\n", "parentCommentId": "fGWHhkg5SFkJEE8Nf", "user": {"username": "sergeivolodin"}}, {"_id": "p3vw6BXz5WB9cNdMY", "postedAt": "2023-03-03T00:13:13.972Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I don't know if demanding answers makes sense, but I do think it's a pretty hard call whether Anthropic is net positive or net negative for AI safety; I'm surprised at the degree to which some people seem to think this question is obvious; I'm annoyed at the EA memeplex for not making this uncertainty more transparent to newcomers/outsiders; I hope not too many people join Anthropic for bad reasons.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "cPfhztu73ykXWeRPk", "postedAt": "2023-03-03T00:14:52.766Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>To be more object-level,</p>\n<p>YES I am confused in terms of \"releasing models\" and \"public participation\". Very very much.</p>\n<p>I don't think it's just me though.</p>\n<p>The Google ethics team is confused too: Margaret Mitchell went to do Hugging face and Timnit Gebru went to do public participation.</p>\n<p>All of this is tricky, like, there's a culture war in many countries and somehow in those conditions we need to do a discussion about AI. We can't not do it: secrets will only make it worse, because of lack of feedback, backlash, and lack of oversight.</p>\n<p>Releasing models makes them more easy to inspect but also opens doors to bad actors.</p>\n<p>It's a mess.</p>\n<p>It's more like the whole industry is confused.</p>\n<p>What seems reasonable is to slow all this down a bit. It's likely that a lot of ML people are burned out working so fast and not thinking clearly.</p>\n<p>We saw Yudkowsky talking on Twitter and trying to save everyone - that doesn't seem like things are going particularly well.</p>\n<p>As you have seen, I am definitely for slowing things down - all in for that.</p>\n<p>How can we do that, so later we can discuss all this mess, at least be in a sane state for that?</p>\n", "parentCommentId": "S2KmvmzxaNNHL6LNv", "user": {"username": "sergeivolodin"}}, {"_id": "dtymDBCqCaA4QjpCA", "postedAt": "2023-03-03T00:20:11.636Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I'm looking at this discourse since 2018, including when I was in EA and doing AI safety.</p>\n<p>At no point I saw a discussion whether a big EA-adjacent org is net-positive or net-negative.</p>\n<p>It's some sort of a \"blind spot\": we evaluate other people's charities. But ours are, of course, pretty good.</p>\n<p>I feel it's time to have a discussion about this, that would be awesome.</p>\n", "parentCommentId": "p3vw6BXz5WB9cNdMY", "user": {"username": "sergeivolodin"}}, {"_id": "PximFbxWv8pnAsfzP", "postedAt": "2023-03-03T00:24:10.887Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Concrete question (I don't have much of that today)</p>\n<p>Have you been to Europe?</p>\n", "parentCommentId": "zcLKf5vfCyWBqDTYj", "user": {"username": "sergeivolodin"}}, {"_id": "xXqa98Xm28AsBmWJH", "postedAt": "2023-03-03T00:25:16.789Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I'm asking seriously, because I feel what you say speaks to alot of people in Silicon Valley, so I ask this question to you and them in some way as well.</p>\n", "parentCommentId": "PximFbxWv8pnAsfzP", "user": {"username": "sergeivolodin"}}, {"_id": "BwHuued785ETKiDaz", "postedAt": "2023-03-03T00:29:33.710Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I mean in at least in global health and animal welfare, most of the time we don't evaluate charities for being net-negative, we only look at \"other people's charities\" that are already above a certain bar. I would be opposed to spending considerable resources looking at net negative charities in normal domains, most of your time is much better spent trying to triage resources to send to great projects and away from mediocre ones.</p><p>In longtermism or x-risk or meta, everything is really confusing so looking at net-positive vs net-negative becomes more compelling.</p><p>For what it's worth, it's very common at LTFF and other grantmakers to consider whether grants are net negative.</p><p>Also to be clear, you don't consider OpenAI to be EA-adjacent right? Because I feel like there are many discussions about OpenAI's sign over the years.</p>", "parentCommentId": "dtymDBCqCaA4QjpCA", "user": {"username": "Linch"}}, {"_id": "vy6ELoBJW7YvwRrgH", "postedAt": "2023-03-03T00:53:04.684Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I feel I have failed right here. I want somehow EA people talking to each other and finally deciding something together. Not to me.</p>\n<p>I don't really know. I'm not the one to ask :)</p>\n<p>What is \"EA-adjacent\"? Well, we can come up with a some phrase for a definition. Then see how some corner cases don't fit into that, extend the definition, repeat it a few times.</p>\n<p>It would work for some phases of EA (like when there were only bed nets) but not for the future, it will need to be updated.</p>\n<p>This seems to be mostly what people do here - dividing the world into concrete blocks with some structure on top.</p>\n<p>That doesn't answer any of the concerns, it's so far away - creating some taxonomy of what's EA and what's not in EA...</p>\n<p>What was the issue? That some people at Anthropic stopped informing us what's going on. That the industry is kinda confused what to do, burned out, and some (with me) say radicalised into some \"male warriors going bravely and gloriously into Valhalla full speed\". That there are so many issues with AI <em>today</em> (how to talk to the public? How to get help with this? How to stop current harm? What about regulation? Etc etc etc) that it seems that people tend to just ignore it all and focus on the shrimp and infinite ethics. I feel this lethargy and apathy too. Let's not go there, this is has only one possible ending.</p>\n<p>Let's evaulate THAT.</p>\n<p>It doesn't matter how we define it.</p>\n<p>Does the culture of OpenAI and EA intersect? Yes. A lot.\nAre they causally linked? Yes. A lot.\nIs Anthropic causally linked to all this as well? Yes. A lot.</p>\n<p>Is something wrong over there? Yes. Definitely looks like it to me.</p>\n<p>That's all that matters. Since we're (apparently) people who are supposed to do something about it. Let's do it. Let's finally do a debate about whether \"ignoring issues today is acceptable\". Let's discuss \"what do we want Anthropic and maybe OpenAI to do\", let's discuss \"how can we get outside people to help\". Let's finally discuss \"whether red-pilled stuff is ok\"</p>\n<p>All of this that was ignored for decades apparently.</p>\n<p>Can we please not put it under the rug?</p>\n<p>About the discussion - ethicists are going to TV programs and it's going pretty well. No \"normie don't understand\" no, none of it. Working quite ok so far.</p>\n<p>No need for \"write your post in a format that I can parse with my RationalityParser9000. Syntax error on line 1, undefined entity 'emotion'. Error. Loading shrimp welfare...\" 💔</p>\n<p>C'mon. Nothing to be afraid of. You really don't need a tranny from Russia to lead you into a discussion about some next shit that's about to blow in Silicon Valley . I'm pretty sure you can do it :)</p>\n<p>Don't ask me, I'm an immigrant here. The \"minor inconvenience\", \"a mere remainder, mere ripples\" in someone's utopia, an artifact in a render, a glitch, a fluke, a \"disappointment to EA leaders seeing me\". I don't know.</p>\n<p>Ask other EAs:)</p>\n", "parentCommentId": "BwHuued785ETKiDaz", "user": {"username": "sergeivolodin"}}, {"_id": "PFRKB67YTFfhEpx4b", "postedAt": "2023-03-03T09:56:51.746Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>So rather than a specific claim about specific activities being done by Anthropic, would you say that:</p>\n<ol>\n<li>\n<p>from your experiences, it’s very common for people to join the arms race under the guise of safety</p>\n</li>\n<li>\n<p>you think by default, we should assume that new AI Safety companies are actually joining the arms race, until proven otherwise</p>\n</li>\n<li>\n<p>the burden of proof should essentially rest on Anthropic to show that they are really doing AI Safety stuff?</p>\n</li>\n</ol>\n<p>Given the huge potential profits from advancing AI capabilities faster than other companies and my priors on how irrational money makes people,  I’d support that view.</p>\n", "parentCommentId": "jJF7zXjqEsbnGbim2", "user": {"username": "freedomandutility"}}, {"_id": "7DYdyqMNqq3F8LGad", "postedAt": "2023-03-03T11:17:53.341Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Can you please take this comment down or edit it given you have inexplicably used a slur (not that there ever is a good context)</p>\n", "parentCommentId": "vy6ELoBJW7YvwRrgH", "user": {"username": "Gideon Futerman"}}, {"_id": "zorwBRapg2kJZ5AqW", "postedAt": "2023-03-03T17:47:23.768Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>In addition, we are issuing a warning to sergia, for this and other comments. Sergia, please read <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">the EA Forum norms post</a> and, if you're in doubt of whether your comment is meeting those norms, please wait for a while and revise your comment.</p>", "parentCommentId": "PkB6xo73oNz6gPNYS", "user": {"username": "jpaddison"}}, {"_id": "toZSqHXr9PPupFN2d", "postedAt": "2023-03-05T00:36:31.655Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Feels kinda mean to tell a non-native speaker off for using a slur about their own group.&nbsp;</p>", "parentCommentId": "7DYdyqMNqq3F8LGad", "user": {"username": "Linch"}}, {"_id": "pQDFKWyscC5cpXcyG", "postedAt": "2023-03-05T00:59:28.774Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Ah apologies, my mistake I didn't know, possibly wrong of me to assume this was in bad faith, and I definitely don't want to tell trans people how to refer to themselves.</p>\n", "parentCommentId": "toZSqHXr9PPupFN2d", "user": {"username": "Gideon Futerman"}}, {"_id": "Fx7C2ndivmCNZbSTA", "postedAt": "2023-03-05T01:02:57.147Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>See for example this summary of someone who spent quite a lot of time trying to understand and pass the ITT of Anthropic's strategy: <a href=\"https://www.lesswrong.com/posts/MNpBCtmZmqD7yk4q8/my-understanding-of-anthropic-strategy\">https://www.lesswrong.com/posts/MNpBCtmZmqD7yk4q8/my-understanding-of-anthropic-strategy</a>&nbsp;</p><blockquote><p>Anthropic is planning to grow. They’re aiming to be one of the “top players”, competitive with OpenAI and Deepmind, working with a similar level of advanced models. They have received <a href=\"https://www.lesswrong.com/posts/aF8Hnnmn5au5DLvYk/linkpost-google-invested-usd300m-in-anthropic-in-late-2022\">outside</a> <a href=\"https://siliconangle.com/2022/04/29/ai-research-company-anthropic-raises-580m-funding/\">investment</a>, because keeping up with state of the art is expensive, and going to get moreso. They’ve recently been hiring for a <a href=\"https://jobs.mindtheproduct.com/job/anthropic-san-francisco-ca-usa-3-product-manager-lead/\">product team</a>, in order to get more red-teaming of models and eventually have more independent revenue streams.&nbsp;</p><p>I think Anthropic believes that this is the most promising route to making AGI turn out well for humanity, so it’s worth taking the risk of being part of the competition and perhaps contributing to accelerating capabilities. Alternatively stated, Anthropic leadership believes that you can’t solve the problem of aligning AGI independently from developing AGI.&nbsp;</p></blockquote>", "parentCommentId": "9XSCHh4cG3T4PDhbZ", "user": {"username": "Habryka"}}, {"_id": "rDTWHvwFaEHcBnwBt", "postedAt": "2023-03-05T01:11:34.121Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>tbc I don't know any more than you here, and I only have the text of the comment to go off of. I just interpreted \"You really don't need a [blip] from Russia to lead you into a discussion about some next shit that's about to blow in Silicon Valley . I'm pretty sure you can do it :)</p><p>Don't ask me, I'm an immigrant here.\" as referring to themselves. I found the rest of the comment kind of hard to understand so it's definitely possible I also misunderstood things here.</p>", "parentCommentId": "pQDFKWyscC5cpXcyG", "user": {"username": "Linch"}}, {"_id": "u8HuXxCPfeAoxYpwf", "postedAt": "2023-03-05T01:22:40.379Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Nah it maybe seems like I was wrong. If so, apologies OP!</p>\n", "parentCommentId": "rDTWHvwFaEHcBnwBt", "user": {"username": "Gideon Futerman"}}, {"_id": "DyTirBMdsWd2gMYnm", "postedAt": "2023-03-07T17:04:09.029Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Yes, it's about me, I'm a trans girl from Russia. Yes I'm saying that it would be weird to me if I do something with the EA community.</p>\n<p>People here believe it's ok to believe in \"red pill\" (not the one from the movie, the other one, see in the most downvoted subthread here). I don't want this in my life. It doesn't feel ok to me to believe in that.</p>\n<p>People here believe in utilitarianism (see comments of Sabs, he's not alone in this), which usually makes people like me the \"mere ripples\".</p>\n<p>It would just feel weird: a peasant helping the master to deal with some issue together?</p>\n<p>The world is not ready for it.</p>\n<p>I'd love to be proved wrong though.</p>\n<p>I have experience that it's like this: I say something, polite, not polite, anything, related to this set of issues - I get downvoted or asked to \"rephrase it in some way\".</p>\n<p>What I really want is answers.</p>\n<p>Like, the RX/TX balance of this conversation is: I sent a lot of stuff to EAs, got not much neaniful response.</p>\n<p>So I stop.</p>\n", "parentCommentId": "rDTWHvwFaEHcBnwBt", "user": {"username": "sergeivolodin"}}, {"_id": "inbdx4TeGrjLcuBTn", "postedAt": "2023-03-07T17:06:42.901Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>Do you believe in it?</p>\n<p>Just seems weird if someone said \"to be safe from a deadly disease, what we really need is to develop it as soon as we can\"</p>\n<p>I get that the metaphore has holes, just, seems a bit \"out there\".</p>\n<p>I'd say that \"to have safe agi, we need to do agi engineering the fastest way possible\" is a very extraordinary claim.</p>\n<p>It requires very extraordinary evidence to support it.</p>\n<p>My thing which is \"can we ask them to explain it\" seems like a very ordinary claim to me.</p>\n<p>So it doesn't require much evidence at all.</p>\n", "parentCommentId": "Fx7C2ndivmCNZbSTA", "user": {"username": "sergeivolodin"}}, {"_id": "vpLHHaiQA37LBa5eo", "postedAt": "2023-03-07T17:23:52.314Z", "postId": "bmfR73qjHQnACQaFC", "htmlBody": "<p>I'm mostly leaving - I have said basically the same thing over and over again. In a polite way. In a more twitter way like here. The Concerned EAs said it in an EA forum style post. At this point, I see that I have done everything that I could.</p>\n<p>In general, I feel this conversation between leftists and EAs fails because of holistic vs logical reasoning.</p>\n<p>EAs tend to believe that \"logical reasoning\" is superior to \"holistic reasoning\"</p>\n<p>Holistic reasoning is good at spotting patterns. Logic is good at disproving the patterns exist, by cutting the thing into a taxonomy with a sharp razor of this logical reasoning.</p>\n<p>What I'm presenting is a pattern. Of course it's not a completely correct statement in a logical sense: I don't really know how it is. All I say is: I'm concerned that I see it.</p>\n<p>What I get in response is not \"sure, let's brainstorm, steelman it\". Or better \"sure, let's see if it's a valid pattern by taking action and see if the response is consistent with the pattern (active exploration, needed to uncover the causal structure. I did a thesis on this). It's not possible to obtain the correct model from observation alone in some cases. Neither internal monologue about the observation would help the agent. Only action and testing the hypothesis\"</p>\n<p>I feel it's like a paper review, not beanstormig. \"Everything wrong with this in a 1000 words\" rather than \"here's what I agree with. Here's what I disagree with. Here's my evidence\".</p>\n<p>That's why it feels not friendly for me to talk to EAs. I tried it soo sooo many times, every time my pattern that is connected to my personality gets dissected, traumatizing and invalidating me. Questioning my very axioms that I have discovered with sweat and pain, rather than saying whether they agree with a statement itself.</p>\n<p>Questioning my holistic thinking that lives with the logical one quite well together for me.</p>\n<p>To me some posts read us a call for me to abandon my emotional side and use only logic (such as, libertarian utilitarianism by Sabs or \"red pill is OK in EA\" in the most downvoted subthread here)</p>\n<p>I want balance, I want both. To me \"only logic, only one way of thinking\" is very extreme. You saw my other posts - I can do mathy things too. Just, I believe that if I only see and do mathy things, my world model would be incomplete, my exploration would be doomed, and my prior will not be universal. It would be \"intelligence used to shoot itself in the foot\"</p>\n<p>There is no way to explain it. It just happened to me once that I met a person who showed this to me, reminded me of something I forgot. The dream I had of \"math being superior to humanities and such\" collapsed, like in the Inception movie.</p>\n<p>Where I am now feels better. I can feel again. I feel whole. And I can still do math. I am sometimes uncomfortable with using math without emotion. Like, taking about genocide and saying \"it's not significant because the number of dead people is low\"</p>\n<p>It's not the way.</p>\n<p>See my post about the matrix trilogy: <a href=\"https://dair-community.social/@sergia/109979018708128244\">https://dair-community.social/@sergia/109979018708128244</a> and about how sometimes the seeming necessity of a choice is the problem, an artifact of the decision-making system rather than an objective necessity.</p>\n<p>I see emotion as something helping to see a bit beyond the tunnel vision of logic.</p>\n<p>It all changed for me when I saw the intensity of suffering of just one person who is not like me. I couldn't think of it as pure numbers or \"mere ripples\". Feeling what they feel.</p>\n<p>I don't want this - never again anyone has to feel this bad.</p>\n<p>I reject utilitarianism : I am from an ex-communist country which loved utilitarianism (and still does: Putin says \"I'm going to save the world from the evil west,  but to do so we're gonna need to kill a lot of people\" - people believe in this there!)</p>\n<p>I believe this can be done, caring about everyone, at least, I will do my best. That doesn't require any viokence I believe, not at all. Those who did agressive violence in the name of peace were utilitarians! Lenin and those people. F them :) they totally didn't get anything I think.</p>\n<p>See more on why I believe so here: <a href=\"https://dair-community.social/@sergia/109977128036067592\">https://dair-community.social/@sergia/109977128036067592</a></p>\n<p>(Side note: it is at the same time surprising but I feel this many times so it's not surprising at all now: a complete and total lack of interest from EAs towards asking questions about my story, the actual evidence I have. Like, nobody cares what happened in real-life with real people - only if there's some mathy philosophy anything is worth anything 💔💔💔)</p>\n<p>That can't be explained, no matter how many walls of text I write. That one life is worth more than any philosophy or any belief system or any ideology, anything like that</p>\n<p>I will say this out loud: I am extremely concerned that a secretive group of people who see superiority as acceptable (men over women in \"red pill\", majority vs minority in \"utilitarianism\", big over small in \"total libertarianism\") are engineering an \"AI revolution\" with manifestos and promises of \"UBI\", with no plan how to get there, only promises and handwaving, and ignore current crimes and harms done by them in the face of some \"greater good\" they imagine in their utopian manifestos.</p>\n<p>If we replace \"red pill\" with \"male supremacy\", \"libertarianism\" with \"communism\" and \"AI\" with \"collectivism\", and \"UBI\" well with \"UBI\", we have a clear parallel between now and a 100 years ago. first in Moscow now in silicon valley. Both were not nice to women (and had a \"theory of all theories\" to justify that), not nice to minorities (both saw them as a nuisance, didn't believe ever that \"people are different\", saw everyone the same because they themselves never met anyone not like them, of course, with a \"theoretical justification\"). Both imagined some \"grand future\" for which it was acceptable (and kinda encouraged) to do crimes in the present.</p>\n<p>The story a 100 years ago went like this: the Red Communists, the most utilitarian ones, killed everyone who had concerns over the validity of their philosophy.</p>\n<p>If it comes to this, you'll see that I'll not defend myself. I don't want to be in a world dominated by utilitarians. All full of utopias in their heads, and actual real poor people on the streets. All imagined, all fake. I'll do my peaceful thing. That is it.</p>\n<p>Just one life is more important than all those mental sandcastles.</p>\n<p>That is it - that is goodbye.</p>\n<p>There were some nice things, some nice people I met in EA. I still want to talk to them</p>\n<p>In general, this is a goodbye.</p>\n<p>Goodbye!</p>\n<p>I would totally love to talk \"real\". A conversation that doesn't feel I talk to a sociopath who would rather believe in some philosophy than even try to help real people.</p>\n<p>The real thing is:</p>\n<ul>\n<li>it takes 10 minutes to write a question to Anthropic</li>\n<li>there's potential upside</li>\n<li>there's no potential downside in asking a question</li>\n</ul>\n<p>Instead people here ask \"well shall I even spend 1 second on making sense of it, or is it all total bs\"?</p>\n<p>It's not a school assignment. It's like you say \"oh teacher the assignment seems contrarctory\" and the teacher is like \"oh sure that's a typo\". I'm not here to fix typos. I did it and it didn't lead to answers.</p>\n<p>It's real world. Nobody knows the full truth, there's no one true theory, there's no reward for an assignment and there's no assignment.</p>\n<p>Since some of you are in a country where culture war is going up, I'd strongly recommend to learn from partially correct information - inferring emotion instead of \"parse error on line 1\".</p>\n<p>Then we can heal it. There's not one single person who's perfect.</p>\n<p>What does seem odd is completely downvoting a person for asking questions to the core of a philosophy.</p>\n<p>What does seem odd is seeing a post advocating for \"Even More Centralisation\" after all that has transpired and all that has been said. It's heartbreaking to me because I know where it leads. I have that experience. For you it's a \"map\", I have memory of real territory. For you it's \"form\", for me it has meaning.</p>\n<p>Please reach out to someone who knows the territory. Someone outside of this group that believes they have answers to everything...</p>\n<p>Save yourself. Really.</p>\n", "parentCommentId": "zorwBRapg2kJZ5AqW", "user": {"username": "sergeivolodin"}}]