[{"_id": "FBiiFXKwcomTgQNMB", "postedAt": "2023-05-06T02:09:23.865Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>This is a big brain move, but it sounds right. I think one would have to have a factor in this calculation for the value of a marginal human life, which would then be weighed against the suffering of expected animals. But I could imagine that some people might give moral weights such that that doesn't really change the conclusion.&nbsp;</p><p>Thanks for writing this.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "JfDbGGxc5kEHCpbmH", "postedAt": "2023-05-06T07:46:19.376Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>This conceptually seems similar to the <a href=\"https://forum.effectivealtruism.org/topics/meat-eater-problem\">meat eater problem</a> argument against global health interventions.</p>\n", "parentCommentId": null, "user": {"username": "Charles_Dillon "}}, {"_id": "7f2zNQEjAyroECb8R", "postedAt": "2023-05-06T08:51:47.396Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>You may be aware of this already, but I think there is a clear difference between saving an existing person who would otherwise have died - and in the process reducing suffering by also preventing non-fatal illnesses - and starting a pregnancy because before starting a pregnancy the person doesn't exist yet.</p>\n", "parentCommentId": "JfDbGGxc5kEHCpbmH", "user": {"username": "LoveAndPeaceAlways"}}, {"_id": "mWnLGgvkvW52qBJt6", "postedAt": "2023-05-06T10:52:28.478Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>This is a reasonable argument, and seems quite plausible for farmed animals.</p><p>I think the biggest uncertainty here - at least in terms of impact on animals - is what each additional human life means for wild animals. If wild animals typically have net negative lives, and more humans reduces the number of wild animals, then perhaps family planning charities aren't beneficial for animals overall.</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "Cj8aPptKmz4sDDx5y", "postedAt": "2023-05-06T13:04:48.756Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>Yeah, I think this is a huge source of uncertainty that could push in the opposite direction. Additionally, I think that maybe more people being born than the counterfactual could increase the chances of space colonization? And that might massively expand suffering (spread wild animals throughout space, digital minds maybe, ...) but that has even more uncertainty to go along with its larger magnitude.</p>", "parentCommentId": "mWnLGgvkvW52qBJt6", "user": {"username": "Hank_B"}}, {"_id": "fEnSyAPmFtY55RBeq", "postedAt": "2023-05-06T14:17:57.534Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>What <i>is </i>that difference, from a consequentialist perspective?</p><p>(For the purpose of comparing apples to apples, let's ignore the suffering reduced by preventing an illness. What's the difference <i>in outcome for a child </i>between poofing them away at a young age, and preventing their birth?)</p>", "parentCommentId": "7f2zNQEjAyroECb8R", "user": {"username": "Ariel Simnegar"}}, {"_id": "H38HT3tGFBL4Zazr5", "postedAt": "2023-05-06T14:34:14.070Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>Thanks for this! The cost-effectiveness of MSI versus the Humane League in your analysis, when optimizing solely for farmed animals, was a significant update to me.</p><p>It's noteworthy that to endorse the argument in your post, one must believe equally strongly that it's wrong to donate to lifesaving charities like AMF. This would be because the effects of both family planning charities and lifesaving charities on farmed animals largely boils down to their effect on human population size.</p><p>Finally, there are significant reasons to believe increasing human population size may be <i>good</i> for wild animals, even if it's most likely bad for farmed animals:</p><ul><li>Human activity has caused a <a href=\"https://reducing-suffering.org/the-importance-of-insect-suffering/#Humans_changing_insect_populations\">huge decline</a> in wild invertebrate populations. Many EAs <a href=\"https://www.simonknutsson.com/how-good-or-bad-is-the-life-of-an-insect\">argue </a>that these animals live largely net negative lives, so under that view, this would be an incredibly good thing.</li><li>Brian Tomasik <a href=\"https://reducing-suffering.org/strategic-considerations-moral-antinatalists/#Should_antinatalists_oppose_human_reproduction\">found </a>that one birth in the US prevents ~10 billion insects. Even with an extremely low moral weight for each insect, if insects live significantly net negative lives, this seems likely to dominate the person's effect on farmed animals.</li></ul>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "TFwcnMMB3aPkxi2tz", "postedAt": "2023-05-06T14:58:15.296Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>An existing child may have particular interest in their continued existence that is or has been realized physically while a nonexistent child doesn't. Often actual (sometimes explicit) preferences to continue to exist, or future-oriented desires, even short-term ones, that would be frustrated if they die. Or maybe they have implicit interests in joy or the things they like, desire satisfaction or what they desire, because their brain is already arranged to like or desire these things, or some things in general, e.g. they have pleasure, desire and generally motivational/valuing subnetworks in their brain. Those interests would be less satisfied than otherwise if they die.</p>\n", "parentCommentId": "fEnSyAPmFtY55RBeq", "user": {"username": "MichaelStJules"}}, {"_id": "eDxbHzZTZxro8hPAY", "postedAt": "2023-05-06T16:09:15.920Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>Thanks for this perspective!</p><p>Am I understanding correctly that the distinction you outlined exists in preference utilitarianism, but not in hedonic utilitarianism? For example, if I were poofed away right now, from a hedonic utilitarian perspective, the only downside seems to be from the prevention of happy experiences I would have later had.</p><p>Also, does your argument work symmetrically? For example, if I could choose between ending the torture of an existing person, and preventing the creation of a person who would have been tortured, would your argument give strong reason to choose the former?</p><p>Within the preference-oriented perspective of your comment, has there been any exploration on how strong the trade-off should be between the preferences of existing moral patients and the future preferences of future moral patients?</p><p>For a simplistic example, when choosing between saving an existing happy person's life, or creating 10 happy people, many consequentialists would prefer the latter. (The latter creates 10x the amount of happy life-years, which plausibly dominates the existing person's preferences.) But even a 10-to-1 tradeoff would mean that preventing a happy person's existence is 10% as bad as killing them--pretty bad!</p>", "parentCommentId": "TFwcnMMB3aPkxi2tz", "user": {"username": "Ariel Simnegar"}}, {"_id": "mtnp4Eg3Fhqh5idRu", "postedAt": "2023-05-06T17:02:35.528Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>From a consequentialist utilitarian perspective, there is also the impact on those that know the existing person.&nbsp;</p><p>The death of an existing person often causes suffering and loss for those that know them. Whereas preventing the existence of a future person typically does not cause this wider suffering (except perhaps in some cases, e.g. when parents strongly desire a child but are unable to conceive).</p>", "parentCommentId": "fEnSyAPmFtY55RBeq", "user": {"username": "Matt_Sharp"}}, {"_id": "QSnW8X3gvQExZbuRY", "postedAt": "2023-05-06T17:51:22.134Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>You're right that that's a source of consequentialist difference. However, out of the consequences of a person's death, their death's harsh effect on those who love them seems unlikely to be worse than the deprivation of decades of future happy life for the person who died.</p><p>To see this, let's run with the premise that <i>most</i> of the badness of a person's death comes from the suffering of their close friends/family members. For simplicity, let's say whenever a person dies, 10 of their close friends/family suffer considerably. Let's further say that every person lives through exactly 10 of their close friends/family dying.</p><p>Now imagine a baby who's \"choosing\" whether or not they'd like to be born. If they choose not to be born, then they lose out on an entire happy life's experience. BUT that experience would include living through 10 of their close friends/family members' deaths, which our premise stated is <i>worse</i> than losing an entire life's experience! So the baby should prefer to <i>not be born.</i></p><p>So <strong>if most of the badness death of an existing person comes from the suffering the death causes on the person's close friends/family</strong>, then ignoring other considerations, <strong>we should advocate for human extinction</strong>. Being born and having to suffer through 10 close friends/family dying is worse than not being born at all.</p><p>To me, this conclusion seems absurd. Even though I'll suffer over life from the deaths of the people I love, on the whole, I'm happy to be alive.</p><p>In conclusion, while one's death <i>is </i>worse because of the suffering of their close friends/family, <strong>it still seems that most of the badness of death comes from the person losing future happy life</strong>. So we're still left with the conclusion that preventing a person's existence is close to as bad as killing them.</p>", "parentCommentId": "mtnp4Eg3Fhqh5idRu", "user": {"username": "Ariel Simnegar"}}, {"_id": "xngTrnBKo9gquNW8x", "postedAt": "2023-05-06T17:59:55.813Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>This runs a bit counter in spirit to some posts or position papers (can’t find it now) arguing that having more children does not have a strong climate cost bc ‘we expect future generations to emit less/solve the problem’. The same sort of argument could be applied to consuming (and torturing) animals. But I’m not sure it’s realistic in either case.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "E9jzq89J6FeXqHghz", "postedAt": "2023-05-06T18:03:24.710Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<blockquote><p>Am I understanding correctly that the distinction you outlined exists in preference utilitarianism, but not in hedonic utilitarianism?</p></blockquote><p>I gave two kinds of distinctions. Future-oriented preferences don't seem to count in themselves under hedonic utilitarianism (the first distinction), but the fact that a being already exists with the circuitry and tendencies to experience pleasure (and/or suffering) could matter on some hedonic utilitarian views (the second distinction).</p><blockquote><p>Also, does your argument work symmetrically? For example, if I could choose between ending the torture of an existing person, and preventing the creation of a person who would have been tortured, would your argument give strong reason to choose the former?</p></blockquote><p>I think the arguments I gave don't really say much either way about this. I think views where future people don't (really) matter in themselves, like presentism or necessitarianism, are compatible (although I don't give much weight to such views). On the other hand, you could defend similarly strong reasons and the procreation asymmetry based on actualism, <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/phpe.12139\">Frick's conditional reasons</a>, or harm-minimization views. See <a href=\"https://rychappell.substack.com/p/death-extinction-and-the-epicurean/comment/13820735\">this discussion</a>. I think at least actualism is asymmetric in a non-question-begging way, and maybe Frick's views, too, as I argue in the linked discussion.</p><blockquote><p>Within the preference-oriented perspective of your comment, has there been any exploration on how strong the trade-off should be between the preferences of existing moral patients and the future preferences of future moral patients?</p></blockquote><p>Within a view, I can't really imagine how you would ground any particular tradeoff ratio, other than basically purely subjectively, i.e. your own preferences about these tradeoffs. You could get something like this across moral views under maximizing expected choiceworthiness over moral uncertainty with the right kind of intertheoretic comparisons between person-affecting views and total views (<a href=\"https://www.jesp.org/index.php/jesp/article/view/223\">Greaves and Ord, 2017</a>, <a href=\"https://philpapers.org/rec/GREMUA-2\">another version</a>), but it's not clear what would ground such intertheoretic comparisons, because the views disagree about what makes something valuable. Maybe also something similar under other approaches to moral uncertainty, but the ratio could depend on the choices available to you.</p>", "parentCommentId": "eDxbHzZTZxro8hPAY", "user": {"username": "MichaelStJules"}}, {"_id": "zNcBDaFWnzNwmxERH", "postedAt": "2023-05-06T18:28:28.532Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>I think a good chunk of and maybe most of humanity's impact on wild animals comes through food production (agriculture, fishing), and animal products require more crop production per calorie or gram of protein than plant products. So, if humanity's net impact on wild animals is to reduce their populations, and this is good, then it seems more likely than not that supporting veg*ism and alt proteins <i>increases</i> wild animal populations, and this is bad.</p><p>This is not meant to be a reductio against the view. I take this argument seriously, so mostly support welfare reforms, which I expect to have smaller in magnitude wild animal effects (relative to their farmed animal effects) and tend less in either direction in particular for wild animals. And I think we should do more research on the wild animal effects of diet.</p><p>FWIW, Brian Tomasik seemed pretty uncertain about this: <a href=\"https://reducing-suffering.org/vegetarianism-and-wild-animals/\">https://reducing-suffering.org/vegetarianism-and-wild-animals/</a>.&nbsp;</p>", "parentCommentId": "mWnLGgvkvW52qBJt6", "user": {"username": "MichaelStJules"}}, {"_id": "k3oBGRWnZfnbXt6Gq", "postedAt": "2023-05-06T20:39:59.279Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>When thinking about sustainability, an extra life means (at least) two things:</p><ul><li>one more person who has their own sustainability footprint, or, in this case, animal welfare footprint -- i.e. a \"definite\" 1750 animals</li><li>one more person who has a small chance of coming up with an awesome innovation (e.g. bringing forward humanity's ability to produce clean meat by x years) which might save 100 billion animals</li></ul><p>There's a few steps in the argument which I've glossed over (incl reasons why the probability of a positive innovation is higher than a negative innovation) but I think there's a good chance that the second item could outweigh the first.</p><p>I also think we need a pretty heavy discount rate when calculating the number of animals saved, since there's a non-trivial chance that veganism could be widespread in 60 years' time.</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "e7747BxRphvHf27Wb", "postedAt": "2023-05-06T23:45:06.883Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>Can I ask why you picked MSI as an example? If I take your argument seriously, is MSI the family planning charity you recommend I donate to?</p>\n", "parentCommentId": null, "user": {"username": "anishazaveri"}}, {"_id": "txZN3qWhm7vzF4Zkb", "postedAt": "2023-05-07T00:01:13.432Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>For climate, maybe <a href=\"https://founderspledge.com/stories/climate-and-lifestyle-report\">this Founders Pledge report</a>?</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/txZN3qWhm7vzF4Zkb/wge24mdp7fof7ycyornt\" alt=\"Climate Report Fig3\"></figure><p>I think it's true that we should expect welfare improvements, and there's some chance that per capita animal product consumption decreases significantly, but it seems consumption is increasing in developing countries, and I think countries with more limited access to contraceptives or other family planning services as well as higher fertility rates are mostly developing countries.</p>", "parentCommentId": "xngTrnBKo9gquNW8x", "user": {"username": "MichaelStJules"}}, {"_id": "QTxKucweQfEWcmQbn", "postedAt": "2023-05-07T01:30:24.336Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>FWIW, I'm not sure about the overall sign of humanity's impact on wild invertebrate populations, and I think <a href=\"https://reducing-suffering.org/humanitys-net-impact-on-wild-animal-suffering/\">neither is Brian Tomasik</a>. Some reasons in favour of little/no clear change or increasing populations instead:</p><ol><li>Copepod (zooplankton) populations may increase from ocean warming, due to increased survival, hatching and egg production: \"However, the effects of near-future OW (+2 to 4°C) seem mainly positive unless these temperatures exceed a species’ thermal limit.\" (<a href=\"https://www.researchgate.net/profile/Bayden-Russell/publication/354764414_Oceanography_and_Marine_Biology_An_Annual_Review_Volume_59/links/638597b8554def619380fe3f/Oceanography-and-Marine-Biology-An-Annual-Review-Volume-59.pdf\">Hemraj et al, 2021</a>).</li><li>Freshwater insect populations may be increasing (<a href=\"https://www.science.org/doi/10.1126/science.abf1915\">Klink et al., 2020</a>).</li><li>Trend signs can be sensitive to location, the baseline year and study period (<a href=\"https://peercommunityjournal.org/articles/10.24072/pcjournal.131/\"><u>Francois et al., 2022</u></a>,&nbsp;<a href=\"https://www.biorxiv.org/content/10.1101/2020.04.27.052795v1.full\"><u>Høye et al., 2020</u></a>), so longer study periods give more reliable estimates. 10 years is probably generally too short to infer much (without controls, at least).</li><li>Some crops may increase NPP and invertebrate populations (<a href=\"https://reducing-suffering.org/crop-cultivation-and-wild-animals/\">https://reducing-suffering.org/crop-cultivation-and-wild-animals/</a>, <a href=\"https://reducing-suffering.org/vegetarianism-and-wild-animals/#Crop_cultivation\">https://reducing-suffering.org/vegetarianism-and-wild-animals/#Crop_cultivation</a>), and more humans means more crops.</li><li>Crops may increase in NPP over time as we increase productivity or switch to more productive crops, and we may also move away from grazing due to its greater land use.</li></ol>", "parentCommentId": "H38HT3tGFBL4Zazr5", "user": {"username": "MichaelStJules"}}, {"_id": "SAfHKaegkD5XBWvTS", "postedAt": "2023-05-07T10:27:42.135Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>I agree that 'most of the badness of death comes from the person losing future happy life'.</p><p>However, there are also other factors that are relevant to whether 'preventing a person's existence is close to as bad as killing them' (this obviously also depends what is meant by 'close to').</p><p>The claim seems to imply that we are doing something almost as bad as murder if we are failing to have as many children as possible. But a society where legislation reflected this position would reduce the quality of life of people who don't want many (or any) children, would force women into being baby-making machines, and would plausibly result in a situation where individual children aren't viewed as particularly important (if one dies, well, no time to grieve - another one is on the way). This strikes me as more absurd and dystopian than advocating for human extinction.</p>", "parentCommentId": "QSnW8X3gvQExZbuRY", "user": {"username": "Matt_Sharp"}}, {"_id": "TLRFHckYNhvXakaFP", "postedAt": "2023-05-07T14:24:16.825Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>As much as I think family planning charities like MSI do good by preventing the pain of unwanted pregnancies on women, I do not think that we should factor in animal welfare concerns when it comes to family planning funding. The analysis assumes that an extra human will have the same impact on meat consumption as an average human, this isn't true. One  extra meat consumer will raise the price of meat, reducing the amount that others eat, and meat production is far from perfectly elastic. One could argue there is some chance they might go on to work in the meat industry and raise supply that way, but at the current moment meat prices seem more dependent on available land then labor supply to me so that seems unlikely. Additionally, due to agglomeration effects an extra human may reduce the time until a full replacement of farmed animal meat with plant based or culture based meats. I do not think we should assume that bringing an extra human into the world should have a net negative impact on farmed animal welfare in expectation.</p>\n", "parentCommentId": null, "user": {"username": "Burner1989"}}, {"_id": "ccr6tboQCwxJsMiww", "postedAt": "2023-05-07T14:33:56.874Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>This was the context, thanks. Agree with you. And I’m intuitively skeptical of the argument in both cases: I suspect meat and animal consumption seems likely to persist for quite some time, as does a high carbon lifestyle. Likely to decrease in high income countries, but maybe to 50% or higher, so adding to population will still be a strong negative through this channel (caveat: this is mostly just my intuition.) The case that ‘future kids will be so much better’ so don’t worry seems a bit wishful thinking and suspicious convergency to me.</p>\n", "parentCommentId": "txZN3qWhm7vzF4Zkb", "user": {"username": "david_reinstein"}}, {"_id": "wQFnXPY6enXmrTotF", "postedAt": "2023-05-07T16:06:38.138Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>My impression is elasticity concerns usually only cut the farmed animal impacts of demand shifts by about 30-70%. I think the post's analysis above also didn't include descendants of the births directly prevented, which could make up for that.</p>\n<p>The agglomeration effect seems very small to me. The probability that this person contributes other than just through diffuse societal benefits to others (targeted contributions to alt proteins and diet change instead of diffuse benefits to society through goods and services, taxes, etc.) seems very very small, and diffuse societal benefits seem very unlikely to make any significant difference at all (e.g. to funding for alt proteins).</p>\n", "parentCommentId": "TLRFHckYNhvXakaFP", "user": {"username": "MichaelStJules"}}, {"_id": "dJqydoQLp7Wmmph47", "postedAt": "2023-05-07T18:47:31.355Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>For me, this conversation is analogous to that surrounding Peter Singer's book The Life You Can Save (TLYCS).</p><p>In TLYCS, Peter Singer argues, in my opinion quite convincingly, that <strong>we have a moral obligation to give up </strong><i><strong>everything </strong></i><strong>we have to help those in extreme poverty</strong>. Singer argues that <strong>every 5000 USD we spend on ourselves and </strong><i><strong>not</strong></i><strong> donate is equivalent to condemning a person whose life we could have saved</strong>. He then follows up with a far more modest ask: That we donate 1% of our income to effective charities.</p><p>There are many people who balk at Singer's conclusion that we have a moral duty to donate everything above our bare survival needs to effective charities, and then reject his comparatively modest 1% ask. They might reply:</p><blockquote><p>[Singer's] claim seems to imply that we are doing something almost as bad as murder if we are failing to [donate as much money as possible]. But a society where legislation reflected this position would reduce the quality of life of people [in developed countries to that of those in extreme poverty], would force [people in developed countries] into being [money]-making machines, and would plausibly result in a situation where individual children [in extreme poverty] aren't viewed as particularly important (if one dies, well, no time to grieve - another one is [waiting to be saved]). This strikes me as more absurd and dystopian than advocating for human extinction.</p></blockquote><p><strong>This isn't what EAs actually advocate for</strong>. Singer's conclusion is far too much to ask of most people, and even the most ardent EAs would balk at legislating it. However, many EAs, myself included, would agree that <strong>Singer's philosophical conclusion really is correct</strong>.</p><p>Similarly, I've <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction\">made the philosophical argument</a> that there's little moral difference between preventing a person's existence and killing them. Given that conclusion, there are <i>many </i>compelling criticisms of what personal or legislative changes should follow. However, <strong>I haven't found any convincing rebuttal to the philosophical argument</strong>.</p><p>There are many considerations which lessen the magnitude of the conclusion. Preventing the suffering of the close friends and family of a person who dies matters. One might have a high credence in a <a href=\"https://en.wikipedia.org/wiki/Person-affecting_view\">person-affecting view</a>, endorse the <a href=\"https://en.wikipedia.org/wiki/Asymmetry_(population_ethics)\">procreation asymmetry</a>, or place substantial credence on non-consequentialist theories.</p><p>But in my opinion, if you're a consequentialist who holds even mild credence (say ~10%) in the non-person-affecting view, then preventing a person's existence is on the order of badness of (say, ~10% as bad as) killing them. If you disagree, then I'd love to understand your perspective further, and see if there's some crucial consideration I may be missing.</p><p>As with Singer's arguments in TLYCS, <strong>I don't think the truth/falsity of a philosophical argument is contingent on how radical its conclusions are</strong>. I also don't think the existence of radical conclusions precludes the implementation of common-sense conclusions, like donating 1% of one's income to effective charities.</p>", "parentCommentId": "SAfHKaegkD5XBWvTS", "user": {"username": "Ariel Simnegar"}}, {"_id": "4XoTbiJ2WvZnNHJ9Q", "postedAt": "2023-05-07T19:47:01.992Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>That's a good question. Some other organizations I've seen in this scene do things other than family planning (the one that comes to mind is population service international (PSI)), so using the numbers from a more \"pure\" family planning org like MSI probably gets a better cost per life prevented than say using the numbers from PSI? But other than that, I haven't done much comparative work here and don't have solid recommendations.&nbsp;</p>", "parentCommentId": "e7747BxRphvHf27Wb", "user": {"username": "Hank_B"}}, {"_id": "vimWEedyCtwgiqkXc", "postedAt": "2023-05-07T19:52:17.118Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>Honestly, I only know of a few organizations here. MSI, PSI, and planned parenthood international are the ones coming to mind. I think there are more. There's one newer organization that is buying radio ads to encourage usage of contraception which might be cheaper than supply-side provision of contraception. It might be Development Media International (https://www.developmentmedia.net/what-we-do/focus-areas/) that I'm thinking of.</p>", "parentCommentId": "4XoTbiJ2WvZnNHJ9Q", "user": {"username": "Hank_B"}}, {"_id": "QEPzHaCFduwTusyAX", "postedAt": "2023-05-08T08:27:08.550Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>Though if you wanted to reduce wild animal populations, you could pay to destroy habitats without also causing farm animal suffering, or maybe even do something productive e.g. keep growing crops but burn them for fuel rather than use them as animal feed. Not that I'd particularly advocate this, but I think it argues against a view that it could be optimal to not reduce farm animal populations on these grounds.</p>", "parentCommentId": "mWnLGgvkvW52qBJt6", "user": {"username": "Pagw"}}, {"_id": "2LBtWqnkHzMbs68wk", "postedAt": "2023-05-10T20:27:32.658Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>This is a very reasonable argument, and one we should take seriously. It is one of the driving forces at <a href=\"https://fairstartmovement.org/\">https://fairstartmovement.org/</a>&nbsp;</p><p>Having worked in animal advocacy for 35 years, I've only seen the number of animals consumed per person go up and up and up. (In the US and globally.) You know what they say is the definition of insanity....</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "34Pc9xpkBTcznw9Ta", "postedAt": "2023-05-10T21:00:28.613Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>I think that it is effective to support organizations that work towards ending animal agriculture. There is at least one animal rights organization that employs effective tactics and has a plan with a reasonable chance of success to end animal agriculture in several countries. I think it is effective to support these types of organizations in order to prevent billions of animal from being bred on factory farms.</p>\n", "parentCommentId": null, "user": {"username": "RasaPetrauskaite"}}, {"_id": "dkAGPjPA4YisYSYoa", "postedAt": "2023-05-11T19:14:12.489Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>I have always been surprised that there is no more interest in donations to charities like MSI from the EA community. You are not only impacting animal welfare, but also environment, pollution, etc, and a lot of future deaths and suffering of children. Plus, MSI also reports saving the lives of 39,500 women, on a total income of 290M pounds, it's 7,342 pounds per life saved, which is not bad at all considering all the additional benefits.</p>", "parentCommentId": null, "user": {"username": "egroj"}}, {"_id": "GquzvvdxnJw3dX6aZ", "postedAt": "2023-05-11T20:58:23.964Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>To me, this seems like a classical case of treating symptoms instead of root causes. By preventing the birth of meat consumers we reduce the consumption of meat, yet we do not address the root cause of a dysfunctional food system. Focussing on food system change may be less effective in the short-run (at least in this concrete example). In the long-run however, as food choices shift towards plant-based options, animal suffering caused by food consumption will decrease continuously and may ultimately drop to zero. This can only be achieved through systemic change.</p>", "parentCommentId": null, "user": {"username": "Chris_Eats_Plants"}}, {"_id": "fTm2L4MuQFyKBTyTd", "postedAt": "2023-05-17T14:25:12.377Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>This is very interesting! I think one of the most important things here is how much suffering there was of the animals. (Still, I'm also very unsure that less people would mean less consumption would mean less animals suffering.) There's a rethink priorities article about animal farming in Zambia! The video of the chickens did not seem as extreme (extreme as in horrific) as other things I've read about in places like the U.S.</p><p>&nbsp;<a href=\"https://rethinkpriorities.org/publications/what-is-animal-farming-in-rural-zambia-like\">https://rethinkpriorities.org/publications/what-is-animal-farming-in-rural-zambia-like</a></p>", "parentCommentId": null, "user": {"username": "Elijah Persson-Gordon"}}, {"_id": "M3tat46ALaZtRMabj", "postedAt": "2023-05-17T20:13:43.922Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<blockquote><p>At least we can have some confidence in the total weight of meat consumed on average by a Zambian per year and the life expectancy at birth in Zambia.</p></blockquote><p>&nbsp;</p><p>We should also think about these on the margin. Ie the lives averted might have been shorter than average and consumed less meat than average.</p>", "parentCommentId": null, "user": {"username": "Rocket"}}, {"_id": "nrRbWeTDYM6r4RkQP", "postedAt": "2023-05-18T18:47:31.709Z", "postId": "BMzmCohuPYRaGPcZD", "htmlBody": "<p>That's true! Maybe the potential human would have been born to poorer than average parents (because those are the people who need help accessing contraception), thus being poorer on average (and so consuming less meat).<br><br>Or maybe the potential human would be born to more educated on average parents (since those are the people who'd be interested in using contraception?)? Thus being richer on average and eating more meat.</p>", "parentCommentId": "M3tat46ALaZtRMabj", "user": {"username": "Hank_B"}}]