[{"_id": "NFAigaxwKzMRLNp9H", "postedAt": "2022-11-06T23:38:13.832Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<p>I'm confused about this post. I don't buy the argument, but really, I'm not sure I understand what the argument is. Text-to-image models have risks? Every technology has risks. &nbsp;What's special about this technology that makes the costs outweigh the benefits?</p><p>Consider this paragraph,</p><blockquote><p>Especially in the case of DALLE-2 and Stable Diffusion, we are not convinced of any fundamental social benefits that access to general-purpose image generators provide aside from, admittedly, being entertaining. But this does not seem commensurate with the potentially-devastating harms that deepfakes can have on victims of sex crimes. Thus, it seems that these models, as they have been rolled out, fail this basic cost/benefit test.&nbsp;</p></blockquote><p>I don't find anything about this obvious at all.&nbsp;</p><p>Suppose someone in the 1910s said, \"we are not convinced of any fundamental social benefits that film provides aside from, admittedly, being entertaining. But this does not seem commensurate with the potentially-devastating harms that film can cause by being used as a vehicle for propaganda. Thus, it seems that films, as they have been rolled out, fail this basic cost/benefit test.\" Would that have convinced you to abandon film as an art form?</p><p>Entertainment has value. Humanity collectively spends hundreds of billions of dollars every year on entertainment. People would hate to live in a world without entertainment. It would be almost dystopian. So, what justifies this casual dismissal of the entertainment value of text-to-image models?</p><p>Your primary conclusion is that \"the AI research community should curtail work on risky capabilities\". But isn't that obvious? Everyone should curtail working on unnecessarily risky capabilities.&nbsp;</p><p>The problem is coordinating our behavior. If OpenAI decides not to work on it, someone else will. What is the actual policy being recommended here? Government bans? Do you realize how hard it would be to prevent text-to-image models from being created and shared on the internet? That would require encroaching on the open internet in a way that seems totally unjustified to me, given the magnitude of the risks you've listed here.</p><p>What's missing here is any quantification of the actual harms from text-to-image models. Are we talking about 100 people a year being victimized? That would indeed be sad, but compared to potential <a href=\"https://en.wikipedia.org/wiki/Existential_risk_from_artificial_general_intelligence\">human extinction from AI</a>, probably not as big of a deal.</p>", "parentCommentId": null, "user": {"username": "Matthew_Barnett"}}, {"_id": "yCCH4qAdu9cM64sqC", "postedAt": "2022-11-07T02:23:03.419Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<p>I have been playing with Stability Diffusion for the past week. (It's a bit addictive.) It's currently very time consuming to make photo realistic deep fake images. It probably easier to do so with photo shop. What I can see happens is that people will use Stable Diffusion to make a lot of creative images for political messages intend to attack and mock the opposite side instead of trying to mislead.</p>\n", "parentCommentId": null, "user": {"username": "newptcai"}}, {"_id": "dE7nAg8ptf8QxBsoR", "postedAt": "2022-11-07T22:42:28.444Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<p>Thanks or the comment. I think that simple interfaces for SD like <a href=\"https://huggingface.co/spaces/stabilityai/stable-diffusion\">this</a> are not particularly worrysome. But I think that now (1) inpainting/outpainting, (2) dreambooth (<a href=\"https://www.reddit.com/r/StableDiffusion/comments/y1xgx0/dreambooth_completely_blows_my_mind_first_attempt/\">see this SFW example</a>), (3) GUIs that make it easy to use these, and (4) future advancements in difusion models (remember that DLALE-2 was only released in April of this year) are the main causes for concern.&nbsp;</p>", "parentCommentId": "yCCH4qAdu9cM64sqC", "user": null}, {"_id": "hccvBkwiMtQTvA8kQ", "postedAt": "2022-11-07T23:22:52.106Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<p>Thanks for the comment. I hope you think this is interesting content.&nbsp;</p><blockquote><p>I'm not sure I understand what the argument is.</p></blockquote><p>The most important points we want to argue with this post are that (1) if a system itself is made to be safe, but it's copycatted and open-sourced, then the safety measures were not effective (2) it is bad when developers like OpenAI publish incomplete/overly-convenient analysis of the risks of what they develop that, for example, ignore copycatting, &nbsp;and (3) the points from \"What do we want\"? and \"What should we do?\"</p><blockquote><p>\"...we are not convinced of any fundamental social benefits that film provides aside from, admittedly, being entertaining...\"</p></blockquote><p>Yes entertainment has value, but I don't think that entertainment from text-to-image models is/will be commensurate with film. &nbsp;I could also very easily list a lot of non-entertainment uses of film involving stuff like education, communication, etc. And I think someone from 1910 could easily think of these as well. What stuff like this would you predict from text-to-image diffusion models?</p><blockquote><p>So, what justifies this casual dismissal of the entertainment value of text-to-image models?</p></blockquote><p>We don't. We argue that it's unlikely to outweigh harms.&nbsp;</p><blockquote><p>Your primary conclusion is that \"the AI research community should curtail work on risky capabilities\".</p></blockquote><p>I wouldn't say this is our primary conclusion. See my first response above. Also, I don't think this is obvious. Sam Altman, Demis Hassabis, and many others strongly disagree with this.&nbsp;</p><blockquote><p>The problem is coordinating our behavior. If OpenAI decides not to work on it, someone else will</p></blockquote><p>We disagree that the counterfactual to OpenAI not working on some projects like DALLE2 or GPT4 would be similar to the status quo. &nbsp;We discussed this in the paragraph that says \"...On one hand, AI generators for offensive content were probably always inevitable. However...\"</p><blockquote><p>...Government bans? Do you realize how hard it would be to prevent text-to-image models from being created and shared...</p></blockquote><p>Yes. We do not advocate for government bans. My answer to this is essentially what we wrote in the \"The role of AI governance.\" I don't have much to add beyond what we already wrote. I recommend rereading that section. In short, there are regulatory tools that can be used. For example, the FTC may have a considerable amount of power in some cases.</p><blockquote><p>Are we talking about 100 people a year being victimized? That would indeed be sad, but compared to potential <a href=\"https://en.wikipedia.org/wiki/Existential_risk_from_artificial_general_intelligence\">human extinction from AI</a>, probably not as big of a deal.</p></blockquote><p>Where did the number 100 come from? In the post, we cite one <a href=\"https://www.fastcompany.com/90414116/there-are-almost-15k-deepfake-videos-out-there-and-96-of-them-are-porn\">article</a> about a study from 2019 that found &nbsp;~15,000 deepfakes online. That was in 2019 when image and video generation were much less developed than today. And in the future, things may be much more widespread because of open-source tools based on SD that are easy to use.</p><p>Another really important point, I think, is that we argue in the post that trying to avoid dynamics involving racing toward TAI, copycatting, and open-sourcing of models will LESSEN X-risk. You wrote your comment as if we are trying to argue that preventing sex crimes are more important than X-risk. We don't say this. I recommend rereading the \"But even if one does not view the risks specific to text-to-image models as a major concern...\" paragraph and the \"The role of AI researchers\" section.&nbsp;</p><p>Finally, and I want to put a star on this point -- we all should care a lot about sex crime. And I'm sure you do. Writing off problems like this by comparing them to X-risk &nbsp;(1) isn't valid in this case because we argue for improving the dev ecosystem to address <i>both</i> of these problems, (2) should be approached with great care and good data if it needs to be done, and (3) is one type of thing that leads to a lot of negativity &nbsp;and bad press about EA.&nbsp;</p><p>I think this is probably even more &nbsp;true for your comments on entertainment value and whether that might outweigh the harms of deepfake sex crimes. First, I'm highly skeptical that we will find uses for text-to-image models that are so widely usable and entertaining that it would be commensurate to the harms of diffusion-deepfake sex crime. But even if we could be confident that entertainment would hypothetically outweigh sex crimes on pure utilitarian grounds, in the real world with real politics and EA critics, I do not think this position would be tenable. It could serve to undermine support for EA and end up being very negative if widespread.&nbsp;</p>", "parentCommentId": "NFAigaxwKzMRLNp9H", "user": null}, {"_id": "XrYoSNomrAAMvhgp5", "postedAt": "2022-11-08T01:11:45.551Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<p>I think the core takeaway, at least from my end, is that this post <i>elucidates a model , and tells a more concrete story, for how proliferation of technologies of a certain &nbsp;structure and API (e.g., general-purpose query-based ML models) can occur, and why they are dangerous.</i> Most importantly, this entails that, <i>even if you don't buy the harms of DALLE-2 itself </i>(which, we have established, you should, in particular for its potential successors), this pattern of <strong>origination -&gt; copycatting -&gt; distribution &nbsp;-&gt; misuse</strong> is a typical path for the release of technologies like this. If you buy that a dangerous capability could ever be produced by an AI model deployable with an API of the form query -&gt; behaviour &nbsp;(e.g. by powerful automatic video generation from prompts, &nbsp;powerful face-editing tools given a video, &nbsp;or an agent with arbitrary access to the internet controlled via user queries), this line of reasoning could therefore apply and/or be useful. This informs a few things:</p><ol><li>Technologies, once proliferated, are like a Pandora's Box (or indeed, a slippery slope), and so therefore <i>the very coordination problem / regulatory problem you speak of&nbsp;</i> is most easily solved <i>at the level of origination. </i>This is a useful insight now, <i>while many of the most dangerous AIs to be developed are yet to be originated</i>.</li><li>The potential harms of these technologies <i>come from their unbounded scope</i>, i.e. from the generality of function, lack of restriction of user access, or from the parameter count of these models being so large as to make their behaviour inherently hard to reason with. All of these things make these kinds of models more particularly amenable to misuse. So this post, in my mind, also takes a view on the <i>source</i> of capabilities risk from these models: in their generality and open scope. This can therefore inform the kinds of models / training techniques that are more dangerous: e.g. that for which the scope is the widest, where most possible failures <i>could </i>happen because the <i>right</i> behaviour is more nebulously defined.&nbsp;</li></ol><p>In general, I would urge you to consider this paragraph (in particular point (3)), the argument there seeming to be the bulk of your criticism.&nbsp;</p><blockquote><p>Overall, the slippery slope from the carefully-guarded DALLE-2 to the fully-open-source Stable Diffusion took less than 5 months. On one hand, AI generators for offensive content were probably always inevitable. However (1) not this soon. Delays in advancements like these increase the chances that regulation and safety work won’t be so badly outpaced by capabilities. (2) Not necessarily in a way that was enabled by companies like OpenAI and StabilityAI who made ineffective efforts to avoid harms yet claim to have clean hands while&nbsp;<a href=\"https://www.forbes.com/sites/kenrickcai/2022/09/07/stability-ai-funding-round-1-billion-valuation-stable-diffusion-text-to-image/?sh=32be129724d6\"><u>profiting greatly</u></a> off these models. And (3) other similar issues with more powerful models and higher stakes might be more avoidable in the future. What will happen if and when&nbsp;<a href=\"https://makeavideo.studio/\"><u>video generators</u></a>,&nbsp;<a href=\"https://towardsdatascience.com/gpt-4-is-coming-soon-heres-what-we-know-about-it-64db058cfd45#:~:text=It%27s%20not%2C%20but%20OpenAI%27s%20CEO,%2C%20likely%20around%20July%2DAugust.\"><u>GPT-N</u></a>, advanced&nbsp;<a href=\"https://www.deepmind.com/publications/a-generalist-agent\"><u>generalist agents</u></a>, or other potentially very impactful systems are released and copycatted?&nbsp;</p></blockquote><p>In other words, it's maybe not as much about DALLE-2 itself, but about the extrapolation of this pattern to models like it, and ways to deal with that before a model with existential risk is brought up (and by that point, if the data is in on that, we're probably dead already).</p><p>Thanks for reading, and for the comment. I hope this clarifies the utility of this article for you.</p>", "parentCommentId": "NFAigaxwKzMRLNp9H", "user": {"username": "philljkc"}}, {"_id": "LpvxXzXhswYyLfWDp", "postedAt": "2022-11-09T14:00:20.264Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<p>This. It suggests that once a powerful AI is released, even in restricted format, others will be motivated to copy it. This is a bad dynamic for AGI, as existential risk only depends on the least-safe actor. If this dynamic is repeated, it's very possible that we all die due to copies of AGI being released.</p>\n", "parentCommentId": "XrYoSNomrAAMvhgp5", "user": {"username": "Sharmake"}}, {"_id": "v9Ci6GSfRnkhfYHET", "postedAt": "2022-11-09T14:03:35.954Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<blockquote>\n<p>Meanwhile, there are deep problems with the “let’s build transformative AI in order to make sure it’s safe” strategy. In particular, OpenAI and DeepMind both express that they want to race to generate highly transformative intelligent systems. The goal they both profess is to be the first to develop them so that they can exercise responsible stewardship and ensure that it is as aligned and beneficial as possible. This is a benevolent form of what Nick Bostrom refers to in Superintelligence as gaining a “decisive strategic advantage” which may make the first developer of particularly transformative AI too powerful to compete with. There are many problems with this strategy including: (1) It is entirely based on racing to develop transformative AI, and faster timelines exacerbate AI risks. This is especially perverse if multiple actors are competitively racing to do so. (2) Nobody should trust a small set of people like Sam Altman and Demis Hassabis to unilaterally exercise benevolent stewardship over transformative AI. Arguably, under any tenable framework for AI ethics, a regime in which a small technocratic set of people unilaterally controlled transformative AI would be inherently unethical. Meaningful democratization is needed. (3) OpenAI’s approach to DALLE-2 should further erode confidence in them in particular. Their overly-convenient technical report on risks that failed to make any mention of copycatting combined with how quickly they worked to profit off of DALLE-2 are worrying signs. (4) Copycatting makes racing to build transformative AI strictly more risky. Even if one fully-trusted a single actor like OpenAI or DeepMind to exercise perfect stewardship over transformative AI if they monopolized it, how quickly DALLE-2 was copycatted multiple times suggests that copycatting may undermine attempts at benevolent strategic dominance. Copycatting would most likely serve to broaden the set of technocrats who control transformative AI but still fail to democratize it. So if a company like OpenAI or DeepMind races to build transformative AI, and if it is still copycatted anyway, we get the worst of all worlds: unsecure, non-democratized, transformative AI on a faster timeline. If a similar story plays out with powerful, highly transformative AI as has with DALLE-2, humanity may be in trouble.</p>\n</blockquote>\n<p>Let's be honest, a lot of the claims by OpenAI and Deepmind shows bad signs of having motivated reasoning. This is equivalent to a tobacco creating company claiming that their research helps make tobacco safe.</p>\n<p>No, it only benefits the company in the form of profits.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "gaizrKR7BCs4N2ogS", "postedAt": "2022-11-11T16:45:25.522Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<blockquote><p>The potential harms of these technologies <i>come from their unbounded scope</i></p></blockquote><p>Previous technologies also have quite unbounded scopes. That does not seem to me different from the technology of film. The example of film in the post you were replying too also has an unbounded scope.</p><blockquote><p>This can therefore inform the kinds of models / training techniques that are more dangerous: e.g. that for which the scope is the widest</p></blockquote><p>Technologies with a broad scope are more like to be dangerous but they are also more likely to be valuable.&nbsp;</p><p>If you look at the scope of photoshop it can be already used by people to make deepfake porn. It can also used by people to print fake money.</p><p>Forbidding broad-scope technologies to be deployed would have likely prevented most of the progress in the last century and would make a huge damper on future progress as well.</p><p>When it comes to gene editing, our society decides to regulate its application but is very open that developing the underlying technology is valuable.&nbsp;</p><p>The analogy to how we treat gene editing would be to pass laws to regulate image creation. The fact that deepfake porn is currently not heavily criminalized is a legislative choice. We could pass laws to regulate it like other sexual assaults.&nbsp;</p><p>Instead of regulating at the point of technology creation, you could focus on regulating technology use. To the extent that we are doing a bad job at that currently, you could build a think tank that lobbies for laws to regulate problems like deepfake porn creation and that constantly analysis new problems and lobbies for the to be regulated.</p><p>When it comes to the issue of deepfake porn, it's also worth looking why it's not criminalized. When Googling I found <a href=\"https://inforrm.org/2022/07/19/deepfake-porn-and-the-law-commissions-final-report-on-intimate-image-abuse-some-initial-thoughts-colette-allen/\">https://inforrm.org/2022/07/19/deepfake-porn-and-the-law-commissions-final-report-on-intimate-image-abuse-some-initial-thoughts-colette-allen/</a> which makes the case that it should be regulated but which cites a government report which suggests that deepfake porn creation should be legal while sharing it shouldn't be legal. I would support making both illegal, but I think approaching the problem from the usage point of view seem the right strategy.</p>", "parentCommentId": "XrYoSNomrAAMvhgp5", "user": {"username": "ChristianKleineidam"}}, {"_id": "6fZDuCouDokQS9MiL", "postedAt": "2022-11-12T11:56:51.361Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<blockquote><p>But even if we could be confident that entertainment would hypothetically outweigh sex crimes on pure utilitarian grounds, in the real world with real politics and EA critics, I do not think this position would be tenable.</p></blockquote><p>Isn't this basically society's revealed position on, say, cameras? People can and do use cameras for sex crimes (e.g. voyeurism) but we don't regulate cameras in order to reduce sex crimes.</p><p>I agree that PR-wise it's not a great look to say that benefits outweigh risks when the risks are sex crimes but that's because PR diverges wildly from reality. (And if cameras were invented today, I'd expect we'd have the same PR arguments about them.)</p><p>None of this is to imply a position on deepfakes -- I don't know nearly enough about them. My position is just that it should in fact come down to a cost/benefit calculation.</p><blockquote><p>I could also very easily list a lot of non-entertainment uses of film involving stuff like education, communication, etc.</p></blockquote><p>Random nitpick, but text-to-image models seem plausibly very useful for education and communication. I would love for people's slide decks with pages and pages of text to be replaced by images that convey the same points better. Maybe imagine <a href=\"https://distill.pub/\">Distill</a>-like graphics / papers, except that it no longer takes 5x as long to produce them relative to a normal paper.</p>", "parentCommentId": "hccvBkwiMtQTvA8kQ", "user": {"username": "rohinmshah"}}, {"_id": "cLChi7tRvhNDSr3dY", "postedAt": "2022-11-15T02:38:58.956Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<blockquote><p>When it comes to gene editing, our society decides to regulate its application but is very open that developing the underlying technology is valuable.&nbsp;</p></blockquote><p>Here, I would refer to the third principle proposed in the \"What Do We Want\" section as well (on Cost-Benefit evaluation): I think that there should be at least more work done to try and anticipate / mitigate harms done by these general technologies. Like what is the rough likelihood of an extremely good outcome vs. extremely bad outcome for model X being deployed? If I add modification Y to it, does this change?&nbsp;</p><p>I don't think our views are actually inconsistent here: if society scopes down the allowed usage of a general technology to comply with a set of regulatory standards that are deemed safe, that would work for me.&nbsp;</p><p>My personal view on the danger here really is really that there isn't enough technical work here to mitigate the misusage of models, or even to enforce compliance in a good way. We really need technical work on that, and only then can we start effectively asking the regulation question. Until then, we might want to just delay release of super-powerful successors for this kind of technologies, until we can give better performance guarantees for systems like this, deployed this publicly.&nbsp;</p>", "parentCommentId": "gaizrKR7BCs4N2ogS", "user": {"username": "philljkc"}}, {"_id": "EfQtXe33PqzADWqmQ", "postedAt": "2022-11-15T02:54:08.075Z", "postId": "Bnp9YDqErNXHmTvvE", "htmlBody": "<p>We agree for sure that cost/benefit ought be better articulated when deploying these models (see the <i>What Do We Want</i> section on Cost-Benefit Analysis). The problem here really is the culture of blindly releasing and open-sourcing models like this, using a <i>Go Fast And Break Things</i> mentality, without at least making a case for what the benefits are, what the harms are, and not appealing to any existing standard when making these decisions.&nbsp;</p><p>Again, it's possible (but not our position) that the specifics of DALLE-2 &nbsp;don't bother you as much, but certainly the current culture we have around such models and their deployment seems an unambiguously alarming development.</p><p>The text-to-image models for education + communication here seems like a great idea! Moreover, I think it's definitely consistent with what we've put forth here too, since you could probably fine-tune on graphics contained in papers related to your task at hand. The issue here really is that people are incurring unnecessary amounts of risk by making, say, an automatic Distill-er by using all images on the internet or something like that, when training on a smaller corpora would probably suffice, and vastly reduce the amount of possible risk of a model intended originally for Distill-ing papers. The fundamental position we advance that better protocols are needed before we start mass-deploying these models, and not that NO version of these models / technologies could be beneficial, ever.</p>", "parentCommentId": "6fZDuCouDokQS9MiL", "user": {"username": "philljkc"}}]