[{"_id": "zFhmNetKNA6LqkED6", "postedAt": "2024-03-28T17:11:54.312Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>He got off easy, in my opinion. I wrote earlier <a href=\"https://forum.effectivealtruism.org/posts/JRTkbyaQiMWXjsJDv/jason-s-shortform?commentId=ofGh3Fz2HdzNHjzg9\">here </a>about the need for general deterrence, as well as enhancement for certain aggravating factors like witness tampering and perjury.</p><p>For non-U.S. readers, the sentence may seem pretty harsh; the actual time to serve may end up roughly equal to the median UK single murderer who did not bring a weapon to the scene and whose conduct did not involve any other statutory aggravating factor. But, compared to what the US criminal justice system regularly hands out for various levels of moral culpability and harm caused, he got (and many white-collar criminals get) significantly less than his culpability level and harm caused would predict. I think \"rich people crime\" getting a significantly less stern response than ordinary crime is damaging to the rule of law and the social contract in this country.&nbsp;</p><p>I also feel little pity for him, at least relative to the median US convicted individual. A large number of people who receive significant prison sentences experienced great childhood trauma, suffer from significant mental illness that contributed to their offenses, and had relatively few good options in life. SBF had great privilege and could choose among an extremely broad range of lawful and attractive paths in life. I don't think anyone has suggested that any mental illness or autism was contributory to his offense.</p><p>So in this case, my desire for consistency and inter-defendant fairness trumps the broader concerns I have about the US system being too punitive.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "SyogE3fi5heXK8Gzx", "postedAt": "2024-03-28T17:46:20.405Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>SBF did terrible acts from many different moral viewpoints, including that of consequentialism. In addition to those he directly harmed, he harmed the EA movement.<br><br>However, from review of what I have read, it seems as if he acted from a sincere desire to better the world and did so to the best of his (quite poor) judgment. Thus, to me, his punishment is a tragedy, though a necessary one. From a matter of ultimate culpability, I don't know if I would judge him more harshly than the vast majority of people in the developed world: those having the capability to save or dramatically better the lives of people in the developing world, but decline, or those who thoughtlessly contribute to the torture of animals through their participation in the animal product economy.&nbsp;</p><p>I wish him comfort and hope that he can find a wiser path forward with the remainder of his life.</p>", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "q7CiiafQtsZDc4i4b", "postedAt": "2024-03-28T18:54:59.001Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>While I see what you're saying here, I prefer evil to be done inconsistently rather than consistently, and every time someone merely gets what they deserve instead of what some unhinged penal system (whether in the US or elsewhere) thinks they deserve seems like a good thing to me.</p>\n<p>(I don't personally have an opinion on what SBF actually deserves.)</p>\n", "parentCommentId": "zFhmNetKNA6LqkED6", "user": {"username": "BenMillwood"}}, {"_id": "TLdSYpFgdJdKYcdfz", "postedAt": "2024-03-28T19:01:52.711Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>This is just not true if you read about the case, he obviously knew he was improperly taking user funds and tells all sorts of incoherent lies to explain it, and it's really disappointing to see so many EAs continue to believe he was well-intentioned. You can quibble about the length of sentencing, but he broke the law, and he was correctly punished for it.</p>", "parentCommentId": "SyogE3fi5heXK8Gzx", "user": {"username": "RedStateBlueState"}}, {"_id": "ZboDtL5Sp4vdh2Wuz", "postedAt": "2024-03-28T19:12:16.219Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>Please note that my previous post took the following positions:<br><br>1. That SBF did terrible acts that harmed people.</p><p>2. That it was necessary that he be punished. To the extent that it wasn't implied by the previous comment, I clarify that what he did was illegal (EDIT: which would involve a finding of culpable mental states that would imply that his wrongdoing was no innocent or negligent mistake).</p><p>3. The post doesn't even take a position as to whether the 25 years is an appropriate sentence.<br><br>All of the preceding is consistent with the proposition that he also acted with the intention of doing what he could to better the world. Like others have commented, his punishment is necessary for general deterrence purposes. However, his genuine altruistic motivations make the fact that he must be punished tragic.</p>", "parentCommentId": "TLdSYpFgdJdKYcdfz", "user": {"username": "Brad West"}}, {"_id": "RBHTQcK4TCcEPv2Dg", "postedAt": "2024-03-28T19:28:57.541Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>Totally fair! I think part of my reasoning here relies on the difference between \"sentence I think is longer than necessary for the purposes of sentencing\" (which I would not necessarily classify as an \"evil\" in the common English usage of that term) and an \"unhinged\" result. I would not support a consistent sentence if it were unhinged (or even a close call), and I would generally split the difference in various proportions if a sentence fell in places between those two points.</p><p>It's a little hard to define the bounds of \"unhinged,\" but I think it might be vaguely like \"no reasonable person could consider this sentence to have not been unjustly harsh.\" Here, even apart from the frame of reference of US sentencing norms, I cannot say that any reasonable person would find throwing the book at SBF here to have been unjustly harsh in light of the extreme harm and culpability.</p>", "parentCommentId": "q7CiiafQtsZDc4i4b", "user": {"username": "Jason"}}, {"_id": "WpfCzHyxdjok4Rvba", "postedAt": "2024-03-28T19:31:56.733Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>To clarify, you would sacrifice consistency to achieve a more just result in an individual case, right?</p><p>But if there could be consistently applied, just, results, this would be the ideal result...</p><p>I don't understand the disagree votes if I am understanding correctly.</p>", "parentCommentId": "q7CiiafQtsZDc4i4b", "user": {"username": "Brad West"}}, {"_id": "kLjoumvyte2D4Fepe", "postedAt": "2024-03-28T20:07:57.617Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>All punishment is tragic, I guess, in that it would be a better world if we didn't have to punish anyone. I guess I just don't think the fact that SBF on some level \"believed\" in EA (whatever that means, and if that is even true) - despite not acting in accordance with the principles of EA - is a reason that his punishment is more tragic than anyone else's</p>", "parentCommentId": "ZboDtL5Sp4vdh2Wuz", "user": {"username": "RedStateBlueState"}}, {"_id": "pEZRCrwYF9TSqaDoB", "postedAt": "2024-03-28T20:36:11.705Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>I can't speak for the disagrees (of which I was not one), but I was envisioning something like this:</p><p>You are one of ten trial judges in country X, which gives a lot of deference to trial judges on sentencing. Your nine colleagues apply a level of punitiveness that you think is excessive; they would hand out 10 years' imprisonment for a crime that you -- if not considering the broader community practices -- would find warrants five years. Although citizens of county X have a range of opinions, the idea of sentencing for 10 years seems not inconsistent with the median voter's views. The other judges are set in their ways and have life tenure, so you are unable to affect the sentences they hand down in any way. Do you:</p><p>(a) sentence to five years, because you think it is the appropriate sentence based on your own judgment;</p><p>(b) impose a ten-year sentence that you find excessive, because it prevents the injustice of unequal treatment based on the arbitrary spin of the assignment wheel; or</p><p>(c) split the difference, imposing somewhere between five and ten years, accepting both that you will find the sentence too high and that there is an unwarranted disparity, but limiting the extent to which either goal is compromised.</p><p>I would be somewhere in camp (c), while Ben sounds like he may be closer to camp (a). I imagine many people in camp (b) would disagree-vote Ben, while people in camp (c) might agree, disagree, or not vote.</p>", "parentCommentId": "WpfCzHyxdjok4Rvba", "user": {"username": "Jason"}}, {"_id": "TaKzqftkgeage2wDu", "postedAt": "2024-03-28T20:45:32.917Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>Nitpick: I think this is a linkpost not a repost since this is the first time it has been shared on the forum.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "Mdf7qA8CDySnPEZ4m", "postedAt": "2024-03-28T20:58:28.917Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<blockquote><p>However, from review of what I have read, it seems as if he acted from a sincere desire to better the world and did so to the best of his (quite poor) judgment.</p></blockquote><p>Although none of us can peer into SBF's heart directly, I think a conclusion that he acted from mixed motives is better supported by the evidence. It would take a lot to convince me that someone who was throwing money around like SBF on extravagances (or <a href=\"https://arstechnica.com/tech-policy/2023/09/sbfs-parents-were-given-16-4m-house-paid-for-entirely-by-ftx-lawsuit-says/\">a $16.4MM house for his parents</a>) was not motivated at least in considerable part by non-benevolent desires.&nbsp;</p><p>If one thinks he viewed luxuries bought as part of his fraudulent enterprise as ultimately altruistic because what makes SBF productive --&gt; makes FTX richer --&gt; makes the world better through philanthropy, then we have a framework under which it is impossible to categorize his motives because any behavior can be recast as ultimately motivated by altruism. The base rate of fraudsters being motivated by personal gain is very high, so -- unless there's a clear way to verify lack of personal-gain motivation -- I think assuming its absence is doubtful.&nbsp;</p>", "parentCommentId": "SyogE3fi5heXK8Gzx", "user": {"username": "Jason"}}, {"_id": "nFq2Fd3QEKcoFesRi", "postedAt": "2024-03-28T21:16:46.976Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>SBF likely had mixed motives, in that there was likely at least some degree to which he acted in order to further his own well-being or with partiality toward the well-being of certain entities (such as his parents). The reasoning that you mentioned above (privileging your own interests instrumentally rather than terminally such that you as an agent can perform better) is a fraught manner of thinking with extremely high risk for motivated reasoning. However, I think that it is one that serious altruists need to engage with in good faith. To not do so would imply giving until one's welfare was at the global poverty line, which would probably impair one too much as an agent. Of course, I'm not saying he was engaged in good faith regarding this instrumental privileging argument, but I cannot preclude the possibility.<br><br>Regardless, I have been persuaded by everything that I have seen that a significant part of SBF's motivations were to help advance a world of higher well-being. Of course, from a deontological perspective he did wrong by his dishonest and fraudulent actions. From a consequentialist perspective, the downside risks had such incalculable costs that it was terrible as well.</p><p>But the sincere desire of his to make the world a better place makes me sympathetic of him in a way that I probably would not be with similarly sentenced other convicts. Given a deterministic or random world, I understand that all convicts are victims too. But I cannot help but feel more for one who was led to their crime by a sincere desire to better the world, than say, to kill their spouse in a fit of rage, or advance themselves financially without any such altruistic motivation.</p>", "parentCommentId": "Mdf7qA8CDySnPEZ4m", "user": {"username": "Brad West"}}, {"_id": "T6gNKKxBatwHLuhvx", "postedAt": "2024-03-28T22:28:50.083Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>I think this is a fair compromise between what the prosecutors wanted and what the defense wanted; I don't have an opinion on what's the \"correct\" level of punishment for this type of crime. My guess is that if I did a first-principles analysis his crime is either the type of thing that gets ~5 years or something that gets life imprisonment without parole, but I'm not confident and also I don't see much value in forming my own independent impression on <a href=\"https://scholarship.law.columbia.edu/cgi/viewcontent.cgi?article=3580&amp;context=faculty_scholarship\">optimal deterrence theory</a>, given that it's not decision-relevant to me at all.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "SByd8YFdvAdE68Jm2", "postedAt": "2024-03-28T22:44:10.979Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<blockquote><p>he got (and many white-collar criminals get) significantly less than his culpability level and harm caused would predict.</p></blockquote><p>What do you think is the correct level of punishment for white collar crimes based on harm? If we only look at first-order effects [1], even stealing 1B is just really bad, consequentially. Like if we use a <a href=\"https://www.transportation.gov/sites/dot.gov/files/docs/2016%20Revised%20Value%20of%20a%20Statistical%20Life%20Guidance.pdf\">simple VSL framework it's equivalent to ~100 murders</a>.&nbsp;</p><p>But of course, this is very much not how the justice system currently operates, so overall I'm pretty confused.</p><p>[1] And not looking at second order effects of his crimes e.g. creating negative reputation for EA which is probably negative (Though prosecutors might disagree), or creating negative reputation for crypto and political donations which is probably positive.</p>", "parentCommentId": "zFhmNetKNA6LqkED6", "user": {"username": "Linch"}}, {"_id": "YutTuoEJnRxh93aPA", "postedAt": "2024-03-28T22:58:32.320Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>It feels like you're arguing for a higher-than-necessary level of harm and suffering in the world, just because a high level of suffering already exists in this context? I can't see an argument with this structure working anywhere else (and believe me, I think Sam should be punished).</p>", "parentCommentId": "zFhmNetKNA6LqkED6", "user": {"username": "huw"}}, {"_id": "YZAmCfCEfLoyZYLPL", "postedAt": "2024-03-29T00:11:49.514Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>For some purposes of sentencing, social context affects what is reasonably \"necessary\" and what I would count as \"harm.\" Society is the other participant in the sentencing exercise.</p><p>Suppose A thinks from first principles that five years was enough for SBF. In the context of the American system, that sentence would convey something about offense severity -- and it would drastically understate it where a street dealer in illegal drugs might get the same sentence. So because of the background severity of sanctioning, the five-year sentence is inadequate to convey the appropriate degree of societal condemnation. If you think the social educative function of the criminal process is important, that's a problem. A sentence that tells everyone in the US that what SBF did isn't really that big a deal on the grand scheme of criminal activity would be quite harmful.</p><p>The social meaning also matters to the victims. Seeing the person who harmed you receive a penalty in line with their crimes mitigates the suffering of many victims; seeing them get off easy imposes additional suffering on others. And those victims are experiencing the sentence through the lens of what other offenders in their society receive.</p><p>But the main harm I had in mind is the harm to the norm that all are equal before the law and will be treated equally. Now, if I hand out below-norm sentences to all offenders, maybe that particular harm isn't present. But those kinds of breaks are not equally distributed; we know that the system is harder on people of color, poor people, and other disadvantaged groups. Giving SBF too much of a break from what others with comparable culpability and harm receive gives the perception that the privileged are more favored before the law than the commoners. Or maybe the reality -- some people have argued that the court should consider SBF's loss of reputation and loss of massive earning capacity, which sounds a whole lot to me like taking his privilege into account. Avoiding that harm is more important to me than whether SBF spends a few extra years in prison.</p><p>(I should clarify that I think a sentence of more than 25 years <i>was </i>necessary and appropriate here on/near first principles, mainly for reasons described in the quick take linked to my comment. I should note that this case hits a lot of the aggravating factors I tend to weigh heavily, and I see no significant mitigating factors here at all.)</p>", "parentCommentId": "YutTuoEJnRxh93aPA", "user": {"username": "Jason"}}, {"_id": "ayGeKvcmC95iCBKPp", "postedAt": "2024-03-29T00:18:32.872Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>I think this changed my mind, but at least for me I was more persuaded by your first point. I momentarily forgot that I really believe that white collar crime should have huge deterrent punishments that take little regard to the personal circumstances of the defendant; that ultimately a large punishment for Sam would proportionally create much less future harm. And that that's not inconsistent with desiring &amp; working toward an end to the hellish US prison system.</p>", "parentCommentId": "YZAmCfCEfLoyZYLPL", "user": {"username": "huw"}}, {"_id": "tomZoBiKBLN7dXQjb", "postedAt": "2024-03-29T01:11:54.165Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<blockquote><p>I think a conclusion that he acted from mixed motives is better supported by the evidence.</p></blockquote><p>I disagree, but it obviously depends what exactly we're discussing.&nbsp;<br><br>Was his judgment for not coming clean when things were only starting to get bad compromised by not wanting to lose his influence, money, and reputation? Probably!<br><br>However, do I think he made some of his most consequential decisions to a significant degree because he thought he could get nice things for himself that way? I actually don't think so!</p><p>Making big decisions for reasons other than impact <i>would ruin his score in the game</i>. It looks to me like his primary drive was optimizing his life for impact like a video game, trying to score the most points. Making a big life decision for self-oriented reasons would be forfeiting points he could otherwise have gotten, which would feel deeply unsatisfying for someone who's always thinking about how to get the highest score.&nbsp;<br><br>Also, $16 million is peanuts for someone who's personally worth $2-10 billion, which SBF probably \"\"somewhat reasonably\"\" thought he was worth when things were going well (or when he optimistically thought he could make them well again soon enough). It's like what a couple hundred bucks is to someone with a net worth of $80,000 – not that significant! Imagine you're making decisions for tens of millions every day. I can't emphasize enough how unimportant it then becomes whether you pay 1 million or 16 million for your parents' house (which you may or may not also plan to use for yourself or some of your coworkers/flatmates). Just like with offices or the building where he planned to sleep in, the price isn't the relevant variable (what's more relevant is, \"Does it take up your time or people's time with high opportunity costs? Is it close to the office where you work? Is it convenient?\" Etc.)&nbsp;<br><br>I feel like,&nbsp;</p><ul><li>if someone displays as much single-minded obsessiveness as SBF,&nbsp;</li><li>and his conversations with the people around him tell you he's hyperfocused on impact (he wasn't just obsessing about how to grow FTX for money, he was also constantly discussing ideas around grantmaking strategies or paying Trump to not run again for election),</li><li>and his close social circle is reinforcing the impact-orientedness,</li><li>and there's a credible ideology behind it which generated many other examples of similarly impact-obsessed people (hopefully the vast majority of them without the recklessness and \"no fear of bad consequences\" part),</li></ul><p>then I'd say the evidence points to being primarily impact-driven pretty much as strongly as it gets. Of course, no one has the motivations of a perfect utilitarian robot, but I think SBF <i>was trying, </i>so it doesn't seem fair to call it \"acted from mixed motives.\"</p><p>Edit to add: We could discuss whether he was \"unusually biased\" for someone who's trying to have a ton of impact – hopefully yes (otherwise EAs don't stand a chance of getting impact right), but that's still meaningfully different from \"acting from mixed motives.\" (Also, I'd say the most severe bias was probably a blindspot around risk taking and risks of things going badly, rather than e.g., being too much into a rich lifestyle or being too much into fame or whatever. FWIW, my best guess is that he also was too much into wanting power/influence; I'm just saying that it doesn't seem like the primary reason things went so poorly.)&nbsp;</p><p>Edit2: <a href=\"https://www.lesswrong.com/posts/HMaBPzrnvg2WCw6KL/noting-an-unsubstantiated-communal-belief-about-the-ftx?commentId=cx5jKqeGC8zcTD3Ex\">Somewhat relevant comment</a> I made a year ago about why I think SBF having dark triad traits is compatible with the above picture.&nbsp;</p>", "parentCommentId": "Mdf7qA8CDySnPEZ4m", "user": {"username": "Lukas_Gloor"}}, {"_id": "88vdQzhqRFPCxP8GK", "postedAt": "2024-03-29T01:12:32.475Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>As far as what they <i>predict</i>, 40-50 years as explained in the government's sentencing memo.</p><p>As far as what the impact <i>should </i>be -- I would have to write a book on that. To start with, I see multiple, related harm-related measures here:</p><ul><li>The amount of expected harm the offender knew or should have known about (this is the culpability-flavored measure);</li><li>The actual expected value of harm (this is more of a general deterrence-flavored measure); and</li><li>The actual harm (more of a retribution-flavored measure).</li></ul><p>I also don't see a unified measure of harm in economic-loss cases, as the harm associated with stealing $1,000 from a working class person is substantially higher than the harm of stealing it from me. Targeting vulnerable victims also gets you an enhancement for other reasons (e.g., it suggests a more extensive lack of moral compass that makes me value incapacitation more as a sentencing goal).</p><p>But most fundamentally, both harm and culpability go into the mix, filtered through the standard purposes of sentencing, to produce a sentence that I think is sufficient, but not greater than necessary, to accomplish those goals.</p><p>So I can tell you that the relationship between harm and sentence in fraud cases shouldn't be -0-, both because there is little or no general deterrence against making your frauds bigger, and because there is some relationship between culpability and fraud size. It also shouldn't be linear, both because this is impractical given the wide variance in harms, and because the degree of culpability does not ordinarily vary in a linear manner.&nbsp;</p><p>Most people in the sentencing realm think the federal sentencing guidelines increase the sentence too much based on loss amount (~ 25% uplift for each doubling of amount, plus some other uplifts tend to scale with size) and give too much weight to loss size in general. I agree with both of those views. Roughly and after considering a fuller measure of harm than aggregate financial loss, I might consider such an algorithm appropriate for weighing the <i>harm factor</i> in arriving at a sentence rather than for uplifting the sentence itself. And maybe I would increase the average sentence about 10% for each doubling, if all other factors were equal (low confidence)? But usually non-harm culpability factors increase with harm size, so the average increase in practice would probably be higher (low confidence).</p><p>As a bonus exercise: The differential impact between harm and non-harm culpability factors seems to vary quite a bit based on offense type. In drunk driving cases, actual harm seems to explain the bulk of the variance? No harm, first offense -- 2 days. Kill someone, no harm -- perhaps 10 years. The non-harm culpability factors and even the expected-harm measures aren't really that different in a lot of cases. Even here, the extra punishment for multiplied harm isn't linear; you might get a 50% uplift for the second fatality, and a total of 85% more for three fatalities (low confidence)?&nbsp;</p><p>On the other hand, if you rob five convenience stores on five days before getting caught, you might get twice the sentence for robbing one (low confidence) -- even though the culpability scales here much more obviously with the number of offenses / amount of harm. One theory here is that getting caught and punished gives you the opportunity to learn your lesson; if you rob again after going through that then the argument for long-term incapacitation is stronger, etc.</p>", "parentCommentId": "SByd8YFdvAdE68Jm2", "user": {"username": "Jason"}}, {"_id": "KGy7w4FrWZLfaDWmA", "postedAt": "2024-03-29T01:34:01.614Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<blockquote><p>Also, 16 million is peanuts for someone who's personally worth 2-10 billion</p></blockquote><p>If you're going to compare outflows to guess at motivation, I think it's better to use actual charitable giving numbers as the comparator rather than perceived wealth. Doubtless underinclusive on both numbers, but IIRC the grants through FTXFF were ~$150MM and the outflows to his parents alone were ~$25MM (there was also ~$10MM in cash). That doesn't suggest the self-serving cashflows were peanuts in either a relative sense or an absolute sense.</p><p>If you assumed based on past actions that ~ 90% of the money was going to end up donated to charity, then ~$1B of the loss found by the district court today was attributable to the 10% that wasn't. Given SBF's crimes, and the fairly brazen nature of his perjury at trial, I would credit his observed actions over what he said he'd do with all the money in the end.&nbsp;</p>", "parentCommentId": "tomZoBiKBLN7dXQjb", "user": {"username": "Jason"}}, {"_id": "MdJZG4jencvqAnYFb", "postedAt": "2024-03-29T01:54:41.031Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>That's a good point. If there weren't a convincing story for why more donations weren't made or at least set up to be made soon, I'd say your point counts for quite a lot!</p><p>However, in this specific case, I feel like there are good reasons why I wouldn't expect that many donations to be made right away:</p><ul><li>FTX did have a hole in the bank! It's interesting that donations were made at all given that they were strictly speaking insolvent. (Of course, he had to keep up appearances or pay for previously-made commitments, etc., so it's not too surprising. I'm just saying it probably wouldn't have been wise even for someone as risk tolerant and unconcerned-by-the-illegality-of-it as SBF to donate much more when there was still a hole in their wallet.) (Edit: Admittedly, this point also cuts against giving money to his parents.)</li><li>Longtermist grantmaking (which SBF thought was most impactful, I believe) already started to feel a bit crowded once FTX Future Fund came in, so it's not actually that easy (or sensible) to deploy $100s of millions on short notice in that cause area.</li><li>The FTX Future Fund was still relatively new; it makes sense to scale up giving as you learn things and do various types of preparatory work for your grantmaking/\"active grantmaking.\"</li><li>\"Donating now vs later\" isn't actually the most obvious of EA strategy questions, esp. if you think you're greatly beating the market on investment returns, which he had been doing at least in his own mind.</li><li>SBF's entire philosophy was about massive wins and game-changing ambitious stuff, so he probably thought of the donations he had already made or was making at the time as not that significant compared to what he was gonna do later, and probably had tentative ideas for long-term plans like \"amass enough money to buy a chip company and then use that as leverage to get more AI safety work done at labs,\" or something super ambitious like that, for which it felt worthwhile to keep investing in the growth of his FTX empire.</li><li>Lastly, and somewhat related to the previous bullet point of weird super-ambitious ideas, he did discuss the paying Trump thing and, at least according to Michael Lewis's sources, he was entertaining the thought (though probably not super seriously because this was when they had a massive hole in the bank?) of paying a sum for it that would have been a lot bigger than the $150 million in charitable contributions you mentioned. (But sure, you can say that, since nothing happened there, it was only talk. We don't know, but I find it plausible that he'd have liked the thought of being the guy who prevented Trump from running!)</li></ul><p>Edit: If someone says \"giving 10 million to his parents (and a house, but we're not sure if the house had other uses) shows he must have had mixed motives,\" I'd be like: Okay, yeah, it does look like this isn't what a utilitarian robot would've gone for, but when I hear \"mixed motives,\" I think of something like 50-50 or at least 40-self-oriented, 60-altruism, whereas giving money to get your parents to retire early could also be compatible with something like 10-90 (or even 5-95), \"focus on impact for the big decisions, but do something nice for your parents once you've made it big.\"&nbsp;</p>", "parentCommentId": "KGy7w4FrWZLfaDWmA", "user": {"username": "Lukas_Gloor"}}, {"_id": "dxwMKkf9QD4cgjnbq", "postedAt": "2024-03-29T11:36:16.316Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>yes, that's right.</p>\n<p>I can think of grounds to disagree, though. Say for example you were able to disproportionately protect e.g. white people from being prosecuted for jaywalking. I think jaywalking shouldn't be illegal, so in a sense any person you protect from prosecution is a win. But there would be indirect effects to a racially unfair punishment, e.g. deepening resentment and disillusionment, enabling and encouraging racists in other aspects of their beliefs and actions. So even though there would be less direct harm, there might be more indirect harm.</p>\n<p>I think the indirect harms are at work in this case too, and it's just a matter of how you weigh them up. I don't have anything but instinct to justify the weighing I've done.</p>\n", "parentCommentId": "WpfCzHyxdjok4Rvba", "user": {"username": "BenMillwood"}}, {"_id": "k8sRNtHxfbzuRQAFX", "postedAt": "2024-03-29T11:54:05.764Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>Yeah, sorry, when I said \"unhinged\" I meant \"the US penal system is in general unhinged\", not \"this ruling in particular is unhinged\". I also used \"evil\" as an illustrative / poetic example of something which I'd rather be inconsistent than consistent, and implied more than I intended that the sentencing judge was actually doing evil in this case.</p>\n<p>It's possible that I'm looking at how the system treats e.g. poor people and racial minorities, where I think it's much more blatantly unreasonable, and transplanting that judgement into cases where it's less merited. 25 years is still a pretty long time though, and I wouldn't personally push for longer. (I would, however, support a lifetime ban from company directorships and C-suite executives and similar.)</p>\n", "parentCommentId": "RBHTQcK4TCcEPv2Dg", "user": {"username": "BenMillwood"}}, {"_id": "rwXgWoLZmyYySBRrA", "postedAt": "2024-03-29T13:36:49.263Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>As others have observed, it's been taboo to publicly speculate on SBF's innocence since long before his conviction, including -- or perhaps especially -- in EA spaces. So please excuse the pseudonym, but...</p><p>I think this sentence is a tragedy. &nbsp;This isn't the place to get into my general issues with the United States incarceration system, but even putting that to one side, I believe there's much more to this story than meets the eye and it would be nice to see more EAs seriously grappling with <a href=\"https://www.asecondglance.org/\">the arguments in his defense.</a></p>", "parentCommentId": null, "user": {"username": "SteadyPanda"}}, {"_id": "7JAPi3kJBw9zHxzNe", "postedAt": "2024-03-29T14:24:18.142Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>I think people who have followed this unusually closely should be encouraged to argue for what they think is right if they have a strong take, but I just don't think this theory is likely. An innocent person would be more likely to talk more freely about things/be less evasive and they'd probably have a better explanation of how it is that they could have missed an 8 billion hole in the bank. It's suspicious if you need to make the same move (\"he could've not seen this\" or \"he could have not looked closely at that\") multiple times to preserve the chance of innocence. Every time you use a not-too-likely excuse like this, your hypothesis takes a hit.</p>\n<p>I don't have a strong view on the sentence length. I think the main reason for a low sentence length (compared to the guidelines for the counts he was convicted of) is that I do believe SBF was strongly altruistically motivated, which is unusual for cases like that. I think the main reason for a long(-ish) sentence length is perjury and evasiveness.</p>\n", "parentCommentId": "rwXgWoLZmyYySBRrA", "user": {"username": "Lukas_Gloor"}}, {"_id": "pepgL4kpxahQsYkFx", "postedAt": "2024-03-29T14:39:30.608Z", "postId": "bNWgMHAsXdpwiSphN", "htmlBody": "<p>A better explanation than what?</p><p>It wasn't <a href=\"https://www.autismandlaw.com/sam-bankman-fried-sbf\">evasiveness</a>, in my view.</p><p>Plus I'm not sure if the judge means much by \"perjury\" beyond \"continues to plead not guilty\" and this so-called evasiveness.</p>", "parentCommentId": "7JAPi3kJBw9zHxzNe", "user": {"username": "SteadyPanda"}}]