[{"_id": "XSfqP9oPLxkGmaBM8", "postedAt": "2023-08-31T08:15:04.673Z", "postId": "BnzogudjvxxPeZFrE", "htmlBody": "<p>Great initiative!&nbsp;</p><p>I'm happy to read it went well with the mixing of mid-career professionals and students, since mid-career professionals can feel a bit 'out of place' in a very young setting. Did you take concrete steps to avoid this? Or did these people all knew each other from the start, as EA can be a bubble? Do you have an idea of what were the benefits of mixing with students for mid-career people?&nbsp;</p><p>Your results are very clearly encouraging, bravo! I'm definitely taking notes to reproduce this at EA Sweden :-)</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "5KjyraxBj8jZMFLKr", "postedAt": "2023-08-31T19:43:57.212Z", "postId": "BnzogudjvxxPeZFrE", "htmlBody": "<p><strong>Executive summary</strong>: Effective Altruism Philippines recently held a successful career planning retreat for students and professionals focused on cause prioritization, career building, and expanding networks.<br><br><strong>Key points</strong>:</p><ol><li>The retreat aimed to boost learning on EA cause areas, help develop career plans, and facilitate connections between attendees.</li><li>Outcomes showed high satisfaction, value ratings, and new connections made. Attendees also reported specific career action plans resulting from the retreat.</li><li>What went well included engaged participants, great speakers, and a welcoming environment.</li><li>Areas for improvement were having a less packed schedule, emphasizing one-on-ones, adding discussions, getting more applicants, and having better social events.</li><li>Plans going forward include more events on cause areas, reading groups, workshops, and continued career assistance services.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "zuTxdBY5rbvDZcNG3", "postedAt": "2023-09-01T18:04:54.492Z", "postId": "BnzogudjvxxPeZFrE", "htmlBody": "<p>Thanks a lot for posting this! I really enjoyed reading it and the linked google document - would anyone in the EA Philippines team be interested in a short meeting with me about this? I currently run EA Oxford and have some specific questions.</p>", "parentCommentId": null, "user": {"username": "CEvans"}}, {"_id": "rpWF4pASAvTr9tEf2", "postedAt": "2023-09-04T01:32:20.329Z", "postId": "BnzogudjvxxPeZFrE", "htmlBody": "<p>Hi there! I'd love to have a chat with you :D You can contact me on my <a href=\"https://www.linkedin.com/in/affcendana/\">LinkedIn</a> :D&nbsp;</p>", "parentCommentId": "zuTxdBY5rbvDZcNG3", "user": {"username": "Alethea Faye Cendaña"}}, {"_id": "LG8ryBrzHknHry899", "postedAt": "2023-09-04T02:21:09.173Z", "postId": "BnzogudjvxxPeZFrE", "htmlBody": "<p>Thank you for the kind words and for asking the question about mid-career professionals.</p><p><i><strong>Mid-career professionals can feel a bit 'out of place' in a very young setting. Did you take concrete steps to avoid this?</strong></i></p><p>&nbsp;Initially we thought the mid-career professionals and the \"younger\" participants will have separate groups during the retreat (i. e. sit together in one table as a group). Fortunately, this wasn't the case. ☺️ Most of the mid-career professionals had something to share about their careers and experience, some were invited as speakers and panelists, and the younger participants were very eager to ask follow-up questions and for more specific advice during down times (lunch, one-on-ones, night time socials).&nbsp;</p><p>One thing that helped younger professionals and students approach the mid-career professionals was the attendee deck. We asked all attendees to fill out their profiles with their short bio, how people can help them, and how they can help others. I observed some people reading someone's profile and listing questions to ask that someone.&nbsp;</p><p>&nbsp;</p><p><i><strong>Did these people all knew each other from the start, as EA can be a bubble?</strong></i></p><p>Not entirely sure but most people knew each other through online EA PH events and were only meeting in-person for the first time in the retreat. A few of the attendees regularly see each other when they attend our monthly in-person community meetup.&nbsp;</p><p>&nbsp;</p><p><i><strong>Do you have an idea of what were the benefits of mixing with students for mid-career people?&nbsp;</strong></i></p><p>The biggest benefit mid-career professionals can gain from mixing with students during the retreat would be new and fresher perspective. I think during the retreat, mid-career professionals gained more by connecting and initiating collaboration with other mid-career professionals. Admittedly, I think we designed the program mostly for a younger setting so the mid-career professionals were mostly guests/speakers/panelists who could impart knowledge and give advice. We did have activities that mid-career professionals really appreciated such as the Personal Theory of Change workshop by Red Bermejo and the Professional's workshop on Empowered Decision-Making by Roc Bata. I do wish we had more activities dedicated for career enrichment of this demographic.</p><p>I hope I answered your questions, feel free to ask followup questions. Happy to chat more with you if you'd like! :&gt; You can contact me on my <a href=\"https://www.linkedin.com/in/affcendana/\">LinkedIn</a> :D&nbsp;</p>", "parentCommentId": "XSfqP9oPLxkGmaBM8", "user": {"username": "Alethea Faye Cendaña"}}]