[{"_id": "EqmYGerWzocajvAwu", "postedAt": "2022-08-23T17:41:24.432Z", "postId": "bo6Jsvmq9oiykbDrM", "htmlBody": "<p>Some other failure modes of EA aesthetics is the issue of keeping EA's identity small, and aesthetic lack prevents the failure mode of going to political stuff immediately, which has been a downfall for many organizations. EA thankfully is mostly apolitical right now, and going for more developed aesthetics threatens that apoliticality, which is necessary if you want to be normatively and empirically uncertain. It's similar in nature to this comment in your previous post here: <a href=\"https://forum.effectivealtruism.org/posts/JQyacxvzoH3Eo4GPo/guided-by-the-beauty-of-one-s-philosophies-why-aesthetics#comments\">https://forum.effectivealtruism.org/posts/JQyacxvzoH3Eo4GPo/guided-by-the-beauty-of-one-s-philosophies-why-aesthetics#comments</a> (Sorry for not pointing to it exactly.)</p>\n<p>This failure mode is so serious and so common such that any efforts that effect that apoliticality need to be very scrutinized first, since there's a whole lot of downside risk, and not too much upside to stronger aesthetics. That means EA shouldn't fund aesthetics right now.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "cAM74ahmqiQtpxsQC", "postedAt": "2022-08-23T23:14:21.028Z", "postId": "bo6Jsvmq9oiykbDrM", "htmlBody": "<p>This is a good point. I don't think it necessarily conflicts with my suggestions, which are more about allowing people and organizations within the EA ecosystem to spend a small part of their time and resources on exploring various aesthetics, rather than picking an aesthetic identity and sticking to it. &nbsp;</p><p>I also think that aesthetics can absolutely be apolitical (I assume you mean the term in a stricter sense like \"mapping to current areas of political disagreement in society,\" since in a broad sense EA is about allocating common resources and therefore inherently political). But yes, the failure mode you describe seems real and should be kept in mind.</p>", "parentCommentId": "EqmYGerWzocajvAwu", "user": {"username": "Étienne Fortier-Dubois"}}, {"_id": "XaESqSYNoLE8aiGwe", "postedAt": "2022-08-24T03:10:55.998Z", "postId": "bo6Jsvmq9oiykbDrM", "htmlBody": "<p>You seem to suggest a couple of times that the aesthetic sense sometimes picks up on things that the rational sense misses. What's an example of that that you've experienced?</p>\n<p>My experience has been, though there are many intuitions that have something useful to say, it's been rare that the aesthetic sense has disagreed with the rest of the system and turned out to be onto anything. It's prone to getting tied in knots and projecting superficial readings onto the situation that don't make any sense. It could be onto something.. but I'm never sure. It sometimes feels like it only constructs reality, never reflects or explains them.</p>\n", "parentCommentId": null, "user": {"username": "MakoYass"}}, {"_id": "F4MDKHKE8DFvPhaLm", "postedAt": "2022-08-24T03:12:14.751Z", "postId": "bo6Jsvmq9oiykbDrM", "htmlBody": "<p>In the EA VR group, we've been working towards designing environments for supporting the right kind of vibes for the things we need to do in there (meeting new people, hashing things out, and eventually coworking)</p>\n<p>I think most of us, maybe even some architects, know very little about how environments set expectations and influence mood, despite being affected by it. As an artform it's so expensive to wield, there aren't many people who get to experiment a lot with it over the course of their careers, but in VR that's going to change, I think we're going to see a lot of advances in social venue design coming really fast.</p>\n", "parentCommentId": null, "user": {"username": "MakoYass"}}, {"_id": "NRiNfioWD3A9xtT7c", "postedAt": "2022-10-02T11:43:53.068Z", "postId": "bo6Jsvmq9oiykbDrM", "htmlBody": "<p>One of my favourite EA Forum posts (and I didn't expect to like it). Many thanks to Gavin for highlighting it.</p>\n", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "z6wmeaxR9DvwRasTq", "postedAt": "2022-10-02T12:00:34.819Z", "postId": "bo6Jsvmq9oiykbDrM", "htmlBody": "<p>I think if you replace 'aesthetic sense' with 'System 1'/'gut feelings' the post makes more sense. Taking ethics specifically, I think a lot of cases of \"naive consequentialism\" could be seen as following one's rational sense despite the protests of one's aesthetic sense.<br><br>Maybe we shouldn't completely conflate 'aesthetic sense' with 'System 1' but I personally really like this framing.</p>", "parentCommentId": "XaESqSYNoLE8aiGwe", "user": {"username": "Holly"}}]