[{"_id": "FZgWhWZtmJyWT3DKT", "postedAt": "2024-03-08T15:55:43.038Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>That sounds upsetting.</p><p>Did you inform EAIF in advance of your intent to publish this? There are sometimes good reasons to dispense with the default <a href=\"https://forum.effectivealtruism.org/posts/f77iuXmgiiFgurnBu/run-posts-by-orgs\">norm of running critical posts by orgs</a>, but I am not seeing any of them present on the face of this post.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "hB5t2mQF2CPKJFvpv", "postedAt": "2024-03-08T16:01:55.173Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I don’t know how I feel about applying that standard in this case, given that lack of communication is the thing at issue</p>\n", "parentCommentId": "FZgWhWZtmJyWT3DKT", "user": {"username": "bec_hawk"}}, {"_id": "r9sMievNfFzvrecHq", "postedAt": "2024-03-08T16:30:24.535Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I’m very sorry that you had such a bad experience here. Whilst I would disagree with some of the details here I do think that our communication was worse than I would have liked and I am very sorry for any hardship that you experienced. It sounds like a stressful process which could have been made much better if we had communicated more often and more quickly.</p>\n<p>In my last email (March 4th), I said that we were exploring making this grant, but it’s legally challenging. Grants for mental health support are complicated, in general, as we have to show that there is a pure public benefit. We have an open thread with our legal counsel, and I’m cautiously optimistic about getting a decision on this relatively soon.</p>\n<p>In general, I don’t think I made promises or hard commitments to get back in a certain time frame; instead, I said that we aim to get back by a certain time. I believe I am at fault for not making this distinction appropriately clear, and I am upset that this mismatch of expectations resulted in hardship.</p>\n<p>I'd also like to quickly clarify that many of the errors here were mine (as opposed to the wider EA Funds team). I should have been more realistic about the time frame for a grant of this nature.</p>\n", "parentCommentId": null, "user": {"username": "calebp"}}, {"_id": "FmyGtrXSyzRHDtszd", "postedAt": "2024-03-08T16:35:13.979Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>That's a fair position. To me, the advantages of prior notification still seem in play here. Quoting from Jeff's post:</p><blockquote><p>This allows the org to prepare a response if they want, which they can post right when your posts goes out, usually as a comment. It's very common that there are important additional details that you don't have as someone outside the org, and it's good for people to be able to review those details alongside your post. If you don't give the org a heads up they need to choose between:</p><ul><li>Scrambling to respond as soon as possible, including working on weekends or after hours and potentially dropping other commitments, or</li><li>Accepting that with a late reply many people will see your post, some will downgrade their view of the org, and most will never see the follow-up.</li></ul></blockquote><p>Given the simplicity of the complaint, I would not think more than 2-3 days notice would be warranted, although I would suggest an extension to ~1 week if the org could identify specific workload commitments that made it difficult for the org to prepare a timely response to the Forum post.</p>", "parentCommentId": "hB5t2mQF2CPKJFvpv", "user": {"username": "Jason"}}, {"_id": "TfAgjMKpwAzuY2b92", "postedAt": "2024-03-08T16:49:41.367Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>One thing to note is that at the end of January, we rejected the original grant (which I believed that we wouldn't be able to show a clear public benefit for), and then said we were interested in a different version of the grant that seemed more defensible to me (subject to legal review). Since then, we have been working out whether we can make this alternate grant.</p>\n<p>I didn't realise that Igor stopped taking clients completely, and I regret that I didn't make a stronger effort to understand the consequences of the unclear situation whilst we tried to understand the legal implications of making the grant.</p>\n", "parentCommentId": "r9sMievNfFzvrecHq", "user": {"username": "calebp"}}, {"_id": "hCcTSZCprsdy3dSxh", "postedAt": "2024-03-08T17:15:31.885Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>This is entirely consistent with two other applications I know of from 2023, both of which were funded but experienced severe delays and poor/absent/straightforwardly unprofessional communication</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "p8D6SjqToJ8MfdnAp", "postedAt": "2024-03-08T17:59:42.638Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Same here</p>\n", "parentCommentId": "hCcTSZCprsdy3dSxh", "user": {"username": "bec_hawk"}}, {"_id": "9AYqptzT4MKq7YENP", "postedAt": "2024-03-08T18:00:31.521Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>This is a very unfortunate situation, but as a general piece of life advice for anyone reading this: <i>expressions of interest</i> are not <i>commitments</i> and should not be \"interpreted\" -- let alone acted upon! -- as such.</p><p>For example, within academia, a department might express interest in having Prof X join their department. But there's no guarantee it will work out. And if Prof. X <i>prematurely quit their existing job,</i> before having a new contract in hand, they would be taking a <i>massive</i> career risk!</p><p>(I'm not making any comment on the broader issues raised here; I sympathize with all involved over the unfortunate miscommunication. Just thought it was important to emphasize this particular point. <i>Disclosure:</i> I've recently had positive experiences with EAIF.)</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "8BNoJFjrKpDKPyeFP", "postedAt": "2024-03-08T18:05:42.210Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I do think the simplicity of the complaint also helps in the other direction as well though - I would guess that it was fairly unburdensome to respond in this case. Though I will say that there were certain aspects of the post that already flagged to me that we were getting a skewed view (eg the pausing of clients seeming premature), so maybe that makes me unduly unconcerned about others absorbing an unbalanced view.</p>\n<p>Though re you point about making an extension due to workload, I’d be strongly against that in this case as the whole complaint is around disorganisation and frustrating extensions of deadlines - that is the case where someone least owes an org flexibility, and I think it would reflect rather poorly on an org to request it in that situation.</p>\n", "parentCommentId": "FmyGtrXSyzRHDtszd", "user": {"username": "bec_hawk"}}, {"_id": "jYQDb3AtxXWbs4MXj", "postedAt": "2024-03-08T18:09:12.958Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Me too</p>", "parentCommentId": "hCcTSZCprsdy3dSxh", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "of4BxMxdEvnDL3h2u", "postedAt": "2024-03-08T19:43:16.568Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Without commenting on the rest of this case or EA Funds more broadly, this stood out to me:</p><blockquote><p>At the EA funds website, they write that they usually grant money within 21 days from sending an application, and that their managers care (no further specification).</p></blockquote><p>I was surprised the OP would request a response within one month when applying for a grant until I saw this truly is emphasized on the EA Funds site. This seems inconsistent with my understanding of many people's experiences with EA Funds and easy messaging to change to set more realistic expectations. I appreciate EA funders' efforts toward quick turnaround times, but traditional funders typically take many months to reach a decision, even for comparably sized (i.e. small) grants. This seems like a strong case for \"underpromise, overdeliver.\"</p>", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "ruFdnWFAKmMXxuJuM", "postedAt": "2024-03-08T20:46:15.691Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I believe our application form says</p>\n<blockquote>\n<p>The Animal Welfare Fund, Long-Term Future Fund and EA Infrastructure Fund aim to respond to all applications in 2 months and most applications in 3 weeks. However, due to an unprecedentedly high load, we are currently unable to achieve our desired speedy turnarounds. If you need to hear back sooner (e.g., within a few weeks), you can let us know in the application form, and we will see what we can do. Please note that:\nEA Funds is low on capacity and may not be able to get back to you by either your stated deadline or the above aims -- we encourage you to apply to other funders as well if you have a time-sensitive ask.</p>\n</blockquote>\n<p>In other parts of the site we say things like “usually we get a decision within 21 days”. It’s possible that the application form said something different when Igor applied, we edit it fairly regularly though I’m not aware of changing that specific like recently.</p>\n", "parentCommentId": "of4BxMxdEvnDL3h2u", "user": {"username": "calebp"}}, {"_id": "uA4EWGN7fxyX22pxn", "postedAt": "2024-03-08T21:16:25.918Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Quite apart from the courtesy (and the OP apparently feels like he hasn't been treated with courtesy himself), this seems like an obvious case for communicating to an organisation that you're upset because you feel that you've been misled about timelines [and are considering publicising your complaint] before going public because, despite the delays, they may actually be quite close to awarding you significant sums of money...</p>\n<p>(I'm not sure what was promised, but this sounds like exactly the sort of thing I'd expect to always take longer than expected)</p>\n", "parentCommentId": "FZgWhWZtmJyWT3DKT", "user": {"username": "David T"}}, {"_id": "bPYkEvp4H7wJBEjPB", "postedAt": "2024-03-08T23:49:09.379Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>On one hand, I agree with you that expressions of interest or even intent are different than commitments, and commitments are different from money in hand. I wish we had exact quotes to figure out what interpretations were justified, but it's certainly possible Caleb's communication was precise and Igor read too much into it.&nbsp;</p><p>OTOH, there is an embedded problem here. If the grant were approved, it would be unethical to drop patients in favor of EAs. Igor's choices were to behave unethically, stop taking new clients before the grant was approved, or delay implementation once the grant was approved. People often feel an obligation not to delay after they've received funding<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"0wap24n19z4n\" role=\"doc-noteref\" id=\"fnref0wap24n19z4n\"><sup><a href=\"#fn0wap24n19z4n\">[1]</a></sup></span>, in which case pausing new clients was the only ethical choice.&nbsp;</p><p>I do think Igor made mistakes here. But I also see patterns that shouldn't have happened. Even if Caleb merely expressed a hope to be able to give an answer by a given date, rather than promising it, he appears to have missed a lot of intentions and should have updated on his own ability to predict response times. Maybe Igor is more heavily misrepresenting the exchanges, but this seems fairly typical of my experience within EA (not with Caleb in particular, and not just with grantmakers).&nbsp;<br>&nbsp;&nbsp;</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"0wap24n19z4n\" role=\"doc-endnote\" id=\"fn0wap24n19z4n\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"0wap24n19z4n\"><sup><strong><a href=\"#fnref0wap24n19z4n\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>it's me, I was people, although after enough delayed grant responses I'm mostly over this. I'm not sure how much of this was internal pressure vs. a vibe from grantmakers.&nbsp;</p></div></li></ol>", "parentCommentId": "9AYqptzT4MKq7YENP", "user": {"username": "Elizabeth"}}, {"_id": "89Qqamat6qFpDqfmi", "postedAt": "2024-03-09T01:33:02.144Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<blockquote><p>People often feel an obligation not to delay after they've received funding</p></blockquote><p>Thanks for flagging this! As a <i>purely forward-looking matter</i> (not blaming anyone), I'd now like to <strong>explicitly push back against any such norm.</strong> For comparison: it's standard in academia for grant-funded projects to begin <i>the following academic year</i> after grant funding is received (so, often 6 months or more).</p><p>This delay is necessary because it's not feasible for universities to drop a planned class at the last minute, after students have already enrolled in it. But independent contractors can have prior commitments too. For someone in that situation, <strong>I think</strong> <strong>it would be a great idea to explicitly build into a proposal that its start date would be \"X months after confirmation of grant approval\"</strong>, to allow time for the necessary adjustments. I expect grant-makers would be understanding of such a timeline. (It's not fair to applicants to expect them to make risky adjustments <i>prior</i> to receiving grant confirmation, after all!) And if the timeline is built into the proposal that they approve, there seems less risk of pressure of any sort (internal or otherwise) to imprudently accelerate.</p>", "parentCommentId": "bPYkEvp4H7wJBEjPB", "user": {"username": "RYC"}}, {"_id": "cqYg3wYMXizowjj5t", "postedAt": "2024-03-09T04:04:08.742Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I think that would be a big step forward- and it might not even be a change in policy, just something that needs to be said more explicitly.&nbsp;</p><p>I don't think it solves the entire problem, but at a certain point I just need to write my Why Living On Personal Grants Sucks post.&nbsp;</p>", "parentCommentId": "89Qqamat6qFpDqfmi", "user": {"username": "Elizabeth"}}, {"_id": "emPvqribt9Zc4sbKK", "postedAt": "2024-03-09T04:34:22.782Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>This is more of communication issue. Any misunderstanding on my part could be resolved very quickly with proper communication from the Fund side.&nbsp;<br><br>Also, while applying for grant, I outlined that I expect to start project shortly after the the deadline for getting an answer.</p>", "parentCommentId": "9AYqptzT4MKq7YENP", "user": {"username": "Igor Ivanov"}}, {"_id": "XZJuocwhKQajfH5XK", "postedAt": "2024-03-09T05:06:22.028Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>This is impossible for us to evaluate without the exact wording. If Caleb agrees, would you be willing to post screenshots of the emails?&nbsp;</p>", "parentCommentId": "emPvqribt9Zc4sbKK", "user": {"username": "Elizabeth"}}, {"_id": "HAYNx7nnami6xoYaP", "postedAt": "2024-03-09T05:41:31.230Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>If it's okay with you, I'd prefer not to have screenshots of my emails posted right now; I'm happy to rethink this in a few days when it feels a bit lower pressure.</p>\n<p>I generally don't write emails, assuming that they will be posted to a public place like the forum.</p>\n", "parentCommentId": "XZJuocwhKQajfH5XK", "user": {"username": "calebp"}}, {"_id": "gNMPwH2F4yAKf8Qmp", "postedAt": "2024-03-09T06:20:26.162Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Thank you for the attitude you expressed here, although I believe that you promised me to get back in a certain time.<br><br>A part from your email from December 5<br><i>We sincerely regret the delay and assure you that we will provide you with an update within the next few days.</i><br><br>Your email from December 18<br><i>We expect to give a decision this week.</i><br><br>I provide parts of your emails because you expressed that you would rather not share everything in your other comments here.</p>", "parentCommentId": "r9sMievNfFzvrecHq", "user": {"username": "Igor Ivanov"}}, {"_id": "XNDEJoyT9nugiTW5Z", "postedAt": "2024-03-09T06:23:13.229Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I had a similar experience with 4 months of wait (uncalibrated grant decision timelines on the website) and unresponsiveness to email with LTFF, and I know a couple of people who had similar problems. I also found it pretty \"disrespectful\".</p>\n<p>Its hard to understand why a) they wouldn't list the empirical grant timelines on their website, and b) why they would have to be so long.</p>\n", "parentCommentId": "hCcTSZCprsdy3dSxh", "user": {"username": "RyanCarey"}}, {"_id": "pnLdAFu2mLYENJFcr", "postedAt": "2024-03-09T09:01:43.210Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>The first one is a commitment, but the second one isn’t - it’s rather a prediction. Perhaps there is a language familiarity issue?</p>\n", "parentCommentId": "gNMPwH2F4yAKf8Qmp", "user": {"username": "bec_hawk"}}, {"_id": "xbfdbFNyvkfaiwq5h", "postedAt": "2024-03-09T09:11:07.142Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<blockquote>\n<p>If the grant were approved, it would be unethical to drop patients in favor of EAs. Igor's choices were to behave unethically, stop taking new clients before the grant was approved, or delay implementation once the grant was approved</p>\n</blockquote>\n<p>Surely the onus is on the applicant to explain all their constraints to the grantmaker, so that expectations can be set? If Igor had said he was not taking new clients in anticipation of the grant, I feel fairly confident it would have been discouraged and the uncertainty of the grant being approved emphasised.</p>\n<p>It would never have occurred to me that discontinuing patient relationships is considered unethical, so that definitely needed to be spelled out.</p>\n", "parentCommentId": "bPYkEvp4H7wJBEjPB", "user": {"username": "bec_hawk"}}, {"_id": "Y4az24rq57qQFXKRp", "postedAt": "2024-03-09T15:21:44.451Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I had a similar experience in spring 2023, with an application to EAIF. The fundamental issue was the very slow process from application to decision. This was made worse by poor communication.</p>\n", "parentCommentId": "XNDEJoyT9nugiTW5Z", "user": {"username": "anonymous_banana"}}, {"_id": "tFCAADtc7DpcoDqKu", "postedAt": "2024-03-09T17:13:33.432Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I agree that the second statement is a prediction, and suspect the issue may lie in the inferences one might draw from it.&nbsp;</p><p>As a formal matter, does \"it's likely X will happen within one week\" imply \"it is very likely X will happen within two weeks\" and \"it is extremely likely X will happen within three weeks\"? Without more, I do not think the first statement logically implies any particular confidence intervals.<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"p8nu727ugzh\" role=\"doc-noteref\" id=\"fnrefp8nu727ugzh\"><sup><a href=\"#fnp8nu727ugzh\">[1]</a></sup></span></p><p>However, I think it is readily foreseeable that a good number of readers would assign significant credence to the latter two statements based on the first, but would feel hesitant to nag the decisionmaker on their grant to be clearer on the confidence intervals. Thus, if the two week / three week statements are not valid, and that is not otherwise clear from the context,<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"2\" data-footnote-id=\"8wanpdkb639\" role=\"doc-noteref\" id=\"fnref8wanpdkb639\"><sup><a href=\"#fn8wanpdkb639\">[2]</a></sup></span>&nbsp;I think it would be much better to include a disclaimer here. E.g.: <i>However, there is a reasonable possibility that our decision could take 3-4 weeks, or even longer, primarily due to other things on our lawyer's desk.</i></p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"p8nu727ugzh\" role=\"doc-endnote\" id=\"fnp8nu727ugzh\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"p8nu727ugzh\"><sup><strong><a href=\"#fnrefp8nu727ugzh\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>An example of \"without more\": I call a company customer-service line, and am told that there are 30 callers ahead of me, that calls are answered in the order received, and that the estimated wait time is 15 minutes. Due to the law of large numbers, I think I'd be entitled to infer a wait time between ~10-20 minutes here.</p></div></li><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"2\" data-footnote-id=\"8wanpdkb639\" role=\"doc-endnote\" id=\"fn8wanpdkb639\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"8wanpdkb639\"><sup><strong><a href=\"#fnref8wanpdkb639\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>I would view \"nothing may get done in the 1-1.5 weeks surrounding Christmas\" as obvious if the correspondents both lived in countries where Christmas leave is common.</p></div></li></ol>", "parentCommentId": "pnLdAFu2mLYENJFcr", "user": {"username": "Jason"}}, {"_id": "CBe6AeTYgA7g9DL3G", "postedAt": "2024-03-09T17:35:22.837Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I think it could be good to put these number on our site. I liked your past suggestion of having live data, though it's a bit technically challenging to implement - but the obvious MVP (as you point out) is to have a bunch of stats on our site. I'll make a note to add some stats (though maintaining this kind of information can be quite costly, so I don't want to commit to doing this).<br><br>In the meantime, here are a few numbers that I quickly put together (across all of our funds).</p><p>Grant decision turnaround times (mean, median):</p><ul><li>applied in the last 30 days = 14 days, 15 days&nbsp;<ul><li>this is pretty volatile as it includes applications that haven't yet closed</li></ul></li><li>applied in the last 60 days = 23 days, 20 days</li><li>applied in the last 90 days = 25 days, 20 days</li></ul><p>When I last checked our (anonymous) feedback form, the average score for [satisfaction of evaluation process] (I can't quite remember the exact question) was ~4.5/5.&nbsp;<br><br><i>(edit: just found the stats - these are all out of 5)</i></p><ul><li><i>Overall satisfaction with application process: <strong>4.67</strong></i></li><li><i>Overall satisfaction with processing time: <strong>4.58</strong></i></li><li><i>Evaluation time: <strong>4.3</strong></i></li><li><i>Communications with evaluators: <strong>4.7</strong></i></li></ul><p>I'm not sure that these stats tell the whole story. There are cases where we (or applicants) miss emails or miscommunicate - but the frequency of events like this is difficult to report quickly and also accounts for the majority of negative experiences (according to our feedback form and my own analysis).<br>&nbsp;</p><p>On (b), I really would like us to be quicker - and more importantly, more reliable. A few very long-tail applications make the general grantee experience much worse. The general stages in our application process are:<br><br>Applicant submits application -&gt; application is assigned to a fund manager -&gt; fund manager evaluates the application (which often involves back and forth with the applicant, checking references etc.) -&gt; other fund managers vote on the application -&gt; fund chair reviews evaluation -&gt; application is reviewed by external advisors -&gt; fund chair gives decision to grantee (pending legal review)<br><br>There's also a really high volume of grants and increasingly few \"obvious\" rejections. E.g. the LTFF right now has over &gt; 100 applications in its pipeline, and in the last 30 days &lt; 10% of applications were obvious rejections).</p>", "parentCommentId": "XNDEJoyT9nugiTW5Z", "user": {"username": "calebp"}}, {"_id": "TauAJnJjk9pKCTHvB", "postedAt": "2024-03-09T18:33:05.357Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Are you factoring in people who withdraw their application because of how long the process was taking?</p>\n", "parentCommentId": "CBe6AeTYgA7g9DL3G", "user": {"username": "bec_hawk"}}, {"_id": "LbNSzoCaEbKas7fAE", "postedAt": "2024-03-09T18:57:04.184Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>what does 30/60/90 days mean? Grants applied to in the last N days? Grants decided on in the last N?&nbsp;<br><br>How do the numbers differ for acceptances and rejections?&nbsp;</p><p>What percent of decisions (especially acceptances) were made within the timeline given on the website?&nbsp;</p><p>Can you share more about the anonymous survey? How has the satisfaction varied over time?&nbsp;</p>", "parentCommentId": "CBe6AeTYgA7g9DL3G", "user": {"username": "Elizabeth"}}, {"_id": "wotjeDK6ywqusKqsG", "postedAt": "2024-03-09T19:14:16.774Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Is there (or might it be worthwhile for there to be) a business process to identify aged applications and review them at intervals to make sure they are not \"stuck\" and that the applicant is being kept up to date? Perhaps \"aged\" in this context would operationalize as ~2x the median decision time and/or ~&gt;90-95th percentile of wait times? Maybe someone looks at the aged list every ~2 weeks, makes sure the application isn't \"stuck\" in a reasonably fixable way, and reviews the last correspondence to/from the applicant to make sure their information about timeframes is not outdated?</p>", "parentCommentId": "CBe6AeTYgA7g9DL3G", "user": {"username": "Jason"}}, {"_id": "WePDKHXhFzHAC7bzn", "postedAt": "2024-03-09T20:21:54.500Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Do you know what proportion of applicants fill out the feedback form?</p>\n", "parentCommentId": "CBe6AeTYgA7g9DL3G", "user": {"username": "bec_hawk"}}, {"_id": "kbzHFEmpk84LQt9ss", "postedAt": "2024-03-09T20:24:12.807Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>We do have a few processes that are designed to do this (some of which are doing some of the things you mentioned above). Most of the long delays are fairly uncorrelated (e.g. complicated legal issue, a bug in our application tracker ...).</p>\n", "parentCommentId": "wotjeDK6ywqusKqsG", "user": {"username": "calebp"}}, {"_id": "FoERMuL4dFhntCyKD", "postedAt": "2024-03-09T20:26:23.668Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Empirically, I don't think that this has happened very much. We have a \"withdrawn by applicant status\", which would include this, but the status is very rarely used.</p>\n<p>In any case, the numbers above will factor those applications in, but I would guess that if we didn't, the numbers would decrease by less than a day.</p>\n", "parentCommentId": "TauAJnJjk9pKCTHvB", "user": {"username": "calebp"}}, {"_id": "6PmsM8gD2AKbDmNGu", "postedAt": "2024-03-09T20:27:19.436Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>The question relating to website timelines would be hard to answer as it was changed a few times I believe</p>\n", "parentCommentId": "LbNSzoCaEbKas7fAE", "user": {"username": "bec_hawk"}}, {"_id": "CKwMcBbYG6JtqLFRt", "postedAt": "2024-03-09T20:30:11.219Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>My point is more around the fact that if a person withdraws their application, then they never received a decision and so the time till decision is unknown/infinite, it’s not the time until they withdrew.</p>\n", "parentCommentId": "FoERMuL4dFhntCyKD", "user": {"username": "bec_hawk"}}, {"_id": "PLgL9k8kMNwRCgAWp", "postedAt": "2024-03-09T20:33:51.578Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I'm not sure sorry, I don't have that stat in front of me. I may be able to find it in a few days.</p>\n", "parentCommentId": "WePDKHXhFzHAC7bzn", "user": {"username": "calebp"}}, {"_id": "dPB6bFsLbisekCfTm", "postedAt": "2024-03-09T20:41:34.679Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Oh, right - I was counting \"never receiving a decision but letting us know\" as a decision. In this case, the number we'd give is days until the application was withdrawn.</p>\n<p>We don't track the reason for withdrawals in our KPIs, but I am pretty sure that process length is a reason for a withdrawal 0-5% of the time.</p>\n<p>I might be missing why this is important, I would have thought that if we were making an error it would overestimate those times - not underestimate them.</p>\n", "parentCommentId": "CKwMcBbYG6JtqLFRt", "user": {"username": "calebp"}}, {"_id": "hKs9BEzF5EnBE2xge", "postedAt": "2024-03-09T21:38:04.537Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I answered the first questions above in an edit of the original comment. I’m pretty sure when I re-ran the analysis with decided in last 30 days it didn’t change the results significantly (though I’ll try and recheck this later this week - in our current setup it’s a bit more complicated to work out than the stats I gave above).</p>\n<p>I also checked to make sure that only looking at resolved applications and only looking at open applications didn’t make a large difference to the numbers I gave above (in general, the differences were 0-10 days).</p>\n", "parentCommentId": "LbNSzoCaEbKas7fAE", "user": {"username": "calebp"}}, {"_id": "KBjxXkcYgwS8E9aQz", "postedAt": "2024-03-09T21:47:00.369Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Thanks for engaging with my criticism in a positive way.</p><p>Regarding how timely the data ought to be, I don't think live data is necessary at all - it would be sufficient in my view to post updated information every year or two.</p><p>I don't think \"applied in the last 30 days\" is quite the right reference class, however, because by-definition, the averages will ignore all applications that have been waiting for over one month. I think the most useful kind of statistics would:</p><ol><li>Restrict to applications from n to n+m months ago, where n&gt;=3</li><li>Make a note of what percentage of these applicants haven't received a response</li><li>Give a few different percentiles for decision-timelines, e.g. 20th, 50th, 80th, 95th percentiles.&nbsp;</li><li>Include a clear explanation of which applications are being included, or excluded, for example, are you including applications that were not at all realistic, and so were rejected as soon as they landed on your desk?</li></ol><p>With such statistics on the website, applications would have a much better sense of what they can expect from the process.</p>", "parentCommentId": "CBe6AeTYgA7g9DL3G", "user": {"username": "RyanCarey"}}, {"_id": "yTaHAgmoW3CTf5TAb", "postedAt": "2024-03-09T21:50:26.565Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Oh, I thought you might have suggested the live thing before, my mistake. Maybe I should have just given the 90-day figure above.</p>\n<p>(That approach seems reasonable to me)</p>\n", "parentCommentId": "KBjxXkcYgwS8E9aQz", "user": {"username": "calebp"}}, {"_id": "M6mkEai4h6DPvPXva", "postedAt": "2024-03-10T00:04:29.335Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I tentatively agree with you Igor should have done several things differently, including making his constraints clearer and not changing his job until he had the money in hand.&nbsp;</p><p>I think the real question is \"how many applicant mistakes should grantmakers be expected to gracefully handle?\" Given that they interact with so many people, especially people new to direct work who couldn't possibly figure out the exact rules ahead of time, I think it's reasonable that EAIF and other entry-level grantmakers be able to handle a fair number<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"uju8judoavq\" role=\"doc-noteref\" id=\"fnrefuju8judoavq\"><sup><a href=\"#fnuju8judoavq\">[1]</a></sup></span>. I imagine that someone with no application experience and inconsistent communication from EAIF would have found it challenging to explain the nuances of their situation in a way that was heard.</p><p>I was going to say \"someone with no application experience would have found it difficult to know how to interpret EAIF's communications\", but I reject the concept that EAIF should need that much translation. It makes me sad that I automatically double timing estimates from EA orgs, treat that as the absolute minimum time something could take, and am often still disappointed. If they can't be more accurate, they could at least give more conservative estimates.&nbsp;</p><p>On the other hand, this case appears to have been unusually legally complicated and have ESL issues. Maybe EAIF is handling the 98th percentile case well and this was the unlucky 99th. It's surely not worth the effort to have zero mistakes, and I don't what the right goal is.&nbsp;</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"uju8judoavq\" role=\"doc-endnote\" id=\"fnuju8judoavq\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"uju8judoavq\"><sup><strong><a href=\"#fnrefuju8judoavq\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>My understanding is SFF deliberately does the opposite and considers ability to fill out the detailed forms to be a qualification. I can also see an argument for that approach. But I do think granting orgs should make a decision and follow through on it.&nbsp;</p></div></li></ol>", "parentCommentId": "xbfdbFNyvkfaiwq5h", "user": {"username": "Elizabeth"}}, {"_id": "kthaBbxcPebntHwDX", "postedAt": "2024-03-10T00:05:46.117Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I'm not following- what does it mean to say you've calculated resolution time to applications that haven't been resolved?</p>", "parentCommentId": "hKs9BEzF5EnBE2xge", "user": {"username": "Elizabeth"}}, {"_id": "S2Cn6TnGyrbyDjeRH", "postedAt": "2024-03-10T00:45:09.863Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>My point was that if someone withdraws their application because you were taking so long to get back to them, and you count that as the date you gave them your decision, you’re artificially lowering the average time-till-decision metric.</p>\n<p>Actually the reason I asked <em>if</em> you’d factored in withdrawn application not <em>how</em> was to make sure my criticism was relevant before bringing it up - but that probably made the criticism less clear</p>\n", "parentCommentId": "dPB6bFsLbisekCfTm", "user": {"username": "bec_hawk"}}, {"_id": "Pwuz3tpQEfieHCsdp", "postedAt": "2024-03-10T00:55:12.046Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Is the repetition of “applied in the last 30 days” possibly a typo?</p>\n", "parentCommentId": "CBe6AeTYgA7g9DL3G", "user": {"username": "bec_hawk"}}, {"_id": "LdvCnhMx4CgPSzH6a", "postedAt": "2024-03-10T01:02:29.928Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>oops, fixed - thank you</p>\n", "parentCommentId": "Pwuz3tpQEfieHCsdp", "user": {"username": "calebp"}}, {"_id": "BaBL54yHzjrxkzPPY", "postedAt": "2024-03-10T08:21:26.555Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<blockquote>\n<p>It makes me sad that I automatically double timing estimates from EA orgs, treat that as the absolute minimum time something could take, and am often still disappointed.</p>\n</blockquote>\n<p>I definitely strongly agree with this. I do think its <em>slowly, ever so slowly</em> <a href=\"https://www.youtube.com/watch?v=w5F8wG4tUgA\">getting better</a> though.</p>\n", "parentCommentId": "M6mkEai4h6DPvPXva", "user": {"username": "D0TheMath"}}, {"_id": "sXGk586ptgyHnJaLH", "postedAt": "2024-03-11T02:02:14.889Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<blockquote>\n<p>you’re artificially lowering the average time-till-decision metric</p>\n</blockquote>\n<p>What would you consider the non-artificial \"average time-till-decision metric\" in this case?</p>\n", "parentCommentId": "S2Cn6TnGyrbyDjeRH", "user": {"username": "Jeff_Kaufman"}}, {"_id": "QWFozHeHZwr7sG9G7", "postedAt": "2024-03-11T02:05:03.223Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<blockquote>\n<p>it includes applications that haven't yet closed</p>\n</blockquote>\n<p>How are these included?  Is it that in you count ones that haven't closed as if they had closed today?</p>\n<p>(A really rough way of dealing with this would be to count ones that haven't closed as if they will close in as many days from now as they've been open so far, on the assumption that you're on average halfway through their open lifetime.)</p>\n", "parentCommentId": "CBe6AeTYgA7g9DL3G", "user": {"username": "Jeff_Kaufman"}}, {"_id": "YbQLgnXE7tCc6BmhJ", "postedAt": "2024-03-11T21:25:56.468Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I thought it might be helpful for me to add my own thoughts, as a fund manger at EAIF (<i>Note I'm speaking in a personal capacity, not on behalf of EA Funds or EV</i>).</p><ol><li>Firstly, I'd like to apologise for my role in these mistakes. I was the Primary Investigator (PI) for Igor's application, and thus I share some responsibility here. Specifically as the PI, I should have (a) evaluated the application sooner, (b) reached a final recommendation sooner, and (c) been more responsive to communications after making a decision<ol><li>I did not make an initial decision until November 20. This was too short a timeframe to provide Igor a final decision by November 24.</li><li>I did not reach a final recommendation until November 30th. This was due to the final recommendation we made being somewhat more complex than the original proposal.<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"q0lgo4mlt4\" role=\"doc-noteref\" id=\"fnrefq0lgo4mlt4\"><sup><a href=\"#fnq0lgo4mlt4\">[1]</a></sup></span></li><li>In February, I did not provide with a full response for Igor's request for an update on his application.</li></ol></li><li>Second, I'd like to apologise to any other applicants to EAIF who have faced similar unreasonably long delays. Whilst we get back to the most applicatants on a reasonable timeframe (see <a href=\"https://forum.effectivealtruism.org/posts/bp3vqgc3QipAXvCjt/lies-and-disrespect-from-the-ea-infrastructure-fund?commentId=CBe6AeTYgA7g9DL3G\">other comments</a>), there are a few cases I am well aware of where we deadlines have been missed for too long. I'm aware of a couple of instances where this has caused significant stress - again, I would like to express my deepest regret for this.</li><li>As broader context, I think it's worth emphasising that <strong>EAIF is highly under-resourced at the moment</strong>. It's fairly common for orgs to say they're \"capacity constrained\" - but I think this is more true for EAIF in the last ~3 months than any other period:<ol><li>In summer 2023, EAIF had five part-time fund managers. With <a href=\"https://forum.effectivealtruism.org/posts/zt6MsCCDStm74HFwo/ea-funds-organisational-update-open-philanthropy-matching\">OP's distancing from EAIF</a>, we dropped down the three. In late 2023, we then dropped to just myself (part-time), and Caleb as acting EAIF chair.</li><li>Given these changes, I would be suprised if EAIF has run on more than ~0.25 FTE over the past three months.&nbsp;</li><li>As such, it has been a challenge for EAIF to fulfil all of it's key responsibilites - as well as developoing a <a href=\"https://forum.effectivealtruism.org/posts/FnNJfgLgsHdjuMvzH/ea-infrastructure-fund-s-plan-to-focus-on-principles-first\">coherent strategy</a> and fundraising given <a href=\"https://forum.effectivealtruism.org/posts/PAco5oG579k2qzrh9/ltff-and-eaif-are-unusually-funding-constrained-right-now\">constraints</a>.</li><li>We are now recruiting / onboarding new fund managers, so this pressure should be alleviated soon.</li></ol></li></ol><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"q0lgo4mlt4\" role=\"doc-endnote\" id=\"fnq0lgo4mlt4\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"q0lgo4mlt4\"><sup><strong><a href=\"#fnrefq0lgo4mlt4\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>I'm happy to go into details as to the details about changes we proposed and why, although I don't think they are especially relevant to this situation</p></div></li></ol>", "parentCommentId": null, "user": {"username": "22tom"}}, {"_id": "4ZyWYmFaqFnnBb9bY", "postedAt": "2024-03-12T02:19:25.559Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<blockquote><p>Specifically as the PI, I should have (a) evaluated the application sooner, (b) reached a final recommendation sooner, and (c) been more responsive to communications after making a decision</p></blockquote><p>&nbsp;</p><p>This comment feels to me like temporary embarrassed deadline-meeter, and I don't think that's realistic. The backlog is very understandable given your task and your staffing, I assume you're doing what you can on the staffing front but even if that's resolved it's just a big task and 3 weeks is a very ambitious timeline even with full staffing. Given that, it's not surprising that you're falling short of your public commitment, and I want to look at what changes could be made to make a better experience for applicants without a change in capacity.&nbsp;</p><p>All of my ideas are going to be shots in the dark given how little information I have, but maybe they'll spark something:</p><ol><li>Set a longer timeline for grant decisions. No one is going to complain if they hear back early.</li><li>Give decision-times with percentiles. E.g. 50% are decided in 3 weeks, 75% at 12 weeks.... Then when someone gets a slow response they can think \"I guess I was in the 10%\" rather than \"EAIF missed the deadline\"</li><li>Update applicant's expectations if a grant looks likely to run long, either on the website or upon first review of the application. It sounds like some projects fall into buckets that cause predictable delays, but applicant's don't know if they fall into that.</li><li>Give applicants timelines for when you will follow up, and when they should bug you if you failed to do that. It is really demoralizing to sit there plotting how long you should wait on a grant maker and what the consequences of a mistake will be.&nbsp;</li></ol>", "parentCommentId": "YbQLgnXE7tCc6BmhJ", "user": {"username": "Elizabeth"}}, {"_id": "jeYdpg4Qh2ph5CMcP", "postedAt": "2024-03-12T07:46:57.970Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>tbh you sound obnoxious from your own description of events and I would lose interest in working with someone, and downgrade my initial assessment of their abilities (especially in a field that &nbsp;involves knowledge about human behavior), if they sent me multiple emails a week complaining about delays. And I am thinking about this mostly in the context of a prospective client, where they'd be the one giving me money in exchange for putting up with their behavior; I can only imagine how much worse it is for a grantmaker who would prospectively be paying money out to the person behaving in this way.&nbsp;</p><p>Stuff takes time, sometimes it takes longer than planned. Especially when they are telling you other people (e.g. lawyers) have to be involved in the decision, you should know they can't predict that accurately. Sometimes taking longer than planned is a way to reject you politely in hopes that you will get the message and move on, or a way for someone who is kind of interested but not that excited about an idea to resolve the issue in their mind.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Bluefalcon"}}, {"_id": "4kHgrDN5u9v7DhYFi", "postedAt": "2024-03-12T08:10:24.609Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Yes, this is consistent with my experience too. Bad calibration of expected timelines, unresponsiveness to (two) emails asking for updates or if they needed anything (over one month), and something I would also qualify as somewhat disrespectful: they asked for additional information that was already available in the initial application.</p><p>For me it means that they probably didn't read through completely before asking for more, besides the application being less than a dozen sentences long, one of them being \"here are the relevant links\" which contained all the information the follow-up email was asking for. I agree that it was not obvious that the requested info was there in the application, but I would expect a grant manager to actually skim or even read everything before asking for additional details.</p><p>In my perspective, it felt like a disregard for my time in an attempt to compensate for a longer turnaround than they wished they would have.</p><p><i>(Opinions my own)</i></p><p>PS: We received a decision a bit less than 3 months after applying.</p>", "parentCommentId": "hCcTSZCprsdy3dSxh", "user": {"username": "alix.pham"}}, {"_id": "WM9qJoRpQbyi7dt99", "postedAt": "2024-03-13T00:06:53.456Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I was funded with long delays. I wouldn't have said \"straightforwardly unprofessional\" communication in my case.</p>\n<p>It was a fairly stressful experience, but seemed consistent with \"overworked people dealing with a tough legal situation\", both for EVF in general and my specific grant.</p>\n<p>I did suggest on their feedback form that misleading language about timeframes on the application form be removed. It looks like they've done that now, although I have no idea when the change was made. (In my case this was essentially the only issue; the turnaround wasn't necessarily super slow in itself -- a few months doesn't seem unreasonable -- it's just that it was much slower than the form suggested it should be.)</p>\n", "parentCommentId": "hCcTSZCprsdy3dSxh", "user": {"username": "Jamie_Harris"}}, {"_id": "BoHtFNKhQ6NK2hNb5", "postedAt": "2024-03-13T05:02:24.217Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I believe we changed the text a bunch in August/early September. I think there were a few places we didn't catch the first time, and we made more updates in ~the following month (September). AFAIK we no longer have any (implicit or explicit) commitments for response times anywhere, we only mention predictions and aspirations.<br><br>Eg here's the text at near the beginning of the application form:&nbsp;</p><blockquote><p>The Animal Welfare Fund, Long-Term Future Fund and EA Infrastructure Fund aim to respond to all applications in 2 months and most applications in 3 weeks. However, due to an unprecedentedly high load, we are currently unable to achieve our desired speedy turnarounds. If you need to hear back sooner (e.g., within a few weeks), you can let us know in the application form, and we will see what we can do. Please note that: EA Funds is low on capacity and may not be able to get back to you by either your stated deadline or the above aims -- we encourage you to apply to other funders as well if you have a time-sensitive ask.</p></blockquote>", "parentCommentId": "WM9qJoRpQbyi7dt99", "user": {"username": "Linch"}}, {"_id": "d4cDxnmQoh7iPqDhy", "postedAt": "2024-03-13T09:17:05.700Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>I am wondering if there are generally strong enough recommendations on building a substantial <a href=\"https://forum.effectivealtruism.org/posts/NDszJWMsdLCB4MNoy/burnout-what-is-it-and-how-to-treat-it#Keep_a_Healthy_Personal_Runway\">personal runway</a>? I am thinking that one might actually want to do something like the following:</p><p>-Before applying for a grant/applying for non-permanent/project based work, perhaps even target a personal runway of 12 months, especially if you have dependents?</p><p>-Then when you are applying, calculate the salary/rate you think you need.</p><p>-Then assume you might burn up to 6 months of your runway on working on this grant (either before it starts and/or when waiting for follow-on funding/your next project).</p><p>-Therefore take your runway per month number, multiply by 6, add taxes, pension etc. and then, before you suggest a rate/budget, add this amount. This is similar to how consultancies often have \"billable hours\" percentages of 70% or lower and they have rates that are high enough to create a buffer for lulls between projects.</p><p>The reason for doing this is that if you burn away your runway on your first grant, you are then out of commission for EA work after the grant. It seems to dawn on me that you should expect multiple months between grants/projects of no \"EA income\".&nbsp;<br><br>I am making this comment because after reading a few other comments here and generally maybe picking up on the mood from e.g. the upvotes on this post, it seems that perhaps delays is more of a norm than the occasional exception? And I think grant makers are under a lot of pressure and also have incentives to \"market\" themselves as fast, incentives we should not expect to go away.<br><br>That said, one might significantly increase the amount one is asking for in these grants by following my recommendations. However, I am not sure this is such a big deal, because I expect the major parameter grantmakers are using for decisions is expected impact, not the cost. E.g. increasing your requested rate/budget by 30% or perhaps even 40% might actually not lower your chances of getting a grant by that much (feel free to comment on this if you disagree!). Such practice might also be good in a solidarity type of way as we could re-calibrate expectations of compensation with grantmakers, making them think less poorly of people \"asking for a lot\". And if you end up not needing this extra money you know where to donate it!</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "oJtYPyxheeErbsrwG", "postedAt": "2024-03-13T16:43:17.625Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>Hmm so I currently think the default should be that withdrawals without a decision aren't included in the time-till-_decision_ metric, as otherwise you're reporting a time-till-closure metric. (I weakly think that if the withdrawal is due to the decision taking too long <i>and</i> that time is above the average (as an attempt to exclude cases where the applicant is just unusually impatient), then it should be encorporated in some capacity, though this has obvious issues.)</p>", "parentCommentId": "sXGk586ptgyHnJaLH", "user": {"username": "bec_hawk"}}, {"_id": "uKw7uYD8aRdTsjbEJ", "postedAt": "2024-03-13T23:41:22.321Z", "postId": "bp3vqgc3QipAXvCjt", "htmlBody": "<p>My experience with the fund has been slightly different, but also disappointing.&nbsp;</p><p><strong>The fund rejected my application, but didn't seem to stand by their own conclusions.</strong></p><p>I submitted an application which was rejected. The fund manager offered to provide feedback, however over the course of the conversation, we discussed how the concerns they raised were things that we already had on our radar, and that our approach was to tackle those issues head on and \"fail fast\" (i.e. work out whether the issues were surmountable, and if not, pivot).</p><p>I was confused that the fund manager sounded like they were updating over the course of the conversation, because I wasn't saying anything which wasn't in the application.</p><p>I then mentioned that someone in the project team might be able to fund the project from his own pocket, but if the project wasn't impactful enough, he would prefer to use the money on higher impact things, and invited the fund manager to help us make a better decision. The fund manager didn't seem to think they could add much value given that they thought that I'm clearly thoughtful about how to assess such projects.</p><p>I would have liked it if the fund had provided either feedback or funding. I came away with neither.</p><p><strong>Reasons to be cautious when updating on this information</strong></p><p>The main reason that readers should be cautious when updating on this comment is that this refers to something which happened multiple years ago. This is relevant because:</p><ul><li>The fund managers are probably different people now (although presumably there is some continuity of processes). [I recommend you update <i><strong>moderately</strong></i> for this point]</li><li>EAIF has outlined a specific strategy which they didn't have at the time. When they had a broader remit, it was presumably harder for them to make effective decisions. [I recommend you update <i><strong>moderately</strong></i> for this point]</li><li>Although I <i>did</i> point out that other EA money might fund the project, and I did ask for feedback to help stop that money going to this project if it weren't high impact enough, when the fund manager didn't feel able to provide a rationale for rejection, I didn't then push for the Fund to provide us with funding. I felt this would have violated norms of respecting their decision. However doing so might have caused them to come up with reasons which they didn't state in the call. Overall, I find this less convincing, because if they did come up with more reasons, then they would have had to essentially contradict themselves, which means my conclusion of low confidence in their decision-making remains unchanged. [I recommend you update <i><strong>to a small extent</strong></i> for this point]</li><li>I can't guarantee that I've remembered things correctly. [I recommend you update <i><strong>significantly</strong></i> for this point with regard to certain details, listed below, and <i><strong>to a small extent</strong></i> for the most important element, see below]</li></ul><p>In case it helps, I can expand on the \"potential for misremembering\" point:</p><ul><li>I'm very confident that the call was for feedback on rejection, and that it ended with the fund manager conceding that he could not defend the decision to reject the application.</li><li>Things I can't remember very well:<ul><li>Although I definitely remembering <i>thinking</i> that we were discussing things which were in the application, I can't remember whether I looked back at the application to check. I can't rule out the possibility that the feedback call included new information, but I do think I would have remembered if the fund manager had indicated that something was new.</li><li>I don't have high confidence in my impression that the fund manager was showing signs of updating in the call, as they weren't super-expressive. I can't remember enough detail to know how confident we should be of this point.</li><li>I can't remember how cruxy the \"fail fast\" element of the discussion was.</li></ul></li></ul><p><strong>Overall, I came away with low confidence in their decision-making ability, and would not recommend that donors provide funds to them.</strong></p><p>Sorry to go anon on this one. Also, I appreciate the details here are (deliberately) vague enough that it will be hard for the fund managers to identify the case or respond. I'm sorry about this, but I also don't want to doxx myself.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Anon Banana"}}]