[{"_id": "LqDRXRgCPJcLtvwg8", "postedAt": "2023-10-29T09:36:37.548Z", "postId": "BpidfBPiv6J8FuHnW", "htmlBody": "<p>Nice work Dušan!</p>", "parentCommentId": null, "user": {"username": "yanni"}}, {"_id": "oPc33QzMGniKLTfEh", "postedAt": "2023-10-30T02:02:18.970Z", "postId": "BpidfBPiv6J8FuHnW", "htmlBody": "<p>Congratulations on the opening, Dušan!</p><p>May I ask you to explain what you mean by \"visa-free work privileges\" in Serbia, in the sentence mentioning citizens of Russia and China?</p><p>I see that <a href=\"https://en.wikipedia.org/wiki/Visa_policy_of_Serbia\">visa policy of Serbia</a>, as summarized in the Wikipedia, allows visa-free access for maximum stay of 30 days for such citizens (and 90 days for another large list of countries). But it doesn't mention work.</p>", "parentCommentId": null, "user": {"username": "Nickolai_Leschov"}}, {"_id": "w7cAevbpoXEraJirF", "postedAt": "2023-10-30T08:15:09.457Z", "postId": "BpidfBPiv6J8FuHnW", "htmlBody": "<p>Hi Nickolai! Sure thing; generally, the maximum stay of 90 days for other countries is limited to 90 days in 180 days. However,, for Russian and Chinese citizens, the limit is 30 days, but there is no limit to how many times this can be done. Thus, so long as you cross a border (for example by bus into Bosnia, which has the same rule and is 2 hours away from Belgrade) once a month, you can stay indefinitely (and I have known people who did so for ~7 years already). This allows you to work from here and have a bank account here, all without having to take out a residency permit. Even getting those permits is not too expensive, as one can open a company fairly cheaply and get a visa based on that, getting corporate accounts and related benefits of residency (ability to apply for other countries' visas from here and gaining citizenship after 3-5 years, although you usually have to give up your own passport).</p>", "parentCommentId": "oPc33QzMGniKLTfEh", "user": {"username": "Dušan D. Nešić (Dushan)"}}]