[{"_id": "K6zpfHj9jcCbKRAgP", "postedAt": "2023-05-25T14:01:04.278Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>I think the question you're asking is ambiguous in a way that matters. Your example—\"someone at OpenPhil being the lead decision maker on a grant and then sitting on the board of that org\"—is not typically what the arrangement of being a funder/board member looks like. While funder/board members drive the direction of an organization and help determine its general funding priorities, being the point person on decisions about <i>specific grants</i> is quite different from this. In the latter case, a funder/board member would also, effectively, be serving as an employee of the organization, because these organizations<i> </i>have full-time grantmakers. That would (likely) make them intimately involved in the day-to-day workings of the organization, and could more easily introduce serious COIs. The arrangement of funder/board member seems fine; the arrangement of funder/board member/grantmaker doesn't.</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "vmhX6J7YmpcACksq9", "postedAt": "2023-05-25T14:08:28.102Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>I agree with everything you said here, and would also add an analogy: in the for-profit world it is very common, and actively encouraged, for major investors to have board seats, because it ensures the investor has some level of control and visibility over how their money is used — which seems very reasonable to me.</p>\n", "parentCommentId": null, "user": {"username": "Shakeel Hashim"}}, {"_id": "GnZ2vSoBAZr4SsZRA", "postedAt": "2023-05-25T14:09:07.970Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>&nbsp;Claire Zabel sits on the board of EVF, and also signs off their grants. Right.</p><p>Which of your examples is this more like?</p><p>I struggle to really understand the difference, though I guess you're right that there is one.</p>", "parentCommentId": "K6zpfHj9jcCbKRAgP", "user": {"username": "nathan"}}, {"_id": "gyghv8dYJmfspY9Ne", "postedAt": "2023-05-25T14:10:53.100Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>Now I think this, because of course I think this, but we could run a monthly poll of community frustrations, isolate the disagreements and run debate posts like this.</p><p>I think this would be much healthier than the current paradigm. Each post discusses one narrow issue, hopefully we can update somewhere by the end of it. Experts have actual reason to get engaged.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "XDoxWEWbybcSJuBqX", "postedAt": "2023-05-25T14:11:57.126Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>I'm confused by some of the references to \"organization,\" which could refer to the organization receiving a grant (e.g., EVF) or the grant-recommending organization (e.g., Open Phil). Could you clarify which you mean?</p>", "parentCommentId": "K6zpfHj9jcCbKRAgP", "user": {"username": "Jason"}}, {"_id": "bW8gDoFywygqiiecE", "postedAt": "2023-05-25T14:33:22.202Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>While I voted weakly agree, I would add some caveats:</p><ul><li>Anyone who is considering a dual-hatted situation like this needs to clearly understand that they are assuming two different roles and that their obligations in each role will differ. When acting as a nonprofit board member, for instance, the individual owes a duty of loyalty to the nonprofit. They need to be particularly alert to situations in which recusal or even resignation may be required.</li><li>In each case, the potential conflicts of interest need to be analyzed. If a conflict exists but is waivable, then it needs to first be waived by someone who can legitimately do so. For instance, in the Claire example, I think there is a conflict between Claire being involved in proposing a grant and in making a recommendation on whether to fund that grant. I also think that conflict is waivable by the ultimate donor. In contrast, if the funds were coming out of a publicly-supported charity, I would likely find the conflict non-waivable because there is no practical way to get ultimate-donor consent.</li><li>It's undesirable to have too large a proportion of funder-linked seats in a public charity. Many larger non-EA nonprofits have rather large boards, which allows them to absorb several seats for major donors (or big fundraisers) without creating too many downsides. For example, having one funder-linked seat out of five seats total would bring this closer to neutral for me. If the board were smaller than that, it would probably move me into negative territory.</li></ul>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "RpuSPHtym7wFDRmt5", "postedAt": "2023-05-25T14:35:54.035Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>One way in which the Claire example could differ from other examples is that she owes both a duty of loyalty to EVF and a duty of loyalty to the donors to whom she is making the grant recommendation. If the donor themself is on the board, there is only one duty of loyalty floating about (it doesn't make sense to say the donor-trustee has a duty of loyalty to themself as a donor).</p>", "parentCommentId": "GnZ2vSoBAZr4SsZRA", "user": {"username": "Jason"}}, {"_id": "kKKQnRaqX6BiuAe64", "postedAt": "2023-05-25T14:59:45.089Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>Private equity employees often sit on the boards of portfolio companies, even though technically it's not their money - it belongs to the investors in the fund. These PE employees then owe duties to both the other investors in the portfolio company and to the investors in the fund.</p>\n", "parentCommentId": "RpuSPHtym7wFDRmt5", "user": {"username": "Larks"}}, {"_id": "FFxfGrKsBWnvMoDZp", "postedAt": "2023-05-25T15:20:03.739Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<blockquote><p>the individual owes a duty of loyalty to the nonprofit</p></blockquote><p>I don't think this is true. This is not what their board seat is for.</p><blockquote><p>a conflict between Claire being involved in proposing a grant and in making a recommendation on whether to fund that grant</p></blockquote><p>I don't really think this either. I think suggesting that the org is worth supporting is her job. She doesn't have a conflict of interest here, this <i>is</i> the job of a grantmaker, right?</p>", "parentCommentId": "bW8gDoFywygqiiecE", "user": {"username": "nathan"}}, {"_id": "LRdnqLMibGdAwrXR6", "postedAt": "2023-05-25T15:54:37.001Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>I haven't thought hard about this yet, so this is just a quick take: I'm broadly enthused but don't feel convinced that experts have actual reason to get engaged. Can you flesh that out more?</p>\n", "parentCommentId": "gyghv8dYJmfspY9Ne", "user": {"username": "ChanaMessinger"}}, {"_id": "WCt6nedPNSPHXPpEv", "postedAt": "2023-05-25T15:56:25.462Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>Again quick take: would be interested in more discussion on (conditional on there being any board members) takes on what a good ratio of funders to non funders is in different situations.</p>\n", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "78smuFGge3vAPjZPB", "postedAt": "2023-05-25T16:21:22.020Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>The duties of a non-profit board member / trustee, including a duty of loyalty to the non-profit, are established by law. I'm not aware of any authority to create board seats whose occupants lack the most fundamental duty of a member / trustee. For example, the Charity Commission (UK) explains that a trustee <a href=\"https://www.gov.uk/government/publications/the-essential-trustee-what-you-need-to-know-cc3/the-essential-trustee-what-you-need-to-know-what-you-need-to-do#act-in-your-charitys-best-interests-1\">must</a> \"do what you and your co-trustees (and no one else) decide will best enable the charity to carry out its purposes,\" and that this duty is not about serving \"the personal interests of supporters, funders or donors.\"<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8v5vv03bw78\"><sup><a href=\"#fn8v5vv03bw78\">[1]</a></sup></span></p><p>Thus, in their role as a trustee, the dual-hatted individual must act in the \"charity’s best interests.\" But in their role as a grantmaker, they owe a duty to their donor(s) to provide the best possible advice. I'd characterize a grantmaker's job as neutrally evaluating all the grant proposals on their desk and recommending a funding allocation. This advice will not necessarily further the best interests of the charity on whose board the grantmaker sits.&nbsp;</p><p>So you have one person performing two different roles (an advocacy-like role and a comparative-evaluation role) on the same grant, each involving a duty of loyalty to a different entity (the organization on whose board the person sits, the donor who the person is advising). That's a conflict to me, albeit often a waivable one by the donor.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8v5vv03bw78\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8v5vv03bw78\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Even on a for-profit board, board members have a fiduciary duty to all shareholders as a whole. A board member who is also a major investor is not exempt from that duty.</p></div></li></ol>", "parentCommentId": "FFxfGrKsBWnvMoDZp", "user": {"username": "Jason"}}, {"_id": "gKkWwhrjcqDr9gmft", "postedAt": "2023-05-25T17:08:23.784Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>Good analogy. This arrangement has been implicitly consented to by the fund investors, so I think it is generally quite fine. I'm more willing to find an implied COI waiver in this context than in most charity contexts for two reasons:</p><ul><li>First, private equity fund investors are generally quite sophisticated, and they both understand and desire that someone from the fund sit on the portfolio-company board. I assume that is also true in the Claire example, but there are many charity-related examples where that is not the case.</li><li>Second, the aims of the various entities tend to be more necessarily aligned in the for-profit example: everyone wants to make money. Although they might disagree on the best path to get there, money is universally quantifiable in a way that charitable impact is not.</li></ul>", "parentCommentId": "kKKQnRaqX6BiuAe64", "user": {"username": "Jason"}}, {"_id": "6RwcpZ3sm6ovstXx2", "postedAt": "2023-05-26T16:07:06.740Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>Just a note that the Likert scale in the poll is not symmetrical (\"Agree\" vs. \"Strongly Disagree\")</p>", "parentCommentId": null, "user": {"username": "christian.r"}}, {"_id": "cGyaHMWbgvNyzNiqF", "postedAt": "2023-05-28T10:41:07.130Z", "postId": "bPXmomt5boy72Pfre", "htmlBody": "<p>Great post, I'm glad this is up for debate.&nbsp;<br><br>I'm mostly worried about situations where the majority of the board is made up of different representatives of a single funder / donor. For the example of Claire - I think it's fine that she represents OP interests to CEA. I'm more worried when the other board members and executives are also very strongly OP affiliated - then it seems like the nonprofits ability to carry out it's mission is harmed. If a nonprofit has an appearance of independence but in practice is managed / owned by a different organization, that seems problematic. Of course, in the case of CEA, I have no idea what went into the decision making process and what the counterfactual looks like (for example - where there other people who wanted that role?), and it's quite possible there are good reasons for this especially post FTX, so I'm less critiquing the results and more of a process that looks like philanthropy -&gt; nonprofit, but in practice is parent company -&gt; subsidiary.</p>", "parentCommentId": null, "user": {"username": "ezrah"}}]