[{"_id": "uvbGmzpZcdKwd9FTT", "postedAt": "2015-07-24T17:05:56.048Z", "postId": "bqgxafGxcTaRYvg5K", "htmlBody": "<p>I really like this. \nWhat I would like even more of critics is to suggest a concrete organisation, that they think we should donate to instead of the current top charities.</p>\n", "parentCommentId": null, "user": {"username": "HaukeHillebrandt"}}, {"_id": "GkJ34dWXoYsSetDrM", "postedAt": "2015-07-24T18:13:00.728Z", "postId": "bqgxafGxcTaRYvg5K", "htmlBody": "<p>Or concrete steps that we should take. I think one thing a lot of these critics think is that we shouldn't be donating - we should be doing more direct work. We need to hear what work exactly that is.</p>\n", "parentCommentId": "uvbGmzpZcdKwd9FTT", "user": {"username": "zdgroff"}}, {"_id": "Y9ecDrBYmAL7BDwYu", "postedAt": "2015-07-24T19:42:23.778Z", "postId": "bqgxafGxcTaRYvg5K", "htmlBody": "<p>And often (with many honorable exceptions), why the critics aren't doing that work...</p>\n", "parentCommentId": "GkJ34dWXoYsSetDrM", "user": {"username": "CarlShulman"}}, {"_id": "nx4erKTKPwjN3aCJi", "postedAt": "2015-07-24T19:44:09.901Z", "postId": "bqgxafGxcTaRYvg5K", "htmlBody": "<p>I don't get that criticism. I can always donate to help you do direct work. I don't see any way to criticize donating per se other than through non-consequentialist reasoning. </p>\n<p>Edit: Unless they're criticizing the ratio of direct work to donations.</p>\n", "parentCommentId": "GkJ34dWXoYsSetDrM", "user": {"username": "mhpage"}}, {"_id": "azkJEi7pPJ7XdaCEX", "postedAt": "2015-07-24T21:27:45.491Z", "postId": "bqgxafGxcTaRYvg5K", "htmlBody": "<blockquote>\n<p>Unless they're criticizing the ratio of direct work to donations.</p>\n</blockquote>\n<p>I think that's usually what it is. But there's usually no explicit argument for it.</p>\n", "parentCommentId": "nx4erKTKPwjN3aCJi", "user": {"username": "zdgroff"}}, {"_id": "pQTALpN3uQ5PCky9u", "postedAt": "2015-07-24T23:04:41.668Z", "postId": "bqgxafGxcTaRYvg5K", "htmlBody": "<p>Thank you for posting this! I think these are really great counter arguments, as well as a succinct description of many criticisms of EA. As we are rapidly gaining press, we are also gaining critiques and almost all of the ones I've seen are exactly this rationale.</p>\n<p>What I keep waiting for someone to say, but haven't seen quite yet, is the response 'That's OK. You don't have to work on X to still identify as an Effective Altruist.' For example I know quite a few people in EA that care deeply about existential risk, but aren't particularly moved by the global poor. I know people who have said they like the 'effective' more than the 'altruist' because they really, really like optimizing things. I myself am not motivated by AI risk at all - I simply don't find it interesting or engaging, and I'm not entirely convinced it's a good way to spend my energy - but I still have great respect for those that do, and I still strongly identify as an EA.</p>\n<p>I wonder if this desire for all or nothing acceptance of base principles may be because many people within EA strive to wipe out cognitive dissonance, which my argument sort of feels like. However I worry if in our avoidance of cognitive dissonance we fall into the trap of dualistic thinking. I found myself wandering back to <a href=\"http://effective-altruism.com/ea/9s/effective_altruism_is_a_question_not_an_ideology/\">Effective Altruism is a Question</a>. The last paragraph being the most pertinent: </p>\n<blockquote>\n<p>I can imagine a hypothetical future in which I don’t agree with the set of people that identify with the 'EA movement'. But I can’t imagine a future where I’m not trying to figure out how to answer the question 'How can I do the most good?'</p>\n</blockquote>\n<p>In other words we as a community should be more open to the idea that not everyone has to buy into every idea or tenant within EA. We do have to all agree that we are trying to do the most good. Indeed it is the continual debate about how to go about doing the most good that is ultimately what makes us most effective.</p>\n<p>Which is why I love your response, which I would probably summarize as 'It is good that EA is flawed because we have things to strive for, come help us make it better!'</p>\n", "parentCommentId": null, "user": {"username": "SydMartin"}}, {"_id": "HS5ZHcpu3AnppdYgZ", "postedAt": "2015-08-02T00:01:05.755Z", "postId": "bqgxafGxcTaRYvg5K", "htmlBody": "<p>The biggest gap that I see is people claim that &quot;X is more important&quot; as a general cause but they don't demonstrate that a given amount of dollars, labor or activism will go further for X than it will for other causes. Even if something is important, that's not sufficient to demonstrate that it's the most important cause to work for.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}]