[{"_id": "2GTeos99rhRjwC3k6", "postedAt": "2023-12-10T13:15:56.342Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>My personal view is that being an EA implies spending some significant portion of your efforts being (or aspiring to be) particularly effective in your altruism, but it doesn't by any means demand you spend <i>all</i> your efforts doing so. I'd seriously worry about the movement if there was some expectation that EAs devote themselves completely to EA projects and neglect things like self-care and personal connections (even if there was an exception for self-care &amp; connections insofar as they help one be more effective in their altruism).</p><p>It sounds like you developed a personal connection with this particular dog rather quickly, and while this might be unusual, I wouldn't consider it a fault. At the same time, while I don't see a problem with EAs engaging in that sort of partiality with those they connect with, I would worry a bit if you were making the case that this sort of behavior was <i>in itself an act of effective altruism</i>, as I think prioritization, impartiality, and good epistemics are really important to exhibit when engaged in EA projects. (Incidentally, this is one further reason I'd worry if there was an expectation that EAs devote themselves completely to EA projects – I think this would lead to more backwards rationalizations about why various acts people want to do <i>are actually</i> EA projects when they're not, and this would hurt epistemics and so on.) But you don't really seem to be doing that.</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "5var7Ds7TC9gXKNRo", "postedAt": "2023-12-10T19:07:15.373Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>In your position, my response to the question \"why spend so much on this one dog?\" would be \"because I wanted to lol\". You don't have to justify yourself to anyone, and you don't have to reconstruct some post-hoc justification as to why you did it.</p>\n<p>I understand that's not a satisfying solution, in that it doesn't preclude a slippery slope into \"all of my money goes into arbitrary things that tug my heartstrings and none of it goes to the most effective causes\". You may be seeking guardrails against that possibility. There are none. Which is okay, because you probably don't need them! You identify as EA for a reason. I'm going to guess it's because the suffering of people and animals tugs at your heartstrings, even when you don't see them. As long as that's true, it seems extremely unlikely that you will fall off this slippery slope.</p>\n<p>Moreover, I don't think it's healthy to try to justify all your life choices on EA grounds, a point made best <a href=\"https://forum.effectivealtruism.org/posts/HX9ZDGwwSxAab46N9/you-don-t-need-to-justify-everything\">here.</a></p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "rFWAgCo5HH28zYpes", "postedAt": "2023-12-10T19:48:11.791Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I mostly agree with the other commenters here, and thought I might perhaps have an additional perspective: I think <i>both</i> your way of being and EA, <i>as well</i> as how your EA friends chose to live are important to EA. I could, when reading your post, feel the pull to divide EA into the \"too much\" camp and the \"EA light\" camp but I think this initial, us vs them reaction is unnecessary and perhaps even counter productive. The more \"hard core\" among us helps the more \"EA light\" among us (to which I think I might belong) prevent value drift and encourages us to take helping as much as we can even more seriously. At the same time, I think us \"EA light\" folks have value to add to the \"hard core\" faction by making them feel more ok about the occasional \"mistake\" they might make. I also think us \"EA light\" folks can help grow the movement as I think it is much easier to recruit \"EA light\" people to our causes and organizations than the hard core types.&nbsp;<br><br>I really hope you and your friends can come to some sort of understanding like this, where you can both live guilt and judgement free as EAs and feel like you belong in this movement. For what it is worth, I think you are probably being more than EA enough - just the fact that you thought through this and wrote this post seems to demonstrate that to me. In my books it is completely ok that EAs act ineffectively, even frequently! I sure do!</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "kBCrADJTwxtR7FQ2R", "postedAt": "2023-12-10T23:11:06.696Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Perhaps another way to frame it might be to count the time and money outside of the your donation bucket? As in, donation budget is rational/effective, and everything else can be included as part of discretionary spending on personal/wellbeing? eg- same bucket as hobbies, travel etc.<br><br>Not sure if this might simplify things mentally and guard against motivated reasoning and slippery slope concerns</p>", "parentCommentId": null, "user": {"username": "Simon Newstead"}}, {"_id": "YdRksYdMukKHxbvGc", "postedAt": "2023-12-11T09:14:06.076Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I feel like these actions and attitudes embody many of the virtues of effective altruism. You really genuinely wanted to help somebody, and you took personally costly actions to do so. I feel great about having people like you in the EA Community. My advice is to keep the feeling of how important you were to Tlalok's life as you do good effectively with other parts of your time and effort, knowing you are perhaps making a profound difference in many lives.</p>\n", "parentCommentId": null, "user": {"username": "rileyharris"}}, {"_id": "XJ2oaBT5jcqKPhjCz", "postedAt": "2023-12-11T13:53:30.066Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p><strong>Executive summary</strong>: The author wrestles with being maximally effective after bonding with and rescuing a stray dog in Mexico, questioning if that emotional response should be avoided or encouraged.</p><p><strong>Key points:</strong></p><ol><li>The author bonded with a sick stray dog in Mexico, spent significant time and money rescuing and eventually adopting it.</li><li>Some effective altruist friends criticized this as irrational and ineffective, suggesting euthanasia or a controversial social media post.</li><li>The author identifies as an effective altruist focused on reducing animal suffering, yet defends the emotional response and questions maximizing effectiveness above all else.</li><li>There are positive effects from helping individuals that inspire others, and wanting to retain empathy even in an increasingly rational world.</li><li>The author concludes by capping emotional/impulsive donations at 20% while guaranteeing effective donations are at least 80%, increasing both together.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "ePHtpc9s3fXij3JXc", "postedAt": "2023-12-11T15:04:51.489Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Thank you for taking the time to write this post, Tobias.&nbsp;<br><br>It resonated a lot with me and as I've recently been thinking (and experiencing!) how privileged I am. I'm spending the winter in a warm place and there are a lot of homeless people here. One way I deal with this emotionally is that I give them 50ct-1€ every time I see a homeless person. This money does not come out of my normal donation budget and it makes me feel like I can make a slight difference in somebodys day. I know it's not the \"EA thing\" to do, but as others said in the comments, there is no need to be sticking to EA principles 100% of the time.</p>", "parentCommentId": null, "user": {"username": "Sara Elsholz"}}, {"_id": "gSuRJaNWABwuYrLqF", "postedAt": "2023-12-11T21:39:27.603Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Thanks for sharing! My intuition would be that the behavior of your friends are net negative for the EA movement as they risk demotivating you in your work and making it seeming like EA has standards that many people don’t want to follow. It took me some years to grasp the bandwidth of attitudes and behaviors that are compatible with adhering to the shared values and this delayed my switching to direct work. In that sense I would agree with the parallel you drew from the vegan community.\nThat being said I feel myself self-censoring more what I post online since becoming more active, as I am aware of being judged by some people in and out of the community. I’m not sure if this is a good thing.</p>\n", "parentCommentId": null, "user": {"username": "gruban"}}, {"_id": "YyRXNkafLffaNFHDp", "postedAt": "2023-12-13T08:40:44.131Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Thank you for writing this, Tobias. I can see why you feel confused about this, I think it makes sense to feel so. It sucks your friends made you feel bad about it.&nbsp;<br><br>I can't say what the right thing to do was in that situation, but I can say I am with you that it <strong>isn't right</strong> to be harsh to ourselves and others for not making the most optimized decision <i>all the time</i>.&nbsp;<br><br>No one needs help just because they spend their personal time and money on a stray dog, including you. I can see why this might still be hard to accept. Perhaps reframing it like this might help?&nbsp;</p><ul><li>Your compassionate colleague, who's incredibly dedicated to improving animal welfare, was on vacation. They're resting from difficult work and making difficult decisions.&nbsp;</li><li>They gave themselves rare time to do whatever they wanted to do, to focus on themselves, just enjoying their lives.&nbsp;</li><li>And at that time, helping an incredibly friendly and trusting stray dog would make them happy. And so, they did.&nbsp;</li></ul><p>I currently live in a place where there are a lot of suffering people and animals. Most of the time, I can't help them. I try to not ignore them, though; I acknowledge them in ways I can. I think they really appreciate that. When I say no to people begging, I still kindly look them in the eye and smile to say sorry. For strays, I give them small treats.</p><p>Since I can't avoid it, I cope by reframing it as a daily reminder of why this work means so much. That I'm helping this many beings who are in need, if not more.&nbsp;</p><p>It hurts that I'm affected, but I see it as an indication that I still care. I think I would actually be really worried if I am no longer affected.</p>", "parentCommentId": null, "user": {"username": "Arvin"}}, {"_id": "vzBnDpqDDaJFCAbeE", "postedAt": "2023-12-13T09:49:40.379Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I think it's good you helped the dog and you should get positive reinforcement for it and feel good about yourself for it.</p>\n<p>I think it would have been, idk, maybe 20 thousand or more times as good, if you had used the same amount of money on highly cost effective global health interventions, but that doesn't mean it isn't also good that you helped the dog.</p>\n", "parentCommentId": null, "user": {"username": "Yellow"}}, {"_id": "rwgBgsroQcsyAZqte", "postedAt": "2023-12-13T09:53:55.335Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<blockquote>\n<p>I’m curious how others think about this, how you cope with this tension, and if you can imagine spending so much time on one human or animal (who is a stranger to you).</p>\n</blockquote>\n<p>Personally no, not really - I wouldn't spent 1000+ dollars or a day's work on an animal who is a stranger to me, or even any an animal that I know. For a human stranger I might, but there are limits there too.  I think to some degree i I can viscerally feel in my feelings as well as my thoughts opportunity costs above a certain magnitude, so it doesn't really feel like cold calculations over feelings to me. It also helps to personally know more people in need than I can realistically help, and so being accustomed to feeling in triage even before taking abstract strangers into account.</p>\n<p>But I sometimes do smaller versions of this. For example, last week I tried to catch a mouse and release it in a location where it might survive rather than killing it, even when that costs an extra hour which could be spent doing much more good. I don't think this is a problem at all, it's a more impactful use of my time than scrolling on the internet which I also do sometimes. Why should only good actions be subject to scrutiny? So you helped a dog, instead of buying a fancier car, why should anyone have a problem with that?</p>\n<p>When your friend isn't criticizing that you bought a more expensive apartment or laptop than is strictly needed to maximize effectiveness, then why should they decide to criticize your act of kindness to a dog? There are institutions with billions in resources who spend it on nothing useful, or war, who wants to worry that one little dog has gotten some good fortune?</p>\n<p>I think it is a big mistake to bring those who are doing a little small bit of good, under more negative scrutiny than if they had done nothing.</p>\n", "parentCommentId": "vzBnDpqDDaJFCAbeE", "user": {"username": "Yellow"}}, {"_id": "RCjKeRMjEBiHWPZNk", "postedAt": "2023-12-13T10:46:23.113Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Echoing themes of what some other people have said, I think it's important to have space in your life where you are not always optimizing for effectiveness. You were on vacation! Choosing to use some of your vacation time and a significant chunk of money is admirable.</p>\n<p>The ONLY worry I would have if I were in your shoes from an EA perspective is \"this $1000 I spent, would I have otherwise donated it to a super effective charity?\" If the answer is yes then maybe there's some reflection to do about how you are approaching effectiveness. But if - as I'm guessing - that $1000 came out of money that you would have spent to make yourself happy I'm some other way, then it's admirable you decided to use it to help this dog.</p>\n<p>How I think about it: I have a effective giving budget, and a guilt-free spending on myself budget. I spend $1000+ per year on things like movies, going out to eat, etc., and don't feel bad about it because I have budgeted for it and can't do an effectiveness calculation every time I make a decision about how to spend my time or money.</p>\n", "parentCommentId": null, "user": {"username": "Luke Eure"}}, {"_id": "8JPZeYJ5A6aMrtzu7", "postedAt": "2023-12-13T16:59:53.421Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Unfortunately when I first joined EA and went vegan I would have been more judgmental but now I think I understand where you're coming from.</p>\n<p>My own anecdote: I have an antisocial hamster. He doesn't like being held or pet, and would be happiest with minimal human interaction. There is no reason for me to be so emotionally attached to him — he was given up by his previous owner, but isn't charismatic / affectionate like dogs and cats. Despite this, I adore him. I've built him the best home I can, as large &amp; interesting as possible, for hundreds of dollars. I've taken him to the (expensive) exotic vet ASAP when he needs it so he can be maximally comfortable.</p>\n<p>Most people buy hamsters for $20 and let them spend their whole lives in crappy plastic cages. I could have easily have either not sought him out, or after getting him, given him only \"standard U.S.\" levels of care. I don't have a good theory for why he deserves hundreds of dollars worth of herbs and bedding and moss when basically any other use of my money would be more effective at reducing animal suffering. I will accept it's basically unjustifiable. But whatever the me-separate-from-my-morality is — the non-consequentialist bits of squishy human reasoning — that me would be deeply emotionally harmed by harming the little dude.</p>\n<p>My best answer is just that my hamster is part of the warm fuzzy budget, not the utilon budget.</p>\n<p>Just wanted to chime in with my own random two cents. Lots of empathy to you, and best wishes with Tlalok. Even if it's not maximally moral, I am glad to live in the same world as people like you.</p>\n", "parentCommentId": null, "user": {"username": "MintSnap"}}, {"_id": "bGGjWWzBkfnqqyjMx", "postedAt": "2023-12-14T05:00:24.714Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Yes! There are so many opportunities to help animals, and some are effective on a really large scale, but what Tobias did means the world to this dog &lt;3</p>", "parentCommentId": "vzBnDpqDDaJFCAbeE", "user": {"username": "fish_are_friends"}}, {"_id": "YQsskxTRybgNhoLrX", "postedAt": "2023-12-14T13:18:59.372Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>thank you. your hamster situation sounds quite similar. I guess for myself I'm wondering if it can be a bug and a feature at the same time :-)</p>", "parentCommentId": "8JPZeYJ5A6aMrtzu7", "user": {"username": "tobiasleenaert"}}, {"_id": "QCeh5wpESnAZuNhap", "postedAt": "2023-12-14T13:22:31.788Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I guess I'm thinking that if A is 20k times as good as B, it's really not very good to do B even if B is a little bit good in itself :-)&nbsp;</p>", "parentCommentId": "vzBnDpqDDaJFCAbeE", "user": {"username": "tobiasleenaert"}}, {"_id": "3jmsRXaijMmthGu6o", "postedAt": "2023-12-14T13:24:48.657Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>what you say relates to the last point I made, I think: what does the behavior (time or money) compete with (or displace). Is that money or time taken from one's charity budget, or from e.g. one's entertainment budget? I guess there's good ways to track that if one is honest with oneself.</p>", "parentCommentId": "rwgBgsroQcsyAZqte", "user": {"username": "tobiasleenaert"}}, {"_id": "sP23CB2tM2bCypmnW", "postedAt": "2023-12-14T13:28:09.900Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>thanks, I've felt this value of light vs hardcore as well...</p>", "parentCommentId": "rFWAgCo5HH28zYpes", "user": {"username": "tobiasleenaert"}}, {"_id": "JqM9ZxEDoXiqcXQpo", "postedAt": "2023-12-14T13:29:57.635Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Thank you, everyone, for your comments. Many of them sort of reframed my dilemma in different terms, and confirmed my doubts (not a bad thing). And at the same time I was also moved and comforted by the empathy displayed. I remain happy to be part of this community.</p>", "parentCommentId": null, "user": {"username": "tobiasleenaert"}}, {"_id": "AwYZrQHTu5Rh5jYuy", "postedAt": "2023-12-14T13:53:56.018Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I believe it's great that you assisted the dog, and you should feel proud of yourself and receive praise for it. While I believe that spending the same amount of money on extremely cost-effective global health treatments would have produced results that were at least ten thousand times as excellent, helping the dog is still a good thing.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "animal learns"}}, {"_id": "6fg4JzwSveggRrAmg", "postedAt": "2023-12-15T13:27:07.975Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Thank you for this post. I have a hunch that your friends' behavior might have a negative impact on the Effective Altruism (EA) movement. It seems that their actions could potentially demotivate you in your efforts and create a perception that EA has standards that many may not want to adhere to. Personally, it took me some time to understand the range of attitudes and behaviors that align with our shared values, and this delayed my transition to direct work. In that regard, I see the parallel you drew with the vegan community<a href=\"https://animallearns.com/\">.</a></p><p>However, I've noticed a shift in my own behavior since becoming more active. I find myself self-censoring more in what I post online, being mindful of potential judgments from both within and outside the community. I'm uncertain whether this change is ultimately beneficial.</p>", "parentCommentId": null, "user": {"username": "animal learns"}}, {"_id": "jXwkRBwMopmTqRnyc", "postedAt": "2023-12-16T21:57:57.148Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>Here's a few quotes from your post (emphasis added):</p><blockquote><p>I ran into a quite unhealthy looking dog who was riddled with ticks. We spent half an hour taking the ticks out and by the time we were done with him, we knew <strong>we wouldn’t let him lie there</strong>....</p><p>We brought him there [to a shelter] right away, leaving him in a pen &lt;...&gt; . When we went away, it was with <strong>a bad feeling.</strong>&nbsp;</p><p>When we went back the next day, we were told that the dog had escaped. &lt;...&gt; <strong>We felt devastated</strong></p><p>By now we had bonded with this dog &lt;...&gt; and <strong>mourned</strong> for the rest of the day.</p></blockquote><p>A question, riffing off the title:</p><ul><li>Several people in the same scenario would <i>not</i> have worried about letting that dog lie there, would <i>not </i>have had a bad feeling about leaving a dog in a shelter and realising that the dog wasn't happy there, would <i>not</i> have felt devastated about this, and would <i>not</i> have mourned the outcome...</li><li>... do those people need help?</li></ul>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "mbyGEqzgayieprAkk", "postedAt": "2023-12-17T01:00:34.981Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I guess I'm not fully sure I understand why you are thinking that. &nbsp;Is it possible that you are feeling confused about your feelings because it is a dog and so it is easier to think of its welfare in terms of which number is smaller rather than engaging with the question emotionally?</p><p>Imagine it was a human child. Wouldn't it be \"very good\" to give one human child a caring family and a home? Why does the fact that it would be arguably more good to prevent ten human children from premature malaria deaths take away from that it's good to help one child?&nbsp;</p><p>If everybody with the capability would give serious support to even one other person then almost all these problems would be solved several times over</p><p>Or lets imagine a more down to earth scenario. Your friend wants you to help them move. So you help them move. But you instead could have worked extra and made more money, hired movers for your friend, and also on top of that paid for a week of your friend's meals. Haven't you still done a good turn by helping your friend, even if an even more efficient way to help them exists? (Especially when in reality you were never going to put in all those extra work hours and you would burn out if you lived like that)\\</p><p>A small good deserves a small reward, not a punishment, but it sounds like you are punishing yourself. The purpose of guilt and shame emotions are not intended to punish yourself for not doing enough.Those emotions are intended to stop you from doing <i>bad </i>things, not punish you for being <i>insufficiently efficient about good</i>. If you emotionally punish yourself for doing good in smaller than maximally efficient ways then you'll only train yourself to flinch away from doing good things, don't do that to yourself. &nbsp;</p><p>We want you to work hard at doing good for others for many years, We don't want you to feel guilt and shame about not doing enough until your motivation fizzles out. Small good things count.&nbsp;</p><p>It's not about catering to your emotions at the expense of rationality or anything. When you find a $1 dollar on the street, you are happy to have gotten a little money, not sad that the bill was not $100, right? It doesn't do to not appreciate the small things just because larger things exist. You talked about emotions vs yourf riends being \"more calculating\" than you earlier, but what your friends said was actually <i>not rational,</i> it is<i> not calculating correctly</i> to not count small good things as good just because an even bigger good is placed next to them.&nbsp;</p><p>If you want to change your behavior to do even more good that's great but there's no sense in which doing a small good should count <i>against</i> you.</p>", "parentCommentId": "QCeh5wpESnAZuNhap", "user": {"username": "Yellow"}}, {"_id": "MeZRMmuZCWgTB3JtL", "postedAt": "2024-01-21T13:38:30.212Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I think your way of being and EA, as well as how your EA buddies decide to live, are vital to EA. I mainly agree with the other posters here, but I thought I might have something extra to contribute. After reading your piece, I felt tempted to categorize EA into two camps: \"too much\" and \"EA light.\" However, I believe that this initial us vs. them mentality is needless and might possibly be detrimental. The more \"EA light\" among us—to which I believe I may belong—helps the more \"hard core\" among us by preventing value drift and motivating us to take assisting even more seriously.</p><p>However, I believe that by helping the \"hard core\" group feel more comfortable with the odd \"mistake\" they may make, we \"EA light\" people may be of benefit. As \"EA light\" individuals are more simpler to attract to our causes and organizations than hard core types, I believe that we \"EA light\" people may also contribute to the movement's growth.&nbsp;<br>&nbsp;</p><p>Regard</p><p>Tiger</p>", "parentCommentId": null, "user": {"username": "Ahsan Umar"}}, {"_id": "9Sms5CGGQ8di54pjf", "postedAt": "2024-01-31T06:44:51.976Z", "postId": "bqtdsyySQEkpLd6uL", "htmlBody": "<p>I feel like many of the other comments here better express my view. But I just wanted to chip in and say that I think your EA friends are wrong and that this post makes me respect you much more, not less. I also really appreciate that you are being so open about your thinking and internal conflicts, even though you are yourself a leader in the space I really look up to.&nbsp;</p>", "parentCommentId": null, "user": {"username": "EffectiveAdvocate"}}]