[{"_id": "oJ8JS6QJYzDwDC3uF", "postedAt": "2015-05-03T01:05:54.413Z", "postId": "BrceoZNxrr363qBFR", "htmlBody": "<p>Thanks for this idea, I'd love to take you up on it. To figure out how many I want:</p>\n<ol>\n<li>How long would it be before you would consider a reprint?</li>\n<li>How much would it cost to ship them to the postcode 4740, Queensland, Australia?</li>\n</ol>\n<p>PS. I might want a hundred or something, in that case I should give you some cash. Donations to EA orgs aren't tax deductible in Australia, so the counterfactual to me buying them is me giving to EA orgs without a tax deduction, whereas your counterfactual to you buying them is (presumably) you giving to EA orgs with a tax deduction. \nPPS. It seems like everyone else personally messaged you which I can't figure out how to do, sorry...</p>\n", "parentCommentId": null, "user": {"username": "BrentonMayer"}}, {"_id": "oBQHvRvfsg2LesDDw", "postedAt": "2015-05-03T20:43:54.301Z", "postId": "BrceoZNxrr363qBFR", "htmlBody": "<blockquote>\n<p>PPS. It seems like everyone else personally messaged you which I can't figure out how to do, sorry...</p>\n</blockquote>\n<p>Click the &quot;messages&quot; link on the right of the sub-header thing, then the &quot;compose&quot; link on the left :)</p>\n", "parentCommentId": "oJ8JS6QJYzDwDC3uF", "user": {"username": "Ben_Kuhn"}}, {"_id": "WXHLrkqPAJt3NaFe7", "postedAt": "2015-05-04T14:40:03.389Z", "postId": "BrceoZNxrr363qBFR", "htmlBody": "<p>Hey Brenton--</p>\n<p>I'm printing as I go. For example, if you wanted 100 copies, I'd order a 100-copy print run and have it shipped directly to Australia (that would be $4.01/copy with shipping). There isn't much of a volume discount for printing, so this appears to be the most economical strategy.</p>\n<p>Legally, no one can exchange cash. (Otherwise, everyone would be able to order the book directly from the printer.) That's why I'm presently footing the bill. I appreciate the tax deduction point, and I am working on a solution. (By that same logic, however, shouldn't you be giving me all of your to-be-donated cash, and then I'll donate it on your behalf and get a further tax deduction?)</p>\n<p>You can send me your address via email: <a href=\"mailto:mhpage@gmail.com\">mhpage@gmail.com</a></p>\n", "parentCommentId": "oJ8JS6QJYzDwDC3uF", "user": {"username": "mhpage"}}, {"_id": "65SCiFuQNSP73eq57", "postedAt": "2015-05-05T02:27:38.163Z", "postId": "BrceoZNxrr363qBFR", "htmlBody": "<p>Hi mhpage, </p>\n<p>Great, thanks for that. I'll send you an email after I've discussed with people on this end how many we want. </p>\n<blockquote>\n<p>Legally, no one can exchange cash. (Otherwise, everyone would be able to order the book directly from the printer.) That's why I'm presently footing the bill. I appreciate the tax deduction point, and I am working on a solution. (By that same logic, however, shouldn't you be giving me all of your to-be-donated cash, and then I'll donate it on your behalf and get a further tax deduction?)</p>\n</blockquote>\n<p>This situation actually made me think more about what can be done around <a href=\"http://effective-altruism.com/ea/fu/can_we_set_up_a_system_for_international_donation/3e8\">the legality/problems with these types of arrangements</a>. At the moment though I agree that we don't have a good answer to your concern in this area at the moment so no worries at all if you want to do the ordering. </p>\n<p>Thanks for your reply mate, chat soon. </p>\n", "parentCommentId": "WXHLrkqPAJt3NaFe7", "user": {"username": "BrentonMayer"}}]