[{"_id": "tqqWbbnZdSmqHQAin", "postedAt": "2023-10-13T12:10:18.056Z", "postId": "brjKwtWHeftfZtoEc", "htmlBody": "<p>Thanks for that. Could you give more details on the considerations and expected values of these examples?</p>", "parentCommentId": null, "user": {"username": "anolderea"}}, {"_id": "KCWj4L7XhxwAEwBwB", "postedAt": "2023-10-13T13:10:58.930Z", "postId": "brjKwtWHeftfZtoEc", "htmlBody": "<blockquote><p>This article is primarily aimed at donors, not grantees.</p></blockquote><p>FWIW, I also think it's valuable information for grantmakers who want to understand the types of applications others are excited about funding.</p><p>Thank you for the write-up!</p>", "parentCommentId": null, "user": {"username": "Lowe Lundin"}}, {"_id": "tmdcsD3yiABnZT7jb", "postedAt": "2023-10-13T18:13:42.038Z", "postId": "brjKwtWHeftfZtoEc", "htmlBody": "<p>I agree.</p><p>I appreciate the examples are adapted and so shouldn't be taken literally, but if this post is being used to convince donors it'd be helpful to understand the marginal gains expected if possible.</p><p>To me, EAIF is one of the strongest forces to build the community and catalyse the work done by other topic area specifc projects/funds (incl. LTFF). I wonder how many people working in successful EA orgs. first got involved through and now propegate their research/policies/ideas through EAIF funded orgs.? It'll be great to see how the EAIF evolves over the coming months to hopefully maximise the impact of it's funding - an exciting time!&nbsp;</p>", "parentCommentId": "tqqWbbnZdSmqHQAin", "user": {"username": "JamesN"}}, {"_id": "7K9R5FdGFShcL5rKH", "postedAt": "2023-10-16T13:24:14.957Z", "postId": "brjKwtWHeftfZtoEc", "htmlBody": "<p>Hey, is it a reasonable interpretation that EAIF is much much more interested in growing EA than in supporting existing EAs?</p><p>(I'm not saying this is a mistake)</p><p>&nbsp;</p><p>P.S</p><p>Here are the \"support existing EAs\" examples I saw:</p><ul><li><i>\"[funding a] PhD student to attend a one-month program\"</i> [$100k tier] - this seems like a very different grant than the other examples, I'm even surprised to see this under EAIF rather than LTFF</li><li><i>\"A shared workspace for the EA community\"</i> [$5M tier] - totally supports existing EAs</li><li><i>\"an open-source Swapcard alternative\"</i> [$10M tier] - I'm surprised this isn't under CEA</li></ul>", "parentCommentId": null, "user": {"username": "hibukki"}}]