[{"_id": "ExgAjMNkgFBLKD4xv", "postedAt": "2023-07-23T11:11:07.865Z", "postId": "BRzA5EH8Wkv3fgHfm", "htmlBody": "<p>I think this is a good idea, however:</p>\n<p>I was initially confused until I realized you meant hair. According to Google hear isn't a word used for that purpose, the correct spelling is hair.</p>\n", "parentCommentId": null, "user": {"username": "LoveAndPeaceAlways"}}, {"_id": "yts968wSPPJPfarRD", "postedAt": "2023-07-23T11:11:11.263Z", "postId": "BRzA5EH8Wkv3fgHfm", "htmlBody": "<p>hear -&gt; hair, right?</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "ouGvu3cb9p9RfDtwu", "postedAt": "2023-07-23T13:23:07.923Z", "postId": "BRzA5EH8Wkv3fgHfm", "htmlBody": "<p>Yep, sorry!</p>", "parentCommentId": "yts968wSPPJPfarRD", "user": {"username": "mikbp"}}, {"_id": "hoW4JoqgGzY7jp87E", "postedAt": "2023-07-23T13:23:40.880Z", "postId": "BRzA5EH8Wkv3fgHfm", "htmlBody": "<p>Yep, sorry! Not native here.</p>", "parentCommentId": "ExgAjMNkgFBLKD4xv", "user": {"username": "mikbp"}}, {"_id": "5iuHXfy2fYGhzhccC", "postedAt": "2023-07-23T13:48:50.992Z", "postId": "BRzA5EH8Wkv3fgHfm", "htmlBody": "<p>I find it pretty stupid to vote down a post because there is a word wrongly spelled. You can do like the 2 users that warned me and other users. It is not that difficult.&nbsp;</p><p>If you want a world without errors, that would be a world where many good things are never attempted for fear of not implementing them perfectly, so it does not look like a very good world to me.</p>", "parentCommentId": null, "user": {"username": "mikbp"}}, {"_id": "MFRnhDj2ATKpHoBuB", "postedAt": "2023-07-23T15:08:32.307Z", "postId": "BRzA5EH8Wkv3fgHfm", "htmlBody": "<p>Hi mikbp!\nWhile it's possible that some people downvoted because of the spelling mistake (which I think shouldn't happen), I was inclined to downvote, too, mainly because when I clicked on the post I was hoping to find some details on why this is an important problem, how long my hair needs to be, how long a donation takes, what good my hair donation could do, upsides and downsides etc. Your post seems more like a call to action and maybe could have been a shortform instead! 😉</p>\n<p>Also, from a fellow non-native speaker to another: There are many Websites and online Tools that will proofread your texts (grammar, spelling, etc.), maybe you want to play around with them a bit? I think this could really help to improve your writing and make it more appealing and understandable to other forum users! :)</p>\n", "parentCommentId": null, "user": {"username": "Moritz von Knebel"}}, {"_id": "EHroHq9eYdvQw3Lh3", "postedAt": "2023-07-23T21:31:32.128Z", "postId": "BRzA5EH8Wkv3fgHfm", "htmlBody": "<p>Ok, thanks. Edited to add an approx min length and that whips are expensive. I didn't state any specific length because the minimum depends on the organisation, but yes, a guideline is good. More than that... there is actually nothing. It is super easy to do and it is common sense that many people who don't have hair because of cancer are really not comfortable with this, and specially for children this makes them stand out and be an easy target for jokes and comments. For those that struggle with money, this is very valuable —at an almost negligible cost for us. Downsides? Having colder ears? ;-) I'm not asking people who don't want to cut their hair to do anything, I'm saying if you want to cut yours, consider donating it.</p>\n<p>Re shortform: I actually first clicked on it but: 1) I wrote the post in the phone, 2) there was no title line, 3) I've never wrote (or read, I think) a shortform 4) I have not written the post for several weeks already. So 2) looked weird and because of 1) and 3) I was not sure that everything was fine, and because of 4) I didn't want to delay more writing the post (which often leads me to not writing any post at all). So I went to the safe option of writing a (short) post (which I don't think is not adequate as I've read quite a few very short posts, also by notable EAs, and nobody complained in the comments or seemed to have downvoted). This also explains the rough writing. I have to note here that I've red several times posts from the forum masters asking people to write rough/short/half-baked posts as it is much preferable than not writing them at all.</p>\n", "parentCommentId": "MFRnhDj2ATKpHoBuB", "user": {"username": "mikbp"}}]