[{"_id": "BFdR6TjCKpnmndywf", "postedAt": "2023-02-23T00:43:39.187Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Thanks for creating this. Insects matter and it's to humanity's credit that despite them having little power we care about them anyway. Also, cool logo and props that your org doesn't contain the words good or effective.<br><br>\"Huh, they could have called it Bughouse\" <a href=\"https://forum.effectivealtruism.org/users/katja_grace?mention=user\">@Katja_Grace</a>&nbsp;</p><p><i>Bughouse is a 4 player chess variant popular among nerds and billionaire fraudsters.</i></p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "bGuv4HgroJmBqCG4q", "postedAt": "2023-02-23T06:52:58.000Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Excited to see what comes from here!</p>\n", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "Lihzjh82iyLfCYBk2", "postedAt": "2023-02-23T08:02:22.330Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>I'm really excited for this. Wishing you all the best in this crucial and neglected work Dustin.</p>\n<p>Please make sure to reach out to Anima International to use our resources whenever you'll feel like we could help. We will also happily advertise any open positions here to our staff.</p>\n", "parentCommentId": null, "user": {"username": "Jakub Stencel"}}, {"_id": "GLnc28qyvis9gfRJR", "postedAt": "2023-02-23T08:15:29.337Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Really important and exciting! Good luck!</p><p>Looking a bit at your website, and the description here, it isn't clear to me how core is the focus on insect welfare compared to other considerations. Do you have a strong position on the matter? E.g. do you oppose or support insect farming?&nbsp;</p><p>(I guess this could also be a strategic choice to collaborate with the existing ecosystem)</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "MC6iqnrf8EmHR7brr", "postedAt": "2023-02-23T10:47:37.691Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Thank you for your initiative! I've been hoping for a while to see this kind of organisation emerge, as it's an issue that is becoming more and more worrying. For example, here in France, insect farming has been developing very rapidly for a few years, with two start-ups in particular having raised several hundred million euros and benefiting from strong government support.</p>\n<p>If you are interested in the environmental aspect of insect farming, please feel free to contact me. I have done a lot of research into the scientific literature on the subject and have written several articles in the French media to temper the enthusiasm and promises made by the promoters of insect consumption, and I am currently writing a paper that will also address this issue.</p>\n", "parentCommentId": null, "user": {"username": "Tom Bry-Chevalier"}}, {"_id": "A4mmRns4AWQgSSfsH", "postedAt": "2023-02-23T11:39:25.474Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>This is so exciting! Are you coming to EAG London too?</p>\n", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "kozFDv97oXvTbBaH9", "postedAt": "2023-02-23T12:08:31.432Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Are you assuming that the insect industry will grow rapidly and that your organization has chosen to work exclusively with the industry/governments/policymakers to ensure the highest possible animal welfare standards? I'm curious to know if you have researched alternative intervention strategies before deciding on this particular approach. Is it safe to assume that this trend is inevitable, and that it's impossible to halt the industry's growth by launching campaigns targeting people's aversion to insects as a food source (or similar)? So have you explored methods to stop this practice altogether, or are you from the get-go primarily focused on animal welfare?</p>", "parentCommentId": null, "user": {"username": "Ula"}}, {"_id": "gynGihKYTLC4SRoK3", "postedAt": "2023-02-23T12:09:25.776Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>P.S. I am also very excited to see the first organization working on insects, especially coming from an evidence-based and cost-effective framework.&nbsp;</p>", "parentCommentId": "kozFDv97oXvTbBaH9", "user": {"username": "Ula"}}, {"_id": "7xbPRQD7WP79wgagq", "postedAt": "2023-02-23T14:32:42.686Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>I'm really looking forward to hearing more about the TII and how other orgs might support or collaborate with you.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Andres Jimenez"}}, {"_id": "o4Ls9eXqLQAGzSsw7", "postedAt": "2023-02-23T20:33:41.232Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Wonderful name. Congratulations, full send!</p>", "parentCommentId": null, "user": {"username": "Dean Guzman Wyrzykowski"}}, {"_id": "YcvnE3oaYxfxQyevY", "postedAt": "2023-02-23T21:15:54.423Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Hey Dustin,</p>\n<p>It’s so awesome that you’re working on this important issue!</p>\n<p>Please take the below comments in a spirt of constructive challenge, and with huge respect for your work on this topic!</p>\n<p>From your website, it looks like you’ve chosen to go for a very “welfarist” approach, of basically accepting that insect farming will happen, and trying to make it cause a bit less suffering.</p>\n<p>But, given the nascent/early stage of insect factory farming, isn’t there a strong case that we should try to <em>block/delay</em> the development of this new form of factory farming? It seems like there is so much that could be done, in relation to regulation, trying to discredit insect factory farming among policymakers/environmentalists/the public, etc. We are at the early stages of this industry and it feels like we may still have time to decisively alter the trajectory of it.</p>\n<p>Going straight for a super “soft”, welfarist approach feels like potentially a major missed opportunity .</p>\n<p>Given the tiny amount of resources we have to play with, getting this call right is key.</p>\n<p>It would be great to hear whether you systematically considered and worked through the arguments in favour and against trying to actually block/slow the development of insect factory farming, before deciding on your current approach?</p>\n<p>If so, please would you be willing to share those arguments?</p>\n<p>If not, would you be willing to pause for a moment and think this through with folks from the community?</p>\n<p>Imagine that we were in the 1950s/60s, and had had the opportunity to try to fundamentally alter the development trajectory of factory farming. Wouldn’t it have been better if we’d at least <em>tried</em> to really stop it then, rather than pivoting straight to “please be a bit kinder to the animals as you ‘farm’ them”?</p>\n<p>Another question on a separate note:</p>\n<p>If your org is determined to play “good cop” with the insect factory farming industry, do you think there is space for a different body to play “bad cop”?</p>\n<p>Again - please take these comments in the spirit of constructive debate in which they are intended. Maybe, of course, your approach is right. It just feels like testing this is really important.</p>\n<p>Wishing you all the best as we try to figure out how to do the most good here :) :)</p>\n", "parentCommentId": null, "user": {"username": "Forumite"}}, {"_id": "odartQpuD5D9RmGX5", "postedAt": "2023-02-24T19:36:34.599Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>That's the plan!</p>", "parentCommentId": "A4mmRns4AWQgSSfsH", "user": {"username": "Dustin Crummett"}}, {"_id": "zqAMiJFyaL9KxidvM", "postedAt": "2023-02-24T19:55:05.388Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Hi Forumite! Very happy to discuss (with you or anyone else reading) via email, DM--or better yet, call (https://calendly.com/dustin-crummett), or, if you'll be at EAG Bay Area, EAGx Nordics, or EAG London, or happen to be near Seattle, &nbsp;in person.</p>", "parentCommentId": "YcvnE3oaYxfxQyevY", "user": {"username": "Dustin Crummett"}}, {"_id": "tTKhBYrgFLpkAqwpL", "postedAt": "2023-02-24T19:59:26.705Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Hi Ula!<br><br>As I just wrote to Forumite above: very happy to discuss (with you or anyone else reading) via email, DM--or better yet, call (https://calendly.com/dustin-crummett), or, if you'll be at EAG Bay Area, EAGx Nordics, or EAG London, or happen to be near Seattle, &nbsp;in person.</p>", "parentCommentId": "kozFDv97oXvTbBaH9", "user": {"username": "Dustin Crummett"}}, {"_id": "Zuhx4xAxsrZ9Rwhtt", "postedAt": "2023-02-24T20:52:35.408Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Nice one - thanks for your willingness to engage on this, Dustin. I’ve DM’d you…:)</p>\n", "parentCommentId": "zqAMiJFyaL9KxidvM", "user": {"username": "Forumite"}}, {"_id": "daQjB9k3AEawuYRxu", "postedAt": "2023-02-25T00:19:06.486Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>I hate to be a pessimist, but have you thought about branding this differently? I’d argue a less open approach with some sort of acronym that has a little obfuscate would be better.</p>\n<p>It’s literally a meme among many anti intellectual circles to say “I will not eat the bugs” - the idea being technical/liberal/Silicon Valley folks want to force normal people to eat bugs. Obviously this type of thinking is hyperbolic and ridiculous, but I worry that naming this org the Insect Institute creates a needlessly large attack surface for animal welfare, and by extension EA.</p>\n<p><a href=\"https://amp.knowyourmeme.com/memes/i-will-not-eat-the-bugs\">https://amp.knowyourmeme.com/memes/i-will-not-eat-the-bugs</a></p>\n", "parentCommentId": null, "user": {"username": "Wil Perkins"}}, {"_id": "yGPpdBshqLQahaxpr", "postedAt": "2023-02-25T00:41:52.204Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Not eating bugs is a win! People who already aren't going to do this are not a group we need to reach.</p>", "parentCommentId": "daQjB9k3AEawuYRxu", "user": {"username": "Linch"}}, {"_id": "BGzTEThf2Qf3kymf3", "postedAt": "2023-02-25T00:47:56.466Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>True…. But as soon as the wrong group catches wind of this, it could turn into a powerful meme to demonize this sort of thinking.</p>\n<p>In the spirit of weirdness points, it may be better not to be too blatant about the fringe of animal welfare arguments until public consensus has shifted farther. Perhaps I’m being too pessimistic, full disclosure I do not find insect welfare a compelling line of reasoning.</p>\n", "parentCommentId": "yGPpdBshqLQahaxpr", "user": {"username": "Wil Perkins"}}, {"_id": "KsFQ6beuxqs6CXraN", "postedAt": "2023-03-03T19:38:47.004Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Awesome work, Dustin! So glad that this exists.</p>", "parentCommentId": null, "user": {"username": "Damin Curtis"}}, {"_id": "vTP7ahgfbXD5JEien", "postedAt": "2023-03-07T09:41:06.143Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Excited you are working on this! I have been thinking about this topic from a corporate campaigns angle. Will be in touch to talk about it.</p>", "parentCommentId": null, "user": {"username": "Jonas Becker"}}, {"_id": "FBbxx6jF3jBYX2q6i", "postedAt": "2023-03-12T15:19:16.253Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<p>Very late to the party here, but I definitely strongly agree with this constructive critique. One of the strongest reasons that corporate welfarist work has had some success in the US and EU is that those regions have very strong pre-existing land animal farming industries. So the logic of trying to make them better is defensible.</p><p>New industries, on the other hand, have extensive uncertainty. And so trying to stave off the farming all together could be a much higher \"reward\" endeavor than assuming it's destined to exist (e.g., see some recent wins in preemptive banning of octopus farming).&nbsp;</p><p>But nonetheless, I look forward to seeing this work.&nbsp;</p>", "parentCommentId": "YcvnE3oaYxfxQyevY", "user": {"username": "GreenByrdhouse"}}, {"_id": "bCr7C3MhoB5so6cvZ", "postedAt": "2023-11-28T19:21:42.016Z", "postId": "Bsdq5wK63vLEB3Gqg", "htmlBody": "<blockquote><p>We will also happily advertise any open positions here to our staff.</p></blockquote><p>Super late reply, but this felt unusually generous / collaborative — this sort of alliance mentality is one of the things I like most about EA (the fact that we are broadly speaking on the same team, and that getting good things done is more important than WHO gets to do the good &lt;3 )</p>", "parentCommentId": "Lihzjh82iyLfCYBk2", "user": {"username": "Angelina Li"}}]