[{"_id": "4SjQNEyGnobPmaNF4", "postedAt": "2022-09-21T15:09:43.750Z", "postId": "BsMrBFMCkgjmBcSec", "htmlBody": "<p>This is another nice piece of work looking at this problem, where cost of sequencing is factored in and they are working with pooled samples under different strategies: <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4164148\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4164148</a>&nbsp;</p><p>The major issue with a lot of this work is how you could identify a novel pathogen and know it's a pathogen. It's not just about detecting something before it gets recognised as an outbreak, it's also about that info being actionable - if you don't know if something is a human pathogen or how it spreads and the only thing to do once an alert is raised is wait to see if clinical cases start showing up in hospitals, it's not much of an early warning system.&nbsp;</p><p>An alternative is to look at airplane waste, since you've got a higher probability that whatever you find came from a human, and you have a list of people to track down and see if they have mild symptoms of illness that haven't reported or asymptomatic infections. You also have info on where the disease has been imported from, which can again give you more info on what to do next.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Nicole Wheeler"}}, {"_id": "K2mdo6xSmSR5yBhEw", "postedAt": "2022-09-22T13:03:29.125Z", "postId": "BsMrBFMCkgjmBcSec", "htmlBody": "<p>Thanks, great to see how sequencing wastewater may eventually help us stop a pandemic. Great work!</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "RuXEPJnY7h4YAiy2N", "postedAt": "2022-09-23T13:25:58.290Z", "postId": "BsMrBFMCkgjmBcSec", "htmlBody": "<blockquote>\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4164148\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4164148</a></p>\n</blockquote>\n<p>Finally got a chance to finish reading the paper!  I don't entirely understand it, though:</p>\n<ul>\n<li>\n<p>I think they're modeling prevalence as initially constant and then sharply transitioning to an increase of 5% per year.  In thinking about infections in the cases I'm familiar with (people and wild populations) this sounds very unlike real spread, which is exponential initially (or the sum of an exponential and a constant if you're observing something new growing to exceed some background).  Is their model more realistic for farmed animals, or is this just highly simplified?</p>\n</li>\n<li>\n<p>It looks to me like maybe the statistical method they're using relies on this clear transition between a linear constant regime and a (very nearly) linear increasing regime, and so if the model is overly simplified (above) then their results will be too optimistic about detection. (See Figure 2 on p4 of the <a href=\"https://drive.google.com/file/d/1NZyRTbJXkSCaS0BcPu6xCBgV6tNnKw5R/view\">supplementary materials</a>.)</p>\n</li>\n<li>\n<p>They talk about being able to detect entirely novel antibiotic resistance genes (scenario 3), but I don't see anything in the paper about how they know to track a particular novel gene to see if it's an antibiotic resistance one?  Is the idea that once you do realize you care about a gene you can go back and re-analyze the sequencing data you've been collecting to learn how quickly it has been spreading?</p>\n</li>\n</ul>\n<blockquote>\n<p>how you could identify a novel pathogen</p>\n</blockquote>\n<p>I've been working on simulating exponential growth detection: count how many times each k-mer (I've been using 40-mers) occurs on each day, and then run Poisson regression to see whether this looks like an exponential increase and how good the fit is.  It works, though as discussed in this post the signal for novel viruses is likely to be extremely weak and so enough sequencing gets expensive.</p>\n<blockquote>\n<p>and know it's a pathogen</p>\n</blockquote>\n<p>Yes, that's also an important part of the problem.  In some cases I think it would be clear how much of a problem it was simply from looking at it and seeing how close various parts are to matching known things (which could be automated if we're getting lots of them).  But yes, in others it would be pretty hard to judge how seriously to take it.</p>\n<blockquote>\n<p>if you don't know if something is a human pathogen</p>\n</blockquote>\n<p>That one seems manageable: once we recognize that something is spreading in particular areas we could use more targeted and cheaper methods, like random sampling of hospital arrivals and qPCR.</p>\n<blockquote>\n<p>how it spreads</p>\n</blockquote>\n<p>I think how it spreads is probably smaller than the other concerns.  Yes, if we had more details we could make a more targeted response, but general responses like lowering thresholds for wearing PPE, ramping up PPE production, ramping up testing ability and developing cheap targeted tests, reducing some forms of non-essential activity, etc would still make sense.</p>\n<blockquote>\n<p>wait to see if clinical cases start showing up in hospitals, it's not much of an early warning system.</p>\n</blockquote>\n<p>As above, I think there are a bunch of things you can do aside from waiting to see if people show up in hospitals, but even then it's much cheaper to check for in hospitals if you know specifically what you're looking for.</p>\n<blockquote>\n<p>An alternative is to look at airplane waste...</p>\n</blockquote>\n<p>Yes, I think airplane waste is very promising, though the statistics are likely much trickier because of the small numbers (small numbers of fliers, small number of fliers using the in-flight toilets).  I'd like to see exploration of both (and also sentinel populations) to see how they compare.</p>\n<p>Plus, depending on your sampling system, you may not have plane-level data.</p>\n<p>(Writing for myself, not the NAO)</p>\n", "parentCommentId": "4SjQNEyGnobPmaNF4", "user": {"username": "Jeff_Kaufman"}}]