[{"_id": "j4fdxSBH8JkDfXYvr", "postedAt": "2015-07-26T21:26:57.607Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<p>Interesting post. This data seems helpful, but it's probably not worth gathering constantly - maybe on an annual basis or something. Of course, then there are representativeness issues. I would think an online survey would be less effective, but there might be a way to automate this using some software. I don't think Hootsuite can do it but some other app for automating Facebook posts and messages could help.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "SEkJ7TrPduRT3nyb4", "postedAt": "2015-07-26T23:21:11.316Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<p>Thanks for writing this up! It's very useful to be able to compare this to census data. Did you use the same/similar message for everyone? If so, I'd be interested to see what it was. This sort of thing would also be useful to a/b test to refine it. There is also the option to add people manually, bypassing the need for admin approval; did you contact these people too? </p>\n", "parentCommentId": null, "user": {"username": "Peter McIntyre"}}, {"_id": "FabQvf4tDXcSoXro4", "postedAt": "2015-07-27T01:09:11.340Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<p>We used: </p>\n<p>&quot;Hey, welcome to the Effective Altruism facebook group! If you have a moment, would you mind telling us where you first heard about EA?</p>\n<p>Thanks!</p>\n<p>Claire</p>\n<p>(moderator)&quot;</p>\n<p>We are considering a/b testing some new questions, and would love suggestions on different phrasing. </p>\n<p>And when someone in the group adds a new member, we still have to approve them.  We messaged them as well.  </p>\n", "parentCommentId": "SEkJ7TrPduRT3nyb4", "user": {"username": "ClaireZabel"}}, {"_id": "r9Rt6kByr9dndn6Ay", "postedAt": "2015-07-28T00:42:51.029Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<p>Thank you for sharing! I think a/b testing this seems like a really good idea. Even just testing the way you are phrasing the question opposed to testing other questions. A static online survey would definitely cut down on the time investment since it will collect all the data for you, however it will definitely cut into your response rate (more clicks = more work).</p>\n<p>It seems like continuing to gather this information over the course of all the EA Global meetings and the launch of Will's book would be valuable due to the likelihood of continued rapid growth. Past that it would be more useful to focus on using the data opposed to collecting it.</p>\n<p>Right now across both surveys it looks like LW and word of mouth are the best recruiting tools. Continuing to enacting marketing strategies across those two platforms seems like the best course of action. Meaning we should probably be encouraging new members to tell their friends and invite them to meetings. It also seems like a great idea to keep messaging some people to reinforce the welcoming feeling and also because people that have been referred by word of mouth will likely appreciate and need a one-on-one interaction to stay interested or motivated. </p>\n", "parentCommentId": null, "user": {"username": "SydMartin"}}, {"_id": "5mRczNC3xfFDgwokQ", "postedAt": "2015-07-28T01:27:41.460Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<blockquote>\n<p>A static online survey would definitely cut down on the time investment since it will collect all the data for you, however it will definitely cut into your response rate (more clicks = more work).</p>\n</blockquote>\n<p>It'd be interesting to test that - one factor which will cut the other way is that some people are more comfortable answering an online survey (often selecting preset answer options) rather than getting into a discussion with another human being.</p>\n", "parentCommentId": "r9Rt6kByr9dndn6Ay", "user": {"username": "Tom_Ash"}}, {"_id": "MKKpEPXr3wiFTbcZ2", "postedAt": "2015-07-28T02:59:52.053Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<p>Tying this into the EA census sounds like a good idea as it'd provide a helpful additional subsample, at least for some subset of questions.</p>\n", "parentCommentId": null, "user": {"username": "number42"}}, {"_id": "HAaNsAbN2frKb8v5m", "postedAt": "2015-07-28T05:41:16.572Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<blockquote>\n<p>We are considering a/b testing some new questions, and would love suggestions on different phrasing.</p>\n</blockquote>\n<p>How about using different questions from the EA Census? There was already a big community discussion on what suggestions to include on that, on this forum I think.</p>\n", "parentCommentId": "FabQvf4tDXcSoXro4", "user": {"username": "jayd"}}, {"_id": "49fryY7CcNxeztqJ7", "postedAt": "2015-07-28T17:46:31.911Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<p>Let me know if you're expecting a surge of Facebook joins (as a result of the Doing Good Better book launch and EA Global) and want help messaging people.</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "8sZafa6wijrXrMfKo", "postedAt": "2015-08-26T19:51:27.274Z", "postId": "BsMvWRmEKMv2eAKnk", "htmlBody": "<p>Thanks for posting this. I compared this to the data we got from a random sample of the EA Facebook group myself as well.  I don't know whether your comparisons above are to our overall results or just the random sample of Facebook we did?</p>\n<p>First points re. comparison:</p>\n<ul>\n<li>Our data is slightly different from each others because you allowed people to select more than 1 place as &quot;where you first heard about EA&quot; whereas we allowed only 1. (We allowed more than 1 option for our &quot;which helped get you more involved in EA question) This might skew things a bit.\n-It also meant that I had to adjust your numbers a bit to be able to compare %s.\n-Comparing our numbers is also quite difficult to do because our categories don't line up. For example, nearly 40% of your responses were &quot;Other&quot; which didn't come up at all in ours (mostly options with quite small numbers too).\n-To make our data a bit more easily comparable I shoved a few categories together (for example, I included &quot;colleague&quot; and &quot;family&quot; in &quot;friend&quot;)\n-Our results agree on ACE/AR being very low numbers</li>\n</ul>\n<p>Comments on the actual data:\nI basically agree that there were some significant differences but overall not enormous divergence.</p>\n<ul>\n<li>LessWrong, as you note, is not the biggest point of divergence. (~10% vs ~20%)\n-GWWC is probably the biggest difference: 14% for us and basically a complete absence for you (&lt;1%). I don't think that can be explained by any simple sampling bias (of the kind people posited for LW)\n-Relatedly we had double the 80K responses you did.\n-You had twice as many Singer responses; but our category was (TED) Singer, so I think some of our general Singer responses may have ended up in TLYCS (or Other, maybe), so our Singer+TLYC scores are pretty similar 8% v 9%.</li>\n</ul>\n<p>What to make of the GWWC/CEA wipeout? (For us CEA and LW had basically equal influence, for you the ratio was 2:1 in favour of LW). I would guess the most likely explanation is timing. There was only year between our survey's (results being published), but we were randomly sampling members of the FB group, whereas you were only asking <em>new</em> members. So we'd have sampled a lot of people who're members of the group and have been EAs for a few years, whereas you are sampling solely new people. People involved in EA from close to the beginning will plausibly be much more likely to have heard of it from GWWC. New people, it seems, much less so. (Even if you include EAG and local groups and Will and Tyler personally <em>all</em> in CEA- which would be unreasonable anyway- the numbers don't jump that much). So it seems plausible that CEA is much less of an influence, as a proportion, than it was in the early years. It will be interesting to see if this trend continues and is reflected in our new survey.</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}]