[{"_id": "CHHyMgtnvE3fDjnpP", "postedAt": "2022-09-07T20:51:47.119Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>These are amazing results guys, well done!</p><p>How did you select which companies you worked with?</p>", "parentCommentId": null, "user": {"username": "jlewars"}}, {"_id": "CpZndE7eHRebL52MM", "postedAt": "2022-09-08T06:58:02.562Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>It seems like these are amazing results and not so much effort. Very impressive.</p>", "parentCommentId": null, "user": {"username": "Ula"}}, {"_id": "yt7uZjmgLMWrrLZ7h", "postedAt": "2022-09-08T14:11:34.148Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>That's a fantastic outcome, congratulations!</p><p>Feedback on the data analysis: I find the 90% confidence interval to not be very informative in some situations. For example in the case of \"Computing the ratio of money raised to time spent, we arrive at an average of 786 USD per hour (CI 7 USD to 3,100 USD)\", the CI range is very broad and I only really take away 'there was high variance in the data' or 'there weren't many data points' or both. In this situation, it's both and it's relatively clear to see from the figures.&nbsp;</p><p>I'm unsure what would be more informative. Maybe a <a href=\"https://en.wikipedia.org/wiki/Box_plot#/media/File:Michelsonmorley-boxplot.svg\">box plot</a> of the direct work hourly rate and your hourly rate calculations could be a good way to visualise the uncertainty. A statistical test to compare the means of the two distributions (direct work and fundraising) could also be interesting but maybe there's too much variance and too few data points in the fundraising data for now.&nbsp;</p><p>It would also be interesting to see the maximum and minimum money raised per hour of time values.</p><p>Regardless, it's a great result and I look forward to hearing how the 2022 season goes!</p>", "parentCommentId": null, "user": {"username": "Sean Lawrence"}}, {"_id": "qcFtdBCbSysfDvP7e", "postedAt": "2022-09-11T14:52:15.793Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>Hi Jack, thanks for your comment. &nbsp;2021 was a smaller-scale pilot for HIP and we worked primarily with EAs at companies that were already in our network as well as with EAs/companies that approached us for assistance. For 2022 we hope to scale up and support more EA working professionals in running fundraising events.</p>", "parentCommentId": "CHHyMgtnvE3fDjnpP", "user": {"username": "Federico Speziali"}}, {"_id": "xoGQ7Bp5FTsdEg2oX", "postedAt": "2022-09-11T14:53:17.091Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>Hi Sean, thanks for your comment and your feedback. I think you are correct on both accounts, more data would definitely increase our confidence in the results even further and the distribution has a high variance due to its heavy tailed nature (which is not uncommon when looking at donations data). &nbsp;Good idea also on doing statistical tests to compare distributions.</p>", "parentCommentId": "yt7uZjmgLMWrrLZ7h", "user": {"username": "Federico Speziali"}}, {"_id": "fuEaJCeriiWqcG75i", "postedAt": "2022-09-11T14:53:35.288Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>Thanks Ula! Indeed we think it is a very cost-effective way for EA working professionals to multiply their impact and build some career capital in the process.</p>", "parentCommentId": "CpZndE7eHRebL52MM", "user": {"username": "Federico Speziali"}}, {"_id": "qR85irz8j8CdDTDM7", "postedAt": "2022-09-17T23:13:24.822Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>Can you show/share your computations of the confidence intervals? Also, less than 95% intervals might be relevant. (Maybe Dm me if you want to discuss?)</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "38NAKf5GtJPWhro2s", "postedAt": "2022-09-21T23:41:27.666Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>Meanwhile, I did a few calculations based on inputting the numbers as eyeballed from your graphs. The very wide CIs do seem plausible, I also calculated wide 95% CIs with both the normal approx and with bootstrapping ... so I'm not saying you made an error.</p>\n", "parentCommentId": "qR85irz8j8CdDTDM7", "user": {"username": "david_reinstein"}}, {"_id": "Q6A4qziWiiJ4CZbEf", "postedAt": "2022-10-04T17:38:37.107Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>Thanks for sharing, Federico!</p><p>Could you elaborate on how you estimated the counterfactual money raised? In particular, what is your estimate for the counterfactual donations as a fraction of the total donations? The best guess from <a href=\"https://docs.google.com/spreadsheets/d/1kY5Ht4MbjebkomK1GNkqI4LpJYd0j4GzvjQTzNxwLKY/copy\">this</a> model (presented <a href=\"https://forum.effectivealtruism.org/posts/n2Y7z5wvjTuNn5TYg/cost-effectiveness-of-rc-forward\">here</a>) is 19.6 % (= E5/K7 from tab \"CEA\").</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "v35LsBa9yxDJ45eFn", "postedAt": "2022-10-25T14:40:20.796Z", "postId": "bsqtndpfKbcbQRFEs", "htmlBody": "<p>As per our conversation, can you please update the text (and add  a 'crossout') perhaps to reflect that you have reported the 95% ranges of the <em>observed</em> data and not 95% confidence intervals?</p>\n<p>I think it's important to get and state our statistics right, for promoting epistemics, statistical literacy, and an empirically-driven environment among the EA community.</p>\n<p>(I really appreciate the work you have done on this by the way)</p>\n", "parentCommentId": "38NAKf5GtJPWhro2s", "user": {"username": "david_reinstein"}}]