[{"_id": "GaGdAaR3qGkc7i2u6", "postedAt": "2022-10-14T21:02:31.639Z", "postId": "btJWbzqrD8K9cz58X", "htmlBody": "<p>I think you're asking some important questions. In my view, this is the most critical thing you've written in the comments:&nbsp;</p><blockquote><p>So when I see an answer like “I think people [at EA] try pretty hard [… to be rational]”, I find it unsatisfactory. Trying is good, but I think planning for failures of rationality is needed. Being above average at rationality, and trying more than most people, can actually, paradoxically, partly make things <i>worse</i>, because it can reduce how much people plan for rationality failures.</p></blockquote><p>We may disagree, but I think looking for a formal debate methodology is a distraction from this more important fundamental question. I don't consider it a promising way to approach the problem above and I suspect others feel similarly.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "5Cty4JTTyzpLybwpP", "postedAt": "2022-10-14T23:18:12.994Z", "postId": "btJWbzqrD8K9cz58X", "htmlBody": "<p>Do you know of any criticism of using structured debate methods that I could read?</p>\n", "parentCommentId": "GaGdAaR3qGkc7i2u6", "user": {"username": "Elliot Temple"}}, {"_id": "MjfTgX75uCCpEF7q7", "postedAt": "2022-10-15T02:44:07.650Z", "postId": "btJWbzqrD8K9cz58X", "htmlBody": "<p>Sorry, no. I don't think I'll be able to sum up my views well quickly either, but here's a little effort: While there are no doubt improvement in debate methods possible, it's unlikely format changes will make a significant different to elements like who determines what debates are had, what debates are seen as productive and not, what incentives people have during the debate, how they affect decision making, etc.&nbsp;</p>", "parentCommentId": "5Cty4JTTyzpLybwpP", "user": null}, {"_id": "yHspwASNNHretXDpb", "postedAt": "2022-10-16T17:12:10.223Z", "postId": "btJWbzqrD8K9cz58X", "htmlBody": "<p>My summary of the answers I got to my question:</p>\n<blockquote>\n<p>EA lacks formal rationality policies, but individuals informally do many things to try to be rational and the community as a whole tries to encourage rationality.</p>\n</blockquote>\n<p>This is intended to be a statement that EAers would agree with. Please let me know if you disagree.</p>\n", "parentCommentId": null, "user": {"username": "Elliot Temple"}}, {"_id": "cKuHN2iHJvXpMuNSs", "postedAt": "2022-10-16T17:25:58.237Z", "postId": "btJWbzqrD8K9cz58X", "htmlBody": "<p>If you read the partial list of issues that I think a debate methodology should address, in my <a href=\"https://forum.effectivealtruism.org/posts/37byNFAMEfbLNPXdm/debate-with-rational-methodology\">first question</a>, you'll see that it's not merely format but also issues like who (or what policies) determine what debates are had (a.k.a. starting conditions). The elements you list and imply are more important are actually some of the things I want a debate methodology to address. I agree that those are important.</p>\n", "parentCommentId": "MjfTgX75uCCpEF7q7", "user": {"username": "Elliot Temple"}}, {"_id": "CjuSQXBBs9j8Qci3k", "postedAt": "2022-10-16T19:39:28.117Z", "postId": "btJWbzqrD8K9cz58X", "htmlBody": "<p>Makes sense. Part of what I think is that a debate methodology is of limited use for issues like the debate starting conditions, and much can be accomplished for rationality without any formal debate methodology, but I could be wrong.&nbsp;</p><p>Based on your other comments, I think we likely agree that sometimes formal rules and policies are not just important but essential; but when I think of those I'm not really thinking of debate methodology. Could just be a lack of imagination from my part though.&nbsp;</p>", "parentCommentId": "cKuHN2iHJvXpMuNSs", "user": null}, {"_id": "v7ob5uJuxz72dMhPx", "postedAt": "2022-10-17T06:04:25.144Z", "postId": "btJWbzqrD8K9cz58X", "htmlBody": "<p>I think this is a pretty good summary! One minor addition is that \"the community as a whole tries to encourage rationality\" suggests that this is a nice-to-have but not much effort has been put into this, but the reality is that the community has invested non-trivial resources into individual and collective rationality (e.g. funding LessWrong, Metaculus, Manifold Markets, QURI, etc).<br><br>Also <a href=\"https://forum.effectivealtruism.org/posts/WBjmN2eakezo5bn4v/?commentId=gixQMXL4syrGyiMJC\">relevant</a>.</p>", "parentCommentId": "yHspwASNNHretXDpb", "user": {"username": "Linch"}}]