[{"_id": "LEfsfQJDq4b3amknx", "postedAt": "2018-08-22T17:00:12.240Z", "postId": "BtptBcXWmjZBfdo9n", "htmlBody": "<p>Thank you so much for doing this! Is the total number of reactions just the number of likes and comments or does it also include shares? And if you happen to have more than the top 50 (as you hinted at <a href=\"http://effective-altruism.com/ea/1qn/open_thread_40/fbl\">here</a>), would you be willing to post just the links in a Google doc?</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "rJMn4TD4NWLtLtxWg", "postedAt": "2018-08-22T22:37:13.197Z", "postId": "BtptBcXWmjZBfdo9n", "htmlBody": "<p>This may be the best moment of my life :)  (no. 2 was leading the time I was top of the EA forum karma list...)</p>\n<p>Out of interest, could you out how many reactions these got? I'd be curious to see what the distribution of reactions is. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "qdMDpvRbcuAnt7sTo", "postedAt": "2018-08-23T04:16:42.786Z", "postId": "BtptBcXWmjZBfdo9n", "htmlBody": "<p>Ah I guess reactions is a bit ambiguous. By “reactions” I meant what Facebook calls “reactions”. This includes likes as well as the other options such as “love”, “haha”, “angry”, etc.</p>\n<p>Claire’s previous list was based on “likes” but that was back before the other “reactions” existed so this seemed like the best analogue. I didn’t take into account comments/shares for this list. (Though as stated above, hoping to put together a separate list ranked by comments.) I’ve edited the post for clarity.</p>\n<p>Great idea about sharing a larger list of links. <a href=\"https://docs.google.com/spreadsheets/d/1V1r7Cou_EUgYLU7HvGJXc5TujTOUS_oJrXdrpTSUNrw/edit?usp=sharing\">Here’s a Google Sheet</a> of all the posts with 50+ “reactions”. The post text/link titles will be a bit messy past the first 50. Enjoy!</p>\n<p>EDIT: Ugh. I made a sorting error at some point while making that spreadsheet and some of the links are mismatched. I've unshared it for now and will add to the post once fixed. Stand by :)</p>\n<p>EDIT 2: Updated the link above with the corrected sheet and also added to the body of the post. Should be all good now but feel free to leave a comment on it if you come across any link issues.</p>\n", "parentCommentId": "LEfsfQJDq4b3amknx", "user": {"username": "joel_duplicate0.5816669276037654"}}, {"_id": "YN9s7CoFCjCF8fGmg", "postedAt": "2018-08-23T04:58:55.675Z", "postId": "BtptBcXWmjZBfdo9n", "htmlBody": "<p>Haha happy to have contributed to your best moment. I guess you can (re)name your first born after me or something :P</p>\n<p>Sadly I don't have a break out of how many of each reaction per post (if that's what you mean). Only the total combined number of &quot;likes&quot;, &quot;loves&quot;, etc. per post. Although you can see that combined number in the spreadsheet I'll add to this post (once I fix it...see my reply to RandomEA).</p>\n<p>EDIT: Added the link to the updated google sheet in the post.</p>\n", "parentCommentId": "rJMn4TD4NWLtLtxWg", "user": {"username": "joel_duplicate0.5816669276037654"}}]