[{"_id": "PCiSkCsDYSpsCxtmu", "postedAt": "2022-12-04T02:36:47.775Z", "postId": "buEazpmcKJhM5KRGx", "htmlBody": "<p>Suppose the Speculation Grantors will consider a grant that is extremely risky. Suppose that grant has a 10% chance to be evaluated in the next round as far more beneficial than all the rest of the Speculation Grants of that round combined; and yet, the grant is net-negative (due to its potential to cause extreme accidental harm, which is not unlikely for extremely-impactful anthropogenic x-risk interventions).</p>\n<p>If in your implementation of <a href=\"https://survivalandflourishing.fund/speculation-grants\">\"impact futures\"</a> the \"fd_value\" of an impact certificate cannot be negative, then to the extent that a Speculation Grantor acts in a way that is aligned with maximizing their expected speculation grant budget, they may bet on that 10% chance and fund the risky intervention. Especially if they think that all the other Speculation Grantors will not fund it, thereby allowing their own budget to receive most of the \"settlement_budget\" (which seemingly exacerbates the <a href=\"https://forum.effectivealtruism.org/topics/unilateralist-s-curse\">unilateralist's curse</a> problem).</p>\n<p>I co-authored a <a href=\"https://forum.effectivealtruism.org/posts/74rz7b8fztCsKotL6/impact-markets-may-incentivize-predictably-net-negative\">post</a> about the general risk of impact markets incentivizing risky, net-negative projects. Please consider taking a look at it if you haven't already.</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "6QxvKJxHgfKpmqZhZ", "postedAt": "2022-12-09T22:38:45.464Z", "postId": "buEazpmcKJhM5KRGx", "htmlBody": "<p>Hi, Great you are doing this. I have what is hopefully a very quick question:</p><p><strong>What is your best guess as to when the next standard SFF grant round will be?</strong> Useful to know even if it is a very rough guess – could be helpful for deciding whether to consider applying or suggesting people short of funding apply for these grants or to wait for the next SFF round.</p><p>Thanks?</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}]