[{"_id": "ZzchJGMR4kQbQcWHe", "postedAt": "2018-01-31T15:41:02.953Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I also find it more instructive to think of it in terms of percentages -- the Global Development fund still holds 49% of all money it has received all time, the far future fund holds 95%, and the community fund holds 71%.</p>\n<p>There can definitely be good reasons for this (such as more merits for giving later vs. giving now, or saving up to give a larger grant in one big batch). I don't know whether it's an intentional application of one of those two things or just that Nick and Ellie are exceptionally busy and have more important priorities than the EA Funds, but it would be nice for more transparency as to why funds are distributed the way they are. (Lewis does a good job at this.)</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "JLQ7fcBREsgWDZ27f", "postedAt": "2018-01-31T17:50:49.969Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>Is the money held invested at all?</p>\n", "parentCommentId": null, "user": null}, {"_id": "gcQbKPyefhhqu4wPk", "postedAt": "2018-01-31T21:35:02.893Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I'll ask; will reply here when I get an answer.</p>\n", "parentCommentId": "JLQ7fcBREsgWDZ27f", "user": {"username": "HenryStanley"}}, {"_id": "7pS6ghgRTPACdsgRp", "postedAt": "2018-02-01T00:39:46.781Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I also feel that, perhaps not now but if they grow much more, it would be worth sharing the responsibility among more than just one person per fund. They don't have to disagree vociferously on many subjects, just provide a basic sanity check on controversial decisions (and spreading the work might speed things up if research time is a limiting factor) </p>\n", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "65DfJerNoEymJwshM", "postedAt": "2018-02-01T03:22:29.313Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>Minor typo: it's &quot;Elie&quot; not &quot;Ellie&quot;</p>\n", "parentCommentId": "ZzchJGMR4kQbQcWHe", "user": {"username": "Milan_Griffes"}}, {"_id": "h7Nt4HeMj85h5MjCR", "postedAt": "2018-02-01T20:27:17.501Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I think this definitely makes sense – though I wonder to what extent the fund manager has the discretion to appoint other fund managers?</p>\n<p>(Okay, it's a rhetorical question – they most likely have full discretion to do so – but it would be good if this was more clearly set out in the terms of the fund.)</p>\n", "parentCommentId": "7pS6ghgRTPACdsgRp", "user": {"username": "HenryStanley"}}, {"_id": "DFBht5Cw28gtSomHo", "postedAt": "2018-02-01T20:34:01.632Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>One issue is that the longer the fund holds on to donations, the more likely it is for the donor's intention and the fund's direction to diverge.</p>\n<p>I might donate to the Animal Welfare fund expecting the money will be handed out to vegan advocacy and clean meat charities (and trust the fund manager to pick the best ones amongst these), but if the money isn't disbursed for two years, well, maybe wild animal suffering research will be the new hotness by then, and that's where my donation will end up going.</p>\n<p>If I just want my donation to go to the expert's choice, then that might be fine. But if I had something more specific in mind (and in line with what the fund had recently donated to), this might not be ideal.</p>\n", "parentCommentId": null, "user": {"username": "HenryStanley"}}, {"_id": "r4D7oY8Cc3g42njaZ", "postedAt": "2018-02-01T21:38:25.815Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I've received feedback from multiple points in the community the EA Funds haven't been as responsive in as timely or as professional a manner as some would prefer. It appears a factor for this is that the fund managers are all program officers at the Open Philanthropy Project, which is a job which from the fund managers' perspective is most of the time more crucial than anything that can be done with the EA Funds. Thus, doing a more than full-time work-equivalent(?... I don't know how much Open Phil staff work each week) may mean management of the EA Funds gets overlooked. Ben West also made a recent post in the 'Effective Altruism' Facebook group asking about the EA Funds, and the response from the Centre for Effective Altruism (CEA) was they hadn't had a chance to update the EA Funds webpage with data on what grants had been made in recent months.</p>\n<p>Given that at the current level of funding, the EA Funds aren't being mismanaged, but rather are being more neglected than donors and effective altruists would like, I'd say it might already be time to assign more managers to the fund. Picking Open Phil program officers to run the funds was the best bet for the community to begin with, as they had the best reputation for acumen going in, but if in practice in turns out Nick, Elie and Lewis only have enough time to manage grants at Open Phil (most of the time), it's only fair to donors CEA assign more fund managers to the fund. What's more, I wouldn't want the attention of Open Phil program officers to be any more divided than it need be, as I consider their work more important than the management of the EA Funds as is.</p>\n<p>If the apparent lack of community engagement regarding the EA Funds is on the part of the CEA team responsible to keep the webpage updated, as their time may also be divided and dedicated to more important CEA projects than the EA Funds at any given point in time, that needs to be addressed. I understand the pressures of affording enough money to project management it gets done very effectively, while as an effective non-profit not wanting to let overhead expand too much and result in inefficient uses of donor money. I think if that's the case for CEA staff dividing their time between EA Funds and more active projects, it'd be appropriate for the CEA to hire a dedicated communications manager for the the EA Funds overall, and/or someone who will update the webpage with greater frequency. This could probably be done at 1 full-time equivalent additional staff hire or less. If it's not a single new position at the CEA, a part-time equivalent CEA staffer could have their responsibilities extended to ensuring there's a direct channel between the EA Funds and the EA community. </p>\n<p>In the scope of things, such as the money moved through EA overall, EA Funds management may seem a minor issue. Given it's impact on values integral to EA, like transparency and accountability, as well as ensuring high-trust engagement between EA donors and EA organizations, options like I've listed out above seem important to implement. If not, overall, I'd think there's greater need for adding external oversight to ensure anything is being done with the EA Funds.</p>\n", "parentCommentId": "7pS6ghgRTPACdsgRp", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "NzcTm7N3mPCNZugc7", "postedAt": "2018-02-02T03:15:13.327Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I wanted to quickly answer a few questions about the Global Development Fund.</p>\n<p><strong>How quickly do I expect to allocate funds in the future?</strong></p>\n<p>I'm planning to consider allocating funds each time GiveWell allocates the funds it has received for granting at our discretion (by donors who choose to give to &quot;Grants to recommended charities at GiveWell's discretion&quot;). We normally allocate these funds four times each year, though the exact schedule can vary depending on staff capacity. My best guess is that, going forward, I'll allocate at the same time as GiveWell and likely follow GiveWell's allocation because we expect that our top charities will have more room for funding than we are able to fill with our discretionary funds.</p>\n<p>This page shows how we've allocated funds given to us for granting at our discretion in the past: <a href=\"https://www.givewell.org/about/FAQ/discretionary-grantmaking\">https://www.givewell.org/about/FAQ/discretionary-grantmaking</a>.</p>\n<p><strong>What are the pros and cons of giving to this fund vs. (a) giving to GiveWell for granting at our discretion or (b) giving directly to one of GiveWell's top charities?</strong></p>\n<p>Pros:</p>\n<ul>\n<li><p>Giving to this fund could result in donations going to opportunities that I believe are more cost-effective than GiveWell's top charities because I can direct them to more speculative opportunities.  I think this possibility is relatively unlikely in the near-term. Good Ventures, a large foundation with which we work closely, has supported GiveWell's Incubation program (<a href=\"https://www.givewell.org/research/incubation-grants)\">https://www.givewell.org/research/incubation-grants)</a>, our work to support the development of future top charities, in the past, and I think it's likely that it will support more speculative opportunities we identify and believe to be more cost-effective than our top charities. To be clear, it's possible that we find opportunities that we believe are outstanding and Good Ventures won't support them, or that we find so many opportunities that it exceeds Good Ventures appetite for Incubation Grants, but I think that's relatively unlikely to happen in the near future.</p>\n</li>\n<li><p>Giving to this fund signals an interest in more speculative opportunities. It's helpful to me to know that there's significant interest in giving to global health and development opportunities that may not meet GiveWell's criteria. Some donors signal that interest by emailing / talking to me or others at GiveWell, but giving to this fund is a good way to directly signal that preference.</p>\n</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>GiveWell has a fairly developed process for (a) answering questions that come in from donors and (b) proactively reaching out to donors to see if they have questions. Because EA Funds don't flow directly through us, EA Funds donors aren't part of that process. in my opinion, that gives those donors a worse donation experience than they'd have if they gave through GiveWell and gives us less ability to follow up with them and learn about their values and goals with their giving.</li>\n</ul>\n<p><strong>A request</strong></p>\n<p>If you're a donor to the fund and have preferences about (a) and (b) below, please let me know. I don't have information about the fund's donors or their preferences. Would you prefer that I:</p>\n<ul>\n<li><p>allocate money held in this fund when GiveWell allocates its funds unless I have another specific opportunity in mind.</p>\n</li>\n<li><p>retain some funding (perhaps ~$500k) in case I identify something that I can't easily fund otherwise.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "ElieHassenfeld"}}, {"_id": "jdLA2yJPK5jP4hicm", "postedAt": "2018-02-08T20:32:51.223Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I understand the desire of the fund to ensure the money is being handed out optimally, but there's two issues that worry me. First, like investing, there is often a compounding effect to altruism - you help someone locally and they are able to improve the local economy, help others, etc. We may be missing out on the benefits of donating now the current fund system. While there is an argument for giving later vs giving now, Assuming the money isn't properly invested and compounding (it may well be), then we're certainly losing out. People would be better off investing the money and giving it when people are ready to receive it.</p>\n<p>Another issue is that by giving large grants there's a greater risk than many small donations. Over or underestimated project costs, inefficiencies, and the like contribute to a chance a donation ends up misallocated or wasted. These mistakes will certainly happen, but with large one-time grants, the risk is larger. Isn't the whole point of the fund to diversify and reduce risk and inefficiencies?</p>\n<p>It seems like it's less risky and more efficient to just donate directly to the charities in the index. In fact, couldn't the fund just list where they recommended donations go at any given moment?</p>\n", "parentCommentId": null, "user": {"username": "turnercore"}}, {"_id": "SXkFqyfqPLPTQFaJx", "postedAt": "2018-02-08T21:00:02.576Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>Hi Elie, good to have some information on how you expect to allocate funds in future. My preference would be option (a), I can see why you might retain some funding, but I would like to see money invested fairly regularly- quarterly seems reasonable. I think $500k is too much to retain given the current fund size- hopefully if donors see regular donations, donations to ea funds will increase and you'd have more money available between allocations should you see opportunities.</p>\n", "parentCommentId": "NzcTm7N3mPCNZugc7", "user": {"username": "Allan_Saldanha"}}, {"_id": "NsHcp2eCjuhJnRye3", "postedAt": "2018-02-09T00:18:43.778Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>Can confirm that the funds are held as cash, not invested. </p>\n", "parentCommentId": "gcQbKPyefhhqu4wPk", "user": {"username": "HenryStanley"}}, {"_id": "Dd7k3cFTcWkJP7Wcc", "postedAt": "2018-02-10T07:16:21.716Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>This seems like a good point.  OpenPhil has <a href=\"https://www.openphilanthropy.org/blog/hits-based-giving\">previously</a> drawn analogies between the work it does and the work venture capitalists/angel investors do.  One big part of the job of an angel investor is to spend lots of time networking so as to become aware of new funding opportunities.  The fact that some fund managers are apparently not even socially engaged enough to explain why they aren't granting the money they've been given seems a little discouraging on this front.</p>\n<p>This view also suggests that a good person to add to the EA Funds team might be someone who is already known as a super-networker within the EA community.  (Somewhat disappointingly, I'm having a hard time thinking of anyone like this off the top of my head.  Proposal: A few people should make it their business to go to every EA event they can possibly go to, monitor and contribute to all online EA discussion spaces, and get to know loads of people in order to introduce people who should know each other etc.)</p>\n", "parentCommentId": "7pS6ghgRTPACdsgRp", "user": {"username": "John_Maxwell_IV"}}, {"_id": "DkzGztjut4q2FQp3v", "postedAt": "2018-02-11T21:38:21.850Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>Huh, that seems like a missed opportunity. I know very little about investing, but aren't there short-term investments with modest returns that would have a one-off setup cost for the fund, such that all future money could go into them fairly easily?</p>\n", "parentCommentId": "NsHcp2eCjuhJnRye3", "user": {"username": "Arepo"}}, {"_id": "FbNovXnpqQk5vhzw5", "postedAt": "2018-03-31T15:39:26.980Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>I would have thought so. Putting them into government and corporate bonds is very safe, and would at least prevent the value in the funds from being eroded by inflation.</p>\n", "parentCommentId": "DkzGztjut4q2FQp3v", "user": {"username": "HenryStanley"}}, {"_id": "qow2e6fCrHQYjbjM6", "postedAt": "2018-10-27T16:34:03.020Z", "postId": "Bueoanm4d7tc2ht4F", "htmlBody": "<p>Update: The funds have now committed to a regular schedule of giving. <a href=\"http://effective-altruism.com/ea/1uu/announcing_new_ea_funds_management_teams/\">link</a></p>\n", "parentCommentId": null, "user": {"username": "Larks"}}]