[{"_id": "ffHtNdes4HFtoTCdj", "postedAt": "2022-11-15T04:19:11.439Z", "postId": "buk2kgMFxWzQAuJta", "htmlBody": "<p>This seems like progress to me. Something highly upvoted but disagreement-downvoted means to me \"we appreciate this comment's existence and want to incentivize that, but disagree with it factually\". I think voting has degraded due to the sheer influx of people and content, but that this feature is swimming uphill against that and has noticeably improved discourse.</p>", "parentCommentId": null, "user": {"username": "DonyChristie"}}, {"_id": "PHfPbygpj5N6dm4a7", "postedAt": "2022-11-17T07:06:02.060Z", "postId": "buk2kgMFxWzQAuJta", "htmlBody": "<blockquote><p>Something highly upvoted but disagreement-downvoted means to me \"we appreciate this comment's existence and want to incentivize that, but disagree with it factually\".&nbsp;</p></blockquote><p>I agree with this sentence.</p><p>But it doesn't apply in this case because:</p><p>The example comment I gave was <strong>not</strong> \"highly upvoted but disagreement-downvoted\". Specifically, it was downvoted rather than \"highly upvoted.\" (It had 9 karma with 11 votes meaning it was downvoted. Highly upvoted comments have much more karma than votes. Comments with equal karma to votes or less (as was in this case) were downvoted (since many users' votes necessarily deliver &gt;1 karma).)</p>", "parentCommentId": "ffHtNdes4HFtoTCdj", "user": {"username": "WilliamKiely"}}, {"_id": "bcAxmf2Sd5fF6bF6H", "postedAt": "2022-11-17T07:06:20.558Z", "postId": "buk2kgMFxWzQAuJta", "htmlBody": "<p>I also want to emphasize that the main thing I wanted to highlight with the example was not that the regular karma was downvoted, but rather that the disagreement karma was, and that the content of the comment was not one that I was pretty confident an informed EA wouldn't disagree with (namely that climate change is not neglected and that directing money to more effective causes was valuable.)&nbsp;<br><br>I saw this as another example of a pattern I think I may have perceived of \"agreement-karma voting degradation.\" My impression was that the voting patterns I've seen (lower-quality agreement-karma voting) is evidence that EA Forum voters are less familiar with EA ideas than they once were.</p><p>Note though that <a href=\"https://forum.effectivealtruism.org/posts/buk2kgMFxWzQAuJta/has-karma-agreement-voting-behavior-changed?commentId=ED2iXyTKrnd5aLHGd\">Kirsten pointed out an alternative hypothesis for disagreement in her answer</a>: \"I think there have been some weird examples of voting recently, but this isn't one! I've long been annoyed with the naivite of EAs who think unsolicited outreach to billionaires will have a positive impact on the world.\"</p><p>So I've updated toward thinking that the example I gave as evidence of my perceived trend in bad agreement-karma voting wasn't actually a good example. In this case, the disagreement votes could be explained by people with Kirsten's view, rather than people disagreeing that climate change was neglected. (Though there are also EA Forum who do think climate change is neglected, per other answers this question received.)</p>", "parentCommentId": "ffHtNdes4HFtoTCdj", "user": {"username": "WilliamKiely"}}, {"_id": "Cz7ijHCNa7zMPHzYL", "postedAt": "2022-11-26T08:57:47.731Z", "postId": "buk2kgMFxWzQAuJta", "htmlBody": "<p>I just came across this. Same article, different voting behaviour.</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/6aXfG57FvbcrKf9Qd/make-the-drought-evaporate\">https://forum.effectivealtruism.org/posts/6aXfG57FvbcrKf9Qd/make-the-drought-evaporate</a> – 8 karma from 10 votes (no critical comments)\n<a href=\"https://www.lesswrong.com/posts/wttyWyKqkPyncuoCm/make-the-drought-evaporate\">https://www.lesswrong.com/posts/wttyWyKqkPyncuoCm/make-the-drought-evaporate</a> – 32 karma from 24 votes</p>\n", "parentCommentId": null, "user": {"username": "rmoehn"}}]