[{"_id": "atFxQwSqzjg4ra2Cc", "postedAt": "2022-12-12T18:13:01.343Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Looks great!</p>\n", "parentCommentId": null, "user": {"username": "lukeprog"}}, {"_id": "msioJRNFMg89GzLZ7", "postedAt": "2022-12-12T18:46:04.418Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Thanks Luke, appreciate it!</p>\n", "parentCommentId": "atFxQwSqzjg4ra2Cc", "user": {"username": "davidvanbeveren"}}, {"_id": "vcoK5m3ibqqEEuCu6", "postedAt": "2022-12-12T21:20:01.556Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>This is a really beautiful website -- nice work.</p>", "parentCommentId": null, "user": {"username": "willbradshaw"}}, {"_id": "FbszzdW9L9zgRDebh", "postedAt": "2022-12-12T21:48:07.437Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Already seeing the love on the Animals and Longtermism Discord! I concur, the website is exceptional. I hope you're tracking hits and website interaction so in the long-term we can get some proxy-measures for the site's long-term impact! It is a fantastic and superior alternative to just sending newbies to the <a href=\"https://en.wikipedia.org/wiki/Wild_animal_suffering\">Wild Animal Suffering wikipedia page</a> - which is just too dense IMO.<br><br><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_100 100w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_200 200w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_300 300w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_400 400w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_500 500w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_600 600w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_700 700w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_800 800w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_900 900w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/a0da5c0d67e2df1f3e6288311b302055c76c507c572509b8.png/w_937 937w\"></p>", "parentCommentId": null, "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "cyjNq6RY4HeopvD4h", "postedAt": "2022-12-12T22:17:32.043Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>I'm really enjoying the images/graphics — thanks for sharing the site! Here's a screenshot:&nbsp;</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_260 260w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_520 520w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_780 780w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_1040 1040w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_1300 1300w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_1560 1560w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_1820 1820w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_2080 2080w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_2340 2340w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/ef6820277a671071ed8d7ccf54d8f8f299e1af60da6624af.png/w_2536 2536w\"></figure><p>(By the way, here's my usual encouragement to include more images in posts. :) )</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "BSvvMrdhLuMQKviYf", "postedAt": "2022-12-12T22:24:00.527Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Does \"For every human, there are roughly 3-4 farmed animals being farmed at any given moment\" only count farmed land vertebrates (specifically mammals and birds)? I think the number is higher if you include farmed fish or farmed invertebrates.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "cBTEMBr2vgdnDAoBw", "postedAt": "2022-12-13T06:10:17.224Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>I agree. A useful resource for farmed fish statistics is <a href=\"https://docs.google.com/spreadsheets/d/12pA0UxIbRDcfY5g25XZ7na4duhj6411l-1-_3tRH48k/edit#gid=1419062790\">OPP's open spreadsheet</a>. It shows that the number of farmed fish alone is 10x of the human population.</p>", "parentCommentId": "BSvvMrdhLuMQKviYf", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "BpgWyMxTyMvcEZ3no", "postedAt": "2022-12-13T10:34:23.091Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>I liked this page a lot and have added it to the further reading on <a href=\"https://80000hours.org/problem-profiles/wild-animal-welfare/\">80k's problem profile</a> on the topic :)</p>\n", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "EtCth4GLmAZv4GKWt", "postedAt": "2022-12-13T10:54:39.342Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Just to update everyone, Michael, Fai and I have chatted separately from this thread. &nbsp;My team just pushed an update to that specific page that now properly includes farmed fish statistics. You can find the source(s) for our numbers in the footer under the \"Credits and sources\" section.<br><br>Thanks for catching that for us!</p>", "parentCommentId": "BSvvMrdhLuMQKviYf", "user": {"username": "davidvanbeveren"}}, {"_id": "HpGJDvqQv5d2zhwAi", "postedAt": "2022-12-13T10:58:02.938Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Amazing— thanks so much for the support!</p>", "parentCommentId": "BpgWyMxTyMvcEZ3no", "user": {"username": "davidvanbeveren"}}, {"_id": "voM7LxmhYS9dEoLBx", "postedAt": "2022-12-13T11:05:49.477Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Love this site!</p>\n<p>Not sure why you wouldn’t just add the fish number in the top-line figure though? Reads a bit odd that it is separated.</p>\n", "parentCommentId": "EtCth4GLmAZv4GKWt", "user": {"username": "jackmalde"}}, {"_id": "CsC6iBGporDSuERnz", "postedAt": "2022-12-13T11:34:23.844Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>This website looks incredible, amazing job people!!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lucas Lewit-Mendes"}}, {"_id": "6rjNGMxCNpTvWKHgb", "postedAt": "2022-12-13T11:35:18.796Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Thanks Jack!<br><br>We're still debating this internally, right now the idea is that we think it gives a better comparison overview between land and ocean statistics, and more importantly, gives more weight towards showing how many individuals are being slaughtered just in the fish industry alone.<br><br>If we combine those numbers, folks that are not as familiar about these industries (as we may be), may potentially assume that the majority included in that statistic are land animals. We still might change how we show this, but for now as a quick update this seemed appropriate.</p><p>Of course, if you have any feedback, we're very open to that and appreciate it!<br><br>Thanks again!</p>", "parentCommentId": "voM7LxmhYS9dEoLBx", "user": {"username": "davidvanbeveren"}}, {"_id": "7xCpuyczuQPHh4Yn7", "postedAt": "2022-12-13T11:40:31.335Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Hi, thanks for posting this. &nbsp;I wanted to start a new thread, or somehow alert the EA wild animal community. My son recently came back from Washinton DC and visited the Zoo there. He was mildly shocked to find that the Tiger is being held in what is little enclosure, with so little room that it has effectively been driven mad, and moans continuously. &nbsp;Given this is the main zoo of the capital of the richest nation on earth, it seems incredible that such a creature should be so abused. &nbsp;Perhaps the EA community can find the funds to build out a better enclosure or better yet bring the tiger out into the country if a suitable park can be found or created.</p>", "parentCommentId": null, "user": {"username": "Edward Farrelly"}}, {"_id": "u5m6SQ6uG9x5LBtkM", "postedAt": "2022-12-13T20:38:34.367Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>I think the websites look amazing!&nbsp;</p><p>It did give me a question: Is anyone doing focus groups or user interviews on these kinds of projects? I think this looks good, but I am already convinced that WAW is worth thinking about, so I am not really the target audience, but maybe the website is not so convincing for people who are not? &nbsp;</p>", "parentCommentId": null, "user": {"username": "ThomasFowl"}}, {"_id": "ZGJQYfc2o9NWFjQ3o", "postedAt": "2022-12-13T21:14:38.218Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Thanks Sam, appreciate it!</p><p>I can't speak for other projects, but we do have a process that includes discovery, validation and user testing, you can see how we approach our projects <a href=\"https://miro.com/app/board/uXjVOWF5D2c=/\">by clicking here.</a></p><p>Thanks again for the kind words!</p>", "parentCommentId": "u5m6SQ6uG9x5LBtkM", "user": {"username": "davidvanbeveren"}}, {"_id": "rLAbQSe7LASC874wJ", "postedAt": "2022-12-14T01:08:07.166Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Hi Edward,<br><br>First off - you have my sympathies. That sounds terrible, and I understand his and your anger about this. Unfortunately, there are a great deal of problems in the world, so EA's need to think carefully about where we should allocate our resources to do as much good as we can. Currently, <a href=\"https://www.givewell.org/charities/top-charities\">you can save a life for around 3500-5500 USD</a>, or for animals, focusing on factory farming can lead to tremendous gains (Animal Charity Evaluators estimates that lobbying for cage-free campaigns for hens can lead to <a href=\"https://animalcharityevaluators.org/charity-review/the-humane-league/#c3\">multiple hen-years affected per dollar</a>).<br><br>So, we need to consider how much it would cost to fix this problem. Building a better enclosure would cost a great deal of money, as would convincing the zoo to let the tiger be released and transported back to its home continent. I don't know how much construction costs, but it definitely wouldn't be in the four figures. I'd estimate six figures, minimum. Even if it were five figures, this is enough to save multiple human lives, or prevent tens of thousands of chickens living even more wretched lives.<br><br>I don't want to trivialise the problem you've mentioned. It's an injustice. However, this injustice is far from unique. Millions of people and animals are suffering right now, and since we cannot help them all, EA focuses on trying to help as many as we can.&nbsp;<br><br>This cause prioritisation is at the heart of the EA movement. &nbsp;If you've got questions, I'd be happy to answer them as best I can, whether here or via PM.&nbsp;</p>", "parentCommentId": "7xCpuyczuQPHh4Yn7", "user": {"username": "Jay Bailey"}}, {"_id": "r3rxAwoLwgCdostfw", "postedAt": "2022-12-14T18:41:14.736Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Hey David, congrats on launching this! Really well-designed site. So great to see the WAS discussion steadily spreading out of academia. It's obviously still quite fringe, but it's progressing faster than I expected. Big thanks to people like you, Humane Hancock and others who are laying the groundwork to bring the discussion into the mainstream.</p><p>I thought I'd let you know that my bank card was temporarily blocked due to \"Vegan Hacktivists\" sounding shady to someone at my bank's fraud department - I'm not sure if you can change this with Donorbox or your bank, but if you can it might make sense. Although this could be a rare/one-off thing that has only happened to me.</p><p>Also, while I'm here, some random bits of feedback - please feel free to completely ignore these:</p><ul><li>It would be great to have a \"promising directions\" page to show people that, actually, there are tractable things that can already be worked on. E.g. many countries have already ~eliminated certain diseases that cause a lot of suffering for wild animals - like rabies, via mass vaccination. And contraceptive baits are already in use to control population sizes of certain r-selected species. These programs are currently \"selfish\" in that they're mainly for the benefit of humans, rather than to help the wild animals themselves, but it shows that tractable and large-scale programs are possible, which is exciting and I think somewhat surprising to many people.</li><li>It may make sense to have a page that tries to put a \"vivid\" picture in the reader's mind about what suffering can be like in the wild. The existing pages give statistics and broad descriptions, but humans often benefit from stories/descriptions of individuals - e.g. (as mentioned in one of the videos you embedded) a deer suffocating to death due to nasal bots, or a young chick that falls out of the nest and dies over the course of many hours or days. It may make sense for this section to have videos and photos, and would perhaps have some sort of CSS effect to censor the whole section, with an explanation and a button for the viewer to actively choose to view the content. I say this because although actively choosing to view this content is not something that many people will do, for those who do view it, it can have a very profound effect in terms of grounding the \"abstract\" and \"statistical\" aspect of the overall explanation - concretely showing how cruel nature can be. This sort of thing was helpful for me when I was introduced to WAS. There are <a href=\"https://www.youtube.com/watch?v=WtVXFonpaWo \">some particularly terrible videos</a> that I don't necessarily suggest that you include (especially because predation is already overemphasised as an aspect of WAS, in regard to early-stage tractability), but which definitely did work to remove my nature-documentary-tinted glasses, and may do so for others, but you'd obviously want to gate them with some very strong content warnings.</li><li>I'm not sure, but I think it might make sense to exclude the earthworms and insects from the pie chart. The scale is likely already enough to make the point after fish, and the point may get muddied when worms and insects are added - since there are many people who think their capacity to suffer is far, far less than the larger-brained animals. Obviously it shouldn't matter to add these in, because it's more wild animal suffering, regardless of how small they think it is, but I feel like everyone is convinced at the scale where fish are added, and adding insects and earthworms makes the point less \"clean\" for a subset of viewers, and for little additional benefit.</li></ul><p>And a few very minor points that I am only adding because it's clear by the quality of your sites that you care about attention to detail:</p><ul><li>On the \"Even Worse, Wild Animals Suffer in Terrible Ways\" page, the drawing for the \"accidents\" button should probably show a non-human-caused accident - e.g. a deer limping with a broken leg, or something like that? Since the road kill situation should probably fall under \"anthropogenic harms\". I only say this because I think accidents/injuries are a bit underrated even in discussions between people who are reasonably informed about WAS, and so I think it's worth giving people the correct \"at-a-glance\" impression here.</li><li>In the video player, when you click the play button, it loads the youtube player, which then requires the user to click a second time (on the youtube play button) to actually start the video. IIUC, you need the user to click the embed, since auto-play functionality (after clicking your \"fake\" play button) won't include sound, but you don't want to load all the embeds up-front. So on desktop you could trigger the embed load when they click the video thumbnail from the side-menu (and do away with \"fake\" play button), and on mobile, perhaps you could load the embed when the video container enters the page (you can use IntersectionObserver <a href=\"https://stackoverflow.com/a/66394121/11950764\">like this</a>). If you want to keep the fake button for aesthetic reasons, then you could use `pointer-events:none` on it so the click goes through to the embed (that was loaded with the IntersectionObserver) underneath.</li><li>In the \"Other Resources You Might Like\" section, I missed the fact that there are other categories (blogs, books, podcasts) that I can toggle through. It was only when I viewed the page on mobile that I noticed, since they are expanded into their own section with horizontal scrolling. I wonder if it might make sense to use that mobile format for desktop too?</li></ul><p>Thanks again to you and the other contributors for putting this site together!</p>", "parentCommentId": null, "user": {"username": "Joe Rocca"}}, {"_id": "k39pKPArpQreAHXw3", "postedAt": "2022-12-14T19:16:55.721Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>I upvoted both of the comments in this thread, because I empathised with Edward's feelings of horror/sadness at the animal abuse they witnessed, and because I thought that Jay's comment was a kind, honest, and full explanation of why Edward's proposal was unlikely to be taken up by others on this Forum :) Thanks both.</p>\n", "parentCommentId": "rLAbQSe7LASC874wJ", "user": {"username": "Bella_Forristal"}}, {"_id": "cetGE6WStiTNtAeBb", "postedAt": "2022-12-15T02:04:03.735Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Hi Edward,</p><p>You might be interested in the work of the Non-Human Rights Project. &nbsp;They are attempting to establish the legal and political frameworks to ensure that animals (e.g. tigers) will be treated well by people.</p><p>https://www.nonhumanrights.org</p>", "parentCommentId": "7xCpuyczuQPHh4Yn7", "user": {"username": "Tyner"}}, {"_id": "jmiAyRmGqACwJfCiB", "postedAt": "2022-12-17T13:44:25.011Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>What a gorgeous website!</p>\n<p>One value to think about in this website’s design is how much to optimize it for persuading EA/rationalists, vegans, or normal people. The website’s discussion of the issue and possible objections seems primarily geared towards EA/rationalist people and vegans rather than towards normal people.</p>\n<p>Has Vegan Hacktivists undertaken any marketing research into which specific groups it makes the most sense to appeal to, and how to best design the website in that vein?</p>\n", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "HvpgWKNHRGse5DWvs", "postedAt": "2022-12-17T23:13:19.281Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>What a fantastically beautiful website. The illustrations (<a href=\"https://katerodman.com/\">Kate Rodman</a> is cited) are great, and the aesthetics as a whole fit together fantastically. I don't know if I've ever seen a site I like better visually.</p><p>I'm also a fan of the content.</p>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "24Pcdc2dcfbCCP9fw", "postedAt": "2022-12-20T12:10:00.542Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Hey JP,<br><br>Thanks so much— I've forwarded your feedback to Kate, I'm sure she'll appreciate it!</p><p>I noticed you're a software engineer here, if you'd ever like to jump on a call with me to just chat and pick each others brains, feel free to message me. I run a tech based capacity building organization called <a href=\"https://veganhacktivists.org/\">Vegan Hacktivists</a> and our work often intersects with EA-aligned orgs working in the farmed animal space.</p><p>Thanks again, cheers!</p>", "parentCommentId": "HvpgWKNHRGse5DWvs", "user": {"username": "davidvanbeveren"}}, {"_id": "z5aifA8LG9vdTXEpb", "postedAt": "2022-12-20T12:22:33.164Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Hi Ariel,</p><p>Thanks for the compliment and feedback!</p><p>We do have an internal discovery process that our projects go through that includes project hypothesis, investigation on use-cases, validation, prioritization, markcomms strategy, guerrilla testing, etc. You can get a peak <a href=\"https://miro.com/app/board/uXjVOWF5D2c=/\">of the process here</a>, although it's not a complete view.</p><p>We concluded that we wanted our two target audiences to be folks who care about wild animal welfare/suffering, and advocates in vegan spaces focused on factory farming— so we built the website with that in mind. That said, we hope it appeals to EA/rationalists and normal folks in some way, but we're always looking to improve if we're missing that target.</p><p>I'll send this feedback back to the team for review, appreciate the question!&nbsp;</p>", "parentCommentId": "jmiAyRmGqACwJfCiB", "user": {"username": "davidvanbeveren"}}, {"_id": "zmxdE8sP4o7qed7e3", "postedAt": "2022-12-20T12:34:27.668Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Hi Joe,</p><p>Thanks so much for this amazing feedback!</p><p>I see you solved the issue with Donorbox, thanks for the donation! We'll look into if our name might be causing issues, appreciate the note.</p><p>I'll try to respond to all of your feedback below:</p><ul><li><strong>Promising directions: </strong>This sounds like a really important addition to add, agreed! Not sure if we can do a whole page (we really have to be careful to not make the site too large, there's so many pages that could be added) but we could add this in an existing page for sure.<br>&nbsp;</li><li><strong>Vivid picture: </strong>Can't agree more. We're really trying to strike a balance of what we show, but I think what you've outlined makes a lot of sense. Appreciate the link to the videos, I'm going to bring this back to the team to see how we can accomplish this.<br>&nbsp;</li><li><strong>Worms / insects: </strong>Interesting point. This sounds like a larger discussion to be had with the folks who researched the content and strategy, I'll bring this back to them - thanks!<br>&nbsp;</li><li><strong>Even worse page: </strong>We fully agree! We'll ask our illustrator to update this in our next round of updates, nice catch.<br>&nbsp;</li><li><strong>Video player: </strong>We just fixed this, let me know if you still have to click twice! This was a bug that wasn't intended to happen but was happening on Chromium based browsers.<br>&nbsp;</li><li><strong>Other resources: </strong>Agree! We're going to make the tabs on the desktop format sticky so no matter how low you scroll, you'll notice that there's other sections. We want to avoid using the mobile format for desktop in order to keep the page a reasonable length. Hopefully this is a good middle-ground solution!</li></ul><p>We can't thank you enough for the really detailed feedback, appreciate it! I'm sending over all of these notes to the team, and if you have any more comments, feel free to message me directly!</p>", "parentCommentId": "r3rxAwoLwgCdostfw", "user": {"username": "davidvanbeveren"}}, {"_id": "djNt6mFnzrx3BfZC7", "postedAt": "2022-12-20T13:23:03.363Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Thanks for that explainer! Given those target audiences, I think the team did a fantastic design job.</p>", "parentCommentId": "z5aifA8LG9vdTXEpb", "user": {"username": "Ariel Simnegar"}}, {"_id": "tGaeqenmCjmSZPpca", "postedAt": "2022-12-20T22:16:28.929Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>No problem, and thanks so much!</p>", "parentCommentId": "djNt6mFnzrx3BfZC7", "user": {"username": "davidvanbeveren"}}, {"_id": "bP6LgD6P4jnfC55WC", "postedAt": "2022-12-27T15:20:08.603Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Beautifully done...I'll be recommending this page to people in the future.</p>", "parentCommentId": null, "user": null}, {"_id": "hdHxkhJqaBRJr3hog", "postedAt": "2023-01-14T20:45:40.756Z", "postId": "Buongkf4KXmBP2jiG", "htmlBody": "<p>Amazing website! This does fill a need; now I have a simple, single-link resource to share with other animal activists/EAs/etc with whom I'd like to convey the importance of wild animal suffering.</p>", "parentCommentId": null, "user": {"username": "Damin Curtis"}}]