[{"_id": "qARgcHHCMzHy7PcuD", "postedAt": "2024-02-06T09:13:13.259Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>My diet is very similar to this one. I'm curious what other knowledgeable people think about the lack of variety in vegetables/fruits. I'm also curious about other people's takes on the lack of probiotics.</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "N5RfDw7nhjWcJXEeT", "postedAt": "2024-02-06T09:28:18.106Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>My not very informed take on probiotics is that if you eat similar quantities of fiber like me, and lots of green leafy greens and legumes, this is what is best known to support a healthy bacterial environment in the gut. I also have in periods eaten miso and kimchi in order to get more live bacteria into my gut but have stopped and not noticed much difference.&nbsp;</p>", "parentCommentId": "qARgcHHCMzHy7PcuD", "user": {"username": "Ulrik Horn"}}, {"_id": "fnmkoenfYBYyi6HP7", "postedAt": "2024-02-07T01:30:03.786Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>You might want to consider iron supplements or eating in ways that increases iron intake (e.g. consume vitamin c-rich food with the leafy greens.) It stood out to me that you didn't mention iron and it might have been the energy-boosting factor when you were eating meat.&nbsp;</p>", "parentCommentId": null, "user": {"username": "anam"}}, {"_id": "vyAGjgnyWLMYHThee", "postedAt": "2024-02-07T07:43:14.039Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Thanks Anam - I will try that right away actually as it is so easy to do. That said, my blood tests showed more than appropriate iron levels when I last checked. Also, according to cronometer I seem to be getting plenty of iron (tofu, oats, peanuts) but vitamin C can probably be boosted - it is only broccoli that provides this currently and I am \"only\" at ~140% of RDA for vit C. Maybe I'll try both iron and vit C supplements - can't hurt as long as I am not risking going over the safe upper limit. Super helpful tip!</p>", "parentCommentId": "fnmkoenfYBYyi6HP7", "user": {"username": "Ulrik Horn"}}, {"_id": "KeXpesjERrFPGG6ex", "postedAt": "2024-02-07T07:47:48.078Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Oh and on variety in fruits/veggies - I supplement opportunistically. So if I am hungry, have time and there is an orange in front of me, I'll eat it. But I won't go out of my way to do this. I also have some fresh pressed juice every morning (orange, apple, pineapple and some smaller quantities of ginger etc). But variety in vegetables is something I am currently not getting. For the first 5 years I varied between broccoli, cauliflower and crimini mushroom (when I had time - before kids!) but not sure that covered the nutritional needs as well as my current diet. But maybe variety is more important than exactly hitting all RDAs - I think science is not clear here. Would be interesting to see e.g. in blue zones how many people hit the RDA on all nutrients. If they don't that is strong evidence that it is not super important, at least not for all nutrients.</p>", "parentCommentId": "qARgcHHCMzHy7PcuD", "user": {"username": "Ulrik Horn"}}, {"_id": "yRHa8JmpMCAu7vcuK", "postedAt": "2024-02-08T20:07:49.934Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>What does raisins have to do with \"building muscle in my core\"?</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "cqS65GMdenyMoyh4a", "postedAt": "2024-02-08T20:10:00.082Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Curious about the \"rescue meat\" thing.</p>\n<p>My take is that buying \"about-to-expire meat on discount when in the grocery store\" incentivizes meat production less than buying expensive super-fresh premium meat.</p>\n<p>On the other hand, stores that visibly see meat rotting on the shelves may be (emotionally?) inclined to reduce their meat orders in the future.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "FDXMQjSmwH7PZS9DK", "postedAt": "2024-02-09T16:50:03.808Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>It's not super well thought through but my understanding is that you need lots of carbs to bulk up, not just protein. And I'm the skinny type so that seems extra fitting in my circumstances. I then thought what is a high carb food that would further diversify my diet and raisins seemed easy and cheap.</p>\n", "parentCommentId": "yRHa8JmpMCAu7vcuK", "user": {"username": "Ulrik Horn"}}, {"_id": "RjR2c76jshhsGdsZx", "postedAt": "2024-02-09T16:51:39.527Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Yeah I might definitely be using some motivated reasoning here. Happy to take feedback here especially backed up by evidence.</p>\n", "parentCommentId": "cqS65GMdenyMoyh4a", "user": {"username": "Ulrik Horn"}}, {"_id": "CMQaRM39vpjLfTDya", "postedAt": "2024-02-15T19:31:08.062Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>The lack of variety of vegetable and almost no fruits looks kinda worrying to me, I've always been told that this is crucial for a healthy diet, but I'm not sure if it's true. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Raultic"}}, {"_id": "A2divi7usqFXAkkqC", "postedAt": "2024-02-16T06:32:20.292Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Yes I think this is a weakness of this diet too. I asked GPT to list the veggies most commonly seen in blue zones, and if I recollect correctly one might want to consider adding garlic, onions and perhaps sweet potatoes and tomatoes too (I think there were a couple of others). Also, kale and brussels sprouts have a similar nutritional profile to broccoli and could work well in this diet too. For me it is not possible due to time constraints (unless my kids suddenly one day go \"dad I want to live healthily and long, please make me veggies!\") but I am likely to diversify once I get a bit more time back. But I think as it stands it is a vast improvement over Huel, I am guessing like 80% of improvement with 20% of effort type of situation. Also, I do advise to opportunistically eat fruits (or different vegetables) whenever the opportunity presents itself.&nbsp;</p>", "parentCommentId": "CMQaRM39vpjLfTDya", "user": {"username": "Ulrik Horn"}}, {"_id": "eHsGcAYPxNrLXtB92", "postedAt": "2024-03-13T08:29:28.593Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Super interesting, and it seems like a good alternative to food in a bottle for sure. Unfortunately I don't think I could live on this, because I derive so much joy from cooking and eating :D&nbsp;</p><p><br>For anyone else considering this diet, but wants more variety/tastiness easily, I have some suggestions:&nbsp;<br>&nbsp;</p><ul><li>add frozen berries to the porridge, they have amazing nutritional value&nbsp;</li><li>use smoked tofu instead of plain, it adds so much taste&nbsp;</li><li>rotate the green veggies in winter: kale and brussel sprouts are in season, and more nutritionally valuable than out-of-season broccoli</li></ul>", "parentCommentId": null, "user": {"username": "Milena Canzler"}}, {"_id": "jFmamujBdH99n33Cu", "postedAt": "2024-03-13T08:32:08.256Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Yeah, I tried to emphasize the ascetic part haha! Oh and the tofu I eat is straight out of the packaging, I just give it a rinse. So pretty bare-bones!</p>", "parentCommentId": "eHsGcAYPxNrLXtB92", "user": {"username": "Ulrik Horn"}}, {"_id": "hcbHjzudNCq9trGec", "postedAt": "2024-03-13T08:35:47.899Z", "postId": "buze9djYDYggqoSRs", "htmlBody": "<p>Hehe, it certainly is ascetic!&nbsp;<br>I actually eat smoked tofu the same way, no need to fry it, it's super tasty that way :)</p>", "parentCommentId": "jFmamujBdH99n33Cu", "user": {"username": "Milena Canzler"}}]