[{"_id": "dEvuTu8jM5KCRNfbM", "postedAt": "2023-03-18T12:46:40.003Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>Hi Luis, thank you for writing this up! I think it's a well-written forum post that clarifies important distinctions and makes valuable points, and on a topic that AFAIK is being considered and discussed by many people in the community currently.</p>\n<p>I agree with most of your points. In fact, I've come around on one that we previously disagreed on, namely on defining \"local priorities research\" more restrictively than how many people are currently using it: I now see more of the value of having \"local\" in LPR clearly refer to the altruistic scope rather than the resources being prioritised, consistent and contrasting with the \"global\" in GPR referring to the global altruistic scope.</p>\n<p>There are two further comments/suggestions I'd like to make:</p>\n<p><strong>Consider using a different name than \"contextualization research\"</strong></p>\n<p>I think adding new terminology that isn't immediately clear should be avoided whenever possible, and CR isn't self-explanatory nor does defining this new term look unavoidable to me. I think using something like \"resource-specific GPR\" or \"targeted GPR\" - though a mouthful - is much clearer than CR, because (1) the terms themselves are more self-explanatory (including by using the word \"priorities\") and (2) it's immediately clear that they refer to a subset of GPR.</p>\n<p><strong>There may be cases in which \"pure\" LPR is worth doing for local groups</strong></p>\n<p>I expect there are cases in which it will be worth doing LPR (according to your new restricted definition) as a local group from the perspective of doing the most good impartially even when it doesn't overlap with CR/resource-specific GPR. In other words, I expect there to be cases where doing \"pure\" LPR would be a recommendation coming out of doing resource-specific GPR for a local group.</p>\n<p>Take your Latin American example: my guess is it will often be valuable to do the type of research you link to there even if you expect not to find anything close to competitive to GW top charities, and even if there isn't a large pot of restricted funds that may be influenced by it.</p>\n<p>A few reasons for doing LPR in such a case could be:</p>\n<ul>\n<li>\n<p>showing one cares and is knowledgeable about local problems before making the claim one should focus on other geographies or cause areas</p>\n</li>\n<li>\n<p>substantiating and better being able to communicate the claim that donations go further in those other countries or cause areas</p>\n</li>\n<li>\n<p>using this as a training opportunity for charity researchers who could later move on to charity evaluation that would qualify as GPR</p>\n</li>\n</ul>\n<p>As we've discussed elsewhere there are clear trade-offs and risks for engaging in LPR at a local group level (e.g. opportunity costs, risk of motivated reasoning or value drift) - so I share your caution in recommending this as an activity. However, I don't think a blanket recommendation <em>against</em> doing (well-considered and careful) LPR at a local group level is justified either, for the above reasons.</p>\n", "parentCommentId": null, "user": {"username": "SjirH"}}, {"_id": "mAZq5trdogjBtmJLw", "postedAt": "2023-03-19T00:22:07.215Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>Names: How about context-specific GPR? (or some variation on this). It takes into account resources / location etc.&nbsp;</p>", "parentCommentId": "dEvuTu8jM5KCRNfbM", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "K7GBmfoLjACG7fxCu", "postedAt": "2023-03-19T00:27:34.633Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>Hi Luis, thanks for disambiguating between these two defintions! I found this post easy to read, clear and convincing.&nbsp;</p><p>When I was first started working on local priorities research, I definitely intended it to be what you call \"Contextualisation Research\", and projects that I ran focused on LPR were all CR related. I think (if Yi-Yang agrees with your proposal) it might be helpful to get the original LPR post re-named or add a disclaimer to the top to prevent people who are finding this later assuming that the original post only calls for \"LPR\" as you define it.&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "SYDWNjoFjPo6zecme", "postedAt": "2023-03-19T09:12:55.925Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "", "parentCommentId": null, "user": {"username": "sujaanaryal"}}, {"_id": "8fQqy2GboLF7iyz3W", "postedAt": "2023-03-19T10:59:52.385Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>I like that one!</p>\n", "parentCommentId": "mAZq5trdogjBtmJLw", "user": {"username": "SjirH"}}, {"_id": "AFBJnfabh7y3vGjQe", "postedAt": "2023-03-25T10:55:15.663Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>Thanks again for your comments, Sjir! Both of your points are great, and the second one which has led me to think LPR is more important than I thought before.<br><br>I still stand by the approach to doing LPR that I propose in the post. Given that there are cases where LPR is highly likely to be effective, I believe that starting with these cases, learning from them, and subsequently determining the best strategy for other situations is a great compromise between the risks and benefits involved. That said, I do think that LPR has the potential to be really successful and get a lot of people involved.<br><br>Addressing the specific advantages of LPR you outlined:</p><ul><li>On the first two points, my intuition is that local groups could learn enough about that without getting anywhere near the work required for charity recommendations. <a href=\"https://forum.effectivealtruism.org/posts/aNsBJYpGovgJqWC9v/comparing-health-interventions-in-colombia-and-nigeria-which\">Alejandro's analysis</a> is an example of the type of research that I believe moves in this direction, though a more comprehensive exploration is likely warranted.</li><li>On the last point, this could indeed be one of the main benefits of LPR. However, prioritization research based on geographic location is not the only way to train people for GPR charity evaluation. Some examples, which I consider to be GPR, include replicating GiveWell's work, or identifying the best donation opportunities from a non-welfarist perspective (such as those that promote justice).</li></ul><p>On the \"contextualization research\" term, I think I'm a bit more satisfied with it than you are, but I also recognize that it isn't the ideal name. Suggestions for a better alternative are welcome!</p>", "parentCommentId": "dEvuTu8jM5KCRNfbM", "user": {"username": "LuisMota"}}, {"_id": "92jgXxWzuuupxGYdT", "postedAt": "2023-03-25T10:55:32.926Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>I also like it!</p>", "parentCommentId": "mAZq5trdogjBtmJLw", "user": {"username": "LuisMota"}}, {"_id": "r2t68ovQoyuL2otJx", "postedAt": "2023-03-25T11:10:04.578Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>Thanks, Vaidehi!&nbsp;<br><br>The possibility of confusion is the worst thing about me using the term \"local priorities research\" to refer so something that was used in a broader sense before. My hunch is that it's worth it, because it seems to me to be by far the most accurate description of what I call LPR. I really hope this won't prove to be too confusing, and I wouldn't want to trouble those who have written before to make changes in response to this. But I think that in a number of cases the term was used to refer to both LPR and CR, in an ambiguous way.<br><br>My guess is that the best thing to do (if people agree with the distinction I've made) is to use LPR in the narrower sense from now on, and maybe making an edit or adding a comment explaining the usage of the term in past posts when authors see fit.</p>", "parentCommentId": "K7GBmfoLjACG7fxCu", "user": {"username": "LuisMota"}}, {"_id": "9kijf7G4dpzF8W6so", "postedAt": "2023-03-25T11:11:01.908Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>Thanks! :)</p>", "parentCommentId": "SYDWNjoFjPo6zecme", "user": {"username": "LuisMota"}}, {"_id": "XJbv242qPrpQtwJ57", "postedAt": "2023-03-25T17:24:27.209Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>Hey Luis, to be clear, I agree with your post (and using a new name - I like context-specific GPR).</p>\n<p>My main proposal which may have been unclear is that you proactively reach out to folks who uses the old definition in their work, in case they don't see this post, and suggest they edit their posts.</p>\n", "parentCommentId": "r2t68ovQoyuL2otJx", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "pwXXFqJhnBWsmtDFS", "postedAt": "2023-04-27T19:25:43.643Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>I like this too!</p>", "parentCommentId": "mAZq5trdogjBtmJLw", "user": {"username": "AmAristizábal"}}, {"_id": "sqTWSFbk2HRWztytr", "postedAt": "2023-06-12T18:04:43.559Z", "postId": "bv2rnSYLsaegGrnmt", "htmlBody": "<p>When I wrote the post, the framing I used was focused on the differences in direct impact of focusing on local causes. This meant not mentioning a number of other important considerations, both positive and negative. Since writing the post, I've had the opportunity to talk more to others, and to reflect some more on what these other considerations are. Below, I highlight some that I consider particularly important (see <a href=\"https://forum.effectivealtruism.org/posts/bv2rnSYLsaegGrnmt/researching-priorities-in-local-contexts?commentId=dEvuTu8jM5KCRNfbM\">Sjir's comment</a> for some others).</p><p>Getting people involved with effective interventions for local problems can serve as a way to get more people involved with effective global interventions. This can happen because it will be easier for some people to get involved with a local problem first before getting involved with a global problem, and also because working on local-level interventions can increase the popularity of EA in the region. I've recently learned that GiveDirectly's US cash transfer program appears to have led to a really large increase to their international donations to people in extreme poverty, due to these two channels. They <a href=\"https://forum.effectivealtruism.org/posts/RKbTLMzS9fDQBzySt/working-in-the-u-s-helped-us-get-more-money-to-international\">claim that this was the case</a>, and a quick look at their <a href=\"https://www.givedirectly.org/financials/\">funding from previous years</a> shows no signs of such a large increase in (international) donations in 2020. If this increase in international donations was indeed not caused by something else, then this example makes me a lot more optimistic about this indirect benefit of doing LPR. Relevantly, I should note that GiveDirectly (1) first consolidated their international transfers program before starting their US transfer program, and (2) tried to emphasize international transfers following the media attention they obtained for US transfers.</p><p>A second point in favor of LPR is that, in practice, it doesn't need to be the case that resources directed to local causes come at the expense of resources for the global cause. If an EA group already has a well-developed core group, and can already do outreach to those interested in the global cause, then the group might be able to start dedicating resources to LPR at a relatively low cost. As long as this doesn't compromise the group's ability to do outreach for global issues properly, I think that LPR might become a valuable activity for EA groups to engage in.</p><p>It's also worth highlighting some downsides:</p><ul><li>Value drift: if research and outreach of local problems comes at the expense of global ones, then this could be a reason for the group to lose most of their impact. And, as the number of people working on local priorities increases, this could attract even more people with a local focus, in a gradual drifting process that might result in a group that's much more focused on local problems than the ideal.</li><li>Research costs: high-quality research requires a lot of time, as well as specific research skills. There's already a lot of research available on the most relevant global issues, but for the local problems the group's countries would have to mostly do this themselves. The opportunity cost is doing direct work, doing context-specific GPR<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefjsv8yjukh5\"><sup><a href=\"#fnjsv8yjukh5\">[1]</a></sup></span>&nbsp;that's not LPR, or doing outreach for global problems, which is quite a high bar.</li><li>Low-quality research has a really large cost in expectation. If the recommended charities aren't among the best local opportunities, then this further increases the gap in effectiveness of local vs global interventions.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreft6ddoho04a\"><sup><a href=\"#fnt6ddoho04a\">[2]</a></sup></span>&nbsp;Furthermore, it opens up space for large damage to the group's reputation, such as negative media coverage.</li></ul><p>These considerations highlight a timing aspect of the overlap between LPR and context-specific GPR. They suggest that LPR is generally better suited for more mature EA groups, which have already consolidated their outreach structure for people willing to work on global problems. Depending on how high the benefits of LPR turn out to be, this could mean that at some point we would want to do LPR even in the US. But there's still a lot of uncertainty, and I think that more information on the benefits and costs of LPR can be quite valuable. I would feel excited about attempts to get a sense for the magnitude of some effects mentioned here, such as by evaluating the GiveDirectly US transfers case more carefully, and looking for other related cases. And I'm excited about EA doing some work on LPR for the information value, particularly in the countries where it's most likely to be the best local opportunity, such as India.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnjsv8yjukh5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefjsv8yjukh5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This is the same concept as what I refer on the post as contextualization research; see <a href=\"https://forum.effectivealtruism.org/posts/bv2rnSYLsaegGrnmt/researching-priorities-in-local-contexts?commentId=mAZq5trdogjBtmJLw\">Vaidehi's comment</a>.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnt6ddoho04a\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreft6ddoho04a\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Given a heavy-tailed distribution of impact at the local level, redirecting donations from the average charity to a better-than-median but not great charity is also likely to have negative impact in counterfactual terms. I won't explain why here, but you can read about properties of heavy-tailed impact in <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/phpe.12133\">this paper</a>.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "LuisMota"}}]