[{"_id": "492amjnuvysXjR6zm", "postedAt": "2022-09-22T22:18:27.541Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p><strong>On unauthorized eponymous-naming. </strong>I'm excited to see rewards going to under-recognised altruists, and appreciate a bunch of the stuff you guys have been doing.</p><p>That said, I don't quite understand the strategy of naming the prize after Harry Truman without approval from his estate, after all, many of his grandchildren <a href=\"https://en.wikipedia.org/wiki/Margaret_Truman\">seem to still be</a> alive today (and I've confirmed some weeks ago that you've not done this). I've not carefully researched the question, but I get the impression this is a somewhat shifty practice. Firstly, the usual recommended practice is to gain consent [1]. Secondly, as a consequence of that, naming a prize after someone gives an impression that the prize is approved by someone connected to the named person, otherwise it is a bit misleading. Thirdly, it could actually undermine the prize's prestige. Both because of any perception of the aforementioned shiftiness, and because it doesn't seem fancy to tout receipt of a prize whose name has changed, or is changing, due to the organisers having been confronted by an unhappy family.</p><p>There are also some concrete reasons: I know of an org having to change its (unauthorised eponymous) name in the past, and I know of another project that had to change its name for this and other related reasons.&nbsp;</p><p>That said, I would be happy to hear counterarguments!</p><p>NB. I did sent a draft of essentially this comment to Nonlinear a couple of weeks ago, to give an opportunity to respond.</p><p>---</p><p>[1]. e.g. the <a href=\"https://awards.acm.org/binaries/content/assets/press_releases/award_proposal_guidelines.pdf\">ACM</a>, which requires, before instantiating a prize, that \"A statement of permission for the use of the name from the person named (if living) or the person's estate\"</p>", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "TvbEByHq53EKLLvXx", "postedAt": "2022-09-22T22:59:52.197Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I love the spirit of this. I wonder if people will nominate non-EAs. I hope that, in time, we will think the prize pool is too small.</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "nDc4y8hm47joTqabs", "postedAt": "2022-09-22T23:02:30.144Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>How confident are you that getting permission is the normal practice? I guess it feels a very small amount strange given that you could put up a statue of them or whatever.</p>\n", "parentCommentId": "492amjnuvysXjR6zm", "user": {"username": "nathan"}}, {"_id": "F3AsiHsWj6aTJfbyP", "postedAt": "2022-09-22T23:19:11.597Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Medium. It's what the ACM says, what the<a href=\"https://www.simoninstitute.ch/about/\">&nbsp;<u>Simon Institute</u></a> and (IIRC) the <a href=\"https://globalprioritiesinstitute.org/parfit-scholarship/\"><u>Parfit &nbsp;Scholarships</u></a> did, I heard previously from a person like me at Oxford that doing this without authorisation seemed weird to them, and ~half of the time that unauthorized eponymous naming is tried, I've heard of it causing problems.</p><p>Edit: if you named a thing after someone from many centuries ago - Socrates, Bentham, etc that would seem better, because a request from relatives to stop using the name would be less credible, and it doesn't give an impression that the prize was actually associated with that person.</p><p>But there are surely people who have a better sense.</p>", "parentCommentId": "nDc4y8hm47joTqabs", "user": {"username": "RyanCarey"}}, {"_id": "nnJjEvJ7g7Y2GqaCm", "postedAt": "2022-09-23T07:09:53.055Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<blockquote><p><strong>Example #2:&nbsp;</strong>Greg works for the government. ...</p></blockquote><p>Cool idea. Minor point to flag: I would expect in at least some countries receiving &nbsp;a prize for things done at work in government/politics could fall foul of various laws designed to prevent government officials or others receiving money or gifts that could bias their judgments. Receiving such a prize could be illegal or could need to be declared. This could be a thing to look into before awarding such prizes. &nbsp;</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "gs6ughvXsEwwL8pAa", "postedAt": "2022-09-23T09:59:06.313Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Agree, I don't think UK Civil Servants would be eligible.</p>\n", "parentCommentId": "nnJjEvJ7g7Y2GqaCm", "user": {"username": "Khorton"}}, {"_id": "ubRQf6nuoGbE2kQri", "postedAt": "2022-09-23T10:09:51.252Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>(Edit: sorry for the harshness, but I thought it important to convey that I really oppose this.)</p>\n<p>This really seems to incentivise deception and secrecy. Take the example of a \"reputational risk\" - an organisation could take an action that the public would think is bad - and most importantly, people who interact with the organisation in good faith would think is bad - and you're explicitly encouraging them to do it anyway and just hide it. Why would we want this?</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "T6yGtxpyoTtmqKL5L", "postedAt": "2022-09-23T10:59:58.708Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<blockquote><p>and most importantly, people who interact with the organisation in good faith would think is bad</p></blockquote><p>Those are your words, not the words in the OP.&nbsp;<br><br>If I was in the evaluation committee it would be one of my &nbsp;evaluation criteria that people interacting with the organization in good faith would think it was a good deed / good involvement on part of the prize contender (and it would be strange to do it differently, so I don't expect the evaluation committee to think differently).</p>", "parentCommentId": "ubRQf6nuoGbE2kQri", "user": {"username": "Lukas_Gloor"}}, {"_id": "SF8PoPKAdjmu4spyo", "postedAt": "2022-09-23T11:51:31.574Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>What do you take a reputational risk to be? If it's something that would be OK with people interacting with the org, how is it a risk?</p>\n", "parentCommentId": "T6yGtxpyoTtmqKL5L", "user": {"username": "Guy Raveh"}}, {"_id": "yFMc67ciDhnQRv4SS", "postedAt": "2022-09-23T12:07:18.771Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Okay, I think you have a good point. The post <a href=\"https://www.lesswrong.com/posts/SWxnP5LZeJzuT3ccd/pr-is-corrosive-reputation-is-not\">\"PR\" is corrosive, \"reputation\" is not</a>, which I really like and agree with, argues that \"reputation\" is the thing that actually matters. A good way to describe reputation is indeed \"how you come across to people who interact with you in good faith.\" Based on this definition, I agree with your point!<br><br>That said, I interpreted the OP charitably in that I assumed they're talking about what Anna Salomon (author of the linked post) would call \"PR risks.\" Anna's recommendation there is to basically not care about PR risk at all. By contrast, I think it's sometimes okay (but kind of a necessary evil) to care about PR risks. For instance, you have more to lose if you're running for a seat in politics than if you're a niche organization that anyway doesn't do a ton of public-facing communications. (But it's annoying and I would often recommend that orgs don't worry about them much and focus on the things that uphold their <i>reputation</i>, more narrowly construed, i.e., \"among people whose opinions are worth caring about.\")<br><br>Anyway, I reversed my downvote of your comment because I like a definition of \"reputational risk\" where it's basically generally bad not to care about it. I didn't change it into an upvote because you seem to disagree with the secrecy/censorship elements of the post in general (you gave \"reputational risks\" as an example, but worded your post in a way that implies you also have qualms with a bunch of other aspects – so far, I don't share this aversion; I think secrecy/censorship are sometimes appropriate).</p>", "parentCommentId": "SF8PoPKAdjmu4spyo", "user": {"username": "Lukas_Gloor"}}, {"_id": "43YoyQu7CWLSqdq2G", "postedAt": "2022-09-23T12:50:09.850Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I'm hoping to be rewarded for all the information hazards I've been keeping to myself, but, alas, I've been keeping them to myself so I can't prove it. And the virtue is somewhat negated by the fact that I'm hinting at their existence in the first place. :3</p>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "J6DmBYHrmEAg5xjLF", "postedAt": "2022-09-23T13:08:45.632Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Ryan, glad you liked the prize, and thanks for your feedback! Our partner has significant IP law and branding experience and does not share your concerns.</p><p>His perspective: the general case is that</p><ol><li><strong>Celebrating our ancestors is common practice.&nbsp;</strong>Long-dead famous people frequently get things named after them.&nbsp;</li><li><strong>Negative outcomes are unlikely.&nbsp;</strong>What you're proposing&nbsp;<i>could</i> happen, but is quite an edge case.</li><li><strong>Branding is important.&nbsp;</strong>A better-named prize can lead to more impact and improved community health.</li></ol><p>So why are we calling this “The Truman Prize?” instead of something like “The Anonymous EA Award”?&nbsp;</p><ol><li>There’s a reason why inspiring people from the past get things named after them. Could write a whole post on our thinking around this, but let’s just say we think having a community health prize with a more inspiring name would be more effective and lead to more impact.</li><li>Spending a lot of time on preventing low probability, low downside possibilities, is low EV.&nbsp;</li></ol><p>Things like this usually end up being really bureaucratic and could take months or years to approve, so the cost is higher than a simple quick email. Following this general approach to low probability, low downside risks, would lead to it being prohibitive to get things done.&nbsp;</p><p>It's low probability because first, a descendant of Truman would have to&nbsp;</p><ol><li><strong>Actually learn of this prize</strong> which is unlikely</li><li><strong>Not feel like we are honoring Truman</strong> by celebrating anonymous altruism, which seems unlikely.&nbsp;</li><li><strong>Care enough to actually ask us to change the name</strong>, which is also unlikely.&nbsp;</li></ol><p>And in the unlikely event that all three of those things happen, then we'll just change the name. Which is also low cost.</p>", "parentCommentId": "492amjnuvysXjR6zm", "user": {"username": "Meta"}}, {"_id": "8DyY66ZwZKhBahAxp", "postedAt": "2022-09-23T13:39:25.658Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Thanks for the flag! Was already aware of this but added a qualifier in the post above and added this to our org payout guidelines for extra redundancy.</p>", "parentCommentId": "nnJjEvJ7g7Y2GqaCm", "user": {"username": "Meta"}}, {"_id": "vYeNRmkcG4YzfFRPq", "postedAt": "2022-09-23T18:33:12.359Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>FWIW I'm not sure \"to be paid out when Greg no longer works for the government if local laws prohibit such awards\" (your edit) is sufficient under anti-lobbying protocols . A commitment to pay in future still looks and feels like a bribe / undue influence. I would worry that in some jurisdictions accepting could potentially be risk for someone's job or security clearance (another issue). Like I'm not saying prize payments to political or government figures cannot be done but just giving a heads up that making it work well might need some more thought and consultation and legal advice</p>\n", "parentCommentId": "8DyY66ZwZKhBahAxp", "user": {"username": "weeatquince"}}, {"_id": "XrZ6dxYyEEv87PCBt", "postedAt": "2022-09-23T21:41:34.860Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Urk, I wasn't trying to make fun of the prize. I think it's good. I was just trying to be silly-funny. This now a place where I can't rely on infinite charity, so I have to beware of how my silly-funny gets interpreted.</p>", "parentCommentId": "43YoyQu7CWLSqdq2G", "user": {"username": "Emrik"}}, {"_id": "nnTqaAtkSF4hEKsLa", "postedAt": "2022-09-23T21:59:15.204Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>What was inspiring about Truman?&nbsp;</p>", "parentCommentId": "J6DmBYHrmEAg5xjLF", "user": null}, {"_id": "ibdTWzPQmP58sesSM", "postedAt": "2022-09-24T10:03:10.164Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>What's the overall end goal or theory of change and how will you know this prize is working / track the impact of this?</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "cM5qnhStSsk3HAB7f", "postedAt": "2022-09-24T11:13:23.478Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Getting legal counsel advice was always the intended procedure internally. Thanks for pointing out that the way I worded it had the potential to be misconstrued so I've updated it again :)</p>\n", "parentCommentId": "vYeNRmkcG4YzfFRPq", "user": {"username": "Meta"}}, {"_id": "HNw2npATFTJuYGzZK", "postedAt": "2022-09-24T17:22:39.844Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I'm less certain that this is a low-probability risk, though I agree that it is honoring him, and should not be a problem. That said, I think we need to look into this and check with a lawyer - as I'm pretty sure the estate doesn't have perpetual rights to prevent naming after someone. If that's incorrect, we should consider a different name.</p>", "parentCommentId": "J6DmBYHrmEAg5xjLF", "user": {"username": "Davidmanheim"}}, {"_id": "vmXW27j56ydBo26PD", "postedAt": "2022-09-24T17:25:32.626Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Yeah, I agree we should consult a lawyer about it, but it's 50 years after his death, which seems like a sufficient time that objections about reputation or damage to his estate wouldn't hold water.<br><br>Edit: See other response - this should not be a problem.</p>", "parentCommentId": "F3AsiHsWj6aTJfbyP", "user": {"username": "Davidmanheim"}}, {"_id": "r7jHkwrGYkb3d6Sn2", "postedAt": "2022-09-24T17:30:24.862Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>They would be eligible for the recognition, even if they can't accept a prize. And the amount is mostly about recognition - it's certainly not life-changing for anyone working in civil service.</p>", "parentCommentId": "gs6ughvXsEwwL8pAa", "user": {"username": "Davidmanheim"}}, {"_id": "9ftgEoHJE9HwTkqN4", "postedAt": "2022-09-24T17:35:57.345Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Organizations or people that did the type of thing you're suggesting wouldn't get an award. Obviously. The award is for doing good things, not hiding bad ones.<br><br>And if someone misunderstood this, and for whatever reason nominated such behavior, I would expect that anyone on the prize committee would, if anything, highlight the misbehavior within the EA community, and the organization or person &nbsp;in question would have much more difficulty getting funded, hired, or supported in the future.</p>", "parentCommentId": "ubRQf6nuoGbE2kQri", "user": {"username": "Davidmanheim"}}, {"_id": "pZq66Zy7CEKFfYSLA", "postedAt": "2022-09-24T18:41:22.096Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>FWIW, my guess would be that it is, or can be, legal, but that if they confronted you, you would want to change the name anyway.</p>", "parentCommentId": "vmXW27j56ydBo26PD", "user": {"username": "RyanCarey"}}, {"_id": "xo5xzFfXFWNoFXtiC", "postedAt": "2022-09-24T19:19:24.184Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Most of the examples you gave seem bad:</p>\n<ol>\n<li>\n<p>A political figure lies about Sam's accomplishment to manipulate people into accepting it.</p>\n</li>\n<li>\n<p>Greg hides his involvement with a controversial field from the public or the elected officials and avoids scrutiny.</p>\n</li>\n<li>\n<p>An organisation hides the involvement of an unwanted person from the public (who are potential donors) and from partners. Max claims he is reformed, but how do the prize judges know? Is it really their job to decide? (This is actually relevant to ongoing EA-adjacent research.)</p>\n</li>\n<li>\n<p>Again it is quite unclear why disclosing Steve's involvement would undermine the project - but if it does, why does this justify hiding it? Maybe it's really bad to accept Steve's contributions - again, is it for you to judge?</p>\n</li>\n</ol>\n<p>Edit: there are lots of downvotes. Would someone care to explain why this is a \"bad comment\" or what you disagree with?</p>\n", "parentCommentId": "9ftgEoHJE9HwTkqN4", "user": {"username": "Guy Raveh"}}, {"_id": "6xw3ZwciuYnvKe7Ky", "postedAt": "2022-09-24T19:48:13.542Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I'm confused why this is downvoted. The only connection with Truman I see is the the quote attributed to him at the top of the post. Drew's comment implies that Truman himself was an inspiring person - perhaps it's worth explaining what was inspiring about him besides him coining a relevant quote?&nbsp;</p>", "parentCommentId": "nnTqaAtkSF4hEKsLa", "user": null}, {"_id": "6vaoasSdJigCvBwCe", "postedAt": "2022-09-24T21:36:45.069Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>It's two years' salary!</p>\n", "parentCommentId": "r7jHkwrGYkb3d6Sn2", "user": {"username": "Khorton"}}, {"_id": "aKBym3NWk3uxy4Twx", "postedAt": "2022-09-24T21:56:45.086Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>The post says individual prizes are $5k-$10k. I'm not sure why the post title says $100k - maybe that's the total amount of prize money available.&nbsp;</p>", "parentCommentId": "6vaoasSdJigCvBwCe", "user": null}, {"_id": "6KjnGck8JtaKrfLCz", "postedAt": "2022-09-25T09:10:10.913Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>It's not a single prize - as the examples show, individual prizes are likely in the $5-10k range.</p>", "parentCommentId": "6vaoasSdJigCvBwCe", "user": {"username": "Davidmanheim"}}, {"_id": "GmxX2eDgcGyooCB2C", "postedAt": "2022-09-25T10:07:20.230Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Thank you - why would they say in the title is a $100k prize???</p>\n", "parentCommentId": "aKBym3NWk3uxy4Twx", "user": {"username": "Khorton"}}, {"_id": "ziD6YXEeztPAWpMWY", "postedAt": "2022-09-25T10:07:38.654Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Thank you - why would they say in the title is a $100k prize???</p>\n", "parentCommentId": "6KjnGck8JtaKrfLCz", "user": {"username": "Khorton"}}, {"_id": "oTYoQmNREwDyirC2u", "postedAt": "2022-09-25T11:22:26.637Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I also noticed unorthodox voting patterns on this post - my first comment was downvoted the minute I posted it. But it doesn't seem like many people would look at that criticism (polite, constructive, sent to the authors in advance) and think it should have negative karma. So basically, I wouldn't worry too much about it.</p>\n", "parentCommentId": "6xw3ZwciuYnvKe7Ky", "user": {"username": "RyanCarey"}}, {"_id": "D9gW8XMHYeEPmuJSe", "postedAt": "2022-09-25T12:18:16.623Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I don't know why sphor's comment was downvoted (I'm also confused by that), but for Ryan's, I can at least speak for myself of why I downvoted it:</p><ol><li>I strongly disagree with the comment and think that<ol><li>&nbsp;This sort of thinking is paralyzing for the EA movement and leads to way more potential founders giving up on ideas, bouncing from the EA movement, not posting on the Forum, or moving so slowly that a <i>lot</i> of impact is lost. &nbsp;(I might write a post about this because I think it's important and neglected in the movement)</li><li>It derails the conversation on something I consider to be a small detail about an improbable small-downside outcome, and I wanted more people focusing on more fruitful potential criticisms or points about the prize.&nbsp;</li></ol></li><li>While a lot of the comment was polite and constructive, it also said that we were being \"shifty\", which felt unnecessarily accusatory. I think if that word was changed I would change it from a strong downvote to just a downvote</li></ol><p>Of note, I just strongly disagree with this comment/idea. In general, I think Ryan is great and consider him a friend.&nbsp;</p>", "parentCommentId": "oTYoQmNREwDyirC2u", "user": {"username": "katherinesavoie"}}, {"_id": "jRzbYvzmFAhHP2ugx", "postedAt": "2022-09-25T13:59:20.636Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>There is currently a total of $100,000 in funding for the prize, so up to that much will be awarded, total. (There is obviously some possibility that it will receive further funding if many prizes are given out, and funders see it as valuable enough to fund further.)</p>", "parentCommentId": "ziD6YXEeztPAWpMWY", "user": {"username": "Davidmanheim"}}, {"_id": "MtbinFKq4dgHRAieq", "postedAt": "2022-09-25T14:04:02.387Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I think that you're assuming the judges will give awards to bad / damaging actions. Obviously, the context will matter, and given who the judges are, I expect that they will be first, not interested in giving out a prize for bad things, and second, cognizant of the potential reputational and other issues which might be involved in giving out a prize.<br><br>And regarding \"is it for you to judge?\" I think the answer is yes - community leaders, including those who are judges for the prizes, are absolutely the people who would be making decisions about the types of things that the community should recognize and honor, in consultation with others who might be needed in order to investigate or determine what is reasonable. Hence the structure of the prize.</p>", "parentCommentId": "xo5xzFfXFWNoFXtiC", "user": {"username": "Davidmanheim"}}, {"_id": "rnTg4bp5fZpeMDaYm", "postedAt": "2022-09-25T14:28:47.765Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Sure, but that's not what it means to advertise a \"$100,000 prize\"</p>\n", "parentCommentId": "jRzbYvzmFAhHP2ugx", "user": {"username": "Khorton"}}, {"_id": "BJeGd3vu45Gere9aJ", "postedAt": "2022-09-25T20:47:57.808Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<blockquote>\n<p>I think that you're assuming the judges will give awards to bad / damaging actions.</p>\n</blockquote>\n<p>I'm assuming the judges will give prizes to actions that fit the outline of the examples in the post. If 80% of them seem bad/damaging, how should I trust that the judges will only issue prizes based on the singular better example?</p>\n", "parentCommentId": "MtbinFKq4dgHRAieq", "user": {"username": "Guy Raveh"}}, {"_id": "DDC5dnMRfRtrukjkZ", "postedAt": "2022-09-27T17:42:00.030Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Agreed, this definitely should have been clearer.</p>", "parentCommentId": "rnTg4bp5fZpeMDaYm", "user": {"username": "Davidmanheim"}}, {"_id": "nRgvjdhjKwKQxZgsg", "postedAt": "2022-09-28T06:00:10.103Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Hi Ryan,<br><br>Having now done some research, I really don't think this is a thing to worry about. The Truman presidential library is run by the <a href=\"https://www.archives.gov/\"><u>National Archives and Records Administration</u></a><u>, </u>without the involvement of the family, or a foundation (unlike those of &nbsp;living and recently deceased presidents.) There is a Truman Foundation, but it does not operate as part of his estate, and seems to have no connection to the family. There seems to be no estate which even could give permission to use the name. I don't think anyone has the impression that Truman's family or estate authorized this, and as above, from my research, they couldn't now have done so, as there is no-one authorized to do it. Overall, it seems like it's really not a problem.&nbsp;<br><br>And the ACM rules are for living and recently deceased individuals, not historical figures - and while I could see an argument that people who died a half century ago might still be a problem, I don't think it holds water.</p>", "parentCommentId": "492amjnuvysXjR6zm", "user": {"username": "Davidmanheim"}}, {"_id": "GzatYB2EYuyCmLgJJ", "postedAt": "2022-09-28T06:02:50.109Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Per my other comment, it seems there isn't anyone to \"confront us,\" or at least, no one &nbsp;who obviously can authorize this, which makes objections seem unlikely and unreasonable.</p>", "parentCommentId": "pZq66Zy7CEKFfYSLA", "user": {"username": "Davidmanheim"}}, {"_id": "HRjbsHzP7qEC4NL92", "postedAt": "2022-09-28T07:26:21.452Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>You're still stridently assuming that the judges will fail to use their best judgement, or that you think they &nbsp;are too dumb to realize that obvious failure modes are bad...</p>", "parentCommentId": "BJeGd3vu45Gere9aJ", "user": {"username": "Davidmanheim"}}, {"_id": "2qxhNhhsao8oxehAa", "postedAt": "2022-09-29T05:54:56.673Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Yes, that is the total funding currently available.</p>", "parentCommentId": "aKBym3NWk3uxy4Twx", "user": {"username": "Davidmanheim"}}, {"_id": "DDwMrWjkE62oAGWyh", "postedAt": "2022-09-29T05:55:48.979Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Superlinear is structured so that donors can top up the prize amounts, and I am hopeful that if this prize is found to be helpful and/or valuable, that will occur.</p>", "parentCommentId": "TvbEByHq53EKLLvXx", "user": {"username": "Davidmanheim"}}, {"_id": "4HvdpbsYa7neMFNpG", "postedAt": "2022-09-29T12:35:42.569Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>I suggest \"$100k prize pool\"</p>", "parentCommentId": "DDC5dnMRfRtrukjkZ", "user": {"username": "nathan"}}, {"_id": "fmiRjvmxXDgrbytWB", "postedAt": "2022-09-29T14:29:27.786Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>\"<strong>Theory of change:&nbsp;</strong>EA promotes caring about effectiveness over other goals like getting credit, but wanting credit or recognition for your work is natural. Rewarding people for maximizing impact over credit increases the health and future effectiveness of the community.\"<br><br>You're asking people to trade-off public credit/recognition with the possibility of anonymous cash prizes. I'm sure no one is going to turn down free money, but I'm unconvinced many people would have kept their brilliant ideas to themselves were it not for the chance to receive $5-10k.</p><p>This sounds more like a prize to reward people for 'doing the right thing', than a prize that will actually lead to people 'doing the right thing' more often. There's nothing wrong with that per say - but I wanted to bring that out and see if I have misunderstood the idea.</p>", "parentCommentId": null, "user": null}, {"_id": "aFBMHhhC7rcRDdeF7", "postedAt": "2022-09-30T10:34:38.338Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Good suggestion! Updated the description.</p>", "parentCommentId": "4HvdpbsYa7neMFNpG", "user": {"username": "Meta"}}, {"_id": "X2Dwsenzk9fEHzvaB", "postedAt": "2022-10-03T06:51:43.949Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<blockquote><p>You're asking people to trade-off public credit/recognition with the possibility of anonymous cash prizes.</p></blockquote><p><br>No, we're fostering a norm that taking credit is not always the best way to be effective, and rewarding people, often not anonymously, for abiding by that norm. It would be great if there are people in the EA community who wouldn't have considered this question, but because they see the prize they decide to consider it, or decide to actually give up credit and be more impactful.</p>", "parentCommentId": "fmiRjvmxXDgrbytWB", "user": {"username": "Davidmanheim"}}, {"_id": "m32HEA5w5RuHQZuHX", "postedAt": "2022-10-04T01:48:27.664Z", "postId": "bvK44CdpG7mGpQHbw", "htmlBody": "<p>Is this prize just for people who self-identify as effective altruists? I cannot tell from the post - some parts seem to imply it's just for Effective Altruists, and others seem to imply it's open to anyone.&nbsp;</p>", "parentCommentId": null, "user": null}]