[{"_id": "CFPiwZZvtcbnpS3ka", "postedAt": "2024-03-29T00:43:58.006Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>Important to note: I archived the Washington Post homepage <a href=\"https://web.archive.org/web/20240329003751/https://www.washingtonpost.com/\">here</a> and it showed Robinson's op-ed, but when I went to <a href=\"https://www.washingtonpost.com\">https://www.washingtonpost.com</a> itself immediately after, at ~5:38 pm San Francisco time, it was nowhere to be found! (I was not signed in for either case).</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "bgcv76tHxo4ZygujC", "postedAt": "2024-03-29T01:18:45.190Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>Interesting! I see it under “Opinions” on their homepage when I check now—maybe was something to do with them refreshing the content on the page at a certain point today when you checked, or something else.</p>\n", "parentCommentId": "CFPiwZZvtcbnpS3ka", "user": {"username": "2ndRichter"}}, {"_id": "ZMchmaKwEbPRhnkQY", "postedAt": "2024-03-29T01:49:28.050Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>The Washington Post article rings quite hollow. It claims that CEA and other EA organizations have taken FTX's downfall as an opportunity for \"reflection and institutional reform\", and cites the legal investigation CEA sponsored as evidence of this.&nbsp;</p><p>However, as far as I can tell the primary goal of that legal investigation was mostly PR-related, trying to clear CEA's name and prove to the outside world that no one knew the full extend of FTX's fraud, and was not aimed at facilitating an internal reflection process (or at the very least people I've talked to at CEA described it to me as something they did not at all expect to be helpful as part of a reflection process, and multiple described the constraints imposed by it as harmful).&nbsp;</p><p>If-anything the legal investigation seems to have actually substantially interferred with CEA reflection processes, with Will MacAskill himself telling me that the EV board prevented him from publishing his reflections on FTX due to legal and PR concerns, and due to it maybe making the legal investigation seem less legitimate.&nbsp;</p><p>Overall, the piece reads like a puff piece and not like something that displays real reflection. I mean, it's fine to write puff-pieces from time to time, but it rings hollow in a world where actual institutional reform as a result of FTX has been almost completely absent.</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "dPpaiuvyhgkvQyfYG", "postedAt": "2024-03-29T02:16:44.870Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>That's interesting, it still doesn't show anywhere on my end. I took this screenshot around 7:14 pm, maybe it's a screen size or aspect ratio thing.</p><figure class=\"image image_resized\" style=\"width:45.02%\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/k4i1te0jaipn0dcv378g\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/lvanplsffe4eedocgbhc 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/l1asl4b9letwqzcyejzi 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/dvo6n3bkv9zyatzz0pcv 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/ipjwtl0yry1fgpdf08gd 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/wvtm83by2ma6amngcuzd 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/nv1dqzpuepaonakal2mw 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/s1gonqvsyk2x1izudqt5 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/noyuphuu2x7su0hpry6p 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/f1qbqgdgqdikodugm8gj 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dPpaiuvyhgkvQyfYG/kx2lou7myq03rdmpsmdz 1920w\"></figure>", "parentCommentId": "bgcv76tHxo4ZygujC", "user": {"username": "trevorw96"}}, {"_id": "z5etD7ENe2E3mT3qR", "postedAt": "2024-03-29T02:21:32.740Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>It’s in the image on the lower far right— “After Bankman-Fried, effective altruists won’t be fooled again, Opinion by Zach Robinson.”</p>\n", "parentCommentId": "dPpaiuvyhgkvQyfYG", "user": {"username": "2ndRichter"}}, {"_id": "AMdiELPhxNTJviJBT", "postedAt": "2024-03-29T05:04:53.681Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>Ah, my bad, I did a ctrl + f for \"sam\"! Glad that it was nothing.</p>", "parentCommentId": "z5etD7ENe2E3mT3qR", "user": {"username": "trevorw96"}}, {"_id": "e6HLqkuQxvbJncfX3", "postedAt": "2024-03-29T05:10:57.889Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>If EA currently</p><ol><li>is in the middle of a <a href=\"https://www.lesswrong.com/posts/xDNyXGCDephBuNF8c/dark-forest-theories\">Dark Forest</a> (e.g. news outlets systematically following emergent consumer interest in criticizing EA and everything it stands for)</li><li>perceives themselves as currently being in the middle of a dark forest or at risk of already being in a dark forest (which might be hard to evaluate e.g. due to the dynamics described in <a href=\"https://www.lesswrong.com/posts/KpMNqA5BiCRozCwM3/social-dark-matter\">Social Dark Matter</a>)&nbsp;</li><li>expects to enter a dark forest at some point in the near future (or the world around them to turn into a dark forest e.g. if China invades Taiwan and a wide variety of norms go out the window)</li></ol><p>then I imagine that it would be pretty difficult to design institutional constraints that are resilient to observation and exploitation by a wide variety of possible adversaries, and balancing those same institutional constraints to simultaneously be visible and credible/satisfying to a wide variety of observers?</p>", "parentCommentId": "ZMchmaKwEbPRhnkQY", "user": {"username": "trevorw96"}}, {"_id": "dSZjGsdojKGTk74iu", "postedAt": "2024-03-29T11:03:04.629Z", "postId": "BvnbcsGh8gQ86cTqr", "htmlBody": "<p>I think you're missing some important ground in between \"reflection process\" and \"PR exercise\".</p><p>I can't speak for EV or other people then on the boards, but from my perspective the purpose of the legal investigation was primarily about helping to facilitate justified trust. Sam had by many been seen as a trusted EA leader, and had previously been on the board of CEA US. It seemed it wouldn't be unreasonable if people in EA (or even within EV) started worrying that leadership were covering things up. Having an external investigation was, although not a cheap signal to send, much cheaper in worlds where there was nothing to hide compared to worlds where we wanted to hide something; and internal trust is extremely important. Between that and wanting to be able to credibly signal to external stakeholders like the Charity Commission, I think general PR was a long way down the list of considerations.</p>", "parentCommentId": "ZMchmaKwEbPRhnkQY", "user": {"username": "Owen_Cotton-Barratt"}}]