[{"_id": "hyWA5J85Z2HKM2khE", "postedAt": "2022-08-26T11:39:30.824Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thank you for doing this and congratulations!&nbsp;</p><p>I haven't managed to read the full report yet unfortunately, but I have a few questions/criticisms already- sorry to move onto these so quickly, but nonetheless I do think its important. (I tried to write these in a more friendly way, but I keep on failing to do, so please don't take the tone as too aggressive, I am really not intending it to be, it just keeps coming across that way ! Sorry (: ) :</p><ul><li>There are no mentions of systemic or cascading risks in the report. Why is this?</li><li>You don't seem to engage with much of the peer-reviewed literature already written on climate change and GCRs. For example: Beard et al 2021, Kemp &nbsp;et al 2022, Richards et al 2021. Don't get me wrong, you might disagree or have strong arguments against these papers, but it seems to some degree like you have failed to engage with them</li><li>You don't seem to engage with much of the more complex systems aspects of civilisation collapse/ existential risk theory. Why is this?</li><li>There are no mentions of existential vulnerabilities and exposures, and you seem to essentially buy into a broadly hazard based account. The subdivision into direct and indirect effects further seems to support this idea. In this way you seem to ignore complex risk analysis. Why is this?</li><li>You seem to broadly ignore the work that went on around \"sexy vs unsexy risks\" and \"boring apocalypses\" and the more expansive work done to diversify views of how X-Risks may come about. Why is this?</li></ul><p>Thanks for the report, and I am sure I will have more questions the more I go through it. I guess my major concern with this sort of stuff is it is likely that this work will go down (unrelated to its quality, and I am not saying its bad) as a \"canonical\" work in EA, so I think you perhaps have a responsibility, even if you in the end reject some of this scholarship, to engage in a lot of this (peer reviewed) scholarship on GCRs and X-Risks that has occurred in the \"third wave\" research paradigm of Existential Risk Studies, and I am slightly concerned that you appear not to have engaged with this literature!</p>", "parentCommentId": null, "user": {"username": "Gideon Futerman"}}, {"_id": "bK5AvadMBbYsKxeeQ", "postedAt": "2022-08-26T12:54:33.802Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Great to see such a detailed, focused, and well-researched analysis of this topic, thank you. I haven't yet read beyond the executive summary yet other than a skim of the longer report, but I'm looking forward to doing so.</p>", "parentCommentId": null, "user": {"username": "Sean_o_h"}}, {"_id": "tujsKcedbLvSrCcLj", "postedAt": "2022-08-26T13:08:55.814Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thank you for writing this - looking forward to diving into the full report this weekend. Congratulations on finishing what must have been a major undertaking!&nbsp;</p>", "parentCommentId": null, "user": {"username": "davija10."}}, {"_id": "sCjjqSx6fJgoJzRQ2", "postedAt": "2022-08-26T13:58:18.842Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hello Gideon</p><ul><li>I don't think explicit discussion of cascading risks would change the fundamental conclusions, and cascading risks are implicitly discussed at several points in the piece.&nbsp;</li><li>I have read the papers you mention. You will find (attempted) refutations of many of the points in those articles scattered across the report. In earlier drafts, I did have a direct response to those papers, but it is now all dealt with in different sections of the main report.&nbsp;</li><li>I don't agree with the 'everything is connected' idea of society, such that society is incredibly sensitive to mild climatic changes. If that is what you mean by complex systems theory. And I defend that view at length in the report.&nbsp;</li><li>There are many many different ways of conceptually dividing up an analysis of climate risk. The direct/indirect way is conceptually exhaustive and so insofar as I have accurately covered the direct/indirect risks, I have accurately covered overall climate risk</li><li>True that I did ignore this, explicitly at least. I do not see how it would affect my conclusions. There is no indication from the climate literature that climate change would cause anything close to a boring apocalypse. Also, I &nbsp;think it is very obvious from study of sexy and unsexy risks that the sexy risks (bio, AI) &nbsp;are far far bigger than the unsexy risks.&nbsp;</li></ul><p>I did engage a lot with that literature, I just don't talk about it directly. &nbsp;One could also say that Beard et al and Kemp et al don't engage with a lot of relevant literature, which I do discuss in my piece. eg Beard et al doesn't engage with the literature suggesting that we are not going to run out of phosphorous and soil; Kemp et al doesn't engage with the literature on assumptions about coal use in integrated assessment models.&nbsp;</p>", "parentCommentId": "hyWA5J85Z2HKM2khE", "user": null}, {"_id": "bK6M4cjzTuL4LDdfh", "postedAt": "2022-08-26T14:35:15.861Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I have an issue with Takakura and other models. All models I've seen measure climate impacts in a) a social cost of carbon, whose value is based on a pure time preference discount factor, or b) impacts by the end of the 21st century, which ignores impacts into future centuries. Both of these methods are incompatible with a longtermist ethical view.</p>\n<p>If we wanted to get a longtermist-compatible estimate of climate damages, we would have to either calculate a social cost of carbon with a zero discount factor (except for growth-adjustments), or calculate total climate damages over hundreds of years. None of the studies I've seen do this. Even worse, we know that climate models are highly sensitive to the choice of discount factor, which is only possible if a large proportion of damages occur in the future, so we could be underestimating this future damage by a lot. How do you deal with this issue when studying climate change from a longtermist perspective?</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "ck94myvGmtbt5NTB5", "postedAt": "2022-08-26T15:33:32.746Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>My thought here would be that if climate effects (or other factors) don't substantially reduce the rate of technological and economic progress over the 21st century, then effects after the 21st century might be likely to be pretty small &nbsp;because our capacity to mitigate them would be enormous. If world real GDP keeps growing at a 3% annual rate, then GDP would be at about a quadrillion dollars/year in 2100 if I'm doing my math right (of course, one might argue it's likely to be much higher due to AGI, much lower due to slowing technological progress etc.). But that kind of enormous world output would make solutions like scaling up direct air capture to get massively negative carbon emissions feasible. In light of that, it makes a lot more sense to worry about how climate change impacts humanity's trajectory over the next 80 years than it does to worry about what the impacts will be after 2100.&nbsp;</p>", "parentCommentId": "bK6M4cjzTuL4LDdfh", "user": {"username": "MHR"}}, {"_id": "nzKcwgacpvrSBcLKQ", "postedAt": "2022-08-26T16:04:22.826Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Climate-economy models factor in technological and economic progress, and yet their SCC estimates are hugely sensitive to the discount rate. The only way I can see this happening is if climate damages in the future are very large.</p>\n", "parentCommentId": "ck94myvGmtbt5NTB5", "user": {"username": "therealslimkt"}}, {"_id": "jPWdebHqHGkEQEBin", "postedAt": "2022-08-26T16:05:02.150Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi Karthik thanks for this comment.&nbsp;</p><p>On your first comment, the Takakura et al (2019) study I mention and other models estimate a climate damage function, which is independent of a discounting module. The social cost of carbon is a function of a socioeconomic module, a climate module, a damages module and a discounting module as shown in the schematic below</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_120 120w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_240 240w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_480 480w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_600 600w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_840 840w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_960 960w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_1080 1080w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7619319d4061c9948a9f05805b36bdae70661f2fe9e1495.png/w_1126 1126w\"><figcaption>Source: Resources for the Future, <i>The Social Cost of Carbon: Advances in Long-TermProbabilistic Projections of Population, GDP, Emissions, and Discount Rates</i>, October 2021<br>&nbsp;</figcaption></figure><p>It is true that some models discount future costs in part with pure time preference. But I am here talking about the damage module which is the undiscounted aggregate damages, not the social cost of carbon.&nbsp;</p><p>Also, it is not true that all studies have a positive rate of pure time preference. The Stern review is one prominent counterexample, for instance.&nbsp;</p><p>I agree that some (though not all) models typically only consider impacts up to 2100. However, impacts up to 2100 are long-term relevant. If climate-economy models suggested that climate change would cause extinction or civilisational collapse or stagnation before 2100 (as some people seem to think is plausible), this would be long-term relevant. I agree that to get a complete picture, we would need to consider impacts past 2100, but we can still learn a lot from models that only go to 2100. Moreover, it would be practically impossible to build a useful complete climate-economy model running eg 1 million years into the future. It is more informative to explore how climate change might affect proxies of things that might have long-term import such as the risk of civilisational collapse or extinction. If you think we are in the hingiest or most important century, then the impacts of climate change this century are in fact the main thing that determine its long-term effects</p>", "parentCommentId": "bK6M4cjzTuL4LDdfh", "user": null}, {"_id": "jr9Ygw3hCELPAHces", "postedAt": "2022-08-26T16:39:19.228Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>(Edit: it seems my fears were right, lol)</p><p>Thanks for posting this Gideon, I shared similar issues to you but didn't make a reply because I feared the it would would be dismissed or ignored. It is gratifying to see that John has replied, but epistemically concerning that your entirely reasonable criticisms are being so heavily downvoted: at present you average 1 point from 13 votes.</p><p>These are critiques you would expect anyone with a background in climate risk to make and I don't see any good reason for them to have been dismissed by so many fellow EAs. Could any of the downvoters explain their decision?</p>", "parentCommentId": "hyWA5J85Z2HKM2khE", "user": {"username": "A.C.Skraeling"}}, {"_id": "shpqdFwm6P8zo8say", "postedAt": "2022-08-26T17:40:18.260Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Yes, whatever the subject, whatever the thread, would down voters please explain their vote. &nbsp; How are authors supposed to respond to and maybe accommodate down voter's concerns if down voting remains a secret anonymous procedure containing no useful information beyond \"don't like it\"? &nbsp; If clicking on things and running is what works for someone, consider Facebook. &nbsp;Thanks.</p>", "parentCommentId": "jr9Ygw3hCELPAHces", "user": {"username": "Phil Tanny"}}, {"_id": "4KZmW9fJbpDmKmKPA", "postedAt": "2022-08-26T17:44:43.020Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I disagree with that. Downvotes are often valuable information, and requiring people to explain all downvotes would introduce too high a bar for downvoting.</p>", "parentCommentId": "shpqdFwm6P8zo8say", "user": {"username": "Stefan_Schubert"}}, {"_id": "S2EJGnynxmkhTuFCw", "postedAt": "2022-08-26T17:49:30.740Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think this strongly contributes to groupthink.</p><p>People will subconsciously adapt their views to match the majority to some extent, and assume that a post or comment has the rating it does for a reason. This is exacerbated by the [issues around hierarchy and hero-worship EA sometimes has.](https://forum.effectivealtruism.org/posts/DxfpGi9hwvwLCf5iQ/objections-to-value-alignment-between-effective-altruists)</p>", "parentCommentId": "shpqdFwm6P8zo8say", "user": {"username": "A.C.Skraeling"}}, {"_id": "zkiRLknMNomvZPRLK", "postedAt": "2022-08-26T17:52:29.897Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>In all cases perhaps, but it is strange to see objections that would be super obvious top-of-the-head stuff in climate circles dismissed out of hand here.</p><p>(Also can someone who knows more about the Forum than me explain how this reply has 51 points from 13 votes? Even if strong-upvotes count as double this is extremely inflated. Are the totals extremified or something? Is it multiplicative?)</p>", "parentCommentId": "4KZmW9fJbpDmKmKPA", "user": {"username": "A.C.Skraeling"}}, {"_id": "5FqJfkv97pRxDKyf8", "postedAt": "2022-08-26T17:59:34.199Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>(I have a few thoughts on this but it’s being marked as spam for some reason, possibly length. I’m going to post this as a short response and then edit in the content. Please let me know if you can see it.)</p><p>Hi John, thanks for the post!</p><p>I'll leave an in-depth response to Gideon, but I have a few points that I think would be helpful to share. In short, your response worries me. I have tried to keep the prose below inoffensive in tone, but there is a trade-off between offensive directness and condescending obfuscation. I hope I have traced the line accurately.&nbsp;</p><ul><li>You may not think significant discussion of cascading risks would change the fundamental conclusions of your report, but many researchers, often those with considerably more experience and expertise in climate risk (e.g. the IPCC), do: strongly so. Surely in a book-length report there is room for a few pages?</li><li>If you have refuted arguments, is it not academic best practice to cite the papers you respond to? In any case, if you know of and have read the papers, are we to understand that you believe many (if not most) peer-reviewed papers on Global Catastrophic and Existential climate risk are not worth mentioning anywhere in 437 pages of discussion?</li><li>This response causes me the most concern. That is simply not what complex systems theory is. Either you are aware that this characterisation is highly inaccurate and unfair, or you are not. If the former, I am disappointed by your (apparent) dismissiveness and willingness to mischaracterise. If the latter, I wonder how you could have done anything close to sufficient research into one of the foundational components of many studies of climate risks.</li><li>It is true that there are many conceptual frameworks for climate risk, and in a study of any topic you are generally expected to state, explain, and justify your conceptual framework. This is especially true when the framework you use (i.e. that of the Techno-Utopian Approach) has been strongly critiqued, for instance in Democratising Risk (Cremer and Kemp, 2021), another highly consequential paper you do not appear to have engaged with or cited. The dichotomy of 'direct' and indirect' risks may be exhaustive, but this is not the only criterion for an adequate theoretical framework. To be somewhat, but logically coherently glib, we could make the same argument for categorising phenomena according to whether their names contained an odd or even number of letters.</li><li>I also disagree with this point, especially the final sentence, but there is little to engage with: simply assertions. Let us agree to disagree.</li></ul><p>Beard et al. and Kemp et al. are each less than 5% of the length of your piece. Of course they cover less ground. There is a difference between a 10- or 20-page paper not mentioning every single caveat in every single work they cite, and one (1) failing to substantively engage with or even cite almost all GCR-specific climate research, (2) not explicitly stating nor justifying one's methodology in the face of strong critique, and (3) disregarding (in complex systems studies) a massive component of studies of climate risk, wider GCR (e.g. Fisher and Sandberg 2022), and the studies of Earth-system dynamics in general without explanation or justification.<br><br>Do you expect to subject this work to peer-review, and if not, why?</p>", "parentCommentId": "sCjjqSx6fJgoJzRQ2", "user": {"username": "A.C.Skraeling"}}, {"_id": "9Kr8nP3tDr4kmF5ML", "postedAt": "2022-08-26T17:59:46.555Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I wouldn't characterise it as dismissing out of hand.</p>", "parentCommentId": "zkiRLknMNomvZPRLK", "user": {"username": "Stefan_Schubert"}}, {"_id": "P6KLydaiPc7YJNx7h", "postedAt": "2022-08-26T18:03:46.532Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>What would you call it?</p><p>I suppose all I have to say is that I often see very reasonable critiques downvoted through the floor without explanation worryingly often.<br><br>I haven't theorised very much about the cause, but the phenomenon correlates suspiciously well with substantive or strong criticism of prominent figures within EA.</p><p>If this perception is accurate, it does not seem like good epistemic practice.</p><p>(This one has 14 points from 3 votes? Do three strong-upvotes produce 14 overall karma? Why?)</p>", "parentCommentId": "9Kr8nP3tDr4kmF5ML", "user": {"username": "A.C.Skraeling"}}, {"_id": "zfAPqqTWgwLRWn4sA", "postedAt": "2022-08-26T18:53:50.892Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>(Case in point for my comment about downvoting, &nbsp;community hierarchy, and groupthink, below)&nbsp;</p>", "parentCommentId": "5FqJfkv97pRxDKyf8", "user": {"username": "A.C.Skraeling"}}, {"_id": "TdJSmRZazSxGALrDf", "postedAt": "2022-08-26T19:22:45.149Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I'm interested to see your in depth response to me</p>\n", "parentCommentId": "5FqJfkv97pRxDKyf8", "user": {"username": "Gideon Futerman"}}, {"_id": "SftypBCmm5waNFFBE", "postedAt": "2022-08-26T20:10:24.439Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I strongly upvoted this because it was at -4 karma when I saw it and that seems way too low. That said, I understand the frustration people feel at a comment like this that would lead them to downvote. It raises far too many questions for the OP to answer all at once, and doesn't elaborate on any of them enough for the OP to respond to the substance of any claim you make. This is the kind of comment that is very hard to answer, regardless of its merit.</p>\n", "parentCommentId": "hyWA5J85Z2HKM2khE", "user": {"username": "therealslimkt"}}, {"_id": "S3perNaKgfAeWSkJJ", "postedAt": "2022-08-26T20:19:29.276Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I meant 'I'll leave <i>the</i> in-depth response to Gideon'. What you say speaks for itself: if Halstead presented this at a climate science org these would be some of the first questions asked and I'm puzzled (+ a bit weirded out, to be frank) as to why they're getting such a hostile response.</p>", "parentCommentId": "TdJSmRZazSxGALrDf", "user": {"username": "A.C.Skraeling"}}, {"_id": "rvxMQFEBiJhvNA8cG", "postedAt": "2022-08-26T20:20:06.493Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote>\n<p>If you think we are in the hingiest or most important century, then the impacts of climate change this century are in fact the main thing that determine its long-term effects</p>\n</blockquote>\n<p><strong>This is untrue if the things that make this century hingey are orthogonal to climate change.</strong> If this century is particularly hingey only because of AI development and the risk of engineered pandemics, and climate change will not affect either of those things, then the impacts of climate change this century are not especially important relative to future centuries, even if this century is important relative to future centuries.</p>\n<p>All the indirect effects of climate that you consider are great-power conflict, resource conflict, etc. I have not seen arguments that claim this century is especially hingey for any of those factors. Indeed, resource conflict and great power conflict are the norm throughout history. So it seems that the indirect effects of climate on these risk factors is not only relevant for the 21st century but all centuries afterwards.</p>\n<p>Takakura does not have a discounting module but considering impacts only up to 2100 is functionally the same as discounting all impacts after 2100. Obviously impacts up to 2100 are relevant to longtermists - my point is that they could be a substantial underestimate of its long-term effects. And you can improve on that substantially with a model that considers 500 years or something similar. It's a baffling dichotomy to say that you can either consider impacts up to 2100 or millions of years.</p>\n", "parentCommentId": "jPWdebHqHGkEQEBin", "user": {"username": "therealslimkt"}}, {"_id": "MPbscmnKYwDPxoGBm", "postedAt": "2022-08-26T20:20:32.204Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Perhaps that's fair, certainly the asking too many questions part. I am less sure that it doesn't expand enough, because I would like to give John credit to suggest he knew what bits of the literature he was excluding.\nMore generally, I think my concern is a post like this may quickly establish itself as \"orthodoxy\" so I wanted to raise my concerns as early as possible, but perhaps I should have waited a bit of time to do a more comprehensive response. Perhaps I will learn for next time</p>\n", "parentCommentId": "SftypBCmm5waNFFBE", "user": {"username": "Gideon Futerman"}}, {"_id": "xZaG5SuNMtBGmZNwk", "postedAt": "2022-08-26T20:44:20.731Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I can see where you're coming from here but I don't think the specifics really apply in this case.</p><p>There are many questions to raise about this google doc, and it seems fair to the reader to ask them all in one place rather than drip-feeding throughout a tree of replies and reply-replies. If responding to them all would take up too much of Halstead's time, he can say so, no?</p><p>There's not usually very much to elaborate when it comes to questions of omission: x is an important aspect of climate risk, Halstead has not mentioned x.</p><p>I suppose you could add the implicit points (studies of topics should include or at least mention the important aspects of those topics, space wasn't a constraint, Halstead &nbsp;knows what the terms mean, etc.) but that's unnecessary in 99% of conversations and not a standard we expect anywhere else.</p>", "parentCommentId": "SftypBCmm5waNFFBE", "user": {"username": "A.C.Skraeling"}}, {"_id": "pBFwmRAwCHgLGrta5", "postedAt": "2022-08-26T20:59:06.474Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>To be fair a 'comprehensive' response would include even more questions, so I'm not confident there's any way to win here.</p><p>Yes I am also very worried about the orthodoxy point; EA is often a closed citation loop, where a small number of people and organisations cross-cite one another and ignore outside ('non-value aligned') work. Most reading lists are absolutely dominated by ~5 names, sometimes a few more.</p><p>Halstead, as &nbsp;a semi-big name at a prominent organisation (and, for better or worse, the movement's de facto authority on climate change) is extremely likely to have his work accepted into the canon without significant challenge from climate experts (with training in climate science and policy, rather than philosophy...).</p><p>Thus, a fresh crop of undergraduates on will be told that climate is no big deal compared to sexier and more EA-friendly stuff like AI without ever being aware of all the climate-related GCR work Halstead doesn't engage with (or even mention). I suspect, perhaps uncharitably, that this is because most of it disagrees with him. This in turn is partially because it has to be peer-reviewed by people selected on the basis of their expertise in climate risk, rather than EA value-alignment.</p><p>This lack of internal critique is probably because EA talks down climate so much (not least due to the influence of Halstead) that there simply aren't very many climate-focused people around, and those that <i>are</i> around know the kind of response they get when they speak out of turn (see above haha).</p><p>I love so much of EA but for a community so focused on epistemics we really are bad at accepting criticism, especially when it's directed at the big boys.</p>", "parentCommentId": "MPbscmnKYwDPxoGBm", "user": {"username": "A.C.Skraeling"}}, {"_id": "JiS4yAN3XAAgZfBWr", "postedAt": "2022-08-26T22:39:15.435Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I respect this for being a substantive critique and have upvoted, even though it does read as pretty harsh to me.</p>\n<p>I do think the way this comment is written might make it hard to respond to. I wonder if it would be easier to discuss if either (a) you made this comment a separate post that you linked to (it's already long enough, I reckon) or (b) you split it into 3-4 individual comments with one important question or critique in each, so that people can discuss each separately? My preference would be for (a) personally, especially if you have the time to flesh out your concerns for a less expert audience!</p>\n", "parentCommentId": "5FqJfkv97pRxDKyf8", "user": {"username": "Khorton"}}, {"_id": "JGGZEcZBdcctFZL9v", "postedAt": "2022-08-26T22:40:29.329Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>This is untrue if the things that make this century hingey are orthogonal to climate change.&nbsp;</p></blockquote><p>I do not think this is true. If we are at a hingey time due to AI and bio, and climate does not affect the hingeyness of this century, then it does not have much impact on the long-term.&nbsp;</p><blockquote><p>Takakura does not have a discounting module but considering impacts only up to 2100 is functionally the same as discounting all impacts after 2100.</p></blockquote><p>You initially said that Takakura et al has a discounting module because it endorses pure time preference. I pointed out that this is not true. So, this seems like changing the subject</p>", "parentCommentId": "rvxMQFEBiJhvNA8cG", "user": null}, {"_id": "8ibfKknWiDxbTctGm", "postedAt": "2022-08-26T23:05:33.960Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>The report was reviewed by various people with expertise in various different aspects of climate change. The reviewers are pasted at the bottom of this comment.&nbsp;</p><p>The criticism raised by GIdeon seems to be that it doesn't cite some studies that take an extreme stance on climate risk relative to mainstream climate scientists and climate economists. &nbsp;I discuss many of the claims made in these papers at considerable length. If you disagree with some of my substantive claims, then I would be happy to discuss them.&nbsp;</p><p>I don't think my report is outside the mainstream of IPCC science. I can't think of any substantive claims that are inconsistent with the latest IPCC report, with the exception of my criticism of the Burke et al (2015) paper and the ecosystem collapse stuff.</p><p>The reviewers for the report are below, though they may not agree with everything I have written.&nbsp;</p><ul><li>Matthew Huber, Professor, Dept. of Earth, Atmospheric and Planetary Sciences, Purdue University</li><li>Dan Lunt, Professor of Climate Science, Bristol University</li><li>Jochen Hinkel, Head of Department of Adaptation and Social Learning at the Global Climate Forum&nbsp;</li><li>R. Daniel Bressler, PhD Candidate in Economics at Columbia</li><li>Cullen Hendrix, Professor at the Korbel School of International Studies, University of Denver</li><li>Andrew Watson, Royal Society Research Professor at the University of Exeter</li><li>Peter Kareiva, Pritzker Distinguished Professor in Environment &amp; Sustainability, UCLA</li><li>Christina Schädel, Assistant Research Professor Center for Ecosystem Sciences and Society, Department of Biological Sciences, Northern Arizona University</li><li>Joshua Horton, Research Director, Geoengineering, Keith Group, Harvard</li><li>Laura Jackson, UK Met Office</li><li>Keith Wiebe, Senior Research Fellow at the International Food Policy Research Institute</li><li>Matthew Burgess, Assistant Professor, Department of Environmental Studies, University of Colorado Boulder</li><li>David Denkenberger, Assistant Professor of Mechanical Engineering at University of Alaska Fairbanks</li><li>Peter Watson, Senior Research Fellow and Proleptic Senior Lecturer, School of Geographical Sciences, Cabot Institute for the Environment, University of Bristol</li><li>Goodwin Gibbins, Research Fellow, Future of Humanity Institute, University of Oxford</li><li>Linus Blomqvist, Senior Fellow at Breakthrough Institute, PhD candidate in Environmental Economics and Science at UC Santa Barbara</li><li>Luca Righetti, Research Fellow, Open Philanthropy Project</li><li>Johannes Ackva, Climate research lead, Founders Pledge</li><li>James Ozden, Extinction Rebellion</li></ul>", "parentCommentId": "pBFwmRAwCHgLGrta5", "user": null}, {"_id": "QwZaZrkwAfCjAexyK", "postedAt": "2022-08-26T23:32:45.571Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>The work was reviewed by experts, as I discuss in the other comment.&nbsp;</p><ul><li>I do discuss tipping points at some length. I don't see how the idea of cascading risks would change my substantive conclusions at all. If you want to argue that cascading risks would in fact affect my conclusions, I would be happy to have that debate.</li><li>In fairness to me, the Kemp et al paper was only published a couple of weeks ago, so I couldn't include it in the report. I think much of that paper is incorrect, and the reasons for that are discussed at length in the report. The conclusions of the Beard et al and Richards et al paper are, in my view, refuted mostly in section 5 of my report. If you have a criticism of that section, which largely leans on the latest IPCC report, I would be happy to have that discussion</li><li>I have read the Richards et al complex systems paper. It contains the following diagram purporting to show how climate change could cause civilisational collapse</li></ul><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_160 160w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_320 320w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_480 480w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_640 640w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_800 800w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_960 960w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_1120 1120w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_1280 1280w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_1440 1440w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/84d60b777ce9390f61c2a581f7cb299fe4fa79e1bbe3532e.png/w_1532 1532w\"></figure><p>I am open to the possibility that my argument that climate change will not destroy the global food system is wrong. I am happy to discuss substantive criticisms of those arguments. I do not see one in the Richards paper, or in what you have said.&nbsp;</p><ul><li>Your critique here seems to me to miss the mark, as illustrated by your own example. If I am assessing biorisk and categorise viruses according to whether they have an odd or even number of letters, then so long as I got my risk assessment right for the odd and even numbered letter viruses, I would have actually evaluated biorisk. I don't know whether I am taking a 'techno-utopian approach' but I thought the Cremer and Kemp paper was not very good and I am not alone in thinking that (it's also not peer reviewed, if that is the criterion we are using). As I have said, I seldom depart from the IPCC in the report. If you think I do, which of my arguments do you think are wrong?</li><li>It's a bit weird to argue that a 400+ page report is radically incomplete without making any arguments and then to criticise my response as just making assertions. Which of my substantive arguments do you disagree with and why?</li></ul><p>It is true that those papers are short but they also do not engage with literature that is inconsistent with most of their main claims. They lean heavily on the idea of planetary boundaries, which is extremely controversial and I argue against at length in the report.&nbsp;</p>", "parentCommentId": "5FqJfkv97pRxDKyf8", "user": null}, {"_id": "f5ydHunvNLifmeQTQ", "postedAt": "2022-08-26T23:38:05.281Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I'm flattered to be called a prominent figure in EA, but I think that is not really true. If people want to criticise the substantive claims in the report, I am happy to have that discussion and I think people on the Forum would appreciate it</p>", "parentCommentId": "P6KLydaiPc7YJNx7h", "user": null}, {"_id": "DvYZfy8KicpX6Fyur", "postedAt": "2022-08-26T23:54:47.678Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi Zoe, what is your proposed alternative to a karma system?</p>", "parentCommentId": "S2EJGnynxmkhTuFCw", "user": null}, {"_id": "uTbyKAwXjoFqJ6eWY", "postedAt": "2022-08-27T01:17:37.015Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I did not say Takakura has a discounting module and this is not changing the subject. What I said was:</p>\n<blockquote>\n<p>I have an issue with Takakura and other models. All models I've seen measure climate impacts in a) a social cost of carbon, whose value is based on a pure time preference discount factor, or b) impacts by the end of the 21st century, which ignores impacts into future centuries.</p>\n</blockquote>\n<p>Takakura has the latter problem, which is my issue with it as you use it.</p>\n<blockquote>\n<p>If we are at a hingey time due to AI and bio, and climate does not affect the hingeyness of this century, then it does not have much impact on the long-term.</p>\n</blockquote>\n<p>This doesn't seem right as a criterion and is also counter to some examples of longtermist success. For example, the campaign to reduce slavery improved the long term by eliminating a factor that would have caused recurring damage over the long term. Climate mitigation reduces a recurring damage over the long term: if that recurring damage each year is large enough, it can be an important longtermist area. My point is that the impacts of climate in the 21st century are probably a substantial underestimate of their total long-term impact. It's totally possible that when you account for the total impact it is still not important, but that doesn't follow automatically from climates effect on hingeyness.</p>\n", "parentCommentId": "JGGZEcZBdcctFZL9v", "user": {"username": "therealslimkt"}}, {"_id": "wZtarB5iR5GTYeakL", "postedAt": "2022-08-27T06:08:16.350Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I was worried about the harshness aspect but to be frank there are only so many ways to say that someone in a position of power and influence has acted with negligence.</p><p>Perhaps these could also be useful things to do (thought given the afore-mentioned herd-downvoting I doubt that (a) would receive sufficient good-faith engagement to be worth writing.</p><p>(b) could be useful for facilitating small-scale discussion, but I haven't seen any indication that there are people who want to or are trying to do that, e.g. with a comment saying 'On point #4...'</p><p>In any case, I have seen far longer comments than mine and comments with more questions and less elaboration than Gideon's get dozens of upvotes before.</p><p>These criticisms (and I'm discussing both your response and Karthik's here, as well as a more general pattern) appear to only be brought up when the EA big boys are being criticised: I doubt if Gideon had asked five complimentary questions he would have received anything close to such a negative reaction.</p><p>This does remind me of a lot of the response to Democratising Risk: Carla and Luke were told that the paper was at once too broad and too narrow, too harsh and yet not direct enough: anything to dismiss critique while being able to rationalise it as a mere technical application of discursive norms.</p>", "parentCommentId": "JiS4yAN3XAAgZfBWr", "user": {"username": "A.C.Skraeling"}}, {"_id": "nAQH5dA5gb2DYrfgk", "postedAt": "2022-08-27T06:36:06.528Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>This is good, though offering comments on various sections of a google doc is of course a very different exercise to full and blind peer-review.</p><p>Did any of the reviewers notice that you had not mentioned (almost?) any climate-related GCR papers? If so, what was your response to them?</p><p>As per your comments about complex systems above, please do not dismissively mischaracterise the views of your critics. This is the kind of thing an average forum user would get hammered for, please do not try to get away with it just because you know you can.</p><p>If you discuss their arguments, why didn't you cite them? If the X-risk climate corpus takes an 'extreme' stance by and large, is that not the kind of thing you would expect to see discussed in a &gt;400 page report on climate change X-risk?</p><p>Even to the extent that this report is within the IPCC mainstream, notwithstanding, for instance:</p><ul><li>The complete absence of systems perspectives (even just to justify your rejection, something I, to be frank, would expect in an undergraduate dissertation)</li><li>Lack of consideration of vulnerability, exposure, or cascading disasters</li><li>Silent disregard for Reisinger et al.'s discussion of the concept of risk</li></ul><p>...it is well-known that the IPCC must moderate its conclusions and focus on better-case scenarios for political reasons, i.e. so as to not be written off as alarmist. You know this, because it is mentioned in Climate Endgame and discussed at length by Jehn et al.</p><p>This is another rather important issue in climate risk scholarship you would expect to see mentioned in a work this long.</p>", "parentCommentId": "8ibfKknWiDxbTctGm", "user": {"username": "A.C.Skraeling"}}, {"_id": "qtLhpuB7TR7kkzbHZ", "postedAt": "2022-08-27T06:38:30.107Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>You may think this, but (some) people on the Forum clearly do not.</p>", "parentCommentId": "f5ydHunvNLifmeQTQ", "user": {"username": "A.C.Skraeling"}}, {"_id": "ZfZgXaKSFkYR3YpYC", "postedAt": "2022-08-27T06:42:41.221Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think some of the criticism of your paper with Kemp was due to it being co-authored with Phil Torres, who has harassed and defamed many people (including me) because he thinks they have frustrated his career aims</p>", "parentCommentId": "wZtarB5iR5GTYeakL", "user": null}, {"_id": "qu6K6HECugXKEFis7", "postedAt": "2022-08-27T06:48:53.574Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I presume that you are assuming I am Zoe Cremer here. I am not Zoe (Carla? Which is her actual first name?) and I have never met her, but feel free to assume only one person has issues with EA norms if you want. That post has 200 upvotes: some people must have agreed with her, even if you didn't.</p><p>Based on Cremer's recent statements in and around the MacAskill profile in the New Yorker she seems to be completely worn out by EA and has largely lost interest: presumably not someone who would dedicate very much time to getting into EA Forum comment wars?</p><p>This isn't just an issue with the karma system (though artificially magnifying the ratings of somewhat popular comments so that 7 votes can produce a rating of over 25 is definitely an odd choice) it's a cultural issue. Why did you ignore these aspects and focus the most technical issue?</p>", "parentCommentId": "DvYZfy8KicpX6Fyur", "user": {"username": "A.C.Skraeling"}}, {"_id": "xR9nFNJgBB8zu8bgs", "postedAt": "2022-08-27T06:52:38.798Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>It might be good to zoom out here and get a sense of what the criticism is here. I am being criticised for not citing four papers. One of them is by you and Kemp, is not peer-reviewed and is not primarily about climate change. The other one is Kemp et al 2022 which was published two weeks before I published my report so I didn't have time to include discussion of it. The other papers I am being criticised for not mentioning are Beard et al and Richards et al. If you want to explain to me why the points they raise are not addressed in my report, I would be happy to have that discussion.&nbsp;</p><p>The Jehn et al papers make claims which are &nbsp;wrong. It is blatantly not true to anyone who knows anything about climate change that the climate science literature ignores warming of more than 3ºC.&nbsp;</p>", "parentCommentId": "nAQH5dA5gb2DYrfgk", "user": null}, {"_id": "jKi7aTbDXteQzpaft", "postedAt": "2022-08-27T06:57:57.784Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>What are you even talking about?</p><ol><li>&nbsp;I am not Cremer and it seems like an odd act of ego-defence to assume that there is only one person that could disagree with you.</li><li>I have no idea what you mean about Phil Torres: he clearly needs to take a chill pill but 'harassment' seems strong. Perhaps I've missed something. 'Frustrated his career aims'?</li><li>In any case, Torres wasn't a co-author of Democratising Risk, though I agree that he would probably agree with a lot of it.</li><li>Even if all of your implicit points were true, why on Earth would co-authorship with someone who had defamed you be grounds to offer reams of contradictory critiques to critical works while making none of the same critiques to comparable [EA Forum comments, but whatever] written pieces that do not substantially disagree with the canon.</li></ol>", "parentCommentId": "ZfZgXaKSFkYR3YpYC", "user": {"username": "A.C.Skraeling"}}, {"_id": "WxAjunmpKnX8Q9Rbi", "postedAt": "2022-08-27T06:59:27.047Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Fair enough on your Takakura point, I misread.&nbsp;</p><p>I'm not sure I understand your second comment. 'hingey' means that we are living at the most influential time ever. This includes things like value change around slavery.&nbsp;</p>", "parentCommentId": "uTbyKAwXjoFqJ6eWY", "user": null}, {"_id": "DqaFuQvhqtD7GeCvB", "postedAt": "2022-08-27T07:01:13.818Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I just assumed you were Cremer because you kept citing all of her work when it didn't seem very relevant.&nbsp;</p><p>Perhaps the authors of the paper would like to share how much Torres contributed that paper and how that might have influenced the reception of the paper</p>", "parentCommentId": "jKi7aTbDXteQzpaft", "user": null}, {"_id": "oqRW9Kj7QY7GsBGnR", "postedAt": "2022-08-27T07:12:23.868Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<ol><li>For those who haven't read the full comments section, Halstead has decided that I am Carla Zoe Cremer.</li><li>Democratising Risk is a preprint, no?</li><li>Democratising Risk is not primarily about climate change, but it is about X-risk methodology. You have written a piece about X-risk. Scholarly works generally require a methodology section, and scholars are expected to justify their methodology, especially when it is a controversial one. This is advice I would give to any undergraduate I supervised.</li><li>It is true that Kemp et al. 2022 has not been published for long, so you can be excused for not discussing it at length. It seems odd to have not mentioned it at all though: two weeks is not a huge amount of time, but enough to at least mention by far the most prominent work of climate GCR work to date.</li><li>If you discuss Beard's and Richards' points, why don't you cite them? In any case, justification for the lack of substantive engagement seems like something you need to offer, rather than me.</li><li>In any case, the lack of mention of most climate-specific GCR work is <i>not</i> the only thing you have been criticised for: please scroll up to see Gideon's original comment if you like.</li><li>Jehn et al., do not say that climate science literature ignores warming of more than 3C, they say that it is heavily under-represented.</li><li>Again, please stop lazily mischaracterising the views of your critics.</li><li>I don't know if this repeated strawman-ing is accidental or not: if accidental, please improve your epistemics, if not, please try to engage in good faith.</li><li>This is an interesting point of view, <strong>that you should have mentioned and justified, as any student would be expected to in an essay, rather than simply pretending that criticisms do not exist</strong></li></ol>", "parentCommentId": "xR9nFNJgBB8zu8bgs", "user": {"username": "A.C.Skraeling"}}, {"_id": "NsavYmxCyfhmNzEq9", "postedAt": "2022-08-27T07:13:47.866Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>That is a rather odd assumption to make given that two of the issues under discussion were X-risk methodology and EA discourse norms in response to criticism.</p><p>Also I think it's worth noting that you have once again ignored most of the criticism presented and moved to the safer rhetorical ground of vague insinuations about people you don't like.</p><p>'Never Play Defense', anyone?</p>", "parentCommentId": "DqaFuQvhqtD7GeCvB", "user": {"username": "A.C.Skraeling"}}, {"_id": "mXiZQJRiwqv4aNSNp", "postedAt": "2022-08-27T07:54:02.209Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>META: This + additional comments below from Halstead are strongly suggestive of bad-faith engagement: lazy dismissal without substantive engagement, repeated strawman-ing, <i>Never Play Defense</i>-ing, and accusing his critics of secretly being sockpuppet accounts of known heretics so their views can be ignored.</p><p>On the basis of Brandolini's Law I am going to try to keep my replies as short as I can. If they seem insubstantial, it is likely because I have already responded to the point under discussion elsewhere, or because they are responding to attempts to move the conversation away from the original points of criticism.</p><p>I have specific criticisms to make, and I would like to see them addressed rather than ignored, dismissed, or answered only on the condition that I make a whole new set of criticisms for Halstead to <i>also</i> not engage with.</p><p>I suggest the reader read Halstead's response before going back to Gideon's and my comments. It was useful for me.</p><ul><li>Climatic tipping points, cascading risks, and systemic risk are different things and you (hopefully) know it.</li><li>If you have refuted arguments made by relevant papers, why didn't you cite them?</li><li>I'm not sure I understand your argument here: you are not under any obligation to discuss opposing perspectives on climate risk because a different paper on climate risk did not explicitly refute an argument that you would go on to make in the future?<ul><li>In any case, <strong>this is not at all what Gideon or I said</strong> Your lazy and factually inaccurate dismissal of complex systems theory remains lazy and factually inaccurate. I am not sure where this point about Richards et al. comes into it.</li></ul></li><li>You would have evaluated biorisk if the only possible use of a methodology was making sure you had a comprehensive categorisation system, which (as I hope you know) is not at all true.</li><li>I don't really see how I have not made any arguments here. I suppose I could ask someone if it's possible to write 'Please cite your sources.' in first-order logic.</li></ul><p>I would like to hear your justification for how Beard et al, Richards et al, and Kemp et al all lean heavily on the idea of planetary boundaries, and how, if this was true, it would be relevant.</p><p>However, I doubt this would go anywhere. I suspect this is simply yet another way of ignoring people who disagree with you without thinking too hard, and relying on the combination of your name-recognition and the average EA's ignorance of climate change to buy you the 'Seems like he knows what he's talking about!'-ness you want.</p>", "parentCommentId": "QwZaZrkwAfCjAexyK", "user": {"username": "A.C.Skraeling"}}, {"_id": "GTXHKoztsC5Td4vvJ", "postedAt": "2022-08-27T08:43:45.882Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>jumping in here briefly because someone alerted me to this post mentioning my name: I did not comment, I was not even aware of your forum post John, (sorry I don't tend to read the EA forum), don't tend to advertise previous works of mine in other peoples comments sections and if I'd comment anywhere it would certainly be under my own name&nbsp;</p>", "parentCommentId": "DqaFuQvhqtD7GeCvB", "user": {"username": "CarlaZoeC"}}, {"_id": "jTbqgr24jtihbmKdB", "postedAt": "2022-08-27T09:27:10.265Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>Imagine that only a few hundred people in the world thought that climate change is an important problem (rather than at least tens of millions), that philanthropists worldwide spent a few million dollars a year on climate (rather than $10 billion), that society as a whole spent a million dollars on the problem (rather than $1 trillion), and that the international institutions trying to tackle the problem either don’t exist or have a similar budget to a McDonald’s restaurant. How bad would climate change be? This is how bad things are for the other global catastrophic risks, and then some.</p></blockquote><p>Great analogy!</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "P8hoKxT7bJCLurcR3", "postedAt": "2022-08-27T09:47:08.391Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>From a longtermist point of view, it is especially important to avoid outcomes that could have persistent and significant effects. These include events like human extinction, societal collapse, a permanent negative change in human values, or prolonged economic stagnation.</p></blockquote><p>&nbsp;</p><p>Over the long term, it seems reasonable to think in terms of cycles. &nbsp; You know, the pattern over the long term is that civilizations live, and then they fall, and then something else rises to take their place. &nbsp;</p><p>The Roman Empire must have seemed permanent to those living at that time, but the empire fell, a period of darkness (in Europe) followed, and then a new even more impressive civilization rose from the ashes.</p><p>Over the long term, it seems likely that eventually this life/death cycle of human civilizations will cease, for everything in nature that has a beginning also has an end.</p><p>This is maybe getting too philosophically off topic, but it is perhaps interesting to question whether our personal mortality, civilization mortality, or species mortality is automatically a bad thing. &nbsp;These events are all inevitable, so there's a logic in making peace with them by whatever means one can find. &nbsp;&nbsp;</p><p>Maturity may involve the ability to hold conflicting inclinations together within one's mind. &nbsp;On the one hand it is our job as individuals and a species to struggle mightily to survive, while at the same time joyfully embracing the reality that we won't. &nbsp;&nbsp;</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "hji8fCaepYt4xFF7r", "postedAt": "2022-08-27T13:28:18.735Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>It seems like my concern was unwarranted anyways as John already responded directly to each of your points!</p>\n", "parentCommentId": "wZtarB5iR5GTYeakL", "user": {"username": "Khorton"}}, {"_id": "kcGihL2z2k4dLC4G7", "postedAt": "2022-08-27T14:33:29.265Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I generally think it'd be good to have a higher evidential bar for making these kinds of accusations on the forum. Partly, I think the downside of making an off-base socket-puppeting accusation (unfair reputation damage, distraction from object-level discussion, additional feeling of adversarialism)  just tends to be larger than the upside of making a correct one.</p>\n<p>Fwiw, in this case, I do trust that A.C. Skraeling isn't Zoe. One point on this: Since she has a track record of being willing to go on record with comparatively blunter criticisms, using her own name,  I think it would be a confusing choice to create a new pseudonym to post that initial comment.</p>\n", "parentCommentId": "DqaFuQvhqtD7GeCvB", "user": {"username": "bmg"}}, {"_id": "ES7tr5WhbhrbtfD4s", "postedAt": "2022-08-27T14:43:35.564Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I strongly agree - if someone has a question or concern about someone else's identity, I think they should either handle it privately or speak to the Forum team about their concerns.</p>\n", "parentCommentId": "kcGihL2z2k4dLC4G7", "user": {"username": "Khorton"}}, {"_id": "vvmzowrH6ELazEoRE", "postedAt": "2022-08-27T15:08:07.155Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>The dynamics in this post seem weird. John is very well-respected within EA  for his work on climate change, and having this report commissioned by Will makes it even more likely to be disseminated quickly and widely throughout the community.</p>\n<p>In my opinion that means it's particularly essential that thoughtful critiques are brought up earlier rather than later. Of course the report has already been reviewed by a lot of people I respect, but in general I'm in favour of people asking questions and raising concerns here, even though I would expect most concerns to have already been thought about and be relatively easily addressed, or in some cases not worth addressing.</p>\n<p>So I'd like to encourage people to post these questions, concerns and critiques, but I think the environment in these comments hasn't always been encouraging. People have been significantly downvoted for reasons I don't understand, and John has in one case accused someone of misrepresenting their identity which I don't think was helpful.</p>\n<p>Do people agree with me that we should encourage people to post their questions and concerns here, even if you don't agree with the specific questions? Do people agree the current environment isn't ideal for that?</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "sgoma8zLQK38KxNmJ", "postedAt": "2022-08-27T15:42:56.215Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Didn't separate karma for helpfulness and disagreement (frequently used on LessWrong) get implemented on the EA forum recently? This post feels like the ideal use case for it:</p><ul><li>&nbsp;There are some controversial comments with weakly positive karma despite lots of votes, where I suspect what's going on is some people are signalling disagreement with downvotes, and others are signalling 'this post constitutes meaningful engagement' with upvotes.&nbsp;</li><li>There are also some comments where the tone seems to me to be over the line, with varying amounts of karma (from very positive to very negative), from various people. &nbsp;</li></ul><p>Were a two-karma system available, I think I would use both [strong upvote, strong disagree] and [strong downvote, strong agree] at least once each.</p>", "parentCommentId": null, "user": {"username": "alexrjl"}}, {"_id": "asQNq32WLfNzGjso3", "postedAt": "2022-08-27T16:04:47.154Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I didn't downvote any of the criticisms but I can understand why people would downvote the following quote as it is quite close to assuming &nbsp;intention:</p><p>\"Either you are aware that this characterisation is highly inaccurate and unfair, or you are not. If the former, I am disappointed by your (apparent) dismissiveness and willingness to mischaracterise.\"</p>", "parentCommentId": "vvmzowrH6ELazEoRE", "user": {"username": "emre kaplan"}}, {"_id": "eKuxwZsZ2sTFQXfki", "postedAt": "2022-08-27T16:14:23.189Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I've seen every question or critique be below zero at some point in the last 24 hours, not just one!</p>\n", "parentCommentId": "asQNq32WLfNzGjso3", "user": {"username": "Khorton"}}, {"_id": "44FPfnskg8fXLK9tj", "postedAt": "2022-08-27T16:33:47.214Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Yes and no in my opinion haha but I see your point</p>", "parentCommentId": "hji8fCaepYt4xFF7r", "user": {"username": "A.C.Skraeling"}}, {"_id": "yEnZhuPYhAAabCBrR", "postedAt": "2022-08-27T16:35:01.348Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Strong upvote, I thought I was going crazy. Thank you!</p>", "parentCommentId": "vvmzowrH6ELazEoRE", "user": {"username": "A.C.Skraeling"}}, {"_id": "u5BypwsstJegKAJJg", "postedAt": "2022-08-27T16:39:33.656Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I may be missing something here, but how is 'either you have acted in way x or way y' \"quite close\" to assuming 'x'?</p><p>The sentence was constructed to deliberately hold open both possibilities (i.e. aware or not), and you have cut off the quote before the latter of the possibilities was spelt out.</p><p>\"'Either this animal is a cat or a dog' is quite close to assuming that the animal is a cat.\"</p>", "parentCommentId": "asQNq32WLfNzGjso3", "user": {"username": "A.C.Skraeling"}}, {"_id": "KKZHjoyeKAnGxZMpq", "postedAt": "2022-08-27T18:40:00.571Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Given the review process was not like normal peer review, would it be possible to have a public copy of all the reviewers comments like we get with the IPCC. This seems like it may br important for epistemic transparency</p>\n", "parentCommentId": "QwZaZrkwAfCjAexyK", "user": {"username": "Gideon Futerman"}}, {"_id": "dFJmuYPNXqbSBDdD7", "postedAt": "2022-08-27T18:41:37.591Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think to some degree this level of accusations is problematic and to some degree derails an important conversation. Given the role a report like this may play in EA in the future, ad hominem and false attacks on critiques seem somewhat problematic</p>\n", "parentCommentId": "kcGihL2z2k4dLC4G7", "user": {"username": "Gideon Futerman"}}, {"_id": "bFbpn25KsSmioGfd7", "postedAt": "2022-08-27T18:54:53.721Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>In formal logic, a statement like \"either you are aware that you are a terrible person, or you are not.\" exhaustively covers all possibilities. It can't be seen as an attack, because it is literally a tautology. However, this is not how most people read common language. This is because (if we read things only on the formal level), a clear fraction of the probability space of \"I am not aware I'm a terrible person\" comes from \"I am not aware I'm a terrible person, because I'm not a terrible person.\"&nbsp;</p><p>However, given the way that most humans reason, most people will in fact not interpret \"either you are aware that you are a terrible person, or you are not\" neutrally.</p>", "parentCommentId": "u5BypwsstJegKAJJg", "user": {"username": "Linch"}}, {"_id": "tjZywjaEt8hKaYRzt", "postedAt": "2022-08-27T19:18:14.752Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi, John.</p><p>I don't have time in the next several days to give your write-up the attention it deserves, but I hope to study it as a learning opportunity and to expand my grasp of general arguments around what I call steady-state climate change, that is, climate change without much contribution from tipping points this century and without strong impacts at even higher temperatures (eg., 3-4C). I appreciate the structure of your report, by the way, it lets a reader quickly drill down to sections of interest. It is clearly written.&nbsp;</p><p>At the moment, I am considering your analysis of permafrost and methane contributions to GAST changes. I have a larger number for total carbon in permafrost than you, 1.5Tt carbon, but now have to go through references to reconcile that number with yours. Your mention of an analysis from USGS deserves a read through articles from the reference you gave, and I am attempting that now.&nbsp;</p><p>There are several parameters involved (only some independent), to do with:</p><ul><li>&nbsp;source type (anearobic decomposition, free gas deposit, methane hydrate dissolution),</li><li>&nbsp;source size,&nbsp;</li><li>source depth and layering,&nbsp;</li><li>rate of release (obviously dependent on other parameters)</li><li>geographic location (gulf of mexico versus arctic ice shelf),&nbsp;</li><li>temperature gradient (at a location),&nbsp;</li><li>water column height (near-shore vs slope),&nbsp;</li></ul><p>in deciding whether methane (edit:carbon in methane) reaches the atmosphere as methane, carbon dioxide, or not at all, and over what time period. &nbsp;</p><p>The significance of field observations over the last 10 years, and differences between particular regions (eg, Arctic seas), should be taken into account. Before reviewing counterarguments, I tend to take specialist claims about conclusions that factor in these parameters uncritically, but now that you've mentioned one parameter, aerobic bacteria acting on methane, as implying conclusions contrary to mine, I should delve deeper into how these parameters interact.&nbsp;</p><p>If you want to offer a comment about Greenland's ice sheet, and its potential contribution to sea level rise this century, I am curious to check sources with you and do more reconciling (or at least partitioning) of references. I've seen reports that changes to Greenland's ice sheet are accelerating and lead to estimates of sea level rise that are higher than, say 50 cm, more like meters, actually, over the next 80 years, but would like to know more from you.&nbsp;</p><p>In general, my observation is strong drivers of change to specific tipping points haven't found their way into climate models used by the IPCC (for example, physical processes driving some Greenland ice melt). They might at some point.</p><p>BTW, I did take a read through the comments here, and consider the the mentions of analyses of systemic and cascading risks to be useful. I hope you won't object if I ask a few questions about those risks, just to understand your perspective on those models. However, if you consider those questions to be out of scope or not of interest, let me know, and I'll hold off.&nbsp;</p><p>Thank you.</p>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "TAjqBuJEtByuHAdKz", "postedAt": "2022-08-27T20:55:47.472Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Here are my high-level thoughts around the comments so far of this report:</p><ul><li>This is a detailed report, where a lot of work has been put in, by one of EA's foremost scholars on the intersection of climate change and other global priorities.</li><li>So it'd potentially be quite valuable for people with either substantial domain expertise or solid generalist judgement to weigh in here on object-level issues, critiques, and cruxes, to help collective decision-making.</li><li>Unfortunately, all of the comments here are overly meta. Out of the ~60 comments so far on this thread, 0.5 of the comments on this thread approach anything like technical criticism, cruxes, or even engagement.<ul><li>The 0.5 in question is <a href=\"https://forum.effectivealtruism.org/posts/BvNxD66sLeAT8u9Lv/climate-change-and-longtermism-new-book-length-report?commentId=bK6M4cjzTuL4LDdfh\">this comment by Karthik</a>.</li><li>(EDIT: I think Noah's <a href=\"https://forum.effectivealtruism.org/posts/BvNxD66sLeAT8u9Lv/climate-change-and-longtermism-new-book-length-report?commentId=tjZywjaEt8hKaYRzt\">comment here</a> qualifies)</li><li>Compare, for example, <a href=\"https://forum.effectivealtruism.org/posts/y8jHKDkhPXApHp2gb/cultured-meat-a-comparison-of-techno-economic-analyses?commentId=HzaXDHaF2MHvttdmE\">the</a> <a href=\"https://forum.effectivealtruism.org/posts/y8jHKDkhPXApHp2gb/cultured-meat-a-comparison-of-techno-economic-analyses?commentId=RuaHxaq6desprHHC2#comments\">following</a> <a href=\"https://forum.effectivealtruism.org/posts/y8jHKDkhPXApHp2gb/cultured-meat-a-comparison-of-techno-economic-analyses?commentId=fYSk8GyqSwETKrS72\">comments</a> to one of RP's cultured meat reports.</li></ul></li><li>After saying that, I will hypocritically continue to follow the streak of being meta while not having read the full report.</li><li>I think I'm confused about the quality of the review process so far. Both the number and quality of the reviewers John contacted for this book seemed high. However, I couldn't figure out what the methodology for seeking reviews is here.<ul><li>To be clear, I'm aware that this is an <a href=\"https://slatestarcodex.com/2014/08/14/beware-isolated-demands-for-rigor/\">isolated demand for rigor</a>. My impression is that very few other EA research organizations have a very formal and legible process for prepublication reviews.</li><li>However, I think for a report of this scope, it might be valuable to have a fairly good researcher sit down and review the report very carefully, in a lot of detail.</li></ul></li><li>If this is not already done, for people who are not satisfied (or at least queasy) with the report, it might be helpful to commission 1-3 months of research critiquing and redteaming this report in a lot of detail.</li><li>I think John is understandably frustrated by the lack of technical engagement and the <a href=\"https://astralcodexten.substack.com/p/criticism-of-criticism-of-criticism\">overly metaness</a> (and possibly personal acrimoniousness? ) of the comments so far.</li><li>I think John has acted badly in accusing A.C.Skraeling of being a sock puppet account.</li><li>I think every loosely organized emerging research field has \"duds,\" or low-quality work that in a poorly filtered ecosystem will suck up a lot of the oxygen.<ul><li>For both politeness and practical time-constraints reasons, people tend to ignore the bad work and only engage with the good/mediocre work.</li><li>Larks is one of the few people who <a href=\"https://forum.effectivealtruism.org/posts/BNQMyWGCNWDdP2WyG/2021-ai-alignment-literature-review-and-charity-comparison#Poor_Quality_Research\">point out this explicitly</a> (for AI alignment). I think his summary of the situation (including why people do this, and downsides) is a worthwhile read, will recommend!</li><li>My impression is that academia and other relatively formal systems deal with this via more explicit notions of prestige, conference/paper rejections, etc.<ul><li>However, this comes with its own dysfunctions and risks ossification.</li></ul></li></ul></li><li>Taking a step back, I'm a bit confused about why longtermist researchers continue to spend such significant intellectual resources on studying climate in this fashion. My guess is that anyone who was convinced by earlier research by John, 80k, etc, plus the relevant research and communication into other, riskier, domains, are unlikely to change their minds by critiques of this deeper report. And anybody who wasn't convinced by the earlier reports are unlikely to be convinced by this one.<ul><li>So I don't really know the value-add of more intellectual attention into this.</li></ul></li><li>I looked into climate change for myself for several weeks in 2019 (back when I was substantially worse at both research and judgement). I think I was fairly satisfied that it should not be one of EA's top priorities, even ignoring neglectedness. My reasoning then was fairly simple.<ul><li>My main reason for thinking that climate change was a significant existential risk (or at least a GCR) was that I had the vague impression that this is a position in academia.</li><li>My main reason for not believing that was because a) weak inside views about historical resilience to temperature variability and b) other smart and thoughtful EAs didn't believe this.</li><li>Thus, the appropriate way to evaluate the evidence is to try to look at the climate change literature, in a way that does not reference past EA work (so as to not be clouded as much by biases/information cascades).</li><li>I looked at it for a while, and concluded that the literature mostly did not say that climate change was a significant existential risk (of course it was not framed in those terms).<ul><li>I thought that climate risk experts should be predisposed to overestimate rather than estimate risks, so there is additional evidence beyond just their conclusions.</li></ul></li><li>Given that my reasons for thinking climate change was a significant existential risk weren't very strong or robust to begin with, I didn't need that many bits to be convinced that the risks are low.</li><li>I think my research quality/rigor at the time was pretty meh. Still I don't think it should swing the overall conclusion.</li><li>I'm more worried about motivated reasoning/selection effects. Motivated reasoning because I felt like part of the reason for doing that research was convincing myself and others, rather than because I fully impassionately wanted to know the truth. Selection effects because I went into it using an EA methodology and ways of thinking about the world, and of course I'm selected to be one of the people who think in that way.</li></ul></li><li>Since then, I had 3 updates re: how high climate risk should intuitively \"feel\", in my head, in different directions:<ul><li>Jan-March 2020 Covid was a large update for me against a) trusting the object-level of a lot of expert modeling and b) trusting that experts will uniformly overestimate rather than underestimate risk (as opposed to \"don't panic\" justifications and conservatism bias). This caused me to worry more about climate stuff.</li><li>John/Johannes looked into and <a href=\"https://forum.effectivealtruism.org/posts/ckPSrWeghc4gNsShK/good-news-on-climate-change\">updated in believing in lower overall climate risk</a>, with reasonable-sounding object-level reasons. This caused me to worry less about climate stuff.<ul><li>I did not look into or investigate their reasoning, and generally have not prioritized looking into climate much since 2019.</li></ul></li><li>Compared to myself in 2019, I placed relatively more trust in the relative judgement of EAs over that of external people. This caused me to worry less about climate stuff.</li><li>I think the first update is the largest.</li></ul></li><li>My understanding is that a lot of the purported value of engaging on the object-level details of climate, and of WWOTF's aims in general, is to draw in the climate change people as allies.<ul><li>I'm a bit confused about this reasoning. I think:<ul><li>the arguments for working on AI risk/biorisk over climate risks seems fairly simple to me, and resilient to a practical range of empirical disagreements within climate.</li><li>to the extent the arguments are bad or poorly communicated, I strongly suspect that they come in almost entirely because AI risk/biorisk arguments are insufficiently grounded, rather than because the climate arguments are insufficiently sophisticated.</li><li>from a persuasion perspective, I think this is maybe a bad move anyway. Maybe better to be \"yes, and\" than to explicitly and immediately tell people that the thing they've devoted their lives to is &gt;100x less important.</li></ul></li></ul></li><li>Given that it might not be realistic to find (and may not be very valuable) a senior-ish EA researcher to critique and red-team John's report, I'd be excited to have several junior EAs try this.<ul><li>Roughly, a summer-long project for someone of the calibre of <a href=\"https://www.camxrisk.org/\">CERI</a>/<a href=\"https://cisac.fsi.stanford.edu/stanford-existential-risks-initiative/content/stanford-existential-risks-initiative\">SERI</a> might be to go <a href=\"https://forum.effectivealtruism.org/posts/myp9Y9qJnpEEWhJF9/linch-s-shortform?commentId=hedmemCCrb4jkviAd\">line by line in the report</a> (or pick a few chapters) to find the relevant potential mistakes/disagreements/cruxes (from an LT perspective).</li><li>This helps train critical thinking abilities and thoughtfulness.</li><li>To be clear, this is premised on domain-general critical thinking abilities and thoughtfulness being among the most valuable things for junior EAs to train.<ul><li>I'm genuinely confused about how much we want less thoughtful people as allies. I think an increasingly common position in longtermist EA nowadays is that the things that matter is AI risk and biorisk (sometimes just AI risk), and what we most/only need are people who are either extremely technically competent (for solving the technical problems) or who are very good at politics (for policy/persuasion).<ul><li>Whereas I feel like I sort of represent the older guard of people who still think that thoughtfulness is a huge asset.<ul><li>But I acknowledge that this is something I have a (large?) bias to believing is true (because I'm relatively worse at being very technical or social, compared to being thoughtful).</li></ul></li></ul></li></ul></li></ul></li></ul>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "9MSSoxKWD78tppRYo", "postedAt": "2022-08-27T20:56:03.374Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think this is fair. I shouldn't have done it and am sorry for doing so</p>", "parentCommentId": "kcGihL2z2k4dLC4G7", "user": null}, {"_id": "YAEESXi4hxCDHC67d", "postedAt": "2022-08-27T21:29:58.439Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I notice a two-karma system has been implemented in at least one EA Forum post before, see the comments section to this \"<a href=\"https://forum.effectivealtruism.org/posts/sEnkD8sHP6pZztFc2/#comments\">Fanatical EAs should support very weird projects</a>\" post.</p>", "parentCommentId": "sgoma8zLQK38KxNmJ", "user": {"username": "Will Aldred"}}, {"_id": "a2jzvkTYega6juuLg", "postedAt": "2022-08-27T22:43:52.710Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>Imagine that only a few hundred people in the world thought that climate change is an important problem (rather than at least tens of millions), that philanthropists worldwide spent a few million dollars a year on climate (rather than $10 billion), that society as a whole spent a million dollars on the problem (rather than $1 trillion), and that the international institutions trying to tackle the problem either don’t exist or have a similar budget to a McDonald’s restaurant. How bad would climate change be? This is how bad things are for the other global catastrophic risks, and then some.&nbsp;</p></blockquote><p>&nbsp;</p><p>This seems to overstate how bad the situation is (although qualitatively it remains an absurd underinvestment, with painfully low-hanging fruit to avert pandemics and AI catastrophe at hand). Surveys of the general public and area experts do show substantial percentages in the abstract endorse nuclear (in particular), bioweapon, and AI risks as important problems (as you mention later). Governments wage wars and spend very large amounts of attention and resources on nuclear proliferation and threats. Biodefense has seen billions of dollars of spending, even if it was not well-crafted to reduce catastrophic bioweapon risk. The low budget for the BWC is in significant part a political coordination problem and not simply a $ supply issue. Annual spending from Open Philanthropy and the Future Fund on catastrophic risks, with priorities close to yours, is now in the hundreds of millions of dollars.</p>", "parentCommentId": null, "user": {"username": "CarlShulman"}}, {"_id": "wguB4j2iTt7vJ3W86", "postedAt": "2022-08-28T01:09:33.989Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Can you make your model of indirect risks accessable to the public? Its asking for access. Thanks a lot.&nbsp;</p><p>Also, why do you assume that \"most of the risk of existential catastrophe stems from AI, biorisk and currently unforeseen technological risks.\"? My impression from earlier in the chapter is that you are essentially drawing the idea you can essentially ignore other potential causes from the Precipice. Is this correct?&nbsp;</p><p>Moreover, this assumption only seems true if you assume an X-Risk will come as a single hazard. If it is, say, a cascading risk, cascading to civilisational collapse then extinction, then the idea these are the biggest risks should be questioned. Simultanously, if you view it as a multi-pulsed thing, say civilisational collapse from one hazard or a series of hazards or cascades, and then followed by whatever may (slowly) make us extinct- once civilisation is collapsed its easier for smaller hazards to kill us all, then once again the primacy of these hazards reduces. Only if you take a reductive view that sees extinction as primarily due to direct, single or near single, hazards that kill everyone or basically everyone, can this model be valid.&nbsp;</p><p>Of course, you do talk a little about multipulsed, subextinction risks followed by recovery being harder, but not in much detail. In particular, you claim that extreme climate change may make civilisational recovery from collapse much harder, but then don't seem to deal in detail with this question, which may be considered to be highly important, particularly if we think civilisational collapse is considerably more likely than extinction. Moreover, you suggest that \"there is some<br>chance of civilisational collapse due to nuclear war or engineered pandemics,\" essentially suggesting other causes of civilisational collapse that are less direct, and therefore could be made more likely due to climate change, are negligable. This assumption should be stated and evidenced, and yet you seem to include no sources on this.&nbsp;</p><p>Moreover, you state (uncited) that \"the main indirect effect is Great power Conflict.\" Whats your source for this claim, and why are you so certain of this that you are confident that you can discount other indirect effects? This feels like the assumptions once again should be supported;</p><p>If this is the case, then I might say that relying on the (in my opinion) rather reductive, hazard-centric, simple risk assessment model of Ord etc. is our crux of disagreement. This is why I would say from my (still moderately limited unfortunatly) reading of the report, it appears that most of your facts are in order, however a lot of what I think that it is very bad that you fail to mention (systemic risk, cascading risk, vulnerabilities, exposures, complex risk assessments (I don't use this to suggest my way is inherently intellectually superior than yours, as indeed it is a plausible position to hold that X-Risks may emerge out of epistemically simplier more direct more \"simple\" risks) etc) originates out of this hazard-centric approach. I won't overthrow a paradigm in a single comment, and I won't even try, but do please tell me if you agree with me that this is the crux of our disagreement. Moreover, whilst in a previous comment to me you have said you have argued for this methodology of viewing X-Risks at length in the piece, I am yet to find such an argument. If you could point me to where you think you make this argument in the piece, I will reread that section, or I may have missed it (apologies if I have). If not, it feels this approach needs considerably greater justification.</p><p>I have more comments/criticisms which I will post in other comments, but certainly on this indirect risk things, these are my questions.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Gideon Futerman"}}, {"_id": "WcmqHXA4pnnEJiBrw", "postedAt": "2022-08-28T01:16:12.786Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi John</p><p>Given the degree to which you have highlighted how experts have commented and reviewed the piece, will you, for the sake of intellectual transparency, commit to publishing all this expert feedback like the IPCC does. I think this may really help.&nbsp;</p><p>I said this in a subcomment, and it (worryingly) got significantly downvoted. It is a worrying sign for a community if a call for intellectual transparency (which is a key norm in EA) is downvoted just because the writer (ie me) has been critical of the piece.</p><p>I have great respect for you as an academic and an EA, and I trust that you will agree that such intellectual transparency is a useful norm, and if possible commit to publishing the commentsand reviews that those who reviewed the publication sent! The worry in the above paragraph is certainly not directed at you, and I have all the confidence that you are and will remain committed to maintaining EA as an as transparent space as possible</p><p>All the best</p><p>Gideon</p>", "parentCommentId": null, "user": {"username": "Gideon Futerman"}}, {"_id": "bKEXqWSBpqem8MQwa", "postedAt": "2022-08-28T05:01:12.758Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote>\n<blockquote>\n<p>Unfortunately, all of the comments here are overly meta. Out of the ~60 comments so far on this thread, 0.5 of the comments on this thread approach anything like technical criticism, cruxes, or even engagement.</p>\n</blockquote>\n</blockquote>\n<p>I think this is mainly because of the length of the report which makes it hard to make meaningful critiques without investing a bunch of time</p>\n", "parentCommentId": "TAjqBuJEtByuHAdKz", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "EAdoFZBtbGroHHQKY", "postedAt": "2022-08-28T07:42:13.891Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>What you say is true, but is not a response to what I said.</p><ol><li>I didn't say Halstead was a terrible person: there is a difference between disapproving of actions and damning persons. In any case, leaving open a significant possibility space for poor intent is not in any way close to '<i>assuming </i>intent' and if someone reads it as such, they are wrong.</li><li>The comment was not meant to be neutral, but again, disapproving of an action is not the same as assuming poor intent, never mind calling the actor a 'terrible person'.</li></ol><p>I'm starting to see the ways in which tone-policing is selectively employed in this community (well, Forum, at least) to shut down criticism.</p><p>I don't think many of the people who do it are conscious of what they're doing, but there does seem to be an assumption that strong criticism (i.e. what is necessary if something is very wrong or someone has acted badly) is by default aggressive and thus in violation of group norms.</p><p>Thus, all criticism must be stated in the most faux-friendly, milquetoast way possible, imposing significant effort demands on the critic and allowing them to be disregarded if they ever slip up and actually straightforwardly say that a bad thing is bad.</p><p>Naturally this is far more likely to be applied when the criticism is directed at big or semi-big figures in the community or orthodox viewpoints.</p><p>And we wonder why EA is so terminally upper-middle class...</p>", "parentCommentId": "bFbpn25KsSmioGfd7", "user": {"username": "A.C.Skraeling"}}, {"_id": "XbDGMyMMBsraSuu8R", "postedAt": "2022-08-28T07:51:08.643Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think we also need renewed discussion of how the karma system contributes to groupthink and hierarchy, things that, to put it gently, EA sometimes struggles with somewhat.</p><p><a href=\"https://forum.effectivealtruism.org/posts/SApmQrKdvgccmH2yF/revisiting-the-karma-system\">As far as I can tell</a>, the system gives far more voting power to highly-rated users, allowing a few highly active (and thus most likely highly orthodox) forum users to unilaterally boost or tank any given post.</p><p>This is especially bad when you consider that low-karma comments are hidden, allowing prominent figures (often with high karma scores) to soft-censor their own critics.</p><p>This is especially worrying given the groupthink that emerges on internet fora, where a comment having a score of -5 makes it much more likely for people to downvote it further on reflex, and vice versa.</p><p>I am not going to go into details here beyond saying that this is the plot of the <a href=\"https://community-sitcom.fandom.com/wiki/MeowMeowBeenz\">MeowMeowBeenz episode of Community</a>.</p><p>MeowMeowBeenz does not contribute to good epistemics.</p>", "parentCommentId": "sgoma8zLQK38KxNmJ", "user": {"username": "A.C.Skraeling"}}, {"_id": "6tKT9Fyrqonzn5gaF", "postedAt": "2022-08-28T07:55:57.180Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Indeed, knowing what I know of some of the reviewers Halstead named I am very curious to see what the review process was, what their comments were, and whether they recommended publishing the report as-is.</p><p>I've always been quite confused about attitudes to scholarly rigour in this community: if the decisions we're making are so important, shouldn't we have really robust ways of making sure they're right?</p>", "parentCommentId": "KKZHjoyeKAnGxZMpq", "user": {"username": "A.C.Skraeling"}}, {"_id": "9Ljie3WTywRJqjAgw", "postedAt": "2022-08-28T08:33:11.746Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Yes, and I note that as/after I wrote my comment, there are more thoughtful object-level comments. So perhaps I commented too early and should've just waited for people to have time to read the report first and then provide object-level comments!</p>", "parentCommentId": "bKEXqWSBpqem8MQwa", "user": {"username": "Linch"}}, {"_id": "h6XK5osbSz9YysXLj", "postedAt": "2022-08-28T09:19:07.607Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p><strong>Thank you so much</strong>, you've said what I've been thinking, better than I've been saying it.</p><p>Maybe this is helpful, not sure.</p><p>At least part of the issue may be the academic roots of EA. &nbsp; Academics turn intellectual inquiry in to a business, which introduces some competing agendas in to the process. &nbsp; Academics often like to pose themselves as rebels, but I think it's closer to the truth to say that they are somewhat imprisoned within the group consensus of academic culture. &nbsp; You know, if you're trying to put your kids through college using your salary as a professor, you might have to sidestep controversial ideas that could get you in trouble with whoever is writing your paycheck.</p><p>&nbsp;Point being, there may be some built-in aversion to unusual ideas, which then gets fed in to the reputation voting system. &nbsp;</p>", "parentCommentId": "XbDGMyMMBsraSuu8R", "user": {"username": "Phil Tanny"}}, {"_id": "o2FCwjAy5tLh4uieS", "postedAt": "2022-08-28T09:52:36.684Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>These are good points, I will amend</p>", "parentCommentId": "a2jzvkTYega6juuLg", "user": null}, {"_id": "jRqsbk7aF5mFsLDNw", "postedAt": "2022-08-28T09:53:18.352Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>the forum did offer the chance of having agree/disagree on the post, I just forgot to respond. I think it is a beta feature but happy for it to be used on this post</p>", "parentCommentId": "sgoma8zLQK38KxNmJ", "user": null}, {"_id": "apxBXKSevakbCiavb", "postedAt": "2022-08-28T09:58:15.989Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I will ask the experts if I can share their feedback. I did ask a couple of them to do this but after a long review process they didn't respond so I decided not to ask the other experts if I could share theirs as I thought it would be weird to have comments on some parts but not others. Maintaining interest in the process from experts can be difficult because they sank a lot of time into reviewing the report and have other things to do so there is a risk of over-asking and them not wanting to engage any more.&nbsp;</p>", "parentCommentId": "WcmqHXA4pnnEJiBrw", "user": null}, {"_id": "Bv9kPBHzmDhfKrpH4", "postedAt": "2022-08-28T10:11:24.783Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>The reviewers for each section were as follows. Josh Horton reviewed a section on solar geoengineering which I am still in the process of revising for a later version.&nbsp;</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_110 110w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_190 190w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_350 350w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_430 430w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_510 510w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_590 590w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_670 670w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/9aa8ae475121db1e9eb2cdb78be630b10419ae9392ec37be.png/w_750 750w\"></figure><p>Peter Watson, Goodwin and James Ozden provided comments on various &nbsp;sections in the report.&nbsp;</p><p>Without wanting to pre-empt the reviewer comments if I am allowed to provide them, there was agreement with what I had written and I accepted the vast majority of proposed revisions. I think the main disagreement was that Keith Wiebe disagreed with some of my claims about extreme warming and agriculture. I think maybe Danny Bressler moderately disagreed with my assessment of Burke et al (2015), but not completely sure. &nbsp;</p>", "parentCommentId": "WcmqHXA4pnnEJiBrw", "user": null}, {"_id": "y7MKvcbrnFEzHWtHn", "postedAt": "2022-08-28T10:13:53.039Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I apologize if I was too quick to misdiagnose the issue. FWIW, I think I'd have trouble responding dispassionately to \"Either you are aware that this characterisation is highly inaccurate and unfair, or you are not.\" To be clear, I think I also would have trouble dispassionately responding to claims that I'm a sock puppet, and I do think it's reasonable for you to be quite upset about this.</p><blockquote><p>I don't think many of the people who do it are conscious of what they're doing, but there does seem to be an assumption that strong criticism (i.e. what is necessary if something is very wrong or someone has acted badly) is by default aggressive and thus in violation of group norms.</p><p>Thus, all criticism must be stated in the most faux-friendly, milquetoast way possible, imposing significant effort demands on the critic and allowing them to be disregarded if they ever slip up and actually straightforwardly say that a bad thing is bad.</p></blockquote><p>I agree that if someone is genuinely a terrible person, especially if that someone is a big or semi-big figure in the community, our politeness norms may make it more annoying to criticize them harshly than if we had more combative norms. I agree that this is pretty bad inasomuch as it makes things harder to unearth real problems, and this is a plausible hypothesis.<br><br>I think I still want to defend &nbsp;some fraction of such norms however, because I think our online norms are still fairly aggressive compared to what most people are used to offline, and I suspect if our online culture is substantially more aggressive (especially in unkind ways) than it currently is, this will make it harder for people to engage and address real problems, rather than just disengage.&nbsp;</p>", "parentCommentId": "EAdoFZBtbGroHHQKY", "user": {"username": "Linch"}}, {"_id": "THcaFgd7pZkjjC97J", "postedAt": "2022-08-28T10:28:03.430Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>The model should be shared now.&nbsp;</p><p>Yes that is correct re my assessment of the other existential risks. I'm taking a view similar to Toby Ord and I suppose the rest of the EA community about where the main risks are. Of course, my main goal in the report is not to make this substantive case; I largely take it as given.&nbsp;</p><p>I don't really see how viewing climate change as a cascading risk would change the overall risk assessment. If you argue that climate change is a large cascading risk then you would have to think that climate would play an important role in starting the cascade from collapse to extinction. I don't see how it could do that and explain why at length in the report. Can you lay out a concrete scenario that sketches this cascading risk worry that isn't already discussed in the report?</p><p>The report does suggest that climate change would make civilisational recovery harder but for plausible levels of warming, it would not be a large barrier to recovery and this should be clear from the substantive discussion in the report</p><blockquote><p>Moreover, you suggest that \"there is some chance of civilisational collapse due to nuclear war or engineered pandemics,\" essentially suggesting other causes of civilisational collapse that are less direct, and therefore could be made more likely due to climate change, are negligable. This assumption should be stated and evidenced, and yet you seem to include no sources on this.&nbsp;</p></blockquote><p>The whole report is about whether climate change could lead to civilisational collapse or something close to it. What other mechanisms do you have in mind that are not already discussed in the report?</p><p>The influence of climate change on great power war or war more generally seems like the most obvious indirect risk of climate change that could make a substantial difference to the scale of climate change. It is often argued that climate change is a threat multiplier for conflict risk. I discuss the literature on this at length. What other indirect risks do you think might be comparably important?</p><p>It does seem that you think that viewing climate change as a cascading risk would make a large difference to my conclusion. I don't understand what you think this cascading risk actually is that is not already discussed in the report.&nbsp;</p><p>I'm not sure which comment you are referring to? I argued that the direct/indirect approach is conceptually exhaustive, which is trivially true.&nbsp;</p>", "parentCommentId": "wguB4j2iTt7vJ3W86", "user": null}, {"_id": "sctdhTLfJtvJyEzHY", "postedAt": "2022-08-28T10:32:21.927Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi Noah,&nbsp;</p><p>(Just noting that I'm not ignoring your comments about methane clathrates, but I don't think you were asking for a response there, but were instead just highlighting some issues for you to look into? Correct me if I'm wrong)</p><p>Yes I note that there is deep uncertainty about sea level rise once warming passes 3ºC and that sea level rise might be much higher than estimated. I discuss the impacts this might have in the sea level rise section and the economic costs section</p><p>I agree that many specific tipping points haven't made their way into IPCC models</p>", "parentCommentId": "tjZywjaEt8hKaYRzt", "user": null}, {"_id": "siaPurFtRNs7xifma", "postedAt": "2022-08-28T10:34:05.943Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think this is a good place to have discussions about claims in specific sections (rather than the whole report) if people would like</p>", "parentCommentId": "bKEXqWSBpqem8MQwa", "user": null}, {"_id": "TuqbbSboybXLYesJj", "postedAt": "2022-08-28T10:49:21.600Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi John</p><p>Thanks so much for this. Did any of the reviewers (Peter Watson, Goodwin Gibbins, James Ozden perhaps?) make comments on the overall report ie your methodology, your choices of areas of inquiry etc. As this is my major criticism of your work I would really love to see the reviewers comments on your overall methodology, structure of the report etc</p><p>Best</p><p>Gideon</p>", "parentCommentId": "Bv9kPBHzmDhfKrpH4", "user": {"username": "Gideon Futerman"}}, {"_id": "HixsMpfxHwkx9gX7P", "postedAt": "2022-08-28T11:08:39.915Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I frequently catch myself, and I'm embarrassed to admit that, being more likely to upvote posts of users that I know. I also find myself anchoring my vote to the existing vote count (if a post has a lot of upvotes then I am less likely to downvote it). Pretty sure I'm not the only one.</p>\n<p>Furthermore, I observe how vote count influences my reading of each post more than it should. Groupthink at its best.</p>\n<p>I suspect if the forum hid the vote count for a month, there would be significant changes in voting patterns. That being said, I'm not sure these changes would actually influence the votesorted order of the postings - but they might. I suspect it would also change the nature of certain discussions.</p>\n", "parentCommentId": "XbDGMyMMBsraSuu8R", "user": {"username": "Lukas T"}}, {"_id": "Yeewe7YfcEbnihpBH", "postedAt": "2022-08-28T11:16:01.671Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>To me it seems more like EA's STEMlord-ism and roots in management consultancy, and its consequent maximiser-culture, rejection of democracy, and heavy preference for the latter aspect of the explore-exploit tradeoff.</p><p>\"Number go bigger\" etc. with a far lower value placed on critical reason, i.e. what the number actually is.</p><p>Orthodoxy is very efficient, you just end up pointed in the wrong direction.</p>", "parentCommentId": "h6XK5osbSz9YysXLj", "user": {"username": "A.C.Skraeling"}}, {"_id": "hfxLWY33tawS794cB", "postedAt": "2022-08-28T11:42:24.701Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi John,</p><p>\"I don't really see how viewing climate change as a cascading risk would change the overall risk assessment. If you argue that climate change is a large cascading risk then you would have to think that climate would play an important role in starting the cascade from collapse to extinction. I don't see how it could do that and explain why at length in the report. Can you lay out a concrete scenario that sketches this cascading risk worry that isn't already discussed in the report?\"</p><p>Having read the report, I am still unclear where in the report you lay out this substantive case. Could you please point this out to me, and I will be happy to reread it as I must have missed it. Also note I don't just refer to cascading risks, but to systemic risks, existential vulnerabilities and exposures etc. Please show me where in your report you make a substantive case against these ideas as well. Thanks!</p><p>Moreover, cascading risks may only be to civilisational collapse, and may not even get you to extinction. If, as you suggest, climate change makes recovery harder, this may be a major problem from an X-Risk perspective. I agree, its unlikely a cascade would directly lead to extinction, but if it leads to major societal collapse (which your piece also doesn't seem to define), and recovery is harder, this may be enough to pose an X-Risk.&nbsp;</p><p>\"The report does suggest that climate change would make civilisational recovery harder but for plausible levels of warming, it would not be a large barrier to recovery and this should be clear from the substantive discussion in the report\"</p><p>The report suggests this but doesn't, as far as I can tell from having read the report, make this case particularly substantively. Also, in the section where this seems to be discussed most at length \"subsequent collapse\", there doesn't seem to be any citations &nbsp;If you could point me to what sources you have used to show that it shouldn't pose a large barrier to recovery, this would be nice. You suggest it should be clear from the report, so if you can point me to where in the report this should be clear from, that would be great. Apologies if I am being stupid and have just missed something obvious in the report.</p><p>\"The whole report is about whether climate change could lead to civilisational collapse or something close to it. What other mechanisms do you have in mind that are not already discussed in the report?\"</p><p>How about a scenario where a multitude of factors eg climate related damages, civil conflict, interstate conflict, bioweaponary, natural disasters and economic collapse all work in concert with each other? What I am trying to suggest is that by shutting down the possibilities to bio and nuclear war, you reduce the role that climate change could play in bringing about collapse.</p><p>\"The influence of climate change on great power war or war more generally seems like the most obvious indirect risk of climate change that could make a substantial difference to the scale of climate change.\"&nbsp;</p><p>Saying something is the most obvious isn't evidence or a justification. Your report is 400 pages long, I am pretty sure you have space to justify this core part of your methodological approach. Also, just because one thing is the \"most\" obvious doesn't mean others aren't worthy of consideration. Also, I am often very unclear what an indirect risk means, which again you don't seem to define in your report. If you could define this for me, I would be happy to answer your question.</p><p>Sorry if some of this is unclear. However, I really think a lot of your key ideas could so with better citation/definition. I also think that ignoring a lot of these concepts which are common in the literature, and then putting the burden on me to hash out the arguments in a comment on my weekend, rather than actually addressing these concepts, even if you were to reject them, in your 400 page report, is a little odd. Nonetheless, thanks for taking the time to respond to my comments thus far, and apologies if I have missed anything in the report- it is very long and I read it late at night</p><p>Best</p><p>Gideon</p>", "parentCommentId": "THcaFgd7pZkjjC97J", "user": {"username": "Gideon Futerman"}}, {"_id": "Y9HcKCDHCR7NpHrAK", "postedAt": "2022-08-28T11:58:17.564Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Not sure why this was downvoted. I really appreciate comments where people publicly acknowledge they may have made an error and update their views.&nbsp;</p>", "parentCommentId": "9Ljie3WTywRJqjAgw", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "ZihELNLqPicLLtkbK", "postedAt": "2022-08-28T12:56:40.706Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I do think it's reasonable to feel frustrated by your experience commenting on this post. I think you should have been engaged more respectfully, with more of an assumption of good faith, and that a number of your comments shouldn't have been so heavily downvoted. I do also agree with some of the concerns you've raised in your comments and think it was useful for you to raise them.<sup class=\"footnote-ref\"><a href=\"#fn-yJFrRPRjYPnB83NCn-1\" id=\"fnref-yJFrRPRjYPnB83NCn-1\">[1]</a></sup></p>\n<p>At the same time, I do think this comment isn't conducive to good conversation, and the content mostly strikes me as off-base.</p>\n<ul>\n<li>\n<p><strong>The EA community doesn't have its roots in management consultancy.</strong> Off the top of my head, I  can't think of anyone who's sometimes considered a founding figure (e.g. Singer, Parfit, Ord, MacAskill, Yudkowsky, Karnofsky, Hassenfeld) who was a management consultant. Although the community does have some people who were or are management consultants, they don't seem overrepresented in any interesting way.</p>\n</li>\n<li>\n<p><strong>At least on the two most obvious interpretations, I don't think the EA community rejects democracy to any unusual degree.</strong> If you mean \"people involved in EA reject democracy as a political system,\" then I think I've literally never heard anyone express pro-autocracy views. If you mean \"organizations in the EA space reject directly democratic approaches to decision-making,\" then that is largely true, but I don't think it's in any way a distinctive feature of the community. I think that almost no philanthropic foundations, anywhere, decide where to give money using anything like a popular vote; I think the same is generally true of advocacy and analysis organizations. I'd actually guess that EA organizations are actually somewhat more democratic-leaning than comparable organizations in other communities; for example, FTX's regranting program is both pretty unusual and arguably a bit \"more democratic\" than other approaches to giving away money. (If you mean something else by \"rejection of democracy,\" then I apologize for the incorrect interpretations!)</p>\n</li>\n<li>\n<p><strong>Lastly, I don't think the EA community has an unusually heavy preference for the exploit end of the explore-exploit trade-off; I think the opposite is true.</strong> I can't think of any comparable community that devotes a larger amount of energy to the question \"What should we try to do?\", relative to actually trying to do things. I think this is actually something that turns off a lot of entrepreneurial and policy-minded people who enter the community,  who want to try to accomplish concrete things and then get discouraged by what they perceive as a culture of constant second-guessing and bias against action.<sup class=\"footnote-ref\"><a href=\"#fn-yJFrRPRjYPnB83NCn-2\" id=\"fnref-yJFrRPRjYPnB83NCn-2\">[2]</a></sup></p>\n</li>\n</ul>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-yJFrRPRjYPnB83NCn-1\" class=\"footnote-item\"><p>For example, although I'm on balance in favor of the current strong upvote system, I agree it also has important downsides. And although I'm pretty bearish on the value of standard academic peer-review processes, I do think it's really useful for especially influential reports to be published alongside public reviews from subject matter experts. For example, when it publishes long reports, OpenPhil sometimes also publishes open reviews from subject matter experts; I think it would be great to see more of that, even though it's costly. <a href=\"#fnref-yJFrRPRjYPnB83NCn-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-yJFrRPRjYPnB83NCn-2\" class=\"footnote-item\"><p>On the other hand, even though I don't like the term, I do think it's fair to say there's an unusually large \"STEMlord-ism\" undercurrent to the culture. People often do have much more positive impressions of STEM disciplines (+econ and the more technical parts of analytic philosophy), relative to non-STEM disciplines. I think this attitude isn't necessarily <em>wrong</em>, but I do think you're correct to perceive that it's there. <a href=\"#fnref-yJFrRPRjYPnB83NCn-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": "Yeewe7YfcEbnihpBH", "user": {"username": "bmg"}}, {"_id": "WjKuFZejgCQ9eoBmv", "postedAt": "2022-08-28T13:27:16.012Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Ha! &nbsp; STEMlord-ism. &nbsp; Good one! &nbsp; Though I noticed that the anonymous click happy hordes who can't be bothered to explain their votes have already downvoted &nbsp;your STEMlord-ism comment, so that must mean it's completely wrong. &nbsp;:-) &nbsp;&nbsp;</p><p>Well, you seem to be even more ruthless than myself on this topic, so we should get along great. &nbsp;That said, I have decided to stop swimming upstream and am now devoting myself to accumulating as many down votes as possible. &nbsp;That way, should anyone wish to find my posts, they can simply power scroll to the bottom of any listings, and there I'll be! &nbsp; :-)</p>", "parentCommentId": "Yeewe7YfcEbnihpBH", "user": {"username": "Phil Tanny"}}, {"_id": "2ACst7ZDGKsYkavmj", "postedAt": "2022-08-28T13:30:01.482Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thank you for providing an excellent example of how one should down vote, if that is what you're doing. &nbsp; Not meaning to put words in &nbsp;your mouth, just applauding a reasoned challenge.</p>", "parentCommentId": "ZihELNLqPicLLtkbK", "user": {"username": "Phil Tanny"}}, {"_id": "bA7Kjbvm5SzSFh7J3", "postedAt": "2022-08-28T13:31:34.384Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Admirable honesty, well done. &nbsp;</p>", "parentCommentId": "HixsMpfxHwkx9gX7P", "user": {"username": "Phil Tanny"}}, {"_id": "2CxNkAN8eMAJRWAkr", "postedAt": "2022-08-28T15:59:46.788Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thanks!</p>\n<p>To be clear, though, I also don't think people should feel like they need to write out comments explaining their strong downvotes. I think the time cost is too high for it to be a default expectation, particularly since it can lead to getting involved in a fraught back-and-forth and take additional time and energy that way. I don't use strong downvotes all that often, but, when I do use them, it's rare that I'll also write up an explanatory comment.</p>\n<p>(Insofar as I disagree with forum voting norms, my main disagreement is that I'd like to see people have <em>somewhat</em> higher bars for strong downvoting comments that aren't obviously substanceless or norm-violating. I think there's an asymmetry between upvotes and downvotes, since downvotes often feel aggressive or censorious to the downvoted person and the people who agree with them. For that reason, I think that having a higher bar for downvotes than for upvotes helps to keep discussions from turning sour and helps avoid alienating people more than necessary.)</p>\n", "parentCommentId": "2ACst7ZDGKsYkavmj", "user": {"username": "bmg"}}, {"_id": "HjJdjEs3DdonJpLwT", "postedAt": "2022-08-28T16:37:37.975Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>To be clear, though, I also don't think people should feel like they need to write out comments explaining their strong downvotes.</p></blockquote><p>&nbsp;</p><p>Ok, no problem, thanks for sharing that. &nbsp; &nbsp;For me, without explanations &nbsp;the entire voting system up and down generates entirely worthless information. &nbsp;With explanations then there is an opportunity to evaluate the quality of the votes. &nbsp;&nbsp;</p><p>To be fair, I've been using forums regularly since they first appeared on the net, and this is probably the most intelligent forum I've ever discovered, which I am indeed quite grateful for. &nbsp; Perhaps the reason I've complained about the voting system is that, in my mind, it contaminates what is otherwise a pretty close to perfect site. &nbsp;The contrast between near perfection, and high school level popularity contest gimmickry offends my delicate aesthetic sensibility. &nbsp; :-)</p>", "parentCommentId": "2CxNkAN8eMAJRWAkr", "user": {"username": "Phil Tanny"}}, {"_id": "4rHTb38uzJq4FHawX", "postedAt": "2022-08-28T16:39:33.409Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I disagree that the problem here is groupthink, and I think if you look at highly rated posts, you can't reasonably conclude that people who criticise the orthodox position will be reliably downvoted. I think the problem here is that some people vote based on tone and some on content, which means that when something is downvoted different people draw different conclusions about why.</p>\n", "parentCommentId": "XbDGMyMMBsraSuu8R", "user": {"username": "alexrjl"}}, {"_id": "qhEszfQochd4dgAgL", "postedAt": "2022-08-28T17:17:26.848Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>No I didn't get any of that. I don't want to put words in their mouths, but Peter overall seemed very positive. I'm less sure what Goodwin and James thought, but they didn't say anything massively negative, though perhaps they thought it</p>", "parentCommentId": "TuqbbSboybXLYesJj", "user": null}, {"_id": "QBiuqwaxHdrGvwvvb", "postedAt": "2022-08-28T17:35:52.994Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>So you didn't get anyone reviewing your overall approach or methodology? Don't you perhaps think this is a bit of an oversight given how influential this report is likely to be?</p>\n", "parentCommentId": "qhEszfQochd4dgAgL", "user": {"username": "Gideon Futerman"}}, {"_id": "mELnDLZGKfAb3aMCn", "postedAt": "2022-08-28T17:53:09.222Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think it might help to make this discussion more concrete if you gave an example of what you mean by a cascading risk. It's hard to defend the arguments in the report when I'm not sure what you are saying I have missed in my analysis. I talk about risks to the food system, and the spillover effects that might come from that (eg conflict), I talk about purported effects on crime, I talk about drought, I talk about tipping points etc. What is the casual story you have in mind?</p><p>The substantive discussion is the outline all of the various impacts that I have discussed and summarising the literature on economic costs, which tends to find costs of 4ºC are on the order of 5% of GDP. Unless something is radically missing from these analyses, I'm not sure how climate change could make a large difference to the chance of recovery from collapse.&nbsp;</p><blockquote><p>How about a scenario where a multitude of factors eg climate related damages, civil conflict, interstate conflict, bioweaponary, natural disasters and economic collapse all work in concert with each other?&nbsp;</p></blockquote><p>I discuss the potential impacts of climate damages, civil conflict, interstate conflict and the economic impact of climate change at considerable length. Even if these all work in concert with each other, my substantive conclusion is unaffected. I also explicitly discuss the possibility that climate change will cause the use of bioweapons in the report.&nbsp;</p><blockquote><p>What I am trying to suggest is that by shutting down the possibilities to bio and nuclear war, you reduce the role that climate change could play in bringing about collapse.</p></blockquote><p>I don't shut down the possibility, I argue against it at considerable length.&nbsp;</p><blockquote><p>However, I really think a lot of your key ideas could so with better citation/definition. I also think that ignoring a lot of these concepts which are common in the literature, and then putting the burden on me to hash out the arguments in a comment on my weekend, rather than actually addressing these concepts, even if you were to reject them, in your 400 page report, is a little odd.</p></blockquote><p>You have made a series of conceptual criticisms of the report. I have said that my conceptual approach is exhaustive, which is true, but you seem to think this is unsatisfactory. I don't think it is unreasonable for you to explain to me what you think I have missed.</p><p>A direct climate impact is an impact of climate change for which the proximal cause of the damage is not human-on-human interaction. An example would be something like heat stress deaths or crop failures from drought. An indirect climate impact is an impact for which the proximate cause is human-on-human damage, but for which the ultimate cause is climate change. An example would be crime, conflict or undermines institutions. &nbsp;</p><blockquote><p>Saying something is the most obvious isn't evidence or a justification. Your report is 400 pages long, I am pretty sure you have space to justify this core part of your methodological approach. Also, just because one thing is the \"most\" obvious doesn't mean others aren't worthy of consideration.&nbsp;</p></blockquote><p>I think appeals to common sense and what is obvious are often permissible in arguments. Which indirect effect do you think is more important?</p><p>I was expecting the discussion to be more like 'hear is why you are wrong about emissions/climate sensitivity/runaway greenhouse/impacts on the food system/impacts on conflict/...'&nbsp;</p>", "parentCommentId": "hfxLWY33tawS794cB", "user": null}, {"_id": "9FgHPDFTu3vWJnZmB", "postedAt": "2022-08-28T17:58:16.823Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Oh sorry, I thought you meant 'did they leave negative comments about these things'. Lots of people looked at the overall report and were free to point out things I missed.</p><p>I still don't really understand why you have such an issue with the methodology. I took my methodology to be - pick out all of the things in the climate literature that are relevant to the longtermist import of climate change, review the scientific literature on those things, and then arrive at my own view, send it to reviewers, make some revisions, iterate.&nbsp;</p>", "parentCommentId": "QBiuqwaxHdrGvwvvb", "user": null}, {"_id": "K6dWQuXne4QANxp2D", "postedAt": "2022-08-28T19:12:43.541Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Right, I wasn't looking for a response about methane, more just excitedly listing, I guess. My motivated thinking, going in, is that there's plenty of exposed methane hydrates and free methane on shallow parts of the continental shelves exposed to much warmer waters in the Arctic and Siberia. A <a href=\"https://www.nature.com/scitable/knowledge/library/methane-hydrates-and-contemporary-climate-change-24314790/\">Nature paper </a>from Ruppel is a bit old, and includes discussion of deeper deposits in warmer waters much further south. The paper does make exceptions for shallower deposits, as in the Arctic sea. She notes technical difficulties in resolving the origin of the methane even in those cases, but there's been efforts to resolve the questions since then. A <a href=\"https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2016RG000534\">later Reviews Of Geophysics paper</a> &nbsp;confronts predictions about sources and distributions.I have to dig into that.&nbsp;</p><p>Carolyn Ruppel is also a proponent of drilling undersea methane for fuel, and has been <a href=\"https://www.loe.org/shows/segments.html?programID=12-P13-00010&amp;segmentID=2\">for the last decade</a>. Treatment of the melting arctic as a tipping point seems politically unpopular, now that various projected benefits of its melt have been identified. We can drill for natural gas or oil, fish, establish shipping lanes, or fight over sovereignty up there, but I'm not seeing much government attention on the ice-free Arctic as an actual climate problem.&nbsp;</p><p>Still, Ruppel holds an important position, and I will give her research more attention now. Thank you.</p><p>Yes, as far as sea level rise, I read the sections you mentioned, thank you. The West Antarctic is less of an immediate concern than Greenland, so I am puzzled why you haven't mentioned Greenland explicitly. Your discussion of sea level rise doesn't include Greenland's contribution, but Greenland will melt before the West Antarctic, and it holds several meters of sea level rise in its ice. I believe that Greenland's melt could shutdown the AMOC as well.</p><p>I think processes like fires on permafrost land go ignored in models of permafrost thaw, just like lubrication of the bottom of Greenland Ice goes ignored. Some discussions about climate change suggest that people move north, but north into areas of melting permafrost? That seems dubious.</p><p>Anyway, thanks again, I'll come back to you with whatever I actually conclude once I compare the two points of view that I have on arctic methane:</p><ul><li>dangerous tipping point</li><li>harmless, possibly irrelevant, source of natural gas</li></ul>", "parentCommentId": "sctdhTLfJtvJyEzHY", "user": {"username": "Noah Scales"}}, {"_id": "C5KAfgEfTBbQuWCHg", "postedAt": "2022-08-29T07:08:02.449Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Doubtful if you look at Gideon's first comment and remember it was downvoted through the floor almost immediately.</p><p>Questioning orthodoxy is ok within some bounds (often technical/narrow disagreements), or when expressed in suitable terms, e.g.&nbsp;</p><ul><li>(Significant) underconfidence, regardless of expertise and/or lack of expertise among those criticised</li><li>Unreasonable assumptions of good faith, even in the face of hostility or malpractice (double standards, perhaps a lesser form of the expectation of a 'perfect victim')</li><li>Extensive use of EA buzzwords</li><li>Huge amounts of extra work/detail &nbsp;that would not be deemed necessary for non-critical writing</li><li>Essentially making oneself as small as possible so as not to set off the Bad Tone hair-trigger<ul><li>This is difficult because knowing what you are talking about and being lazily dismissed by people you know for a fact know far less than you about a given subject matter makes one somewhat frustrated</li></ul></li></ul><p>As several EAs have noted, e.g. <a href=\"https://forum.effectivealtruism.org/posts/gx7BEkoRbctjkyTme/democratising-risk-or-how-ea-deals-with-critics-1?commentId=cXnTCWSbZgySoyRu7\">weeatquince</a>, this is time-consuming and (emotionally) exhausting, and often results in dismissal anyway.</p><p>This is even harder to pull off when questioning sensitive issues like politics, funding ethics, foundational intellectual issues (e.g. the ways in which the TUA uses utterly unsuitable tools for its subject matter due to a lack of outside reading), competence of prominent figures, etc.</p><p>I actually think this forms a sort of positive feedback loop, where EAs become increasingly orthodox (and confident in that orthodoxy) due to perceived lack of substantive critiques, which makes making those critiques so frustrating, time-consuming, and low-impact that people just don't bother. I've certainly done it.&nbsp;</p>", "parentCommentId": "4rHTb38uzJq4FHawX", "user": {"username": "A.C.Skraeling"}}, {"_id": "RxcF8sZvpTXdi49GH", "postedAt": "2022-08-29T07:17:31.525Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>John, with all possible respect, that is not a theoretical framework.</p><p>I think one of your major errors in this piece (as betrayed by your methodology-as-categorisation comment above), is that you have an implicit ontology of factors as essentially separate phenomena that can perhaps have a few, likely simple relationships, which is simply not how the Earth-system &nbsp;or social systems work.</p><p>Thus, you think that if you've written a few paragraphs on each thing you deem relevant (chosen informally, liberally sprinkled with assertions, assumptions, and self-citations), you've covered everything.</p><p>It's all very Cartesian.</p>", "parentCommentId": "9FgHPDFTu3vWJnZmB", "user": {"username": "A.C.Skraeling"}}, {"_id": "nXDGmzw8i92qBFJax", "postedAt": "2022-08-29T09:44:08.075Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Why was this downvoted?</p>\n", "parentCommentId": "bA7Kjbvm5SzSFh7J3", "user": {"username": "Guy Raveh"}}, {"_id": "SPWFxwwtTsz3fQRPh", "postedAt": "2022-08-29T09:53:00.889Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote>\n<p>I don't think the EA community rejects democracy to any unusual degree</p>\n</blockquote>\n<ol>\n<li>Every time the issue of taxes comes up, it's a very popular opinion that people should avoid as much taxes as possible to redirect the money to what they personally deem effective. This is usually accompanied by insinuations that democratically elected governments are useless or harmful.</li>\n<li>While it is true that aid and charity in general tend to be far from democratic, it is also widely accepted that they often cause harm or just fail to have an effect - indeed, this is the basis for our very movement. There are also many known cases where bad effects were the result of lack of participation by the recipients of aid. So it's not enough to be \"no less democratic than other charity orgs\". I believe we should strive to be <em>much more</em> democratic than that average - which seems to me like a minority view here.</li>\n<li>I'm assuming you're right about the amount of democracy in other non-profits, but the situation in my country is actually different. All non-profits have members who can call an assembly and have final say on any decision or policy of the non-profit.</li>\n</ol>\n", "parentCommentId": "ZihELNLqPicLLtkbK", "user": {"username": "Guy Raveh"}}, {"_id": "4eDS6vTEAnivfgazc", "postedAt": "2022-08-29T10:34:38.431Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Strongly upvoted.</p>\n<p>Usually I would've given a regular upvote, but I think this should be highlighted above the meta comments and flame wars.</p>\n", "parentCommentId": "tjZywjaEt8hKaYRzt", "user": {"username": "Guy Raveh"}}, {"_id": "Xv7xXERsq8n6hYEQX", "postedAt": "2022-08-29T11:00:44.635Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Because the voting system is in place to encourage high school students to participate in EA discussion. &nbsp; If you were to say something like \"I still think Britney Spears is cool\" then you're gonna get down voted, so I'd try to avoid that topic if you can.</p>", "parentCommentId": "nXDGmzw8i92qBFJax", "user": {"username": "Phil Tanny"}}, {"_id": "8FdHarqP2BrgsDkWj", "postedAt": "2022-08-29T11:24:04.115Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thanks for the thoughtful comment!</p>\n<blockquote>\n<p>So it's not enough to be \"no less democratic than other charity orgs\". I believe we should strive to be much more democratic than that average - which seems to me like a minority view here.</p>\n</blockquote>\n<p>I do think that this position - \"EA foundations <em>aren't</em> unusually undemocratic, but they should still be a lot more democratic than they are\" - is totally worthy of discussion. I think you're also right to note that other people in the community tend to be skeptical of this position; I'm actually skeptical of it, myself, but I would be interested in reading more arguments in favor of it.</p>\n<p>(My comment was mostly pushing back against the suggestion that the EA community is <em>distinctly</em> non-democratic.)</p>\n<blockquote>\n<p>I'm assuming you're right about the amount of democracy in other non-profits, but the situation in my country is actually different. All non-profits have members who can call an assembly and have final say on any decision or policy of the non-profit.</p>\n</blockquote>\n<p>I've never heard of this - that sounds very like a really interesting institutional structure! Can I ask what you're country you're in, or if there's anything to read on how this works in practice?</p>\n<blockquote>\n<p>Every time the issue of taxes comes up, it's a very popular opinion that people should avoid as much taxes as possible to redirect the money to what they personally deem effective. This is usually accompanied by insinuations that democratically elected governments are useless or harmful.</p>\n</blockquote>\n<p>The first part of this does seem like a pretty common opinion to me - fair to point that out!</p>\n<p>On the second: I don't think \"democratic governments are useless or harmful\" is a popular opinion, if the comparison point is either to non-democratic governments or no government. I do think \"government programs are often really inefficient or poorly targeted\" and \"governments often fail to address really important issues\" <em>are</em> both common opinions, on the other hand, but I don't really interpret these as being about democracy per se.<sup class=\"footnote-ref\"><a href=\"#fn-DzJpuqfmJT5MQ5pFC-1\" id=\"fnref-DzJpuqfmJT5MQ5pFC-1\">[1]</a></sup></p>\n<p>One thing that's also complicated, here, is that the intended beneficiaries of EA foundations' giving tend to lack voting power in the foundations' host countries: animals, the poor in other countries, and future generations. So trying to redirect resources to these groups, rather than the beneficiaries preferred by one's national government, can also be framed as a response to the fact that (e.g.) the US government is <em>insufficiently</em> democratic: the US government doesn't have any formal mechanisms for representing the interests of most of the groups that have a stake in its decisions. Even given this justification, I think it probably would still be a stretch to describe the community tendency here as overall \"democratic\" in nature. Nonetheless, I think it does at least make the situation a little harder to characterize.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-DzJpuqfmJT5MQ5pFC-1\" class=\"footnote-item\"><p>At least speaking parochially, I also think of these as relatively mainstream opinions in the US rather than opinions that feel distinctly EA. Something I wonder about, sometimes, is whether cross-country differences are underrated as a source of disagreement within and about the EA community. Your comment about how non-profits work in your country was also thought-provoking in this regard! <a href=\"#fnref-DzJpuqfmJT5MQ5pFC-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": "SPWFxwwtTsz3fQRPh", "user": {"username": "bmg"}}, {"_id": "kJjzcFNaPDrDBkvGB", "postedAt": "2022-08-29T11:40:33.029Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Which impacts do you think I have missed? Can you explain why the perspective you take would render any of my substantive conclusions false?</p><p>I'm not sure what you're talking about with self-citation. When do I cite myself?</p><p>Another way to look at it is to think about the impacts including in climate-economy models. Takakura et al (2019), which is one of the more comprehensive, includes:</p><ul><li>Fluvial flooding</li><li>Coastal inundation</li><li>Agriculture</li><li>Undernourishment</li><li>Heat-related excess mortality</li><li>Cooling/heating demand</li><li>Occupational-health costs</li><li>Hydroelectric generation capacity</li><li>Thermal power generation capacity</li></ul><p>I discuss all of those except cooling/heating demand and hydro/thermal generation capacity, as they seem like small factors relative to climate risk. In addition to that, I discuss tipping points, runaway greenhouse effects, crime, civil and interstate conflict, ecosystem collapse.&nbsp;<br>&nbsp;</p>", "parentCommentId": "RxcF8sZvpTXdi49GH", "user": null}, {"_id": "suA6J6XHSWWpuj6CG", "postedAt": "2022-08-29T12:04:39.063Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote>\n<p>Can I ask what you're country you're in, or if there's anything to read on how this works in practice?</p>\n</blockquote>\n<p>I live in Israel. A short Google search didn't turn up much in terms of English language information about this, other than <a href=\"https://www.gov.il/BlobFolder/policy/proper_management_guidelines/en/associationen.pdf\">this government document</a> outlining the relevant laws and rules. The relevant part of it is the chapter about the institutions of an Amuta(=Israeli non-profit), starting page 9.</p>\n<p>In practice, since members have to be admitted by already existing bodies of the non-profit, the general assembly can be just the executive board and the auditor(s), and thus be meaningless. I'm sure this happens often (maybe most of the time). In particular, EA Israel (the org) has very few members. But I've been a member of a non-profit with a much larger (~100 people) general assembly in the past.</p>\n<p>You can draw some parallels between the general assembly and a board of directors (Edit: trustees? I don't know what the right word is). On the other hand, you can also draw parallels between the executive board and a board of directors - since in many (most?) cases, including EA Israel, the actual day-to-day management of the non-profit is done by a paid CEO and other employees. So the executive board makes strategy decisions and oversees the activity, and doesn't implement it itself. Meaning it's kind of a board of directors, which still answers to a possibly much larger general assembly.</p>\n", "parentCommentId": "8FdHarqP2BrgsDkWj", "user": {"username": "Guy Raveh"}}, {"_id": "ZreffaG5DzDrfx27z", "postedAt": "2022-08-29T12:08:46.282Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote>\n<p>One thing that's also complicated, here, is that the intended beneficiaries of EA foundations' giving tend to lack voting power in the foundations' host countries: animals, the poor in other countries, and future generations. So trying to redirect resources to these groups, rather than the beneficiaries preferred by one's national government, can also be framed as a response to the fact that (e.g.) the US government is insufficiently democratic: the US government doesn't have any formal mechanisms for representing the interests of most of the groups that have a stake in its decisions.</p>\n</blockquote>\n<p>I don't disagree, but I think the discussion is not as simple. When it comes to \"legitimate\" EA money, I think it would be much better to have some mechanism that includes as many of the potential beneficiaries as possible, rather than one national government. I just view tax money as \"not legitimate EA money\" (Edit: and I see people who do want to avoid taxes, as wanting to subvert the democratic system they're in in favor of their own decisionmaking).</p>\n", "parentCommentId": "8FdHarqP2BrgsDkWj", "user": {"username": "Guy Raveh"}}, {"_id": "42xNsHPHtpRDZzFXw", "postedAt": "2022-08-29T12:25:34.410Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>This time it's me who downvoted. The first part (high school students) doesn't seem close to being true, and the second (Britney Spears) is not related at all to the discussion?</p>\n", "parentCommentId": "Xv7xXERsq8n6hYEQX", "user": {"username": "Guy Raveh"}}, {"_id": "dQeKs5pGQHTS7jiYF", "postedAt": "2022-08-29T12:31:06.735Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Sorry for jumping into this discussion which I haven't actually read (I just saw this particular comment through the forum's front page), but one thing that's absent and I'd be interested in is desertification. I didn't find any mention of it in the report.</p>\n", "parentCommentId": "kJjzcFNaPDrDBkvGB", "user": {"username": "Guy Raveh"}}, {"_id": "gDxGgpFAsEM3Kjsnc", "postedAt": "2022-08-29T14:00:47.286Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thank you for not being anonymous, and for explaining your down vote. &nbsp;That's all I've been requesting from the beginning. &nbsp; I agree my colorful language was an imprecise description of the situation. &nbsp;&nbsp;</p><p>PS: &nbsp;Holy cow, I got -24 from just 6 votes. &nbsp; That's awesome. &nbsp;I predict I will soon be the king of down votes! &nbsp; &nbsp;High school systems require high school participation. &nbsp;</p>", "parentCommentId": "42xNsHPHtpRDZzFXw", "user": {"username": "Phil Tanny"}}, {"_id": "sPaqhJ3G3orwjRAzX", "postedAt": "2022-08-29T14:01:05.783Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>This is pretty far afield from what the post is about, but to me the most natural reason why someone might say EA rejects democracy are neither of the two interpretations you mentioned, but rather that EAs are technocrats suspicious of democracy, to <a href=\"https://bostonreview.net/forum_response/response-rob-reich/\">quote</a> Rob Reich:</p><blockquote><p>In my experience, effective altruists are unabashed technocrats. They seek to maximize good in the world, and they deploy the best evidence they can marshal to identify the mechanisms by which one can pursue that goal. Effective altruists might locate instrumental value in politics—to the extent that political engagement is necessary to promote good—but not, I suspect, intrinsic value.</p><p>Plato identified the best city as that in which philosophers were the rulers. Effective altruists see the best state of affairs, I think, as that in which good-maximizing technocrats are in charge. Perhaps it is possible to call this a politics: technocracy.</p><p>But this politics is suspicious of, or rejects, the form of politics to which most people attach enormous value: democracy. Would effective altruists attach any independent value to democracy? Given the chance to craft social and political arrangements from scratch, would effective altruists select democratic rather than technocratic rule? I suspect the answer is no, and to that extent, effective altruism is in tension with the commonplace philosophy that identifies in democracy a powerful normative force.</p></blockquote>", "parentCommentId": "ZihELNLqPicLLtkbK", "user": null}, {"_id": "QRapr3prhqjCDxtRK", "postedAt": "2022-08-29T15:27:58.428Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>I disagree that the problem here is groupthink, and I think if you look at highly rated posts, you can't reasonably conclude that people who criticise the orthodox position will be reliably downvoted</p></blockquote><p>The highly rated posts I've seen so far, on the topic of X risk in particular, appear to me to typically be a product of group think. &nbsp; They're typically very articulate, very polished form, highly informed on details, (ie. good academic style) &nbsp;but not escaping group think.</p><p>As evidence, please direct us to the writers here who have been laser focused on the critical importance of managing the pace of the knowledge explosion. &nbsp;Where are they? &nbsp; If they exist, and I sincerely hope they do (because I don't have the authority to sell the case) I really would like to meet them.</p><p>In my opinion, group think is to some immeasurable degree built in to the fabric of academia, because academia is a business, and one does not stay in business by alienating one's clients. &nbsp;Thus, to the degree the academic depends on their salary, they are somewhat imprisoned within the limits of whoever is signing their paycheck.</p><p>Here's an example. &nbsp;</p><p>I can afford to persistently sell a \"world without men\" idea as an ambitious solution to human violence because nobody owns me, I have nothing of value at stake. &nbsp; &nbsp;Whatever the merits of such a case might be, (very clearly debatable) &nbsp;academics can't afford to make that case, because the group consensus of their community will not tolerate it. &nbsp;And before you protest, know that I've already been threatened with banning on this site just for bringing the subject up. &nbsp;&nbsp;</p><p>Academia is business, and is thus governed by fear, and that is the source of group think.</p><p>If you would, please down vote this post at least 100 times, as I believe I've earned it. &nbsp;:-)</p>", "parentCommentId": "4rHTb38uzJq4FHawX", "user": {"username": "Phil Tanny"}}, {"_id": "kckkmPSqyAqLDTxqQ", "postedAt": "2022-08-29T19:33:04.282Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thanks, I'm actually surprised that members of the community have such energy around its concerns about the quality of climate change scholarship. I didn't expect that that the OP would generate these concerns.&nbsp;</p><p>I posted a radical opinion about climate change here some time back that got a few downvotes and almost no readers. Basically, I think global warming is now self-amplifying. Anyway, I don't mind the lack of interest, it wasn't scholarly work. &nbsp;</p><p>The meta comments are about research process, how best to represent differing viewpoints, and whether John gave fair weight to considerations outside the point of view that John holds. I don't have a comment here, I think I'll take what was given as where to start my own learning efforts.</p><p>&nbsp;What I would like from others who post here is more engagement around specific scenarios of risk. From my review of comments made in discussions of climate change, the obstacle seems to be lack of commitment to the plausibility of specific scenarios.&nbsp;</p><p>So for example, a discussion of a multi-breadbasket failure would include a few sentences about how our civilization would respond by choosing to grow its own food, eg., in cities. I would like to see someone work that through. We're talking about locally producing calorie-dense sources of carbohydrates and proteins in a situation in which grain stocks become limited worldwide. Vegies on your windowsill won't do the job. More generally, there's a question about stocks vs flows, we have some grain reserves, but how much, and how should they be managed in case of what percentage of global crop failures? George Monbiot has some conclusions (hint, he wants to use some old NASA tech), I'm looking forward to reading his work. Then there's the reason for failure. Hurricanes inundating low-lying farm areas (like Vietnam) would have a longer impact on soil productivity than would a 6-week heat wave, or would it?</p><p>Another example would be how we handle internal and global migration, given some specific scenario. For example, a famine and water shortage in Bangladesh during a heat wave inducing power outages and heat stress enough to kill people. What does an altruistic response to that situation look like?</p><p>In any prediction where the claim goes, \"It would be very bad if....\", there's usually a discussion of 100's of millions of deaths. What does that mean? Do they die in place, suddenly, or was there a predictable build-up but no response for a long time? I see this happening with a multi-breadbasket failure, there's hardly anyone working to prevent this scenario in realtime. There's one UN organization, a small one, and then &nbsp;there's ALLfed, who seem to be focused on Nuclear Winter. And how long is realtime? There's supposed to be a network coordinated from the UN that tracks when a global famine is looming and arranges stocks and flows to prevent the worst of it. Are they funded and effective?</p><p>I have also noticed a lack of interest in the states about the impacts of small heat waves elsewhere, for example, China's recent heat wave. But these tiny examples are a good start for creating predictions. People fried eggs on city stones for fun over there (yes, the heat island effect). Bridges buckled from heat, and their hydroelectric dams are dry. The immediate predictions, sadly, are just focused on their GDP. There's not much good prediction work to explain what happens if their water and hydropower shortage continue. I know only a little, that different geographic regions have different levels of dependency on hydropower. But the industries effected are critical to some sections of the global economy, and their shutdown, long-term, should be a concern for the economics-minded. Will they turn to coal to make up the difference and does it matter (coal, btw, has an interesting silver lining, the aerosol effect)?</p><p>Then there's Britain's recent heat wave, and the heat wave in the Northwest of the US a few years ago. All quite odd, linked to the meandering jet stream. The rain on Greenland's summit, another anomaly, which sets a new precedent for Greenland melt. We don't want an atmospheric river dumping on Greenland for days on end.</p><p>Then there's the recent prediction of a historical flood of California, a recurring event, but worsened by climate change.</p><p>Yes, so there's plenty to start from, and when building a scenario, you can take what's happened, make it worse, and make it last longer or occur repeatedly. Use that to explain why climate change is bad. Conversely, to reject climate change as a catastrophic risk, explain how we go about handling these difficult situations successfully, in time to prevent risks like the deaths of 100's of millions of people. I would like to read some of those rejections.</p>", "parentCommentId": "4eDS6vTEAnivfgazc", "user": {"username": "Noah Scales"}}, {"_id": "EHuqJRKiMDAhwWx8d", "postedAt": "2022-08-29T19:52:11.717Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>I think the problem here is that some people vote based on tone and some on content,</p></blockquote><p>I hope to encourage more people to instead upvote based on rigor/epistemics/quality on the margin, rather than based on tone or based on agreement (which is some of \"content\") or vibe.&nbsp;</p><p>EDIT: I also think a surprisingly high number of people upvote low-quality criticisms that have a good tone, which makes me surprised when others assert than the movement is systematically biased against criticisms (\"insufficient discernment\" will be a fairer criticism, but that's a mistake, not a bias).</p>", "parentCommentId": "4rHTb38uzJq4FHawX", "user": {"username": "Linch"}}, {"_id": "kBmYmixWbt8t6ZP7c", "postedAt": "2022-08-29T20:07:02.230Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Quantitatively, if you look at the <a href=\"https://forum.effectivealtruism.org/allPosts?sortedBy=top&amp;timeframe=allTime\">top 10 most upvoted posts</a>:</p><ul><li>4 are straightforwardly criticisms: (\"Free-spending EA might be bad...\", \"Bad Omens\", \"case against randomista development\", \"Critiques of EA\")</li><li>4 are partial criticisms (\"Long-Termism\" vs. \"Existential Risk\", \"My mistakes on the path to impact\",\"EA for dumb people?\", \"Are you really in a race?\")</li><li>1 (the most upvoted) was a response to criticism (\"EA and the current funding situation\")</li><li>1 was about the former EAForum head leaving (\"Announcing my retirement\")</li></ul><p>This is a total of 40-80%, depending on how you count.</p><p>(In the next 10 posts, I \"only\" see 3 posts that are criticisms, but I don't think that 30% is particularly low either. It does get lower further down however).&nbsp;</p>", "parentCommentId": "C5KAfgEfTBbQuWCHg", "user": {"username": "Linch"}}, {"_id": "g7yzNZnenWACTTka8", "postedAt": "2022-08-29T20:20:35.785Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I upvoted since I also thought Ben's claims in that section was too strong.<br><br>That said, I think \"suspicious of democracy\" seems fairly extreme as a way to describe it. I think some EAs are healthily skeptical that democracy is the best possible governance mechanism (or more controversially, best realistically attainable governance mechanisms).&nbsp;</p><p>I would certainly consider myself one of them. I think we should generally have a healthy degree of skepticism towards our existing institutions, and I don't see clear reasons why we should privilege the \"democracy\" hypothesis over technocracy or more futuristic setups, other than general conservatism (\"<a href=\"https://en.wiktionary.org/wiki/Chesterton%27s_fence#:~:text=Chesterton's%20fence%20(uncountable),state%20of%20affairs%20is%20understood.\">Chesterton's fence</a>\") preferences/heuristics. In contrast, we have substantially more evidence for the benefits of democracies over monarchies or other autocratic systems.</p><p>I do think the track record where so-called elite people overestimate the efficiency gains of less free systems is suboptimal (LOL at the 1950s economists who thought that the Soviet Union will be more productive than the US). But I don't think bias arguments should be &nbsp;dominant.</p>", "parentCommentId": "sPaqhJ3G3orwjRAzX", "user": {"username": "Linch"}}, {"_id": "Pd78BDKmGNmf4KEMB", "postedAt": "2022-08-30T01:56:19.072Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think this is a non-sequitur in response to A.C.Skraeling's comment. They said:</p><blockquote><p>Questioning orthodoxy is <strong>ok within some bounds</strong> (often technical/narrow disagreements), <strong>or when expressed in suitable terms</strong></p></blockquote><p>A high percentage of the most upvoted posts of all time being criticism of some sort is perfectly compatible with this.</p><p>Here's a recent case of someone questioning orthodoxy (writing a negative review of WWOTF), not bothering to express it in EA-friendly enough language, and subsequently being downvoted to a trollish level (-12) for it despite their content being much better than that: <a href=\"https://forum.effectivealtruism.org/posts/AyPTZLTwm5hN2Kfcb/book-review-what-we-owe-the-future-erik-hoel\">https://forum.effectivealtruism.org/posts/AyPTZLTwm5hN2Kfcb/book-review-what-we-owe-the-future-erik-hoel</a></p>", "parentCommentId": "kBmYmixWbt8t6ZP7c", "user": null}, {"_id": "zgpCoe7CT4G6zhaYu", "postedAt": "2022-08-30T08:22:55.318Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I don't find this example convincing. I just read the review and found it pretty underwhelming. Take this:</p><blockquote><p>MacAskill’s personal position is to basically to throw up his hands, declare that none of the solutions to the problems with utilitarianism look very good, and we should just compromise between various repugnant theories of how to deal with populations, hoping that whatever compromise we take isn’t that bad.</p></blockquote><p>The paragraph is reacting to the following passage in WWOTF:</p><blockquote><p>There is still deep disagreement within philosophy about what the right view of population ethics is. . . Indeed, I don’t think that there’s any view in population ethics that anyone should be extremely confident in.</p><p>If you want to reject the Repugnant Conclusion, therefore, then you’ve got to reject one of the premises that this argument was based on. But each of these premises seem incontrovertible. We are left with a paradox. One option is to simply accept the Repugnant Conclusion. . . This is the view that I incline towards. Many other philosophers believe that we should reject one of the other premises instead.</p><p>Like all views in population ethics, the critical level view has some very unappealing downsides.</p><p>There is still deep disagreement about what the right view of population ethics is. . . Indeed, I don’t think that there’s any view in population ethics that anyone should be extremely confident in.</p></blockquote><p>But MacAskill is here describing problems with rival views in <i>population ethics</i>, not problems with <i>utilitarianism!</i> Because the author (1) conflates the two, (2) mischaracterizes the Repugnant Conclusion (\"worlds where all available land is turned into places worse than the worst slums of Bangladesh\"), and (3) fails to distinguish the Repugnant Conclusion from standard \"repugnant\" implications of utilitarianism that have nothing to do with it, he ends up attributing to longtermism a number of \"ridiculous\" views that do not in fact follow from that position.</p><p><s>Separately, if criticizing WWOTF is considered to be a paradigmatic case of \"heterodoxy\", it seems worth mentioning that </s><a href=\"https://forum.effectivealtruism.org/posts/vZ4kB8gpvkfHLfz8d/critique-of-macaskill-s-is-it-good-to-make-happy-people\"><s>a recent critical review by Magnus Vinding</s></a><s> has been very favorably received (179 karma at the time of writing).</s></p>", "parentCommentId": "Pd78BDKmGNmf4KEMB", "user": {"username": "Pablo_Stafforini"}}, {"_id": "MXbQxwykAztnGczKi", "postedAt": "2022-08-30T12:33:09.925Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>This response completely ignores the main point of my comment.&nbsp;</p><blockquote><p>Separately, if criticizing WWOTF is considered to be a paradigmatic case of \"heterodoxy\", it seems worth mentioning that <a href=\"https://forum.effectivealtruism.org/posts/vZ4kB8gpvkfHLfz8d/critique-of-macaskill-s-is-it-good-to-make-happy-people\">a recent critical review by Magnus Vinding</a> has been very favorably received (179 karma at the time of writing).</p></blockquote><p>Please reread my comment because the <strong>whole point </strong>was that A.C.Skraeling said that criticism is <strong>accepted within some boundaries</strong>, or when <strong>expressed in suitable terms</strong>. You essentially just repeated Linch's point except that my whole point was that Linch's point is perfectly compatible with what A.C. Skraeling said.&nbsp;</p><hr><p>&nbsp;Regarding Hoel's review, you seem to have read my point as being that it was particularly good or convincing to EAs, which is incorrect. My point was that it was downvoted to -12, a karma score I associate with trollish posts, despite its content being much better than that, because of the combination of criticizing EA orthodoxy (longtermism, utilitarianism, population ethics etc) and not expressing it in a suitable manner. This makes it a decent example of what A.C.Skraeling said. You are free to disagree of course.&nbsp;</p>", "parentCommentId": "zgpCoe7CT4G6zhaYu", "user": null}, {"_id": "KdJPTXKNJMPPWoBKc", "postedAt": "2022-08-30T13:33:50.556Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>Please reread my comment because the <strong>whole point </strong>was that A.C.Skraeling said that criticism is <strong>accepted within some boundaries</strong>, or when <strong>expressed in suitable terms</strong>.</p></blockquote><p>I did misread some parts of your original comment. I thought you were saying that criticizing WWOTF was itself an example of criticism that is beyond the bounds Skraeling was describing. But I now see that you were not saying this. My apologies. (I have crossed out the part of my comment that is affected by this misreading.)</p><blockquote><p>Regarding Hoel's review, you seem to have read my point as being that it was particularly good or convincing to EAs, which is incorrect.</p></blockquote><p>That is not how I read your point. I interpreted you as saying that the quality of the book &nbsp;review justified higher karma than it received (which is confirmed by your reply). My comment was meant to argue against this point, by highlighting some serious blunders and sloppy reasoning by the author that probably justify the low rating. (-12 karma is appropriate for a post of very low quality, in my opinion, and not just a trollish post.)</p>", "parentCommentId": "MXbQxwykAztnGczKi", "user": {"username": "Pablo_Stafforini"}}, {"_id": "fEzGEq9gLLXjZSKva", "postedAt": "2022-08-30T14:39:26.564Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Action on climate change is in its infancy and forecasts cannot be relied as they cannot include unforeseen events. &nbsp;Given human nature ie people do what is the least inconvenient to them (ie act in their own self interest) rather than what is morally right, I'm expecting a backlash to CO2 reducing policies which I doubt the IPCC forecasts include. Will the majority of people pay for new green infrastructure and a more expensive hydrogen economy? &nbsp;People are already up in arms about the current energy cost rises. Will Governments stand up to the majority who want cheap energy and convenience, as they have had for the past few decades?&nbsp;</p><p>The only hope to counter this self interested behaviour that I can see, is to portray the fossil fuel industries as being as bad as the slave trade of the 19th 18th centuries. Both are/ were &nbsp;cheap sources of energy but both have or will cause great harm to humanity. (Predictions of 4 Billion people living in a tropical hot house by 2050 was reported in New Scientist a few weeks ago).</p><p>See \"What else is there to say about climate change?\" on trevorprew.blogspot.com &nbsp;&nbsp;</p><p>As for AI, can't you just pull the plug out if it starts running amuck!</p>", "parentCommentId": null, "user": {"username": "Trev Prew"}}, {"_id": "DKixXzEhMTdinF57h", "postedAt": "2022-08-30T17:10:23.513Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>Thus, all criticism must be stated in the most faux-friendly, milquetoast way possible, imposing significant effort demands on the critic and allowing them to be disregarded if they ever slip up and actually straightforwardly say that a bad thing is bad.</p></blockquote><p>I'm speaking for the moderation team right now. We <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\"><u>enforce civility on the Forum</u></a> and don't view this property as opposed to criticism or disagreement.</p>", "parentCommentId": "EAdoFZBtbGroHHQKY", "user": {"username": "Lizka"}}, {"_id": "hKraqfoiNjAhPXwod", "postedAt": "2022-08-30T17:12:06.917Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>However, I doubt this would go anywhere. I suspect this is simply yet another way of ignoring people who disagree with you without thinking too hard, and relying on the combination of your name-recognition and the average EA's ignorance of climate change to buy you the 'Seems like he knows what he's talking about!'-ness you want</p></blockquote><p>The moderation team feels that this is unnecessarily hostile and rude, and violates <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\"><u>Forum norms</u></a>. This is a warning; please do better in the future.</p>", "parentCommentId": "mXiZQJRiwqv4aNSNp", "user": {"username": "Lizka"}}, {"_id": "LFwArgnpmTmTFGsJb", "postedAt": "2022-08-30T19:11:19.832Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Accusing anonymous or pseudonymous Forum accounts of being someone in particular (or doxing anyone) goes <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Rules_for_pseudonymous_and_multiple_accounts\">against Forum norms.</a> We have reached out to John Halstead to ask that he refrain from doing so and that he refrain from commenting more on these threads.</p>", "parentCommentId": "ZfZgXaKSFkYR3YpYC", "user": {"username": "Lizka"}}, {"_id": "tsuHF67KCECuWvzEa", "postedAt": "2022-08-30T21:41:09.286Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thanks for the retraction.&nbsp;</p><p>Regarding the Hoel piece, the fact that you highlighted the section you did and the way you analyzed it suggests to me you didn't understand what his position was, and didn't try particularly hard to do so. I don't think you can truly judge whether his content is very low quality if you don't understand it. Personally, I think he made some interesting points really engaging with some cores of EA, even if I disagree with much of what he said. I completely disagree that his content, separate from its language and tone towards EAs, is anywhere near very low quality, certainly nowhere near -12. If you want to understand his views better, I found his comments replying to <a href=\"https://forum.effectivealtruism.org/posts/PZ6pEaNkzAg62ze69\">his piece</a> on why he's not an EA illuminating, such as <a href=\"https://forum.effectivealtruism.org/posts/PZ6pEaNkzAg62ze69/?commentId=LxZixkyvfoAxBeKhL\">his response</a> to my attempted summary of his position.&nbsp;But we can agree to disagree.&nbsp;</p><p>Edit note: I significantly edited the part of this comment talking about Hoel's piece within a few hours of posting with the aim of greater clarity.&nbsp;</p>", "parentCommentId": "KdJPTXKNJMPPWoBKc", "user": null}, {"_id": "5SQtyazFp8LJ8eJz3", "postedAt": "2022-08-31T00:06:05.221Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I'm looking at your profile, you have almost nothing but downvotes, but I haven't seen you say anything dumb--just sassy. FWIW, I really like this comment.</p>", "parentCommentId": "QRapr3prhqjCDxtRK", "user": {"username": "Emrik"}}, {"_id": "Ta742oQoFfJQSmZfe", "postedAt": "2022-08-31T19:03:14.086Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>\"<strong>AI</strong>: Forecasters on the community forecasting platform Metaculus think that artificial intelligent systems that are better than humans at all relevant tasks <a href=\"https://www.metaculus.com/questions/5121/date-of-artificial-general-intelligence/\"><u>will be created in 2042</u></a>.\"<br><br>How do you get this from the questions' operationalization?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Flodorner"}}, {"_id": "KdGthq6Coqri4Drar", "postedAt": "2022-08-31T21:01:17.265Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hello, since animal agriculture is one of the leading causes of climate change, I thought to emphasize that here and to let you know that if you would like to join our efforts to end animal agriculture world-wide by first changing laws in California state towards ending animal agriculture, please feel free to message me at +1 (650) 863-1550. I’m a volunteer with Compassionate Bay and Direct Action Everywhere (DxE). We need more supporters to change social norms and to pass laws towards ending animal agriculture world-wide.</p>\n", "parentCommentId": null, "user": {"username": "RasaPetrauskaite"}}, {"_id": "uxhwP7apqRjDqaCon", "postedAt": "2022-08-31T23:32:37.682Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>Is there much/any concern here that global warming could increase the risk of a far more deadly pandemic stemming from natural sources?&nbsp;<br><br>Where I am located, as the coolest months warm known viruses in animals are occurring in these cooler months for the first time. Anecdotally, on top of becoming more frequent they also appear to be increasing in severity.&nbsp;</p><p>Further, could this increased pandemic risk due to global warming (if true) &nbsp;help bring attention and resources to biosecurity in general which could also help prevent engineered viruses?<br><br>\"Climate change will result in thousands of new viruses spread among animal species by 2070 — and that’s likely to increase the risk of emerging infectious diseases jumping from animals to humans, according to a new study.\"<br><a href=\"https://www.pbs.org/newshour/science/climate-change-will-result-in-new-viruses-and-risk-of-new-diseases-says-study\">Source</a></p></blockquote>", "parentCommentId": null, "user": {"username": "Brendon"}}, {"_id": "vuHJpkDqeEjgKM3X3", "postedAt": "2022-09-01T07:23:07.462Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>That's good to know, but I wonder how much change you personally can make. It'll be significant, for sure, but I think a lot of this is cultural: a sort of EA-accelerated chunk of the class-coded aspects of the Hidden Curriculum.</p>", "parentCommentId": "DKixXzEhMTdinF57h", "user": {"username": "A.C.Skraeling"}}, {"_id": "6RojCN7aJP9SyBdoK", "postedAt": "2022-09-01T07:32:16.054Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>How would you prefer people to react when someone acts in bad faith?</p><p>What aspects of this comment fall outside those bounds?</p>", "parentCommentId": "hKraqfoiNjAhPXwod", "user": {"username": "A.C.Skraeling"}}, {"_id": "sK4aQapq7kBT6HR6J", "postedAt": "2022-09-01T13:06:43.216Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I thought that was what was meant by AGI? I agree that the operationalisation doesn't state that explicitly, but I thought it was implied. Do you think I should change in the report?</p>", "parentCommentId": "Ta742oQoFfJQSmZfe", "user": null}, {"_id": "sfoz4BQt48H3S4dSD", "postedAt": "2022-09-01T14:03:30.396Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I think this strongly depends on how much weight you expect forcasters on metaculus to put onto the actual operationalization rather than the question's \"vibe\". I personally expect quite a bit of weight on the exact operationalization, so I am generally not very happy with how people have been talking about this specific forecast (the term \"AGI\" often seems to invoke associations that are not backed by the forecast's operationalization), and would prefer a more nuanced statement in the report.<br><br>&nbsp;(Note, that you might believe that the gap between the resolution criteria of the question and more colloqiual interpretations of \"AGI\" is very small, but this would seem to require an additional argument on top of the metaculus forecast).&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "sK4aQapq7kBT6HR6J", "user": {"username": "Flodorner"}}, {"_id": "YSGKtHm7TtJoegcaS", "postedAt": "2022-09-01T20:07:53.936Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>\"it is well-known that the IPCC must moderate its conclusions and focus on better-case scenarios for political reasons, i.e. so as to not be written off as alarmist\"<br><br>As a climate scientist reading this, I just thought I'd pick up on that and say I have not got that impression from reading the reports or conversations with my colleagues who are IPCC authors. I've not seen any strong evidence presented that the IPCC systematically understates risks - there are a couple of examples where risks were perhaps not discussed (not clearly underestimated as far as I've seen), but I can also think of at least one example where it looked to me like IPCC authors put too much weight on predictions of large changes (sea ice in AR5). (This is distinct from the thought that the IPCC doesn't do enough to discuss low-likelihood, high-impact possibilities, which I agree with.)</p>", "parentCommentId": "nAQH5dA5gb2DYrfgk", "user": {"username": "Pagw"}}, {"_id": "4mGZLpJtuH9Za8EY2", "postedAt": "2022-09-01T20:53:35.631Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>\"I don't want to put words in their mouths, but Peter overall seemed very positive\"<br><br>As Peter, just in case this should come back to bite me if misinterpreted, I just thought I'd say I could give an informed review of certain physical climate science aspects and the report seems to capture those well. I am positive about the rest as being an interesting and in depth piece of scholarship into interesting questions, but I can't vouch for it as an expert :-)</p>", "parentCommentId": "qhEszfQochd4dgAgL", "user": {"username": "Pagw"}}, {"_id": "XJQZTpx43sedFyddW", "postedAt": "2022-09-03T01:02:35.252Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thanks for mentioning ALLFED. We do tend to focus on nuclear winter, including with NASA tech like <a href=\"https://allfed.info/images/pdfs/preprint.pdf\">hydrogen single cell protein</a>. However, a lot of the foods we research are relevant to climate catastrophes such as multiple breadbasket failure, including <a href=\"https://80000hours.org/podcast/episodes/david-denkenberger-sahil-shah-using-paper-mills-and-seaweed-in-catastrophes/\">seaweed</a>.</p>", "parentCommentId": "kckkmPSqyAqLDTxqQ", "user": {"username": "Denkenberger"}}, {"_id": "R7aoaWkhQFRzJ54mm", "postedAt": "2022-09-03T09:36:25.260Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Yes, the protein production technology is certainly relevant. I don't think the seaweed is unless you are confident that it would survive various changes in ocean temperature, acidity, pollutant levels, flora, and fauna that progress with climate change. What do your models say?</p>", "parentCommentId": "XJQZTpx43sedFyddW", "user": {"username": "Noah Scales"}}, {"_id": "spkCw2oyQ3wPWqrTj", "postedAt": "2022-09-03T15:56:53.613Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Would you suggest the depth of your feedback was the depth of peer review? And I'm correct in saying therefore that you didn't really review the overall methodology used etc?</p>\n", "parentCommentId": "4mGZLpJtuH9Za8EY2", "user": {"username": "Gideon Futerman"}}, {"_id": "vPEMDohJaarqyh4xH", "postedAt": "2022-09-03T18:01:16.077Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>We have not modeled seaweed growth in a warming world, but I believe others have. I expect that species would need to move to higher latitudes, as <a href=\"https://allfed.info/images/pdfs/EAGLDN19SeaweedPoster.pdf\">they would need to move to lower latitudes in the case of nuclear winter</a>.</p>", "parentCommentId": "R7aoaWkhQFRzJ54mm", "user": {"username": "Denkenberger"}}, {"_id": "S9fK2dCfAtyLKmsim", "postedAt": "2022-09-03T19:15:02.924Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>What geographic range would growth of the seaweed serve depending on what forms of food transport? Is the use of seaweed as a food source likely restricted to the coasts and coastal populations?</p>", "parentCommentId": "vPEMDohJaarqyh4xH", "user": {"username": "Noah Scales"}}, {"_id": "cmk3J8kt5EpoegyzJ", "postedAt": "2022-09-03T19:37:49.127Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Seaweed can be dried and transported long distances. It can also be used for reducing climate change, including sequestering CO2 and reducing methane emissions of cattle.</p>", "parentCommentId": "S9fK2dCfAtyLKmsim", "user": {"username": "Denkenberger"}}, {"_id": "Zcha7hbimGQZvkybN", "postedAt": "2022-09-04T13:12:00.510Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I'd say the depth of review was similar to peer review yes, though it is true to say that publication was not conditional on the peer reviewers okaying what I had written. As mentioned, the methodology was reviewed, yes. So, this is my view, having taken on significant expert input.&nbsp;</p><p>A natural question is whether my report should be given less weight eg than a peer reviewed paper in a prominent journal. I think as a rule, a good approach is to try start by getting a sense of what the weight of the literature says, and then exploring the substantive arguments made. For the usual reasons, we should expect any randomly selected paper to be false. Papers that make claims far outside the consensus position that get published in prominent journals are especially likely to be false. There is also scope for certain groups of scientists to review one another's papers such that bad literatures can snowball.&nbsp;</p><p>This isn't to say that any random person writing about climate change will be better than a random peer reviewed paper. But I think there are reasons to put more weight on the views of someone who has good epistemics (not saying this is true of me, but one might think it is true of some EA researchers) and also be actually talking about the thing we are interested in - i.e. the longtermist import of climate change. Most papers just aren't focusing on that, but will use similar terminology. e.g. there is a paper by Xu and Ramanathan which says that climate change is an existential risk but uses that term in a completely different way to EAs.&nbsp;</p><p>I will give some examples of the flaws of the traditional peer review process as applied to some papers on the catastrophic side of things.&nbsp;</p><ol><li>A paper that is often brought up in climate catastrophe discussions is Steffen et al (2018) - the 'Hothouse Earth' paper. That paper has now been cited more than 2,000 times. For reasons I discuss in the report, I think it is both surprising that the paper was &nbsp;published. The IPCC also disagrees with it.</li></ol><p>2. The Kemp et al 2022 PNAS paper (also written by many planetary boundaries people) was peer reviewed, but also contains several &nbsp;errors.</p><p>For instance, it says \"Yet, there remain reasons for caution. For instance, there is significant uncertainty over key variables such as energy demand and economic growth. Plausibly higher economic growth rates could make RCP8.5 35% more likely (27).\"&nbsp;</p><p>The cite here in note (27) is to <a href=\"https://www.pnas.org/doi/epdf/10.1073/pnas.1713628115\">Christensen et al (2018)</a>, which actually says \"Our results indicate that there is a greater than 35% probability that emissions concentrations will exceed those assumed in RCP8.5.\" i.e. their finding is about the percentage point chance of RCP8.5, not about an increase in the relative risk of RCP8.5.&nbsp;</p><p>Another example: \"While an ECS below 1.5 °C was essentially ruled out, there remains an 18% probability that ECS could be greater than 4.5 °C (14).\"&nbsp;</p><p>The cite here is to the entire WG1 IPCC report (not that useful for checking but that aside...) The latest IPCC report says \"a best estimate of equilibrium climate sensitivity of 3°C, with a very likely range of 2°C to 5°C. The likely range [is] 2.5°C to 4°C\" The IPCC says \"Throughout the WGI report and unless stated otherwise, uncertainty is quantified using 90% uncertainty intervals. The 90% uncertainty interval, reported in square brackets [x to y], is estimated to have a 90% likelihood of covering the value that is being estimated. The range encompasses the median value, and there is an estimated 10% combined likelihood of the value being below the lower end of the range (x) and above its upper end (y). Often, the distribution will be considered symmetric about the corresponding best estimate, but this is not always the case. In this Report, an assessed 90% uncertainty interval is referred to as a ‘very likely range’. Similarly, an assessed 66% uncertainty interval is referred to as a ‘likely range’.</p><p>So, the 66% CI is 2.5ºC to 4ºC and the 90% CI is 2ºC-5ºC. If this is symmetric, then this means there is a 17% chance of &gt;4ºC, and a 5% chance of &gt;5ºC. It's unclear whether the distribution is symmetric or not - the IPCC does not say - but if it is then the '18% chance of &gt;4.5ºC' claim in climate endgame is wrong. So, a key claim in that paper &nbsp;- about the main variable of interest in climate science - cannot be inferred from the given reference.&nbsp;</p><p>3. Jehn et al have published <a href=\"https://forum.effectivealtruism.org/posts/TxBdCp3pmDb9mySCr/focus-of-the-ipcc-assessment-reports-has-shifted-to-lower\">two</a> <a href=\"https://forum.effectivealtruism.org/posts/HaXxEtx4QdykBjJi7/betting-on-the-best-case-higher-end-warming-is\">papers</a> cited in Kemp et al (2022), one of which says that \"More likely higher end warming scenarios of 3 °C and above, despite potential catastrophic impacts, are severely neglected.\" This is just not true, but nevertheless made it through peer review. Almost every single climate impact study reports the impact of 4.4ºC. There is barely a single chart in the entire IPCC impacts report that does not report that. We can perhaps quibble over what 'severely neglected' means, but it &nbsp;doesn't mean 'shown in every single chart in the IPCC climate impacts book'. &nbsp;It is surprising that this got through peer review.&nbsp;</p><p>**</p><p>As I have said, these are just single studies. I am consistently impressed by how good the IPCC is at reporting the median view in the literature, given how politicised the whole process must be.&nbsp;</p><p>**</p><p>I also do not think there is any tendency to downplay risks in the climate science literature. If you look at studies on publication bias in climate science, they <a href=\"https://www.pnas.org/doi/epdf/10.1073/pnas.1713628115\">find</a> that effect sizes in abstracts in climate change papers have a tendency to be significantly inflated relative to the main text. This is especially pronounced in high impact journals. I have also found this from personal experience. Overall, I think in some cases the risks are overstated, in some they are understated, but there is no systematic pattern.&nbsp;</p><p>Probably the best way to examine whether my substantive conclusions are wrong would be to raise some substantive criticisms/carry out a redteam - I would welcome this. I emphasise that if my arguments are correct, then the scale of biorisk is numerous orders of magnitude larger than climate change.&nbsp;</p>", "parentCommentId": "spkCw2oyQ3wPWqrTj", "user": null}, {"_id": "bkZCYnkQk9czGEv8m", "postedAt": "2022-09-05T05:52:51.011Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p><i>Writing this as a moderator, but only expressing my own view.</i></p><p>Accusing someone of acting in bad faith on a public forum can be very damaging to the person, and it's very easy to be mistaken about such a characterization. Even if the person is acting in bad faith, it might escalate things and make it hard to deal with the underlying problem well.&nbsp;</p><p>Instead, it would be better to go through the moderation and community health channels, which you can do by flagging comments/posts or by contacting us directly.</p>", "parentCommentId": "6RojCN7aJP9SyBdoK", "user": {"username": "edoarad"}}, {"_id": "zumnwPx6riQzhEJZN", "postedAt": "2022-09-05T16:35:19.951Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<blockquote><p>refrain from commenting more on these threads</p></blockquote><p>My comment above was vague. Just a note to clarify: by “on these threads” we meant threads involving A.C.Skraeling. In our message to John Halstead, we wrote: “refrain from commenting on the existing threads with A.C.Skraeling.”</p>", "parentCommentId": "LFwArgnpmTmTFGsJb", "user": {"username": "Lizka"}}, {"_id": "agEBEcu9C7RFdCfkg", "postedAt": "2022-09-07T22:39:56.218Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Can it be grown in tanks? I think fallout from a nuclear war would contaminate all open areas used for agriculture, including the oceans, for example, from fallout on winds, dust, rain (if there is any?), or water contamination carried on ocean currents. Do your models suggest that agriculture and aquaculture and use of open areas is a strong contamination risk or no?</p><p>In the case of climate change, the major shifts are in pH, local heat, currents, and ecology. I suspect strong climate change will require tank growth of seaweed, if any. There are global models of ocean pH change. I think pH is <a href=\"https://www.asoc.org/learn/ocean-acidification/\">lower at the poles</a> while <a href=\"https://www.pnas.org/doi/10.1073/pnas.1910114117\">absolute water temps near the coasts will be higher at the equator</a>.</p><p>There was an algae-based oil called <a href=\"https://www.foodnavigator-usa.com/Article/2020/08/10/Corbion-discontinues-Thrive-algae-oil-We-were-not-able-to-achieve-the-commercial-success-needed-to-sustain-the-brand\">Thrive</a>, totally monounsaturated, if I remember right, that until recently was commercially available. I used it several times and liked it as a salad oil.</p>", "parentCommentId": "cmk3J8kt5EpoegyzJ", "user": {"username": "Noah Scales"}}, {"_id": "YZ55jFJr2rtKQjwAu", "postedAt": "2022-09-07T23:49:44.398Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Seaweed can be grown in tanks, and so can microalgae. But from what I've seen, the cost is significantly higher in tanks. Radioactive contamination is a concern, especially in target countries. But it is likely not the most important concern, as Hiroshima was continuously inhabited. Radioactive contamination would be diluted in the oceans, so I think seaweed would be better than land crops in this regard.</p>", "parentCommentId": "agEBEcu9C7RFdCfkg", "user": {"username": "Denkenberger"}}, {"_id": "oCEq68sLq2CNjuGJ8", "postedAt": "2022-09-08T06:25:58.163Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi, Dr. Denkenberger</p><p>Thanks! I appreciate your thoughts. I have a few more questions:</p><p>1. If you can find the research about seaweed growth in lower-pH conditions with heat waves in nearshore waters, and changes in nutrient availability (probably declines), I want to know more. I think seaweed might be a good near-term choice of replacement agriculture in the next 10-20 years, but during that time, it makes sense that the world scale up the kinds of food sources that you and ALLFED explore.</p><p>2. I like dextrose monohydrate, as a food product, it's widely available and dissolves clean in water. With flavoring and in combination with whey (and of course casein, but I really favor whey), it makes a replacement milk. I understand that anhydrous dextrose has different properties in foods. What form of dextrose would paper mills produce? Are you more thinking something with less sweetness, like maltodextrin (also a possibility in a milk substitute)? Could the mills produce different types of carbs?</p><p>3. Assuming a 2400 kcal diet, what are your targets for macronutrients? Given a source of concentrated carbohydrates, people need a protein source, a fat source, and additional sources of minerals and vitamins and other compounds. I &nbsp;lik carbs (510g-450g), proteins (40g-100g), and an EFA source (1g-10g), but that's just me. Adding in fats, you need to choose a carb minimum, as I think the trade-off would be carbs for fats, not proteins for fats.&nbsp;<br>There's a variety of reasons to choose different kcalorie totals and macronutrient balances, do you have a list of your criteria and final decisions or have you looked into that in detail?</p><p>4. Have you looked into the manufacture of:<br>* individual essential amino acids?<br>* essential fatty acids?<br>* vitamin and mineral supplements?</p><p>5. Based on UN studies, there's a lower limit on protein consumption that maintains protein balance in a person<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdd8yl9e0fiq\"><sup><a href=\"#fndd8yl9e0fiq\">[1]</a></sup></span>. Has ALLFED chosen a minimum daily human EAA requirements, per kg bodyweight, and something similar for children?&nbsp;</p><p>6. With the dried seaweed you mentioned, how do you prepare it, or what sort of food products can you prepare with it? With dextrose, the easiest choices are sweet treats. What do you do with the seaweed?</p><p>7. I suspect that in a time of crisis like a multi-breadbasket failure, both refrigeration and heating (cooking) are lacking resources for transport and storage. Therefore, ability to store food for long periods without spoiling is important. Dried foods or powders work the best there<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefglgv0nnhrba\"><sup><a href=\"#fnglgv0nnhrba\">[2]</a></sup></span>. If it were me, I'd choose carb+ protein powders and vacuum-sealed EFA plus vitamin/mineral supplementation powder. How does your modeling and knowledge differ from my conclusions?</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndd8yl9e0fiq\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdd8yl9e0fiq\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Given different food sources of proteins, and differences in absorption from those sources, as well as balance of aminos present in those foods, people require more or less food to meet their EAA requirements. This is actually an important argument against the use of natural food vegan protein sources available globally, because although total protein requirements are easily met by local food sources, EAA requirements are much to meet without the addition of milk or meat, unless you rely on soy. I don't object to soy in the diet, but in terms of environmental footprint required to meet human EAA requirements, vegan diets might be a concern if they don't include soy. Of course you know that individual EAAs cannot be substituted for each other.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnglgv0nnhrba\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefglgv0nnhrba\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;I think supplementation of manufactured foods with aminos would serve for countries with less access to milk or meat. So EAA's to bring foods into balance with ideal EAA profiles, and individual amino acids like glutamine that have higher metabolic demand. Ajinomoto corporation does use aminos as a food additive and animal feed suppliers do this with animal feed but most amino acids taste terrible, except for lysine, glutamine, and maybe a few others. Some people like glycine but I do not like the taste.</p></div></li></ol>", "parentCommentId": "YZ55jFJr2rtKQjwAu", "user": {"username": "Noah Scales"}}, {"_id": "HYYBr6bkXoBqjp5vs", "postedAt": "2022-09-08T16:01:03.859Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi!</p><p>I have different understanding of moisture greenhouse based on what I've read. You said (oversimplifing) that the <i>threshold</i> for moisture greenhouse is 67C &nbsp;and the main risk &nbsp;from it is ocean evaporation.</p><p>But in my understanding 67 C is the <i>level</i> of moisture greenhouse climate. The climate according to some models will be stable on this level. &nbsp;67 C mean temperature seems to almost lethal to humans but some people could survive on high mountains.&nbsp;</p><p>However, the threshold to moisture greenhouse, that is the tipping point after which the transition to the next meta-stable condition is inevitable, could be much less than at 67C and could be after just 10 C warming - you discussed this and different authors who wrote about that, but it contradicts the word \"threshold\" you used about &nbsp;moisture greenhouse.&nbsp;</p><p>Transition to next meta-stable climate takes according to the article about water worlds like 4-40 years.</p><p>As a result the whole catastrophic scenario of moisture greenhouse moved away from now, but it could happen in next 100 years and Ord's estimation is justified.&nbsp;</p>", "parentCommentId": null, "user": {"username": "turchin"}}, {"_id": "zzax4yChWBmPaa86d", "postedAt": "2022-09-09T07:48:17.951Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Peer review is very variable so it's hard to say what \"the depth of peer review\" is. I checked the bits I was asked to check in a similar way as I would a journal article. No I didn't myself really review the methodology. The process was also quite different from normal review in involving quite a few back-and-forth discussions - I felt more like I was helping make the work better rather than simply commenting on its quality. It also differed in that the decision about \"publishing\" was taken by John rather than a separate editor (as far as I know).&nbsp;</p>", "parentCommentId": "spkCw2oyQ3wPWqrTj", "user": {"username": "Pagw"}}, {"_id": "CP4stvjyA8Ckq7v3X", "postedAt": "2022-09-09T08:49:13.953Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thanks for this. Someone else raised some issues with the moist greenhouse bit, and I need to revise. I still think the Ord estimate is too high, but I think the discussion in the report could be crisper. I'll revert back once I've made changes</p>", "parentCommentId": "HYYBr6bkXoBqjp5vs", "user": null}, {"_id": "bZatqZruRcTeCRrcw", "postedAt": "2022-09-09T08:53:58.103Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I would say that for all of the 'non-EA' reviewers, the review was very extensive, and this was also true of some of the EA reviewers (because they were more pushed for time). The non-EA expert reviewers were also compensated for their review in order to incentivise them to review in depth.&nbsp;</p><p>It is true that I ultimately decided whether or not to publish, so this makes it different to peer review. Someone mentioned to me that some people mean by 'peer review' that the reviewers have to agree for publication to be ok, but this wasn't the case for this report. Though it was reviewed &nbsp;experts, ultimately I decided whether or not to publish in its final state.&nbsp;</p>", "parentCommentId": "zzax4yChWBmPaa86d", "user": null}, {"_id": "gTeJv2Fe6xtcCoydc", "postedAt": "2022-09-09T13:32:52.285Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi John,</p><p>Thanks for this openness, its really appreciated. Any update as to whether the reviewers are happy for their comments to be share?</p><p>Best</p><p>Gideon</p>", "parentCommentId": "bZatqZruRcTeCRrcw", "user": {"username": "Gideon Futerman"}}, {"_id": "YkPpJ28nWHtYQee5i", "postedAt": "2022-09-09T14:09:55.968Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi John,</p><p>So sorry for the lateness of this reply, I have been super busy, and this reply will also only be short as I ma very busy. It would be good to organise a meeting to chat about this at some point if your interested.</p><p>On cascading risks, I tink a good recent discussion of cascading risk is found in <a href=\"https://www.nature.com/articles/s41467-021-25021-8\">https://www.nature.com/articles/s41467-021-25021-8</a> . &nbsp;A plausible causal story for how climate change leads to a cascade may be as follows. This is obviously flawed and incomplete and clearly needs more study:</p><ul><li>To respond to growing threats from climate change, adaptation measures (often technological) will be put in place. However, these adaptation measures, such as physical defences, are often very fragile. Whilst it is possible agricultural production increases, this would also likely be due to adaptation measures, with new things introduced likely to be less resilient due to lack of experience. Moreover, as certain regions get agriculture more badly hit, it is possible you see a few increasing agricultural hubs as those places less effected by climate change/could adapt quicker. This further increases vulnerability</li><li>One or a number of critical nodes in this system are hit by a hazard, either one made more likely by climate change, or by another hazard. Sychrnonous failure causes diversion of resources to these areas, and the economic shock makes it harder to sustain adaptation infrastructure, which may then start to fail</li><li>Climate impacts cause increased civil unrest. This causes greater economic and political insecurity, making greater diversion of resources away from climate adaptation and towards combating the symptomns of this. The resources exerted can't match with the pressures on them, both environmental, climatic, social, political, economic. A &nbsp;near complete collapse of a mid-sized economy ensues, with global reprucussions</li><li>Meanwhile, climate change has made an engineered pandemic more likely by increasing the number of omnicidal actors. One of these engineered pandemics occur killing 1% of the worlds population, sychronous with a major drought, causing global economic collapse. In response to the drought, a water war between mid-sized powers ensues, leading to the involvement of major powers. Sanctions and embargoes between the powers lead to further economic damage. This is combined by significant food shortages from the &nbsp;drought, and socio-economic damage from the pandemic.</li><li>Political tensions rise in &nbsp;India, leading to mass protests. &nbsp;The failure of the Indian government to relieve a Muslim majority region of the famine causes tensions, a police massacre causes this to go into outright rebellion. The Indian government collapses, with major global economic consequences.</li><li>Climate impacts continue to scale across the world, with the economic damage from the famine, pandemic and collapse of the Indian government spreading. In the subsequent economic collapse, a major economy defaults on its debts, leading to further ewconomic turmoil. Civil unrest breaks out in another major economy (say Germany), once again causing economic collapse. The new Indian government, crippled and weakened and still under pressure from the civil war, promises to defend its water resources at all costs, however China, also suffering from a drought, cuts off the source of Brahmaputra. A tactical nuclear weapon is set off. Whilst this doesn't lead to global nuclear war, in the aftermath of this, markets collapse</li><li>With a collapsing global economy and mounting climate damages, adaptation measures cannot be meaningfully carried out, as maintences can't be afforded. This causes more and more damage.</li></ul><p>This is the example of a cascade. I didn't take it all the way to collapse/ extinction, but I think you could probably carry it on yourself. This is just A scenario I just came up with. Its probably not the most plausible. But there are thousands of such scenarios, each which climate change is a key factor in causing, interacting in different ways. this is what I mean by cascade.</p><p>&nbsp;</p><p>On the seperate point of your indirect vs direct framing, it seems like my issues with it are two fold. I tend to think indirect risk is just so much larger a subset of things than direct risk (involves many of the causes of hazards, as well as I assume all exposures and vulnerabilities?), and yet I don't think your treatment of it gives it this necessary depth. So maybe in theory your framework is well defined, but in practice the category of indirect risk is like \"the rest\" and so doesn't seem to give a useful structure for defining what these key impacts are. &nbsp;I think, even if unintentional, the rhetoric of employing such a device privelages direct risks hugely, which I tend to think leads nearly inevitably to your conclusion due to this privelaging.</p><p>When you say you expected other criticisms, I can understand why you may be frustrated with my focus on the meta-issues. But I broadly don't have much of a problem with what you say, and certainly don't on any areas outside my area of expertise. Its what you don't say, and the methodology you have used that lets you get there, that worries me. Thats why I have focused on these meta-issues, because in terms of where I think this piece goes substantially wrong, I think its that.&nbsp;</p><p>As I have said previously, I think what you miss out is important as you are in a really unique place in the community by no fault of your own. There are probably few people deferred to in EA more than you are, &nbsp;so the worry if you miss things out, or if your methodology is wrong (and as I am sure you will admit no one is perfect) is this will get propograted as orthodoxy through the community. I know you tend to not think of yourself as this sort of person, and I don't think these epistemically deeply unhealthy dynamics are your fault.&nbsp;</p><p>Anyway, sorry I couldn't do a more substantive reply, I am super busy, and it certainly doesn't seem like forum comments are the most constructive to this discussion. Would you like to have a chat about this at some point so we can really hear each others persepctives?</p>", "parentCommentId": "mELnDLZGKfAb3aMCn", "user": {"username": "Gideon Futerman"}}, {"_id": "8SvkGhpwyhK42C2du", "postedAt": "2022-09-09T18:21:13.776Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>About planetary boundaries:</p><p>Leaving aside the discussions on the specific value and/or variable used to measure a specific boundary -which the authors themselves caveat that may be temporal until finding better ones-, isn't most of the controversy due to critiques conflating planetary boundaries and tipping points?</p>", "parentCommentId": "QwZaZrkwAfCjAexyK", "user": {"username": "mikbp"}}, {"_id": "2Z8TMXMc9wB8vkL94", "postedAt": "2022-09-10T16:51:02.625Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>I am going to have a post about the risks of runaway global warming soon.</p>", "parentCommentId": "CP4stvjyA8Ckq7v3X", "user": {"username": "turchin"}}, {"_id": "BLuTYgg6mrPn6JGoG", "postedAt": "2022-09-11T19:57:55.743Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>here https://forum.effectivealtruism.org/posts/bdSpaB9xj67FPiewN/a-pin-and-a-balloon-anthropic-fragility-increases-chances-of</p>", "parentCommentId": "CP4stvjyA8Ckq7v3X", "user": {"username": "turchin"}}, {"_id": "Tk7uEzWQoyLXMefsh", "postedAt": "2022-09-16T10:32:39.473Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>That assumes a relatively happy path. If there's some other major one-off catastrophe (eg a major pandemic), the long-term effects of climate change will end up being far harder to deal with.</p>\n", "parentCommentId": "ck94myvGmtbt5NTB5", "user": {"username": "Arepo"}}, {"_id": "aznAwFZtfb4Jq47SH", "postedAt": "2022-09-18T19:28:05.832Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi, John.</p><p>In your research report, you wrote:</p><blockquote><p>About 1 trillion tonnes of carbon is stored in permafrost.325</p></blockquote><p>and you include the footnote:</p><blockquote><p>325<br>“The new northern permafrost zone carbon inventory reports the surface permafrost carbon pool (0–3 m) to be 1,035 ±150 Pg carbon (mean ±95% confidence interval, CI).” E. a. G. Schuur et al.,‘Climate Change and the Permafrost Carbon Feedback’, Nature 520, no. 7546 (April 2015): 171–79,https://doi.org/10.1038/nature14338.</p></blockquote><p>In <a href=\"https://www.researchgate.net/publication/274698738_Climate_change_and_the_permafrost_carbon_feedback\">the Nature paper you cited</a> for a listing of permafrost carbon, you find the following quote on the same page as lists total carbon in the top 3 meters of permafrost. I &nbsp;list the geographic regions in braces for clarity:&nbsp;</p><blockquote><p>Taken together, the known pool of terrestrial permafrost carbon in the northern permafrost zone is 1,330–1,580 Pg carbon, accounting for surface carbon as well as deep carbon in the yedoma region [in Siberia and Alaska] and [Arctic] river deltas, with the potential for 400 Pg carbon in other deep terrestrial permafrost sediments that, along with an additional quantity of subsea permafrost carbon, still remains largely unquantified.</p></blockquote><p>So a total amount of carbon in permafrost between 1730-1980 Pg, or 1.73-1.98 trillion tonnes of carbon, not the 1 trillion tonnes you list. This is typically described as being twice the carbon currently in the atmosphere, but how quickly it causes heating given some rate of thaw depends on whether it is released as methane or carbon dioxide. As you know, methane has 100X the heating potential of carbon dioxide, but that drops off rapidly over a couple decades, so rate of release is very important.</p><p>If you look elsewhere for amounts, you find the usual figure listed is 1.5Tt for total carbon in permafrost. I think that represents updates to estimates but have not looked into it in detail. A slight rephrase of your sentence \"About 1 trillion tonnes of carbon is stored in permafrost.\" to either mention the top 3 meters of soil explicitly for the trillion tonnes number or to use some figure closer to 1.5Tt (<a href=\"https://arctic.noaa.gov/Report-Card/Report-Card-2019/ArtMID/7916/ArticleID/844/Permafrost-and-the-Global-Carbon-Cycle\">NOAA's mid-range</a> for total northern permafrost). will bring the announced total closer to what people typically mean by total carbon in permafrost, just the permafrost in the North.<s>&nbsp;</s></p><p>Earlier in the same Nature paper, you read:</p><blockquote><p>Deeper carbon measurements were initially rare, and it was not even possible to quantify the uncertainty for the permafrost carbon pool size estimate. However, important new syntheses continue to report large quantities of deep carbon preserved in permafrost at many previously unsampled locations, and that a substantial fraction of this deep permafrost carbon is susceptible to future thaw15. The permafrost carbon pool is now thought to comprise organic carbon in the top 3 m of surface soil, carbon in deposits deeper than 3 m (including those within the yedoma region, an area of deep sediment deposits that cover unglaciated parts of Siberia and Alaska16–18), as well as carbon within permafrost that formed on land during glacial periods but that is now found on shallow submarine shelves in the Arctic.</p></blockquote><p>For the reference you cite, it's clear that carbon deeper than 3m is considered \"susceptible to future thaw\", and so is relevant to discussions of permafrost contribution to global warming. In fact, some existing examples of that thaw are mentioned in that 2015 paper.</p><p>I think there are numerous taking off points for discussion of the effects of permafrost thaw aside from the box 5.1 sections of the IPCC technical report that you cite.&nbsp;</p><p>The parameters deciding the effects of permafrost include:</p><ul><li>abrupt vs gradual release of carbon</li><li>carbon release as methane (CH4) vs carbon dioxide (CO2)</li><li>geological shaping of ice and organic matter within permafrost</li><li>release of ancient microbes (bacteria, viruses) and &nbsp;others (anthrax, smallpox) in the soil</li><li>subsidence rates (causing effects on current or future infrastructure)</li><li>biophysical rates of change to permafrost (ground fires and microbial action)</li><li>stored chemical release on permafrost lands (sump chemicals, other chemicals)</li></ul><p>if you decide that you want to expand on those in a later version of your research.</p><p>EDIT: I included some light edits to this to make my comment more clear. Also I would love to discuss more of the topics you raise in your research report, including the models suggesting different levels of contribution from carbon release from permafrost.&nbsp;</p><p>I noticed this quote at the end of the box highlight on \"Permafrost Carbon and Feedbacks to Climate\" in Chapter 5 of the IPCC Technical Report that you cite:</p><blockquote><p>In conclusion, thawing terrestrial permafrost will lead to carbon release under a&nbsp;warmer world (high confidence). However, there is low confidence on the timing, magnitude and linearity of the permafrost climate feedback owing to the wide range of published estimates and the incomplete knowledge and representation in models of drivers and relationships.</p></blockquote><p>And this is why considering the highs and lows in a bit of depth is worth doing.</p><blockquote><p>&nbsp;It is projected that CO2 released from permafrost will be 18 (3.1–41) PgC /°C by 2100, with the relative contribution of CO2 vs CH4 remaining poorly constrained. Permafrost carbon feedbacks are included among the under-represented feedbacks quantified in Figure&nbsp;5.29.</p></blockquote><p>Those projections, if we accept them as accurate, do not address nonlinear release of carbon, particularly as Methane. That leaves it to you to summarize expected heating over the short term of an abrupt release of carbon involving significant amounts of CH4. As I wrote, &nbsp;CH4 has 100X the heating potential of CO2 but over the longer term of a century, that drops to 25X.&nbsp;</p><p>Would abrupt release of a large amount of CH4 create a jump in average temperature of 1-2C? What would the impact of that be? How would it amplify other feedbacks and with what consequences for humanity, give that the effect is temporary?</p><p>Your report could address those questions with more interest than it does.&nbsp;</p>", "parentCommentId": "sctdhTLfJtvJyEzHY", "user": {"username": "Noah Scales"}}, {"_id": "hpdzaArdoh5oEGMcv", "postedAt": "2022-10-10T20:57:04.614Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi John,</p><p>I would appreciate your thoughts on the shape of the relationship between existential risk due to climate change and global warming. For example, would it be reasonable to assume it is linear, i.e. that the x-risk linked to an increase of 2 ºC relative to today's temperature is 2 times as large as the x-risk linked to an increase of 1 ºC?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "y32FJMhfBLi7R3tSn", "postedAt": "2023-01-26T23:13:38.262Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Thanks for the comment, it was interesting to have examples.</p><p>By chance, do you have some documentation on cascading risks caused by shortfalls on energy production? Or more data on what would cause the economy to collapse? I'm looking for this since I have made some posts on energy depletion and trying to keep updating.</p><p>&nbsp;</p><p>By the way, I find the lack of answer by John rather worrying, especially as this seems to be a crucial point you're making, especially in our interconnected world. Did you manage to chat with him?</p>", "parentCommentId": "YkPpJ28nWHtYQee5i", "user": {"username": "Corentin Fressoz"}}, {"_id": "ZRNv7HCcjDKzZ9bSW", "postedAt": "2023-05-11T06:27:07.958Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": "<p>Hi John,</p><blockquote><p>The executive summary is below and the full report is <a href=\"https://drive.google.com/file/d/14od25qdb4sdDoXVDMoiSrTwuzYAMSpxK/view\">here</a></p></blockquote><p>It looks like the link is broken:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/lrbtekbh4ovgr08qcbjs\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/wto7qebn7usbvs4k8vvo 220w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/hm3zqt7ncckmystmyh36 440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/cj7ypkinud0quxhruuzv 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/oki0fxicriat6sqpydpg 880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/of0dbuydxrngazfiamux 1100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/cnf616gguktm8eas3huo 1320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/u1uqnbwftffyzchqhn4l 1540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/i7bn9tzzprrn7qtxnffn 1760w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/lwitmxxhhttsinzbxqdu 1980w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZRNv7HCcjDKzZ9bSW/idujmi2mjisryszgd9lh 2105w\"></figure>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "iKE7cjY92BYHaLZK6", "postedAt": "2022-08-28T10:45:38.786Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": null, "parentCommentId": "EAdoFZBtbGroHHQKY", "user": null}, {"_id": "7QExDZJ9myHNStHjD", "postedAt": "2022-09-11T12:14:35.457Z", "postId": "BvNxD66sLeAT8u9Lv", "htmlBody": null, "parentCommentId": "2Z8TMXMc9wB8vkL94", "user": null}]