[{"_id": "FMmwAYjXySxjMaSPK", "postedAt": "2022-09-26T08:06:03.803Z", "postId": "bvtAXefTDQgHxc9BR", "htmlBody": "<p>Great summary post re <a href=\"https://qri.org/\">QRI</a>'s work as it relates to EA. I think EA should be paying more attention to this stuff as it seems ripe for generating (and hopefully resolving!) <a href=\"https://forum.effectivealtruism.org/topics/crucial-consideration#fnxdk9z17b98\">crucial considerations</a>.</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "ZzcJZkPzHEcjfsTzY", "postedAt": "2022-10-13T19:02:40.568Z", "postId": "bvtAXefTDQgHxc9BR", "htmlBody": "<p>I feel like there is some definitional slipping going on when you suggest that a painful experience is less bad when you are also experiencing a pleasurable one at the same time.  Rather, it seems to me the right way to describe this situation is that the experience is simply not as painful as it would be otherwise.</p>\n<p>To drive this intuition consider S&amp;M play.  It's not that the pain of being whipped is just as bad...it literally feels different than being whipped in a different context that simply makes it less painful.</p>\n<p>Better yet notice the way opiates work that leaves you aware of the physical sensation of the pain but mind it less.  Isn't it just that when we experience a pleasure and pain at the same time the nuerochems created by the pleasure literally blunt the pain much like opiates would.</p>\n<hr>\n<p>On a related note I'm a bit uncomfortable about inferring too much about the structure of pain/pleasure based on our evolved willingness to seek it out/endure it and worry that also conflates reward and pleasure but it's a hard problem.</p>\n", "parentCommentId": null, "user": {"username": "TruePath"}}, {"_id": "uziTAGuHADndNnD2H", "postedAt": "2022-10-20T18:26:52.223Z", "postId": "bvtAXefTDQgHxc9BR", "htmlBody": "<p>More on <a href=\"https://forum.effectivealtruism.org/posts/XhD9ooZeJcQD8QJZL/cause-exploration-prizes-jhana-meditation\">jhana meditation as a new cause area</a>.</p>", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}]