[{"_id": "mRHHsvQe3pu4tkKdN", "postedAt": "2024-02-29T02:20:30.036Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thank you for your detailed, well-informed, and clearly written post.</p><blockquote><p>America has about five times more <a href=\"https://substack.com/redirect/4022a8dc-9e9c-4b9d-9a14-1aa43ddb8f20?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>vegetarians</u></a> than <a href=\"https://substack.com/redirect/3691b7ad-22e3-4a55-a5a4-6bd1f76798f2?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>farmers</u></a> — and many more omnivores who care about farm animals. Yet the farmers wield much more political power.</p></blockquote><p>This probably doesn't address your core points, but the most plausible explanation for me is that vegetarians on average just care a lot less about animal welfare than farmers care about their livelihoods. Most people have many moral goals in their minds that compete with other moral goals as well as more mundane concerns (which by revealed preferences they usually care about more), while plausibly someone's job is in top 1-3 of their priorities.&nbsp;<br><br>Sure there are some animal advocates (including on this forum!) who care about animals being tortured more than even farmers care about their jobs. But they're the exception rather than the rule; I'd be very very surprised if they are anywhere close to 20% of vegetarians.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "aQMysxbfJ2iWTEEAN", "postedAt": "2024-02-29T02:23:13.358Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>I liked this post a fair bit, thank you.<br><br>&gt; America has about five times more <a href=\"https://substack.com/redirect/4022a8dc-9e9c-4b9d-9a14-1aa43ddb8f20?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>vegetarians</u></a> than <a href=\"https://substack.com/redirect/3691b7ad-22e3-4a55-a5a4-6bd1f76798f2?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>farmers</u></a> — and many more omnivores who care about farm animals.<br>...<br>&gt; How do they do it? Money helps. The US National Pork Producers Council spent <a href=\"https://substack.com/redirect/02fe36ab-3bff-43ab-abd8-59bf452dc787?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>$2.8M</u></a> lobbying last year, much of it presumably to advance the anti-animal <a href=\"https://substack.com/redirect/130ed7c8-4749-434e-944a-8d11fc52b50c?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>EATS Act</u></a>. Individuals, companies, and groups associated with the meat industry made about $45M <a href=\"https://substack.com/redirect/d0932825-3e8f-491e-abaa-ecc3a491fa1c?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>in</u></a> <a href=\"https://substack.com/redirect/76fcbcc6-2a6f-46a8-b8ca-adab4a224f48?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>political</u></a> <a href=\"https://substack.com/redirect/51b390a5-edcf-4493-87b9-393b9391435b?j=eyJ1IjoibzZ1emgifQ.9M4J89iiLBRqcyFC014F7_82QPgiqhJ_cozO6f44l1Q\"><u>contributions</u></a> in the 2020 election cycle — about $45M more than animal advocates.<br><br>Wait - did vegans and animal rights groups really donate approximately $0 to political donations (at least in 2020)?&nbsp;<br><br>The facts you present seem to imply that the public cares about this issue in surveys, but doesn't care about it enough to actually spend much money trying to change things.<br><br>On that note, $45M really doesn't seem like much to me, though that was just on that one election cycle. I'd hope that animal rights people could organize $100M/yr for this sort of thing. <a href=\"https://news.gallup.com/poll/510038/identify-vegetarian-vegan.aspx\">1% of Americans identify as Vegan</a>, if they all donated an average of $33/yr, that would be $100M/yr.&nbsp;</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "tKEXdzSzKhFu5ybmw", "postedAt": "2024-02-29T04:22:21.488Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<blockquote><p>Wait - did vegans and animal rights groups really donate approximately $0 to political donations (at least in 2020)?&nbsp;</p></blockquote><p>Surely SBF count[s/ed] as a vegan and an animal rights guy? He alone donated over $5m to Biden.</p>", "parentCommentId": "aQMysxbfJ2iWTEEAN", "user": {"username": "Larks"}}, {"_id": "ajYnpNz2KTgCvtqgn", "postedAt": "2024-02-29T06:05:53.011Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>I doubt that was to support animal protection, though.</p>", "parentCommentId": "tKEXdzSzKhFu5ybmw", "user": {"username": "MichaelStJules"}}, {"_id": "6sHyHucxooziJbabr", "postedAt": "2024-02-29T12:48:20.570Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>\"<strong>Moo-ving policy, baa-lancing strategies\"</strong></p><p>After some poor sleep last night, I was getting a bit tired at the halfway mark, but this helped me push through - and I'm glad I did what a fantastic summary. Like others I'm amazed how little political lobbying is done by the animal rights \"lobby\"</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "vJgscsMn8Gs7xnKyr", "postedAt": "2024-02-29T15:57:23.849Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<blockquote><p>Animal welfare bills are typically referred to legislatures’ agriculture committees, where the most anti-reform politicians reside.&nbsp;</p></blockquote><p>[This is a US-focused comment; it's been ~20 years since I took a comparative government class.]</p><p>Looking at this through the lens of incentives would suggest the task is fairly difficult due to incentives at the district and state levels, especially as they relate to logrolling.&nbsp;</p><p>The folks on the ag committees aren't there because they hate animals; they generally have sought that committee assignment because ag interests are important to their constituents. In other words, it is particularly costly in political terms for these legislators to move legislation that is perceived as harming ag interests forward.</p><p>The US seems to have fewer cross-cutting cleavages than it used to. I would assume that people who care a lot about factory-farming issues, for whom a politician's position might reasonably be expected to impact their vote, are disproportionately concentrated in large cities. They are disproportionately in the leftmost quintile of the U.S. political distribution. Meanwhile, ag-heavy districts tend to be more conservative, even when the seat is held by a Democrat. I suspect few voters <i>most</i> interested in animal-welfare issues are likely to vote for -- or donate to -- the types of politicians who currently represent ag-interested districts anyway (no matter what their votes are on animal-welfare legislation).&nbsp;</p><p>Therefore, there is usually little counterfactual upside (and a significant downside) for a number of critical legislators to support bills opposed by the ag industry. While money and organization play a part, I think the harder issue to address is the nature of US Congressional elections happening by district and state, and the geographic concentration of many interest groups.&nbsp;</p><p>Also, I focusing on the number of factory farmers would understate the ag interests in these districts. Just because someone doesn't have kids doesn't mean they do not factor in the importance of education for the overall welfare of their community. Likewise, one doesn't have to be a factory farmer to realize that agricultural interests play a significant role in the economic welfare of their specific communities. So there is a wider group of people in the district who <i>indirectly </i>benefit from what helps ag interests.<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"dqxzj67n3t\" role=\"doc-noteref\" id=\"fnrefdqxzj67n3t\"><sup><a href=\"#fndqxzj67n3t\">[1]</a></sup></span></p><p>I think this also holds for a number of politicians not on the ag committees. In many cases, the margin of error for getting something through Congress is pretty low. Bipartisan cooperation is all too uncommon, and Senate rules give a minority faction significant powers to make passing legislation difficult and costly in terms of legislative resources. That means that each legislator's individual vote can be important.&nbsp;</p><p>I also think that focusing on the majority's support for reforms can understate the importance of <a href=\"https://en.wikipedia.org/wiki/Logrolling\">logrolling </a>/ vote trading in legislatures. Because certain districts care a lot about ag interests, other politicians can and do appeal to those interests in logrolling trades. For example, if you're a Democrat in a relatively conservative district/state, party leadership is going to ask you to cast some votes that are going to make your life more difficult. What is leadership going to offer you in exchange for that vote you cast on (e.g.) abortion that will irritate a decent number of the people who voted for you?&nbsp;</p><p>Ag issues are in a sense ideal trade objects for this kind of logrolling; they are low-cost for the rest of the party (because failure to push welfare bills is unlikely to have negative electoral consequences for anyone) but high-benefit for the receiving politician. That, of course, doesn't mean that lobbying is futile. But I think it helps explain why it may be much less successful than polling numbers would suggest.</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"dqxzj67n3t\" role=\"doc-endnote\" id=\"fndqxzj67n3t\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"dqxzj67n3t\"><sup><strong><a href=\"#fnrefdqxzj67n3t\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>Of course, a given reform bill might not actually hurt the district's broader economic interests -- as opposed to those of big ag companies. But that may be a tough case to make legibly to the district's voters.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "yfhiZbbMC4cuHed9P", "postedAt": "2024-02-29T16:02:11.568Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>There are also plenty of people whose economic or other interests are <i>indirectly </i>affected by agricultural interests. If you live in an agriculture-heavy district, anything that has a material negative effect on your community's economics will indirectly affect you. That may be through a reduction in the amount consumers have to spend in your local area, local tax revenue, farm job loss increasing competition for non-farm jobs, etc.</p>", "parentCommentId": "mRHHsvQe3pu4tkKdN", "user": {"username": "Jason"}}, {"_id": "JkpdmW5DsBKDDseuR", "postedAt": "2024-02-29T23:00:20.499Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thanks Nick! That's very kind :)</p>", "parentCommentId": "6sHyHucxooziJbabr", "user": {"username": "LewisBollard"}}, {"_id": "H6NGFZXFXZbbTBA6n", "postedAt": "2024-02-29T23:01:26.070Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thanks Linch. Yeah I think you're spot on about the salience / enthusiasm gap. I should have emphasized this more in the piece.</p>", "parentCommentId": "mRHHsvQe3pu4tkKdN", "user": {"username": "LewisBollard"}}, {"_id": "b3Xmjn3pBzt974sCj", "postedAt": "2024-02-29T23:03:56.288Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Yeah good point. I think welfare reforms should mostly be good for these indirect players, since the reforms mostly require agribusinesses to invest more in new infrastructure (e.g. building more barns to give animals more space) and increase staffing (e.g. cage-free farms require more workers than caged farms). But I agree that the indirect players probably don't see it this way.</p>", "parentCommentId": "yfhiZbbMC4cuHed9P", "user": {"username": "LewisBollard"}}, {"_id": "GErGRzDMAPWvDmv7c", "postedAt": "2024-02-29T23:13:42.912Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thanks Ozzie! I should have been more precise in my claim. I'm guessing people who happen to be vegans or animal rights activists cumulatively donated millions in the 2020 election cycle. I'm just not aware of anyone donating substantial $ for the purpose of advancing animal advocacy.&nbsp;</p><p>But, in fairness, this may well be true of a lot of the $45M donated by industry-aligned individuals too. E.g. $14.7M of the $45M was donated by executives of Mountaire Corp, almost entirely to conservative groups. My guess is that's likely because those executives are personally conservative -- not because they're buying influence.</p><p>And yeah I agree the money involved is surprisingly little given the stakes. I'd love to see someone try to organize vegans to give politically, though you'd also need to get the vegans to tell politicians this is why they're donating, which might be more challenging.</p>", "parentCommentId": "aQMysxbfJ2iWTEEAN", "user": {"username": "LewisBollard"}}, {"_id": "XcnYneaDA6C3Grdfz", "postedAt": "2024-02-29T23:19:27.215Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thanks Jason! You raise some really interesting points. I particularly like your logrolling point, which I think explains well the disproportionate power of reform opponents on ag policy. The decline of rural Democrats may be quite helpful here in getting the Democratic party onboard. But it won't help with Republicans, where I agree that pro-reform suburban Republicans are likely going to keep trading away this issue to anti-reform rural Republicans.</p>", "parentCommentId": "vJgscsMn8Gs7xnKyr", "user": {"username": "LewisBollard"}}, {"_id": "mQgc3efxiQFk3bWFM", "postedAt": "2024-03-01T00:25:07.822Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Vegans could donate to an animal protection group, like HSUS, to lobby on their behalf. That should make it clear why they’re donating.</p>\n", "parentCommentId": "GErGRzDMAPWvDmv7c", "user": {"username": "MichaelStJules"}}, {"_id": "FJL5KSibnfv8np6KW", "postedAt": "2024-03-01T03:46:40.204Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>This seems like an isolated demand for rigour. When Hormel employees and other associated people <a href=\"https://www.opensecrets.org/orgs/hormel-foods/summary?topnumcycle=2024&amp;contribcycle=2024&amp;lobcycle=2024&amp;outspendcycle=2022&amp;id=D000026518&amp;toprecipcycle=2020\">gave $500k</a> to <a href=\"https://kitchentableconversations.org/about-us\">an end-of-life care charity</a> - a donation which is part of Lewis's data - I don't think this was a secret scheme to increase beef consumption. (I'm not really sure why it's captured in this data at all actually). People who work in agriculture aren't some sort of evil caricature who only donate money to oppose animal protection; a lot of their donations are probably motivated by the same concerns that motivate everyone else.</p>", "parentCommentId": "ajYnpNz2KTgCvtqgn", "user": {"username": "Larks"}}, {"_id": "K67XQZXrG3CxKzFg4", "postedAt": "2024-03-01T06:33:31.305Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<blockquote><p>When Hormel employees and other associated people <a href=\"https://www.opensecrets.org/orgs/hormel-foods/summary?topnumcycle=2024&amp;contribcycle=2024&amp;lobcycle=2024&amp;outspendcycle=2022&amp;id=D000026518&amp;toprecipcycle=2020\">gave $500k</a> to <a href=\"https://kitchentableconversations.org/about-us\">an end-of-life care charity</a> - a donation which is part of Lewis's data - I don't think this was a secret scheme to increase beef consumption.</p></blockquote><p>Ya, I wouldn't want to count that. I didn't check what the data included.</p><blockquote><p>People who work in agriculture aren't some sort of evil caricature who only donate money to oppose animal protection; a lot of their donations are probably motivated by the same concerns that motivate everyone else.</p></blockquote><p>I agree. I think if the money is coming through an interest/industry group or company, not just from an employee or farmer, then it's probably usually lobbying for that interest/industry group or company or otherwise to promote the shared interests of that group. Contributions from individuals could be more motivated by political identity and other issues than just protecting or promoting whatever industry they work in.</p>", "parentCommentId": "FJL5KSibnfv8np6KW", "user": {"username": "MichaelStJules"}}, {"_id": "KJerChSnZwkoJrgRa", "postedAt": "2024-03-01T11:25:54.621Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thank you so much for an excellent post.</p><p>I just wanted to pick up on one of your suggested lessons learned that, at least in my mind, doesn’t follow directly from the evidence you have provided.</p><p>You say:</p><blockquote><p>These wins suggest a few lessons. ... the value of cross-party support. Every farm animal welfare law I’m aware of, globally, passed with cross-party support. ... We should be able to too: there are many more conservative animal lovers than liberal factory farmers.</p></blockquote><p>To me, there are two very opposing ways you could take this. Animal-ag industry is benefiting from cross party support so:<br><strong>A]</strong> Animal rights activists need to work more with the political right so that we get cross-party support too, essentially <strong>depoliticising animal rights </strong>policy, with the aim of <i>animal activists also getting the benefits</i> of cross party support.<br><strong>B]</strong> Animal rights activists need to work more with the political left so that supporting animal farming is an unpalatable opinion or action for anyone on the left to hold, essentially <strong>politicising animal rights </strong>policy, with the aim of <i>industry loosing the benefits</i> of cross-party support.</p><p><strong>Why do you suggest strategy A] depolticisation? </strong>Working with conservative animal lovers. Do you have any evidence this is the correct lesson to draw?</p><p>I have not yet done much analysis of this question but my initial sense from the history of social change in the US is that the path to major change though an issue becoming highly politicised and championed by one half of the political spectrum is likely to be the quicker (albeit less stable) route to success, and in some cases where entrenched interests are very strong, might be the only path to success (e.g. with slavery). I worry the a focus on depoliticsiation could be a strategic blunder. I have been pondering this for a while and am keen to understand what research, evidence and reasoning there is for keeping animal rights depoliticsed.</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "8chFkkEJatLsswT6W", "postedAt": "2024-03-01T23:41:45.651Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thanks for flagging that. I agree that most of the funds donated by animal ag employees were not to oppose animal protection, or likely any specific policies. I should have clarified that. I also generally don't think of people working in agriculture as evil. I think they're mostly just doing the rationale thing given the goal of profit maximization, and the lack of constraints we've imposed on how to pursue that.</p>", "parentCommentId": "FJL5KSibnfv8np6KW", "user": {"username": "LewisBollard"}}, {"_id": "DgzYWxAy27fkwgGW9", "postedAt": "2024-03-01T23:52:07.741Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thanks, this is a good point. I agree that it's not obvious we should choose A) over B).</p><p>My evidence for A) is that it seems to be the approach that worked in every case where farm animal welfare laws have passed so far. Whereas I've seen a lot of attempts at B), but never seen it succeed. I also think A) really limits your opportunities, since you can only pass reforms when liberals hold all key levers of power (e.g. in the US, you need Democrats to control the House, Senate, and Presidency) <i>and</i> they agree to prioritize your issue.</p><p>My sense is that most historic social reforms also followed path A), e.g. women's suffrage, child labor, civil rights. In the UK, cross-party support was also critical to abolishing slavery, while in the US, where abolition was more politicized, it took a Civil War.</p><p>That said, the farm animal welfare successes of A) mostly occurred in past decades when politics was less polarized and I think some modern movements like climate change suggest A) may be the only plausible path today. I also wonder if we might be able to do some of A) and B). E.g. try to make being pro-factory farming an unpalatable opinion for anyone on the left or moderate right to hold -- leaving just the most conservative rural representatives championing it.</p>", "parentCommentId": "KJerChSnZwkoJrgRa", "user": {"username": "LewisBollard"}}, {"_id": "AZGRA7XiJehN3x7XD", "postedAt": "2024-03-02T17:11:35.134Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Thank you for a nuanced and interesting reply.</p>\n", "parentCommentId": "DgzYWxAy27fkwgGW9", "user": {"username": "weeatquince"}}, {"_id": "jPSJQHADgLRheoYYX", "postedAt": "2024-03-03T12:59:53.289Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>I can't speak for Lewis but as an animal advocate running an organisation, my bigger concern is that politicisation is irreversible and destroys option value.</p>", "parentCommentId": "KJerChSnZwkoJrgRa", "user": {"username": "emre kaplan"}}, {"_id": "eEdsusN8hXMqypuDK", "postedAt": "2024-03-03T22:14:55.444Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>I think you’re asking a general question of whether we should politicise or depoliticise issues we care about. I pretty much always think the answer is depoliticise, because very crudely, I expect the right and left to be in power about 50% of the time in 50% of the places, so if we want the laws we want everywhere, we should depoliticise things we care about.</p>\n", "parentCommentId": "KJerChSnZwkoJrgRa", "user": {"username": "freedomandutility"}}, {"_id": "CfHBN3pp4ipEYdxbk", "postedAt": "2024-03-07T16:17:46.476Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<blockquote><p>My sense is that most historic social reforms also followed path A), e.g. women's suffrage, child labor, civil rights. In the UK, cross-party support was also critical to abolishing slavery, while in the US, where abolition was more politicized, it took a Civil War.</p></blockquote><p>As a non-expert, this is surprising to me. And I'm not sure that this applies to the US context. I think it's useful to distinguish between party polarization (democrats vs republicans) and ideological polarization (liberals vs conservatives). Almost any reform passed in the 1950s-1970s probably had bipartisan support, since the two parties were hardly ideologically polarized at that time. But many of these reforms were absolutely politicized on ideological grounds (liberals typically were in favor of civil rights and environmental reforms. Conservatives were not). I think the anti-slavery movement fits this description as well. Until the last few years before the civil war, the two major political parties (democrats and whigs) both contained large groups of pro-slavery and anti-slavery politicians. So opposition to slavery was bipartisan even though it was clearly polarized on ideological and geographical grounds. Only in the few years before the civil war did the major parties become polarized on the slavery issue.<br>In recent decades, since the two major parties have become more ideologically polarized, it seems like major reforms were politicized on both party and ideological lines (LGBTQ rights and climate change come to mind).<br><br>So, my guess is that most major social reforms in US history were highly politicized on ideological lines, but not necessarily on party lines. I could be wrong though. This is mostly based on reading wikipedia pages.</p>", "parentCommentId": "DgzYWxAy27fkwgGW9", "user": {"username": "sbehmer"}}, {"_id": "9rmSzwBxfwaiPA6Fw", "postedAt": "2024-03-09T18:47:26.635Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Yea, this is what I was assuming the action/alternative would be. This strategy is very tried-and-true.&nbsp;</p>", "parentCommentId": "mQgc3efxiQFk3bWFM", "user": {"username": "oagr"}}, {"_id": "EtrdsjkzF7kFxssqz", "postedAt": "2024-03-14T17:32:31.677Z", "postId": "BvXkG3PLfdmvoECFb", "htmlBody": "<p>Yeah that's a great point. I think you're right that these issues were ideologically polarized historically, and that now the parties reflect that polarization, it may mean that most social reforms will be politically polarized too.</p>", "parentCommentId": "CfHBN3pp4ipEYdxbk", "user": {"username": "LewisBollard"}}]