[{"_id": "Y4PrFSzjvG9jHLwH6", "postedAt": "2021-11-13T23:04:18.547Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>Well done!!&nbsp;<br><br>I would absolutely love if you will post these results to our FB group <a href=\"https://www.facebook.com/groups/1275690949170991\">Psychologists for Effective Altruism. </a>(Please Join!) &nbsp;<br><br>Have you tried publishing your results to Mental Health Innovation Network? It is a fantastic organization and they try to promote such novel interventions.&nbsp;<br><br>And I'm sure that if your N was a bit bigger you would have reached the statistical significance that would show that BROAD is superior to the Light Box!!&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dvir Caspi"}}, {"_id": "c4SSjLJLA5EEHrnpj", "postedAt": "2021-11-14T03:42:49.212Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>I haven't read the paper, but this sounds interesting. There was a time when I purchased this 10,000 lumen <a href=\"https://www.amazon.com/Brightness-Waterproof-Daylight-Worklights-Construction/dp/B08HZ8P8WJ/ref=sr_1_9?keywords=construction+lamp&amp;qid=1636861077&amp;sr=8-9\">lamp</a> to ail my poor sentiment during the sophomore year of college. The power in my room blew out once I purchased a second lamp, and I was left without electricity in my dorm for 2 weeks. Imagine treating everyone with SAD - 100,000 lumens each. I wonder how much electricity this would be collectively. Each person would need around this amount of light for some duration of some interval of the year. What would be the net positive impact of this intervention? Would the increased productivity and mood conferred outweigh the costs of the massive electrical usage? I can imagine that it might be the case that simply living somewhere else during the worst parts of the year for people with SAD is better than a 100,000 lumen room, which I assume uses much more electrical power than most rooms.&nbsp;</p>", "parentCommentId": null, "user": {"username": "rodeo_flagellum"}}, {"_id": "rdkkafDQqgjfYoETN", "postedAt": "2021-11-14T04:14:28.765Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>How did the electricity blow out once you had 2 100W lamps? That's 200W whereas a toaster or hair dryer commonly uses 1200-1500W.</p><p>Also, energy has a price and we can just measure it. At 20c/kWh, which is above average US retail electricity cost and probably enough to pay for carbon offsets too, 200W <i>* &nbsp;</i>1h/day<i> &nbsp;</i>* 20c / kWh = 4 cents/day, cheaper than most antidepressants by an order of magnitude.</p>", "parentCommentId": "c4SSjLJLA5EEHrnpj", "user": {"username": "tkwa"}}, {"_id": "kBi2aRsXYgrAwDj2o", "postedAt": "2021-11-14T10:22:16.486Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>For 100,000 LM, 12 hours a day, that would be 1000W * 12h/day * 20c/kwh = $2.4.</p>", "parentCommentId": "rdkkafDQqgjfYoETN", "user": {"username": "Lukas_Finnveden"}}, {"_id": "G9GL4KxGvKBeCQWYr", "postedAt": "2021-11-14T13:33:06.285Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>yes, when we did the calculation, it was something like €2 per day (for ~6-8 hours per day). Still very cheap for a depression treatment :-)</p>", "parentCommentId": "kBi2aRsXYgrAwDj2o", "user": {"username": "JanBrauner"}}, {"_id": "a8qSuivmeTgiEhFNK", "postedAt": "2021-11-14T13:58:54.895Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>I was thinking more about price in terms of carbon cost, but this should follow from the USD calculation, assuming that this is roughly proportional to some quantity of CO2 released. My prior knowledge on wattage was lacking, so I guessed 100k lumen for ~8-12 hours per day to consume more electricity than it actually does.&nbsp;</p>", "parentCommentId": "rdkkafDQqgjfYoETN", "user": {"username": "rodeo_flagellum"}}, {"_id": "QzheAKjwAM9H3wqCR", "postedAt": "2021-11-15T13:34:50.881Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>Nice! :)</p><p>Also, I think a few links are missing here:</p><blockquote><p>David Chapman for inspiring us with these two posts in the Meaningness blog, Raemon for inspiring us with this LessWrong post</p></blockquote>", "parentCommentId": null, "user": {"username": "markus_over"}}, {"_id": "rtExhmSjQenYDPyHx", "postedAt": "2021-11-19T00:02:18.529Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>Thanks so much! I'm already in this group, thanks for the reminder to post there. Just did it :)</p>", "parentCommentId": "Y4PrFSzjvG9jHLwH6", "user": {"username": "Fabienne"}}, {"_id": "DkJjX7v3ACH3eATdL", "postedAt": "2021-11-19T00:03:32.364Z", "postId": "bwhDhZQvbEcG4FEb8", "htmlBody": "<p>Thanks a lot! I have corrected that now :)</p>", "parentCommentId": "QzheAKjwAM9H3wqCR", "user": {"username": "Fabienne"}}]