[{"_id": "yRxnuPk6PT7dto5Fk", "postedAt": "2017-07-02T22:39:32.834Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Could you say what forum volunteering involves and how much time you spend each week doing it?</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "2hszGwCeKW8jQMAeL", "postedAt": "2017-07-03T01:17:06.574Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Once you make the domain change, both effectivealtruism.com and effective-altruism.com will redirect to effectivealtruism.org. Have you considered purchasing effective-altruism.org and redirecting it to effectivealtruism.org to avoid any confusion? </p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "daLAeAgR8KNFejyYX", "postedAt": "2017-07-03T02:41:30.493Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Can you speak to any plans on the horizon other than changing the domain name, even if long term?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "jjkKHoRAhTvCndTHQ", "postedAt": "2017-07-03T03:56:54.030Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Thanks Julia! </p>\n<p>I would like to add my thanks to Ali Woodman and Rebecca Raible, who did much of the moderation over the last couple of years, as well as Dot Impact, Trike and the rest of the previous moderators. My perspective is that since I've moved toward research and CEA has grown, it no-longer makes sense for me to dedicate my time to continuing to manage the forum. So I'm grateful for CEA's takeover. Of course, I'm still happy to consult if you need help understanding how the forum has run, or thinking about its strategy.</p>\n<p>Thanks all and long live effective altruism! ;)</p>\n<p>Ryan</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "2wrLcHxpttkxjfo7S", "postedAt": "2017-07-03T18:50:53.473Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Yep, this is already in place! Try going to <a href=\"http://www.effective-altruism.org\">www.effective-altruism.org</a></p>\n", "parentCommentId": "2hszGwCeKW8jQMAeL", "user": {"username": "SamDeere"}}, {"_id": "ezBwsiLuEPWQQ6qzz", "postedAt": "2017-07-04T03:26:18.315Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Short-medium term: some minor UI changes, to bring branding more into line with the rest of effectivealtruism.org</p>\n<p>Longer term ideas (caveat — these are just at the thought bubble stage at the moment and it's not clear whether they'd be valuable changes): </p>\n<ul>\n<li><p>I think there's appetite for a discussion space that's both content aggregation as well as original content. This might take the form of getting a more active subreddit (for example) happening, but plausibly this could be something specifically built-for-purpose that either integrates with or complements the existing forum.</p>\n</li>\n<li><p>We've thought about integrating logins between the webapp on EffectiveAltruism.org (what is currently just EA Funds) and the forum to avoid the need to manage multiple accounts when doing various EA things online</p>\n</li>\n<li><p>We've also thought a bit about integrating commenting systems so that discussion that happens on various EA blogs is mirrored on the forum (to avoid splitting discussions when cross-posting).</p>\n</li>\n</ul>\n<p>If there are things that you think would be useful (especially if you've been able to give this more thought than I have) that'd be great to know, with the caveat that we're pretty restricted by developer time on this, and the priority is ensuring ongoing maintenance of the existing infrastructure, rather than building out new features.</p>\n<p>[eta spaces between dot points]</p>\n", "parentCommentId": "daLAeAgR8KNFejyYX", "user": {"username": "SamDeere"}}, {"_id": "us4wKjuw79ZyEGvqs", "postedAt": "2017-07-04T07:00:00.253Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Do you foresee any changes being made to the moderation guidelines on the forum? Now that CEA's brand name is associated with it, do you think that could mean forbidding the posting of content that is deemed &quot;not helpful&quot; to the movement, similar to what we see on the Effective Altruists Facebook group?</p>\n<p>If there are no anticipated changes to the moderation guidelines, how do you anticipate CEA navigating reputational risks from controversial content posted to the forum?</p>\n", "parentCommentId": null, "user": {"username": "vipulnaik"}}, {"_id": "rT3Qy6BDQqC4wc2F9", "postedAt": "2017-07-04T12:34:16.709Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>The main reason moderation on the Facebook group works the way it does is that the group has 13000+ members and no ability to downvote, so the ratio of signal to noise would be pretty sad if there were no screening. It's very rare that the Facebook group moderators screen out a post for being harmful - almost everything that we screen out is because it's not relevant enough. </p>\n<p>With the Forum, everyone can upvote and downvote, so content that readers find most interesting and relevant gets sorted up to the top that way. There's also a karma threshold to make a post (though we can help newcomers with that if they ask.) So I don't have the same worry about the front page becoming mostly noise. </p>\n<p>We still expect to enforce the standards of discussion on the Forum, described in the FAQ (&quot;Spam, abuse and materials advocating major harm or illegal activities are deleted.&quot;) But in general we expect that people don't take everything posted on the Forum to represent CEA's view. </p>\n", "parentCommentId": "us4wKjuw79ZyEGvqs", "user": {"username": "Julia_Wise"}}, {"_id": "hqzzf7szA7stj5DsE", "postedAt": "2017-07-04T12:45:31.914Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>I'm not sure about tech volunteering, I think that's pretty ad hoc. </p>\n<p>Moderating involves generally staying aware of what's being posted, removing spam, deciding with other moderators what to do about posts or comments that other users have reported as inappropriate, and sometimes giving feedback to users about how they could improve their posts. Currently it takes less than an hour a week, but if the Forum gets used more I'd expect that to increase.</p>\n", "parentCommentId": "yRxnuPk6PT7dto5Fk", "user": {"username": "Julia_Wise"}}, {"_id": "kA4Pjz2rPkzMQExd9", "postedAt": "2017-07-04T22:58:04.313Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>EDIT: It's been over a week, and it seems particularly important that CEA answer this.</p>\n<hr />\n<p>I see some significant disadvantages to this, to the point that it should be reconsidered.</p>\n<p>EffectiveAltruism.org is designed around making EA welcoming and appealing to newcomers. The EA Forum is quite the opposite... it is in depth, can involve controversial ideas and discussions, and can sometimes have a less welcoming tone in the content and comments.</p>\n<p>They're really polar opposites in terms of EA, and by bringing the two together in the same domain and with the same front-end you're closely associating them. This violates Marketing 101, bringing two things together that are positioned so differently.</p>\n<p>By sharing the same domain, they two will be closely associated in search, and by changing the front-end the association will be much stronger.</p>\n<p>Is the intention for the forum to have more newcomers on it? I fear it will become like the Effective Altruism Facebook page in depth of content and usefulness.</p>\n<p>Or alternatively if the forum content doesn't change, it will turn off newcomers and detract from the utility of the main EffectiveAltruism.org site.</p>\n<p>I'd like to further understand the plan for bringing these quite different things together, and how you might mitigate the dilution of the forum.</p>\n<hr />\n<p>Small side note: Forum.effectivealtruism.org has some SEO disadvantages (v. EffectiveAltruism.org/forum), and the way you implement this transition from a technical standpoint will also affect SEO significantly, so I urge you to consult with somebody about proper ways to do so.</p>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "6grrXL6nekucFz6La", "postedAt": "2017-07-04T23:52:50.419Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>I really respect the moderators of this forum for allowing me to advocate for public safety (ie. criticize NUE) and removing comments that could endanger public safety (ie. advocating suicide)!</p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "ft6p4CazHCRbEtHGc", "postedAt": "2017-07-07T23:47:33.257Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>I presume CEA tech staff will make the branding changes, but is the plan for them also to make the longer term changes, or would that continue to be the .impact community? I don't understand what roles CEA has taken on as of this announcement and what role .impact continues to have? It sounds from the first paragraph like .impact has decided to transition primary responsibility for forum maintenance and improvements to CEA, but the third last paragraph suggest otherwise - could someone from that community comment?</p>\n", "parentCommentId": "ezBwsiLuEPWQQ6qzz", "user": {"username": "Nekoinentr"}}, {"_id": "2Ly9fuwLXhEKtwPeW", "postedAt": "2017-07-07T23:50:14.342Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Another change:</p>\n<p>(3) Tagging users so they get notifications. I tried tagging &quot;Tee&quot;, who posted here about moving up to the Executive Director role at .impact, in my previous comment. But I couldn't find a character like @ that allowed me to do this.</p>\n<p>(Is there a place to post feature suggestions like this?)</p>\n", "parentCommentId": "Wws3QMqYbpdqRMpTb", "user": {"username": "Nekoinentr"}}, {"_id": "qJixiqWcWG6gRm7WH", "postedAt": "2017-07-10T16:06:39.558Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<blockquote>\n<p>We've also thought a bit about integrating commenting systems so that discussion that happens on various EA blogs is mirrored on the forum (to avoid splitting discussions when cross-posting).</p>\n</blockquote>\n<p>I've thought a bunch about this; let me know if you want to talk.</p>\n", "parentCommentId": "ezBwsiLuEPWQQ6qzz", "user": {"username": "Jeff_Kaufman"}}, {"_id": "55GuPvpdvJPirxWGF", "postedAt": "2017-07-14T21:00:45.280Z", "postId": "bwoqzGiz9NNgowsGt", "htmlBody": "<p>Hey Josh, thanks for the comment and sorry for the wait on a response.</p>\n<p>The TL;DR is that I think that the branding changes provide a small amount of upside in terms of consistency, and have low risk of downside, because I don't expect that they'll significantly change discoverability, forum composition, or that they'll counterfactually change people's impressions of the different parts of the EA online space.</p>\n<p>Our primary motivation is to reduce the proliferation of very similar domain names that all correspond to different things (e.g. effective-altruism.com is the Forum, previously effectivealtruism.com was the <em>Doing Good Better</em> site etc). From our perspective it seems useful to consolidate community assets under the same domain, both from the perspective of users seeing them as part of a broadly unified whole, and in the longer term, from a technical perspective (e.g. easier to share logins between different sites on the same domain). I agree that it's probably good to keep some branding differentiation between the Forum and the front page of EffectiveAltruism.org, however I think it's disingenuous for us to pretend that there's no overlap.</p>\n<p>Perhaps a good analogy is YCombinator/Hacker News — the front page presents a more welcoming, informative front, whereas Hacker News has a pretty intense community and may not always be welcoming to newcomers. However, I think people are generally pretty good at understanding that the organization and the user-generated content are different things, while understanding them to be part of the same broad sphere.</p>\n<p>I wholeheartedly agree that the Forum is a more advanced part of the community, and it's certainly not our intention to try to dilute the quality of conversation or flood it with newcomers who may lack the context to meaningfully contribute to some of the more in-depth discussions or may find the tone unwelcoming. However, this seems like an issue of discoverability. The Forum is already pretty discoverable (fourth result for 'effective altruism' on Google), so if someone totally new is doing a wide survey of what the EA online space is like, they'll find it (and it already has 'Effective Altruism' in the name...). However, we're not planning on adding additional links to it from the www domain, or changing how we market it in other channels — I don't expect this change to significantly change the composition of people posting on the forum, nor do I expect that it significantly changes how people will view the broad idea of 'effective altruism' (especially not relative to the status quo).</p>\n<p>Given that there's already a strong association between EA and the EA Forum, I don't think the exact domain matters that much. If we didn't want there to be any association, we should probably take the words 'effective altruism' out of the title and have a completely different domain. This isn't something we're currently considering.</p>\n<p>I'd prefer to use a subdomain rather than a nested route because it's a significantly simpler DNS/server setup. I think the SEO point is a bit counter to the other points. I agree that it will have some SEO implications, but if the issue is discoverability, then actually making the Forum less discoverable in a random search seems to work more to your purposes (as above, currently the Forum is the fourth result on Google). In terms of implementation, we're planning to rewrite the old domain to the new one (using 301 redirects and keeping the old domain active to prevent broken links). I'd also planned to advise Google of the domain change using Search Console. I'd be very happy to hear from you if there are additional steps that you think are important here.</p>\n", "parentCommentId": "kA4Pjz2rPkzMQExd9", "user": {"username": "SamDeere"}}]