[{"_id": "cNqXxbkMCkXtHXtkC", "postedAt": "2023-12-19T13:17:06.249Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p><strong>Executive summary:</strong> An investigation into the non-profit Nonlinear went seriously wrong due to procedural flaws, resulting in damaging false claims that indicate deeper issues in the rationalist/EA culture around accountability.</p><p><strong>Key points:</strong></p><ol><li>The investigation unearthed and published unambiguous falsehoods that proper fact-checking with Nonlinear could have prevented.</li><li>Known issues were dismissed by the community, indicating a flawed standard around spreading damaging claims.</li><li>Better accountability processes used elsewhere show negligence, not impracticality.</li><li>Legal threats deserve distinct consideration as a last defense against reputational damage.</li><li>A failure to fully consider duties and potential harm suggests the need for more grace and procedural safeguards.</li><li>Declaring a mistrial and starting over may be the only viable path forward after such comprehensive flaws.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "WgqagZSyR4G2stBJq", "postedAt": "2023-12-19T15:36:15.463Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Insightful and well-argued post!</p><ul><li>I found the hypothetical about NYT and CEA helpful for reasoning from first principles about acceptable journalistic practice. I came out of it empathizing more with Nonlinear's feelings before and during the publication of Ben Pace's article than I previously had.</li><li>Regarding Ben Pace's explicit seeking of negative information and unwillingness to delay posting, you updated me from thinking of these as simple mistakes to now considering them egregiously bad.</li><li>Great point that an article author can't just state their disclaimers at the top and expect readers to rationally recalibrate themselves and ignore the vibes of the evidence's presentation.</li></ul><p>I found it hard to update throughout this story because the presentation of evidence from both parties was (understandably) biased. As you pointed out, \"Sharing Information About Nonlinear\" presented sometimes true claims in a way which makes the reader unsympathetic to Nonlinear. Nonlinear's response presented compelling rebuttals in a way which was calculated to increase the reader's sympathy for Nonlinear. Both articles intentionally mix the evidence and the vibes in a way which makes it difficult to readers to separate the two. (I don't blame Nonlinear's response for this as much, since it was tit for tat.)</p><p>Thanks again for putting so much time and effort into this, and I'm excited to see what you write next.</p>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "6zFqDCwumpoGAm5AH", "postedAt": "2023-12-19T15:46:03.216Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thank you for putting so much effort into helping with this community issue.&nbsp;<br><br>What do you think community members should do in situations similar to what Ben and Oliver believed themselves to be in: where a community member believes that some group is causing a lot of harm to the community, and it is important to raise awareness?<br><br>Should they do a similar investigation, but better or more fairly? Should they hire a professional? Should we elect a group (e.g., the CEA community health team (or similar)) to do these sorts of investigation?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "AE8vYcKCryBmHnkCK", "postedAt": "2023-12-19T16:04:27.375Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I'll just quickly say that my experience of this saga was more like this:&nbsp;<br><br>Before BP post: NL are a sort of atypical, low structure EA group, doing entrepreneurial and coordination focused work that I think is probably positive impact.<br>After BP post: NL are actually pretty exploitative and probably net negative overall. I'll wait to hear their response, but I doubt it will change my mind very much.<br>After NL post: NL are probably not exploitative. They made some big mistakes (and had bad luck) with some risks they took in hiring and working unconventionally. I think they are probably still likely to have a positive impact on expectation. I think that they have been treated harshly.<br>After this post: I update to be feeling more confident that this wasn't a fair way to judge NL and that these sorts of posts/investigations shouldn't be a community norm.&nbsp;</p>", "parentCommentId": "WgqagZSyR4G2stBJq", "user": {"username": "Peterslattery"}}, {"_id": "BZYjhixEiLqkcorrm", "postedAt": "2023-12-19T16:33:03.554Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>This post seems premature to me (edit: which I recognize might seem in conflict with my defense of Ben not giving Nonlinear more time to respond before publication, and am happy to go into why I hold both of these positions after Ben published his response).</p><p>In-particular the section 'Avoidable, Unambiguous Falsehoods' contains mostly claims that are, to the best of my knowledge, not actually falsehoods, but are correct. And that section of the post seems quite load-bearing (given that the central case of the post relies on spreading false and/or misleading information about Nonlinear, and the case for an absence of due diligence).</p><p>Ben is working on a response, and given that I think it's clearly the right call to wait a week or two until we have another round of counter-evidence before jumping to conclusions. If in a week or two people still think the section of \"Avoidable, Unambiguous falsehoods\" does indeed contain such things, then I think an analysis like this makes sense, and people can spend time thinking through the implications of that (I disagree with various other parts of the post, but I think mine and Ben's time is best spent engaging with Nonlinear's post and not getting distracted by discussion on this post).</p><p>I might also try to get some responses out earlier, but my current sense is people would like us to not rush out a response to reduce the risk of any errors introduced and to generally save people time and attention. Interested in people's takes in the replies if they disagree. If people prefer we can post evidence more piecemeal and quickly, though my vague read is that people prefer us taking time and to publish something more comprehensive.</p><p>(I do also want to clarify that Me and Ben were not shared on this post in advance, and I would have left comments with evidence falsifying at least one or two of the claims)</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "PvCK2FHNsXYrQwy7w", "postedAt": "2023-12-19T16:34:50.988Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>Threats of lawsuits are fundamentally different to other threats. They are, as @Nathan Young put it, bets that the other party is so wrong you're willing to expend both of your time and money to demonstrate it.&nbsp;</p></blockquote><p>I don't think that's quite right. <i>Threats </i>of lawsuits are extremely cheap -- it takes ten seconds max to type \"I'll sue you!\" They are also commonly made without a reasonable basis in law or fact, and without any intent to actually follow through. They are often used to inappropriately silence speech and truthseeking.&nbsp;</p><p>Hiring a lawyer and filing a complaint gets closer to a bet, as you are putting some significant money and time on the line. However, people definitely file defamation suits as a form of PR management without any real intent to see them to trial, expecting that observers will see the filing as a marker of earnestness and/or a signal to withhold judgment until legal proceedings are complete. By the time the case is withdrawn or settled on confidential terms, public interest has moved on and nobody pays much attention.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6t3fwkphf5r\"><sup><a href=\"#fn6t3fwkphf5r\">[1]</a></sup></span></p><p>So evaluating whether it was an appropriate to threaten litigation requires an assessment of whether the threatening party would have a reasonable basis in fact and law, as well as a reasonable basis under the community's norms,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref1j6aiglgjk1\"><sup><a href=\"#fn1j6aiglgjk1\">[2]</a></sup></span>&nbsp;for initiating and completing litigation. Bluffing to intimidate a would-be publisher, or filing litigation without good cause, should be strongly condemned. I also think that suing, or threatening to sue, individual employees in their personal capacities should generally be off the table where their conduct was in the scope of their employment.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6t3fwkphf5r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6t3fwkphf5r\">^</a></strong></sup></span><div class=\"footnote-content\"><p>For example, in recent defamation litigation involving cheating accusations made by the then-world champion, I think the plaintiff's attorneys may have brought certain claims and made procedural missteps to draw a motion to dismiss that would stall the case out for months and allow the plaintiff to characterize the court's adverse ruling as on procedural matters rather than the merits. After that, the case confidentially settled with no indication that money changed hands. A less interesting possibility is that plaintiff's lawyers were just not very good.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn1j6aiglgjk1\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref1j6aiglgjk1\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In my tentative view, those norms should match the US constitutional norms where individuals of little prominence are concerned (mere negligence required), and where the speaker is a limited-purpose public figure (\"actual malice\" required). However, between those poles, I would often apply a sliding scale rather than a binary. For individuals/organizations of some prominence, where the subject matter is one of legitimate community concern, we probably want to err to some extent on not suppressing speech. So my standard there might be ~ \"gross negligence OR refusal to retract when actually presented with pretty clear evidence of falsity.\"</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "FnXsMrrYTxxMfzjxy", "postedAt": "2023-12-19T16:58:06.810Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>You criticize Ben for not waiting a week for a response, and yet you yourself were unable to wait a week for <i>his</i> response to the <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims\">recent article</a>. If you look in the comments, a lot of people have found significant misrepresentations in that article: the author paraphrased Chloe incorrectly, put those paraphrases in quotes as if they were her actual words, and then \"debunked\" those.&nbsp;</p><p>I'm worried that the response to one side presenting a biased account is to present an equally biased account in the other direction. The presentation about the new york times here appears to be an attempt to harness tribalistic feelings about hated outsiders. But what actually matters is the truth. I don't think Ben's original article ended up entirely truthful, and he should apologise for that. But Kat's reply was not entirely truthful either.&nbsp;</p><p>Would a culture of lawsuits in EA help expose truth? I don't think so. I think it would lead to the rich and powerful being handed a bludgeon they can use to prevent the powerless from speaking out about exploitation and harm. I wish this investigation was handled better, but I am still glad that it happened. &nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "hLkTHrfWDR9pzQSo6", "postedAt": "2023-12-19T17:17:59.586Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Since the time I have started looking into this, you have:</p>\n<ul>\n<li>\n<p><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=sid5NsbnFZ2JLhYnZ\">incorrectly described the nature of people you talked with around Nonlinear</a>, for which you subsequently apologized.</p>\n</li>\n<li>\n<p><a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=7bFGyqEa6mbSrmpfv\">incorrectly claimed Nonlinear might be sponsored by Rethink Priorities</a>, which you subsequently retracted. (EDIT: While as per below he did text a board member to check here, I think the example still has some value)</p>\n</li>\n<li>\n<p><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=y3AP5N8xYcxc3eHqd\">made likely-incorrect assumptions about libel law</a>, which I subsequently clarified.</p>\n</li>\n<li>\n<p><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=jwCQiZFjAvtgotmGv\">incorrectly predicted what journalists would think of your investigative process</a>, after which we collaborated on a hypothetical to ask journalists, all of whom disagreed with your decision.</p>\n</li>\n<li>\n<p>in our direct messages about this post prior to publication, provided a snippet of a private conversation about the ACX meetup board decision where you took a maximally broad interpretation of something I had limited ways of verifying, pressured me to add it as context to this post in a way that would have led to a substantially false statement on my part, then admitted greater confusion to a board member while saying nothing to me about the same, after which I reconfirmed with the same board member that the wording I chose was accurate to his perception.</p>\n</li>\n<li>\n<p>agreed that the claim about vegan food as written, which Spencer tried to correct prior to publication, was substantially incorrect.</p>\n</li>\n</ul>\n<p>I appreciate that you publicly update when you get things wrong, but the frequency with which you make these mistakes serves as strong evidence to me that I had sufficient information to make this post.</p>\n<p>The specific falsehoods, while useful, are not the core of my point. The core of my point is that a process aimed at finding only the negative, in which a great majority of your time is spent gathering evidence from one side of a situation and sympathizing with one party to it, will necessarily lead to a post aimed at something other than truth-seeking and a trial in the court of public opinion without due process. The journalistic standard I advocate for and you disagree with stands independent of any subsequent factual claims. The primary source documents I include in this post stand as useful evidence independent of any new evidence that gets introduced, and would have materially changed the interpretation of every one of the points in the section you dispute.</p>\n<p>I stand by my post, and its timing, in full.</p>\n", "parentCommentId": "BZYjhixEiLqkcorrm", "user": {"username": "TracingWoodgrains"}}, {"_id": "jBhEptKPzKjvXsrqb", "postedAt": "2023-12-19T17:26:43.150Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p><i>(I do also want to clarify that Me and Ben were somewhat ironically not shared on this post in advance, and I would have left comments with evidence falsifying at least one or two of the claims)</i><br><br>I agree that you probably should have had the chance to review the post (noting what TracingWoodgrain has said makes me a little less certain of this, though I still believe it)<br><br>I also think that most people, myself included, would be happy to read your comments now if you want to share them.</p>", "parentCommentId": "BZYjhixEiLqkcorrm", "user": {"username": "Peterslattery"}}, {"_id": "fMrJLQiZpzLRzL7bE", "postedAt": "2023-12-19T17:27:35.191Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>The great majority of my post focuses on process concerns. The primary sources introduced by Nonlinear are strong evidence of why those process concerns matter, but the process concerns stand independent. I agree that Nonlinear often paraphrased its subjects before responding to those paraphrases; that's why I explicitly pulled specific lines from the original post that the primary sources introduced by Nonlinear stand as evidence against.</p>\n<p>My ultimate conclusion was and is explicitly not that Nonlinear is vindicated on every point of criticism. It is that the process was fundamentally unfair and fundamentally out of line with journalistic standards and a duty to care that are important to uphold. Not everyone who is put in a position of needing to reply to a slanted article about them is going to be capable of a perfectly rigorous, even-keeled, precise response that defuses every point of realistically defusable criticism, which is one reason people should not be put in the position of needing to respond to those articles.</p>\n", "parentCommentId": "FnXsMrrYTxxMfzjxy", "user": {"username": "TracingWoodgrains"}}, {"_id": "kpySEoM5kk5uf88tW", "postedAt": "2023-12-19T17:29:00.483Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thank you for explaining all of this.<br><br>If it is ok, can you please clarify what you said here because I am not sure if I properly understand it: \"in our direct messages about this post prior to publication, provided a snippet of a private conversation about the ACX meetup board decision where you took a maximally broad interpretation of while I had limited ways of verifying, pressured me to add it as context to this post in a way that would have led to a substantially false statement on my part, then admitted greater confusion to a board member while saying nothing to me about the same, after which I reconfirmed with the same board member that the wording I chose was accurate to his perception.\"</p>", "parentCommentId": "hLkTHrfWDR9pzQSo6", "user": {"username": "Peterslattery"}}, {"_id": "bacsbiXT43fGfiFiE", "postedAt": "2023-12-19T17:36:47.036Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>I appreciate that you publicly update when you get things wrong, but the frequency with which you make these mistakes serves as strong evidence to me that I had sufficient information to make this post.</p></blockquote><p>I find myself confused about why you think this line of reasoning goes through in this case, but is something that you vehemently object to in the case of Ben's post. To be clear, there are lots of ways these situation are disanalogous, but it still feels somewhat contradictory to me with the other principles about process outlined in the post.</p><p>I also want to again emphasize that I am really not the right counterparty here. Ben is the person who has far more context on the relevant details, and is far more knowledgeable on this than I am, and indeed my first paragraph in our DM conversation was me asking you to please not generalize from my level of knowledge and rate of error to Ben's knowledge and rate of error. We are not in the same reference class in terms of knowledge about this situation. Ben however is and should be quite busy gathering evidence and writing a follow-up response to Nonlinear, and so it's mostly me commenting so far.&nbsp;</p><hr><p>Some quick responses to your bullet list:&nbsp;</p><blockquote><p><a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=7bFGyqEa6mbSrmpfv\">incorrectly claimed Nonlinear might be sponsored by Rethink Priorities</a>, which you subsequently retracted.</p></blockquote><p><a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=wQ3YZFTaMatPkgkbm\">It appears to be consensus in that thread</a> that I followed proper procedure by first asking a Rethink Priorities board member, who sure seemed to confirm what I said.</p><blockquote><p><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=sid5NsbnFZ2JLhYnZ\">incorrectly described the nature of people you talked with around Nonlinear</a>, for which you subsequently apologized.</p></blockquote><p>Yep, I am sorry for not being clear here. It was not a load-bearing part of my argument, and I updated afterwards that I will write things less quickly in these threads (to provide context for readers, in a paragraph focused on the effort Lightcone put into this investigation I said \"talked to dozens of people who worked at Nonlinear\" instead of \"talked to dozens of people who worked with the relevant people at Nonlinear\", which I agree is an important thing to get right, but it really was just an honest mistake as I was writing quickly and it wasn't intended to be any kind of new information, just a summary of known information).&nbsp;</p><p>I really don't think this has much to do with the degree to which Ben and me would have been able to provide evidence relevant to your claims.</p><blockquote><p><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=y3AP5N8xYcxc3eHqd\">made likely-incorrect assumptions about libel law</a>, which I subsequently clarified.</p></blockquote><p>I don't see any incorrect assumptions about libel law here. I continue to think that a libel suit against the original post had little chance of succeeding. You are linking here to one sentence, which is not claiming to be comprehensive in any way. I agree that simply stating your epistemic status or citing you sources alone does not protect you from libel (though both are likely to help in most circumstances).</p><blockquote><p>in our direct messages about this post prior to publication, provided a snippet of a private conversation about the ACX meetup board decision where you took a maximally broad interpretation of while I had limited ways of verifying, pressured me to add it as context to this post in a way that would have led to a substantially false statement on my part, then admitted greater confusion to a board member while saying nothing to me about the same, after which I reconfirmed with the same board member that the wording I chose was accurate to his perception.</p></blockquote><p>This feels like a misrepresentation, but also doesn't seem worth litigating. My primary response was \"Happy to get into a DM chat with you and the panel members if you want to follow-up more on this\".</p><blockquote><p>agreed that the claim about vegan food as written, which Spencer tried to correct prior to publication, was substantially incorrect.</p></blockquote><p>This part is correct. I also think post-publication I don't think I defended those claims as correct (after Kat had shared more substantial screenshots, which did update me).&nbsp;</p><p><i>(Edit: forgot this one on my first pass, quick comment just to be comprehensive:</i></p><blockquote><p><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=jwCQiZFjAvtgotmGv\"><i>incorrectly predicted what journalists would think of your investigative process</i></a><i>, after which we collaborated on a hypothetical to ask journalists, all of whom disagreed with your decision.</i></p></blockquote><p><i>I really appreciate you doing this and reaching out! For what it's worth, I think saying that \"all of whom disagreed with my decision\" is not an accurate summary of quotes like:&nbsp;</i></p><blockquote><p><i>On the request for more time for right to reply, that’s a judgement call—is this a fair period for the allegations involved, or time wasting? It’s not unknown for journalists to put in a right to reply on serious allegations, and the subject ask for more time, and then try to get ahead of the story by breaking it themselves (by denying it).</i></p></blockquote><p><i>I think the responses you received are very interesting, but I don't think that's accurately summarized as \"all of whom disagreed with your decision\".)</i></p>", "parentCommentId": "hLkTHrfWDR9pzQSo6", "user": {"username": "Habryka"}}, {"_id": "MYAABukErLwsuttsb", "postedAt": "2023-12-19T17:46:15.151Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>All of those are reasonable options. The money Ben paid to sources would go a long way towards hiring a professional—it's almost as much as I make in my (part-time) journalism-adjacent work in a year.</p>\n<p>Like I say, I'm not averse to citizen journalism and it would be incredibly hypocritical of me if I was.  There's a lot amateurs can do in this sort of thing, but I think it requires willingness to act as something other than prosecutor—or, if you see yourself only able to act as prosecutor, to provide your evidence to a neutral third party who can get the other side of things.</p>\n<p>Electing a group puts a lot of pressure on that group, but it's approximately what any large enough organization seems to do to handle misconduct allegations and has the advantage of allowing clear and predictable structure.</p>\n", "parentCommentId": "6zFqDCwumpoGAm5AH", "user": {"username": "TracingWoodgrains"}}, {"_id": "NmZe5nohEQEQYyuYn", "postedAt": "2023-12-19T18:03:06.195Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>I find myself confused about why you this line of reasoning goes through in this case, but is something that you very vehemently object to in the case of Ben's post.</p>\n</blockquote>\n<p>I'm confused at your confusion. I have strong concerns about the process behind Ben's post, and see a similar process at work in some of your comments. I am careful about the specific factual claims I make and respond to.</p>\n<p>I recognize that you're not the right counterparty for Nonlinear's specific claims, but I do think you're in as much of a position to address my process concerns as Ben is. When responding to my post, you passed over the bullet point addressing the hypo I ran, which forms a key part of my process argument as a whole. I respect people's right to respond or not respond to whichever conversations they want, but since the process is at the core of my point and that part was preregistered by both of us and is directly material to process, I do think it's the most germane.</p>\n<blockquote>\n<p>I also think post-publication I don't think I defended those claims as correct (after Kat had shared more substantial screenshots, which did update me).</p>\n</blockquote>\n<p>I appreciate that. If nothing else, I think this establishes that those claims should not have made it into the original post.</p>\n<p>I share your uncertainty about litigating the other sub-points further, but think they're important indicators of why I was comfortable making the post when I did and informing you of publication but not sharing in full. The bulk of the post and the core of the argument within it was repurposed from our public conversations. I shared the section that introduced new information (the ACX meetup part) with you and you fact-checked it. You referenced specific parts of Kat's evidence you contested, which I checked with my own writing on those pieces of evidence, concluded I was still comfortable with those sections, and maintained.</p>\n", "parentCommentId": "bacsbiXT43fGfiFiE", "user": {"username": "TracingWoodgrains"}}, {"_id": "HjGsjLRr5WYBLKdg4", "postedAt": "2023-12-19T18:08:33.215Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>After checking with Oliver, my impression is that to properly detail that section would require sharing non-public information we would need another party's permission to share. Given that and the degree to which litigating it could derail things, I'll simply say that the core takeaway should be that I shared part of the post with Oliver prior to publication and we had a confusing and somewhat frustrating conversation about it, and that the bulk of the post contained arguments we had already been litigating in the public sphere.</p>\n", "parentCommentId": "kpySEoM5kk5uf88tW", "user": {"username": "TracingWoodgrains"}}, {"_id": "uaBmMHMoAoM7fHcKG", "postedAt": "2023-12-19T18:11:27.388Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Appreciate your response. I have more thoughts, but am probably not going to comment much further for a while, unless there is a lot more activity on this post.</p><blockquote><p>I recognize that you're not the right counterparty for Nonlinear's specific claims, but I do think you're in as much of a position to address my process concerns as Ben is.</p></blockquote><p>I do think this is definitely not true. I know much less about the process that gave rise to Ben's post than Ben does. I have a high-level overview, and I made decisions at a very high level of \"how much time to allocate to this investigation\", but when it comes to details like:&nbsp;</p><ul><li>what exactly happened for fact-checking purposes,&nbsp;</li><li>how much different claims are backed up by primary sources vs. witness accounts,&nbsp;</li><li>how much private evidence there is that didn't make it into the post,&nbsp;</li><li>what the exact tradeoffs were for delaying vs. not-delaying,&nbsp;</li><li>how much it seemed like Nonlinear was bluffing vs. being real about promising to provide counter-evidence in a week&nbsp;</li></ul><p>that is stuff that Ben has substantially more information on than I have, all of which seem relevant to the claims made in your post.&nbsp;</p><p>I am trying my best to share what information I have, mostly to free up time for Ben to do a more substantial response to the full post. But please don't mistake my knowledge here for anything remotely as thorough as where Ben is at. I expect his comments on process to also be substantially superior to mine.&nbsp;</p>", "parentCommentId": "NmZe5nohEQEQYyuYn", "user": {"username": "Habryka"}}, {"_id": "Afz6dYFqvmgNq7LeY", "postedAt": "2023-12-19T18:13:55.680Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Perfectly reasonable. I appreciate your engagement and look forward to Ben's response.</p>\n", "parentCommentId": "uaBmMHMoAoM7fHcKG", "user": {"username": "TracingWoodgrains"}}, {"_id": "DHAmrckF97f8zdy6c", "postedAt": "2023-12-19T18:48:53.082Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Just to clarify, the only section that was shared with me was the following:&nbsp;</p><blockquote><p>You don't even have to look as far as my examples, though. To his credit, Oliver <a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=6aRaBeN7TKhaNECQ7\">repeatedly</a> <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=5MLPKedkNdcwkyDcr\">asked</a> for better examples of what to do in similar situations. To the credit of the rationalist community, it contains some of those examples. To Oliver's discredit, however, he had full awareness of one better example, as his response to allegations of community misconduct was one of its subjects of investigation.</p><p>Last year, a rationalist meetup organizer faced accusations of misconduct, Oliver and his wife Claire (who was in charge of meetup organization as a whole) banned him from an event, he objected, and Claire agreed to be bound by a community investigation. One principle used in that investigation is worth highlighting:</p><blockquote><p>Anyone accused of misconduct should promptly be informed of any accusations made against them and given an opportunity to tell their side of the story, present evidence, and propose witnesses. Emergency preliminary actions should be taken where allegations are sufficiently serious and credible, but the accused should be given an opportunity to defend themselves as quickly as possible.<a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went#fn7n9mnmzsc9\"><sup>[16]</sup></a></p></blockquote><p>In the end, the team writing the report highlighted several specific allegations against its primary subject before including a telling line:</p><blockquote><p>We were unable to substantiate any other allegations made against [redacted]. At his request, we are not repeating unsubstantiated allegations in this document.</p></blockquote><p>A prudent decision.</p></blockquote><p>I pointed out one concrete error in the relevant section (which Tracing corrected), and then said some other stuff about the panel's relationship to that section.</p><p>Mostly want people to not walk away with the impression that I saw the whole post, or any substantial fraction of it, which would directly contradict a point I made in another comment.</p>", "parentCommentId": "HjGsjLRr5WYBLKdg4", "user": {"username": "Habryka"}}, {"_id": "3zMzGmZShyeEPuRGk", "postedAt": "2023-12-19T18:57:12.445Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thank you for this. I think Nonlinear made several poor stylistic choices in their response, which likely resulted in many people giving up on reading their post before seeing the evidence against some of Ben Pace's egregious claims. Your post does a better job of clearly and forcefully arguing that Ben Pace's post was misguided than their response did.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "LqkdXeukWGDKWr7id", "postedAt": "2023-12-19T19:08:07.839Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>The 'stylistic choices' were themselves evidence of wrongdoing, and most of their evidence against claims both misstated the claims they claimed to be refuting and provided further (unwitting?) evidence of wrongdoing.</p>", "parentCommentId": "3zMzGmZShyeEPuRGk", "user": {"username": "Czynski"}}, {"_id": "5jBvhp7bTmrfgJtLr", "postedAt": "2023-12-19T19:10:47.878Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I can confirm this is accurate. More fully:</p>\n<p>I shared the full post with a member of the panel, a CEA community health team representative, and several others who seemed well positioned to give good feedback prior to publication and made several adjustments based on their feedback.</p>\n<p>Seeing that the local norm is to inform people of substantial responses before providing them, I told Ben and Oliver I would be providing a response that pulled together much of what I had been litigating in Oliver with public and brought in the ACX meetup dispute details and a bit more. Oliver wanted to see the meetup section, so I shared it, and he warned that specific factual allegations might be incorrect pending more information they gave (with a couple of examples) so I investigated those factual claims to ensure nothing I said contradicted what he was saying (which it did not).</p>\n<p>Oliver corrected one point I'd misread in that section before going into the confusing and frustrating conversation I refer to.</p>\n<p>Given that conversation, our prior conversations, and his prior public statements, I felt (and continue to feel) that I had enough to establish all that needed to be established in my post.</p>\n", "parentCommentId": "DHAmrckF97f8zdy6c", "user": {"username": "TracingWoodgrains"}}, {"_id": "C3Gggr6hcNnexJi9h", "postedAt": "2023-12-19T19:14:25.632Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Glad to hear it! I agree with your assessment of the stylistic choices—part of the goal in my post was to divorce those stylistic choices (which I read primarily as evidence of the difficulty of responding with precision under community pressure and during a time of intense stress) from the new concrete evidence that was provided.</p>\n", "parentCommentId": "3zMzGmZShyeEPuRGk", "user": {"username": "TracingWoodgrains"}}, {"_id": "XxHBHMhrnK5Md9b4q", "postedAt": "2023-12-19T19:32:27.471Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>the section 'Avoidable, Unambiguous Falsehoods' contains <strong>mostly</strong> claims that are, to the best of my knowledge, not actually falsehoods, but are correct</p></blockquote><p>(Emphasis mine)</p><p>Even if your claim is correct, that doesn't make the situation much better. It's not sufficient for <i>most</i> of the egregious claims Ben Pace made to have been correct -- a single false and egregious claim can be very damaging and constitute libel.</p>", "parentCommentId": "BZYjhixEiLqkcorrm", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "qqJyHp3AEqsjxAKMJ", "postedAt": "2023-12-19T19:37:15.818Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>If you have time, can you provide some examples of what you saw as evidence of wrongdoing?&nbsp;<br><br>I feel that much of what I saw from my limited engagement was a valid refutation of the claims made. For instance, see the examples given in the post above.<br><br>There were responses to new claims and I saw those as being about making it clear that other claims, which had been made separately from Ben's post, were also false.<br><br>I did see some cases where a refutation and claim didn't exactly match, but I didn't register that as wrongdoing (which might be due to bias or not realising the implications of the changes etc)<br><br>Also, are you sure it is fair to claim that <i>most </i>evidence they provided misstated the claims and provided evidence of wrong doing? Was it really most of the evidence, or just (potentially) some of it?</p>", "parentCommentId": "LqkdXeukWGDKWr7id", "user": {"username": "Peterslattery"}}, {"_id": "eWJJyeB36qfow2YKY", "postedAt": "2023-12-19T19:38:24.630Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>A few weeks later, the article writer pens a triumphant follow-up about how well the whole process went and offers to do similar work for a high price in the future.</p></blockquote><p>I think this is meant to be the fantasy version of <a href=\"https://www.lesswrong.com/posts/AggYFFvFHfh2WWZiv/closing-notes-on-nonlinear-investigation\">Closing Notes on Nonlinear Investigation</a>, where Ben writes,</p><blockquote><p>I don't really want to do more of this kind of work. Our civilization is hurtling toward extinction by building increasingly capable, general, and unalignable ML systems, and I hope to do something about that. Still, I'm open to trades, and my guess is that if you wanted to pay Lightcone around $800k/year, it would be worth it to continue having someone (e.g. me) do this kind of work full-time. I guess if anyone thinks that that's a good trade, they should email me.</p></blockquote><p>I understand that you're taking liberties for your allegory in imagining a \"triumphant follow-up\", but I think it's worth being clear that the actual follow-up all but states that this was a miserable experience and not worth the time and effort:</p><blockquote><p>I did not work on this post because it was easy. I worked on it because I <i>thought it would be easy</i>. I kept wanting to just share what I'd learned. I ended up spending about ~320 hours (two months of work), over the span of six calendar months, to get to a place where I was personally confident of the basic dynamics (even though I expect I have some of the details wrong), and that Alice and Chloe felt comfortable with my publishing.</p><p>On June 15th I completed the first draft of the post, which I'd roughly say had ~40% overlap in terms of content with the final post. On Wednesday August 30th, after several more edits, I received private written consent from both Alice and Chloe to publish. A week later I published.</p><p>I worked on this for far too long. Had I been correctly calibrated about how much work this was at the beginning, I likely wouldn't have pursued it. But once I got started I couldn't see a way to share what I knew without finishing, and I didn't want to let down Alice and Chloe.</p></blockquote><p>The high price communicates how little Ben wants to do this again, not that he thinks he did something that others should value at that price.</p>", "parentCommentId": null, "user": {"username": "Muireall"}}, {"_id": "qMQr9paoFQTfJ9kNY", "postedAt": "2023-12-19T20:03:31.369Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I agree that some false and egregious claims can do this. I contend that none of the things that I expect will end up actually falsified will turn out to be in such a category. We can dig more into this when the relevant evidence is presented.</p>", "parentCommentId": "XxHBHMhrnK5Md9b4q", "user": {"username": "Habryka"}}, {"_id": "kjRpEriKmyS8LyS56", "postedAt": "2023-12-19T20:05:37.983Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Someone can be at once exhausted and triumphant after completing a major, complicated, lengthy process, and that combination of tones is what I took from the post. See eg:</p>\n<blockquote>\n<p>When I saw on Monday that Chloe had decided to write a comment on the post, I felt a sense of \"Ah, the job is done.\" That's all I wanted.</p>\n</blockquote>\n", "parentCommentId": "eWJJyeB36qfow2YKY", "user": {"username": "TracingWoodgrains"}}, {"_id": "t4a8KKFtrboftw2uQ", "postedAt": "2023-12-19T20:15:03.153Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Just to provide the full quote, since I think it's kind of confusing standing on its own:&nbsp;</p><blockquote><p>I worked on this for far too long. Had I been correctly calibrated about how much work this was at the beginning, I likely wouldn't have pursued it. But once I got started I couldn't see a way to share what I knew without finishing, and I didn't want to let down Alice and Chloe.</p><p>My goal here was not to punish Nonlinear, per se. My goal was to get to the point where the accusations I'd found credible could be discussed, openly, at all.&nbsp;</p><p>When I saw on Monday that Chloe had decided to write <a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear?commentId=gvjKdRaRaggRrxFjH\">a comment</a> on the post, I felt a sense of \"Ah, the job is done.\" That's all I wanted. For both sides to be able to share their perspective openly without getting dismissed, and for others to be able to come to their own conclusions.</p><p>I have no plans to do more investigations of this sort. I am not investigating Nonlinear further. If someone else wants to pick it up, well, now you know a lot of what I know!</p></blockquote>", "parentCommentId": "kjRpEriKmyS8LyS56", "user": {"username": "Habryka"}}, {"_id": "4cnStzTF9mmjxqzKg", "postedAt": "2023-12-19T20:21:37.586Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Most people in Ben's shoes won't have access to resources like those of Lightcone. So I think that is more a response to a narrower version of Peter's question (what someone similarly situated to Ben and Oli should do in an analogous situation) than it is to the broader reading of the question.</p><p>It's not clear to me how much professional time would have been needed for a full and fair investigation of this matter; do you have a sense of what the going rate for work like this would be?</p>", "parentCommentId": "MYAABukErLwsuttsb", "user": {"username": "Jason"}}, {"_id": "noJJbk2W28qAtvCZa", "postedAt": "2023-12-19T20:33:54.472Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I have many other investigations I would like to see happen, so if there is a way to buy this as a service, in a way that will produce decent investigations, then I would very gladly pay substantial sums of my personal money for this.&nbsp;</p><p>We did go around and ask many other people whether they would be willing to take on this investigation, all of which declined, but we didn't explore the option of paying a large sum directly for this, and I at least don't have any contacts for people I expect would be willing to do this.</p><p>If you have any references to people who could be paid to do this kind of work in a high-integrity way, I would really love to be put in touch with them.</p>", "parentCommentId": "MYAABukErLwsuttsb", "user": {"username": "Habryka"}}, {"_id": "xZwHTGqAr2TTNiaGy", "postedAt": "2023-12-19T20:48:28.394Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I don't, no. Obviously it could stretch almost arbitrarily high, but I expect there are competent people who would tackle it for $50-$100/hour, for example. It's also pretty common for journalists who take interest in a topic to pursue it of their own initiative, but they have their own incentives and work (indeed, must work) towards different goals than the people who tip them off to things.</p>\n<p>The broader reading is hard to answer because people vary wildly in their skills, interests, and resources. If I were advising myself, for example, I would say \"Start poking around and see what pops up,\" because that's what I've always done. If I were advising someone with lots of money but little time, I would say \"Spend your money to find someone with more time,\" because that seems like a pretty universal problem-solver. If I were advising someone with a large public presence, I would say \"Call in a few favors from people you know,\" because reputation is power.</p>\n<p>Let's go for the purest case, though: a random community member with little experience, money, or presence. The most important thing is finding somebody credible who has those. You can try tipping leads to trustworthy journalists (yeah yeah, I know) who operate close to that area, sharing concerns in private with more influential members of your community to see if any of them can lead things off, or simply saying whatever you have hard evidence of in a public forum and seeing where it leads. The ultimate goal is, I'd say, always to find someone with the time and capacity to look into things in depth and with balance, as much as is realistic given the situation. That can be a pretty constrained group, which is why large organizations usually end up having dedicated positions for that sort of thing, but that's the ideal.</p>\n", "parentCommentId": "4cnStzTF9mmjxqzKg", "user": {"username": "TracingWoodgrains"}}, {"_id": "GWjd9rQ7Tp3uejpNj", "postedAt": "2023-12-19T21:22:11.380Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think that's right, but this case seems to present a strong case for actual legal defamation. I saw the threat of a libel suit as credible, and I won't be surprised if one gets filed</p>", "parentCommentId": "PvCK2FHNsXYrQwy7w", "user": {"username": "Within Reason"}}, {"_id": "FD4EsGxQ4vuBuK9wg", "postedAt": "2023-12-19T21:25:48.474Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>incorrectly claimed Nonlinear might be sponsored by Rethink Priorities, which you subsequently retracted.</p>\n</blockquote>\n<p>This one seems unfair to include: he confirmed with a Rethink Priorities board member over texts first.</p>\n", "parentCommentId": "hLkTHrfWDR9pzQSo6", "user": {"username": "Jeff_Kaufman"}}, {"_id": "39MEZKzexhJzdMvfF", "postedAt": "2023-12-19T21:42:43.048Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>I continue to think that a libel suit against the original post had little chance of succeeding.</p>\n</blockquote>\n<p>Place <a href=\"https://manifold.markets/JeffKaufman/would-nonlinear-win-a-libel-suit-ag\">your bets</a>!</p>\n", "parentCommentId": "bacsbiXT43fGfiFiE", "user": {"username": "Jeff_Kaufman"}}, {"_id": "RAjE3jGAWr9grMfxP", "postedAt": "2023-12-19T22:29:27.205Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I'm not a fan of the fact that this market resolves YES if there's a settlement. A settlement is not an admission of guilt. Lawyers often tell defendants to settle lawsuits even if they're completely innocent. So this market mostly captures whether NL would get some financial compensation from the lawsuit, not whether Lightcone/Ben would be found liable for defamation.</p>", "parentCommentId": "39MEZKzexhJzdMvfF", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "kJJ7Hbo6zxHZtTKyF", "postedAt": "2023-12-19T23:11:59.479Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>TracingWoodgrains - thanks for an excellent post. I think it should lead many EAs to develop a new and more balanced perspective on this controversy.&nbsp;</p><p>And thanks for mentioning my EA Forum comments about Ben Pace doing amateur investigative reporting -- reporting that doesn't seem, arguably, to have lived up to the standards of basic journalistic integrity (regardless of how much time he and the Lightcone team may have put into it.)</p><p>This leaves us with a very awkward question about the ongoing anonymity of 'Alice' and 'Chloe', and I don't know what the right answer is about this issue, but I'm curious what other EAs think.</p><p>We seem to be in a situation where two disgruntled ex-employees of an EA organization coordinated to spread very harmful, false or highly exaggerated claims about the organization with the deliberate intent of slandering it and harming its leaders. They convinced someone with power and influence in the community to spend a lot of time confirming their claims, writing a highly negative public report, and paying them as whistleblowers/informants. Later, the slandered organization published a long refutation of the ex-employees' claims, showing that many of them were false or highly exaggerated.</p><p>Yet the key figures in this whole EA community drama, 'Alice' and 'Chloe', remain absent from the discussion -- ghostly presences that, apparently, must be treated as blameless, as if they were innocent, virtuous, righteous whistle-blowers with no moral agency or accountability of their own. They have the luxury of remaining behind a cloak of anonymity, despite their apparently false allegations. But I'm not sure why.</p><p>I don't know who 'Alice' and 'Chloe' are. I haven't tried to find out. Someone once mentioned their real-world identities to me in passing, but I've tried to forget them, and I have no intention of sharing them.</p><p>But here's the thing.&nbsp;</p><p>If I was running an EA organization, I would really want to know the names of any EA-involved people who seem willing to spread false, exaggerated, harmful, and slanderous claims about their former employers. I would not want to hire such people. And I would be furious if I did hire them, in ignorance of their previous slanders, and then they did the same thing to my organization that they did to their former organization -- all while being protected by EA's cloak of anonymity.&nbsp;</p><p>So, what do you all think? If anonymous 'whistleblowers' turn out to have made a lot of false, highly exaggerated, and/or highly harmful claims about EA people and organizations, should their anonymity remain protected? Or would it be in the general interests of the EA movement, and other EA organizations that they might work for in the future, for their names to be known, and for their actions to be held accountable?</p><p>I honestly do not know the right ethical line to take on this anonymity issue. But I'm raising it because it seems very odd that nobody else seems to be.&nbsp;</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "8KHbixGyYKQd6z3zP", "postedAt": "2023-12-19T23:12:39.773Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Would there be a monetary settlement threshold which would capture the idea of LC/Ben losing?</p>\n", "parentCommentId": "RAjE3jGAWr9grMfxP", "user": {"username": "Jeff_Kaufman"}}, {"_id": "RpE4P6RpcpE8ndbgz", "postedAt": "2023-12-19T23:13:09.147Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>The beauty of Manifold is that you can make your own competing market with resolution criteria you find preferable.</p>\n<p>I am sympathetic to this view, but there is a settlement dollar figure at which I think a market should resolve to YES rather than N/A. I don't know what it should be, but treating (e.g.) the massive Fox News / Dominion settlement as N/A doesn't track the spirit of the market either. A big enough settlement is a de facto admission of very probable loss if trial happened.</p>\n", "parentCommentId": "RAjE3jGAWr9grMfxP", "user": {"username": "Jason"}}, {"_id": "qtvynA9CSETJPQq6T", "postedAt": "2023-12-19T23:16:44.631Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Hard to discern what that threshold would be.  In a field where damage claims are more grounded in facts (e.g., medical malpractice), I'd suggest a percentage of the damages claimed in the complaint. But alleged defamation damages tend to be hyberbole.</p>\n", "parentCommentId": "8KHbixGyYKQd6z3zP", "user": {"username": "Jason"}}, {"_id": "3bjbtcygyvaBuTmiq", "postedAt": "2023-12-19T23:25:03.883Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>You’re right that that’s useful context to include. It weakens the signal of that example (and I’ll edit accordingly) but, I would argue, not so much that the example is worth excluding altogether.</p>\n", "parentCommentId": "FD4EsGxQ4vuBuK9wg", "user": {"username": "TracingWoodgrains"}}, {"_id": "C7kfzwZa5rrT8BeXN", "postedAt": "2023-12-19T23:28:55.088Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Whistleblower anonymity should remain protected in the vast majority of situations, including this one, imo</p>\n", "parentCommentId": "kJJ7Hbo6zxHZtTKyF", "user": {"username": "Khorton"}}, {"_id": "LQazeB86F9M9ovtzu", "postedAt": "2023-12-19T23:42:08.885Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Good question. Let me think on it.</p>\n<p>The answer I’m tempted towards is, of course, “Me”—for things that can be done remotely, at least. It’s something I’ve done professionally only in the context of podcast production and I don’t want to claim extraordinary experience or overstate my qualifications, but I do think I have a few unusual traits that make me well-suited for that sort of thing and it’s a process I take seriously.</p>\n<p>Part of why I hesitate there is that I can’t do anything near-future (next five months or so) due to my commitments and don’t want to throw my hat in a ring where I’m too busy to ever do anything, but it’s a general style of work I enjoy and am open to.</p>\n<p>I prefer to do more than idly self-promote, though—I’ll consider the question further.</p>\n", "parentCommentId": "noJJbk2W28qAtvCZa", "user": {"username": "TracingWoodgrains"}}, {"_id": "KyNXPKBrAJarqkCF4", "postedAt": "2023-12-19T23:56:38.547Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Small sidenote that my guess is most people are modeling but still seemed good to make explicit: That market only resolves if Nonlinear does indeed file a suit. My current guess is it's very unlikely for them to sue, and the world in which they sue are of course the worlds where it's most likely they would win.&nbsp;</p><p>This means this market does not measure the probability of a libel suit against the original post succeeding, but only of it succeeding conditional on Nonlinear deciding to go ahead with such a suit, which I think increased the probability a lot.</p>", "parentCommentId": "39MEZKzexhJzdMvfF", "user": {"username": "Habryka"}}, {"_id": "aHQsojR3zLed7657p", "postedAt": "2023-12-20T00:02:07.948Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Good point to make explicit!</p>\n", "parentCommentId": "KyNXPKBrAJarqkCF4", "user": {"username": "Jeff_Kaufman"}}, {"_id": "cxDGdS5sxvyShLiAp", "postedAt": "2023-12-20T00:17:26.890Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Even if the whistleblowers seem to be making serial false allegations against former employers?</p><p>Does EA really want to be a community where people can make false allegations with total impunity and no accountability?&nbsp;</p><p>Doesn't that incentivize false allegations?</p>", "parentCommentId": "C7kfzwZa5rrT8BeXN", "user": {"username": "geoffreymiller"}}, {"_id": "ehySCnn9RhT524KuJ", "postedAt": "2023-12-20T00:27:45.609Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Has there been a suggestion that Chloe has made serial false allegations against former employers? I thought that was only Alice.</p>\n", "parentCommentId": "cxDGdS5sxvyShLiAp", "user": {"username": "bec_hawk"}}, {"_id": "5xspEb8EAcq2siDes", "postedAt": "2023-12-20T00:31:20.636Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>There's a unilateralist's curse issue here -- if there are (say) 100 people who know the identities of Alice and Chloe, does only one of them have to decide breaching the psuedonyms would be justified?</p>\n<p>[Edit to add: I think the questions Geoffrey is asking are worthwhile ones to ask. I am just struggling to see how an appropriate decision to unmask could be made given the community's structure without creating this problem. I don't see a principled basis for declaring that, e.g., CHSP can legitimately decide to unmask but everyone else had better not.]</p>\n", "parentCommentId": "cxDGdS5sxvyShLiAp", "user": {"username": "Jason"}}, {"_id": "kvDRjxotGrYJjui6P", "postedAt": "2023-12-20T00:33:46.392Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p><strong>Short answer:</strong> I think Ben should defer to the community health team as to whether to reveal identities to them or not (I'm guessing they know). And probably the community health team should take their names and add it to their list where orgs can ask CH about any potential hires and learn of red flags in their past. I think Alice should def be included on that list, and Chloe should maybe be included (that's the part I'd let the CH team decide if it is was bad enough). It's possible Alice should be revealed publicly, or maybe just revealed to community organizers in their locale and let them make the decision of how they want to handle Alice's event attendance and use of community resources.<br><br><strong>Extra answer:</strong> FWIW I already have bad feelings about CEA's hardcore commitment to anonymity. I do feel EA is too hard on that side, where for example, people accused of things probably won't even be told the names of their accusers or any potentially-identifying details that make accusations less vague. The only reason NL knew in this situation is because the details make it unavoidable that they'd know. But otherwise the standard across EA is that if you are accused of something via CEA's community health team, you will never know who makes the critiques, and therefore will never be able to properly rebut them. And if that is how <i>this</i> had gone down, it would have been Kat and Emerson getting their names on CEA's blacklist. I think this default justice system of this community is messed up, and there should be <i>some</i> exceptions in theory.</p><p>That said, I'm not sure this is one of those exceptions. I feel kind of conflicted about revealing their names even in this extreme case, because I have also had a weird employment experience in EA with an atypical structure, after which I felt emotionally wounded, and if someone had come to me and said \"We suspect your ex-employer may be unethical and causing repeated serious harms! So I am asking you and others for all the details they can remember that made you feel bad in that situation\" there is some likelihood I would share my experiences, rather than say my actual thought-through POV which is \"No I actually don't blame or hold ill will to my ex-employers and I won't participate in any investigation against them. It was a complex situation and we all made mistakes\". In most cases I would not \"sing\" per se, but in some universes I surely would. Just because I was asked. Incidentally this parallels how I feel about the women in the sexual misconduct TIME piece too. It's gotta be hard to not add to a (maybe false but also maybe true) narrative when you are literally asked to and commended for doing so? Most of us trust people who put themselves in that sort of investigator position.</p><p>I'm sure many readers who are shocked at Alice or Chloe now would, if asked, start singing if they had been in their position, thinking they are doing something useful as they are being so encouraged, after all, even if at first they felt conflicted. Even if they had felt conflicted about it for a year prior. Even if they were almost over it, and their mental health and humility were improving, wouldn't being suddenly told \"no you really might be a victim, please share, in fact I'm talking to another victim too\" sort of.. undo that? Especially if they are working on mental health problems, I imagine it would feel soo temptingly cathartic and be hard to say no to a narrative that just <i>might </i>make you the hero, just <i>might </i>help someone else, for everything else you feel you lost. Does that make it their fault that they bit the bait? Or is it more the \"fault\" (or simply, \"result\") of how the investigation was done?</p><p>I do agree that orgs should be able to factor this whole debacle into their decision if they end up about to hire Alice or even Chloe. CEA's private list should mostly solve that problem. But my opinion on revealing names publicly beyond that hinges a lot on how the investigation kicked off. How much did Ben have to search and push to get them to say all that? What framing did he use? How much were they slandering NL before Ben even reached out, and was it about egregious or very important things? Was NL's reputation unfairly damaged by Alice <i>or</i> Chloe before this investigation even kicked off? I would like to hear more of his thoughts on that.. with no judgement toward him for the past, because it is so critical that the community come together and discuss honestly and collaboratively what happened here.</p>", "parentCommentId": "kJJ7Hbo6zxHZtTKyF", "user": {"username": "Ivy_Mazzola"}}, {"_id": "4krbLstnzNBtXNq26", "postedAt": "2023-12-20T00:39:04.691Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>So, what do you all think?</p></blockquote><p>I <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=LyJERRGdzhZqmsgbb\">continue to think</a> that something went wrong for people to come away with takes that lump together Alice and Chloe in these ways.&nbsp;</p><p>Not because I'm convinced that Alice is as bad as Nonlinear makes it sound, but because, <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=qPAAsbfpCkwtQmKAq\">even based on Nonlinear's portrayal</a>, Chloe is portrayed as having had a poor reaction to the specific employment situation, and (unlike Alice) <i>not</i> as having a general pattern/history of making false/misleading claims. That difference matters immensely regarding whether it's appropriate to warn future potential employers. (Besides, when I <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=Hvgt3ntx6bdLj7oFe\">directly compare</a> Chloe's writings to Nonlinear's, I find it more likely that they're unfair towards her than vice versa.)</p><p>FWIW, I'm not saying that coming away with this interpretation is all your fault. If someone is only skim-reading Nonlinear's post, then I can see why they might form similarly negative views about both Alice and Chloe (though, on close reading, it's apparent that also Nonlinear would agree that there's a difference). My point is that this is more a feature of their black-and-white counterattack narrative and not so much appropriate for what I think most likely happened.</p>", "parentCommentId": "kJJ7Hbo6zxHZtTKyF", "user": {"username": "Lukas_Gloor"}}, {"_id": "9nShRibjeu6C5y2uq", "postedAt": "2023-12-20T00:46:47.632Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>How would you define the set of circumstances that are not in the \"vast majority\"? My initial reaction is vaguely along the lines of: lack of good faith + clear falsity of at least the main thrust of the accusation + lack of substantial mistreatment of the psuedonymous person by their target. But how does one judge the good faith of a psuedonym?</p>\n", "parentCommentId": "C7kfzwZa5rrT8BeXN", "user": {"username": "Jason"}}, {"_id": "mFgb6DnxnnyMR9FfB", "postedAt": "2023-12-20T01:18:50.533Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Lukas - I guess one disadvantage of pseudonyms like 'Alice' and 'Chloe' is that it's quite difficult for outsiders who don't know their real identities to distinguish between them very clearly -- especially if their stories get very intertwined.</p><p>If we can't attach real faces and names to the allegations, and we can't connect their pseudonyms to any other real-world information about them, such as LinkedIn profiles, web pages, EA Forum posts, etc., then it's much harder to remember who's who, and to assess their relatively degrees of reliability or culpability.&nbsp;</p><p>That's just how the psychology of 'person perception' works. The richer the information we have about people (eg real names, faces, profiles, backgrounds), the easier it is to remember them accurately, distinguish between their actions, and differentiate their stories.</p>", "parentCommentId": "4krbLstnzNBtXNq26", "user": {"username": "geoffreymiller"}}, {"_id": "yzjMtYNPt98YEq4iW", "postedAt": "2023-12-20T01:22:56.352Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Ivy - I really appreciate your long, thoughtful comment here. It's exactly the sort of discussion I was hoping to spark.&nbsp;</p><p>I resonate to many of your conflicted feelings about these ethically complicated situations, given the many 'stakeholders' involved, and the many ways we can get our policies wrong in all kinds of ways.</p>", "parentCommentId": "kvDRjxotGrYJjui6P", "user": {"username": "geoffreymiller"}}, {"_id": "isFr7r5kFmE42Bkd7", "postedAt": "2023-12-20T01:26:50.361Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>PS For the people downvoting and disagree-voting on my comment here:</p><p>I raised some awkward questions, without offering any answers, conclusions, or recommendations.</p><p>Are you disagreeing that it's even legitimate to raise any issues about the ethics of 'whistleblower' anonymity in cases of potential false allegations?</p><p>I'd really like to understand what you're disagreeing about here.</p>", "parentCommentId": "kJJ7Hbo6zxHZtTKyF", "user": {"username": "geoffreymiller"}}, {"_id": "LHAXrBPMkgzFMTkCJ", "postedAt": "2023-12-20T01:51:55.672Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thanks for your kind comment :)</p>\n", "parentCommentId": "yzjMtYNPt98YEq4iW", "user": {"username": "Ivy_Mazzola"}}, {"_id": "dKFnNRAgQHAKjoTvs", "postedAt": "2023-12-20T02:00:43.374Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think the questions you're raising are important. I got kind of triggered by the issue I pointed out (and the fact that it's something that has already been discussed in the comments of the other post), so I downvoted the comment overall. (Also, just because Chloe is currently anonymous doesn't mean it's risk-free to imply misleading and damaging things about her – anonymity can be fragile.)<br><br>There were many parts of your comment that I agree with. I agree that we probably shouldn't have a norm that guarantees anonymity unconditionally. (But the anonymity protection needs to be strong enough that, if someone temporarily riles up public sentiment against the whistleblowers, people won't jump to de-anonymizing [or to other, perhaps more targeted/discreet appropriate measures, such as the one suggested <a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went?commentId=kvDRjxotGrYJjui6P\">by Ivy here</a>] too quickly; instead, the process there should be diligent and fair <i>as well, </i>just like an initial investigation prompted by the whistleblowers should be. (Not saying that this contradicts any of what you were suggesting!)<br><br>When things get heated and people downvote each others comments, it might be good to focus on things we do (probably) agree on. As I said <a href=\"https://www.lesswrong.com/posts/2vNHiaTb4rcA8PgXQ/effective-aspersions-how-the-nonlinear-investigation-went?commentId=tcdaFNBstGzYQTjAZ\">on the Lesswrong version of this post</a>:</p><blockquote><p>Here are the list of values that are important to me about this whole affair and context:</p><ul><li>I want whistleblower-type stuff to come to light because I think the damage bad leaders can do is often very large</li><li>I want investigations to be fair. In many cases, this means giving accused parties time to respond</li><li>I understand that there’s a phenotype of personality where someone has a habit of bad-talking others through false/misleading/distorted claims, and I think investigations (and analysis) should be aware of that</li></ul><p>(FWIW, I assume that most people who vehemently disagree with me about some of the things I say in this comment and elsewhere would still endorse these above values.)</p></blockquote>", "parentCommentId": "isFr7r5kFmE42Bkd7", "user": {"username": "Lukas_Gloor"}}, {"_id": "zQEdnqePvK6D5DQag", "postedAt": "2023-12-20T02:08:13.145Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thanks for writing this! I'd been putting something together, but this is much more thorough.</p><p>Here are the parts of my draft that I think still add something:</p><hr><p>I'm interested in two overlapping questions:</p><ol><li>Should Ben have delayed to evaluate NL's evidence?</li><li>Was Nonlinear wrong to threaten to sue?</li></ol><p>While I've <a href=\"https://www.jefftk.com/p/run-posts-by-orgs\">previously advocated</a> giving friendly organizations a chance to review criticism and prepare a response in advance, primarily as a question of politeness, that's not the issue here. As I <a href=\"https://www.lesswrong.com/posts/Lc8r4tZ2L5txxokZ8/sharing-information-about-nonlinear-1?commentId=b9FGqeqo4hBcbSfu5\">commented</a> on the original post, the norm I've been pushing is only intended for cases where you have a neutral or better relationship with the organization, and not situations like this one where there are allegations of mistreatment or you don't trust them to behave cooperatively. The question here instead is, how do you ensure the accusations you're signal-boosting are true?</p><p>Here's my understanding of the timeline of 'adversarial' fact checking before publication: <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=8DGWvtFjvtDCMQmQh\">timeline</a>. Three key bits:</p><ul><li>LC first shared the <a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=Zf4oaHFm8DHFndnHt\">overview of claims</a> 3d before posting.</li><li>LC first shared the draft 21hr before posting, which included additional accusations</li><li>NL responded to both by asking for a week to gather evidence that they claimed would change LC's mind, and only threatened to sue when LC insisted on going ahead without hearing their side of the story.</li></ul><p>Overall, it does look to me like Ben should have waited. That he was still learning his post had additional false accusations right up to publication, including one so close to publication that he didn't have time to address it, meant he should have expected that if he didn't delay it would go to publication containing additional false claims. And Ben seems to have understood this, and <a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=8qvrnk8X2pk9hefqB\">told NL</a> two days before that \"I do expect you'll be able to show a bunch of the things you said\" and \"I did update from things you shared that Alice's reports are less reliable than I had thought\". Additionally, three days (some of which NL was traveling for) is not long to rebut such a long list of accusations, and some of the accusations were shared with NL less than a day in advance of publishing.</p><p>Given that I think it's clear Ben should have given NL some time to assemble conflicting evidence, do I also need to conclude that it was ok for NL to threaten to sue if he didn't? That is something I <i>really</i> don't want to do: I'm not a fan of how strict defamation law is, and I think it's really valuable that it's almost never used in our community. If we instead had a culture where everyone is being super careful never to say anything that they would lose a suit over I think we'd see a tremendous <a href=\"https://en.wikipedia.org/wiki/Chilling_effect\">chilling effect</a> where many true and important things would never come out. This is especially important around allegations of abusive behavior, where proving the truth of anything can be quite difficult and abusers have often taken advantage of this.</p><p>On the other hand, defamation law at its best deters people from saying false things, including fact checking before <a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=GoqAiuDfwxwBRfMsY\">republishing</a> others' claims, especially in cases where false statements are likely to have strong personal and professional impacts. NL threatening a suit here seems to me like the law used correctly even given the tighter scope I'd like to see for defamation law, and while it's still not something I would do and I'd be sad if it became common in our community, I don't think NL was actually wrong to do it.</p><p>Note that I'm not making an overall \"Nonlinear: yes or no\" judgement here; please don't interpret this post as a view on whether NL mistreated their employees or on how trustworthy their former employees are. I've only been looking at the two questions above: should Ben have waited for additional evidence, and was it an unreasonable escalation for NL to threaten to sue.</p><hr><p>A few thoughts about how future posts like LC's could go better:</p><ul><li>Be clear about voice. Ben's post often clarifies that he's relaying information (\"Alice reported that\") but at other times reports Alice or Chloe's perspective as his own (\"nobody in the house was willing to go out and get her vegan food, so she barely ate for 2 days\"). The latter would be warranted if Ben had validated the claims he's relaying, but my understanding is this was instead just a bit sloppy.</li><li>If you have your facts straight you don't <i>have</i> to give the people you're writing about a chance to look over a draft and point out errors, and in cases where, for example, people are telling the story of abuse that happened to them that's often a reasonable decision. On the other hand, especially if you're reporting on a situation you weren't a part of, I think you're really very likely to have some mistakes. Sharing your post's claims section (you don't have to share parts of the post that don't make new claims) for review is really hard to beat as a way of avoiding publishing false claims.</li><li>How much time to give for assembling evidence depends on how many claims there are, and I think you can do some prioritization. You can ask if they can provide evidence for some of the places they think you're most clearly wrong, and if they can't do a good job with this given a few days I think you're justified in assuming their claims of counter-evidence are bluster.</li><li>When giving time to fact check and gather evidence, get agreement on deadlines up front so things don't get pushed back repeatedly: \"I'll review anything you get me before EOD Thursday; does that work?\" While you should sort out all your claims before starting this process, if you want to add new claims after then you need to push the deadline out to give them more time to respond.</li></ul><p>I really like Michael Plant's <a href=\"https://forum.effectivealtruism.org/posts/fn7bo8sYEHS3RPKQG/concerns-with-intentional-insights?commentId=BHX8y5gD687NAgoFe\">comment</a> on a <a href=\"https://forum.effectivealtruism.org/posts/fn7bo8sYEHS3RPKQG/concerns-with-intentional-insights\">previous post about issues with an EA org</a> (which <a href=\"https://forum.effectivealtruism.org/users/habryka?mention=user\">@Habryka</a> also worked on), responding to someone who <a href=\"https://forum.effectivealtruism.org/posts/fn7bo8sYEHS3RPKQG/concerns-with-intentional-insights?commentId=piXQnP4uvJrXC4Mzu\">thought</a> the post was \"charitable and systematic in excess of reasonable caution\" and objected to the \"fully comprehensive nature of the post and the painstaking lengths it goes to separate out definitely valid issues from potentially invalid ones\":</p><blockquote><p>I take your point as \"aren't we being too nice to this guy?\" but I actually really like the approach taken here, which seems extremely fair-minded and diligent. My suspicion is this sort of stuff is long-term really valuable because it establishes good norms for something that will likely recur in future. I'd be much more inclined to act with honesty if I believed people would do an extremely thorough public investigation into everything I'd said, rather than just calling me names and walking away.</p></blockquote><p>If you think that NL was overall in the right then of course LC should have been more careful, but even if you think NL is run by horrible people I think you <i>still</i> should come to that conclusion. &nbsp;This combination of posts and overwhelming amounts of conflicting screenshots and stories seems to have left most of the community not knowing what to think. A post from LC that led with airtight accusations and then included supplementary material for fuzzier issues would have been much more effective towards its goals, enough so that I think more hours spent in 'adversarial fact checking', resolving conflicting claims, would have been <i>far</i> more effective per hour than the average for this project.</p><hr><p>I almost always post immediately after writing things, since that's how my motivation works, but in this case I sent my post out for review. &nbsp;I got some good feedback from several people, but now that the top-level post has opened the conversation about appropriate process in situations like these I think talking in public makes more sense.</p>", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "soyf3bHt7gtwkqCAf", "postedAt": "2023-12-20T10:33:57.552Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I find this post to be emotionally manipulative to a pretty substantial degree. It opens by explicitly asking readers to picture a scene involving the NYT, which most people will have a negative association with:</p><blockquote><p>Picture a scene: the New York Times is releasing an article on Effective Altruism (EA) with an express goal to dig up every piece of negative information they can find. They contact Émile Torres, David Gerard, and Timnit Gebru, collect evidence about Sam Bankman-Fried, the OpenAI board blowup, and Pasek's Doom, start calling Astral Codex Ten (ACX) readers to ask them about rumors they'd heard about affinity between Effective Altruists, neoreactionaries, and something called TESCREAL. They spend hundreds of hours over six months on interviews and evidence collection, paying Émile and Timnit for their time and effort. The phrase \"HBD\" is muttered, but it's nobody's birthday.</p></blockquote><p>... and then proceeds to try to build an analogy between the NYT and Ben's post.</p><p>When Nonlinear posted their reply, there was some controversy over whether the section \"Sharing Information on Ben Pace\" is okay or not. I defended it because, rightly or wrongly, Nonlinear had their reputation destroyed to a significant extent by Ben's post, and I thought and still think that gives them some leeway when it comes to emotional appeals in their post. Nothing like that applies here, yet this post is written like a novel rather than an impartial analysis. (To be clear there's much more to this than just the central analogy, but I'm not going to get into details.)</p><p>I think emotional manipulation is always bad because it's orthogonal to truth, but it's super extra bad when the topic under discussion is this controversial and emotionally loaded in the first place. I don't expect many to agree with this, but I honestly think it may be because you don't realize the extent to which you're being manipulated because I guess this is more subtle than what Nonlinear did. I'd argue that makes it worse; Nonlinear's section on Ben actually told the readers what it was doing. Again, don't expect much agreement here, but I think incentivizing stuff like this is a bad idea, and it's especially bad if we're only incentivizing it if the author doesn't admit what they're doing.</p><p>The post itself also seems premature for the reasons habryka already mentioned. Both Ben's post and Nonlinear's reply widely swung pubic opinion; why do we expect that Ben's reply won't do the same? And if it does, then it seems unhelpful to make a post framing it as a settled matter. And it's also not true that they're unambiguous falsehoods since most of them leave plenty of room for argument, as demonstrated by people still arguing about them.</p>", "parentCommentId": null, "user": {"username": "Rafael Harth"}}, {"_id": "QvrmofDgQjETDMAnr", "postedAt": "2023-12-20T10:38:11.604Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/?commentId=soyf3bHt7gtwkqCAf\">I disagree-voted because your first paragraph praised the OP.</a></p>", "parentCommentId": "isFr7r5kFmE42Bkd7", "user": {"username": "Rafael Harth"}}, {"_id": "RCKLG4zsMto34t2ar", "postedAt": "2023-12-20T10:53:43.494Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I feel like you’re eliding my point on the New York Times section. The example there is rhetorically effective not because there is an analogy between what the New York Times does and what this post did, but because there <em>isn’t</em>. The NYT, whatever its flaws (and there are many) would never publish a post like the original callout. Oh, they’d write a hit piece, sure, but it would be much more precise: every detail cross-checked, negative info in the lede with exculpatory info below, so forth. I meant it when I said you’re lucky the NYT doesn’t cover you the way that post was written, and I think that’s an important substantive point to make.</p>\n<p>This community has no trouble noticing and objecting to bad journalistic practice when it’s from an outsider looking in, but it applies different levels of trust to insiders, and I think in that case it caused them to miss obvious warning signs that they would have spotted in any other context. It’s useful and material to my argument to demonstrate that by establishing a context where everyone would see the warning signs.</p>\n<p>I reject that this post is premature because I didn’t wait for Ben’s further response. He wrote an article after six months of work; everyone has plenty of material to react to, and my post centers around recognizing that a six-month hunt for negative information is fundamentally not a truth-seeking process and that the community ignored major red flags that were present and mentioned at the moment of publication.</p>\n<p>People are still arguing about the falsehoods, but it’s unclear to me either that those arguments have any substance or that they’re germane to the core of my point. So far, the main truth-claim argument I’ve gotten against the points I highlight in this post is that “lived apart for six weeks of the four months” is compatible with “wasn’t allowed to live apart,” which I still don’t see. Meanwhile, one of my crucial points—that Ben received exculpatory evidence two hours before posting but was so committed to a posting schedule he would not edit anything—is admitted by all parties.</p>\n<p>If you want to argue that they remain ambiguous, it’s more useful to make it with specifics than to gesture vaguely at it.</p>\n", "parentCommentId": "soyf3bHt7gtwkqCAf", "user": {"username": "TracingWoodgrains"}}, {"_id": "gCE6uotARphJspbmu", "postedAt": "2023-12-20T11:22:39.262Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>Oh, they’d write a hit piece, sure, but it would be much more precise: every detail cross-checked</p></blockquote><p>Can you clarify what you mean by cross-checked here?&nbsp;</p><p>I know of multiple hit-pieces written about people close to me, and it has never been the case that major newspapers cross-checked facts with the person accused, and they often got substantial facts wrong, so I am not sure what kind of cross-checking you are talking about (and how it's supposed to compare with the kind of fact-checking that Ben did in his post).</p>", "parentCommentId": "RCKLG4zsMto34t2ar", "user": {"username": "Habryka"}}, {"_id": "2dd8xnFsw5yWd3dWi", "postedAt": "2023-12-20T11:32:10.963Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>If large newspapers get specific factual points wrong they can and should be sued for libel. Partially as a consequence, when making accusations against people they are generally careful to stick within the bounds of the technically true even if uncharitably framed.</p>\n<p>This is one reason, despite the distaste towards them in this community, I will not disavow libel suits as error-correcting mechanisms: they are a strong motivator for newspapers and one every journalist keeps in mind. Trust is a currency. Corrections are seen as stains on papers, retractions more so, losing lawsuits worst of all.</p>\n<p>When I say “cross-checked” I don’t necessarily mean “checked with the accused”—although that comes into it—but verified with hard, unambiguous evidence. Not every paper keeps a high evidentiary standard, but the NYT—despite its many faults—does.</p>\n<p>EDIT: for those who doubt this—keep an eye on how many conservatives still cite data presented by the NYT to make their points. It has clear biases in structure, presentation, and style of content, but its overall production value is unusually high. Its preeminence in the news world is not a coincidence, it having maintained that preeminence rather than being disrupted in the digital age is not a coincidence, and understanding the how and why of that is useful <em>especially</em> if you dislike it.</p>\n", "parentCommentId": "gCE6uotARphJspbmu", "user": {"username": "TracingWoodgrains"}}, {"_id": "mKtF4mGfwayrjfQtm", "postedAt": "2023-12-20T12:09:51.585Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Yeah, reflecting on the hit pieces that were New York Times related, I do believe the New York Times in-particular is quite diligent with its fact-checking. Though this is of course very far from universal among newspapers. See for example one of the <a href=\"https://www.politico.eu/article/rishi-sunak-artificial-intelligence-pivot-safety-summit-united-kingdom-silicon-valley-effective-altruism/\">recent Politico articles on EA and DC policy activism</a> referring to the founder of Open Philanthropy as \"Harold Karnofsky\", which is really one of the most basic fact-checking errors to make (his real name is Holden Karnofsky).&nbsp;</p><p>I don't believe it's libel suits that cause the difference here, given that other newspapers can get away with much lower standards while being similarly susceptible to libel suits. I think it's a reputation that the New York Times is trying to maintain that is mostly enforced outside of the legal system.</p>", "parentCommentId": "2dd8xnFsw5yWd3dWi", "user": {"username": "Habryka"}}, {"_id": "vwthAr4msboamHFu5", "postedAt": "2023-12-20T12:22:17.248Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>It’s both. It’s important to remember that the primary effect of legal-system-as-backdrop isn’t “people get sued” but “people constrain their behavior because they know there could theoretically be legal consequences.” Every journalist knows what happened to Gawker, and the word “libel” is never terribly far from their minds.</p>\n<p>The NYT is absolutely trying to maintain a reputation. Journalists as a whole are too, often less successfully. And for all of them, one of the greatest possible stains on that reputation would be a libel suit. There are many layers of error-correcting and error-checking mechanisms built atop the common-law foundation that come together into professional or institutional norms, but that doesn’t make the foundation meaningless.</p>\n", "parentCommentId": "mKtF4mGfwayrjfQtm", "user": {"username": "TracingWoodgrains"}}, {"_id": "GiWZykGWHrsDnmbXS", "postedAt": "2023-12-20T12:47:23.794Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p><strong>Meta note: </strong>I'm not going to spend much more time on nonlinear threads, since I think it's among the poorer uses of my time. With this in mind, <strong>I hope people don't take unilateral actions (e.g. deanonymizing Chloe or Alice) after discussing in this thread</strong>, because I suspect at this point threads like these filter for specific people and are less representative of the EA community as a whole.</p>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "hNpLAoYKoSwvFuDxs", "postedAt": "2023-12-20T12:53:28.651Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>People are still arguing about the falsehoods, but it’s unclear to me either that those arguments have any substance or that they’re germane to the core of my point.</p></blockquote><p>Well yes, I would have been very surprised if you thought they had substance given your post. But the term \"unambiguous\" generally implies that reasonable people don't disagree, not just that the author feels strongly about them. This is one of the many elements of your post that made me describe it as manipulative; you're taking one side on an issue that people are still arguing about and call it unambiguous.</p><p>There are plenty of people who have strong feelings about the accusations but don't talk like that. <i>Nonlinear themselves didn't talk like that! </i>Throughout these discussions, there's usually an understanding that we differentiate between how strongly we feel about something and whether it's a settled matter, even from people who perceive the situation as incredibly unfair.</p>", "parentCommentId": "RCKLG4zsMto34t2ar", "user": {"username": "Rafael Harth"}}, {"_id": "eHANAj6n3yCPuDosX", "postedAt": "2023-12-20T13:03:41.598Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>The example there is rhetorically effective not because there is an analogy between what the New York Times does and what this post did, but because there <i>isn’t</i>.</p></blockquote><p>I objected to the comparison because it's emotionally loaded. \"You're worse than {bad thing}\" isn't any less emotionally loaded than \"you're like {bad thing}\".</p>", "parentCommentId": "RCKLG4zsMto34t2ar", "user": {"username": "Rafael Harth"}}, {"_id": "ycek4N6vavdNxXraS", "postedAt": "2023-12-20T14:25:29.324Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>For what it's worth, I think saying that \"all of whom disagreed with my decision\" is not an accurate summary of quotes like:</p></blockquote><blockquote><blockquote><p>On the request for more time for right to reply, that’s a judgement call—is this a fair period for the allegations involved, or time wasting? It’s not unknown for journalists to put in a right to reply on serious allegations, and the subject ask for more time, and then try to get ahead of the story by breaking it themselves (by denying it).</p></blockquote></blockquote><p>Do you think it's an accurate summary of quotes like the rest of her reply?</p><blockquote><p>This feels like a good example of why you shouldn’t over-promise to your sources—you want a cordial relationship with them but you need boundaries too. I can definitely see a situation where you would agree to give a source a heads up once you’d decided to publish — if it was a story where they’d recounted a violent incident or sexual assault, or if they needed notice to stay somewhere else or watch out for hacking attempts. But I would be very wary of agreeing in advance when I would publish an investigation—it isn’t done until it’s done.</p><p>In the end the story is going out under your name, and you will face the legal and ethical consequences, so you can’t publish until you’re satisfied. If the sources are desperate to make the information public, they can make a statement on social media. Working with a journalist involves a trade-off: in exchange for total control, you get greater credibility, plausible deniability and institutional legal protection. If I wasn’t happy with a story against a ticking clock, I wouldn’t be pressured into publication. That’s a huge risk of libelling the subjects of the piece and trashing your professional reputation.</p></blockquote><p>I don't think there's much use to selectively quoting a paragraph using the phrase \"judgment call\" when the reply as a whole emphasizes that she considers it a mistake to agree in advance to a particular publication date, that an investigation isn't done until it's done, and that you will face the legal and ethical consequences of publishing any falsehoods. In particular, to stick with the factual backing we both agree on: You maintained a hard publication date while receiving information two hours beforehand that substantially called into question a claim in the article that was later demonstrated to be false. Do you think \"disagreed with your decision\" is an inaccurate summary of those two paragraphs as they relate to that specific decision?</p>", "parentCommentId": "bacsbiXT43fGfiFiE", "user": {"username": "TracingWoodgrains"}}, {"_id": "q8GJrijb8mFt3eaGB", "postedAt": "2023-12-20T14:37:48.178Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Whistleblower protection is necessary when Abe provides evidence that Bill harmed Cindy; otherwise, Abe lacks incentive to help Cindy. It is less important when Abe defends himself against harm caused by Bill.</p>", "parentCommentId": "C7kfzwZa5rrT8BeXN", "user": {"username": "JamesMiller"}}, {"_id": "qRJH5cAAk2EouxEZG", "postedAt": "2023-12-20T14:38:40.916Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Wasn't the Gawker suit for <a href=\"https://en.wikipedia.org/wiki/Bollea_v._Gawker\">invasion of privacy, infringement of personality rights, and intentional infliction of emotional distress</a>? It involved a suit by a third-tier celebrity over a leaked sex tape, financed by a billionaire with a major grudge against Gawker.</p><p>The lessons of the Gawker case involve not publishing celebrity sex tapes, and not enraging vindictive billionaires, but I'm not sure what they have to do with defamation. The sex tape wasn't false.</p>", "parentCommentId": "vwthAr4msboamHFu5", "user": {"username": "Jason"}}, {"_id": "hquEsPFGEyqutG8X3", "postedAt": "2023-12-20T14:44:55.453Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Totally fair; I should have clarified. The Gawker case was fresh on my mind as an incident of journalistic malpractice due to <a href=\"https://www.lesswrong.com/posts/2vNHiaTb4rcA8PgXQ/effective-aspersions-how-the-nonlinear-investigation-went?commentId=oLX3gQcFdgkXTLiBE\">this conversation</a> and is the most memorable example of lawsuits taking down a journalistic outlet. It's a good example of the risks of irresponsible journalism in general but definitely wasn't libel, and precision would have been better.</p>\n", "parentCommentId": "qRJH5cAAk2EouxEZG", "user": {"username": "TracingWoodgrains"}}, {"_id": "Mk5FsNEJntfGbSKf9", "postedAt": "2023-12-20T14:53:49.507Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I'd like to re-iterate that we did not say we would sue if they published. We said we would sue&nbsp;<strong>if they didn't give us time to share the evidence with them</strong>.&nbsp;</p><p>They were not supporting discourse. They were trying to&nbsp;<i>avoid</i> discourse.&nbsp;</p><p>Ben explicitly said he'd updated about Alice's reliability based on our conversation and evidence we showed in the call.&nbsp;</p><p>He knew he was about to receive even&nbsp;<i>more</i> evidence that would mean he'd wasted $10,000 and his last 6 months listening to a person who has a reputation of saying false and misleading things.&nbsp;</p><p>He just didn't want to see that evidence. And<a href=\"https://docs.google.com/document/d/1P4iLZPrQt-dxl9njvz1EvnB8qOBt11DVmtn8PHwFyPw/edit#heading=h.5sjidzo7kg9w\">&nbsp;<u>he did masterful frame control by trying to make it seem like if we&nbsp;</u><i><u>did</u></i><u> share this evidence, that was us being \"retaliatory\" or somehow unethical.</u></a>&nbsp;</p><p>He then<a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear#:~:text=%22I%20will%20sue%20you%20if%20you%20publish%20these%20concerns%22%2C\">&nbsp;<u>went around saying we'd threatened to sue if he published</u></a> (link to one comment of many where they do this), when we<a href=\"https://docs.google.com/document/d/1P4iLZPrQt-dxl9njvz1EvnB8qOBt11DVmtn8PHwFyPw/edit#bookmark=id.l77s40fct86f\"><u> couldn't have made it more clear that that wasn't the case.</u></a>&nbsp;</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mk5FsNEJntfGbSKf9/snrkk9p8chd9jbqfmsvl\"></p><p><i>Excerpt from email we sent to Ben. Bolding in the original.&nbsp;</i></p><p>This sort of suing threat wouldn't chill the discourse and make it so people wouldn't post valid criticisms of an EA org. EA is all&nbsp;<i>about</i> publishing rigorous and valid criticisms of different charities.</p><p>It&nbsp;<i>would&nbsp;</i>incentivize people to not write unsubstantiated and explicitly slanted hit pieces causing massive and irreversible damage to people who might be innocent.&nbsp;</p><p>Make sure you're being rigorous and impartial before you do something that you know will cause massive suffering and irreversible &amp; permanent damage to somebody.&nbsp;</p><p>Writing critical pieces, especially ones that are vitriolic, calling people “predators” chewing up and spitting out the youth of the community, is something that will cause massive, predictable, and irreversible harms to its victims.&nbsp;<br><br>The community should disincentivize using this weapon recklessly.&nbsp;</p>", "parentCommentId": "PvCK2FHNsXYrQwy7w", "user": {"username": "katherinesavoie"}}, {"_id": "kMR8iDRirpSJiWewX", "postedAt": "2023-12-20T15:02:36.877Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>There's an important qualifier here: it is extremely hard for a public figure (including a \"limited-purpose public figure\") to win a libel suit in the United States. I would submit that most of the inhibitory effect of libel law in the U.S. as it relates to public figures comes from the <i>fear </i>of litigation, or the <i>costs </i>of litigation, rather than the risk of an actual-malice finding at trial. (Actual malice requires a showing that the speaker knew that the statement was false, or acted with reckless disregard of its truth or falsity. Mere negligence isn't enough.)</p><p>I bring that up because I don't think libel law causes newspapers to insist that everything derogatory that they print about a person be \"verified with hard, unambiguous evidence\" unless you water that term down a lot.</p>", "parentCommentId": "2dd8xnFsw5yWd3dWi", "user": {"username": "Jason"}}, {"_id": "NL54KuPP7FQuvz6se", "postedAt": "2023-12-20T15:03:34.585Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Nonlinear indicate in their appendix that they've decided against suing. (<a href=\"https://docs.google.com/document/d/1P4iLZPrQt-dxl9njvz1EvnB8qOBt11DVmtn8PHwFyPw/edit#bookmark=id.vfw4iurg5lfe\">Source; it's the paragraph immediately above the linked bookmark</a>).</p><p>For my part I'm moderately inclined to be dismissive of the lawsuit threat, in main because the rule-of-thumb I've personally heard about threatening to sue is that, if you're serious about it, you should consult your lawyer <i>before</i> you send the threat; I'm not a lawyer myself, though, and am unsure whether it gives the right output here (especially given that their preferred outcome was for Ben to delay the post without their suing).</p>", "parentCommentId": "GWjd9rQ7Tp3uejpNj", "user": {"username": "evere"}}, {"_id": "5FaoPJfSTjsXcJjr7", "postedAt": "2023-12-20T15:44:05.744Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>A quick reminder that moderators have asked, at least for the time being, to <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=7CnpbyrXbmNr3LqhP\">please<strong> not</strong> post personal information that would deanonymize Alice or Chloe.</a></p>", "parentCommentId": "kJJ7Hbo6zxHZtTKyF", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "Zpp3ChfLX6JBqKowq", "postedAt": "2023-12-20T16:11:15.583Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thanks, Kat. To be clear, I am not expressing an opinion about whether it was appropriate to make a litigation threat in the circumstances in which Nonlinear found itself. That's in part because I don't actually have an opinion on that point -- reaching an opinion I'd feel comfortable asserting would require hours of pouring over posts and comments with that question in mind, which doesn't seem a good use of my time.</p><p>My concern was that TracingWoodgrains' analysis about \"Threats of lawsuits\" generally -- the plural is in the original -- appeared to conflate <i>threatening to sue</i> and <i>actually seeing a case to trial</i>. The latter is a costly signal; the former is not. I think it would be unfortunate if the community came to view threats to sue as a credible signal of correctness; that would incentivize making many more of those threats in circumstances where it was not appropriate to do so.</p>", "parentCommentId": "Mk5FsNEJntfGbSKf9", "user": {"username": "Jason"}}, {"_id": "FabkjudsLsJBuxLse", "postedAt": "2023-12-20T16:13:10.649Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>I raised some awkward questions, without offering any answers, conclusions, or recommendations.</p>\n</blockquote>\n<p>I don't feel like you raised discussion with no preference for what the community decided. When I gave my answer, which many people seem to agree with, your response was to question whether that's REALLY what the EA community wants. I think it's a bit disingenuous to suggest that you're just asking a question when you clearly have a preference for how people answer!</p>\n", "parentCommentId": "isFr7r5kFmE42Bkd7", "user": {"username": "Khorton"}}, {"_id": "dKpjZaWhRHBWqiBc2", "postedAt": "2023-12-20T16:15:15.730Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>You're right about the effort involved, but when these are real people who you are discussing deanonymizing in order to try to stop them from getting jobs, you should make the effort.</p>\n", "parentCommentId": "mFgb6DnxnnyMR9FfB", "user": {"username": "Khorton"}}, {"_id": "anA8ALg24XYsnneX7", "postedAt": "2023-12-20T16:31:50.987Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>The most obviously questionable choice was, of course, their <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=hwjAuwpHh3DWrCbjA\">questionable usage of quotation marks</a>, which is still only mentioned in the appendix. This introduced substantial confusion as to whether their responses to ostensible quotations in fact addressed the claims made in the original post, and this was exacerbated by their extensive editorialisation. I am not interested in legislating claims, but do notice their determination to muddy the waters, and find it very indicative that they believed this was their best path forward.</p><p>Another couple things that stood out.</p><p>This 'illustration' is quite a choice.</p><figure class=\"image image_resized\" style=\"width:66.01%\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/ydnc7frnlk5miuldra77\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/ntruys3lcuydmeoozytn 120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/ioyy6bhmhg00zupt4k6k 240w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/nlikdzwpdokhaw2vmgxz 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/qr0axhrcjnwgutkpyubb 480w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/mssm4xik0u4bx4d1fqok 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/i86xsyp7vrtnzrqbnrqv 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/cxjeoculy1p2bahggunm 840w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/igfg1buoonzytokvtibx 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/ezcynjf1jh8wisdjoai0 1080w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/zoqaawv3jk9arv2q97nm 1110w\"></figure><p>Why did images and captions like these feature so prominently in the post, including right near the beginning?</p><figure class=\"image image_resized\" style=\"width:54.97%\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/jsxn8vhecl15j2sa3eia\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/gwx0ovmjir5x1anu0dtk 100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/kmqfjzdu79nblkxsspyj 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/f3urnrarnpvt3o0xpamm 300w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/lqxie3oheblscrpof3my 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/a05iopmkvkevjz1nnelh 500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/gjpsfnktdkpojwkyl6sd 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/e4caog2zbgt68eqhzrro 700w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/mobatorckuynua58msi8 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/spde6rjobxylt5obudtb 900w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/anA8ALg24XYsnneX7/zos3srrvjodtkz8lca4n 960w\"></figure><p>This is a document written over more than three months and reviewed by more than ten people. The stylistic and editorial choices are not accidents, or innocent oversights; at the very least, the specific accidents and oversights are suggestive of behavioural tendencies. Ultimately, they seem—in the comments on the original article, and in their later response—manipulative in ways that make the original allegations seem plausible to me. Whether they are in fact true is, of course, a separate matter.</p>", "parentCommentId": "qqJyHp3AEqsjxAKMJ", "user": {"username": "Evan Hockings"}}, {"_id": "MCBCrHTvYuv5XcNkb", "postedAt": "2023-12-20T17:06:17.860Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>This is a fair distinction, but it does make me want to toy with a peculiar thought. As things stand in this community, threats to sue are themselves a costly signal of <em>something</em> even independent of proceeding to trial, because the counterparty can publicize them and get a lot of support from people furious that someone is breaking a norm against such threats.</p>\n", "parentCommentId": "Zpp3ChfLX6JBqKowq", "user": {"username": "TracingWoodgrains"}}, {"_id": "fykJk4rCSnywzuiyY", "postedAt": "2023-12-20T17:32:08.947Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>He then<a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear#:~:text=%22I%20will%20sue%20you%20if%20you%20publish%20these%20concerns%22%2C\">&nbsp;<u>went around saying we'd threatened to sue if he published</u></a> (link to one comment of many where they do this), when we<a href=\"https://docs.google.com/document/d/1P4iLZPrQt-dxl9njvz1EvnB8qOBt11DVmtn8PHwFyPw/edit#bookmark=id.l77s40fct86f\"><u> couldn't have made it more clear that that wasn't the case.</u></a>&nbsp;</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mk5FsNEJntfGbSKf9/snrkk9p8chd9jbqfmsvl\"></p><p><i>Excerpt from email we sent to Ben. Bolding in the original.&nbsp;</i></p></blockquote><p>But then, from the next paragraph of <a href=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/5cYYBnbr3ktLP2DhA/pnqwvzygiahohbmxidor\">that same email</a>:</p><blockquote><p>...if published as is we intend to pursue legal action for libel against Ben Pace personally and Lightcone for the maximum damages permitted by law.</p></blockquote><p>It seems to me that you and Emerson are trying to have it two ways. &nbsp;On the one hand, the email clearly says that you only wanted time. &nbsp;On the other hand, the email also clearly says that if Ben gave you that time and then didn't respond the way you wanted, you were still going to sue him. &nbsp;\"we'd threatened to sue if he published\" is a much more accurate summary of that email than \"We said we would sue&nbsp;<strong>if they didn't give us time to share the evidence with them</strong>. \" IMO.</p><p>(note, I haven't read Ben's original piece, just your rebuttal)</p>", "parentCommentId": "Mk5FsNEJntfGbSKf9", "user": {"username": "David Seiler"}}, {"_id": "vPRjZCrjtfd8MyWdL", "postedAt": "2023-12-20T18:14:17.016Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>When we said \"publish it as is\" we meant published now without having seen the evidence. Also, you cut that quote out of its context. The full quote is “Given the irreversible damage that would occur by publishing, it simply is inexcusable to not give us a bit of time to correct the libelous falsehoods in this document, and if published as is we intend to pursue legal action”.&nbsp;</p><p>You could try to make the case that they didn't know that and it's ambiguous, but I think it's more than made up for by when&nbsp;<strong>we say explicitly that we were not doing this and we bolded it.&nbsp;</strong></p><p>With that as context I find it really hard to believe that they genuinely believed that we would sue them if they published it unchanged a week later after seeing our evidence.</p><p>Like, imagine telling somebody, in bold&nbsp;<strong>\"we are not asking for X. We're asking for Y\".&nbsp;</strong>The whole email is making a case for Y. The email ends with us saying in bold again “<strong>Please Y”&nbsp;</strong>(precisely, we end the email saying, in bold “Please wait a week for the evidence. To do otherwise violates the community’s epistemic norms.”). However, in the email, there's a single ambiguously worded sentence that fits incredibly well with Y but could also&nbsp;<i>plausibly&nbsp;</i>be X.&nbsp;</p><p>In such cases, people should interpret the ambiguous sentence as us asking for Y unless there’s strong evidence to the contrary.&nbsp;</p>", "parentCommentId": "fykJk4rCSnywzuiyY", "user": {"username": "katherinesavoie"}}, {"_id": "x9zcFh9g2r7HdsLQH", "postedAt": "2023-12-20T18:21:34.478Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Lorenzo - yes, I'm complying with that request.&nbsp;<br>&nbsp;</p><p>I'm just puzzled about the apparent double standard where the first people to make allegations enjoy privacy &amp; anonymity (even if their allegations seem to be largely false or exaggerated), but the people they're accusing don't enjoy the same privilege.</p>", "parentCommentId": "5FaoPJfSTjsXcJjr7", "user": {"username": "geoffreymiller"}}, {"_id": "zitJEudFkyGhuEYQ8", "postedAt": "2023-12-20T18:24:52.889Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Well all three key figures at Nonlinear are also real people, and they got deanonymized by Ben Pace's highly critical post, which had the likely effect (unless challenged) of stopping Nonlinear from doing its work, and of stigmatizing its leaders.</p><p>So, I don't understand the double standard, where those subject to false allegations don't enjoy anonymity, and those making the false allegations do get to enjoy anonymity.</p>", "parentCommentId": "dKpjZaWhRHBWqiBc2", "user": {"username": "geoffreymiller"}}, {"_id": "2uDuZXuCyTLhXPH8d", "postedAt": "2023-12-20T20:09:35.707Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>There's something to this, but I don't think the incentives argument maps neatly onto the presence/absence of third parties. It's not entirely clear to me what tangible incentive \"Alice\" and \"Chloe\" would have to tell their stories to Ben with permission to share with the broader public. The financial payment seems to have not been anticipated. Having proceeded under pseudonyms, the bulk of any sympathy they might get from the community wouldn't translate into better real-world outcomes for the individuals themselves.&nbsp;</p><p>In these kinds of cases, the motive will often be psychological. People in this position could be motivated by altruistic motives (e.g., a desire for others not to experience the same things they believe they did) or non-altruistic motives (e.g., a hope that the community will roast people who the pseudonymous individuals believe did them wrong). In the former case, a default norm of respecting pseudonymity is important. Altruistic whistleblowers aren't getting much out of it themselves (and are already devoting a lot of time and stress to the communal good).</p>", "parentCommentId": "q8GJrijb8mFt3eaGB", "user": {"username": "Jason"}}, {"_id": "tXcLqRwtknDHWSX4r", "postedAt": "2023-12-20T20:38:51.950Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I agree that the Forum's rules and norms on privacy protection are confused. A few observations:</p><p>(1) Suppose a universe in which the first post on this topic had been from from Nonlinear, and had accused Alice and Chloe (by their real names) of a pattern of mendaciously spreading lies about Nonlinear. Would that post have been allowed to stay up? If yes, it is hard to come up with a principled reason why Alice and Chloe can't be named now.&nbsp;</p><p>If no, we would need to think about why this hypothetical post would have been disallowed. The best argument I came with would be that Alice and Chloe are, as far as I know, people with no real prominence/influence/power (\"PIP\") within or without EA. Under this argument, there is a greater public interest in the actions of those with PIP, and accepting a role of PIP necessarily means sacrificing <i>some</i> of the privacy rights that non-PIPs get.</p><p>(2) Another possibility involves the idea of <i>standing</i>. Under this theory, Alice and Chloe had standing to name people at Nonlinear because they were the ones who allegedly experienced harm. Ben had derivative standing because Alice and Chloe had given him permission to share their stories on the Forum. Under this theory, Nonlinear (and individuals named in Ben's post) would have standing to name Alice and Chloe as the parties allegedly harmed by their conduct. The rest of us would not have standing. [Edit to add footnote here.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref23snzoj2atl\"><sup><a href=\"#fn23snzoj2atl\">[1]</a></sup></span>]</p><p>Maybe the aggrieved party isn't the best imaginable arbiter of whether someone should be unmasked, but it's probably better than concluding that each and every one of us get to make that decision. That could more easily lead to a situation in which 99% of us agree that the names shouldn't be disclosed, and the 1% gets to decide. Of course, that could happen under a standing theory as well, but the 1% minority opinion has to coincide with the list of parties with standing. That at least narrows the problem.</p><p>(3) This situation involves a mix of Forum and non-Forum conduct. I sense that the norm for not doxxing people is stronger for Forum conduct (or at least for conduct involving similar sorts of speech) than from non-Forum conduct. This may reflect a difference in the norms of Internet communities vs. physically-grounded communities, or a sense that Forum speech is often core expressive speech or otherwise entitled to extra solicitude.&nbsp;</p><p>In any event, based on the fact that a number of people seem to know their identities, it sounds like the tale of Alice and Chloe was not a closely-kept secret before Ben's post went up. Presumably this information came, directly or indirectly, from Alice and Chloe. In other words, there has been potentially relevant non-Forum conduct that did not magically morph into Forum conduct merely because Ben decided to write a post sharing the same information.</p><p>That raises the following hypothetical. Let's say that Dan allegedly made some homophobic, racist, sexist, and/or otherwise offensive comments.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefez22hg2jpf9\"><sup><a href=\"#fnez22hg2jpf9\">[2]</a></sup></span>&nbsp;Does the location in which the comments were made change whether he can be identified. For example, is it OK to write a Forum post identifying Dan by name if those comments were posted on the Forum under a pseudonym? What if they were said at an EAG afterparty? In a non-EA space on Reddit? With a mask on in public (by someone who recognized Dan's voice)? If the answers are not the same, why is that the case? I don't claim to know the answers, by the way; this isn't a trick question.</p><p>(4) I do not at present have a clear opinion on whether naming Alice, Chloe, or both should be allowed on the Forum. I do have an opinion that there needs to be a clear, logical set of rules or at least principles -- ideally, laid out in advance as far as that is practical. I don't like the idea of apparently ad hoc decisions about who gets privacy protections and who does not.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn23snzoj2atl\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref23snzoj2atl\">^</a></strong></sup></span><div class=\"footnote-content\"><p>[Added footnote: I should note that standing, which is used as a legal metaphor here, does <i>not </i>mean \"is none of your business.\" We often impose standing requirements to make sure the person making the decision has appropriate incentives, context, etc.&nbsp;</p><p>Here, the various people who A &amp; C have allegedly spread lies about are in a much better position than I am to know the relevant facts. If they have not concluded that disclosure of A &amp; C's names is warranted, it's not clear why I -- or any other reader of the relevant posts -- would do a better job as decisionmaker.</p><p>Another reason for limited standing is practicality. For instance, in US law, we don't usually allow suits where the alleged harm is \"<a href=\"https://lawrepository.ualr.edu/cgi/viewcontent.cgi?article=1281&amp;context=appellatepracticeprocess\">I'm a taxpayer, and I paid two cents of tax toward this program I think is illegal</a>.\" You'd have hundreds of millions of people who could challenge any line item in the federal budget, and if you multiply that by how many line items someone might object to . . . &nbsp;Even though there is de minimis financial harm, and that's usually enough, we've decided that isn't enough where the taxpayer's interest is basically of the same nature as every other taxpayer's interest in the matter. The analogy here is that we don't want 100 different people being able to unilaterally decide that A &amp; C should be named. If 99 of them decide that maintaining anonymity is appropriate, and 1 disagrees, the odds of the 1 being correct are pretty low.]</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnez22hg2jpf9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefez22hg2jpf9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This is not to equate Dan's hypothetical conduct to what Alice and Chloe are alleged to have done.</p></div></li></ol>", "parentCommentId": "x9zcFh9g2r7HdsLQH", "user": {"username": "Jason"}}, {"_id": "LisrKHbESMfQcCNLX", "postedAt": "2023-12-20T20:54:14.553Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I had all that context when I read it, and the reading you're giving here still didn't occur to me. &nbsp;To me it says, unambigiously, two contradictory things. &nbsp;When I read something like that I try to find a perspective where the two things don't actually conflict. &nbsp;What I landed on here was \"they won't sue Ben so long as he removes the parts they consider false and libelous, even if what's left is still pretty harsh\". &nbsp;\"Nonlinear won't sue so long as Ben reads the evidence, no matter what he does with it\" isn't quite ruled out by the text, but leaves a lot of it unexplained: there's a lot of focus on <i>publishing </i>false information<i> </i>in that email, much more than just that one line. &nbsp;It doesn't really seem to make logical sense either: if some of Ben's post is libelous, why would his looking at contradictory evidence and deciding not to rewrite anything make it better?</p><p>Anyway, that's my thought process on it; if I'd got that email -- again, knowing nothing about you folks except what you wrote in the rebuttal post, and I guess that one subthread about nondisparagement agreements from the original -- then I'd certainly have taken it as a threat, contingent on publishing without changes. &nbsp;I hope it helps illustrate how Lightcone could take it the same way.</p><p>(searching for \"libel\" in the original thread also gives me <a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear?commentId=kirCopfCCb4rByjCT\">this comment</a>, making the same point three months ago, so I guess I am not adding anything new to the discourse after all. &nbsp;Oh well, there are probably some other people who read this thread but not that one).</p>", "parentCommentId": "vPRjZCrjtfd8MyWdL", "user": {"username": "David Seiler"}}, {"_id": "XGtBvwXWL9vj8psQC", "postedAt": "2023-12-20T21:04:13.441Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>If yes, it is hard to come up with a principled reason why Alice and Chloe can't be named now.</p>\n</blockquote>\n<p>I expect no one was interested in writing something about Alice and/or Chloe (A/C), by name or otherwise, before Ben's post, and people only want to name them now because they think A/C should face consequences for falsely (they believe) alleging abuse.  Which is very close to retaliating against whistleblowers, and we should be very careful, which includes maybe accepting a rule that will have some false positives.</p>\n<p>To take a different example, my non-professional understanding is it would normally be legal for an MA employer to report their employee to immigration authorities, but if the employer did this right after the employee had filed a complaint with the attorney general's office, even a false one, this is probably actually <a href=\"https://www.mass.gov/doc/anti-retaliation-fact-sheet/download\">illegal retaliation</a>.  This will have the occasional false positive, where the employer really was going to report the employee anyway but can't prove it, but we accept that because avoiding the harms of retaliation is more important.</p>\n", "parentCommentId": "tXcLqRwtknDHWSX4r", "user": {"username": "Jeff_Kaufman"}}, {"_id": "WJbMd7zohjkdBKRow", "postedAt": "2023-12-20T21:07:00.715Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>-13 karma from 5 votes for a comment that doesn't seem to break any Forum norms? Odd</p>\n", "parentCommentId": "2uDuZXuCyTLhXPH8d", "user": {"username": "Khorton"}}, {"_id": "AmogtEkjhHSkcuLv7", "postedAt": "2023-12-20T21:10:29.248Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I disliked the opening parable too</p>\n", "parentCommentId": "soyf3bHt7gtwkqCAf", "user": {"username": "Khorton"}}, {"_id": "d26whpDWC85HhgjvW", "postedAt": "2023-12-20T21:14:56.762Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think \"your decision\" implied that it was specifically about the choice to delay. I agree that all three had critiques of the process that was used, which indeed I found valuable and interesting to read!</p>", "parentCommentId": "ycek4N6vavdNxXraS", "user": {"username": "Habryka"}}, {"_id": "AdpmrmfoxhwTKxFZf", "postedAt": "2023-12-20T21:48:26.806Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>It was. You decided, knowing hard evidence had just come in against one of the claims in the post, not to delay publication for even the length of time it would take to fix that claim, a claim that would later prove false.</p>\n<p>My statement was accurate.</p>\n", "parentCommentId": "d26whpDWC85HhgjvW", "user": {"username": "TracingWoodgrains"}}, {"_id": "cybJfSWBBHg6WoM4A", "postedAt": "2023-12-20T21:53:05.485Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think I am failing to understand the argument here, but on the very specific decision to delay, the reply you cite said \"that's a judgement call\". Doesn't seem worth litigating here though.&nbsp;</p>", "parentCommentId": "AdpmrmfoxhwTKxFZf", "user": {"username": "Habryka"}}, {"_id": "Kq5g9EqAq8TywcG2e", "postedAt": "2023-12-20T22:01:23.840Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Could you explain what “ core expressive speech” and “extra solicitude” are?</p>\n", "parentCommentId": "tXcLqRwtknDHWSX4r", "user": {"username": "bec_hawk"}}, {"_id": "mfxZLkR3chLeNvnDE", "postedAt": "2023-12-20T22:09:13.186Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>I expect no one was interested in writing something about Alice and/or Chloe (A/C), by name or otherwise, before Ben's post [ . . . .]</p></blockquote><p>(Correctly) surmising a lack of interest in writing a hypothetical expose about A/C isn't quite the same thing as reaching a conclusion that the post shouldn't have been allowed to remain. However, I think there is a lot of overlap between the two; the reasons for lack of interest seem similar to the arguments for why the post shouldn't be allowed. So I think we are both somewhere vaguely near \"there would be no legitimate/plausible reason for someone to write an expose about A/C, unless one accepted that their whistleblowing activity made it legitimate.\"</p><p>One interesting thing about this framing is that it raises the possibility that the whistleblowers' identities are relevant to the decision. If a major figure in EA were going around telling malicious lies about other EAs, that would be (the subject of an appropriate post / something people would be interested in writing about) independently of any specifically whistleblowing-retaliation angle.</p><p>One could stake out an <i>anti-standing</i> argument in which Nonlinear et al. would not be able to identify A/C because we would be worried that vindictive or retaliatory desires were affecting their judgment, but an truly disinterested person (e.g., <i>not </i>friends of Nonlinear employees) could identify them -- because they are likely to be acting from purer, less emotionally-invested motives (e.g., protection of the community from those they perceive as brazen liars). I'm not endorsing that view, but it is interesting to ponder.</p><p>Continuing with your analogy, if you were a random person who found out about the employee filing with the AG independently of the employer, and you somehow were able to determine that the employee knowingly filed a false report out of (e.g.) racial animus, would it be OK for <i>you </i>to report the employee to the immigration authorities? [Asking ethically, not under MA law.]&nbsp;</p><p>Relatedly, your example relates to a situation with a significant power imbalance (employer/employee). It probably isn't illegal for me to report someone to the immigration authorities where my real motive is that they cheated on me, they cheated on my friend, etc. [I didn't specifically check that example.] So it seems that we often protect individuals exercising socially-important functions like whistleblowing from retaliation by some actors but not others.</p>", "parentCommentId": "XGtBvwXWL9vj8psQC", "user": {"username": "Jason"}}, {"_id": "zgqSEBHdy8nrTiLCi", "postedAt": "2023-12-20T22:22:09.212Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>My use of core expressive speech was inspired by \"core political speech\" in U.S. First Amendment doctrine. E.g., <a href=\"https://virginialawreview.org/articles/equal-speech-protection/\">this article </a>describing a hierarchy of protected speech. I meant that Forum speech may be more likely to be speech about the stuff that matters, discouragement of which (including by denying psuedonymity) poses particularly great harms. Probably \"high-value speech\" would have been clearer here.</p><p>Solicitude is care or concern, so here I meant that we might particularly care about protecting Forum speech as opposed to other kinds of speech for some reason.</p>", "parentCommentId": "Kq5g9EqAq8TywcG2e", "user": {"username": "Jason"}}, {"_id": "EPLrdLeiJYJF6RB5B", "postedAt": "2023-12-20T22:23:19.390Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>All good points! I'm quite conflicted here.</p>\n", "parentCommentId": "mfxZLkR3chLeNvnDE", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Refd7hrfTjbmvrFNy", "postedAt": "2023-12-20T22:30:22.070Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>The judgement call is on giving time for \"right to reply\", not for \"taking more time to verify claims\", right? Those seem kind of different to me.</p>\n", "parentCommentId": "cybJfSWBBHg6WoM4A", "user": {"username": "ChanaMessinger"}}, {"_id": "snS37HoXX6eXEB7i9", "postedAt": "2023-12-21T03:08:38.785Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>So, I don't understand the double standard, where those subject to false allegations don't enjoy anonymity, and those making the false allegations do get to enjoy anonymity.</p></blockquote><p>I don't think all people in the replies were arguing that Ben's initial post was okay and deanonymizing Alice and or Chloe would be bad (which I think you would call a double standard, which I'm not commenting on right now). Some probably do but some probably think that Ben's initial post was bad and that deanonymizing Alice and or Chloe would also be bad and that we shouldn't try to correct one bad with another bad, which doesn't look like a double standard to me.</p>", "parentCommentId": "zitJEudFkyGhuEYQ8", "user": {"username": "Chi"}}, {"_id": "Kk7r8HW3Strm5rNgR", "postedAt": "2023-12-21T03:55:59.635Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>You touched on something here that I am coming to see as the key issue: whether there should be a justice system within the EA/Rationality community and whether Lightcone can self-appoint into the role of community police. In conversations with people from Lightcone re:NL posts, I was told that is wrong to try to guard your reputation because that information belongs to the community to decide. US law on reputation is that you do have a right to protect yourself from lies and misrepresentation. Emerson talking about suing for libel-- his right-- was seen as defection from the norms which that Lightcone employee thinks should apply to the whole EA/rationality community. When did Emerson opt into following these norms, being judged by these norms? Did any of us? The Lightcone employees also did not like that Kat made a veiled threat to either Chloe or Alice (can't remember) that her reputation in EA could be ruined by NL if she kept saying bad things about them. They saw that as bad not just because it was a threat but because it conspired to hide information from the community. From what I understood, that Lightcone employee thought it would have been okay for Kat to talk shit about the former employee-- it was trying to keep the employee from talking that was wrong. I see bargaining in private not to talk shit about each other as up to those people, not necessarily doing something wrong by the rest of the community. Again, who else knew that these were the rules for being in this community?<br><br>In general, I am not in favor of community justice just like I'm not in favor of campus justice. If someone commits a crime, it should be reported to the police. If individuals want to give a company a bad review, they can do so publicly online or privately to whomever they want. If EAs/rationalists want to belong to a community that polices itself, there should be an explicit agreement to join this community along with its expectations, and the enforcers should be accountable to the enforced somehow.</p>", "parentCommentId": null, "user": {"username": "Holly_Elmore"}}, {"_id": "ayDmKS3FnomfL2nkp", "postedAt": "2023-12-21T04:24:17.289Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>That's right, though it seems to me that if someone thought it was reasonable to not give any right to reply in first place, then they presumably must also think that giving people only a very short time to reply is also OK, so one subsumes the other.&nbsp;</p><p>I am not totally confident of this, but on the face of it, if you think it was a reasonable judgement call to give someone no notice before posting, then it must also be a reasonable judgement call to give someone 4/1 days before posting.</p><p>I don't think anyone here is arguing that in absolute terms Ben should have spent more time verifying claims non-adversarially? Like, Ben really did do a lot of that, and I think there might be many valid objections about how Ben went about it, but \"more time\" doesn't seem like currently something people are arguing for.&nbsp;</p><p>My model is people specifically wanted Ben to spend more time in the adversarial stage of a potential fact-finding process, but the above quote suggests that in some circumstances \"0 hours\" is an acceptable amount of time to spend on that, which I find it hard to square with a perspective that \"60 hours\" is an unacceptable amount of time to spend on that, according to this specific source.</p>", "parentCommentId": "Refd7hrfTjbmvrFNy", "user": {"username": "Habryka"}}, {"_id": "QCHdcM2nrtYBvEdgA", "postedAt": "2023-12-21T04:55:18.460Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>(This was indeed my interpretation when I read it. Maybe it was wrong and didn't align with the intent of what Nonlinear tried to communicate, which would be unfortunate, but I think my interpretation was a reasonable one. <a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear?commentId=kirCopfCCb4rByjCT\">Commenters on the original post</a> also seemed to think that this interpretation was reasonable.)</p>", "parentCommentId": "LisrKHbESMfQcCNLX", "user": {"username": "Habryka"}}, {"_id": "bLsWTx9afT4Ks7N2D", "postedAt": "2023-12-21T04:56:17.544Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>US defamation law is not strict at all. It bends over backwards to respect the First Amendment. Truth is a complete defense. UK defamation law, and the law of many other un-free countries, is pretty ridiculous and I do think it's unethical to take advantage of that. But in the US it's so hard to bring a defamation suit that even bringing one and not being shot down by the anti-SLAPP law is strong evidence that the plaintiff is in the right.</p><p>&nbsp;</p><p>&nbsp;I haven't reviewed it closely enough to know if there's enough for a viable defamation suit, but <i>if</i> there is, NL <i>absolutely</i> should sue Pace and those getting mad about that threat should be ashamed of themselves. A norm that you should not bring, or threaten to bring, lawsuits against people who are wronging you in a way the law recognizes as wrong is very very very bad. That norm privileges those who are doing wrong, at the expense of the innocent.&nbsp;</p>", "parentCommentId": "zQEdnqePvK6D5DQag", "user": {"username": "Bluefalcon"}}, {"_id": "peercGAHpqB6W8yPg", "postedAt": "2023-12-21T05:29:36.846Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thank you for saying this.</p>\n<p>I’ve noticed that among those who most strongly condemn the idea of bringing a defamation lawsuit, almost all also assume that Lightcone would win the suit. I have seen nobody make the case that this is a slam-dunk defamation case but that Nonlinear should still never consider pursuing it on principle.</p>\n", "parentCommentId": "bLsWTx9afT4Ks7N2D", "user": {"username": "TracingWoodgrains"}}, {"_id": "nFzuWmZck7Jx5daZd", "postedAt": "2023-12-21T06:00:07.563Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think you may be assuming in part that the plaintiff is at least a limited purpose public figure and would have to prove actual malice rather than mere negligence. One has to show negligence to collect on a lot of torts. Yes, there are extra/early screening mechanisms because of abusive use of defamation suits, but those exist in other areas too -- like medical malpractice, qualified immunity, etc.</p>\n<p>The flipside is that US judgments can be truly eye-popping. I have no love lost for Guliani and even less for Alex Jones, but it's hard for me to accept that compensatory damages for people telling obvious lies about someone should approach an order of magnitude higher than they would likely be for tortiously killing the person (e.g., by speeding). So lower risk than most other places, but the liability if you lose can be devastating.</p>\n<p>Are Nonlinear and its employees LPPFs here? I'm not opining beyond noting that is non-obvious to me. One could view this more as a dispute over, e.g., alleged non-provision of vegan food to staff, which doesn't strike me as a matter of public concern.</p>\n", "parentCommentId": "bLsWTx9afT4Ks7N2D", "user": {"username": "Jason"}}, {"_id": "prY2bsBHhyxCcQmtQ", "postedAt": "2023-12-21T06:05:05.869Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I recognize that there is all kinds of relevant context, and I really don't mean this as some kind of cheap \"gotcha\" or whatever, and think there are a bunch of ways in which this is reasonable, but Nonlinear did sound like they were claiming that this was a slam-dunk case in their email to us:&nbsp;</p><blockquote><p>Given the irreversible damage that would occur by publishing, it simply is inexcusable to not give us a bit of time to correct the libelous falsehoods in this document, and if published as is we intend to pursue legal action for libel against Ben Pace personally and Lightcone for the maximum damages permitted by law. <strong>The legal case is unambiguous</strong> and publishing it now would both be unethical and gross negligence, causing irreversible damage.</p></blockquote><p>I do think this mattered quite a bit for at least my reaction (though it's more that Ben's reaction here mattered).&nbsp;</p><p>Again, I do think there are ways in which saying this kind of thing is understandable, especially under time pressure, and also I am not an expert in libel law, but Nonlinear claiming that the legal case was unambiguous, despite me being reasonably confident that it wasn't, was one of the things that made me interpret this as more of a bluff and an intimidation tactic than a serious attempt to fairly use the legal tools available to achieve a just outcome.</p>", "parentCommentId": "peercGAHpqB6W8yPg", "user": {"username": "Habryka"}}, {"_id": "8JessNviaGfZia5Sa", "postedAt": "2023-12-21T06:07:41.840Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I’m not sure how this would contradict my point. You don’t think the threat was reasonable because you don’t think the case was a slam dunk. If you thought they actually had a slam dunk case against you and were virtually guaranteed to win via summary judgment, do you think a libel suit would be a reasonable threat?</p>\n", "parentCommentId": "prY2bsBHhyxCcQmtQ", "user": {"username": "TracingWoodgrains"}}, {"_id": "wdkdc3tWmhCGwJDpx", "postedAt": "2023-12-21T06:17:39.904Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Do you mean “would win” or “would lose” the suit? If the former, the two sentences seem contradictory?</p>\n", "parentCommentId": "peercGAHpqB6W8yPg", "user": {"username": "bec_hawk"}}, {"_id": "msBSBReWk2kDsqfGc", "postedAt": "2023-12-21T06:24:55.808Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>What do you mean?</p>\n<p>People who think Lightcone would win (ie “no libel”) tend to treat the suit as a threat simply to waste their time and money. I haven’t seen many people who strongly think Nonlinear would win (ie “libel”) but that threatening a (winning) suit would be wrong of them.</p>\n", "parentCommentId": "wdkdc3tWmhCGwJDpx", "user": {"username": "TracingWoodgrains"}}, {"_id": "TMqp3guPDLsGrvFYa", "postedAt": "2023-12-21T06:29:42.661Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>My statement stands even on a negligence standard. It's even harder to sue as a pubic figure, but truth is an absolute defense regardless.&nbsp;</p>", "parentCommentId": "nFzuWmZck7Jx5daZd", "user": {"username": "Bluefalcon"}}, {"_id": "x3wzksiLNRtt2RNX5", "postedAt": "2023-12-21T07:04:57.304Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Oh I see, I misread the proper nouns</p>\n", "parentCommentId": "msBSBReWk2kDsqfGc", "user": {"username": "bec_hawk"}}, {"_id": "LyGjHx3r5XRDKkxsB", "postedAt": "2023-12-21T08:11:32.646Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>If they actually had a slam dunk case, I would react somewhat differently, though still perceive a libel suit in that context as a very aggressive thing to do.&nbsp;</p><p>If Nonlinear had accurately represented their chances of winning, then I would have perceived it as less of an intimidation attempt (like, if the Nonlinear email said \"we aren't confident we would win a libel suit, but given the stakes for us we have no choice\", I do think that would have caused me to perceive the email pretty differently).</p><p>Relatedly, if I thought that the case was obviously a slam dunk, and they had said so, that also would have felt less like intimidation to me. It would have still been a kind of risky threat, but as <a href=\"https://forum.effectivealtruism.org/users/jason-1?mention=user\">@Jason</a> pointed out in <a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went?commentId=PvCK2FHNsXYrQwy7w\">another comment on this post</a>, one of the most pernicious problems with libel suits is invoking the threat of them, without actually ever having to pay up on the cost of going through with them, and overstating your chances of success is correlated with that.</p><p>I do also think that a lawsuit that was very likely to succeed would be correlated with having more of an ethical case (not strongly, but at least somewhat).</p>", "parentCommentId": "8JessNviaGfZia5Sa", "user": {"username": "Habryka"}}, {"_id": "Pbqs8Dortypw8ZrbY", "postedAt": "2023-12-21T09:24:35.636Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I feel like we should also be discussing FTX here.  My model of the Lightcone folks is something like:</p>\n<ol>\n<li>\n<p>They kinda knew SBF was sketchy.</p>\n</li>\n<li>\n<p>They didn't do anything because of diffusion of responsibility (and maybe also fear of reputation warring).</p>\n</li>\n<li>\n<p>FTX fraud was uncovered.</p>\n</li>\n<li>\n<p>They resolved to not let diffusion of responsibility/fear of reputation warring stop them from sharing sketchiness info in the future.</p>\n</li>\n</ol>\n<p>If you grant that the Community Health Team is too weak to police the community (they didn't catch SBF), and <em>also</em> that a stronger institution may <em>never</em> emerge (the FTX incident was insufficient to trigger the creation of a stronger institution, so it's hard to imagine what event <em>would</em> be sufficient), there's the question of what \"stopgap norms\" to have in place until a stronger institution <a href=\"https://forum.effectivealtruism.org/posts/5dW9p5EahtfhdiSKF/closing-notes-on-nonlinear-investigation?commentId=zPdvJDH6B7EDnB5Ld\">hypothetically</a> emerges.</p>\n<p>Even if you think Lightcone misfired <em>here</em> -- If you add FTX in your dataset too, then the \"see something? say something!\" norm starts looking better overall.</p>\n<p>With regard to explicit agreements: One could also argue from the other direction.  No one in EA explicitly agreed to safeguard the reputation of other EAs.  You say: \"If individuals want to give a company a bad review, they can do so publicly online or privately to whomever they want.\"  Do the ethics of \"giving Nonlinear a bad review\" change depending on whether the person writing the bad review is a person in the EA community or outside of it?  Depending on whether the bad review is written on the EA Forum vs some other website?</p>\n<p>Suppose someone raised their hand and offered to work as an investigative journalist funded by and for the EA community.  It seems fairly absurd to tell e.g. an investigative journalist from ProPublica that they're only allowed to cover subjects who explicitly agreed to be covered.  Why would such a hypothetical EA-funded investigative journalist be any different?</p>\n<p>The best argument I can think of against such an EA investigative journalist is that it seems unfair to pick on people who are putting so much time and money towards doing good.  However, insofar as EAs involve themselves in public issues, public scrutiny will often be warranted.  I think the best policy would be: the journalist's job is to cover people both inside <em>and</em> outside the EA community, who are working in areas of public <em>and</em> EA interest.  They aspire to neutrality in their coverage, so the valence of their stories isn't affected by a person's EA affiliation.</p>\n<p>We should also discuss what \"stopgap norms\" to have in place until something actually happens, because if FTX is any guide, nothing will ever happen.  (<strong>Perhaps the simplest stopgap norm is</strong>: If Ben Pace is concerned with Nonlinear, he should hire a pro investigative journalist on the spot to look into it.  This looks like a straightforward arbitrage anyway, since Ben says he values his time at $800K/year.)</p>\n", "parentCommentId": "Kk7r8HW3Strm5rNgR", "user": {"username": "chinscratch"}}, {"_id": "rai4WiTHwZdXNNtdW", "postedAt": "2023-12-21T10:32:51.838Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>This is a weaker defense than it sounds: a statement can be true while also not turning out to be something you can convince a court is most likely to be true.</p>\n", "parentCommentId": "TMqp3guPDLsGrvFYa", "user": {"username": "Jeff_Kaufman"}}, {"_id": "9ufeANEaddBwbqYDo", "postedAt": "2023-12-21T11:28:10.789Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>This looks like a straightforward arbitrage anyway, since Ben says he values his time at $800K/year</p></blockquote><p>nit: I don't know what Ben values his times at, though my guess is it's generally not $800k/yr. Ben just said that he would consider doing this kind of work for $800k/year. This kind of work is really quite stressful, so it likely comes a premium compared to other kinds of work, and might be more expensive than how much Ben otherwise values his time, I am confident it would for the great majority of people.&nbsp;</p><p>My guess is most people would charge substantially more money to take on a dangerous job, or one they really don't enjoy, or one that involves a lot of pain and stress than they would usually.&nbsp;</p><p>(Separately, I don't currently know of investigative journalists you can hire this way. Hiring an investigative journalist for a bunch of EA stuff was one of the primary things I was arguing for at the most recent EA Coordination Forum. I think it's a great idea, but it's not a great stopgap norm because it's genuinely quite hard to hire for, or at least I don't super feel capable of doing it. Financially I would be willing to contribute quite a lot of money from a mixture of Lightcone, grantmaking, and personal funds)</p>", "parentCommentId": "Pbqs8Dortypw8ZrbY", "user": {"username": "Habryka"}}, {"_id": "AznCEiJtqQaxiTDib", "postedAt": "2023-12-21T12:36:04.287Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Asking out of ignorance here, as I was only exposed to the general news version and not EA perspectives about FTX. What difference would it have made if FTX fraud was uncovered before things crashed? Is it really that straightforward to conclude that most of the harm done would have been preventable?</p>\n", "parentCommentId": "Pbqs8Dortypw8ZrbY", "user": {"username": "VictorW"}}, {"_id": "ARpBic9zGBQAo5y5o", "postedAt": "2023-12-21T12:47:13.024Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I disagree that they should necessarily sue if they can win.</p>\n<p>NL suing would cause further controversy and damage to their reputation.</p>\n<p>Lawsuits should be a weapon of last resort; in this case, it remains plausible that either Lightcone will eventually apologize, or that NL can win over the community. (Arguably they are in the process of doing so?)</p>\n<p>A lawsuit is a negative-sum game for the EA community, due to the substantial lawyer fees; depending on the damages, it could be financially negative even for the winner.</p>\n<p>In the event of a successful lawsuit, I believe we should think very mildly poorly of NL, and <strong>extremely</strong> poorly of Lightcone.</p>\n", "parentCommentId": "bLsWTx9afT4Ks7N2D", "user": {"username": "iamasockpuppet"}}, {"_id": "HaiyhvYdcbcpQHHw5", "postedAt": "2023-12-21T13:03:45.006Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I believe that Nonlinear would win, and that actually doing so as of now would be <a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went?commentId=ARpBic9zGBQAo5y5o\">mildly wrong.</a></p>\n<p>It’s worth distinguishing between the threat they made and bringing the actual lawsuit; in this comment you talk about the lawsuit, but in your clarification below you talk about the threat of one. Even if I lay aside the obvious justification for the threat and only consider the possible harms, they’re so insignificant that I don’t think they’re worth considering; I feel like the threat was well justified.</p>\n", "parentCommentId": "peercGAHpqB6W8yPg", "user": {"username": "iamasockpuppet"}}, {"_id": "uGAPZcnuGgcH56HtW", "postedAt": "2023-12-21T13:06:25.192Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I'll respond to one aspect you raised that I think might be more significant than you realize. I'll paint a black and white picture just for brevity.</p>\n<p>If you're running organizations and do so for several years with dozens of employees across time, you <em>will</em> make poor hiring decisions at one time or another. While making a bad hire seems bad, avoiding this risk at all costs is probably a far inferior strategy. If making a bad hire doesn't get in the way of success and doing good, does it even make sense to fixate on it?</p>\n<p>Also, if you're blind to the signs before it happens, then you reap the consequences, learn an expensive lesson, and are less likely to make it in future, at least for that type of deficit in judgment. Sometimes the signs are obvious after having made an error, though occasionally the signs are so well hidden that anyone with better judgment than you could have still have made the same mistake.</p>\n<p>The underlying theme I'm getting at is that embracing mistakes and imperfection is instrumental. Although many EAs might wish that we could all just get hard things right the first time all the time, that's not realistic. We're flawed human beings and respecting the fact of our limitations is far more practical than giving into fear and anxiety about not having ultimate control and predictability. If anything, being willing to make mistakes is both rational and productive compared to other alternatives.</p>\n", "parentCommentId": "kJJ7Hbo6zxHZtTKyF", "user": {"username": "VictorW"}}, {"_id": "dyuxtchAyyewrNpFS", "postedAt": "2023-12-21T13:13:45.740Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I can definitely be persuaded of this, and that’s in line with the conclusion I was aiming towards in my last section: lawsuits are a last resort and a sign of an embarrassing failure to resolve disputes any other way. The EA community prides itself on having better-than-median approaches to these things, so it can and should find a satisfactory resolution that does not involve an actual lawsuit.</p>\n", "parentCommentId": "HaiyhvYdcbcpQHHw5", "user": {"username": "TracingWoodgrains"}}, {"_id": "qZBZbas73sujFLDBw", "postedAt": "2023-12-21T13:55:14.293Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think the claim is not that fraud would have been uncovered, but rather that rumors about SBF acting deceptively would have been shared. (See e.g. <a href=\"https://forum.effectivealtruism.org/posts/BNKBJs4RJsA8FtdWE/a-personal-reflection-on-sbf\">this post</a> as an example of what might have been shared.)</p>", "parentCommentId": "AznCEiJtqQaxiTDib", "user": {"username": "Ben_West"}}, {"_id": "zktgNjv9RyQoz5spY", "postedAt": "2023-12-21T14:03:56.494Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Concretely, I sometimes hear organization leaders say that they choose to have their organization not be \"EA\" because doing so opens them to criticism from random people on the EA Forum, and this doesn't occur if they just describe themselves as working on \"alternative proteins\" or whatever.</p><p>(Although in this particular case, it's not clear to me that Ben Pace wouldn't have chosen to investigate Nonlinear if they didn't self describe as \"EA\". It seems like his investigation was triggered by them using Lightcone.)</p>", "parentCommentId": "Kk7r8HW3Strm5rNgR", "user": {"username": "Ben_West"}}, {"_id": "HBJuGJ9qjq4A5BMqx", "postedAt": "2023-12-21T14:49:26.931Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>whether there should be a justice system within the EA/Rationality community and whether Lightcone can self-appoint into the role of community police</p></blockquote><p>These are two different questions!&nbsp;</p><p>EA already has a justice system of sorts- the CEA Community Health Team. Ben chose to do this because <a href=\"https://forum.effectivealtruism.org/posts/5dW9p5EahtfhdiSKF/closing-notes-on-nonlinear-investigation#On_the_CEA_Community_Health_Team__and_the_EA_ecosystem_in_general_\">he thought it was ineffective.</a> The second question should instead be, whether Lightcone can self-appoint themselves as a replacement for the CHT.</p><p><s>The fact that somebody thought the CHT was ineffective and tried to replace it, then immediately faceplanted, makes me more confident in the actually existing CHT. (In particular, if Alice did indeed lie to Ben, it's then pretty likely that she said she didn't trust the CHT/didn't want info shared with them because they would fact-check her claims.)</s></p>", "parentCommentId": "Kk7r8HW3Strm5rNgR", "user": {"username": "iamasockpuppet"}}, {"_id": "HrrTRjNiJuW8vHgaY", "postedAt": "2023-12-21T15:03:58.621Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Presumably you're looking at some sort of arbitration? Here's the chaIlenge I see: in general, the EA community seems very hesitant to bring outsiders into this sort of thing. However, it may often be difficult to find insiders who would be accepted by all as truly neutral, who also have the necessary skillset and bandwidth.</p><p>This <i>is </i>a favorable situation for arbitration from a structural point of view -- Lightcone and Nonlinear seem to be roughly the same weight, by which I mean that their ability to present their case to an arbitrator seems roughly equal and that neither seems vastly more powerful in a way that risks an arbitrator deferring to them. In addition, both are probably in a position to pay for the costs of arbitration if they lose. Under those circumstances, some sort of private dispute resolution is viable in a way that it wouldn't be if (e.g.) Open Phil was one of the disputants.</p>", "parentCommentId": "dyuxtchAyyewrNpFS", "user": {"username": "Jason"}}, {"_id": "GQmWrkEfpKE8KYErA", "postedAt": "2023-12-21T15:28:35.995Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>Even if you think Lightcone misfired <i>here</i> -- If you add FTX in your dataset too, then the \"see something? say something!\" norm starts looking better overall.</p></blockquote><p>No, I don't think it does. You also need to assume that a \"see something? say something!\" rumor mill would have actually had any benefit for the FTX situation. I'm pretty sure that's false, and I think it's pretty plausible it would be harmful.</p><p>(1) The fraud wouldn't have become publicly known under this norm, so I don't think this actually helps.</p><p>(2) I don't think it would be correct for EA to react strongly in response to the rumors about SBF- there are similar rumors or conflicts around a very substantial number of famous people, e.g. Zuckerberg vs. the Winklevoss Twins.</p><p>(3) Most importantly, how we get from \"see something? say something?\" to \"the billionaire sending money to everybody, who has a professional PR firm, somehow ends up losing out\" is just a <strong>gigantic</strong> question mark here. To me, the outcome here is that SBF now has a mandate to drive anybody he can dig up or manufacture dirt on out of EA. (I seem to recall that the sources of the rumors about him went to another failed crypto hedge fund that got sued; I can't find a source, but even if that didn't actually happen it would be easy him to <i>make</i> that happen to Lantern Ventures.) (I expect that the proposed \"EA investigative journalist\" would have probably been directly paid by SBF in this scenario.)</p>", "parentCommentId": "Pbqs8Dortypw8ZrbY", "user": {"username": "iamasockpuppet"}}, {"_id": "Zrgtv6bPrDazNvWGs", "postedAt": "2023-12-21T15:43:40.935Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>(1) The fraud wouldn't have become publicly known under this norm, so I don't think this actually helps.</p>\n</blockquote>\n<p>If EA disavowed SBF, he wouldn't have been able to use EA to launder his reputation.</p>\n<blockquote>\n<p>(2) I don't think it would be correct for EA to react strongly in response to the rumors about SBF- there are similar rumors or conflicts around a very substantial number of famous people, e.g. Zuckerberg vs. the Winklevoss Twins.</p>\n</blockquote>\n<p>In this case it would've been correct, because the rumors were pointing at something real.  We know that with the benefit of hindsight.  One has to weigh false positives against false negatives.</p>\n<p>I'm not saying rumors alone are enough for a disavowal, I'm saying rumors can be enough to trigger investigation.</p>\n<blockquote>\n<p>(3) Most importantly, how we get from \"see something? say something?\" to \"the billionaire sending money to everybody, who has a professional PR firm, somehow ends up losing out\" is just a gigantic question mark here. To me, the outcome here is that SBF now has a mandate to drive anybody he can dig up or manufacture dirt on out of EA. (I seem to recall that the sources of the rumors about him went to another failed crypto hedge fund that got sued; I can't find a source, but even if that didn't actually happen it would be easy him to make that happen to Lantern Ventures.) (Similarly, I expect that such an \"EA investigative journalist\" would have probably been directly paid by SBF, had one existed.)</p>\n</blockquote>\n<p>I think a war between SBF and EA would have been good for FTX users -- the sooner things come to a head, the fewer depositors lose all their assets.  It also would've been good for EA in the long run, since it would be more clear to the public that fraud isn't what we're about.</p>\n<p>Your point about conflict of interest for investigative journalists is a good one.  Maybe we should fund them anonymously so they don't know which side their bread is buttered on.  Maybe the ideal person is a freelancer who's confident they can find other gigs if their relationship with EA breaks down.</p>\n", "parentCommentId": "GQmWrkEfpKE8KYErA", "user": {"username": "chinscratch"}}, {"_id": "kaXqzAYkhE6oHYxST", "postedAt": "2023-12-21T15:51:50.205Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>You touched on something here that I am coming to see as the key issue: whether there should be a justice system within the EA/Rationality community and whether Lightcone can self-appoint into the role of community police.&nbsp;</p></blockquote><p>Pretty much every community has norms and means of enforcing those norms (\"social control\" to the sociologists). Those means may be more or less formal, but I don't think communities are very viable without some means of norm enforcement. I think \"justice system\" implies something significantly different than what has happened here: e.g., the US justice system can throw me in a dungeon and take away all my money. To use a private example, if I were Catholic, the Catholic justice system could excommunicate me, defrock me as a priest, etc. A campus justice system can expel or fire me.</p><p>What happened here feels more like gossip on steroids. Lightcone said bad things about Nonlinear, which had the effect of decreasing community opinion of Nonlinear. That might in turn have concrete adverse effects on Nonlinear. But as far as I know: Lightcone did not, and could not, directly impose consequences on Nonlinear unmediated by the actions of the community.</p><p>Likewise, I don't think \"community police\" is right, at least in the frame of modern Western societies. The police and prosecutors (collectively \"police\") have the <i>exclusive </i>ability to charge people with crimes. They have the exclusive ability to use certain investigative tools, like search warrants. Although everyone has the ability to investigate possible wrongdoing in some capacity (e.g., journalists), the police are generally recognized as having a preeminent role. For example, if there is a police investigation into certain conduct, other processes like private organizations and civil investigations are usually expected to step aside to avoid disrupting the police investigation.</p><p>Rather, I think Lightcone's role here is more akin to the prosecutorial role in classical Athens. <a href=\"http://law2.umkc.edu/faculty/projects/ftrials/socrates/greekcrimpro.html\">Any citizen could bring a criminal prosecution. In fact, there were no public prosecutors.</a> There was a preliminary stage, but then the matter was tried before a large jury of citizens (e.g., 500 for the most famous trial, that of Socrates). It's not clear to me that Lightcone has claimed any role in norm enforcement that is superior to the role they would believe appropriate for any community member. True, it championed the cause of A and C, but that was a result of a voluntary decision among A, C, and Lightcone. Similar things happened in classical Athens, and Lightcone hasn't appointed itself sole champion of people with grievances. What we are seeing on the Forum is vaguely like the deliberations of the citizen jury.&nbsp;</p><p>I'm not seeing a clear alternative to \"private\" prosecution of norm violations in such a decentralized community. Who is in a place to be the public prosecutor? One could argue for CHSP, but it is merely another private actor with no real democratic legitimacy and some serious conflicts of interests (e.g., due to being part of CEA, due to so much of CEA's funding coming from Open Phil). I do not like the alternative of their being no norm enforcement except what is available through the legal system.</p><p>Although I can envision alternatives to adjudication by the whole community, I don't think we can criticize the abstract idea of bringing disputes to the whole community for adjudication at this time. In such a decentralized structure, sanctions for norm violations are imposed by community actors in their individual capacities. In other words, everyone who hears of Lightcone's charges has to decide for themselves whether they will change the way they interact with Nonlinear (and/or Lightcone) as a result. Likewise, there is no adjudicatory authority who would publicly warn everyone else of the risks of associating with an organization that has committed serious norm violations. Whatever its flaws, public adjudication seems to be the only real option at present for a certain class of matters.</p><blockquote><p>Emerson talking about suing for libel-- his right-- was seen as defection from the norms which that Lightcone employee thinks should apply to the whole EA/rationality community. When did Emerson opt into following these norms, being judged by these norms? Did any of us?&nbsp;</p></blockquote><p>Fair enough, but the flipside is that Lightcone didn't opt in to following your proposed norm of <i>not criticizing people for threatening to file defamation suits</i>. Lightcone criticizing Emerson for his speech is Lightcone's right. It is your right (and mine, and everyone else's) to decide not to associate with Lightcone, Nonlinear, both, or neither based on your assessment of their various actions.</p>", "parentCommentId": "Kk7r8HW3Strm5rNgR", "user": {"username": "Jason"}}, {"_id": "mFTyMkKzqmXQDzao7", "postedAt": "2023-12-21T16:01:07.224Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>I think a war between SBF and EA would have been good for FTX users</p></blockquote><p>To be clear, what I'm saying is that SBF would just flat out win, and really easily too, I wouldn't expect a war. The people who had criticized him would be driven out of EA on various grounds; I wouldn't expect EA as a whole to end up fighting SBF; I would expect SBF would probably end up with <i>more</i> control over EA than he had in real life, because he'd be able to purge his critics on various grounds.</p><blockquote><p>Your point about conflict of interest for investigative journalists is a good one. Maybe we should fund them anonymously so they don't know which side their bread is buttered on.</p></blockquote><p>I don't think that's enough; you'd need to not only fund some investigators anonymously, you'd also need to (a) have good control over <i>selecting</i> the investigators, and (b) ban <i>anybody</i> from paying &nbsp;or influencing investigators non-anonymously, which seems unenforceable. (Also, in real life, I think the investigators would eventually have just assumed that they were being paid by SBF or by Dustin Moskovitz.)</p>", "parentCommentId": "Zrgtv6bPrDazNvWGs", "user": {"username": "iamasockpuppet"}}, {"_id": "ayEpSLkXRmreBxEqC", "postedAt": "2023-12-21T16:05:47.258Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>This is an excellent comment.</p>\n", "parentCommentId": "kaXqzAYkhE6oHYxST", "user": {"username": "willbradshaw"}}, {"_id": "SCZwZ2MhosPeQd5pG", "postedAt": "2023-12-21T16:35:53.553Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Victor - this is total victim-blaming. Good people trying to hire good workers for their organizations can be exploited and ruined by bad employees, just as much as good employees can be exploited and ruined by bad employers.&nbsp;</p><p>You said 'If making a bad hire doesn't get in the way of success and doing good, does it even make sense to fixate on it?'</p><p>Well, we've just seen an example of two very bad hires ('Alice' and 'Chloe') almost ruin an organization permanently. They very much got in the way of success and doing good. I would not wish their personalities on any other employers. Why would you? &nbsp;</p><p>We shouldn't 'embrace mistakes' if we can avoid them. And keeping bad workers anonymous is a way of passing along those hiring mistakes to other future employers without any consideration for the suffering and chaos that those bad workers are likely to impose, yet again.</p>", "parentCommentId": "uGAPZcnuGgcH56HtW", "user": {"username": "geoffreymiller"}}, {"_id": "kzcRqKNaAgFhfibfP", "postedAt": "2023-12-21T16:49:30.806Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Jeff -- actual 'whistleblowers' make true and important allegations that withstand scrutiny and fact-checking. I agree that legit whistleblowers need the protection of anonymity.&nbsp;</p><p>But not all disgruntled ex-employees with a beef against their former bosses are whistleblowers in this sense. Many are pursuing their own retaliation strategies, often turning trivial or imagined slights into huge subjective moral outrages -- and often getting credulous friends, family, journalists, or activists to support their cause and amplify their narrative.</p><p>It's true that most EAs had never heard of 'Alice' or 'Chloe', and didn't care about them, until they made public allegations against Nonlinear via Ben Pace's post. And then, months later, many of us were dismayed and angry that many of their allegations turned out to be fabricated or exaggerated -- harming Nonlinear, wasting thousands of hours of our time, and creating schisms within out community.</p><p>So, arguably, we have a case here of two disgruntled ex-employees retaliating against a former employer. Why should their retaliation be protected by anonymity?</p><p>Conversely, when Kat Woods debunked many of the claims of Ben Pace (someone with much more power and influence in the EA/Rationalist community), why was she not considered a 'whistleblower' calling out his bullying and slander?</p><p>Yet again, the gender bias in 'moral typecasting' becomes important, as I mentioned in a previous comment <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/?commentId=T62vJyTkNepNYLvtw\">here</a>.&nbsp;</p>", "parentCommentId": "XGtBvwXWL9vj8psQC", "user": {"username": "geoffreymiller"}}, {"_id": "LHHxDcPocA3Qzs2JH", "postedAt": "2023-12-21T17:08:58.765Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I really don't know how the norms of professional investigative journalism work, but I imagine a lot hinges on whether the source of concern / subject of the piece is the repository of a large amount of relevant information about the central claims.&nbsp;</p><p>e.g. the point is \"how much work do you need to put in to make sure your claims are accurate\" and then sometimes that implies \"no need to get replies from the subject of the piece because you can get the information elsewhere\" and sometimes that implies \"you have to engage a bunch with the subject of the piece because they have relevant information.\"</p>", "parentCommentId": "ayDmKS3FnomfL2nkp", "user": {"username": "ChanaMessinger"}}, {"_id": "g4T3rJLXwsjK7SLZM", "postedAt": "2023-12-21T17:13:51.563Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I maintain, of course, that the cleanest and best resolution would be for LC to back off of trying to litigate every specific claim to its maximum capacity and instead acknowledge the ways going on a hunt only for negative information and then refusing to pause to consider exculpatory evidence (including a point they agree was exculpatory on an accusation they agree was significant) poisoned the well in the dispute as a whole—even expecting them to continue to believe they were more-or-less correct about NL.</p>\n<p>As things stand, it looks almost inevitable that Ben’s next post will focus primarily on relitigating specific claims and aiming to prove he really was right about NL. Oliver has, however, indicated at least some inclination towards the idea that if that does not persuade people, they will be more open to considering the procedural points I raise here. I believe him in that and am broadly optimistic that what I anticipate will be a lukewarm response to that further litigation will open the door to a clean resolution.</p>\n<p>Failing a broadly community-satisfactory outcome from that, it does seem like an ideal case for arbitration or something that fills the same role, yes.</p>\n", "parentCommentId": "HrrTRjNiJuW8vHgaY", "user": {"username": "TracingWoodgrains"}}, {"_id": "dfpg5N2wwEvsygaDF", "postedAt": "2023-12-21T17:28:03.012Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Unlikely, but to the extent it's true it mostly favors the defendant. Burden of proof is on the plaintiff.</p>", "parentCommentId": "rai4WiTHwZdXNNtdW", "user": {"username": "Bluefalcon"}}, {"_id": "LBJ2avjyDQfbwXmfp", "postedAt": "2023-12-21T17:30:08.607Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>In the event of a successful lawsuit, we should consider NL fully vindicated and not engage in this sort of reputational retribution for daring to defend their rights. Actions that successfully punish wrongdoers are generally not negative sum because they discourage future misconduct. This is true even where it's negligent and not malicious; knowing one may face consequences encourages greater care in the future.&nbsp;</p><p>&nbsp;</p><p>Edit: I can see reasons it <i>might</i> be unfair to pursue a defamation suit against an unsophisticated/under-resourced party where it's a really close call legally. But we are talking about legally sophisticated parties who effectively spent $ 6 figures' worth of their time on this; the legal fees are chump change compared to what they've already put in.&nbsp;</p>", "parentCommentId": "ARpBic9zGBQAo5y5o", "user": {"username": "Bluefalcon"}}, {"_id": "dTHiMKEaLPTsM9Yj7", "postedAt": "2023-12-21T17:40:36.789Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Reasonable disagreement, I think, should be as in the legal sense for doubt: disagreement based on clear reasons, not disagreement from people who are generally reasonable. I’ve had a lot of complaints about my “unambiguous” claims being ambiguous, very few reasons provided as to why they are, and no compelling ones (but of course I would say that). I’d see a lot more use to engaging with your point if instead of simply asserting that people could disagree, you explain precisely which you disagree with and why.</p>\n", "parentCommentId": "hNpLAoYKoSwvFuDxs", "user": {"username": "TracingWoodgrains"}}, {"_id": "SBswbDYJEMAqyNwcJ", "postedAt": "2023-12-21T17:47:06.182Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>This is helpful; thanks. It brings up something I have been internally musing about (not specifically about your post or comments) --</p><p>For this exercise, let's (roughly) condense the criticism of Lightcone into \"They have acted like a partisan advocate, rather than a neutral truthseeker.\" I can think of three ways to go from there, which have a good bit of overlap:</p><ul><li>\"We expect everyone to be a neutral truthseeker here; partisan advocacy is against our norms.\"</li><li>\"We accept some degree of advocacy from both sides here, but Lightcone went way over the line of permissible advocacy here.\"</li><li>\"A core problem is that Lightcone presented itself as a neutral truthseeker conducting an 'investigation,' when in fact its actions were that of a partisan advocate.\"</li></ul><p>As someone who is focused more about setting norms in the future than arbitrating Lightcone's specific conduct per se, it might be helpful for future norm-building if Lightcone's critics are clear about the extent to which each of these three pathways explains how they believe that Lightcone went astray. My <i>guess </i>is that it is some combination of number 2 and number 3 for most people, but I don't actually know that.</p>", "parentCommentId": "g4T3rJLXwsjK7SLZM", "user": {"username": "Jason"}}, {"_id": "rqGE3gf8c4KFczNvx", "postedAt": "2023-12-21T17:58:49.440Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>actual 'whistleblowers' make true and important allegations that withstand scrutiny and fact-checking. I agree that legit whistleblowers need the protection of anonymity.</p>\n</blockquote>\n<p>I think that's too strong? For example, under my amateur understanding of <a href=\"https://malegislature.gov/Laws/GeneralLaws/PartI/TitleXXI/Chapter149/Section148A\">MA</a> <a href=\"https://malegislature.gov/Laws/GeneralLaws/PartI/TitleXXI/Chapter151/Section19\">law</a> I don't see anything about the anti-retailation provisions being conditional requiring a complaint to withstand scrutiny and fact-checking.  And if this were changed to allow employers to retaliate in cases where employees claims were not sustained then I think we'd see, as a chilling effect, a decrease in employees raising true claims.</p>\n", "parentCommentId": "kzcRqKNaAgFhfibfP", "user": {"username": "Jeff_Kaufman"}}, {"_id": "t4igrMGfEY6YGKLMk", "postedAt": "2023-12-21T18:03:37.345Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>To be clear, what I'm saying is that SBF would just flat out win, and really easily too, I wouldn't expect a war. The people who had criticized him would be driven out of EA on various grounds; I wouldn't expect EA as a whole to end up fighting SBF; I would expect SBF would probably end up with more control over EA than he had in real life, because he'd be able to purge his critics on various grounds.</p>\n</blockquote>\n<p>What would it take for EA to become the kind of movement where SBF would've lost?</p>\n<blockquote>\n<p>I don't think that's enough; you'd need to not only fund some investigators anonymously, you'd also need to (a) have good control over selecting the investigators, and (b) ban anybody from paying  or influencing investigators non-anonymously, which seems unenforceable. (Also, in real life, I think the investigators would eventually have just assumed that they were being paid by SBF or by Dustin Moskovitz.)</p>\n</blockquote>\n<p>I agree that the ideal proposal would have answers here.  However, this is also starting to sound like a proof that there's no such thing as a clean judicial system, quality investigative journalism, honest scientific research into commercial products like drugs, etc.  Remember, it's looking like SBF is going to rot in jail despite all of the money he gave to politicians.  The US judicial system is far from perfect, but let's not let the perfect be the enemy of the good.</p>\n<p>If EA just isn't capable of trustworthy institutions for some reason, maybe there's some clever way to outsource to an entity with a good track record?  Denmark, Finland, and Norway seem to do quite well in international rankings based on a quick Google: <a href=\"https://images.transparencycdn.org/images/CPI2022_Mapindex_EN.jpg\">1</a>, <a href=\"https://worldjusticeproject.org/rule-of-law-index/global/2023\">2</a>.  Perhaps OpenAI should've incorporated in Denmark?</p>\n", "parentCommentId": "mFTyMkKzqmXQDzao7", "user": {"username": "chinscratch"}}, {"_id": "X3b8HfBeKv5RmzTy6", "postedAt": "2023-12-21T18:08:02.438Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I’m suspicious that Lightcone has already been deterred.</p>\n<p>Even if they haven’t, we should prefer/pursue punishments that don’t involve setting a bunch of money on fire to pay lawyers, with a lawsuit as the last resort; we are not yet at that last resort, and probably won’t ever end up there.</p>\n", "parentCommentId": "LBJ2avjyDQfbwXmfp", "user": {"username": "iamasockpuppet"}}, {"_id": "Md3gdBR3BeRGBrvMF", "postedAt": "2023-12-21T18:22:30.138Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p><i>Writing in a personal capacity.</i></p><p>Hi Geoffrey, I think you raise a very reasonable point.</p><p>There’s some unfortunate timing at play here: 3/7 of the active mod team—Lizka, Toby, and JP—have been away at a CEA retreat for the past ~week, and have thus mostly been offline. In my view, we would have ideally issued a proper update by now on the earlier&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=7CnpbyrXbmNr3LqhP\"><u>notice</u></a>: “For the time being, please&nbsp;<strong>do not</strong> post personal information that would deanonymize Alice or Chloe.”</p><p>In lieu of that, I’ll instead publish one of my comments from the moderators’ Slack thread, along with some commentary. I’m hoping that this shows some of our thinking and adds to the ongoing discussion here.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefiuhrp6u0h9q\"><sup><a href=\"#fniuhrp6u0h9q\">[1]</a></sup></span>&nbsp;I’m grateful to yourself, <a href=\"https://forum.effectivealtruism.org/users/ivy-mazzola?mention=user\">@Ivy Mazzola</a>, <a href=\"https://forum.effectivealtruism.org/users/jason-1?mention=user\">@Jason</a>, <a href=\"https://forum.effectivealtruism.org/users/jeff_kaufman?mention=user\">@Jeff Kaufman</a> and others for helping push this conversation forward.</p><hr><p><i>Starting context: Majority of moderators in agreement that our current policy on doxing, “Revealing someone's real name if they are anonymous on the Forum or elsewhere on the internet is prohibited” (</i><a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_discourage__and_may_delete_or_edit_out_\"><i><u>link</u></i></a><i>), should apply in the Alice+Chloe case. (And that it should apply whether or not Alice and/or Chloe have exaggerated their allegations.)</i></p><blockquote><p><strong>Will</strong> (5 days ago)</p><p>I think what this comes down to for me is: If Kat Woods’ Forum username was pseudonymous, would we have taken down Ben’s post? (Or otherwise removed all references to Kat by her real name?)</p><p>If the answer to this is “yes,” then I don’t think Alice+Chloe should be deanonymized.</p><p>If the answer to this is “no,” then I think Alice+Chloe should be deanonymized.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefix0xuj58d1r\"><sup><a href=\"#fnix0xuj58d1r\">[2]</a></sup></span>&nbsp;(Because if we go with “no,” then this would mean that it’s fair game for Kat to go write a post now that shares information on two past employees whom she believes have spread falsehoods about Nonlinear, using these employees’ real names. Which is equivalent to deanonymizing Alice+Chloe.)</p><p>------</p><p>I'm concerned about setting a precedent of first-mover advantage. Like, I imagine there are EAs with mutual grievances out there, and if we set a precedent of, \"If you strike first, anonymously, then you can name the person you bear a grievance against whilst granting yourself anonymity immunity,\" then I think we're laying the foundations for a pretty awful dynamic.</p></blockquote><p>There was then commentary from a couple of the other moderators acknowledging that:</p><ul><li>Under our current policies, it is indeed fair game for Kat to write a post sharing information on those former employees using their real names, as long as that post doesn’t refer directly to Ben’s one. Which does seem like a weird technicality.</li><li>The three broad paths forward seem to be: 1) “give the first accuser the right to remain anonymous;” 2) “ban anonymous allegations altogether;” 3) “stick with our current policies, notwithstanding that there is that technicality.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefbzk95tooqz\"><sup><a href=\"#fnbzk95tooqz\">[3]</a></sup></span>”<ul><li>There’s since been the beginnings of a discussion on whether certain categories of anonymous allegations—notably, employees sharing information on employers—could be exceptions to the rule if the second path is taken.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefwwdw896bwf\"><sup><a href=\"#fnwwdw896bwf\">[4]</a></sup></span></li></ul></li></ul><p><i>Closing context: At the time of me posting this comment, inter-moderator discussion on the issue is inconclusive.</i></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fniuhrp6u0h9q\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefiuhrp6u0h9q\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The thinking shown will of course be skewed towards my personal view, over the views of other moderators.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnix0xuj58d1r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefix0xuj58d1r\">^</a></strong></sup></span><div class=\"footnote-content\"><p>A later comment of mine, which ties in here:</p><blockquote><p>I think it probably makes most sense to decide this at the policy level first, and then circle back to how to handle the Nonlinear case. Specifically, if we go with giving the first accuser anonymity rights at the policy level, then it follows that Alice and Chloe should remain anonymous. But if we decide that allegations should not be made anonymously, then we'll have to think of what to do with the Alice+Chloe allegations already out there.</p><p>[ETA: Like, since Alice and Chloe made their allegations expecting anonymity, I believe we should give their cases special treatment (if we go the route of not allowing anonymous allegations). This could just mean fully respecting their expectation. This could mean making difficult judgement calls in weighing up, for example, Alice's expectation for anonymity versus the magnitude of her exaggerations.]</p></blockquote></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnbzk95tooqz\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefbzk95tooqz\">^</a></strong></sup></span><div class=\"footnote-content\"><p>And notwithstanding that this technicality may well put an accused party in an uncomfortable position, where they believe they have good reason for writing a response “sharing information” post, but they also know that doing so likely means receiving some backlash (for implicitly deanonymizing their accuser).</p><p>My personal view is that this rules out the third path: I don’t think a fair set of policies would force someone into this kind of a lose-lose position.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnwwdw896bwf\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefwwdw896bwf\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In other words, one consideration is whether the benefit of allowing anonymous whistleblowing on the Forum—where the purpose of whistleblowing is in part to compensate for employer-employee asymmetry—outweighs the cost of not having first-accuser-second-accuser symmetry.</p></div></li></ol>", "parentCommentId": "x9zcFh9g2r7HdsLQH", "user": {"username": "Will Aldred"}}, {"_id": "kKJjhocgFCLLAMajo", "postedAt": "2023-12-21T18:35:13.398Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>What would it take for EA to become the kind of movement where SBF would've lost?</p></blockquote><p>I sorta feel like this is barking up the wrong tree, because: (a) the information that SBF was committing fraud was private and I cannot think of a realistic scenario where it would have become public, and (b) even if widely spread, the public information wouldn't have been sufficient.</p><p>Before FTX's fall, I'd remarked to several people that EA's association with crypto (compare e.g. Ben Delo) was almost certainly bad for us, as it's overrun with scams and fraud. At the time, I'd been thinking non-FTX scams affecting FTX or its customers, not FTX itself being fraudulent; but I do feel like the right way to prevent all this would have been to refuse any association between EA and crypto.</p><blockquote><p>However, this is also starting to sound like a proof that there's no such thing as a clean judicial system, quality investigative journalism, honest scientific research into commercial products like drugs, etc.</p></blockquote><p>Good point! I'm probably being overly skeptical here, on reflection.</p>", "parentCommentId": "t4igrMGfEY6YGKLMk", "user": {"username": "iamasockpuppet"}}, {"_id": "qqaMpXtGAqxxbRfpa", "postedAt": "2023-12-21T19:03:33.149Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Deterrence isn't merely about Lightcone being deterred from future action, but also about other parties that are considering saying potentially defamatory things regarding others. If they can see that past defamatory statements carried legal consequences, they may be more inclined to exercise greater care; thus harm from future defamatory statements could be avoided.</p>", "parentCommentId": "X3b8HfBeKv5RmzTy6", "user": {"username": "Brad West"}}, {"_id": "chbobgMhxpkgfTPMY", "postedAt": "2023-12-21T19:22:57.946Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>2) “ban anonymous allegations altogether;”&nbsp;</p></blockquote><p>I wouldn't classify Ben's post as containing <i>fully </i>anonymous allegations. There was a named community member who implicitly vouched for the allegations having enough substance to lay before the Forum community. That means there was someone in a position to accept social and legal fallout if the decision to post those allegations is proven to have been foolhardy. That seems to be a substantial safeguard against the posting of spurious nonsense.</p><p>Maybe having such a person identified didn't work out here, but I think it's worth distinguishing between this case and a truly anonymous situation (e.g., burner account registered with throwaway account doing business via Tor, with low likelihood that even the legal system could identify the actual poster for imposition of consequences).</p><blockquote><p>And notwithstanding that this technicality might put the accused party in an uncomfortable position, where they believe they have good reason for writing a response “sharing information” post, but they also know that doing so will likely make them the target of some severe backlash for implicitly deanonymizing their accuser.</p></blockquote><p>That could be a feature rather than a bug for reasons similar to those described above. Deanonymizing someone who claims to be a whistleblower is a big deal -- and arguably we should require an identified poster to accept the potential social and legal fallout if that decision wasn't warranted, as a way of discouraging inappropriate deanonymization.&nbsp;</p>", "parentCommentId": "Md3gdBR3BeRGBrvMF", "user": {"username": "Jason"}}, {"_id": "r4zKcPvzqsA4wExAh", "postedAt": "2023-12-21T19:32:14.824Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I agree that requiring that the claims be <i>sustained </i>would have a chilling effect. However, in many contexts, we don't extend protections to claims submitted in bad faith. For instance, we grant immunity from legal retaliation against people who file reports of child abuse . . . but that is usually conditioned on the allegations were made in good faith. If a reported individual can prove that the report was fabricated out of whole cloth, we don't shield the reporter from a defamation suit or other legal consequences.&nbsp;</p><p>Note that this is generally a subjective standard -- if the reporter honestly believed the report was appropriate, we shield the reporter from liability. This doubtless allows some bad actors to slip through with immunity. However, we believe that is necessary to avoid reporters deciding not to report out of fear that someone will Monday-morning quarterback then and decide that reporting was objectively unreasonable.</p><p>In your example, I suspect that knowingly filing a false report with a state agency is a crime in MA (as it is with a federal agency at the federal level), so there is at least some potential enforcement mechanism for dealing with malicious lies.</p>", "parentCommentId": "rqGE3gf8c4KFczNvx", "user": {"username": "Jason"}}, {"_id": "eWXRAgmm7uHEbELKY", "postedAt": "2023-12-21T19:41:29.598Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thanks for sharing this!</p>\n<p>I had a bunch of thoughts on this situation, enough that I wrote them up <a href=\"https://www.jefftk.com/p/pseudonymity-and-accusations\">as a post</a>. Unfortunately your response came out while I was writing and I didn't see it, but I think doesn't change much?</p>\n<p>In addition to your three paths forward, I see a fourth one: you extend the policy to have the moderators (or another widely-trusted entity) make decisions on when there should be exceptions in cases like this, and write a bit about how you'll make those decisions.</p>\n", "parentCommentId": "Md3gdBR3BeRGBrvMF", "user": {"username": "Jeff_Kaufman"}}, {"_id": "3KiBnkpa2ckh8aLL3", "postedAt": "2023-12-21T20:08:10.825Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Yeah, I agree with these considerations.&nbsp;</p><p>I am however not super sure how this is related to the specific claim at hand here, which was just about whether the journalists that TracingWoodgrains asked are accurately summarized as \"disagreeing with [the decision to not delay]\".&nbsp;</p><p>It seems to me is that at least one of the journalists thought it was a messy judgement call and didn't give a recommendation one way or another on the contested question. So it seems inaccurate to me to summarize them the way TracingWoodgrains did.</p><p>(The other journalist says:&nbsp;</p><blockquote><p>I think it depends a lot on the group's ability to provide evidence the investigators' claims are wrong. In a situation like that I would <i>really</i>&nbsp;press them on the specifics. They should be able to provide evidence fairly quickly. You don't want a libel suit but you also don't want to let them indefinitely delay the publication of an article that will be damaging to them. It is a tricky situation! I am not sure an investigative reporter would&nbsp;be able to help much more simply because what you're providing is a pretty vague account, though I totally understand the reasons why that's necessary.</p></blockquote><p>which I also don't think should be succinctly summarized in the same way)</p>", "parentCommentId": "LHHxDcPocA3Qzs2JH", "user": {"username": "Habryka"}}, {"_id": "cMfevG5kmZ2p9hmgm", "postedAt": "2023-12-21T20:30:05.762Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>If you have time, can you provide some examples of what you saw as evidence of wrongdoing?&nbsp;</p></blockquote><p>I didn't interpret any of these as evidence of the original wrongdoing, but these were the main things Kat did in her evidence thread that, in my opinion, muddled Nonlinear's defense:</p><ol><li>Lots of motte-and-bailey/strawmanning their critics, like claiming to refute an allegation but then providing evidence that they didn't do some other, more egregious thing, or saying that the only way something bad could have come out of their actions was that they were \"secretly evil\"</li><li>Selectively engaging only with comments that made them look good, and avoiding responding to comments that looked more incriminating</li><li>Abuse of quotation marks, such that most of the time when they claimed someone else said something, the other person had not actually said that thing, but something else that sounded like it, modulo Kat's interpretation.</li></ol><p>There was also the section where they may have fabricated allegations against Ben Pace to make a point that anyone can make anyone else sound bad, though I thought the analogy did not quite work and some people thought was deranged. But I'm not sure if that part is substantiated or not, because she has avoided responding to questions about it.</p><p>Also, this was not in the forum thread, but Kat declaring victory on Facebook and saying she has changed everyone's minds based on some questionable napkin math, while living in a bubble and engaging only with comments from people with whom she has shared the most flattering possible interpretation of events where people are witch hunting her for no reason.</p>", "parentCommentId": "qqJyHp3AEqsjxAKMJ", "user": {"username": "fish_are_friends"}}, {"_id": "uLvyJuq7t56cqwdYZ", "postedAt": "2023-12-21T20:39:55.920Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>What I think I'm hearing from you (and please correct me if I'm not hearing you) is that you feel conflicted by the thought that the efforts of good people with good intentions can be so easily be undone, and that you wish there were some concrete ways to prevent this happening to organizations, both individually and systemically. I hear you on thinking about how things could work better as a system/process/community in this context. (My response won't go into this systems level, not because it's not important, but because I don't have anything useful to offer you right now.)<br><br>I acknowledge your two examples (\"Alice and Chloe almost ruined an organization) and (keeping bad workers anonymous has negative consequences). I'm not trying to dispute these or convince you that you're wrong. What I am trying to highlight is that there is a way to think about these that doesn't involve requiring us to never make small mistakes with big consequences. I'm talking about a mindset, which isn't a matter of right or wrong, but simply a mental model that one can choose to apply.<br><br>I'm asking you to stash away your being right and whatever you perspective you think I hold for a moment and do a thought experiment for 60 seconds.<br>At t=0, it looks like ex-employee A, with some influential help, managed to inspire significant online backlash against organization X led by well-intentioned employer Z.<br>It could easily look like Z's project is done, their reputation is forever tarnished, their options have been severely constrained. Z might well feel that way themselves.<br>Z is a person with good intentions, conviction, strong ambitions, interpersonal skills, and a good work ethic.<br>Suppose that organization X got dismantled at t=1 year. Imagine Z's \"default trajectory\" extending into t=2 years. What is Z up to now? Do you think they still feel exactly the way they did at t=0?<br>At t=10, is Z successful? Did the events of t=0 really ruin their potential at the time?<br>At t=40, what might Z say recalling the events of t=0 and how much that impacted their overall life? Did t=0 define their whole life? Did it definitely lead to a worse career path, or did adaptation lead to something unexpectedly better? Could they definitely say that their overall life and value satisfaction would have been better if t=0 never played out that way?<br>In the grand scheme of things, how much did t=0 feeling like \"Z's life is almost ruined\" translate into reality?<br><br>If you entertained this thought experiment, thank you for being open to doing so.<br><br>To express my opinion plainly, good and bad events are inevitable, it is inevitable that Z will make mistakes with negative consequences as part of their ambitious journey of life. Is it in Z's best interests to avoid making obvious mistakes? Yes. Is it in their best interests to adopt a robust strategy such that they would never have fallen victim to t=0 events or similarly \"bad\" events at any other point? I don't think so necessarily, because: we don't know without long-term hindsight whether \"traumatic\" events t=0 lead to net positive changes or not; even if Z somehow became mistake-proof-without-being-perfect, that doesn't mean something as significant as t=0 couldn't still happen to them without them making a mistake; and lastly because being that robust is practically impossible for most people.<br>All this to say, without knowing whether \"things like t=0\" are \"unequivocally bad to ever let happen\", I think it's more empowering to be curious about what we can learn from t=0 than to arrive at the conclusion at t&lt;1 that preventing it is both necessary and good.</p>", "parentCommentId": "SCZwZ2MhosPeQd5pG", "user": {"username": "VictorW"}}, {"_id": "G2a2ggStCZmBEAyEp", "postedAt": "2023-12-21T21:36:14.334Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>So, arguably, we have a case here of two disgruntled ex-employees retaliating against a former employer. Why should their retaliation be protected by anonymity?</p></blockquote><p>Highlighting that is an important crux (and one on which I have mixed feelings). Not all allegations of incorrect conduct rise to the level of \"whistleblowing.\" A whistleblower brings alleged misconduct on a matter of public importance to light. We grant lots of protections in furtherance of that public interest, not out of regard for the whistleblower's private interests.</p><p>Is this a garden-variety dispute between an employer and two employees about terms of employment? Or is this a story about influential people allegedly using their power to mistreat two people who were in a vulnerable position which is of public import because it should update us on how much influence to allow those people?</p>", "parentCommentId": "kzcRqKNaAgFhfibfP", "user": {"username": "Jason"}}, {"_id": "jR65QWHBXEh4uEbPY", "postedAt": "2023-12-21T21:56:15.356Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Great journalists are getting laid off all the time these days. You could find any number of professional and highly accomplished journalists for a tiny fraction of $800k per year.&nbsp;</p>", "parentCommentId": "9ufeANEaddBwbqYDo", "user": {"username": "Stuart Buck"}}, {"_id": "mG6wskYaLSnDgZ2EZ", "postedAt": "2023-12-21T21:57:45.768Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>There may be a fifth, which could be seen as a bit of a cop-out.&nbsp;</p><p>It's not clear to me whether the mods claim jurisdiction over deanonymizing conduct <i>that doesn't happen on the Forum</i>. I think the answer here is that claiming such jurisdiction here would be inappropriate.&nbsp;</p><p>As far as I know, it wouldn't violate the rules of X, Facebook, or most other sites to post that \"[Real Names] have been spreading malicious lies about things that happened when they were Nonlinear employees.\" It certainly would not violate the rules of a state or federal court to do that in a court complaint. The alleged harm of Alice and Chloe spreading malicious lies about Kat, Emerson, and Nonlinear existed off-the-Forum prior to anything being published on the Forum. I don't see why Ben's act of including those allegations in a Forum post creates off-Forum obligations for Nonlinear et al. (or anyone else) that did not exist prior to Ben's post. Alice and Chloe, and people in similar situations, have to accept that many fora exist that do not have norms against this kind of conduct.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref730cvsq9p2o\"><sup><a href=\"#fn730cvsq9p2o\">[1]</a></sup></span></p><p>If there is no jurisdiction over off-Forum naming here, it seems that the people who want Alice and Chloe named can do so in other places, and everyone who wants to know will know soon enough. If that's the case, I'm not sure whether -- at least in these circumstances&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdvlbbz6nqvv\"><sup><a href=\"#fndvlbbz6nqvv\">[2]</a></sup></span>&nbsp;-- Jeff's suggestion offers <i>enough </i>added value to justify the rather significant costs of the mods adjudicating this particular matter in a reasonably thorough manner. If the names can be plastered all over X and Facebook, and ~everyone who cares to know will find out that way, does it make a huge amount of difference whether or not the names are <i>also </i>on the Forum? Under those circumstances, declining to adjudicate because the question would be of limited practical importance would be justifiable.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn730cvsq9p2o\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref730cvsq9p2o\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I express no opinion as to whether the mods could legitimately exercise broader jurisdiction over attempting to disclose the identity of a Forum poster, where the only relevant conduct was on-Forum.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndvlbbz6nqvv\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdvlbbz6nqvv\">^</a></strong></sup></span><div class=\"footnote-content\"><p>That is, enough people who know of their identity appear to be motivated to share it.</p></div></li></ol>", "parentCommentId": "eWXRAgmm7uHEbELKY", "user": {"username": "Jason"}}, {"_id": "fN7d2vcnon8Ls6Gv2", "postedAt": "2023-12-21T22:17:54.778Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think @chinscratch may have meant: What would it take for EA to become the kind of movement where SBF would've lost <em>in his hypothetical efforts to squelch discussion of his general shadiness, and run those folks out of EA?</em></p>\n<p>EA couldn't have detected or stopped the fraud in my opinion, but more awareness of shady behavior could have caused people to distance themselves from SBF, not make major decisions in reliance on FTX cash, etc.</p>\n", "parentCommentId": "kKJjhocgFCLLAMajo", "user": {"username": "Jason"}}, {"_id": "3xJjcnFRbvNuPJSmW", "postedAt": "2023-12-21T22:18:19.190Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Victor - thanks for elaborating on your views, and developing this sort of 'career longtermist' thought experiment. I did it, and did take it seriously.</p><p>However.</p><p>I've known many, many academics, researchers, writers, etc who have been 'cancelled' by online mobs, who have made mountains out of molehills. In many cases, the reputations, careers, and prospects of the cancelled people are ruined. Which is, of course, the whole point of cancelling them -- to silence them, to ostracize them, and to keep them from having any public influence.</p><p>In some cases, the cancelled people bounce back, or pivot, or pursue other interests. But in most cases, they cancellation is simply a tragedy, a huge setback, a ruinous misfortune, and a serious waste of their talents and potential.&nbsp;</p><p>Sometimes there's a silver lining to their being cancelled, bullied, and ostracized, but mostly not. Bad things can happen to good people, and the good people do not always recover.</p><p>So, I think it's very important for EA to consider the many serious costs and risks we would face if we don't take seriously the challenge of minimizing false allegations against EA organizations and EA people.</p>", "parentCommentId": "uLvyJuq7t56cqwdYZ", "user": {"username": "geoffreymiller"}}, {"_id": "i8dBfZKHfcvFegNjW", "postedAt": "2023-12-21T22:28:15.493Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Will - thanks very much for sharing your views, and some of the discussion amongst the EA Forum moderators.</p><p>These are tricky issues, and I'm glad to see that they're getting some serious attention, in terms of the relative costs, benefits, and risks of different possible politicies.</p><p>I'm also concerned about 'setting a precedent of first-mover advantage'. A blanket policy of first-mover (or first-accuser) anonymity would incentivize EAs to make lots of allegations before the people they're accusing could make counter-allegations. That seems likely to create massive problems, conflicts, toxicity, and schisms within EA.&nbsp;</p>", "parentCommentId": "Md3gdBR3BeRGBrvMF", "user": {"username": "geoffreymiller"}}, {"_id": "7niAjnksfGuqgEF4d", "postedAt": "2023-12-21T22:34:42.986Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Jeff - thanks very much for sharing the link to that post. I encourage others to read it - it's fairly short. It nicely sets out some of the difficulties around anonymity, doxxing, accusations, counter-accusations, etc.</p><p>I can't offer any brilliant solutions to these issues, but I am glad to see that the risks of false or exaggerated allegations are getting some serious attention.</p>", "parentCommentId": "eWXRAgmm7uHEbELKY", "user": {"username": "geoffreymiller"}}, {"_id": "ewuHa9B6gdgoyZLRy", "postedAt": "2023-12-21T22:42:34.030Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>If you have any references for good ones, please send them to me! I think this kind of job is quite hard and many (my guess is most) journalists would not live up to a standard that I think would be acceptable in this kind of job, but I do think there are some, and I would love to talk to them about this.</p>", "parentCommentId": "jR65QWHBXEh4uEbPY", "user": {"username": "Habryka"}}, {"_id": "jujJypsywGv6MvA5y", "postedAt": "2023-12-22T00:58:42.496Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>This isn't about the Forum mods as as representatives of the Forum, but instead as the most obvious trusted community members (possibly in consultation with CH) to make a decision.</p>\n<p>What centralized adjudication avoids is each person having to make their own judgment about whether deanonymization is appropriate in a given circumstance. Let's say NL starts posting the real names on Twitter: should I think poorly of them for breaking an important norm or is this an exception? Is that an unreasonable unilateral escalation of this dispute? Should I pressure them not to do this?</p>\n", "parentCommentId": "mG6wskYaLSnDgZ2EZ", "user": {"username": "Jeff_Kaufman"}}, {"_id": "9kgRaeFLcjGaYdrur", "postedAt": "2023-12-22T01:18:01.791Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>My understanding is that Kat and Emerson did in fact get their names on CEA's blacklist to some extent.<br><br>Here is the bigger problem I see with your proposed solution. If an employer reviewing an application from Alice or Chloe believes their side of this, then the employer would not factor in the fact of their presence on CEA's blacklist, since the employer, by hypothesis, thinks CEA was mistaken to put them there. If, on the other hand, an employer reviewing an application from Alice or Chloe believes Nonliner's side of this, then the employer may justifiably look at the fact that CEA erred by having blacklisted Kat and Emerson and choose not to consult CEA in their hiring decisions at all, and therefor not discover that their applicant was Alice or Chloe. Either way, CEA blacklisting Alice and Chloe seems ineffective.</p>", "parentCommentId": "kvDRjxotGrYJjui6P", "user": {"username": "River"}}, {"_id": "AAsy9QsgL3ySkLXka", "postedAt": "2023-12-22T01:25:57.344Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think paying a friendly outsider would be the best option. I don't expect I have much say in this, since I don't have much spare money, so I will not be the one heiring. But I would like TracingWoodsgrains to look into the Nonlinear story.&nbsp;</p>", "parentCommentId": "LQazeB86F9M9ovtzu", "user": {"username": "Linda Linsefors"}}, {"_id": "vegdd745oavmC2ABK", "postedAt": "2023-12-22T02:00:46.828Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>I think what this comes down to for me is: If Kat Woods’ Forum username was pseudonymous, would we have taken down Ben’s post? (Or otherwise removed all references to Kat by her real name?)</p><p>If the answer to this is “yes,” then I don’t think Alice+Chloe should be deanonymized.</p></blockquote><p>&nbsp;</p><p>I do not like the incentive structure that this would create if adopted. Kat did not get to look at this particular drama and decide whether she wanted it discussed under a real or pseudonymous username. Her decision point was when she created her forum account however many years ago, at a time when she had no idea that this kind of drama would erupt. If this position becomes policy, then it incentivizes every person, at the time that they create a forum account, to choose a pseudonym rather than use their real name, to avoid having any unforeseeable future drama publicly associated with their real name. I think this would be bad. People in a community can't build trust if they don't know the identities of the people they are building trust with.</p>", "parentCommentId": "Md3gdBR3BeRGBrvMF", "user": {"username": "River"}}, {"_id": "nvpcwXK7bDwskBmjD", "postedAt": "2023-12-22T02:59:09.156Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>That approach certainly does offer some significant advantages, but I think it's a lot harder to pull off. &nbsp;Will's three options, the narrower version of mod discretion (which is limited to whether A/C can be named <i>on the Forum</i>), and my fifth option (declining to allow in this case because if people decide to name, everyone will find out whether it's on the Forum or not) are all open to the mods because they are mods.&nbsp;</p><p>The possibility of a centralized adjudication that is recognized as binding in all places requires outside buy-in. I think it needs either (1) the consent of every party directly in interest or (2) the consent of Nonlinear, broad community support, and the centralized adjudicator's willingness to either release the names themselves or allow widespread burner accounts naming them.&nbsp;</p><p>Option (1) is basically arbitration on the consent of the parties; they would be free to choose the mods, Qualy, a poll, or a coin flip. Alice and Chloe would consent to being named if the arbitrators chose, and Nonlinear would agree to not name if the arbitrators ruled against them.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefi0d9x3jea9\"><sup><a href=\"#fni0d9x3jea9\">[1]</a></sup></span>&nbsp;If the arbitrators rule for naming, no one should judge Nonlinear because it would have named Alice and Chloe with their consent. If they rule against naming and Nonlinear did it anyway, everyone should judge them for breaking their agreement. And there's a strong argument to me that we bystanders should honor the decision of those directly involved on a resolution.</p><p>But reaching an agreement to arbitrate may be challenging. A rational party would not consent to arbitrate unless it concluded its interests were expected to be better off under arbitration than the counterfactual. Settlements can be mutually beneficial, but I am not yet convinced arbitration would be in Alice and Chloe's interests. So long as a substantial fraction of the community would judge Nonlinear for naming, it probably will not do so. So the status quo for Alice and Chloe would be a win vs. an uncertain future in arbitration.</p><p>The other, less certain option is that Nonlinear and the significant majority of the community consented to abide by the arbitration result. Even here, there is a risk that the arbitration process may become a no-win scenario for Nonlinear. If enough community members reserve their right to independently and adversely judge Nonlinear for naming, then it is in a pickle even if it \"wins\" the arbitration.&nbsp;</p><p>A possible workaround might be either that the arbitration panel itself will release the names if it rules against Alice and Chloe, or that it will allow untraceable anonymous posters to flood the Forum with their names. In other words, if Alice and Chloe do not consent, and there is a contingent of anti-namers in the community, then any blowback for releasing needs to fall on someone other than Nonlinear.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fni0d9x3jea9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefi0d9x3jea9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>One complexity is that, to the extent that Alice and/or Chloe allegedly slandered other people, there are other potential parties in interest.</p></div></li></ol>", "parentCommentId": "jujJypsywGv6MvA5y", "user": {"username": "Jason"}}, {"_id": "YmXt5kk4H8zzzwFTd", "postedAt": "2023-12-22T03:13:35.346Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>A rule that you couldn't directly name people of moderate or greater prominence wouldn't work well anyway. People here are awfully clever, and I'm sure one could easily write a whistleblowing piece on such a person that left very little doubt about their identity without actually saying their name or other unique identifiers. In fact, I'm not sure if Ben's piece could have been effectively written without most of the Forum readership knowing who Alice and Chloe had worked for.</p>", "parentCommentId": "vegdd745oavmC2ABK", "user": {"username": "Jason"}}, {"_id": "RoctAnrvtxbTEsqK9", "postedAt": "2023-12-22T03:15:50.609Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>The possibility of a centralized adjudication that is recognized as binding in all places requires outside buy-in.</p>\n</blockquote>\n<p>I think you might be thinking too formally? We sometimes have things that work because we decide to respect an authority that doesn't have any formal power. If you make a film you don't have to submit it to the MPAA to get a rating, and if you run a theater you don't have to follow MPAA ratings in deciding whether someone is mature enough to be let into an R-rated movie, but everyone just goes along with the system.</p>\n<p>I'm imagining that the Forum mods would make a decision for the Forum, and then we'd just go along with it voluntarily even off the Forum, as long as they kept making reasonable decisions.</p>\n", "parentCommentId": "nvpcwXK7bDwskBmjD", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Fcc3E9nfo3RMuMGL3", "postedAt": "2023-12-22T04:12:23.613Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I'm not seeing any real consensus on what standard to apply for deanonymizing someone. I think a voluntary deference model is much easier when such a consensus exists. If you're on board with the basic decision standard, it's easier to defer even when you disagree with the application in a specific case. In sports, the referees usually get the call right, and errors are evenly distributed between your team and your opponents. But if you fundamentally disagree with the decision standard, the calls will go systematically against your viewpoint. That's much harder to defer to, and people obviously have very strong feelings on either side.</p><p>I don't think the MPAA is a great analog here. I'd submit that the MPAA has designed its system carefully in light of the wholly advisory nature of its rulings. Placing things on a five-point continuum helps. I think only a small fraction of users would disagree more than one rating up/down from where the MPAA lands. So rarely would an end user completely disagree with the MPAA outcome. Where an end user knows that the MPAA grades more harshly/leniently than they do, the user can mentally adjust accordingly (as they might when they learn so many Harvard College students get 4.0s?) &nbsp;</p><p>And it's easy for end users to practically opt out of the MPAA system without any real social sanction; if a theater owner decides to admit ten-year olds to R-rated movies with a signed parental consent, that is really none of my business. If a parent decides to take a seven-year old to one, that is also none of my business as long as the child is non-disruptive. The MPAA system is resilient to 20-30% of the population opting out, if they so chose.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8t6fdmfbwms\"><sup><a href=\"#fn8t6fdmfbwms\">[1]</a></sup></span></p><p>So I don't think the features that make the MPAA system workable as a voluntary-deference system are likely to transfer over well to this context.&nbsp;</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8t6fdmfbwms\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8t6fdmfbwms\">^</a></strong></sup></span><div class=\"footnote-content\"><p>It's harder for filmmakers to opt out -- but they also got a lot out of the system, too. Mild self-regulation is preferable to government regulation, especially back in days when the First Amendment was not enforced with the same rigor it is today.</p></div></li></ol>", "parentCommentId": "RoctAnrvtxbTEsqK9", "user": {"username": "Jason"}}, {"_id": "BoeFvtDJkyGKSPso2", "postedAt": "2023-12-22T06:08:19.418Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thanks for entertaining my thought experiment, and I'm glad because I better understand your perspective too now, and I think I'm in full agreement with your response.</p><p>A shift of topic content here, feel free to not engage if this doesn't interest you.<br><br>To share some vague thoughts about how things could be different. I think that posts which are structurally equivalent to a hit piece can be considered against the forum rules, either implicitly already or explicitly. Moderators could intervene before most of the damage is done. I think that policing this isn't as subjective as one might fear, and that certain criteria can be checked even without any assumptions about truthfulness or intentions. Maybe an LLM could work for flagging high-risk posts for moderators to review.</p><p>Another angle would be to try and shape discussion norms or attitudes. There might not be a reliable way to influence this space, but one could try for example by providing the right material that would better equip readers to have better online discussions in general as well as recognize unhelpful/manipulative writing. It could become a popular staple much like I think \"Replacing Guilt\" is very well regarded. Funnily enough, I have been collating a list of green/orange/red flags in online discussions for other educational reasons.</p><p>\"Attitudes\" might be way too subjective/varied to shape, whereas I believe \"good discussion norms\" can be presented in a concrete way that isn't inflexibly limiting. NVC comes to mind as a concrete framework, and I am of the opinion that the original \"sharing information\" post can be considered violent communication.</p>", "parentCommentId": "3xJjcnFRbvNuPJSmW", "user": {"username": "VictorW"}}, {"_id": "JXpopHeHotcLGTQBi", "postedAt": "2023-12-22T06:12:48.648Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>(I feel sad about the downvotes here. I really feel like I am not making a particularly complicated point here, and am doing so in good faith. Would appreciate if voters could clarify, since I feel like my argument is pretty straightforward and is done in good faith)</p>", "parentCommentId": "3KiBnkpa2ckh8aLL3", "user": {"username": "Habryka"}}, {"_id": "m2xan33jBStWF6nJm", "postedAt": "2023-12-22T08:47:29.801Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I work for Habryka, so my opinion here should be discounted. (for what it's worth I think I have disagreed with some of his other comments this week, and I think your post did update me on some other things, which I'm planning to write up). But re:</p><blockquote><p><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=jwCQiZFjAvtgotmGv\">incorrectly predicted what journalists would think of your investigative process</a>, after which we collaborated on a hypothetical to ask journalists, all of whom disagreed with your decision.</p></blockquote><p>this seems egregiously inaccurate to me. Two of the three journalists said some flavor of \"it's complicated\" on the topic of whether to delay publication, for very similar reasons to what Habryka has mentioned. It seems like at best it was a wash, and it felt pretty weird in the OP that you wrote them up as if they supported your thesis.</p>", "parentCommentId": "hLkTHrfWDR9pzQSo6", "user": {"username": "Raemon"}}, {"_id": "oChYQKWh5XiNyS4DN", "postedAt": "2023-12-22T09:14:19.048Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think it’s that you’re not factoring in the bigger point that Tracing and the journalist were making - that it is a clear error to promise a hard deadline to sources and so get into a situation where the you are having to make the judgement call about delaying</p>\n", "parentCommentId": "JXpopHeHotcLGTQBi", "user": {"username": "bec_hawk"}}, {"_id": "PQib57JveyYvTAvTY", "postedAt": "2023-12-22T10:44:46.949Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>Reasonable disagreement, I think, should be as in the legal sense for doubt: disagreement based on clear reasons, not disagreement from people who are generally reasonable.</p></blockquote><p>With this definition, any and all ability to enforce norms objectively goes out the window. A follower of {insert crazy idea X} would be equally justified to talk about unambiguous delusions in doubters of X, and anyone disputing it would have to get into a debate about the merits of X rather than pointing out that plenty of people disagree with X so it doesn't seem unambiguous.</p><p>We already have plenty of words to express personal opinions about a topic. Why would you want to define words that talk about consensus to also refer to personal opinions only? That just takes away our ability to differentiate between them. Why would we want that? Whether or not most people think something is useful information.</p><p>And there's also a motte-and-bailey thing going on here. Because if you really only want to talk about what you personally think, then there wouldn't be a reason to talk about unambiguous falsehoods. You've used the word unambiguous because it conveys a sense of objectivity, and when challenged, you defend by saying you that personally feel that way.</p><blockquote><p>I’d see a lot more use to engaging with your point if instead of simply asserting that people could disagree, you explain precisely which you disagree with and why.</p></blockquote><p>This is the second time you've tried to turn my objection into an object-level debate, and it completely misses the point. You don't even know if I have any object-level disagreements with your post. I critiqued your style of of communication, which I believe to be epistemically toxic, not the merits of your argument.</p>", "parentCommentId": "dTHiMKEaLPTsM9Yj7", "user": {"username": "Rafael Harth"}}, {"_id": "pK2pwQ6ZbukbBLMoh", "postedAt": "2023-12-22T11:26:51.844Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>If a company has 21 employees and someone says it has 7, I’m not going to call the situation ambiguous just because someone disagrees with me. That is the sense I am using the term. The lines contained clear errors that I would expect a serious outlet to correct; I think people who disagree they are errors do so without good reason.</p>\n<p>I’m not retreating to “I personally feel that way.” Those lines are wrong either for strict factual inaccuracies or for framing and tones that leads people to a substantially false picture and should be corrected. There is no bailey here—I meant what I said.</p>\n<p>Speaking of unpleasant framing, I’m wholly unimpressed by the framing of me “trying to turn [your] objection into an object-level debate.” It matters whether, on the object level, things I said were unambiguous are.</p>\n<p>It’s inevitable that some people are going to dislike the way I chose to frame my reply, but I did so carefully and with an eye towards serious, charitable, direct engagement with the topic on its merits. “Epistemically toxic” is strong phrasing that I wholly reject.</p>\n", "parentCommentId": "PQib57JveyYvTAvTY", "user": {"username": "TracingWoodgrains"}}, {"_id": "q7RaEerpDdj3zKDvf", "postedAt": "2023-12-22T11:39:07.642Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think it's worth pointing to the specifics of each, because I really don't think it's unreasonable to gloss as \"all of whom disagreed.\"</p>\n<blockquote>\n<p>I would delay publication.</p>\n</blockquote>\n<p>This goes without saying.</p>\n<blockquote>\n<p>I think it depends a lot on the group's ability to provide evidence the investigators' claims are wrong. In a situation like that I would really press them on the specifics. They should be able to provide evidence fairly quickly. You don't want a libel suit but you also don't want to let them indefinitely delay the publication of an article that will be damaging to them. It is a tricky situation!</p>\n</blockquote>\n<p>\"I would really press them on the specifics. They should be able to provide evidence very quickly. You don't want a libel suit...\"</p>\n<p>They were very clearly offering to provide specific, hard evidence in a short time span, not asking for an indefinite delay. Some of that specific, hard evidence came in two hours before publication. Ben and Oliver did not press them on the specifics, they said they had a hard deadline and that was that.</p>\n<blockquote>\n<p><strong>This feels like a good example of why you shouldn’t over-promise to your sources</strong>—you want a cordial relationship with them but you need boundaries too. I can definitely see a situation where you would agree to give a source a heads up once you’d decided to publish — if it was a story where they’d recounted a violent incident or sexual assault, or if they needed notice to stay somewhere else or watch out for hacking attempts. But <strong>I would be very wary of agreeing in advance when I would publish an investigation—it isn’t done until it’s done.</strong></p>\n</blockquote>\n<blockquote>\n<p><strong>In the end the story is going out under your name, and you will face the legal and ethical consequences, so you can’t publish until you’re satisfied.</strong> If the sources are desperate to make the information public, they can make a statement on social media. Working with a journalist involves a trade-off: in exchange for total control, you get greater credibility, plausible deniability and institutional legal protection. <strong>If I wasn’t happy with a story against a ticking clock, I wouldn’t be pressured into publication. That’s a huge risk of libelling the subjects of the piece and trashing your professional reputation.</strong></p>\n</blockquote>\n<blockquote>\n<p>On the request for more time for right to reply, that’s a judgement call—is this a fair period for the allegations involved, or time wasting? It’s not unknown for journalists to put in a right to reply on serious allegations, and the subject ask for more time, and then try to get ahead of the story by breaking it themselves (by denying it).</p>\n</blockquote>\n<p>I've bolded the parts that present the most emphatic disagreement. A lot of the problems around the deadline were created by promising sources a hard deadline, something that she would not do. As a result of that promised hard deadline, they got into a situation where, with two hours to go, they looked at new information they received that complicated things and said \"Sorry, story goes up as-is.\" This seems clearly incompatible with the advice in those two paragraphs. The third paragraph mentions a judgment call, and there of course my own judgment call would be different (a week to gather evidence against the results of six months of investigation seems like the minimum for a fair period, certainly not time-wasting) but I recognize there's a bit more flex there. The rest, though? \"Disagreed\" is the most straightforward read by far.</p>\n", "parentCommentId": "m2xan33jBStWF6nJm", "user": {"username": "TracingWoodgrains"}}, {"_id": "DHzraFKxtCxxvt2uS", "postedAt": "2023-12-22T12:12:29.926Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>posts which are structurally equivalent to a hit piece</p>\n</blockquote>\n<p>What does this mean?</p>\n", "parentCommentId": "BoeFvtDJkyGKSPso2", "user": {"username": "Jeff_Kaufman"}}, {"_id": "7bgBGFpZjJezwo3rF", "postedAt": "2023-12-22T12:26:15.732Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>If a company has 21 employees and someone says it has 7, I’m not going to call the situation ambiguous just because someone disagrees with me.</p></blockquote><p><s>Sure, I agree with this particular case. There is a level of clarity above which you can say ambiguous without getting criticism. Mathematical statements or extremely simple factual statements are in that category. If that had been the only item in the section, I wouldn't have an issue with it. But you've also picked the most objective one to make this argument. </s><a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=FuRMM8NpJPydbjAEA\"><s>Habyrka also already admitted</s></a><s> that he got the number of people in the company wrong, so this is not the problematic claim.</s></p><p>Edit: Apologies, I didn't check the context. I endorse the general point about narrow claims, but the quote from Habryka isn't relevant.</p><blockquote><p>Speaking of unpleasant framing, I’m wholly unimpressed by the framing of me “trying to turn [your] objection into an object-level debate.” It matters whether, on the object level, things I said were unambiguous are.</p></blockquote><p>I don't get the point here. \"The object-level question matters\" isn't a rebuttal to \"you're trying to make it about an object-level question\".</p><blockquote><p>It’s inevitable that some people are going to dislike the way I chose to frame my reply, but I did so carefully and with an eye towards serious, charitable, direct engagement with the topic on its merits. “Epistemically toxic” is strong phrasing that I wholly reject.</p></blockquote><p>I agree that it's a strong phrasing, but I stand by it. I wouldn't bring up style if I didn't if I only had minor issues with it. I think the ability to differentiate between consensus-level claims and opinions is one of the main reasons why discussion on LW and EA is less bad than discussion everywhere else on the internet, and I perceive this post and the conversation as an step toward eroding that difference.</p><p>I have no doubts that you think the style was fine. I also have no doubts that you'd be able to justify the \"charitable\" and \"direct\" adjectives as you understand them. I expect the problem would again be that you'll define them by subjective, things-people-can-disagree-about standards. By my standards, the post is not direct engagement since it begins by drawing an emotionally loaded analogy, and it's not charitable because of the section I've been criticizing. Both of these are true regardless of the object-level merits (unless every object level claim were in the category of extremely straight-forward factual statements, which it isn't).</p>", "parentCommentId": "pK2pwQ6ZbukbBLMoh", "user": {"username": "Rafael Harth"}}, {"_id": "bEtCKYswWbuYh7pAy", "postedAt": "2023-12-22T15:01:00.074Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>a piece of writing with most of the stereotypical properties of a hit piece, regardless of the intention behind it</p>", "parentCommentId": "DHzraFKxtCxxvt2uS", "user": {"username": "VictorW"}}, {"_id": "sogZgeAtbEkMidEnu", "postedAt": "2023-12-22T15:05:31.526Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Do you think <a href=\"https://forum.effectivealtruism.org/posts/fn7bo8sYEHS3RPKQG/concerns-with-intentional-insights\">Concerns with Intentional Insights</a> should have been ineligible for the Forum under this standard?</p>\n", "parentCommentId": "bEtCKYswWbuYh7pAy", "user": {"username": "Jeff_Kaufman"}}, {"_id": "dfAtjjuB99zGTjzfc", "postedAt": "2023-12-22T16:02:33.961Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Sure, I think there is a reasonable argument to be had here that tries to answer a broader question, but I don't think that should come at a loss of the ability to make locally valid arguments (but also, seems like votes corrected themselves).</p>", "parentCommentId": "oChYQKWh5XiNyS4DN", "user": {"username": "Habryka"}}, {"_id": "RrJigaRfkZj9uopBs", "postedAt": "2023-12-22T16:29:54.518Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>If a company has 21 employees and someone says it has 7, I’m not going to call the situation ambiguous just because someone disagrees with me</p></blockquote><p>Just for the record, it is definitely false that at any point during the period Ben's investigation covered, Nonlinear would be accurately described as \"having 21 employees\". I am also pretty confident that at no point Nonlinear could have been described as \"having 21 employees\", unless there was maybe some very temporary internship program, but the average number of employees was verifiably very far from 21.</p><p>(Edit: Removed an unnecessary aside about evidentiary standards. I just want to make sure nobody walks away with a wrong impression about concurrent employees. I don't really want to get into more indirect stuff)&nbsp;</p>", "parentCommentId": "pK2pwQ6ZbukbBLMoh", "user": {"username": "Habryka"}}, {"_id": "rHAzHoQJ32gcjw9tG", "postedAt": "2023-12-22T16:34:01.235Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>But you've also picked the most objective one to make this argument. <a href=\"https://www.lesswrong.com/posts/q4MXBzzrE6bnDHJbM/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=FuRMM8NpJPydbjAEA\">Habyrka also already admitted</a> that he got the number of people in the company wrong, so this is not the problematic claim.</p></blockquote><p>This comment has absolutely nothing to do with the discussion at hand! I have never admitted I \"got the number of people in the company wrong\"! And even if I did, it wouldn't matter because I didn't write the post.&nbsp;</p><p>The comment you linked talks about a completely separate discussion where the question at hand was how many people who have worked with Kat/Emerson/Drew we have talked to, which is multiple dozens. I misspoke and instead said that we had talked to that many people who \"worked at Nonlinear\" which is false. But this had nothing to do with Ben's claim in the post, it was just me being sloppy with language.</p><p>I absolutely do not admit that Ben's post substantially got the number of Nonlinear employees during the relevant period wrong. As far as I can tell it is still accurate.&nbsp;</p>", "parentCommentId": "7bgBGFpZjJezwo3rF", "user": {"username": "Habryka"}}, {"_id": "4g8ABuCLcCL2NmQ5i", "postedAt": "2023-12-22T16:34:49.364Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>By \"has\" I meant \"has had a total of\", in line with their consistent claim of past count. I think that should have been clear given context and am unsure why you're acting as if I would be claiming something different to that.</p>\n<p>It was simple to fact-check. Trivial, really:</p>\n<p>They wanted to tell you. They were ready to answer questions and had the information immediately on hand. They knew exactly how many employees they'd had. You could have asked; they would have told you. If you wanted more specifics to ensure you had an accurate count, I suspect that a week would be plenty of time for them to pull up records.</p>\n<p>You wouldn't need to take their word for it; most companies keep records of past employees and have some form of evidence to back their claims. You <em>would</em> have needed to go to a source that had the info available, and such a source was there and begging to speak with you.</p>\n", "parentCommentId": "RrJigaRfkZj9uopBs", "user": {"username": "TracingWoodgrains"}}, {"_id": "yctDnvvr5nWEqhLtj", "postedAt": "2023-12-22T16:41:09.537Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>(Edit: This comment was responding to a version of Tracing's comment before an edit. The comment became moot when Tracing edited his comment to clarify, so am removing it to not get dragged into discussions that seem unnecessary)</p>", "parentCommentId": "4g8ABuCLcCL2NmQ5i", "user": {"username": "Habryka"}}, {"_id": "ijxXENJAhAqKJTASx", "postedAt": "2023-12-22T16:42:41.594Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote>\n<p>I absolutely do not admit that Ben's post substantially got the number of Nonlinear employees during the relevant period wrong. As far as I can tell it is still accurate.</p>\n</blockquote>\n<p>His precise sentence was this:</p>\n<blockquote>\n<p>My current understanding is that they’ve had around ~4 remote interns, 1 remote employee, and 2 in-person employees (Alice and Chloe).</p>\n</blockquote>\n<p>He did not say \"At the time Alice and Chloe were working there, they'd had...\". He used the present tense! It is simple revisionism to act as if the sentence says anything else. Anyone reading that sentence would <em>and should</em> come to the conclusion that he was speaking about the company as a whole, providing background context for who they are, not anchoring it to some unspecified point in the past.</p>\n<p>This is a strange claim to litigate in this way.</p>\n", "parentCommentId": "rHAzHoQJ32gcjw9tG", "user": {"username": "TracingWoodgrains"}}, {"_id": "6dXu2mfReDwJjGYiv", "postedAt": "2023-12-22T16:44:48.081Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I'm baffled. What do you mean \"during the relevant period\"? The relevant period as explicitly written into Ben's post is the company's entire history.</p>\n<p>Chloe and Alice were in no position to know the company's historical employee count as of September 7, 2023, which is the only thing that matters at all in determining whether Ben's claim was accurate.</p>\n<p>If you go and check the primary sources, and they definitely confirm that during the relevant period [presumably you mean: while Chloe/Alice were employed there] Nonlinear did not have 21 employees (and had much closer to the number of employees that Ben listed), it will update me further towards the conclusion that you are straining at gnats to defend obvious inaccuracies.</p>\n", "parentCommentId": "yctDnvvr5nWEqhLtj", "user": {"username": "TracingWoodgrains"}}, {"_id": "zBjHL8qQijDor8mqW", "postedAt": "2023-12-22T16:54:05.119Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>He did not say \"At the time Alice and Chloe were working there, they'd had...\". He used the present tense!</p></blockquote><p>Presumably you meant to say \"he used the past tense\".</p><p>You used the present tense in this discussion, so I was responding to claims about the present tense. You said \"If a company has 21 employees and someone says it has 7, I’m not going to call the situation ambiguous just because someone disagrees with me.\", which to me reads as clearly talking about how many employees a company has simultaneously.</p><p>I agree that in the quoted section Ben's post talks in the past tense in a way that implies it is talking about all historical employees (by the end of the period Ben's investigation covers, Nonlinear was not properly incorporated, so there is not even really a sense of legal employment, so how to handle past data points, and what the ground truth is, is messier than it would usually be). The veracity of that statement seems still right to me, though not one I really want to litigate here, or am really that confident about.</p><p>In other places he also talks about the number of concurrent employees. I just wanted to make sure no falsehoods about concurrent employees get propagated.</p>", "parentCommentId": "ijxXENJAhAqKJTASx", "user": {"username": "Habryka"}}, {"_id": "icT4C5m77C7h3AMvT", "postedAt": "2023-12-22T16:56:47.872Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I meant nothing of the sort. \"They've had\" is present perfect tense, and it's in a section where he is referring to Nonlinear in the present tense as of 7 September 2023 as he outlines the basics of their structure and history.</p>\n<p>EDIT:</p>\n<blockquote>\n<p>which to me reads as clearly talking about how many employees a company has simultaneously.</p>\n</blockquote>\n<p>This reading would make sense in isolation; as we have all been talking about the same fact pattern for a week, I admit it makes rather less sense to me. Either you read my statement as a general hypothetical to demonstrate what an unambiguous falsehood looks like, in which case there's no issue, or you read it as referring to the Nonlinear situation, in which common sense dictates it should be read as sloppy shorthand for the \"has had 21 employees\" fact pattern that's been under discussion.</p>\n", "parentCommentId": "zBjHL8qQijDor8mqW", "user": {"username": "TracingWoodgrains"}}, {"_id": "4wDjBPjG6smad3mbJ", "postedAt": "2023-12-22T17:02:41.345Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>I meant nothing of the sort. \"They've had\" is present perfect tense, and it's in a section where he is referring to Nonlinear in the present tense as of 7 September 2023 as he outlines the basics of their structure and history.</p></blockquote><p>Ah, sorry, that's not how I would have used \"present tense\", but I am also not a native english speaker.</p><blockquote><p>This reading would make sense in isolation; as we have all been talking about the same fact pattern for a week, I admit it makes rather less sense to me.</p></blockquote><p>I agree it would have been better to ask for clarification instead of immediately objecting. As I say in a comment above, I do really care about misrepresentations of Ben's post being corrected, because there is a very large amount of that in Nonlinear's reply.&nbsp;</p><p>I did just straightforwardly update from the language you used here that in the OP you had interpreted Ben as talking about the number of maximum concurrent employees during the relevant period (which I agree is not the most natural interpretation of the language Ben used, but seemed implied to me by the language you used). We've now clarified, and I apologize for jumping to hasty conclusions about your epistemic state.&nbsp;</p>", "parentCommentId": "icT4C5m77C7h3AMvT", "user": {"username": "Habryka"}}, {"_id": "8jhhcxwHnogKqWipE", "postedAt": "2023-12-22T17:03:07.112Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Ben's original phrasing (\"My current understanding is that they’ve had around ~4 remote interns, 1 remote employee, and 2 in-person employees (Alice and Chloe).\") seems clearly to be referring to their total number of employees, not the concurrent number.</p><p>I sympathize with how you're feeling here, and I agree that taking Nonlinear's word for it without evidence would not have constituted fact-checking, but I think you may be falling into an arguments-as-soldiers mindset. If it's not overstepping to suggest (and I apologize if it is!), I think it might be helpful to take a step back from this discussion and do something less stressful for a while, so as to hopefully return with less of a sense of urgency.</p>", "parentCommentId": "RrJigaRfkZj9uopBs", "user": {"username": "evere"}}, {"_id": "dPbFmHtJrhGKvFS3G", "postedAt": "2023-12-22T17:05:23.677Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>What you’re missing is that Lightcone is not just another citizen. They control a lot of money and influence. If Ben and Oli were just regular citizens these criticisms wouldn’t carry undue weight. If Alice and Chloe had published their experiences themselves, I think people would have interpreted them more in proportion (and they would have exposed to way risk), which would have been a lot closer to the system you’re talking about.</p>\n<blockquote>\n<p>It is your right (and mine, and everyone else's) to decide not to associate with Lightcone, Nonlinear, both, or neither based on your assessment of their various actions.</p>\n</blockquote>\n<p>I don’t know you, but it sounds like you don’t live on EA/Rat grants. If you did, you would know it’s way more advantageous to side with Lightcone. Many would feel they could not afford not to. (Full disclosure: I have a Lightspeed grant, and obviously I feel okay criticizing Lightcone, but I might hesitate more if they were my only funding source.)</p>\n", "parentCommentId": "kaXqzAYkhE6oHYxST", "user": {"username": "Holly_Elmore"}}, {"_id": "gkH72A2WFMtSiZNDG", "postedAt": "2023-12-22T17:06:48.208Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>But CEA CHT doesn’t cancel people. They just answer questions about people in the most general way possible if you ask and maybe ban them from CEA-sponsored programs and events like EAGs. No coincidence that Julia Wise set it up and is a social worker by training.</p>\n<p>(Anyone who knows more, please fee free to correct/elaborate on what CHT does.)</p>\n", "parentCommentId": "HBJuGJ9qjq4A5BMqx", "user": {"username": "Holly_Elmore"}}, {"_id": "egAmzvkeYYuYkjxcd", "postedAt": "2023-12-22T17:12:06.852Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Yeah, sorry. To be clear I was responding specifically to TracingWoodgrain's claim which is written in a way that implies concurrent employees. However, the thing I should have done was to be less nitpicky and be like \"just to clarify, you probably meant to say 'if a company has had 21 employees, and someone says it had 7...'\", and then maybe make some response.</p><p>Based on TracingWoodgrain's phrasing, the above does really seem to be talking about concurrent employees, and I care a lot about people not ending up with the wrong impression of that number. Ben's post does talk about the number of concurrent employees multiple times, so this seemed like a relevant claim.</p><p>I do agree that I should have done less of a \"gotcha\" thing, and instead just tried to clarify the conversation. Conversation gets worse when every sentence gets interpreted in the most adversarial and narrow fashion, and I contributed to that in the above.&nbsp;</p><p>I appreciate the suggestion to take a step back. I do care a lot about preventing false narratives from what was written in Ben's post from taking hold, and which things are substantiated by evidence, because Nonlinear's post contains such a huge number of inaccurate claims about what Ben, Alice or Chloe said.</p><p>Based on the language that TracingWoodgrains used, I did genuinely come to believe that he thought Nonlinear had 21 concurrent employees during the relevant period, and have a draft DM to him where I ask him for clarification on this, because if so, that does seem like a major misunderstanding. Now Tracing has clarified, and I think we can let this discussion rest.</p>", "parentCommentId": "8jhhcxwHnogKqWipE", "user": {"username": "Habryka"}}, {"_id": "MqJ46CjJePG6yBfiM", "postedAt": "2023-12-22T17:34:46.195Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I have very little inside perspective on SBF, but my general take on FTX is that there was not enough shady info known outside of the org to stop the fraud. (What’s the mechanism? Unless you knew about the fraud, idk how just saying what you knew could have caused him to change his ways or lose control of his company.) It’s possible EA/rationality might have relied less on SBF if more were known, but you have to consider the harm of a norm of sharing morally-loaded rumors as well.</p>\n<p>The risk of a witch hunt environment seems worse to me than the value of giving people tidbits of info that a perfect Bayesian could update on in the correct proportion but which will have negative higher-order effects on any real community that hears it.</p>\n", "parentCommentId": "Pbqs8Dortypw8ZrbY", "user": {"username": "Holly_Elmore"}}, {"_id": "vuDQB3i9Wm4xqnnkr", "postedAt": "2023-12-22T18:31:57.217Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Ah, sorry! I had vaguely remembered that comment and it took me a while to find it, and I think &nbsp;I was so annoyed in that moment that I just assumed the context would fit without checking (which I realize makes no sense since you didn't even write the original post). I'll edit my comment.</p>", "parentCommentId": "rHAzHoQJ32gcjw9tG", "user": {"username": "Rafael Harth"}}, {"_id": "62xxeTwaJaWrBFnfo", "postedAt": "2023-12-22T19:33:44.883Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Thank you!</p>", "parentCommentId": "vuDQB3i9Wm4xqnnkr", "user": {"username": "Habryka"}}, {"_id": "Caj9zQxkg2a5D6ZQP", "postedAt": "2023-12-22T21:39:40.440Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I've just partly read and partly skim read that post for the first time. I do suspect that post would be ineligible under a hypothetical \"no hit pieces under duck typing\" rule. I'll refer to posts like this as DTHP to express my view more generally. (I have no comment on whether it \"should\" have been allowed or not allowed in the past or what the past/current Forum standards are.)</p><p>I've not thought much about this, but the direction of my current view is that there are more constructive ways of expression than DTHPs, and here I'll vaguely describe three alternatives that I suspect would be more useful. By useful I mean that these alternatives potentially promote better social outcomes within the community, while hopefully not significantly undermining desirable practical outcomes such as a shift in funding or priorities.</p><p>1. If nothing else, add emotional honesty to the framing of a DTHP. A DTHP becomes more constructive and less prone to inspire reader bias when they are introduced with a clear and honest statement of the needs, feelings, requests from the main author. Maybe two out of three is a good enough bar. I'm inclined to think that the NL DTHP failed spectacularly at this.<br>2. Post a personal invitation for relevant individuals to learn more. Something like \"I believe org X is operating in an undesirable way and would urge funders who might otherwise consider donating to X to consider carefully. If you're in this category, I'm happy to have a one on one call and to share my reasons why I don't encourage donating to X.\" (And during the one on one you can allude to the mountain of evidence you've gathered, and let someone decide whether they want to see it or not.)<br>3. Find ways to skirt around what makes a DTHP a DTHP. I think a simple alternative such as posting a DTHP verbatim to one's personal blog, then only sharing or linking to it with people on a personal level is already incrementally less socially harmful than posting it to the forums.</p><p>Option 4 is we find some wonderful non-DTHP framework/template for expressing these types of concerns. I don't know what that would look like.<br><br>These are suggestions for a potential writer. I haven't attempted to provide community-level suggestions here which could be a thing.</p>", "parentCommentId": "sogZgeAtbEkMidEnu", "user": {"username": "VictorW"}}, {"_id": "eyJ82kdJBbQCzPMPX", "postedAt": "2023-12-22T22:13:35.126Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I'm biased since I worked on that post, but I think of it as very carefully done and strongly beneficial in its effect, and I think it would be quite bad if similar ones were not allowed on the forum. So I see your proposed DTHP rule as not really capturing what we care about: if a post shares a lot of negative information, as long as it is appropriately fair and careful I think it can be quite a positive contribution here.</p>\n", "parentCommentId": "Caj9zQxkg2a5D6ZQP", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ycuvZ2o9wwAJvttLa", "postedAt": "2023-12-22T22:52:22.543Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I appreciate your perspective, and FWIW I have no immediate concerns about the accuracy of your investigation or the wording of your post.</p><p>Correct me if I'm wrong: you would like any proposed change in rules or norms to still support what you tried to achieve in that post, which is provide accurate information, presented fairly, and hopefully leading people to update in a way that leads to better decision making.</p><p>I support this, I agree that it's important to have some kind of channel to address the kinds of concerns you raised, and I probably would have seen your post as a positive contribution (had I read it and been a part of EA / etc back then but I'm not aware of the full context), and simultaneously I'm saying things like your post could have even better outcomes with a little bit of additional effort/adjustment in the writing.</p><p>I encourage you think about my proposed alternatives not as being blockers to this kind of positive contribution. That is not their intended purpose. As an example, if a DTHP rule allows DTHPs but requires a compulsory disclosure at the top addressing the relevant needs, feelings, requests of the writer, I don't think this particularly bars contributions from happening, and I think it would also serve to 1) save time for the writer by reflecting on their underlying purpose for writing, and 2) dampen certain harmful biases that a reader is likely to experience from a traditional hit piece.</p><p>If such a rule existed back then, presumably you would have taken it into account during writing. If you visualize what you would have done in that situation, do you think the rule would have negatively impacted 1) what you set out to express in your post and 2) the downstream effects of your post?</p>", "parentCommentId": "eyJ82kdJBbQCzPMPX", "user": {"username": "VictorW"}}, {"_id": "JiqbC2ZBiEDSHS5DM", "postedAt": "2023-12-23T12:18:43.510Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>This \"unambiguous\" contradiction seems overly pedantic to me. Surely Kat didn't expect Ben would receive her evidence and do nothing with it? So when Kat asked for time to \"gather and share the evidence\", she expected Ben, as a reasonable person, would change the article in response, so it wouldn't be \"published as is\".</p>", "parentCommentId": "LisrKHbESMfQcCNLX", "user": {"username": "dpiepgrass"}}, {"_id": "jLpQHNJnvXWuj8Fgh", "postedAt": "2023-12-23T13:33:29.899Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>TW, I want to thank you for putting this together, for looking at the evidence more closely than I did, for reminding me that Ben's article violated my own standards of truthseeking, and for highlighting some of Kat's evidence in more effective ways than Kat herself did. (of course, it also helps that you're an outside observer.)</p><p>I hadn't read some of those comments under Ben's article (e.g. by Spencer G) until now. I am certain that if I personally had received evidence that I was potentially quite wrong about details of an important article I'd just published (or was about to publish), I'd be <strong>very</strong> concerned about that. I would start investigating and making changes immediately, I'd be embarrassed, and I'd be potentially very apologetic insofar as I was wrong ― but Ben <s>and Hab</s> wasn't, and I don't know why. So, I was persuaded to switch my vote from up to down on Ben's article.</p><p>Now, Ben indicated that there were \"many\" other anonymous sources for the \"Nonlinear is bad\" vibe, but... well, he <i>was</i> unaware of the existence of more than half of NL's staff. So I'd like to stop putting weight on these mysterious additional sources unless I find out more about who they were and what they had to say. A mistrial! Yes, let's declare a mistrial.</p>", "parentCommentId": null, "user": {"username": "dpiepgrass"}}, {"_id": "tgPnfhEK2RYpqAxeC", "postedAt": "2023-12-23T14:04:20.129Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I was one of those who criticized Kat's response pretty heavily, but I really appreciated TracingWoodgrains' analysis and it did shift my perspective. I was operating from an assumption that Ben &amp; Hab were using an appropriate truthseeking process, because why wouldn't they? But now I have the sense that they didn't respond to counterevidence from Spencer G (and others), and the promise of counterevidence from Nonlinear, appropriately. So now I'm confused enough to agree with TW's conclusion: mistrial!</p><p>(edit: mind you, as my older comments <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=TwzuoXEdopP8MvL3D\">suggest</a>, in the end I won't end up thinking Kat did nothing wrong at all. This post raises doubts about Ben's approach to the case, though, due to which it's hard to tell out how bad or not bad the conduct was.)</p>", "parentCommentId": "FnXsMrrYTxxMfzjxy", "user": {"username": "dpiepgrass"}}, {"_id": "SyhnEeEzEfyEYN2hy", "postedAt": "2023-12-23T18:07:02.685Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>well, he <i>was</i> unaware of the existence of more than half of NL's staff.</p></blockquote><p>If anyone has evidence that Ben was indeed this far off about the number of staff, please send it to me (or post it here). I am trying to look into this claim and am really struggling to find any trace of the <a href=\"https://docs.google.com/document/d/1P4iLZPrQt-dxl9njvz1EvnB8qOBt11DVmtn8PHwFyPw/edit#bookmark=id.5bcox6exljim\">21 employees</a> that Kat and drew claim have worked at Nonlinear.&nbsp;</p><p>I don't see how you could get to 21 in addition to Kat, Drew and Emerson. There are maybe some contractors, short-term volunteers, and temporary unpaid interns, which I wouldn't usually classify as employees, where if you count all of them, you might be able to have it add up (though even then I am struggling). I would really like to dig into this very large divergence between any traces I can find, and what Nonlinear is claiming. I've also reached out to Drew from Nonlinear about this.</p>", "parentCommentId": "jLpQHNJnvXWuj8Fgh", "user": {"username": "Habryka"}}, {"_id": "SqfWxYE69JF33G3yx", "postedAt": "2023-12-24T03:05:17.225Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Habryka seems to think there was significant underreaction to shady info: <a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=nGxkHbrikGeTxrLjZ\">https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were?commentId=nGxkHbrikGeTxrLjZ</a></p>\n<p>I think you have to balance cost of false negatives against cost of false positives.</p>\n", "parentCommentId": "MqJ46CjJePG6yBfiM", "user": {"username": "chinscratch"}}, {"_id": "ivEejYeKZ9affegQt", "postedAt": "2023-12-24T09:33:25.668Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<blockquote><p>Surely Kat didn't expect Ben would receive her evidence and do nothing with it?</p></blockquote><p>Why not? &nbsp;According to Nonlinear, they had already told Ben they had evidence, and he'd decided to publish anyway: \"He insists on going ahead and publishing this with false information intact, and is refusing to give us time to provide receipts/time stamps/text messages and other evidence\". &nbsp;Ben already wasn't doing what Nonlinear wanted; the idea that he might continue shouldn't have been beyond their imagination. &nbsp;Since that's unlikely, it follows that Lightcone shouldn't have believed it, and should instead have expected that Nonlinear's threat was meant the way it was written.</p><p>More broadly, I think for any kind of claim of the form \"your interpretation of what I said was clearly wrong and maybe bad faith, it should have been obvious what I really meant\", any kind of thoughtful response is going to look pedantic, because it's going to involve parsing through what specifically was said, what they knew when they said it, and what their audience knew when they heard it. &nbsp;In this kind of discussion I think your pedantry threshold has to be set much higher than usual, or you won't be able to make progress.</p>", "parentCommentId": "JiqbC2ZBiEDSHS5DM", "user": {"username": "David Seiler"}}, {"_id": "TkBFnjyqLBXzzXAgB", "postedAt": "2023-12-27T19:53:09.323Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Nonlinear responded and said that their final estimate of employees is actually 23. That number includes 11 volunteers (unpaid interns) as well as some unspecified number of contractors (my guess would be a substantial majority of the remaining ones, though see below for difficulties in drawing the line here).&nbsp;</p><p>I have asked for clarification on the breakdown between employees and contractors, though my understanding is that legally all employees of Nonlinear are paid as contractors, so there is no clear line here. Some contractor relationships obviously wouldn't be relevant here (like paying for well-specified services like plumbing, copy-editing, or software development services, which to be clear I don't know whether any such are included in the number), and some of them would be quite relevant (like if Alice and Chloe were technically paid as contractors).</p>", "parentCommentId": "SyhnEeEzEfyEYN2hy", "user": {"username": "Habryka"}}, {"_id": "TCyG4daKaq5DZrjQ2", "postedAt": "2023-12-28T03:11:33.263Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>There are some references here to the community health team’s practices that we think aren’t fully accurate. You can see more <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in#When_we_don_t_have_permission_to_discuss_the_situation\">here</a> about how we typically handle situations where we hear an accusation (or multiple accusations) and don’t have permission to discuss it with the accused.</p>", "parentCommentId": "kvDRjxotGrYJjui6P", "user": {"username": "Julia_Wise"}}, {"_id": "aiLtFMNMv9w3qPWkA", "postedAt": "2024-01-01T04:48:40.841Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I don't have personal references, but a ton of great journalists have gotten laid off in 2023, and they never were paid that much in the first place (not being TV or celebrity journalists).&nbsp;</p><p><a href=\"https://www.poynter.org/business-work/2023/buzzfeed-news-closed-180-staffers-laid-off/\">https://www.poynter.org/business-work/2023/buzzfeed-news-closed-180-staffers-laid-off/</a></p><p><a href=\"https://www.sfgate.com/tech/article/wired-layoffs-conde-nast-magazine-18550381.php\">https://www.sfgate.com/tech/article/wired-layoffs-conde-nast-magazine-18550381.php</a></p><p><a href=\"https://www.washingtonpost.com/style/media/2023/10/10/washington-post-staff-buyouts/\">https://www.washingtonpost.com/style/media/2023/10/10/washington-post-staff-buyouts/</a></p>", "parentCommentId": "ewuHa9B6gdgoyZLRy", "user": {"username": "Stuart Buck"}}, {"_id": "MFdC9nWDYko6f2K9F", "postedAt": "2024-01-03T17:12:20.424Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Sorry, but I have (re)read that link and I don’t see how anything we said was in conflict with each other. Perhaps I didn’t word it well. Or am I misunderstanding you? If you could give some hard numbers like, only X% of complaints end up being handled anonymously, and of those, in Z% the complaints end up being unactionable and we just give a listening ear, and only in Y% do anonymous complaints end up being held against the person and meaningfully effecting their lives, then maybe I can agree I made the extent of the dilemma sound overblown. I’m also aware that other tactics come with their own dilemmas. I just wanted to acknowledge that there is a dilemma and that I am not a “never deanonymize” type of person before I made some other points.</p>\n<p>Reading your link I felt it was not in conflict because: In the case where many people give complaints about Steve, not a single person was willing to have their concerns discussed in detail with him (out of fear that details would reveal them I suppose), let alone be deanonymized by name. So it does sound like EAs like to make complaints in (what I’d call) “extreme anonymity” by “default” and tbh that matches my social and cultural model of EAs. And in the next section you say that your policy is to be even more protective of confidentiality than some communities like universities. And you do make some decisions based on those things you might never fully discuss with the other party. You call them “compromises” but some are major reactions which could be EA-career-ending. Actually I find it hard to consider what other worse actions remain other than calling the police, writing a public expose about them, or messaging their employer out of the blue. So I don’t think it is going too far to say that maybe CEA could be too protective of anonymity, as you acknowledge your behavior can, at least sometimes, be abnormal or counter to what people would expect in other institutions.</p>\n<p>In my view, it might be one of those cases where general society or others landed on the right institutional practices, but we EAs are naive in our tradeoff considerations by trying to use different systems, or draw the line of deanonymizing at different degrees. I don’t think this is a bold possibility. I expect you disagree with the idea that CH could be too protective of anonymity. Maybe most EAs would. But it’s a natural thing we can look at and not avert our eyes from that possibility. That’s all I wanted to say.</p>\n<p>I’d also like to clarify that I was not trying to be harsh on CH and drag you all in with what I wrote. These are hard problems. I was merely trying to write an introduction I felt took seriously and related to the feelings of people who do want Alice and Chloe doxxed, and show how I understand and sympathize with that perspective very much, and then go from there to discuss why I wouldn’t be in favor of doxxing even in this case that so many are shocked by. I am mostly bullish on the CH team which is why in my “short answer” section, I claimed that EAs should mostly defer to the CH team on this issue.</p>\n", "parentCommentId": "TCyG4daKaq5DZrjQ2", "user": {"username": "Ivy_Mazzola"}}, {"_id": "vHDLTHWcbztgiDuZJ", "postedAt": "2024-01-03T18:55:43.114Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Well the first thing that stands out to me is you don’t specify that the anonymity occurs only if the complainant requests it</p>\n", "parentCommentId": "MFdC9nWDYko6f2K9F", "user": {"username": "bec_hawk"}}, {"_id": "hoK3CzhFLDyAD2mxc", "postedAt": "2024-01-03T19:34:13.014Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Hm I guess that’s true. I guess I thought it went without saying that it would be when people want anonymity, I didn’t imagine there could be an alternative where CH removes names even if the complainant doesn’t request it. That would indeed be worse and a true “default” and I hope no one took that as what I meant.</p>\n<p>But I <em>think</em> CH asks complainants what degree of anonymity and detail-sharing they are comfortable with by default. And I think a lot of people ask them to not give details, and by default CH does defer to that preference to what might be an abnormal extent, such that anonymity may be functionally the default in our culture and their dealings. But yeah I guess I wonder about hard numbers. It is striking to me that not one person was willing to have the details of the incident shared with Steve though</p>\n", "parentCommentId": "vHDLTHWcbztgiDuZJ", "user": {"username": "Ivy_Mazzola"}}, {"_id": "EfiDKT83K4TGHa4ov", "postedAt": "2024-01-03T22:30:57.324Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I assumed the mock-incident was just meant to  illustrate how it might arise that someone doesn’t get full information, and it’s easier to get that point across if you have it as everyone requesting anonymity.</p>\n<p>On the real world point, I do agree that if what happens is something like ‘CEA: do you want anonymity? Complainant: uh sure, might as well’, then that seems suboptimal. Though I’m not sure I could come up with any system that’s better overall.</p>\n", "parentCommentId": "hoK3CzhFLDyAD2mxc", "user": {"username": "bec_hawk"}}, {"_id": "ejuC8rP8n7qJyw9eH", "postedAt": "2024-01-03T22:54:35.538Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>Fair, that is a mock incident, but I don’t see that aspect as being dramatized or anything. Fwiw I have known multiple people whose experiences basically matched Steve’s.</p>\n<p>I just think if we are going to talk about doxxing Alice and Chloe we might want to think what it might look like if they had gone elsewhere, or what it might look like in the future if they unduly report others. And as a community I think it must be reckoned with why some people feel upset right now at the protection that reporters face when accused get so few protections, not even the protection to know details of the claims against them. And a cultural standard where names of people who make provably false accusations are revealed could protect all of us. So I think it is worth reckoning with. Even though I came out supporting non-doxxing in this case</p>\n", "parentCommentId": "EfiDKT83K4TGHa4ov", "user": {"username": "Ivy_Mazzola"}}, {"_id": "qPkR7jkrLH2aqqZCs", "postedAt": "2024-01-03T23:07:53.508Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I think it’s important to separate out how CH handled the allegations vs how Ben did. IMO CH’s actions (banning presenting at EAG but not attending, recommending a contract be used) were quite measured, and of a completely different magnitude than making public anonymous allegations. And I think this whole situation would have been significantly improved if Ben had adopted CEA’s policy of not taking further actions if restrictions are requested.</p>\n", "parentCommentId": "ejuC8rP8n7qJyw9eH", "user": {"username": "bec_hawk"}}, {"_id": "u22jqL4yzntuLXAnW", "postedAt": "2024-01-05T20:30:46.202Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>You make a lot of fair points here, and we've grappled with these questions a lot.</p>", "parentCommentId": "MFdC9nWDYko6f2K9F", "user": {"username": "Julia_Wise"}}, {"_id": "6qNuDSEzs9LNFBZ3R", "postedAt": "2024-01-09T15:38:09.386Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>I never comment here but I wanted to say this: it is absolutely never acceptable to ask an employee to illegally buy controlled substances for an employer. No one should do this. If you think “oh, it’s “just” ADHD drugs, I’ll probably get away with it,” fine, you can take the legal risk yourself. Do not ask an employee to take that risk. It’s an abuse of power.</p>", "parentCommentId": null, "user": {"username": "Kayla Gamin"}}, {"_id": "qQuxrAHfmhiQuafSx", "postedAt": "2024-01-12T06:19:31.123Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": "<p>In Australia people can be, and have been, prosecuted when they whistleblow on something commercially or otherwise sensitive (that was of major public importance!) by disclosing it publicly without completely exhausting internal whistleblowing processes. So even in cases of proper whistleblowing, countervailing factors can dominate in what the consequences are for whistleblower.</p>\n", "parentCommentId": "G2a2ggStCZmBEAyEp", "user": {"username": "bec_hawk"}}, {"_id": "4awxBxziTfCqHaNAj", "postedAt": "2023-12-19T19:32:47.823Z", "postId": "bwtpBFQXKaGxuic6Q", "htmlBody": null, "parentCommentId": "BZYjhixEiLqkcorrm", "user": null}]