[{"_id": "kxYLh3viEqdsDBoeF", "postedAt": "2015-07-28T05:39:16.486Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>This is especiall useful and practical compared with other posts in your series so far - a lot of what you say about individuals and institutions is plausible.</p>\n", "parentCommentId": null, "user": {"username": "jayd"}}, {"_id": "cirsJMqPcT4MSBPc2", "postedAt": "2015-07-28T07:55:54.528Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>I agree with Jay; most accessible essay in the series yet. Keep it up! Suggestions for building a moral market:</p>\n<ul>\n<li><p>Encourage more potential donors to post what sort of research they'd seek to fund.\nIf they then end up with multiple candidates coming forward, that can be resolved through a competitive hiring process.</p>\n</li>\n<li><p>Also encourage more potential donees to post their aspiring research agendas, to attract potential donors more easily.</p>\n</li>\n</ul>\n<p>Note: the prior suggestions might not be practical to enact until basic infrastructure of a direct funding moral market is set up.</p>\n<ul>\n<li><p>Approach EA Ventures about vetting and normalizing direct funding. This could be one institution itself that doesn't receive funding from the direct funding market, which could generate trust in EA Ventures as an evaluator. It could also serve as a light version of Givewell or GWWC responsible for assessing the viability of individuals. EA Ventures could make clear in reports their assessments are their own opinions, and other donors and donees are by all means free to make their open funding arrangements.</p>\n</li>\n<li><p>Multiple donors could form coalitions to fund a single donee. For donors, this could decrease salient feelings of risk aversion otherwise preventing funding, because not one single donor takes on all risk. For donees, being funded by a coalition of multiple donors could increase security in two ways. Firstly, if one donor stops contributing funds, one or more funders are still around to provide funding. Hopefully, partial interim funding would be sufficient to meet living costs for the donee until full funding is restored. Anyway, secondly, funding coalitions of more members can seem more trustworthy and reliable to potential new donors. A new donor will be more likely to fill an existing funding gap if they can see one or more other donors already trust the donee enough to carry out the desired work.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "XAHtCQnaoTFYhqXQi", "postedAt": "2015-07-28T19:41:19.149Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<blockquote>\n<p>AFAIC donations within a bounded range can be received by non-US citizens in US soil, even in non-favorable Visa conditions.</p>\n</blockquote>\n<p>I think you mean AFAICT - as far as I can tell. It's normally better to spell these acronyms out for writing of this sort.</p>\n<p>While I'm commenting, does this hold in other places EAs might want to move (I suppose this means the UK, Canada, Australia, Switzerland and perhaps Thailand?)</p>\n", "parentCommentId": null, "user": {"username": "Nekoinentr"}}, {"_id": "yCBDFZJPBYQGEBvLY", "postedAt": "2015-07-28T19:54:38.823Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Who would some natural candidates for receiving funding be? I'll spare you from having to name yourself and do so for you! But are there actually any others? Maybe not?</p>\n", "parentCommentId": null, "user": {"username": "number42"}}, {"_id": "Jc69mr4YEFCJkjMwf", "postedAt": "2015-07-28T20:31:34.635Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<blockquote>\n<p>Multiple donors could form coalitions to fund a single donee</p>\n</blockquote>\n<p>Or to fund multiple donees.</p>\n", "parentCommentId": "cirsJMqPcT4MSBPc2", "user": {"username": "Giles"}}, {"_id": "jXDE2rX7dt6zZXfmZ", "postedAt": "2015-07-28T21:39:57.381Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Off the top of my mind and without consulting people: </p>\n<p>Justin Shovelain, Oliver Habryka, Malcolm Ocean, Roxanne Heston, Miranda Dixon-Luinenburg, Steve Rayhawk, Gustavo Rosa, Stephen Frey, Gustavo Bicalho, Steven Kaas, Bastien Stern, Anne Wissemann, and many others. </p>\n<p>If they had not received FLI funding: \nKaj Sotala,  Katja Grace. </p>\n<p>If they needed to transition between institutions/countries: \nMost of the core EA community. </p>\n<p>I have mentioned it as an option for a while, but personally waited for less conflict of interest to actually post about it (at the moment I'm receiving much less funding than I did before, and am receiving some funding through institutions, I wanted to make clear that my goal is not to have people disliking institutions, but to fix the labor market). </p>\n<p>I think the greater point here is that this has not been considered so far because people did not even envision it being an option. But now they will. </p>\n", "parentCommentId": "yCBDFZJPBYQGEBvLY", "user": {"username": "Diego_Caleiro"}}, {"_id": "REKMu2KpKB23PQMtx", "postedAt": "2015-07-29T09:18:43.001Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<blockquote>\n<p>if I recall correctly, direct donations are not subject to income tax on the donee’s part, which makes it even cheaper for the donors.</p>\n</blockquote>\n<p>At least on Patreon (which you seem to be suggesting that people use) you probably have to pay tax if you make over $600 per year. See their <a href=\"https://www.patreon.com/taxes\">FAQ on taxes</a>:</p>\n<blockquote>\n<p>If you are a US creator, and you make over $600 a year, you’ll need to complete a W9 and we will send you a 1099.</p>\n<p>[...]</p>\n<p>In most jurisdictions, the money you receive from your patrons is taxable income.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "riceissa"}}, {"_id": "FjGKKzHBdybj6gmTr", "postedAt": "2015-07-29T09:45:50.575Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<blockquote>\n<p>If you are hired by an EA institution to do a particular set of tasks, you are being paid to do those tasks, and help that organization do well in its function. If you are directly being paid to be an EA however, this is much more ingrained in your identity. There are people paying you to do the most good you can do. If you see an opportunity for doing good, you will be more likely to take it, since you are never done with the obligation of being a great EA.</p>\n</blockquote>\n<p>While I agree that funding individuals is promising, I don't find this particular argument very convincing. If one is not being paid to do particular tasks, then &quot;being paid to be an EA&quot; is a lot like being paid to be cool, which probably only works if one has already demonstrated the ability to perform well under similar conditions. Saying that people are paying one to &quot;do the most good one can do&quot; sounds a lot like a rationalization where the whims of the donee are gratuitously tolerated.</p>\n<p>Also I'd point out that constantly thinking of EA as an obligation and &quot;never being done&quot; <a href=\"http://www.benkuhn.net/stress\">may be suboptimal</a>.</p>\n", "parentCommentId": null, "user": {"username": "riceissa"}}, {"_id": "pxHfhWqtxxeH5RDWa", "postedAt": "2015-07-30T18:06:18.852Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>It's worth spelling out why you think that individuals are cheaper than institutions. Reasons I can see:</p>\n<ol>\n<li><p>Individuals are willing to work for less. But this doesn't really speak to the opportunity cost of their time, which (from the perspective of society, or &quot;effective altruism&quot; as a whole) is the main cost.</p>\n</li>\n<li><p>Tax treatment. Most of the time this is much worse for gifts to individuals (unless you arrange to make a grant to an individual, which is quite difficult for most donors and introduces significant additional reporting overhead). It can be better if (a) donors weren't able to deduct their donations anyway (e.g. because they are in an unfavorable jurisdiction or are donating &gt; 50% of AGI in the US), and (b) people are willing to work for very low wages outside of institutions.</p>\n</li>\n<li><p>Fundraising. I don't see why this would be cheaper for individual donors, though I agree that in general we could as a community reduce fundraising costs by improving our collective decision-making.</p>\n</li>\n<li><p>Coordination. Groups spend time coordinating with each other, on training and recruiting, etc., but in general these seem like worthwhile projects that are pursued precisely because they are cost-effective.</p>\n</li>\n<li><p>Administrative overhead. This seems like the main game. Some of this is useful work that improves efficacy, while some is just overhead involved with hiring people, accounting, maintaining non-profit status. It would be useful to get a more precise estimate for the total &quot;lost&quot; overhead that can be avoided by working independently. I think this is the main thing you could do to make this case more compelling. </p>\n</li>\n</ol>\n<p>It's worth pointing out that the number of dollars spent on overhead as a fraction of total dollars isn't a directly relevant metric, given that the opportunity cost of employee time is often significantly higher (so e.g. a 20% financial overhead may be more like a 5-10% overhead if we include all inputs). Between this and some overhead being useful for productivity (e.g. having an office, saving employee time, recruiting...), I mostly don't feel concerned about institutional overhead.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "wmqBvyHMNnPcRJjLR", "postedAt": "2015-07-30T18:14:26.491Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>My preferred proposal would involve a conceptual division of funder responsibilities (though the same person might do both):</p>\n<ol>\n<li><p>Provision of reliable income, to ensure that people can afford to work independently without worrying about financial issues, in exchange for some fraction of total output. I think that this fraction should probably be negotiated explicitly, as a way of helping us figure out how important money is and how reasonable it is to work independently. This step is profit-motivated, and can be split across several people.</p>\n</li>\n<li><p>Evaluation of outputs, and either resale of those outputs or internal recognition of altruistic gains.</p>\n</li>\n</ol>\n<p>[1] can be continued or eventually discontinued based on the results of [2]. The separation allows people well-positioned to evaluate work to be separate from those who have enough funding to support it. It also helps provide more explicit accountability, and to support better decisions about whether it's worth doing [1].</p>\n<p>I and the impact purchase are potentially willing to participate in either half of this arrangement (or both), but I will continue to make evaluations which are noisy, transparent, and on the low side (and hence which are liable to be offensive).</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "nEeFfdXNnYSERYNPb", "postedAt": "2015-08-01T13:57:24.165Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Strongly second this comment. As someone currently doing a lot of things that more or less amount to 'pay other people to do thing x that I think should be done', I would be very interested in understanding the most efficient way of doing so. But from this post I really don't know why individuals should be cheaper overall; charitable status is a huge factor in favour of institutions (a much larger factor in the UK than the US admittedly, but still) and is currently the only significant factor I am aware of in either direction.</p>\n", "parentCommentId": "pxHfhWqtxxeH5RDWa", "user": {"username": "AGB"}}, {"_id": "QZw6wJ7JN6xEKHktZ", "postedAt": "2015-08-01T15:20:16.503Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>One difference in cost comes from institutions such as Oxford requiring their employees to get prestigious wages. That makes the $75k average misleading. More obscure charities can hire employees much more cheaply.</p>\n", "parentCommentId": "pxHfhWqtxxeH5RDWa", "user": {"username": "PeterMcCluskey"}}, {"_id": "wxNXMFwrPx7XeCpZm", "postedAt": "2015-08-01T15:42:26.807Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>The goal of avoiding groupthink has the potential to be a very important reason for preferring direct funding. If the direct funding ends up substituting for donations to large, entrenched institutions, then I expect it to be valuable. But I expect that any groupthink associated with young charities that have a handful of employees comes from a broader community, not the specific institution.</p>\n", "parentCommentId": null, "user": {"username": "PeterMcCluskey"}}, {"_id": "ZPCarihB8e6HEi9Fm", "postedAt": "2015-08-01T17:44:30.528Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>To give the example of a charity that's competitive with paying individuals (and indeed obscure, at least outside EA!), the employees at Charity Science try to live on fairly minimal expenses. And we're currently spending very little time and thus money on administrative overhead; the <a href=\"http://www.charityscience.com/organizational-breakdown.html\">estimate of operations time in 2015 here</a> is generous.</p>\n<p>This isn't to say that I'm against funding individuals at all. Indeed the boundaries are fuzzy. People can fund me directly to work on the projects I run (albeit with some money then going to people I pay to work on them when this is more efficient), but they can do that tax-deductibly by donating to Charity Science (the legal umbrella entity, rather than the core fundraising projects).</p>\n", "parentCommentId": "QZw6wJ7JN6xEKHktZ", "user": {"username": "Tom_Ash"}}, {"_id": "S4STcBKZdXi9cSHHE", "postedAt": "2015-08-01T20:04:50.312Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<blockquote>\n<p>the employees at Charity Science try to live on fairly minimal expenses. And we're currently spending very little time and thus money on administrative overhead; the estimate of operations time in 2015 here is generous.</p>\n</blockquote>\n<p>As great as that all is, isn't this largely due to the culture at Charity Science, and the culture it tries to promote? I expect it would be difficult to normalize or replicate this in existing effective altruism charities. (It seems it would be difficult enough to spread among the existing non-profit world at large, where it isn't already being practiced, that I won't bother discussing it). Not that it wouldn't be worth trying, but we can dissect the problem to get a better sense of it.</p>\n<p>It's not necessarily that existing employees of various charities would be averse to engendering these norms, per se, but they might have a culture which already normalizes how perfectly acceptable it is to <em>not</em> live at a fairly minimal level, i.e., just covering basic living costs. I don't know what other organizations do or don't do this, so I won't speculate. </p>\n<p>If Charity Science or its employees would want to change this, they can spread these values among other effective altruists or other supporters they meet, and who are enthusiastic about Charity Science. Then, when they go on to do some kind of direct work, they'll be more inclined to keep costs this low. One or more of you could also post to this forum, as its readership is amenable to (some) more personal stories. I think those values in how to run an organization or how to do the work won't stick unless some people who all shared those values founded an organization together. </p>\n<p>Of course, Charity Science could always get more volunteers, expand to hire effective altruists doing independent work in line with its mission, or hire contractors(?).</p>\n", "parentCommentId": "ZPCarihB8e6HEi9Fm", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "8PfGZ9KEwZishHiEe", "postedAt": "2015-08-01T20:23:07.318Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Edit: after watching the EA Global livestream of Kerry Vaughan's talk about what he plans for the future of the effective altruism community as the director of EA Ventures, it's my impression he would be very open to being part of a partnership like the one you're proposing, Paul. I strongly encourage you to reach out to Kerry Vaughan.</p>\n<p>I made a similar suggestion <a href=\"http://effective-altruism.com/ea/lg/direct_funding_between_eas_moral_economics/4gn\">here</a>.</p>\n<blockquote>\n<p>Approach EA Ventures about vetting and normalizing direct funding. This could be one institution itself that doesn't receive funding from the direct funding market, which could generate trust in EA Ventures as an evaluator. It could also serve as a light version of Givewell or GWWC responsible for assessing the viability of individuals. EA Ventures could make clear in reports their assessments are their own opinions, and other donors and donees are by all means free to make their open funding arrangements.</p>\n</blockquote>\n<p>Consider reaching out to EA Ventures to be the second half of the arrangement.</p>\n", "parentCommentId": "wmqBvyHMNnPcRJjLR", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "SkhK83kAKTahNcM6R", "postedAt": "2015-08-01T20:25:17.056Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>If this market can start taking off, encourage each of those persons you mentioned to post an outline of the research they're pursuing on the Effective Altruism Forum or LessWrong or something. Then, potential funders have somewhere to browse and ask questions about the research proposal(s).</p>\n", "parentCommentId": "jXDE2rX7dt6zZXfmZ", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "PHfCgyCByrJwp7yvZ", "postedAt": "2015-08-01T20:37:02.850Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>It might help people willing to become funders, or who are seeking funding, if they update the details of such aspirations in <a href=\"http://effectivealtruismhub.com/user/register\">a profile on the Effective Altruism Hub</a>.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "jmhhRAGroW6EDCWc9", "postedAt": "2015-08-01T20:46:56.648Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Sure, that's totally fair. Though as I'm sure you know it doesn't affect the point about whether institutions or individuals are more efficient to fund: we're one example of people who could be funded cheaply whether as individuals or as an organisation. Admittedly an unrepresentative example, at one extreme.</p>\n<blockquote>\n<p>[One could] spread these values among other effective altruists [so that] when they go on to do some kind of direct work, they'll be more inclined to keep costs this low. One or more of you could also post to this forum, as its readership is amenable to (some) more personal stories.</p>\n</blockquote>\n<p>That could be a good idea, though I don't know if we'll personally write this - we're happy for others to do so though! (It could be along the lines of that <a href=\"https://impact.hackpad.com/EA-Interview-Series-BRMjLTsF84A\">EA interview series</a> you mentioned you might continue.)</p>\n", "parentCommentId": "S4STcBKZdXi9cSHHE", "user": {"username": "Tom_Ash"}}, {"_id": "XGjFatfkskWPJWHGf", "postedAt": "2015-08-18T07:43:34.709Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Off the top of <em>my</em> mind and without consulting people:</p>\n<p>Ruairi Donnelly, Max Carpendale, Kieran Grieg, Andrew McKnight, Oscar Horta</p>\n<p>Had he not been hired by ACE: Jacy Anthis</p>\n<p>The Foundational Research Institute (FRI) is a project aiming to be similar to the Future of Humanity Institute, except with a more explicitly utilitarian bent, based on the concerns of, e.g,. David Pearce, Brian Tomasik, and the EAs of Basel, Switzerland. They're in an awkward position where Brian would be a valuable researcher for them, but he considers his peers to be just as valuable and adept researchers, so he's taken to funding them and their organizations himself through earning to give. I believe he may be the only person doing so for (FRI), and also perhaps Animal Ethics. This seems to me an awkward state of affairs. I don't know if FRI is even legally incorporated in any country yet, so funding them and/or affiliated researchers might blur the lines between funding individual researchers and institutions. Either way, I believe Mr. Tomasik and his peers would appreciate a chance to discuss direct funding if or when such funding became available. </p>\n", "parentCommentId": "yCBDFZJPBYQGEBvLY", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "JXuR3miF6dKooYiTs", "postedAt": "2015-08-19T11:31:45.755Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Thanks, Evan! FRI is an official charity in Switzerland. Donations would help us grow, though we'd probably need a lot of funding ($100K+) before I revised my personal thoughts on earning vs. direct research.</p>\n", "parentCommentId": "XGjFatfkskWPJWHGf", "user": {"username": "Brian_Tomasik"}}, {"_id": "mxigZeTn8nkncbwXN", "postedAt": "2015-08-19T14:24:15.260Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>I sent 5 euros to you! :)</p>\n<p>What I don't see is how FRI could actually change the future. No matter how much research you publish, there's no reason to predict it will actually influence real decisions which affect real future suffering.</p>\n<p>So it is only a theoretical activity (still fun and legitimate, of course).</p>\n", "parentCommentId": "JXuR3miF6dKooYiTs", "user": {"username": "DisposableUsername"}}, {"_id": "DJGBKs2ZAKZiuuBHh", "postedAt": "2015-11-29T08:23:49.265Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Do you want to do this soon? You can help us get it done. </p>\n", "parentCommentId": "SkhK83kAKTahNcM6R", "user": {"username": "Diego_Caleiro"}}, {"_id": "rs8pbgxkuWpsfbbrj", "postedAt": "2015-12-01T08:03:15.206Z", "postId": "BXFCXfH5EtKedoquu", "htmlBody": "<p>Yeah, let's do it. If others are rearing to go, I'll help edit or provide feedback or share links or do whatever I can. Between so many major foundations seeming poised to give more money than the rest of the community combined to all our current favored charities across causes, but them being unlikely to directly fund individuals' research, now is an ideal time to plant in the minds of 4-to-6 figure-per-year donors new acceptable targets for their donations. </p>\n", "parentCommentId": "DJGBKs2ZAKZiuuBHh", "user": {"username": "Evan_Gaensbauer"}}]