[{"_id": "oi74WusibtgLohJ5C", "postedAt": "2022-09-08T11:57:12.568Z", "postId": "bXKNrYnr4gFKYzLGd", "htmlBody": "<p>Intriguing idea, thanks for sharing. In general think it's worth at least doing some tentative exploration all ideas to increasing the popularity of plant-based diets.</p><p>There seems to be an implicit assumption in your post that courses/coaching on plant-based eating will either increase the probability that somebody adopts a plant-based diet, or increases the probability that they stick with it. Has this assumption been tested, to your knowledge? It could also be that this intervention would mostly reach people who are keen on plant-based eating anyway, which is why I think it'd be good to test these assumptions in reality (pilot study or similar).</p><p>You might also get some useful feedback by sharing this idea with the RECAP group (https://www.recapresearch.org/join-recap) or Faunalytics, if you haven't already, as both of those groups have people thinking along these lines. I also mention this because - in my opinion - we should be focusing on whatever plant-based interventions appear to work the best. So, for this idea to be deserving of resources (in the long-term, after the idea is tested) it would also need to be shown that this idea works as well as, or better than, other plant-based interventions available to us. (Admittedly, I'm not sure what the best plant-based interventions are right now, but Faunalytics has loads of research on this.)</p>", "parentCommentId": null, "user": {"username": "Ren Springlea"}}, {"_id": "7xaHcjFxktJWcpuh7", "postedAt": "2022-09-08T12:31:54.893Z", "postId": "bXKNrYnr4gFKYzLGd", "htmlBody": "<p>Thank you for your thoughtful comment.&nbsp;</p><ol><li>It's true that it is an implicit assumption that courses will increase plant based eating. That must be tested yes.</li><li>As I've held courses about subjects like security and nutrition, I keep noticing that the participants that freely join are not those that need it the most - but, as you say, those who already have an interest for the subject. I feel like you have to \"pry\" knowledge like this into people that are not genuinely interested in it - by incentivising them. So yes the target audience would not be those who already have a lean towards a PBD.</li><li>I'll forward this post to both RECAP and Faunalytics and get their opinion. Indeed I'm now curious what the best proved plant based interventions are.</li></ol>", "parentCommentId": "oi74WusibtgLohJ5C", "user": {"username": "JB"}}, {"_id": "vS22EireiWxz6SAkH", "postedAt": "2022-09-11T15:21:57.899Z", "postId": "bXKNrYnr4gFKYzLGd", "htmlBody": "<p>Hey Johannes, thanks for this. I think that transitioning the world from consuming animal products is imperative, so I'm in favor of trying such a project. And I think it would be well-worth funding and setting up to collect useful data.&nbsp;</p><p>Some other considerations:</p><ul><li>How will people be enticed to such a program / courses? As the other comment says, most people who would join would already lean plant-based. But what about a cook together and eat together situation and make it like a social meetup?</li><li>For families, they might be helped by more meal plans and batch cooking. <a href=\"https://veganfamilykitchen.com/\">Vegan family kitchen</a> provided this for example. On a similar note, if I'm cooking for just myself, I tend to value expediency, cost, and nutrition at the expense of taste. I suspect that many potential participants would be similar.</li><li>Ideally, the program would probe participants after a year or so and see how much of their diet/cooking is vegan. We'd want to understand when and why recidivism occurs.&nbsp;</li><li>Feel free to reach out to <a href=\"https://animalcharityevaluators.org/\">Animal Charity Evaluators</a> about funding. They know the animal charity space the best and can advise on who to ask. I'd be happy to introduce you, if helpful.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Karthik Sekar"}}, {"_id": "zg6aHxe9DmajSZSRZ", "postedAt": "2022-09-12T11:36:07.740Z", "postId": "bXKNrYnr4gFKYzLGd", "htmlBody": "<p>Hey Karthik and thank you very much for your response.&nbsp;</p><p>- The exact content of the curriculum should in my opinion be shaped by the most current and relevant information we have at hand about nutrition, behavioural science, psychologists, environmental science etc. I agree with you that facilitating the cooking process will have a relevant role, as the time consumption together with price point seems to act as the biggest friction points for people to eat more plants.</p><p>- It's a relevant point but I’m not specialised in how to make sure the education doesn’t end up with participants who are already interested in plant based eating, but I’m sure there are ways.&nbsp;</p><p>- Absolutely, it’s important to keep up to date with how the participants apply the coaching.</p><p>- I contact you privately about Animal Charity Evaluators. It was already eye opening to read about some of their previous grantees.</p>", "parentCommentId": "vS22EireiWxz6SAkH", "user": {"username": "JB"}}, {"_id": "n4hFpBakMzpYFMRxQ", "postedAt": "2022-09-13T12:19:46.699Z", "postId": "bXKNrYnr4gFKYzLGd", "htmlBody": "<p>Thanks for sharing your piece and for citing our new study. There are many existing courses and programs to support people going veg*n so my feeling is that there isn't much additional mileage to be gained there by creating another one, but I don't know of any testing about paying people. It's a nice&nbsp;parallel to pay-per-view and pay-per-read advocacy. Worth testing, in my opinion, but I agree with the point about people who need it most not being the ones who would sign up. Another approach could be to focus specifically on the people who in our study had ability barriers (lack of access), where individual strategies weren't helpful. If you provided money for them to get veg food delivery, that would address some of those systemic barriers.</p>", "parentCommentId": null, "user": {"username": "jo"}}, {"_id": "dnA3J5N3aTDFEK4pv", "postedAt": "2022-09-14T18:50:29.783Z", "postId": "bXKNrYnr4gFKYzLGd", "htmlBody": "<p>Thank you for joining the conversation Jo. Faunalytics is as far as I know one of the best sources of information regarding this subject.</p><p>I agree that the main point is to open the eyes of those that previously were interested in PB eating. Probably \"Peter\" and his family who are dead set meat eaters wouldn't be interested in free classes about plant based eating since they would see no benefits to it. Hence the idea for monetary rewards.&nbsp;</p><p>I agree that there's probably no inherent value in creating another program for the sake of creating another program. What I'm hoping is to place efforts where they can make the most positive impact. I'd love to know from your perspective, using all your experience in the area- which program(s) do you think have the best effect of transitioning and retaining meat eaters to eat as much plants as possible instead?</p>", "parentCommentId": "n4hFpBakMzpYFMRxQ", "user": {"username": "JB"}}]