[{"_id": "tt9mCz8ABmepw44LN", "postedAt": "2018-01-12T01:21:34.301Z", "postId": "BxMzd4CRYBF8wuwFW", "htmlBody": "<p>Also here's a 5 minute talk I gave at EA Global London on the same topic:\n<a href=\"https://www.youtube.com/watch?v=jgSxmA7AiBo&amp;index=30&amp;list=PLwp9xeoX5p8POB5XyiHrLbHxx0n6PQIBf\">https://www.youtube.com/watch?v=jgSxmA7AiBo&amp;index=30&amp;list=PLwp9xeoX5p8POB5XyiHrLbHxx0n6PQIBf</a></p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "QEG6AiHeRGTfAKSR6", "postedAt": "2018-01-12T15:01:14.076Z", "postId": "BxMzd4CRYBF8wuwFW", "htmlBody": "<p>Hi Daniel,</p>\n<p>you argue in section 3.3 of your paper that nanoprobes are likely to be the only viable route to WBE, because of the difficulty in capturing all of the relevant information in a brain if an approach such as destructive scanning is used.</p>\n<p>You don't however seem to discuss the alternative path of <a href=\"http://kajsotala.fi/Papers/CoalescingMinds.pdf\">neuroprosthesis-driven uploading</a>:</p>\n<blockquote>\n<p>we propose to connect to the human brain an exocortex, a\nprosthetic extension of the biological brain which would integrate with the mind\nas seamlessly as parts of the biological brain integrate with each other. [...] we make three\nassumptions which will be further fleshed out in the following sections:</p>\n</blockquote>\n<blockquote>\n<p>• <strong>There seems to be a relatively unified cortical algorithm which is capable\nof processing different types of information.</strong> Most, if not all, of the\ninformation processing in the brain of any given individual is carried out using\nvariations of this basic algorithm. Therefore we do not need to study hundreds\nof different types of cortical algorithms before we can create the first version of\nan exocortex.<br />• <strong>We already have a fairly good understanding on how the cerebral cortex\nprocesses information and gives rise to the attentional processes underlying consciousness.</strong>  We have a good reason to believe that an exocortex\nwould be compatible with the existing cortex and would integrate with the\nmind.<br />• <strong>The cortical algorithm has an inbuilt ability to transfer information\nbetween cortical areas.</strong> Connecting the brain with an exocortex would therefore\nallow the exocortex to gradually take over or at least become an interface\nfor other exocortices.</p>\n</blockquote>\n<blockquote>\n<p>In addition to allowing for mind coalescence, the exocortex could also provide\na route for uploading human minds. It has been suggested that an upload can be\ncreated by copying the brain layer-by-layer [Moravec, 1988] or by cutting a brain\ninto small slices and scanning them [Sandberg &amp; Bostrom, 2008]. However, given\nour current technological status and understanding of the brain, we suggest that\nthe exocortex might be a likely intermediate step. As an exocortex-equipped brain\naged, degenerated and eventually died, an exocortex could take over its functions,\nuntil finally the original person existed purely in the exocortex and could be copied\nor moved to a different substrate.</p>\n</blockquote>\n<p>This seems to avoid the objection of it being too hard to scan the brain in all detail. If we can replicate the high-level functioning of the cortical algorithm, then we can do so in a way which doesn't need to be biologically realistic, but which will still allow us to implement the brain's essential functions in a neural prosthesis (here's some <a href=\"http://iopscience.iop.org/article/10.1088/1741-2560/8/4/046017/meta\">prior</a> <a href=\"http://iopscience.iop.org/article/10.1088/1741-2560/10/6/066013/meta\">work</a> that also replicates some aspect of brain's functioning and re-implements it in a neuroprosthesis, without needing to capture all of the biological details). And if the cortical algorithm can be replicated in a way that allows the person's brain to gradually transfer over functions and memories as the biological brain accumulates damage, the same way that function in the biological brain gets reorganized and can remain intact <a href=\"https://linkinghub.elsevier.com/retrieve/pii/S0140-6736(07\\\">even as it slowly accumulates massive damage</a>61127-1), then that should allow the entirety of the person's cortical function to transfer over to the neuroprosthesis. (of course, there are still the non-cortical parts of the brain that need to be uploaded as well)</p>\n<p>A large challenge here is in getting the required amount of neural connections between the exocortex and the biological brain; but we are already getting relatively close, taking into account that the corpus callosum that connects the two hemispheres &quot;only&quot; has on the order of 100 million connections:</p>\n<blockquote>\n<p>Earlier this year, the US Defense Advanced Research Projects Agency (DARPA) launched a project called Neural Engineering System Design. It aims to win approval from the US Food and Drug Administration within 4 years for a wireless human brain device that can monitor brain activity using 1 million electrodes simultaneously and selectively stimulate up to 100,000 neurons. (<a href=\"https://www.nature.com/news/four-ethical-priorities-for-neurotechnologies-and-ai-1.22960\">source</a>)</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Kaj_Sotala"}}, {"_id": "EMMTZpLiCqJnWoAur", "postedAt": "2018-01-13T02:20:09.489Z", "postId": "BxMzd4CRYBF8wuwFW", "htmlBody": "<p>Neuroprosthesis-driven uploading seems vastly harder for several reasons:</p>\n<p>• you'd still need to understand in great detail how the brain processes information (if you don't, you'll be left with an upload that, while perhaps intelligent, would not act like how the person acted, and perhaps even drastically so that it might be better to imagine it as a form of NAGI than as WBE)</p>\n<p>• integrating the exocortex with the brain would likely still require nanotechnology able to interface with the brain</p>\n<p>• ethical/ regulatory hurdles here seem immense</p>\n<p>I'd actually expect that in order to understand the brain enough for neuroprosthesis-driven uploading, we'd still likely need to run experiments with nanoprobes (for the same arguments as in the paper: lots of the information processing happens on the sub-cellular level - this doesn't mean that we have to replicate this information processing in a biologically realistic manner, but we likely will need to at least understand how the information is processed)</p>\n", "parentCommentId": "QEG6AiHeRGTfAKSR6", "user": {"username": "Daniel_Eth"}}, {"_id": "gDATY5FECZvCFLzr9", "postedAt": "2018-01-15T17:46:00.739Z", "postId": "BxMzd4CRYBF8wuwFW", "htmlBody": "<p>What do you mean by nanoscale neural probes? What are the questions that these probes would answer?</p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "iwsRyDj9ydYEe8nLW", "postedAt": "2018-01-17T09:26:25.249Z", "postId": "BxMzd4CRYBF8wuwFW", "htmlBody": "<p>Broadly speaking, nanoparticles (or nanorobots, depending on how complicated they are) that scan the brain from the inside, in vivo. The sort of capabilities I'm imagining is the ability to monitor every neuron in large neural circuits simultaneously, each for many different chemical signals (such as certain neurotransmitters). Of course, since this technology doesn't exist yet, the specifics are necessarily uncertain - these probes might include CMOS circuitry, they might be based on DNA origami, or they might be unlike any technology that currently exists. Such probes would allow for building much more accurate maps of brain activity.</p>\n", "parentCommentId": "gDATY5FECZvCFLzr9", "user": {"username": "Daniel_Eth"}}, {"_id": "YaYpDJjspbmGnBuhs", "postedAt": "2018-01-17T12:47:53.490Z", "postId": "BxMzd4CRYBF8wuwFW", "htmlBody": "<p>Technology to do something like this is already being developed, but it's not nanotechnology: <a href=\"https://www.nature.com/articles/nmeth.3151\">https://www.nature.com/articles/nmeth.3151</a></p>\n<p>Nanotechnology is rarely the most practical way to probe very small things. People have been able to infer molecular structures since the 19th century. Modern molecular biology/biochemistry makes use of electron microscope, fluorescent microscopy, and sequencing-based assays, among other techniques. </p>\n", "parentCommentId": "iwsRyDj9ydYEe8nLW", "user": {"username": "Lila"}}, {"_id": "FnmtZwvRXzSKzCPYS", "postedAt": "2018-01-18T00:59:33.284Z", "postId": "BxMzd4CRYBF8wuwFW", "htmlBody": "<p>Nanotechnology is technology that has parts operating in the range of between 1 nm and 100 nm, so actually this technology is nanotechnology - as is much of the rest of biotechnology.</p>\n<p>You're right that the usefulness of non-biotech based nanotechnology (what people typically think of as nanotechnology) hasn't been used much - that's largely due to it being a nascent area. I expect that to change over the coming decades as the technology improves. It might not, though, as biotech based nanotechnology might stay in the lead.</p>\n", "parentCommentId": "YaYpDJjspbmGnBuhs", "user": {"username": "Daniel_Eth"}}]