[{"_id": "Lub4bLPWnETqkpXjN", "postedAt": "2022-09-22T09:49:16.362Z", "postId": "BxwSMFnuDgB4Fovaw", "htmlBody": "<p>I don't think the term \"x-risk footprint\" makes sense. A carbon footprint isn't an equal fraction of the carbon emitted in the world, it's the amount you personally emit. There's no equivalent for x-risk; the world would not be safer if you didn't exist.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "HyLvskeR3A9gDLaAG", "postedAt": "2022-09-22T11:24:04.861Z", "postId": "BxwSMFnuDgB4Fovaw", "htmlBody": "<p>Thanks for commenting, Kirsten.</p><blockquote><p>A carbon footprint isn't an equal fraction of the carbon emitted in the world, it's the amount you personally emit.</p></blockquote><p>I agree, but I would say the carbon footprint of the mean human can be calculated by diving the global greenhouse gas (GHG) emissions by the total population.</p><blockquote><p>There's no equivalent for x-risk; the world would not be safer if you didn't exist.</p></blockquote><p>I think there is an equivalent for x-risk to some extent. For example, GHG emissions contribute to x-risk from climate change. Similarly, in the same way that some people have a larger carbon footprint, I guess some people have a larger x-risk footprint. For example, people in the apocalyptic residual (see <a href=\"https://nickbostrom.com/papers/vulnerable.pdf\">Bostrom 2019</a>) working in a <a href=\"https://en.wikipedia.org/wiki/Biosafety_level\">BSL</a>-4 lab would have a larger x-risk footprint than a typical rural farmer in Kenya.</p><p>However, I agree the concept of footprint is flawed in many ways. This post was just a calculation I found interesting, and fun to do. As I said above:</p><blockquote><p>In any case, effective donations and other actions are:</p><ul><li>Better seen as a great way of increasing impact. Thinking about them as a form of offsetting could limit our ambition and lead to a smaller impact.</li><li>Often complementary instead of mutually exclusive.</li></ul></blockquote>", "parentCommentId": "Lub4bLPWnETqkpXjN", "user": {"username": "vascoamaralgrilo"}}]