[{"_id": "eZoLJfLi3hqnoKrd9", "postedAt": "2022-11-06T23:57:51.199Z", "postId": "BxWuyD3GwGfbEKHJo", "htmlBody": "<p>Last year (2021) the world <a href=\"https://www.utilitydive.com/news/solar-coal-wind-global-capacity-bnef-report/632316/\">added 182 GW of solar PV and 90 GW of wind capacity</a>.</p>\n<p>Nuclear globally saw <a href=\"https://www.iea.org/fuels-and-technologies/nuclear\">5 GW of additions, and 8 GW of retirements, for a net -3 GW capacity</a>.  Nuclear additions will need to increase considerably to maintain net capacity as many retirements are scheduled in the next decade.</p>\n<p>Given the data around capacity additions, growth rates, and learning rates, I'm really puzzled how you end up scoring nuclear well on your <em>QUICK</em>, <em>ZERO</em>, and <em>FACILITATE</em> criteria:</p>\n<ul>\n<li><em>\"Criterion QUICK: An energy strategy must lead to the highest practically feasible near-term emission reductions for the actor’s energy system, without causing significant harm elsewhere.\"</em></li>\n<li><em>\"Criterion ZERO: An energy strategy pursued by an actor must, with high chance of success, reduce the total greenhouse emissions of the actor’s energy system to zero in a suitable time frame, without increasing emissions elsewhere.\"</em></li>\n<li><em>\"Criterion FACILITATE: An energy strategy must facilitate, rather than impede, the path toward global zero emissions, in a suitable time frame.\"</em></li>\n</ul>\n<p>Zero-carbon energy technologies at &lt;10 GW capacity additions per year with little to now growth over the last decade fail <em>QUICK</em> and <em>ZERO</em>.  An energy technology also fails <em>FACILITATE</em> if it takes 5-7 years to become operational, and the same investment could have purchased more or cheaper zero-carbon resources such as VRE or efficiency that would be deployed sooner.  <a href=\"https://www.sciencedirect.com/science/article/pii/S2542435121002464\">The net result from delay nuclear entails may mean higher cumulative emissions</a>.</p>\n<p>It's also weird to me that you single out nuclear as the key to technology to pair with renewables when there are <a href=\"https://www.sciencedirect.com/science/article/pii/S2542435122004056\">several other strategies to provide that firm generation role</a>.  Your same arguments apply to other technologies such as H2 CTs, storage, or hot rock geothermal.  These all get much less advocacy support, but appear to have far better unit economics, and are more or less at similar levels of development and deployment to SMRs.  They also don't entail any of the profileration, waste, and weapons concerns.</p>\n<p><strong>I'm not against nuclear, I just find the singular, fanatical support for it really odd given the technology landscape.</strong></p>\n<p>Lastly, no analysis of decarbonizing electricity is complete without acknowledging efficiency.\n<a href=\"https://www.sciencedirect.com/science/article/pii/S2214629620304606\">All generation sources have negative externalities. Efficiency and demand response reduce electric demand and have large, positive externalities</a>.  Buildings are ~75% of the load on the grid. Most buildings are horribly inefficient - it's common to see a 3x difference in energy use between buildings of the same size and type.  New buildings are getting much better. Building energy codes in developed countries are moving to net-zero as code by 2030. It's difficult to understate how significantly zero-energy codes will change the nature of the grid in the long run. Also, building floor area will triple by 2050, with most construction in countries without building energy codes. In the U.S., energy codes over the last 50 years have counterfactually reduced grid demand by ~60%. The same could be done for developing countries.\nWhy don't grid modelers include energy efficiency potential in their models? Simple - they only focus on the supply side and treat demand as exogenous, because they don't have the expertise to do a bottom-up model of electric demand (yet - it has been done on city-scale projects).  Seems to me efficiency is the closest thing to an ethical imperative if such imperatives meaningfully exist.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "Jxz9Cgt27mJmR842L", "postedAt": "2022-11-07T08:51:59.018Z", "postId": "BxWuyD3GwGfbEKHJo", "htmlBody": "<p>Thanks for your thoughtful response!</p><p>You are right that investing in new nuclear tends to score rather badly according to QUICK. We say the same in the paper. However, as we explain, we tend to regard out two other criteria as more important, because of lock-in and path dependency risks if we focus mostly on short-term emission reductions. (Considerations about harm from emissions being cumulative count in the other direction, though.)</p><p>You are also right about other technologies potentially being able to play a similar role. Hydropower especially often does so already. Where it is available (or where geothermal plausibly will), there is no, or at least no strong, imperative to invest in new nuclear from ZERO, though it may still be wise.&nbsp;</p><p>Your points on efficiency are well taken, but I don't quite see how they are relevant. By indicating that overall demand is set to fall, at least if the right steps are taken? I'm not sure about that. In any case, the grid modellers whose works we cite tend to assume very large efficiency gains and significantly lower overall final energy demand by mid-century in developed countries. I am sceptical that these are helpful assumptions (notably, we might want to make sure that developed countries can still have energy-intensive industry and/or contribute significantly to negative emissions), but they are made.</p>", "parentCommentId": "eZoLJfLi3hqnoKrd9", "user": {"username": "simonfriederich"}}, {"_id": "YqJ7K57P3JJhbHpwB", "postedAt": "2022-11-08T14:02:29.518Z", "postId": "BxWuyD3GwGfbEKHJo", "htmlBody": "<p>I found this article interesting, have an upvote. In particular I didn't know the dynamic around nuclear energy assistance being tied to nonproliferation agreements. That seems pretty cool. I'd be interested in more exploration of the effectiveness there, but I didn't read the cited paper, so ¯\\_(ツ)_/¯.</p><p>That said, I found this article disappointing. Like y'all, I agree that nuclear energy as many theoretical advantages. However, tragically, those advantages seem stymied by:</p><ol><li>Unfriendly regulation</li><li>A really bad case of cost disease<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefh3kafgo1il\"><sup><a href=\"#fnh3kafgo1il\">[1]</a></sup></span>&nbsp;(which may be a function of the regulation, or may not, we can for now just observe the costs)</li></ol><p>If we don't fix those, we won't see nuclear energy becoming a particularly relevant factor. I'm all for fixing those! And I was mostly expect to see y'all explain a well-worked and/or convincing argument for optimism there. You did address both, and I'll attempt to summarize them both, please let me know if you disagree:</p><ol><li>\"Indeed, in some parts of the world nuclear energy has the potential to engage the traditionally “climate-sceptical” political right. Successful bipartisan legislative initiatives in the US to speed up the development of advanced nuclear reactors reflect this. It should also be noted that, even in nuclear-sceptical western countries, the popular acceptance of nuclear energy is highest among those who are living closest to nuclear reactors.\" (No summary needed! I can quote your entire argument in three sentences!)</li><li>Rougher summary for the economic challenges:<ol><li>Nuclear used to be cost-competitive in the west in the 60s-80s, and still is competitive in some parts of Asia.</li><li>We can pursue approaches to cutting costs. Building automation, and Small Modular Reactors seem promising.</li></ol></li></ol><p>I will first of all grant that I am much more optimistic about nuclear energy in Asia, given what you write, which again, super interesting article, thanks a bunch.</p><p>For the rest however, I found the arguments underdeveloped. To briefly respond: All of the regulatory factors you mention are not new. Maybe we're at the crux of an imminent shift in public opinion, but I feel like I'd need more convincing. And for costs, there have been strong economic incentives to lower costs for a long time. Any good technologist always has a story for how their technology will reduce in costs and/or get better soon. Nevertheless, one should be skeptical of such claims. And I feel not-particularly compelled by this story.</p><p>It seems plausible to me that there's a role for nuclear energy policy advocacy in the portfolio of solutions to climate change, but it seems smaller than the summary here makes it out to be, and I don't currently see what it is.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnh3kafgo1il\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefh3kafgo1il\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In keeping with a local dialect, I use cost disease in a <a href=\"https://slatestarcodex.com/2017/02/09/considerations-on-cost-disease/\">slightly nonstandard, broader sense</a>, which I got from Scott Alexander / Tyler Cowen.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "zKxfCNav9uaNrEYJF", "postedAt": "2022-11-10T11:44:03.452Z", "postId": "BxWuyD3GwGfbEKHJo", "htmlBody": "<p>Thanks for reading and for sharing your thoughts! Your summary seems adequate. Our main focus was on the ethical argument, not so much about whether there is reason for optimism regarding cost development. To some extent, this question is discussed in our references, though.</p>", "parentCommentId": "YqJ7K57P3JJhbHpwB", "user": {"username": "simonfriederich"}}, {"_id": "yptvZyCskH5QwitYh", "postedAt": "2022-11-10T13:40:49.481Z", "postId": "BxWuyD3GwGfbEKHJo", "htmlBody": "<p>Cool, that makes sense. However, here's a point I want to make: in effective altruism (and I would say, in the world at large) one needs to focus on tractability to make the base for an intervention to be an ethical priority. Otherwise, you as an agent with non-infinite resources would do better to focus on another way of achieving your goals.</p><p>To a large extent you can say, \"yep, if we had more space we would devote more effort to that.\" But to this audience, who is already sympathetic to the in-theory benefits of nuclear energy, I doubt you have done much to convince me / them.</p>", "parentCommentId": "zKxfCNav9uaNrEYJF", "user": {"username": "jpaddison"}}]