[{"_id": "PKSEuhsieeYGkz5ga", "postedAt": "2014-04-14T02:29:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>It looks like all the footnote links in this post go to a non-existent file instead of to the footnotes at the end.</p>\n", "parentCommentId": null, "user": {"username": "Michael_Dickens"}}, {"_id": "LHX6hcnrtdkGLyKqf", "postedAt": "2014-04-14T02:51:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Sorry about that. I'm currently working on fixing this problem.</p>\n", "parentCommentId": "PKSEuhsieeYGkz5ga", "user": {"username": "Pablo_Stafforini2"}}, {"_id": "DdD3tcAkgfJZce8vz", "postedAt": "2014-04-14T03:10:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Nice post - many interesting points!</p><p></p><p>One\nminor comment, regarding this bit:</p><p>&quot;In\nthe light of this reality, the rationalist suggestion I have encountered – that one guard against a desire to\nbecome a parent by pre-emptively\nbeing sterilised before the desire has arisen – seems a recipe for psychological disaster.&quot;</p><p></p><p>It\nstrikes me that one straightforward way to test this claim empirically would be to look at the extent to which the lives of\npeople who are infertile due to some pathology tend to end in &quot;psychological disaster.”</p><p></p><p>According\nto the <a href=\"http://scholar.google.com/scholar?cites=8091203382061989760&amp;as_sdt=2005&amp;sciodt=0,5&amp;hl=en\"> most cited article on the topic </a>,</p><p></p><p>&quot;The\ndescriptive literature on the psychological consequences of infertility presents infertility as a devastating\nexperience, especially for women.\nAttempts to test the psychological consequences hypothesis have produced more equivocal results. In general, studies which\nlook for psychopathology have not found significant differences between the infertile and\nothers. Studies which\nemploy measures of stress and self-esteem have found significant differences.&quot;</p><p></p><p>Perhaps someone feels like investigating this particular\nsub-issue in more detail!</p>", "parentCommentId": null, "user": {"username": "Guest"}}, {"_id": "WSfYM2uDw3nfsCCPc", "postedAt": "2014-04-14T13:01:22.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Thanks for your thoughtful response.</p><p>As a medical professional, as well as within my friendship group, I've actually had very extensive experience of people experiencing sub-fertility or infertility. On the basis of that experience I have quite a high prior for this statement. One friend, who underwent 3 years of testing and treatment before becoming pregnant described her feeling on being pregnant as 'the first time in 3 years I haven't felt sad, stressed and unhappy for every hour of the day'.  </p><p>The essay cited seems to conclude that the literature reveals only 'stress' but not enough to result in a diagnosis of a psychiatric disorder. I would argue the levels of stress involved do not need to meet the criteria for major depression in order to have a significantly negative impact on one's life and productivity. A more recent review of the literature (2007) suggests prevalence of depression and anxiety in patients seeking treatment for infertility that are 2 to 4 times the general population.  <a href=\"http://www.sciencedirect.com/science/article/pii/S1521693406001611\">http://www.sciencedirect.com/science/article/pii/S1521693406001611</a> </p><p>Finally, one of the most pervasive emotions experience by people suffering sub-fertility or infertility is a sense of guilt and failure, even among those who know this rationally not to be the case. If you knew you had deliberately produced this difficulty, it seems reasonable to predict those feelings would be very much amplified.</p>", "parentCommentId": "DdD3tcAkgfJZce8vz", "user": {"username": "Bernadette_Young"}}, {"_id": "ikQiB2mKLsdXNs9no", "postedAt": "2014-04-14T13:22:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Thanks for your thoughtful response.</p><p>As a medical professional, as well as within my friendship group, I've actually had very extensive experience of people experiencing sub-fertility or infertility. On the basis of that experience I have quite a high prior for this statement. One friend, who underwent 3 years of testing and treatment before becoming pregnant described her feeling on being pregnant as 'the first time in 3 years I haven't felt sad, stressed and unhappy for every hour of the day'.  </p><p>The essay cited seems to conclude that the literature reveals only 'stress' but not enough to result in a diagnosis of a psychiatric disorder. I would argue the levels of stress involved do not need to meet the criteria for major depression in order to have a significantly negative impact on one's life and productivity. A more recent review of the literature (2007) suggests prevalence of depression and anxiety in patients seeking treatment for infertility that are 2 to 4 times the general population (with rates between 20 and 40% compared with 10%)\n<a href=\"http://www.sciencedirect.com/science/article/pii/S1521693406001611\">http://www.sciencedirect.com/science/article/pii/S1521693406001611</a> </p><p>Finally, one of the most pervasive emotions experience by people suffering sub-fertility or infertility is a sense of guilt and failure, even among those who know this rationally not to be the case. If you knew you had deliberately produced this difficulty, it seems reasonable to predict those feelings would be very much amplified.</p>", "parentCommentId": "DdD3tcAkgfJZce8vz", "user": {"username": "Bernadette_Young"}}, {"_id": "2kNCdZXqjDkAiNG5h", "postedAt": "2014-04-14T18:33:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Great post. As the father of a daughter in her second year of college, I'd make two quick comments:</p>\n<ol>\n<li>The cost estimates of raising a child -- at least in our case -- our vastly overblown. </li>\n<li>This might be impossible to answer for sure, but seems a more important question than it seems to be given credit:\n&quot;Finally we may ask whether parenthood – and the resulting person created – will benefit the wider world?&quot;\nNot that this would be the norm, but because of our daughter, there are many more vegetarians and non-chicken-eating people in the world. At least so far, many people have supported my work and my wife's work in part because of their fondness for our daughter. \nAnd, more importantly, she is pursuing a utilitarian career. \nPS -- Good luck!</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Matt_in_AZ"}}, {"_id": "3TqqTRkmLqkDaBDJX", "postedAt": "2014-04-14T19:15:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Nice post, Bernadette. You make a good case that some people may need to have children to be most effective. My guess is the situation depends heavily on the individual, although assessing which type of individual you are may not be easy. (You might think you don't want kids and then change your mind, or you might think you need kids for a brief time, after which the need fades.)</p>\n", "parentCommentId": null, "user": {"username": "Brian_Tomasik"}}, {"_id": "66KFimPD6JLaWM7F6", "postedAt": "2014-04-14T19:36:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>This is a very interesting essay addressing a very important decision EAs face. Thank you for writing it!</p><p>\nI think your estimates for the annual financial cost of having children underestimate the real costs, because they don't account for the time value of money and because they omit opportunity costs.</p><p>To account for the time value of money, we can use the formula used to calculate <a href=\"https://en.wikipedia.org/wiki/Amortization_(business)\">amortization</a> in business.  Assuming a present-value cost of £175,000, an interest rate of 5% and 50 periods, the annual cost for each couple turns out to be about <b>£4,700</b> per parent per year.</p><p>To account for opportunity costs, we can use Brian Tomasik's <a href=\"http://www.utilitarian-essays.com/cost-of-kids.html#section3\">estimates</a>.  He claims that the present-value opportunity costs of parenting are about $380,000, or £225,000. Adding this to the financial costs, we get a total cost of £400,000.  Using the formula above, this translates into about <b>£11,000</b> per parent per year.</p><p>However, as Brian notes in private correspondence, the opportunity costs could be much lower if parents outsource them. And parents persuaded by Bryan Caplan's arguments should be less reluctant to outsource these costs.  So for you and Toby, and for many other EAs, the estimate is probably lower than £11,000.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini2"}}, {"_id": "6RkHmzwMdWR5sHgE3", "postedAt": "2014-04-15T02:29:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>You could outsource the costs if that's something you're inclined to do. I would probably feel guilty about doing so myself.</p><p>\nThe opportunity costs can vary a lot based on what your alternative career might have been (e.g., for a would-have-been CEO they're much bigger than for a would-have-been librarian), as well as whether the parenting time comes from your existing leisure time or your existing work time.</p>", "parentCommentId": "66KFimPD6JLaWM7F6", "user": {"username": "Brian_Tomasik"}}, {"_id": "YCCK6zWueJq6LPNtB", "postedAt": "2014-04-15T21:39:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Thank you for treating this as the complicated set of issues it is, rather than boiling it down to one thing.</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise2"}}, {"_id": "nZda5NfWdMWEjAFPZ", "postedAt": "2014-04-16T00:14:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>I'm not familiar with the theory behind the time value of money to appraise it, but it looks to me like your calculation here has taken my per parent figure and come out with a per couple figure, which (I'm sure unintentionally) makes it look at first read like my estimate is &lt;50% of the true cost). But the figure of £4700 per couple is not wildly different from £4000 per couple per annum, given the uncertainty bounds I'd put on it. </p><p>Regarding the opportunity costs estimate here I'd dispute that figure with gusto. I think that estimate is inaccurate and probably inflated for two major reasons.</p><p>Firstly, I don't think we have anything like the amount of certainty about that figure - at the very least it deserves some error bars! (Incidentally, I find this is a big problem with back-of-the-envelope calculations that come out with a single figure - the number looks much more authoritative than it should given the uncertainty regarding the factors behind it). </p><p>I was deliberately not specific as to the amount of the time cost involved because I was unable to find reliable data to make such an estimate. Brian's essay does not provide any data from which he draws  his estimate of 21 hours per week per parent in time opportunity costs (I think I am correct in believing he's not a parent). He simply states it after a long list of the types of work that parenting involves.  In his account, the following are 'work':  &quot;playing with your toddler…spending quality time with your kid on the weekends, taking your kid to events and friends' houses, going to school functions…giving advice on jobs, and everything else in between.&quot; I don't dispute that some elements of parenting are straightforwardly work - probably unpleasant and with no immediate reward for the individual performing them. However to describe playing with your child, engaging in social activities or giving interested advice to a young person exploring future career options as 'work' is a little boggling to me. I suspect that for most people who would class these things as work, parenthood is unlikely to be an attractive prospect.</p><p>So I am sceptical of the apparently randomly drawn figure of the hours of work involved. Of course, I'm happy to report back with data on this in a few years.</p><p>Secondly (and this criticism also applies to Brian's figure of 21 hours per parent per week even if it were accurate), I would dispute the assumption that each marginal hour of time can be spent in earning money at the same rate as your basic income.</p><p>Depending on your type of work, It may not be practically possible: In my case, though I can increase my earnings by taking on extra shifts, the number I can take is capped as I am not allowed to exceed a set number of hours of clinical duty per week (averaged over a period of time). In fact, just yesterday a colleague was reprimanded for having taken on locum shifts which meant he exceeded these hours, and he has had to come off the 'on-call' rota (with a concomitant salary cut) to allow the time to average out. For someone in a full-time salaried position (say a university research appointment), it's not the case that working longer hours increases your pay. For most people in this position it's unlikely to be the case that opportunities exist to find an extra 21 hours of paid work per week which will pay them at a professional wage. </p><p>In addition to the practical possibility there's the psychological reality. I don't know many people who can actually consistently and productively do paid work 50+ hours a week. I recall seeing data (on this blog) that suggested those who estimate their working hours much about the mid-40s were a) overestimating and b) no more productive than those who claimed to work fewer hours.  Certainly at a population level an inverse relationship is observed between hours worked and productivity</p><p><a href=\"http://www.economist.com/blogs/freeexchange/2013/09/working-hours\">http://www.economist.com/blogs/freeexchange/2013/09/working-hours</a>.</p><p>So even we did work in careers that would theoretically allow us to increase our working hours by nearly 50 and be paid for it, I think it's highly unlikely we would sustain that working pattern. (I'm sure some people can, I just know I'm not them!)</p>", "parentCommentId": "66KFimPD6JLaWM7F6", "user": {"username": "Bernadette_Young"}}, {"_id": "qBqGwqT2jqd9XiLeB", "postedAt": "2014-04-16T00:15:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Thank you! I'm very much looking forward to sharing views on the topic in more detail with you in the summer.</p>\n", "parentCommentId": "YCCK6zWueJq6LPNtB", "user": {"username": "Bernadette_Young"}}, {"_id": "eopfDvGkWNhTMgpcQ", "postedAt": "2014-04-16T00:19:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Thank you. </p><p>I think my reluctance to give a lot of argumentative weight to the benefits my child might add to the world come from how hard it is to be certain - at least from this end. I'm very much aware of being new to the parenting game with untested skills. Also, while both Toby and I have parents who feel strongly about justice and equality, and who almost certainly helped form us to who we are, we also have siblings who differ from us. I am trying not to have too specific a set of expectations for my child. However your daughter sounds like someone to be very proud of - congratulations, and well done!</p>", "parentCommentId": "2kNCdZXqjDkAiNG5h", "user": {"username": "Bernadette_Young"}}, {"_id": "zeWWQrXQT3DfwKRBz", "postedAt": "2014-04-16T00:23:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Absolutely it's going to vary with individuals greatly. The irreversible nature of the decision (and with a limited reproductive lifespan the decision for women and stable couples is irreversible either way) certainly adds to the difficulty in appraising what is right for you as an individual. It's quite difficult to study this, especially as most people will try to come to a position where they believe their decisions have been 'for the best', and so may downplay the degree of suffering not becoming a parent has involved for them.</p>\n", "parentCommentId": "3TqqTRkmLqkDaBDJX", "user": {"username": "Bernadette_Young"}}, {"_id": "8w8HbJ6iTp3oy5bWC", "postedAt": "2014-04-16T01:28:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Thanks for the reply.  You write:</p><p><blockquote>I'm not familiar with the theory behind the time value of money to appraise it, but it looks to me like your calculation here has taken my per parent figure and come out with a per couple figure, which (I'm sure unintentionally) makes it look at first read like my estimate is &lt;50% of the true cost). But the figure of £4700 per couple is not wildly different from £4000 per couple per annum, given the uncertainty bounds I'd put on it.</blockquote></p><p>No, sorry: I took the middle value of your £150-£200,000 estimate (£175,000) then divided this figure by two and used one of the many amortization schedule calculators found online to reach the £4700 figure, assuming a 5% interest rate and 50 annual periods.  So £4700 is what <em>each parent</em> would need to pay at the end of each year, over the following 50 years, to cover the costs of having the child. (This assumes £175,000 is the <em>present-value</em> cost of parenthood, rather than the nominal cost.)</p><p>I have nothing to add to your comments about Brian's estimates, and I agree with much of what you write.  I relied on those estimates because I knew of no better ones.  I do however think that if you believe his calculations are inflated you should, if possible, use figures that match your own estimates, rather than no estimates at all. But I grant that this may be quite complicated, since the opportunity costs of parenting may be highly sensitive to factors that vary significantly among different people, as Brian himself acknowledges in <a href=\"http://www.effective-altruism.com/parenthood-and-effective-altruism/#comment-1336646253\">his comment</a>.</p>", "parentCommentId": "nZda5NfWdMWEjAFPZ", "user": {"username": "Pablo_Stafforini2"}}, {"_id": "o72KPJ8u5LJT4huZi", "postedAt": "2014-04-16T02:54:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>I'm looking forward to that too!</p>\n", "parentCommentId": "qBqGwqT2jqd9XiLeB", "user": {"username": "Julia_Wise2"}}, {"_id": "nxMHCpEeXRbe4nFAZ", "postedAt": "2014-04-16T17:47:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Hi Pablo,</p><p>\nYou are right that the £2,000 per year per parent lifetime cost would be better if it included an adjustment for the fact that the cost aren't evenly distributed over that timespan. However, they <em>are</em> distributed over twenty years of that time and I think the amortization calculator you used assumes it is all paid as a lump sum on year one. I set up a spreadsheet to allocate the costs evenly over the first twenty years and then look for which amount this was equivalent to paying if the costs were spread out over the whole 50 years. This was £3,000 per parent per year, which is higher than the £2,000, but quite a bit less than the £4,700. This is still not perfect as the costs are skewed a bit towards the early and late years, but it should be pretty close to the right model.</p><p>\nI also think that 5% above inflation is substantially higher than the best estimates of the risk adjusted rate of return. Using 3%, the cost per annum drops to £2,500, which is pretty close to the original unadjusted estimate. </p><p>\n(Note that you might want something even higher than 5% if you would really like to spend/donate money a lot sooner, but if so, you should also be taking out loans in order to donate more sooner and I've never met anyone doing that).</p>", "parentCommentId": "66KFimPD6JLaWM7F6", "user": {"username": "Toby_Ord"}}, {"_id": "NnA2diRmo3a5gr66G", "postedAt": "2014-04-17T01:58:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Hi Toby,</p><p><blockquote>However, they <em>are</em> distributed over twenty years of that time and I think the amortization calculator you used assumes it is all paid as a lump sum on year one.</blockquote></p><p>Yes, this is what I assumed.  As I note at the end of my previous comment, I took the £150-200,000 figure to represent the <em>present-value</em> cost of having a child, rather than the unadjusted sum of payments that parents are expected to make over a 20-year period.  I think I made that assumption because Brian's own estimates are adjusted for the time value of money. I agree that, if this assumption doesn't hold in this case, then the cost per parent per year is £3,000 (excluding opportunity costs).</p>", "parentCommentId": "nxMHCpEeXRbe4nFAZ", "user": {"username": "Pablo_Stafforini2"}}, {"_id": "3TCtL6wC7WRYrqH6q", "postedAt": "2014-04-17T21:07:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>5% above inflation seems reasonable if you invest in stocks, unless you think (as some do) that stock markets are going to systematically have lower returns in the future than they did in the past. I don't see why a risk-free rate would be appropriate, since stocks aren't risky enough to cause problems in many practical situations.</p>\n", "parentCommentId": "nxMHCpEeXRbe4nFAZ", "user": {"username": "Brian_Tomasik"}}, {"_id": "3QrTQeyLXFSvX4MqZ", "postedAt": "2014-04-17T21:17:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Bernadette makes some good criticisms, and I've updated my piece in response. I now put the opportunity-cost figure around $100K of present value, which seems low but not obviously too low if much of the parenting time is not &quot;work.&quot; I also changed the opportunity cost from being about extra income to being about how much you value what you would have been doing instead.</p><p>Individual differences seem big here. While there are some people like Bernadette and Julia who give extensive thought to this issue, there are others who don't actually care about kids as much but just go along with social custom, spousal pressure, or the results of carelessness with birth control. It's this latter group that my piece is mainly intended to speak to. I don't know the relative proportions of different types of people in the population.</p>", "parentCommentId": "8w8HbJ6iTp3oy5bWC", "user": {"username": "Brian_Tomasik"}}, {"_id": "DeJQQAcpBYJai2Ecb", "postedAt": "2014-04-22T17:35:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Brian, there are several serious sampling biases in most estimates of long run real returns which tend to overestimate the returns. These include: </p><p>(1) Time selection bias. The 20th century was unprecedentedly good for stocks. If we instead averaged over wider periods or over the 21st century so far, we get much lower numbers. It is unclear what is the best period to use, but many estimates use the most optimistic one which is suspect.\n(2) Country selection bias. The US has done unprecedentedly well with stocks. International comparisons give lower returns and are probably more representative of the future (we don't know which country will do best this time round).\n(3) Within-index selection bias. The major indices are of the top stocks rather than a fixed set, so for example if all the stocks in the S&amp;P 500 went to zero tomorrow, this would really change the real rate of return, but wouldn't change the index that much as the next 500 stocks would replace them -- we need to adjust for that.\n(4) Between-exchange selection bias. Even attempts to adjust for the country selection bias by using a range of stock markets or indices in different countries often overestimate returns because failed stock markets typically don't appear in the later data for they have ceased to exist. One needs to carefully adjust for this.</p><p>\nI don't recall the exact real returns when these things are adjusted for and can't quickly find a good estimate, but I seem to recall it comes down to less than 3%. If someone has a pointer to a good estimate, I'd love to see it.</p><p>\nRegarding risk adjustment, I didn't mean risk aversion, just that you have to adjust for the chance of losses as well as gains to get an expected rate. Any sensible aggregate will do this.</p>", "parentCommentId": "3TCtL6wC7WRYrqH6q", "user": {"username": "Toby_Ord"}}, {"_id": "DLnAyuWEjr37DTRbb", "postedAt": "2014-04-23T09:35:00.000Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Thanks for those notes. :)</p><p><a href=\"http://economics.mit.edu/files/637\">http://economics.mit.edu/files/637</a> says the US Social Security Administration used a 7% real rate of return, but the paper goes on to explain why that seems too high.</p><p><a href=\"https://en.wikipedia.org/wiki/Equity_premium_puzzle\">https://en.wikipedia.org/wiki/Equity_premium_puzzle</a> says the equity premium for stocks &quot;is generally accepted to be in the range of 3–7% in the long-run.&quot; That piece lists reasons to deny an equity premium, similar to those you enumerate, but it also says &quot;most mainstream economists agree that the evidence [for an equity premium] shows substantial statistical power.&quot; I don't know enough to evaluate this debate without further investigation, but your concerns about biases seem significant.</p>", "parentCommentId": "DeJQQAcpBYJai2Ecb", "user": {"username": "Brian_Tomasik"}}, {"_id": "tHy6LBic9pZa2o646", "postedAt": "2014-09-09T16:52:14.140Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Many of the costs shared in this post are unfortunately average costs. To set a child up for an earning to give career on Wall Street, top-tier education is necessary and very expensive in most cases. I don't think universities would reduce the expected family contribution even if the parent is donating most of the income to effective charities.\nUltimately, if the child does earn to give, then the cost of education is worth it, provided that humanity exists for several years while the child earns to give.\nAs an 18-year-old, I don't intend to have children because if I would, then I'd get a child at, say, age 30, and it'd take the child ~22 years to get onto Wall Street. That's around 2048, and that's so far in the future that humanity's continuation is much more uncertain.</p>\n", "parentCommentId": null, "user": {"username": "DanielHendrycks"}}, {"_id": "n3dd4d5fNjgpiBgmf", "postedAt": "2015-04-21T19:27:28.974Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>If this is still linking to the correct Economist article, it notes that Greece is poorer than other parts of Europe but Greeks work more hours per week. However, I have not seen evidence for causation, that is if the rest of Europe worked more hours, its GDP per capita would actually fall. Has anyone seen this?</p>\n", "parentCommentId": "nZda5NfWdMWEjAFPZ", "user": {"username": "Denkenberger"}}, {"_id": "xs9CaiWESePjyp9XQ", "postedAt": "2020-01-03T22:31:01.479Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>Are we accounting for all factors here?</p><ul><li>The human right not to be born, not to be used as a means to an end, the lack of consent, the risk (guarantee) of harm.</li><li>You have to (in an ideal world) walk past the orphanage to get to the Pregnancy Care Centre, or IVF unit. What does that do to your psychology in the long run? </li><li>Also, a&apos; la Oskar Schindler, you will have an extra 70 malarial deaths on your conscience. Does that guilt just disappear? Does it really translate to &apos;even better parenting&apos;?</li><li>Perhaps you have too much leisure money set aside? And could your spare time not be spent looking after existing children?</li><li>Less intelligent and less effective people aren&apos;t going to doff their caps and make way for you and your stroller. They will want to get some too, and compete with you. Breeding for power (or for doing good) sends all the wrong messages, elitism being just one of them.</li><li>Advocating not breeding and giving the money away instead will really impress people. Perhaps cause a huge positive chain reaction. Why do you think they would be so turned off? At least stick with &apos;because I just want to&apos; and let your honesty gain their respect. I&apos;m not saying we have to be anti-parent, hostile, or make it mandatory, but actively congratulating and encouraging? Anyway they can always set up their own Procreator-EA group. Why do the job for them?</li></ul>", "parentCommentId": null, "user": {"username": "sombrero"}}, {"_id": "9iHvbbtcKrYYwPrsn", "postedAt": "2020-01-17T14:40:54.266Z", "postId": "bz2A2gRvtrpHAsToN", "htmlBody": "<p>So what? I bet there were people before abolition who felt genuinely sad, stressed, and unhappy about not being able to afford their own slaves, and so became unproductive. </p><p>If the price of a person&apos;s participation in EA is the non-consensual imposition of life on a new (possibly just as sad, stressed, and unhappy) person then I am prepared to say to them &apos;tough luck&apos;, relieve your guilt by adopting or teaching, and try to be a non-failure in other ways. </p><p>Why should people get special treatment just because they claim to be &apos;EA&apos;s? Or are you saying IVF for *everyone* is now an EA cause?</p>", "parentCommentId": "ikQiB2mKLsdXNs9no", "user": {"username": "sombrero"}}]