[{"_id": "c4mrtqLpEiZgYhtF7", "postedAt": "2023-12-15T15:05:04.143Z", "postId": "BZaycPXEbxHhEssmT", "htmlBody": "<p><strong>Executive summary</strong>: The FDA should be stripped of its regulatory authority and transformed into a voluntary informational and labeling body to reduce healthcare costs and spur medical innovation.</p><p><strong>Key points:</strong></p><ol><li>Doctors already commonly prescribe drugs for off-label uses, so removing mandatory FDA approval won't increase liability or prescriptions barriers.</li><li>The FDA's conservative approval process likely causes more harm through delays than doctors' bad prescriptions cause.</li><li>The FDA could still produce drug safety and efficacy data in a voluntary labeling role.</li><li>Neither the current FDA nor proposed alternatives solve issues with insurance incentives.</li><li>Non-binding FDA labeling allows cheaper, faster drug development while retaining labeling incentives.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "9LEAncZqFr5TFMhrB", "postedAt": "2023-12-15T16:01:40.825Z", "postId": "BZaycPXEbxHhEssmT", "htmlBody": "<p>This is a good summary of the post's arguments, but I think misses one key detail: that this post is a response to a post by Scott.</p>", "parentCommentId": "c4mrtqLpEiZgYhtF7", "user": {"username": "Larks"}}, {"_id": "XGdPKGAEjq7nKqRtW", "postedAt": "2023-12-16T00:09:56.349Z", "postId": "BZaycPXEbxHhEssmT", "htmlBody": "<p>\"Completely remove efficacy testing requirements, making the FDA a non-binding consumer protection and labeling agency.\"</p><p>That seems to be how the supplement market works under DSHEA. Is there any evidence that stuff marketed as supplements is any better at curing disease, preventing disease, improving health, etc., than the FDA pathway? Indeed, is there any evidence that the supplement market works well at all? We've known for decades that antioxidants don't actually improve health, yet they are still a huge market. <a href=\"https://pubmed.ncbi.nlm.nih.gov/17327526/\">https://pubmed.ncbi.nlm.nih.gov/17327526/</a> &nbsp;</p>", "parentCommentId": null, "user": {"username": "Stuart Buck"}}]