[{"_id": "FJvNom5yeTXxmkoPj", "postedAt": "2023-01-03T03:34:04.738Z", "postId": "BZLj8tefWZrnB6YPe", "htmlBody": "<p>I have been using Focusmate* for a while now and this post helped me realize that one of my biggest failure modes with it was not having sessions setup to begin each day. I would use it a lot for a while and then get out of the habit and my productivity would gradually start to suffer and it took me some time to realize and get back into it.&nbsp;</p><p>Now I have been booking first sessions out for two weeks. It's flexible in that I can always cancel it if something comes up, but I usually won't and it's elastic in that even if I bail on it for the good part of a day, my first session is setup by default for me for the next day. Usually that's enough to get and keep me on track.&nbsp;</p><p>*A service that matches you with video co-working partners for accountability. <a href=\"https://forum.effectivealtruism.org/posts/ZQPig66wteqwbNHGh/ea-focusmate-group-announcement\">More about it and EA group details here</a>.</p>", "parentCommentId": null, "user": {"username": "captainjc"}}, {"_id": "L2y5ZAYca4cYgmECa", "postedAt": "2023-01-03T07:20:25.517Z", "postId": "BZLj8tefWZrnB6YPe", "htmlBody": "<p>The last link is broken, and should probably be:<br><a href=\"https://forum.effectivealtruism.org/posts/ZQPig66wteqwbNHGh/ea-focusmate-group-announcement\">https://forum.effectivealtruism.org/posts/ZQPig66wteqwbNHGh/ea-focusmate-group-announcement</a></p>", "parentCommentId": "FJvNom5yeTXxmkoPj", "user": {"username": "Søren Elverlin"}}, {"_id": "jMjy5krHdytcmrxFB", "postedAt": "2023-01-03T14:17:48.287Z", "postId": "BZLj8tefWZrnB6YPe", "htmlBody": "<p>Fixed thanks!</p>", "parentCommentId": "L2y5ZAYca4cYgmECa", "user": {"username": "captainjc"}}, {"_id": "nE8TPHtetX8AieyJr", "postedAt": "2023-01-03T18:40:15.777Z", "postId": "BZLj8tefWZrnB6YPe", "htmlBody": "<p>LessWrong for EA seems like a great idea, and a pretty mediocre specific post to choose - it's very recent, not particularly strongly upvoted by the LW community, and doesn't contribute any of the things I have been excited about seeing from &nbsp;LessWrong for EA.</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "Q2ggg74tvQ5ucwhkR", "postedAt": "2023-01-03T19:37:18.807Z", "postId": "BZLj8tefWZrnB6YPe", "htmlBody": "<p>Thank you for the feedback! I agree that it's not the best one I've reposted. I haven't had much time for digging in the LW archives lately though and I came across it, and it actually helped me make some concrete improvements to productivity, so I thought it could possibly help others. I am realizing now that I may be more excited about the productivity-hack genre than most, so I will keep that in mind moving forward.&nbsp;</p><p>If you haven't checked out the ~30 earlier reposts, you can find them by clicking on the tag. I would be surprised if you didn't find that stuff higher quality as they are mostly older and higher karma. Feel free to tag your own reposts as well. I think it would be great to have a collection of stuff that doesn't just reflect my tastes/interests, and I am not sure how frequently I will be able to keep posting at this point.</p>", "parentCommentId": "nE8TPHtetX8AieyJr", "user": {"username": "captainjc"}}]