[{"_id": "oMsCzYPFo9uPe4fme", "postedAt": "2017-11-09T23:46:20.288Z", "postId": "bzoWKMPhDuxNRrvXs", "htmlBody": "<p>Treating Candida via diet isn't accepted science: <a href=\"https://www.mayoclinic.org/healthy-lifestyle/consumer-health/expert-answers/candida-cleanse/faq-20058174\">https://www.mayoclinic.org/healthy-lifestyle/consumer-health/expert-answers/candida-cleanse/faq-20058174</a> </p>\n<p>So it's not surprising a doctor wouldn't diagnose you. </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "zsx5BwNz3qKv2yMJi", "postedAt": "2017-11-10T00:30:08.427Z", "postId": "bzoWKMPhDuxNRrvXs", "htmlBody": "<p>Eliezer's solution wasn't dietary treatment, it was to use imported Nizoral. </p>\n", "parentCommentId": "oMsCzYPFo9uPe4fme", "user": {"username": "kbog"}}, {"_id": "3Q3EK6LbLJuW6ok7i", "postedAt": "2017-11-11T00:29:59.331Z", "postId": "bzoWKMPhDuxNRrvXs", "htmlBody": "<p>Although it isn't clear in the story, doctors often use empirical treatment: i.e. treat the most likely culprit, then rely on the patient to come back if it doesn't work.</p>\n<p>So I don't take this as a huge strike against the medical profession - after all, <em>knowing a treatment hasn't worked</em> is a large informational edge.</p>\n", "parentCommentId": "zsx5BwNz3qKv2yMJi", "user": {"username": "Gregory_Lewis"}}, {"_id": "oQQEseJDhrxddsXWk", "postedAt": "2017-11-11T10:55:25.025Z", "postId": "bzoWKMPhDuxNRrvXs", "htmlBody": "<p>One class of relevant cases is contemporary evaluation of historical decisions. Because then the same issue is being decided twice, by two sets of actors with different incentives, often without much difference in available information. If the two systems come to substantially different conclusions then that suggests that at least one system is inadequate. The frequency of differences in opinion can give us a sense of how often it is that systems are inadequate.</p>\n<p>My impression of military history, where I know the subject best is that the immediate, naive &quot;they made the wrong decision&quot; sorts of claims frequently made or implied in early or popular historical literature are frequently incorrect or flawed and revised by more comprehensive scholarship. E.g., the French realistically couldn't have countered German movement into the Rhineland in 1935 because of a combination of deep political factors and misinformation. The Germans were forced to switch to night bombing in 1940 because of their aircraft losses, not as a single fatal mistake that cost them the Battle of Britain. As to why wrong claims like this are made in the first place, there may be an incentive in historical media to prize sensationalism, blame, other things that activate emotions, rather than simply saying that everyone involved did the best they could and here's how the cards fell.</p>\n<p>However, they're not always incorrect. There are, on occasion, well identified mistakes in historical decisions. You might think that no one in history had a better reason to identify better night fighter designs than the Germans in World War II. But they still failed to build the He-219 in large numbers, due to inadequate political structure of the time.</p>\n<p>Meta note: I really like how the book website links to the messageboards where each chapter is discussed.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}]