[{"_id": "hrXMreaDgDEKfwn6j", "postedAt": "2022-09-12T03:36:22.519Z", "postId": "bZPzDgF9nEXNnGgct", "htmlBody": "<p>Thanks! Charity Entrepreneurship maintain a <a href=\"https://www.charityentrepreneurship.com/recommended-resources\">list</a> of books they recommend, which include a few you mention here. I'm only partway through the list and it's good and helpful, though there are some misses.&nbsp;<br><br>Atomic Habits was quite practically written and concise; the Lean Start-up pretty interesting. I hated Adam Grant's 'Originals' with a passion. &nbsp;Ray Dalio of Bridgewater wrote 'Principles', which has been highly recommended. The third section covering his actual management principles looks really good so far, but the second section, in which Dalio describes his philosophy of life, has some real hot garbage.&nbsp;</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "eoPE9WHkeq27gyX3p", "postedAt": "2022-09-12T09:22:47.356Z", "postId": "bZPzDgF9nEXNnGgct", "htmlBody": "<p>\"Business Adventures\" by John Brooks is a collection of midcentury New Yorker articles about business, obviously very old-fashioned but they are really quite good. There's something to be said for learning about:</p><ul><li>a short squeeze in shares of the Piggly-Wiggly supermarket chain (founder went broke, later tried to make Amazon Just Walk Out but with 1950s punch card technology)</li><li>the first insider trading lawsuit</li><li>the first \"Big Tech\" information technology company that spun off from university research and promoted liberal political causes (Xerox)</li><li>the earliest cases of employees being sued over noncompete/intellectual property agreements</li></ul><p>Among many other interesting but less obviously relevant topics.</p>", "parentCommentId": null, "user": {"username": "anonymous6"}}, {"_id": "PrywkgmLY2Nw53ynW", "postedAt": "2022-09-12T11:51:17.137Z", "postId": "bZPzDgF9nEXNnGgct", "htmlBody": "<p>Thanks for mentioning it. I've never heard of that, but it seems like it has some cool stories. I'll add it to my (ever growing) want-to-read list.</p>", "parentCommentId": "eoPE9WHkeq27gyX3p", "user": {"username": "jlemien"}}]