[{"_id": "EvptbF4yxvifxMP7r", "postedAt": "2022-11-06T22:08:09.476Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>Why is this relevant to the EA forum?</p>\n", "parentCommentId": null, "user": {"username": "Charles_Dillon "}}, {"_id": "zmTE73Hn4RHCZTk6L", "postedAt": "2022-11-06T22:34:31.971Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>There are writing issues and I'm not sure the net value of the post is positive.</p><p>But your view seems ungenerous, ideas in paragraphs like this seem relevant:</p><blockquote><p>This isn't a snide jab at Will MacAskill. He in fact recognized this problem before most and has made the wise choice of not being the CEO of the CEA for a decade now even though he could have kept the job forever if he wanted.&nbsp;</p><p>This is a general problem in EA of many academics having to repeatedly learn they have little to no comparative advantage, if not a comparative disadvantage, in people and operations management.</p><p><strong>Some of the individuals about who there is the greatest concern that may end up in a personality cult, information silo, or echo chamber, like Holden, are putting in significant effort to avoid becoming out of touch with reality and minimizing any negative, outsized impact of their own biases.&nbsp;</strong></p><p>Yet it's not apparent if Musk makes any similar efforts. So, what, if any, are the reasons specific to Musk as a personality causing him to be so inconsistent in the ways effective altruists should care about most?</p></blockquote><p><br>&nbsp;</p>", "parentCommentId": "EvptbF4yxvifxMP7r", "user": {"username": "Charles He"}}, {"_id": "5FF2x4JMvvXGRTm7r", "postedAt": "2022-11-07T01:45:05.349Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>I understood the heart of the post to be in the first sentence: \"what should be of greater importance to effective altruists anyway is how the impacts of all [Musk's] various decisions are, for lack of better terms, high-variance, bordering on volatile.\" While Evan doesn't provide examples of what decisions he's talking about, I think his point is a valid one: Musk is someone who is exceptionally powerful, increasingly interested in how he can use his power to shape the world, and seemingly operating without the kinds of epistemic guardrails that EA leaders try to operate with. This seems like an important development, if for no other reason that Musk's and EA's paths seem more likely to collide than diverge as time goes on.</p>", "parentCommentId": "zmTE73Hn4RHCZTk6L", "user": {"username": "IanDavidMoss"}}, {"_id": "oEJnAtJLdL8rA8usP", "postedAt": "2022-11-07T21:42:25.214Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>What you said seems valid. However, unfortunately, it seems low EV to talk a lot about this subject. Maybe the new EA comms and senior people are paying attention to the issues, and for a number of reasons that seems best in this situation. If that's not adequate, it seems valid to push or ask them about it.</p>", "parentCommentId": "5FF2x4JMvvXGRTm7r", "user": {"username": "Charles He"}}, {"_id": "iqpXqe4gHcxmZDNQ8", "postedAt": "2022-11-08T22:45:10.820Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>Musk has for years identified that one of the major motivators for most of his endeavours is to ensure civilization is preserved.</p>\n<p>From EA convincing Elon Musk to take existential threats from transformative AI seriously almost a decade ago, to his recent endorsement of longtermism and William MacAskill's What We Owe the Future on Twitter for millions to see, the public will perceive a strong association him and EA.</p>\n<p>He also continues to influence the public response to potential existential threats like unaligned AI and the climate crisis, among others. Even if Musk has more hits than misses, his track record is mixed enough that it's worth trying to notice any real patterns across his mistakes so the negative impact could be mitigated. Given Musk's enduring respect for EA, the community may be better able than most to inspire him to make better decisions in the future as it relates to having a positive social impact, i.e., become better at calibration.</p>\n", "parentCommentId": "EvptbF4yxvifxMP7r", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "udYnQ3Gz3kZpkFikC", "postedAt": "2022-11-08T22:54:19.465Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>Strongly upvoted. You've put my main concern better than I knew how to put it myself.</p>\n", "parentCommentId": "5FF2x4JMvvXGRTm7r", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "EucqY34X7rpmCCLnF", "postedAt": "2022-11-08T22:54:19.906Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>Thanks for the response. I still do not think the post made it clear what its objective was, and I don't think it's really the venue for this kind of discussion.</p>\n", "parentCommentId": "iqpXqe4gHcxmZDNQ8", "user": {"username": "Charles_Dillon "}}, {"_id": "7LKxHP42FqcMjgq2b", "postedAt": "2022-11-09T00:17:54.564Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>I meant the initial question literally and sought an answer. I listed some general kinds of answers and clarified that I'm seeking answers to what potential factors may be shaping Musk's approaches that would not be so obvious. I acknowledge I could have written that better and that the tone makes it ambiguous whether I was trying to slag him disguised as  me asking sincere question.</p>\n", "parentCommentId": "EucqY34X7rpmCCLnF", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "KA8LYHg9os8NQETS7", "postedAt": "2022-11-09T00:31:28.477Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>I'm thinking of asking people like that about what they're doing but I'm also intending to request feedback from them and others in EA how to communicate related ideas better. I've asked this question to check if there are major factors I might be missing as a prelude to a post with my own views. That'd be high stakes enough that I'd put in the effort to write it better that I didn't put into this question post. I might title it something like \"Effective Altruism Should Proactively Help Allied/Aligned Philanthropists Optimize Their Marginal Impact.\"</p>\n<p>Other than at the Centre of Effective Altruism, who are the new/senior communications staff it'd be good to contact?</p>\n", "parentCommentId": "oEJnAtJLdL8rA8usP", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "SeRBaxv4oYLpzwsPD", "postedAt": "2022-11-09T00:55:25.155Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>As I write in my answer above, I think high-variance and volatile decisions are kinda just the name of the game when you are trying to make billions of dollars and change industries in a very-competitive world.</p><p>Agreed that Musk is \"operating without the kinds of epistemic guardrails that EA leaders try to operate with\", and that it would be better if Musk was wiser. &nbsp;But it is always better if people were wiser, stronger versions of themselves! &nbsp;The problem is that people can't always change their personalities very much, and furthermore it's not always clear (from the inside) which direction of personality change would be an improvement. &nbsp;<a href=\"https://equilibriabook.com/\">The problem of \"choosing how epistemically modest I should be\", is itself a deep and unsettled question.</a><br><br>(Devil's advocate perspective: maybe it's not Musk that's being too wild and volatile, but EAs who are being too timid and unambitious -- trying to please everyone, fly under the radar, stay apolitical, etc! &nbsp;I don't actually believe this 100%, but maybe 25%: Musk is more volatile than would be ideal, but EA is also more timid than would be ideal. &nbsp;So I don't think we can easily say exactly how much more epistemically guard-railed Musk should ideally be, even if we in the EA movement had any influence over him, and even if he had the capability to change his personality that much.)</p>", "parentCommentId": "5FF2x4JMvvXGRTm7r", "user": {"username": "Jackson Wagner"}}, {"_id": "y8stwEaBhjDXzisWR", "postedAt": "2022-11-09T01:26:52.168Z", "postId": "bzxrN6Hn8QAii3QPs", "htmlBody": "<p>I agree that Musk should have more epistemic guardrails but also that EA should me more ambitious and not less timid, but more tactful. Trying to always please everyone, be apolitical and  fly under the radar can constitute an extreme risk aversion, a risk in itself.</p>\n", "parentCommentId": "SeRBaxv4oYLpzwsPD", "user": {"username": "Evan_Gaensbauer"}}]