[{"_id": "xSiRMjuDzgis3FZmu", "postedAt": "2024-03-18T00:28:13.587Z", "postId": "c22ReEuMDcoTnqoa4", "htmlBody": "<blockquote><p>The upshot is: I recommend only choosing this career entry route if you are someone for whom working exclusively at EA organisations is incredibly high on your priority list.</p></blockquote><p><br>I think taking a role like this early on could also be high-value if you're trying to determine whether working in a particular cause area is for you. Often it's useful to figure that out pretty early on. Of course, the fact that it isn't the exact same job as you might be doing later on might make it less valuable for this.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "n9jcShZiwLNBivsqL", "postedAt": "2024-03-18T08:31:41.758Z", "postId": "c22ReEuMDcoTnqoa4", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/z59wybc56FCAysrAe/how-we-started-our-own-ea-charity-and-why-we-decided-to-wrap\">Case in point</a> on outreach beyond EA. I'm sure 80k hrs and/or CE has thought about this, but it might be a \"missing\" skillset in EA. I also remember seeing <a href=\"https://forum.effectivealtruism.org/posts/spjMkHjbj97CARXYQ/seeking-marketing-and-sales-ea-project-work-ideas\">this note</a> on sales people perhaps having a hard time to find work in EA. &nbsp;My comment here is not thought through at all, but I have a hunch that people good at getting the attention of people and knowing how to network/find their way in corporations and/or governments can be a good skill set in EA, especially paired with someone technical/subject matter expert.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "k45EEXiYnfKPkSMRq", "postedAt": "2024-03-18T19:16:32.118Z", "postId": "c22ReEuMDcoTnqoa4", "htmlBody": "<p><strong>Executive summary:</strong> The author reflects on their experience leaving and returning to the Effective Altruism (EA) community, offering career advice for EA-aligned graduates that emphasizes skill-building over prestige, managing rejection in job seeking, and the importance of engaging with the non-EA world.</p><p><strong>Key points:</strong></p><ol><li>Focus on skill-building rather than the impressiveness factor of a job or organization. Valuable skills can be gained at less prestigious places with better effort-payoff.</li><li>Entry-level positions at EA organizations may not provide the best skill development compared to mainstream grad roles, despite their competitiveness.</li><li>Repeated job rejections can be emotionally difficult. Adjust your mindset and/or ambitions to manage this, to avoid becoming disheartened and leaving EA entirely.</li><li>Engaging with the non-EA world, both professionally and socially, is crucial for effective communication, collaboration, and personal well-being.</li><li>Taking time away from EA can help reset one's relationship with the movement and lead to a more sustainable, balanced engagement.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]