[{"_id": "ZA2GkzbCgEqmNQjyu", "postedAt": "2024-01-24T16:23:34.426Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>It looks very likely that Labour will return to government later this year. What are your expectations for what they might achieve in their first term? Would there be any big political or practical barriers to overcome if they wanted to be ambitious on animal welfare?</p>", "parentCommentId": null, "user": {"username": "AdamC"}}, {"_id": "Qi6wExsnTBLLnsGp9", "postedAt": "2024-01-24T20:51:33.169Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><br>As you probably are aware, there was recently a successful EA-adjacent campaign against the Bully XL dog in the UK.</p><p>These dogs were explicitly bred from pitbulls for fighting and aggression, and as a result are very dangerous - &gt;70% of human deaths from dog attacks were from Bullies, and they are massively over-represented among dogs seized by the police. They are estimated at below 1% of the dog population - though the recent figures suggest they are far from 1% - meaning they are more than 300x more dangerous than the typical dog population.</p><p>Despite this, due to a strange loophole they were not banned in the UK, because the police regarded them as a distinct breed from Pitballs, and hence not covered under the Dangerous Dogs Act, while the civil servants responsible for the act thought they were Pitballs, and hence already illegal so there was no need to expand the act.</p><p>Thankfully in 2023 we saw a very successful campaign on this issue by a small number of people lead by Lawrence Newport, and as a result the law has been updated and the breed has been banned - existing specimens will have to be neutered and muzzled, and no new bullies can be bred or imported.</p><p>However, my understanding is that the RSPCA actually opposed this reform, and supported the continued legality of the Bully, despite the harm they caused to both humans and animals. I also understand the RSPCA was partially responsible for Scotland brief opposition to a ban (now reversed as a lot of the dogs were moved from England to Scotland and started attacking people up there). Further, the apparently the RSPCA wanted to not only allow Bullies but to bring back Pitballs! Would you be able to comment on why the RSPCA took this position, given the ban seems like a clear win for both human and animal welfare?<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "EexFeziaxxbP7knQo", "postedAt": "2024-01-25T03:07:42.257Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>I’m also v interested in the bully ban campaign issue.&nbsp;</p><p>Some prominent EAs <a href=\"https://x.com/richardmcngo/status/1702656273991217182?s=46&amp;t=T5oifr8aLXRu9VbHjWksRA\">criticised</a> the campaign because they thought that the lives saved (around 5 lives per year at current rates plus many more maulings, and more still if we expect that the bully population would have continued to grow as it was doing prior to the ban), while valuable, would not exceed the cost of effort involved. But the RSPCA actively campaigned <i><strong>against</strong></i> this life-saving policy and <a href=\"https://www.rspca.org.uk/getinvolved/campaign/bsl\">continues to argue for its reversal</a>. Why?</p><p>nb I actually think the EA bully ban critics might have been \"right for the wrong reasons\". While they vastly overestimated the effort involved in the campaign and therefore imagined more resources were spent per life than was actually the case (in fact the campaign had no external funding, just a few months part time work from Lawrence Newport which would make the anti-bully campaign about <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness#:~:text=Our%20top%20charities%2C%20which%20(based,programs%20that%20we%20know%20of.\">as effective as a GiveWell top charity in expenditure per life saved</a>), it turns out that Dr Newport is a generational campaigning talent and if you value his time that way then a few months of effort actually does represent a significant commitment. Though if you count talent discovery as a campaign outcome it tips the balance the other way again!</p>", "parentCommentId": null, "user": {"username": "MWStory"}}, {"_id": "m4oiAgTNWMzvejqFL", "postedAt": "2024-01-25T16:39:17.459Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Hi Emma, thanks for your work. It was encouraging to see the plight of chickens being featured so prominently by the RSPCA at the beginning of the year. Some questions:</p><ul><li>How do you respond to accusations of “humane washing”, and do you think your standards are the best they could be? For instance, your standards allow for pigs to be gassed in slaughterhouses despite the RSPCA having called for a <a href=\"https://uk.news.yahoo.com/rspca-calls-ban-gas-chamber-slaughter-pigs-2024-104748029.html\">ban</a> on the gassing of pigs in 2018 and expressed concern about chickens being exposed to highly aversive levels of carbon dioxide?</li><li>There has also been a lot of coverage recently (some of it driven by the <a href=\"https://www.theguardian.com/environment/2023/dec/11/chris-packham-calls-for-halt-to-catastrophic-expansion-of-scottish-salmon-farms\">concerns</a> of your President, the broadcaster Chris Packham) about the atrocious welfare standards on UK salmon farms, including the high prevalence of sea lice infestation and high mortality rates. Yet, in a <a href=\"https://committees.parliament.uk/writtenevidence/111816/pdf/\">submission</a> to a Parliamentary committee, you said that 100% of salmon production in the UK is RSPCA-certified, meaning that as a September 2023 report <a href=\"https://wildfish.org/wp-content/uploads/2023/09/Responsibly-Farmed-Investigating-the-certification-of-Scottish-farmed-salmon.pdf\">found</a>, RSPCA-certified farms with mortality rates of up to 74 percent can carry the label.</li><li>Even though your standards are clearly better for farmed animals, how confident are you that farms are actually adhering to them? A number of <a href=\"https://www.dailymail.co.uk/news/article-12635209/RSPCA-approved-workers-STAMP-hens-eggs-Op-Morrisons.html\">investigations</a> over the <a href=\"https://theecologist.org/2019/jul/02/foul-truth\">years</a> have <a href=\"https://www.youtube.com/watch?app=desktop&amp;v=RzwXtvu39Js&amp;ab_channel=HillsideAnimalSanctuary\">found</a> poor welfare for animals at RSCPA-assured farms. I see that your scheme involves pre-announced inspections unless there has been a complaint, in which case unannounced inspections may occur. Would you be willing to move to unannounced inspections across the board? We now have CCTV cameras in slaughterhouses in the UK (though it has led to some <a href=\"https://www.vetclick.com/news/introduced-mandatory-cctv-in-all-abattoirs-in-england-has-been-proven-to-be-effective-new-report-shows-p9761.php\">improvement</a>, the degree to which the footage is being monitored is <a href=\"https://www.thetimes.co.uk/article/abuse-at-abattoirs-is-caught-on-video-but-no-one-watches-it-s9rf0pm0z\">in question</a>) - would you support mandatory CCTV on RSPCA-certified farms too?</li></ul><ul><li>How many farms have been RSCPA-certified over the years and how many have you removed from the scheme due to poor welfare practices?</li><li>How do you balance engagement with industry with ensuring that your standards are as stringent as possible? I see that the egg industry has recently <a href=\"https://www.nfuonline.com/updates-and-information/nfu-seeks-clarification-on-new-rspca-assured-standards/\">complained</a> about your proposed new standards (around natural lighting and verandas) for egg-laying hens.</li><li>&nbsp;I see that you have an email campaign encouraging supermarkets to adopt the Better Chicken Commitment. How combative are you willing to be if they don't?&nbsp;</li><li>Do you see the Better Chicken Commitment as complementary to your existing scheme? Are there any major differences between your own scheme and the Commitment? As your website notes, only 1.2% of chicken produced in the UK is RSCPA-assured, so if retailers and suppliers follow through on the Commitment do you envisage that this percentage will rise?</li><li>The RSPCA has tremendous respect and therefore has social and political capital. What would you say to people who think you should use some of that capital to more forcefully argue that people should drastically reduce or eliminate their consumption of animal products, particularly chickens, turkeys, eggs, fishes and pigs?</li><li>What are some of the major pledges on farmed animal welfare that you’d like to see from political parties ahead of this year’s UK general election?&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "JBentham"}}, {"_id": "3bsgbREuT5F7Z9p2u", "postedAt": "2024-01-28T20:33:07.728Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>The RSPCA has a long history of bringing private prosecutions, particularly on the companion animal welfare side. I know that there has also been talk about stopping the RSPCA's private prosecution altogether too. Has the RSPCA ever brought private prosecutions against the mistreatment of farm animals? Would it consider doing so for an issue like where poultry catching teams clearly break the Animal Welfare Act 2006 when trapping heads/wings in the transport modules by not taking due care? These are cases where APHA/Local Authorities typically don't act and an RSPCA private prosecution could play a powerful role.</p>", "parentCommentId": null, "user": {"username": "Signal Failure"}}, {"_id": "GxAfukW4r8aTis9PL", "postedAt": "2024-01-28T20:37:53.919Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Why do you think that we haven't seen more animal welfare related import requirements in the UK (beyond the existing welfare at slaughter equivalency requirements), particularly for totemic issues like use of sow stalls and barren cages? It has the support of both the National Farmers Union and AW NGOs, and are widely thought to be pretty defensible at the WTO.&nbsp;<br><br>Do you think a Labour government will do it?</p>", "parentCommentId": null, "user": {"username": "Signal Failure"}}, {"_id": "6e3AW4WrtdJrosLEv", "postedAt": "2024-01-28T20:40:08.956Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>When reflecting on which campaigns and policies to push, how does the RSPCA prioritize between companion animals, wild animals, animals in research and farm animals? How much does it pay attention to the number of animals that can be affected by a given intervention?<br><br>Do you think it's important that the RPSCA keeps a somewhat even portfolio given that (I assume) most of its natural support base comes from those interested in companion animal welfare?</p>", "parentCommentId": null, "user": {"username": "Signal Failure"}}, {"_id": "J2frnbkoBg357TMaN", "postedAt": "2024-01-28T20:48:25.896Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Below as some commonly discussed big ticket policy changes for farm animals in the UK. How would you rank their relative importance? How do you go about making the decisions on what to push?</p><ul><li>Legislating for the Better Chicken Commitment as the legal minimum</li><li>Banning High Concentration CO2 gassing of pigs</li><li>Introducing mandatory tiered animal welfare labelling for meat</li><li>Specific fish welfare requirements (e.g. requiring stunning, water quality rules) in legislation</li><li>Retaining the ban on allowing insects as feed for pigs and poultry</li><li>Banning enriched cages for laying hens and gamebirds and farrowing crates for pigs</li><li>Introducing specific minimum legal rules for broiler breeders and layer breeders</li><li>Import ban on meat produced using sows in sow stalls or egg products from layers in barren cages</li></ul>", "parentCommentId": null, "user": {"username": "Signal Failure"}}, {"_id": "i626FKm6kbH7Zrudx", "postedAt": "2024-01-29T08:13:24.640Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>How do you think the RSPCA Assured work balances good cop/bad cop when working with industry?</p>\n<p>I saw recent improved standards were pulled due to farmers' backlash. The issues were on things like granting more time to provide natural light for hens (now moved to 2031!) and it has removed the requirement for verandas, which are hugely valued by hens and really help with things like reducing feather pecking. To me this suggests farmers hold a lot of power over a scheme that should be ambitious and demanding for animals.</p>\n<p>I guess one might say that you need to keep farmers on side, but I'm not sure I find this satisfying. Things should be practical but verandas are not that huge of an ask, especially when current standards allow other welfare insults like male chicks to be culled and permitting beak trimming. Also I find it hard to imagine RSPCA farmers will move to cage systems in the event that your asks are too much, so I do believe you have some power.</p>\n<p>How are decisions like this made? Do you see any potential threats to laying hen welfare due to the power that industry seems to have within the scheme? I guess those new standards were put in place for a good reason - how were the costs/benefits of keeping them assessed? Article here - <a href=\"https://www.farminguk.com/news/rspca-assured-revises-new-laying-hen-welfare-standards-after-concern_64034.html\">https://www.farminguk.com/news/rspca-assured-revises-new-laying-hen-welfare-standards-after-concern_64034.html</a></p>\n<p>Thanks!</p>\n", "parentCommentId": null, "user": {"username": "Sentience"}}, {"_id": "y7ujgx2BC8f2rzMeA", "postedAt": "2024-01-31T14:07:05.432Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>The RSPCA states that cats cannot eat vegan diets. &nbsp;<a href=\"https://www.rspca.org.uk/adviceandwelfare/pets/cats/diet\">https://www.rspca.org.uk/adviceandwelfare/pets/cats/diet</a><br><br>How does the RSPCA respond to claims of hypocrisy that it is meant to be preventing cruelty to animals (the clue is very much in their name!) yet promotes conventional meat diets for companion animals?&nbsp;</p>", "parentCommentId": null, "user": {"username": "JLC"}}, {"_id": "e6TMFwjCZrHgEpvmG", "postedAt": "2024-01-31T14:08:02.565Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Does the RSPCA still serve meat in offices and at meetings and events?&nbsp;<br>(cf. <a href=\"https://plantbasednews.org/culture/ethics/rspca-members-vote-plant-based-catering/)\">https://plantbasednews.org/culture/ethics/rspca-members-vote-plant-based-catering/)</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "JLC"}}, {"_id": "KsaYbuF7JeFHQFLZS", "postedAt": "2024-01-31T14:58:09.952Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Hi Emma! Thanks so much for agreeing to do this AMA!<br><br>Just to help people get to know you a bit more:</p><ol><li>How would you describe your role at the RSPCA? What campaigns have you worked on recently?&nbsp;</li><li>What first got you into animal cruelty prevention?</li></ol><p>Thanks again!<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "enDesDTiuWjqCxysK", "postedAt": "2024-02-01T08:56:42.592Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>What process does the RSPCA use to decide what their top priorities are?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "Acx3Gc4QNRzaEgnFq", "postedAt": "2024-02-01T14:37:16.130Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Thanks for doing this AMA, Emma!</p><p>I'm curious as to how you think about prioritizing different types of interventions that might reduce the suffering of farmed animals in very different ways, for example:</p><ol><li>Working on reducing suffering through welfare reforms.</li><li>Working on reducing numbers of animals through diet change policies (e.g. plant-based default food policies) or behavior change messaging (e.g. pro-veg messages).</li><li>Working on reducing numbers of animals through increased alternative protein availability and consumption (e.g. plant-based meats, etc.).</li></ol><p>&nbsp;</p><p>Since each of these is a plausible way to help farmed animals, yet they're very different strategic approaches, how do you all think about allocating your time and energy?</p>", "parentCommentId": null, "user": {"username": "Steven Rouk"}}, {"_id": "sQyk9W3CYvEZ3mxE9", "postedAt": "2024-02-01T14:39:04.212Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Do you think about fish or insects at all, or are you choosing to remain focused on chickens for now?</p>", "parentCommentId": null, "user": {"username": "Steven Rouk"}}, {"_id": "YFaAnhBmauukjiMnh", "postedAt": "2024-02-01T16:13:35.244Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>My role is to oversee the lobbying, public campaigning, international, education, thought leadership and policy work of the organisation - and the evidence base that supports those functions. I am also a member of the leadership team working to manage running of the organisation as a whole. Recently we have worked on the Act Now For Animals Campaign, working to ensure the government lives up to the commitments it has made around ending live exports, banning the keeping of primates as pets, tackling puppy smuggling, consulting on ending the use of cages in farming etc. We have also been working on ending greyhound racing, supporting the Better Chicken Commitment, banning trail hunting and phasing out the use of animals in research.&nbsp;&nbsp;</i></p><p><br><i>I have always worked in campaigning and advocacy roles, across sectors like disability, youth justice, deprived neighbourhoods etc. In 2011 the wonderful Joyce D’Silva gave me my first job in animal welfare and it felt like coming home. I have always been a volunteer and supporter of animal causes. I started a Save the Worm club at school, moving worms from pavements, though looking back now I am sure the worms would have much rather I left them alone. I grew up in a very rural “ huntin’, shootin’, fishin’ “ area and found plenty to be concerned about on my doorstep. Since 2011 I have been lucky enough to work for Compassion in World Farming, World Animal Protection, Global Canopy, the Animal Health and Welfare Board and now the RSPCA.&nbsp;</i></p>", "parentCommentId": "KsaYbuF7JeFHQFLZS", "user": {"username": "Emma_Slav"}}, {"_id": "MxYmo4NdBHbCoKrhm", "postedAt": "2024-02-01T16:15:36.349Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>We do our best to be here for all animals. But that means showing up in different ways. For example we work hard to secure a phase out of the use of animals in research through engagement and lobbying (and have seen severe suffering in animal experiments fall by 61% since 2014), whereas our work on cruelty and neglect is focused more on prevention and rescue interventions. Given our size and scope I do think it is important that we leverage that in the work we doing, using it to look at cross-species issues eg extreme conformation breeding which impacts companion animals and farmed animals, or the bigger questions around the relationship between humans and animals&nbsp;</i></p>", "parentCommentId": "6e3AW4WrtdJrosLEv", "user": {"username": "Emma_Slav"}}, {"_id": "7j6nrg8bSsGXrGEts", "postedAt": "2024-02-01T16:17:47.246Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>As part of our new strategy, we are exploring transferring our prosecutions role to the CPS. APHA undertakes prosecutions for farmed animals. This is to ensure we avoid any possible conflict of interest with our farm assurance scheme. More information on the changes we want to make to our prosecution role is here: https://www.rspca.org.uk/whatwedo/strategy/prosecution</i></p><p><br>&nbsp;</p>", "parentCommentId": "3bsgbREuT5F7Z9p2u", "user": {"username": "Emma_Slav"}}, {"_id": "hBchJNrp49o6jhdhg", "postedAt": "2024-02-02T14:24:34.515Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>We are an unusual organisation in that we provide rescue, rehabilitation, rehoming, release, education, public information, prevention, investigation and prosecution activities as well as our evidence, advocacy and campaigning work - and our farmed animal welfare assurance scheme. Our work is delivered through a family for independent branches, our centres and the national ‘hub’ organisation.&nbsp;&nbsp;</i></p><p><i>This means we balance priorities across different functions and audiences. For example our priorities for our education work might be different from that for our rescue work, or our campaigning work. However in general the factors we consider are the severity, scale and duration of suffering (we use the 5 domains model as the basis for our welfare assessment), and then internal and external factors such as our skill sets and specialisms, the work of other organisations, the likelihood of achieving change and the timescales. We strive to have a data and insight informed approach, but this can be challenging. For example one of our specialisms is around animal neglect, whilst there is some data and evidence around contributing factors to neglect, there is very little research into the comparative effectiveness of different interventions. We also try to contribute to the sector as a whole, so for example when we identify a data or evidence gap, like the one just mentioned, we think about how we could contribute to filling that gap.&nbsp;</i></p><p><i>We also try to take an ambitious-pragmatism approach to creating change - challenging ourselves to consider what will be the most effective route to creating change.&nbsp;</i></p><p><br>&nbsp;</p>", "parentCommentId": "enDesDTiuWjqCxysK", "user": {"username": "Emma_Slav"}}, {"_id": "DyEZP62ixke5RXrxR", "postedAt": "2024-02-02T15:21:34.302Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Hi, thanks for your questions - I have tried to cover all of them below:<br><br><i>The RSPCA welfare standards and the RSPCA Assured certification scheme exist because the way in which farmed animals are treated is simply not good enough and legislation is insufficient to protect their welfare; there is simply no con or sleight of hand in that. Change takes time, but we are progressing farmed animal welfare every day. We will continue to work with the farming industry for as long as it takes to see all animals treated with kindness, compassion and respect. We update our standards roughly every two years to incrementally improve welfare, based either on advances in knowledge and evidence, or by continually working with industry, other organisations, government and experts to push changes through over time. We will always be improving our standards to achieve higher levels of welfare, that is an inherent part of the strategy behind the scheme. Setting standards and running an assurance scheme is challenging - but we challenge ourselves to do what we believe is going to impact the lives of animals for the better. I am convinced that a welfare focussed assurance scheme like RSPCA Assured improves the lives of millions of animals. We have called on the government repeatedly to set a date for ending the use of CO2 stunning and have repeated this in our work with political parties in advance of the next general election. Our standard requires 90% concentration of CO2 (compared to 80% by law) which reduces suffering and reduces the time to death.&nbsp;</i><br><br><i>RSPCA Assured labelled salmon comes from farms that are inspected up to 500 standards aimed at improving their welfare. These cover every stage of a salmon’s life from hatchery to slaughter. The standards have been a catalyst for change throughout the entire salmon industry with most farms now adopting these standards. If it wasn't for the RSPCA and RSPCA Assured choosing to work with the salmon farming industry these, and many other significant welfare improvements, would never have been made.&nbsp; We respect that there are many different views on salmon farming and we share concerns about the challenges the industry is facing. Sadly, there are no quick fixes for these challenges and it takes time to develop science, evolve understanding and change practices, but we are constantly furthering learning and driving towards finding solutions. &nbsp;It would be the infinitely easier option to just turn our backs, but we don’t believe that is conducive to improving fish welfare. Salmon farming exists whether we are present or not, and currently there is no specific legislation to protect the welfare of salmon. Without voices like ours, encouraging the food and farming industries to adopt higher welfare standards, many millions of fish could be farmed to lower welfare standards. We are due to release a new set of salmon standards in the coming weeks, which will further drive welfare standards up.&nbsp;</i></p><p><i>RSPCA Assured works closely with all members to ensure that the RSPCA welfare standards are being met. All RSPCA Assured members have thorough annual assessments conducted by specially trained RSPCA Assured assessors as well being subject to unannounced spot checks. Additionally, RSPCA Assured works with SCI (Supply Chain In-Sights) assessors to inspect processors and packers and ensure a full chain of custody for products that carry the RSPCA Assured logo. RSPCA Assured takes all complaints of poor animal welfare very seriously, we will not hesitate to suspend or remove any member from the scheme if appropriate. Sadly, there are individual cases where failures have been identified, but steps are always taken to immediately address and rectify any issues. It is important to remember that for every animal shown on covertly-filmed video, there are millions more who've had a better life thanks to RSPCA Assured. We are right in the middle of a piece of work looking at our assessment model, which is considering exactly these questions. This piece of work is due to be finished over the next 18 months.&nbsp;</i></p><p><i>In order to join the scheme a farm must be assessed and then have an annual assessment (and more frequent if concerns are found or raised). Farms can be removed in a number of ways; temporarily, permanently, placed in special measures etc. The scheme has been running for 30 years so I am afraid I don’t know the number of farms that have been permanently or temporarily removed in that time. We currently have around 4,000 farms on the scheme. Most recently a hen catching team has been permanently removed from the scheme.</i></p><p><i>We use a robust and independent process to set our standards. We try to be as transparent as possible and the full process is set out&nbsp;</i><a href=\"https://www.rspcaassured.org.uk/farmed-animal-welfare/rspca-welfare-standards/#:~:text=What%20are%20STAGs%20for%3F,at%20the%20forefront%20of%20welfare.\"><i><u>here</u></i></a><i>. As you would expect when we are implementing changes we do get push back from industry, other times we get support. We work with a wide range of farmers, producers, retailers and others to inform the standards - but they are always based on the approach of increasing welfare and a strong evidence base.&nbsp;</i></p><p><i>Our email campaign secured about 44,000 actions which we were very pleased with. My view is that the strength of the animal welfare sector is really felt when we have a diversity of approaches calling for a unified goal; if we all adopt the same tactic we reduce our impact. We are committed to encouraging retailers to adopt the BCC and celebrating those that do.&nbsp;</i></p><p><i>Yes we see the BCC and the RSPCA standards for chickens as being complementary. Our standard goes much further as it covers the full life of the birds, and has&nbsp;</i><a href=\"https://science.rspca.org.uk/documents/1494935/9042554/RSPCA%20welfare%20standards%20for%20meat%20chickens%20%288.48%20MB%29.pdf/e7f9830d-aa9e-0908-aebd-2b8fbc6262ea?t=1557668435000\"><i><u>hundreds of welfare requirements</u></i></a><i> which must be met; including handling and transporting for example. Our hope is that as the BCC grows so will the number of birds raised under RSPCA standards.</i></p><p><i>We have a strong meat reduction (and farmed animal reduction) message. We call for an end to all intensive farming and a reduction in both consumption and production of animal products, and a reduction in the number of animals farmed. This is one of the messages of our general election manifesto work for example. We’ve also sponsored three reports recently looking at the role of alternative protein and in 2022 we devoted our annual Wilberforce Lecture to exploring food and farming systems. We are currently working on a foresight report about the future of the relationship between humans and animals which will further examine the role of diet.&nbsp;</i><br><br><i>All our requests to political parties can be found here:&nbsp;</i><a href=\"https://politicalanimal.rspca.org.uk/2024-general-election\"><i><u>https://politicalanimal.rspca.org.uk/2024-general-election</u></i></a><i>&nbsp;</i><br>&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": "m4oiAgTNWMzvejqFL", "user": {"username": "Emma_Slav"}}, {"_id": "efkhQMMvA3GDKyYZs", "postedAt": "2024-02-02T15:24:36.477Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>What a great question. This is probably one for a discussion over a coffee but as a general approach we would use the kind of process I have set out above (Nathan Young's question) which considers scale, severity and duration of suffering against the 5 domains model, and then considers other internal and external factors. However, from that list I would particularly identify the Better Chicken Commitment (particularly addressing fast growing breeds) and legal protections for fish as high priorities.&nbsp;</i></p><p><br>&nbsp;</p>", "parentCommentId": "J2frnbkoBg357TMaN", "user": {"username": "Emma_Slav"}}, {"_id": "Mcftxnj7f4MwQRJFs", "postedAt": "2024-02-02T15:25:17.994Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>Our current policy is that all catering must be plant based or RSPCA Assured. This is being reviewed by our Trustees in light of the AGM resolution.&nbsp;</i></p>", "parentCommentId": "e6TMFwjCZrHgEpvmG", "user": {"username": "Emma_Slav"}}, {"_id": "3RpXWRwqAR3XmvGo9", "postedAt": "2024-02-02T15:38:56.030Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>I would hope in the first period following the election any government would face into the urgent need for reforming farming standards and phasing out the use of animals in research. I think the biggest political barrier to these kinds of changes, and the others that we would like to see, is breaking out of the practice of siloed policy making, and instead understanding the interactions between e.g. human health, the environment and animal welfare.&nbsp;</i></p>", "parentCommentId": "ZA2GkzbCgEqmNQjyu", "user": {"username": "Emma_Slav"}}, {"_id": "F8vxBdpYLjSByun5w", "postedAt": "2024-02-02T15:55:28.396Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>I think we have seen a prioritisation of ‘the deal’ over ‘the content’. I agree with the tone of your question - there is widespread agreement on the need for this, and an agreed approach around core standards.&nbsp;</i></p><p><i>This is one of the issues we are prioritising for the election and I am very hopeful whichever party forms the new government it will go up the agenda rapidly.&nbsp;</i></p><p><br>&nbsp;</p>", "parentCommentId": "GxAfukW4r8aTis9PL", "user": {"username": "Emma_Slav"}}, {"_id": "cfL9TPRpzsjjda8fX", "postedAt": "2024-02-02T20:03:00.037Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Thank you! Great to see that you’re considering some of these questions and thanks for linking to your general election manifesto. I agree with the broad theme that, since some/many farms do abide by your standards (even when you’re not looking) and may not have done otherwise, millions of animals have better lives as a result. But for every farm found to be falling short during an undercover investigation, I imagine there are also many more getting away with it, which is what prompted my questions about compliance rates - hopefully we’ll be able to get better estimates as a result of the review into your assessment and monitoring process.</p>\n", "parentCommentId": "DyEZP62ixke5RXrxR", "user": {"username": "JBentham"}}, {"_id": "6czvSds3eLaRiNLvY", "postedAt": "2024-02-03T15:24:39.573Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p>Some context around the 5 domains (I think):</p>\n<p>What are the Five Domains?\nThe Five Domains framework is a way of thinking about animal welfare – going beyond just eliminating or minimising negative experiences to achieve a neutral state of animal welfare and encouraging positive experiences in four functional domains, with the idea being an output is the fifth domain, a mental domain.\nTo determine an animal’s wellbeing the following should be considered:\nNutrition\nEnvironment\nHealth\nBehavioural interactions\nMental State\nFor every physical experience an animal has, there may also be an effect on their mental wellbeing.</p>\n<p>link here: <a href=\"https://www.rspcaqld.org.au/blog/animal-welfare/the-five-domains#:~:text=The%20Five%20Domains%20framework%20is,fifth%20domain%2C%20a%20mental%20domain\">https://www.rspcaqld.org.au/blog/animal-welfare/the-five-domains#:~:text=The Five Domains framework is,fifth domain%2C a mental domain</a>.</p>\n", "parentCommentId": "hBchJNrp49o6jhdhg", "user": {"username": "nathan"}}, {"_id": "akCg27CbwcLK8ezD6", "postedAt": "2024-02-05T10:50:54.997Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>Alongside other organisations like Cats Protection and the British Veterinary Association we would not recommend a vegan diet for cats. However we are aware that research and evidence in this space is growing and keep it under review. We do ask people to consider higher welfare brands of pet food like McAdams which uses RSPCA Assured ingredients.&nbsp;</i></p><p><br>&nbsp;</p>", "parentCommentId": "y7ujgx2BC8f2rzMeA", "user": {"username": "Emma_Slav"}}, {"_id": "FmHqgh2ryiwyTzjKc", "postedAt": "2024-02-05T10:54:22.661Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>I think I have covered the standards setting process above (JBentham's question), but please do ask if you would like any more information. In terms of the laying hen standard, we have retained the requirement to provide natural daylight, but permitted&nbsp; an additional 12 months for this to be achieved. We have committed to doing an&nbsp;in-depth review of installing verandas on free-range systems. We still require verandas to be installed for all barn systems by 2030. The original standards concerning free range producers required them to install verandas new builds and building undergoing major refurbishments. It’s only these two requirements, which would have affected a minority, that have been redacted (pending the review).&nbsp;&nbsp;</i></p><p><i>We agree with you about the welfare benefits verandas can provide and it is still our intention to progress with these, but we have committed to doing a review with the industry to see what the potential challenges and barriers may be (so we understand these better and can consider solutions to these) and then progress depending on the outcome of that review&nbsp;</i></p><p><br>&nbsp;</p>", "parentCommentId": "i626FKm6kbH7Zrudx", "user": {"username": "Emma_Slav"}}, {"_id": "4jKsbjhGvpp2KLYBP", "postedAt": "2024-02-05T10:55:55.906Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>Scientific evidence has shown that breed/type is not a robust indicator of bite risk. The causal factors of aggressive behaviour are a complex interaction between genetics and lifetime experiences. Research has also shown that legislation like the the Dangerous Dogs Act which bans types of dog based on how they look is ineffective in protecting the public. This policy position is consistent across&nbsp; Battersea Dogs and Cats Home, Dogs Trust, Blue Cross, the British Veterinary Association, Hope Rescue, the Scottish SPCA, USPCA, Woodgreen, PDSA and The Kennel Club. There are more effective models for tackling dog-bite risk and keeping people and dogs safe. These are in operation in other parts of the world. Tackling irresponsible breeding, irresponsible ownership, the need for training, public education, licensing etc is all required to address this issue in a meaningful way.&nbsp;</i></p><p><i>From 1999-2019, the number of hospital admissions for the treatment of dog bites has increased by 154%, despite the prohibition of certain types of dogs. The UK Government must tackle the root issue by dealing with the unscrupulous breeders, who are putting profit before welfare, and the irresponsible owners whose dogs are dangerously out of control.</i></p><p><i>As well as being ineffective in protecting the public, these laws based on the appearance of the dog mean that many dogs whose behaviour has never been a concern are targeted.&nbsp;</i></p>", "parentCommentId": "EexFeziaxxbP7knQo", "user": {"username": "Emma_Slav"}}, {"_id": "8wQeCWsQLyd4rwEAx", "postedAt": "2024-02-05T11:00:45.300Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>The XLB has been referred to recently as a 'fighting breed derived from the pit bull', however, other sources of information dispute the origins of this dog. Multiple sources refer to this breed of dog as one who was selected as a companion and family dog. For example, the United Kennel Club refers to this dog as ‘first and foremost, a companion, exhibiting confidence with a zest and exuberance for life. Although there are breeds and types of dogs originally bred and selected for fighting, this does not mean that individuals within a particular breed or type are inherently aggressive or pose any greater risk of aggressive behaviour towards people or other animals. The selection for specific physical and temperamental attributes can result in serious injuries. However, the extent to which these characteristics are expressed or displayed will vary within individuals and are influenced by the way in which the dogs are bred and their lifetime experiences therefore, not all individuals of the same type will behave in the same way.&nbsp;</i></p><p><i>There is a distinct lack of verifiable evidence of the types of dogs involved in bite incidents, with data not regularly and uniformly recorded by police. The XL Bully has largely come to attention by social and traditional media sources where the breed or type of dog involved in an incident often can not be substantiated. There is no conclusive evidence that shows any breed as being more aggressive than another or inherently aggressive, although we acknowledge that the larger the breed the greater the capacity for harm if they display aggressive behaviour. Focusing on specific breeds potentially provides a false assumption that all other dogs are safe, where in&nbsp; reality any dog has the capacity to be dangerous if irresponsibly bred, reared and socialised. This is why our focus has always been on tackling the causal factors of aggressive behaviour which includes the way in which dogs are bred, reared and their lifetime experiences.</i></p><p><i>Some of the stats you have included in your answer are not ones I would recognise, however I have tried to answer the spirit of your question.&nbsp;</i><br>&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": "Qi6wExsnTBLLnsGp9", "user": {"username": "Emma_Slav"}}, {"_id": "4u6ZCPsjNARiRoPgZ", "postedAt": "2024-02-05T11:11:05.710Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>Thanks for your question. I think it is fair to say that the majority of RSPCA’s efforts to date have gone into your first option. We have skills, expertise, reach and resources to enable us to make a real difference to the lives of animals in this way through both our RSPCA Assured scheme, and through campaigning for changes to legislation and corporate behaviour. This work has resulted in real and significant (and evidenced) better lives for millions of animals than they would otherwise have lived.</i></p><p><i>However, we recognise that to get to a world without intensive farming, we also need to significantly reduce the number of animals farmed. We are developing our strategy here, but have already begun looking at the role of alternative protein in improving welfare (i.e. how could it have the most welfare benefit). For example we sponsored this report:&nbsp;</i><a href=\"https://www.smf.co.uk/publications/alt-proteins-animal-suffering/\"><i><u>https://www.smf.co.uk/publications/alt-proteins-animal-suffering/</u></i></a><i> which concludes: “If alternative proteins reach the 30% market share predicted by respondents by 2040, it would result in over 300 million fewer animals being raised in factory farms and slaughtered every year.”</i></p><p><i>As our strategy work develops in this area we will be considering how we best play our role in contributing to all three of these approaches.&nbsp;</i><br>&nbsp;</p>", "parentCommentId": "Acx3Gc4QNRzaEgnFq", "user": {"username": "Emma_Slav"}}, {"_id": "qWP7EuCqxXv2MeMc3", "postedAt": "2024-02-05T11:23:27.896Z", "postId": "C23sNoAmA8xjJejZz", "htmlBody": "<p><i>We are here for all animals, including fish and insects. For example we have RSPCA Assured Standards for salmon and trout to try to drive up standards on farms, and we are working to secure legal protections for farmed fish.&nbsp;</i><br><br><i>We also work to end the use of animals in research (that causes them harm) and these animals are often fish. Whilst we work to end their use, we also work on improving their lives and have improved industry practices around environment and slaughter which has reduced the suffering of many fish in laboratories.&nbsp;</i></p><p><i>We take a precautionary principle approach to sentience i.e. unless there is evidence an animal isn’t sentient, we treat them as though they are. Our work on insects is less developed than other areas from an advocacy point of view, but it is something we focus on extensively in our work around human behaviour and education. As an aside, I also founded the Wasp Appreciation Society some years ago.&nbsp;</i></p>", "parentCommentId": "sQyk9W3CYvEZ3mxE9", "user": {"username": "Emma_Slav"}}]