[{"_id": "JisFsxcghjzpyuTE5", "postedAt": "2024-02-22T14:42:10.634Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p><strong>Executive summary</strong>: Comparing welfare impacts of intense yet brief suffering versus longer yet milder distress poses complex challenges. Currently lacking sufficient evidence on perceived intensities, a pragmatic approach quantifies time separately for varying severities.</p><p><strong>Key points</strong>:</p><ol><li>Evidence suggests more intense pains feel disproportionately worse, but precise relationships remain unclear.</li><li>Translating intensities into a single scale carries high uncertainty and can lose situational details.</li><li>A granulated metric can currently rank most welfare issues; difficult trade-offs need case-by-case evaluation.</li><li>Assessing all consequences, not just immediate experience, is key for informed comparisons.</li><li>Extreme ratios in perceived severity would be needed to justify addressing brief intense suffering over chronic moderate distress.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "hE5kcBFQdWDSjfics", "postedAt": "2024-02-23T15:37:25.541Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>I see why you made your decisions, but I still think that it would be very useful if people could cite you to say stuff like “According to Welfare Footprint Project, broiler reforms decrease chicken suffering by very roughly 40%-60%”. It’s not for researchers at places like OpenPhil to decide what should be the next welfare ask. It’s for donors, volunteers, researchers who want to mention your conclusions in passing, and even retailers considering whether to sign the Better Chicken Commitment. I don’t know if animal charities would do it, but such a sentence could even be included in petitions urging retailers and restaurants to implement welfare reforms. Yes, it would be more accurate to write that according to your research, “broiler reforms increase annoying pain by 4.5% but decrease hurtful pain by….” But that is clunky and then the reader might be confused about whether the welfare reform are even good because there is more annoying pain. So it’s more difficult to make a point that these reforms are very impactful using your research. Hence, your great work is cited less and has less impact than it could have. And yes, you can’t accurately say whether the reform decreases suffering by 30% or 60% because it might depend on what weights for different categories of pain you will use. But I think that many people assume that it’s more like 5% so whatever you write on the subject, I think it would be useful.&nbsp;</p><p>Also, if you don’t do it well, someone else will do it poorly. I wrote sentences based on your research like “broiler reforms avert 50% of suffering” in&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/kHdKWmTcS3FfcYAZj/eaa-is-relatively-overinvesting-in-corporate-welfare-reforms?commentId=cfQ2Dox9GktW6EMpn\"><u>this comment</u></a> but I had to use my own weights for categories of pain. But your weights would be much better than mine because clearly you thought about it more. I think I later saw my weights being used in some serious cost-effectiveness estimate, but I don’t remember where.</p><p>Also, I want to say that I really appreciate and respect your work, thank you for doing it :)</p>", "parentCommentId": null, "user": {"username": "saulius"}}, {"_id": "HwM74u2TYPprP2Ru2", "postedAt": "2024-02-23T16:35:51.860Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>Thanks for your nice words about our work :) . Yes, I see it can be frustrating to have estimates disaggregated (it is very much for us too), and that it can reduce the use and impact of the work. At this moment though we feel it is important to have a solid evidence-based model to quantify animal suffering. That is, a model that is very robust to scrutiny by academics (so they are more likely to adopt it) and by the industry, one in which all estimates can be justified thoroughly.Traction in the academic community is important because as a small team, we would be unable to analyse all situations of animal suffering (in farming context, research, etc) by ourselves, so ideally academics should adopt it too to enable increasing the coverage of the analyses substantially. Robustness against criticisms by the industry is also important to ensure the credibility of this new type of evidence, as used by advocates, in this early stage. &nbsp;So while we can justify well time in four intensities of suffering, knowledge is not yet available for us to do the same regarding equivalence weights. That said, we have been using summaries of the estimates like \"there is a decrease of about 60% of the time in pain for every hen raised in an aviary instead of a cage\". Will try to add summaries like this in the forthcoming work, thanks! &nbsp;</p>", "parentCommentId": "hE5kcBFQdWDSjfics", "user": {"username": "cynthiaschuck"}}, {"_id": "BnoGpGwqeaJ72ovJY", "postedAt": "2024-02-24T09:11:00.742Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>I see. In that case, it might be good for someone else to do the project of determining what weights for your pain categories would be most reasonable, and perhaps you could review that. I'm now considering doing it but it's unlikely that I will.</p>", "parentCommentId": "HwM74u2TYPprP2Ru2", "user": {"username": "saulius"}}, {"_id": "AYieGRPCsCrM6MioG", "postedAt": "2024-02-27T14:01:39.274Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>Sure, we would be glad to review a project like this. Coincidentally, today I came across an EA post where four people from RP articulated their reasons for choosing to present, or not to present, sentience weights for invertebrates. Our rationale for not providing intensity equivalence weights are very much aligned with the views of <a href=\"https://forum.effectivealtruism.org/posts/T5fSphiK6sQ6hyptX/opinion-estimating-invertebrate-sentience#Jason_Schukraft\">Jason K</a>, particularly the notion that any weights we use would be overemphasized and reduce our credibility with potential collaborators. That said, we are not advocating for giving up on this area, it is just that we think we are not there yet.</p>", "parentCommentId": "BnoGpGwqeaJ72ovJY", "user": {"username": "cynthiaschuck"}}, {"_id": "obRAardrfeCrPrPPe", "postedAt": "2024-02-28T17:32:47.494Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>The relative difference you cited between most painful and second most painful experience is interesting. Personally, I can't even name my second most painful experience, but will probably never forget my most painful experience.&nbsp;</p><p>Even given the intensity of my most painful experience, I would rather do that again compared to facing a year of chronic pain because chronic pain seems so debilitating.&nbsp;</p><p>One thing I'm wondering about with respect to pain in animals is how they process memories, and how closely their memories alter their experience. I think that would matter because a memory of intense pain might cause ongoing psychological suffering, but I'm not sure if or which animals could have that type of experience.</p>", "parentCommentId": null, "user": {"username": "Steeven"}}, {"_id": "L4WwvpGzw4ymZNynj", "postedAt": "2024-02-28T19:48:31.346Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>Yes, I believe the salience of more intense experiences is disproportionally greater, hence the possibly disproportionally stronger memory trace.</p><p>On chronic x acute pains, this is our general impression too. With chronic pain there is the possibility of sensitization over time and multiple additional longer-term consequences.&nbsp;<br><br>On memory differences with other species, that is a very interesting question, one for which there is not much research available as far as I am aware. For example, observations of the Peak-End rule mentioned in the text are widespread in humans, but so far there has been <a href=\"https://pubmed.ncbi.nlm.nih.gov/37029265/\">only one</a> experiment testing it in animals (dairy cows). That said, at least in vertebrates intense pain has been observed to lead to greater levels of fearfulness, reduced resilience, sensitization, among others (so if it happens early in life, the effects of intense pain are likely much more pervasive). So at least in vertebrates, either memory is present, or intense pain leads to a reconfiguration of pain coping mechanisms.</p>", "parentCommentId": "obRAardrfeCrPrPPe", "user": {"username": "cynthiaschuck"}}, {"_id": "sBwMCo8nkAYorAqsd", "postedAt": "2024-03-01T16:30:34.996Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>I agree that I would rather go through my most painful-ever experiences again than go through a much longer period of chronic pain because chronic pain is debilitating.&nbsp;</p><p>In general, I expect a lot of people to feel more averse to chronic rather than acute pain -- with the assumption that the long-term effects of chronic pain are greater than those of acute -- once thinking beyond themselves. That is, considering not just what they themselves would prefer, all else held equal, but also damage to their productivity and ability to help others (e.g duty to friends and family; desire to help the world). This preference might not change the lived experience of the pain, but it might still be morally relevant.&nbsp;</p><p>This might mean that, at a species level, relative aversiveness to different kinds of pains might depend on animals' social roles. I wonder if social animals, particularly social insects, might be less averse to pain in a morally relevant way if the pain is contracted as a result of e.g defending the nest or hive.</p>", "parentCommentId": "L4WwvpGzw4ymZNynj", "user": {"username": "Ilsze"}}, {"_id": "vFsctoi6rR7tA6Cmt", "postedAt": "2024-03-03T22:41:53.299Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>\"The observation that the aversiveness of pain escalates super-linearly with [pain] intensity [...]\"</p><p>It seems to me that the data mostly don't support this claim, or at least that there are plausible alternative explanations for the data. The main issues I'd like to raise are:</p><p>1. Whether aversiveness varies linearly or super-linearly with pain intensity can only be determined if the pain intensity is represented on a ratio scale (e.g. with the same intensity difference between 0-1 and 9-10). In several studies, however, the ratio scale consists of values arbitrarily assigned to verbal descriptions of pain intensity (e.g. source [22]: \"2: just noticeable, 3: weak, 4: mild, 5: moderate, 6: strong, 7: severe, 8: excruciating\"). If the participants react mainly to the verbal descriptions (and less to the assigned numbers), which seems plausible to me, then we can't draw any conclusions from the mathematical relationship between the (arbitrary) numbers and the aversiveness. Another interpretation could be that the assumed difference in pain intensity between \"just noticeable\" and \"weak\" is simply much smaller than the assumed difference in pain intensity between \"severe\" and \"excruciating\", even though the assigned values differ by 1 in both cases. The same concern applies to [19], [20], but not to [21].</p><p>2. Even when pain intensity is represented only by numbers (and not by verbal descriptions), it's not obvious how participants interpolate between the highest and lowest numbers. Take [21]: In the appendix it says, “pain intensity is rated using a pain scale 0–10, with 0=no pain and 10=worst pain imaginable”. Do participants treat these numbers as if they were on a ratio scale (e.g. with the same intensity difference between 0-1 and 9-10)? It's not unreasonable to think so, but we just don't know because they're not asked to do so. It may well be that they are interpolating on a log scale, where intensities are compressed the higher they go (or something else entirely). For example, if pain intensities are interpreted logarithmically, the identical plot for aversiveness would imply that aversiveness varies *linearly* with intensity, not super-linearly.</p><p>3. “Research in this area indicates that as sensations, including pain, increase in intensity, their perceived aversiveness grows exponentially [24]”. The source [24], however, only seems to show that as *physical stimuli* (such as loudness or visual flash rate) increase in intensity, their perceived aversiveness grows super-linearly. This doesn't say anything about the relationship between *pain intensity* (or other sensations) and perceived aversiveness. An alternative explanation might be that pain intensity varies super-linearly with physical stimuli, and perceived aversiveness varies *linearly* with pain intensity. Also, according to [24], perceived aversiveness doesn’t vary “exponentially”, as you claim, but according to a “power function” which means e.g. y=x^2, not y=2^x. I haven’t checked the other psychophysics sources cited, but I wouldn’t be surprised if they suffered from the same limited explanatory power.</p><p>4. It seems hard even in theory for participants to distinguish between pain intensity and pain aversiveness. I’m somewhat convinced by behavioral studies (such as [21]) that express aversiveness in terms of trade-offs (a measurement distinct from pain intensity), but less so by the other study designs.</p><p>5. Some of the sources are very old ([24] from 1957, [25] from 1959), which in and of itself doesn’t invalidate the claims, but still surprised me a little. Do they still represent the current state of science?</p><p>I'd be interested to hear your reaction to these points. I'm sure there are things I'm missing or that I’m getting wrong.</p>", "parentCommentId": null, "user": {"username": "nalthaus"}}, {"_id": "sQJxk4wYFLtbf2djx", "postedAt": "2024-03-05T15:25:33.206Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>Thank you for the detailed comments, it is really nice to see you were so thorough with the text and the studies we cite, these are good points!</p><p>If we understand you well, with a few exceptions (as in the case of the time trade-off study, [21]), what you mention is that the superlinearity observed could be a by-product of participants of the studies interpreting the designed scales of intensity (even the numerical ones) as not equidistant, hence a non-equidistant plot of aversiveness could, for example, be observed if the relationship between intensity and aversiveness was in fact linear.</p><p><br>My impression, however, is that we are referring to different things when we say pain intensity (and this is our fault for not being clearer on the text, we will make the distinction clearer). My understanding is that ‘pain intensity’ is often used simply as a synonym for aversiveness or unpleasantness, as opposed to physical intensity of stimuli/pain signals.&nbsp;</p><p><br>As I see it, assessments of pain intensity (unpleasantness) are typically made on what can only be understood as an ordinal scale. Whether evidence on pain unpleasantness is collected with verbal descriptors or numerical descriptors, these unpleasantness scales (i.e. the intensity scales used) can only be interpreted as ordinal exactly because we do not know what type of understanding of the scale study participants have. Even though some authors use the data collected (e.g., pain intensity/unpleasantness ratings in scales from 1-10 or 1-100) and calculate things such as areas under the curve for plots of ‘intensity’ (meant as unpleasantness) ratings x duration, the data is still ordinal for practical purposes and unsuitable for these operations.&nbsp;</p><p><br>So the effort in this work was to try and see if it would be possible to make such a conversion of pain unpleasantness (from ordinal to ratio scale), and determine the distance among the categories of unpleasantness on a ratio scale. Thus, in the case of the psychophysics studies, I do not see three parameters: intensity of physical stimuli, pain intensity and pain aversiveness, but only two: intensity of physical stimuli and aversiveness (we will correct the text where we mention that the relationship is exponential).</p><p><br>On the availability of studies, unfortunately, all of them were riddled with limitations. Although designs such as the time trade-off approach (used in study [21]) are much better, to our surprise the literature is extremely scarce. So no good studies, and no recent studies either, as far as we are aware. This is why we currently prefer a disaggregated approach, as we do not see how, with the evidence at hand, it is possible to estimate the equivalence weights with any precision .<br>&nbsp;</p>", "parentCommentId": "vFsctoi6rR7tA6Cmt", "user": {"username": "cynthiaschuck"}}, {"_id": "xbGTnisxfbMszuutd", "postedAt": "2024-03-05T15:35:53.125Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>This is an interesting question, relating to the evolutionary role of pain going beyond protection of the individual survival and immediate reproduction (or that of kin), but affecting the group as a whole. As you said, debilitating pain (i.e., pain that prevents individuals to function normally) for a solitary species may also have different moral implications than for a social species even if the unpleasantness of the pain experience is the same.</p><p>My impression is that it would be difficult to determine differences in pain aversiveness among species with different degrees of sociality given the confounders present. For example, there might be differences in hedonic and cognitive capacity between social and non-social species (see eg <a href=\" https://forum.effectivealtruism.org/posts/H7KMqMtqNifGYMDft/differences-in-the-intensity-of-valenced-experience-across\">here</a>), hence differences in aversiveness to pain for reasons other than the context of the painful experience.</p>", "parentCommentId": "sBwMCo8nkAYorAqsd", "user": {"username": "cynthiaschuck"}}, {"_id": "Lzn4Snu2rnd4Kpj6o", "postedAt": "2024-03-05T21:51:35.348Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>“If we understand you well […] the relationship between intensity and aversiveness was in fact linear.”&nbsp;<br>-&gt; Yes, that entire section is well put and a succinct summary of what I was trying to get at.</p><p>“My understanding is that ‘pain intensity’ is often used simply as a synonym for aversiveness or unpleasantness, as opposed to physical intensity of stimuli/pain signals.”<br>-&gt; I see, that wasn’t clear to me when I read your post. I think it’s good to make those distinctions clearer (as you suggested). E.g. some scholars argue that pain without aversiveness (or painfulness) is possible (mainly in pain asymbolia – maybe you’re aware of this: <a href=\"https://direct.mit.edu/books/book/2549/Feeling-Pain-and-Being-in-Pain\">https://direct.mit.edu/books/book/2549/Feeling-Pain-and-Being-in-Pain</a> ). It might be a good idea to distinguish pain and aversiveness conceptually or else explicitly say that you treat them as synonymous (in which case you should modify the claim “Pain's aversiveness escalates disproportionally with its intensity” and similar claims, because it becomes contradictory)</p><p>“So the effort in this work was to try and see if it would be possible to make such a conversion of pain unpleasantness (from ordinal to ratio scale), and determine the distance among the categories of unpleasantness on a ratio scale.”<br>-&gt; if you put it that way it seems clearer (at least to me). I’m still not sure if that’s a substantial point, since adding or subtracting categories would change the relationship between aversiveness and the ordinal scale, but I see what you mean. I guess there is *some* value in saying that stronger verbal descriptions tend to comprise more levels of aversiveness, but to me it’s a bit of a stretch to talk about non-linearity if the x-axis in the plot is actually an ordinal axis.</p><p>“So no good studies, and no recent studies either, as far as we are aware. This is why we currently prefer a disaggregated approach, as we do not see how, with the evidence at hand, it is possible to estimate the equivalence weights with any precision.”<br>-&gt; yeah, that makes sense.</p>", "parentCommentId": "sQJxk4wYFLtbf2djx", "user": {"username": "nalthaus"}}, {"_id": "yzLkdxXt4qZtCvJWa", "postedAt": "2024-03-09T16:35:56.923Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>Thanks! I will revise the post to make sure it is clearer!</p>", "parentCommentId": "Lzn4Snu2rnd4Kpj6o", "user": {"username": "cynthiaschuck"}}, {"_id": "CQ6PPcG8XbztJKqWm", "postedAt": "2024-03-10T19:43:19.990Z", "postId": "C2qiY9hwH3Xuirce3", "htmlBody": "<p>Great!</p>", "parentCommentId": "yzLkdxXt4qZtCvJWa", "user": {"username": "nalthaus"}}]