[{"_id": "pbBvgq5dQ6RKHbFmM", "postedAt": "2022-11-30T13:47:56.000Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Thanks for the post. This makes sense - so many more deaths are caused by eating more chicken that it makes sense to avoid it altogether. This reminds me of the recommendations done in <a href=\"https://www.onestepforanimals.org/about.html\">One Step for Animals</a>.</p><p>&nbsp;</p><p>However, I am a bit bothered that the climate change study doesn't include the impact on famines, wars, infectious diseases, floods and other risks - since they are by far the biggest risks. The biggest danger of climate change isn't heat - it's that it changes absolutely everything else in the Earth system.</p><p>I have a found another study that thinks there is 1 additional deaths for 1000 tons emitted : <a href=\"https://www.frontiersin.org/articles/10.3389/fpsyg.2019.02323/full#h5.\">https://www.frontiersin.org/articles/10.3389/fpsyg.2019.02323/full#h5.</a> What do you think about it ?</p><p>This doesn't change your conclusion that meat should be avoided altogether I think.</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}, {"_id": "24CgdKAfSMASokJ68", "postedAt": "2022-11-30T14:29:46.140Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>While I'm sympathetic to your conclusion, it feels like a major omission to not think about added wild animal deaths due to climate change, in addition to the added human deaths. Did you look at all at the state of research on how climate change will impact wild animal populations? (Note: you might get into some morally tricky questions there. Climate change is going to hurt lots of existing species, but other species may replace species that are hurt by habitat loss and temperature changes. How exactly to morally weight that is probably more complex than just tallying up deaths).&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "tCjLaeSReS3Sufwge", "postedAt": "2022-11-30T16:51:45.387Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Hi Stijn,<br>Interesting post!<br>I have a few questions about your meat-to-animal conversions.<br><br>1. In the \"Deathprint of meat\" section you clearly cite the sources for the meat-to-emissions conversions, but not the meat-to-animal conversions. From reading further down the piece it seems they probably come from Saja, K. (<a href=\"https://doi.org/10.1007/s10460-012-9402-x\">2013</a>). Is that correct?<br><br>2. Saja (2013) seems to calculate 2 kg of chicken meat for \"Average animal products per one animal life\", which would be 0.5 chickens per 1kg though in your table you have 0.667 for animals killed per kg meat for chicken meat. I think that 0.667 is Saja's figure for Fish (1.5kg of meat per 1 fish)?<br><br>3. If you did use Saja (2013), I wonder if you could elaborate on why, especially since as you note it \"excludes the animals used as feed (e.g. fish meal and insect meal given to farm animals).\" One could also use the conversion factors from <a href=\"https://faunalytics.org/animal-product-impact-scales/\"><u>Faunalytics (2020)</u></a> which I believe do include feed fish (here 1kg of chicken meat would be associated with 0.87 animal deaths). There are of course also other more recent conversions <a href=\"https://stephenwarrenorg.files.wordpress.com/2018/08/suffering-by-the-pound-meat-and-animal-product-harm-comparisons5.pdf?fbclid=IwAR39D3pO6DabJn6VVzXPAiIBySXyHz7JAdPsAwTPvEzXiytGcWTlc5sSSHo\"><u>Warren (2018)</u></a><u>, </u><a href=\"http://everydayutilitarian.com/essays/how-much-suffering-is-in-the-standard-american-diet/?fbclid=IwAR3EV5-iIqP31Ljv324uDMbjcxFpAHONa8cpmrK8q_T2cIt8iZDeHi8jSm0\"><u>Hurford (2014</u></a>) for number of animal deaths, and for days of life (or suffering) e.g. <a href=\"https://impartial-priorities.org/direct-suffering-caused-by-various-animal-foods.html?fbclid=IwAR17OAW2vjtJmWuhKkrFgQurq9gUFIQh8XwI2ixPn0I8ea7f7tHr-OmLRDU\"><u>Drescher (2017</u></a>), <a href=\"https://reducing-suffering.org/how-much-direct-suffering-is-caused-by-various-animal-foods/\"><u>Tomasik (2007</u></a>).</p>", "parentCommentId": null, "user": {"username": "Incogneilo18"}}, {"_id": "xZepHZC5mJHD6zEFT", "postedAt": "2022-11-30T19:06:50.515Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Hi Neil,</p><p>my meat-to-animal conversions were not based on Saja, but simply on the weight of edible meat produced by an animal. For chickens, I used the slightly more conservative value of 1.5 kg edible meat per broiler chicken, instead of Saja's 2 kg. That means 1/1.5=0.66 animals/kg. Perhaps broiler chickens in the US grow heavier and are closer to Saja's 2 kg per chicken?</p><p>Haven't thought about using those other sources like Faunalitics. Thanks for mentioning it.</p>", "parentCommentId": "tCjLaeSReS3Sufwge", "user": {"username": "Stijn"}}, {"_id": "xp52biqhJDE9jXXfZ", "postedAt": "2022-11-30T19:27:14.217Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Not much is known about the impact of climate change on wild animals, so therefore I excluded it. It is very complicated. First, it could still be the case that at the expected level of warming, &nbsp;the decrease in cold deaths of wild animals could be larger than the increase in heat deaths. Less freezing days, but more heat waves and forest fires... Second, it might be the case that most wild animals have a net negative welfare and that climate change decreases population sizes, which means fewer animals with net negative welfare will be born, and that is good in the long run. Third, animals have a shorter lifespan and higher reproduction levels than humans, which means &nbsp;the identities of future born animals may be much more dependent on what we (CO2 emitting beings) do, compared to the influence of our actions on the identities of future born humans. Compare the world where we take climate measures with a business as usual world. Already after a few years you will see that those two worlds will contain different animals. That brings us to the difficult non-identity problem in population ethics. So... it becomes very complicated.&nbsp;</p>", "parentCommentId": "24CgdKAfSMASokJ68", "user": {"username": "Stijn"}}, {"_id": "kiyuAfiKdCmMCR2vP", "postedAt": "2022-11-30T19:33:28.138Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Thanks for referring to that study. &nbsp;That 1 death per 1000 tons is in the same order of magnitude of the 1 death per 4000 tons that I used based on Daniel Bressler's study. So I think the main takeaways are still valid. &nbsp;But yes, there is a possibility that deaths from climate induced famines, wars,... are some orders of magnitude larger than deaths from temperature change</p>", "parentCommentId": "pbBvgq5dQ6RKHbFmM", "user": {"username": "Stijn"}}, {"_id": "hbGsKdToN6Y6CEpTz", "postedAt": "2022-12-01T16:59:31.487Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>NPP is increasing, meaning There is more food available, and warmer climates means faster metabolisms and shorter lifespans for ectotherms, we should expect Climate change to increase the number of future animals.</p>\n", "parentCommentId": "xp52biqhJDE9jXXfZ", "user": {"username": "Vgvt"}}, {"_id": "GXfRgxTZwHT4ybkcE", "postedAt": "2022-12-01T17:04:03.912Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Just read the article by Parncutt about the 1000 tonne rule. Apparently, it is 1 death per 1000 tonnes of carbon, i.e. 1 death per 3700 tonnes of CO2, close to Bressler's estimate</p>", "parentCommentId": "kiyuAfiKdCmMCR2vP", "user": {"username": "Stijn"}}, {"_id": "ripvbpKY2uDJLn9ar", "postedAt": "2022-12-01T17:09:08.797Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>According to <a href=\"https://www.nature.com/articles/s41558-019-0578-6\">this study</a>, the excess deaths from temperature are much larger than the deaths from climate change related famines, floods,... &nbsp;I'm not sure if deaths from wars have to be included, because I would say the aggressor who starts the war is responsible for those deaths.</p>", "parentCommentId": "pbBvgq5dQ6RKHbFmM", "user": {"username": "Stijn"}}, {"_id": "BtoMAXr4DgNiKr2qc", "postedAt": "2022-12-02T09:42:37.945Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>I don't have access to the study (I may find a way to access it later). I'm just surprised by the result.</p><blockquote><p>The most pessimistic pathway without mitigation would result in a net economic impact equivalent to 6.6% (3.9–8.6%) of global GDP at the end of this century.</p></blockquote><p>This impact sounds awfully small. The worst climate causing a decrease of 4% to 8% GDP?</p><p>Are these impacts derived from DICE or calculations by Nordhaus, or his peers ? If yes, there are huge methodological flaws in the way this results was obtained (for instance, they only model the impact on GDP for outdoors activites).</p><p>I recommend watching <a href=\"https://www.youtube.com/watch?v=vwwvZ8g5eHE\">this video</a> to understand commons limits of calculations made on GDP impacts.</p><p>This papers on the topic is also <a href=\"https://www.researchgate.net/profile/Steve-Keen/publication/344034609_The_appallingly_bad_neoclassical_economics_of_climate_change/links/5f73b637a6fdcc0086484210/The-appallingly-bad-neoclassical-economics-of-climate-change.pdf\">very interesting</a>.</p><p>&nbsp;</p><p>I really deaths from war should be included, if the war wouldn't have taken place without climate change (which is of course very hard to evaluate - climate change is one factor that adds pressure but is combined with others).</p>", "parentCommentId": "ripvbpKY2uDJLn9ar", "user": {"username": "Corentin Fressoz"}}, {"_id": "jAdbao9QnnLbTjnxm", "postedAt": "2022-12-02T09:44:46.946Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Oh, true. I didn't catch that.</p><p>Thanks for the precision.</p>", "parentCommentId": "GXfRgxTZwHT4ybkcE", "user": {"username": "Corentin Fressoz"}}, {"_id": "DtuX5rEtMpqkEWZBw", "postedAt": "2022-12-02T19:11:35.736Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Neither DICE nor calculations by Nordhaus were used in that study. Here I was not talking about the impact on GDP, but on the expected deaths from undernourishment, fluvial flooding,... (supplementary material figure 3) (These deaths were then used to calculate loss of economic welfare in monetary terms using the value of &nbsp;a statistical life, but that contestable step is not important here.)</p>", "parentCommentId": "BtoMAXr4DgNiKr2qc", "user": {"username": "Stijn"}}, {"_id": "89Kwah2wLB6w4kDMN", "postedAt": "2022-12-03T07:34:55.890Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Ok, I don't really have the time to look into this in detail, this just sounds very much like an underestimate (especially as economic predictions usually don't include tipping points, cascading risks, and include poorly tail risks).</p><p>For instance, at -5°C compared to preindustrial during the last ice age, the North of America and Europe (including Canada and Scotland) were under a 3km thick ice sheet. I fear current climate change damage models would count this as a 4% GDP loss.</p>", "parentCommentId": "DtuX5rEtMpqkEWZBw", "user": {"username": "Corentin Fressoz"}}, {"_id": "uXntyuk4RjBHykesw", "postedAt": "2022-12-05T21:42:52.629Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Post summary (feel free to suggest edits!):<br>A recent study (Bressler, 2021) estimated that for every 4000 ton CO2 emitted today, there will be one extra premature human death before 2100. The post author converts this into human deaths per kilogram of meat produced (based on CO2 emissions for that species), and pairs this with the number of animals of that species that need to be slaughtered to produce 1kg of meat.&nbsp;</p><p>After weighting by neurons per animal, their key findings are below:</p><p><img src=\"https://lh6.googleusercontent.com/9jbbaaPbVqpKVtmm5ENO973apuCH-ute3CJyD09Q6rIKzs-hNwsTQc1scwYKk_jAnxwV864EznBVtOMz_Qkodjvb-US5E6iJoCNv7zmXytf5NvJ-HVapRX6lbkB0AbLSIFPn-dbUn8v5SyiHcoIagqHluWB8XA23vFK8QedcgKiMHz5l89qwbwK3bF8OLg\"></p><p>This suggests switching from beef to chicken or insect meat reduces climate change but increases animal suffering significantly, so might be bad overall. They suggest prioritizing a reduction of chicken meat consumption, and that policy makers stop subsidizing research on insect meat, tax meat based on climate and suffering externalities, and start subsidizing plant / cell based meat.</p><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "ijFWDnDceRixsqiyH", "postedAt": "2022-12-06T22:07:53.356Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>I am sorry but this article is naive at best and misleading at worst. Crickets lifecycle is extremely short, they can live a full life cycle before processing, unlike humans starving to death and butchered livestock. These deaths can not and should not be compared by any  metrics. It is very comfortable to judge solutions to world hunger from the ebony tower, where it is thought wise to shred a tear over crickets than humans in need of nurturing.</p>\n<p>Also the more I think about it, linking the value of life to neurons is a slippery slope.</p>\n<p>Despite all of that, most of the policy suggestions are great.</p>\n", "parentCommentId": null, "user": {"username": "András Hegedűs"}}, {"_id": "pBvqQakovqmpwkNKq", "postedAt": "2022-12-20T01:01:28.432Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>I agree it's very complicated, but it seems possible the results from wild animal suffering/death could be enough to negate the gains you think will come from farmed animals. Hence, I think the policy recommendations should with a big uncertainty cauvea\nt. It's possible those recommendations could make things worse.</p>\n", "parentCommentId": "xp52biqhJDE9jXXfZ", "user": {"username": "Yelnats T.J."}}, {"_id": "MbFEDg5W5dvvX8xLx", "postedAt": "2022-12-20T01:50:33.517Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>I'd like to see if this analysis holds up if you change the human deaths this century per kgs variable (as well as took into account wild animal deaths).</p><p>&nbsp;</p><p>The \"0,00000025\" just comes from Bressler 2021, from what I see. <a href=\"https://docs.google.com/spreadsheets/d/1KudrtbAF4uaIrkOk8nyZtRh-cx01UkI8/edit?usp=sharing&amp;ouid=111316552491979793650&amp;rtpof=true&amp;sd=true\">I did some calculations</a> to see how much the Bressler rate differs from another rate I've read about--the Climate Vulnerability Monitor. It's possible the Bessler number undercounts by a factor between 1:2 and 1:34&nbsp;</p><p>&nbsp;</p><p>Key limitations with my numbers:</p><ul><li>The Bressler number is looking forward to the future but, to compare it, I apply that rate to all existing GHG emissions.</li><li>Beef production might have an asymmetric contribution to climate versus pollution; the latter being the biggest contributor to the Climate Vulnerability Monitor's high-end numbers</li><li>I cherry picked the Climate Vulnerability Monitor. Maybe there is research out there that suggests the GHG kg/human death rate is even lower than Bressler's</li></ul>", "parentCommentId": null, "user": {"username": "Yelnats T.J."}}, {"_id": "DcwLt5PrG7NuTfnQh", "postedAt": "2023-02-18T17:19:02.313Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>Hi Stijn,</p><p>Interesting analysis!</p><p>You say that:</p><blockquote><p>Not much is known about the impact of climate change on wild animals, so therefore I excluded it.</p></blockquote><p>However, if the effects on wild animals are the driver for the nearterm effects (as suggested &nbsp;in the table <a href=\"https://forum.effectivealtruism.org/posts/rdLMTsSZ2oqoFAeTg/is-improving-the-welfare-of-arthropods-and-nematodes-1\">here</a>), being clueless about them (for reasons such as the ones you provided) implies being clueless about the nearterm effects of replacing beef by chicken (or any other substitution). \"Overall effect\" = \"certain effects\" + \"uncertain effects\" can be approximated as:</p><ul><li>\"Certain effects\" if \"certain effects\"&gt;&gt;\"uncertain effects\".</li><li>\"Uncertain effects\" if \"certain effects\"&lt;&lt;\"uncertain effects\".</li></ul><p>Mathematically, you can conclude that <a href=\"https://en.wikipedia.org/wiki/Expected_value\">E</a>(\"overall effect\") &gt; 0 if E(\"certain effects\") &gt; 0 and E(\"uncertain effects\") = 0. However, the sign of E(\"uncertain effects\") is quite uncertain, so that conclusion would not be <a href=\"https://forum.effectivealtruism.org/topics/credal-resilience\">resilient</a>. Under these conditions, further research makes more sense to me than advocating for specific subsitutions.</p>", "parentCommentId": "xp52biqhJDE9jXXfZ", "user": {"username": "vascoamaralgrilo"}}, {"_id": "z6xsSR5MZwEzDiSvw", "postedAt": "2023-02-18T18:21:49.170Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>It might be possible to replace chicken partially with beef and partially with plants so that the environmental (and wild animal) effects have roughly 0 expected value, but the effects on farmed animals are positive. Maybe not, though, depending on how deep your uncertainty and how many different effects you need to balance.</p>\n<p>I discuss this kind of approach more generally here: <a href=\"https://forum.effectivealtruism.org/posts/Mig4y9Duu6pzuw3H4/hedging-against-deep-and-moral-uncertainty\">https://forum.effectivealtruism.org/posts/Mig4y9Duu6pzuw3H4/hedging-against-deep-and-moral-uncertainty</a></p>\n", "parentCommentId": "DcwLt5PrG7NuTfnQh", "user": {"username": "MichaelStJules"}}, {"_id": "MsuyqJWKGzKLZEXfo", "postedAt": "2023-02-28T16:55:20.919Z", "postId": "c3we8rKppwkRLfzwv", "htmlBody": "<p>yes, good point</p>", "parentCommentId": "DcwLt5PrG7NuTfnQh", "user": {"username": "Stijn"}}]