[{"_id": "dKYX8zCgqTbjSzdFi", "postedAt": "2023-09-12T12:28:06.773Z", "postId": "c5BPGmDxYGhgqxyb2", "htmlBody": "<p><strong>Executive summary</strong>: The author shares their experience and insights as an Academic Researcher specializing in nonprofit organizations and accounting, discussing their career trajectory, the nature of their work, and its potential impact.</p><p><strong>Key points</strong>:</p><ol><li>The author has accounting and economics degrees, worked in consulting, and got a PhD in accounting which he enjoyed.</li><li>As a professor, the author teaches 2 courses per semester but spends most days doing research, which he loves for the autonomy and ownership despite pressures.</li><li>The impact comes from training students, doing novel nonprofit research, and earning a high salary to give.</li><li>The author seeks to maximize impact via policy, organizations, donors, and nonprofit boards, and is happy to advise aspiring academics.<br>&nbsp;</li></ol><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "rQEGdemohgKqvpSwp", "postedAt": "2023-09-12T12:43:22.456Z", "postId": "c5BPGmDxYGhgqxyb2", "htmlBody": "<p>Thanks for sharing this!</p>", "parentCommentId": null, "user": {"username": "MJusten"}}, {"_id": "gWzE8uQzqjgmnmYd4", "postedAt": "2023-09-12T21:29:56.598Z", "postId": "c5BPGmDxYGhgqxyb2", "htmlBody": "<p>Thank you for sharing your thoughts. Being a lecturer is undoubtedly an engaging profession, but the experience in Low- and Middle-Income Countries (LMICs) like Nigeria presents unique challenges. Despite these hurdles, I still have the privilege of managing my time and courses.</p><p>As a senior lecturer, my monthly salary amounts to a mere $272 USD (using 900NAIRA/USD). What sets this apart is the absence of funds available for initiating research projects or establishing a lab. Consequently, the responsibility falls squarely on me to self-finance my research endeavors and publish research papers using this salary. In essence, there is little room for the concept of \"earning to give\" in our academic landscape. It's an arduous journey, to say the least.</p><p>To illustrate the extent of our challenges, my university hasn't paid us salaries for the last four months. Nonetheless, we continue to report to work and strive to conduct research. It is an exceptionally tough situation – one where you cannot simply request assistance, yet you must maintain productivity, often measured in terms of publications.</p><p>In our context, the impact of our work is often measured by the individuals we nurture and mentor. Training and guiding students to progress and contribute meaningfully to society is our primary yardstick for success. Witnessing their growth and development brings a deep sense of satisfaction and happiness.</p><p>I must admit that there have been moments of temptation to seek opportunities elsewhere, where conditions may be more favorable. However, my commitment to the cause keeps me rooted here. The challenges notwithstanding, the fulfillment derived from shaping the future of our students and our community makes it all worthwhile. I am constantly on the lookout for that elusive solution that might make our work easier.</p><p>I often wonder if there are programs or initiatives that could provide a stop-gap salary for individuals working in positions where they are owed salaries for extended periods but would prefer not to leave their jobs. I would be highly interested in applying for such support if it were available.</p>", "parentCommentId": null, "user": {"username": "emmannaemeka"}}]