[{"_id": "9R5tk2g53Awr2wbwe", "postedAt": "2022-10-07T15:51:03.323Z", "postId": "c5wgvkt2CfCCciggR", "htmlBody": "<p>A hot take I heard recently that I like but am not yet sure I buy is that asking for more rather than less can make you feel more like an employee and less like a volunteer, and therefore more likely to actually take your work seriously.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "BvoPZHdPBGjKvfquB", "postedAt": "2022-10-07T19:50:55.139Z", "postId": "c5wgvkt2CfCCciggR", "htmlBody": "<p>There are a lot of great resources for grantees that people posted in the responses to my question a few months ago, \"<a href=\"https://forum.effectivealtruism.org/posts/KdhEAu6pFnfPwA5hf/grantees-how-do-you-structure-your-finances-and-career\">Grantees: how do you structure your finances &amp; career?</a>\" &nbsp; (The answers with the most detail are about taxation and other expenses-related stuff. &nbsp;I am still curious to hear more about how being an EA grantee intersects with long-term career planning and other life considerations about things like family, location, etc.)</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "RZJK9CojjqJPM5XjE", "postedAt": "2022-10-07T20:38:07.237Z", "postId": "c5wgvkt2CfCCciggR", "htmlBody": "<p>Thanks, adding to the post!</p>", "parentCommentId": "BvoPZHdPBGjKvfquB", "user": {"username": "Julia_Wise"}}, {"_id": "xT8geL67kJ5stJfHF", "postedAt": "2022-10-07T21:31:22.624Z", "postId": "c5wgvkt2CfCCciggR", "htmlBody": "<p>Julia -- excellent advice.</p><p>Also budget for a car and car insurance if you're planning to live in the US.</p><p>The US generally has very bad public transportation, and a very car-centered culture, so you'll need to buy a used car. Only a few cities in the US are feasible to live without a car (e.g. New York, San Francisco), and most are way too dangerous to use a bicycle for a daily commute.</p><p>You can get a decent used car for something around USD $5k to $10k, but bear in mind used car prices are quite high at the moment -- about <a href=\"https://fred.stlouisfed.org/series/CUSR0000SETA02\">50% higher </a>than just 2 years ago.&nbsp;</p><p>In most areas of the US, I'd recommend something substantially bigger and heavier than UK or European people are used to driving, given the safety concerns. We have a lot of bad drivers, and if you're into longtermism and longevity, you'll want to minimize risk of death/disability from car crashes. My heuristic would be, get a vehicle with at least 4,000 pounds mass, 6 airbags, and some active safety features. Bear in mind that gas is much cheaper in the US than in many other countries, so the extra mass doesn't matter very much in terms of running costs.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "RAHyBkcQq5CczFBfx", "postedAt": "2022-10-07T21:32:36.428Z", "postId": "c5wgvkt2CfCCciggR", "htmlBody": "<p>I recently applied for funding and found it helpful to look at my month to month spending over the last few months. I guessed at a rough mean monthly spending over 6 months but I might have been better off picking a median. I also forgot to account for tax!</p>\n", "parentCommentId": null, "user": {"username": "Will Payne"}}, {"_id": "eQKToPuoCSaJBmJpQ", "postedAt": "2022-10-10T15:51:38.128Z", "postId": "c5wgvkt2CfCCciggR", "htmlBody": "<p>This doesn't seem obvious enough to me to include - I eventually co-owned a car at age 36 but never had one before that (living in suburbs of Philadelphia and Boston). It does seem worth talking to people in the area you plan to live about whether they find it feasible to not own a car.</p>", "parentCommentId": "xT8geL67kJ5stJfHF", "user": {"username": "Julia_Wise"}}]