[{"_id": "w4yEufQYBi5kkeE6k", "postedAt": "2024-01-15T17:59:36.512Z", "postId": "c7NN2wZE6KqSjMYhM", "htmlBody": "<p>Skimming the <a href=\"https://80000hours.org/podcast/episodes/alison-young-biosafety-lab-leaks/\">podcast transcript</a> they talk about the importance of directional airflow in BSL-3 (non-airtight) labs while the paper talks about how now that we've gotten good at making BSL-4 labs airtight, directional airflow between differently risky airtight sections doesn't appreciably reduce risk. It doesn't sound like these are in tension?</p>\n<p>Can you be specific about the proposed changes to biosafety precautions you think are misguided, including linking and/or quoting them?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "jnSTufd73DnwWh9K9", "postedAt": "2024-01-15T19:07:54.966Z", "postId": "c7NN2wZE6KqSjMYhM", "htmlBody": "<p>Thanks for the comment, Jeff!</p><blockquote><p>Skimming the <a href=\"https://80000hours.org/podcast/episodes/alison-young-biosafety-lab-leaks/\">podcast transcript</a> they talk about the importance of directional airflow in BSL-3 (non-airtight) labs while the paper talks about how now that we've gotten good at making BSL-4 labs airtight, directional airflow between differently risky airtight sections doesn't appreciably reduce risk. It doesn't sound like these are in tension?</p></blockquote><p>They do not talk explicitly about directional airflow in BSL-4 labs, but \"I got the impression listening to the podcast that directional airflow, and a differential pressure gradient were critical safety measures even today\", not just in BSL-3 labs, but more broadly. Alison said:</p><blockquote><p>The airflow issue is a problem that comes up over time. One of the things I think that’s important for listeners to understand is that one of the main ways that labs try to keep these pathogens from infecting people outside the lab is to control the airflow in the labs: they operate under what’s supposed to be <a href=\"https://en.wikipedia.org/wiki/Negative_room_pressure\">negative air pressure</a>. And this lab [at the Birmingham Medical School; I do not think it was BSL-3 nor BSL-4] had problems with airflow, allowing particulates to float out into areas where people would not have been thinking they were at risk of becoming infected.</p></blockquote><p><a href=\"https://www.frontiersin.org/articles/10.3389/fbioe.2022.953675/full\">Kurth 2022</a> focusses on BSL-4 labs, but it suggests we do not have strong evidence that a differential pressure gradient is needed in BSL-3 labs:</p><blockquote><p>Only a 2005 study by (<a href=\"https://www.frontiersin.org/articles/10.3389/fbioe.2022.953675/full#B2\">Bennett et al.,2005</a>) addresses the relationship between negative pressure and protection from cross-contamination in BSL-3 laboratories in an evidence-based manner and concludes that pressure differentials has no effect on protection from cross-contamination. Only directional airflow into a laboratory (inflow velocity) had a positive effect and is still used today to protect against cross-contamination in non-technically airtight rooms (e.g., BSL-3 laboratories).</p></blockquote><p>I think the above is in tension with Alison seemingly highlighting the importance of a differential pressure gradient in CDC's BSL-3 lab:</p><blockquote><p><strong>Luisa Rodriguez:</strong> Let’s talk about a few more of the things you uncovered. So there’s the duct tape on the door. Are there other examples that you remember particularly vividly from this period of investigation?</p><p><strong>Alison Young:</strong> Yeah, definitely. So that same building with the duct tape, Building 18, has had over the years a whole series of these airflow problems. Whether it’s other power outages, which it also has had, or the airflow systems not working properly — either being neutral or, on occasions, going positive.</p><p>That negative airflow has been a challenge. And one of the things I’ve learned over time is that that is one of the more complex systems in these labs. Not just this Building 18, but getting that airflow to work properly is something that is very difficult for these facilities. So there have been numerous incidents of that: puffs of air where people are walking by and all of a sudden they feel this puff of air enough that it sort of blew someone’s hair coming out of a lab. Luckily, that particular lab was not hot at the time. So there have been those kinds of things.</p></blockquote><p>In terms of:</p><blockquote><p>Can you be specific about the proposed changes to biosafety precautions you think are misguided, including linking and/or quoting them?</p></blockquote><p>I did not mean to claim some proposed changes to biosafety are misguided. I would also not remove the ones related to directional airflow and a differential pressure gradient unless we have significant evidence they are not needed. On the other hand, I think it is good to be transparent about how much evidence is supporting the precautions.</p>", "parentCommentId": "w4yEufQYBi5kkeE6k", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ia5KbDeGGq5M5WLXi", "postedAt": "2024-01-15T20:12:17.256Z", "postId": "c7NN2wZE6KqSjMYhM", "htmlBody": "<blockquote><p>\"I got the impression listening to the podcast that directional airflow, and a differential pressure gradient were critical safety measures even today\", not just in BSL-3 labs, but more broadly. Alison said:</p></blockquote><blockquote><blockquote><p>The airflow issue is a problem that comes up over time. One of the things I think that’s important for listeners to understand is that one of the main ways that labs try to keep these pathogens from infecting people outside the lab is to control the airflow in the labs: they operate under what’s supposed to be negative air pressure. And this lab [at the Birmingham Medical School; I do not think it was BSL-3 nor BSL-4] had problems with airflow, allowing particulates to float out into areas where people would not have been thinking they were at risk of becoming infected.</p></blockquote></blockquote><p>&nbsp;</p><p>They're talking about <a href=\"https://en.wikipedia.org/wiki/1978_smallpox_outbreak_in_the_United_Kingdom\">Janet Parker's infection in 1978</a>, right? That was before the introduction of the BSL system, and controls were very lax compared to today. &nbsp;Among other things, the rooms weren't anywhere close to airtight, which made negative pressure much more important. &nbsp;I see this inclusion in the interview as an illustration of why airflow controls are important.</p><p>Note also that when Young talks about controlling air flow she's talking about something much broader than directional airflow. &nbsp;That also includes things like biosafety cabinets and positive pressure suits, and I don't think anyone is saying these aren't critical tools?</p><blockquote><p>I think the above is in tension with Alison seemingly highlighting the importance of a differential pressure gradient in CDC's BSL-3 lab</p></blockquote><p>I don't think these are in tension? &nbsp;The Bennet study is talking about how to design BSL-3 labs, and Young is describing a situation where a CDC lab wasn't being operated as designed. It reads to me like after an accident the CDC lab's airflow management wasn't operational at all. This would still have been be a serious issue if the lab had been designed along Bennet's recommendations, focusing on inflow velocity.</p><hr><p>Overall it looks to me like Young is trying to give a high level introduction to biosafety, including giving specific examples of historical failures to explain why you care how the air is flowing. Then you're responding by citing papers that say \"better to manage airflow this way and not this way\" as if they conflict with her explanations, but I don't actually see conflicts?</p>", "parentCommentId": "jnSTufd73DnwWh9K9", "user": {"username": "Jeff_Kaufman"}}, {"_id": "PKy28ozWeg2echPJY", "postedAt": "2024-01-15T22:41:24.199Z", "postId": "c7NN2wZE6KqSjMYhM", "htmlBody": "<p>The lack of rigorous applied biosafety research in recent years is among the major challenges to protecting against the release of dangerous pathogens from research facilities around the world.</p><p>The foundations of modern biosafety practices in use today were pioneered by Dr. Arnold Wedum and the safety division at the U.S. Army’s Camp Detrick (later Fort Detrick) in Maryland in the decades after World War II. Wedum and his team, as I detail in <a href=\"https://www.kirkusreviews.com/book-reviews/alison-young/pandoras-gamble/\"><i>Pandora’s Gamble</i></a>, did intensive investigations trying to determine the source of each of the hundreds of accidental infections associated with Detrick’s biological experiments. These lab-associated infections weren’t occurring just among the scientists performing experiments. The invisible, accidental spread of pathogens outside of the labs was also resulting in infections among secretaries, animal caretakers, dishwashers, carpenters and the occasional spouse.</p><p>Because so few of these infections could be traced to an obvious lab accident, pioneering research was done during this era using high-speed photography to examine how infectious aerosols could be generated by routine lab activities like the removal of stoppers out of bottles or the transfer of liquid specimens between containers. Wedum’s team studied the risks posed by animals used in experiments: not just from biting or scratching workers, but also their ability to spread infectious organisms by shaking their contaminated fur or through human contact with their cage litter. They even studied the risks of microbes contaminating the beards of men working in labs.</p><p>But this kind of intensive study of the risks – and effectiveness – of lab procedures and equipment has not been the norm in recent decades, according to experts interviewed for <i>Pandora’s Gamble</i>. While government and private funders have spent billions of dollars on biological research – including funding experiments that make pathogens more dangerous than what is found in nature, there has been little funding or focus – since the Wedum era – on studies to assess lab safety equipment and practices. For a good overview of the research needs in applied biosafety, please see: &nbsp;<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5371692/\">Basic Scholarship in Biosafety is Critically Needed To Reduce Risk of Laboratory Accidents</a>.</p><p>It is important to note that the specific paper cited in this post (<a href=\"https://www.frontiersin.org/articles/10.3389/fbioe.2022.953675/full\">Kurth 2022</a>) is focused on biosafety level 4 labs, the highest safety level. These particular labs, which represent <a href=\"https://www.globalbiolabs.org/\">a small fraction</a> of biological research labs around the world, have different layers of engineering than lower level labs. The duct-taped door at the CDC, for example, was in a biosafety level 3 lab that had a reversal of its airflow – blowing positive (outward) into a clean corridor.</p><p>And while the post here cites a couple of papers questioning the necessity of certain aspects of directional airflow in lab facilities, it's worth noting that these papers, so far, have not resulted in changes in what are considered current best practices for containment at BSL-3 and BSL-4 lab facilities.</p><p>The current 6th edition of <i>Biosafety in Microbiological and Biomedical Laboratories, </i>often just referred to as the BMBL, is considered a leading advisory document \"recommending best practices for the safe conduct of work in biomedical and clinical laboratories from a biosafety perspective.\" &nbsp;In it you can find multiple references to the importance of directional airflow in modern labs. <a href=\"https://www.cdc.gov/labs/BMBL.html\">https://www.cdc.gov/labs/BMBL.html</a>&nbsp;</p><p>But the bottom line is that there remains a significant need for applied biosafety research on a wide range of engineering and human factors.</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Alison Young"}}, {"_id": "mGsmqpnutbCJ2piPu", "postedAt": "2024-01-16T10:12:14.681Z", "postId": "c7NN2wZE6KqSjMYhM", "htmlBody": "<blockquote><p>Overall it looks to me like Young is trying to give a high level introduction to biosafety, including giving specific examples of historical failures to explain why you care how the air is flowing. Then you're responding by citing papers that say \"better to manage airflow this way and not this way\" as if they conflict with her explanations, but I don't actually see conflicts?</p></blockquote><p>Fair! The post was supposed to be a little bit of a call to being curious and <a href=\"https://forum.effectivealtruism.org/posts/GW3cxBurTNKHs352S/controlling-for-a-thinker-s-big-idea\">controlling for a thinker’s big idea</a> rather than confidently pointing to conflicts. It is also worth noting that optimal number of biosafety failures (and maybe even pandemics?) is not 0. As Bryan Caplan <a href=\"https://80000hours.org/podcast/episodes/bryan-caplan-stop-reading-the-news/#cold-open-000000\">said</a>:</p><blockquote><p>Whenever there is a disaster, the normal reaction is, “Something has to be done to stop this from ever happening again.” Again, the question is: Maybe we should just stay the course, because this is the right number of disasters to have? Which horrifies people. But look, we shouldn’t have earthquake codes so strict that no building ever collapses, no matter what, because the effect on housing costs would be astronomical. So why don’t you tell me what is the correct number of houses to collapse in earthquakes [or airflow issues in biosafety labs]? And then we’re only going to cover it in the media if we exceed that number. You just imagine people’s heads exploding, like, “No, we have to cover every single one so that we can have the proper reaction!” This proper reaction is what makes housing costs too high.</p></blockquote><p>Of course, it still makes sense to be aware of the risks, and I think it is great that Alison has contributed to that! I have added the above quotation and sentences before and after it in this comment to the post.</p><p>Below are some quick replies to the other parts of your comment, but I wanted to say the above 1st because for me it is the most important part.</p><blockquote><p>They're talking about <a href=\"https://en.wikipedia.org/wiki/1978_smallpox_outbreak_in_the_United_Kingdom\">Janet Parker's infection in 1978</a>, right?</p></blockquote><p>Right.</p><blockquote><p>Note also that when Young talks about controlling air flow she's talking about something much broader than directional airflow. &nbsp;That also includes things like biosafety cabinets and positive pressure suits, and I don't think anyone is saying these aren't critical tools?</p></blockquote><p>I have not looked into that, but I guess they are important.</p><blockquote><p>I don't think these are in tension? &nbsp;The Bennet study is talking about how to design BSL-3 labs, and Young is describing a situation where a CDC lab wasn't being operated as designed. It reads to me like after an accident the CDC lab's airflow management wasn't operational at all. This would still have been be a serious issue if the lab had been designed along Bennet's recommendations, focusing on inflow velocity.</p></blockquote><p>Right, directional airflow should have been working, but Alison also seemed to imply there is a need for a differential pressure gradient, which is in tension with <a href=\"https://www.frontiersin.org/articles/10.3389/fbioe.2022.953675/full\">Kurth 2022</a> saying:</p><blockquote><p>Only a 2005 study by (<a href=\"https://www.frontiersin.org/articles/10.3389/fbioe.2022.953675/full#B2\">Bennett et al.,2005</a>) addresses the relationship between negative pressure and protection from cross-contamination in BSL-3 laboratories in an evidence-based manner and concludes that pressure differentials has no effect on protection from cross-contamination.</p></blockquote>", "parentCommentId": "ia5KbDeGGq5M5WLXi", "user": {"username": "vascoamaralgrilo"}}, {"_id": "AoiSF62dYzESFqwuM", "postedAt": "2024-01-17T14:46:07.570Z", "postId": "c7NN2wZE6KqSjMYhM", "htmlBody": "<p>Thanks for the valuable clarifications, Alison!</p>", "parentCommentId": "PKy28ozWeg2echPJY", "user": {"username": "vascoamaralgrilo"}}]