[{"_id": "SFoBkmYvmyvG3yuzh", "postedAt": "2023-12-21T19:44:42.309Z", "postId": "C7vmqqyn68Kx3gzij", "htmlBody": "<blockquote><p>the idea that essential workers would stay at home while society breaks down around them is implausible to me. I would welcome evidence to change my mind here, but that case has not been made.</p></blockquote><p>I think Ebola in 2014 is an example. <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/</a><br>\"The epidemic killed and drove out many farmers, leading to the abandonment of fields whose plantations turned into rotten food. . . . disruptions in markets and in the processing and distribution chains of agri-food products <strong>exposed nearly one million people to food insecurit</strong>y [<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref10\"><u>10</u></a>].<br><br>The health sector was also deeply affected. First of all, a high mortality rate among health workers was observed. Fear of infection led to a decrease in the number of people attending health centres for other diseases. Public health interventions such as vaccination, antenatal care, diagnosis and treatment of common diseases such as diarrhoea, malaria, pneumonia, HIV/AIDS, tuberculosis, as well as effective emergency case management dropped sharply. For malaria in 2014, the Ebola epidemic was estimated to have led to an increase in malaria cases of 45% in Guinea, 88% in Sierra Leone, and 140% in Liberia, with an <strong>additional 10,000 deaths</strong> [<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref4\"><u>4</u></a>,<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref13\"><u>13</u></a>]. In the Ebola affected districts in Guinea, health facilities were badly affected. In November 2014, 94 health centres (<strong>23%) closed due to desertion and/or deaths of health workers</strong> [<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref14\"><u>14</u></a>].\"</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "XuxGGYmzFrDQ5CQdz", "postedAt": "2023-12-22T12:00:38.837Z", "postId": "C7vmqqyn68Kx3gzij", "htmlBody": "<p>Thanks - this is definitely a relevant example, especially the health facilities. I have towards more uncertainty here.</p><p>The food security seems to be the impact of inverventions, rather than pure fear, which is the mechanism Gopal et al. suggest.</p><blockquote><p>The reduced mobility of farmers and other agricultural workers, but also the difficulty of getting products to harbours due to the quarantine zone, prevented affected countries from being able to produce and sell their goods [<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref4\">4</a>,<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref8\">8</a>,<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref9\">9</a>]. The epidemic killed and drove out many farmers, leading to the abandonment of fields whose plantations turned into rotten food. Some larger farms faced significant labour shortages as a result of quarantine and the migration of many families [<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref8\">8</a>,<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8797032/#ref10\">10</a>].</p></blockquote>", "parentCommentId": "SFoBkmYvmyvG3yuzh", "user": {"username": "jooke"}}, {"_id": "KbpHkkDhfnsyw5FtH", "postedAt": "2023-12-22T19:07:55.254Z", "postId": "C7vmqqyn68Kx3gzij", "htmlBody": "<p>True, I hadn't properly looked at the amount of the agricultural disruption that was due to interventions.</p>", "parentCommentId": "XuxGGYmzFrDQ5CQdz", "user": {"username": "Julia_Wise"}}, {"_id": "dH8BLJW5LYY3iR2LG", "postedAt": "2023-12-23T10:28:18.567Z", "postId": "C7vmqqyn68Kx3gzij", "htmlBody": "<p>Thanks for writing this, I found it interesting!</p>", "parentCommentId": null, "user": {"username": "jtm"}}]