[{"_id": "NP8REeJwEdXtkz7xH", "postedAt": "2023-11-17T12:46:21.605Z", "postId": "C8ZzjFc7aKT7ihmeK", "htmlBody": "<p>This sounds very worthwhile – I’m glad you’re working on this!</p>\n<blockquote>\n<p>We will initially establish a proof of concept in one <strong>region</strong>, working closely with the government TB program.</p>\n</blockquote>\n<p>It wasn’t clear to me from the post whether you’re planning to do an impact evaluation of an <em>existing</em> government TB programme, or to trial a <em>new</em> kind of screening and preventive treatment programme in partnership with a government (which wouldn’t otherwise do it without you).</p>\n<blockquote>\n<p>We will then aim to scale <strong>nationally</strong>, with funding from the <a href=\"https://www.theglobalfund.org/en/\">Global Fund</a>, and expand to <strong>other countries</strong>.</p>\n</blockquote>\n<p>Have I understood correctly that the Global Fund wouldn’t be willing to fund the proof-of-concept and pilot programmes itself?</p>\n", "parentCommentId": null, "user": {"username": "Andrew Gimber"}}, {"_id": "rwKxvQQMFRpzQic2e", "postedAt": "2023-11-19T23:39:18.943Z", "postId": "C8ZzjFc7aKT7ihmeK", "htmlBody": "<p>Excellent, I hope this goes really well!</p><p>It would seem better and less confusing to me if the good folk at GWWC (<a href=\"https://forum.effectivealtruism.org/users/graceadams?mention=user\">@GraceAdams</a>) add a field in the donation interface with a dropdown menu of which specific CE-incubated charity one wants to donate to (with the default being an agnostic donation for GWWC to distribute between CE charities as they see fit).&nbsp;</p>", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "jPCfCW5Z9gtZ7gpvt", "postedAt": "2023-11-24T05:24:25.428Z", "postId": "C8ZzjFc7aKT7ihmeK", "htmlBody": "<p>Hello, Rox! Congratulations on the name! Excited for the team.</p>\n", "parentCommentId": null, "user": {"username": "Mark Romero MD"}}, {"_id": "ikt9RTaNQFHnWTLFK", "postedAt": "2023-11-28T19:28:50.508Z", "postId": "C8ZzjFc7aKT7ihmeK", "htmlBody": "<p>Hi Andrew,</p><p>Thanks for your comment!</p><blockquote><p>It wasn’t clear to me from the post whether you’re planning to do an impact evaluation of an <i>existing</i> government TB programme, or to trial a <i>new</i> kind of screening and preventive treatment programme in partnership with a government (which wouldn’t otherwise do it without you).</p></blockquote><p>Apologies it wasn't clear!</p><p>Our current plan is the latter: to start a new program (in partnership with the government).</p><p>Programs like this do exist in many countries and many regions but we are hoping to show that a certain program can work well in a particular context where it hasn't been tried before.</p><p>Our program may well have elements that are not yet widespread e.g. particular drug regimens, dignostic tools or methods of program delivery (such as through schools or using mobile vans)</p><blockquote><p>Have I understood correctly that the Global Fund wouldn’t be willing to fund the proof-of-concept and pilot programmes itself?</p></blockquote><p>Yes you have understood correctly that we don't expect to get Global Fund money going towards these early stages.</p><p>The Global Fund works on a 3 year cycles and provides money for a country's national TB program over that period.</p><p>We're hoping to introduce a new program that we don't expect a government / national TB program to already have funding for from the Global Fund. Though, in time, we hope that it will become part of the national TB program activities.</p><p>Hope that answers your questions!</p>", "parentCommentId": "NP8REeJwEdXtkz7xH", "user": {"username": "Habiba"}}, {"_id": "snGv2Yh9y7xECu3DD", "postedAt": "2023-12-08T12:53:40.113Z", "postId": "C8ZzjFc7aKT7ihmeK", "htmlBody": "<p>I wanted to check if this project could become redundant by the expected arrival of TB vaccine(s) later this decade, but they had <a href=\"https://www.devex.com/news/who-s-jeremy-farrar-says-he-s-optimistic-about-tuberculosis-here-s-why-106241\">only 50% efficacy in Phase 2 trials</a>, so treatment will indeed be needed for quite a while it seems.</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "CdBheD7qTeedPrsBd", "postedAt": "2023-12-11T15:56:28.735Z", "postId": "C8ZzjFc7aKT7ihmeK", "htmlBody": "<p>Yes I asked some TB experts about precisely this a little while ago and I totally agree with your take: eventually there will hopefully be even better preventative measures like vaccines but they really do seem like a while off right now. So right now the WHO is keen to push on expanding access to TB preventative treatment.</p>\n", "parentCommentId": "snGv2Yh9y7xECu3DD", "user": {"username": "Habiba"}}, {"_id": "wFtDjxr5gzLkToGJW", "postedAt": "2024-01-12T11:00:31.991Z", "postId": "C8ZzjFc7aKT7ihmeK", "htmlBody": "<p>Hello Rox! Congratulations on securing the name! I'm thrilled about the team and can't <a href=\"https://apkwa.net/pt/gb-whatsapp/\">wait </a>for what's to come. Unique value: A warm greeting and genuine enthusiasm for the achievement.</p><p>&nbsp;</p><p>&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Cozy Nest"}}]