[{"_id": "Hqm3ApA4fsXfsgsbk", "postedAt": "2015-03-25T16:03:55.135Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Totally agree--I've been noticing that the later stages of the funnel are neglected as well. These are great suggestions! I hope people are inspired to follow them.</p>\n<p>I'm especially optimistic about the potential for local meetups and student groups. Regular, discoverable, newbie-friendly EA meetups have already been a big source of growth for the Boston scene (and I imagine other places as well). I'd just like to plug Weeatquince's <a href=\"http://effective-altruism.com/ea/ey/how_i_organise_a_growing_effective_altruism_group/\">great guide</a> for running them efficiently, to anyone who's considering starting one!</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "syAxSPgofsyg9ebo3", "postedAt": "2015-03-25T17:17:11.702Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>A different way of thinking about the &quot;gold rush&quot; idea is that EA has achieved product-market fit. We know we have a set of ideas that are valuable to people and that people want. Now is the time for the hockey stick growth curve.</p>\n", "parentCommentId": null, "user": {"username": "Kerry_Vaughan"}}, {"_id": "v55LfRAxwde5daAGv", "postedAt": "2015-03-25T17:42:27.000Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Just to add - Weeatquince is Sam Hilton (he's happy for the article not to be anonymous) - I'm sure he'd be happy to chat about it in person too if people are interested in setting up groups! </p>\n", "parentCommentId": "Hqm3ApA4fsXfsgsbk", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "sJ3YWiMS5QhaZrkQG", "postedAt": "2015-03-25T17:56:27.495Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Thanks for this Peter. Definitely an important area for more work, and this has lots of great ideas for us to work on! \nI’m not sure I agree that there more people wanting conversations than are willing to talk. Giles’ ‘buddy’ system seemed to yield a bunch of people happy to chat to new effective altruists, but very few people with questions (that was my impression anyway, as a ‘buddy’ who didn’t end up having any conversations). \nI think I’d actually characterise Giving What We Can a bit less as focusing on getting people to first hear about effective altruism, and a bit more as focusing on the problem of how to get people from having heard about it to acting on it. We’re planning to hire Luke Ilott in June, the largest part of whose job will be reaching out to people who have had some contact with the idea of giving effectively, and chatting/answering questions/addressing concerns/seeing how the person could get more involved. Our current outreach is also focused heavily on local groups (led by Jon Courtney). These seem both good ways of introducing people to the ideas, and also good ways to get people more engaged with them. Since GWWC is first and foremost a community, we’re hopefully in somewhat of a good position to support people in the process of going from liking the sound of effective altruism, to really putting effective altruism into practice.</p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "fJExxeLHEcwu4ZLZ9", "postedAt": "2015-03-25T23:17:15.651Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>I really like this and the funnel stuff cribbed from for profit orgs. I see the biggest value add of EA being broadly characterizeable as getting non-profits to start doing all the effective things for profits do.</p>\n<p>My guess is that it would be useful to have meetups have a strong component of people talking about earning to give. Their experience with it, how they set it up, etc. A large influx of people means most of them will not be joining EA orgs to work on things directly.</p>\n<p>Is anyone working on adapting <a href=\"http://lesswrong.com/lw/crs/how_to_run_a_successful_less_wrong_meetup/\">this guide</a> to EA startups to supply meetups with a default agenda? This should lower the frictional costs associated with organizers who may have access to a venue not knowing what to do.</p>\n", "parentCommentId": "syAxSPgofsyg9ebo3", "user": {"username": "RomeoStevens"}}, {"_id": "M29F3nd6jcXNQqyPY", "postedAt": "2015-03-25T23:31:43.812Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>I obviously agree with this post given that we've already talked about it :-). Three notes:</p>\n<p>1) I'm uncomfortable with the idea that introducing people to EA is well funded. First, relative to the size of the opportunity here, I the amount of funding is minuscule. Second, we have yet to find a massively scalable approach to finding new EAs. Until we have that, we're not going to achieve true hockey stick style massive growth</p>\n<p>2) A project applied to EA Ventures with an idea to work on solving this problem :-). Still working them through the evaluation process, so I can't say much now. More info may be available in the near future.</p>\n<p>3) I think effectivealtruism.org is the natural home for projects in this domain. I'd love to work with you (or anyone else) on developing and testing out ways to get people that sign up there plugged into the community.</p>\n", "parentCommentId": null, "user": {"username": "Kerry_Vaughan"}}, {"_id": "SyBqGbDMEm2z3ZBcA", "postedAt": "2015-03-26T03:02:17.744Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<p>Is anyone working on adapting this guide to EA startups to supply meetups with a default agenda?</p>\n</blockquote>\n<p>That would be great. There are some shorter guides already, which are <a href=\"http://effective-altruism.wikia.com/wiki/Local_groups\">indexed on the EA wiki</a>, including the excellent one by Sam referenced in the comment by Ben above.</p>\n", "parentCommentId": "fJExxeLHEcwu4ZLZ9", "user": {"username": "Tom_Ash"}}, {"_id": "3xtddgYpG4fSZeeix", "postedAt": "2015-03-26T09:37:55.646Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>I agree with this and would add that even monthly meetings only could be very valuable if they're combined with good online follow-up. When you know someone from a meeting first you're probably more likely to ask them lots of questions that if they were just recommended to you over the internet. Nevertheless, I also think it could be promising to invest into personalized online guidance. Michelle mentioned below that the buddy-system wasn't used much, but maybe something similar could work well especially if the demand from new people increases as expected. </p>\n", "parentCommentId": "Hqm3ApA4fsXfsgsbk", "user": {"username": "Lukas_Gloor"}}, {"_id": "CBaNBqn6Xm8mkBawE", "postedAt": "2015-03-26T13:45:01.875Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>My hunch is that specialising might be interesting. We've got good groups working together around EA for profit ventures, mainly in tech. We've got emerging groups around earning to give, even for poker players specifically. I'd like to see the EA movement get so big that we have groups that are focused on particular things. These might be organised by method (e.g. cognitive sciences, maths, management) and organised by subject (e.g. politics or healthcare). Having an organised matrix where people can be organised by which fields they have skills/networks in would also be interesting. I see this as a little bit in tension with the whole 'breadth' thing, but you have to pin your stripes to a mast for some portion of time to get anywhere, and can always switch camps later. </p>\n<p>The thought behind it is that organising in this way suddenly makes the questions of 'what to do with them' much less of a problem: each group will have projects they want help with at different stages, will be appropriate as a source of mentoring, will be open to ideas in this domain, and can help to bring some more focused suggestions. </p>\n<p>Too organised?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "d9Kd2X6gbZau4SaBr", "postedAt": "2015-03-26T14:03:49.367Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Thanks for the great post Peter!  As Michelle mentioned I am spending most of my time focusing on chapter growth, and helping to support established and emerging chapters.  I completely agree with everything you said about the importance of local groups- in particular I think you are right that we need to be spending more time on supporting new EA meet-ups once they have started up.  More generally i think local meet-ups and chapters have a really important role to play in the 'EA funnel'.  They serve as a natural 'next-step' after people have heard about EA and are intrigued by the concept, &quot;interested in EA? Why not meet up with other people in your area talking about it?&quot;.  Chapters and meet-ups also serve as natural launching-off points for other projects like pamphleting or fundraising campaigns.  Also, in Giving What We Can's experience, chapter involvement has played a large part in many people deciding to sign the pledge.  This gives us some reason to think that chapters can play an important role in moving people from being interested in the ideas of EA to acting on them in their life.  For all of these reasons I think that we should be working hard to both create as many chapters and meet-up groups as we can, and provide a system to support and sustain chapters these chapters once they have started out.  Hopefully in the next week or so I will be posting here with concrete a proposal for a volunteer run 'Chapter Growth Team' which can help in this venture!</p>\n", "parentCommentId": null, "user": {"username": "jonathancourtney"}}, {"_id": "yuyKDbLsmC9s4bi2N", "postedAt": "2015-03-26T16:35:44.585Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<p>And there are four different books on effective altruism coming out, at least two of which will be marketed heavily by professionals.</p>\n</blockquote>\n<p>I guess the two that will be marketed heavily by professionals are <a href=\"https://www.netgalley.com/catalog/show/id/60898\">Peter Singer's <em>The Most Good You Can Do</em></a> and <a href=\"http://www.amazon.com/Doing-Good-Better-Effective-Difference/dp/1592409105\">Will MacAskill's <em>Doing Good Better</em></a>, but could you please tell us which the other two books are?</p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "xekZ8ovfSnxCBvxu4", "postedAt": "2015-03-26T18:11:29.326Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>There's also &quot;How to be Great at Doing Good: Why Results are What Count and How Smart Charity Can Change the World&quot; by Nick Cooney and &quot;Strangers Drowning: Grappling with Impossible Idealism, Drastic Choices, and the Overpowering Urge to Help&quot; by Larissa MacFarquhar.</p>\n", "parentCommentId": "yuyKDbLsmC9s4bi2N", "user": {"username": "Peter_Hurford"}}, {"_id": "y8vTC6JggsWGM3Heb", "postedAt": "2015-03-26T22:39:41.380Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "xekZ8ovfSnxCBvxu4", "user": {"username": "Stefan_Schubert"}}, {"_id": "GbTkw96Z69rCL7HkG", "postedAt": "2015-03-27T14:07:44.356Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<p>Is anyone working on adapting this guide to EA startups to supply meetups with a default agenda? This should lower the frictional costs associated with organizers who may have access to a venue not knowing what to do.</p>\n</blockquote>\n<p>This has been done to death, but perhaps under advertised. See the list of various EA chapter guides at\n<a href=\"http://effective-altruism.com/ea/a6/outreaching_effective_altruism_locally_resources/\">http://effective-altruism.com/ea/a6/outreaching_effective_altruism_locally_resources/</a></p>\n", "parentCommentId": "fJExxeLHEcwu4ZLZ9", "user": {"username": "weeatquince"}}, {"_id": "YxiLAMfPc88rnkPD6", "postedAt": "2015-03-27T14:26:34.045Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<p> . . . but very few people with questions . . . </p>\n</blockquote>\n<p>On finding people with questions. If I think I could find people who wanted to talk about EA stuff who should they be put in touch with? Is there a clear contact for this? What if I am fairly sure that the conversation would be of low value?</p>\n<p>As someone who runs an EA chapter if I get messages from people reasonably often. In the past I have offered to meet people to talk about EA stuff one-on-one and have had this offer taken up. I no longer make this offer due to lack of time. But having someone (ideally someone local) who could meet people could help outreach in London.</p>\n", "parentCommentId": "sJ3YWiMS5QhaZrkQG", "user": {"username": "weeatquince"}}, {"_id": "DehnhYZzfJFufmsxh", "postedAt": "2015-03-27T15:53:27.702Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<p>As someone who runs an EA chapter if I get messages from people reasonably often. In the past I have offered to meet people to talk about EA stuff one-on-one and have had this offer taken up. I no longer make this offer due to lack of time. But having someone (ideally someone local) who could meet people could help outreach in London.</p>\n</blockquote>\n<p>This is what I've been setting up for <a href=\"http://effective-altruism.com/ea/ff/creating_a_local_effective_altruist_presence_in/\">the new local presences I've been creating</a>, and for existing EA groups. I'll put contact details for these local people up on the <a href=\"http://effectivealtruismhub.com/groups\">list and map of EA groups</a> soon.</p>\n", "parentCommentId": "YxiLAMfPc88rnkPD6", "user": {"username": "Tom_Ash"}}, {"_id": "449eigoBruFfvsdDq", "postedAt": "2015-03-27T16:29:54.987Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<p>Get engaged on the &quot;small things&quot;\nWe've previously compiled a list of small things people can do.  People's identities are reinforced by taking action, so doing small actions can lead to people doing larger actions in the future.  Moreover, these actions are quite valuable in their own right.\nWe should update the list, think of what more we could add to it, think about how to make it more digestible, and then try to publish it widely (such as prominently on effectivealtruism.org).</p>\n</blockquote>\n<p>I am keen to work on this. I have made a post about it in .impact at\n<a href=\"https://www.facebook.com/groups/dotimpact/permalink/430648037102852/\">https://www.facebook.com/groups/dotimpact/permalink/430648037102852/</a>\nSo if anyone else is keen on helping with this project then feel free to get in touch on facebook or add thoughts to the Hackpad at\n<a href=\"https://impact.hackpad.com/.impact-and-Solving-the-EA-Funnel-hoSefyU3Sti#:h=Step-#2:-Figure-out-the-&quot;small\">https://impact.hackpad.com/.impact-and-Solving-the-EA-Funnel-hoSefyU3Sti#:h=Step-#2:-Figure-out-the-&quot;small</a></p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "oeHp3yhW9AHLGN3vR", "postedAt": "2015-03-28T02:28:53.391Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<p>However, once we have enough small stuff for people to do, we can refer them to finish the small stuff and establish a track record. If someone has done a good job, say, running a fundraiser, than chances are that they'll also do a reasonable job at some other task.  You can build from there.</p>\n</blockquote>\n<p>Peter talked to me about this recently. I think that it's good to get people to do something that's low/zero management overhead first, as a filter. I think running a fundraiser might be too harsh a filter though - significant numbers of promising people won't do that. The other small things don't really provide filters that we can test to see who's promising - so it would be great if we can come up with something that does, though none are springing to mind. I've asked if his suggestion is that they'd tell us about a few of the small things that they've done before we try hooking them up with volunteer opportunities.</p>\n<blockquote>\n<p>Right now, we don't really have that much readily available work to give to those people who are proven. </p>\n</blockquote>\n<p>I don't think this is true, I think there's a shortage of proven volunteers who'll spend reasonable amounts of time.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "8qPeBaQjmTptKqP3L", "postedAt": "2015-03-30T03:48:18.319Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<blockquote>\n<blockquote>\n<p>Right now, we don't really have that much readily available work to give to those people who are proven.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>I don't think this is true, I think there's a shortage of proven volunteers who'll spend reasonable amounts of time.</p>\n</blockquote>\n<p>What kind of work do you have in mind?</p>\n", "parentCommentId": "oeHp3yhW9AHLGN3vR", "user": {"username": "Peter_Hurford"}}, {"_id": "4gjFvofTaB5Hjdfrj", "postedAt": "2015-03-30T17:39:45.246Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>To take just a couple of examples, work on the EA Hub and on local groups.</p>\n", "parentCommentId": "8qPeBaQjmTptKqP3L", "user": {"username": "Tom_Ash"}}, {"_id": "o2eNsy3rbkZndmPaQ", "postedAt": "2015-03-30T19:50:18.383Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>I'm up to help do both of those. Of course, how much I can help with the former will depend on what exactly needs to be done.</p>\n", "parentCommentId": "4gjFvofTaB5Hjdfrj", "user": {"username": "Marcus_A_Davis"}}, {"_id": "sYA5wypn6ZkjS8M45", "postedAt": "2015-03-31T19:20:48.574Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Work on the EA Hub might be good for learning how to program?  I don't know.</p>\n", "parentCommentId": "o2eNsy3rbkZndmPaQ", "user": {"username": "Peter_Hurford"}}, {"_id": "spDSsYTvLriuJtCZf", "postedAt": "2015-03-31T19:21:17.195Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>How much of this work is unskilled?  I think unskilled work is probably best handled by virtual assistants rather than EA volunteering.  What do you think?</p>\n", "parentCommentId": "4gjFvofTaB5Hjdfrj", "user": {"username": "Peter_Hurford"}}, {"_id": "HAPRPhgynZ8jW74gz", "postedAt": "2015-03-31T19:45:25.628Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>There's some of each. I think you're right about VAs, but I don't know if everyone's willing to pay for them.</p>\n", "parentCommentId": "spDSsYTvLriuJtCZf", "user": {"username": "Tom_Ash"}}, {"_id": "wuZchTA8MBmQMSg2M", "postedAt": "2015-04-16T19:08:28.161Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Wasn't one of your suggestions to find small/unskilled work for EA volunteers to do, to see if they're ready for a bigger task? I think it'd defeat the purpose of getting EAs involved in a small way to just hire virtual assistants for unskilled work.</p>\n", "parentCommentId": "spDSsYTvLriuJtCZf", "user": {"username": "Gina_Stuessy"}}, {"_id": "N6yFth3daB96MXoCp", "postedAt": "2015-04-18T18:57:46.839Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>Yep.  Good point, I can definitely see the tension between those two statements and you're correct to point it out.</p>\n<p>That being said, I think I'd prefer VAs over EA volunteers when the task is easy, long, and unskilled, because then skilled EA labor can be used somewhere where it's a better fit that VAs can't do.  This could even include getting and coordinating the VA, which itself does take some work.</p>\n<p>Of course, if it's faster to just use a volunteer, then it could be worth it.  And, I suppose it might be better in the long-run to draw people in via unskilled VA-able tasks if there are no other options.</p>\n", "parentCommentId": "wuZchTA8MBmQMSg2M", "user": {"username": "Peter_Hurford"}}, {"_id": "tNw9njSDoMzEaDJTz", "postedAt": "2015-12-21T12:21:16.756Z", "postId": "C9ocXigPfNndZqn8j", "htmlBody": "<p>I think it's very important to give new members a sense of belonging and importance. We had a new member in our group who had some ideas but didn't get a lot of support from the existing members, and (I believe), dropped off because they weren't being listened to.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDello"}}]