[{"_id": "ocvgyF6B23MojZ5Gu", "postedAt": "2015-05-25T22:17:43.179Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>Strongly agree. I've said before that I think that EA is in many relevant respects not like a &quot;social movement&quot; but also that even within the class of 'social movements' there's so much diversity that we don't gain much (and possibly only mislead outselves) by drawing comparisons to others within the class- and I think you've captured the point neatly here.</p>\n<p>Another way to look at it would be to look again at the formulation that EA is &quot;a philosophy and a social movement.&quot; The philosophy can clearly be pursued through very many different 'movements' or means, and it often obscures more than it reveals to talk about 'the movement' as a whole.</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "XNv7trMZnqr8NurzP", "postedAt": "2015-05-25T23:10:48.430Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>I suspect that I get what you mean by applying the intensional vs. extensional distinction to movements, and it may be something that I’ve argued only a week ago using different terms, but I’m not entirely sure because my brain might be pattern-matching too eagerly.</p>\n<p>Could you give some examples of movements within those classes and why they belong there, so I can better test my understanding? Movements like enlightenment, feminism, animal rights, evidence-based medicine and various other ones that we’re familiar with? Thankies!</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "GHhSCMYWp4RWKm5eL", "postedAt": "2015-05-26T00:56:07.719Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>You have accidentally read the draft version that was automatically published by a reviewer. The section you asked for was precisely what the reviewers were helping me generate. Glad about the convergence! </p>\n", "parentCommentId": "XNv7trMZnqr8NurzP", "user": {"username": "Diego_Caleiro"}}, {"_id": "ETkwqfPXPNKWy7LDr", "postedAt": "2015-05-26T00:57:52.289Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>Hm, I'm not convinced that this distinction carves reality at the joints.  I notice that your examples of &quot;intensional&quot; movements are mostly either ideas/memes or organizations.  I think it's definitely interesting to have a meme level view of EA, or an organization level view.  But I'm also inclined to think that the movement level view also has some predictive value.</p>\n<p>To try to break your dichotomy more explicitly, does the skeptic movement qualify as intensional or extensional?  They seem intensional in the sense that skepticism, in theory, points to a way of looking at the world rather than a predetermined set of conclusions.  But in practice, everyone refers to the skeptic movement as a movement and they seem very movement-like.  It's even possible that skepticism started out as an intension and it eventually became an extensional movement as it grew, with unfortunate results.</p>\n<p>Or take 80K... why is it not an &quot;intension&quot; in the sense that it points to whatever the most effective careers for people to take are?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "KPbz7YjYwW8vKbiZN", "postedAt": "2015-05-26T09:12:55.164Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>EA is special, and your core point about thinking things through from first principles rather than relying on what's happened before is strong. But EA is not that special. Other movements are more strictly defined, but no movement is as strictly defined as your characterisation - to the point where 1-3 and 5 break down. 4 doesn't seem to hold because as John Maxwell IV said  - your other examples of intensional movements don't seem to be that similarly broad or question-based. But great piece otherwise and helpful in clarifying some of the characteristics of EA.</p>\n<p>Your points a-f show the kind of thinking I've been hoping to come across more of.</p>\n<p>Relatedly, if an intensional movement is so important for the long run, durable, and easy to move in to - then why are we finding it so hard to come up with good reference examples for intensional movements?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "a7u24RAsvWdnaoqjY", "postedAt": "2015-05-26T14:30:51.648Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>Indeed! Turns out what I was arguing was something much more specific. Was it that tricky save button again? I’ve fallen for that once too.</p>\n", "parentCommentId": "GHhSCMYWp4RWKm5eL", "user": {"username": "Telofy"}}, {"_id": "zY8pKKBNhwXeoFAbR", "postedAt": "2015-05-26T14:38:19.927Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>I think I would describe the difference you see rather in quantitative than in qualitative terms. There may be greatly fewer maxims someone has to accept to call themselves EA than there are, e.g., in religions, but I can think of two:</p>\n<ol>\n<li>The well-being of other sentient beings is morally relevant.</li>\n<li>There are levels of well-being or groups of beings that are greater or smaller than others.</li>\n</ol>\n<p>I think if someone rejects either of these, they can’t (and won’t want to) call themselves EA. I know several people who would reject #1 at least in some or most circumstances, and I’ve met people who at least claimed to reject #2 (not sure if after reflection).</p>\n<p>This parsimony will hopefully make EA more robust though.</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "Sp5gP8FpE65RLqdPs", "postedAt": "2015-05-26T16:17:09.847Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>I've noticed that what &quot;EA is&quot; seems to vary depending on the audience and, specifically, why it is that the audience is not already on board. For example, if one's objection to EA is that one values local lives over non-local lives, or that effects don't matter (or are trumped by other considerations), then EA is an ethical framework. But many people are on board with the basic ethical precepts but simply don't act in accordance with them. For those people, EA seems to be a support group for rejecting cognitive dissonance. </p>\n", "parentCommentId": "ocvgyF6B23MojZ5Gu", "user": {"username": "mhpage"}}, {"_id": "dB48nXSg7DinFkkhi", "postedAt": "2015-05-26T20:27:05.483Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>I have heard before that a person who currently holds a very high position within the EA movement predicted that it would fail precisely because of this lower level of connection that intensional movements have versus extensional ones. That person sure is glad now that they were wrong. It is much easier to grip an extensional movement to the ground, so to speak. \nEA now has traction, as long as we don't push the breaks, let's use it's momentum.  </p>\n<p>The difficulty of finding intensional movements is related to some cognitive abilities. Science and philosophy took long to evolve though saints, religions and spirits are cheap. I recommend in particular &quot;The prehistory of the mind&quot; by Stephen Mithen to get a grasp of why levels of intentionality are one of the newest characteristics the human mind is able to entertain, and not all human minds are equally good at it.  It is connected to levels of intensionality. </p>\n", "parentCommentId": "KPbz7YjYwW8vKbiZN", "user": {"username": "Diego_Caleiro"}}, {"_id": "8oYMDKGCWBXPndy7e", "postedAt": "2015-05-27T00:19:24.743Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>I wonder if the 'intensionality' generates a deontological framing. I mean, if Paul donates to AMF because he had malaria as an infant and Mary donates to the same charity because she thinks it is effective, then, Paul is not an EA and Mary is, right?</p>\n", "parentCommentId": null, "user": {"username": "celso"}}, {"_id": "PBFnkMRZ5XSHouuce", "postedAt": "2015-05-27T04:52:31.274Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>I think your description of what the skeptic movement possibly is is perfectly accurate, as are the unfortunate results you mention. </p>\n", "parentCommentId": "ETkwqfPXPNKWy7LDr", "user": {"username": "Diego_Caleiro"}}, {"_id": "SCf8kXimC2YPqHANB", "postedAt": "2015-05-27T04:53:41.392Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>Yes, and that is a very smart question! You're right. </p>\n", "parentCommentId": "8oYMDKGCWBXPndy7e", "user": {"username": "Diego_Caleiro"}}, {"_id": "Te6TJneooX55z4ofa", "postedAt": "2015-05-27T10:02:55.075Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>If Paul pushes someone in front of a trolley because it will kill someone and Mary pushes someone in front of a trolley because it will save two people from getting hit, then Paul is not and EA and Mary is. </p>\n<p>Is this a counter example to the 'deontological framing' assertion?</p>\n", "parentCommentId": "SCf8kXimC2YPqHANB", "user": null}, {"_id": "LG366vmY3fSyEgRHG", "postedAt": "2015-05-28T16:59:42.861Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>I'm not sure I got your point... do you mean counter example because it proves it is not deontological or because it proves it is not desirable to be deontological? If you look only the consequences paul and mary actions are the same, they kill one to save two. \nI think it is interesting to think about the practical consequences for the movement of the different approaches. If what matters is only extension it would justify to get adherents no matter what (i don't know, like using strong images, manipulated data...), on the other hand, from an intensional point of view you want adherents that get the point reasonably enough to push it further. \nMaybe we also need a distinction between adherents that are only interested in knowing good charities to donate to, and those who are willing to push the ideas further</p>\n", "parentCommentId": "Te6TJneooX55z4ofa", "user": {"username": "celso"}}, {"_id": "iBj49jpKJcXYCrDXD", "postedAt": "2015-05-29T10:25:43.294Z", "postId": "c9QshT3wesPwTchDa", "htmlBody": "<p>Sorry, I wrote that comment carelessly! I wanted to look into whether the framing is actually deontological.</p>\n<p>In your example, they both had the same ends (donating to AMF) and different means (having malaria as a kid or trying to be effective). If I'm correct, you were saying that because it was the means that distinguished the two cases, deontological framing was being used.</p>\n<p>But in my example, they both had the same means (pushing someone in front of a trolley) to get to different ends ('saving' one life or killing one life). And in this case, it was the ends that distinguished them. So I was wondering if deontological framing was actually being used.</p>\n", "parentCommentId": "LG366vmY3fSyEgRHG", "user": null}]