[{"_id": "5ctkJxPFXjXhW3YzK", "postedAt": "2023-09-28T13:33:53.226Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>I totally agree with this. But while disappointment is sad, the &nbsp;the global ennui of our times is even worse. I hope you soon resume the pursuit of your own happiness, with the feeling of fulfilled duty.&nbsp;</p><p>I lack something in EA: what about being a farmer, a nurse or a policeman? As utilitarians, there shall be a message for the ample majority of the people, that shall do the \"manteinance\" work of civilization. For the majority of people, the main message of utilitarianism shall be to find private happiness (in non extractive ways). &nbsp;And in any case you never know when a \"disproportionate impact\" opportunity can arrive to your life.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "BuT8DG7QtbDoQTDHr", "postedAt": "2023-09-28T14:16:23.469Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>Yeah… I've been part of another community where a few hundred people were scammed out of some $500+ and left stranded in Nevada. (Well, Las Vegas, but Nevada sounds more dramatic.) Hundreds of other people in the community spang into action within hours, donated and coordinated donation efforts, and helped the others at least get back home.</p><p>Only Nonlinear attempted something similar in the EA community. (But I condemn exploitative treatment of employees of course!) Open Phil picked up an AI safety prize contest, and I might miss a few cases. I was very disappointed by how little of this sort happened. Then again I could've tried to start such an effort myself. I don't have the network, so I'm pretty sure I would've failed. I was also in bed with Covid for the first month.&nbsp;</p><p>I suppose it really makes more sense to model EA not as a community but as a scientific discipline. I have a degree in CS, but I wasn't disappointed that the CS community didn't support their own after the FTX collapse because I never had the expectation that that is something that could happen. EA seems to me is better understood within that reference class. (Unfortunately – not because there's something wrong with scientific disciplines but because I would've loved to be part of a real community too.)</p>", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "Yj5KBYvBoP2REEEqD", "postedAt": "2023-09-28T14:43:10.812Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<blockquote>\n<p>I've been part of another community where a few hundred people were scammed out of some $500+ and left stranded in Nevada. (Well, Las Vegas, but Nevada sounds more dramatic.) Hundreds of other people in the community spang into action within hours, donated and coordinated donation efforts, and helped the others at least get back home.</p>\n</blockquote>\n<p>I think if this happened with, say, a conference you would see this kind of response within EA. A group of people stuck in a specific place is very different from the FTX collapse.</p>\n", "parentCommentId": "BuT8DG7QtbDoQTDHr", "user": {"username": "Jeff_Kaufman"}}, {"_id": "dGtF3JpWD5FDmTKit", "postedAt": "2023-09-28T20:35:26.039Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>openphil did some lost wages stuff after FTXsplosion, but I think evaluated case by case and some people may have been left behind.&nbsp;</p>", "parentCommentId": "BuT8DG7QtbDoQTDHr", "user": {"username": "quinn"}}, {"_id": "DaYWKN8oNJR98zHXy", "postedAt": "2023-09-28T21:39:31.875Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>What do you feel like the community could best do for you going forward?</p>\n", "parentCommentId": null, "user": {"username": "tswizzle96"}}, {"_id": "skJ4AC2F6Jzg4ZuZW", "postedAt": "2023-09-29T03:52:09.668Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>There was a supportive response, to some degree, in the wake of FTX:</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/BesfLENShzSMeb7Xi/community-support-given-ftx-situation\">https://forum.effectivealtruism.org/posts/BesfLENShzSMeb7Xi/community-support-given-ftx-situation</a></p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/7PqmnrBhSX4yCyMCk/effective-peer-support-network-in-ftx-crisis-update\">https://forum.effectivealtruism.org/posts/7PqmnrBhSX4yCyMCk/effective-peer-support-network-in-ftx-crisis-update</a></p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/gbjxQuEhjAYsgWz8T/a-job-matching-service-for-affected-ftxff-grantees\">https://forum.effectivealtruism.org/posts/gbjxQuEhjAYsgWz8T/a-job-matching-service-for-affected-ftxff-grantees</a></p>\n<p>Maybe now is a good time to review that response and figure out what could've been done better.  For example, maybe some person or organization could've made a point of reaching out individually to each and every FTX grantee.</p>\n<hr>\n<p>For me, the OP resonates well beyond just the FTX stuff though.  There's an element of making personal sacrifices for the greater good that exists in EA, which doesn't exist in the same way for an academic discipline.  I myself found the lack of supportiveness in EA very alienating, and it's a major reason why I'm not very involved these days.</p>\n<p>One idea is something like a \"<a href=\"https://forum.effectivealtruism.org/posts/4TJpwmGmdgv7R6nGZ/basefund-has-entered-its-trial-phase-1\">Basefund</a> for mental health\", to provide free or low-cost therapy for EAs -- possibly group therapy.  EAs have already made the argument that mental health could be an effective cause area.  If that's true, \"mental health for EAs\" could be a doubly effective cause area.  Beyond the first-order benefit of improving someone's mental health, you can improve someone's mental health in a way that enables them to do good.</p>\n", "parentCommentId": "BuT8DG7QtbDoQTDHr", "user": {"username": "chinscratch"}}, {"_id": "7sTbigGyvjgbxAFcy", "postedAt": "2023-09-29T09:00:39.456Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>Thank you for reaching out and asking how the community can support me during this time. Your consideration means a lot, especially given the challenging journey I've been on.</p><p>The aftermath of my funder's collapse took a significant toll on me. Despite the well-intentioned promises of assistance for those impacted,<strong> I felt ghosted and unsupported</strong>. I've now returned to my home country, where I'm navigating a very different set of challenges. Currently, I'm attempting to reinvent myself professionally in a place that feels very removed from the epicenters of EA.</p><p>My background, which is humble and without a traditional support system, makes my situation even more precarious. The decision to leave a stable job for the promise of making a meaningful impact has had profound consequences. This choice left me with a strong reluctance to re-enter the traditional workforce, even if my skills are clearly valuable and rare, a sentiment only intensified by my ongoing battle with major depression.</p><p>While I value the emotional and social support from the EA community, I also recognize the inherent differences in our day-to-day experiences. The juxtaposition of my current challenges against the backdrop of peers who may be in more favorable situations abroad underscores the solitude of my journey.</p><p>The only tangible way the community could assist is by <strong>contributing towards some of the expenses</strong> I'm currently shouldering, for example, therapy. The sessions are a significant outlay, but they're essential for my well-being, especially as I anticipate continuing them for a while.</p><p>Another area of potential support could be in the form of pro-bono <strong>mentorship</strong> or <strong>guidance</strong> as I try to reinvent my career as a freelancer/entrepreneur.</p><p>Ultimately, while the past cannot be changed, and the challenges are real, the act of reaching out and showing genuine concern provides a measure of comfort. I'm unsure if anything could significantly alter my emotional state right now, but the interest is nonetheless appreciated.</p>", "parentCommentId": "DaYWKN8oNJR98zHXy", "user": {"username": "IReallyWantToBeAnonimous"}}, {"_id": "dRtd5PXH2LdAfJTGb", "postedAt": "2023-09-29T10:36:09.211Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>Anytime, I want this to be a community that cares not just for the productive contributors, but also for others who've come in and out of involvement.&nbsp;</p><p>I know this doesn't help with anything financial, but the only thing I can tell you without knowing more is that maybe making non-EA friends could be a point of focus for you right now. Potentially away from family and absent other support structures, it might help you dig yourself out a bit. This may be obvious (and non-helpful if what you need is the how and not the what) but I mention it because I've a feeling of trying to right yourself first before you go out and try to build that structure a couple of times before, where I think having others around for help and care could really be invaluable.&nbsp;</p><p>Sadly can't offer any financial help myself, but <a href=\"https://calendly.com/tswizzle96\">happy to talk</a> sometime if you'd like!</p>", "parentCommentId": "7sTbigGyvjgbxAFcy", "user": {"username": "tswizzle96"}}, {"_id": "oYKypxiyDkTyABf5A", "postedAt": "2023-09-29T12:58:18.254Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>Oh true! I was only thinking of financial support for struggling projects and project developers, but those kinds of support are also super valuable!</p><p>Rethink Wellbeing is definitely on board with mental health for EAs being an important cause area.&nbsp;</p><p>I don't think personal identity makes too much sense, so preventing the extinction of EA-related values (or maybe even some wider set of prosocial, procivilizational values) could be an underexplored cause area. Some sort of EA crisis fund could be a way to achieve that, but also archival of important insights and such.</p>", "parentCommentId": "skJ4AC2F6Jzg4ZuZW", "user": {"username": "Telofy"}}, {"_id": "owMB2nu7n7cBsLENC", "postedAt": "2023-09-29T14:43:23.209Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<blockquote><p>I felt deserted by the very community I'd given so much to. Nobody reached out; nobody seemed to care. It was a profound isolation I had never anticipated.</p></blockquote><p>I've felt that too. I didn't have the exact same scenario of losing funding; I lost a job. I hadn't yet built a support network, and without the income from that job I couldn't afford to live in <i>big expensive city</i>. Former colleagues who had previously been friendly never contacted me again; they never said \"hey, I saw this job posting that I think you would be good for.\" People I had interacted with at EA social events didn't contact me. People who had reached out to me for one-on-ones at conferences no longer did so. I assume that they only reached out to me previously because I was associated with a prestigious institution, which made me feel used as a means to an end rather than as an end in myself.</p><p>It makes me think about \"Diversity is being invited to the party; inclusion is being asked to dance.\" There were plenty of \"parties\" that I was able to access (conferences, Slack workspaces, chat groups), but I wasn't \"asked to dance.\"</p><p>What I perceive as the lack of welcomingness has made me pretty sad at times.</p><p>Sending you virtual hugs.</p>", "parentCommentId": null, "user": {"username": "Anonymous EA Forum user"}}, {"_id": "TCqTos2fEd3iytwy2", "postedAt": "2023-09-29T18:59:55.311Z", "postId": "c9vt7SPeCCiC76cMC", "htmlBody": "<p>A quick and impulsive comment.<br><br>I am very sorry that this happened to you. I had a somewhat similar experience of disillusion and depression a few years ago. I eventually realised that it was because my life was deeply imbalanced at that time: I focused on and valued work too much and I didn't prioritise my wellbeing and happiness sufficiently.&nbsp;<br><br>Five years later, I feel happier and more productive that I have ever been. I now feel that I needed my burnout to see the error of my ways and develop a better mentality and lifestyle (although I wish it were not the case). I hope that this event will eventually have a similarly positive outcome for you (although I recognise that it may not). I wish you all the best regardless.&nbsp;<br><br>I will also mention that I do think that many EAs could often do more to care for and look out for each other.&nbsp;</p><p>I definitely felt for sometime that if I were not impactful for some reason, like poor mental health, no-one would take much if any time to look out for me. I worried that it wouldn't seem high value enough for my colleagues who already had so much important work to do. I don't feel this way about my friends in community now, which makes me feel much better.&nbsp;</p><p>I think that having a strong sense of social support and security is probably more important than many people in the community realise. It is hard to work comfortably with people if you feel that their care for you is (nearly) entirely conditional on you sharing their values and delivering 'impact'. It is also easy to mistake that sort of collaboration for friendship and I think that this is a common mistake.</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}]