[{"_id": "F9EntcpeFBBSLB36w", "postedAt": "2022-10-27T07:44:29.142Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>These areas all seem well-identified, but the essential problem is that EA doesn't have near the sufficient talent for top priority causes already.&nbsp;</p>", "parentCommentId": null, "user": {"username": "burner"}}, {"_id": "XrqrhYSqraZrHFmnh", "postedAt": "2022-10-27T07:55:37.917Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>I was also confused about why no one has written something more extensive on nanotech.  My guess would be that, it might be rather hard to have a catastrophe 'by accident' as the <a href=\"https://en.wikipedia.org/wiki/Gray_goo\">gray goo</a> failure mode is rather obviously undesirable. From the Wikipedia article on gray goo I gathered that Erik Drexler thinks it's totally possible to develop safe nanotechnology. That distinguishes it from AI which <a href=\"https://www.fhi.ox.ac.uk/team/eric-drexler/\">he seems to have shifted his focus to</a>. See also this <a href=\"https://files.givewell.org/files/conversations/Eric%20Drexler%2010-08-14%20(public).pdf?fbclid=IwAR2MNbno4Os_J9ZqhycNNTsHkhe4kO0dN-PEjki3XQvzMSemBWl4itFLwBs\">report</a>, I found through <a href=\"https://forum.effectivealtruism.org/posts/gzj9Np8WWpKgCJgiW/is-nanotechnology-such-as-apm-important-for-eas-to-work-on\">this question</a></p>\n", "parentCommentId": null, "user": {"username": "Morpheus"}}, {"_id": "u93zHyzELjZrrTe5t", "postedAt": "2022-10-27T08:06:17.989Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<blockquote>\n<p>This might come as the biggest surprise to be on the list. After all, space exploration is expensive and difficult. But there are very few out there who are actually working on how to change humanity from being a Single Point of Failure System. If we are serious about longtermism and truly decreasing x-risk, this might be one of the most crucial achievements needed. Any x-risk is most likely greatly reduced by this, even perhaps AGI*.  The sooner this process begins, the greater the reduction in risk, since this will be a very slow process.</p>\n</blockquote>\n<p>Seems not everyone <a href=\"https://www.youtube.com/watch?v=fVrUNuADkHI\">agrees with you that this is hard</a>. See also <a href=\"http://www.truevaluemetrics.org/DBpdfs/Ideas/Oxford/FHI-Future-Shock-intergalactic-spreading.pdf\">the paper</a> if video is not your thing.</p>\n", "parentCommentId": null, "user": {"username": "Morpheus"}}, {"_id": "iEx7mqmKvaWSEjYzP", "postedAt": "2022-10-27T08:19:38.586Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<blockquote>\n<p>I do not see the difference in those dying of other causes also being a tragedy. Even if you do believe extending the human lifespan is not important, consider the alternative case where you’re wrong.</p>\n</blockquote>\n<p>I think most EAs would agree that death is bad. The important question would be how tractable life expansion is.</p>\n<blockquote>\n<p>This is related to Life Extension, but even more neglected, and probably even more impactful. The number of people actually working on cryonics to improve human minds is easily below 100. A key advancement from one individual in research, technology, or organizational improvement could likely have enormous impact. The reason for doing this goes back to the idea of irrecoverable loss of sentient minds. As with life extension, if you do not believe cryonics to be important or even possible, consider the alternative where you’re wrong. If one day we do manage to bring people back  from suspended animation, I believe humanity will weep for all those that were needlessly thrown in the dirt or the fire: for they are the ones there is no hope for, an irreversible tragedy. The main reason why I think this isn’t being worked on more is because it is even \"weirder\" than most EA causes, despite making a good deal of sense.</p>\n</blockquote>\n<p>Not sure if I can speak for everyone here, but personally I am not optimistic enough about AI to focus on cryo. Also, the limiting factor for cryonics seems to be more it's weirdness rather than research? The technology exists. The costs are probably only going down if more people sign up, right?</p>\n", "parentCommentId": null, "user": {"username": "Morpheus"}}, {"_id": "rYCPb5k8NhJKiMruL", "postedAt": "2022-10-27T09:29:42.530Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>\"Also, the limiting factor for cryonics seems to be more it's weirdness rather than research?\"</p><p>&nbsp;</p><p>Not really. The perfusion techniques haven't really updated in decades. And the standby teams to actually perform preservation in the event of an accident are extremely spread out and limited. I think some new organizations need to breath life back into cryonics, with clear benchmarks for standards they hope to achieve over a certain timeline. I think Tomorrow Biostasis is doing the kind of thing I'm speaking of, but would love to see more organizations like them.</p>", "parentCommentId": "iEx7mqmKvaWSEjYzP", "user": {"username": "Akmon Ra"}}, {"_id": "HtecsEGFre4tTF6WA", "postedAt": "2022-10-27T09:37:48.753Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>My guess a big reason is there doesn't really seem to be any framework to go about working on it, except perhaps on the policy side. Testing out various forms of nanotechnology to see if they're dangerous might be very bad. Even hypothetically doing that might create information hazards. I imagine we would have to see a few daring EAs blaze the trail for others to follow in. There's also the obvious skill and knowledge gap. You can't easily jump into something like nanotech the way you could for something like animal welfare.</p>", "parentCommentId": "XrqrhYSqraZrHFmnh", "user": {"username": "Akmon Ra"}}, {"_id": "nrbfoynGLdSkjZ2oz", "postedAt": "2022-10-27T10:26:47.780Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<blockquote>\n<p>Not really. The perfusion techniques haven't really updated in decades.</p>\n</blockquote>\n<p>Honestly, not knowledgeable enough to know how much of a qualitative difference that makes (eg. how much does that increase your expected value of future you?).</p>\n<p>They might also improve the process somewhat, but at the current scope, the impact is very limited as long as there is like less than (~10,000?) (just a ballpark, not looking up actual number) people signed up, and the whole thing costs ~50,000$ if you are getting it real cheap. Like, I also have extended family members that are close to dying, but I am not close enough to them to convince them that this could be a good idea and the cost is a real issue for 99% of the population (Maybe more could save the money in their bank account, but can they reason through the decision?). I honestly think that there are lots of people who would sign up for cryonics if given more capacity/time to think for themselves, but it's hard enough to get people to invest their money for future self in the same lifetime.</p>\n<blockquote>\n<p>I think Tomorrow Biostasis is doing the kind of thing I'm speaking of, but would love to see more organizations like them.</p>\n</blockquote>\n<p>Yeah, I had a call with them as I was not sure whether I would want to sign up or not, and it seems they are doing a great job at making the process way less painfull and weird. Not sure about the exact numbers anymore, but I remember that they expect to outgrow Alcor in a few years (or have they already?).  I would really question whether there is room for lots of more cryo organizations if the public perception of them does not change, and I would definitely question whether it would be the best thing to pursue on longtermist grounds (rather than selfish (totally reasonable) grounds). I still recommend friends of mine to look into cryonics, but only because I care about them, if they care about helping other people I'd recommend other things.</p>\n", "parentCommentId": "rYCPb5k8NhJKiMruL", "user": {"username": "Morpheus"}}, {"_id": "n9ejt9LZaHndX2HAm", "postedAt": "2022-10-27T12:32:02.340Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>\"The main reason why I think this isn’t being worked on more is because it is even \"weirder\" than most EA causes, despite making&nbsp;<a href=\"https://waitbutwhy.com/2016/03/cryonics.html\"><u>a good deal of sense</u></a>.\"</p><p>I don't think that is true. This was previously discussed <a href=\"https://forum.effectivealtruism.org/posts/jd4ycHq8aqFgJGvkY/is-there-a-hedonistic-utilitarian-case-for-cryonics-discuss\">here</a>. It's very hard to argue that preserving existing lives through cryonics is more cost-effective than creating new lives if you have a totalist view of population ethics. And even if you have a person-affecting view of population ethics it's not clear how cryonics is more cost-effective than AI safety.</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "qzKD7qiMSzjrunoyw", "postedAt": "2022-10-27T12:46:51.924Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>Is it actually more cost effective, though? Someone in suspended animation does not eat or consume resources. Unless you mean sometime in the future, but in that future we don't know what resource constraints will actually be, and we don't know what we will value most. Preventing irrecoverable loss of sentient minds still seems like a wiser thing to do, given this uncertainty. As for AI Safety, I think we're facing a talent deficit much more than a financial deficit right now. I'm not sure how much adding, say, 5 more million to the cause will really change at this time.</p>", "parentCommentId": "n9ejt9LZaHndX2HAm", "user": {"username": "Akmon Ra"}}, {"_id": "vDLhMrA48QnWdEHmX", "postedAt": "2022-10-27T13:32:55.637Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>Arden here from 80k -- just wanted to note the figures you cite are from a survey and were not 80k's overall views.</p>\n<p>Our articles put AI risk closer to 10% (<a href=\"https://80000hours.org/problem-profiles/artificial-intelligence/\">https://80000hours.org/problem-profiles/artificial-intelligence/</a>) and nano much lower though we don't try to estimate it numerically (we have a mini writeup here <a href=\"https://80000hours.org/problem-profiles/atomically-precise-manufacturing/\">https://80000hours.org/problem-profiles/atomically-precise-manufacturing/</a>)</p>\n<p>seems like we should update that article anyway though. thanks for drawing my attention to it</p>\n", "parentCommentId": null, "user": {"username": "Ardenlk"}}, {"_id": "ucZqEBSNJ6bkAZQGR", "postedAt": "2022-10-27T13:58:32.662Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>For a successful cryopreservation, you need facilities for storage, liquid nitrogen and staff overseeing the operation. All that costs money. <a href=\"https://www.gwern.net/plastination\">Plastination</a> alleviates some of those costs, and <a href=\"https://www.lesswrong.com/posts/WbbuyfoGE3d4Zadhv/cryonics-wants-to-be-big\">economies of scale</a> would also apply.</p>\n<p>And cryonics is <em>expensive</em>: The cryoprotectants currently used alone are nothing to sneer at.</p>\n<blockquote>\n<ol start=\"3\">\n<li>The perfusate has a shelf life of several years when stored in an ordinary refrigerator. Alcor’s purchase price for the ingredients in all 10 2-liter bags of perfusate, including M22, is ~$1,500. The concentration of M22 increases by a factor of 1.67 between bags, except that the last 3 bags have the same terminal concentration. While 10 bags is sufficient to achieve the desired terminal jugular cryoprotectant concentration, 16 bags were prepared for the initial trial (the final 9 bags having the same terminal concentration) to ensure that enough bags were available to achieve terminal jugular cryoprotectant concentration.</li>\n</ol>\n</blockquote>\n<p><em>—<a href=\"https://www.alcor.org/library/cryopreserving-everyone/\">A Big Hairy Audacious Goal for Cryonics</a>, Ralph Merkle, 2014</em></p>\n", "parentCommentId": "qzKD7qiMSzjrunoyw", "user": {"username": "niplav"}}, {"_id": "24jLubmLEHq4MvL9H", "postedAt": "2022-10-27T14:02:31.415Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>There's an interesting tension showing itself with the potential areas you point to: Two out of the five are mostly not public goods, and EA has traditionally focused on supplying public goods.</p>\n<p>Both life extension and cryonics should be very much in everybody's interest assuming that most people want to live longer and healthier—so if they aren't, they are either very irrational (possible) or it's just not in their interest.</p>\n", "parentCommentId": null, "user": {"username": "niplav"}}, {"_id": "byxFh3Hp8bpxEorsa", "postedAt": "2022-10-28T04:45:39.927Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>Thanks! I'll update to correct this.</p>", "parentCommentId": "vDLhMrA48QnWdEHmX", "user": {"username": "Akmon Ra"}}, {"_id": "BAYvmDdo49or9kptu", "postedAt": "2023-05-26T03:23:31.874Z", "postId": "cA9QLEyu2bRnsEPNM", "htmlBody": "<p>This is such a breath of fresh air. Make EA weirder!</p>", "parentCommentId": null, "user": {"username": "EcologyInterventions"}}]