[{"_id": "LtN4tEsaGXCjyYtzw", "postedAt": "2024-03-27T15:15:11.634Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Glad to hear it!&nbsp;</p><p>I've been working on a meta-analysis of \"what works best for reducing consumption of meat and animal products (MAP)\" -- first <a href=\"https://forum.effectivealtruism.org/posts/k9qqGZtmWz3x4yaaA/environmental-and-health-appeals-are-the-most-effective\">draft here</a>, in-progress version <a href=\"https://github.com/setgree/vegan-meta\">here</a>. &nbsp;I've been coming to the conclusion that in terms of consumer-side interventions, we have a much better handle on how to reduce red and processed meat consumption (RPMC) that MAP consumption overall, and that much of the change in RPMC is probably being driven by inter-MAP substitution. This might be good for health and the environment but terrible for animal welfare , and I think this problem is generally under-appreciated by researchers and funders (though my co-author Maya Mathur touches on the subject <a href=\"https://www.science.org/doi/abs/10.1126/science.abo2535\">here</a>).&nbsp;</p><p>So anyway I'm glad to hear AIM is putting time and energy into this, because I think among potential funders, AIM is a lot more likely to be sensitive to this important tradeoff.</p>", "parentCommentId": null, "user": {"username": "setgree"}}, {"_id": "6rGxLDYxiAamb5kz9", "postedAt": "2024-03-27T17:42:45.371Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>(posting anonymously due to working closely with some CE groups)</p><p>I like CE a lot, and think that some of their charities are great. I donate to multiple CE charities (including one animal welfare charity). I appreciate their ambition and think that what they do is very difficult, and they've had a lot of success in the face of that difficulty.<br><br>However, I'm very concerned about their work in the animal welfare space, and wanted to flag some of these concerns if they are considering expanding in this space. I don't think donors should take much guidance from them, compared to OpenPhil or the EA Animal Welfare Fund, and I would personally wager that CE leading giving in the animal space would be net-negative for the space compared to the status quo (which, to be fair, is very bad already). These comments are pretty light on a serious topic, but I want to flag them to donors considering joining this funding circle. These are one person's impressions, and I'd encourage people considering joining these projects look into this more.<br><br>Concerns:<br>1. CE's research on animal welfare is extremely low quality</p><ul><li>There is a widely held view in the animal research community that CE's reports on animal welfare consistently contain serious factual errors, and their research is broadly not trusted by others in the space. My personal experience with this was reading a report I was an expert on, noticing immediately that it had multiple major errors, sharing that feedback, and having it ignored due to their internal time capping practices.</li><li>Another animal advocacy research organization supposedly found CE plagiarizing their work extensively including in published reports, and CE failed to address this.</li></ul><p>2. CE's charities working on animal welfare have mostly not been very good, and listening to external feedback prior to launching them would have told them this would happen.<br><br>Here are some very light evaluations of CE's animal charities:</p><ul><li>Current CE incubated animal charities<ul><li>Shrimp Welfare Project: Very promising, doesn't do CE's original proposed idea anymore, rough impression is that more feedback ahead of time would have told them the original idea was bad.&nbsp;</li><li>Animal Advocacy Careers: Okay, but not a super promising/scalable intervention, still does CE's original proposed idea</li><li>Fish Welfare Initiative: Hasn't worked very well, and seemed like it wouldn't in advance, doesn't do CE's original proposed idea anymore, more feedback ahead of time would have told them not to do the original idea</li><li>Animal Ask: Was a bad idea prior to launching, hasn't had much impact, people in the space were skeptical ahead of launch</li><li>Healthier Hens: Was a bad idea prior to launching, hasn't had much impact, people in the space were skeptical ahead of launch</li><li>Animal Policy International: Was a bad idea prior to launching, too short a time has elapsed to assess</li></ul></li></ul><p>Incubating charities is difficult, and CE definitely shouldn't expect 100% to work out. I think 1.25 charity out of 6 being good is still a quite solid success rate. But, most of these charities seemed like bad ideas to many other people in the space prior to launching, CE was given that feedback, and seemed to fail to act on it. This is also the case with their most recent batch of charities that haven't yet launched. CE is typically much more confident in their own research than external feedback, which seems bad given concern 1.</p><p><br>3. CE is fairly hostile to external feedback on their animal welfare work</p><ul><li>CE has a fairly strong reputation of being hostile / non-collaborative in the animal welfare space. While their charities and founders tend to be very open to feedback and willing to work with others, CE itself has consistently been non-collaborative to other groups in the space to the degree that their staff are sometimes not invited to coordination events or meetings.</li></ul>", "parentCommentId": null, "user": {"username": "mildlyanonymous"}}, {"_id": "XxrnhxzQ4sWT4jA5s", "postedAt": "2024-03-27T18:54:33.133Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>First a meta note less directly connected to the response:</p><p>Our funding circles fund a lot of different groups, and there is no joint pot, so it's closer to a moderated discussion about a given cause area than CE/AIM making granting calls. We are not looking for people to donate to us or our charities, and as far as I understand, OpenPhil and AWF do not have a participatory way to get involved other than just donating to their joint pot directly. This request is more aimed at people who want to put in significant personal time to making decisions independent from existing funding actors.<br>&nbsp;</p><p>More connected response:</p><p>Thanks for the thoughts, and the support you have given our past charities. I can give a few quick comments on this. Our research team might also respond a bit more deeply.</p><p>&nbsp;</p><p>1) Research quality: I think in general, our research is pretty unusual in that we are quite willing to publish research that has a fairly limited number of hours put into it. Partly, this is due to our research not being aimed at external actors (e.g., convincing funders, the broader animal movement, other orgs) as much as aimed at people already fairly convinced on founding a charity and aimed at a quite specific question of what would be the best org to found. We do take an approach that is more accepting of errors, particularly ones that do not affect endline decisions connected directly to founding a charity. E.g., For starting a charity on fish in a given country, we are not really concerned about the number of fish farmed unless that number is significant determining factor in terms of founding a charity in that space. We have gone back and forth as to how much transparency to have on research and how much time to spend per report and have not come to a fixed answer. We are more likely to get criticism/pushback on higher transparency + lower hours per report but typically think it will still lead to more charities that are promising in the end.<br>&nbsp;</p><p>2) CE’s animal charity quality: I think both our ordering and assessment of charity quality would be different from what is described here. I also think animal welfare funds and Open Phil's (both of who have funded the majority of these projects) assessments would also not match your description. However, in some ways, these are small differences as our general estimate is that 2/5 charities in a given area are highly promising. It is quite a hits-based game, and that is the number we would expect (and would rank internally) about how many charities are performing really well.<br>&nbsp;</p><p>2.5) Feedback on animal charities: I did a quick review of charities that got the most positive vs negative feedback at the time of idea recommendation from the broader animal community relative to your rank order and relative to our internal one and did not find a correlation. Generally, I think the space is pretty uncertain and thus the charity that got the most positive expectations were typically the charities that deviated the smallest amount from other actions already taken in the space. I think that putting more time into the research reports (including getting more feedback) is one way to improve charity quality (at the cost of quantity) but I'm pretty skeptical it's the best way. So far, the biggest predictive factor has not been idea strength but the founder team, so when thinking about where to spend marginal resources to improve charities, I would still lean that way (although it's far from clear if that will always be the case).<br>&nbsp;</p><p>3) I would be interested in doing a survey on this to get better data. I get the impression that we are seen as pretty disconnected from the animal space (and I think that is fairly true). I think we are far more involved in e.g., the EA space both when it comes to more formal research and when it comes to softer social engagement. I think our charities tend to go deeper into whatever area they are focusing on than our team does, and I am pretty comfortable with that. I would not be surprised if we both were invited less and attended less coordination events and meetings connected to the animal space; we like to stay focused quite directly on the problems we are working on.<br>&nbsp;</p><p>Thanks again for writing this up. I put some chance that these are issues that are correct and important enough to prioritize, and it's valuable to get pushback and flags even if we end up disagreeing about the actions to take.</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "Joey"}}, {"_id": "ayuEmec7GDKMeFwRj", "postedAt": "2024-03-27T19:45:56.845Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Thanks for sharing your thoughts! I feel like your comment would be more valuable/credible if you elaborated further on your claims. You say the ideas for the animal charities were bad, but you provide no justification, and most of them not succeeding should not update one much given charities being successful is unlikely on priors.</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "vascoamaralgrilo"}}, {"_id": "kSdgsaNdzvJzAk9sQ", "postedAt": "2024-03-27T20:43:40.067Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<blockquote><p>I don't think donors should take much guidance from them, compared to OpenPhil or the EA Animal Welfare Fund, and I would personally wager that CE leading giving in the animal space would be net-negative for the space compared to the status quo (which, to be fair, is very bad already).</p></blockquote><p>&nbsp;</p><p>If you had total control over all donations in the EA animal space, how would you change things compared to the status quo?</p><p>For the main point of your argument, I echo Vasco Grilo's point that your critiques of specific would be more compelling with justification or sources backing up your views. For any given charity idea, I have no reason to think that the fact that somebody on the internet thinks it's a bad idea prior to launch correlates with that idea actually being bad. Every new idea has people who are sceptical of it - that doesn't provide much information one way or the other. I'd be more interested to see a detailed evaluation of each charity in terms of actual impact they may have (or have not) delivered. I can only speak for my experience at Animal Ask, but a couple of recent, detailed evaluations do exist, and we invest a great deal of energy into critically evaluating our own work (and having it evaluated by others).</p><p>(<i>As always, my views are my own, not those of my employer.</i>)</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "Ren Springlea"}}, {"_id": "RzPHMpF93kqeCWbzR", "postedAt": "2024-03-27T20:43:40.640Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>I'm mainly trying to convey what seemed to be a sentiment among many who worked in research in animal advocacy in response to seeing these ideas, though I agree with your second point.</p><p>As an example of this, I think that people thought Animal Ask or Healthier Hens both failed account for why the animal space had consolidated work on a few specific asks over the last few years (because corporations weren't sure how to prioritize across many asks, and focusing on just one at a time helped get their attention to be more focused), and this was feedback conveyed to CE ahead of time but mostly ignored, and then became a route to failure for their early work.</p>", "parentCommentId": "ayuEmec7GDKMeFwRj", "user": {"username": "mildlyanonymous"}}, {"_id": "42XBQDwywWAue6SGb", "postedAt": "2024-03-27T20:52:51.557Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<ol><li>It would be helpful if you engaged with the plagiarism claims, because it is concerning that CE is running researcher training programs while failing to handle that well. I agree with the rest of what you say here as being tricky, but think that it is pretty bad that you publish the low confidence research publicly, and it's led to confusion in the animal space.</li><li>+ 2.5 - I think if your ordering is significantly different, it's probably fairly different than most people in the space, so that's somewhat surprising/an indicator that lots of feedback isn't reaching you all.</li><li>To be clear, I am certain that CE staff have not been invited to events in the animal welfare space due to impressions of your organization being unwilling to be cooperative.<br>&nbsp;</li></ol><p>My main view is that animal donors should seriously engage in a vetting process prior to taking large amounts of guidance on donations from CE / shouldn't update on your research in meaningful ways. I still think CE is probably the best bet in the animal space for future new very high impact organizations in the space as well though, so it's a tricky balance to critique CE. I'd bet that a fair number of the best giving opportunities in the animal space in 5 years will have come out of CE, but that it'll also have come with a large amount of generally avoidable wastes of funding and talent.</p>", "parentCommentId": "XxrnhxzQ4sWT4jA5s", "user": {"username": "mildlyanonymous"}}, {"_id": "isFe8iZkXwuzKrgzM", "postedAt": "2024-03-27T21:02:25.262Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>I agree that detailed evaluations would be better than my narrative impressions. My main point is to warn people to do way more due diligence on CE. Even if the reputation is undeserved, the organization has a negative reputation among many in animal advocacy, especially in research and grant evaluation, and that is worth looking into.<br><br>I don't really have strong views on how to allocate funds in the animal space, but I doubt it is through funding circles, which usually seem worse for charities even if they are better for donors and the space overall (e.g. the degree of dislike that charities have for the existing Farmed Animal Funders circle seems like an indicator of something important).</p>", "parentCommentId": "kSdgsaNdzvJzAk9sQ", "user": {"username": "mildlyanonymous"}}, {"_id": "haxZXBJX88LLf3aBP", "postedAt": "2024-03-27T21:04:59.333Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Hi mildlyanonymous. I work on the philanthropy programs at AIM. One thing to keep in mind here is that the Foundation Program and funding circles are distinct from the Incubation Program. We never tell any funder where to donate, all funding decisions are independently-made, and if you look at past funding circle updates (Meta, Mental Health), most grantees are not CE incubatees. Having worked on several funding circles, I am a huge believer that communities of grantmakers can have outsized impact compared to working alone. While I myself am a fan of CE's animal research and incubatees, this disagreement doesn't really have any bearing on the programs Joey was referring to in this post. All the same, thank you for your thoughts!&nbsp;</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "wtroy"}}, {"_id": "bxDdwsmLypjHnmKH4", "postedAt": "2024-03-27T21:37:37.160Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Hello! One point that seems important to make: \"People in the space\" being skeptical of a startup idea, or even being confident it's a bad idea, is not good evidence that it's a bad idea.</p><p>Whilst we can expect subject matter experts to be skeptical of ideas that turn out to be bad, we can also expect them to be skeptical of a lot of ideas that turn out to be good!&nbsp;</p><p>This is true of many extremely successful for-profit start-ups (it's mentioned in Y-Combinator lectures a lot) and of non-profits as well, including many of CE's most successful incubated charities. If i'm not mistaken, it's even true of CE itself! When it's co-founders asked experts for their advice when considering launching the Incubation Program, the majority view was that it was a bad idea. I, for one, am glad they didn't listen! If you look around the room you're in now, you're almost certainly surrounded by a number of inventions that \"people in the space\" said were impossible or a bad idea. The job of an entrepreneur (or a researcher identifying start-up ideas for entrepreneurs) is to figure out when \"people in the space\" are wrong, or at least likely enough to be wrong for it to be worth trying.</p><p>So in conclusion: Track record of CE incubated charities -- good indicator. Whether or not people in the space were skeptical -- not a good indicator.&nbsp;</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "Aidan Alexander"}}, {"_id": "zMepQgTZWB9eK7Jgf", "postedAt": "2024-03-27T21:38:23.307Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>My impression is that Healthier Hens wouldn't have caused confusion for corporations dealing with other major asks like cage-free or broiler asks, because HH was planning to work directly with different targets, specifically farms and feed mills, and in Kenya to start. Do you mean it would have just been better to further support corporate cage-free and broiler campaigns (about which you've stated skepticism <a href=\"https://forum.effectivealtruism.org/posts/PTHskHoNpcRDZtJoh/gwwc-s-evaluations-of-evaluators?commentId=dzkEMmMYozwopWjs8\">here</a>), or another ask the movement would consolidate to focus on?</p><p>They discuss things that didn't go well for them <a href=\"https://forum.effectivealtruism.org/posts/6eaY7MEDWnK39sCEi/healthier-hens-y1-5-update-and-scaledown-assessment#Things_that_didn_t_go_well\">here</a>: fundraising, feed testing, delays, survey response collection and (negative results in their) split-feeding trial.</p><p>(I don't have much sense about the impact of Animal Ask, both how much impact they're having and why. Some of their research looks useful, but I don't know how their work is informing decisions or at what scale.)</p>", "parentCommentId": "RzPHMpF93kqeCWbzR", "user": {"username": "MichaelStJules"}}, {"_id": "ava5KZtidsT6jRRNF", "postedAt": "2024-03-28T00:19:57.031Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<blockquote><p>CE has a fairly strong reputation of being hostile / non-collaborative</p></blockquote><p>Could you elaborate on \"being hostile\"? Do they have a reputation for causing harm, or is it just about not listening to feedback?</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "AnonymousAccount"}}, {"_id": "tdxbBdjmNNmYDbfSX", "postedAt": "2024-03-28T01:36:26.752Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>At Animal Ask we did later hear some of that feedback ourselves and one of our early projects failed for similar reasons. Our programs are very group-led, as in we select our research priorities based on groups looking to pursue new campaigns. This means the majority of our projects tend to focus on policy rather than corporate work, given more groups consider new country-specific campaigns and want research to inform this decision.</p><p>In the original report from CE, they do account for the consolidation of corporate work behind a few asks. They expected the research on corporate work to be 'ongoing' deeper' and 'more focused research'. So strategically would look more like research throughout the previous corporate campaign to inform the next with a low probability of updating any specific ask. The expectation is that it could be many years between the formation of corporate asks.&nbsp;</p><p>So in fact this consolidation was highlighted in the incubation program as a reason success could have so much impact. As with the large amount of resources the movement devotes to these consolidated corporate asks ensuring these are optimised is essential.</p><p>As Ren outlined we have a couple of recent, more detailed evaluations and we have found that the main limitations on our impact are factors only a minority of advisors in the animal space highlighted. These are constraints from other organisation stakeholders either upper management (when the campaigns team had updated on our findings but there was momentum behind another campaign) or funders (particular individual or smaller donors who are typicaly less research motivated than OPP, EAAWF, ACE etc.)</p><p>You can see this was the main concern for CE researchers in the&nbsp;<a href=\"https://3394c0c6-1f1a-4f86-a2db-df07ca1e24b2.filesusr.com/ugd/9475db_b2329237752a4c3b8995e08eac7723e7.pdf\">original report.</a>&nbsp;\"Organizations in the animal space are increasingly aware of the importance of research, but often there are many factors to consider, including logistical ease, momentum, and donor interest. It is possible that this research would not be the determining factor in many cases\".&nbsp;</p>", "parentCommentId": "RzPHMpF93kqeCWbzR", "user": {"username": "GeorgeBridgwater"}}, {"_id": "eQJqBeDEsbgmK5LXw", "postedAt": "2024-03-28T10:18:30.736Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<blockquote><p>Another animal advocacy research organization supposedly found CE plagiarizing their work extensively including in published reports, and CE failed to address this.</p></blockquote><p>Hi, I am Charity Entrepreneurship (CE, now AIM) Director of Research. I wanted to quickly respond to this point.</p><p>I believe this refers to an incident that happened in 2021. CE had an ongoing relationship with an animal advocacy policy organisation occasionally providing research to support their policy work. We received a request for some input and over the next 24 hours we helped that policy organisation draft a note on the topic at hand. In doing so a CE staff member copy and pasted text from a private document shared by another animal advocacy research organisation. This was plagiarism and should not have happened. I would like to note: firstly that this did not happen in the course of our business as usual research process but in a rushed piece of work that bypassed our normal review process, and secondly that this report was not directly published by us and it was not made clear to the CE staff member involved that the content was going to be made into a public report (most other work for that policy organisation was just used privately) although we should of course have considered this possibility. These facts of course do not excuse our mistake here but are relevant for assessing the risk that this was any more than a one-off mistake.<br><br>I was involved in responding when this issue came to light. On the day the mistake was realised we: acknowledged the mistake, apologised to the injured party, pulled all publicity for the report, drafted an email to the policy org asking to have the person who's text was copied added as a co-author (the email was not sent until the following day after as we waited for approval from the injured party). The published report was updated. Over the next three weeks we carried out a thorough internal risk assessment including reviewing all past reports by the same author. The other animal rights research organisation acknowledged they were satisfied with the steps taken. We found no cases of plagiarism in any other reports (the other research org agreed with this assessment), although one other tweak was made to a report to make acknowledgment more clear.&nbsp;</p><p>FWIW I find mildlyanonymous' description of this event to be somewhat misleading referring to multiple \"reports\" and claiming \"CE failed to address this\".</p><p>&nbsp;</p><blockquote><p>CE's reports on animal welfare consistently contain serious factual errors ... noticing immediately that it had multiple major errors, sharing that feedback, and having it ignored due to their internal time capping practices.</p></blockquote><p>I don’t know what this is about. I know of no case where we have ignored feedback. We are always open to receiving feedback on any of our reports from anyone at any time. I am very sorry if I or any CE staff ignored you and I open to hearing more about this, and/or hearing about any errors you have spotted in our research. If you can share any more information on this I can look into it, please contact me (I will PM you my email address, note I am about to go on a week's leave). It is often the case if we receive minor critical feedback after a report is published we do not go back and edit our report but note the feedback in our Implementation Note for future Charity Entrepreneurship founders, maybe that is what happened.</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "weeatquince"}}, {"_id": "Bny3tvTfwfmL2sFvu", "postedAt": "2024-03-28T11:30:05.653Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<blockquote><p>2. CE's charities working on animal welfare have mostly not been very good, and listening to external feedback prior to launching them would have told them this would happen.<br><br>[...] doesn't do CE's original proposed idea anymore</p></blockquote><p>On the point of the charities not doing CE's originally proposed idea anymore, I want to clarify that we don't see charities tweaking an idea as a failure but rather as the expected course of action we encourage. We are aware of the limitations of desktop research (however in-depth), and we encourage organizations to quickly update based on country visits, interactions with stakeholders, and pilot programs they run. There are just some informations that a researcher wouldn't be able to get, and they need input from someone working on the ground. For example, when Rethink Priorities was writing their report on shrimp welfare, they consulted SWP extensively to gain that perspective. Because CE charities operate in extremely neglected cause areas, there is often no other \"implementer\" our research team can rely on. Therefore, organizations are usually expected to change the idea as they learn in their first months of operations. I see this as a success in ingraining the values of changing one's mind in the face of new evidence, seeking this evidence, and making good decisions on the side of co-founders with the support of their CE mentors, and we are happy when we see it happen.&nbsp;<br>There is a complex trade-off to be made when balancing the learning value from more in-depth desktop research vs. more time spent on learning as one implements, and I don't think CE always gets it right, but the latter perspective is often misunderstood and underappreciated in the EA space.&nbsp;<br><br>Regarding charities specifically, in general, we expect about a 2/5 \"hit rate\" (rarely because of the broad idea being bad, more often because the implementation is challenging for one reason or another), and many people, including external charity evaluators and funders, have a different assessment of some of the charities you list. That being said, if you have any specific feedback about the incubated organization's strategies or ideas, please reach out to them. As you mentioned, they are open to hearing input and feedback. Similarly, if you have specific suggestions about how CE can improve its recommendations, please get in touch with our Director of Research at sam@charityentrepreneurship.com; we appreciate specific feedback and conversation about how we can improve. Thank you for your support of multiple CE charities so far!&nbsp;</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "KarolinaSarek"}}, {"_id": "MtzuebTnv4dJrCiKi", "postedAt": "2024-03-28T11:48:45.939Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>It also concerns me that I’ve seen 5 instances of this post being disagree voted and strong downvoted, then a CE staff member commenting right after. I think those are obviously things people have a right to do if it is CE staff downvoting and disagreeing, but it means this post, outside of CE staff, might have fairly strong agreement from many people, which seems like an important note, given that it is still very positive karma, and without those votes might be positive agreement on balance.</p>\n", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "mildlyanonymous"}}, {"_id": "h4vwTkfqQBN68cSRw", "postedAt": "2024-03-28T11:49:27.906Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Thanks for sharing this! It differs from the narrative I’ve heard elsewhere is critical ways, but I don’t really know much about this situation, and just appreciate the transparency.</p>\n", "parentCommentId": "eQJqBeDEsbgmK5LXw", "user": {"username": "mildlyanonymous"}}, {"_id": "7hYsECr6vtBrro2cW", "postedAt": "2024-03-28T11:52:52.567Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>I definitely agree that organizations should pivot as they learn about how an intervention works in practice. I think the errors I refer to are more things of the type: a cursory glance from an animal welfare scientist could have told you your research was missing key considerations, and the charity would have not wasted time on the recommended intervention. These seem cheap to prevent and preventable issues.</p>\n", "parentCommentId": "Bny3tvTfwfmL2sFvu", "user": {"username": "mildlyanonymous"}}, {"_id": "uJdGDeoecngHWtfnT", "postedAt": "2024-03-28T11:58:50.630Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>I think this is overly simplifying of something a lot more complex, and I’m surprised it’s a justification you use for this. Of course on some level what you’re saying is correct in many cases. But imagine you recommend a global health charity to be launched. GiveWell says “you’re misinterpreting some critical evidence, and this isn’t as impactful as you think”. Charities on the ground say “this will impact our existing work, so try doing it this other way”. You launch the intervention anyway. The founders immediately get the same feedback, including from trying the intervention, then pivot to coordinating more and aligning with external experts.</p>\n<p>This seems much more analogous to what happens in the animal space, and it seems absolutely like a good indicator that people were skeptical. Charities aren’t for-profits, who exist in a vacuum of their own profitability. They are part of a broader ecosystem.</p>\n", "parentCommentId": "bxDdwsmLypjHnmKH4", "user": {"username": "mildlyanonymous"}}, {"_id": "e6k5sfoxqsakB87qN", "postedAt": "2024-03-28T12:48:23.795Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Thanks for clarifying! We always have an expert view section in the report, and often consult animal science specialists, but it is possible we missed something. Could you tell me where specifically we made a mistake regarding animal science that could have changed the recommendation? I want to look into it, to fact-check it, and if it is right not to make this mistake in the future.&nbsp;</p>", "parentCommentId": "7hYsECr6vtBrro2cW", "user": {"username": "KarolinaSarek"}}, {"_id": "BW3GR4fx294TLQroT", "postedAt": "2024-03-28T14:03:33.784Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>I went though the old emails today and I am confident that my description accurately captured what happened and that everything I said can be backed up.</p>\n", "parentCommentId": "h4vwTkfqQBN68cSRw", "user": {"username": "weeatquince"}}, {"_id": "vaJpufWCYoGaf9vgh", "postedAt": "2024-03-28T15:46:16.196Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>For what it's worth, I have no affiliation with CE, yet I disagree with some of the empirical claims you make — I've never gotten the sense that CE has a bad reputation among animal advocacy researchers, nor is it clear to me that the charities you mentioned were bad ideas prior to launching.</p>\n<p>Then again, I might just not be in the know. But that's why I really wish this post was pointing at specific reasoning for these claims rather than just saying it's what other people think. If it's true that other people think it, I'd love to know why they think it! If there are factual errors in CE's research, it seems really important to flag them publicly. You even mention that the status quo for giving in the animal space (CE excepted) is \"very bad already,\" which is <em>huge if true</em> given the amount of money at stake, and definitely worth sharing examples of what exactly has gone wrong.</p>\n", "parentCommentId": "MtzuebTnv4dJrCiKi", "user": {"username": "Tyler Johnston"}}, {"_id": "grCqrxRW5beC9uRxD", "postedAt": "2024-03-28T16:30:10.735Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<blockquote><p>There is a widely held view in the animal research community that CE's reports on animal welfare consistently contain serious factual errors</p></blockquote><p>To the extent this view is both valid and widely-held, and the reports are public, it should be possible to identify at least some specific examples without compromising your anonymity. While I understand various valid reasons why you might not want to do that, I don't think it is appropriate for us to update on a claim like this from a non-established anonymous account without some sort of support.</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "Jason"}}, {"_id": "bx4FexELoxYZwhSfo", "postedAt": "2024-03-28T16:51:54.329Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<blockquote><p>I think in general, our research is pretty unusual in that we are quite willing to publish research that has a fairly limited number of hours put into it. Partly, this is due to our research not being aimed at external actors (e.g., convincing funders, the broader animal movement, other orgs) as much as aimed at people already fairly convinced on founding a charity and aimed at a quite specific question of what would be the best org to found. We do take an approach that is more accepting of errors, particularly ones that do not affect endline decisions connected directly to founding a charity.&nbsp;</p></blockquote><p>Do you think there are additional steps you could/should take to make this philosophy / these limitations clearer to would-be to those who come across your reports?</p><p>I strongly support more transparency and more release of materials (including less polished work product), but I think it is essential that the would-be secondary user is well aware of the limitations. This could include (e.g.) noting the amount of time spent on the report, the intended audience and use case for the report, the amount of reliance upon which you intend that audience to place on the report, any additional research you expect that intended audience to take before relying on the report, and the presence of any significant issues / weaknesses that may be of particular concern to either the intended audience or anticipated secondary users. If you specifically do not intend to correct any errors discovered after a certain time (e.g., after the idea was used or removed from recommended options), it would probably be good to state that as well.</p>", "parentCommentId": "XxrnhxzQ4sWT4jA5s", "user": {"username": "Jason"}}, {"_id": "D73duioq32kMbt6LD", "postedAt": "2024-03-29T01:12:52.093Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Most of these are just \"people in space knew this wouldn't work\". Could you share more specific criticisms? As Aidan said, the biggest successes come from projects no one else would do, so without more information that seems like a very weak criticism.&nbsp;</p>", "parentCommentId": "6rGxLDYxiAamb5kz9", "user": {"username": "Elizabeth"}}, {"_id": "3iynbbbk7v8WCmbpn", "postedAt": "2024-03-29T10:03:50.573Z", "postId": "CA9r7p53cCaa3a5pK", "htmlBody": "<p>Hi, I am Charity Entrepreneurship (CE, now AIM) Director of Research. I wanted to quickly respond to this point.</p><p>– –&nbsp;</p><p><strong>Quality of our reports</strong></p><p>I would like to push back a bit on Joey's response here. I agree that our research is quicker scrappier and goes into less depth than other orgs, but <strong>I am not convinced that our reports have more errors or worse reasoning that reports of other organisations </strong>(thinking of non-peer reviewed global health and animal welfare organisations like GiveWell, OpenPhil, Animal Charity Evaluators, Rethink Priorities, Founders Pledge).</p><p>I don’t have strong evidence for thinking this. Mostly I am going of the amount of errors that incubates find in the reports. In each cohort we have ~10 potential founders digging into ~4-5 reports for a few weeks. I estimate there is on average roughly 0.8 non-trivial non-major errors (i.e. something that would change a CEA by ~20%) and 0 major errors highlighted by the potential founders. This <strong>seems in the same order of magnitude to the number of errors GiveWell get on scrutiny </strong>(e.g. <a href=\"https://www.happierlivesinstitute.org/report/a-dozen-doubts/\">here</a>).</p><p>And <strong>ultimately all our reports are tested in the real world </strong>by people putting the ideas in practice. If our reports do not line up to reality in any major way we expect to find out when founders do their own research or a charity pivots or shuts down, as <a href=\"https://forum.effectivealtruism.org/posts/MWSwSXNmsSBaEKtKw/maternal-health-initiative-is-shutting-down\">MHI has done recently</a>.</p><p>One caveat to this is that I am more confident about the reports on the ideas we do recommend than the other reports on non-recommended ideas which receive less oversight internally as they are less decision relevant for founders, and receive less scrutiny from incubates and being put into action.&nbsp;</p><p>I note also that in this entire critique and having skimmed over the threads here no-one appears to have pointed out any actual errors in any CE report. So I find it hard to update on anything written here. (The possible exception is me, in this post, pointing to the MHI case which does seem unfortunately to have shut down in part due to an error in the initial research.)</p><p>So I think our quality of research is comparable to other orgs, but my evidence for this is weak and I have not done a thorough benchmarking. I would be interested in ways to test this. It could be a good idea for CE to run a change our mind context like GiveWell in order to test the robustness of our research. Something for me to consider. It could also be useful (although I doubt worth the error) to have some external research evaluator review our work and benchmark us against other organisations.</p><p>– –&nbsp;</p><p>That said I do agree that we should make it very very clear in all our reports the context of who the report is written for and why and what the reader should take from the report. We do this in the introduction section to all our reports and I will review the introduction for future reports to make sure this is absolutely clear.</p>", "parentCommentId": "bx4FexELoxYZwhSfo", "user": {"username": "weeatquince"}}]