[{"_id": "hAihiogxFZTfoo4Lp", "postedAt": "2015-08-16T17:01:37.169Z", "postId": "CAoEMopMv3EMNiKKC", "htmlBody": "<p>Wow, I didn't expect to see any submissions so quickly! Thanks Dave!</p>\n<p>A couple questions:</p>\n<blockquote>\n<p>The satellites would be ~micron thick solar cells plus CPUs, and would require a small fraction of the matter in the solar system.</p>\n</blockquote>\n<p>Do you have calculations to justify this claim?</p>\n<p>Do you expect that computer consciousness would be net positive? Why?</p>\n<p>You talk about preserving natural life as a good thing. Are you at all concerned about <a href=\"http://foundational-research.org/publications/importance-of-wild-animal-suffering/\">wild-animal suffering</a>?</p>\n<p>More generally, alternate foods is an interesting idea that I hadn't heard before, and it looks neglected among EAs (I don't know if there's much research being done on it but from what you say it sounds like there's not). I'd be happy to see what you publish on alternate food interventions.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "LJQZct5g4kiD3Jy6z", "postedAt": "2015-08-16T23:26:35.442Z", "postId": "CAoEMopMv3EMNiKKC", "htmlBody": "<p>Thanks for the questions and thanks for the opportunity to post!\nSee <a href=\"http://web.archive.org/web/20080918090527/http://www.aeiveos.com:8080/~bradbury/MatrioshkaBrains/MatrioshkaBrainsPaper.html\">link</a> for calculations on mass requirements. They estimate that a chunk of Mercury could envelop the sun in a few years using self replicating nanotechnology. But then to get maximum computation power, you would want to use the waste heat from a shell near the sun to power another shell further out (Matrioshka Brains). We actually already have &quot;solar&quot; cells that work with lower temperature radiation. Making many of these shells would require a lot more mass, but it would still be feasible.</p>\n<p>I think that computer consciousnesses could be much happier than humans. However, they could be much less happy. So I think this is important to work on, though I am optimistic overall.</p>\n<p>My reference to reducing animal suffering in galactic colonization and ancestor simulations includes concern about wild animal suffering. I am just less concerned about the wild animal suffering that is going on now because it is much smaller quantities. However, I will note that there may be low-cost ways of reducing wild animal suffering without compromising biodiversity, by just keeping fewer number of organisms per species. For instance, there are huge number of copepods (a type of invertebrate) over large areas of the ocean. However, if we fertilize the oceans, we can have food chain that goes directly from algae to fish. This would reduce the amount of agricultural land required, probably increasing wild animal suffering on land, but it might be a win overall. This could be justified even in non-catastrophe times, but fertilizing the oceans is one of my alternate foods if there is some sunlight remaining.</p>\n<p>Yes, very few people are working on alternate foods now. So that means the marginal impact of additional work is very high.</p>\n", "parentCommentId": "hAihiogxFZTfoo4Lp", "user": {"username": "Denkenberger"}}, {"_id": "e6axG2utA6dMrPTgT", "postedAt": "2015-08-17T07:19:44.801Z", "postId": "CAoEMopMv3EMNiKKC", "htmlBody": "<blockquote>\n<p>I believe that the future will generally be net beneficial. </p>\n</blockquote>\n<p>That seems.... optimistic. Why do you believe that?</p>\n", "parentCommentId": null, "user": {"username": "DisposableUsername"}}, {"_id": "btKRvCfG2inBzyySC", "postedAt": "2015-08-18T07:06:30.258Z", "postId": "CAoEMopMv3EMNiKKC", "htmlBody": "<p>This is really cool, and I'm glad to see that one of the first posts in this series is on a somewhat unconventional EA idea.</p>\n<p>I'm curious, though - you seem to conclude pretty decisively that GCRs, or at least general far future trajectory changes, are the highest-impact cause, but then you select alternate foods rather than other far future interventions because it is competitive with other GCR causes but is also good for global poverty and environmentalism. If GCRs or far future trajectory changes are overwhelmingly important, it seems you should just choose whichever intervention seems most important for the far future and call it a day. A marginal difference in impact on the far future should outweigh impact on other causes that are far less important. Of course, it could be that GCRs are only slightly more important than the other causes, in which case this calculation makes sense. But it seems like you think they're likely to be far more important, so I'm curious about how you reconcile this.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "WiPnggSSMaiqpQgGn", "postedAt": "2015-08-19T00:49:21.821Z", "postId": "CAoEMopMv3EMNiKKC", "htmlBody": "<p>Thanks, and good points. There is a lot of uncertainty in the cost effectiveness of GCR interventions (especially given my crude framework so far - <a href=\"http://gcrinstitute.org/integrated-assessment/\">this</a> would be much more accurate). So I would not have a lot of confidence to say that one is the best. I would have slightly more confidence to saying that the group I mentioned is likely to be more cost-effective than the GCRs I did not mention. \nBecause I have two independent lines of reasoning pointing towards the overwhelming importance of reducing GCR, I am fairly confident in that. But I am not 100% confident, so there is an advantage of having benefits in other frameworks (&quot;no regrets&quot;). Also, I am particularly excited about the fact that alternate foods have an opportunity to unite some of the factions within EA.</p>\n", "parentCommentId": "btKRvCfG2inBzyySC", "user": {"username": "Denkenberger"}}, {"_id": "e5kKB6PaQGs4wWFCa", "postedAt": "2015-08-19T01:16:51.577Z", "postId": "CAoEMopMv3EMNiKKC", "htmlBody": "<p>On the biological human side, since we have figured out how to grow our economies faster than our population, our standard of living has increased much beyond subsistence. Many would argue that even at subsistence, human existence was still net positive, but I think it is fairly clear that human existence in developed countries currently is net positive. In the future, barring a global catastrophe, I think we could maintain or increase our standard of living (see my second comment <a href=\"http://effective-altruism.com/ea/df/the_outside_critics_of_effective_altruism/\">here</a>).</p>\n<p>On the computer consciousness side, it is much less straightforward. Robin Hanson has written a lot on what the future might be like if there are many competing computer consciousnesses (e.g. <a href=\"http://mason.gmu.edu/~rhanson/uploads.html\">link</a>). Since it is so easy to create a copy of software, he argues that the big supply of labor will reduce wages to subsistence levels, unless we somehow are able to regulate the process. I couldn't find exactly where, but I believe he argues that the subsistence levels might be quite happy. The logic went something like an optimally productive worker is generally a happy and highly motivated worker, like a workaholic. </p>\n<p>However, if there is fast takeoff of an individual computer consciousness, that could become completely dominant. Making that a happy outcome is where MIRI comes in. I am currently pretty scared about our chances in this scenario. But now that we even have Bill Gates concerned about it (though not donating yet), I am hopeful we can improve our odds soon.</p>\n", "parentCommentId": "e6axG2utA6dMrPTgT", "user": {"username": "Denkenberger"}}, {"_id": "8RtktbEuntt2ATiJ2", "postedAt": "2015-08-19T05:30:17.631Z", "postId": "CAoEMopMv3EMNiKKC", "htmlBody": "<p>Thanks for answering. I don't really care about computer consciousnesses because I'm somewhat of a carbon chauvinist; I only care what happens to biological humans and other vertebrates who share my ancestry and brain architecture. I think the rest is just our empathy misfiring.</p>\n<p>AI or em catastrophe would be terrible, but likely not hellish, so it would be merely a dead future, not a net-negative one.</p>\n<p>The things I'm most concerned about are blind spots like animal suffering and political risks like irrational policies that cause more harm than benefit. If we include these, I think it's plausible there is net-negative aggregate welfare even in developed countries. Technology might change these, but I think political risks and human biases (moral blind spots) can make any innovation useless or net harmful. I don't know how to address these because I don't believe advocacy actually works.</p>\n", "parentCommentId": "e5kKB6PaQGs4wWFCa", "user": {"username": "DisposableUsername"}}]