[{"_id": "pw6MRpadkk3cXBngD", "postedAt": "2022-11-05T15:48:55.790Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<blockquote><p>[Personal connections] are cited as an important reason that people get involved in EA in the&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/NP5B6yNMoZiZbmEQ8/open-phil-ea-lt-survey-2020-introduction-and-summary-of\"><u>Open Phil EA/Longtermist Survey</u></a></p><ol><li>35% of people said personal contact with EAs was important for them getting involved</li><li>38% said personal contacts had the largest influence on their personal ability to have a positive impact</li></ol></blockquote><p>&nbsp;</p><p>I just wanted to check whether you didn’t accidentally cite the OP Survey rather than the EA Survey? These results and question wording are identical to the 2020 EA Survey:&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/tzFcqGmCA6ePeD5wm/ea-survey-2020-how-people-get-involved-in-ea#What_factors_are_important_for_getting_involved_\"><u>35.4%</u></a> said “personal contact with EAs” was “important for [them] getting involved in EA”,&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/Dhxg9BfBQEYvZETAD/ea-survey-2020-community-information#Which_factors_have_had_the_largest_influence_on_your_personal_ability_to_have_a_positive_impact_\"><u>38.7%</u></a> said personal contact with EAs… had the largest influence on your personal ability to have a personal impact?”<br><br>It’s true that the OP survey and EAS asked many of the same questions, and it’s true that the OP survey and EAS tend to get exceptionally similar results (when you filter for highly engaged EAs), but that seems like quite the coincidence, and I don't think OP actually asked both these questions.</p><p>Fwiw, I think the OP Survey and EAS are both complementary and it's generally good to cite both. Much more could be written about the circumstances in which it makes sense to use different results of each of these surveys, since I think it is not straightforward. I'd like the survey team to do this sometime, but we lack capacity at present.</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "zyxm9u96HHoSKpfco", "postedAt": "2022-11-06T08:05:30.753Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>I feel pretty unsure how high the EAG bar is.</p>\n<p>How much do you know about the quality of the EAG connections? How is that quality-adjusted connection calculated?</p>\n<p>(Maybe too much of a tangent. NNTR.)</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "2SmTTcJrenySjdxrh", "postedAt": "2022-11-06T08:21:15.558Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>Personally I find Twitter and email far more helpful than EAG for making new connections, and for meeting up with people I already know.</p>\n<p>It's not a close call—I'd estimate 2-10x better per hour of time spent trying to connect (including travel time).</p>\n<p>Given that, I've more or less stopped going to EAGs.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "KBMNuSgF6YJiCjyxj", "postedAt": "2022-11-06T08:23:53.099Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>If I can easily be in the same city as an EAG event I am pleased about that, because it's raises the chance that someone I'd like to see in person is less than 25 miles away.</p>\n<p>I sometimes remember to check if people I'd like to meet are around a few days before the conference starts. I wish I remembered to do that more consistently.</p>\n<p>I also wish I could more easily find out who is attending, whether or not I am not attending. Sometimes that would make me decide to be in the relevant city, even though I am not attending.</p>\n", "parentCommentId": "2SmTTcJrenySjdxrh", "user": {"username": "Peter_Hartree"}}, {"_id": "FCAzGcj3pWm3Yqpw2", "postedAt": "2022-11-06T08:34:31.087Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>I've been to at least 5 EAGs.</p>\n<p>About 80% of the \"connection\" value came from the following process:</p>\n<ol>\n<li>Think of people I want to meet.</li>\n<li>Search Swapcard to see if they're attending EAG.</li>\n<li>Message to suggest a meeting.</li>\n</ol>\n<p>Most of the rest came from \"bump into\" effects, where seeing someone in a corridor reminds me that I'd like to speak to them, and so I do. And vice versa.</p>\n<p>I imagine many people get a lot of value from the \"off venue\" parties—I skip those because I hate parties.</p>\n<p>I've attended a couple of interest/skill-specific \"speed dating\" sessions over the years and found them fairly useless.</p>\n<p>The main ways I see EAG as being optimised for connections are:</p>\n<ol>\n<li>Ability: everyone is physically nearby, so it's easier to meet in person.</li>\n<li>Trigger: the purpose of the conference is to see people</li>\n<li>Motivation: there's a limited time window.</li>\n</ol>\n<p>The actual conference venue is usually a bad place to speak. It's noisy and if you're in a public place, people often interrupt your conversations. I do ~all of my meetings outside the venue, usually walking nearby.</p>\n<p>(I'm not sure why people attend talks at EAG—I just want to watch at 2x on the internet.)</p>\n<p>Crazy thought: I wonder what would happen if you ran an EAG where the physical venue was just \"Central London\" and then people watch talks on the internet and arrange IRL meet ups.</p>\n", "parentCommentId": "2SmTTcJrenySjdxrh", "user": {"username": "Peter_Hartree"}}, {"_id": "bgi7EQM6ALdNAxt5p", "postedAt": "2022-11-06T08:50:37.121Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>On the community map, you wrote:</p>\n<blockquote>\n<p>I think we did a decent job promoting, and demand is just genuinely low.</p>\n</blockquote>\n<p>What are the main things you did to promote the map?</p>\n<p>Are you sure you've tested demand carefully enough?</p>\n<p><a href=\"https://behaviormodel.org\">Behaviour = motivation * ability * trigger</a>. What is the trigger for using the map?</p>\n<p>Personally, when the map was announced, I set my location and did a quick map search. But then I totally forgot that the map exists until I read your post today.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "wemHwXS7Aru3JdvFQ", "postedAt": "2022-11-06T08:52:06.336Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>I think the key design challenge for the map product is to deliver an ongoing stream of well-timed prompts to use it.</p>\n<p>I want to notice whenever someone I've interacted with on the forum is in the same city as me. You could tell me about this:</p>\n<p>(a) Whenever I interact with someone (e.g. their username name is visually highlighted if they're nearby).</p>\n<p>(b) When one of us change location (e.g. you keep a list of people I've interacted with, then trigger a notification when one of them is nearby*).</p>\n<p>Ideally the EA Forum would request location access and update my location automatically whenever I log on. If I don't consent to that, then it should periodically remind me to update my location, with the timing of those reminders perhaps partly based on IP address changes.</p>\n<p>*Probably you'd want to rate-limit these a bit, and prioritise by things like recency and volume of interaction.</p>\n", "parentCommentId": "bgi7EQM6ALdNAxt5p", "user": {"username": "Peter_Hartree"}}, {"_id": "2Ps84GDwJgCyAA9nb", "postedAt": "2022-11-06T09:15:47.435Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>Re: Swapcard, you wrote:</p>\n<blockquote>\n<p>A timebound conference creates an artificially highly liquid market for conversations.</p>\n</blockquote>\n<p>I think there are good ways to create virtual timebounds. Prime Day works pretty well for Amazon.</p>\n<p>Here's a sketch of one possible path:</p>\n<ol>\n<li>\n<p>Every Xth of the month is \"Connection day\". People are encouraged to reserve several hours for calls on this day.</p>\n</li>\n<li>\n<p>In the run up to \"Connection day\", Forum users are prompted to suggest \"Connection day\" calls with each other.</p>\n</li>\n<li>\n<p>The Forum helps you generate ideas for who to connect with. E.g.</p>\n</li>\n</ol>\n<p>3a. There's a \"Connection day\" page that lists all the Forum users you've interacted with, ranked by recency and depth of interaction.</p>\n<p>3b. There's a list of all your Twitter mutuals, plus some \"recommended follows\".</p>\n<p>3c. There's an easy way to suggest that Forum users you know reach out to someone in particular.</p>\n<ol start=\"4\">\n<li>If both parties indicate that they want to meet on Connection day, then (MVP) their calendar links are shared to each other. If this proves popular then you can make a better UI with Calendar integration.</li>\n</ol>\n<p>Lots of details to fill in here, but I would definitely try this, if it existed.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "iAbeE5KnvnFuzJx3k", "postedAt": "2022-11-06T09:18:15.654Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<blockquote>\n<p>The biggest issue with building a directory is getting people to actually use it.</p>\n</blockquote>\n<p>\"Use it\" breaks down into (a) \"sign up\" and then (b) \"ongoing use\".</p>\n<p>The EA Forum has an incredible edge on both dimensions—you've already passed these hurdles for the Forum itself.</p>\n<p>If anyone can make an EA directory product work, it's probably going to be the EA Forum.</p>\n", "parentCommentId": "2Ps84GDwJgCyAA9nb", "user": {"username": "Peter_Hartree"}}, {"_id": "qa3xpNiGsHLCrajiF", "postedAt": "2022-11-06T09:26:50.536Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>One idea for increasing connections: when I interact with someone on the Forum, encourage me to follow them on Twitter.</p>\n<p>Ways you might do this:</p>\n<ol>\n<li>\n<p>Everywhere a Forum username is shown, add a bird icon that links to their Twitter profile.</p>\n</li>\n<li>\n<p>When I upvote, reply or send a DM, prompt me to follow the person on Twitter.</p>\n</li>\n<li>\n<p>Periodically email me a list of Twitter profiles of the EA Forum users I interact with the most.</p>\n</li>\n</ol>\n<p>I imagine (1) would get a lot of the value, and it's cheap to test.</p>\n<p>Generally I think it would be interesting to brainstorm on ways that EA Forum could interact with EA Twitter, and vice versa.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "55wkovpNfBhXNqdSj", "postedAt": "2022-11-07T04:03:04.580Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>Adding on to this - we had a maps functionality on the EA Hub (eahub.org), but never tried to promote it or saw it as a particularly useful way to achieve the use case of \"people nearby want to meet\".&nbsp;</p><p>To do that, we launched more advanced <a href=\"https://forum.effectivealtruism.org/posts/PEBzBYKEt4CXFDai4/the-ea-hub-what-s-new-in-2021#New_features\">search functionality</a> and a \"EA Chats\" which would have allowed matching on location. That functionality that was not launched, but had some good beta feedback of <a href=\"https://forum.effectivealtruism.org/posts/QivHpLgvM4fwYKgSk/call-for-beta-testers-for-the-ea-pen-pals-project\">EA Pen Pals</a> (and the 2015 version of EA Chats).</p><p>In general, we consulted closely with local group organizers to build functionality that would help them facilitate connections themselves (they were perhaps the \"trigger\").</p><p>Unfortunately we were not able to test this out because we <a href=\"https://forum.effectivealtruism.org/posts/FdWv7t8Pyxyxe6xnb/the-ea-hub-is-suspending-new-feature-development-with-plans\">decided to retire the Hub before that</a>, but my guess is that either of those versions would have been more robust ways of testing the functioanlity.&nbsp;</p>", "parentCommentId": "bgi7EQM6ALdNAxt5p", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "ugZSJqpqr3HJ2dKvD", "postedAt": "2022-11-11T13:13:45.286Z", "postId": "CAWvSaGWNbCnoRccd", "htmlBody": "<p>I have found this post really interesting and useful....thanks for posting!&nbsp;<br><br>You write that 'the Forum wasn’t designed well' for meaningful connections. I am researching online communities and wondered in what ways the EA forum was deficient in this area in you opinion? Do you have other forums in mind that do facilitate more meaningful connections?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Cosima Axford"}}]