[{"_id": "ENyEWPCgF2W6xXTbj", "postedAt": "2024-01-18T02:13:57.649Z", "postId": "CBq2KFAjE6GTxTjEF", "htmlBody": "<p>Wow, this is amazing! &nbsp;Thank you for putting in the time and effort to write it. &nbsp;I just ordered a copy for the Effective Altruism at Georgia Tech library. &nbsp;Can’t wait to read it!</p>", "parentCommentId": null, "user": {"username": "Pete Rowlett"}}, {"_id": "WBTx77TxSPqmpD8so", "postedAt": "2024-01-18T08:47:02.167Z", "postId": "CBq2KFAjE6GTxTjEF", "htmlBody": "<p>Thank you for writing this book, I'm looking forward to reading it. How does it contrast with jacy reese's the end of animal farming? I notice that it's focused on america, but would you still recommend it for advocates in other countries?&nbsp;</p>", "parentCommentId": null, "user": {"username": "jordanve"}}, {"_id": "nE9HNqniQE9fzHbfS", "postedAt": "2024-01-18T10:32:40.792Z", "postId": "CBq2KFAjE6GTxTjEF", "htmlBody": "<p>Wow, this is amazing news. Thank you so much for all the hard work that must have gone into writing this book, I can’t wait to read it !</p>\n<p>(Small, very reluctant point of correction: I think unfortunately, “The good it promises, the harm it does” is probably the first book focusing on EA and FAW (assuming we don’t consider Animal Liberation to be a book about EA, which I think is fair)).</p>\n", "parentCommentId": null, "user": {"username": "Kaleem"}}, {"_id": "wk6m3PHxF9e5GJT3L", "postedAt": "2024-01-18T10:39:35.852Z", "postId": "CBq2KFAjE6GTxTjEF", "htmlBody": "<p>I think there are other earlier examples, e.g. <a href=\"https://en.wikipedia.org/wiki/The_End_of_Animal_Farming\">https://en.wikipedia.org/wiki/The_End_of_Animal_Farming</a>&nbsp;</p>", "parentCommentId": "nE9HNqniQE9fzHbfS", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "Hpn8LEEfKv9mqTpLS", "postedAt": "2024-01-22T16:57:39.733Z", "postId": "CBq2KFAjE6GTxTjEF", "htmlBody": "<p>Thank you! Jacy's book is quite good. I would describe his as focused on clean and plant-based meat. His work was very helpful for my chapter on clean meat. My take is broader and considers a number of facets of the movement beyond the tech side. I have nothing bad to say about The End of Animal Farming but my book I think does a good job of telling the stories about activists throughout the farm animal welfare and rights communities through the lens of EA.</p><p>It is focused on America so I probably wouldn't recommend it to folks based outside the U.S. unless they have an interest in the U.S.!</p>", "parentCommentId": "WBTx77TxSPqmpD8so", "user": {"username": "Jeff Thomas"}}, {"_id": "sXKJWbDn3eohtshcz", "postedAt": "2024-01-22T17:08:14.851Z", "postId": "CBq2KFAjE6GTxTjEF", "htmlBody": "<p>Kaleem - thank you so much for your comment. I think you make a good point. I read \"The Good It Promises\" and I think there are some helpful chapters, but it has a number of essays not really about farm animals. &nbsp;And as Lorenzo notes there are many other books that discuss EA and farm animals. I thought The End of Animal Farming was good and cite it in my book. I just thought a good survey of EA and farm animals would be helpful for folks. In any event, I really hope my book inspires other people to write even better books!&nbsp;</p>", "parentCommentId": "wk6m3PHxF9e5GJT3L", "user": {"username": "Jeff Thomas"}}, {"_id": "GszaXjiH9fiHFEck2", "postedAt": "2024-01-22T17:08:35.626Z", "postId": "CBq2KFAjE6GTxTjEF", "htmlBody": "<p>Thank you, Pete, that is so kind!&nbsp;</p>", "parentCommentId": "ENyEWPCgF2W6xXTbj", "user": {"username": "Jeff Thomas"}}]