[{"_id": "RF6qWqHmSBfL5z49i", "postedAt": "2018-02-15T22:56:06.416Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>One of the biggest challenges is trying to even figure out how likely it is caused by something physical vs. a psychological root cause. It is a very controversial topic, to say the least. I spent about an hour looking into this, but I wasn't really able to get anywhere, at least without any knowledge of the field or where to find reliable information.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "WHQrraMNAoy47X6F4", "postedAt": "2018-02-16T00:22:26.632Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>ME/CFS (the currently accepted name in the US) is a physiological disease. This is beyond dispute, and no longer a debate in the medical and scientific community. At least in the United States.</p>\n<p>US CDC: &quot;Myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS) is a serious, long-term illness that affects many body systems.&quot;</p>\n<p>US National Academy of Medicine: ME/CFS &quot;is a medical — not a psychiatric or psychological — illness.&quot;</p>\n<p>New York State Department of Health: ME/CFS is &quot;a multi-system disease associated with neurological, immunological, and energy metabolism impairment.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Webdog"}}, {"_id": "RF6ieQomeHpjZdCE5", "postedAt": "2018-02-16T03:41:31.425Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>It's not either/or. It's likely not to be a single disease - would probably be more accurate to call it a syndrome. </p>\n", "parentCommentId": "RF6qWqHmSBfL5z49i", "user": {"username": "Lila"}}, {"_id": "tLeJHD5zMqctv99qt", "postedAt": "2018-02-16T16:36:47.926Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Yes, but only very recently so. For example, it's only a few months ago that the CDC removed language and recommendations that were remnants of the belief that it is psychological. See the article that I linked at the end of the post for some background there (<a href=\"https://www.npr.org/sections/health-shots/2017/10/02/554369327/for-people-with-chronic-fatigue-syndrome-more-exercise-isnt-better)\">https://www.npr.org/sections/health-shots/2017/10/02/554369327/for-people-with-chronic-fatigue-syndrome-more-exercise-isnt-better)</a>. And it's likely that there are plenty of doctors who haven't followed these developments closely and would still believe it's not a physiological disease.</p>\n", "parentCommentId": "WHQrraMNAoy47X6F4", "user": {"username": "JanPaul123"}}, {"_id": "qXotTvhr2iGAzu9kb", "postedAt": "2018-02-16T16:53:31.026Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>That's fair, a lot of this are recent findings. Which is why I think it's interesting to EA, since there isn't much mainstream understanding and funding yet.</p>\n<p>I would say if you're going to spend an hour researching, I'd look at the 2015 Institute of Medicine report, which contains most of the current state of the art (<a href=\"http://www.nationalacademies.org/hmd/Reports/2015/ME-CFS.aspx)\">http://www.nationalacademies.org/hmd/Reports/2015/ME-CFS.aspx)</a>. Which is very little. But they do cite quite a few studies on physical manifestations of the disease, in an attempt to establish diagnostic criteria (e.g. physical differences during exercise stress tests).</p>\n<p>There obviously are some more findings since then, but since funding is so low there isn't that much progress since 2015. ;)</p>\n", "parentCommentId": "RF6qWqHmSBfL5z49i", "user": {"username": "JanPaul123"}}, {"_id": "b487p3hzt3hc6vjAc", "postedAt": "2018-02-16T17:13:12.109Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Also, what's great about EA is that we're not just individuals with an hour here and there to spare. We have entire organisations dedicated to researching causes and interventions. They could take a couple of controversial diseases like this (I only had time to look into this one) and properly research what's going on, and how much funding in the right places would help.</p>\n<p>They might find that none of this is useful to spend money on. Or they might find some gems. I think it's worth finding out!</p>\n", "parentCommentId": "qXotTvhr2iGAzu9kb", "user": {"username": "JanPaul123"}}, {"_id": "73K7ScPEKuX9C6t7W", "postedAt": "2018-02-17T02:55:32.042Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>As long as we're talking about medical research from an EA perspective, I think we should consider funding therapies for reversing aging itself. In terms of scale, aging undoubtedly is by far the largest (100,000 people die from age-related diseases every single day, not to mention the psychological toll that aging causes). Aging is also quite neglected - very few researchers focus on trying to reverse it. Tractability is of course a concern here, but I think this point is a bit nuanced. Achieving a full and total cure for aging would clearly be quite hard. But what about a partial cure? What about a therapy that made 70 year olds feel and act like they were 50, and with an additional 20 years of life expectancy? Such a treatment may be much more tractable. At least a large part of aging seems to be due to several common mechanisms (such as DNA damage, accumulation of senescent cells, etc), and reversing some of these mechanisms (such as by restoring DNA, clearing the body of senescent cells, etc) might allow for such a treatment. Even the journal Nature (one of the 2 most prestigious science journals in the world) had a recent piece saying as much:\n<a href=\"https://www.nature.com/articles/d41586-018-01668-0\">https://www.nature.com/articles/d41586-018-01668-0</a></p>\n<p>If anyone is interesting in funding research toward curing aging, the SENS Foundation (<a href=\"http://www.sens.org\">http://www.sens.org</a>) is arguably your best bet.</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "sk6uvsDvJJSHJwPJc", "postedAt": "2018-02-17T03:26:50.038Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>There seems to be some confusion about scale--from importance--in regard to neglectedness (ITN). One should also consider how pervasive the medical condition is in the world. How common is it? Is it a very rare medical condition? Does it affect a certain cohort? Just something to keep in mind.</p><p>Related</p><p><a href=\"https://reg-charity.org/effective-giving-guide/part-2\">Reg-charity.org \"Prioritising causes\"</a></p><p><a href=\"http://effective-altruism.com/ea/ss/the_importantneglectedtractable_framework_needs\">EA Forum article1</a></p><p><a href=\"http://effective-altruism.com/ea/yp/evaluation_frameworks_or_when_importance/\">EA Forum article2</a></p><p><a href=\"https://80000hours.org/2013/12/a-framework-for-strategically-selecting-a-cause/\">80,000 Hours \"Accessing Importance\"</a></p><hr><p>PS ~ When describing EA to others, a big question is, \"What is 'effective' charity?\" A common misunderstanding is mistaking 'effective' charities to be preordained or forced. As any EA knows, evaluation is key. Better understanding will come when using complementary diction, such as \"scale\" and \"solvability\" (see at least the first link above).</p>", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "AuwbYNYLahnwxNM4J", "postedAt": "2018-02-17T22:50:11.475Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Yeah, the DALY metric I used in this article takes into account how common it is.</p>\n", "parentCommentId": "sk6uvsDvJJSHJwPJc", "user": {"username": "JanPaul123"}}, {"_id": "NvQaSF9j948ouHQAi", "postedAt": "2018-02-18T00:39:13.874Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Agreed.</p>\n<p>This was intended to be a reply to casebash, who was questioning whether ME/CFS was psychological. It was not meant as a comment on the article itself. My apologies for the confusion.</p>\n", "parentCommentId": "tLeJHD5zMqctv99qt", "user": {"username": "Webdog"}}, {"_id": "rdFuNa6TrMvbbbYa9", "postedAt": "2018-02-18T19:54:36.420Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Thanks for this writeup. I found it thoughtful and compelling.</p>\n<p>My understanding is that ME is real, serious, and understudied/underfunded. Perhaps the core reason it's understudied is that it's unclear where to start, physiologically speaking -- there's a lot of ontological uncertainty in terms of what this thing is that sometimes cripples people.</p>\n<p>This is sometimes solvable by throwing resources at the problem, and sometimes not.</p>\n<p>It might be helpful to survey some other diseases that followed a similar trajectory (mysterious crippling conditions that later resolved into known diseases with known causes and known treatments) and see if there are any general lessons to learn. My expectation here is that often, what makes a mystery disease 'make sense' is a new method that gives a novel/fresh window into physiology. Celiac disease could be an interesting case study: it was hugely mysterious (and hugely underdiagnosed) until (1) we got a decent IgG screen, and (2) we started to understand how gut permeability works.</p>\n<p>I'd also suggest that you may be a little too cynical about alternative medicine; there's a huge amount of snake-oil there, but alternative medicine is also highly heterogeneous, exploring a lot of the possibility space. There will be a lot of bs, but there often are some pearls as well. Mainstream medicine is also not particularly known for immediately finding these pearls and synthesizing them back into the medical literature, so I think it's also plausible that a viable way to make progress on this problem is to survey what alt-med thinks it knows about ME, filter the bs out, and see if there's anything left that can help mainstream medicine understand what ME is and what general class of treatments might help.</p>\n", "parentCommentId": null, "user": {"username": "MikeJohnson"}}, {"_id": "oua8yT7Ld7fpRApRf", "postedAt": "2018-02-19T17:35:13.910Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>All great points, thanks!</p>\n", "parentCommentId": "rdFuNa6TrMvbbbYa9", "user": {"username": "JanPaul123"}}, {"_id": "ajr9HHfLZqrTx7T8X", "postedAt": "2018-02-20T03:50:07.677Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>I think the general scientific consensus is that it's a physiological condition. But I don't think it matters whether it's psychological or not, anyway - it's just as disabling and underfunded either way. </p>\n", "parentCommentId": "RF6qWqHmSBfL5z49i", "user": {"username": "peace34"}}, {"_id": "jcBBSpePBY7CW3j9K", "postedAt": "2018-02-20T09:41:35.041Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>unsure why this was downvoted. I assume because many EAs think X-risk is a better bet than aging research. That would be a reason to disagree with a comment, but not to downvote, which is snarky. I upvoted for balance. </p>\n", "parentCommentId": "73K7ScPEKuX9C6t7W", "user": {"username": "MichaelPlant"}}, {"_id": "j2AqpP5LWtG3dC8Pu", "postedAt": "2018-02-23T23:04:43.098Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>It does seem like there are important areas where medical research is inadequate. I'll suggest that part of the problem is inadequate effort devoted to treatments that aren't protected by patents.</p>\n<p>It looks like some unknown fraction of ME/CFS is caused by low thyroid hormone levels. &quot;Subclinical&quot; <a href=\"https://en.wikipedia.org/wiki/Hypothyroidism\">hypothyroidism</a> has symptoms that are pretty similar to those of ME/CFS. They are usually distinguished by TSH tests. [TSH is the standard measure of thyroid levels; there are a number of other options, none of which are ideal].</p>\n<p><a href=\"http://lesswrong.com/lw/nef/the_thyroid_madness_core_argument_evidence/\">Here's speculation</a> that we should distrust TSH results. (There's a more detailed and very verbose version of that speculation <a href=\"http://lesswrong.com/lw/n8u/a_medical_mystery_thyroid_hormones_chronic/\">here</a>).</p>\n<p>There's <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2664572/\">plenty of confusion</a> about when it's wise to increase a patient's thyroid hormone. E.g. <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC58535/\">this small RCT study</a> which gave a standard T4 dose, rather than adjusting the dose to achieve some measure of optimal hormone levels. The reported TSH levels of 0.66 in patients receiving T4 suggest that many patients got more than the optimal dose, and/or didn't convert T4 to T3 well.</p>\n<p>In contract, two smaller uncontrolled studies (<a href=\"http://www.jad-journal.com/article/S0165-0327(06\">here</a>00014-0/abstract) and <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/16086620\">here</a>) reported good results from T3 treatment for treatment-resistant depression (H/T <a href=\"https://srconstantin.wordpress.com/2018/02/12/atypical-treatment-resistant-depression/\">Sarah Constantin</a>). Plus there are lots of anecdotal reports of benefits (see <a href=\"http://www.bayesianinvestor.com/blog/index.php/2017/12/28/ashwagandha-and-thyroid-hormones\">mine here</a>).</p>\n<p>There are real dangers from overdoses, and it's unclear how well researchers have measured the benefits, so it's easy to imagine that most doctors are erring on the side of inaction.</p>\n<p>My intuition says that there's plenty of room for making protocols that more safely determine the optimal dose. I don't have enough expertise to estimate how tractable that is.</p>\n<p>Another area where EAs might possibly provide an important benefit is Alzheimer's. There have been some <a href=\"http://www.bayesianinvestor.com/blog/index.php/2017/10/19/the-end-of-alzheimers/\">recent</a> <a href=\"https://www.ahcmedia.com/articles/142004-studies-find-cognitive-decline-reversible-even-if-patients-are-apoe4-positive\">claims</a> that there are strategies which substantially prevent Alzheimer's or reverse it in early stages. As far as I can tell, these claims aren't prompting as much research as they deserve.</p>\n<p>Some parts of those strategies are backed by small RCTs published in <a href=\"https://www.hindawi.com/journals/ijad/2013/586365/\">2013</a> and <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/21780182/\">2012</a>, and yet the first Google search result for Alzheimer's is still <a href=\"https://www.alz.org/\">a page</a> that says Alzheimer's &quot;cannot be prevented, cured or even slowed&quot;.</p>\n<p>I expect good research about Alzheimer's to be too expensive for EAs to fund directly, but it seem like we should be able to do something to nudge existing research funding into better directions.</p>\n", "parentCommentId": null, "user": {"username": "PeterMcCluskey"}}, {"_id": "Pt4Sd9u9NdEcn3HEc", "postedAt": "2018-02-26T02:39:17.152Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>I'm not sure I'd put it only on X-risk people. My understanding is that disease burden and DALYs are calculated using as a reference the highest life expectancy of any country by gender, which was previously Japanese women (now South Korean women?), and somewhere between 80 and 90 years. This means that deaths after this reference life expectancy simply don't count towards disease burden at all. I'd like to hypothesize that this and some of the downvotes may be due to what I suspect is a common intuition (perhaps not common in EA; I don't know): everyone ought to have an overall good life with a decent lifespan, i.e. &quot;fair innings&quot;. </p>\n<p>This &quot;fair innings&quot; might be part of why EAs are generally more concerned with global health and poverty than anti-aging. Maybe the stronger evidence for specific poverty/health interventions explains this better, though. </p>\n<p>Mostly guesses on my part, of course. </p>\n", "parentCommentId": "jcBBSpePBY7CW3j9K", "user": {"username": "MichaelStJules"}}, {"_id": "Lq7BGougKn3A2Xaj2", "postedAt": "2018-02-27T21:29:49.021Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Mind-Body dualism isn’t a productive framework. For many diseases you have a mix of “physical” and “psychological” effects. </p>\n", "parentCommentId": "RF6qWqHmSBfL5z49i", "user": {"username": "ChristianKleineidam"}}, {"_id": "ey2ZqTCopkKJwCqgc", "postedAt": "2018-02-27T21:30:35.273Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Your  article doesn’t mention Systemic Exertion Intolerance Disease (SEID). It’s the new name the Institute of Medicine (IOM) gave the disease.\nGiven that we are on the internet it’s helpful to work all relevant keywords into an article like this even if you don’t like the new name.</p>\n", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "PnMFjq8YfQ6HN8EQ8", "postedAt": "2018-02-27T21:35:39.232Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>After different forms of resting <a href=\"https://curetogether.com/chronic-fatigue-syndrome/ig/treatment-effectiveness-vs-popularity\">https://curetogether.com/chronic-fatigue-syndrome/ig/treatment-effectiveness-vs-popularity</a>\nLow-Dose Naltrexone seems to be the treatment that was reported as most beneficial on CureTogether for CFS. Fortunately there’s an <a href=\"https://cas.uab.edu/younger/2017/02/ldn-chronic-fatigue-syndrome-clinical-trial/\">ongoing clinical trial</a> to test  this treatment. </p>\n<p>I think the fact that there are some pearls in alternative medicine but there no efficient way to  find them is a more fundamental problem that is it’s own cause worth looking at.\nOur at LessWrong I wrote proposed Prediction-based Medicine. It would be possible to create a startup that puts <a href=\"https://www.lesserwrong.com/posts/TYA2nsPypoNaLsczd/prediction-based-medicine-pbm\">Prediction-based Medicine</a> to work and afterwards it would be possible for patients to go to alternative medicine providers who can reliably predict the treatment success they have for the patients.</p>\n<p>The startup would need a good team and some funding but Musk-level funding wouldn’t be required to put the idea effectively to work.</p>\n", "parentCommentId": "rdFuNa6TrMvbbbYa9", "user": {"username": "ChristianKleineidam"}}, {"_id": "nWC7KfkkZSi9BxtRF", "postedAt": "2021-06-29T20:53:21.727Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Thank you for this thoughtful and thorough post! I've been following this complex chronic condition for many years, as I have a personal connection to it. Fortunately, there has been significant progress made in leveraging awareness, funding, and research, particularly over the past year based on the connection to COVID and a post-infectious disease process. Thought I'd share links to a couple of organizations leading these efforts. One just had a fundraising campaign in May, along with research updates. The other is promoting a campaign that doubles donations 1:1, up to $1M, through the end of this month so only 1 day left!</p><p>Solve M.E.</p><p><a href=\"https://solvecfs.org/donate-to-the-solve-m-e-double-your-money-challenge/\"><u>https://solvecfs.org/donate-to-the-solve-m-e-double-your-money-challenge/</u></a></p><p>Open Medicine Foundation</p><p><a href=\"https://www.omf.ngo/the-end-mecfs-project/\"><u>https://www.omf.ngo/the-end-mecfs-project/</u></a></p>", "parentCommentId": null, "user": {"username": "Jordan Hoffman"}}, {"_id": "K267tts4shBJPr3Yv", "postedAt": "2021-06-29T21:00:00.809Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>Here's another related &nbsp;organization (studying the complex and dynamic relationship between microorganisms and human physiology/pathology) that I recently came across:</p><p>PolyBio Research Foundation</p><p><a href=\"https://polybio.org/\">https://polybio.org/</a>&nbsp;</p>", "parentCommentId": "nWC7KfkkZSi9BxtRF", "user": {"username": "Jordan Hoffman"}}, {"_id": "yKec8CisLjjJhTjxz", "postedAt": "2022-04-19T18:55:52.168Z", "postId": "CbYgMbEPDWgafPfyL", "htmlBody": "<p>The first link seems to be dead by now, the second one moved. Here are the most recent (archived) versions that I could find:&nbsp;</p><ul><li><a href=\"https://web.archive.org/web/20171230194806/http://curetogether.com/Chronic-Fatigue-Syndrome/ig/treatment-effectiveness-vs-popularity\">https://web.archive.org/web/20171230194806/http://curetogether.com/Chronic-Fatigue-Syndrome/ig/treatment-effectiveness-vs-popularity</a></li><li><a href=\"https://sites.uab.edu/younger/2017/02/23/ldn-chronic-fatigue-syndrome-clinical-trial/\">https://sites.uab.edu/younger/2017/02/23/ldn-chronic-fatigue-syndrome-clinical-trial/</a>&nbsp;<ul><li>&nbsp;<a href=\"https://web.archive.org/web/20190925152628/https://cas.uab.edu/younger/2017/02/ldn-chronic-fatigue-syndrome-clinical-trial/\">https://web.archive.org/web/20190925152628/https://cas.uab.edu/younger/2017/02/ldn-chronic-fatigue-syndrome-clinical-trial/</a></li></ul></li></ul><p>&nbsp;</p><p>If I understand it correctly, then the study you mention is scheduled to end in August 2022, this year: <a href=\"https://clinicaltrials.gov/ct2/show/NCT02965768\">https://clinicaltrials.gov/ct2/show/NCT02965768</a> (<a href=\"https://web.archive.org/web/20220419185404/https://clinicaltrials.gov/ct2/show/NCT02965768\">backup</a>)<br>It contains only 30 participants, but still better than nothing.</p>", "parentCommentId": "PnMFjq8YfQ6HN8EQ8", "user": {"username": "Michael Große"}}]