[{"_id": "FbyD25ksZ7vWRGnax", "postedAt": "2023-10-31T13:09:33.191Z", "postId": "cCH3KAjKnpzLzz7FH", "htmlBody": "<p>Bruno, it was really great to meet you at EAG!! Thank you for the work you're doing in Brazil :D&nbsp;</p>", "parentCommentId": null, "user": {"username": "Calum"}}, {"_id": "zpzf7eu8kXk6ofBaB", "postedAt": "2023-11-01T03:55:13.292Z", "postId": "cCH3KAjKnpzLzz7FH", "htmlBody": "<p>Hi Bruno,<br><br>I think we briefly saw each other at the Effective Giving meetup in Boston, but didn't get the chance to chat.<br><br>Would love to discuss charity evaluation in Brazil with you at greater length, and especially to get a sense from you as to the charities/NGOs working in nutrition policy advocacy in Brazil, as that's an area we've found to be highly cost-effective (https://exploratory-altruism.org/research-findings/), and we're presently evaluating such charities with a view of circulating evaluations/recommendations to our interested grantmaking partners in end-Nov/early-Dec.<br><br>Feel free to drop me an email (https://exploratory-altruism.org/contact/) if this sounds interesting to you and you want to continue this discussion!<br><br>Regards,<br>Joel</p>", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "p7F4RbKzxeGAA7tNb", "postedAt": "2023-11-01T16:29:09.475Z", "postId": "cCH3KAjKnpzLzz7FH", "htmlBody": "<p>Hey <a href=\"https://forum.effectivealtruism.org/users/calum?mention=user\">@Calum</a>! Likewise, it was a pleasure to meet you at EAG too! It goes without saying - although it has been said - that GiveWell is a major reference to what we do here in Brazil. Thank <strong>you</strong> for your work and for commenting. We're just getting started and have a long road ahead. We'll keep in touch! 😄</p>", "parentCommentId": "FbyD25ksZ7vWRGnax", "user": {"username": "Bruno Sterenberg"}}, {"_id": "2Khg5rvAFZZQiGGNB", "postedAt": "2023-11-01T17:02:38.749Z", "postId": "cCH3KAjKnpzLzz7FH", "htmlBody": "<p>Hey <a href=\"https://forum.effectivealtruism.org/users/joel-tan-cearch?mention=user\">@Joel Tan (CEARCH)</a>, thank you for your comment. Sorry we didn't have the time to meet in person at EAG Boston - it would have been a pleasure!<br><br>We would be delighted to discuss charity evaluation in Brazil at greater length. We have a great interest in this cause/area as well and would love to present you our work and hear your insights and thoughts, besides understanding potential opportunities for collaboration.<br><br>I'll reach you over email so we can schedule a call and keep the talk going!<br><br>Regards,<br>Bruno</p>", "parentCommentId": "zpzf7eu8kXk6ofBaB", "user": {"username": "Bruno Sterenberg"}}, {"_id": "5JMijuAjP2PfvvwZb", "postedAt": "2023-11-02T02:55:38.215Z", "postId": "cCH3KAjKnpzLzz7FH", "htmlBody": "<p>Hi Bruno,<br><br>I'm also brazilian and getting motivated to spread EA's ideas in our country, with a focus on the amazon region. I'm looking forward to keep up with doebem's work and maybe assist you somehow in the future.</p><p>Regards,</p>", "parentCommentId": null, "user": {"username": "Rafael Mousinho"}}, {"_id": "Kve5BPwRyaGXs5veh", "postedAt": "2023-11-02T15:16:12.558Z", "postId": "cCH3KAjKnpzLzz7FH", "htmlBody": "<p>Hey <a href=\"https://forum.effectivealtruism.org/users/rafael-mousinho?mention=user\">@Rafael Mousinho</a>,&nbsp;<br><br>Awesome to hear of your motivation to grow our community in the Amazon region! There's a big group up and running for EA Brazil on Slack and WhatsApp. Hit me up at <a href=\"mailto:bruno@doebem.org.br\">bruno@doebem.org.br</a> and I'll be happy to assist you in connecting with existing members all over the country.</p>", "parentCommentId": "5JMijuAjP2PfvvwZb", "user": {"username": "Bruno Sterenberg"}}]