[{"_id": "ZpCwacYsKNYRa6rqi", "postedAt": "2022-11-11T17:08:43.357Z", "postId": "CcNaQmrtdeC9PPixK", "htmlBody": "<p>I assume you mean something like “return the money to FTX such that it gets used to pay out customer balances”, but I don’t actually know how I’d go about doing this as an individual. It seems like if this was a thing lots of people wished to do, we’d need some infrastructure to make it happen, and doing so in a way that led to the funds having the correct legal status to be transferred back to customers in that fashion might be nontrivial.</p>\n<p>(Or not; I’m definitely not an expert here. Happy to hear from someone with more knowledge!)</p>\n", "parentCommentId": null, "user": {"username": "RavenclawPrefect"}}, {"_id": "bB8xK7cg9qYrRoCX6", "postedAt": "2022-11-11T17:15:29.037Z", "postId": "CcNaQmrtdeC9PPixK", "htmlBody": "<p>Yep this is a great point and overlaps with Vardev's comment. If I thought that the money was gained immorally, it would be pretty bad to just return it to the people who did the immoral thing!</p>", "parentCommentId": "ZpCwacYsKNYRa6rqi", "user": {"username": "sawyer"}}, {"_id": "wYfeoKLe9uhGAfSix", "postedAt": "2022-11-11T17:39:36.079Z", "postId": "CcNaQmrtdeC9PPixK", "htmlBody": "<p>FTX and 133 related entities have filed for bankruptcy in US court, so distribution of corporate assets will follow applicable law. Equity holders like SBF are last in line. However, if it's really bad there might not be enough to pay more than the costs of bankruptcy administration -- this is unlikely based on the petition that was filed.</p>\n", "parentCommentId": "bB8xK7cg9qYrRoCX6", "user": {"username": "Jason"}}, {"_id": "R9a3Ae9jxKjGSHeG6", "postedAt": "2022-11-11T17:43:10.652Z", "postId": "CcNaQmrtdeC9PPixK", "htmlBody": "<p>There is a Manifold Market on <a href=\"https://manifold.markets/ahalekelly/will-ftx-retail-investors-get-their\">the fraction of deposits expected to be recovered by FTX retail investors</a>.</p><p>Here is <a href=\"https://twitter.com/wassielawyer/status/1591099947461799936\">an informative thread</a> on the implications of the recent FTX Chapter 11 filing.</p>", "parentCommentId": "wYfeoKLe9uhGAfSix", "user": {"username": "Pablo_Stafforini"}}]