[{"_id": "YaqLe5jKKScobPQ3w", "postedAt": "2023-03-16T15:47:28.113Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>I think for most fisheries, the price elasticity of wild-caught fish supply, including fish caught specifically for fishmeal to feed farmed fish and shrimp, tends to be close to 0 and is sometimes even negative (when there's overfishing, which is common in developing countries). So, it's not clear you would have been responsible in expectation for many extra fishing deaths, and you might have even spared fish from fishing deaths in expectation by reducing the number that could be caught. See:</p>\n<ol>\n<li><a href=\"https://forum.effectivealtruism.org/posts/snnfmepzrwpAsAoDT/why-anima-international-suspended-the-campaign-to-end-live?commentId=5o6jpg6m47iJ6L2JK\">https://forum.effectivealtruism.org/posts/snnfmepzrwpAsAoDT/why-anima-international-suspended-the-campaign-to-end-live?commentId=5o6jpg6m47iJ6L2JK</a></li>\n<li><a href=\"https://reducing-suffering.org/should-fishing-opponents-be-happy-about-overfishing/\">https://reducing-suffering.org/should-fishing-opponents-be-happy-about-overfishing/</a></li>\n<li><a href=\"https://reducing-suffering.org/wild-caught-fishing-affects-wild-animal-suffering/\">https://reducing-suffering.org/wild-caught-fishing-affects-wild-animal-suffering/</a></li>\n</ol>\n<p>with the last two written from a suffering-focused perspective.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "JgHYb2odyvi6be6Z6", "postedAt": "2023-03-16T15:51:31.592Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Are you suggesting we should prefer to eat fish from species that are already overfished, to make their populations even more depleted and thus reduce the number that are suffering?</p>", "parentCommentId": "YaqLe5jKKScobPQ3w", "user": {"username": "robirahman"}}, {"_id": "XXdBaymfbD2ZJN4si", "postedAt": "2023-03-16T16:03:35.248Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>If that were the only important effect, maybe, because I'm also suffering-focused. But I'd rather say that I'm clueless about whether eating fish is good or bad. There are also other effects, like on small wild aquatic (and for farmed species, terrestrial) arthropods that could end up dominating and could go the other way, but I haven't thought enough about them. I think this is a reasonable position whether or not you're suffering-focused, as long as you're roughly utilitarian of some kind.</p>\n", "parentCommentId": "JgHYb2odyvi6be6Z6", "user": {"username": "MichaelStJules"}}, {"_id": "2bassgv4gpLBiAoMs", "postedAt": "2023-03-16T16:07:07.412Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Thank you! You’re laying out the argument well that if a previous omnivore eats seafood for every meal where they previously ate meat this will be harmful for animals.</p>\n<p>What I’d like to see is some empirical backing how much  pescetarians actually swap out seafood for meat given what you’re claiming in the title.</p>\n<p>You discuss your own experience of eating 2 pounds of salmon weekly, but when I was pescetarian I had a fish meal once every month or two. If omnivores switch to a pescetarian diet like mine that still seems like a win for animal welfare.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "PreCJNA57zoM59jEp", "postedAt": "2023-03-16T16:36:39.039Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Interesting, will check these out.&nbsp;</p><p>Given that many fish we eat come from farms (and that number is increasing), do you think these arguments still hold?</p>", "parentCommentId": "YaqLe5jKKScobPQ3w", "user": {"username": "Garrison"}}, {"_id": "DvvBhawqmcJZkthBr", "postedAt": "2023-03-16T16:47:01.036Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Unfortunately, I wasn't able to find good data on something that specific. Obviously, someone going from an omnivorous diet where they replace all land animals with plants and eat the same number of fish is going to consume fewer animals. But at least in my case, and in others of people I know, they increased their fish consumption as a result of going pescetarian.&nbsp;</p><p>There are also lots of recommendations to swap out land animals for fish for climate and health reasons, so I wanted to focus more on the animal welfare implications of doing that.&nbsp;</p>", "parentCommentId": "2bassgv4gpLBiAoMs", "user": {"username": "Garrison"}}, {"_id": "8D6EvSNzmkjDK8e5g", "postedAt": "2023-03-16T16:56:34.100Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>I think even with this line of thinking, the growth of insect farming specifically for use as feed for farmed aquatic animals probably tips this in the direction of \"bad\".</p>", "parentCommentId": "XXdBaymfbD2ZJN4si", "user": {"username": "Rockwell Schwartz"}}, {"_id": "6poXTBtgdi6NPvj8M", "postedAt": "2023-03-16T17:10:19.301Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>You're asking about whether farmed fish dominate anyway, right? I think the specific claims I made about wild fish (including wild fish caught to feed farmed fish) still hold, but it's possible that the main effects of eating fish, whether wild-caught or farmed, are on farmed fish, because</p><ol><li>if you eat more wild-caught fish, others will eat more farmed fish in expectation, because they're substitute goods, and</li><li>the weight of farmed fish produced will probably be more responsive to your diet decisions than the weight of fish caught from the wild is, because of greater price elasticity of supply, as wild fish stocks are limited and often exploited near the rate that gives maximum sustainable yield or are managed specifically to maintain stocks and catch (e.g. quotas).</li></ol><p>Still, I think there could be on the order of 10x more wild-caught anchovies than farmed fish (e.g. see the columns for % slaughtered/bred/used annually in <a href=\"https://forum.effectivealtruism.org/posts/pT7AYJdaRp6ZdYfny/estimates-of-global-captive-vertebrate-numbers#Fish\">this table</a>) and the population effects are probably larger than the catch effects (based on my toying with fishery models), and wild arthropods are even more numerous so could be impacted more. So, even if the effect by weight is smaller, the effect by number of individuals could be larger. Again, I still feel pretty clueless, as I haven't seen a model attempting to quantify all of these effects together. If you ignore wild arthropods (aquatic and terrestrial), I think there's a decent chance we could answer the question either way, but I'm less optimistic when you include wild arthropods.</p><p>On the other hand, eating fish could increase insect farming; aquaculture is a primary target market for farmed insects. See for example, <a href=\"https://insectfeed.nl/wp-content/uploads/2021/03/Rabobank_No-Longer-Crawling-Insect-Protein-to-Come-of-Age-in-the-2020s_Feb2021-1.pdf\">this report</a>.</p><p>For what it's worth, I also think wild arthropods could easily dominate all diet decisions in the near term in expectation, but if you ignore them, I'd guess eating relatively small farmed animals and their products, like shrimp, herbivorous farmed fish, chicken and eggs, is bad.</p>", "parentCommentId": "PreCJNA57zoM59jEp", "user": {"username": "MichaelStJules"}}, {"_id": "uMCu4GFGLs74wJzst", "postedAt": "2023-03-16T17:39:20.366Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>(Edited to correct my math and add the example at the bottom.)</p><p>That sounds possible to me, but again I feel very unsure and would want to work through some models before deciding. It still seems possible to me that the effects on wild arthropods (aquatic and terrestrial) could outweigh, even vastly outweigh, the effects on farmed insects. It could depend on which arthropods you count, what probabilities you assign to their consciousness and their expected moral weights, though, e.g. mites, springtails and zooplankton might be too unlikely to be conscious or not matter enough overall, but I suspect the number of them affected will be far more numerous than the number of affected farmed insects, at least in expectation.</p><p>Globally, there are an estimated</p><ol><li>10^17 to 10^19 terrestrial arthropods alive at any moment, according to&nbsp;<a href=\"https://reducing-suffering.org/how-many-wild-animals-are-there/\"><u>Tomasik, 2009</u></a> and <a href=\"https://doi.org/10.1073/pnas.1711842115\">Bar-On, Phillips, and Milo, 2018</a>.&nbsp;<a href=\"https://reducing-suffering.org/how-many-wild-animals-are-there/\"><u>Tomasik, 2009</u></a> has a breakdown.</li><li>10^18 copepods (small crustaceans)&nbsp;according to <a href=\"https://reducing-suffering.org/how-many-wild-animals-are-there/\"><u>Tomasik, 2009</u></a>.</li></ol><p>On the other hand, I expect the number of farmed insects to reach on the order of 10^11 to 10^12: <a href=\"https://insectfeed.nl/wp-content/uploads/2021/03/Rabobank_No-Longer-Crawling-Insect-Protein-to-Come-of-Age-in-the-2020s_Feb2021-1.pdf\">500,000 tonnes in 2030 by dry weight or dried protein meal</a>, and about 0.05 grams per dried black soldier fly larva, but they live around 14 days before slaughter, so I'd estimate the number alive at any time in 2030 to be:&nbsp;</p><p><a href=\"https://www.wolframalpha.com/input?i=%2814%2F365%29+*+%28500%2C000+tonnes+%2F+0.05+grams%29\">(14 days alive per BSF larva produced) * (1 year/365 days) * (500,000 tonnes of dried BSF larvae produced/year) / (0.05 grams/dried BSF larva produced) = 3.84 * 10^11</a>.</p><p>So that's at least around 1,000,000x more wild arthropods than farmed arthropods. On the other hand, we should expect a greater share of the farmed insects to be affected, possibly a far greater share, and insects should matter more on average and in expectation, but 1,000,000x is <i>a lot</i>.</p><p>For example, springtails are estimated to be \"100,000 individuals per square meter of ground\" (<a href=\"https://en.wikipedia.org/wiki/Springtail#Distribution\">wiki</a>). To match the number of farmed black soldier fly alive at any moment in 2030, you would need to affect 1 million square meters, or 1 square kilometer of soil (in a way that has a modest impact on their population or average welfare). When you scale that down to individual consumption choices, probably less than 1 millionth of this, it doesn't seem crazy for the springtails to be affected more, and possibly much more, in expectation. If a single farmed salmon is fed 1 kg of dried BSF larva meal*, that's something like <a href=\"https://www.wolframalpha.com/input?i=1+kg+%2F+0.05+grams\">20,000 individual BSF larvae</a> who would have lived around 14 days each. I think it's likely that more than 1 square meter of soil (so possibly more than 100,000 springtails per moment) is affected for more than 14 days in expectation for a few kg of other feed for one farmed salmon. So springtails could be affected far more.</p><p>*This is probably an overestimate, maybe 10x too high or more. Farmed salmon convert around 1 kg of dry feed into 1 kg of wet weight gained, and have final weights of around 3 to 6 kg, but insects would probably only make up around 5-15% of their feed by weight even for those that do include insects in their diets (similar to current fishmeal inclusion rates), and the vast majority probably still won't.</p>", "parentCommentId": "8D6EvSNzmkjDK8e5g", "user": {"username": "MichaelStJules"}}, {"_id": "rxWTymt2kXvHNvtkv", "postedAt": "2023-03-17T03:03:38.171Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Garrison - excellent Vox article; well done. I think I'll include it as required reading next time I teach my college course on Effective Altruism. It does a nice job of explaining some of the counter-intuitive results that can happen when we get serious about trying to quantify the suffering entailed from different diets.</p><p>I especially liked the evolutionary arguments about the adaptive value of nociceptors, pain, and capacity for suffering. It's very strange to me that some people doubt the sentience of other vertebrates. I mean, what do they think a central nervous system is for, if not to integrate information from positive and negative reinforcers to guide adaptive learning and behavior?</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "BPrRBa2ucxBzHykjr", "postedAt": "2023-03-17T04:16:00.705Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Great article! I think it's great that you're bringing attention to how well-meaning dietary choices like pescetarianism and swapping beef for chicken can inadvertently cause more suffering than the alternative.</p><p>That said, there remain some knock-on considerations which leave me undecided as to whether or not pescetarianism is better than a typical meat-eating diet:</p><ul><li>The magnitude of the difference between the suffering of a wild-caught fish's death through fishing and the expected alternative (most likely predation?) is very unclear to me.</li><li>Chickens are similar in size and perceived probability of sentience to the larger fish we eat. Since over 90% of chickens are factory farmed, and over 90% of fish are wild-caught, this weakly points to chicken consumption being worse.</li><li>The size of fish people eat seems very relevant, with anchovies seeming much worse than larger fish like salmon. It's plausible that one's particular diet within pescetarianism could determine whether they place above or below a typical meat-eater. For example, a diet of only <a href=\"https://dianaverse.com/2020/04/07/bivalveganpart1/\">oysters and mussels</a> is almost certainly better than the typical meat-eating diet, but a diet of only shrimp is likely much worse.</li><li>The net effects of wild-caught fishing on wild animal suffering seem <a href=\"https://reducing-suffering.org/wild-caught-fishing-affects-wild-animal-suffering/\">extremely unclear</a>.</li></ul>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "BAJCnh9ta3hnYgDtM", "postedAt": "2023-03-17T15:48:50.012Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Wow, thanks so much – very cool to hear!</p><p>Totally agreed RE the central nervous system!</p>", "parentCommentId": "rxWTymt2kXvHNvtkv", "user": {"username": "Garrison"}}, {"_id": "G6pjQoeYXfbASCrPR", "postedAt": "2023-03-19T08:39:26.247Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Hi Garrison,</p><p>The effects on the welfare of wild arthropods and nematodes resulting from a given diet are super unclear. So, since <a href=\"https://forum.effectivealtruism.org/posts/ayxasxhHWTvf6r5BF/scale-of-the-welfare-of-various-animal-populations\">I think</a> these will be the drivers for the nearterm effect on welfare, I would say it is pretty hard to be confident of which diet is better. In general, wild animal welfare dominates, which means more energy-efficient plant-based diets will be better/worse if you assume wild arthropods and nematodes have negative/positive lives.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "8qx9vbwFQwfEBXEq4", "postedAt": "2023-05-03T15:37:44.966Z", "postId": "Cd8wM4jZPnaAA8vwX", "htmlBody": "<p>Fin Moorhouse <a href=\"https://twitter.com/finmoorhouse/status/1636705469463945224\">asked</a> something along these lines on Twitter. Pasting his question and my response below:</p><p>Fin: \"Great article. I'm curious: are there estimates for how many extra fish deaths are caused by fishing wild-caught fish, especially high on the food chain (like tuna and salmon)? Seems complicated if fishing diminishes fish stocks and ∴ reduces predation in the long run?\"</p><p>Me: \"I didn't come across any. I think this is an interesting line of reasoning, and it makes me a bit more uncertain about the ethics of wild-fishing, but ultimately, it doesn't move me much.&nbsp;</p><p>Why?&nbsp;</p><p>1. If killing predators in the wild is good, why stop at fish? Why not systematically hunt tigers and lions to extinction? Some people bite this bullet, but I feel like we don't know nearly enough to know what the welfare effects of such a large ecosystem change would be.&nbsp;</p><p>2. Given how clueless we are, I think that having clear signals that we care about the wellbeing of others is more robust than coming up with a byzantine diet where eating wild-caught predator fish is good, but eating other kids of fish is bad.&nbsp;</p><p>As our knowledge of the world gets better, I think diets like vegetarianism and veganism are more likely to lead to good welfare outcomes, both because they're easier memes to spread &amp; because someone eating wild-caught fish because they are predators may have motivated reasoning to keep eating them even when our understanding of the welfare effects change.</p>", "parentCommentId": "YaqLe5jKKScobPQ3w", "user": {"username": "Garrison"}}]