[{"_id": "QTbefqSggKg9uvuu7", "postedAt": "2024-02-27T14:28:23.084Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>Thanks for the post, Owen. Too bad it is being downvoted<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefqunyiccpvrr\"><sup><a href=\"#fnqunyiccpvrr\">[1]</a></sup></span>&nbsp;based on considerations which presumably do not have to do with its own merit.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnqunyiccpvrr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefqunyiccpvrr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Now it has 20 karma in 28 votes.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "9vjDJMk7tsz2chJi5", "postedAt": "2024-02-27T15:21:00.788Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>Eh, I'm in favour of people up- or down-voting based on what they feel like doing.&nbsp;</p><p>(Though if someone who's downvoted wants to express what they wish I had done, given that I've been thinking about these topics and guess at least some readers would find the content useful, I'm interested. I'm currently unclear whether there's something I've missed, or if people just feel kind of vaguely negative and want to express that without a particular view of what should have been done instead. I'm planning to post a brief discussion of how this relates to some of my mistakes on the second essay, which seemed to be the most natural place to include it.)</p>", "parentCommentId": "QTbefqSggKg9uvuu7", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "YXmJvuFR5hKZ8kvLQ", "postedAt": "2024-02-27T17:27:56.376Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>An even more modest ask for people who downvoted the post: please agreevote this comment if your downvote was significantly influenced by who the author is, and disagreevote this comment if it was not.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefzl7onrtjvkn\"><sup><a href=\"#fnzl7onrtjvkn\">[1]</a></sup></span>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnzl7onrtjvkn\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefzl7onrtjvkn\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm aware of the downsides of polls conducted in the comment section. I think that using a single comment to ask a binary question, rather than a multiple-choice mechanism requiring a bunch of comments to implement, at least mitigates those concerns.</p></div></li></ol>", "parentCommentId": "9vjDJMk7tsz2chJi5", "user": {"username": "Jason"}}, {"_id": "dqQbGDqXGB3mgafQe", "postedAt": "2024-02-27T17:39:57.575Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>I'm a little hesitant to comment here as I'm not sure whether its helpful, but it could potentially (lots of qualifiers...) come across as inappropriate to some folks for Owen to be writing a series on the specific topic of \"wholesomeness\" given what happened, and the recent very public reflection on the forum here. If the post was about some completely unrelated topic that might feel different? Especially because in this post there isn't any self-reflection on the elephant in the room which feels a bit off - although this might be coming in future posts.<br><br>Or I could be off base here.<br><br>&nbsp;</p>", "parentCommentId": "YXmJvuFR5hKZ8kvLQ", "user": {"username": "NickLaing"}}, {"_id": "ihdbMCXHRggzK3BYj", "postedAt": "2024-02-27T19:11:06.857Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>I agree that it would have been better for Owen to at least briefly address that elephant early in the main text rather than noting in a comment that a brief discussion is planned for the second essay. I'm undecided on the broader question of whether it is advisable for him to be writing essays on \"wholesomeness\" at this point in time.</p>", "parentCommentId": "dqQbGDqXGB3mgafQe", "user": {"username": "Jason"}}, {"_id": "ryuCN9fch7qYW2FFu", "postedAt": "2024-02-27T19:12:39.593Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p><strong>Executive summary</strong>: Acting wholesomely means contributing well to the whole system around us without introducing unnecessary friction, by paying attention and being receptive to what would make things better.</p><p><strong>Key points</strong>:</p><ol><li>Acting wholesomely means avoiding unwholesome things that create imbalance or tension. This leverages emotional intelligence to notice issues.</li><li>It involves understanding impacts on the whole system around us and seeking harmony within it. Wholesomeness relates to virtue and sincerity but puts more emphasis on effects on others.</li><li>Making wholesome judgments requires giving issues time and space to appreciate all facets. Simply optimizing risks losing touch with the whole picture.</li><li>There will always be some unwholesomeness. Relating to it like a wise parent is better than ignoring or demonizing it.</li><li>Adopting a posture of wholesomeness, receptively and firmly seeking to improve things, encapsulates proper integration of yin and yang.</li><li>This concept pulls together things the author has long known; putting them into words can help people more intentionally practice wholesomeness.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "yqnShxWACvzxrGxzY", "postedAt": "2024-02-27T21:20:13.075Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>Thanks both. Yeah I kind of knew that writing on this topic was unusually likely to make people unhappy with me. But I'm still not certain what if anything I should have done differently. I don't really want to not share thinking I think may be (nontrivially) helpful for some people just because it will make others unhappy with me (if there's a deeper harm than \"making people unhappy with me\" which I'm not tracking, that might change my view). And I also don't really want to make it about my issues, something I suspect that many people have spent more than enough time engaging with already (though I'm super happy to have peripheral conversation on that, it feels like putting it in the post proper would be an error by making it more about me than I think it should be).</p><p>I guess I'm leaning towards agreeing it would have been better to acknowledge the issue up-front, and posted a longer comment at the time of making the post talking a little about this, saying that of course people might reasonably have suspicion of my judgement on some of these topics, but for obvious reasons I've spent some time dwelling on them and wanting to share what I've got, etc.</p><p>BTW, as I'm alluding to there: it's not total coincidence that this is a topic that I've been thinking about, since one of several generators for the thinking was \"without fixing my mistaken beliefs, what kind of basic shift in orientation might nonetheless have helped me to avoid past errors\". I don't think it's a *majority* generator, and think e.g. SBF is a larger part. However, finding a frame which simultaneously seemed to give good answers to \"how could things have been different to reduce issues with SBF\" and also \"how could I have oriented differently to reduce risk of harmful errors in the vicinity of attraction\" provided some boost to my thinking that there was really something helpful and worth sharing.</p>", "parentCommentId": "ihdbMCXHRggzK3BYj", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "tgFbbRc3JRSS9327h", "postedAt": "2024-02-27T21:27:24.455Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>I imagine this summary not being super helpful to people.</p><p>More specifically:</p><ul><li>I think the executive summary is fine</li><li>The first sentences of each of Key points 1, 2, and 3 are all sort of pointing to the same point<ul><li>If they were combined in one key point that would probably work</li><li>Unfortunately the second sentence in each case is making a different point, so the flow could be a bit confusing<ul><li>The second sentence of Key point 2 doesn't feel very key</li></ul></li></ul></li><li>Key point 4 is pretty good</li><li>Key point 5 kind of feels like nonsense (like if I squint I can see what it's saying, but I don't expect it to be helpful for any readers of the summary)</li><li>Key point 6 is not inaccurate, but I wouldn't have guessed it was very key</li></ul><p>Of course it's possible I'm too close to the source material to judge well! Do as you will with the feedback :)</p>", "parentCommentId": "ryuCN9fch7qYW2FFu", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "ouTr2qB4LvDWEz6Nn", "postedAt": "2024-02-29T06:50:00.402Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>Another aspect I would be interested in exploring is a gendered analysis of what lead to the mistake. I think it is super helpful that reflections on what lead to the mistake is done in public, I think it is potentially super valuable for a movement like EA with quite skewed gender demographics. But while perhaps the exact circumstance around what happened is unique, I could imagine it to be part for something like \"male entitlement\" or other parts of a culture that has gendered elements. In other words, I think every time a male transgresses towards a female, it is possible to frame it in terms of wholesomeness, asocial behavior, etc. But this might miss the point that when it comes to the frequency of transgressions, they are much more frequent from males towards females than the other way around, so it seems such individualistic analysis misses an important driver of all such behavior.&nbsp;<br><br>In danger of writing too long, it is a bit like safety incidents on airplanes: Each incident can be explained in terms of a missing bolt, or the missed replacement of some seal. However, all these incidents together might point at another causal factor: A lax safety culture.</p>", "parentCommentId": "dqQbGDqXGB3mgafQe", "user": {"username": "Ulrik Horn"}}, {"_id": "fyzETdbRoEhxrmtyq", "postedAt": "2024-02-29T23:11:03.425Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>I worry 'wholesomeness' overemphasizes doing what's comfortable and convenient and feels good, rather than what makes the world better:</p><ul><li>As mentioned, wholesomeness could stifle visionaries, and this downside wasn't discussed further.</li><li>Fighting to abolish slavery wasn't a particularly wholesome act, in fact it created a lot of unwholesome conflict. <a href=\"https://www.bloomberg.com/news/newsletters/2024-02-13/ai-protest-at-openai-hq-in-san-francisco-focuses-on-military-work\">Protests</a> aren't wholesome. I expect a lot of important future work to look and feel unwholesome. (I'm aware you could fit it into the framework somehow, but it's an awkward fit.)</li><li>I worry it'll make EA focus even more on creating a cushy environment for its own members (further expanding its parental leave policy and mental health benefits for the third time and running wonderful team retreats in fancy retreat centers), rather than on getting important things done in the world.</li></ul><p>Things like <a href=\"https://forum.effectivealtruism.org/posts/q7WwTuZQWMqDEEoWM/virtues-for-real-world-utilitarians\">virtues</a> and <a href=\"https://forum.effectivealtruism.org/posts/CfcvPBY9hdsenMHCr/integrity-for-consequentialists-1\">integrity</a> in my opinion do a better job at addressing the naïve consequentialist failure modes that wholesomeness is supposed to address.</p>", "parentCommentId": "QTbefqSggKg9uvuu7", "user": {"username": "Jonas Vollmer"}}, {"_id": "PxiRNc37AnaXS2D57", "postedAt": "2024-02-29T23:56:36.479Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>I definitely think it's important to consider (and head off) ways that it could go wrong!</p><p>Your first two bullets are discussed a bit further in the third essay which I'll put up soon. In short, I completely agree that sometimes you need visionary thought or revolutionary action. At the same time I think revolutionary action -- taken by people convinced that they are right -- can be terrifying and harmful (e.g. the <a href=\"https://en.wikipedia.org/wiki/Cultural_Revolution\">Cultural Revolution</a>). I'd really prefer if people engaging in such actions felt some need to first feel into what is unwholesome about them, so that they're making the choices consciously and may be able to steer away from the most harmful versions.</p><p>On your third point, I kind of feel the other way? Like I think it feels wholesome to have a certain level of support for staff, but lots of cushy benefits doesn't really feel wholesome, and I feel is more likely to come from people in an optimizing \"how do we make ourselves attractive to staff?\" mindset. (Am I an outlier here? Does it feel wholesome to you to have cushy benefits for staff?)</p><p>Edit: On the third point, I do think that emphasising wholesomeness would lead to fewer people pushing themselves to the point of burnout. I have mixed feelings about this. The optimistic view is that it would help people to find healthy sustainable balances, and also help reduce people being putoff because of seeing burnout. The pessimistic view is that it would lead to just less work, and also perhaps less of a culture of taking important things very seriously.</p>", "parentCommentId": "fyzETdbRoEhxrmtyq", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "4iCTakDr2MtLqSQPJ", "postedAt": "2024-03-01T04:37:12.012Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>Thanks for writing this, a pleasure to read as always.</p><p>I must admit I come away being rather confused by what you mean by 'wholesomeness'. Is wholesomeness basically consequentialism but with more vibes and less numbers? Your account makes it seem quite close to consequentialism. It also seems really close to virtue ethics - you try to differentiate it by saying it rejects <i>\"focus[ing] single-mindedly on excelling at one virtue\" </i>but my impression was that virtue ethics was all about balance the golden median anyway. And then it seems pretty close to sincerity/integrity also.</p><p>I was especially confused by this section:</p><blockquote><h3>Clean / traditional living</h3><p>Working a normal respectable job, going to church on Sundays, staying sober and off drugs, avoiding sexual promiscuity or strange counterculture — these are all kinds of “clean” living that might sometimes be called “wholesome”.</p><p>Often they will also be somewhat wholesome on my concept. Over-indulgence in general, and addiction in particular, are unwholesome as they ground in an imbalanced sense of priorities. And, all else equal, there is something wholesome about comporting with the culture around us. However, all else is not always equal. There’s something wholesome about letting people do the things they’re drawn to, and unwholesome about puritanically suppressing that. Moreover, there’s something important and wholesome about people experimenting — both for their own learning, and ultimately to find better ways for things to be.</p></blockquote><p>Apparently the activities I think most people would be most likely to label wholesomeness are only <i>\"often... somewhat\"</i> wholesome. And I think most people would basically never describe experimenting with drugs as wholesome. Maybe it might be good, but if it is good its good for some other reason (like it's educational), not because its wholesome.</p><p>I think you actually have a really revisionist account of 'wholesomeness' - so revisitionist I think you should probably just pick a new word. It seems like you are trying to rely on some of the vibes of the word while giving it a new meaning which fixates on the word 'whole' to the neglect of the actual historical denotation. Samwise is one of the most wholesome characters I know, but it's not because he was attending to the whole of Middle Earth - it's because of his courage and humility, and his loyalty to Frodo, Rosie and the Shire. A good officer - or Denethor - comes much closer to attending to the whole, but that doesn't mean his batsman isn't more wholesome.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "mGeLzvrKw9bmNcGNQ", "postedAt": "2024-03-01T09:44:52.640Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<blockquote><p>Is wholesomeness basically consequentialism but with more vibes and less numbers?</p></blockquote><p>I think it's partially that (where the point of the vibes is often that they're helpful for tracking things which aren't directly good/bad, but have an increased chance of causing good/bad things down the line). It's also a bit like \"consequentialism, but with some extra weight on avoiding negative consequences to things you're interacting with\" (where the point of this is that it distributes responsibility in a sensible way across agents).</p><blockquote><p>I think you actually have a really revisionist account of 'wholesomeness' - so revisitionist I think you should probably just pick a new word.</p></blockquote><p>I agree that my sense is somewhat revisionist, although I think it's more grounded in the usual usage than you're giving it credit for. I did consider choosing a different word, but after talking it through with some folks felt better about \"wholesome\" than the alternatives. The main way in which I care about the vibes of the existing word is for people putting it into practice. I think if people ask of an action they're considering \"what are the ways in which this might not be wholesome?\", it will be easy to feel answers to that question. If I try to define \"holistically-good\" and then people ask \"what are the ways in which this might not be holistically-good?\", I think they'll more get caught up in explicit verbal models and not notice things which they might have caught as answers to the first question.&nbsp;</p><p>Put another way: one of my guiding principles for this is to try to have an account of things such that I think it could lead to people doing the good ambitious versions of EA, but such that I find it hard to imagine SBF trying to follow it could have made the same mistakes, even if there was motivated cognition towards doing so. Stuff about side constraints doesn't really feel robust enough to me. If there's a new term it could be vulnerable to a lot of reinterpretation. Anchoring in the existing term serves to resist that.</p><p>Maybe I'm supposed to more explicitly separate out the thing you do felt mental checks for from the thing that you overall choose to pursue? I'm worried that gets contrived.&nbsp;</p>", "parentCommentId": "4iCTakDr2MtLqSQPJ", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "atqycaRwQSHrZdJ7A", "postedAt": "2024-03-01T13:45:48.465Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>I'm not sure how central this is to your point, but for what it's worth I think you may be overestimating the degree to which I'd disagree with normal judgements about what's wholesome. I would also basically never describe experimenting with drugs as wholesome. (Maybe I'd make an exception if someone was travelling to a country where they were legal in order to experiment with things that might relieve pain from a chronic condition or something; of course it would depend on the details of their attitude.)</p>\n<p>I think that it wouldn't be unusual, though, to describe it as more wholesome to have got drunk one or two times in college than to have been too straight laced ever to do that. (I say, as someone who has never got drunk.)</p>\n<p>Overall I feel like I agree with the normal senses of unwholesome and add some extra things which I regard as unwholesome, which normally might not register. Then in some circumstances the least-unwholesome action on my account will be one that involves some of the regular sense of unwholesomeness.</p>\n", "parentCommentId": "4iCTakDr2MtLqSQPJ", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "KJreiChCbxai4c7dt", "postedAt": "2024-03-03T09:34:43.903Z", "postId": "cDdTbDPQW8s6XTgJw", "htmlBody": "<p>This is the <a href=\"https://forum.effectivealtruism.org/posts/nm7PxHXYwiK6Kx962/wholesome-culture#Wholesomeness_and_visionaries\">relevant section of the third essay</a> on visionaries/revolutionaries.</p>", "parentCommentId": "PxiRNc37AnaXS2D57", "user": {"username": "Owen_Cotton-Barratt"}}]