[{"_id": "uegpHJM9nXYSKcKf5", "postedAt": "2023-12-15T12:00:51.624Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Hi Vasco, quickly responding to a few of your points here</p><p><i>Let its donors know that donating to GHDF in its current form has a similar effect to donating to AGF (if that is in fact the case), instead of just describing GHDF as a “higher-risk” “higher-reward” alternative (to TCF). “Donating to this fund [GHDF] is valuable because it helps demonstrate to GiveWell that there is donor demand for higher-risk, higher-reward global health and development giving opportunities”.&nbsp;</i></p><ul><li>I do think that the GHDF is more committed to doing something like maximising the impartial good for currently alive people more than GiveWell (in principle), though it also has less capacity to do so. I think GiveWell is a pretty confusing organisation in some ways (e.g. on their site I think they claim to care about things that aren't just cost-effectiveness -, but to me, it clearly seems like you should just care about cost-effectiveness and whilst some of the things that GiveWell says they care about might be good proxies/signals they really are (imo) <i>only</i> to be used as proxies or signals of cost-effectiveness and not additional factors.<ul><li>To be clear, I am not advocating for narrow cost-effectiveness estimates that ignore important nth-order effects (e.g. I think that it's plausible that the Gates Foundation <a href=\"https://(https://www.gatesnotes.com/Mosquito-Wars)\">decreased their spending on bed nets</a> due to GiveWell/OP moving a lot of money into the space, and this funging effect would ideally be accounted for in the cost-effectiveness estimate.</li></ul></li><li>When I speak to GiveWell/OP GHW employees, it seems like they agree with me - but I don't know how to reconcile this with their site + stuff like supporting GiveDirectly for a long time despite thinking there were things more than 5x as good as cash transfers. I also suspect that I am substantially more excited about things like deworming than they are (though probably less than the mean dev economist).</li><li>(I'm also a little surprised that you think the GWWC GHW fund is a more reasonable option than the GHDF, it seems to me to have a much shorter track record and I'm pretty confused about the HLI rec (and fwiw the THL rec on the animal side)</li></ul><p>&nbsp;</p><p><i>Consider appointing additional fund managers independent from GiveWell. I do not recall seeing a public call for fund managers, and I guess it would have attracted more people than a private one. I also assume a short post on eventual attempts to find fund managers would have been useful.&nbsp;</i></p><ul><li>writing a post sounds like a good idea, appointing additional fund managers is definitely something I have considered several times.<ul><li>If people are interested in being a fund manager feel free to ping me on the forum with a list of your qualifications for the role (or other evidence for why you might be a good fit)</li></ul></li></ul><p><i>Consider accepting applications. Jason suggested it could “start taking applications that would previously have been within EAIF’s scope, so that there is a relatively seamless transition for potential and established grantees” (see EA Infrastructure Fund's Plan to Focus on Principles-First EA).</i></p><ul><li>seems reasonable but this mostly hinges on are there people that we trust to evaluate the applications and tbh I haven't come across many people who I think would do an excellent job relative to GiveWell recs - if you think there are lots of excellent people I am very interested in hearing names.</li><li>I do think that my bar for funding something is higher than other GHW donors - e.g. I think lots of successful GHW CE charities (some of which are run by people I really admire and are personal friends of mine) are very unlikely to beat the very best other donation options I am aware of - and imo the main purpose of funding these kinds of narrow GHW charities it almost entirely for the value of discovering that it beats the very best GHW charities we are already aware of + have room for funding.</li></ul>", "parentCommentId": null, "user": {"username": "calebp"}}, {"_id": "EfbwoKaTqywdW4NEy", "postedAt": "2023-12-15T15:00:36.044Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p><strong>Executive summary: </strong>The author believes donations to GiveWell's funds or Giving What We Can's Global Health and Wellbeing Fund are better options than donating to EA Funds' Global Health and Development Fund for improving global health and development, and suggests ways for the latter fund to improve.</p><p><strong>Key points:</strong></p><ol><li>Donating to GiveWell's All Grants Fund or unrestricted funds has a similar effect to donating to EA Funds' Global Health and Development Fund.</li><li>Giving What We Can's Global Health and Wellbeing Fund allows further evaluation of health evaluators and may fund other organizations in the future.</li><li>The EA Funds' fund should clarify it has a similar effect as GiveWell's funds, consider additional independent managers, and potentially accept applications.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "sAFohRg5mnGDD8Dv6", "postedAt": "2023-12-15T15:45:25.081Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Thanks for the clarifying comments, Caleb!</p><blockquote><p>I think GiveWell is a pretty confusing organisation in some ways (e.g. on their site I think they claim to care about things that aren't just cost-effectiveness -, but to me, it clearly seems like you should just care about cost-effectiveness and whilst some of the things that GiveWell says that care about might be good proxies/signals they really are (imo) <i>only</i> to be used as proxies or signals of cost-effectiveness.</p></blockquote><p>I very much agree cost-effectiveness is all that matters, in the sense that one would ideally maximise the benefits for a given amount of resources. Of course, as you point out, this does not mean the cost-effectiveness number outputted by the spreadsheet is all that matters! It is often hard to formalise all factors which influence cost-effectiveness, and so the actual cost-effectiveness estimates one obtains are not everything. Nevertheless, my impression is that GiveWell's cost-effectiveness estimates are pretty close to encompassing all their thinking. Elie <a href=\"https://podcast.clearerthinking.org/episode/096/elie-hassenfeld-why-it-s-so-hard-to-have-confidence-that-charities-are-doing-good/\">mentioned</a> on the Clearer Thinking podcast that:</p><blockquote><p>GiveWell cost- effectiveness estimates are not the only input into our decisions to fund malaria programs and deworming programs, there are some other factors, but they're certainly 80% plus of the case.</p></blockquote><p>This is in line with what you said about Open Phil and GiveWell agreeing with you.</p><blockquote><p>I'm also a little surprised that you think the GWWC GHW fund is a more reasonable option than the GHDF, it seems to me to have a much shorter track record and I'm pretty confused about the HLI rec</p></blockquote><p>Thanks for questioning! I have clarified my reasons a little more updating the 1st 2 bullets of the section <a href=\"https://forum.effectivealtruism.org/posts/CDt5ShpdABZRn8Tvi/my-quick-thoughts-on-donating-to-ea-funds-global-health-and#Case_for_donating_to_Giving_What_We_Can_s_Global_Health_and_Wellbeing_Fund\">Case for donating to Giving What We Can's Global Health and Wellbeing Fund</a> to:</p><blockquote><ul><li>Welcomes further evaluation of the process behind the recommendations of GiveWell and other evaluators in the global health and wellbeing space (e.g. Happier Lives Institute), trusts GWWC’s research team to identify evaluators to rely on, and wants the evaluations to be published, as in GWWC’s<a href=\"https://forum.effectivealtruism.org/posts/PTHskHoNpcRDZtJoh/gwwc-s-evaluations-of-evaluators\">&nbsp;<u>evaluations of evaluators</u></a>. These would be my main reasons for donating to GHWF instead of GHDF, which has not produced public evaluations of GiveWell's recommendations.</li></ul></blockquote><p>From your comment, it sounds like you have some concerns about GiveWell's recommendation process, which I think would be worth expanding on more publicly.</p><blockquote><p>[\"accepting applications\"] seems reasonable but this mostly hinges on are there people that we trust to evaluate the applications and tbh I haven't come across many people who I think would do an excellent job relative to GiveWell recs - if you think there are lots of excellent people I am very interested in hearing names.</p></blockquote><p>I guess a public call might be helpful to find such people. Rethink Priorities might be open to doing some evaluations? They have been commisioned by GiveWell, and have experience incubating new projects.</p><blockquote><p>I do think that my bar for funding something is higher than other GHW donors</p></blockquote><p>Do you have a cost-effectiveness bar as a fraction of the cost-effectiveness of GiveDirectly? It may be better to be explicit about it. GiveWell's <a href=\"https://forum.effectivealtruism.org/posts/aLNEXzr6buXR8L6hB/open-philanthropy-s-2023-2025-funding-of-usd300-million\">is</a> 10, and I believe Open Phil's <a href=\"https://www.openphilanthropy.org/research/our-planned-allocation-to-givewells-recommendations-for-the-next-few-years/\">is</a> 20.</p><blockquote><p>I think lots of successful GHW CE charities (some of which are run by people I really admire and are personal friends of mine) are very unlikely to beat the very best other donation options I am aware of - and imo the main purpose of funding these kinds of narrow GHW charities it almost entirely for the value of discovering that it beats the very best GHW charities we are already aware of + have room for funding.</p></blockquote><p>Fair points. Maybe such charities will eventually (not initially) go on to use funds which would otherwise have gone to less effective charities?</p>", "parentCommentId": "uegpHJM9nXYSKcKf5", "user": {"username": "vascoamaralgrilo"}}, {"_id": "EAwzpzPrcwTkSGCgs", "postedAt": "2023-12-15T16:24:17.036Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>I am obviously biased (I co-manage the fund), so please bear that in mind. But I'd like to throw in Founders Pledge GHD fund as another GHD option- it's not the case that you have to be an FP member to donate to this fund.<br><br>We tend to fund GiveWell-style recs (e.g. AMF) alongside things that we think are higher risk but potentially more impactful/ younger orgs that we want to get up to scale quickly. Recent grants have included: 1DaySooner to try and speed up malaria vaccine roll-out, <a href=\"https://www.essentialimpact.org/what-we-do\">Essential</a> for research into producing low-cost proteins in East Africa, Ubongo, Suvita, LEEP, &nbsp;r.i.c.e for kangeroo mothercare, Family Empowerment Media, Taimaka. Some stuff that we're currently checking out include Pure Earth, other lead research-y things, and some anti-corruption stuff via my colleague Vadim.&nbsp;<br><br>I'm especially interested in things which could be very good, but might fall outside the bounds of the current GHD funding ecosystem (e.g. things that are not super amenable to RCTs, orgs that are too young to get mainstream funders but too old for seed funding, urgent things that require a very quick turnaround).&nbsp;<br><br>Full disclosure that we haven't been the best at publicly publishing evaluations- due to capacity, but still. I hope to improve this/ generally provide more resources about how we do grantmaking from the fund over the next year or so.&nbsp;</p>", "parentCommentId": null, "user": {"username": "RBettle"}}, {"_id": "QgsGZwsuGDySH6SRm", "postedAt": "2023-12-15T18:20:07.814Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Thanks for sharing, Rosie!</p><blockquote><p>I'm especially interested in things which could be very good, but might fall outside the bounds of the current GHD funding ecosystem</p></blockquote><p>The scope of Founders Pledge's global health and development <a href=\"https://www.founderspledge.com/funds/global-health-and-development-fund\">fund</a> was different in the recent past, right? From the 1.70 M$ (= 1.22 + 0.100413 + 0.231672 + 0.05125 + 0.1) you have granted from November 2020 to September 2023<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8kd5rp3jd6o\"><sup><a href=\"#fn8kd5rp3jd6o\">[1]</a></sup></span>&nbsp;(BTW, the website says 1.3 M$), it looks like 1.22 M$ (= 0.05 + 0.16 + 0.17918 + 0.03 + 0.02 + 0.07 + 0.125 + 0.05 + 0.05 + 0.1 + 0.1 + 0.05 + 0.112 + 0.100027 + 0.012498 + 0.011733), i.e. 71.8 % (= 1.22/1.70) have&nbsp;gone to organisations already supported by funders aligned with effective altruism:</p><ul><li>Evidence Action <a href=\"https://www.givewell.org/research/grants/Evidence-Action-Accelerator-renewal-march-2022\">has</a> been supported by GiveWell.</li><li>Lead Exposure Elimination Project <a href=\"https://www.charityentrepreneurship.com/lead-exposure-elimination-project\">was</a> incubated by Charity Entrepeneurship.</li><li>Effektiv Spenden <a href=\"https://www.openphilanthropy.org/grants/effektiv-spenden-general-support/\">has</a> been supported by Open Phil.</li><li>New Incentives is one of <a href=\"https://www.givewell.org/charities/top-charities\">GiveWell's top charities</a>.</li><li>The Life You Can Save was part of the initial effective giving movement.</li><li>Family Empowerment Media <a href=\"https://www.charityentrepreneurship.com/family-empowerment-media\">was</a> incubated by Charity Entrepeneurship.</li><li>r.i.c.e. <a href=\"https://www.givewell.org/research/grants/rice-kangaroo-mother-care-november-2022\">has</a> been supported by GiveWell.</li><li>Effective Altruism Australia <a href=\"https://funds.effectivealtruism.org/grants?search=Effective+Altruism+Australia&amp;sort=round\">has</a> been supported by the EA Infrastructure Fund.</li><li>Suvita <a href=\"https://www.charityentrepreneurship.com/suvita\">was</a> incubated by Charity Entrepeneurship.</li><li>Malaria Consortium is one of <a href=\"https://www.givewell.org/charities/top-charities\">GiveWell's top charities</a>.</li><li>Against Malaria Foundation is one of <a href=\"https://www.givewell.org/charities/top-charities\">GiveWell's top charities</a>.</li><li>Sightsavers <a href=\"https://www.givewell.org/research/grants/sightsavers-deworming-cameroon-nigeria-February-2022\">has</a> been supported by GiveWell.</li><li>University of Washington <a href=\"https://www.givewell.org/research/incubation-grants/University-of-Washington-deworming-planning-grant-March-2022\">has</a> been supported by GiveWell.</li></ul><blockquote><p>Full disclosure that we haven't been the best at publicly publishing evaluations- due to capacity, but still. I hope to improve this/ generally provide more resources about how we do grantmaking from the fund over the next year or so.</p></blockquote><p>Thanks for being open about this! For readers reference, Founders Pledge's global health and development <a href=\"https://www.founderspledge.com/funds/global-health-and-development-fund\">fund</a> has made 21 grants, and published 8 write-ups, but these only have 1 paragraph each. <a href=\"https://docs.google.com/document/d/1ZzSFwsXEJMZPmtcaQtqP4ilt7jUkCPQx8xKEiUYsPLs/edit\">Here</a> is the one respecting the grant to Family Empowerment Media in August 2022:</p><blockquote><p>The GHD Fund granted $70,000 to FEM for a program that uses radio broadcasts to inform people in Nigeria about modern forms of contraception. In Nigeria, contraceptives are available, but many women are reluctant to use them due to misconceptions such as the belief that IUDs or birth control pills can cause infertility. FEM is seeking to raise 50% of their operating budget for 2023. This grant will go towards these operating costs, enabling them to reach more women with their broadcasts. A secondary goal of this grant is to put FEM in a stronger position to apply for funding for a randomized controlled trial; if such funding is received, they will be better able to assess impact and, if evidence is promising, to raise considerably more capital.</p></blockquote><p>GHDF has reports of a few sentences too, but it is effectively managed by people at GiveWell, which does in-depth research to inform their recommendations. I think it would be valuable for you to explain your reasoning if you depart from GiveWell's recommendations.</p><p>Overall, I would recommend GiveWell’s<a href=\"https://www.givewell.org/all-grants-fund\">&nbsp;<u>All Grants Fund</u></a> or<a href=\"https://www.givewell.org/unrestricted-fund\">&nbsp;<u>unrestricted funds</u></a>, or GWWC's<a href=\"https://www.givingwhatwecan.org/charities/global-health-and-wellbeing-fund\">&nbsp;<u>Global Health and Wellbeing Fund</u></a><u> over Founders Pledge's</u>&nbsp;<a href=\"https://www.founderspledge.com/funds/global-health-and-development-fund\"><u>Global Health and Development Fund</u></a><u>.</u></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8kd5rp3jd6o\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8kd5rp3jd6o\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Dates of the latest and most recent grants on the <a href=\"https://www.founderspledge.com/funds/global-health-and-development-fund\">website</a>.</p></div></li></ol>", "parentCommentId": "EAwzpzPrcwTkSGCgs", "user": {"username": "vascoamaralgrilo"}}, {"_id": "Btp2BDfb3Cz2JaAqW", "postedAt": "2023-12-15T19:09:20.854Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Hey Vasco,</p><p>RE: most of the funding going to groups which are already in the EA ecosystem- yep, I think this is correct. I still think this is compatible with the statement of 'being especially interested in stuff falling outside the main GHD ecosystem' though,&nbsp;and that the grantmaking focus has changed somewhat in the last year or two.<br><br>* r.i.c.e we granted to an early stage (before they were GiveWell supported) when they were having a severe funding crunch.<br>* FEM, Suvita and LEEP we evaluated and granted to at an early stage. I think there's value here in 'identifying promising charities and getting up to scale asap'.<br>* Our most recent grants aren't up on the website yet: I don't think (? could be wrong) 1daysooner's malaria stuff has gotten EA funding yet, Ubongo isn't EA supported afaik, or Essential.<br><br>It's true though that a lot of FP GHD grantmaking is stuff that's already supported by the EA community. I could have been clearer here; our guiding principle is just 'whatever we think is most cost-effective' and many of the existing EA-supported orgs still have funding gaps that are highly cost-effective. Aka I wouldn't want to prioritise something that sounds cool on a 'this is new basis' over something that is already known in EA, and is more cost-effective. Most of the decisions that I really agonise over are 'does this <strong>really</strong> beat bednets? Most things don't beat bednets, and I'm aware that most things seem less cost-effective as more researcher hours go into probing them'. I do think it is possible though to &nbsp;to find funding opportunities in the 'falling outside the current GHD ecosystem and &gt;10X in expectation' space though, and these have been some of my favourite grants.<br><br>RE: the scope of Founders Pledge's global health and development <a href=\"https://www.founderspledge.com/funds/global-health-and-development-fund\">fund</a> being different in the past. This was before my time (I joined FP maybe 1.5 years ago) but yes, I would say that our scope has changed a little to be somewhat more risk tolerant (while still focusing on evidence base) and figuring out where our comparative advantages are (speed being one of them).<br><br>RE: being more open with evaluations; yeah I totally agree with you, and think you're right that explaining when we depart from GiveWell is esp important. (Some places where we've just started to do this: <a href=\"https://forum.effectivealtruism.org/posts/8qXrou57tMGz8cWCL/are-education-interventions-as-cost-effective-as-the-top\">Vadim's education work</a>, my <a href=\"https://forum.effectivealtruism.org/posts/cfFokZu7mH7SKCjwH/mass-media-interventions-probably-deserve-more-attention\">mass media stuff</a>. But I haven't published actual FO evals as often). IMO our evals are rigorous, without being as in-depth as GiveWell; there's a process of understanding the area (some of our cause area reports are on the EA forum), then a ~25 page ish eval &amp; CEA, and red-teaming. Our rapid grants are shorter, but still have an eval, CEA/ BOTEC + red-teaming.&nbsp;<br><br><br>&nbsp; &nbsp;&nbsp;</p>", "parentCommentId": "QgsGZwsuGDySH6SRm", "user": {"username": "RBettle"}}, {"_id": "sAWugZ485ofbPeTDd", "postedAt": "2023-12-15T19:46:25.693Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Thanks for elaborating, Rosie! I said over 90 % of the grants you made were to organisations already supported by EA, but I have now corrected it to 71.8 % (see 2nd paragraph of my comment). I was relying on the total money granted displayed on the website, but I do not think it is correct. Now I am just adding up the amount of all the grants there.</p><blockquote><p>FEM, Suvita and LEEP we evaluated and granted to at an early stage (I think we did the first EA-style evals of them? my bad if another funder org did this before us and I didn't realise). I think there's value here in 'identifying promising charities and getting up to scale asap'.</p></blockquote><p>The 3 organisations above were incubated by Charity Entrepeneurship (see links in my previous comment), which is very much aligned with effective altruism, so I assume they take most of the credit for their existence and evaluation.</p><blockquote><p>Our most recent grants aren't up on the website yet: I don't think (? could be wrong) 1daysooner's malaria stuff has gotten EA funding yet, Ubongo isn't EA supported afaik, or Essential.</p></blockquote><p>Open Phil <a href=\"https://www.openphilanthropy.org/grants/?q=1day+sooner\">has</a> granted 2.1 M$ to 1Day Sooner from 2020 to 2021. I also do not recall EA-aligned funders supporting Ubongo or Essential. I think you could link to the websites of these organisations in the page of your fund, as you did for the other grants.</p>", "parentCommentId": "Btp2BDfb3Cz2JaAqW", "user": {"username": "vascoamaralgrilo"}}, {"_id": "Z7AezxvRZx3LCrMu3", "postedAt": "2023-12-15T19:59:10.073Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<blockquote>\n<p>Nevertheless, my impression is that GiveWell's cost-effectiveness estimates are pretty close to encompassing all their thinking. Elie mentioned on the Clearer Thinking podcast that:</p>\n</blockquote>\n<p>Fwiw I feel quite confused about how different GiveWell's recommendations would be if they were solely optimising for cost-effectiveness, I have heard different versions of how much they are optimising for this already based on different people that I speak to (and my impression is that most public materials do not say they are solely optimising for this).</p>\n<blockquote>\n<p>Do you have a cost-effectiveness bar as a fraction of the cost-effectiveness of GiveDirectly? It may be better to be explicit about it. GiveWell's is 10, and I believe Open Phil's is 20.</p>\n</blockquote>\n<p>I think the bar for the first dollar should be better than the best charity I'm aware of that has room for funding (which is probably at least 20x cash - I'd guess higher). The bar for the last dollar is a bit confusing because of funding effects.</p>\n", "parentCommentId": "sAFohRg5mnGDD8Dv6", "user": {"username": "calebp"}}, {"_id": "PNThy3mMZzRjWizB8", "postedAt": "2023-12-15T20:07:56.766Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>correct: to be absolutely clear, CE and the orgs themselves definitely incubated and developed the first CEAs for the CE charities (not us!). Thanks for this, will edit my comment. What I meant was is that evaluating and supporting orgs in the 'no longer a seed stage charity but also not yet at scale' stage is a key role that I see for the FP GHD fund, and I think we've had previous success here.<br><br>Yep, 1DS' pandemic preparedness has been supported by OP. And thanks, I will mention to our comms team. FYI that our impact report is upcoming onto the website, which will list all recent grantmaking.<br><br>(also cheers for this post, and making the subtleties &amp; differences between different GHD funds etc clearer!)</p>", "parentCommentId": "sAWugZ485ofbPeTDd", "user": {"username": "RBettle"}}, {"_id": "oKjAuMvWWditoES49", "postedAt": "2023-12-17T17:40:21.971Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<blockquote><p>. . . . I think lots of successful GHW CE charities (some of which are run by people I really admire and are personal friends of mine) are very unlikely to beat the very best other donation options I am aware of &nbsp;. . . .</p></blockquote><p>This implies a crux to me. Presumably the people running these charities seek funding from EA sources, despite knowing that counterfactually the bulk of that money would otherwise go to AGF/GHDF/et al. Do you think they disagree with your assessment of their effectiveness, perhaps due to different moral weights?</p><p>I'm not suggesting your assessment is wrong -- my own tentative view is that there aren't (m)any places <i>with room for large amounts of funding</i> that would beat GiveWell AGF or similar on pure QUALYs (or equivalent).</p><blockquote><p>main purpose of funding these kinds of narrow GHW charities it almost entirely for the value of discovering that it beats the very best GHW charities we are already aware of + have room for funding</p></blockquote><p>That's a second crux, I think. While that is an important purpose, it is not as predominant a purpose in my view. There are lots of monies out there that are practically restricted in a way that precludes AGF et al. from competing for them. This could be due to pre-defined government/foundation grant areas, or due to an individual donor's personal preferences, or a non-EA donor's desire for some higher quantum of warm fuzzies than organizations like AMF can provide. If we don't have anything to offer in those areas, we are conceding them to less effective charities.</p><p>All funding niches have low-hanging fruit and monies that are harder to acquire. For instance, speaking from personal experience, there are a lot of US evangelical Christians who won't donate to an organization unless it is Christian-flavored enough. As you might guess, I do not share that view -- but it is what it is, and some people with these views are wealthy. <a href=\"https://forum.effectivealtruism.org/posts/D2wfYhB4rAMPkSnPt/kaleem-s-shortform?commentId=t6kNbZB2DKdHhihKx\">Kaleem's recent quick take on zakat</a> provides another possible example. Other donors really want to donate to mental-health causes, etc. Meanwhile, most GiveWell-recommended charities are significantly operating in a specific zone of fundraising (i.e., donors open to all sorts of charities without any self-imposed limitations). Thus, while it likely isn't cost-effective to fund organizations that operate in niches merely for the QUALYs they produce, it may be beneficial to support them in their earlier stages until they are developed enough to mine their niche for non-EA resources effectively.</p><p>&nbsp;Another consideration is that it is unlikely that the current top GHW charities will be as effective in ~20-30 years. It's plausible, albeit unlikely, that we will see PEPFAR levels of funding for malaria vaccines in the next decade or so. (Who would have predicted PEPFAR would have happened, and under Bush II at that?) Infectious disease and malnutrition generally become less overwhelming of a problem as a society develops economically. So an effective GHW field that doesn't grow and develop is unlikely to remain particularly effective in the long run.</p><p>That being said: while more cost-effective GHW meta opportunities may well exist, it may be rather difficult to find and evaluate many of them (outside of charity evaluators and effective-giving group support where the causal chain to impact is easier to determine). I'm curious, though, whether/why that would be so much harder in GHW than in longtermism or animal welfare (which do have EA Funds that will consider requests formerly fielded by EAIF). Is it primarily inherent to GHW meta work, or is it more a function of who is skilled up &amp; available to do that evaluation?</p>", "parentCommentId": "uegpHJM9nXYSKcKf5", "user": {"username": "Jason"}}, {"_id": "CXspdihsLLSepbyjC", "postedAt": "2023-12-22T22:36:34.795Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Hi Vasco and Caleb, we appreciate the interest in the Global Health and Development Fund! This is Isabel Arjmand responding on behalf of GiveWell.</p><p>We're grateful for the opportunity to manage this fund, and we think it's a great opportunity for donors who want to support highly cost-effective global health and development programs. We're also interested in having more in-depth conversations with Caleb and others involved in EA Funds about what the future of this fund should look like, and we’ll reach out to schedule that.</p><p>In the meantime, here are some notes on our grantmaking and how donations to the fund are currently used.</p><ul><li><strong>We expect the impact of giving to the Global Health and Development Fund (GHDF) is about the same as giving to&nbsp;</strong><a href=\"https://www.givewell.org/all-grants-fund\"><strong><u>GiveWell's All Grants Fund</u></strong></a><strong>: both go to the most impactful opportunities we've identified (across programs and organizations), and are a good fit for donors who'd like to support the full range of our grantmaking, including higher-risk grants and research.</strong> The online description of GHDF was written before the All Grants Fund existed (it launched in 2022), and the two funds are now filling a very similar niche. Caleb, we'd love to collaborate on updating the GHDF webpage to both reflect the existence of the All Grants Fund and include more recent grant payout reports.</li><li><strong>In the broadest sense, GiveWell aims to maximize impact per dollar. </strong>Cost-effectiveness is the primary driver of our grantmaking decisions. But, “overall estimated cost-effectiveness of a grant” isn't the same thing as “output of cost-effectiveness analysis spreadsheet.” (<a href=\"https://blog.givewell.org/2011/11/10/maximizing-cost-effectiveness-via-critical-inquiry/\"><u>This blog post</u></a> is old and not entirely reflective of our current approach, but it covers a similar topic.)</li><li><strong>The numerical cost-effectiveness estimate in the spreadsheet is nearly always the most important factor in our recommendations, but not the&nbsp;</strong><i><strong>only&nbsp;</strong></i><strong>factor.&nbsp;</strong>That is, we don’t solely rely on our spreadsheet-based analysis of cost-effectiveness when making grants.&nbsp;<ul><li>We don't have an institutional position on exactly&nbsp;<i>how</i> much of the decision comes down to the spreadsheet analysis (though Elie's take of \"80% plus\" definitely seems reasonable!) and it varies by grant, but many of the factors we consider outside our models (e.g. qualitative factors about an organization) are in the service of making impact-oriented decisions. See&nbsp;<a href=\"https://blog.givewell.org/2023/10/27/how-we-work-1-cost-effectiveness/\"><u>this post</u></a> for more discussion.&nbsp;</li><li>For a small number of grants, the case for the grant relies heavily on factors other than expected impact of that grant per se. For example, we sometimes make exit grants in order to be a responsible funder and treat partner organizations considerately even if we think funding could be used more cost-effectively elsewhere.</li><li>To add something to our&nbsp;<a href=\"https://www.givewell.org/charities/top-charities\"><u>top charities list</u></a> (vs. make a grant from the&nbsp;<a href=\"https://www.givewell.org/all-grants-fund\"><u>All Grants Fund</u></a> /&nbsp;<a href=\"https://funds.effectivealtruism.org/funds/global-development\"><u>GHDF</u></a>), we want a high degree of confidence in the program. See our list of additional criteria for top charities&nbsp;<a href=\"https://www.givewell.org/how-we-work/criteria#Additional_Criteria_for_Top_Charities\"><u>here</u></a>; some of those criteria aren't proxies for cost-effectiveness, but are instead capturing whether a program provides the confidence and direct case for impact that donors expect from that product.&nbsp;</li><li>Also, we recognize it was confusing to have GiveDirectly on our top charity list when we believed our other top charities were substantially more cost-effective. Now, our list of top charities is limited to the programs that we think can&nbsp;<i>most</i> cost-effectively use marginal funding (currently, programs we believe to have room for more funding that is at least 10x unconditional cash transfers); see the fourth bullet point&nbsp;<a href=\"https://www.givewell.org/how-we-work/criteria#Additional_Criteria_for_Top_Charities\"><u>here</u></a>.</li></ul></li></ul>", "parentCommentId": "Z7AezxvRZx3LCrMu3", "user": {"username": "GiveWell"}}, {"_id": "5LbJ3DT8jAJxGEjXk", "postedAt": "2023-12-23T06:33:00.925Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Thanks for sharing your thoughts, Jason! I noticed it was downvoted. Excluding my strong upvote and your vote, it would have -7 karma for 2 votes. Caleb's strong downvote is worth -7, so he (or other person) might have strongly downvoted your comment anticipating it would be significantly upvoted by others, which in this case did not happen. I think it makes sense to strongly downvote comments which are only a few words, and have already tens of karma, but I believe substantive comments with not much karma like yours should only be strongly downvoted if they are offensive or have major factual errors. In addition, to the extent this is case, I think downvoters would ideally point out the errors.</p>", "parentCommentId": "oKjAuMvWWditoES49", "user": {"username": "vascoamaralgrilo"}}, {"_id": "cGu96vrFKbeFGY5Mt", "postedAt": "2024-01-06T11:31:25.299Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<blockquote><p>Presumably the people running these charities seek funding from EA sources, despite knowing that counterfactually the bulk of that money would otherwise go to AGF/GHDF/et al.</p></blockquote><p>This presumption isn't always true. In 2019, at CSH we made a deliberate decision not to continue seeking funding from sources that would counterfactually donate to GiveWell top charities.&nbsp;</p>", "parentCommentId": "oKjAuMvWWditoES49", "user": {"username": "katriel"}}, {"_id": "JApYJ6MK2mQGjTQbj", "postedAt": "2024-01-06T11:47:08.506Z", "postId": "CDt5ShpdABZRn8Tvi", "htmlBody": "<p>Thanks for clarifying, Katriel. For readers reference, CSH stands for <a href=\"https://www.charityentrepreneurship.com/charity-science-health\">Charity Science Health</a>.</p>", "parentCommentId": "cGu96vrFKbeFGY5Mt", "user": {"username": "vascoamaralgrilo"}}]