[{"_id": "64eX7eqyPAakeuDzT", "postedAt": "2015-06-24T01:25:20.484Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I am very intrigued by the potential upside of this idea. As I see it, one can change charity culture by changing consumer demand (generally what GiveWell does), which will eventually lead to a change in product. Alternatively, one can change charity culture by changing the product directly, on the assumption that many consumers care more about the brand than the product.</p>\n<p>Would the service be free to the nonprofits? Would it help nonprofits conduct studies to assess their impact?</p>\n<p>Anecdata: I have a friend who works at a big-name nonprofit who has been trying to find exactly this service.</p>\n", "parentCommentId": null, "user": {"username": "mhpage"}}, {"_id": "BftNFmijXcDQXbZBx", "postedAt": "2015-06-24T03:11:50.274Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>Except for the purposes of obtaining more epistemic information later on, the general agreement within the EA crowd is that one should invest the vast majority of eggs in one basket, the best basket. </p>\n<p>I just want to point out the exact same is the case here, where if someone wants to make a charity more effective, choosing oxfam or the red cross would be a terrible idea, but trying to make AMF, FHI, SCI etc more effective would be a great idea.  </p>\n<p>Effective altruism is a winners take all kind of thing, where the goal is to make the best better, not to make anyone else be as good as the best. </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "9dWfo4iEsNW2ZD7Ak", "postedAt": "2015-06-24T03:35:50.229Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>This is true with respect to where a rational, EA-inclined person chooses to donate, but I think you're taking it too far here. Even in the best case scenario, there will be MANY people who donate for non-EA reasons. Many of those people will donate to existing, well-known charities such as the Red Cross. If we can make the Red Cross more effective, I can't see how that would not be a net good.</p>\n", "parentCommentId": "BftNFmijXcDQXbZBx", "user": {"username": "mhpage"}}, {"_id": "c39Qo2yKrMmp5TGwt", "postedAt": "2015-06-24T07:05:14.861Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I think this is a great area to experiment with, so I'd be keen for people to just go and try it on a small scale and see what works.</p>\n<p>One problem to bear in mind is that the best EA content is about cause selection and intervention selection, and charities are usually unwilling to change these dimensions. Whereas there's already a lot of advice for people who just want to implement an intervention more effectively.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "9GH6QR3NKhLnHhHfL", "postedAt": "2015-06-24T14:47:34.537Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>If you can make an organisation that deals with billions of dollars 1% more effective, I think that could have a similar outcome to making an effective charity that works with millions of dollars 1% more effective.</p>\n<p>There may be more scope for change as well if it isn't that effective to begin with.</p>\n<p>Also getting higher up an organisation will lead to greater opportunities to change it from within rather than always staying outside because they aren't as efficient.</p>\n", "parentCommentId": "BftNFmijXcDQXbZBx", "user": {"username": "DavidNash"}}, {"_id": "cpsgE9Q4myky2P3Ly", "postedAt": "2015-06-24T16:21:46.516Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I’ve recently chatted with Tara of CEA about this and my recent post on <a href=\"http://effective-altruism.com/ea/ih/incentivizing_charity_cooperation/\">raising the effectiveness waterline</a> goes in a similar direction. Such programs will be limited to charities that operate in areas that allow for high effectiveness, and the charity has to be willing to do it of course.</p>\n<p>My first charitable interpretation of the situation was that if a charity has the potential to be highly effective given its cause area and is willing to optimize its effectiveness but still fails to be on par with a top charity in the same area, they must be lacking in something that is hard to obtain, namely specialized knowledge they can get from the top charity. A cooperation between the charities would furthermore serve to thwart wasteful competition between the charities.</p>\n<p>Tara’s experience with nonprofit counseling with Toyota, however, has been that what such charities lacked was not so much this specialized knowledge but general skills in accounting, controlling, and I don’t fully remember what else she mentioned. If the most salient problems of these charities are in such general areas, then a general EA consultancy firm would make sense.</p>\n<p>The services of such a consultancy firm may be highly subsidized from donations, but I think the charity will be more likely to implement advice that it has paid for, and that should also make it easier for the consultancy firm to pay its bills. I haven’t done any calculations, but it feels to me like it will be very hard to keep this sort of operation afloat financially.</p>\n<p>An alternative might be to find an existing, established consultancy firm with knowledge in the area of nonprofits that is ready to advise charities as to how they can maximize impact rather than just fundraising success. An EA funder, a charity, and this company could then agree on prices and a cofunding plan. This will usually involve lots of money, though, since this sort of optimization will be most cost-effective with charities that move a lot of non-EA donations, and those charities will be large and complex.</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "WtWGcpG99wZmPNpsk", "postedAt": "2015-06-24T17:18:29.651Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>At the end of the day, the metric will always be the same. If you can make the entire red cross more effective, it may be that each unit of your effort was worth it. But if you anticipate more and more donations going to EA recommended charities, then making them even more effective may be more powerful. </p>\n<p>See also DavidNash  comment. </p>\n", "parentCommentId": "9dWfo4iEsNW2ZD7Ak", "user": {"username": "Diego_Caleiro"}}, {"_id": "pf9JYaJx4qy7ZnFAX", "postedAt": "2015-06-24T17:43:51.206Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>Of course. But as I understand it, the hypothesis here is that given (i) the amount of money that will invariably go to sub-optimal charities; and (ii) the likely room for substantial improvements in sub-optimal charities (see DavidNash's comment), that one (arguably) might get more bang for their buck trying to fix sub-optimal charities. I think it's a plausible hypothesis.</p>\n<p>I'm doubtful that one can make GiveWell charities substantially more effective. Those charities are already using the EA lens. It's the ones that aren't using the EA lens for which big improvements might be made at low cost.</p>\n<p>EDIT: I suppose I'm assuming that's the OP's hypothesis. I could be wrong.</p>\n", "parentCommentId": "WtWGcpG99wZmPNpsk", "user": {"username": "mhpage"}}, {"_id": "8jbsicJmh8MiGGmjp", "postedAt": "2015-06-24T20:55:15.750Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>Yes this is indeed my hypothesis; thank you for stating it so plainly. I think you've summed up my initial idea quite well.</p>\n<p>My assumption is that trying to improve a very effective charity is potentially a lot of work and research, while trying to improve an ineffective but well funded charity, even a little, could require less intense research and have a very large pay-off. Particularly given that there are very few highly effective charities but LOTS of semi-effective, or ineffective ones, meaning there is a larger opportunity. Even if only 10% of non EA charities agree to improve their programs by 1% I believe the potential for overall decrease in suffering is greater.</p>\n<p>There is also the added benefit of signalling. Having an organization that is working to improve effectiveness (despite of funding problems [see Telofy's comment]) shows organizations that donors and community members really care about measuring and improving outcomes. It plants the idea that effectiveness and an EA framework are valuable and worth considering. Even if they don't use the service initially.</p>\n<p>My thought here is this is another way (possibly a very fast one) to spread EA values through the charity world. Creating a shift in nonprofit culture to value similar things seems very beneficial.</p>\n", "parentCommentId": "pf9JYaJx4qy7ZnFAX", "user": {"username": "SydMartin"}}, {"_id": "dWdTc9beknRKYTpZD", "postedAt": "2015-06-24T21:28:32.421Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>The question I would ask then is, if you want to influence larger organization, why not governmental organizations, which have the largest quantities of resources that can be flipped by one individual? If you get a technical position in a public policy related organization, you may be responsible for substantial changes in allocation of resources. </p>\n", "parentCommentId": "8jbsicJmh8MiGGmjp", "user": {"username": "Diego_Caleiro"}}, {"_id": "5GQDErLDfrfpg8Ebk", "postedAt": "2015-06-24T21:34:54.227Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I agree that trying to branch out to, or add an EA cause to a current charities is unlikely to succeed. My experience is that you are right - there are lots of services and advice out there for charities that want to improve implementation or strategy (mainly focused around cultivating donors).</p>\n<p>I would be interested to know if there are many resources out there aimed at getting organizations to collect more data. To asses their success rates more scientifically. It is also my understanding that the advice out there for creating more effective implementation is usually based around just getting better numbers, not if those numbers actually make change in a given cause area.</p>\n<p>What would you suggest is a good place to start for small scale experimentation? I think you are right, just doing some of this is the best way to gauge tractability. </p>\n", "parentCommentId": "c39Qo2yKrMmp5TGwt", "user": {"username": "SydMartin"}}, {"_id": "WzJxY4cMqEMcmSeiu", "postedAt": "2015-06-24T21:39:09.020Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I agree. The bulk of the variance in 'charity effectiveness' looks to be along intervention lines. If charities are fairly hard to budge on these, then it looks less likely that efforts to shift the entire distribution of charities to the right are going to work better than focusing on the extreme right tail in the first place.</p>\n", "parentCommentId": "c39Qo2yKrMmp5TGwt", "user": {"username": "Gregory_Lewis"}}, {"_id": "NJijMZQ8x2AM88xgC", "postedAt": "2015-06-24T21:41:15.738Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I think that governmental orgs would be a great way to do this!</p>\n<p>I do worry that doing this as an individual has it's draw backs. I think getting to this sort of position requires ingraining yourself into a dysfunctional culture and I worry about getting sucked into the dysfunction, or succumbing to the multiple pressures and restraints within such an organization. Whereas an independent organization could remain more objective &amp; focused on effectiveness.</p>\n", "parentCommentId": "dWdTc9beknRKYTpZD", "user": {"username": "SydMartin"}}, {"_id": "YTK9cZr8r3LztXbcw", "postedAt": "2015-06-25T02:27:29.565Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I'm interested in helping organizations collect more data, using independent surveys of households to measure bed net usage, as well as surveys around deworming programs. One organization that conducts independent surveys is <a href=\"http://pma2020.org/\">PMA2020</a>. They currently have family planning and WASH surveys, but may add additional modules in the future.</p>\n", "parentCommentId": "5GQDErLDfrfpg8Ebk", "user": {"username": "tjmather"}}, {"_id": "Nz98fYTpin4EgN4WQ", "postedAt": "2015-06-28T04:49:38.410Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>Some relevant organisations:</p>\n<p><a href=\"http://giving-evidence.com/about/\">http://giving-evidence.com/about/</a></p>\n<p><a href=\"http://www.thinknpc.org/\">http://www.thinknpc.org/</a></p>\n<p><a href=\"http://www.bridgespan.org/\">http://www.bridgespan.org/</a></p>\n<p>There's also the whole 'strategic philanthropy' scene generally:</p>\n<p><a href=\"http://www.ssireview.org/up_for_debate/article/strategic_philanthropy\">http://www.ssireview.org/up_for_debate/article/strategic_philanthropy</a></p>\n", "parentCommentId": "5GQDErLDfrfpg8Ebk", "user": {"username": "Benjamin_Todd"}}, {"_id": "Y4poqfjdAfk2SRnAJ", "postedAt": "2015-07-05T17:05:45.660Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>In the world of animal protection, we have Faunalytics (formerly Humane Research Council). I'm the founder and executive director, full disclosure. We've been around for 15 years, since before &quot;EA&quot; became a common term, but that's essentially what we do. We're a nonprofit research provider and we encourage animal charities to collect and utilize data. We identify and summarize third-party research that is relevant to animal advocacy, conduct fee-for-service projects for animal groups, and carry out independent studies to further animal advocacy. We are a backbone organization that does not directly advocate for animals ourselves, but strive to make animal charities more effective. I'd be happy to talk about our experience sometime or you can learn more at <a href=\"https://faunalytics.org\">https://faunalytics.org</a> </p>\n", "parentCommentId": null, "user": {"username": "chegreen"}}, {"_id": "EWwQwGpuq69MEb3ew", "postedAt": "2015-07-22T03:15:34.093Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>When I met Holden Karnofsky (the executive director of Givewell) at the 2014 Effective Altruism Summit, I asked him if Givewell ever intended to consult or revamp charities to become more effective rather than just evaluating and recommending already effective charities. He said no. His reason for this is because he believes it's substantially more difficult to create an effective charity than evaluate existing ones. I'm inclined to agree with him, as the risks and rewards of creating a charity are spread across the whole non-profit world, not jeopardizing the potential value of Givewell's marginal resources. Note I just mean I now think it makes sense for Givewell not to go into consulting, but I still think others need try to create effective charities.</p>\n<p>Note Mr. Karnofsky's statement reflects the position of Givewell's leadership, but this doesn't mean other effective altruists working for, aligned with, or near Givewell couldn't get involved in such a project. Givewell already values independent thinking among its employees, exemplified by their annual blogs about where each of its research employees intends to donate and why.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "xqThPcdnNb5ndjQc2", "postedAt": "2015-07-22T03:18:53.853Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>For your information, if effective altruism was to spearhead such consulting projects, they probably won't be initiated by Givewell (see <a href=\"http://effective-altruism.com/ea/ka/revamping_existing_charities/4f3\">my comment here</a>). The Centre for Effective Altruism, in particular Effective Altruism Ventures, might be the best organization poised to initiate such work.</p>\n", "parentCommentId": "cpsgE9Q4myky2P3Ly", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "y8BPCTMK8DBJjmTJN", "postedAt": "2015-07-22T03:22:26.453Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>Ben Todd made <a href=\"http://effective-altruism.com/ea/ka/revamping_existing_charities/479\">this comment here</a> detailing organizations he knows about (sort-of) working in that vein. Try forwarding that list to your friend!</p>\n", "parentCommentId": "64eX7eqyPAakeuDzT", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "GTCD5vagNKb6Dbd7z", "postedAt": "2015-07-24T23:24:07.824Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I'm inclined to agree with Holden for a number of reasons. First and foremost being that this isn't really what GiveWell does. They are very good at what they do, which is evaluate existing charities; while I see the tie-in with knowing how a good charity is run, it is a far cry from making organizational changes. Which is the other reason I agree with him, doing this is hard. Like really, really, substantially <em>hard</em>.</p>\n<p>However I think <em>hard</em> and 'not worth doing' are very different things. I also agree that CEA or EA Ventures would be more appropriate venues to incubate a testable idea around this. After speaking with Kerry at CEA about this he agrees that while this is very exciting and something that would be great, no one yet seems to have a good answer for how to go about doing this. I think the next step is more asking lots and lots of people how they would go about doing this, what the very first change would, should, or could be.</p>\n", "parentCommentId": "EWwQwGpuq69MEb3ew", "user": {"username": "SydMartin"}}, {"_id": "j229f8gd7K9sjQJua", "postedAt": "2020-08-12T13:05:50.668Z", "postId": "Ce4pHskhve8XKua7P", "htmlBody": "<p>I am really intested to hear if some of this was implemented in a concrete project? We as Effective Altruism Netherlands receive an increasing amount of requests from very skilled people (e.g. from finance, data science, legal professions and change management) who want to contribute to existing charities. We are currently talking to effective charities to see if they need skilled volunteers, but I have strong doubts they can meet all the demand from skilled volunteers.</p><p>Letting them work at existing less effective charities, making them more effective, could be worthwile for the reasons mentioned in this post. We can provide volunteers with some formal training and standardized methods to ensure high quality. I&#xB4;ve looked into Benjamin Todd&#xB4;s post and we could try to collaborate with one of the organisation mentioned there.</p><p>Does anyone here have any shareable experiences on this?</p>", "parentCommentId": null, "user": {"username": "Jan-WillemvanPutten"}}]