[{"_id": "xoBpgMhrQXHHdt3av", "postedAt": "2022-11-30T07:02:48.305Z", "postId": "cErbypPjxQstgZhME", "htmlBody": "<p>Thanks for sharing!&nbsp;</p><blockquote><p>In exchange for a 50% reduction in developing major vascular events.</p></blockquote><p>Where did you get this figure from? This seems too high to me. (sorry just skimmed and searched for various iterations of \"50\" in the text).</p><p>I did find this in the text though, which is more in line with my understanding of the evidence.</p><blockquote><p>Collaborators which demonstrated a 25% reduction in major vascular events...per 1.0mmol/L reduction in LDL-C</p></blockquote><p>Even if true, this figure is likely to be more relevant for high risk individuals, and it would be a mistake to extrapolate those risk reduction figures to an otherwise healthy 30yo with no risk factors (not suggesting you have done this).</p>", "parentCommentId": null, "user": {"username": "bruce"}}, {"_id": "hYEmvsrRybZj4f7Sr", "postedAt": "2022-11-30T08:30:24.796Z", "postId": "cErbypPjxQstgZhME", "htmlBody": "<p>The 50% is just a guess that I tried to made plausible in the previous parts. This is also why I wrote this article, to discuss if this guess is correct.</p><p>To me it seems plausible that a mild reduction in your LDL-C/apoB during your whole life will have a lot of impact, because the disease takes 4 decades to develop. Current treatment strategies treat very aggressively, but only in the last decade. At which point you have already &nbsp;collected 3 decades worth of plaque.&nbsp;</p><p>This study I highlighted also seems to point into that direction.&nbsp;</p><blockquote><p>For instance, a paper from 2006 called, <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMoa054013\"><i>Sequence Variations in PCSK9, Low LDL, and Protection against Coronary Heart Disease</i></a>, looks at the presence of mutations in a gene called PCSK9 which is associated with a lowered LDL-C and apoB. Black participants had a 28 percent reduction in mean LDL-C and an 88 percent reduction in the risk of coronary heart disease<a href=\"https://forum.effectivealtruism.org/posts/cErbypPjxQstgZhME/preventing-atherosclerosis-the-easiest-way-to-improve-your#fn8333vkftzq3\"><sup>[6]</sup></a>. White participants had a 15 percent reduction in LDL-C and a 47 percent reduction in the risk of coronary heart disease.&nbsp;</p></blockquote>", "parentCommentId": "xoBpgMhrQXHHdt3av", "user": {"username": "Eli_"}}, {"_id": "uRs4GtAmqGv4TuqNn", "postedAt": "2022-11-30T09:38:00.802Z", "postId": "cErbypPjxQstgZhME", "htmlBody": "<p>RE: the 2006 paper:</p><p>Unless you have that gene mutation yourself, those findings aren't particularly relevant to you. If I'm interpreting that quote right, the association of that gene mutation with both a 15% reduction in LDL-C and a 47% reduction in CHD doesn't mean if you reduce your LDL-C by 15% in other ways (e.g. via statins) you will reproduce the reduction in CHD risk.</p><p>Here's a <a href=\"https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD004816.pub5/full\">systematic review of 18 RCTs</a> that push back on the 50% figure.</p><p>&nbsp;</p><blockquote><p>The 50% is just a guess that I tried to made plausible in the previous parts.</p></blockquote><p>I'm not following sorry - do you mean you added up the 25% in major vascular events with the 15% reduction in vascular mortality with the 9% reduction in risk for all-cause mortality to get to ~50%? Or are you saying you expect a 2mmol/L reduction in LDL-C, because it's a 25% reduction per mmol/L, and 25*2 is 50? The first approach will double count, and the second approach is pretty unlikely given the reference range for someone with normal LDL-C levels is 2.6 mmol/L.</p><p>&nbsp;</p><blockquote><p>To me it seems plausible that a mild reduction in your LDL-C/apoB during your whole life will have a lot of impact</p></blockquote><p>Sure, but 25% and 50% reduction could both be interpreted as \"a lot of impact\". I'm not suggesting it's not possible for 50% to be correct, I'm just not confident the evidence you've provided makes a strong case for it, and making sure you're right about whether it's 25% or 50% for the population with no risk factors is pretty decision relevant if the tradeoff is a 30% increase in diabetes.</p><p>&nbsp;</p><p>I'm probably going to check out here, but definitely a conversation to continue having with your doctor who will hopefully have a better sense of the evidence base and understanding of your medical history + needs than I do. I do think all the things mentioned in your \"first line of defence\" are great and important to continue working on regardless of what decision you end up going with RE: statins. Good luck!<br>&nbsp;</p><p><br>(not medical advice etc)</p>", "parentCommentId": "hYEmvsrRybZj4f7Sr", "user": {"username": "bruce"}}, {"_id": "3KGSrQANPmTzHYwAg", "postedAt": "2022-11-30T11:52:26.937Z", "postId": "cErbypPjxQstgZhME", "htmlBody": "<p>It seems like every now and again someone suggests cardiovascular disease as a potential high-impact cause area on the EA forum. The problem is tractability. It's really hard to convince people to eat better, exercise more and stop smoking. Doctors spend a lot of time trying to do this and billions have been spent on public health campaigns trying to convince people to do this. The medications that treat cholesterol, hypertension, and diabetes are among the most commonly prescribed in the world already.</p><p>You've identified a serious problem but I don't see a cost-effective solution</p>", "parentCommentId": null, "user": {"username": "Henry Howard"}}, {"_id": "FWuLbfobdHAsC9oWJ", "postedAt": "2022-11-30T12:39:29.891Z", "postId": "cErbypPjxQstgZhME", "htmlBody": "<p>Thanks for all the engagement, let's see if I can clarify.</p><ul><li>The 50% reduction would be a lifetime reduction for people starting in their 20s and 30s with no obvious risk factors. &nbsp;</li><li>The 50% number has been pulled out of thin air, but a number that seems plausible to me. When I say plausible, I mean that given what I have read so far, it wouldn't surprise me if that was the case.<ul><li>There is indirect evidence based on the PCSK9 genetic mutation, but like you said, this doesn't guarantee that you would achieve the same results by lowering LDL-C artificially. But, it does make it more plausible.&nbsp;</li><li>Mechanistically, it also seems plausible to me, because plaque accumulation happens over the span of 4 decades.&nbsp;</li></ul></li><li>Your meta analysis doesn't push back on this number, because it does an analysis over a relatively short treatment period. Its selection criteria are a treatment period of at least one year and a follow-up of six months. As far as I'm aware there doesn't exist a trial with a 10-year period or longer. What I'm discussing here, when I say the 50% number, is a 60 year treatment period.&nbsp;</li></ul><p>I wish I could give a number for lifetime treatment of atherosclerosis in a population with no obvious risk factors, because that is exactly what I'm looking for!</p>", "parentCommentId": "uRs4GtAmqGv4TuqNn", "user": {"username": "Eli_"}}, {"_id": "mkqDF5kemh6L92CEJ", "postedAt": "2022-11-30T12:47:31.456Z", "postId": "cErbypPjxQstgZhME", "htmlBody": "<p>I agree that lifestyle changes are hard to do, but I would like to push back in two ways:</p><ul><li>Currently, it isn't standard practice to measure apoB and base treatment on that statistic. This would result in doctors prescribing medication to people that are at risk, but that are currently unaware.</li></ul><blockquote><blockquote><p>We calculated the number of clinical events prevented by a high-risk treatment regimen of all those &gt;70th percentile of the US adult population using each of the 3 markers. Over a 10-year period, a non-HDL-C strategy would prevent 300 000 more events than an LDL-C strategy, whereas an apoB strategy would prevent 500 000 more events than a non-HDL-C strategy.</p></blockquote></blockquote><ul><li>Furthermore, there is the option of early treatment with medication, that currently isn't deployed. Like I described in the article, you can have a lifetime risk of 39-70% while also having a 10-year risk &lt;10%, which means you won't get treatment. While it is seems plausible that these people would benefit a lot by this.</li></ul><p>To summarize it bluntly, it seems that the world would benefit from prescribing more cholesterol lowering medication. Advocacy for doing this would be the cost-effective solution.</p><p>Having said that, I didn't start writing this article while having EA in mind. So I haven't done an intensive cost/benefit analysis.&nbsp;</p>", "parentCommentId": "3KGSrQANPmTzHYwAg", "user": {"username": "Eli_"}}, {"_id": "n4SeqK45N7QvusLzG", "postedAt": "2023-03-21T11:08:02.812Z", "postId": "cErbypPjxQstgZhME", "htmlBody": "<p>Hey, I think you are right. I myself am doing my Masters in Nutrition and Biomedicine and have been reading up a lot on preventive cardiology (lipids, statins, etc.) over the last few months. Here are some more papers that I think are good and may be helpful for argumentation:</p><ul><li><a href=\"https://pubmed.ncbi.nlm.nih.gov/28444290/\">https://pubmed.ncbi.nlm.nih.gov/28444290/</a> (Probably the most influential paper on the topic of LDL and atherosclerosis - a consensus statement from the European Atherosclerosis Society).</li><li><a href=\"https://www.sciencedirect.com/science/article/pii/S2666667722000551\">https://www.sciencedirect.com/science/article/pii/S2666667722000551</a> (Very good overview including line of argument for earlier and more aggressive treatment)</li><li><a href=\"https://pubmed.ncbi.nlm.nih.gov/15172426/\">https://pubmed.ncbi.nlm.nih.gov/15172426/</a> (Optimal LDL levels)</li><li><a href=\"https://pubmed.ncbi.nlm.nih.gov/29241485/\">https://pubmed.ncbi.nlm.nih.gov/29241485/</a> (Linear relationship between LDL-C and atherosclerosis even in the \"normal\" range)</li><li>In addition, leaders in the field like Thomas Dayspring or Allan Sniderman (you cited some papers of his anyway) are good places to go for information (e.g., the podcasts with Peter Attia, which you may already know anyway).</li></ul><p>Personally, I'm still under 30 and have \"optimal\" non-HDL-C levels according to guidelines, but I'll probably take a low-dose statin to get to under 100 mg/dl or LDL-C under 70 mg/dl or ApoB to about 60 mg/dl. At least for me, that is not achievable with lifestyle alone.&nbsp;</p><p>In addition, Lp(a) is still an important point. This is genetically determined and cannot (yet) really be influenced, but with a high value the treatment should be all the more aggressive.<br>&nbsp;</p>", "parentCommentId": "FWuLbfobdHAsC9oWJ", "user": {"username": "nicosp"}}]