[{"_id": "aTDtepeq2aH7hP6gq", "postedAt": "2022-12-06T15:18:02.096Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>Hey there, your ideas seem promising, hope you get the support you need. In the meantime, here's a few <i>potentially</i> relevant grant making organizations that may be able to help you, or hopefully, help direct you to other potential funding opportunities more mission aligned.</p><ol><li><strong>Food System Research Fund</strong><ol><li><a href=\"https://www.fsrfund.org/\">https://www.fsrfund.org</a></li><li>The Food System Research Fund is a small targeted fund. It aims to facilitate and disseminate research that answers the most pressing questions that can lead to actionable insights to speed a transition away from an animal product-based food system.</li></ol></li><li><strong>The Alternatives Research &amp; Development Foundation</strong><ol><li><a href=\"https://www.ardf-online.org/index.html\">https://www.ardf-online.org</a></li><li>Fund research projects that develop alternative methods to advance science and replace or reduce animal use. Proposals are welcome from any nonprofit educational or research institution worldwide, although there is a preference for U.S. applications.</li></ol></li><li><strong>Animal Advocacy Research Fund</strong><ol><li><a href=\"https://researchfund.animalcharityevaluators.org/\">https://researchfund.animalcharityevaluators.org</a></li><li>The introduction of plant-based and cell-cultured protein alternatives has enormous potential to reduce the suffering of farmed animals.</li></ol></li></ol><p>These are just ones that I found that could be relevant to your situation, but feel free to check out this<a href=\"https://www.animaladvocacyafrica.org/funding\"> this sheet</a> maintained by Animal Advocacy Africa which may be useful too.</p><p>Best of luck!</p>", "parentCommentId": null, "user": {"username": "davidvanbeveren"}}, {"_id": "qTngvp6rKvm2yijXh", "postedAt": "2022-12-06T15:35:58.330Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>I'm not sure if you live in Israel - just seeing signs suggesting it on your website - but have you contacted The Modern Agriculture Foundation (https://www.modern-agriculture.org/)? I know they're in touch with many companies locally and may have ideas about funding locally as well.</p>", "parentCommentId": null, "user": {"username": "jasonk"}}, {"_id": "3j3yBDDSyofzGHnCG", "postedAt": "2022-12-06T15:48:18.007Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>I do live in Israel, and I am now very curious as to what those signs on my website are :)</p>", "parentCommentId": "qTngvp6rKvm2yijXh", "user": {"username": "Noa Weiss"}}, {"_id": "u9NoKLA7e7FRo7QGo", "postedAt": "2022-12-06T16:40:21.979Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>\"I lead the Israeli community of Women in Data Science\" and videos in Hebrew. &nbsp;:-)</p>", "parentCommentId": "3j3yBDDSyofzGHnCG", "user": {"username": "jasonk"}}, {"_id": "Gt9ntaSKeuRKjQkJt", "postedAt": "2022-12-06T17:26:39.523Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>Do you think you could advance these goals by working for one of the many companies building alternative proteins? Or are there special benefits to independent work? The latter totally seems possible, but the former would eliminate the need for EA to evaluate and fund the project while still enabling it.</p>\n", "parentCommentId": null, "user": {"username": "Aidan O'Gara"}}, {"_id": "Az5eyveS7gXJG65uJ", "postedAt": "2022-12-07T00:34:12.501Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>I thought about using AI/ML to help alternative protein research and thought about whether it is better for talents to work for one of the alt-pro companies, or independently. I think I much prefer to see independent work on this because the research results will be much more likely to be shared among the whole industry. If I am a funder I think I will only consider funding this if this work will be open source.</p>", "parentCommentId": "Gt9ntaSKeuRKjQkJt", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "Ra2hzHbuQZBKoKFSN", "postedAt": "2022-12-07T17:39:48.387Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>Oh, yeah, that's somewhat of a giveaway &nbsp;XD</p>", "parentCommentId": "u9NoKLA7e7FRo7QGo", "user": {"username": "Noa Weiss"}}, {"_id": "BRtMvnqFjeNZZorYn", "postedAt": "2022-12-07T17:41:05.919Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>This is extremely helpful, thank you!</p>", "parentCommentId": "aTDtepeq2aH7hP6gq", "user": {"username": "Noa Weiss"}}, {"_id": "hiJcKDk4p5XdRo5wr", "postedAt": "2022-12-07T17:44:06.779Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>My thoughts on this are similar to what <a href=\"https://forum.effectivealtruism.org/posts/cFtheXSC6XfECxeze/alternative-proteins-machine-learning-project-proposals?commentId=Az5eyveS7gXJG65uJ\">Fai wrote</a>. By working for one company, any work I do would only benefit that specific company. My own goal, however, is to solve a bottleneck that applies to many companies in that space, then make it available to all of them, thus having a much higher ROI, impact-wise.</p>", "parentCommentId": "Gt9ntaSKeuRKjQkJt", "user": {"username": "Noa Weiss"}}, {"_id": "tipPSThTzMeTkvQ79", "postedAt": "2022-12-07T18:26:46.437Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>No problem, glad it helped, best of luck!</p>", "parentCommentId": "BRtMvnqFjeNZZorYn", "user": {"username": "davidvanbeveren"}}, {"_id": "o6KH8bGBLFJFx95H8", "postedAt": "2022-12-08T05:26:49.663Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>You probably might have came across it already, but the Good Food Institute (GFI) has compiled a research funding database for alternative proteins (<a href=\"https://gfi.org/resource/research-funding-database/\">here</a>).</p><p>Overall I think having collaborators that have the expertise and facilities to perform biological experiments and bioprocessing may be quite crucial. My experience is that at this moment, publicly available data are scarce and insufficient to support purely computational work &nbsp;in this field, unlike say cancer research where loads of multi-omics data are available for data mining and modeling.</p>", "parentCommentId": null, "user": {"username": "vincentzh"}}, {"_id": "Th2v8pXBkQBrsRCXe", "postedAt": "2022-12-14T12:05:32.222Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>I absolutely agree. Part of my current plan is to do the work required to get that data, through partnerships with the relevant institutes.</p>", "parentCommentId": "o6KH8bGBLFJFx95H8", "user": {"username": "Noa Weiss"}}, {"_id": "FnfLLxKPva6AhfFAc", "postedAt": "2023-02-15T01:46:02.534Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>Hey Noa,&nbsp;<br>Thanks for writing this up!</p><p>As someone who's worked on similar stuff, I just wanted to pitch in with two thoughts (hopefully helpful!):&nbsp;</p><p>On extrusion modeling, I (&amp; others) looked into something similar about 4-5 years ago and I personally I came away quite pessimistic for 2 reasons.i) The search space is practically a lot narrower than it seems (very limited by ingredients accessible and \"suppliable\" at scale).ii) Furthermore, an extrusion expert I spoke to thought that more of the variability probably came from ingredients rather than actual extrusion parameters so a model alone seemed unlikely to create \"big\" improvements to the texture / product quality.&nbsp;<br>Somewhat confirming this: I spoke to a senior researcher at a well known plant-based company + and an ex-one from a mainstream CPG company and they both confirmed that they'd tried something like this and came away from it without any real product improvements.&nbsp;<br><br>On the second idea, I have less to add but it may be worth checking out <a href=\"https://www.amii.ca/latest-from-amii/amii-and-new-harvest-announce-research-collaboration/\">AMII's recent collab</a> with New Harvest. More general hot take though: My (the low confidence) general impression has been that solving \"big\" fermentation / cultivated problems with an AI-ish approach has been somewhat bottlenecked by the ability to get good data and iterate (in other words, the \"sensors\" aren't great and limited). In-silico modeling is seemingly pretty far away too for most cell lines/platforms that I've heard folks talk about in recent years but unsure where that will go.&nbsp;<br><br>Other interesting things from an ML/AI perspective may be looking at areas like ingredient functionalization &amp; processing for ingredient companies (ADM, Roquette etc.). The idea here would be to tweak processes to get better functionality &nbsp;or lower prices. There was some interest in this work 4-5 years ago but I haven't followed it much since. &nbsp;<br><br>Anyway, hope some of that is useful and that you find an interesting problem &amp; funding!<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "alt_protein_vc"}}, {"_id": "ygGsoEcF4kJ55bvDn", "postedAt": "2023-02-15T15:55:24.792Z", "postId": "cFtheXSC6XfECxeze", "htmlBody": "<p>Hi,<br><br>Thank you for this detailed reply! These are some very relevant facts. I know of some of the problems you mentioned, but the fact that others have tried and fail is new to me - I haven't been able to find anyone who attempted the same thing up until now.<br><br>I would love to talk to you about it f2f and get some more detail, if that's ok. Would you be willing to have a short call?</p>", "parentCommentId": "FnfLLxKPva6AhfFAc", "user": {"username": "Noa Weiss"}}]