[{"_id": "QqDg3pjpYvMbX9EbD", "postedAt": "2022-12-03T21:01:07.632Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Thanks for this, Vasco, Hanzhang, Melissa!</p><p>A couple of thoughts:</p><ol><li>It seems to me that on reasonable quantifications of the ways in which direct tree planting efforts in the UK do not optimize for climate impact (utter non-neglecteness, lack of advocacy, trajectory change, low policy additionality, the factors you mention in the appendix) one would have a prior where tree planting is several orders of magnitude less cost-effective than strategies that seek to optimize for impact. As such, I find a posterior of a 1-order-of-magnitude difference within reach quite surprising.&nbsp;</li><li>While I am generally quite pessimistic on forestry interventions because of the utter non-neglectedness and the difficulty to get to credible additionality and permanence, it seems direct tree planting in the UK is kind of close to the worst thing one can do from a climate angle. So for donors that cannot be moved from tree planting it could be interesting to see what the best charities in this space might look like, e.g. advocacy to improve REDD+ or peatland protection etc.&nbsp;</li><li>Re Google Trends for neglectedness: A great datasource for climate philanthropy are the Climate Works reports -- those show clearly not only that forests are very well funded compared to other areas, but also that funding is growing strongly (it has been an early focus of Bezos Earth Fund, the largest climate philanthropist). In addition, IIRC, conservation philanthropy more broadly, of which a significant share focuses on forests,&nbsp; is several X larger than climate philanthropy.</li></ol>", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "EkrwJy7F26McnYFGW", "postedAt": "2022-12-03T23:27:21.248Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Hi Johannes,</p><p>Thanks for sharing your thoughts!</p><blockquote><p>I find a posterior of a 1-order-of-magnitude difference within reach quite surprising.</p></blockquote><p>1 t/£ is estimated to be about 1 (= log10(1/0.0722)) order of magnitude (OOM) higher than the cost-effectiveness of tree planting in the UK. However, the difference to the projects funded by CCF may be quite larger. Fitting a lognormal distribution with 2.5th and 97.5th percentiles equal to the lower and upper bound of the 95 % confidence interval you guessed (with the disclaimer that it should not be intended a resilient estimate) <a href=\"https://forum.effectivealtruism.org/posts/NbWeRmEsBEknNHqZP/longterm-cost-effectiveness-of-founders-pledge-s-climate#Results\">leads</a> to a mean of 2.34 kt/$. This is about 5 (= log10(2.34 k / 0.0722)) orders of magnitude higher than the cost-effectiveness of tree planting for the UK.</p>", "parentCommentId": "QqDg3pjpYvMbX9EbD", "user": {"username": "vascoamaralgrilo"}}, {"_id": "6vtv63dKrNzFyKGtv", "postedAt": "2022-12-04T13:22:16.660Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Thanks! Yeah, a five OOM difference sounds more like what I would expect, indeed.</p>", "parentCommentId": "EkrwJy7F26McnYFGW", "user": {"username": "jackva"}}, {"_id": "yfnddxgwT29zioACA", "postedAt": "2022-12-05T09:54:34.736Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Thanks for the report - I'll keep my initial estimate of tree planting as \"not worth spending much time on that\". This works feels very complete.</p><p>Just a suggestion: this post is kind of hard to read as it is now, so I think it could benefit from something like an <a href=\"https://forum.effectivealtruism.org/posts/dHHuEYdbMqBf2deyj/using-the-executive-summary-style-writing-that-respects-your\">executive summary</a> that allows to grasp in a clear and simple way <i>why </i>tree planting is not as effective as one could expect (there are many interesting things you took into account, like albedo and impact on insects but it feels drowned in an ocean of numbers).</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}, {"_id": "A5ffQsJtRybmunbeR", "postedAt": "2022-12-05T22:25:54.105Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Hi Corentin,</p><p>Thanks for the comment!</p><blockquote><p>I'll keep my initial estimate of tree planting as \"not worth spending much time on that\".</p></blockquote><p>That makes sense to me.</p><blockquote><p>This works feels very complete.</p></blockquote><p>I would say it is very broad, as it covers many of the effects of tree planting. However, I think it is also quite shallow, as it does not go into much depth into any of them. I think it is not necessary to go into greater depth given given the <a href=\"https://forum.effectivealtruism.org/topics/credal-resilience\">resilience</a> of the mean cost-effectiveness being at best around 1 t/£.</p><blockquote><p>Just a suggestion: this post is kind of hard to read as it is now</p></blockquote><p>I very much agree the post is not very reader-friendly.</p><blockquote><p>so I think it could benefit from something like an <a href=\"https://forum.effectivealtruism.org/posts/dHHuEYdbMqBf2deyj/using-the-executive-summary-style-writing-that-respects-your\">executive summary</a> that allows to grasp in a clear and simple way <i>why </i>tree planting is not as effective as one could expect</p></blockquote><p><a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#fn18y4pa3u2mi\">This</a> footnote illustrates how one could obtain the upper bound for the mean cost-effectiveness of 1 t/£:</p><blockquote><p>The calculation of the best mean of 1 t/£ can be illustrated by considering a net removal of emissions of 39.7 t/ha/year for 50.7 year, and a cost of 1.62 k£/ha.</p></blockquote><p>As for:</p><blockquote><p>there are many interesting things you took into account, like albedo and impact on insects but it feels drowned in an ocean of numbers</p></blockquote><p>In essence:</p><blockquote><p>The cost-effectiveness of tree planting is driven by the existential risk cost-effectiveness, which is perfectly correlated with the cooling cost-effectiveness, as both are directly proportional to the adjusted net removal of CO2e emissions (t/ha/year).</p></blockquote><p>So the net removal of CO2e emissions (t/ha/year), persistence of the intervention (year), and cost (£/ha) seem to be the factors which really matter.</p>", "parentCommentId": "yfnddxgwT29zioACA", "user": {"username": "vascoamaralgrilo"}}, {"_id": "rxzHRnQK55KabbAq7", "postedAt": "2022-12-06T05:42:30.974Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>I was really glad to see you take into account albedo changes-I think this is really important for the boreal forest.&nbsp;</p><p>For the existential and overall cost effectivenesses, I think you're getting implausible values because the standard deviation of your future population size and duration of humanity are too large. For instance, it appears that your 5th percentile of future population of humanity is 10^-34 people, and duration is &lt;1 yr. I guess it's possible to have a mean greater than the 95th percentile, but I don't think the means are plausible. Anders Sandberg estimates the upper bound of number of human lives is around a <a href=\"https://en.wikipedia.org/wiki/Googol\">Googol </a>(10^100, note, Google is a misspelling of Googol). So it is not reasonable that 1 £ is going to save 10^90 lives.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "7F3Gc5c9JhfkgTsYp", "postedAt": "2022-12-06T14:35:46.091Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Hi David,</p><p>Thanks for the comment!</p><blockquote><p>For the existential and overall cost effectivenesses, I think you're getting implausible values because the standard deviation of your future population size and duration of humanity are too large.</p></blockquote><p>You may well be right. I did not try to get the most accurate distributions. The selected ones are essentially for illustration that the longterm effect of tree planting dominates the analysis.&nbsp;</p><p>In the table of <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#Other_effects\">this</a> section, I mention that such effect is of the order of 10^(10^2) in terms of lives saved per hectare. This was also to indicate I am only confident of getting the order of magnitude of the order of magnitude right. So, for the cost-effectiveness, I believe log10(log10(\"existential/overall cost-effectiveness (life/£)\")) = 2.</p><blockquote><p>For instance, it appears that your 5th percentile of future population of humanity is 10^-34 people, and duration is &lt;1 yr.</p></blockquote><p>The virtually null 5th percentile of the future population size makes sense to me. Given Toby Ord's guess if 1/2 for the total existential risk, I guess the median population size is close to 0 (I set it to 1). The 5th percentile of the humanity's lifespan being shorter than 1 year does not make sense, but it does not affect the mean of the distribution, which is driven by the right tail. In general, truncated distributions would be more accurate.</p>", "parentCommentId": "rxzHRnQK55KabbAq7", "user": {"username": "vascoamaralgrilo"}}, {"_id": "jyQmuBARrc3SYDsos", "postedAt": "2022-12-06T23:13:00.442Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Okay-if you're just trying to get the order of magnitude of the exponent correct, then this could be consistent with 10^10^1.5 ~10^30 lives/£, which is plausible. As for the median population size, I guess you are trying to get an average over the time horizon which could extend 100 trillion years, so that's why you're saying it's around zero with 50% as existential risk, which makes sense.</p><p>By the way, I was confused when I read this:</p><blockquote><p>The parameters of humanity’s future duration were estimated as follows:</p></blockquote><p>I think you mean population size instead of duration.</p>", "parentCommentId": "7F3Gc5c9JhfkgTsYp", "user": {"username": "Denkenberger"}}, {"_id": "cogS5djGWwNhozDtX", "postedAt": "2022-12-07T06:56:53.072Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Well, this is very interesting! Thank you for posting it.</p>\n<p>My first impression, reading it, is that I wonder where most of your hard numbers come from. While the references to organizations or research sources are scattered, did I miss a summary of what organizations provided numbers or data on topics like:</p>\n<ul>\n<li>projected anthropogenic GHG's</li>\n<li>total carbon uptake by trees (for example, respiration increases, tree types)</li>\n<li>threats to aforestation vs reforestation efforts</li>\n<li>policies of native vs non-native reforestation</li>\n<li>mitigation of climate impacts on forests</li>\n<li>ecosystem management to avoid increasing niche species losses</li>\n</ul>\n<p>I also  wonder how estimates were done of effects on trees of climate impacts like:</p>\n<ul>\n<li>drought</li>\n<li>tree diseases</li>\n<li>fires</li>\n<li>invasive pests</li>\n<li>development priorities</li>\n<li>increasing tree respiration</li>\n</ul>\n<p>These effects impact reforestation and aforestation efforts.</p>\n<p>For me it's a warning that your analysis must be broad but shallow because an analysis of, for example, ecosystem services will necessarily be very complicated  with respect to aforestation vs reforestation and choice of plant species and impacts on insect species, and related problems with tree-destroying pests. That research is still ongoing. In your write-up here, I don't see direct references to <a href=\"https://www.ipcc.ch/site/assets/uploads/2019/11/SRCCL-Full-Report-Compiled-191128.pdf\">IPCC data or projections about value and impacts of land management</a>. Is that represented here, earlier in your chain of research, or in your sources? They're one of several options for research summaries in this area.</p>\n<p>I did take  a look at the <a href=\"http://www.evsd.info\">www.evsd.info</a> database, briefly, and it reads to me as economics thinking applied to ecology, and not very well. For example, their homepage lists one of the  primary \"ecosystem services\" of mangroves as tourism. That might be true subjectively and in the moment, where there is some choice about whether the mangrove forests exist and how important tourism should be to an economy, but it fails to recognize mangrove forest role in contexts where earnings from tourism are irrelevant. Fundamentally, this looks like more dissonance between what motivates policy action and what deserves policy action.</p>\n<p>With nature, you can't typically change your mind. Larger systems can be hard to restore. Conditions won't allow growth of species in the right quantities or varieties or at all. Animal and plant species, once extinct, tend to stay gone. You can't remove toxins from soil or water or air in polluted areas. You can't control the temperature or the weather,. You can't grow food where you once could, or eat it when you once could, because its no longer safe. Without the economic incentive, and narrow interests define those, survival value of ecosystems are mismanaged. Once the land is depleted, it typically goes ignored. Until then, it's dollar value is relative to current economic activity that is falsely projected to continue into the future, something like tourism. What if tourism has to stop to create enough benefit to save some niche ecosystem feature?</p>\n<p>On my reading, this idea of ecosystem services given dollar amounts treats the value of ecosystems as one of aesthetics if the ecosystem has not otherwise been exploited for profit in some easily recognizable business process (and plausibly a non-reversible one that degrades the ecosystem). However, the real value of these systems is not aesthetic. They are survival-supporting machines that we don't understand well and interact with poorly. If we thought of them like that, the real question here, of how to protect whole ecosystems from our misdoings, would be the focus.</p>\n<p>In your existential risk mitigation footnote, you mention that you make existential risk directly proportional to GAST reduction, <a href=\"https://www.nature.com/articles/d41586-019-03595-0\">but it is not</a>. In particular, some temperature effects can happen with small additional increases in temperature, thus why they are called tipping points, because their effects proceed with just a small additional forcing. Furthermore, some tipping element effects involve a hysteresis relationship, so that just reversing the GAST increase that caused them will not reverse their change (for example, sea level rise). Finally, some tipping elements can change in a reversible way, but the reversal over the change is longer than human time frames.</p>\n<p>Underlying your approach could be an assumption that, having defeated climate change, the natural world is saved, so it makes sense to compare tree planting as an approach to reducing GAST rise with some other approach. However, the sharp losses to all tree populations due to existing climate change at some intermediate point in the future (for example, tipping of the Amazon within 20 years) is a near term threat to our ecosystems even if GHG's were in principle reducible to pre-industrial levels by century's end, other things equal. Not to mention, other things are not equal. In particular, with <a href=\"https://news.un.org/en/story/2022/10/1129912\">increase in GAST past 1.5C virtually guaranteed</a>, we can expect <a href=\"https://www.science.org/doi/10.1126/science.abn7950\">tipping points to pass this century</a>.</p>\n<p>Ecosystem losses are covered somewhat in the IPCC report on land management, but not to the reducible form where you can assume incremental changes lead to incremental effects. More broadly, the problem is one of assuming that ecosystem management is like running a factory, that is, we are deciding how to allocate resources and make products (in a broad sense), and can always change our minds, reallocate resources, bring in engineers, install new stuff, and go back to make the older products. But we can't do that, really. Once a system is too far gone, it won't make sense to try and recover. I don't think that danger or cost or timing of such outcomes is represented in your analysis.</p>\n<p>So, yes, tree planting is not justifiable as a single solution for climate change, but in fact tree populations are threatened by climate change. To model reforestation or ecosystem protection efforts as a question of cost-effectiveness in reducing GHG's reverses the causality. The bigger concern is whether we can protect forests by reducing anthropogenic GHG's, real-estate development, cattle-raising, and other pressures on forest health.  <a href=\"https://www.google.com/search?q=importance+of+forests\">Forests are important in their own right</a>, but that importance should not be reduced to economic value in a way that ignores most ecosystem survival benefits and limits.</p>\n<p>I welcome your thoughts. Thanks.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "jMEdJnWWuGTuAJDWi", "postedAt": "2022-12-07T10:58:33.989Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Hi Noah,</p><p>Thanks for the comment, I strongly upvoted it!</p><blockquote><p>projected anthropogenic GHG's</p></blockquote><p>See <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#Cumulative_greenhouse_gas_emissions_between_2020_and_2100_assuming_current_climate_policies\">Cumulative greenhouse gas emissions between 2020 and 2100 assuming current climate policies</a>.</p><blockquote><p>total carbon uptake by trees (for example, respiration increases, tree types)</p></blockquote><p>See <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#Net_removal_of_CO2e_emissions\">Net removal of CO2e emissions</a>.</p><blockquote><p>threats to aforestation vs reforestation efforts</p><p>tree diseases</p><p>fires</p><p>invasive pests</p></blockquote><p>See <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#Tree_planting_intervention_risk\">Tree planting intervention risk</a> (including <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#fnage28idyoo8\">this</a> footnote).</p><blockquote><p>policies of native vs non-native reforestation</p><p>increasing tree respiration</p></blockquote><p>These are implicitly taken into account in the net removal of CO2e emissions.</p><blockquote><p>mitigation of climate impacts on forests</p></blockquote><blockquote><p>ecosystem management to avoid increasing niche species losses</p><p>drought</p><p>development priorities</p></blockquote><p>See <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#Ecosystem_services_benefits\">Ecosystem services benefits</a> and <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#Factual_and_counterfactual_initial_ecosystem_services\">Factual and counterfactual initial ecosystem services</a>.</p><blockquote><p>For me it's a warning that your analysis must be broad but shallow because an analysis of, for example, ecosystem services will necessarily be very complicated with respect to aforestation vs reforestation and choice of plant species and impacts on insect species, and related problems with tree-destroying pests.</p></blockquote><p>I agree the analysis is broad and shallow. I commented <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness?commentId=A5ffQsJtRybmunbeR\">here</a> that:</p><blockquote><p>I would say it [the analysis] is very broad, as it covers many of the effects of tree planting. However, I think it is also quite shallow, as it does not go into much depth into any of them. I think it is not necessary to go into greater depth given the <a href=\"https://forum.effectivealtruism.org/topics/credal-resilience\">resilience</a> of the mean cost-effectiveness being at best around 1 t/£.</p></blockquote><p>I agree ecosystem services are quite complex, but, based on the results I got:</p><blockquote><p>The cost-effectiveness of tree planting is driven by the existential risk cost-effectiveness, which is perfectly correlated with the cooling cost-effectiveness, as both are directly proportional to the adjusted net removal of CO2e emissions (t/ha/year). Consequently, one could assess the overall cost-effectiveness of tree planting based on the cooling cost-effectiveness</p></blockquote><p>Regarding the EVSD, you mentioned:</p><blockquote><p>I did take a look at the <a href=\"http://www.evsd.info/\">www.evsd.info</a> database, briefly, and it reads to me as economics thinking applied to ecology, and not very well. For example, their homepage lists one of the primary \"ecosystem services\" of mangroves as tourism.</p></blockquote><p>Tourism is not the driver of the ecosystem services based on the <a href=\"https://docs.google.com/spreadsheets/d/1Hcfv-Zw1fTTkuOcf62FfFlWGdaNosJ8F/edit?usp=sharing&amp;ouid=100520515741794242960&amp;rtpof=true&amp;sd=true\">data</a> I used to model those of the \"ERPM\" projects:</p><blockquote><p>It is worth noting that the mangroves ecosystem services could have been overestimated by fully including the benefits of fisheries and wood, which account for about 80% of the total value, but could be partly obtained elsewhere.</p></blockquote><p>I tend to agree that:</p><blockquote><p>On my reading, this idea of ecosystem services given dollar amounts treats the value of ecosystems as one of aesthetics if the ecosystem has not otherwise been exploited for profit in some easily recognizable business process (and plausibly a non-reversible one that degrades the ecosystem).</p></blockquote><p>However, it might still be the best approach we have now. I suppose the relationship between ecosystem services and existential risk could be explored further, but I guess the main driver for the cost-effectiveness will be the net removal of CO2e emissions.</p><blockquote><p>In your existential risk mitigation footnote, you mention that you make existential risk directly proportional to GAST reduction, <a href=\"https://www.nature.com/articles/d41586-019-03595-0\">but it is not</a>. In particular, some temperature effects can happen with small additional increases in temperature, thus why they are called tipping points, because their effects proceed with just a small additional forcing.</p></blockquote><p>I agree temperature can increase superlinearly past a certain level of emissions. However, I expect the linear regime to continue for a while. From note (6.93) of What We Owe to the Future (WWOF) (see <a href=\"https://whatweowethefuture.com/notes/\">here</a>; emphasis below added by me):</p><blockquote><p>Hansen et al. 2013, 17. Popp et al. (2016) found that if carbon dioxide concentrations reached 1,520 parts per million, a simulated planet would transition to a moist greenhouse state.<strong> If we burned all of the fossil fuels, then carbon dioxide concentrations would reach 1,600 parts per million</strong> (Lord et al. 2016, Figure 2). However, the simulated planet’s initial climate was six degrees warmer than today’s Earth.</p><p>Regarding my claim about how Earth’s climate differs from the planet simulated by Popp et al. (2016), see the start of their Discussion section (pp. 5–6, emphases mine): \" (...) Indeed, the <strong>climate of the model</strong> version used in ref. 17 was recently shown <strong>to become unstable when the CO2 concentrations were increased from 4,480 to 8,960 p.p.m.</strong> (eventually leading to numerical failure of their model). Nonetheless, the <strong>forcing required to cause a climate transition would certainly be higher on present-day Earth</strong> than on our aqua-planet, even with our version of the model. Several other studies of Earth have found lower climate sensitivities to relatively large CO2 forcing than we do which supports this notion\".</p></blockquote><p>In principle, I agree that:</p><blockquote><p>Once a system is too far gone, it won't make sense to try and recover. I don't think that danger or cost or timing of such outcomes is represented in your analysis.</p></blockquote><p>However, for the reasons described in the note above, I think we are very far from that situation.</p><blockquote><p>In particular, with <a href=\"https://news.un.org/en/story/2022/10/1129912\">increase in GAST past 1.5C virtually guaranteed</a>, we can expect <a href=\"https://www.science.org/doi/10.1126/science.abn7950\">tipping points to pass this century</a>.</p></blockquote><p>There is an important distinction between crossing a climate tipping point and a temperature tipping point. The article you link to focusses on climate tipping points of the cryosphere, ocean and biosphere. Their most extreme (maximum for positive, or minimum for negative) impact on the global temperature is descrived inTable S3 (see <a href=\"https://www.science.org/doi/10.1126/science.abn7950#supplementary-materials\">Supplementary Materials</a>):</p><ul><li>Greenland Ice Sheet [collapse]: 0.13.</li><li>West Antarctic Ice Sheet [collapse]: 0.05.</li><li>Labrador-Irminger Sea / SPG Convection [collapse]: -0.5.</li><li>East Antarctic Subglacial Basins [collapse]: 0.05.</li><li>Amazon Rainforest [dieback]: 0.15 (= (0.1 + 0.2)/2).</li><li>Boreal Permafrost [collapse]: 0.3 (= (0.2 + 0.4)/2).</li><li>Atlantic Meriodional Overturning Circulation [collapse]: -0.5.</li><li>Arctic Winter Sea Ice [collapse]: 0.6.</li><li>East Antarctic Ice Sheet [collapse]: 0.6.</li><li>Lowlatitude Coral Reefs [die-off]: not defined (ND).</li><li>Boreal Permafrost [abrupt thaw]: ND.</li><li>Barents Sea Ice [abrupt loss]: ND.</li><li>Mountain Glaciers [loss]: 0.08.</li><li>Sahel &amp; West African Monsoon [greening]: ND.</li><li>Boreal Forest [southern dieback]: -0.18.</li><li>Boreal Forest [northern expansion]: 0.14.</li><li>Boreal Permafrost [gradual thaw]: 0.7.</li><li>Arctic Summer Sea Ice [loss]: 0.25.</li><li>Global Land Carbon Sink [weaken]: ND.</li><li>Ocean Biological Pump [weaken]: ND.</li><li>Marine Methane Hydrates [dissociation]: 0.5.</li><li>Indian Summer Monsoon [shift]: ND.</li><li>South. Ocean Sea Ice [Ind. increase]: ND.</li><li>South. Ocean Sea Ice [Pac./Atl. loss]: ND.</li><li>South. Ocean Sea Ice [bimodality]: ND.</li><li>Equatorial Stratocumulus Clouds [breakup]: 8.</li><li>Antarctic Bottom Water [collapse]: ND.</li><li>Indian Ocean Upwelling [abrupt increase]: ND.</li><li>Tibetan Plateau Snow [abrupt loss]: ND.</li><li>Ocean Deoxygen -ation [global anoxia]: ND.</li><li>Arctic Ozone Hole [abrupt expansion]: ND.</li><li>El Nino Southern Oscillation [permanent / extreme]: ND.</li><li>Northern Polar Jet Stream [instability]: ND.</li></ul><p>Adding up all of these, I get a maximum global warming of 10.37 ºC, which is mostly driven by the 8 ºC which could result from the breakup of the equatorial stratocumulus clouds. This:</p><blockquote><p>Occurs at 1200+ppm (1400-2200ppm sens. analysis) =&gt; approx. 6.3°C (7-8.9°C) at ECS of 3°C per 2xCO2. Only in one model so far, so relatively uncertain. If proven then could be involved in high palaeo climate sensitivity for hothouse periods.</p></blockquote><p>If this tipping point exists (it is still unclear), we would have to burn all fossil fuels to cross it, which seems quite unlikely. Moreover, even if we crossed it, we would take quite some time to do so (it would take time to get to a CO2 concentration which is 4 times as high), so I guess there would be some time to adapt. (7 + 8.9)/2 = 8 ºC of warming until the tipping, plus 8 ºC due to crossing the tipping point would lead to 16 ºC of warming, but this is a very worst case scenario (which should be downweighted proportionally to its low likelihood). In addition, it is not totally clear (1400 + 2200)/8*16 = 7200 ppm would lead to a moisture greenhouse effect. However, the note from WWOF says the tipping point may be somewhere between 4,480 to 8,960 ppm, so it would certainly be quite troubling!</p><blockquote><p>So, yes, tree planting is not justifiable as a single solution for climate change</p></blockquote><p>I agree, and would add that supporting <a href=\"https://founderspledge.com/funds/climate-change-fund\">CCF</a> is much better than tree planting (as I clarified <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness?commentId=EkrwJy7F26McnYFGW\">here</a>).</p><blockquote><p><a href=\"https://www.google.com/search?q=importance+of+forests\">Forests are important in their own right</a>, but that importance should not be reduced to economic value in a way that ignores most ecosystem survival benefits and limits.</p></blockquote><p>The ESVD considers many ecosystem services (see <a href=\"https://forum.effectivealtruism.org/posts/CFZvcnbuQsvAkpXc3/tree-planting-cost-effectiveness#fnqk88uwuha\">this</a> footnote), although there is room for improving their measurement.</p><blockquote><p>I welcome your thoughts. Thanks.</p></blockquote><p>Thanks again for commenting!</p>", "parentCommentId": "cogS5djGWwNhozDtX", "user": {"username": "vascoamaralgrilo"}}, {"_id": "uLAZAhwgYpPy34MGv", "postedAt": "2022-12-07T12:50:39.224Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<blockquote><p>As for the median population size, I guess you are trying to get an average over the time horizon which could extend 100 trillion years, so that's why you're saying it's around zero with 50% as existential risk, which makes sense.</p></blockquote><p>Yes, that was it, thanks for clarifying!</p><blockquote><p>I think you mean population size instead of duration.</p></blockquote><p>Good catch, corrected!</p>", "parentCommentId": "jyQmuBARrc3SYDsos", "user": {"username": "vascoamaralgrilo"}}, {"_id": "Fa6veGT9W3DYNdfEk", "postedAt": "2022-12-07T21:44:48.541Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Thanks for the reply. If you don't mind my adding a few more thoughts:</p>\n<blockquote>\n<p>I agree temperature can increase superlinearly past a certain level of emissions. However, I expect the linear regime to continue for a while. From note (6.93) of What We Owe to the Future (WWOF) (see here; emphasis below added by me):</p>\n</blockquote>\n<p>and then there's some estimates of temperature effects of all the tipping elements you listed ... tipped. But temperature effects on temperature, not the effects of the changed systems on the land, oceans, or atmosphere. Looking at those numbers, I have some serious doubts. For example, if you  shut off the AMOC, you change ocean circulation such that warming occurs off continental shelves, triggering release of hydrates on those shelves. Globally, there's more than is needed to raise GAST by 0.5C. There's more accessible and releasable from just the East Siberian Arctic Shelf, 1C-2C GAST from there alone, if it's an abrupt release of mostly methane.</p>\n<p>If the Greenland Ice Sheet were to collapse, the accompanying sea level rise would be more than 7 meters. Off the top of my head, that would flood some countries, make floods so drastic in others that farming ceases because of saltwater inundation, and flood out most coastal cities around the world. Global farming productivity would take a hit because of loss of low-lying countries. Saltwater would infiltrate groundwater supplies in more places, and reduce the fertility of land near rivers, reducing farming productivity further. That's one tipping point considered in isolation. EDIt: Those effects would begin with strength around 1-2 meters of rise, I estimate.</p>\n<p>If you're writing about the collapse of the West Antarctic Ice Sheet, that's near-term, and 10+ feet of sea level rise. I don't know how you feel about the civilizational impacts of an additional 10+ feet of sea level rise, but you can't feel that good about it, and  at that point, the Antarctic would not stop melting. It holds 50 meters plus of sea level rise in it.</p>\n<p>And that's just one problem. Jet stream instability? That's connected heat domes across the Northern Hemisphere, extreme weather events like what happened in the UK this year, but much worse, for example, enough to trigger a multi-breadbasket failure. Shifting the monsoons? Well, that could dry out land over Asia and South America, reducing farming productivity, killing forests,desertifying land, collapsing land biological pumps, which currently absorb some 30% of anthropogenic CO2 production. Those effects would be irreversible in the short term. Carbon dumped from existing land suffering fires or drought would go into the atmosphere, adding to anthropogenic sources. The ocean would be what's left to absorb CO2, some 25%+ of our CO2 production (EDIT: or more).</p>\n<p>But then the problems become too big. The AMOC has stopped, land sinks of carbon are gone, methane hydrates globally are melting out,  permafrost is melting out  abruptly, ocean PH in the productive zones has dropped because of changed circulation, ocean heating and freshening and CO2 absorption has collapsed all fisheries, starting in the Arctic, and some phytoplankton species are dead, with others present but in smaller amounts, though that's a guess. The ocean's biological pump is collapsed, and the ocean is dumping more carbon into the atmosphere. In parallel, the 6th great extinction over and ours is threatening.</p>\n<p>I just don't think that the impacts of those tipping elements falling was thought through very well by the WWOTF research. Their analysis reverses the relevant importance of GAST, apparently. It's not that higher GAST is nonlinearly bad in amplifying itself (though I think if all those tipping points fall, you could be looking at 20C GAST rise or more). What is bad about higher GAST is that it effects those tipping elements as it does, nonlinearly, and at fairly low temps, 2C-5C GAST rise, mostly. The consequences of the tipping elements falling are disastrous. Most people die. Most species go extinct. Most land is uninhabitable. That's what  the fall of those tipping elements means.</p>\n<p>I believe it takes patience and bottom-up thinking to consider  building a town on a melted permafrost landscape still oozing methane and developing sink holes with constant simmering fire appearing on any vegetation, or in a desert with 55C-60C temps a lot of the year or rocky areas with no groundwater, no meltwater, no rivers, and little or no rain,  or on a coast subject to frequent extreme weather, toxic algae blooms, and pollutant-contaminated jellyfish die-offs, when they're around at all.</p>\n<p>I've read before that geologic time shows that species survived high temperature changes, and so there won't be a 6th great extinction, but it is already taking place, our activities outside global warming contribute to it, and in any case relevant temperature changes from the geologic past occurred over much longer than a few hundred years, giving species time to adapt.</p>\n<p>The lesson in climate science and given in public discussion and media coverage of climate change is, that we don't want to go past 1.5C GAST rise. Here's we're looking at upwards of 3C GAST rise this century. The articles I referenced are exploring the outcomes of that rise, and its knock-on effects into the next century. The significance is the systemic effects of that GAST rise, not that the numbers are just \"high\" per se.</p>\n", "parentCommentId": "jMEdJnWWuGTuAJDWi", "user": {"username": "Noah Scales"}}, {"_id": "7ogkMQgx5RGh9xRRn", "postedAt": "2022-12-07T22:29:49.461Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>Thanks for sharing!</p><p>Unfortunately, I do not know much about the effects of the tipping points. I believe you know way more than I do! That being said, I can say I agree with <a href=\"https://www.pnas.org/doi/10.1073/pnas.2108146119\">Kemp 2022</a> that research on the effects of extreme climate change (&gt; 3 ºC) has been neglected relative to non-extreme one.</p>", "parentCommentId": "Fa6veGT9W3DYNdfEk", "user": {"username": "vascoamaralgrilo"}}, {"_id": "WoYQcQs5tKu8McEuc", "postedAt": "2022-12-08T02:59:34.462Z", "postId": "CFZvcnbuQsvAkpXc3", "htmlBody": "<p>You're welcome, of course, and thank you for your courtesy in replying.</p>\n<p>I don't have time,  money, training or resources to explore climate in more detail, but if I could, I would start with developing more sophisticated computer models that incorporate more physical processes deciding changes to tipping elements (for example,  meltwater drainage on Greenland). Existing atmospheric models use a mesh that is too coarse, making predictions translate from climate to weather poorly. Ocean modeling is hopeless at current atmospheric mesh size, we need 1km meshes or better for climate models, not the much larger meshes in use for the atmosphere. Dedication of more and faster computer resources to climate modeling would be helpful.</p>\n<p>However, different methodologies applied to develop less sophisticated models can still produce general foresight that limits or suggests available policy options to prevent climate-related crises. This runs into political interests ultimately concerned with the welfare of a small percentage of the global population, whose false sense of security and selfishness is actually in the way of preserving civilization.</p>\n<p>Regardless, the survival of humanity, if that is what this fiasco comes to, could depend on terraforming this planet back to an 1800's state. Well before then, we need very fine mesh computer models, as well as better understanding of ecosystems and practical means to create and quickly evolve new species. An alternative would be local-scale weather and ecosystem control, allowing a small area of land to have mild weather and favorable living conditions,  allowing one city or small country to flourish, though that combination of advanced technology and a small human population might not work on its own. The trouble with humans and technology is that we are not born with the learnings of our parents, so a small population supported by technology that is magic to us, and whose ecosystem also depends on that technology, won't last, unless we've locked in some AI or AL running it that understands it. That issue makes me think we're better off with a planet that is habitable in many areas, not one with a small green zone run by some effectively alien technology. If that whole discussion seems implausible, that is because it absolutely is implausible.</p>\n<p>While as a longtermist, I can see the value of having a small human population reached equitably through family planning over a few centuries, that should be achieved without large losses of existing global population. That means protecting against climate change catastrophe and systemic effects. Implying, for this century, degrowth and energy conservation and the end of consumerism, and less emphasis on democratization of advanced technologies. But all that has to happen <em>soon</em> to preserve most of the global population from early death.</p>\n<p>I have watched <a href=\"https://www.youtube.com/watch?v=Y_yMemcSMkg\">Kemp's lecture on foreseeing the end of the world</a>. The discussion is about how to layer forecasting and foreseeing methods to improve prediction of existential crises, something still in the exploratory stages. Don't associate my own conclusions with his, my weird opinions are my own, but I recommend his work.</p>\n<p>You folks do a lot of forecasting, but foreseeing is worth exploring as well.  I see the same forks in the road, but only foresee the negative ones as least surprising. Climate destruction is not a hopeless situation though, but not hopeless for whom living how? That's the bigger question, and a worrisome one. There's no solutions without compromises, particularly for utilitarians , that is, absent the longtermist \"far future trillions of people\" take, where current population is a just a blip anyway. And that's why I've said before, only future people that <em>will</em> exist have moral status. Present people do have moral status. Present people matter, including those in the womb. Future people? Only if they will actually be alive at some point.</p>\n<p>Climate destruction, as assessed by MacAskill's book and Halstead's analysis, is difficult to take seriously. You EA folks could use something better, considering your interest in preventing existential dangers. In general, EA's massively underestimate the climate change threat to civilization, and appear to prefer techno-optimist solutions regardless, which multiplies environmental and resource management concerns for utilitarians when turned into policy.</p>\n<p>Anyway, I envy your position as someone actively involved in foresight and forecasting, as well as your efforts to suggest policy. Congratulations on that opportunity! I have not looked into the climate nonprofit that you recommend, but I hope their work is good.</p>\n", "parentCommentId": "7ogkMQgx5RGh9xRRn", "user": {"username": "Noah Scales"}}]