[{"_id": "ArWkCbX7Px4ooud6v", "postedAt": "2022-11-22T19:38:02.020Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>I'm excited about these!</p><p>A small question on New Harvest: <a href=\"https://animalcharityevaluators.org/charity-review/new-harvest/#c2\">you state</a> that they have ~$6M in assets, about half of which is in illiquid stock, and have been cash flow positive the past few years. In 2021, it looks like revenues were almost 2x expenses.</p><p>But a few months ago <a href=\"https://forum.effectivealtruism.org/posts/FkWvwmbepoMKav2sM/new-harvest-the-nonprofit-nucleus-of-cellular-agriculture-is\">they posted</a> saying they had only $1M in assets and expected to go bankrupt Oct 2022.&nbsp;</p><p>Do you know what the discrepancy is?</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "DEg9rgh4cyMjY4vjg", "postedAt": "2022-11-22T22:22:33.466Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>I'm an ACE board member, so full disclosure on that, though what I say here is in my personal capacity.</p><p>I'm very glad about a number of improvements to the eval process that are not obvious from this post. In particular, there are now numeric cost-effectiveness ratings that I found clarifying, overall explanations for each recommendation, and clearer delineation of the roles the \"programs\" and \"cost-effectiveness\" sections play in the reviews. I expect these changes to make recommendations more scope sensitive. This leaves me grateful for and confident in the new review framework.</p>", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "3vWDXkHgmWnMnEryZ", "postedAt": "2022-11-23T09:21:24.346Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<blockquote><p>there are now numeric cost-effectiveness ratings...</p><p>I expect these changes to make recommendations more scope sensitive</p></blockquote><p>Nice.</p>", "parentCommentId": "DEg9rgh4cyMjY4vjg", "user": {"username": "NunoSempere"}}, {"_id": "3CZS4NPcZtiTpho4B", "postedAt": "2022-11-23T12:13:16.465Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>Looking into the specifics of the quantification (<a href=\"https://animalcharityevaluators.org/charity-review/the-good-food-institute/#c1\">here</a> and <a href=\"https://docs.google.com/spreadsheets/d/1l7BGcsCiQGVL6m3nRrc8vVFw5JxHe3IiD02NUnJG22s/edit#gid=0\">here</a>), I see that this is based on estimating the number of \"achievements\" per $100k. I think that this is:</p><ul><li><i>Very ingenious:</i> it allows for rapid comparison of many different programs in different areas</li><li>Hopefully something that can be refined later: I'm not sure that achievements in different areas should be worth the same, and it's not clear what goes into an \"impact score\".</li></ul>", "parentCommentId": "3vWDXkHgmWnMnEryZ", "user": {"username": "NunoSempere"}}, {"_id": "hyZF58x9DcayokikH", "postedAt": "2022-11-23T21:25:16.868Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>Yes, and thank you for the detailed private proposal you sent the research team. I didn't see it but heard about it, and it seems like it was a huge help and just a massive amount of volunteer labor. I know they really appreciated it.</p>", "parentCommentId": "3CZS4NPcZtiTpho4B", "user": {"username": "zdgroff"}}, {"_id": "urxGjaFi5yqPNgsu2", "postedAt": "2022-11-28T14:59:46.253Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>Thank you for this initial feedback, Nuño - we appreciate you taking the time. In the coming weeks, we'll be publishing one blog post for each of the evaluation criteria that we use when reviewing charities (for a total of 4 posts). The blog posts will give more detail on how we made our assessments, how this year's approach differs from previous years, and any limitations we see. The Cost Effectiveness blog post will be published on Dec 15th, so we look forward to sharing more details then.</p><p>- Elisabeth</p>", "parentCommentId": "3CZS4NPcZtiTpho4B", "user": {"username": "AnimalCharityEvaluators"}}, {"_id": "6JuCaAKowbXPc5MNL", "postedAt": "2022-11-28T15:01:10.176Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>Hi Ben! Thanks for question, and I'm glad you're excited about our recommendations.</p><p>The situation was as you noted: a significant portion of New Harvest's assets were in the stock of companies that had not gone public. In retrospect, when we last evaluated New Harvest in mid-late 2021, it would have been more accurate for ACE not to count assets that may be difficult to liquidate quickly, because they are not truly available to maintain operations. As you'll see in the upcoming \"Our Room for More Funding Approach in 2022\" blog post, we have since updated our methodology to ask charities whether they hold these types of assets.</p><p>Additionally, as New Harvest noted in their town hall, they received less in donations than expected in the first half of the year (attributed to the market downturn), which contributed to a decline in assets leading up to their post in June 2022. Thankfully, last we heard from them, they have been able to extend their runway through 2023.</p><p>- Vince</p>", "parentCommentId": "ArWkCbX7Px4ooud6v", "user": {"username": "AnimalCharityEvaluators"}}, {"_id": "Xq3tmHrxNEbgFLJsA", "postedAt": "2022-12-13T17:27:55.802Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>Hi Nuño, we've now published our <a href=\"https://animalcharityevaluators.org/blog/our-approach-to-assessing-cost-effectiveness/\">blog post</a> on our approach to assessing Cost Effectiveness, including a charity’s approaches to implementing interventions, their recent achievements, and the costs associated with those achievements. Thanks, Holly</p>", "parentCommentId": "3CZS4NPcZtiTpho4B", "user": {"username": "AnimalCharityEvaluators"}}, {"_id": "M2A4wFAHxk6cAEntc", "postedAt": "2022-12-14T16:40:39.913Z", "postId": "cGn5HrDKdCkaf3REy", "htmlBody": "<p>Cheers, excited about this:</p><blockquote><p>For next year, we are considering moving further toward a quantitative approach that analyzes the level of suffering prevented given the resources used, while also quantifying our level of uncertainty in our estimates. Importantly, we will carefully review the reasoning for moving away from fully quantitative models in the past to avoid reinstating the same limitations.</p></blockquote>", "parentCommentId": "Xq3tmHrxNEbgFLJsA", "user": {"username": "NunoSempere"}}]