[{"_id": "hsXBDRtnBYuzs3Wyb", "postedAt": "2023-03-27T17:10:16.332Z", "postId": "CGofXqkwzdaabgzhJ", "htmlBody": "<p>How does Focus Philanthropy compare and contrast with Farmed Animal Funders?</p><p>Good luck!</p>", "parentCommentId": null, "user": {"username": "Tyner"}}, {"_id": "WgntwmAjzBcQCboZy", "postedAt": "2023-03-27T22:32:16.278Z", "postId": "CGofXqkwzdaabgzhJ", "htmlBody": "<p>Equally enthusiastic about your project, good luck. Would love to hear the answer to this though -- and also why the broad name? Would you ever move beyond factory farming?&nbsp;</p>", "parentCommentId": "hsXBDRtnBYuzs3Wyb", "user": {"username": "William Reynolds"}}, {"_id": "Kv2kyHqnwaF9Gt9eT", "postedAt": "2023-03-29T10:06:33.812Z", "postId": "CGofXqkwzdaabgzhJ", "htmlBody": "<p>There's an annoying trend of funders using non-descriptive names. It makes it harder to remember what they do. It seems mutually negative for a bunch of reasons.<br><br>1. Makes you appear lower down search rankings for relevant terms e.g. \"Farmed Animal Welfare Funder\"<br><br>2. Makes it harder to remember what they do, so people forget and have to click on their website over and over to remind themselves&nbsp;<br><br>-&gt; more relevant people forgetting what you do and thus not applying &amp; more irrelevant people viewing your information (thus wasting their time)<br><br>Compare and contrast to something like \"Mental Health Funding Circle\" or \"EA Animal Welfare Fund\" where it's immediately apparent to both the relevant and irrelevant.</p>", "parentCommentId": "WgntwmAjzBcQCboZy", "user": {"username": "John Salter"}}, {"_id": "mxZshz4hsFgZunxRv", "postedAt": "2023-05-29T00:43:08.440Z", "postId": "CGofXqkwzdaabgzhJ", "htmlBody": "<p>Farmed Animal Funders has a minimum requirement of 250k donation per year to qualify for their donor advising services. Focus Philanthropy doesn't list a minimum that I can see. Other than that, I'm not sure what the differences are.</p>", "parentCommentId": "hsXBDRtnBYuzs3Wyb", "user": {"username": "Constance Li"}}]