[{"_id": "iPw8vy7mmN6nWnbgF", "postedAt": "2021-11-15T19:31:43.581Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>On reading just the summary, the immediate consideration I had was that the EMH would imply that in the counterfactual where I don't invest in Mind Ease, someone else will, and if I do invest in Mind Ease, someone else will not. After reading the post, it looks like you have two important points here against this—first, early-stage venture markets are not necessarily as subject to the EMH, and second, it's different in this case because EA-aligned investors would be willing to take a lower financial return than they could get with the same risk otherwise in order to do good. Do you agree that impact investing in the broader financial market into established companies has very little counterfactual impact, or is there something I'm missing there? I'm interested in further research on this concept, and I'm not sure how much EA-aligned for-profits are already working on this.</p>", "parentCommentId": null, "user": {"username": "devanshpandey"}}, {"_id": "mZFT2tW3Kf9pXeBrH", "postedAt": "2021-11-15T20:09:26.137Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thanks for commenting! Our point is not only that VC markets are inefficient and thus the EMH may not apply, but also that the EMH is only a statement on the pricing of assets, and does not in fact imply that all available assets will be funded. Thus, it is possible for investments that offer market-rate returns to go unfunded and for the EMH to still hold.</p>\n<p>Interestingly, in VC, investors and founders can actually negotiate the pricing for an investment round. Thus, it may be possible for most/all startups to produce market-rate returns if the valuation is tweaked (for example, founders getting less dollars per share than they are asking investors for in a priced round), but since many startups don't even get an investment offer, clearly not all market-rate investments are being funded.</p>\n<p>Even if this is not the case, altruistic investors/impact investors are willing to make concessionary investments in which expected returns are lower than the market rate. For example impact investors give loans to nonprofits or disadvantaged communities at interest rates lower than the market rate, gaining both impact returns and financial returns, whereas for-profit investors may pass because they are only looking at financial returns.</p>\n<p>In my opinion, it seems like the consensus is that primary market investments (like VC investing and loans directly to people and organizations) are much higher impact than secondary market investments, and I agree with this consensus. I think there may be the chance that creative secondary market strategies, like forms of shareholder advocacy, may have a counterfactual impact (the exact degree of which is unclear), but I haven't looked into it much yet.</p>\n<p>\"I'm interested in further research on this concept, and I'm not sure how much EA-aligned for-profits are already working on this.\"</p>\n<p>Which concept are you referring to?</p>\n", "parentCommentId": "iPw8vy7mmN6nWnbgF", "user": {"username": "Brendon_Wong"}}, {"_id": "nNWwFyJrnzp9oFsEB", "postedAt": "2021-11-15T21:21:14.657Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>This is a great analysis!</p><p>I'm working on an EA-aligned public benefit corporation (www.dozy.health) with similar ambitions as Mind Ease, but for insomnia treatment. My funding up to this point has predominantly been from EA-driven investors, implicitly based on a model like this. Having a more formalized analysis for the approach I'm taking will be helpful. &nbsp;:)</p>", "parentCommentId": null, "user": {"username": "samstowers"}}, {"_id": "vtsRdu2BrhiK2KNtv", "postedAt": "2021-11-16T10:41:05.384Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thanks for this interesting analysis! Do you have a link to &nbsp;Foster's analysis of MindEase's impact?</p><p>How do you think the research on MindEase's impact compares to that of GiveWell's top charities? Based on your description of Hildebrandt's analysis for example, it seems less strong than e.g. the several randomized control trials supporting distributing bed nets. &nbsp;Do you think discounting based on this could substantially effect the cost-effectiveness? (Given how much lower Foster's estimate of impact is though and that this is more heavily used in the overall cost-effectiveness, I would be interested to see whether this has a stronger evidence base?)</p>", "parentCommentId": null, "user": {"username": "RobertHarling"}}, {"_id": "mz4Ty22zWYRH5Aoce", "postedAt": "2021-11-16T16:44:50.306Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>It seems to me like the case for MindEase (whether from an impact perspective or from a return-on-investment perspective) rests on MindEase's ability to attract users.&nbsp;</p><p>Can you say more where the estimate of 1,000,000 active users came from, as well as the 25% chance of success? At first glance, this strikes me as overly optimistic, given that a) many other well-designed apps have failed to acquire users and b) it seems really hard to compete with the existing mindfulness apps. (See <a href=\"https://ajp.psychiatryonline.org/doi/10.1176/appi.ajp.2019.19090905?url_ver=Z39.88-2003&amp;rfr_id=ori:rid:crossref.org&amp;rfr_dat=cr_pub%20%200pubmed\">here</a>, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7801857/\">here</a>, and <a href=\"https://psycnet.apa.org/record/2020-65097-001\">here</a> for papers that go into these points in greater detail).</p>", "parentCommentId": null, "user": {"username": "Akash"}}, {"_id": "P3tWg2D35LAQ9gSrh", "postedAt": "2021-11-16T18:13:11.340Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Hi Akash! Yep, I think Mind Ease's ability to attract users is certainly an important factor! I think of it as Mind Ease's counterfactual ability to get users relative to other apps (for example, since Mind Ease is impact-driven, they could offer the app for free to people living in low-income countries which profit-driven competitors are not incentivized to do) as well as Mind Ease's counterfactual impact on users compared to a substitute anxiety reduction app (for example, data in the cost-effectiveness analysis section of <a href=\"https://docs.google.com/document/d/1Y0Mc0pI-pDMQMPg8M4F0zA1KYiXuvW5q7MPXRH9sX7k/edit?usp=sharing\">Hauke's report</a> pointing Mind Ease potentially having a stronger effect on GAD-7 anxiety scores compared to Pacifica, a popular alternative, as well as the general rigor of their approach).</p><p>The active user estimates were modeled in TPP's full report on Mind Ease. &nbsp;We provide a high-level overview of the data that was considered in the full report, which \"included Mind Ease’s background and plans (including offering a free or discounted version of the app to low/middle income countries), historical downloads and active users, competitors, and financial details.\" The report leveraged Lionheart's business analysis, and based on my knowledge of information such as Mind Ease's historical user figures and strategic options like offering the app for free to certain populations, I think the report's user growth projections are reasonable (and those projections are only for the 25% \"success\" case).</p><p>As a reference point for the 25% chance of success, it's possible that many people's views on startup success are shaped by headlines like \"<a href=\"https://www.investopedia.com/articles/personal-finance/040915/how-many-startups-fail-and-why.asp#:~:text=In%202019%2C%20the%20failure%20rate,70%25%20in%20their%2010th%20year.\">90% of startups fail</a>.\" However, the criteria for the startups that are included in the numerator and denominator of such success calculations can greatly affect the final number. Funded startups have higher success rates than one might expect. In our footnote on startup base rates which you may find interesting, \"Funded ventures had a 76% survival rate (to 2010) and 27% \"success\" rate (exit or &gt;75 employees).\" The 25% success rate aligns very closely with the 27% success rate of funded ventures gaining over 75 employees or getting acquired in the study we cited. The study findings align with other research/reports I am familiar with.</p>", "parentCommentId": "mz4Ty22zWYRH5Aoce", "user": {"username": "Brendon_Wong"}}, {"_id": "BDQQpQeCJXt8avwBS", "postedAt": "2021-11-16T18:15:38.297Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thanks Sam! Great to hear this could be a valuable framework through which to view Dozy's impact from a philanthropic and investment perspective.</p>", "parentCommentId": "nNWwFyJrnzp9oFsEB", "user": {"username": "Brendon_Wong"}}, {"_id": "LLhtAGyeefwgEnyMF", "postedAt": "2021-11-16T18:44:05.425Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Hi Robert, Foster's analysis currently isn't publicly available, but more details from Foster's analysis are available in TPP's full report on Mind Ease. To my knowledge, it was not stronger evidence that resulted in a lower efficacy estimate from Foster's research, but skepticism of the longer-term persistence of effects from anxiety reduction methods as well as analyzing the Mind Ease app as it is in the present—not incorporating the potential emergence of stronger evidence of the app's efficacy, as well as future work on the app. As one would expect, Mind Ease plans on providing even stronger efficacy data and further developing its app as time goes on.</p><p>As mentioned in our writeup, TPP used the lower estimate \"because if Mind Ease still looks attractive in this \"worst case,\" then it would definitely look attractive with weights that are less tilted towards Foster’s estimate,\" rather than skewing based on the strength of a particular estimate. &nbsp;I think it's quite possible that Mind Ease's expected impact is considerably higher than the example conservative estimate shared in this writeup. Using different framings, such as the <a href=\"https://forum.effectivealtruism.org/posts/mY4pZSwvFCDsjorJX/donating-money-buying-happiness-new-meta-analyses-comparing\">Happier Lives Institute's findings</a> regarding the cost-effectiveness of mental health interventions, can also result in much higher estimates of Mind Ease's expected impact compared to GiveWell top charities.</p><p>I personally haven't spent much time looking over GiveWell's evaluations, but <a href=\"https://docs.google.com/document/d/1Y0Mc0pI-pDMQMPg8M4F0zA1KYiXuvW5q7MPXRH9sX7k/edit?usp=sharing\">Hauke's full report</a> \"avoid[s] looking at individual studies and focus[es] mostly on meta-analyses and systematic reviews of randomized controlled trials.\" I'd expect that someone's assessment of Mind Ease's impact will generally follow their opinion of how cost effective digital mental health interventions are compared to getting no treatment (Hauke's report mentions that most people suffering from depression and anxiety do not receive timely treatment or any treatment at all, particularly in developing countries).</p>", "parentCommentId": "vtsRdu2BrhiK2KNtv", "user": {"username": "Brendon_Wong"}}, {"_id": "oRLz6ERQPxh6Y9shB", "postedAt": "2021-11-16T21:15:11.982Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>To add two additional points to Brendon's comment.</p>\n<p>The 1,000,000 active users is cumulative over the 8 years. So, just for example, it would be sufficient for Mind Ease to attract 125,000 users a year each year. Still very non-trivial, but not quite as high a bar as 1,000,000 MAU.</p>\n<p>We were happy we the 25% chance of success primarily because of the base rates Brendon mentioned. In addition this can include the possibility that Mind Ease isn't commercially viable for reasons unconnected to its efficacy, so the IP could be spun out into a non-profit. We didn't put much weight on this, but it does seem like a possibility. I'm mentioning it mostly because it's an interesting consideration with impact investing that could be even more important in some cases.</p>\n", "parentCommentId": "P3tWg2D35LAQ9gSrh", "user": {"username": "jh"}}, {"_id": "icMgNBi2gCyHmbehL", "postedAt": "2021-11-16T21:39:34.583Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Just to add, for the record, that we released most of Hauke's work because it was a meta-analysis that we hope contributes to the public good. We haven't released either Hauke or Derek's analyses of Mind Ease's proprietary data. Though, of course, their estimates and conclusions based on their analyses are discussed at a high level in the case study.</p>\n", "parentCommentId": "LLhtAGyeefwgEnyMF", "user": {"username": "jh"}}, {"_id": "ihtckGikgW36pHX7x", "postedAt": "2021-11-17T15:22:08.723Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thank you, Brendon and jh! A few more thoughts/questions below. Feel free to ignore any that are not super relevant or that would take a very long time to address.</p><ul><li>My understanding is that most popular apps (e.g., Headspace, Calm) offer free versions to people [including people in low- and middle-income countries]. I suppose MindEase would have an edge if it offers the full (premium) version for free, but it still seems quite difficult to compete with highly popular apps like Headspace/Calm. What do you think? And has this model of offering an app for free in low- and middle-income countries worked for any apps in the past?</li><li>The Pacifica study that Hauke cites compares counseling alone to counseling + Pacifica. This seems like a comparison that would <i>underestimate</i> the effect of Pacifica. (It seems rather impressive that an app is able to have any effect <i>above and beyond </i>therapy, and I would imagine its standalone effect to be larger). Furthermore, I don't think Pacifica will be Mind Ease's main competitor-- Headspace and Calm appear to be much more popular than Pacifica (<a href=\"https://pubmed.ncbi.nlm.nih.gov/32354266/\">here</a> and <a href=\"https://psycnet.apa.org/record/2020-65097-001\">here</a>), and they also focus on mindfulness/relaxation. Are there any estimates of Mind Ease's counterfactual impact relative to Headspace or Calm?</li><li>Is the business analysis by Lionheart publicly available? (Apologies if you said this somewhere in your post).</li><li>Thank you for the info about startups! I'm still a bit skeptical about the mental health app space in particular; are there any statistics about the percentage of funded health/mental health app startups that succeed?</li></ul>", "parentCommentId": "P3tWg2D35LAQ9gSrh", "user": {"username": "Akash"}}, {"_id": "oaGbYNCvG84fpyCYf", "postedAt": "2021-11-17T17:28:24.918Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>These are great points! FYI, jh is Jonathan Harris who runs TPP.</p><p>I'll preface my response by saying that I'm not an expert in this area; Will and I mostly focused on the impact investing side of things, and Hauke or someone on the Mind Ease team could likely provide a better response.</p><blockquote><p>My understanding is that most popular apps (e.g., Headspace, Calm) offer free versions to people [including people in low- and middle-income countries]. I suppose MindEase would have an edge if it offers the full (premium) version for free, but it still seems quite difficult to compete with highly popular apps like Headspace/Calm. What do you think? And has this model of offering an app for free in low- and middle-income countries worked for any apps in the past?</p></blockquote><p>I think that Headspace and Calm may not be the right reference points since they're not designed to tackle anxiety and depression, whereas Sanvello (formerly Pacifica) is. Headspace and Calm strike me more as \"mindfulness apps\" versus \"mental health apps.\" For instance, it doesn't look like Mindspace and Calm feature any CBT exercises, whereas Sanvello does. I have paid access to Calm via my employer, and while I haven't used it much, it looks like all it has are guided meditations. Reviews of <a href=\"https://www.healthline.com/health/mental-health/headspace-review#what-is-it\">Headspace</a> and <a href=\"https://www.healthline.com/health/mental-health/calm-app-reviews\">Calm</a> support my initial impression and mention that they just have guided meditation and music. I &nbsp;expect that evidence-based practices specifically designed to target certain mental health conditions are significantly more efficacious than guided mindfulness meditations.</p><p>This distinction might've made it so that this <a href=\"https://www.psychologytoday.com/us/blog/how-do-life/201902/the-sanvello-app\">Psychology Today review</a> from 2019 mentions Sanvello as \"the most popular\" mental health app, ignoring Headspace and Calm. Regarding competition, it mentions that Sanvello has 2.6 million registered users, which is smaller than Headspace and Calm but still seems significant. It seems like other apps, including ones I've never heard of, have also been able to get decent user counts. For example, Moodpath <a href=\"\">reached 1 million downloads</a> in 2019. Regardless of whether Headspace and Calm are competitors, Sanvello and other apps would still need to be competed against. Unlike other industries, like network effects with social media, I don't think that the major mindfulness/mental health apps have enough of a moat to prevent other competitors from emerging.</p><p>My understanding is that Headspace and Calm offer their vast majority of their content behind a paywall. The Headspace review I linked to suggests free users get access to one-third of a \"Basics\" (introductory meditation) course before they need to pay.</p><p>What constitutes releasing an app for free as \"working?\" It's commonly known that free apps get many more downloads and are the <a href=\"https://www.statista.com/statistics/263797/number-of-applications-for-mobile-phones/\">vast majority</a> of apps on the iOS and Android app store, so I would expect that this would be a very effective user acquisition strategy (but perhaps not an effective monetization strategy, hence the social impact angle).</p><blockquote><p>The Pacifica study that Hauke cites compares counseling alone to counseling + Pacifica. This seems like a comparison that would <i>underestimate</i> the effect of Pacifica. (It seems rather impressive that an app is able to have any effect <i>above and beyond </i>therapy, and I would imagine its standalone effect to be larger). Furthermore, I don't think Pacifica will be Mind Ease's main competitor-- Headspace and Calm appear to be much more popular than Pacifica (<a href=\"https://pubmed.ncbi.nlm.nih.gov/32354266/\">here</a> and <a href=\"https://psycnet.apa.org/record/2020-65097-001\">here</a>), and they also focus on mindfulness/relaxation. Are there any estimates of Mind Ease's counterfactual impact relative to Headspace or Calm?</p></blockquote><p>Sanvello (Pacifica) was likely selected because it is the most efficacious competitor in the same space. I'm not sure about how Hauke utilized the study findings in his report and his reasoning for doing so, so I'll have to defer to him on this. I'll let him know about your question!</p><p>It's worth pointing out that the report uses a very conservative counterfactual user impact estimate that is much closer to Foster's estimate than Hauke's estimate due to \"principles of robust decision making under uncertainty.\"</p><blockquote><p>Is the business analysis by Lionheart publicly available? (Apologies if you said this somewhere in your post).</p></blockquote><p>It is not! TPP has not publicly released information containing private data from Mind Ease, which includes the business analysis and Foster's report. That's why the section on Mind Ease user data is not included in Hauke's report.</p><blockquote><p>Thank you for the info about startups! I'm still a bit skeptical about the mental health app space in particular; are there any statistics about the percentage of funded health/mental health app startups that succeed?</p></blockquote><p>There isn't too much information out there on startup success rates, and I'm afraid I'm not familiar with success data specifically about mental health apps!</p>", "parentCommentId": "ihtckGikgW36pHX7x", "user": {"username": "Brendon_Wong"}}, {"_id": "t9iWhzE4okgwnXFbK", "postedAt": "2021-11-17T18:54:18.873Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Just to add that in the analysis we only assumed Mind Ease has impact on 'subscribers'. This meanings paying users in high income countries (and active/committed users in low/middle income countries). We came across this <a href=\"https://www.profitwell.com/recur/all/headspace-calm-pricing\">pricing analysis</a> while preparing our report. It has very little to do with impact but it does a) highlight Brendon's point that Headspace/Calm are seen as meditation apps, and b) that anxiety reduction looks to be among the highest Willingness To Pay / high value to the customer segments  into which Headspace/Calm could expand (e.g. by relabeling their meditations as useful for anxiety). The pricing analysis doesn't even mention depression (which Mind Ease now addresses following the acquisition of Uplift). Perhaps because they realize it is a more severe mental health condition.</p>\n", "parentCommentId": "oaGbYNCvG84fpyCYf", "user": {"username": "jh"}}, {"_id": "wZ2hHzbsufAh7kwtX", "postedAt": "2021-11-18T16:31:17.928Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>[Edited on 19 Nov 2021: I was asked to remove the links.]</p><p>For those who are interested, here is the write-up of my per-user impact estimate (which was based in part on statistical analyses by David Moss): [removed]</p><p>The Main Model in Guesstimate is here: [removed]</p><p>The Effect Size model, which feeds into the Main Model, is here: [removed]</p><p>I was asked to compare it to GiveDirectly donations, so results are expressed as such. Here is the top-level summary:</p><blockquote><p>Our analysis suggests that, <i>compared to doing nothing</i> to relieve anxiety, MindEase causes about as much benefit per <i>paying</i> user as donating $40 (90% confidence interval: $10 to $140) to GiveDirectly. We suspect that other leading apps are similarly effective (perhaps more so), in which case most of the value of MindEase will come from reaching people who would not have accessed alternative treatment.</p><p>Due to time constraints and lack of high-quality information, the analysis involved a lot of guesswork and simplifying assumptions. Of the parameters included in our Main Model, the results are most sensitive to the effect sizes of both MindEase and GiveDirectly, the retention of those effects over time, and the choice of outcome metric (DALYs vs WELLBYs). One large, independent study could eliminate much of this uncertainty. Additional factors worth considering include indirect effects (e.g. economic productivity, meat consumption, evidence generation), opportunity costs of team members’ time, and robustness to non-utilitarian worldviews.</p></blockquote><p>Note that this was done around June 2020 so there may be better information on MindEase's effectiveness by now. Also, I think the Happier Lives Institute has since done a more thorough analysis of the wellbeing impact of GiveDirectly, which could potentially be used to update the estimate.</p>", "parentCommentId": null, "user": {"username": "Derek"}}, {"_id": "b7nTJkhETb9ypDBpv", "postedAt": "2021-11-18T21:56:16.670Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>[Edited on 19 Nov 2021: I removed links to my models and report, as I was asked to do so.]</p><p>Just to clarify, our (Derek Foster's/Rethink Priorities') estimated Effect Size of ~0.01–0.02 DALYs averted per paying user assumes a counterfactual of no treatment for anxiety. It is misleading to estimate total DALYs averted without taking into account the proportion of users who would have sought other treatment, such as a different app, and the relative effectiveness of that treatment.&nbsp;</p><p>In our Main Model, these inputs are named \"Relative impact of Alternative App\" and \"Proportion of users who would have used Alternative App\". The former is by default set at 1, because the other leading apps seem(ed) likely to be at least as effective as Mind Ease, though we didn't look at them in depth independently of Hauke. The second defaults to 0; I suppose this was to get an upper bound of effectiveness, and because of the absence of relevant data, though I don't recall my thought process at the time. (If it's set to 1, the counterfactual impact is of course 0.)</p><p>Our summary, copied in a <a href=\"https://forum.effectivealtruism.org/posts/Ch5NZ7LhsY3mumMzn/ea-aligned-impact-investing-mind-ease-case-study?commentId=wZ2hHzbsufAh7kwtX\">previous comment</a>, also stresses that the estimate is per <i>paying</i> user. I don't remember exactly why, but our report says:</p><blockquote><p>Other elements of the MindEase evaluation (i.e. parts not done by Rethink Priorities) consider a “user” to be a paying user, i.e. someone who has downloaded the app and purchased a monthly or annual plan. For consistency, we will adopt the same definition. <strong>(Note that this is a very important assumption, as the average effect size and retention is likely to be many times smaller for those who merely download or install the app.)</strong></p></blockquote><p>As far as I can tell (correct me if I'm wrong), your \"Robust, uncertainty-adjusted DALYs averted per user\" figure is essentially my theoretical upper-bound estimate with no adjustments for realistic counterfactuals. It seems likely (though I have no evidence as such) that:</p><ul><li>Many users would otherwise use a different app.</li><li>Those apps are roughly as effective as MindEase.</li><li>The users who are least likely to use another app, such as people in developing countries who were given free access, are unlikely to be paying (and therefore perhaps less likely to regularly use/benefit from it) – not to mention issues with translation to different cultures/languages.</li></ul><p>So 0.02 DALYs averted per user seems to me like an extremely optimistic average effect size, based on the information we had around the middle of last year.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Derek"}}, {"_id": "t7DswraXgoRGdhJLs", "postedAt": "2021-11-19T10:19:02.677Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Hi Derek, hope you are doing well. Thank you for sharing your views on this analysis that you completed while you were at Rethink Priorities.</p>\n<p>The difference between your estimates and Hauke's certainly made our work more interesting.</p>\n<p>A few points that may be of general interest:</p>\n<ul>\n<li>For both analysts we used 3 estimates, an 'optimistic guess', 'best guess' and 'pessimistic guess'.</li>\n<li>For users from middle-income countries we doubled the impact estimates. Without reviewing our report/notes in detail, I don't recall the  rationale for the specific value of this multiplier. The basic idea is that high-income countries are better served, more competitive markets, so apps are more likely to find users with worse counterfactuals in middle income countries.</li>\n<li>The estimates were meant to be conditional on Mind Ease achieving some degree of success. We simply assumed the impact of failure scenarios is 0. Hauke's analysis seems to have made more clear use of this aspect. Not only is Hauke's reading of the literature more optimistic, but he is more optimistic about how much more effective a successful Mind Ease will be relative to the competition.</li>\n<li>Indeed the values we used for Derek's analysis, for high income countries, were all less than 0.01. We simplified the 3 estimates, doing a weighted average across the two types of countries, into the single value of 0.01 for Derek's analysis after rounding up (I think the true number may be more like 0.006). The calculations in the post use rounded values so it is easier for a reader to follow. Nevertheless, the results are in line with our more detailed calculations in the original report.</li>\n<li>Similar to this point of rounding, we simplified the explanation of the robustness tilt we applied. It wasn't just about Derek vs Hauke. It was also along the dimensions of the business analysis (e.g. success probabilities). We simplified the framing of the robustness tilt both here and in a 'Fermi Estimate' section of the original report because we believed that it is conceptually clearer to only talk about the one dimension.</li>\n<li>What would I suggest to someone who would like to penalize the estimate more or less for all the uncertainty? Adjust the impact return.</li>\n<li><strong>How can you adjust the impact return in a consistent way?</strong> Of course, to make analyses like this useful you would want to do them in a consistent fashion. There isn't a golden standard for how to control the strength of the robustness tilts we used. But you can think of the tilt we applied (in the original report) as being like being told a coin is fair (50/50) and then assuming it is biased to 80% heads (if heads is the side you don't want). This is an expression of how different our tilted probability distribution was from the distribution in the base model (the effect on the impact estimate was more severe; 1-0.02/(0.25/2+0.01/2)=85%). There is a way of assessing this \"degree of coin-equivalent tilt\" for any tilt of any model. So if you felt another startup had the same level of uncertainty as Mind Ease you could tilt your model of it until you get the same degree of tilt. This would give you some consistency and not make the tilts based purely in analyst intuition (though of course there is basically no way to avoid some bias). If a much better way to consistently manage these tilts was developed, we would happily use it.</li>\n<li>Overall, this analysis is just one example of how one might deal with all the things that make such assessments difficult including impact uncertainty, business uncertainty, and analyst disagreement. The key point really being a need to summarize all the uncertainty in a way that is useful to busy, non-technical decision makers who aren't going to look at the underlying distributions. We look forward to seeing how techniques in this regard evolve as more and more impact assessments are done and shared publicly.</li>\n</ul>\n", "parentCommentId": "b7nTJkhETb9ypDBpv", "user": {"username": "jh"}}, {"_id": "A7nmfscMCM499dC2o", "postedAt": "2021-12-20T00:47:19.577Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>From an impartial perspective, I think it is also necessary to account for the wallet of the customer, not only of the investor. After all, the only reason why the investor gets their money back, is that customers are paying for the product.<br><br>In other words, &nbsp;one could add a row \"Financial loss customer\" to the decision matrix. For the \"Pass &amp; Give Now\" Column it would be 0% (there is customer who pays the investor back). For all other columns it would be 100%, I think. That is, once the customers wallet is taken into account, the best world would be if either the investor did not invest but donate to the BACO, or the customer did not buy the App but donate to the BACO instead.<br><br>So all things considered, solo and lead impact investing are good, but only 7 and 30% as good as donating to the BACO, respectively. Or am getting this wrong?</p>", "parentCommentId": null, "user": {"username": "Paul_Lang"}}, {"_id": "i3gnvYmd32Lgwi4up", "postedAt": "2021-12-20T06:05:04.237Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thanks for this comment and question, Paul.</p>\n<p>It's absolutely true that the customer's wallets are worth potentially considering. An early reviewer of our analysis also made a similar point. In the end we are fairly confident this turns out to not be a key consideration. The key reason is that mental health is generally found to be a service for which people's willingness to pay is far below the actual value (to them). Especially for likely paying customer markets of e.g. high-income country iPhone users, the subscription costs were judged to be trivial compared to changes in their mental health. This is why, if I remember correctly, this consideration didn't feature more prominently in Hauke's report (on the potential impacts on the customers). Since it didn't survive there, it also didn't make it into the investment report.</p>\n<p>I'm not quite sure I understand the point about the customer donating to the BACO instead. That could definitely be a good thing. But it would mean an average customer with anxiety choosing to donate to a highly effective charity (presumably instead of not buying the App). This seems unlikely. More importantly, it doesn't seem like the investor can influence it?...</p>\n<p>In short, since the expected customers are reasonably well off non-EAs, concerns about customer wallet or donations didn't come into play.</p>\n", "parentCommentId": "A7nmfscMCM499dC2o", "user": {"username": "jh"}}, {"_id": "JhNCYfNzNW4n3oPtP", "postedAt": "2021-12-23T15:12:08.558Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thanks for the response. My issue was just that the money flow from the customer to the investor was accounted as positive for the investor, but not negative for the customer. I see the argument that customers are reasonably well off non-EAs whereas the investor is an EA. I am not sure if it can be used to justify the asymmetry in the accounting.<br><br>Perhaps it would make sense that an EA investor is only 10% altruistic and 90% selfish (somewhat in line with the 10% GW pledge)? The conclusion of that would be that investing is doing good, but donating is doing more good.</p>", "parentCommentId": "i3gnvYmd32Lgwi4up", "user": {"username": "Paul_Lang"}}, {"_id": "QidQmgC7A62MDHmSi", "postedAt": "2021-12-23T16:03:09.225Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>I'm still not sure I understand your point(s). The payment of the customers was accounted for as a negligible (negative) contribution to the net impact per customer.</p>\n<p>To put it another way: Think of the highly anxious customers each will get $100 in benefits from the App plus 0.02 DALYs averted (for themselves) on top of this. The additional DALYs being discounted for the potential they could use another App.</p>\n<p>Say the App fee is $100 dollars. This means to unlock the additional DALYs the users as a group will pay $400 million over 8 years.</p>\n<p>The investor puts in their $1 million to increase the chances the customers have the option to spend the $400m. In return they expect a percentage of the $400m (after operating costs, other investors shares, the founders shares). But they are also having a counterfactual effect on the chance the customers have/use this option.</p>\n<p>This is basically a scaled up version of a simple story where the investor gives a girl called Alice a loan so he can get some therapy. The investor would still hope Alice repays them with interest. But they also believe that without their help to get started she would have been less like to get help for herself. Should they have just paid for her therapy? Well, if she is a well-off, western iPhone user who comfortably buys lattes everyday, then that's surely ineffective altruism. Unless she happens to be the investor's daughter or something, so it makes sense for other reasons.</p>\n<p>I think the message of this post isn't that compatible with general claims like \"investing is doing good, but donating is doing more good\". The message of the post is that specific impact investments can pass a high effectiveness bar (i.e. $50 / DALY). If the investor thinks most of their donation opportunities are around $50/DALY, then they should see Mind Ease as a nice way to add to their impact.</p>\n<p>If their bar is $5/DALY (i.e. they see much more effective donation opportunities) then Mind Ease will be less attractive. It might not justify the cost of evaluating it and monitoring it. But for EAs who are investment experts the costs will be lower. So this is all less an exhortation for non-investor EAs to learn about investing, and more a way for investor EAs to add to their impact.</p>\n<p>Overall, the point of the post is a meta-level argument that we can compare donation and investment funding opportunities in this way. But the results will vary from case to case.</p>\n", "parentCommentId": "JhNCYfNzNW4n3oPtP", "user": {"username": "jh"}}, {"_id": "RuTRHy4H9bvKBofAC", "postedAt": "2021-12-23T22:36:34.778Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>I agree with your statement that \"The message of the post is that specific impact investments can pass a high effectiveness bar\"<br><br>But when you say &gt;&gt;I think the message of this post isn't that compatible with general claims like \"investing is doing good, but donating is doing more good\".&lt;&lt; I think I must have been misled by the decision matrix. To me it suggested this comparison between investment and donation, while not being able to resolve a difference between the columns \"Pass &amp; Invest to Give\", \"Pass &amp; Give now\" (and a hypothetical column \"Pass &amp; Invest to keep the money for yourself\", with presumably all zero rows), which would all result in zero total portfolio return (differences between these three options would become visible if the consumer wallet would be included and the \"Pass &amp; Invest to Give\" would create impact through giving, like the \"Pass &amp; Give now\" column does).<br><br>Anyway, &nbsp;I now understand that this comparison between investing and donating was never the message of the post, so all good.</p>", "parentCommentId": "QidQmgC7A62MDHmSi", "user": {"username": "Paul_Lang"}}, {"_id": "sqg3wXM4BpYcrEJDW", "postedAt": "2022-08-18T17:23:48.259Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thank you, Akash, for sharing these papers. They are fascinating! <a href=\"https://www.jmir.org/2019/9/e14567/\">Here</a> is another paper that I sometime cite when referring to the \"retention\"-problem. It is a systematic analysis<i> </i>of infield data, estimating that 90% of users trying unguided mental health apps drop out after 7 days &nbsp;(<a href=\"https://www.jmir.org/2019/9/e14567/\"><u>Baumel &amp; Edan, 2019</u></a>).<br>&nbsp;</p>", "parentCommentId": "mz4Ty22zWYRH5Aoce", "user": {"username": "Inga"}}, {"_id": "hft3jCydgwnR25gFL", "postedAt": "2022-08-19T12:00:43.452Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Thanks for sharing this reference, Inga!</p>\n", "parentCommentId": "sqg3wXM4BpYcrEJDW", "user": {"username": "jh"}}, {"_id": "C2n6nx7wL9cfarQxt", "postedAt": "2022-09-20T07:56:00.896Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>First: I like the framework and the fact that you help to make impact vesting a viable option for the EA space. It indeed might open more opportunities for entering a multitude of markets and funding. Having a streamlined standard EA-aligned framework for this in the Global Health and Wellbeing Space could make the investment process more attractive (smooth), more efficient (options clearer and better comparable), and lead to better decisions (if the background analysis is high-quality).&nbsp;</p><p>Some points that jumped to my head for this specific case:</p><p>Might it be useful to add something like “<strong>neglectedness” of funding</strong>”? E.g. in the Mindease Case, I believe it was moderately likely (depending on the quality of the presented scaling strategy) that another investor would have jumped in to take the lead. There might be value in identifying and helping (1) ventures that have a promising impact prospect but low funding chances or (2) ventures that look like they might not have a promising impact prospect but since you have some rare specialists in the corresponding field, you know it is better than other options in the field. E.g. if Mindease had a really promising approach (evaluated by the specialists) to solve the low retention of users or the lack of sustainable effects of mental health interventions.</p><p>The evaluation of <strong>neglectedness </strong>(of the solution/problem) seemed partly confusing to me. It is correct that lots of people suffering from mental health issues do not receive treatment. This is also true in HIC where digital solutions are widely available. The real neglected problem seems to be the distribution of these interventions and this has been hard for all companies out there offering services like that and is only possible if you adapt your service to the specifics of the different cultures and countries and then also tailor the distribution strategy. This means, that currently Mindease just does something in HIC that other apps such as Sanvello are offering already (maybe no additional value for people that in this calculation is added to the DAILYs) and does not have product or market strategy for LMIC - where it would be neglected. Convincing providers like Sanvello to offer their services in LMIC, and then just specializing in tailoring the product for people in a specific large country (e.g. Nigeria) as well as nailing distribution there, might be much more impactful. E.g. the UK-based charity Overcome does something along the lines of this.&nbsp;</p><p>Having said this, maybe the<strong> impact evaluation</strong> should be done by an expert in the field: in this case an individual that knows the current state of research, practice, and industry and has a background in the field (here: mental health interventions).&nbsp;</p><p>Would it be useful also to add a <strong>“people’s time resources”</strong> needed to the equation? E.g. it is a difference if 10 or 30 EA spend their time working on this solution because they could also help to make an impact elsewhere.</p>", "parentCommentId": null, "user": {"username": "Inga"}}, {"_id": "fDMNkhrLfBGEn3hiC", "postedAt": "2022-09-21T01:17:48.850Z", "postId": "Ch5NZ7LhsY3mumMzn", "htmlBody": "<p>Hi Inga, thanks for commenting!</p><blockquote><p>First: I like the framework and the fact that you help to make impact vesting a viable option for the EA space. It indeed might open more opportunities for entering a multitude of markets and funding. Having a streamlined standard EA-aligned framework for this in the Global Health and Wellbeing Space could make the investment process more attractive (smooth), more efficient (options clearer and better comparable), and lead to better decisions (if the background analysis is high-quality).&nbsp;</p></blockquote><p>Thanks! I personally think that impact investing is an incredibly promising space for EA.</p><blockquote><p>Might it be useful to add something like “<strong>neglectedness” of funding</strong>”? E.g. in the Mindease Case, I believe it was moderately likely (depending on the quality of the presented scaling strategy) that another investor would have jumped in to take the lead. There might be value in identifying and helping (1) ventures that have a promising impact prospect but low funding chances or (2) ventures that look like they might not have a promising impact prospect but since you have some rare specialists in the corresponding field, you know it is better than other options in the field. E.g. if Mindease had a really promising approach (evaluated by the specialists) to solve the low retention of users or the lack of sustainable effects of mental health interventions.</p></blockquote><p>That's already included under \"Investor Impact!\" See &nbsp;\"funding probability.\" If I recall correctly, the 15% indicates that there's a ~1/6 chance this investment was counterfactually impactful, and that draws from the &nbsp;much lengthier documents written by TPP that this writeup is based on.</p><blockquote><p>The evaluation of <strong>neglectedness </strong>(of the solution/problem) seemed partly confusing to me. It is correct that lots of people suffering from mental health issues do not receive treatment. This is also true in HIC where digital solutions are widely available. The real neglected problem seems to be the distribution of these interventions and this has been hard for all companies out there offering services like that and is only possible if you adapt your service to the specifics of the different cultures and countries and then also tailor the distribution strategy. This means, that currently Mindease just does something in HIC that other apps such as Sanvello are offering already (maybe no additional value for people that in this calculation is added to the DAILYs) and does not have product or market strategy for LMIC - where it would be neglected. Convincing providers like Sanvello to offer their services in LMIC, and then just specializing in tailoring the product for people in a specific large country (e.g. Nigeria) as well as nailing distribution there, might be much more impactful. E.g. the UK-based charity Overcome does something along the lines of this.&nbsp;</p></blockquote><p>Did you read Hauke's analysis, or just our brief summary of it? Here's a direct link to the <a href=\"https://docs.google.com/document/d/1Y0Mc0pI-pDMQMPg8M4F0zA1KYiXuvW5q7MPXRH9sX7k/edit#heading=h.56kequnmbuy8\">3.5 pages covering neglectedness</a> in Hauke's report. The extended TPP report covers several distribution strategies, which I personally believe to be very compelling and differentiated from existing apps, and some of them may resemble strategies you proposed. I do not recall if the full report is public, but Jon Harris would know the latest status.</p><blockquote><p>Would it be useful also to add a <strong>“people’s time resources”</strong> needed to the equation? E.g. it is a difference if 10 or 30 EA spend their time working on this solution because they could also help to make an impact elsewhere.</p></blockquote><p>I think that's an interesting idea! I haven't seen too many examples of that in EA analyses, but let me know if you find any on the EA Forum! I can think of a few difficulties associated with doing that and I'm not sure how people would overcome that, including establishing a counterfactual personal impact benchmark (what is the baseline impact of the EA that would have been hired?) and modeling the additive impact of additional team members (does going from 10 to 30 team members triple the impact? under what impact scenarios would that occur?). Also, not all team members would need to be \"EAs\" (what even counts as EA?), and I think that can also be hard to forecast and is somewhat dependent on the team and how things end up working out (whether people end up joining from within or outside EA).</p>", "parentCommentId": "C2n6nx7wL9cfarQxt", "user": {"username": "Brendon_Wong"}}]