[{"_id": "9KySDwrDQYaFyRLdv", "postedAt": "2023-03-06T14:52:38.986Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Although I think this is incredible, there is a nagging feeling in the back of my mind that it may be difficult to sustain the kind of success rate that CE is currently achieving. Do you anticipate that, as you run more incubation programs, you will see more incubated charities failing or shutting down?</p><p>Do you have a sense of whether you will eventually exhaust cost-effective charity ideas as you continue to run more incubation programs?</p>", "parentCommentId": null, "user": {"username": "AryanYadav"}}, {"_id": "3HHvNT6WrsFuD6NLQ", "postedAt": "2023-03-06T14:54:51.506Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Nice one. The success rate is quite phenomenal - especially how committed the founders are to bringing their concepts to fruition. Your biggest strength might be in selecting people even more than selecting causes.</p><p>My one slight issue with the data presentation is the use of \"people reached\" or \"animals reached\" as a &nbsp;headline metric. To some extent I understand using it outside of EA circles as we know that the biggest numbers sound the most impressive, but I don't think it s a &nbsp;impact measurement with integrity. Basically any org that does mass media will reach millions very fast which is great, but it doesn't necessarily translate to impact.&nbsp;</p><p>Endless NGOs spend millions on fairly useless media messages here &nbsp;- give me 10,000 dollars tomorrow in Uganda and I can reach 1 million people with whatever message you like - that's not an impact measurement, what matters is th<i><strong>e result of that message</strong></i> - which looks to be great with CE orgs. What sets your orgs apart is that their approach is backed by evidence and is likely to lead to &nbsp;real positive impact -<strong> </strong><i><strong>not the fact that they can reach millions over the radio, anyone can do that!</strong></i></p><p>Not the biggest deal, but I think within EA we can do better with our headline metrics.</p><p>Small question also, why no mention of Fortify Health, who I think are the CE org which has got the most funding to date and have done an amazing job?</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "KYZhyK9F9CPWiPeZC", "postedAt": "2023-03-06T16:42:55.343Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Thank you for your comment, Yadav.<br>Regarding success rates, we expect the net impact per charity to generally improve because both our program and outreach have gotten stronger. This improvement could still happen even with the overall success rate of our charities decreasing, with more charities shutting down but more charities having large wins, especially in policy. Over time, we expect some of our charities to shut down, with our general estimate being that one in five will.</p><p>Regarding cost-effective ideas, we recognize this as a legitimate concern and something we think about quite a bit. There might be some diminishing returns on the impact of ideas we can find, but researching multiple cause areas has slowed this down a lot. We expect some level of a natural refresh rate as more studies and new evidence comes out on what are the most effective things to do. For example, we expect one new great idea per cause area to become newly available per year. Our current estimates suggest we could start about 10 charities across four cause areas a year for the foreseeable future.</p><p><br><br><br>&nbsp;</p>", "parentCommentId": "9KySDwrDQYaFyRLdv", "user": {"username": "Ula"}}, {"_id": "fj2QAu7SzmT27MLqp", "postedAt": "2023-03-06T16:46:27.018Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Thank you for your comment, Nick. I used the word \"reach\" because it is difficult to objectively measure the impact of some of our charities, given their age. We wanted to give people a sense of their current progress despite this. Reach can also give a sense of the potential scale of the intervention. We also tried to include some estimated cost effectiveness to show the sense of level of impact per dollar. However, overall we do agree with the general sentiment that, sadly, people tend to look at more vanity level metrics like reach, funding, etc. Of course, many of our organizations will need to run an RCT (which some are already planning) before we can get a real sense of their impact, and we believe our organizations are committed to do this.&nbsp;<br><br>We indeed agree that Fortify Health has done a really great job, but we had to limit the number of charities we could talk to for this post, and some charities were more cautious about being associated with the EA movement. Feel free to check&nbsp;<a href=\"https://www.charityentrepreneurship.com/our-charities\"><u>our website</u></a> for updates.</p>", "parentCommentId": "3HHvNT6WrsFuD6NLQ", "user": {"username": "Ula"}}, {"_id": "tb2cegwKdDs6eynZ4", "postedAt": "2023-03-06T17:25:29.381Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Congratulations, I'm very excited about the work that CE is doing.</p>\n<p>BTW, I'd be interested in reading a post of post-mortems on CE-incubated projects that <em>didn't</em> pan out.</p>\n", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "wQJnZoks8yJmbRs3s", "postedAt": "2023-03-06T19:09:37.602Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Already in our content calendar :)&nbsp;</p>", "parentCommentId": "tb2cegwKdDs6eynZ4", "user": {"username": "Ula"}}, {"_id": "chZaPpX2YG3q5LT9C", "postedAt": "2023-03-07T08:14:47.670Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Thank you for writing this and for all the work you (and others) have put in over the years.</p>\n<p>My question is to what extent you think CE’s impact measurement is tautological. If you determine something to be a high impact opportunity and then go and do it, aren’t you by definition doing things you estimate to be high impact (as long as you don’t screw up the execution or realise you made an error). To full adjust for selection effect, you would have to ignore all research conducted before the decision was made and rely solely on new data, which is probably quite hard to come by.</p>\n<p>The 40% seems very high. For-profit start-ups have a much higher failure rate. If that’s true, that’s incredible, but I’d expect to see more like 5% of charities and 50% of funds.</p>\n", "parentCommentId": null, "user": {"username": "Grayden"}}, {"_id": "CZM6b9C7obxzJ3gjh", "postedAt": "2023-03-07T16:59:46.140Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>The high success rate almost makes me think CE should be incubating even more ambitious, riskier projects, with the expectation of a lower success rate but higher overall EV. Very uncertain about this intuition though, would be interested to hear what CE thinks.</p>\n", "parentCommentId": "chZaPpX2YG3q5LT9C", "user": {"username": "romanhauksson"}}, {"_id": "hYyigzzrSMsk5YScB", "postedAt": "2023-03-08T13:25:48.464Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>I think tautological measurement is a real concern for basically every meta charity, although I'm not sure I agree with your solution. I think the better solution is external evaluation, someone like GiveWell or Founders Pledge who does not have any reason to value CE charities. Typically, these organizations do their own independent research and compare it across their current portfolio of projects. If CE can, for example, fairly consistently incubate charities that GW/FP/etc. rank as best in the world, I think that is at least not organizationally tautological (it is assuming that these charity evaluators are in fact identifying the best areas/charities, and replicating any flaws they have though).<br><br>In terms of success rate, I agree 40% is high but I would expect many NGO incubators to be considerably higher than in the for-profit space, for a few reasons (a couple listed below):<br><br>General competition: There are just not that many charities aiming for pure impact (in an EA way), unlike the for-profit market. The general efficiency of the charity market is pretty low, and thus there are lots of fairly easy wins.<br><br>Scale sensitivity: Generally, successful for-profits are seen as really large-scale ventures (e.g., unicorns) and the market is consistently hunting for that. Debatably, the only charity currently seen as highly impactful that can get to that sort of scale is GiveDirectly. Thus the bar for success in the charity sector is significantly lower in terms of a money spent scale. For example, if we founded a charity running with a 1m a year budget, that was x2 as effective as top GW ones, we could count that as a success. But an organization of the same size would be considered a rounding error by YC. If we take size expectations into account, it might be like 1/25 charities that we incubated that have any significant chance of getting to unicorn-level size.</p>", "parentCommentId": "chZaPpX2YG3q5LT9C", "user": {"username": "Joey"}}, {"_id": "C4gb9KdzquE53gWso", "postedAt": "2023-03-08T13:26:58.779Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>We have thought about this but we are not confident weaker charities would not crowd out stronger ones with funders and thus lead to less overall impact.&nbsp;</p>", "parentCommentId": "CZM6b9C7obxzJ3gjh", "user": {"username": "Joey"}}, {"_id": "Yk5pnzHe3PcMi8763", "postedAt": "2023-03-08T23:12:13.100Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>Thanks, Joey. Really appreciate you taking the time to engage on these questions.</p>\n<p>To be clear, I’m not seriously suggesting ignoring all research from before the decision. I’m just saying that mathematically, an independent test needs its backrest data to exclude all calibration data.</p>\n<p>It strikes me that there are broadly 3 buckets of risk / potential failure:</p>\n<ol>\n<li>Execution risk - this is significant and you can only find out by trying, but you only really know if you’re being successful with the left hand side of the theory of change</li>\n<li>Logic risk - having an external organisation take a completely fresh view should solve most of this</li>\n<li>Evidence risk - even with an external organisation marking your homework, they are still probably drawing on the same pool of research and that might suffer from survivorship bias</li>\n</ol>\n", "parentCommentId": "hYyigzzrSMsk5YScB", "user": {"username": "Grayden"}}, {"_id": "KrtgyhDTDdZKgC8vz", "postedAt": "2023-03-09T04:23:07.845Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<blockquote><ul><li>40% of our charities reach or exceed the cost-effectiveness of the strongest charities in their fields (e.g., GiveWell/ACE recommended).</li><li>40% are in a steady state. This means they are having impact, but not at the GiveWell-recommendation level yet, or their cost-effectiveness is currently less clear-cut (all new charities start in this category for their first year).</li><li>20% have already shut down or might in the future.&nbsp;</li></ul></blockquote><p>Thanks for writing this up. I am excited about the work you are doing, but to be blunt, these success rates strike me as implausibly good. Here are a few reasons why I am skeptical:</p><ol><li>As you note, charities generally get more cost-effective as they scale, and most CE charities are still quite small.&nbsp;</li><li>These charities are young, and there is a long learning curve associated with building an effective organization.</li><li>Doing good charitable work is hard—many charities are ineffective, and a substantial portion cause harm. Therefore, my prior is (<a href=\"https://forum.effectivealtruism.org/posts/cHDz2R5FfWGoZgWoZ/?commentId=chZaPpX2YG3q5LT9C\">also</a>) that most incubated charities would not wind up being cost-effective, even if CE did a perfect job. Given this, I suspect that some of the 40% of cost-effective charities are not cost-effective, and that many of the\"steady state\" charities should be reclassified as \"might shut down in the future\" charities, although these three categories (\"highly cost-effective\", \"having impact\", and \"might shut down\") are vague and do not cover the range of possible outcomes here.</li><li>The fact that this post pitches the program to potential applicants (\"Applications are now open\") also makes me somewhat more skeptical about the positive gloss.</li></ol><p>I have read your response <a href=\"https://forum.effectivealtruism.org/posts/cHDz2R5FfWGoZgWoZ/?commentId=hYyigzzrSMsk5YScB\">here</a>, and agree that it'd be good to have an external organization do a comprehensive evaluation.&nbsp;</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "KSrM5Lkg9PjB3Bgek", "postedAt": "2023-03-10T22:15:09.767Z", "postId": "cHDz2R5FfWGoZgWoZ", "htmlBody": "<p>The CE incubatees are an absolutely amazing bunch and exactly the types of people I would want on these world-bettering projects. &nbsp;Charity Entrepreneurship is no doubt one of the EA projects I am most excited about due to pure impact, research prowess and future potential.</p><p>When I compare the CE program to <a href=\"https://www.ycombinator.com/blog/yc-stats/\">YC</a> (see also <a href=\"https://ourworldindata.org/owid-at-ycombinator\">OWID@YC</a>), it feels even better due to the great co-founder matching process and the success rate along with the excellence within the focus areas (people don't come with their own esoteric tech startups).</p><p>For other commenters who talk about the use of reach numbers instead of e.g. QALY or WELLBYs, having seen some of their spreadsheets and programs, I am in deep awe and respect of some of the superheroes that have saved hundreds of lives (with many of these being counterfactual given the effectiveness and new vectors of impact) though I'll let them summarize their numbers.</p><p>I am very excited about where the projects will be in one and even five years and commend everyone involved.</p>", "parentCommentId": null, "user": {"username": "esben-kran"}}]