[{"_id": "KEyDrkuYpxTxMWAWH", "postedAt": "2022-10-21T21:07:10.008Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<p>Hi!</p>\n<p>It's great that you are trying to make these kinds of decisions with impact in mind!</p>\n<p>I have a comp bio background but more in proteomics and have spent time this year looking at different ways to have a large impact, although my own focus was much more on pandemics preparedness / x-risk.</p>\n<p>Probably this problem is underspecified. It's just very hard for anyone at this level of abstraction to make the decision for you. Details like your relationship with the supervisor, other lab members for example could be critical. It does sound like you like the first option but I'd encourage you to test your hypothesis thoroughly (or proportionally to the subsequent time investment).</p>\n<p>However, some guiding principles may help:</p>\n<ul>\n<li>Speak to current lab members/students of either lab. If you feel very confident that they are sending out good cultural and intellectual vibes then you're time is a much safer bet there.</li>\n<li>Fieldwise, meta-genomics seems likely to be very useful in pandemic preparedness (see SecureDNA) so if your work has higher inner product (more in common) with those kinda of projects then I'd see that as a concretely safer bet.</li>\n<li>Given your other interests, I'd definitely go speak to more bio experts. Book an appt with the EA consult a bio expert (if it's still open) or look for EAs who you can chat  and contact them.</li>\n</ul>\n<p>EffectiveThesis might have some useful content too. <a href=\"https://effectivethesis.org/\">https://effectivethesis.org/</a></p>\n<p>Good luck and all the best!</p>\n", "parentCommentId": null, "user": {"username": "Joseph Bloom"}}, {"_id": "Nd86ACHRvFpwgdmHm", "postedAt": "2022-10-22T00:46:01.559Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<p>I made an EA-inspired career change into biomedical engineering and am midway through an MS, so I feel I can speak to some of this.</p><blockquote><p>This lab was a bit less exciting to me but the supervisor was more hands-off in terms of projects, giving their students freedom to develop their own projects (within reason), which might mean that I could develop a more optimal project than the other one I was offered. However, the projects seemed more about discovery rather than application, which makes me uncertain about how interesting/beneficial it could be, although they do use a range of highly-transferable techniques.</p></blockquote><p>Speaking for myself, having freedom to develop my own project would have been suboptimal. One of the biggest values of grad school is absorbing the strategic knowledge of an experienced supervisor. The most capable people in our prestigious lab defer heavily to the PI. Not all PIs are worth deferring to. You should seek a lab run by a PI whose judgment in project selection motivates you the most.</p><blockquote><p>How important is making the right choice, really? Is it more important to just find a project that interests me, and hope I can transfer my skills anyway?</p></blockquote><p>It's important to choose a lab where you won't find your growth bottlenecked by something pointless. <strong>You want the limiting factor to be your own skills, time, and energy.</strong> Here are some things I would make sure you'll have:</p><ul><li>A capable mentor figure, either the PI or a strong PhD student/postdoc</li><li>A project that will hold your interest for a couple years</li><li>Enough money that you won't be wasting a lot of time economizing</li><li>Colleagues who respect you and the lab (no matter how sarcastic they might be in conversation)</li></ul><blockquote><p>On that point, is my choice likely to cut off other options and pathways?</p></blockquote><p>It won't cut off many options and pathways, although one thing I can think of is that, as an MS student, you're unlikely to be competitive for the NSF GRFP (PIs steer their PhDs toward that), and you won't be eligible for it after doing the MS.</p><p>What it will do is give you a comparative advantage that will exert a strong pull in a certain direction. You'll use your experience to get a PhD position or your first industry job, and that will tend to give you more forms of related experience, funneling you into a niche.</p><p>You can fight against that to some extent, but it takes effort and you will not have perfect control. After your MS, you'll be in debt, 2 years older, and feeling pressure to find your next step. You'll have less slack than you do right now, but more doors will be open to you. &nbsp;</p><blockquote><p>Should I aim for a lab that isn't as directly interesting to me but might allow me greater freedom to design an optimal project?</p></blockquote><p>No, I think you should aim for a lab that will give you heavy guidance in constructing your project. Good strategic and technical mentorship is invaluable. When the lab constrains your project, it's a sign they have a focused research agenda that your work fits into. That means your work will enhance somebody else's. Everybody is therefore motivated to help each other. This is good for research.&nbsp;</p><p>Choosing your own project that doesn't fit with everybody else's means that nobody's directly incentivized to help you. &nbsp;You miss out on a HUGE amount if you wind up in this position. Ideally, there should be a specific person in your lab you can name whose own research will be drastically accelerated by your own project (which is something you'll only figure out after you join the lab).</p><blockquote><p>Is it worth going for a project that is less interesting but will make me more employable/broaden my options?</p></blockquote><p>I think it's very good to choose projects that give you at least 1 marketable skill so you can get your foot in the door somewhere after you graduate. That's something you can discuss with the PI. But don't trade off too much motivation for marketability. If you're choosing between a fascinating project that uses only skills with no market value, vs. a fairly interesting project that will also teach you the skills to get your first postgraduate job, probably go with the second one. It's only 2 years.</p>", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "aPHyK7uwd4bdxvtKy", "postedAt": "2022-10-22T01:12:54.877Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<p>This was one of the best written posts on the forum. It's clearly motivated, expresses the issues, the context and your uncertainty and confidence well.</p><p>I think you have good answers already.&nbsp;</p><p>Here's some other considerations (that are mostly general):</p><ol><li>Fit is important. How well you feel in the lab matters a lot. If you feel like the people are overbearing or if you have to fight, that's bad. This can be hard to figure out and worth thinking about. There is a honeymoon period, and small things can play a big role 1-2 years later. Many people become miserable.</li><li>(For an MA, it might matter less) but the actual placement record of the PI is pretty important. This is not just for the usual reason of academic status, but I think it's gives an important sense of how good the work/lab is.</li><li>Especially for an MA, the PI actually might not be very hands on or determine your experience (especially for high status PIs). <i><strong>Often it's actually the post-docs (lab techs sometimes) that are extremely important for students and can make you successful, or make your life a living hell.</strong></i><ol><li>Note that people leave and a small trap is joining a lab where the talent (post docs) take a new position, which change everything for you.</li><li>Asking around for reputation is important.</li></ol></li><li>It's unusual and I'm unsure how likely it is, but it's possible you might be able to swing some sort of EA mentorship or grant, which might make your second choice more interesting if you can point it toward pandemics.</li><li>Overall (maybe because of my bias described below), I generally distrust labs where you are fitted in a slot to solve a problem for a PI. I recommend a lab where you can gain general programming skills or have freedom to network and express your abilities.&nbsp;</li></ol><p>&nbsp;</p><p><strong>More background:</strong></p><p>I'm against/biased against a lot of \"hard science\" grad work, because (maybe outside of a small number of labs/PIs) I think you often just serve as cheap labor that doesn't actually involve a lot intellectual activity (this is a distinct from the other problem a lot of research activity is winning games in academia).&nbsp;</p><p>This might be different and not apply to bioinformatics or something exposed to a lot of programming.</p>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "r7MztoNJvWJn73TWQ", "postedAt": "2022-10-24T00:50:18.688Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<p>Hi there, thank you so much for the fantastic, detailed reply, I appreciate the effort.<br><br>It's really good to hear your perspective on being able to choose my own project, as that's something I'm concerned about too. &nbsp;The second supervisor did mention that that is a challenging thing for students to manage, and so I am more drawn to being able to complete a pre-designed and well-constructed research project than trying to pull one together on my own.&nbsp;<br><br>I just realized that I completely neglected to mention in my original post that I am from Australia, which is a pretty major detail but only really means that that advice about the NSF GRFP doesn't apply. Given that I (hopefully) won't be in as much debt completing my MS in Australia rather than the US, I hope that that might give me a bit more \"slack\" as you say. Nevertheless, I understand what you're saying about being \"pulled\" in a certain direction and that's something I'll take care to be aware of.<br><br>The advice about making sure my work is directly helping someone else's is excellent, and I know for sure that that will be the case for the first lab, as the supervisor clearly explained how the research is contributing to the lab's agenda, and there is a postdoc in the lab that has similar research so will be apparently guiding me throughout.<br><br>On the last point, I might try to recontact the first supervisor to get a general idea of what techniques they use in their lab and that I would be using, to try to gauge how marketable my time in the lab would make me.&nbsp;<br><br>Once again, thank you for taking the time to write such a thoughtful and useful reply!</p>", "parentCommentId": "Nd86ACHRvFpwgdmHm", "user": {"username": "ripbennyharvey"}}, {"_id": "3auBPtaFuSvNzuCy6", "postedAt": "2022-10-24T00:55:49.590Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<p>Hi Charles, thank you for taking the time to write your reply, you've given me some really valuable advice. Those are some valuable general considerations to keep in mind regardless of which direction I go. I know that in the first lab, the third point is especially relevant as I was told that there is a postdoc that will be providing guidance for me throughout, so that's something for me to be mindful of.<br><br>Your fourth point is something I'll give a bit more thought as well, especially because I know the second lab recently did a project monitoring a population to see which pathogens were present, so there's definitely scope for me to shape a project in that area.<br><br>I appreciate the final point too, that's something to be careful of and I should &nbsp;try to get a better handle on how much freedom I'll have before I commit. Hopefully, as you say, that's not as generally true for bioinformatics-related projects but I can see there still being a risk of that.<br><br>Thanks again!</p>", "parentCommentId": "aPHyK7uwd4bdxvtKy", "user": {"username": "ripbennyharvey"}}, {"_id": "ZdfwavEzoEEpsYxBW", "postedAt": "2022-10-24T01:01:09.187Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<p>Hi Joseph, thanks so much for sharing your thoughts, it's interesting to hear your own angle from a pandemics preparedness background.<br><br>Those are some really useful guiding principles to follow, and I'm going to send an email to a member of the lab to try to get a better understanding of the supervisor's style of supervising and the culture of the lab overall. I really should try to connect with more bio experts, I've had a look on Effective Thesis but I hadn't heard about that consultation service, so I'll look into it. More generally, I will try to seek out more EA-aligned bio experts to chat with, I've found those I've contacted in the past to be very receptive.<br><br>Thanks again Joseph and good luck for your own efforts at impact!&nbsp;<br>&nbsp;</p>", "parentCommentId": "KEyDrkuYpxTxMWAWH", "user": {"username": "ripbennyharvey"}}, {"_id": "pmuEbfdZkrKSsLDtn", "postedAt": "2022-10-24T01:38:52.511Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<p>Absolutely! It sounds like your were intuitively being pulled in this direction anyway, so it sounds like you have good judgment and that will take you far. Best of luck.</p>", "parentCommentId": "r7MztoNJvWJn73TWQ", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "oMLtkaMtn3gJ9JjEb", "postedAt": "2022-10-24T04:34:38.552Z", "postId": "Cj9eq3hnjGCRmkQkt", "htmlBody": "<blockquote><p>I'm against/biased against a lot of \"hard science\" grad work, because (maybe outside of a small number of labs/PIs) I think you often just serve as cheap labor that doesn't actually involve a lot intellectual activity (this is a distinct from the other problem a lot of research activity is winning games in academia).&nbsp;</p></blockquote><p><br>I'd offer a slightly different perspective on this point, as a hard science graduate student doing a lot of cheap labor with most of my intellectual activity done on the side.</p><p>When you do cheap \"non-intellectual\" work in a hard science lab, you learn:</p><ul><li>A practical sense of how to design an experiment to answer an important question</li><li>An intuition for how to connect data in papers (and content in textbooks) to what the scientists actually did in the lab, and what the limitations, implications, and importance might be in light of that.</li><li>The skills to develop and troubleshoot new methodologies</li><li>How to collaborate and communicate with your supervisor, colleagues, tech support, other labs, core facilities, and authors of papers you're building on</li><li>A sense of what bottlenecks hold things back in the lab, as fodder for future research directions as well as any possible future management role you may have</li></ul><p>I have gotten a ton of value out of both rote lab techniques and the arduous process of troubleshooting methods for a novel experimental design.</p>", "parentCommentId": "aPHyK7uwd4bdxvtKy", "user": {"username": "AllAmericanBreakfast"}}]