[{"_id": "D7Tkk9ni2pWwK4i7S", "postedAt": "2018-05-20T23:42:00.190Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>Thanks for trying to get a clearer handle on this issue by splitting it up by cause area.</p>\n<p>One gripe I have with this debate is the focus on EA orgs. Effective Altruism is or should be about doing the most good. Organisations which are explicitly labelled Effective Altruist are only a small part of that. Claiming that EA is now more talent constrained than funding constrained implicitly refers to Effective Altruist orgs being more talent than funding constrained. </p>\n<p>Whether 'doing the most good' in the world is more talent than funding constrained is much harder to prove but is the actually important question.</p>\n<p>If we focus the debate on EA orgs and our general vision as a movement on orgs that are labelled EA, the EA Community runs the risk of overlooking efforts and opportunities which aren't branded EA.</p>\n<p>Of course fixing global poverty takes more than ten people working on the problem. Filling the funding gap for GiveWell recommended charities won't be enough to fix it either. Using EA branded framing isn't special to you - but it can make us lose track of the bigger picture of all the problems that still need to be solved, and all the funding that is still needed for that.</p>\n<p>If you want to focus on fixing global poverty, just because EA focuses on GW recommended charities doesn't mean EtG is the best approach - how about training to be a development economist instead? The world still needs more than ten additional ones of that. (Edit: But it is not obvious to me whether global poverty as a whole is more talent or funding constrained - you'd need to poll leading people who actually work in the field, e.g. leading development economists or development professors.)</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "yNyx6NQKCKdtuHa4F", "postedAt": "2018-05-21T00:28:43.842Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>Here's what Lewis Bollard <a href=\"https://80000hours.org/podcast/episodes/lewis-bollard-end-factory-farming/\">had to say</a> about the talent vs. funding issue when asked about it on the 80,000 Hours podcast (in September 2017):</p>\n<p><strong>Robert Wiblin:</strong> My impression is that fa …. animal welfare organisations, at least the ones that I’m aware of, they are associated with Effective Altruism are often among the most funding constrained. That they often feel like they’re most limited by access to money. Does this suggest that people who are concerned with animal welfare should be more inclined to do earning to give and, perhaps, rather than work in the area, instead make money and give it away?</p>\n<p><strong>Lewis Bollard:</strong> I don’t think so. I think that that was true until two years ago, or it was true until eighteen months ago when we started ground making in this field. I think the situation has dramatically improved in terms of funding largely because of Open Phil. Entering this field, but also because there are a number of other very generous donors who’ve either entered the field or significantly increased their giving in the last two years.</p>\n<p>Right now I think there is a bigger talent gap than financial gap for farm animal welfare groups. That’s not to say it will always be that way, and I certainly do think that someone whose aptitude or inclination is heavily toward earning to give, it could still well make sense. If someone has great quantitative skills and enjoys working at a hedge fund, then I would say earn to give. That could be still a really powerful way and we will more and more funders over time to continue scaling up the movement, but all things equal, I would encourage someone to focus more on the talent piece now because I do think that things have really flipped in the last few years, and I’m pretty optimistic that the funding will continue to grow in this space for animal welfare.</p>\n<p><strong>Robert Wiblin:</strong> What makes you confident about that? You don’t expect to be fired in the next few years?</p>\n<p><strong>Lewis Bollard:</strong> First, I hope I won’t be fired, but I think there’s a deep commitment from the Open Philanthropy Project to continue strong funding in this space, to continue funding on at least the level we’re funding currently and hopefully more.</p>\n<p>I’ve also just seen a number of new large-ish funders coming online. Just in the last two years I would say the number of funders giving more than two hundred thousand dollars a year has doubled, and I’ve started to see real interest from some other major potential funders.</p>\n<p>I think it’s natural that, as this issue has gained public prominence, so were there a lot of potential donors, or people who have great wealth, have realised that this is something important and this is something that they can make a great difference.</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "LfG4PGrvPeLmqCqGh", "postedAt": "2018-05-21T10:12:54.411Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<blockquote>\n<p>One gripe I have with this debate is the focus on EA orgs</p>\n</blockquote>\n<p>I think this is a bit unfair. I took the OP to be referring the previous discussion of this by 80k, which was specifically about EA orgs. </p>\n", "parentCommentId": "D7Tkk9ni2pWwK4i7S", "user": {"username": "MichaelPlant"}}, {"_id": "2DMDNrcEPxWZ57AgG", "postedAt": "2018-05-21T11:03:54.279Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<blockquote>\n<p>Talent gap - Middle (~50 people)</p>\n</blockquote>\n<p>If the AI safety/alignment community is altogether around 50 people, that's a large <em>relative</em> gap. Depending on how you count it might be bigger than 50 people, but the talent gap seems large in relative terms in either case. :) </p>\n", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "WhLewwNnFCcrXXvz3", "postedAt": "2018-05-21T14:55:42.091Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>Like you, at 80,000 Hours we view the relative impact of money vs talent to be specific to particular problems and potentially particular approaches too.</p>\n<p>First you need to look for what activities you think are most impactful, and then see what your money can generate vs your time.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "jCDrD92HsNrchqgbi", "postedAt": "2018-05-21T15:01:54.294Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>&quot;Claiming that EA is now more talent constrained than funding constrained implicitly refers to Effective Altruist orgs being more talent than funding constrained.&quot;</p>\n<p>It would be true if that were what was meant, but the speaker might also mean that 'anything which existing EA donors like Open Phil can be convinced to fund' will also be(come) talent constrained.</p>\n<p>Inasmuch as there are lots of big EA donors willing to change where they give, activities that aren't branded as EA may still be latently talent constrained, if they can be identified.</p>\n<p>The speaker might also think activities branded as EA are more effective than the alternatives, in which case the money/talent balance within those activities will be particularly important.</p>\n", "parentCommentId": "D7Tkk9ni2pWwK4i7S", "user": {"username": "Robert_Wiblin"}}, {"_id": "bJQ6QZzawPffktbFr", "postedAt": "2018-05-21T19:26:51.750Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<blockquote>\n<p>First you need to look for what activities you think are most impactful, and then see what your money can generate vs your time.</p>\n</blockquote>\n<p>This statement could be interpreted as suggesting that people should use a two-step process: first, choose a problem based on how pressing it is and then second, decide how to contribute to solving that problem.* That two-step approach would be a bad idea because some people may be able to make a greater impact working on a less pressing problem if they are <a href=\"https://80000hours.org/articles/problem-framework/#how-to-assess-personal-fit\">especially effective</a> at addressing that problem. Because of this, information about how pressing different problems are relative to each other should not be used to choose a single problem; instead, it should be used as background information when comparing careers across problems.</p>\n<p>*I doubt that's what you actually meant since you wrote the linked article that discusses personal fit. But I figured some people might be unfamiliar with that article, so I thought it'd be worthwhile to note the issue. </p>\n", "parentCommentId": "WhLewwNnFCcrXXvz3", "user": {"username": "RandomEA"}}, {"_id": "NHMgpM6fsoPwHj3cj", "postedAt": "2018-05-21T22:46:46.617Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>Yes - the reason you need to look at a bunch of activities rather than just one activity, is that your personal fit, both in general, and between earning vs direct work, could materially reorder them.</p>\n", "parentCommentId": "bJQ6QZzawPffktbFr", "user": {"username": "Robert_Wiblin"}}, {"_id": "CJbsnWczP9gidi8se", "postedAt": "2018-05-22T03:28:59.391Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>Yes, each cause has different relative needs.</p>\n<p>It's also more precise and often clearer to talk about particular types of talent, rather than &quot;talent&quot; as a whole e.g. the AI safety space is highly constrained by people with deep expertise in machine learning and global poverty isn't.</p>\n<p>However, when we say &quot;the landscape seem more talent constrained than funding constrained&quot; what we typically mean is that given our view of cause priorities, EA aligned people can generally have a greater impact through direct work than earning to give, and I still think that's the case.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "E8nxHarwq7rsnwSzK", "postedAt": "2018-05-23T16:14:09.786Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>This is very helpful. I would note that the Global Catastrophic Risk Institute does AI and is funding constrained. Of course it also does other X risk work, but I think it would be good to broaden your category to include this or have a separate category.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "Hf83nQSeuKa6sG6L2", "postedAt": "2018-05-23T17:14:57.973Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>For the animal advocacy space, my anecdata suggest that the talent gap is in large part <em>a product of</em> funding constraints. Most animal charities pay rather poorly, even compared to other nonprofits.</p>\n", "parentCommentId": null, "user": {"username": "jayquigley"}}, {"_id": "je9srToQcatECwkQF", "postedAt": "2018-06-11T12:59:14.017Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<blockquote>\n<p>The funding is fairly centralized between Open Phil and the AR Funds being run by the same person (Lewis), which controls nearly 50% of all funding in AR.</p>\n</blockquote>\n<p>If this is true, I just want to take a moment to celebrate that the EA movement has more or less doubled animal rights funding globally. That's awesome!</p>\n", "parentCommentId": null, "user": null}, {"_id": "dq965qgioZRMyfR4c", "postedAt": "2018-06-11T13:47:35.682Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>I had a similar reaction.</p>\n<p>It was the choice of &quot;Money gap - Large (~<a href=\"https://blog.givewell.org/2017/11/27/our-top-charities-for-giving-season-2017/\">$86 million</a>&quot; in the summary that got me. It just seems immediately odd that if you think that Earning To Give to some global poverty charities is on a par with other common EA career choices in terms of marginal impact (i.e. assuming you think &quot;poverty&quot; should be on the table at all for us), that the size of this funding gap is the equivalent of ~$0.086pp for the bottom billion. And in fact the linked post gives a funding gap of something more like $400 million for GiveWell's top charities alone (on top of expected funding from Good Ventures and donors who aren't influenced by GiveWell), with GiveDirectly able to absorb &quot;over 100 million dollars&quot;. But it's not so odd if you think that the expected value of donating to GiveWell-recommended charities is several orders of magnitude greater compared to the average global poverty charity. I'm aware that heavy-tailed distributions are probably at play here, but I'm very skeptical that GiveWell has found anywhere near the end of that tail (although I think they're the best we have).</p>\n<p>Regardless of what the author meant, I think I see this kind of thinking in EA fairly regularly, and it's encouraged by giving the &quot;neglectedness&quot; criterion such prominence, perhaps <a href=\"http://effective-altruism.com/ea/1ge/against_neglectedness/\">unduly</a>.</p>\n<p>And yes, I also want to thank the author for encouraging people to think and talk about this in a more nuanced way.</p>\n", "parentCommentId": "D7Tkk9ni2pWwK4i7S", "user": null}, {"_id": "9kJ9w2oMkAcMJyFGP", "postedAt": "2019-05-22T03:08:53.348Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>In 2015 you (Benjamin) wrote a post which, if I&#x27;m reading it right, aspires to answer the same question, but is in very direct contradiction with the conclusions of your (Katherine&#x27;s) post regarding <em>which</em> causes are relatively talent constrained. I would be interested in hearing about the sources of this disagreement from both of you (Assuming it is a disagreement, and not just the fact that time has passed and things have changed, or an issue of metrics or semantics)</p><p> here is the relevant excerpt</p><p> <a href=\"https://80000hours.org/2015/11/why-you-should-focus-more-on-talent-gaps-not-funding-gaps/\">https://80000hours.org/2015/11/why-you-should-focus-more-on-talent-gaps-not-funding-gaps/</a> </p><blockquote>...Most of the causes the effective altruism community supports are more talent constrained than funding constrained. For example (in all of the following, I’ve already taken account of replaceability): <strong>1) International development...</strong> <strong>2) Building the effective altruism community and priorities research...</strong> <strong>3)</strong> <strong>AI safety research...</strong></blockquote><blockquote>...The main exception to this – a cause supported by the community that seems more funding constrained than talent constrained – is ending factory farming. Jon Bockman of <a href=\"http://www.animalcharityevaluators.org/\">Animal Charity Evaluators</a>, told me that <strong>vegan advocacy charities have lots of enthusiastic volunteers but not enough funds to hire them</strong>, meaning that funding is the greater bottleneck (unless you have the potential to be a leader and innovator in the movement). So, the more weight you put on this cause, the more funding constrained you’ll see the community. But the situation could reverse if you think developing meat substitutes is the best approach, because that could be pursued by for-profit companies or within academia. </blockquote><p><strong>It sounds like both of you (Katherine and Benjamin) agree that AI is &quot;talent constrained&quot;. </strong>Pretty straightforward, it&#x27;s hard to find sufficiently talented people with the specialized skills necessary.</p><p><strong>It sounds like the two of you diverge on global poverty, for reasons that make sense to me.</strong></p><p>Katherine&#x27;s analysis, as I understand it, is straightforwardly looking at what Givewell says the current global poverty funding gap is...which means that impact via talent basically relies on doing more good with the existing money, performing better than what is currently out there. (And how was your talent gap estimated? Is it just a counting up of the number of currently hiring open positions on the EA job board?)</p><p>Benjamin&#x27;s analysis, as I understand it, is that EA&#x27;s growing financial influence means that more money is going to come in pretty soon, and also that effective altruists are pretty good at redirecting outside funds to their causes (so, if you build good talent infrastructure and rigorously demonstrate impact and a funding gap, funding will come) </p><p>Is this a correct summary of your respective arguments? I understand how two people might come to different conclusions here, given the differing methods of estimating and depending on what they thought about EA&#x27;s ability to increase funding over time and close well demonstrated funding gaps.</p><p>(As an aside, Benjamin&#x27;s post and <a href=\"https://80000hours.org/2015/07/update-how-many-extra-donations-have-we-caused/\">accompanying documents</a> made some predictions about the next few years - can anyone link me to a retrospective regarding how those predictions have born out?)</p><p><strong>It sounds like you diverge on animal rights, for reasons I would like to understand</strong></p><p>Benjamin, it sounds like you / Joe Bockman are saying that ending factory farming is <em>exceptional </em>among popular EA causes in having more talent than they can hire and being in sore need of funding.</p><p>Whereas Katherine, it sounds like you&#x27;re saying that animal rights is <em>particularly</em> in need of talent relative to all the other cause areas you&#x27;ve mentioned here.</p><p>These seem like pretty diametrically opposed claims. Is this a real disagreement or have I misread? I&#x27;m not actually sure what the source of this disagreement is, other than Katherine and Joe having different intuitions, or bird&#x27;s eye views of different parts of the landscape? Has Joe written more on this topic? If it&#x27;s just a matter of two people&#x27;s intuitions, it doesn&#x27;t leave much room for evaluating either claim. (I get the sense that Katherine&#x27;s claim isn&#x27;t based on intuition, but the fact that EA animal organizations are <em>currently</em> expanding, which increases the estimated number of open job postings available in the near future. Is that correct?)</p><p>(Motivation: I&#x27;m reading this post now as part of the CE incubation program&#x27;s reading list, and felt surprised because the conclusions conflicted with my intuitions, some of which I think were originally formed by reading Benjamin&#x27;s posts a few years ago. As the program aims to set me on a path which will potentially help me cause redirection of funding, redirection of talent, create room for more talent, and/or create room for more funding within global poverty or animal issues, the answers to these questions may be of practical value to me.)</p><p>I&#x27;d be happy if either of you could weigh in on this / explain the nature and sources of disagreement (if there is in fact a disagreement) a bit more! </p><p>(PS - can I tag two people to be notified by a comment? Or are people notified about everything that occurs within their threads?)</p>", "parentCommentId": "CJbsnWczP9gidi8se", "user": {"username": "ishaan"}}, {"_id": "pD3FLmjAHeCNTKLEt", "postedAt": "2019-05-22T03:44:12.913Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<p>What are your thoughts on this?  <a href=\"https://80000hours.org/2015/11/why-you-should-focus-more-on-talent-gaps-not-funding-gaps/\">https://80000hours.org/2015/11/why-you-should-focus-more-on-talent-gaps-not-funding-gaps/</a> </p><p>In particular</p><p>&gt; a cause supported by the community that seems more funding constrained than talent constrained – is ending factory farming. Jon Bockman of <a href=\"http://www.animalcharityevaluators.org/\">Animal Charity Evaluators</a>, told me that <strong>vegan advocacy charities have lots of enthusiastic volunteers but not enough funds to hire them</strong>, meaning that funding is the greater bottleneck (unless you have the potential to be a leader and innovator in the movement). </p><p>Please see also my reply to Benjamin Todd&#x27;s comment for a longer version of this question, which I wanted to address to both of you, but I don&#x27;t think this forum has user tagging functionality.</p>", "parentCommentId": null, "user": {"username": "ishaan"}}, {"_id": "WwPZRG6Tt7CQzhZzZ", "postedAt": "2020-08-04T03:26:03.089Z", "postId": "CjPrNjSeDJJpHJhXk", "htmlBody": "<html><head></head><body><p>Thanks for this post, it was very insightful. Do you have any ideas on the talent/funding gap scenario for other EA cause areas like global priorities research (I believe this doesn't come under meta EA), biosecurity, nuclear security, improving institutional decision making, etc?</p></body></html>", "parentCommentId": null, "user": {"username": "Prabhat Soni"}}]