[{"_id": "yN3aS9PQAbMGXkzbS", "postedAt": "2017-05-06T06:42:01.185Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>More than half of the time, people who have a psychotic episode will have already had one before. I think the same is true of mania. The incidence for a first episode of psychosis is fairly low, about 0.03% per year [1].</p>\n<p>[1] &quot;Over the 8-year period May 1995–April 2003, there were 194 cases of any DSM-IV psychotic illness (117 male, 77 female; Table 2). The annual incidence of “all psychoses” was 31.6/100,000 aged &gt;15, this being higher in males (37.2) than in females (25.7; risk ratio [RR] = 1.44 [95% CI 1.08, 1.93], p &lt; .02; Table 3).&quot;</p>\n<p><a href=\"https://academic.oup.com/schizophreniabulletin/article/31/3/624/1894444/Epidemiology-of-First-Episode-Psychosis\">https://academic.oup.com/schizophreniabulletin/article/31/3/624/1894444/Epidemiology-of-First-Episode-Psychosis</a></p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "ZyqQgzcM9G3mEZMvB", "postedAt": "2017-05-06T16:21:42.759Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>I appreciate this article because it makes these emotional problems – and ways to prevent and deal with them – visible and dispels the impression that we're all rational, calculating evaluators, all of the time. I recall 2 cases in the EA community of people who I chatted with online in the last year who seemed (disclaimer: by my amateurish reasoning for their extreme behaviour) to experience mania and/or psychosis at a point.</p>\n", "parentCommentId": null, "user": {"username": "remmelt"}}, {"_id": "nHerSD7mF9NdS74yM", "postedAt": "2017-05-08T14:57:38.198Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Yeah, incidence for someone who's never had any episodes before is unlikely. So you can assume that your own risk is very low if you know you've never experienced these things before and don't have a family history. </p>\n<p>But if a friend seems off and you're not certain of their personal or family history, I do think it's worth considering that they might have experienced mania or psychosis before without you knowing about it. </p>\n", "parentCommentId": "yN3aS9PQAbMGXkzbS", "user": {"username": "Julia_Wise"}}, {"_id": "etfxMPqhc8JskeHbq", "postedAt": "2017-05-08T16:13:54.967Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Thanks for writing this! It's really helpful to have the basics of what the medical community knows.</p>\n<p>I've been trying to figure out how to help in ways that respect neurodiversity. Psychosis and mania, like other mental conditions, aren't just the result of some exogenous force - they're the brain doing too little or too much of some particular things it was already doing.</p>\n<p>So someone going through a psychotic episode might at times have delusions that seem to their friends to be genuinely poetic, insightful, and important, and this impression might be right. And yet, they're still having trouble tracking what's real and what's just a thought they had, worse at caring for themselves, and really need to eat and get a good night's sleep and friends to help them remember to do this.</p>\n", "parentCommentId": null, "user": {"username": "BenHoffman"}}, {"_id": "xCX2TtQSMHuNAvAnY", "postedAt": "2017-05-09T19:32:00.375Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Yes, I think that's where some kind of an advance plan can be useful: \n&quot;When I start acting like X, I want you to take step Y&quot; or \n&quot;When you act like X, I'm going to stop engaging with the conversation and start focusing on helping you get some rest, and we can write down where we were in the conversation and resume 48 hours later if you want.&quot;</p>\n", "parentCommentId": "etfxMPqhc8JskeHbq", "user": {"username": "Julia_Wise"}}, {"_id": "BktvEquYGuuSFobZh", "postedAt": "2017-05-11T07:59:50.086Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Before I should admit my bias here.  I have a pet peeve about posts about mental illness like this.  When I suffered from depression and my friend killed himself over it there was nothing that pissed me off more than people passing on the same useless facts and advice to get help (as if that magically made it betteR) with the self-congratulatory attitude that they had done something about the problem and could move on.  So what follows may be a result of unjust irritation/anger but I do really believe that it causes harm when we past on truisms like that and think of ourselves as helping...either by making those suffering feel like failures/hopeless/misunderstood (just get help and it's all good) or causing us to believe we've done our part.  Maybe this is just irrational bias I don't know.</p>\n<p>--</p>\n<p>While I like the motivation I worry that this article does more to make us feel better that 'something is being done' than it does anything for EA community members with these problems.  Indeed, I worry that sharing what amounts to fairly obvious truisms that any google search would reveal actually saps our limited moral energy/consideration for those with mental illness (ohh good we've done our part).</p>\n<p>Now I'm sure the poster would defend this piece by saying well maybe most EA people with these afflictions won't get any new information from this but some might not and it's good to inform them.  Yes, if informing them were cost free it would.  However, there is still a cost in terms of attention, time, pushing readers away from other issues.  Indeed, unless you honestly believe that information about every mental illness ought to be posted on every blog around the world it seems we ought to analyze how likely this content on this site is to be useful.  I doubt EA members suffer these diseases at a much greater rate than the population in general while I suspect they are informed about these issues at a much greater rate making this perhaps the least effect place to advertise this information.</p>\n<p>I don't mean to downplay these diseases.  They are serious problems and to the extent there is something we can do with a high benefit/cost ratio we should.  So maybe a post identifying media that is particularly likely to serve afflicted individuals who would benefit from this and urging readers to submit this information would be helpful.  </p>\n<hr />\n", "parentCommentId": null, "user": {"username": "TruePath"}}, {"_id": "Q7W8F9vBbxyk4suXr", "postedAt": "2017-05-14T14:41:39.569Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Great post. I'll try to make a useful contribution. Maybe this can be of help as well: the APA list of evidence based treatments: </p>\n<ul>\n<li>for bipolar disorder <a href=\"http://www.div12.org/psychological-treatments/disorders/bipolar-disorder/\">http://www.div12.org/psychological-treatments/disorders/bipolar-disorder/</a></li>\n<li>for psychosis &amp; other related disorders <a href=\"http://www.div12.org/psychological-treatments/disorders/schizophrenia-and-other-severe-mental-illnesses/\">http://www.div12.org/psychological-treatments/disorders/schizophrenia-and-other-severe-mental-illnesses/</a> </li>\n</ul>\n<p>Maybe one sentence that can use some more context:</p>\n<blockquote>\n<p>They also listed their most important needs during periods of crisis: Getting rid of voices and paranoia</p>\n</blockquote>\n<p>There is nothing that you can do to help someone getting rid of their voices. On the contrary, encouraging them not to hear voices might make it worse. This is why Acceptance and Commitment Therapy is on the list of evidence based approaches. And why <em>Validation of their experience; someone to listen who could be trusted</em> is on that list of needs as well. </p>\n<p>As with most psychopathology, trying not to experience stuff that often results in more of those experiences. Off course, do get help, and medication might help to get rid of voices. But changing how you cope with such experiences is also of use. </p>\n<p>Eric Morris is one of the researchers on this topic <a href=\"http://drericmorris.com/\">http://drericmorris.com/</a> &amp; this is a Twitter feed aimed at contextual behavioral science and psychosis <a href=\"https://twitter.com/ACBSPsychosis\">https://twitter.com/ACBSPsychosis</a> </p>\n", "parentCommentId": null, "user": {"username": "KrisMartens"}}, {"_id": "cgoshccdERBsjLwYc", "postedAt": "2017-05-17T19:39:08.042Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>I did question whether this was on-topic enough to be a good fit for this forum. (I don't think awareness about every health issue that affects EAs would be a good use of the space, even if it affects a higher proportion than these problems.) </p>\n<p>I do think these problems can be unusually and spectacularly destructive when unchecked, and often even when much effort has been made. I also think most people don't have a good concept of how to recognize these conditions or even what to google; I certainly wouldn't have before getting training as a social worker.</p>\n<p>I definitely don't want us to congratulate ourselves for having dealt with these problems, because there have been cases when people in this community have needed help here and not gotten enough. I wrote this in the hope that it will tip the balance in some future crisis toward people having the knowledge they need, not so that we can check this off our list as a solved problem. These are really hard problems to deal with, both for people who have them and for people trying to help, and that's exactly why I wanted a resource available.</p>\n<p>I'm so sorry about your friend. This kind of information definitely isn't fail-safe, but I think it's the best we have.</p>\n", "parentCommentId": "BktvEquYGuuSFobZh", "user": {"username": "Julia_Wise"}}, {"_id": "kC8rJiSB554wBzufg", "postedAt": "2017-05-17T19:51:41.067Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Thank you!</p>\n<p>I agree that trying to force hallucinations and paranoia away or talk someone out of them almost never works. I was citing verbatim the list of what people from the NAMI survey listed as their needs. </p>\n<p>Just a note that the APA here is the American Psychological rather than Psychiatric Association (both go by APA, confusingly) and lists only talk therapy and social support methods, not including medication. For psychosis in particular, I think virtually anyone in the field would say medication is the first line of treatment. The kinds of treatment listed there are good for ongoing management, but if I ever became psychotic I would absolutely want a psychiatrist or emergency room to be my first stop. Talk therapy would be good to add in later.</p>\n", "parentCommentId": "Q7W8F9vBbxyk4suXr", "user": {"username": "Julia_Wise"}}, {"_id": "dFRLmhJqFNPayutWp", "postedAt": "2017-05-19T13:39:31.361Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<blockquote>\n<p>Most people don’t get help soon enough. Someone who experiences psychosis usually doesn’t get treatment until more than a year later. Someone with bipolar typically isn’t diagnosed until more than three years after their first mood episode.</p>\n</blockquote>\n<p>In many venues, I think it's okay to tell people the official narrative for dealing with mental health without evidence, but in this space, I would like to see evidence for a claim like &quot;Most people don’t get help soon enough&quot;.\nThis means I would like a discussion of the likely impact of seeking professional care vs. not seeking it before making such a claim.</p>\n", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "EQMpjsbdoaE7oHTER", "postedAt": "2019-04-18T22:02:14.699Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<blockquote>Common triggers of psychosis... some medications or drugs, especially marijuana, psychedelics, MDMA</blockquote><p></p><p>Re: psychedelics &amp; psychosis risk, see <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/23976938\">Krebs &amp; Johansen 2013</a>, a study of National Survey on Drug Use and Health data (<em>n</em> = 130,152) which found:</p><p></p><blockquote>21,967 respondents (13.4% weighted) reported lifetime psychedelic use. There were no significant associations between lifetime use of any psychedelics, lifetime use of specific psychedelics (LSD, psilocybin, mescaline, peyote), or past year use of LSD and increased rate of any of the mental health outcomes.</blockquote><blockquote>Rather, in several cases psychedelic use was associated with lower rate of mental health problems.</blockquote><p></p><p>More detail on <a href=\"https://forum.effectivealtruism.org/posts/H8gC7gLfFvCTwLDsf/legal-psychedelic-retreats-launching-in-jamaica#YH5xqdNdB7KJA68uc\">this comment thread</a>.</p>", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "unn4qQgZob99LMu2B", "postedAt": "2019-08-28T17:08:37.604Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>I&#x27;ve looked at this study and others and I agree. I&#x27;ve updated that sentence.</p>", "parentCommentId": "EQMpjsbdoaE7oHTER", "user": {"username": "Julia_Wise"}}, {"_id": "uwMEs7YW3NcdByjFZ", "postedAt": "2019-08-28T23:58:43.095Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Thanks, Julia.</p><br/><blockquote>Common triggers of psychosis? ... Some medications or drugs, especially marijuana or MDMA</blockquote><br/><p>What&#x27;s the evidence for MDMA being especially likely to trigger psychosis?</p><p>From a quick look, I found a couple case reports (<a href=\"https://www.erowid.org/references/refs_view.php?A=ShowDoc1&ID=526\">1</a>, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3304680/\">2</a>) where ecstasy appears to have caused a psychotic episode. But I couldn&#x27;t find a population-level study on this (probably there isn&#x27;t one).</p><p>Given that <a href=\"http://www.drugpolicy.org/drug-facts/how-many-people-use-mdma\">millions of people use MDMA each year</a> and there&#x27;s only a couple case reports of ecstasy-induced psychosis in the literature, MDMA doesn&#x27;t seem especially likely to cause psychosis.</p><p>See also: <a href=\"https://en.wikipedia.org/wiki/Substance-induced_psychosis\">https://en.wikipedia.org/wiki/Substance-induced_psychosis</a></p>", "parentCommentId": "unn4qQgZob99LMu2B", "user": {"username": "Milan_Griffes"}}, {"_id": "iPjSe42nXqTpDZzYf", "postedAt": "2019-08-29T18:23:09.126Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>I&#x27;m confused - the wikipedia article you link to lists MDMA as one of the substances that induces psychosis. See also: <a href=\"https://en.wikipedia.org/wiki/Stimulant_psychosis#Substituted_amphetamines\">https://en.wikipedia.org/wiki/Stimulant_psychosis#Substituted_amphetamines</a></p><p><a href=\"https://www.karger.com/Article/Abstract/59383\">https://www.karger.com/Article/Abstract/59383</a></p><p>The fact that this study had 32 participants from 2 drug treatment centers indicates to me that it&#x27;s not just a few cases.</p>", "parentCommentId": "uwMEs7YW3NcdByjFZ", "user": {"username": "Julia_Wise"}}, {"_id": "R6SA95YNxwWBnaZcD", "postedAt": "2019-08-29T22:31:59.279Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Right, I linked to that <a href=\"https://en.wikipedia.org/wiki/Substance-induced_psychosis\">wikipedia article</a> because it gives a long list of drugs that may induce psychosis (including MDMA), and the citation it gives for MDMA causing psychosis is <a href=\"https://www.erowid.org/references/refs_view.php?A=ShowDoc1&ID=526\">a single case report from 1991</a>.</p>", "parentCommentId": "iPjSe42nXqTpDZzYf", "user": {"username": "Milan_Griffes"}}, {"_id": "bCvWwe5XQEkuNtmFa", "postedAt": "2019-08-29T22:41:07.483Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<blockquote><a href=\"https://www.karger.com/Article/Abstract/59383\">https://www.karger.com/Article/Abstract/59383</a></blockquote><blockquote>The fact that this study had 32 participants from 2 drug treatment centers indicates to me that it&#x27;s not just a few cases.</blockquote><br/><p>Thanks, I didn&#x27;t find that study during my quick look.</p><p>I think this is a base-rates thing:</p><ul><li>In the US, overall prevalence of schizophrenia is something like <a href=\"http://schizophrenia.com/szfacts.htm#\">7.2 people out of 1,000</a></li><li>In the US, around <a href=\"http://www.drugpolicy.org/drug-facts/how-many-people-use-mdma\">3.1 million people use MDMA each year</a> (In 2013, 1% tried in the last year * 2013 population of 316 million)</li><li>So, in the case where there&#x27;s no causal relationship, we&#x27;d expect to see about 22,320 people in the US who both used MDMA in the last year and are schizophrenic (3,100,000 MDMA users * 0.72%)</li></ul><br/><p>Given that there doesn&#x27;t seem to be a population-level study on this and the prevalence can explained without positing a causal relationship (definitely could find 32 folks at treatment centers out of 22,000), I think assuming causality here is a stretch.</p>", "parentCommentId": "iPjSe42nXqTpDZzYf", "user": {"username": "Milan_Griffes"}}, {"_id": "iC8YAtp9EMsttdrzW", "postedAt": "2021-04-29T07:07:13.205Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Yes and reading this again now I think I was way too harsh.  I should have been more positive about what was obviously an earnest concern and desire to help even if I don't think it's going to work out.  A better response would have been to suggest other ideas to help but other than reforming how medical practice works so mental suffering isn't treated as less important than being physically debilitated (docs will agree to risky procedures to avoid physical loss of function but won't with mental illness ...likely because the family doesn't see the suffering from the inside but do see the loss in a death so are liable to sue/complain if things go bad).</p>\n", "parentCommentId": "cgoshccdERBsjLwYc", "user": {"username": "TruePath"}}, {"_id": "yhQ7Y3qPqn8h75qXo", "postedAt": "2022-06-01T11:18:41.455Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>National suicide prevention chat now has different URL -- <a href=\"https://suicidepreventionlifeline.org/chat/\">https://suicidepreventionlifeline.org/chat/</a></p>\n", "parentCommentId": null, "user": {"username": "newptcai"}}, {"_id": "3QQCWqzSDihgusGXi", "postedAt": "2022-06-01T17:18:43.591Z", "postId": "CJZGFxzHfdPuu2X76", "htmlBody": "<p>Thanks, updated!</p>\n", "parentCommentId": "yhQ7Y3qPqn8h75qXo", "user": {"username": "Julia_Wise"}}]