[{"_id": "FdHXq5RorJvtgeEH2", "postedAt": "2015-01-15T16:55:40.621Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Err ... I like your article. Thanks for the hard work. :)</p>\n<p>The above was my main reaction to reading this! Then I thought my comment would be more apposite if it also contained a grain of criticism, so I started looking for something you might have improved. </p>\n<p>The only thing I have is that perhaps it would help to lead with a paragraph summarising the recommendations, so that people who don't read the whole thing still get some of the value, and people who do are more likely to remember it.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "wzbsvevQnSRwfky4t", "postedAt": "2015-01-15T17:11:10.866Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Great article! I really think it sets an excellent standard for us to all aspire to and work at. </p>\n<p>I recently discovered a downside to hedging and being vulnerable in a public forum. In responding to a blog post I made, a commenter claimed I had an important figure wrong by 2-4 fold. He'd used an adjustment that I thought was not applicable and rather than say 'no your calculation is wrong' I hedged by saying I wasn't an expert in field x and could be explain what calculation he'd used and why. Unfortunately that exchange was used by a critic of EA as proof of my - and the movement's a 'ignorance'. </p>\n<p>The moral of this story is, I suppose, we risk vulnerability to unsupportive critics by taking these standards. I definitely think it's a worthwhile trade, and one that will lead to better discussion and a more productive community.</p>\n", "parentCommentId": null, "user": {"username": "Bernadette_Young"}}, {"_id": "mxHHFJKRfj5NheY6A", "postedAt": "2015-01-15T20:14:07.916Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>I think people perceive differences in their treatment more than they perceive the absolute harshness or kindness of their treatment.  If everyone receives harsh criticism from their teacher or boss, in my experience this results in little resentment, and it makes the praise that much better.  When I did ballet, the criticism was almost comically harsh.  The teacher would say our dancing was &quot;ugly&quot; or &quot;stupid&quot; and that she &quot;hated&quot; it.  Sometimes she would just laugh at us.  Praise was very rare and very mild (&quot;not half-bad&quot;).  But it was the same for everyone, so almost all of us just reacted with amusement at the harshness, and I think we did become much better dancers as a result.  Contrast that with the way girls treated one another: some were popular, some were the target of cruel remarks, and in general it was very unequal.  This led to a lot of unhappiness, of course.  </p>\n<p>I'm not saying that over-the-top cruelty is the best way to deliver criticism, but I think people perceive who's popular and who's not, even if the criticism is implicit.  (Keep in mind that &quot;implicit&quot; sometimes just means passive-aggressive, which can be even more destructive.) </p>\n<p>Also keep in mind that people perceive differences in praise.  Sometimes the EA community feels a bit clique-ish.  For example, it feels kind of hurtful when someone will post statuses naming their favorite people in the EA community.  </p>\n<p>So the lesson is: don't be driven by grudges or favoritism.  (I know this is one thing I need to be better about myself.)  </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "QyJdGKbuTfrBnu88X", "postedAt": "2015-01-15T21:26:51.815Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>I'd accept there's some tradeoff here, but I'd hope it's possible to defend your reasoning while being sufficiently supportive.</p>\n", "parentCommentId": "wzbsvevQnSRwfky4t", "user": {"username": "davidc"}}, {"_id": "LGE9TmWT7PsnvSG7e", "postedAt": "2015-01-16T00:18:08.695Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Michelle and Jess, thank you so much for continuing to write and think about these problems!</p>\n<p>I've noticed recently that a lot of successful communities seem to succeed because people want to be in them <em>for their own sake</em>, even leaving aside the stated goals of the community. This kind of hard thinking about our social norms really help to push effective altruism towards that goal.</p>\n<blockquote>\n<p>It might be particularly good to start and end your comment by telling the person what you like and admire about their post. This is particularly the case if you think the overall idea is a good one, though you think there are particular refinements that could be made. That way the person has an overall positive feeling toward your comment, which will hopefully leave them feeling enthused to carry out the specific suggestion you had. </p>\n</blockquote>\n<p>If you need a handy name for this technique, I've heard it called the &quot;compliment sandwich&quot; :)</p>\n<p>I've discovered with these that it feels really important to get the compliments right--not just &quot;great post!&quot; or something but taking the time to put together something specific, thoughtful, and relevant. (For instance, see my attempt above.) Otherwise, if the person you're talking to is familiar with the compliment sandwich, it can come off as slightly insincere.</p>\n<p>Of course, this is hard, but the skill of giving compliments that are sincere, topical, and meaningful will take you very far. And as I mentioned above, I think they also have huge benefits for EA culture at large, in terms of making this a community that people <em>want</em> to participate in.</p>\n<blockquote>\n<p>Highlighting areas of agreement</p>\n</blockquote>\n<p>I think another (underrated) benefit of this, is that it stops the other person from rounding off what you're saying to the closest argument they're used to hearing. For instance, if I were trying to persuade a friend that, say, global poverty causes were probably higher-impact than environmental ones, I would be very careful to say that I agreed that anthropogenic climate change was a serious problem, etc., so that the friend didn't get distracted and start hashing out carefully-rehearsed anti-climate-denial arguments.</p>\n<p>As another tip--in informal communication, I'm a big booster of using smiley faces [:)] when I say something that could be read ambiguously. For instance, if I say something that could be read sarcastically, I'll often end with a smiley to make sure it's not taken the wrong way.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "FkHoynADnCqdk8JBx", "postedAt": "2015-01-16T00:38:57.825Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<blockquote>\n<p>For example, it feels kind of hurtful when someone will post statuses naming their favorite people in the EA community.</p>\n</blockquote>\n<p>Yikes, that does sound obnoxious! It would be good if we could cultivate a complimentary atmosphere without causing these effects...</p>\n<p>Are there types of praise that are more or less likely to trigger this reaction? Thinking about this, my intuition suggests that it's much more of a problem when you praise <em>people</em> and less of a problem when you praise <em>specific actions</em>. Does that seem right?</p>\n<p>(As a side bonus, praising specific actions instead of people generally also helps with <a href=\"http://en.wikipedia.org/wiki/Mindset#Fixed_mindset_and_growth_mindset\">growth mindset</a>.)</p>\n", "parentCommentId": "mxHHFJKRfj5NheY6A", "user": {"username": "Ben_Kuhn"}}, {"_id": "esKkGry5wJm6CN4zQ", "postedAt": "2015-01-16T01:36:04.005Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Thanks for the post!  I really liked it, and it helped me further internalize a lot of what I had read elsewhere (e.g., How to Win Friends and Influence People).  I definitely need to think about that again and figure out how to actually integrate it into my list.</p>\n<p>Maybe a mandatory criticism checklist before I criticize anyone, with a negative HabitRPG habit if I catch myself having criticized without going through the checklist?  Or just a negative HabitRPG habit for all criticism?  (I like to think of negative HabitRPG habits as things which are unvirtuous (figuratively soul damaging), and I think giving criticism is that, regardless of how needed it is.)</p>\n<p>I'm also reminded of Slate Star Codex's <a href=\"http://slatestarcodex.com/comments/\">comment policy</a>: &quot;There is an ancient Sufi saying beloved of the Buddha, which like a surprising number of ancient Sufi sayings beloved of the Buddha, originates from a book of preachy Victorian poetry. It goes: 'Before you speak, let your words pass through three gates; At the first gate, ask yourself, is is true? At the second gate ask, is it necessary? At the third gate ask, is it kind?' Slate Star Codex has lower standards than either ancient Sufis or preachy Victorians, and so we only require you to pass at least two of those three gates.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "rGnc6fQKhSRMwMuHJ", "postedAt": "2015-01-16T02:48:52.091Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Great comment! Coming from a background of more mainstream altruistic circles, I've found appearing <strong>confident</strong> and avoiding hedging is an important aspect of leadership and inspiring others to join me in my goals.</p>\n<p>I think one resolution for this trade-off is to adjust based on the subject matter. When making certain basic claims  (e.g. the importance of the far future, giving a public speech about effective altruism), we might want to err on the side of confidence, but when making more tenuous claims (e.g. regarding the effectiveness of Against Malaria Foundation versus the effectiveness of GiveDirectly), we might want to err on the side of  hedging.</p>\n<p>Another resolution is to try to come off as both confident and hedging. This is easier in person when we can communicate confidence with our tone and body language, but hedge with our language. It seems difficult to pull off online.</p>\n<p>I'd be interested in hearing other ways to best handle this tradeoff.</p>\n", "parentCommentId": "wzbsvevQnSRwfky4t", "user": {"username": "redmoonsoaring"}}, {"_id": "SaP5qorCcE2wMMYhu", "postedAt": "2015-01-16T15:06:43.528Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Nice article! I also think all of these factors are important, not only to build to strengthen our ability to be supportive of another, but also because they simply make us better decision-makers. Here's an interesting experiment on the &quot;collective intelligence&quot; of groups and what factors contribute to it:</p>\n<blockquote>\n<p>Psychologists have repeatedly shown that a single statistical factor—often called “general\nintelligence”—emerges from the correlations among people’s performance on a wide variety of cognitive tasks. But no one has systematically examined whether a similar kind of “collective intelligence” exists for groups of people. In two studies with 699 people, working in groups of two to five, we find converging evidence of a general collective intelligence factor that explains a group’s performance on a wide variety of tasks. <strong>This “c factor” is not strongly correlated with the average or maximum individual intelligence of group members but is correlated with the average social sensitivity of group members, the equality in distribution of conversational turn-taking, and the proportion of females in the group.</strong></p>\n</blockquote>\n<p>My emphasis.</p>\n<p><a href=\"http://www.chabris.com/Woolley2010a.pdf\">Here's the article (<em>Science</em>)</a> and <a href=\"http://kgajos.eecs.harvard.edu/mite/\">here's a test of social sensitivity</a>.</p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "koANXg3EsJ3jenztM", "postedAt": "2015-01-16T21:14:35.904Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>This is nice and practical - it's good that it focusses on specific behaviours that people can practice rather than saying anything that could come across as &quot;you're alienating people and you should feel bad&quot;.</p>\n<p>One thing I'd add to this is to try to debate less and be curious more. Often discussions can turn into person A defending one position and person B rebutting this position and defending their own. I've found that it is often more helpful for both people to collaborate on analysing different models of the world in a curious way. Person A proposes a model of how the world works and person B the starts trying to understand person A's model - what its assumptions are, where it applies, and where it doesn't. They can then contrast this with other models of the world and try to work together to find out which is best. If you want to get really into it, drawing diagrams can help both because it helps you think and because it increases the sense that you are working together on a problem, rather than arguing against one another. But it doesn't have to be this formal - it could just be a friendly discussion about the strengths and weaknesses of different ideas.</p>\n<p>On a related note, I think it's important to realise that people don't always believe the positions they're arguing for. I'll often tell my friends an idea because I'm interested in working out it's strengths, weaknesses, and implications. If they're dismissive and try to argue against it I feel that they're missing the point - it would be more helpful to explore the idea's strengths and weaknesses together rather than turning it into a debate. This would help us to be more accepting of new ideas that don't come from the usual EA sources.</p>\n", "parentCommentId": null, "user": {"username": "Richard_Batty"}}, {"_id": "oE6pKMrWzwec9Tuoy", "postedAt": "2015-01-17T12:03:38.573Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Dennett has a nice article on this for written criticism: <a href=\"http://www.brainpickings.org/2014/03/28/daniel-dennett-rapoport-rules-criticism/\">http://www.brainpickings.org/2014/03/28/daniel-dennett-rapoport-rules-criticism/</a></p>\n<p>Here's his checklist:</p>\n<p>How to compose a successful critical commentary:</p>\n<ol>\n<li>You should attempt to re-express your target’s position so clearly, vividly, and fairly that your target says, “Thanks, I wish I’d thought of putting it that way.</li>\n<li>You should list any points of agreement (especially if they are not matters of general or widespread agreement).</li>\n<li>You should mention anything you have learned from your target.</li>\n<li>Only then are you permitted to say so much as a word of rebuttal or criticism.</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "gwRfX6nbJthwCk3gM", "postedAt": "2015-01-17T19:02:58.213Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Some of the comments on the forum don't seem to have any purpose but to make the commenter sound smart/morally superior. I try to only post comments that are useful, not just ones where I can prove someone wrong. It's actually hard not to make unhelpful “you're wrong” type of comments, as per human nature, but I think I have a good system to avoid them: I always write any comment I make in my word processor first, because it's easier to edit, and then cut and paste it into the comment form. If I'm not sure whether my comment will be really useful (despite how right I think it is), I'll just leave it in my word processor for a day or two, occasionally referring back to it. I'll often decide to seriously edit the comment to make it more benign/useful, but often I end up just dropping it altogether if I think it may not be that constructive. Replying to something as soon as you read it can lead to nonproductive comments – often routed in emotion – that come across as showing someone up. </p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "ffNaE4kGX494xW4aW", "postedAt": "2015-01-19T23:17:16.118Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Yeah, I often use a heuristic of &quot;if you're not sure if you should post this, don't.&quot;</p>\n", "parentCommentId": "gwRfX6nbJthwCk3gM", "user": {"username": "Larks"}}, {"_id": "Xqog53jRohJNpdLvS", "postedAt": "2015-01-25T13:35:27.308Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Jess &amp; Michelle: thanks for this excellent post. Three remarks I'd like to add:</p>\n<p><strong>1. We all need support, but individuals vary considerably in the kind of support they need in order to flourish.</strong> A kind of support that works well for one person might feel patronising, frustrating or stifling to another, or cold, distant and uncaring to a third. To be effectively supportive, we must be sensitive to individual needs. </p>\n<p><strong>2. Being supportive is difficult, so individuals in the community should help others support them.</strong> If the support you're getting from the community is suboptimal, it's unlikely that other individuals are <em>entirely</em> to blame. </p>\n<p><strong>3. As a community, we should create an atmosphere where it's easy for people to ask for more or different kinds of support when they need to.</strong> Admitting vulnerability and requesting support is a sign of strength and maturity, not weakness, so we should praise, encourage and reward those who do this. </p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "KRTSxg4vD8xT3CHnB", "postedAt": "2015-01-25T14:37:50.893Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Thanks Ben - great guidelines!</p>\n", "parentCommentId": "oE6pKMrWzwec9Tuoy", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "9djx3X98caHSTHpJS", "postedAt": "2015-01-25T14:46:15.367Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>I definitely agree it seems important to create a community atmosphere that's appealing in itself, tricky as that is likely to be. \nAs you say, the compliments need to not just be sincere, but the kind that come across as sincere. Being really specific seems like a good way to do that. It might also be helpful not to think of it as a 'compliment sandwich', which sounds kind of insincere, but rather as showing appreciation for the person. Putting yourself in the other's shoes, and thinking about the fact you would like to be appreciated, and then trying to do the same, might help get into a frame of mind that will make showing true appreciation easier. \nI'm actually not such a fan of smilies - I think they can come across as patronising, or as a bit fake - like you're saying something mean and then trying to nullify the offence. But I imagine it just really depends on the person! </p>\n", "parentCommentId": "LGE9TmWT7PsnvSG7e", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "moe5cfPnQW5H9ucia", "postedAt": "2015-01-25T14:47:02.965Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Thanks Peter, great points!</p>\n", "parentCommentId": "Xqog53jRohJNpdLvS", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "dX5ie2QGCx9mr4e4n", "postedAt": "2015-01-25T14:48:58.410Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>I really like that framing of trying to be more curious and less debating. As you say, it's really useful to investigate new ideas, even if you don't agree with them!</p>\n", "parentCommentId": "koANXg3EsJ3jenztM", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "PALHnMZPtvwmQHx6G", "postedAt": "2015-01-26T15:57:26.330Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Great comment! :)</p>\n", "parentCommentId": "koANXg3EsJ3jenztM", "user": {"username": "Roman_Duda"}}, {"_id": "K7Eu3cT2r2tcbNanR", "postedAt": "2015-01-26T21:13:17.011Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p><a href=\"http://lifehacker.com/utilize-the-steel-man-tactic-to-argue-more-effectivel-1632402742\">http://lifehacker.com/utilize-the-steel-man-tactic-to-argue-more-effectivel-1632402742</a></p>\n<p>An advantage to steel-manning an opponent (arguing against the best version of their argument) is that you get to see if they agree with your steel-man. This leads to many possible outcomes, and almost all are good for information within the debate. If the person disagrees with your steel man, they may rephrase their argument in a stronger way than your steel man, which may convince you of their position and cause you to change your mind. If they agree, you know exactly what you have to argue against.</p>\n<p>There is some nuance to this which is very useful in social situations. For example, if someone immediately agrees with a steel-man, in a rather suspicious way, you may be able to detect if the person is using sophistry to convince you of something. Some people just speak non-sense while trying to signal intelligence or group loyalty, and you can accidentally create a coherent argument where there was none initially. </p>\n<p>To summarize, steel-man arguments often lead to good outcomes: \n(1) You may change your mind for good reasons\n(2) You can find a clear path to argue with minimal semantic issues and confrontation\n(3) You may identify motivated reasoners faster</p>\n", "parentCommentId": "oE6pKMrWzwec9Tuoy", "user": {"username": "Gentzel"}}, {"_id": "TY4K9gtjk68PhHawb", "postedAt": "2015-01-26T21:35:24.151Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>I like this idea, and have done it before, but it is good if the process can be sped up. Being more responsive increases the likelihood that the useful things you post will get read by those you are responding to. Some forums boot people for not explaining their arguments fast enough.</p>\n", "parentCommentId": "gwRfX6nbJthwCk3gM", "user": {"username": "Gentzel"}}, {"_id": "rp59SdHkiEkrc54m7", "postedAt": "2020-07-20T07:53:35.147Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>I quite appreciated both this post and your comment. (Which I&apos;ve stumbled upon 6 years late due to <a href=\"https://forum.effectivealtruism.org/posts/XXAjiLpHsL8PXwovf/collection-of-good-2012-2017-ea-forum-posts-1\">this post</a>.)</p><p>I was going to comment something related. Specifically, when I read:</p><blockquote><a href=\"http://zenhabits.net/how-to-give-kind-criticism-and-avoid-being-critical/\">This post</a> has a nice breakdown of the various different reasons we might give critical feedback:<br>To help someone improve<br>To see a change we would like<br>To further the discussion<br>To hurt someone<br>To vent frustrations<br>To boost our ego</blockquote><p>...it occurred to me that I think an additional, common reason for giving critical feedback is to signal one&apos;s knowledge or intelligence. (I&apos;d say that that&apos;s related but not identical to boosting our ego.)</p><p>If I&apos;m being honest, I notice I&apos;m sometimes motivated to comment on the forum for this reason. I don&apos;t think that that&apos;s <em>inherently</em> bad, and I think there <em>is </em>an upside: the desire to signal that I know stuff motivates me to post and comment more on the forum, which (I hope) actually does benefit others in some ways. But that motivation could also lead to making comments that aren&apos;t actually net positive (once you factor in how the comments make other people feel), or making comments in a <em>way </em>that&apos;s suboptimal (e.g., with the wrong sort of tone). </p><p>So I try to pay attention to whether that motivation is playing a major role in my decision-making. And, when it seems like it might be, I try to increase how carefully I assess whether it&apos;s worth me making the comment, and whether I should adjust how I phrase it. </p><p>(That said, a norm promoting that sort of approach could conceivably go too far, in a way that slows people down and reduces discussion to a greater extent than is worthwhile.)</p>", "parentCommentId": "gwRfX6nbJthwCk3gM", "user": {"username": "MichaelA"}}, {"_id": "XAvAEgTfEqbKMFiiJ", "postedAt": "2023-11-26T10:46:23.601Z", "postId": "CkikpvdkkLLJHhLXL", "htmlBody": "<p>Thanks, Michelle!</p><blockquote><p>How to Win Friends and Influence People</p></blockquote><p>I have not read the book, but <a href=\"https://dansilvestre.com/summaries/how-to-win-friends-and-influence-people/\">this</a> seems like a good summary.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]