[{"_id": "Noe9QeMEaYCsL4EAQ", "postedAt": "2022-12-29T22:42:38.532Z", "postId": "CkYNsQKEB8kgFHEYx", "htmlBody": "<p>I think the overall balance of positive and negative sources is fair when only viewed from a \"positive versus negative\" standpoint. As I think Habiba Islam pointed out somewhere much of the positive reading is much much longer. Where I think this will wind up running into trouble is something like this:</p>\n<p>-While there is some primary reading in this list, most of the articles, figures, events, ideas etc. that are discussed across these readings appear in the secondary sources.</p>\n<p>-This is pretty much inevitable, the list would multiply out far too much if she added all of the primary sources needed to evaluate the secondary sources from scratch</p>\n<p>-Most of the secondary sources are negative, and often misleading in some significant way</p>\n<p>-The standard way to try to check these problems without multiplying out primary sources too much is to read other pieces arguing with the original ones</p>\n<p>-The trouble is, there are very few of those outside of blogs and the EA forum on these topics, something I've been hand wringing about for a while, and Thorn seems to only be looking at more official sources like academic/magazine/newspaper publications</p>\n<p>-I think Thorn will try to be balanced and thoughtful, but I think this disparity will almost ensure that the video will inherit many of the flaws of its sources</p>\n", "parentCommentId": null, "user": {"username": "Devin Kalish"}}, {"_id": "ZyoG7snJcEdGN3KtL", "postedAt": "2023-02-15T03:23:29.721Z", "postId": "CkYNsQKEB8kgFHEYx", "htmlBody": "<p>This video was just released on Nebula. I expect it will be out on youtube in the next couple of days. I watched the entire thing and, overall, thought it was reasonably evenhanded. Some of the critiques seem valid, and though not necessarily novel, worth discussing more (ie Measurability Bias). Some of them seemed a bit more hand-wavey (ie, paraphrased: \"morality is about the interactions that we have with each other, not about our effects on future people, because future people don't even exist!\") or shallow (ie, paraphrased: \"malicious AI won't spread uncontrolled through the internet; complex programs need special hardware, and we can just turn that off!\"). There was also a healthy dose of \"dismantle the System\" and complaint that EA legitimizes capitalism by making earning money compatible with morality.</p>\n<p>Overall, it struck me as unusually truth-seeking for a piece of media produced primarily for entertainment. While Thorn seems to have some core ideological differences with EA (she's <em>really</em> into \"Dismantle the System\"), she also seems to have made a significant effort here, including reading both What We Owe the Future and The Precipice in addition to Torres and other critics. Hopefully her audience will come away with a nuanced view.</p>\n", "parentCommentId": null, "user": {"username": "rachelAF"}}, {"_id": "9fzyyZyXv64WYmsBb", "postedAt": "2023-02-20T23:15:46.223Z", "postId": "CkYNsQKEB8kgFHEYx", "htmlBody": "<p>Ah, thank you!</p>\n<blockquote>\n<p>paraphrased: \"morality is about the interactions that we have with each other, not about our effects on future people, because future people don't even exist!\"</p>\n</blockquote>\n<p>If that's really the core of what she said about that... yeah maybe I won't watch this video. (She does good subtitles for her videos, though, so I am more likely to download and read those!)</p>\n", "parentCommentId": "ZyoG7snJcEdGN3KtL", "user": {"username": "NicholasKross"}}, {"_id": "rWL4ygZqJbo3dwB3r", "postedAt": "2023-02-24T10:29:46.496Z", "postId": "CkYNsQKEB8kgFHEYx", "htmlBody": "<p><a href=\"https://www.youtube.com/watch?v=Lm0vHQYKI-Y\">The video</a> is coming out today on YouTube - the title: \"<strong>The Rich Have Their Own Ethics: Effective Altruism &amp; the Crypto Crash (ft. F1nn5ter)\"</strong> suggests its obvious line of attack, but given PhilosophyTube is a major contributer to Leftist YouTube, that should be well in line with priors.</p><p>Given you described it as 'reasonably evenhanded', and how much I liked <a href=\"https://www.youtube.com/watch?v=v1eWIshUzr8\">Abby's video on the NHS</a> as an exploration of institutional failure and the harms it can cause, I might give it a watch and post a summary as a top-level comment when I get back from work.</p>", "parentCommentId": "ZyoG7snJcEdGN3KtL", "user": {"username": "JWS"}}, {"_id": "HLemM7qrr7QqLkPKL", "postedAt": "2023-02-25T23:47:45.901Z", "postId": "CkYNsQKEB8kgFHEYx", "htmlBody": "<p>Thanks for the update; I'm curious to hear what you think!</p>\n", "parentCommentId": "rWL4ygZqJbo3dwB3r", "user": {"username": "rachelAF"}}, {"_id": "AHQbM3wk8vGzxkknJ", "postedAt": "2023-02-26T00:05:47.992Z", "postId": "CkYNsQKEB8kgFHEYx", "htmlBody": "<p>Hey rachel, there's actually been a few different posts on the Forum about the video which I was glad to see. I posted my main reaction <a href=\"https://forum.effectivealtruism.org/posts/AfkS6Jufvj8A2BAdf/video-on-effective-altruism-by-popular-youtuber-philosophy?commentId=ryYzxtJLbu9BvPh8L\">here</a> &nbsp;- but short answer, I was pleasantly surprised by how fair it felt as criticism, especially given the YT format and what I know about Abigail's own philosophical perspective. In retrospect, seems like your impression was pretty spot on.</p>", "parentCommentId": "HLemM7qrr7QqLkPKL", "user": {"username": "JWS"}}]