[{"_id": "QFSFHByCTpG5w4XrS", "postedAt": "2023-07-13T05:32:30.099Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>MHR, &nbsp;thanks for the CEA. I just want to flag that I wrote that quoted part in the Manifund proposal, not Andres. I wrote it off of stuff that Andres sent to me but all mistakes are my own, not his. I'm going to encourage Andres to leave a comment here as well to give comments on the CEA.</p>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "AKoatcXRsRad7rihK", "postedAt": "2023-07-13T10:39:12.470Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks for the correction! I've updated that section.</p>", "parentCommentId": "QFSFHByCTpG5w4XrS", "user": {"username": "MHR"}}, {"_id": "mbcMawRGzZyEKBkRN", "postedAt": "2023-07-13T11:51:49.924Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Something I think is worth mentioning, but that I didn’t get to in the main body of the post, is priors-based critiques of the RP moral weights. I think a lot of people find some of RP’s results (e.g that octopuses have a &gt;5% chance of being able to realize more than 1. 4x the instantaneous welfare of a human) intuitively unreasonable, and might understandably question the overall methodology for producing these kinds of outcomes. RP has responded to these critiques, but I do share some of these concerns; I would be skeptical of an argument for prioritizing animal welfare over interventions that help humans that depended heavily on specific values in the MWP results. However, I am less concerned about these critiques when applied to this specific analysis, since this case is just comparing two animal welfare interventions. Critiques of the RP moral weights applied to this case would need to make an argument for why the relative weights of chicken and shrimp are wrong, not the absolute weights. I think concern about the undiluted experience model is the most salient of these critiques, which is why it was the primary critique discussed in the post.</p>\n<p>Of course, one still needs to make the case for why it’s worth caring about animal welfare at all. But I think that case can be made without appealing to the specifics of the MWP results, and is outside the scope of this post regardless.</p>\n", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "mYTcGtbWRau344oC7", "postedAt": "2023-07-13T12:33:16.913Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>And that goes in both directions: some find it intuitively unreasonable to think that humans can realise far more welfare than some other animals. Additionally, the undiluted experience model seems pretty intuitive to many.</p>\n<p>I would hope that in a community committed to impartiality, one need not have to make the case for why it’s worth caring about the welfare of beings that happen not to be members of our species, so it is totally fine not to include that in your post.</p>\n", "parentCommentId": "mbcMawRGzZyEKBkRN", "user": {"username": "JBentham"}}, {"_id": "pqcJdKePkRDWej7uN", "postedAt": "2023-07-13T14:26:18.747Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<blockquote><p>I would hope that in a community committed to impartiality, one need not have to make the case for why it’s worth caring about the welfare of beings that happen not to be members of our species</p></blockquote><p><strong>I think EA's cause prioritization would look very different if it genuinely were a \"community committed to impartiality\" regarding species</strong>. Under impartiality, both of these interventions are on the order of 1000x as cost-effective as GiveWell top charities.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefjrqqj5necr\"><sup><a href=\"#fnjrqqj5necr\">[1]</a></sup></span>&nbsp;(One could avoid this conclusion by believing pleasure/pain only account for on the order of 0.1% of welfare, but this is a deeply unusual view and is empirically dubious.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6bktc2u512v\"><sup><a href=\"#fn6bktc2u512v\">[2]</a></sup></span>) Open Phil (OP) has recognized this since 2016.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdfj21w668f5\"><sup><a href=\"#fndfj21w668f5\">[3]</a></sup></span></p><p>However, to this day, OP has only allocated 17% of its annual neartermist funding to animal welfare.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefpook53rufyi\"><sup><a href=\"#fnpook53rufyi\">[4]</a></sup></span>&nbsp;If OP <i>really</i> believes animal welfare is ~1000x as cost-effective as GiveWell top charities, it's difficult to understand how this allocation of funding could possibly be morally justified. Yes, many caveats could be made:</p><ul><li>OP could find moral weight estimation methodologically dubious. (This would be strange given that OP funded RP's moral weights project.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvhqybxcihoi\"><sup><a href=\"#fnvhqybxcihoi\">[5]</a></sup></span>)</li><li>OP could oppose outsize allocations to interventions which depend upon controversial views, such as being impartial about species membership. (This would be strange given that in 2017, 2019, and 2021, OP allocated a <i>majority</i> of longtermist funding to AI x-risk reduction, even though the view that AI is an x-risk is similarly controversial.)</li><li>As remarked above, OP could hold a deeply unusual view where almost none of welfare is accounted for by pleasure/pain, which would be quite inconsistent with the existing evidence.</li><li>OP could believe animal welfare has faster diminishing marginal returns than global health. This is probably true, but if OP believes animal welfare has ~1000x cost-effectiveness, it seems that OP would be trying to hyperaggressively grow the capacity of animal welfare charities more than it's currently doing.</li></ul><p>Why doesn't OP allocate a majority of neartermist funding to animal welfare? I don't know. <strong>My guess is that key decisionmakers </strong><i><strong>aren't</strong></i><strong> \"committed to impartiality\" regarding species</strong>. Holden Karnofsky has said as much: \"My own reflections and reasoning about philosophy of mind have, so far, seemed to indicate against the idea that e.g. chickens merit moral concern.\"<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2wc6dbuv367\"><sup><a href=\"#fn2wc6dbuv367\">[6]</a></sup></span></p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/pqcJdKePkRDWej7uN/jrkqafz3cw0yfltjonel\"></figure><p>(Meme by me)</p><p>So, what to do? For one, <strong>it would be extremely helpful for OP to clarify their views on the questions relevant to animal welfare</strong> (how much of welfare is explained by hedonism, should one be impartial regarding species), what the cruxes are that would change their minds regarding cause prioritization, and the counterpoints which explain why they haven't changed their minds. (I'll be publishing a post within the next few months with the above arguments.)</p><p>I wish you were right that EA is a \"community committed to impartiality\" regarding species. However, empirically, it seems that's not the case.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnjrqqj5necr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefjrqqj5necr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Vasco Grilo (2023). \"Prioritising animal welfare over global health and development?\" <a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and\">https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and</a></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6bktc2u512v\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6bktc2u512v\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Severe pain, such as cluster headaches, is associated with a greatly increased suicidality. Lee et al (2019). \"Increased suicidality in patients with cluster headache\".&nbsp;<a href=\"https://pubmed.ncbi.nlm.nih.gov/31018651/\"><u>https://pubmed.ncbi.nlm.nih.gov/31018651/</u></a></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndfj21w668f5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdfj21w668f5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>\"If one values humans 10-100x as much, this still implies that corporate campaigns are a far better use of funds (100-1,000x).\" Holden Karnofsky (2017). \"Worldview Diversification\". <a href=\"https://www.openphilanthropy.org/research/worldview-diversification/\">https://www.openphilanthropy.org/research/worldview-diversification/</a></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnpook53rufyi\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefpook53rufyi\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Ariel Simnegar (2023). \"Open Phil Grants Analysis\". <a href=\"https://github.com/ariel-simnegar/open-phil-grants-analysis/blob/main/open_phil_grants_analysis.ipynb\">https://github.com/ariel-simnegar/open-phil-grants-analysis/blob/main/open_phil_grants_analysis.ipynb</a></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvhqybxcihoi\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvhqybxcihoi\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Open Philanthropy. \"Rethink Priorities — Moral Patienthood and Moral Weight Research\". <a href=\"https://www.openphilanthropy.org/grants/rethink-priorities-moral-patienthood-and-moral-weight-research/\">https://www.openphilanthropy.org/grants/rethink-priorities-moral-patienthood-and-moral-weight-research/</a></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2wc6dbuv367\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2wc6dbuv367\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Holden Karnofsky (2017). \"Radical Empathy\". <a href=\"https://www.openphilanthropy.org/research/radical-empathy/\">https://www.openphilanthropy.org/research/radical-empathy/</a></p></div></li></ol>", "parentCommentId": "mYTcGtbWRau344oC7", "user": {"username": "Ariel Simnegar"}}, {"_id": "fEkBZAkqDAuLhn5r9", "postedAt": "2023-07-13T14:33:39.679Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Rather than capping shrimp welfare ranges at 0.1 (relative to humans), I would just exclude the undiluted experience model or cap welfare ranges (for both chickens and shrimp) at around 1, or report welfare range model-conditional estimates, because I think the equality-based model is not implausible, and probably many potential donors would give it substantial weight.</p>\n<p>If you're taking means, you run into the two envelopes problem, and the undiluted experience model (and generally, the higher the variance in relative welfare ranges across models) is going to make it particularly bad. Typically, I think it’s only reasonable to treat the human welfare range as constant across models to normalize by and take expected values relative to based on agent-relative reasons, because we could otherwise consider the chicken or shrimp or fruit fly welfare range constant (or use some other scales, possibly multiple scales and moral uncertainty between them and an approach other than to maximize expected choiceworthiness, like a moral parliament), and you could end up with very different results under each.</p>\n<p>In general, I'd want to report the cost-effectiveness of each intervention separately conditional on each welfare range model, because this doesn’t commit us to any specific way to identify units between the models (intertheoretic comparisons), or any specific approach to moral uncertainty or even specific probabilities to each model (and it's also a sensitivity analysis with respect to the welfare range model).</p>\n<p>I'm also working on an article on this topic, but for some prior writing, see:</p>\n<ol>\n<li><a href=\"https://reducing-suffering.org/two-envelopes-problem-for-brain-size-and-moral-uncertainty/\">https://reducing-suffering.org/two-envelopes-problem-for-brain-size-and-moral-uncertainty/</a></li>\n<li>Section 1.1 in <a href=\"https://www.openphilanthropy.org/research/update-on-cause-prioritization-at-open-philanthropy/\">https://www.openphilanthropy.org/research/update-on-cause-prioritization-at-open-philanthropy/</a></li>\n</ol>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "CbhKXLjhNmFykqswo", "postedAt": "2023-07-15T05:01:09.199Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>First and foremost, I want to express my deep gratitude to <a href=\"https://forum.effectivealtruism.org/users/mhr?mention=user\">@MHR</a>, <a href=\"https://forum.effectivealtruism.org/users/marcusabramovitch?mention=user\">@MarcusAbramovitch</a> &nbsp;and <a href=\"https://forum.effectivealtruism.org/users/aaronb50?mention=user\">@Aaron Bergman</a> for kickstarting this discussion in the EA Forum. As mentioned in the post, this is currently SWP’s most cost-effective programme and one that we are very keen to continue to scale in the coming few years. To achieve that, we expect to rely on the support of our existing donors but also on that of the EA Community at large.&nbsp;</p><p>Second, we couldn’t have asked for a better way to get the conversation started than for a third party to look at our programme in such depth and to put it to the community for consideration in an impartial way.&nbsp;</p><p>Finally, I want it to be clear that my comments should not be interpreted as a negative reaction to the post but quite the opposite. It would have been nearly impossible to do a better job at portraying and evaluating our programme without further ‘insider intel’ which I hope to provide a bit of here.&nbsp;</p><p>Thank you!</p><p>&nbsp;</p><p>In the coming days, we might have some more feedback on the specific assumptions made in the post but I wanted to make some clarifications as early as possible:</p><p>&nbsp;</p><p><i><strong>FUNDING</strong></i></p><ul><li><strong>We are aiming to fundraise up to $1,000,000 for this programme to deploy stunners for the remainder of 2023 as well as 2024</strong><ul><li>2-3 more electrical stunners in 2023 (high degree of certainty),</li><li>12 more in 2024 (ambitious), and</li><li>An allowance to hire someone who will support with the logistics of physically getting all these stunners where they are supposed to go. This is surprisingly labour-intensive (negotiating contracts, arranging shipments, dealing with importing agencies, etc.).&nbsp;</li></ul></li><li>Anyone interested in supporting this programme can donate through the&nbsp;<a href=\"https://manifund.org/projects/shrimp-welfare-project---special-program---place-electric-stunners-at-selected-producers?tab=comments\"><u>Manifund project</u></a> or our&nbsp;<a href=\"https://www.shrimpwelfareproject.org/donate\"><u>webpage</u></a>.&nbsp;<ul><li>Should anyone be thinking about making a sizeable donation, please contact me directly at <a href=\"mailto:andres@shrimpwelfareproject.org\"><u>andres@shrimpwelfareproject.org</u></a></li></ul></li><li>As mentioned, we have signed agreements with <a href=\"https://www.shrimpwelfareproject.org/post/mou-with-mer-seafood\">MER Seafood</a> and <a href=\"https://www.shrimpwelfareproject.org/post/seajoy-and-shrimp-welfare-project\">Seajoy - Cooke</a>, both based in Honduras. Those stunners have already been acquired and at least partially paid for. The funds we are raising are aimed at funding the other 2-3 stunners in the pipeline for this year and another dozen for 2024.&nbsp;</li></ul><p>&nbsp;</p><p><i><strong>OVERALL PROGRAMME</strong></i></p><ul><li>It cannot be highlighted enough that the ultimate goal of this project, even if highly cost-effective in its own right, is to catalyse industry-wide adoption (certification schemes, legislation, etc.) of a more humane slaughter method than the one currently utilised. By removing certain perceived barriers (or falsifying some excuses, depending on your views of the industry), we expect retailers and other buyers to be emboldened and be more assertive in demanding their shrimps to be humanely stunned pre-slaughter.<ul><li>A positive indication of the tractability of this Theory of Change is the recent publication by Marks &amp; Spencer (a UK retailer) of their&nbsp;<a href=\"https://corporate.marksandspencer.com/sites/marksandspencer/files/marks-spencer/Aquaculture/MS-Decapod-Welfare-Policy%20v2FINAL.pdf\"><u>Decapod Crustacean Welfare Policy</u></a>. It has some commitments and timelines which seemed unthinkable when SWP was launched in 2021. This was made possible mainly by:<ul><li>Compassionate individuals inside M&amp;S who were willing to actively engage with animal welfare organisations,</li><li>Crustacean Compassion’s great work, including their <a href=\"https://www.crustaceancompassion.org/the-snapshot\"><u>industry benchmark</u></a><u>,</u>&nbsp;</li><li>AND Shrimp Welfare Project’s novel approach in supporting the adoption of humane tech (as recognised in the text of M&amp;S’s own welfare policies) which gave M&amp;S greater confidence in drawing up their plans</li></ul></li></ul></li></ul><p>&nbsp;</p><p><i><strong>COST-EFFECTIVENESS ESTIMATES</strong></i></p><ul><li>The average and standard deviations of how many shrimps this programme would help per $, use only the percentages that the producers have committed to in order to receive their initial electrical stunner. However, in our discussions, it is clear that these producers (and more importantly their buyers) are seeing this as a pilot to eventually stun 100% (or close) of their shrimps.&nbsp;<ul><li>Assuming that SWP does not pay for any of the additional stunners required by those producers, this would increase the average from c.15,000 to c.27,500 (+54%) shrimps per $, making it significantly more cost-effective&nbsp;</li></ul></li></ul>", "parentCommentId": null, "user": {"username": "Andres Jimenez"}}, {"_id": "QXxw66edPDdBmEYQT", "postedAt": "2023-07-15T05:05:00.889Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks for the clarification and encouragement ;)</p>", "parentCommentId": "QFSFHByCTpG5w4XrS", "user": {"username": "Andres Jimenez"}}, {"_id": "SJ39Agyu39Ef2tesn", "postedAt": "2023-07-15T14:39:54.324Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks Andrés, this is great information! I've added a summary and link to your comment at the top of the post.&nbsp;</p>", "parentCommentId": "CbhKXLjhNmFykqswo", "user": {"username": "MHR"}}, {"_id": "dTuLTy6GcmBzNbSzC", "postedAt": "2023-07-15T16:02:30.035Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks for your comment! I agree that there are plenty of options that would be useful other than using the raw welfare ranges or using the welfare ranges with a cap on shrimp at 0.1x humans' level. Here are the results with a cap on both shrimp's and chickens' welfare ranges at 1x humans':</p><blockquote><p>Summary Statistics: Weighted Hours of Disabling-Equivalent Pain Averted Per Dollar Donated to SWP:<br>5th, 25th, 50th, 75th, 95th percentiles:<br>[2.234e-04 4.837e+00 6.347e+01 4.592e+02 4.776e+03]<br>Mean:<br>1155.78<br>Summary Statistics: Weighted Hours of Disabling-Equivalent Pain Averted Per Dollar Donated to THL:<br>5th, 25th, 50th, 75th, 95th percentiles:<br>[2.301e+01 1.023e+03 2.935e+03 6.537e+03 1.595e+04]<br>Mean:<br>4811.45</p></blockquote><p>Breaking out the cost-effectiveness results conditional on each welfare range model (or conditional on including/excluding the undiluted experience model) would be fantastic, but is probably outside the scope of what I have time to do.&nbsp;</p><p>I don't really understand your middle paragraph. Can you elaborate on what you mean by \"agent-relative reasons?\" I do understand the issue whereby which welfare range is taken to be constant can drive the outcome of an EV calculation. But I *think* that only ends up changing the results if your unit for welfare range is based one of the animals in the comparison? I think I'd get identical conclusions if I took fruit flies' welfare range to be the constant instead of humans', it would only change if I used chickens' or shrimp's as the constant. And I'm not trying to take EVs across multiple moral systems, I'm holding the moral system constant and taking EVs across different estimates of chickens' and shrimp's capacities for realizing welfare, which seems like it avoids some further pitfalls.&nbsp;</p>", "parentCommentId": "fEkBZAkqDAuLhn5r9", "user": {"username": "MHR"}}, {"_id": "YgaN35Q3FQS63djn2", "postedAt": "2023-07-15T18:09:58.628Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks for doing and sharing these calculations!</p>\n<p>If you used fruit flies (or other very small-brained animals) as having constant welfare range and included the neuron count model as a possibility, then the neuron count model would skew the expected values towards favouring chickens. This post illustrates this, although the model assumptions are different (conscious subsystems is an empirical/descriptive hypothesis about the number of moral patients conditional on each theory of consciousness and welfare, not a model or theory of consciousness and welfare per moral patient):\n<a href=\"https://forum.effectivealtruism.org/posts/vbhoFsyQmrntru6Kw/do-brains-contain-many-conscious-subsystems-if-so-should-we\">https://forum.effectivealtruism.org/posts/vbhoFsyQmrntru6Kw/do-brains-contain-many-conscious-subsystems-if-so-should-we</a></p>\n<p>By agent-relative reasons, I just mean each agent could have some reasons to fix their own welfare range without similar reasons to fix others' welfare ranges. Like maybe you just do ethics by projecting and extrapolating how you value your own experiences, which you assume to be fixed in value.</p>\n<p>I think different theories of welfare (including different theories of hedonistic welfare), captured by the different models for welfare ranges, are effectively different normative/moral theories. So, if you do take expected values across them, you are taking expected values across different normative/moral stances.</p>\n", "parentCommentId": "dTuLTy6GcmBzNbSzC", "user": {"username": "MichaelStJules"}}, {"_id": "cDbJWsoBeMLxBHTFd", "postedAt": "2023-07-15T18:31:26.829Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks! I appreciate the response</p>\n", "parentCommentId": "YgaN35Q3FQS63djn2", "user": {"username": "MHR"}}, {"_id": "LoMpLpyAEhHAFB9d6", "postedAt": "2023-07-17T16:08:43.209Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>This is interesting ! I had the same interrogation, their position doesn't seem that coherent.</p><p>Maybe you should to a post with this question, that would get noticed by someone at Open Phil and maybe get answered ?</p>", "parentCommentId": "pqcJdKePkRDWej7uN", "user": {"username": "Corentin Fressoz"}}, {"_id": "osRPx4YmJphfotgpW", "postedAt": "2023-07-17T17:38:07.707Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Agreed. I'm planning on writing up a post about it, but I'm very busy and I'd like the post to be extremely rigorous and address all possible objections, so it probably won't be published for a month or two.</p>", "parentCommentId": "LoMpLpyAEhHAFB9d6", "user": {"username": "Ariel Simnegar"}}, {"_id": "xpLE5HjMYyARwxJks", "postedAt": "2023-07-17T23:55:05.891Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<blockquote><p>To weight pain at these different levels, I followed the same approach as the recent Rethink Priorities report “<a href=\"https://docs.google.com/document/d/1p7xqop2FlIF8Kw45za0NnJPwvUA70Mb1UzjijMRKRr8/edit#heading=h.eml8g2x67lkh\"><u>Cost-Effectiveness of Historical Farmed Animal Welfare Ballot Initiatives</u></a>,” authored by Laura Duffy, which weights an hour of hurtful pain as equivalent to 0.15 hours of disabling pain and an hour of excruciating pain as equivalent to 5 hours of disabling pain.</p></blockquote><p>&nbsp;</p><p>These ratios seem somewhat conservative to me, i.e. I think we can make a case for disabling pain being much more than 1/0.15=~6.67 times worse than hurtful pain, and excruciating pain being much more than 5 times worse than disabling pain. I view this as partly a question of how animals actually respond (e.g. what kinds of tradeoffs they would make, or we would make in their place), and partly a normative/moral question, so subject to normative/moral uncertainty. <a href=\"https://forum.effectivealtruism.org/posts/xtcgsLA2G8bn8vj99/reminding-myself-just-how-awful-pain-can-get-plus-an#Question_3__How_does_intense_pain_compare_morally_to_mild_pain_\">Ren Springlea underwent some intense pain and estimated how bad the different WFP intensity levels were</a>. Here's the table reproduced from their post after undergoing these experiences:</p><figure class=\"table\" style=\"height:280.578px;width:700px\"><table style=\"background-color:rgb(20, 20, 20);border:1px double rgb(122, 122, 122)\"><tbody><tr><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">&nbsp;</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\" colspan=\"4\">Weightings (units of time that would equate with 1 unit time of annoying pain)</td></tr><tr><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">&nbsp;</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">Annoying</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">Hurtful</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">Disabling</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">Excruciating</td></tr><tr><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">4 Feb 2023 (Evening after getting tattoos)</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">1</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">15</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">1,000</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">??? Maybe infinite ???</td></tr><tr><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">25 Feb 2023 (After doing cold pressor tests)</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">1</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">10</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">490</td><td style=\"border:1pt solid rgb(0, 0, 0);padding:5pt\">???</td></tr></tbody></table></figure><p>According to Ren's estimates, disabling pain was around 50x worse than hurtful pain, and excruciating pain was <i>possibly infinitely</i> worse than disabling pain.</p><p>Both chicken (hen and broiler) welfare reforms and shrimp stunning reduce excruciating pain in expectation,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref068va5vgdblb\"><sup><a href=\"#fn068va5vgdblb\">[1]</a></sup></span>&nbsp;but I'd expect shrimp stunning to do so more cost-effectively, if as many shrimp experience excruciating pain during slaughter as you assumed (ideally, we could gather more evidence on that, too).</p><p>On the other hand, there might be more cost-effective ways to reduce excruciating pain for chickens by focusing on slaughter instead of more general asks, too. Or, we should also look at shrimp stunning as part of the overall portfolio of work to help shrimp, although SWP is seeking separate funding for it.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn068va5vgdblb\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref068va5vgdblb\">^</a></strong></sup></span><div class=\"footnote-content\"><p>According to <a href=\"https://welfarefootprint.org/\">Welfare Footprint Project</a> for chicken welfare reforms.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "DwubtDg6MaSCi64T7", "postedAt": "2023-07-18T17:07:07.075Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>I left a comment on RP's post on welfare ranges <a href=\"https://forum.effectivealtruism.org/posts/Qk3hd6PrFManj8K6o/rethink-priorities-welfare-range-estimates?commentId=2WSyexNiHrvDfLMwW\">here</a> that's relevant.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "HDsfYqCuaj8EwBZup", "postedAt": "2023-07-21T12:43:08.084Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks! This is a very interesting thought!</p>", "parentCommentId": "DwubtDg6MaSCi64T7", "user": {"username": "MHR"}}, {"_id": "JhARr4scH674W3pQe", "postedAt": "2023-07-26T11:29:16.535Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks so much for this post.&nbsp; Very impressive how quickly you put this together.&nbsp;</p><p>I think your analysis is a very helpful take on how cost-effective it might be for advocates to&nbsp;<i>purchase</i>&nbsp;<i>shrimp stunners for industry,&nbsp;</i>and how this might compare to estimates of the cost-effectiveness&nbsp;<i>of historical corporate hen welfare campaigns</i>.&nbsp; Very useful to try and make different interventions comparable for interested stakeholders.</p><p>That said, I think your quantitive analysis probably misses most of the expected value of the SWP’s shrimp stunning intervention.&nbsp; My guess is that the vast majority of the expected value of this opportunity lies in how much it might bring forward widespread adoption of shrimp stunning by industry, and not the easier-to-quantify short-term direct impacts of the stunners SWP purchases for industry.</p><p>I think you recognise this issue in the last paragraph.&nbsp; And I also fully appreciate that even a relatively shallow attempt at quantifying wide-spread industry adoption scenarios was probably beyond the amount of time you could dedicate to this post.&nbsp;&nbsp;</p><p>That said, I’m not sure this limitation comes through fully in your summary, even after you the updates you added to the top.&nbsp; My biggest concern is that your report might put off potential donors who might assume your assessment more comprehensively covers benefits than it does, and might not have time to fully engage with your methodology or reach the final paragraph.</p><p>If you agree with my assessment, share my concerns, and were open to making changes while fundraising is ongoing, my suggestions would be to be more explicit about the scope limitations of your analysis and how most of the expected value might not be quantified (either by amending the summary or adding an additional update at the top).&nbsp; When describing the factors that might drive donor decisions, I’d personally also add optimism/pessimism about the potential for this project to bring forward widespread adoption by industry, which I see as independent of the factors you’ve already listed.</p><p>If you don’t agree with my assessment about where expected value might come from (e.g. because you think donors purchasing stunners for industry might set a dangerous precedent that might in fact delay adoption), or just happen to be deeply uncertain,&nbsp; I think it would be great for you to articulate this more explicitly.</p><p>Hope you don’t mind me making these suggestions.&nbsp; Really great work again - thank you for putting the time and effort into it.</p>", "parentCommentId": null, "user": {"username": "Sagar K Shah"}}, {"_id": "CMwgstPEYvsMYhPr6", "postedAt": "2023-07-26T23:21:51.869Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks for your comment! I broadly agree with the point you’re making, and have amended the summary to capture it. Let me know if you think the updated wording addresses your concern.</p><p>I did ponder trying to quantify the potential impacts of catalyzing industry-wide change as a result of this pilot, and I just want to lay out a little bit of why I think that’s so hard. It’s very tempting to compute a massive EV for this by doing a calculation like (small chance that this brings industry-wide adoption forward n years) * (400 billion shrimp farmed/year) = giant number. But I think that’s probably a bad way to look at it. I think the better way to think of it is that industry-wide adoption would take a successful pilot plus other forms of activism like corporate campaigns, ballot initiatives, or legislative lobbying. So the pilot alone isn’t necessarily bringing forward broader adoption, but rather creating new potentially cost-effective opportunities for donations. The exact EV would therefore depend on questions like the relative cost-effectiveness of those new donation opportunities compared to the existing animal welfare portfolio, and on how funding constrained the animal welfare space is expected to be over the next several years.</p><p>None of this is to say that I disagree with your point, just that I’m quite uncertain about the indirect cost effectiveness and would struggle to find a way to easily model it.</p>", "parentCommentId": "JhARr4scH674W3pQe", "user": {"username": "MHR"}}, {"_id": "32DFTgvnvcrx4Eg2W", "postedAt": "2023-07-28T11:35:05.637Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>I think the edits you made to the summary work very well in making it clear what the quantitative analysis does and doesn't cover! &nbsp;Thank you for taking on board my comments so promptly.</p><p>Fully agree with your points on the difficulty of quantifying the indirect benefits, and also how/where those benefits should be attributed. &nbsp;&nbsp;<br><br>I think the challenge is that excluding indirect benefits from a quantitative analysis effectively assigns them a zero value. That is ok when indirect benefits are most likely only a small fraction of the direct benefits. &nbsp;But it becomes problematic when the indirect benefits could plausibly be several times (or orders of magnitude) larger than the direct ones and relevant to decision-making.<br><br>If judgements about the size of the indirect benefits might be important, think it is valuable to make the exclusions clear - as you've now done!</p><p>Thanks again for the time you put into the piece, and the clear write-up / reasoning transparency!</p>", "parentCommentId": "CMwgstPEYvsMYhPr6", "user": {"username": "Sagar K Shah"}}, {"_id": "b6wuf8E8NRkiKd6MJ", "postedAt": "2023-09-25T08:22:33.622Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>Thanks very much for this write-up MHR! We’ve recently published a “<a href=\"https://forum.effectivealtruism.org/posts/Qo3559TqP5BzoQyWX/two-years-of-shrimp-welfare-project-insights-and-impact-from\">two-year update</a>” post on the Forum, and wanted to reflect on some considerations we think most likely affect the Cost-Effectiveness of this project. Rather than including the below in that post, we thought it made sense to continue the discussion that had already started here.</p><ul><li>Considerations around the&nbsp;<strong>“</strong><a href=\"https://welfarefootprint.org/research-projects/pain-tracks/\"><strong><u>Pain-Track</u></strong></a><strong>” for this intervention</strong>, for example:<ul><li>The intervention targets acute rather than chronic suffering. In some Pain-Tracks,&nbsp;<strong>Time spent suffering can overwhelmingly dominate the calculation of suffering</strong> (though this also depends on the relative intensity of the chronic suffering compared to the acute suffering).</li><li>Similarly, how you weigh the relative suffering of Annoying, Hurtful, Disabling, and Excruciating pains can be a deciding factor. It’s possible that these are within orders of magnitude of each other, but it’s also possible to view “Excruciating” pain as being&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/xtcgsLA2G8bn8vj99/reminding-myself-just-how-awful-pain-can-get-plus-an#Question_3__How_does_intense_pain_compare_morally_to_mild_pain_\"><u>infinitely worse</u></a> than other types of pain (and similarly to Time as a factor,<strong> if Excruciating pain is weighted high enough, then any time in this state can end up dominating the overall calculation</strong> for the Pain-Track).</li></ul></li><li>The relative&nbsp;<a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw/p/tnSg6o7crcHFLc395\"><u>welfare range</u></a> of shrimps - in particular,&nbsp;<strong>whether the undiluted experience model of welfare is correct or not</strong> - is another consideration that can dominate cost-effectiveness calculations (largely because the number of shrimps&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/Fhoq7tP9LYPqaJDxx/shrimp-the-animals-most-commonly-used-and-killed-for-food\"><u>used and killed for food</u></a> is so large),</li><li>The&nbsp;<strong>likelihood that we accelerate the adoption of humane slaughter practices</strong> - both in terms of the shorter term goal of producers buying further stunners themselves, and the longer-term goal of electrical stunning becoming the norm in the industry.<ul><li>For example, we have one producer who is committed to stunning 100M shrimps, which represents 8% of their shrimps. If the “pilot” is successful, they will likely buy further stunners to stun most (if not all) of their shrimps. This would mean our investment of $65,000 would be the first domino leading to ~1.25B shrimps being stunned per year.</li><li>Additionally, once a buyer has seen that it’s possible for their suppliers to implement stunners, they can be empowered to require that all of their suppliers stun their shrimps (or otherwise source from suppliers who already stun).</li><li>Finally, many certifiers/policymakers are unwilling to require the industry to do things until it has been relatively established. We’re unsure what the timelines of work like this might be, but believe that by counterfactually introducing stunners to the industry earlier than they would have been, it could lead to widespread adoption being accelerated by a number of years.</li></ul></li><li><strong>Any potential “impact ceiling” we might hit with buying stunners</strong> - if the pool of producers large enough to stun a minimum of 100M shrimps and willing to take up our offer of a stunner is smaller than we currently estimate, then this could limit the potential scale of impact. Likewise, the potential pool could be larger than we realise, for example, we may find a number of smaller producers who want to take a stunner but can’t commit to 100M shrimps, in which case we could offer to pro-rata our contribution, and work with a larger pool of producers at a similar cost-effectiveness.</li><li>Finally, we see hard-to-quantify value in&nbsp;<strong>whether this intervention helps to diversify interventions in the animal welfare space</strong>. Both the decision to focus on shrimps, and to purchase equipment for the industry, are both somewhat novel “bets” that seem to have paid off. We hope that this is encouraging for the movement more broadly to continue to invest in exploratory work in the space.</li></ul>", "parentCommentId": null, "user": {"username": "AaronBoddy"}}, {"_id": "Z273PbkkScZWYbgu6", "postedAt": "2023-10-24T10:14:26.859Z", "postId": "CmAexqqvnRLcBojpB", "htmlBody": "<p>TL;DR: <strong>I think donations to SWP may be in the conversation for the single most cost-effective opportunity available to humanity.</strong></p><p>&nbsp;</p><p>Just saw this comment by chance when doing some of my usual late-night reading about shrimp welfare, and thought I'd reply because somebody mentioned me on the internet!</p><p>I've thought about this specific question (weightings between the different pain categories) at length, and there's quite a bit of uncertainty as with any esoteric area of philosophy. I don't put that much weight on my own experience that Michael described (as these decisions are too important to rely on my own experiences). I know a few people are thinking about this, so I've seen what various people have written about this; a small amount of academic research; some informal surveys; and a fair amount of philosophy. I think that any discussion of this topic needs to acknowledge this uncertainty. I think in a couple of years, we'll be in a much more informed position about the trade-offs between pain categories, perhaps with the exception of excruciating pain.</p><p>I've also given shrimp welfare and shrimp stunning some detailed thought (and my colleagues will know just how critical and conservative I am when conducting research!).</p><p>That said:</p><ul><li>I agree that 6.67x (disabling:hurtful) and 5x (excruciating:disabling) are conservative.</li><li>In my work, I use many sets of weightings, and I assign a rough probability to each one. The weighted mean is quite close to those above numbers. But averages obscure, which is why I use a set of weightings to arrive at a more informed judgement about any particular decision.</li><li>I think there's a &gt;30% chance that disabling:hurtful is above 15x (rather than 6.67x) and that excruciating:disabling is above 100x (rather than 5x). I also think the idea that excruciating is infinitely worse should be taken seriously.</li></ul><p>Overall, given this thinking as well as my own detailed research into various aspects of the animal advocacy movement, <strong>I think donations to SWP may be in the conversation for the single most cost-effective opportunity available to humanity</strong> today, possibly ever (subject to usual moral uncertainty stuff around the big worldview questions, of course). Some healthy uncertainty around the pain weightings doesn't change that.</p><p>Also, might be worth saying that if anybody strongly disagrees with this claim, I'd be keen to collaborate on a cost-effectiveness analysis of SWP and some other highly cost-effective opportunity (especially outside of the animal space) to see where the cruxes are.</p>", "parentCommentId": "xpLE5HjMYyARwxJks", "user": {"username": "Ren Springlea"}}]