[{"_id": "sennPzNECd7jKBYJX", "postedAt": "2023-03-15T22:03:17.277Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>AFAIK this is not something that can be shared publicly.&nbsp;</p>", "parentCommentId": null, "user": {"username": "oh54321"}}, {"_id": "JY4MpMabnqvMLCFyN", "postedAt": "2023-03-15T22:04:28.171Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>Source is that I remember Ajeya mentioning at one point that it led to positive changes and she doesn't think it was a bad decision in retrospect, but cannot get into said changes for NDA reasons.&nbsp;</p>", "parentCommentId": "sennPzNECd7jKBYJX", "user": {"username": "oh54321"}}, {"_id": "weGE4nvBvXW8hXCuM", "postedAt": "2023-03-15T22:21:16.267Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>I'm not sure what can be shared publicly for legal reasons, but would note that it's pretty tough in board dynamics generally to clearly establish counterfactual influence. At a high level, Holden was holding space for safety and governance concerns and encouraging the rest of the leadership to spend time and energy thinking about them.<br><br>I believe the implicit premise of the question is something like \"do those benefits outweigh the potential harms of the grant.\" Personally, I see this as a misunderstanding, i.e. that OP helped OpenAI to come into existence and it might not have happened otherwise. I've gone back and looked at some of comms around the time (2016) as well as debriefed with Holden and I think the most likely counterfactual is that the time to the next fundraising (2019) and creation of the for-profit entity would have been shortened (due to less financial runway). Another possibility is that the other funders from the first round would have made larger commitments. I give effectively 0% of the probability mass to OpenAI not starting up.</p>", "parentCommentId": null, "user": {"username": "Dustin Moskovitz"}}, {"_id": "WukYJrTKMJGeY358F", "postedAt": "2023-03-15T23:01:46.822Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<blockquote><p>Personally, I see this as a misunderstanding, i.e. that OP helped OpenAI to come into existence and it might not have happened otherwise.</p></blockquote><p>I think some people have this misunderstanding, and I think it's useful to address it.</p><p>With that in mind, much of the time, I don't think people who are saying \"do those benefits outweigh the potential harms\" are assuming that the counterfactual was \"no OpenAI.\" I think they're assuming the counterfactual is something like \"OpenAI has less money, or has to take somewhat less favorable deals with investors, or has to do something that it thought would be less desirable than 'selling' a board seat to Open Phil.\"</p><p>(I don't consider myself to have strong takes on this debate, and I think there are lots of details I'm missing. I have spoken to some people who seem invested in this debate, though.)</p><p>My current ITT of a reasonable person who thinks the harms outweighed the benefits says something like this: \"OP's investment seems likely to have accelerated OpenAI's progress and affected the overall rate of AI progress. If OP had not invested, OpenAI likely would have had to do something else that was worse for them (from a fundraising perspective) which could have slowed down OpenAI and thus slowed down overall AI progress.\"</p><p>Perhaps this view is mistaken (e.g., maybe OpenAI would have just fundraised sooner and started the for-profit entity sooner). But (at first glance), giving up a board seat seems pretty costly, which makes me wonder why OpenAI would choose to give up the board seat if they had some less costly alternatives.</p><p>(I also find it plausible that the benefits outweighed the costs, though my ITT of a reasonable person on the other side says something like \"what were the benefits? Are there any clear wins that are sharable?\")</p>", "parentCommentId": "weGE4nvBvXW8hXCuM", "user": {"username": "Akash"}}, {"_id": "8HuYKaXzesF3ihES9", "postedAt": "2023-03-15T23:39:02.658Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>Unless it's a hostile situation (as might happen with public cos/activist investors), I don't think it's actually that costly. At seed stage, it's just kind of normal to give board seats to major “investors”, and you want to have a good relationship with both your major investors and your board.<br><br>The attitude Sam had at the time was less \"please make this grant so that we don't have to take a bad deal somewhere else, and we're willing to 'sell' you a board seat to close the deal\" and more \"hey would you like to join in on this? we'd love to have you. no worries if not.\"</p>", "parentCommentId": "WukYJrTKMJGeY358F", "user": {"username": "Dustin Moskovitz"}}, {"_id": "tsWJCSyxXaHk2cS7n", "postedAt": "2023-03-16T00:21:31.659Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>Thanks for this context. Is it reasonable to infer that you think that OpenAI would've got a roughly-equally-desirable investment if OP had not invested? (Such that the OP investment had basically no effect on acceleration?)</p>", "parentCommentId": "8HuYKaXzesF3ihES9", "user": {"username": "Akash"}}, {"_id": "PgBG6nYpiddvKPW92", "postedAt": "2023-03-16T01:01:10.648Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>Yes that’s my position. My hope is we actually slowed acceleration by participating but I’m quite skeptical of the view that we added to it.</p>\n", "parentCommentId": "tsWJCSyxXaHk2cS7n", "user": {"username": "Dustin Moskovitz"}}, {"_id": "kmqmi5G6kASKQkoBq", "postedAt": "2023-03-16T14:03:04.535Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<blockquote>\n<p>I give effectively 0% of the probability mass to OpenAI not starting up.</p>\n</blockquote>\n<p>I think an important question here is whether OpenAI would have reached a <strong>critical level of success</strong> that is necessary for, say, convincing Microsoft to throw $1B at them—before exhausting their runway—if OpenPhil had not recommended the $30M <a href=\"https://www.openphilanthropy.org/grants/openai-general-support/\">grant</a> in 2017.</p>\n<blockquote>\n<p>[...] I think the most likely counterfactual is that the time to the next fundraising (2019) and creation of the for-profit entity would have been shortened (due to less financial runway).</p>\n</blockquote>\n<p>This seems reasonable. On the other hand, if OpenAI had not reached a critical level of success as a non-profit org, I think it is not obvious that their for-profit spinoff would have succeeded in raising investments that are sufficient to get them to a critical level of success. They would have probably needed to compete with many other for-profit AI startups for investments.</p>\n", "parentCommentId": "weGE4nvBvXW8hXCuM", "user": {"username": "ofer"}}, {"_id": "Hkhnogik3Qk9pbXrq", "postedAt": "2023-03-16T16:22:09.427Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>Thanks! I found this context useful.&nbsp;</p>", "parentCommentId": "PgBG6nYpiddvKPW92", "user": {"username": "Akash"}}, {"_id": "YXm7gJLWkhT45fFBY", "postedAt": "2023-03-16T18:43:02.292Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>Why do you believe that’s binary? (Vs just less funding/smaller valuation at the first round)</p>\n", "parentCommentId": "kmqmi5G6kASKQkoBq", "user": {"username": "Dustin Moskovitz"}}, {"_id": "FWEkJFPYjix3oktRz", "postedAt": "2023-03-16T21:16:02.535Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>I think this type of ML research (i.e. trying to train groundbreaking neural networks) is pretty messy and unpredictable; and money and luck are fungible to some extent. It's not like back in 2017 OpenAI's researchers could perfectly predict which ML experiments would succeed, and how to turn $X of GPU hours into an impressive model that would allow them to raise &gt;$X in the next round, with probability 1.</p>\n<p>For example, suppose OpenAI's researchers ran some expensive experiment in 2017, and did not get impressive results. They then need to decide whether to give up on that particular approach, or just tweak some hyperparameters and run another such experiment. The amount of remaining funding they have at that point may determine their decision.</p>\n", "parentCommentId": "YXm7gJLWkhT45fFBY", "user": {"username": "ofer"}}, {"_id": "ZcsLcWXBvw5KgYhJg", "postedAt": "2023-03-16T22:36:54.392Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>Again, why does it have to be X=$1B and probability 1?<br><br>It seems like if the $30M mattered, then the counterfactual is that they needed to be able to raise $30M at the end of their runway, at any valuation, rather than $1B, in order to bridge to the more impressive model. There should be a sizeable gap in what constitutes a sufficiently impressive model between those scenarios. In theory they also had \"up to $1B\" in grants from their original funders, including Elon, that should have been possible to draw on if needed.<br><br>How did you come to the conclusion that funding ML research is \"pretty messy and unpredictable\"? I've seen many ML companies funded over the years as straightforwardly as other tech startups, esp. if they had great professional backgrounds as was clearly the case with OAI. Seems like an unnecessary assumption on top of other unnecessary assumptions.</p>", "parentCommentId": "FWEkJFPYjix3oktRz", "user": {"username": "Dustin Moskovitz"}}, {"_id": "g94bXp9DphwTLGaN3", "postedAt": "2023-03-17T00:51:34.149Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<blockquote>\n<p>How did you come to the conclusion that funding ML research is \"pretty messy and unpredictable\"? I've seen many ML companies funded over the years as straightforwardly as other tech startups, […]</p>\n</blockquote>\n<p>I think it's important to distinguish here between companies that intend to use existing state-of-the-art ML approaches (where the innovation is in the product side of things) and companies that intend to advance the state-of-the-art in ML. I'm only claiming that research that aims to advance the state-of-the-art in ML is messy and unpredictable.</p>\n<p>To illustrate my point: If we use an extreme version of the messy-and-unpredictable view, we can imagine that OpenAI's research was like repeatedly drawing balls from an urn, where drawing each ball costs $1M and there is a 1% chance (or whatever) to draw a Winning Ball (that is analogous to getting a super impressive ML model). The more funding OpenAI has the more balls they can draw, and thus the more likely they are to draw a Winning Ball. Giving OpenAI $30M increases their chance to draw a Winning Ball; though that increase must be small if they have access to much more funding than $30M (without a super impressive ML model).</p>\n", "parentCommentId": "ZcsLcWXBvw5KgYhJg", "user": {"username": "ofer"}}, {"_id": "z7wH9JGpenuAdfyTi", "postedAt": "2023-03-18T13:10:44.193Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": "<p>I understood what you meant before, but still see it as a bad analogy.</p>\n<p>For context I saw many rounds of funding as a board member at Vicarious which was a pure lab for most of its life (and then later attempted robotics but that small revenue actually devalued it in the eyes of investors). There, what it took was someone getting excited about the story and smaller performance milestones along the way.</p>\n", "parentCommentId": "g94bXp9DphwTLGaN3", "user": {"username": "Dustin Moskovitz"}}, {"_id": "8M8KSPifXnQCuPTfy", "postedAt": "2023-03-15T23:01:09.349Z", "postId": "CmZhcEpz7zBTGhksf", "htmlBody": null, "parentCommentId": "weGE4nvBvXW8hXCuM", "user": null}]