[{"_id": "iQsDf7xMbKawodJQu", "postedAt": "2017-06-01T00:01:06.093Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>Thanks for this. I think I strongly agree with what you've said. I've often noticed/got the impression that lots of EAs seem to be quite interested in pursuing their own projects and don't help each other very much. I worry this results in an altruistic tragedy of the commons problem; it would be better if people helped each other, but instead we chose to do our own good in our own way, resulting in less good done overall. Now I think of it, I've probably done this myself.</p>\n<p>The real challenge, as you noted, is the following:</p>\n<blockquote>\n<p>Being considerate often makes others happier to interact with you. That is normally good, but in some circumstances may not be desirable. If people find you extremely helpful when they ask you about frivolous matters, they will be incentivized to keep asking you about such matters. If you would prefer them not to, you should not be quite so helpful.</p>\n</blockquote>\n<p>This seems to be quite a common problem, at least in academia. VIPs (very important people) will often deliberately make themselves unavailable so they have time for their own projects. Presumably, this has some reciprocal costs to the VIP too: if they <strong>had</strong> helped you, you would be more inclined to help them in future.</p>\n<p>Relatedly, suppose people accept more considerate norms and so are reluctant to bother some VIP in case it's annoying to the VIP. We can imagine this backfiring. Take an extreme scenario where considerate people dont ask VIPs (or indeed anyone) else for help. This means people don't get help from the VIPs, and VIPs only get requests from inconsiderate people. Presuming these VIPs do grant some requests for help and the requests from considerate people would have done more good, this is now a worse situation overall. Extreme considerateness, call it 'meekness', seems bad.</p>\n<p>It strikes me that it would be important to develop some community norms for navigating this difficulty. Perhaps people asking for help should be encouraged to do so, ask once or twice and leave the other person plenty of room to turn the request down. Perhaps receipients of requests should make a habit of replying to them but being polite and honest about their current capacity to help.</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "SwqggAurSxSZy8Mkm", "postedAt": "2017-06-01T08:55:49.570Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>If there was any community that it might apply to, it's probably effective altruists.</p>\n", "parentCommentId": "n9hzorJTQTMjHhJ6E", "user": {"username": "DavidNash"}}, {"_id": "dgeG7Kjawzsb8duJB", "postedAt": "2017-06-01T09:18:22.458Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>I think you're right that there's a failure mode of not asking people for things. I don't think that not-asking is in general the more considerate action, though -- often people would prefer to be given the opportunity to help (particularly if it feels like an opportunity rather than a demand). </p>\n<p>I suppose the general point is: avoid the trap of overly-narrow interpretations of considerateness (just like it was good to avoid the trap of overly-narrow interpretations of consequences of actions). </p>\n", "parentCommentId": "iQsDf7xMbKawodJQu", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "9c7yu5FozEg2btKK8", "postedAt": "2017-06-01T10:23:06.287Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>I agree. In which case it's possibly worth pointing out one part of considerateness is giving people the opportunity to help you, which they may well want to do anyway.</p>\n", "parentCommentId": "dgeG7Kjawzsb8duJB", "user": {"username": "MichaelPlant"}}, {"_id": "WjYgqKYLHjRHbtgp9", "postedAt": "2017-06-01T17:46:54.461Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>Brief note: one important norm of considerateness which it is easy to neglect is not talking about people behind their back. I think there are strong consequentialist reasons not to do this: it makes you feel bad, it's hard to remain authentic when you next see that person, it makes others think a lot less of you</p>\n", "parentCommentId": null, "user": null}, {"_id": "G6P7FZwEh8BcdXA4Q", "postedAt": "2017-06-01T22:21:00.526Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>Not as pithy, but just a flag that I think the question implicitly raised by Tom's comment and the answer in David's are pretty important. This <em>is</em> a community which is willing to update actions based on theoretical arguments about what's important. Of course I don't expect an article to totally change people's beliefs -- let alone behaviours -- but if it has a fraction of that effect I'd count it as cheap.</p>\n", "parentCommentId": "SwqggAurSxSZy8Mkm", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "Nzua94i47Sde6CsZd", "postedAt": "2017-06-01T23:28:11.078Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>I doubt it'll have much direct effect on friendliness, but it might convince people to work harder on concrete projects to improve the community.</p>\n", "parentCommentId": "n9hzorJTQTMjHhJ6E", "user": {"username": "casebash"}}, {"_id": "B3fhZxAuixMjwGQ3t", "postedAt": "2017-06-01T23:49:03.804Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>One issue not addressed is the potential of weaponised requests for niceness (I have kept this post purposefully abstract).</p>\n<ul>\n<li>Often these will involve defecting from certain niceness norms, whilst justifying it (implicitly or explicitly) by the pursuit of other niceness norms. One example would be aggressively attacking other members of the community for relatively minor mistakes. Another example would be people threatening to the leave the community unless they get their way in this particular issue for things that are relatively minor. These people may not actually be involved with the community to any significant degree in the first place. And obviously, anyone can leave for anyone reason, no matter how trivial, it's just when someone is trumpeting it loudly without good cause we should be careful not to pay too much attention and hence incentivise such behaviour.</li>\n<li>On the other hand, people may have valid critiques, even if they aren't going about making them in the best way. I think the guide here is to look at how willing the person is to engage in conversation. If someone does not want to engage in collaborative discussion there is no point unless they are particularly insightful.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "hCh9CneBx6zo4rGBi", "postedAt": "2017-06-02T12:22:43.665Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>I'm not sure I agree. There's an argument that gossip is potentially useful. Here's a quote from <a href=\"http://www.sciencedirect.com/science/article/pii/S0378873311000700\">this paper</a>:</p>\n<blockquote>\n<p>Gossip also has implications for the overall functioning of the group in which individuals are embedded. For example, despite its harmful consequences for individuals, negative gossip might have beneficial consequences for group outcomes. Empirical studies have shown that negative gossip is used to socially control and sanction uncooperative behavior within groups (De Pinninck et al., 2008; Elias and Scotson, 1965 ;  Merry, 1984). Individuals often cooperate and comply with group norms simply because they fear reputation-damaging gossip and subsequent ostracism</p>\n</blockquote>\n", "parentCommentId": "WjYgqKYLHjRHbtgp9", "user": {"username": "MichaelPlant"}}, {"_id": "RLaqiYwb5RnXXPwfx", "postedAt": "2017-06-02T12:37:46.556Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>I can't access the linked to studies. Even if true, this only justifies talking behind people's backs as a sanction for uncooperative behaviour. And I suspect that there are much better ways to sanction uncooperative behaviour.</p>\n", "parentCommentId": "hCh9CneBx6zo4rGBi", "user": null}, {"_id": "84AMfXHD33rHp5AbY", "postedAt": "2017-06-02T16:10:13.477Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>I believe in respecting people who are respectable and care about others, like Gleb Tsipursky, and standing up to frauds. Very few people in your EA movement are sincere. Most are atheist extremists hijacking EA to advance their religion, which often includes the murder of all life on Earth. CEA is in the latter group because it promotes and financial supports these atheist terrorism cells (ie. “Effective Altruism Foundation”). </p>\n<p>CEA isn't being very considerate when they promote killing everyone. In fact, I would say that is decidedly INconsiderate! Couldn't help but notice that “genocide” is not on your list of considerate behaviours. You sickos consider that an act of altruism. </p>\n<p>I, for one, am okay if “EAs” don't want to work with me. Knowing that they want to kill as much as possible, I would be happy if I never met one!</p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "Qu6qC8J496pkF8F5p", "postedAt": "2017-06-03T18:17:31.197Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>Who hurt you?</p>\n", "parentCommentId": "84AMfXHD33rHp5AbY", "user": {"username": "Zeke_Sherman"}}, {"_id": "Z9FmpLFWGCoQaZRaL", "postedAt": "2017-06-05T13:01:11.402Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>I never really understood this concept. It seems to me a helpful process to be able to discuss disagreements you are having with other people, and some interpret this as talking behind the original person's back. Clearly spreading false rumors is harmful. But are there other aspects that are objectionable like telling more people than necessary about the disagreement?</p>\n", "parentCommentId": "RLaqiYwb5RnXXPwfx", "user": {"username": "Denkenberger"}}, {"_id": "eWrTFquYmevxYAMTm", "postedAt": "2017-06-05T13:03:54.679Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>Nice article. When you say &quot;published&quot; do you mean submitted to a journal?</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "mqkZfb6tRztfMJNjk", "postedAt": "2017-06-11T20:29:45.436Z", "postId": "Cn3dAZhtqeBXYmQvF", "htmlBody": "<p>With all the talk of &quot;societal social capital&quot;, it's interesting to consider groups like the <a href=\"https://www.youtube.com/watch?v=e7yES9b5NlI\">Make a Wish Foundation</a> that EA has historically dismissed.  It seems plausible to me that improving societal social capital is a really hard problem and the Make a Wish Foundation accomplishes it in a relatively cost-effective way.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}]