[{"_id": "7wFK3rm4pzkHavaSR", "postedAt": "2024-03-18T14:16:43.875Z", "postId": "Cn8GZETFsNJZE6Pvh", "htmlBody": "<p>Hi. Thanks for sharing the model.&nbsp;I’d like to question&nbsp;you putting 32.5% weight on the scale, which you define as “Number of land animals projected to be farmed in 2050 under business-as-usual conditions”. The value of this variable depends on:</p><ol><li>Current human population</li><li>Expected growth in the human population</li><li>Current animal production per capita</li><li>Expected change in the production per capita</li></ol><p>I think that the 2, 3, and 4 are relevant and should be in the metric. But of these four, I’d bet it depends on the 1 (current human population) by far the most. No matter the growth, Djibouti (pop 1.1 million) will not farm more animals than Nigeria (pop 213 million). But I’m unsure if that provides evidence that the marginal dollar would go further in supporting animal advocacy in Nigeria.</p><p>Uh, I know embarrassingly little about the geopolitical situation in Africa. I’ll just say that I saw this type of metric being used to prioritise animal advocacy work in the U.S. over the work in Poland because U.S. is bigger. But federal legislation in the U.S. is very unlikely, so any work in the U.S. will focus on a particular state, which might be smaller than Poland. If that state somehow becomes an independent country (or EU becomes one country), suddenly the comparisons shift to favour Poland. But it’s unclear whether such administrative changes would actually impact how many animals would be helped by charities in either country.</p><p>There is an implicit assumption that we would achieve more if we spent $10 million on a big country like Nigeria, rather than if we dispersed this $10 million among 10 smaller countries which combined might be as big as Nigeria. It’s unclear whether this is the case even for country-wide interventions. It’s possible that lobbying bigger government bodies is more cost-effective. But is it? I just honestly don’t know. And also Nigeria likely has bigger corporations than Djibouti, and corporate campaigns against bigger corporations could be more cost-effective. But I haven’t seen this shown anywhere either. It’s also possible that campaigns against medium-sized corporations and governments are more cost-effective. AFAIK, we just don’t know. And for some other interventions, like working with farmers to achieve win-win reforms (in the style of Fish Welfare Initiative), it might not matter whether the farmer is in a big or small country.</p><p>Sorry for the longwinded comment, I didn’t want to spend much time tidying it up, and thanks for your work :)</p>", "parentCommentId": null, "user": {"username": "saulius"}}, {"_id": "3uJCekdJhZN6rfet7", "postedAt": "2024-03-18T14:46:03.209Z", "postId": "Cn8GZETFsNJZE6Pvh", "htmlBody": "<p>Thanks for your comment! And no worries about not polishing, I will do the same, so it will also be a bit long :)</p><p>I agree with your concern and it is something I've also thought about before (in other contexts as well). However, I see two reasons for why working in high-population countries should indeed be favoured:</p><ol><li>At Animal Advocacy Africa we're currently working on recommendations and implementation guides for advocates that aim to mitigate the rise of industrial animal agriculture in Africa. Based on our research, policy work is the top recommendation and I do think the expected value of this is higher in high-population countries. The reason is that it is hard to know where policy work is more likely to be successful (which you also mentioned). As long as we don't have an indication that it is significantly less likely to be successful in higher-population countries, it seems fair to focus on the factor that we know will be important: the expected impact, if successful.</li><li>For work besides the area of policy/regulations (e.g. working with farmers or certain public outreach interventions, which are our recommendations #2 and #3), I agree that scale considerations can be overblown. If we cannot cover the whole population anyway, there is no limit that should really matter. However, I think scalability and potential flow-through effects are important to consider here. If we can get a successful model to work for some part of a large country, there is the potential to scale this much further or to have it scale automatically across the country (e.g. word of mouth).</li></ol><p>In short, there is a lot of upside to working in such large countries and as long as I don't have evidence that working in smaller countries is much more tractable I would keep focusing on the large ones. However, if there is clear evidence that working in a specific country is likely to be significantly more tractable, we should give this consideration a lot of weight. Unfortunately our rough model is not well-suited for such nuances, so it should definitely be combined with contextual knowledge/factors.</p><p>That said, I think it is a good point that the weight might be too high and these weights are mostly based on our intuitions anyway. So it's great that you are challenging this. I think it would probably be fruitful to do some kind of MC simulation on how the scores change if we vary the weights of different parameters. Maybe I'll find time for this somewhere down the road.</p>", "parentCommentId": "7wFK3rm4pzkHavaSR", "user": {"username": "moritz-stumpe"}}, {"_id": "ea7FZ54e8CzdxJrBX", "postedAt": "2024-03-22T12:45:18.384Z", "postId": "Cn8GZETFsNJZE6Pvh", "htmlBody": "<p>Thank you for your thoughtful reply. Some thoughts.</p><blockquote><p>&nbsp;As long as we don't have an indication that it is significantly less likely to be successful in higher-population countries, it seems fair to focus on the factor that we know will be important: the expected impact, if successful.</p></blockquote><p>Lobbying smaller bodies of government is definitely easier. Whoever decides on policies in small countries has fewer bids of attention and is targeted by fewer lobbyists. You might need a lot of connections and effort to make your voice heard to a decision-maker in a big body of government. In a&nbsp; small body of government, you might be able to set up a meeting by writing an email without any prior connection. There’s definitely a trade-off of scale vs tractability here. And to me, it’s not obvious at all which choice would be more cost-effecitve. I'm not talking from experience here, it's just my common sense intuitions.</p><blockquote><p>&nbsp;If we can get a successful model to work for some part of a large country, there is the potential to scale this much further or to have it scale automatically across the country (e.g. word of mouth).</p></blockquote><p>I agree that country borders impact word of mouth but I’m not sure how much. Especially in Africa since I’ve heard that African borders were drawn kind of randomly and I don’t know how important they are culturally. For example, if I look at Africa language map like&nbsp;<a href=\"https://www.reddit.com/r/MapPorn/comments/dbuw38/the_spoken_languages_of_africa/\"><u>this</u></a>, I see that bigger countries have many languages. Language barriers might limit the meme spread within the country. And it also seems that languages often cross national boundaries,&nbsp; Meme spread through internet content, TV, and radio might often transcend national boundaries, I imagine. But I don’t know how much, I know little about Africa.</p><p>It’s just food for thought, I think your view is reasonable and you probably have already thought about these things. You could just reduce the weight of the variable a little bit if I convinced you a little bit :)</p>", "parentCommentId": "3uJCekdJhZN6rfet7", "user": {"username": "saulius"}}, {"_id": "acYXreSrZirJd9qkz", "postedAt": "2024-03-25T21:54:39.484Z", "postId": "Cn8GZETFsNJZE6Pvh", "htmlBody": "<p>Yes, this has certainly updated my view on prioritisation between big and small countries. So thanks for sharing your thoughts!</p><p>I think it's a good idea to reduce the weight of scale, though probably not as much as you might. Aashish and I might update this as soon as we got around to talking about it and are aligned.</p><p>In any case, we encourage people to just take the model, make a copy, and change parameters themselves, if it seems useful for their purposes.</p>", "parentCommentId": "ea7FZ54e8CzdxJrBX", "user": {"username": "moritz-stumpe"}}, {"_id": "uh7dQPaAMXX5nyfki", "postedAt": "2024-03-26T08:45:51.037Z", "postId": "Cn8GZETFsNJZE6Pvh", "htmlBody": "<p>Nice ^_^ One final thought. I mentioned that scale depends on multiple parameters:</p><ol><li>Current human population</li><li>Expected growth in the human population</li><li>Current animal production per capita</li><li>Expected change in the production per capita</li></ol><p>You account for 2,3, and 4 with a separate variable “expected growth in animal production” which would be something like “projected number of farmed animals in 2050 divided by the current number of farmed animals”. And then also have a variable “Current human population”. I think it makes sense to split because these two variables matter for different reasons, and someone may put weight on one but not the other.</p>", "parentCommentId": "acYXreSrZirJd9qkz", "user": {"username": "saulius"}}]