[{"_id": "uLWx7a77HWSj2AP7p", "postedAt": "2017-08-21T22:22:33.674Z", "postId": "Co9wY9E4NykXZWguj", "htmlBody": "<p>This is a great series. I'm not persuaded about the neglectedness, though. I do believe there are few organizations working on drug reform across the board, but it does seem plausible to say that (a) legalizing marijuana is an effective first step to broader drug reform and (b) marijuana legalization is not neglected, as there is enough force behind it to have successfully won ballot measures across the United States as well as support from many leading national politicians. What do you think of the push to legalize marijuana on this front?</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "fKdfxYrgpRnnDukmk", "postedAt": "2017-08-23T06:50:43.711Z", "postId": "Co9wY9E4NykXZWguj", "htmlBody": "<blockquote>\n<p>The reason no (serious) politician will endorse DPR is because the public are against it.</p>\n</blockquote>\n<p>How do you know? Why should your audience believe that you understand the motivations of the relevant politicians?</p>\n<p>In the UK a plurality even supports decriminalization of cannabis.</p>\n<blockquote>\n<p>Certainly, I think the argument we should make it easier to for doctors to do research into drugs just to see if they can help miserable people, but we that shouldn’t change the law and make it any easier for the public to gain access to drugs, seems pretty hard to object to. That’s seems the least controversial, but not the most impactful, line to take.</p>\n</blockquote>\n<p>It seems to me that you ignore the politics of the situation. Mental health policy is largely driven by Big Pharma and their agenda.\nYou want to change the policies for mental health drugs in a way that leads to the perscription of unpatented drugs in cases where Big Pharma currently makes money with their patented drugs.</p>\n", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "qLtKMXfQGBdKgaTPy", "postedAt": "2017-08-23T07:10:45.483Z", "postId": "Co9wY9E4NykXZWguj", "htmlBody": "<blockquote>\n<p>We could talk to campaigners, both those campaigning directly for drug reform in particular, as well as for other issues (outsiders might engage less in wishful thinking) and ask them how much money they think they would need to be 10%, 50% and 100% confident they could organise enough people to change policy. </p>\n</blockquote>\n<p>I'm not sure that's are particularly meaningful question. Drug-policy changes regularly. </p>\n<p>Germany ended up with 1P-LSD being legal which is an LSD analoge that's believed to have the same effects as LSD without anybody passing a law.\nIt's legality also rests on it being a substance that doesn't have medical applications.</p>\n", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "256QDbDkvg2cALice", "postedAt": "2017-08-23T12:51:47.155Z", "postId": "Co9wY9E4NykXZWguj", "htmlBody": "<p>thanks</p>\n", "parentCommentId": null, "user": {"username": "maxbale"}}, {"_id": "PPhcDDftLb8FyLseB", "postedAt": "2017-08-23T15:55:50.082Z", "postId": "Co9wY9E4NykXZWguj", "htmlBody": "<p>Well, in which case we could ask more specific questions about different types of drugs and policies.</p>\n", "parentCommentId": "qLtKMXfQGBdKgaTPy", "user": {"username": "MichaelPlant"}}, {"_id": "s7aAedPpDthuDTCz8", "postedAt": "2017-08-29T09:47:19.219Z", "postId": "Co9wY9E4NykXZWguj", "htmlBody": "<blockquote>\n<p>How do you know? Why should your audience believe that you understand the motivations of the relevant politicians?</p>\n</blockquote>\n<p>What evidence do you want me to present? Surely you're not asking me to look inside peeople's minds.</p>\n<blockquote>\n<p>It seems to me that you ignore the politics of the situation. Mental health policy is largely driven by Big Pharma and their agenda. You want to change the policies for mental health drugs in a way that leads to the perscription of unpatented drugs in cases where Big Pharma currently makes money with their patented drugs</p>\n</blockquote>\n<p>Because your first comment was so unhelpful, I feel inclined to turn it around on you: how do you know mental health policy is driven by big pharma? You seem to be speaking with a US-centric approach. Even if it's true medical policies are, to some extent, driven by commercial interests this is nevertheless (1) still not totally true in the US and (2) much less true outside it (e.g. the UK). Also, mental health is only one part of DPR.</p>\n", "parentCommentId": "fKdfxYrgpRnnDukmk", "user": {"username": "MichaelPlant"}}]