[{"_id": "yAbQx2xt3YyPH4yjR", "postedAt": "2017-12-20T21:35:35.528Z", "postId": "CPjJw24azSxaySEzX", "htmlBody": "<blockquote>\n<p>We're on the cusp of being able to maybe buy a permanent venue</p>\n</blockquote>\n<p>Are you mostly searching for venues in the Bay Area (+ venues within day-driving distance of the Bay Area)?</p>\n", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "cEfnWvj6HSvTQw58K", "postedAt": "2017-12-20T21:39:57.332Z", "postId": "CPjJw24azSxaySEzX", "htmlBody": "<p>Ah, just saw this: <a href=\"http://rationality.org/resources/updates/2017/cfar-2017-venue-update\">http://rationality.org/resources/updates/2017/cfar-2017-venue-update</a></p>\n<p>Sweet house.</p>\n", "parentCommentId": "yAbQx2xt3YyPH4yjR", "user": {"username": "Milan_Griffes"}}, {"_id": "FoiXoSAkQqax8dyQr", "postedAt": "2017-12-21T22:53:05.267Z", "postId": "CPjJw24azSxaySEzX", "htmlBody": "<p>Thanks Anna! A couple of questions:</p>\n<ol>\n<li>If I'm understanding your impact report correctly, you identified 159 IEI alumni, and ~22 very high impact alumni whose path was determined to have been &quot;affected&quot; by CFAR.\n1.1 Can you give me an idea of what that implies for the upcoming year? E.g. does that mean that you expect to have another 22 very high impact alumni affected in the next year?\n1.2 Can you say more about what the threshold was for determining whether or not CFAR &quot;affected&quot; an alumnus? Was it just that they said there was some sort of counterfactual impact or was there a stricter criterion?</li>\n<li>You mention reducing the AI talent bottleneck: is this because you think that the number of people you moved into AI careers is a useful proxy for your ability to teach attendees rationality techniques, or because you think this is/should be the terminal goal of CFAR? (I assume the answer is that you think both are valuable, but I'm trying to get a sense for the relative weighting.)</li>\n<li>Do you have &quot;targets&quot; for 2018 impact metrics? Specifically: you mentioned that you think your good done is linear in donations: could you tell us what the formula is? \n3.1 Or more generally: could you give us some insight into the value of information we could expect to see from a donation? E.g. &quot;WAISS workshops will either fail or succeed spectacularly, so it will be useful to run some and see.&quot;</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}]