[{"_id": "8vRzFCKkR5SpkudJv", "postedAt": "2024-03-09T21:27:08.101Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<p>I might be untapped with the latest update here, but did they release the reason behind Altman's firing? I don't think it was ever answered by him in the subsequent interviews. Gradually questions died down or probably dropped from the questioner's list due to a clause, maybe. Now that he is back at the table,<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"39xrbbc0vet\" role=\"doc-noteref\" id=\"fnref39xrbbc0vet\"><sup><a href=\"#fn39xrbbc0vet\">[1]</a></sup></span>I think it has become more urgent to get the original motivations out.</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"39xrbbc0vet\" role=\"doc-endnote\" id=\"fn39xrbbc0vet\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"39xrbbc0vet\"><sup><strong><a href=\"#fnref39xrbbc0vet\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p><a href=\"https://openai.com/blog/openai-announces-new-members-to-board-of-directors\">https://openai.com/blog/openai-announces-new-members-to-board-of-directors</a>&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Mayank Modi"}}, {"_id": "vhZbAaoSiPCe3GhG4", "postedAt": "2024-03-10T07:43:04.169Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<p>No they didn't, and it looks like we aren't going to see the investigation, unless somebody leaks it. But it looks to me that it had something to do with his pattern of manipulative behavior, and allegedly he lied to other board members that McCauley wanted Toner fired (this was stated in the NY Times article on Murati, I think), which sounds like the proximate cause to me.</p>\n<p>But if such behavior came up during the investigation, I'm confused how the investigators could NOT conclude there was good reason for his firing (maybe they're not so independent?) or why the board didn't say something like \"Mr. Altman was attempting to get a board member fired by providing false information\" (too risky for libel?). Maybe he lied to Sutskever or Brockman, and they didn't want to corroborate it? Questions, questions..</p>\n", "parentCommentId": "8vRzFCKkR5SpkudJv", "user": {"username": "SiebeRozendal"}}, {"_id": "hn37oojgQKQCHSMH5", "postedAt": "2024-03-10T08:04:41.926Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<p>From gwern's summary over on lesswrong it sounds like the actual report only stated that the firing was \"not mandated\", which could be interpreted as \"not justified\" or \"not required\". Is it clear from the legal context that the former is implied?</p>\n", "parentCommentId": "vhZbAaoSiPCe3GhG4", "user": {"username": "Nick K."}}, {"_id": "Kz6nseygopEfDbsSm", "postedAt": "2024-03-10T11:20:08.003Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<p>Ah yes, that's a great summary I hadn't read yet. Link: <a href=\"https://www.lesswrong.com/posts/KXHMCH7wCxrvKsJyn/openai-facts-from-a-weekend?commentId=eFuasCwaKJr2YiScY\">https://www.lesswrong.com/posts/KXHMCH7wCxrvKsJyn/openai-facts-from-a-weekend?commentId=eFuasCwaKJr2YiScY</a></p>\n<p>And it looks like likely that phrase actually meant \"not required\"!</p>\n", "parentCommentId": "hn37oojgQKQCHSMH5", "user": {"username": "SiebeRozendal"}}, {"_id": "AJp4duzM4f3TifhQH", "postedAt": "2024-03-10T12:06:10.435Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<p>I am not sure if leaks are a reliable source in these cases. For one, these instances don't have material evidence. Somebody (or a bunch of somebodies) can only try to come forward to take action. But I am afraid that's what they tried to do. It was like the first necessary crisis (the sooner, the better) for later events to unfold. I am unsure about their nature. Partially based on the new board's current update on choosing the new members.</p><blockquote><p>No they didn't, and it looks like we aren't going to see the investigation, unless somebody leaks it.&nbsp;</p></blockquote>", "parentCommentId": "vhZbAaoSiPCe3GhG4", "user": {"username": "Mayank Modi"}}, {"_id": "BkotQtbg8Dt3Dnrfs", "postedAt": "2024-03-10T14:31:59.101Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<p>I'm pretty sure WilmerHale chose that word carefully. I do not see an implication that it was not justified. Moreover, as the statement says, boards have very broad discretion over this kind of stuff. So \"not mandated\" says very little indeed!</p>\n", "parentCommentId": "hn37oojgQKQCHSMH5", "user": {"username": "Jason"}}, {"_id": "wDTRzDEYLrgxqMccW", "postedAt": "2024-03-10T16:18:30.297Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<p>Sorry I don't follow - not sure whom you refer to by \"they\" and \"their\"</p>\n", "parentCommentId": "AJp4duzM4f3TifhQH", "user": {"username": "SiebeRozendal"}}, {"_id": "aLNHbyrz6Hukg6paY", "postedAt": "2024-03-10T17:57:30.549Z", "postId": "Cq8DTRusceNFJqn3y", "htmlBody": "<blockquote><p>Somebody (or a bunch of somebodies) can only try to come forward to take action. But I am afraid that's what they tried to do.</p></blockquote><p>Here, \"they\" refers to folks from OpenAI who tried to come forward and do something about Sam's manipulative behavior or lies or whatever was happening. Anyone who may potentially provide the leaks or shed some light.</p><blockquote><p>It was like the first necessary crisis (the sooner, the better) for later events to unfold. I am unsure about their nature.</p></blockquote><p>Here, I am unsure about the nature of the events.&nbsp;</p><p>I hope it is clear now.</p>", "parentCommentId": "wDTRzDEYLrgxqMccW", "user": {"username": "Mayank Modi"}}]