[{"_id": "Djj4rBFGXMjDpDfSM", "postedAt": "2023-12-25T18:30:48.808Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Thanks so much for sharing!</p>\n", "parentCommentId": null, "user": {"username": "JDBauman"}}, {"_id": "9HCzgucFadsgaMzY3", "postedAt": "2023-12-25T20:53:25.051Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Thanks for sharing your story, and for your  family's sacrifice for the sake of those who need it most</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "pn9PXSSRH5pvfRsEX", "postedAt": "2023-12-26T06:08:24.914Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Hi thanks for sharing and I really commend your dedication to helping those in need. I just want to gently <i><strong>push back on the degree to which people should make sacrifices in order to comply with a giving pledge</strong></i>. I am sure it can work out well for many people, but I am more making this comment in order for people that struggle not to feel too bad if they cannot &nbsp;always fulfill their pledge. I also think perhaps it is not for everyone to go to the lengths you have done in order to fulfill it. I can see many ways pushing too hard can go wrong:</p><p>-If only one of the people in a relationship made the pledge, then their income decreases and it puts strain on their relationship. E.g. if the non-pledger wants to join their friends for a couple's holiday but the pledger cannot afford to go.</p><p>-One has kids, like you do, and the sacrifices start becoming quite material such as not being able to afford warm winter clothes so they are uncomfortable being outside, or having to cut back on groceries e.g. drinking more water instead of milk which happens to be the main source of protein for the kid who is a picky eater.</p><p>-Probably many other ways one can risk one's own and one's family's well-being by being too unwilling to give up the pledge.</p><p>I know I am not the only one thinking that EAs should not always go to too extreme lengths and specifically not everyone might want to take or follow the pledge (I think breaking the pledge should not be associated with too much guilt) - <a href=\"https://80000hours.org/podcast/episodes/lucia-coulter-lead-exposure-elimination-project/\">Rob Wiblin recently suggested</a> that the 10% pledge might not be for everyone, specifically for founders and his guest Lucia Coulter mentioned that she could imagine not being able to fulfill the pledge if one was a non-profit founder with kids in an expensive city like London.</p><p>I like the idea of giving under the sense that one will be taken care of but also want to flag that you are in Canada with pretty high social security and you are also part of a tight knit community. Therefore, such belief in that \"everything will be ok\" might not apply to people living either in places with less welfare, for people with less strong social circles or both.</p><p>I have made a few comments like this recently. I think this is because the Forum in some ways encourages more extreme takes and it might seem to newcomers or those with less broad exposure to EA that EA requires extraordinary sacrifices and/or very unusual ways of living. I think such impressions are unfortunate and unhelpful especially in building the community. A post such as \"I quite carelessly broke my giving pledge and do not feel too guilty about it\" might have gotten less upvotes than this post. So it is not so much about your post as opposed to me just trying to bring some more balance where I see appropriate.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "sGDgBTq5RioLmdvCr", "postedAt": "2023-12-26T17:55:40.414Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Thanks for sharing this story. It’s good to have these sorts of perspectives on the forum, in my opinion.</p>\n<p>On the subject of public versus private giving, I wonder if we should experiment with some different models. For example, besides fully public or fully anonymous giving, I could imagine:</p>\n<ul>\n<li>Giving through a community foundation (or church, employer, etc) where the credit goes to the community rather than to the individual</li>\n<li>Psudonymous giving, “this gift from Scott Alexander”</li>\n<li>Unverifiable acknowledgement: The recipient acknowledges a gift but keeps the donor secret. The donor could claim credit but so could others.</li>\n<li>Anonymous-but-not-really (like in the <a href=\"https://m.youtube.com/watch?v=JqrJ4wGid4Y\">curb your enthusiasm sketch</a>)</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "cwdLBYMvnEAQCFWbM", "postedAt": "2023-12-26T22:41:16.755Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Yes, it's definitely a delicate balance.</p><p>Back in July, I had the pleasure of meeting a passionate, upright, and caring role model of mine,&nbsp;<a href=\"https://homeword.com/about/jim-burns/\"><u>Dr. Jim Burns</u></a>, at a week-long family Christian summer conference (<a href=\"https://www.cbcc.net/conferences\">CBCC</a>).</p><p>I asked him about his journey as a nonprofit entrepreneur, and one of the insights I journaled after our conversation was the importance of regularly asking Jesus to check our motives, motivations, and ego.</p><p>Since then, I have saved this prayer in my YouVersion app and have prayed it regularly because my ultimate desire and approval come from Jesus and nobody else. At the end of the day, I want to be called a 'good and faithful servant' when I see Him:</p><blockquote><p>God, I ask for protection over my mind &amp; heart. I want to be willing to let go of things that are not Your will for me so that I can make room for things that You do have prepared for me. Guard me from any thoughts, relationships or beliefs that are not from You. In Jesus' name, Amen.</p></blockquote><p>All this is to say, I've shared this particular story about our family publicly.</p><p>In the future, I'm unsure if we will do so again.</p><p>If we are called to, and if, after checking our motivations through prayer, it seems okay, we might.</p><p>Sorry if that's a much more faith-based answer than what you were looking for.</p>", "parentCommentId": "sGDgBTq5RioLmdvCr", "user": {"username": "Harry Luk"}}, {"_id": "Yss23tTuXwcvApCe9", "postedAt": "2023-12-26T23:12:30.359Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Thank you for your comment.</p><p>I definitely agree that everyone, every family, has their own journey.</p><p>As I mentioned above:</p><blockquote><p>Another example is how God sent an angel in the form of a financial planner out of nowhere. She volunteered numerous hours to help us navigate our transition from dual to single income because she knew of our desire to continue tithing despite our involvement in a nonprofit startup.</p></blockquote><p>She has spent so many hours with us and continues to help (in fact, we have a call with her tonight).</p><p>Our financial picture and budget have been completely revamped to make this work.</p><p>There are things we have had to cut back on significantly. There are many things we would have said 'yes' to before that are now 'no' or 'maybe.'</p><p><strong>But, in the end, <u>the magic number isn't 10%</u>.</strong></p><p>What's more important is the shift in mindset.</p><p>The heart.</p><p>The change from the norm in our consumer culture of spending every last dollar made on ourselves to giving instead, even if it's just 1% or 0.5%.</p><blockquote><p>Great things are not done by impulse, but by a series of small things brought together.</p></blockquote><p>- Vincent Van Gogh</p>", "parentCommentId": "pn9PXSSRH5pvfRsEX", "user": {"username": "Harry Luk"}}, {"_id": "qLDTfucCmgbFnoSjW", "postedAt": "2023-12-26T23:26:00.028Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Thanks for leading EA for Christians :)</p><p>Glory to Jesus!</p>", "parentCommentId": "Djj4rBFGXMjDpDfSM", "user": {"username": "Harry Luk"}}, {"_id": "jadXqpTAdZLxuqoGr", "postedAt": "2023-12-26T23:28:27.513Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Sorry if this is not the norm in the EA forum...</p><p>I have to redirect this upwards. Glory to God :)</p>", "parentCommentId": "9HCzgucFadsgaMzY3", "user": {"username": "Harry Luk"}}, {"_id": "SLfr4gFMCZdoooruM", "postedAt": "2023-12-27T04:23:38.421Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>Here is the Boxing Day Giving update for those wondering: 507 nets to protect 913 people (<a href=\"https://www.againstmalaria.com/MyNets.aspx?DonationID=1187309\">https://www.againstmalaria.com/MyNets.aspx?DonationID=1187309</a>).</p><p>We thought we had cleared our \"tithing debt\" to Jesus last time, but there were some filters in the spreadsheet that were overlooked.</p><p>All is good; hopefully, the year 2023 is settled after this :)</p><p>Merry Christmas and Happy New Year to you all!</p>", "parentCommentId": null, "user": {"username": "Harry Luk"}}, {"_id": "qBkRfo3pWJFJHGpiv", "postedAt": "2023-12-29T00:14:32.627Z", "postId": "CryjzhyHaBZKdkYkw", "htmlBody": "<p>I'd go further and say that it's probably a good idea for promoters of the pledge to actively discuss the merits of budget-constrained people <i>deferring</i> part or all of giving pledges (complete with tips on estimating the NPV of deferred contributions when you have a bit more disposable income). I think that approach probably saves more lives in the long run than people feeling they have to drop out or can only commit to a low amount.</p>", "parentCommentId": "pn9PXSSRH5pvfRsEX", "user": {"username": "David T"}}]