[{"_id": "ChP6YBeE4iZePXqXQ", "postedAt": "2015-07-12T06:50:37.928Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Put another way: comparative advantage is hard. It is slightly easier in the charity world because the charity world is less competitive overall, but it is still hard. EA is relatively new and thus has found some underfunded areas, but we should expect the orgs that do well by current EA heuristics to eventually become saturated with funds because there will be a lot of people using EA heuristics to inform their giving. The truly best giving opportunities are expected to be at the frontier: causes where the skills needed to evaluate them are rare. This could be due to technical background, professional connections, etc.</p>\n<p>I would propose that something that at least helps alleviate this is EAs pursuing higher variance causes. Low variance causes get snapped up pretty quickly, but there is remarkably little stomach among large donors for funding 20 causes and having 19 of them fail, even if the one that succeeds &quot;pays for&quot; the entire experiment in terms of impact.</p>\n", "parentCommentId": null, "user": {"username": "RomeoStevens"}}, {"_id": "wYkSiMXZNyfozZkk3", "postedAt": "2015-07-12T10:49:05.255Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Cause selection should help here too. If you find a cause that others don't think clearly about, like Open Borders, or identify an area that is neglected because of newness - synthetic biology biosecurity, then you're more likely to have a comparative advantage.</p>\n", "parentCommentId": "ChP6YBeE4iZePXqXQ", "user": {"username": "RyanCarey"}}, {"_id": "psvXP4sz5rWofyDza", "postedAt": "2015-07-12T13:16:31.522Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>I'd argue that even within these areas, it would be hard to find low-hanging research fruit. It seems to me that even new technologies get saturated really quickly.  In the bioinformatics research I mentioned, I was doing a fairly uncommon type of data analysis to answer a non-obvious question from a 6-year-old technology - and I still got scooped.  My experience with the social sciences is more limited, but I once tried to write a paper exploring the contribution of increasing agricultural productivity to Thai GDP, only to find that the exact topic already had a paper.</p>\n<p>So one of my major points is: EA organizations such as GiveWell may do too much original research and writing, when advocacy backed by literature reviews might be better. </p>\n", "parentCommentId": "wYkSiMXZNyfozZkk3", "user": {"username": "Lila"}}, {"_id": "FTEZaWQBLcpRM6RHM", "postedAt": "2015-07-12T14:20:02.313Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>If you want to find a comparative advantage in research, maybe breakthrough research, translational research (including efforts for commercialisation), literature reviews are more neglected? </p>\n<p>If you want to take a hard line against the usefulness of research among moderately high-talent researchers, then you might argue that it's better to leave academia for business or policy? Would you try to make that case? The thing is that we're looking for a comparative advantage, we don't necessarily need an absolute one (e.g. to be in the top X% at Y task).</p>\n<p>I'm not sure it's right to criticise GiveWell on this sort of topic, when GiveWell mostly focus on reviewing, summarising, integrating and applying existing literature more than creating new experiments and models as academics would focus on.</p>\n", "parentCommentId": "psvXP4sz5rWofyDza", "user": {"username": "RyanCarey"}}, {"_id": "XLcCHQNjNyri9WWMT", "postedAt": "2015-07-12T14:39:40.086Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Yeah I'll concede that GiveWell is fairly good in terms of not reinventing the wheel, though I think that they could be taking even more shortcuts.  </p>\n<p>It's not that I think research is useless - I actually take a very positive view of scientific research as a whole, but this means that an individual is constrained to small marginal returns.  Maybe we're just going to have to accept that, instead of saying &quot;scientific research is fundamentally broken and I'm gonna come in and change everything&quot; the way I used to think. I still think scientific research is a good EA option, though I don't think translational research is systematically underfunded.  There are many incentives to have biomedical applications. In fact, some people argue basic research is underfunded compared to applied research. I'm not sure what you mean by &quot;breakthrough research&quot;. </p>\n<p>If one does want to make a more radical difference, one needs to identify systems of incentives that do result in brokenness, like government spending as a whole.  </p>\n", "parentCommentId": "FTEZaWQBLcpRM6RHM", "user": {"username": "Lila"}}, {"_id": "dXYgoF76j4tZt5r5w", "postedAt": "2015-07-12T15:07:25.525Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Breakthrough research - this kind of thing: <a href=\"http://blog.givewell.org/2015/04/14/breakthrough-fundamental-science/\">http://blog.givewell.org/2015/04/14/breakthrough-fundamental-science/</a>.</p>\n<p>Incentives causing brokenness - We're going well beyond the subject of your post now, but science still seems to be broken in many ways. As you say, people are incentivised badly - to publish, rather than for the social good. People are incentivised to fund projects with sure incremental progress, much of which is not on the biggest problems facing humanity. Fields are fairly insular and inwards-looking. It takes too long for people to recognise paradigm-shifts. Replication is poor. <a href=\"http://blog.givewell.org/2015/04/21/science-policy-and-infrastructure/\">Science infrastructure is neglected</a> (e.g. LaTeX is old and has lots of room for improvement). Things like cognitive genomics are neglected because of political reasons. So there are a lot of different problems here, although they're not obviously fixable by an individual motivated researcher. I guess we agree that a person in science might be well-served to try to combat these head-on, rather than just performing research that might be replaceable. I don't agree that one has to zoom out all the way to government-spending to see problems to be fixed. That would seem to be an overcorrection.</p>\n", "parentCommentId": "XLcCHQNjNyri9WWMT", "user": {"username": "RyanCarey"}}, {"_id": "rTCAksC3qqDgjRB34", "postedAt": "2015-07-12T16:25:36.361Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>The most prestigious publications like Nature and Science <em>love</em> to publish breakthroughs, but this also leads to sloppiness, like the paper on arsenic-based life that was retracted and the paper on induced stem cells that was retracted.  When we see really bold publications like that, we always ask, &quot;How long do you think till this is retracted?&quot;  On the other hand, there are also incentives to produce research with social benefit.  It's odd to complain about both breakthrough (i.e. basic, high-risk/high-reward) research and translational (i.e. applied, incremental) research being underfunded.  You can't have it both ways here.</p>\n<p>There's a similar contradiction in this: &quot;It takes too long for people to recognise paradigm-shifts. Replication is poor.&quot;  The reason science is slow to change theories is <em>because</em> replication is poor.  Individual studies have an inherent stochasticity, so one has to consider a body of work as a whole before being willing to shift the paradigm. (Note that Galileo's and Mendel's studies didn't replicate initially.)  </p>\n", "parentCommentId": "dXYgoF76j4tZt5r5w", "user": {"username": "Lila"}}, {"_id": "ao7Hgth5pY2a2q7ha", "postedAt": "2015-07-12T16:52:17.856Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>What I think are neglected are science that is ambitious, with low probability of success (e.g. Hsu's cognitive genomics work, Ioannidis' statistics work), and work bridging new research to humanitarian applications (e.g. using machine learning to classify medical images, or to detect online fraud or risks to security). These are overlapping sets.</p>\n<p>In paradigm shifts, I mean adaptation to different ways of doing things. e.g. working to develop BCI and brain implants, or to apply deep learning in machine learning. These things have occurred too slowly. The replication problems are mostly in soft sciences like psychology, and arise from systemic problems with study pre-registration. The causation of these problems is somewhat entangled, but they're not the exact same problem. Both should be fixed.</p>\n<p>My point is: there are a range of important structural changes that effective altruists might want to make in science.</p>\n", "parentCommentId": "rTCAksC3qqDgjRB34", "user": {"username": "RyanCarey"}}, {"_id": "36khennqWQEqde5GH", "postedAt": "2015-07-12T18:23:17.255Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>I think the main comparative advantage (= irreplaceability) of the typical EA comes not from superior technical skill but from motivation to improve the world (rather than make money, advance one's career or feel happy). This means researching questions which are ethically important but not grant-sexy, donating to charities which are high-impact but don't yield a lot of warm-fuzzies, promoting policy which goes against tribal canon etc.</p>\n", "parentCommentId": null, "user": {"username": "Squark"}}, {"_id": "pWeiLMfNmpwgzwarR", "postedAt": "2015-07-13T20:50:36.448Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>What is good for the world is not necessarily good for our self-image as heroic do-gooders. It would be good for the world if there was lots of money already being directed to the most important things. It would be good for the world if there were enough folks with money and good intentions to 'fill up' any funding gaps promptly after they arise. It would be good for the world that things that really matter already attract the intellectual and creative energies of large numbers of extremely talented people. </p>\n<p>Yet, as you say, the closer this is to how the world really is squeezes out opportunities for individual acts of heroism. Things have gone <em>badly wrong</em> if vast stakes hang in the balance of my behaviour or my bank account - the margin of 'vitally important things for thousands of lives/the human species/everything that matters' should be really well populated, and my impact should be fairly marginal. </p>\n<p>(Doctors sometimes pompously remark that medicine is the only profession that works towards its own obsolescence. And there definitely is a common medical Bildungsroman of how a JD-like idealist wanting to save the world gets marinated in blood sweat and tears into a grizzled-but-heart-in-the-right-place Perry Cox figure. Doctors I know dislike medical heroism not only because it can twist judgement, and not only because it can be an exercise in demeaning vaingloriousness, but also because good medicine should make heroism unnecessary - the system for medics to 'save the day' shouldn't be extraordinarily demanding, else saving the day would be extraordinarily rare.)</p>\n<p>Speaking for me, insofar as optimism about the state of the world is in tension with optimism about the likely impact I could make, I find the former much more psychologically comforting than the latter. It is damning indictment on the human condition I really am one of the best candidates to save the world.</p>\n", "parentCommentId": null, "user": {"username": "Gregory_Lewis"}}, {"_id": "jp66KEzdH5H8eDwXv", "postedAt": "2015-07-13T23:53:17.575Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Greg conveys similar feelings about experiencing a downwards correction in his estimated effectiveness:\n<a href=\"http://effective-altruism.com/ea/iy/lognormal_lamentations/\">http://effective-altruism.com/ea/iy/lognormal_lamentations/</a></p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "Ybmk7nHBibQxfDafW", "postedAt": "2015-07-14T08:12:03.209Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>I would also much prefer if altruism was obsolete. You could watch your hero stories on TV and be done with it. :)</p>\n<blockquote>\n<p>Doctors sometimes pompously remark that medicine is the only profession that works towards its own obsolescence.</p>\n</blockquote>\n<p>I see doctors more as organized rentseekers who peddle artificial scarcity. Not only don't they invent the drugs they prescribe, they earn money because we need their <em>permission</em> before we can buy a prescription drug from the pharma industry. We can't even sign a legal waiver to reject this paternalism.</p>\n<p>Many times have I brought money into a doctor's practice only to fetch the piece of paper that I needed to buy what I wanted to buy from other people.</p>\n", "parentCommentId": "pWeiLMfNmpwgzwarR", "user": {"username": "DisposableUsername"}}, {"_id": "R8noTaf5DW88yuxq7", "postedAt": "2015-07-15T03:41:36.139Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>The recent talk of not having good giving opportunities is confusing to me. Maybe there are limited opportunities to save a life at $3000, but there should be many opportunities to save a life at $10,000 (UNICEF? Oxfam?). This is still far better than developed country charities (where it costs millions of dollars to save a life), so it is still a great opportunity.\nAs for global catastrophic risk, it is true that some areas receive a lot of funding. But then there is the Global Catastrophic Risk Institute that has an <a href=\"http://gcrinstitute.org/integrated-assessment/\">integrated assessment</a> to look across all the global catastrophic risks and prioritize interventions that is largely unfunded (disclosure: I am a research associate at the Global Catastrophic Risk Institute). And in general, if we took seriously the value of future generations, we should be funding global catastrophic risk reduction orders of magnitude more than it is currently funded.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "5tvNC2LaJmYgZNo25", "postedAt": "2015-07-16T13:12:45.791Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Off topic: As a member of the aforementioned rent-seeking organisation, I might be biased, but I'm fairly pro- regulating access to medical substances via prescriptions or similar. The value a doctor (hopefully) provides when prescribing is that they will select the right medication, and I'd back them to get this right significantly more often than (even well informed) laypeople. Maybe a libertarian would be happy with legal waivers etc. to get access to medical substances (let an individual decide the risks that are tolerable, and let the market set the price on how much value expert prescribing adds!), but most folks might be happy for some paternalism to protect people from the dangers - even it means savvy educated laypeople suffer some costs. Besides, even if you could waiver away your own damages, most countries have some degree of socialized medicine which are obliged to treat you, and the costs to health services of medication errors are already significant. I'd guess letting amateurs have a go would increase this still further.</p>\n", "parentCommentId": "Ybmk7nHBibQxfDafW", "user": {"username": "Gregory_Lewis"}}, {"_id": "RYL3cp2gCmrip5kBN", "postedAt": "2015-07-16T15:30:24.228Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Yeah, it could make sense to move lots of medications down a notch on the restriction scale based on practical libertarian arguments but doing away with prescriptions altogether seems very net harmful.</p>\n", "parentCommentId": "5tvNC2LaJmYgZNo25", "user": {"username": "RyanCarey"}}, {"_id": "xPQPcWHC8T7xGShmX", "postedAt": "2015-07-17T00:51:31.057Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Surely anyone save an absolutist non-EA (non-consequentialist) libertarian would grant that; but equally, surely it <em>does</em> make sense to move lots of medications down a notch on the restriction scale. See Slate Star Codex on the FDA, 23 and me, meds with tiny chances of huge harms compared to antidepressants with high chances of libido reduction, etc.</p>\n", "parentCommentId": "RYL3cp2gCmrip5kBN", "user": {"username": "number42"}}, {"_id": "pY5Cg5ZAMAvbKas7n", "postedAt": "2015-07-17T00:53:13.487Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>I completely agree.</p>\n", "parentCommentId": "R8noTaf5DW88yuxq7", "user": {"username": "number42"}}, {"_id": "9YswRE94HawpGf6sn", "postedAt": "2015-07-17T09:59:42.594Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Put yet another way: overcrowdedness is a significant concern. Perhaps you assign it a higher weighting within the ‘overcrowdedness/ importance / tractability’ tripartite than the average EA. If so, why not trade it off for the latter two: you could examine only moderately important careers - ones that receive little/no EA attention - where the average employee is much less talented than you. Or you could dedicate yourself to solving a  seemingly intractable problem - it’s high risk but that’s precisely why it might be overlooked as Romeo points out.</p>\n<p>Of course, if you think replaceability issues are truly ubiquitous, then even these suggestions are moot.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Rhodes"}}, {"_id": "miK5Rs6fdLAxaFL2n", "postedAt": "2015-07-17T18:08:55.330Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Thanks for the article. I think the conclusions about advocacy are important. Looked at another way, there are a lot of obviously very bad things about the world and a lot that could be done differently. The problem is people don't necessarily want to do things differently because of the incentives they face. The question is, who holds the reigns of power in any given situation and how can you beat them without too much collatoral damage.</p>\n<p>FYI, I don't think that you should credit 'libertarian' or 'Austrian' fringe political economists with thinking about incentives, or homo-economicus, or revealed preference - they're all standard traditional economics.</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "3mdGRnCMLqMGNi7ge", "postedAt": "2015-07-19T21:46:57.914Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>+1</p>\n<p>The idea that we could become saturated with money seems bizarre. It's not like Givewell's top charities have run out of RfMF, and even if they do, and all the top organisations are genuinely more talent- than money-constrained, it doesn't follow that there's a better option than putting money towards them. </p>\n<p>You could potentially fund scholarships for people learning the skills they need - not that I would expect this to be a top-tier use of the money, but it seems likely to be as good or better use of your resources than either a) applying or studying for a highly 'talent-constrained' job which, if it's that hard, there's little reason to expect yourself to be be competent for, or b) sitting around and waiting for someone to show up.</p>\n", "parentCommentId": "R8noTaf5DW88yuxq7", "user": {"username": "Arepo"}}, {"_id": "DtntCzfnKSu5EHZ7Q", "postedAt": "2015-07-22T02:55:42.299Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>In the future, effective altruism may need to become less risk averse. There is appeal in Givewell's top recommendations for classic charitable causes because there is more-or-less a guarantee people will be helped as cash transfers, mosquito bed nets, or vaccinations are delivered. If effective altruism donates millions of dollars to an advocacy campaign which may fail, or fund a project with a decades-long trajectory difficult to predict in the present, it's less certain someone in need will be as helped as we hoped for. There may also be a personal bias among individuals who want to feel as though their dollars donated definitely made a difference despite what mistakes other donors make. So, that could be a bias towards donating to the Against Malaria Foundation, or GiveDirectly. I know this worry has pulled on my heartstrings in the past, but I'm (slowly) overcoming it. I know of no data of how pervasive this bias may actually be among altruists.</p>\n<p>One solution could be to separate ego and psychology from expected value. Part of effective altruism's appeal is it can make one feel good about oneself. This can come from a confidence that donating to an effective charity which will definitely leads to lives saved feels better than feeling ambivalent about the value of private charity and its uncertainty. However, that's a state of thinking effective altruism may need to return to. Plenty of wealthy philanthropists donate money to art museums and other institutions which won't go on to save lives. These philanthropists still reap the status of donating, and feel good about themselves. There are activists and protest movements around the world proud of the work they do, but not all are guaranteed to work. If others can feel that way, then I think effective altruism can take on bigger risks with a chance of greater value as well, without us feeling bad about ourselves. </p>\n<p>Another solution may be effective altruism scaling up what it approaches, and thinking bigger about what it can achieve. Good Ventures is more or less aligned with effective altruism, with other major philanthropists able to donate as much as the rest of this movement combined doing related work (e.g., Elon Musk). William MacAskill's new book <em>Doing Good Better</em> was recently positively reviewed by Susan Desmond-Hellman, the CEO of the Bill and Melinda Gates Foundation. Further, catastrophic risks like Artificial Intelligence and pandemic biotechnology are now or may soon receive funding from the National Science Foundation and other governmental bodies in the United States. </p>\n<p>These are all indicators that even if effective altruism doesn't hit explosive growth in the next couple years, it still has a chance of affecting the biggest movers and donors in philanthropy. This doesn't make much less imperative for individual donors the identified responsibility of saving lives by way of UNICEF or OxFam. Effective altruism may need change its pitch. Being an individual who saves hundreds of lives through earning to give or through regular donations might need give way to pursuing a more ambitious and less conventional career of being part of a more coordinated global network or actors whose greatest value is in doing work beyond the scope of individuals.</p>\n<p>To find the best giving opportunities might require effective altruism pioneering new ways of finding them, or creating them itself.</p>\n", "parentCommentId": "3mdGRnCMLqMGNi7ge", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "PECpE2nAgFjGZMGSm", "postedAt": "2015-07-22T02:58:56.131Z", "postId": "CsRyvwwop66dgo5gu", "htmlBody": "<p>Sometimes it's not about promoting policy which goes against tribal canon. It can also be about promoting policy so technical and obtuse that virtually everyone else's eyes glaze over when thinking about it, so they never pay it any mind.</p>\n", "parentCommentId": "36khennqWQEqde5GH", "user": {"username": "Evan_Gaensbauer"}}]