[{"_id": "CMcsCDs6XWp9ZkBFA", "postedAt": "2023-07-29T01:02:26.380Z", "postId": "CtACh7xRBFnpK3NW4", "htmlBody": "<p>Great guide! Thanks for sharing. I'd like to make a suggestion, which I'm not sure is applicable to your organizations. But some areas can pose risks for certain types of attendees due to local laws. For example, laws that criminalize trans people using their preferred bathrooms, or laws that increase deportation risks for undocumented people. So, that's something to be aware of maybe. Having event planners, if they're deciding where to host an event, look into local laws.</p>\n", "parentCommentId": null, "user": {"username": "Masha Winchell"}}, {"_id": "xCGuD8mGr2Sa2nv5M", "postedAt": "2023-07-29T01:13:45.527Z", "postId": "CtACh7xRBFnpK3NW4", "htmlBody": "<p>Also, OFTW's harassment policy seemed to focus on harassment related to protected characteristics, like gender, race, etc. But what about harassment for other reasons? Eg, someone harassing/threatening/intimidating someone who rejected their grant application. GWWC's harassment policy was more general, and I would assume it would cover this type of harassment, though it was not made explicit.</p>\n", "parentCommentId": "CMcsCDs6XWp9ZkBFA", "user": {"username": "Masha Winchell"}}, {"_id": "LhJCDhGvuD4RWmfwo", "postedAt": "2023-07-29T04:42:50.187Z", "postId": "CtACh7xRBFnpK3NW4", "htmlBody": "<p>Thanks for this guide!</p>\n<p>One thing that I appreciated when attending a GWWC event was that expectations of responsible conduct were made clear with an explicit announcement at the beginning of the event. I thought this was a good way to create a social agreement among attendees.</p>\n<p>I think that some people are reluctant to do this because they think it might bring the mood down, or it feels awkward to call attention to the possibility of harmful behaviour at what is supposed to be a fun or professional event. They might also not be sure exactly what to say. One idea for addressing these barriers would be to provide a basic script that organisers could say, or rewrite in their own words.</p>\n", "parentCommentId": null, "user": {"username": "AlexanderSaeri"}}, {"_id": "sE6kZoBYwpgW8wJ2X", "postedAt": "2023-07-31T13:45:55.899Z", "postId": "CtACh7xRBFnpK3NW4", "htmlBody": "<p>I actually do have this in a template for slides for events organisers are doing! I've also included in a doc on how to run events that it's important to set the tone for the event, and that this can be a good time to speak about what behaviours you do (and don't) want to see!</p>", "parentCommentId": "LhJCDhGvuD4RWmfwo", "user": {"username": "GraceAdams"}}, {"_id": "uXmbiaDttqTgefonp", "postedAt": "2023-07-31T13:48:11.021Z", "postId": "CtACh7xRBFnpK3NW4", "htmlBody": "<p>That's a really good point! I'll make a note to update the guide to include a note about this!&nbsp;</p>", "parentCommentId": "CMcsCDs6XWp9ZkBFA", "user": {"username": "GraceAdams"}}, {"_id": "4zcvXfgkhuoyBatpZ", "postedAt": "2023-08-22T19:46:59.817Z", "postId": "CtACh7xRBFnpK3NW4", "htmlBody": "<p>I wonder what you/readers think about indoor air quality as an accessibility feature.</p>\n<p>It's quite a topic in my other community (infection associated chronic illnesses &amp; immunosuppressed people) with many people who still prefer not to be in spaces with poor indoor air quality, especially during high levels of covid.</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "sQ6geTcsJ5Dngtrys", "postedAt": "2023-08-27T00:52:21.575Z", "postId": "CtACh7xRBFnpK3NW4", "htmlBody": "<p>I very sympathetic to people who care about high air quality and ventilation for health reasons!</p>\n<p>By default, I often try to host events outdoors when I can, when the weather is good and generally try to keep spaces well ventilated.</p>\n<p>I also think it can make sense to explicitly ask people who feel unwell at all to stay at home in communications prior to the event.</p>\n<p>And I think it’s very reasonable for people with concerns to enquire with the hosts about things like this prior to the event!</p>\n<p>I also think having some virtual events for those who might not want to or be able to attend in person events makes sense.</p>\n<p>I might add something to the guide about this :)</p>\n", "parentCommentId": "4zcvXfgkhuoyBatpZ", "user": {"username": "GraceAdams"}}]