[{"_id": "PCoxW3SSwCWLoLy6G", "postedAt": "2014-12-10T18:19:01.114Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>Thanks, in general pre-registration is a great tool to help have appropriate confidence in results.</p>\n<p>I may disagree with this slightly:</p>\n<blockquote>\n<p>More subtle cheating is also discouraged, such as adding extra statistical tests because the data seem to be pointing that way.</p>\n</blockquote>\n<p>There are some forms of that which are pure p-value hacking, and should definitely be discouraged. But experiments have a couple of purposes, only one of which is hypothesis testing. The other is exploration, which can help with hypothesis generation. </p>\n<p>It's absolutely legitimate to notice an odd correlation between variables you didn't plan in advance to test for correlation and form a hypothesis about this. It may be helpful to use a statistical test to see how suggestive the data is. What you shouldn't do is confuse the strength of evidence for such hypotheses with ones which you set out to explore.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "McwA6Kdmx5ehLnZzg", "postedAt": "2014-12-10T20:55:04.719Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>I had a look at the current entries, and it's a bit unclear to me. For the facebook welcome, I don't understand the methodology. Are you comparing different standard greetings against each other? If so, how do you decide which greeting gets used for which person?</p>\n<p>In general the idea with pre-registration should be to state up-front exactly what questions you are trying to answer. This is a non-negligible amount of work involved in doing this properly; this is the cost of pre-registration (and why it isn't a total no-brainer, particularly early on in a field when exploration and hypothesis generation is more important than hypothesis testing). Of course bringing down the cost helps make it worthwhile earlier.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "DkahyafPShaYQsPBZ", "postedAt": "2014-12-10T20:57:06.248Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>There's a lot about this idea that I agree with. It seems important to get effective altruists (and everyone) to share more information about what they're trying to achieve, whether it worked or didn't, and why. In particular, a lot of us are trying radical things like applying for finance jobs or starting companies, which have high variance, making it hard to infer whether these are good decisions. </p>\n<p>I think this idea can grow a lot. It would be good to have everyone we know pooling together information about when they started a company, for example, so that we could infer whether it's better to start more companies or work for somebody else. In the long run, it would be ideal situation would be to have thousands of people making their decision in similar ways to you, and to have a recommender system that can give you suggestions by giving extra weighting to the experiences of people similar to you.</p>\n<p>However, I do have a bunch of feedback and questions:</p>\n<p>1 Is a registry the best way of sharing information about what activities are working well and which aren't? </p>\n<p>2 Is there some reason to focus just on explicit experiments rather than lots of activities with uncertain payoff? Are there enough explicit experiments to support this project? Don't we want to reduce reporting bias in general, rather than just publication bias? i.e. we want people to report the successes and failures of activities with uncertain payoff, rather than just explicit experiments. So it might be better to call it a Reporting Bias Registry.</p>\n<p>3 On second thoughts, shouldn't it be named by what it's trying to achieve rather than what it's trying to avoid? e.g. the 'charity project performance registry', or 'social impact registry', or something like that.</p>\n<p>4 I think it's important to be clear about what exactly you want people to do. At the top or bottom of the page, you could write in bold that what you want is for people to write information about their projects on the wiki.</p>\n<p>5 It's not clear that a wiki is the best way to implement this. Few people don't use the wiki, and some of the important experiments that people run might be private? Perhaps it would be better to make a Google form, and to assure people that any information that is sufficiently specific to identify them or their project will not be disclosed? Or perhaps privacy would only work if there are at least dozens of projects. It's at least worth thinking about.</p>\n<p>6 Is this substantially different from the EA Survey? Is it substantially different from the EA Profiles? Is it substantially different from GWWC's donation registry? CFAR's alumni community? 80k's alumni group? Can it be integrated with any of these things?</p>\n<ol>\n<li>Maybe we should also get everyone to report their progress on the projects that we already know about. This is kind-of different, because the reports will be somewhat biased but it still seems worthwhile.</li>\n</ol>\n<p>So I would be interested in how you would respond to some of these challenges and how we could plan around them in order to make the project more likely to be the big success that the idea deserves.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "T9j4RkXCc6pAgkcdu", "postedAt": "2014-12-11T01:27:58.203Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>I have a bunch of experiments I ran for a Master's Thesis related to the use of neural networks for object recognition, that ended up getting published in a couple conference papers.  Given that any A.I. research has the potential to contribute to Friendly A.I., would those have counted or are they too distant from E.A.?</p>\n<p>I also have an experiment that's current status is failed, a Neural Network Earthquake Predictor, but which I'm considering resurrecting in the near future by applying different and newer methods.  How would I go about incorporating such an experiment into this registry, given that it technically has a tentative result, but the result isn't final yet?</p>\n", "parentCommentId": null, "user": {"username": "Joseph_Chu"}}, {"_id": "w2gJSRSi8Z4Tytfgm", "postedAt": "2014-12-11T02:28:37.897Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>I agree. Thanks for clarifying.</p>\n", "parentCommentId": "PCoxW3SSwCWLoLy6G", "user": {"username": "Giles"}}, {"_id": "APEtPDqpP9qNZMRNK", "postedAt": "2014-12-12T16:01:53.981Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>There are plenty of valuable thoughts here. I also like Giles' idea and think it's worth giving a go.</p>\n<p>A few specific comments:</p>\n<blockquote>\n<p>It's not clear that a wiki is the best way to implement this.</p>\n</blockquote>\n<p>I think a wiki's fine for now, and pretty simple. I don't think there's yet reason to worry about privacy. In general I think Giles' setup is a decent minimum viable product.</p>\n<blockquote>\n<p>Maybe we should also get everyone to report their progress on the projects that we already know about. This is kind-of different, because the reports will be somewhat biased but it still seems worthwhile.</p>\n</blockquote>\n<p>I believe .impact was set up partly for this purpose, and its <a href=\"https://impact.hackpad.com/Projects-aRiPtncmuKS\">projects page</a> is a pretty good place to report this sort of thing.</p>\n", "parentCommentId": "DkahyafPShaYQsPBZ", "user": {"username": "Tom_Ash"}}, {"_id": "t9fzCoJwWACMdw6Yf", "postedAt": "2014-12-12T18:12:25.576Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>Just an update.  I decided to make a go of adding the experiment to the Registry.  Hopefully what I added is acceptable.  If not, let me know what I should change.</p>\n", "parentCommentId": "T9j4RkXCc6pAgkcdu", "user": {"username": "Joseph_Chu"}}, {"_id": "oK9gKBM626DZ4XM5Z", "postedAt": "2014-12-13T18:34:22.189Z", "postId": "CTD4yLt4Tgrr4wE2x", "htmlBody": "<p>If this turns out to something people find useful, it might also be useful to have people who watch the wiki and provide feedback/advice on the proposed study designs, or who can help people who are less familiar with study design and statistics to produce something useful. This provides an additional service along with the preregistration, so it isn't just an extra onerous task. (I'd be willing to do this if it seems useful).</p>\n<p>I'm somewhat doubtful that this experiment registry will attract a lot of use, but +1 for setting it up to try it out.</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}]