[{"_id": "atHoXaZh7QCufbtr8", "postedAt": "2023-06-02T02:55:54.291Z", "postId": "CTw58TXSaLSuG6BCg", "htmlBody": "<blockquote><p>if someone receives explanation E_1 of a concept C, and they're paying attention, and they still don't intuitively grok C, then they need at least one more different explanation E_2.</p></blockquote><p>That sounds about right to me. I'm not an expert on pedagogy, but from my own experience self-learning as an adult (a couple of languages to vary levels of fluency, math concepts that I never learned in school, a moderate amount of various fields) your hypothesis is correct. Being exposed to a concept from multiple angles or in multiple forms reduces the chance that someone won't be able to understand it.</p><p>I'd be willing to bet money that people who actually study the psychology of learning have a name for this concept, but I don't know what it is.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "86R7u5ATYDMYNuyTq", "postedAt": "2023-06-02T02:57:40.843Z", "postId": "CTw58TXSaLSuG6BCg", "htmlBody": "<p>Why just math? This may seem like an obvious question, but your hypothesis applies to any type of learning: how to be a better parent, how to self-regulate emotions, moral philosophy, systems thinking or statistical thinking, physics, and so on.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "SifSyHijz4FpXpjFD", "postedAt": "2023-06-02T10:00:23.073Z", "postId": "CTw58TXSaLSuG6BCg", "htmlBody": "<p>Yeah, we'd hope there's a good bit of existing pedagogy that applies to this. Not much stood out to me, but maybe I haven't looked hard enough at the field.</p>\n", "parentCommentId": "atHoXaZh7QCufbtr8", "user": {"username": "NicholasKross"}}, {"_id": "SsFdmCM4xa4Cx8JZC", "postedAt": "2023-06-02T10:06:37.087Z", "postId": "CTw58TXSaLSuG6BCg", "htmlBody": "<p>Maybe! I'm most interested in math because of its utility for AI alignment <em>and</em> because math (especially advanced math) is notoriously considered \"hard\" or \"impenetrable\" by many people (even <a href=\"https://slatestarcodex.com/2015/01/31/the-parable-of-the-talents/\">people who</a> otherwise consider themselves smart/competent). Part of that is probably lack of good math-intuitions (grokking-by-playing-with-concept, maths-is-about-abstract-objects, law-thinking, etc.).</p>\n", "parentCommentId": "86R7u5ATYDMYNuyTq", "user": {"username": "NicholasKross"}}]