[{"_id": "JegJG9zWQZ3xwtxPj", "postedAt": "2023-05-12T23:24:42.494Z", "postId": "CuktFCQ39fuXnxcHx", "htmlBody": "<p>Thanks for this. Any thoughts or comments on the prospects of the new R21/Matrix-M malaria vaccine?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "eKdc8ij3yHohajA7A", "postedAt": "2023-05-13T11:58:39.992Z", "postId": "CuktFCQ39fuXnxcHx", "htmlBody": "<p>Thanks for this update this makes a lot of sense. The cost-effectiveness of a malaria vaccine could well rival and even exceed nets, especially if this RTS'S vaccines real-world effectiveness comes close to the incredible effectiveness shown in the initial trial.</p><p>My only query around vaccines is how neglected they really in terms of funding. GAVI, UNICEF and the WHOa s as mentioned are obviously huge players but also direct government aid and even the Gates foundation have helped to fund malaria vaccine trials and rollouts.</p><p>It surprises me a little that a high profile malaria vaccine like this wouldn't get all the funding it needed without GiveWell input, but I trust GiveWell have considered that well.<br><br>One other issue I have is that I think it is possible like Kenya, Ghana and Ugandan governments have enough capacity now to be able to deliver these vaccine programs with their own systems without 5 million dollars in help from an NGO like PATH. That's a LOT of money for logistic support. Having another NGO in between GAVI / vaccine producers and a government which is accustomed to rolling out vaccines seems inefficient. I'm not sure how much \"technical assistance\" they need. Here in Uganda vaccine rollouts no longer involve a huge amount of NGO input, with Polio and other vaccines often rolled out at fairly short notice without too much trouble. The bottlenecks that I see seem only to be paying extra allowances to those in the vaccine supply chain and those giving the vaccines. Obviously I might be missing something about the logistics specifically of difficulties in distributing the vaccine.</p><p>To put it more simply, if the government of Kenya was given just the vaccine and $500,000 (or less) would they have been able to do a similar job without help from PATH?<br><br>As another idea is that &nbsp;perhaps a trial could have been done where PATH were put in charge of the rollout in one country (Ghana), and only the Government in another (e.g. Kenya) to assess just how much PATH really improved efficiency.</p><p>Nice work Givewell as usual!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "Supx6jD9uYZmrMviT", "postedAt": "2023-05-25T13:59:39.878Z", "postId": "CuktFCQ39fuXnxcHx", "htmlBody": "<p>Hi, Nick,</p><p>Thanks for your comment! Apologies that it took a while to respond to this.</p><p>Re: how much funding is needed to successfully roll out the vaccine, we've provided a&nbsp;<a href=\"https://www.givewell.org/research/grants/PATH-malaria-vaccines-January-2022#Budget\"><u>budget breakdown</u></a> on the grant page. The majority of this funding is going toward training and other activities needed to distribute the vaccine, vaccine-related supplies, and shipping and handling for the doses donated by GSK. Only about $1.8 million of the total, or less than half, is going toward the costs of having PATH and WHO provide technical support for this project.&nbsp;</p><p>For every grant opportunity we evaluate, we do consider the likelihood that another funder will step in to cover the costs absent our support. In&nbsp;<a href=\"https://docs.google.com/document/d/1XKSf9buniP9NWaWeiknPXNI8o4z59FWXnkJgohHJgMs/edit\"><u>a conversation with PATH and WHO</u></a>, we learned that there were no other suitable candidates for funding this rollout of RTS,S to comparator areas, though we didn't independently verify this.</p><p>As for whether the governments of Kenya, Ghana, and Malawi could successfully speed up the implementation of RTS,S without NGO/WHO technical support, this is a subjective assessment. We frequently hear from NGOs that the governments where programs we fund operate tend to have many competing priorities, so progress on projects like this can be slow. The theory is that providing dedicated funding (and with it, human capacity) for a single project can accelerate the timeline of results. We try to confirm whether this is right by talking to other relevant actors, including government officials themselves.&nbsp;</p><p>It would be interesting to try out what you suggest—giving the funding directly to a country government to see if they could achieve the same results without technical assistance—but because there are so many country-specific factors that inform the success of an intervention, we think it'd be hard to tell if a slower vaccine rollout in a given country was due to lack of technical assistance or some other factor.&nbsp;</p><p>I hope that's helpful!&nbsp;</p><p><br>Best,</p><p>Miranda Kaplan</p><p>GiveWell Communications Associate</p><p><br>&nbsp;</p>", "parentCommentId": "eKdc8ij3yHohajA7A", "user": {"username": "GiveWell"}}, {"_id": "CS3mSXPp3BPuJicaX", "postedAt": "2023-05-26T16:25:42.183Z", "postId": "CuktFCQ39fuXnxcHx", "htmlBody": "<p>Hi, Peter! So sorry I missed this question earlier and have been delayed in responding.</p><p>We've described in the above post what we know about R21 so far (see the second and third paragraphs from the end). To summarize, R21 has been shown to have high efficacy in protecting against malaria, but it's unclear to us so far how generalizable those results will be. R21 is also reportedly less complicated to manufacture, which could be helpful as demand for malaria vaccine is expected to outstrip supply - but we can't independently verify this. We'll keep monitoring the literature on R21, and we'll consider any funding opportunities as they come up.</p><p>Best,</p><p>Miranda Kaplan</p><p>GiveWell Communications Associate</p>", "parentCommentId": "JegJG9zWQZ3xwtxPj", "user": {"username": "GiveWell"}}]