[{"_id": "Lx5AbEzxraoRSxYFC", "postedAt": "2023-03-12T08:18:49.157Z", "postId": "CurMPLmAzqJZcwFQj", "htmlBody": "<p>Thanks for sharing, gordoni.</p><p>I am not familiar with the bill. However, I think wellbeing-adjusted life years are a better measure than quality-adjusted life years (see <a href=\"https://forum.effectivealtruism.org/posts/dk48Sn6hpbMWeJo4G/to-wellby-or-not-to-wellby-measuring-non-health-non\">here</a>).</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "ctrB3Gj5qjFACJ4AD", "postedAt": "2023-03-12T20:56:26.575Z", "postId": "CurMPLmAzqJZcwFQj", "htmlBody": "<p>WELLBYs are proposed in the doc you link as a measure specifically for non-heath and non-pecuniary measures. QALYs take subjective well-being into account, along with physical health metrics through the psychological component of HRQoL, so a shift to WELLBYs in this context just excludes the physical health component of QALYs in pricing physical health interventions.</p>\n", "parentCommentId": "Lx5AbEzxraoRSxYFC", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "8HharbGPncr7yvuaR", "postedAt": "2023-03-12T22:12:40.083Z", "postId": "CurMPLmAzqJZcwFQj", "htmlBody": "<p>Hi there,</p><p>Thanks for clarifying. In any case, I think we should only care about health and pecuniary benefits to the extent they affect wellbeing, so using WELLBYs still seems better than QALYs for assessing those too. In addition, I would prefer a wellbeing metric that measured happiness instead of life satisfaction.</p>", "parentCommentId": "ctrB3Gj5qjFACJ4AD", "user": {"username": "vascoamaralgrilo"}}, {"_id": "fibFKKmfmSNyyD9tz", "postedAt": "2023-03-13T14:58:29.210Z", "postId": "CurMPLmAzqJZcwFQj", "htmlBody": "<p>This is getting into philosophical territory, so here’s a thought experiment. Let’s say you’d lost your legs. You had to choose between a $10 pill that instantly regrew your legs and restored your subjective well-being, and a $0 pill that only corrected any loss in subjective well-being from having lost your legs. Do you really choose the well-being only pill in this case?</p>\n", "parentCommentId": "8HharbGPncr7yvuaR", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "swfsMQwXDLq4figTQ", "postedAt": "2023-03-13T16:56:46.413Z", "postId": "CurMPLmAzqJZcwFQj", "htmlBody": "<p>Thanks for the thought experiment!&nbsp;</p><p>So, in the example you described, I would pay the 10 $ to get my legs back. However, this is just because I am altruistic, and with my legs minus 10 $ I would have a greater positive impact in the world than without my legs (not having legs surely implies a loss in produtivity due to e.g. having to spend more time to move from one place to the other).</p><p>If the expected total hedonistic utility (ETHU) for all the moral patients excluding me was the same in both scenarios, I would be totally indifferent between the 2 options.</p>", "parentCommentId": "fibFKKmfmSNyyD9tz", "user": {"username": "vascoamaralgrilo"}}, {"_id": "g9xLEmEg2iFFKamNG", "postedAt": "2023-03-13T20:00:56.972Z", "postId": "CurMPLmAzqJZcwFQj", "htmlBody": "<p>Interesting! Do you think that is a common view? And do you think that federal healthcare policy should be made by somehow tapping into commonsense moral intuitions? Or should a winning, even if unpopular, argument  determine policy options?</p>\n<p>Edit: perhaps we can value QALYs on the principle that we’re unlikely to be able to accurately track all contributors to total ETHU in practice, but having people maintain physical health is probably an important contributor to it in practice. Physical health has positive externalities that go beyond subjective well-being and therefore we should value it in setting healthcare policy.</p>\n", "parentCommentId": "swfsMQwXDLq4figTQ", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "FK2vYiFPmQAFhPMsQ", "postedAt": "2023-03-13T23:14:31.588Z", "postId": "CurMPLmAzqJZcwFQj", "htmlBody": "<blockquote><p>Do you think that is a common view?</p></blockquote><p>In the general population, no. It is hard to imagine wellbeing being the same without 2 legs, so people would answer the question ignoring the fact wellbeing would be the same.</p><blockquote><p>And do you think that federal healthcare policy should be made by somehow tapping into commonsense moral intuitions? Or should a winning, even if unpopular, argument determine policy options?</p></blockquote><p>I think commonsense moral intuitions should absolutely be taken into account. However, our intuitions can easily be misleading, so we should see whether they are consistent. For example, humans finding it much more intuitive to make comparisons between the mean level of wellbeing often results in people rejecting the Repugnant Conclusion, which follows from<a href=\"https://forum.effectivealtruism.org/posts/hJbM5Svpku6haQi7S/what-is-your-confidence-in-the-premises-of-the-repugnant#Repugnant_Conclusion_and_its_premises\"> pretty undisputable premises</a>.</p><p>Personally, I find expectational total hedonistic utilitarianism being true as intuitive as 1 = 1 being true. So, when asked about my preference about 2 situations in which ETHU is constant, I am always indifferent between them.</p><p>I also believe most disagreements about these thought experiments come from different interpretations about the meaning of wellbeing. For example, I think it is often said wellbeing does not allow for intrinsically valueing relationships, beauty, and freedom. However, all of these are words we use to describe conscious states, i.e. wellbeing. Another common argument is that people value unconscious objects for their own sake (not just for the sake of the observer). However, all things we call unconscious are actually conscious in expectation, because they have a non-null chance of being conscious, so they also relate to wellbeing in expectation.</p><blockquote><p>Edit: perhaps we can value QALYs on the principle that we’re unlikely to be able to accurately track all contributors to total ETHU in practice, but having people maintain physical health is probably an important contributor to it in practice.</p></blockquote><p>Great point! I agree there is a positive correlation between QALYs and ETHU, but guess the correlation between WELLBYs and ETHU is stronger. Anyways, I am not confident about this. I am mainly in favour of a more widespread usage of WELLBYs in order to change the focus to what actually matters, wellbeing. Even if WELLBYs is not a great measure of it, adopting them would hopefully eventually lead to the adoption of better metrics in the future.</p><blockquote><p>Physical health has positive externalities that go beyond subjective well-being and therefore we should value it in setting healthcare policy.</p></blockquote><p>I think ETHU is all that matters (see <a href=\"https://80000hours.org/podcast/episodes/sharon-hewitt-rawlette-hedonistic-utilitarianism/\">this</a> related episode of The 80,000 Hours Podcast), and in that sense that are not positive/negative externalities which go beyond it. I suppose you are alluding to e.g. better health leading to economic growth, which tends to increase wellbeing even if it does not immediately impact it in the short term. However, I am generally quite uncertain about whether economic growth is good or bad. While subjective wellbeing has been increasing with greater consumption (say, since at least the industrial revolution), existential risk has increased too. In other words, improving health does not look to me like a robust way of achieving <a href=\"https://forum.effectivealtruism.org/topics/differential-progress\">differential progress</a>.</p><p>So maybe the focus should not be on QALYs nor WELLBYs, but on good metrics to achieve differential progress. Maybe ones about rationality? Being more rational means being better at achieving goals. So, to the extent high existential risk is not aligned with our goals, greater rationality will tend to decrease it. I guess this is part of the motivation for 80,000 Hours having epistemics and institutional decision-making as one of its <a href=\"https://80000hours.org/problem-profiles/\">most pressing problems</a>.</p><p>In addition, I believe the attention should shift (on the current margin) from gross domestic product to things like total amount of compute, or cost of DNA screening, which are much more informative about the greater x-risks, advanced AI and engineered pandemics.</p>", "parentCommentId": "g9xLEmEg2iFFKamNG", "user": {"username": "vascoamaralgrilo"}}]