[{"_id": "r5yNCGm4u3N8tuDaf", "postedAt": "2023-11-10T14:14:56.432Z", "postId": "Cvn6fwzdoLNLgTJif", "htmlBody": "<p><strong>Executive summary</strong>: The post outlines potential projects to reform and improve EA organizations and infrastructure. It considers changes to boards, investigations, whistleblowing, coordination, operations, risk management, fundraising support, and information sharing.</p><p><strong>Key points:</strong></p><ol><li>Advising EA organizations on board composition could help ensure necessary skills and oversight.</li><li>An investigation team could review major problems like fraud or HR issues at EA organizations.</li><li>Improving whistleblowing procedures could facilitate reporting problems.</li><li>Better coordination between organizations on gaps and staff working in similar areas could be valuable.</li><li>Operations support through funding, advising, and sharing policies could help smaller EA organizations.</li><li>An \"EA COO\" could pursue efforts improving operations and management across organizations.</li><li>A risk management project could identify and monitor multi-organization risks.</li><li>Fundraising training and assistance could help diversify funding sources.</li><li>Sharing more information on organizations could aid decision-making by staff, donors, and partners.</li><li>Further research into organizational improvements could build on this preliminary overview.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "nj9dkqrLYYdFTmeLJ", "postedAt": "2023-11-12T13:39:45.626Z", "postId": "Cvn6fwzdoLNLgTJif", "htmlBody": "<p>Hey Julia and Ozzie, thanks a lot for writing this! I enjoyed reading it and agree with your points, nice to see the gaps highlighted, hopefully it will lead to more people considering and starting these projects! I actually used the gap approach to start Impactful Animal Advocacy, and we now have a <a href=\"https://www.impactfulanimaladvocacy.org/slack\">very active Slack space</a> which the readers of this forum (interested in animal advocacy) are welcome to join. The main purpose is coordination and knowledge sharing in animal advocacy, and we also have a <a href=\"https://impactfulanimal.substack.com/\">regular newsletter</a> among other programmes like <a href=\"https://www.notion.so/impactfulaa/IAA-Wikis-ecaaecee16644b0b982dd23e2e377a77\">resource databases and wikis</a> (building these up at the moment).</p>", "parentCommentId": null, "user": {"username": "sofiabalderson"}}, {"_id": "s4ybkiENx7bt4WwA7", "postedAt": "2023-11-14T18:08:50.959Z", "postId": "Cvn6fwzdoLNLgTJif", "htmlBody": "<p>Thanks for linking! I've heard of IAA, happy to see community work here.&nbsp;</p>", "parentCommentId": "nj9dkqrLYYdFTmeLJ", "user": {"username": "oagr"}}]