[{"_id": "Y3zxkdcznNANs3otp", "postedAt": "2015-04-18T01:44:52.558Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>My understanding is that GWWC are working on an impact evaluation which will look at issues of membership attrition, so will hopefully cover the first bullet point. I'd guess the other ones will remain matters of conjecture until enough time has passed. Given the changes you are worried about happened in 2013-2014, they'd have to be disastrous to see much of a signal 1-2 years post. I agree the longitudinal data will be interesting over time. </p>\n<p>(If there is a drop off in 'member quality', though, it might be difficult to find out why: there's a plausible selection effect whereby the more committed people are likely to discover (and join) GWWC earlier. I'd guess the secular trend - regardless of strategic choices GWWC makes - is that later members are less likely to fulfil their pledges.)</p>\n<p>Although the change in the pledge precedes the massive spike in pledges, it played little causal role. A far more important event was the hugely successful recruitment event run by Ravi Patel and others, which recruited hundreds of people around the Christmas season. (<a href=\"https://www.facebook.com/events/1581545938749145/\">https://www.facebook.com/events/1581545938749145/</a>) </p>\n<p>(For disclosure: I'm a member of GWWC, formerly volunteered for them, and continue to donate to them directly. I'm not officially involved though, so please don't take my remarks as anything official - given how inept I generally am at remarking, I'm sure GWWC would want you to do the same!)</p>\n", "parentCommentId": null, "user": {"username": "Gregory_Lewis"}}, {"_id": "xPC7qZLhZx3HZSydw", "postedAt": "2015-04-18T10:05:17.365Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Thank you for this post. I agree with its central premise and I know that Michelle is already working on an impact evaluation that will contain a lot of this sort of information.</p>\n<p>However, your post contains a couple of misleading points that I thought would be worth correcting.</p>\n<ul>\n<li>The online-only pledge was launched on 4th April 2014, not in mid-2013, though there are a handful people who joined online in experiments before this date. (In your Internet Archive link the form has just been spread over 2 pages.) For what it's worth, the increased growth rate from around September 2013 coincided with Ben Clifford starting as Director of Community and encouraging people who had expressed an interest to join.</li>\n<li>The cause-neutral pledge wording was added to the website on 5th December 2014. As Greg mentioned, the huge spike in growth over the new year was due to over 100 new members from Ravi Patel's <a href=\"https://www.facebook.com/events/1581545938749145\">Facebook campaign</a>. Taking into account the growth rate since mid-January, this appears to be more-or-less unrelated to the pledge wording.</li>\n</ul>\n<p>For future reference, it may have been courteous to contact someone at Giving What We Can before posting this. In case that sounds intimidating I can assure you they are all very friendly :)</p>\n<p>(Disclosure: I manage Giving What We Can's website as a volunteer.)</p>\n", "parentCommentId": null, "user": {"username": "Jacob_Hilton"}}, {"_id": "8dZifAzwT8xzhHhsu", "postedAt": "2015-04-18T14:59:50.979Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>However, your post contains a couple of misleading points that I thought would be worth correcting.</p>\n</blockquote>\n<p>Thanks very much for this!</p>\n", "parentCommentId": "xPC7qZLhZx3HZSydw", "user": {"username": "Dale"}}, {"_id": "ZAi6de7d8Hcah9SXu", "postedAt": "2015-04-18T18:19:57.329Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Evaluating impact is very difficult, and Michelle has a really hard and thankless job to do.  I'm excited for the GWWC impact report and I'd be very understanding if it isn't entirely perfect, as ideas for measuring are hard to come by and even harder to execute.  I think it would have been more polite to suggest this to GWWC privately and get their feedback before publishing it here.</p>\n<p>I do think seeing cohort data would be pretty interesting, though, and I'm glad that you brought it up.</p>\n<p>Personally, my top concern is instead about counterfactuals.  Ravi Patel's Facebook campaign is amazing -- can you really move millions of dollars to charity through an FB event?!  It would seem unlikely.  I wonder if when GWWC opened the pledge, many people <em>already</em> giving 10% joined, as now they don't feel constrained by cause area.  (Of course these people may have been influenced by GWWC years before, especially if GWWC played an important role in the normalization of 10% as the EA giving schelling point.)  I know GWWC tracks &quot;how much would you have given if not for GWWC&quot; data, and I'm interested to see how that fits into the report.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "pdrAfwaKiKCaHAv6G", "postedAt": "2015-04-18T22:15:20.031Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Hi Dale, \nThanks for your post. It’s great to see someone take such a deep interest, and thank you for the specificity of your suggestions. As it happens, we’re about to put up an impact evaluation. I’m sorry it’s been a little while since the previous one (done by Nick Beckstead). I was hoping to do it a bit earlier, but was tied up finishing my PhD. It will address various points like what we might expect the value of a new member to be, and how this changes with different discount rates. I’ll take your comments, like about wanting to be able to follow individual cohorts, into consideration. We’ve also recently taken on a Community Director (Alison Woodman) who focuses on members – both to improve membership retention and to increase our understanding of our membership for impact evaluation purposes. So hopefully in the future our impact evaluations will be more thorough and frequent.</p>\n<p>Jacob’s already addressed the most pressing points. I just had a couple of other considerations: \nAs he said, the main thing in December was the Pledge event, which was amazing. Giving season and new year’s resolutions always cause a bit of a bump in membership too. </p>\n<p>I’m don’t think that we should think of members who joined under the newer pledge as ‘lower quality’. The new pledge is more general, but it is so in the sense that it is cause neutral. People who plan to donate to animal charities because they think that they can help fellow creatures even more by doing so seem every bit as serious in helping others effectively as those donating to eradicate extreme poverty. We’ve even had a couple of people join because of the change in the pledge who donate to poverty eradication charities, but who thought that we might in future find an even more effective cause than that, and wanted to make sure if they took a lifelong pledge they would definitely be able to keep it. These people seem at least as likely to continue donating as others. </p>\n<p>While I agree that it’s easier to join online than by sending off a letter, I’m less convinced that the new method of joining is going to be one which makes it less likely people feel engaged. We still send people a physical pledge form, to maintain the feeling of solidity. But doing it online means that an email immediately gets sent to the person, and we now make more effort to follow-up with and get to know members (which we have more capacity for because of the reduction in admin moving to the online system). </p>\n<p>By the way, you seem very comfortable with numbers, knowledgable and engaged – how would you feel about working with our research team? We’d be very grateful for the help! </p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "ckSWK7uDGcJrA3L86", "postedAt": "2015-04-19T00:24:36.690Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>I’m sorry it’s been a little while since the previous one (done by Nick Beckstead). </p>\n</blockquote>\n<p><a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/Steph%20Crampin/gwwc_2013_quantitative_performance_review_beckstead.pdf\">Here is that impact analysis</a>. It's well worth a read, particularly the section 'Overview of GWWC’s performance so far' as this speaks to many of Dale's questions.</p>\n", "parentCommentId": "pdrAfwaKiKCaHAv6G", "user": {"username": "Vincent_deB"}}, {"_id": "wNZMgBjZhrGwHf6gf", "postedAt": "2015-04-19T00:37:38.923Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p> I wonder if when GWWC opened the pledge, many people already giving 10% joined, as now they don't feel constrained by cause area.</p>\n</blockquote>\n<p>That seems clearly what'd happen, and from what I hear is what most people think. People who'd favoured non-poverty causes and who join in the months after that change are unlikely to be giving as a result of GWWC's work in those months after all, going out and convincing people to give to them from scratch. (Not to say that it's not valuable for them to record their giving, or that the moves away from poverty have been a mistake.)</p>\n", "parentCommentId": "ZAi6de7d8Hcah9SXu", "user": {"username": "impala"}}, {"_id": "9qHCaNDc7iA3miaYH", "postedAt": "2015-04-19T05:14:17.145Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Thanks for sticking your head out with this post, I've heard a lot of people express similar or stronger concerns but say they're too frightened about prompting a pile-on (or in some cases organised and tactical retaliation). One thing some of these people have said is that internal knowledge at and research by CEA reveals unflattering facts about the issues you've raised, but that CEA hides this from impact evaluations and isn't honest about it with donors. For example, people not donating and staying on the member lists, including prominent EAs.</p>\n", "parentCommentId": null, "user": {"username": "impala"}}, {"_id": "rCdpT7z73mnK7dCj2", "postedAt": "2015-04-19T05:42:35.005Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>o.O</p>\n", "parentCommentId": "9qHCaNDc7iA3miaYH", "user": {"username": "Peter_Hurford"}}, {"_id": "M47jARD2LiYRJCySM", "postedAt": "2015-04-19T11:05:01.875Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>I actually did roughly this analysis last year and have shared the results with some donors. At the time we didn't release it because we were still chasing up giving data from 2013 and without having completed donation reporting for that year we didn't have that many years' worth of data to report (i.e. it couldn't say anything about switching to allowing online sign-ups). It also simply takes a lot of work to polish up that kind of analysis to make sure you aren't publishing errors.</p>\n<p>It should be public at some point (as part of the impact evaluation Michelle is working on).</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "QRwYmx9tzvJqoXm56", "postedAt": "2015-04-19T11:06:49.169Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>That would have been my guess, but a surprising number of these new members came through Ravi's work, and wouldn't have even known about the change to the pledge. Michelle could give a more exact share.</p>\n", "parentCommentId": "wNZMgBjZhrGwHf6gf", "user": {"username": "Robert_Wiblin"}}, {"_id": "Mh42t9cRKsheTxM7i", "postedAt": "2015-04-19T11:17:32.260Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Concerns like these should be made publicly. If true, the wider community should know; if false, CEA should have the opportunity to refute them. </p>\n", "parentCommentId": "9qHCaNDc7iA3miaYH", "user": {"username": "Gregory_Lewis"}}, {"_id": "44XZgDGtGZc3jw9ys", "postedAt": "2015-04-19T14:51:31.501Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Hi Impala, I'm sorry you feel this way! I assure you we're actually all nice and not at all scary, so do feel free to contact us to discuss whatever you'd like. \nI don't know precisely what you're talking about, but I don't know of anyone you might be talking about as 'prominent EAs' who are both members of Giving What We Can and not donating. There are definitely people like Paul Christiano who support saving to donate later, because they think that the savings rate at the moment is unusually high and we're currently in an unusually good position to learn more, so that donating in the future will be even more valuable than now. But Paul is not a member, for that very reason. </p>\n", "parentCommentId": "9qHCaNDc7iA3miaYH", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "kSnPbfEEQDzhc5JXa", "postedAt": "2015-04-19T15:01:32.135Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>I just want to comment on the issue of new cohorts being more likely to drop out because they e.g. signed up online.</p>\n<p>I'm not sure if that will happen or not, but even if it does, I don't think it's such a bad thing. Let's say the retention rate for members who join on paper is 80%, and that for those who would only ever join online is 50%. While it would be a shame to have those online members start dropping out, that is still potentially a lot of extra members who we never would have had otherwise. If they never signed up at all, presumably fewer still would continue to give in the long term, because they would not have made any public commitment or received regular reminders from us about giving and updates on the latest research from us and GiveWell.</p>\n<p>In the early days of GWWC, having members 'drop out' was regarded as very bad. While I understand the reasons behind that, I think this is was a mistake. Being too cautious about accepting new members would prevent us from encouraging a large number of people to give more and give more effectively.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "7khK2s9vEGincDtnz", "postedAt": "2015-04-19T17:01:54.150Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Oh, does the GWWC central team know how many of these members were non-poverty people? What was Ravi’s work, was it something the GWWC team did to follow up changing the pledge?</p>\n", "parentCommentId": "QRwYmx9tzvJqoXm56", "user": {"username": "impala"}}, {"_id": "GYhfEpwwwfpNqNddq", "postedAt": "2015-04-19T17:04:21.071Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>I absolutely agree, like I suggested when complementing Dale for sticking his head out. (If that is the phrase? Google is ambiguous between “head” and “neck”.) I like to think I would state them myself, given the anonymity this forum allows, and I wouldn’t pay much social cost anyway as I don’t talk to EAs much any more now that I’m distant from the main EA centers. But like I said I’ve heard them second hand from a lot of people who wouldn’t want the sources to be guessed at. I’ll ask them if there’s anything I can post on their behalf in this thread.</p>\n<p>The one thing I have heard from people other than these people is about <em>some</em> of the EAs who don’t donate but stay on the member lists. That was still second hand however, from other people who weren’t criticising but might not like the implication that they were. I’m not sure it’s right to name individuals in this venue either, beyond identifying classes like “employees or trustees of organisations”. Ambiguity about what counts as a donation vs. self-serving may also be at play.</p>\n", "parentCommentId": "Mh42t9cRKsheTxM7i", "user": {"username": "impala"}}, {"_id": "ATDSCL3uk3i9bK59P", "postedAt": "2015-04-19T17:05:01.367Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Like I said to Gregory, I am limited in what I can say without violating confidences, but I personally wouldn’t find saying other things scary if it’s anonymous. Is there an anonymous way to send messages to you which doesn’t reveal my email (which contains the username I use around the Web)? </p>\n", "parentCommentId": "44XZgDGtGZc3jw9ys", "user": {"username": "impala"}}, {"_id": "dbymqArsqtNuvvZ7Q", "postedAt": "2015-04-19T17:20:04.449Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>This is starting to sound like it would be scary for me. I think Hauke may have made an anonymous feedback form for this purpose. I'll ask him. </p>\n", "parentCommentId": "ATDSCL3uk3i9bK59P", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "C3BXyR9f7wvHfStsW", "postedAt": "2015-04-19T19:00:50.532Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Impala, you can trivially set up a new gmail account to send anonymous email.</p>\n", "parentCommentId": "ATDSCL3uk3i9bK59P", "user": {"username": "RyanCarey"}}, {"_id": "JCuDLuQeWrpTXNLkN", "postedAt": "2015-04-19T20:18:10.885Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>I believe the updated pledging form asks people to specify the broad cause(s) they will donate to (eg poverty, animal suffering, existential risk), so that information would be readily available to the GWWC team. </p>\n<p>Ravi Patel is a medical student in Cambridge who independently led the enormously successful campaign to get new pledges as a New Years resolution. It was hosted in a Facebook group, and you can see here the people posting as they joined. \n<a href=\"https://www.facebook.com/events/1581545938749145/\">https://www.facebook.com/events/1581545938749145/</a>\nThis coincides with the Dec/jan spike on the chart above. </p>\n", "parentCommentId": "7khK2s9vEGincDtnz", "user": {"username": "Bernadette_Young"}}, {"_id": "osMHf7E4htSZn5LMZ", "postedAt": "2015-04-20T01:09:06.288Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Yup, I agree:</p>\n<blockquote>\n<p>Making it easier to join means more marginal people, with less attachment to the idea, can join. This is still good if their membership adds value, but they dilute the membership, which means we shouldn’t account for the average new member being signed up now as being equally valuable as the members who joined up in 2010. </p>\n</blockquote>\n<p>but just am concerned that this means our forecasts might overestimate the value of adding another member, causing relative over-investment.</p>\n", "parentCommentId": "kSnPbfEEQDzhc5JXa", "user": {"username": "Dale"}}, {"_id": "tznrZ7GcfMibo7mRs", "postedAt": "2015-04-20T01:09:32.448Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>It should be public at some point </p>\n</blockquote>\n<p>Glad to hear it!</p>\n<blockquote>\n<p>It also simply takes a lot of work to polish up that kind of analysis to make sure you aren't publishing errors.</p>\n</blockquote>\n<p>This should make publishing the raw/cohort data more appealing - CEA doesn't have to actually do the analysis itself, just maintain data integrity, which it should be doing as a matter of course.</p>\n", "parentCommentId": "M47jARD2LiYRJCySM", "user": {"username": "Dale"}}, {"_id": "jihHikfaWX4Gbwxg7", "postedAt": "2015-04-20T01:12:41.861Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Yes, fortunately I am both quite autistic and also don't know many EA people in person.</p>\n<blockquote>\n<p>isn't honest about it with donors.</p>\n</blockquote>\n<p>Yeah, there's an obvious problem whereby organizations with 'dirty secrets' will tend not to share them. As a result, in investment we tend to work out what they key metrics are and then assume the worst if companies don't release them. (Sovereigns can get a bit more leeway because they are incompetent and big). My understanding is that GiveWell uses a similar methodology of assuming the worst from the charities it looks at.</p>\n", "parentCommentId": "9qHCaNDc7iA3miaYH", "user": {"username": "Dale"}}, {"_id": "JXbNT8FSnRoojzEwT", "postedAt": "2015-04-20T01:13:50.716Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Upvoted for morally admirable concern for people's confidences.</p>\n", "parentCommentId": "ATDSCL3uk3i9bK59P", "user": {"username": "Dale"}}, {"_id": "7Mwq6BgYbAbqeFbWR", "postedAt": "2015-04-20T01:15:27.425Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>Here is that impact analysis.</p>\n</blockquote>\n<p>Your link just points to this post? </p>\n", "parentCommentId": "ckSWK7uDGcJrA3L86", "user": {"username": "Dale"}}, {"_id": "tYBW4EcySzccpxaDw", "postedAt": "2015-04-20T01:30:36.382Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Thanks for the response.</p>\n<blockquote>\n<p> As it happens, we’re about to put up an impact evaluation. </p>\n</blockquote>\n<p>Glad to hear it! I look forward to seeing the data.</p>\n<blockquote>\n<p>I’m don’t think that we should think of members who joined under the newer pledge as ‘lower quality’. ... People who plan to donate to animal charities because they think that they can help fellow creatures even more by doing so seem every bit as serious in helping others effectively as those donating to eradicate extreme poverty. </p>\n</blockquote>\n<p>Well, that's true unless you don't think animals count as 'others'. Presumably we should discount their value by whatever credence we place in animals counting as moral agents. A wide range of new focuses are now acceptable to GWWC members, and regardless of one's specific personal beliefs, it seems likely that some of those members will focus on something you don't personally think is very valuable. For example, it seems plausible that some people might (falsely) think that donating to a political party was the best way of helping people. Yet presumably no-one would think that increasing donations to both Democrat and Republican parties by $100 is equal to $200 going to AMF! </p>\n<p>However, my complaint wasn't really about the target of their donations - I assume that in practice most will mainly donate to AMF etc. anyway - but that they'll see a higher dropout rate. I don't think this concern can really be verified or refuted without seeing the data.</p>\n<blockquote>\n<p> But doing it online means that an email immediately gets sent to the person, </p>\n</blockquote>\n<p>This seems like a bit of a misnomer. People were always requesting a signup form online - you could combine paper forms in the post with an email saying 'Welcome ... the forms are on their way'.</p>\n<p>Your point about the overhead costs is a good one though. My impression is this could be outsourced - at least in the US I'm pretty sure there are firms that will deal with your mailing for you, but that still costs money.</p>\n<blockquote>\n<p>By the way, you seem very comfortable with numbers, knowledgable and engaged – how would you feel about working with our research team? We’d be very grateful for the help!</p>\n</blockquote>\n<p>Very kind of you. Unfortunately I work a more-than-full-time job, so can't really commit to anything. However, I get the impression that the EA community has a fair number of math-literate people who would be willing to work on relevant questions just out of interest if the data was available. In this case I'd probably analyse the cohort data if it was available - and the same probably goes for object-level issues as well. This would have a couple of advantages:</p>\n<ul>\n<li>Save CEA resources</li>\n<li>Get third parties more involved</li>\n<li>Provide independent evaluation, which is more credible than internal evaluation (in the same way that companies get independent auditors, etc.)</li>\n</ul>\n", "parentCommentId": "pdrAfwaKiKCaHAv6G", "user": {"username": "Dale"}}, {"_id": "Go8DdyxXuw8XG5qns", "postedAt": "2015-04-20T01:38:58.141Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>Michelle has a really hard and thankless job to do.</p>\n</blockquote>\n<p>It's not addressed to any one individual, but there was <a href=\"https://effectivereaction.wordpress.com/2014/11/15/happy-5th-birthday-giving-what-we-can/\">this</a>. Maybe I should have made it more personalized. </p>\n", "parentCommentId": "ZAi6de7d8Hcah9SXu", "user": {"username": "Dale"}}, {"_id": "AAkWQCzwaMzq9q5Z9", "postedAt": "2015-04-20T05:41:55.940Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p><a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/Steph%20Crampin/gwwc_2013_quantitative_performance_review_beckstead.pdf\">Fixed.</a></p>\n", "parentCommentId": "7Mwq6BgYbAbqeFbWR", "user": {"username": "Vincent_deB"}}, {"_id": "HGXzwpoMBt8mXvJkc", "postedAt": "2015-04-20T11:35:52.101Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Hi. I recently joined Giving What We Can as Director of Community and am very happy to answer member-related questions!</p>\n<p>Of the 83 people who became members between Dec 2014 - Jan 2015 after clicking 'attend' or 'maybe' on the Facebook event, 7 of these have said upon joining that they intend to give to non-poverty causes. There are an additional 7 members or so who joined during that period (bearing in mind the pledge change happened in early December) who also said they intend to give to non-poverty causes. </p>\n<p>So it seems the spike over Dec-Jan is attributable more to the Facebook event than to the broadening of the pledge, although that certainly had a noticeable effect. Having spoken to quite a few of those who joined because of the event, I'd guess that Rob is right that most of these were likely not aware of the pledge change.</p>\n<p>The pledge change and Ravi's work just happened to coincide - we hadn't heard from Ravi beforehand. He and a group of friends came up with the idea of a New Year pledging event and did most of the work themselves, though the GWWC team helped out.</p>\n", "parentCommentId": "7khK2s9vEGincDtnz", "user": {"username": "aliwoodman"}}, {"_id": "jL5Z5rqX2sPnDWEpK", "postedAt": "2015-04-20T15:32:21.337Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Thanks! We actually have had quite a few people with expertise go over the impact evaluation - as you say, it's pretty fun. I was thinking of other things we could do with more researchers on. Sounds like you're already plenty busy though! </p>\n", "parentCommentId": "tYBW4EcySzccpxaDw", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "gGC5Hb7HDG27twMzB", "postedAt": "2015-04-21T02:12:55.920Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<p>Thanks very much. Some interesting points:</p>\n<ul>\n<li>only 293 of 705 (41.6%) of the people who applied to join GWWC have returned their pledge forms.</li>\n<li>The fraction of people who claimed to be fulfilling the pledge in 2011 (I take it GWWC does not have tax receipts etc.) was basically unvarying by year of pledge: 64% of 2009 pledges, 71% of 2010 pledges and 64% of 2011 pledges. This suggests that the 'more keen people join first' and 'people drop out over time' effects perfectly canceled out. (Though the sample size is small). However 65-70% claimed retention after 0-2 years suggests a relatively short half-life for members.</li>\n</ul>\n", "parentCommentId": "AAkWQCzwaMzq9q5Z9", "user": {"username": "Dale"}}, {"_id": "jETc96kKbAKDJEJcK", "postedAt": "2015-04-21T05:59:08.442Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>Regardless of one's specific personal beliefs, it seems likely that some of those members will focus on something you don't personally think is very valuable</p>\n</blockquote>\n<p>The relevance of this isn't clear. Both before and after the change, every particular GWWC donor is giving to a charity that the donor likes but that some people don't consider maximally valuable. The question is whether the change made things worse. On average, I expect it made things better, since I expect cause neutrality to be helpful.</p>\n<p>Perhaps your point is that previously this impact was valuable to one constituency--people who prioritize development--whereas now the value is spread to a wider range of donors with a wider range of values. I can see why this might make fundraising harder, since it's a classic example of a public goods problem, but it doesn't seem to make the project less impactful overall.</p>\n<blockquote>\n<p>but that they'll see a higher dropout rate</p>\n</blockquote>\n<p>I expect that GWWC's dropout rate is increasing over time. I don't see why this change in particular would be expected to lead to a higher dropout rate. At face value, one might expect a broader pledge to have a lower dropout rate.</p>\n", "parentCommentId": "tYBW4EcySzccpxaDw", "user": {"username": "Paul_Christiano"}}, {"_id": "3moAWR3JeRPpS3Kpb", "postedAt": "2015-04-22T02:28:29.699Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>On average, I expect it made things better, since I expect cause neutrality to be helpful.</p>\n</blockquote>\n<p>I'm implicitly assuming that global poverty is an unusually uncontroversial cause. </p>\n<blockquote>\n<p>I don't see why this change in particular would be expected to lead to a higher dropout rate. At face value, one might expect a broader pledge to have a lower dropout rate.</p>\n</blockquote>\n<p>I guess in the limit if the pledge became sufficiently expansive it would become impossible to fail to comply!</p>\n<p>I think locally the effect is likely to be negative, though I don't have much confidence either way till we see the data. Nor do I see much value in speculating on this, save to encourage the release of such data.</p>\n", "parentCommentId": "jETc96kKbAKDJEJcK", "user": {"username": "Dale"}}, {"_id": "CSdbXZ7rP2yXfQkey", "postedAt": "2015-04-22T02:45:42.804Z", "postId": "CW3aDcuQ8dxCQP36J", "htmlBody": "<blockquote>\n<p>However 65-70% claimed retention after 0-2 years suggests a relatively short half-life for members.</p>\n</blockquote>\n<p>It occurs to me that, if true, this would have important implications for GWWC's marketing, namely that we should deemphasize students, as many of them would have dropped out before they start making bank, and increase the emphasis on mature targets.</p>\n", "parentCommentId": "gGC5Hb7HDG27twMzB", "user": {"username": "Dale"}}]