[{"_id": "Fyw3hwcxC9pB3iX5o", "postedAt": "2023-12-21T11:28:24.427Z", "postId": "Cw8dtPdRDgchb4h5B", "htmlBody": "<p>Could you give some examples of animal x-risk? And what I could do about it? How much to prioritize an issue depends on these more concrete things, not just abstract considerations.</p>\n<p>Also, are you having in mind extinction scenarios of a single species, or extinction scenarios of all mammals, or all non-human animal life?</p>\n", "parentCommentId": null, "user": {"username": "harfe"}}, {"_id": "A7sngfzSdcBuYEaJX", "postedAt": "2023-12-21T19:19:09.953Z", "postId": "Cw8dtPdRDgchb4h5B", "htmlBody": "<p>I am considering extinction scenarios for any and all species. I’m trying to understand why safeguarding against the extinction of humanity is prioritised, but this is not the case for any other species.</p>\n<p>As for examples, the IUCN Red List is the most comprehensive database that I’m aware of - assessing and reporting the extinction risk to 1000s of species worldwide. I have seen some criticism of this list however (notably that the approach used to assess risk lacks transparency), so wonder if the EA community would have some value to add here?</p>\n<p><a href=\"https://www.iucnredlist.org/\">https://www.iucnredlist.org/</a></p>\n<p>What you (or the EA community more generally) could do about it will vary from species to species. Interventions might range from tackling deforestation, to reducing harm from human waste, to lobbying against hunting/fishing…. the list of possible interventions is huge! Again, I wonder if the EA community might have value to add in identifying effective interventions?</p>\n<p>I’m not yet arguing for the EA community to do these things - just trying to understand what has been thought about/discussed by others, so I might better understand why this work is not prioritised.</p>\n", "parentCommentId": "Fyw3hwcxC9pB3iX5o", "user": {"username": "StephenRo"}}, {"_id": "GvrvvEbmmLbDEha23", "postedAt": "2023-12-21T20:26:36.295Z", "postId": "Cw8dtPdRDgchb4h5B", "htmlBody": "<p>I have seen very little discussions about these things in EA circles and I dont know of a thorough investigation. Maybe some EAs have briefly thought about it but think that the cause is not as important/tractable/neglected as other causes, without doing a long writeup.</p>\n<p>As for extinction of a single species, I imagine that moral factors are also at play here. Many people (including me), consider the extinction of homo sapiens to be much worse than the extinction of the \"wandering albatross\" (which I pulled from your linked list).</p>\n", "parentCommentId": "A7sngfzSdcBuYEaJX", "user": {"username": "harfe"}}, {"_id": "uwnWAd7vtR7npZJq5", "postedAt": "2023-12-22T18:51:02.232Z", "postId": "Cw8dtPdRDgchb4h5B", "htmlBody": "<p>I think there should be more discussions of animal x-risk and/or animal longtermism within EA. I  definitely care more about human extinction than animal extinction and think human extinction risk should be a <em>higher</em> priority, but that does not mean that animal extinction risk should not be considered. For example, I think considering both human and animal xrisk might change how much climate change is prioritised as an existential risk, and what interventions are worth focusing on for it (there are definitely more people focussing on climate change compared to other xrisks outside of EA, but that does not mean that the best interventions have been focussed on similar to the global poverty space).</p>\n<p>I don't have strong opinions on 'this should definitely be prioritised', but I think at least a few people should be researching this (to see if it is important/tractable/neglected/etc), and it should be discussed more than it currently is.</p>\n", "parentCommentId": "GvrvvEbmmLbDEha23", "user": {"username": "LinBowkerLonnecker"}}]