[{"_id": "YxYugCaz53G29Qa3Q", "postedAt": "2022-11-30T14:01:13.235Z", "postId": "CWAHovjrT4L9RStmm", "htmlBody": "<p>Amazing. Well done. I am proud of you!</p>\n<p>Thank you so much for sharing your experience, it's really helpful. I have previously wondered what the process looks like in the UK. I am sorry to hear about your mum.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "fpkXAefz9PZ4ZCbdc", "postedAt": "2022-11-30T14:21:53.857Z", "postId": "CWAHovjrT4L9RStmm", "htmlBody": "<p>This is great! Thanks so much for donating and for writing this guide/reflection!</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "J4uePA6CCE3roaEsN", "postedAt": "2022-12-01T20:27:41.004Z", "postId": "CWAHovjrT4L9RStmm", "htmlBody": "<p>+1. I'm super impressed by people who do this.</p>", "parentCommentId": "YxYugCaz53G29Qa3Q", "user": {"username": "Kevin Kuruc"}}, {"_id": "pH8PwykxB8qNWTAKh", "postedAt": "2022-12-04T20:47:05.358Z", "postId": "CWAHovjrT4L9RStmm", "htmlBody": "<p>Thanks for writing this!</p>\n<p>Your pre-screening steps look a little different <a href=\"https://forum.effectivealtruism.org/posts/RqWSkF7svb4GkgHAG/donating-a-kidney-uk-process\">to mine</a>, which could be a regional thing given we were both in the process at around the same time.</p>\n<p>Your guide is excellent! (And I have added a link to it from my much more hurried post :))</p>\n", "parentCommentId": null, "user": {"username": "Rasool"}}, {"_id": "EyaAzKusyGWihJHrp", "postedAt": "2022-12-05T20:28:00.369Z", "postId": "CWAHovjrT4L9RStmm", "htmlBody": "<p>Awesome, thanks for doing this!<br><br>Post summary (feel free to suggest edits):<br>Around 250 people on the UK kidney waiting list die each year. Donating your kidney via the UK Living Kidney Sharing Scheme can potentially kick off altruistic chains of donor-recipient pairs ie. multiple donations. Donor and recipient details are kept confidential.</p><p>The process is ~12-18 months and involves consultations, tests, surgery, and for the author 3 days of hospital recovery. In a week since discharge, most problems have cleared up, they can slowly walk several miles, and they encountered no serious complications.</p><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "bEdEsgLkRymSZFmJ3", "postedAt": "2023-06-19T20:38:04.166Z", "postId": "CWAHovjrT4L9RStmm", "htmlBody": "<p>Very interesting and thank you for posting.</p><p>I donated a couple of years ago and although I’m glad I did, I have been plagued with issues since waking up from the operation. I had severe constipation, and very quickly had a very bad infection in the main incision, which took weeks to heal. After care in the hospital was poor, intact it was pretty dire. If wasn’t for my GP, I think I would have been in a very dark place now. The staff at my GPs surgery we’re outstanding.</p><p>A couple of months went by that were quite grim at times and then a large Hernia appeared. I got straight on to the hospital, who always told me they‘d fix any problems that may arise, hernia being one of them. That last statement couldn’t be further from the truth. After numerous visits, I was asked if they could sign me off, I said no, not until I was fixed. The second from last consultant I saw initially told me that that it was as good as it gets, and some things go wrong and I’ll have to deal with it. I obviously said no, and that I want a second opinion.</p><p>After a while I eventually got to see a hernia &nbsp;specialist that said he could sort, but at best it will be early this year(2023). As of yet, nearly July, I haven’t heard a thing From them. My operation was two years ago now.</p><p>From the original consultation it has been a shambles, pre op there were three different surgeons that were going to do the op. Appointments were arranged, and one department not speaking to another, so certain tests seemed unplanned. Follow up calls and general communication was dire.</p><p>I am glad I have helped a complete stranger to have a better life by donating, but would I do it again, I don’t really know, and probably wouldn‘t.</p><p>Only thing I would say is really check out the hospital that is taking from you, mine was a prestigious NHS hospital that should have done better.&nbsp;<br>I feel that their interest in me, was only what they could get from me, and not my well-being. Almost as blunt as saying I was a slab of meat to them.</p>", "parentCommentId": null, "user": {"username": "Nell"}}]