[{"_id": "3fxnX8jr7a3it8whh", "postedAt": "2023-11-02T21:53:16.248Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>What are the stringent and permissive criteria for judging that someone has heard of EA?</p>", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "Y3ajvNExXdooLvxq2", "postedAt": "2023-11-03T05:24:36.550Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>Strongly agree. Given the question design (\"Are you familiar with effective altruism?\"), there's clear risk of acquiescence bias - on top of the fundamental social desirability bias of wanting to not appear ignorant to your interviewer.</p>", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "pu7atoP6N62khAtvC", "postedAt": "2023-11-03T09:46:35.451Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>The full process is described in our <a href=\"\">earlier post</a>, and included a variety of other checks as well.&nbsp;</p><p>But, in brief, the \"stringent\" and \"permissive\" criteria refer to respondents' open comment explanations of what they understand \"effective altruism\" to means, and whether they either displayed clear familiarity with effective altruism, such that it would be very unlikely someone would give that response if they were not genuinely familiar with effective altruism (e.g. by referring to using <i>evidence and reason</i> to <i>maximise the amount of good</i> done with your <i>donations</i> or <i>career</i>; or referring to specific EA figures, books, orgs, events etc.), or whether it was merely probable based on their comment that they had heard of effective altruism (e.g. because the responses were more vague or less specific).</p>", "parentCommentId": "3fxnX8jr7a3it8whh", "user": {"username": "David_Moss"}}, {"_id": "JBPbSpTrFTjkK3RTD", "postedAt": "2023-11-03T18:14:31.784Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>For sure, and just misunderstanding error could account for a lot of positive responses too - people thinking they know it when they don't.</p>\n", "parentCommentId": "Y3ajvNExXdooLvxq2", "user": {"username": "NickLaing"}}, {"_id": "iRmBT35t5FbqD6Efu", "postedAt": "2023-11-03T20:22:13.265Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>Agreed. As we note in <a href=\"https://forum.effectivealtruism.org/posts/CwKiAt54aJjcqoQDh/are-1-in-5-americans-familiar-with-ea#fnref1xzsj8b2q14\">footnote 2</a>:</p><blockquote><p>There are many reasons why respondents may erroneously claim knowledge of something. But simply put, one reason is that people like demonstrating their knowledge, and may err on the side of claiming to have heard of something even if they are not sure. Moreover, if the component words that make up a term are familiar, then the respondent may either mistakenly believe they&nbsp;<i>have</i> already encountered the term, or think it is sufficient that they believe they can reasonably infer what the term means from its component parts to claim awareness (even when explicitly instructed not to approach the task this way!).&nbsp;</p><p>For reference, in another check we included, over 12% of people claim to have heard of the specific term “Globally neutral advocacy”: A term that our research team invented, which returns no google results as a quote, and which is not recognised as a term by GPT—a large-language model trained on a massive corpus of public and private data. “Globally neutral advocacy” represents something of a canary for illegitimate claims of having heard of EA, in that it is composed of terms people are likely to know, and the combination of which they might reasonably think they can infer the meaning or even simply mistakenly believe they have encountered.&nbsp;</p></blockquote><p>I think this is one reason why \"effective altruism\" gets higher levels of claimed awareness than other fake or <a href=\"https://forum.effectivealtruism.org/posts/qQMLGqe4z95i6kJPE/how-many-people-have-heard-of-effective-altruism#Appendix_2__Reported_familiarity_with_terms__weighted_\">low incidence</a> terms (which people would be very unlikely to have encountered).</p><figure class=\"image\"><img src=\"http://res.cloudinary.com/cea/image/upload/v1667995971/mirroredImages/qQMLGqe4z95i6kJPE/eq6oacfvvj0gs0uho0mr.png\"></figure>", "parentCommentId": "JBPbSpTrFTjkK3RTD", "user": {"username": "David_Moss"}}, {"_id": "ajJi3RLXrxsariv57", "postedAt": "2023-11-23T02:13:37.661Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>Outsider here! I dropped out of grad school years ago and was never really involved in the \"elite\" academic or professional scene to which most EA members belong. The <i>term</i> \"effective altruism\" was familiar to me since my student days in the early '10s, but I didn't really know much about it until very recently (the whole OpenAI scandal brought it to my attention, and I decided to explore the philosophical roots of it all over the holiday).<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Hayven Jackson"}}, {"_id": "GQz6JgeXPNFFLMHZt", "postedAt": "2023-12-18T12:47:44.397Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>This is a very helpful post, thanks!&nbsp;<br><br>You write \"YouGov also report that respondents are ... overwhelmingly positive towards EA, with 81% of those who (claim to) have heard of EA approving or strongly approving of EA. Fortunately, this positive view is broadly in line with our own findings ... which we aim to report on separately at a later date\".&nbsp;<br><br>Could you give an ETA for that? Or could you provide further details? Even if you haven't got data for the Netherlands it'd help us make estimates, which will then inform our strategy. &nbsp;</p>", "parentCommentId": null, "user": {"username": "James Herbert"}}, {"_id": "eesQB2DHScytkqyaj", "postedAt": "2023-12-18T14:41:19.870Z", "postId": "CwKiAt54aJjcqoQDh", "htmlBody": "<p>Thanks!<br><br>We'll definitely be reporting on changes in awareness of and attitudes towards EA in our general reporting of EA Pulse in 2024. I'm not sure if/when we'd do a separate dedicated post towards changes in EA awareness/attitudes. We have a <a href=\"https://forum.effectivealtruism.org/posts/cMcEBSNiy4meDrmuE/rethink-priorities-needs-your-support-here-s-what-we-d-do#_1K____10K_per_research_work_to_allow_us_to_publish_our_backlog_of_research\">long list</a> (this list is very non-exhausive) of research which is unpublished due to lack of capacity. A couple of items on that list also touch on attitudes/awareness of EA post-FTX, although we have run additional surveys since then.</p><p>Feel free to reach out privately if there are specific things it would be helpful to know for EA Netherlands.</p>", "parentCommentId": "GQz6JgeXPNFFLMHZt", "user": {"username": "David_Moss"}}]