[{"_id": "dYhbLDfWii3CMwusJ", "postedAt": "2017-11-17T07:12:44.567Z", "postId": "Cyuq6Yyp5bcpPfRuN", "htmlBody": "<p>I'm not sure how useful this data is given that there are major distribution effects. ie. If I distribute the survey through Less Wrong, I'll find a lot of people who first heard of the movement through Less Wrong, ect.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "5Ec9NmEi2EPaPKQ7m", "postedAt": "2017-11-17T15:59:58.853Z", "postId": "Cyuq6Yyp5bcpPfRuN", "htmlBody": "<p>Yep, that is an issue. One idea might be to look at the data for each referral source (e.g., how everyone who heard about the survey through Facebook heard about EA, then how everyone who heard about the survey though SlateStarCodex heard about EA, etc.).</p>\n", "parentCommentId": "dYhbLDfWii3CMwusJ", "user": {"username": "Peter_Hurford"}}, {"_id": "SvZ9rZFeiqhDmmjhi", "postedAt": "2017-11-17T17:13:09.573Z", "postId": "Cyuq6Yyp5bcpPfRuN", "htmlBody": "<p>I agree, this is something we acknowledge multiple times in the post, and many times throughout the series. The level of rigor it would take to bypass this issue is difficult to reach.</p>\n<p>This is also why the section where we see some overlap with Julia's survey is helpful. </p>\n", "parentCommentId": "5Ec9NmEi2EPaPKQ7m", "user": {"username": "Tee"}}, {"_id": "2pu6JcFj8TJ6HhzXh", "postedAt": "2017-11-21T23:42:55.226Z", "postId": "Cyuq6Yyp5bcpPfRuN", "htmlBody": "<p>Re: Table 7 and the sentences\n&quot;As seen in Table 7, personal networking did not come out as the top source for actually getting people involved in EA, though it remains within the top five. Once introduced to EA, it would appear GiveWell, books and/or blogs, and 80,000 Hours are the three most potent ways to keep engage new EAs.&quot;</p>\n<p>The Personal Contact # is higher than the 80k hours # in the table (442 &gt; 423), so either the sentences or the table need to be corrected, I think.</p>\n", "parentCommentId": null, "user": {"username": "Gina_Stuessy"}}, {"_id": "Cv3gZxuWLmmcakQNz", "postedAt": "2017-11-25T10:52:54.248Z", "postId": "Cyuq6Yyp5bcpPfRuN", "htmlBody": "<p>Did SlateStarCodex even exist before 2009? I'm sceptical - the post archives only go back to 2013: <a href=\"http://slatestarcodex.com/archives/\">http://slatestarcodex.com/archives/</a>. Maybe not a big deal but does suggest at least some of your sample were just choosing options randomly/dishonestly.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "CsNBLkJxLzAEDdmDr", "postedAt": "2017-11-25T14:43:05.394Z", "postId": "Cyuq6Yyp5bcpPfRuN", "htmlBody": "<p>They could also be referring to earlier writing by the same author at other addresses.</p>\n", "parentCommentId": "Cv3gZxuWLmmcakQNz", "user": {"username": "RyanCarey"}}, {"_id": "f7pa8TdKjZ8P8ei5S", "postedAt": "2017-11-26T02:17:25.850Z", "postId": "Cyuq6Yyp5bcpPfRuN", "htmlBody": "<p>Yes - 80,000 Hours only briefly mentioned the survey at the end of one newsletter. If we had promoted it more heavily, we could have probably got more than twice as many submissions, and they would be more tilted towards people who first found out about EA from 80,000 Hours. As a comparison, our annual impact survey gets around 1000 responses each year, which would make it about the same size as this survey.</p>\n", "parentCommentId": "dYhbLDfWii3CMwusJ", "user": {"username": "Benjamin_Todd"}}]