[{"_id": "RdMSoXE35QGSXhHw5", "postedAt": "2022-10-27T00:35:24.287Z", "postId": "CZg7wSmLeaijwS4r7", "htmlBody": "<p>Can you give examples of how these techniques helped you be better at forecasting?</p><p>In lieu of this, my own opinion is that this is not a good way to become a better forecaster. I'd recommend people a) instead read notes on Superforecasting, b) read posts with the <a href=\"https://forum.effectivealtruism.org/topics/forecasting\">forecasting</a> tag on the Forum, c) &nbsp;concretely practice forecasting skills themselves by actually doing forecasts, d) do calibration exercises online and e) build various Fermi models for questions of interest.</p><p>Forecasting is at a pretty nascent and preparadigmatic stage, so there's still a lot of uncertainties left. Nonetheless, I do not think we're <i>entirely </i>lost, and my best guess is that most people who want to be better at forecasting can gain more from reading the existing literature and doing the known exercises than not doing this.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "n8roj2NsJkz9jnzDA", "postedAt": "2022-10-27T08:50:14.584Z", "postId": "CZg7wSmLeaijwS4r7", "htmlBody": "<h1>An answer to forecasting</h1><blockquote><p>Can you give examples of how these techniques helped you be better at forecasting?</p></blockquote><p>&nbsp;</p><p>Hmm, what has helped me be a better forecaster is developing a useful and small ontology in areas that interest me and then researching to validate specifics of it that lead quickly to useful predictions.I match ontological relations to research information to develop useful expectations about my current pathway.&nbsp;</p><p>As far as predictions relevant to EA's bigger picture doomy stuff, uhh, I have done a bit of forecasting (on climate at gjopen, you'll have to browse history there) and a bit of backcasting (with results that might not fit the forum's content guidelines), but without impact by doing so, as far as I know.</p><p>Linch, if you look at what I'm describing, it's not far from combining forward chaining to scenarios and backward chaining from scenarios, and people do that all the time. <strong>As far as how it helps my forecasting abilities, it doesn't. It &nbsp;helps my planning abilities.</strong></p><p>That said, I'm drawn to convenient mathematical methods to simplify complex estimates and want to learn more about them, and I am not trying to subvert forecasters or their methods. However, overall, the use of probability in forecasting mostly upsets me. I see the failure that it has meant for climate change policy, for example, and I get upset<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefjm8fka2j6b\"><sup><a href=\"#fnjm8fka2j6b\">[1]</a></sup></span>. But I think it's cool for simpler stuff with better evidence that doesn't involve existential or similar risks. &nbsp;</p><p>The rest of this is not specifically written for you, Linch, though it is a general response to your statements. I suspect that your words reflect a consensus view and &nbsp;common misinterpretation of what I wrote. &nbsp;Some EA community members are focused on subjective probabilities and forecasting of novel one-off extreme negative events. They take it seriously. I get that. If my ideas matter so little, I'm confident that they will ignore them.</p><h1><strong>EAs can use their forecast models to develop plans</strong></h1><p>To me, a prediction is meant to convey confidence in a particular outcome, so confidence that one event from a list of several will occur, given the current situation. Considering all possible future events as uncertain (unknown in their relative probability) is useful, as I wrote, to create a broad uncertainty about the future. To do so is not forecasting, obviously. However, for EA's, what I suggest does have application for the whole point of your work in forecasting.&nbsp;</p><p>You folks work on serious forecasts of novel events (like an existential threat to humanity, what you sometimes call a \"tail risk\") because you want to avoid them. Without experience of such situations in the past, you can only rely on models (ontologies) to guide your forecasts. Those models have useful information for planning in them, indirectly.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefboltwjc7aip\"><sup><a href=\"#fnboltwjc7aip\">[2]</a></sup></span>&nbsp;&nbsp;</p><h3>Remember to dislike ambiguous pathways into the future</h3><p>The problem I think any ethical group (such as the EA community) working to save humanity faces is that it can seem committed, in some respects, to ambiguous pathways that allow for both positive and negative futures.&nbsp;</p><ul><li>You want vibrant economies and alleviation of poverty and long life for all but you fear global resource losses and environmental destruction.</li><li>You want AGI to save us all but also fear that AGI will abuse or kill us all.</li><li>You want modern civilization and development across the natural world and increasing technology for treating disease, but you fear natural and man-made pandemics.&nbsp;</li><li>... and so on.</li></ul><p>As is, our pathways into the future are ambiguous, or are they? If they are not, then belief in some future possibilities drops to (effectively) zero or rises to one hundred percent. That's how you know that your pathway is unambiguously going toward some specific future. Apparently, for EA folks, our pathways remain ambiguous with respect to many negative futures. You have special names for them, extinction risks, existential risks, suffering risks, and so on.</p><h1>Use ontologies that inform your forecasts, but use them to create plans&nbsp;</h1><p>My post was getting at how to use the ontologies that inform your forecasts, but in as simple terms as possible. But here is another formulation:</p><ol><li><strong>Create a list of alternative, mutually exclusive events</strong> (you already have them in your models that you use to forecast events like existential risk from AGI)</li><li><strong>Don't bother with betting odds</strong> (you already have those in your models,so you ditch the subjective probability numbers temporarily).&nbsp;</li><li><strong>Examine your list of events</strong> (you rejected some as too unlikely, others as more or less likely)</li><li><strong>Put yourself in a mindset of </strong><i><strong>broad uncertainty about the future</strong> </i>(get back the mindset you tried to lose with your forecasting effort).<br><br>To do that, you might have to change your understanding of what you believe about the current situation and the likelihood of alternative futures (for example, by arbitrarily reversing those likelihoods and backtracking).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0ne3lglqy7w\"><sup><a href=\"#fn0ne3lglqy7w\">[3]</a></sup></span>&nbsp;</li><li><strong>Backtrack from futures you consider unlikely to their implications for the present </strong>(you EA folks reject plausible futures on the regular but you need to understand the present and its path to the future differently to see yourself on a pathway to such rejected futures)&nbsp;</li><li><strong>Examine the pathways to the events on your revised list </strong>(by this step you're supposed to have figured out how a strange present situation leads you to a desirable or undesirable future)</li><li><strong>Plan to exit negative pathways and enter positive pathways early </strong>(you now can see how far along you are and avoid negative futures and embrace positive ones. Disambiguate the pathways involved. Look for exclusively positive pathways.)</li></ol><h3>An EA shortcut to broad uncertainty about the future</h3><p>A lot of outcomes are not considered \"real\" for people until they have some sort of pivotal experience that changes their perspective. By flip-flopping the probabilities that you expect (for example, 98% chance of human extinction from AGI), you give yourself permission to ask:</p><p>&nbsp;\"What would that mean about the present, if that particular future were so &nbsp;likely?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref76m118hei2o\"><sup><a href=\"#fn76m118hei2o\">[4]</a></sup></span>\"</p><p>Now, I think the way that some people would respond to that question is:</p><p>\"Well, the disaster must have already happened and I just don't know about it in this hypothetical present.\"&nbsp;</p><p>If that's all you've got, then it is helpful to keep a present frame of reference, and go looking for different ideas of the present and the likely future from others. Your own mental filtering and sorting just won't let you answer the question well, even as a hypothetical, so find someone else who really thinks differently than you do.&nbsp;</p><p>\"Broad uncertainty\" does not imply that you think we are all doomed. However, since the chronic choice in EA is to think of unlikely doomish events as important, broad uncertainty about the future is a temporary solution. One way to get there is to temporarily increase your idea of the likelihood of those doomish events, and backtrack to what that must mean about the present<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref70inra9u62r\"><sup><a href=\"#fn70inra9u62r\">[5]</a></sup></span>. &nbsp;By responding to broad uncertainty you can make plans and carry out actions before you resolve any amount of the uncertainty.&nbsp;</p><h3>Using precondition information to change the future, in detail</h3><p>Once you collect information about preconditions for the various positive or negative events:</p><ul><li><strong>find the preconditions for the occurrence of various positive or negative events</strong> (for example, releasing GHG's in the atmosphere)</li><li><strong>study how to quickly exit the pathways that enable negative events</strong> (for example, reducing GHG's soon)</li><li><strong>study how to quickly enter the pathways that enable positive events</strong> (for example, beginning oil/gas conservation efforts now)</li></ul><p>Then, ideally, you, your group, your country, your global society, make that pathway change instead of procrastinating on that change and stressing a lot of people out.</p><h1>Conclusion</h1><p>So, what I presented earlier was just really shortform quality work on what could be called modeling, but is not forecasting. It is much simpler.</p><p>It's just a way to temporarily (only temporarily, because I know EA's love their subjective probabilities) withdraw from assigning probabilities to novel future events, events without earlier similar events to inform you of their likelihood.</p><ol><li>&nbsp;Start with just {A, not A} as your possible events</li><li>build that out to {A,B,C,D,...}&nbsp;</li><li>note which events are negative or positive&nbsp;</li><li>work on exiting or entering pathways toward events that you dislike or like, once you learn:</li></ol><ul><li>&nbsp;which pathways you are headed down</li><li>which pathways are ambiguous</li><li>what exit or entry points are present on various paths.</li></ul><p>It is important to return to your forecasts, take the list of compared alternative events in those forecasts, and learn more about how to avoid unfavorable alternatives, all while ignoring their likelihood. Those likelihood numbers could make you less effective, either by relieving you or discouraging you when neither's appropriate.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnjm8fka2j6b\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefjm8fka2j6b\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Policy-makers choose present and short-term interests repeatedly over longer-term concerns. In the case of climate change and environmental concerns in general, the last 50 years of policy have effectively doomed humanity to a difficult 21st century.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnboltwjc7aip\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefboltwjc7aip\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Not the prediction probabilities, those should be thrown out, for the simple reason that, even if they are accurate, when you're talking about the extinction of humanity, for example, the difference between a 1% and a 10% chance is not relevant to planning against the possibility.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0ne3lglqy7w\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0ne3lglqy7w\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Like most people, you could wonder what the point is of pretending that the unlikely is very likely. Well, what is the likelihood, in your mind, of having poor quality information about the present situation?</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn76m118hei2o\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref76m118hei2o\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Rather than you having to have such an experience yourself, for example,in the case of climate change, by helplessly watching a beloved family member perish in a heat wave, you just temporarily pretend that future extreme climatic events are actually very likely.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn70inra9u62r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref70inra9u62r\">^</a></strong></sup></span><div class=\"footnote-content\"><p>When you backtrack, you are going through your pathway in reverse, from the future to the present. You study how you got to where you ended up from where you are right now. You can collect this information from others. If they predict doom, how did it happen? From that, you learn about what steps not to take going forward.&nbsp;</p></div></li></ol>", "parentCommentId": "RdMSoXE35QGSXhHw5", "user": {"username": "Noah Scales"}}]