[{"_id": "jghN7cJFyJpwfgFLj", "postedAt": "2023-07-24T17:32:58.352Z", "postId": "D4khSueGA4Trebkks", "htmlBody": "<p>This article seems like a reasonable summary of the pause argument, although it relies a bit too heavily on the \"god-like AI\" hypothesis.&nbsp;</p><blockquote><p>Like playing chess against grandmaster Magnus Carlsen, we cannot predict the moves he will play, but we can predict the outcome: we lose.</p></blockquote><p>I've been seeing this analogy a lot lately, and I think it's bad. The more intelligent side of a conflict does not always win if the less intelligent side starts with a more advantageous position. I can easily beat stockfish in chess if I <a href=\"https://titotal.substack.com/p/when-do-brains-beat-brawn-in-chess\">take away it's queen</a>, and an angry bear can easily defeat me in a cage match, despite my PhD.&nbsp;</p><p>We know that Magnus will beat me in a fair game of chess because there is ample empirical evidence for this, in the forms of all his previous games against other players. That's why we know he is a grandmaster. There is no such empirical basis to know the outcome of a human-AI war.&nbsp;</p><p>Lastly, while we can't predict the <i>exact</i> moves Magnus will make, we can make <i>general</i> predictions about how the game will go. For example, we can confidently predict that he won't make obvious blunders, that his structure will probably be stronger, that he will capitalise on mistakes I make, etc.&nbsp;</p><p>I'm not saying it's absurd to think an AGI would win such a war (though I personally believe it is unlikely), just that if you do think the AGI would win, you have to actually prove it, not rely on faulty analogies.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "FBq8gvseK4naCjmdh", "postedAt": "2023-07-24T23:07:34.945Z", "postId": "D4khSueGA4Trebkks", "htmlBody": "<p>Well done Otto and Joep 👏🏼</p>", "parentCommentId": null, "user": {"username": "Yanni Kyriacos"}}, {"_id": "4HxukmKgLEB7Zua8A", "postedAt": "2023-07-27T09:42:11.996Z", "postId": "D4khSueGA4Trebkks", "htmlBody": "<p>As you recognise yourself in your linked <a href=\"https://titotal.substack.com/p/when-do-brains-beat-brawn-in-chess\">post</a>:</p><blockquote><p>the real world has secret information, way more possible strategies, the potential for technological advancements, defections and betrayal, etc. which all favor the more intelligent party.</p></blockquote><p>Also, consider that the AI has ingested ~all the world's information. That, to me, sounds like a huge resource advantage; a huge strategic advantage - it's not just more intelligent, it's more knowledgeable.</p><blockquote><p>It’s somewhat hard to outthink a missile headed for your server farm at 800 km/h.</p></blockquote><p>This actually made me think of the AI launching the missile, and the humans not having time to think (see <a href=\"https://smarterthan.us/terminator-versus-the-ai/\">this</a> or <a href=\"https://www.youtube.com/watch?v=w9npWiTOHX0&amp;t=2s&amp;ab_channel=FutureofLifeInstitute\">this</a>). The AI will have a huge speed advantage over us - we will basically be like <a href=\"https://twitter.com/AndrewCritchCA/status/1680461874171658242\">plants</a> or <a href=\"https://www.lesswrong.com/posts/Ccsx339LE9Jhoii9K/slow-motion-videos-as-ai-risk-intuition-pumps\">rocks</a> to it.</p><blockquote><p>if you do think the AGI would win, you have to actually prove it</p></blockquote><p>What would count as \"proof\" to you, short of an actual global catastrophe?</p>", "parentCommentId": "jghN7cJFyJpwfgFLj", "user": {"username": "Greg_Colbourn"}}]