[{"_id": "LS7SzD6yGw7KNMAKg", "postedAt": "2022-09-09T00:18:18.767Z", "postId": "D6oKe6kjHeBeiCtWn", "htmlBody": "<blockquote><p><strong>As we are engineers, we couldn’t help but start speculating and designing as our research progressed.</strong><a href=\"https://docs.google.com/document/d/1Y1f2-OMysvrSHhfJatVqR6nqmUPcB8-hNjotvOwUKaU/edit?usp=sharing\"> <u>See some of our speculative thoughts and drawings on Super PPE here :)</u></a></p></blockquote><p>Very interesting work, congrats! How does this design compare to existing alternatives in terms of cost, ease of manufacturing, and comfort?</p>", "parentCommentId": null, "user": {"username": "renanaraujo"}}, {"_id": "suKZQJahGxkJ44GJu", "postedAt": "2022-09-09T10:14:03.855Z", "postId": "D6oKe6kjHeBeiCtWn", "htmlBody": "<p>These are very early stage concepts to help us brainstorm more than anything – real designs will come about over a much longer development process, but will be particularly informed by the feasibility study we’re hoping to undertake. Cost, ease of manufacture and comfort are all key areas for us!</p>", "parentCommentId": "LS7SzD6yGw7KNMAKg", "user": {"username": "AndyGraham"}}, {"_id": "fpGEkTGYd7n4Jmqwm", "postedAt": "2022-09-09T10:34:29.988Z", "postId": "D6oKe6kjHeBeiCtWn", "htmlBody": "<p>Sounds like valuable work - good luck! I spotted this recent news story that might be relevant. Any thoughts?</p><p><a href=\"https://www.bbc.co.uk/news/health-62797775\">https://www.bbc.co.uk/news/health-62797775</a></p><blockquote><p><strong>Scientists have developed a virus-killing plastic that could make it harder for bugs, including Covid, to spread in hospitals and care homes.</strong></p><p>The team at Queen's University Belfast say their plastic film is cheap and could be fashioned into protective gear such as aprons.</p><p>It works by reacting with light to release chemicals that break the virus....</p><p>....The material was tested in the laboratory against four types of virus - two influenzas, the Covid virus and a picornavirus, which has the traits that make a virus highly stable outside the body.</p><p>In controlled laboratory conditions, about one million virus particles were placed on the self-sterilising plastic. This is far beyond the amount of virus that would be needed to start an infection.</p><p>\"It goes from one million viruses down to nothing, and we can see an effect in less than one hour and maximum death in two hours,\" said Dr Connor Bamford, from the school of medicine at Queen's.</p></blockquote>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "kyLkFXbdCcDmY3h3x", "postedAt": "2022-09-09T11:17:20.705Z", "postId": "D6oKe6kjHeBeiCtWn", "htmlBody": "<p>Thanks Matt, an initial skim of the paper shows some very interesting results, so we'll certainly look into it!</p>", "parentCommentId": "fpGEkTGYd7n4Jmqwm", "user": {"username": "AndyGraham"}}, {"_id": "f2DniTg2PiYPsFaJ7", "postedAt": "2022-09-09T14:54:57.133Z", "postId": "D6oKe6kjHeBeiCtWn", "htmlBody": "<p>Sounds great. As someone with no familiarity (but a lot of interest) in the field, I'd appreciate it if you included comparisons with the state of the art and existing alternatives in your analysis.</p>", "parentCommentId": "suKZQJahGxkJ44GJu", "user": {"username": "renanaraujo"}}, {"_id": "Qcgw6EzfAKAtQLnFB", "postedAt": "2023-03-23T23:22:47.659Z", "postId": "D6oKe6kjHeBeiCtWn", "htmlBody": "<p>Any update on how the project is going?</p>", "parentCommentId": null, "user": {"username": "egastfriend"}}]