[{"_id": "yEALvfMWGG6cBLKrW", "postedAt": "2022-11-17T19:39:44.805Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<blockquote><p>As Shakeel wrote&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/Et7oPMu6czhEd8ExW/why-you-re-not-hearing-as-much-from-ea-orgs-as-you-d-like\"><u>here</u></a>, the leaders of EA organizations can’t say a lot right now, and we know that’s really frustrating.&nbsp;</p></blockquote><p>** the leaders of EA organizations <i>are deciding not to</i> say a lot right now...&nbsp;</p>", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "HWhFq3TY9R6WEnBT3", "postedAt": "2022-11-17T19:54:43.329Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>Julia - thanks for a helpful update.</p><p>As someone who's dealt with journalists &amp; interviews for over 25 years, I would just add: if you do talk to any journalists for any reason, be very clear up front about (1) whether the interview is 'on the record', 'off the record', 'background', or 'deep background', (2) ask for 'quote approval', i.e. you as the interviewee having final approval over any quotes attributed to them, (3) possibly ask for overall pre-publication approval of the whole piece, so its contents, tone, and approach are aligned with yours. (Most journalists will refuse 2 and 3, which reminds you they are not your friends or allies; they are seeking to produce content that will attract clicks, eyeballs, and advertisers.)&nbsp;</p><p>Also, record the interview on your end, using recording software, so you can later prove (if necessary, in court), that you were quoted accurately or inaccurately.</p><p>If you're not willing to take all these steps to protect yourself, your organization, and your movement, DO NOT DO THE INTERVIEW.</p><p>This <a href=\"https://ethics.journalists.org/topics/interviewing/\">piece</a> is a useful resource about these terms and concepts.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "t7g2Yhm6LFmt4oxTQ", "postedAt": "2022-11-17T21:02:46.360Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>And there are <i>a lot </i>of reasons to decide not to say a lot right now.</p>", "parentCommentId": "yEALvfMWGG6cBLKrW", "user": {"username": "trevorw96"}}, {"_id": "Dipm3rNidLzh6amkL", "postedAt": "2022-11-17T21:05:59.856Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>Aside from recording the interview, which is illegal in some states if you don't tell them beforehand that you're doing it, I'm pretty sure none of this works. They just ignore it, lie and say whatever makes you feel safe, and treat it like a normal interview with no stipulations.</p><p>This is my memory from 2019 and my source might not have been reliable or up to date. This is not legal advice.</p>", "parentCommentId": "HWhFq3TY9R6WEnBT3", "user": {"username": "trevorw96"}}, {"_id": "kC94pxi73bCnj4PjE", "postedAt": "2022-11-17T22:57:07.797Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>I think this is overstated.&nbsp;</p><p>Many journalists are honorable and professional, and will follow the ethical norms of the profession. Some aren't honorable, and won't follow those norms.&nbsp;</p><p>If in doubt about someone's credibility and integrity, don't talk to them.&nbsp;</p><p>Generally speaking, if they're employed by a large, established news organization with a decent reputation (e.g. The Economist, NY Times, Financial Times), they have a fair amount to lose by violating journalistic ethics.</p><p>If they're freelance, or employed by an online sensationalist outlet that's notorious for slander (e.g. Gawker), then they have less to lose by violating journalistic ethics.</p>", "parentCommentId": "Dipm3rNidLzh6amkL", "user": {"username": "geoffreymiller"}}, {"_id": "sQMFb2Ef7eNePpYLS", "postedAt": "2022-11-18T00:21:13.654Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>See, e.g., Forbes,<i> </i><a href=\"https://www.forbes.com/sites/johnhyatt/2022/11/17/disgraced-crypto-trader-sam-bankman-fried-was-a-big-backer-of-effective-altruism-now-that-movement-has-a-big-black-eye/?sh=5e5a531b4ce7\"><i>Some Of Sam Bankman-Fried's Donations To Effective Altruism Nonprofits Tied To An Oxford Professor Are At Risk Of Being Clawed Back</i></a><i>:</i></p><blockquote><p>“The recent FTX scandal has, I think, caused a major dent in the confidence many in the EA Community have in our leadership,” <a href=\"https://forum.effectivealtruism.org/posts/RPTPo8eHTnruoFyRH/some-important-questions-for-the-ea-leadership\">wrote</a> Gideon Futerman, whose <a href=\"https://www.resiliencer.org/about-us\">small nonprofit</a> received money from the Future Fund, on the E.A. Forum.</p></blockquote><p>And also:</p><blockquote><p>Molly Kovite, legal operations manager for the Open Philanthropy foundation, a prominent E.A. group funded by Moskovitz (which does not have any ties to FTX), last Sunday <a href=\"https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation\">warned</a> nonprofits on the E.A. Forum, a popular message board for true believers (run by MacAskill’s center), that FTX grants made in the 90 days before bankruptcy are likely to be clawed back. Kovite added that it is “way too early to tell” whether other gifts made will be clawed back, but acknowledged that “larger transactions” would likely be targeted. On Wednesday, Open Philanthropy <a href=\"https://forum.effectivealtruism.org/posts/mCCutDxCavtnhxhBR/some-comments-on-recent-ftx-related-events\">announced on the E.A. forum</a> that it is taking applications and it may help fund charities that received money from FTX.</p></blockquote>", "parentCommentId": null, "user": {"username": "Jonas Vollmer"}}, {"_id": "s9nbnvcrCPtid6vqC", "postedAt": "2022-11-18T00:21:29.414Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>Thanks for this post. However, one of the first things that came to mind was the EA Forum itself.<br><br>It is completely public, much EA discourse happens here, and a lot of people use their real names/full names (I believe this is even encouraged). Clearly forum communication is not intended to be the same as an interview, and that it can't be quoted as an interview (I expect/hope - I have no experience with journalism), and I think many people will already be bearing this in mind. It is also hard to prove of course who it is who is actually commenting, and whether people are using their own names, so it is less reliable there than an actual interview.&nbsp;<br><br>But the advice for talking to journalists seems to be for everyone in EA thinking about giving an interview, and generally I see it being very easy for a journalist to go on the forum and use that as a source (even including screenshots).&nbsp;<br><br>People being able to have discussions is one of the best things about the forum in my mind, and it's good for people to be able to express their views without self-censoring. But also, anything written on the internet in public is clearly public.&nbsp;<br><br>I'm sure there are some nuances here. Does anyone have thoughts on this?</p>", "parentCommentId": null, "user": {"username": "LinBowkerLonnecker"}}, {"_id": "n5ZL6inNAohu4EbSo", "postedAt": "2022-11-18T00:55:46.217Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>Incidentally, Jonas Vollmer's comment on this forum post (can't seem to link it sorry, at time of writing it is the comment above mine) gives example(s) where an EA Forum post has been directly quoted by Forbes.&nbsp;<br><br>e.g. <a href=\"https://www.forbes.com/sites/johnhyatt/2022/11/17/disgraced-crypto-trader-sam-bankman-fried-was-a-big-backer-of-effective-altruism-now-that-movement-has-a-big-black-eye/?sh=5e5a531b4ce7\">https://www.forbes.com/sites/johnhyatt/2022/11/17/disgraced-crypto-trader-sam-bankman-fried-was-a-big-backer-of-effective-altruism-now-that-movement-has-a-big-black-eye/?sh=5e5a531b4ce7</a><br>&nbsp;</p><p>Anyone know what can and can't be quoted? Is everything quotable? Is there any permission required?</p>", "parentCommentId": "s9nbnvcrCPtid6vqC", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "pdvAndEdcAK8CWotA", "postedAt": "2022-11-18T01:50:40.671Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>Everything that's posted on the EA Forum is public, and so journalists can (and often will) quote it. (Though obviously a <i>lot</i> of stuff is posted on the forum, and most of it won't get attention from journalists!).</p>", "parentCommentId": "n5ZL6inNAohu4EbSo", "user": {"username": "Shakeel Hashim"}}, {"_id": "SpkW3dGk34ahXLN7i", "postedAt": "2022-11-18T01:54:36.305Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>With the caveat that there are at least several hundred different legal jurisdictions in the world, I don't see an obvious reason under U.S. law others can't quote forum posts. The forum is public and accessible to the world, so there's no plausible tort involving intrusion on private affairs. Forum posts and comments may well be copyrighted -- but the doctrine of fair use pretty clearly allows reasonable quotation in news articles. I don't see how quotation would be legally different from quoting a tweet. Pasting someone's treatise of several thousand words might well be a different story.</p><p>To me, the biggest risk as a journalist to quoting is that you have no independent verification of who wrote the post/comment. If the journalist attributed a controversial quote to an identifiable real person, and it turns out the post was written by someone masquerading as the real person, there could be some liability there if the real person suffered reputational damage.</p>", "parentCommentId": "n5ZL6inNAohu4EbSo", "user": {"username": "Jason"}}, {"_id": "KCPj2ZarRaQBZ5m6f", "postedAt": "2022-11-18T05:23:16.353Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<blockquote><p>My colleague&nbsp;<a href=\"https://www.centreforeffectivealtruism.org/team/shakeel-hashim\">Shakeel Hashim</a>&nbsp;at CEA is focused on communications for all of EA, not CEA in particular.</p></blockquote><p>&nbsp;</p><p>Are there any mechanisms in place to ensure that Shakeel’s work prioritizes the interests of&nbsp;&nbsp;“all of EA, not CEA in particular”? I think these interests will generally, but not always, be aligned. The recent&nbsp;<a href=\"https://twitter.com/KerryLVaughan/status/1590918219455307776\">allegations that multiple &nbsp;CEA board members were aware of SBF behaving unethically at Alameda in 2018</a> (as well as <a href=\"https://forum.effectivealtruism.org/posts/Et7oPMu6czhEd8ExW/why-you-re-not-hearing-as-much-from-ea-orgs-as-you-d-like?commentId=eCeFqu8YofsNcmhhp\">community requests for comments</a> on those allegations) seem like an important area of potential misalignment.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "BeSttqfFHftwKoJWW", "postedAt": "2022-11-18T09:32:49.789Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>This post just seems like a snarky way of saying you disagree with their decision, but without offering any actual arguments against.</p>\n", "parentCommentId": "yEALvfMWGG6cBLKrW", "user": {"username": "Michael_PJ"}}, {"_id": "yqKH3tgDSXvjCojqy", "postedAt": "2022-11-18T09:38:39.903Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>Habryka offers an argument <a href=\"https://forum.effectivealtruism.org/posts/Et7oPMu6czhEd8ExW/why-you-re-not-hearing-as-much-from-ea-orgs-as-you-d-like?commentId=eCeFqu8YofsNcmhhp\">here</a>:</p><blockquote><p>It's been a few more days, and I do want to express frustration with the risk-aversion and guardedness I have experienced from CEA and other EA organizations in this time. I think this is a crucial time to be open, and to stop playing dumb PR games that are, in my current tentative assessment of the situation, one of the primary reasons why we got into this mess in the first place.&nbsp;<br><br>...</p></blockquote>", "parentCommentId": "BeSttqfFHftwKoJWW", "user": {"username": "Greg_Colbourn"}}, {"_id": "nGyyYvpnJrpY5LLea", "postedAt": "2022-11-18T09:59:46.525Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>In my brief and unwanted <a href=\"https://forum.effectivealtruism.org/posts/CJJDwgyqT4gXktq6g/long-term-future-fund-april-2019-grant-recommendations?commentId=i25aoM4AE9WcXTrX2\">foray with the media</a>, I had people in my building called \"noisy fuckers\" in a quote printed by <a href=\"https://archive.ph/OOlME#selection-747.159-747.172:~:text=his%20guests.%20%E2%80%9CThey%E2%80%99re-,noisy%20fuckers,-%2C%E2%80%9D%20he%20grumbles%20of\">The Economist</a> (perhaps because we weren't cooperative with them and didn't give them an interview on the record), &nbsp;got <a href=\"https://forum.effectivealtruism.org/posts/CJJDwgyqT4gXktq6g/long-term-future-fund-april-2019-grant-recommendations?commentId=i25aoM4AE9WcXTrX2\">doorstepped when I was expecting a phone call</a>, and had a bunch of <a href=\"https://ceealar.org/media/\">inaccuracies</a> printed by The Times. Always remember <a href=\"https://en.wikipedia.org/wiki/Michael_Crichton#GellMannAmnesiaEffect\">Gell Mann Amnesia</a> is a thing when reading newspapers!</p>", "parentCommentId": "kC94pxi73bCnj4PjE", "user": {"username": "Greg_Colbourn"}}, {"_id": "gP9rAiBxmQR6GBS3J", "postedAt": "2022-11-18T10:54:52.391Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>This is a really important point.  It might make sense to talk to journalists in order to contextualize what you said on the EA Forum -- or to ask them not to use something!</p>\n<p>Answering in writing should help with the \"foot in mouth\" problem.  You can ask them to send questions, and say you don't promise to answer all of them.</p>\n<p>A journalist reached out to me recently and this is basically what I did; no regrets so far at least.</p>\n<p>IMO \"try to respond in writing\" should be standard advice when dealing with journalists.  Past that, I remember a Less Wrong user once created a (public) thread specifically for taking journalist questions; that seems like a good way to discourage misrepresentation.</p>\n", "parentCommentId": "s9nbnvcrCPtid6vqC", "user": {"username": "John_Maxwell_IV"}}, {"_id": "ykKvfDLrYypLSsfmm", "postedAt": "2022-11-20T18:31:13.371Z", "postId": "D7tkpztwmgg3KrykY", "htmlBody": "<p>I really like the idea of asking for a public written thread for Q &amp; A from a journalist to avoid misrepresentation.</p>", "parentCommentId": "gP9rAiBxmQR6GBS3J", "user": {"username": "Greg_Colbourn"}}]