[{"_id": "oQD5sAF5938cAgFgT", "postedAt": "2023-05-15T18:46:39.132Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<blockquote>\n<p>Alternatively, worldview diversification can be understood as an attempt to approximate expected value given a limited ability to estimate relative values. If so, then the answer might be to notice that worldview-diversification is a fairly imperfect approximation to any kind of utilitarian/consequentialist expected value maximization, and to try to more perfectly approximate utilitarian/consequentialist expected value maximization. This would involve estimating the relative values of projects in different areas, and attempting to equalize marginal values across cause areas and across years.</p>\n</blockquote>\n<p>I think this is the interpretation of worldview diversification that makes the most sense, and I see two major difficulties with your alternative:</p>\n<ol>\n<li>\n<p>The total funding amounts are not constant over time, so it doesn't make sense to equalize marginal values across time. In a year where funding decreases (e.g. FTX) all marginal values should be higher than in the previous year. And since there's no clearcut relationship between total funding and marginal values, I don't see any way to set the marginal values to be consistent across years, at least not with the information we have.</p>\n</li>\n<li>\n<p>More importantly, a relatively fixed funding pool (or at least a non-shrinking one) is kind of a requirement for a healthy ecosystem of projects and organizations. If the animal welfare funding bucket bounced between $100 million and $20 million and $300 million year to year, it would be really hard to actually get any animal welfare organizations up and running for an extended time.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "3r3eyHDeHgEetDwjz", "postedAt": "2023-05-15T19:42:51.932Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>Re: 1: Yes, the post considered a situation where funding streams are known, for simplicity. But when they are unknown, you could do <i>expected</i> marginal relative values. This would require some forecasting infrastructure which doesn't exist. But the solution in that case still doesn't seem like it would be worldview diversification.</p>", "parentCommentId": "oQD5sAF5938cAgFgT", "user": {"username": "NunoSempere"}}, {"_id": "p5ByRdNiDZdCMBkyB", "postedAt": "2023-05-15T20:16:34.203Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>I don't think this is actually a problem, for roughly <a href=\"https://www.lesswrong.com/s/4hmf7rdfuXDJkxhfg/p/5KHz6AMvMbqq8bunq\">the reasons described here</a>. I.e. worldview diversification can be seen as a way of aggregating the preferences of multiple agents—but this shouldn't necessarily look like maximizing any given utility function.</p><p><a href=\"https://www.lesswrong.com/posts/6QPFKHRsuY63cuJwh/making-decisions-using-multiple-worldviews\">I also talk about this here</a>.</p>", "parentCommentId": null, "user": {"username": "richard_ngo"}}, {"_id": "LJzpetHamD5c34pst", "postedAt": "2023-05-15T20:44:21.520Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>Re: 2: Yes, I agree. I think you could deal with this in various ways, e.g., calculating the expected relative values of committed vs floating funding, or doing the rebalancing every few years instead of all the time. But I also think that there is some meaningful difference between a) the underlying framework, and b) how you choose to go about it, and I think this post was more about a)</p>", "parentCommentId": "oQD5sAF5938cAgFgT", "user": {"username": "NunoSempere"}}, {"_id": "QTeX7wxB3kvKz6PTj", "postedAt": "2023-05-15T21:03:41.951Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>I agree that things could be such that the reflective equilibrium was that, but it would really surprise me. In particular, Open Philanthropy has a sole funder. It's one guy. It would surprise me if his preference about things was such that he wanted to leave Pareto improvements on the table. Not impossible, but it feels like a stretch. Of course I'm missing a whole lot of context, so ¯\\_(ツ)_/¯.</p><p>Or, in other words, if things were such as in your post, I would expect to see trade (even though you <a href=\"https://www.lesswrong.com/s/4hmf7rdfuXDJkxhfg/p/Xht9swezkGZLAxBrd#Against_Independence\">could set up things</a> such that it doesn't happen). I would not expect to see a U-turn on <a href=\"https://nunosempere.com/blog/2022/06/16/criminal-justice/\">criminal justice</a>. Instead, I think the worldview diversification thing as implemented by Open Phil is more like a historical accident.</p>", "parentCommentId": "p5ByRdNiDZdCMBkyB", "user": {"username": "NunoSempere"}}, {"_id": "euhKveMMELYua9nw6", "postedAt": "2023-05-15T21:26:10.624Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>The Pareto improvements aren't about worldview diversification, though. You can see this because you have exactly the same problem under a single worldview, if you keep the amount of funding constant per year. You can solve this by letting each worldview donate to, or steal from, its own budget in other years.</p><p>I do think trade between worldviews is good in addition to that, to avoid the costs of lending/borrowing; the issue is that you need to be very careful when you're relying on the worldviews themselves to tell you how much weight to put on them. So for example, if every year the AI risk worldview gets more and more alarmed, then it might \"borrow\" more and more money from the factory farming worldview, with the promise to pay back whenever it starts getting less alarmed. But the whole point of doing the bucketing in the first place is so that the factory farming worldview can protect itself from the possibility of the AI risk worldview being totally wrong/unhinged, and so you can't assume that the AI risk worldview is just as likely to update down as to update upwards.</p><p>You could avoid this by having the AI risk worldview make concrete predictions about what would make it more or less alarmed. But now this is far from a \"simple\" scheme, it requires doing a bunch of novel intellectual work to pin down the relevant predictions.</p><p>Re the U-turn on criminal justice: no matter what scheme you use, you should expect it to change whenever you have novel thoughts about the topic. Worldview diversification isn't a substitute for thinking!</p>", "parentCommentId": "QTeX7wxB3kvKz6PTj", "user": {"username": "richard_ngo"}}, {"_id": "vguWKXHvbQ27SjhHu", "postedAt": "2023-05-15T21:34:23.747Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<blockquote><p>You can see this because you have exactly the same problem under a single worldview, if you keep the amount of funding constant per year. You can solve this by letting each worldview donate to, or steal from, its own budget in other years.</p></blockquote><p>Good point! I think my objection then is that I do want relative values to not be \"dangling\". Also, I do care about expected values, so there are some interesting trades where you bet all of your budget which you couldn't do just by borrowing from your future stream.</p>", "parentCommentId": "euhKveMMELYua9nw6", "user": {"username": "NunoSempere"}}, {"_id": "yq9CFCeaqgiynudNP", "postedAt": "2023-05-15T21:37:18.350Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>One reason to see \"dangling\" relative values as principled: utility functions are equivalent (i.e. produce the same preferences over actions) up to a positive affine transformation. Hence why we often use voting systems to make decisions in cases where people's preferences clash, rather than trying to extract a metric of utility which can be compared across people.</p>", "parentCommentId": "vguWKXHvbQ27SjhHu", "user": {"username": "richard_ngo"}}, {"_id": "LP6gCyeKMBPfyWheo", "postedAt": "2023-05-15T21:42:59.361Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<blockquote><p>So for example, if every year the AI risk worldview gets more and more alarmed, then it might \"borrow\" more and more money from the factory farming worldview, with the promise to pay back whenever it starts getting less alarmed. But the whole point of doing the bucketing in the first place is so that the factory farming worldview can protect itself from the possibility of the AI risk worldview being totally wrong/unhinged, and so you can't assume that the AI risk worldview is just as likely to update down as to update upwards.</p></blockquote><p>Suppose that as the AI risk worldview becomes more alarmed, you are paying more and more units of x-risk prevention (according to the AI risk worldview) for every additional farmed animal QALY (as estimated by the farmed animal worldview). I find that very unappealing.</p>", "parentCommentId": "euhKveMMELYua9nw6", "user": {"username": "NunoSempere"}}, {"_id": "sQdbAKrwvhwSJw7hi", "postedAt": "2023-05-15T21:52:58.215Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>I'm not sure whether the following example does anything for you; it could be that our intuitions about what is \"elegant\" are just very different:</p><p>Imagine that I kill all animals except one Koala. Then if your worldview diversification which had some weight on animals, you would spend the remaining of that worldview on the Koala. But you could buy way more human QALYs or units of x-risk work per unit of animal welfare.</p><p>More generally, setting up things such that sometimes you would end up valuing e.g., a salmon as 0.01% of a human and other times as 10% of a human just seems pretty inelegant.</p>", "parentCommentId": "yq9CFCeaqgiynudNP", "user": {"username": "NunoSempere"}}, {"_id": "KQM9TvZwJefQjntPq", "postedAt": "2023-05-15T22:09:25.012Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>I notice myself being confused about why trades have to happen at the OpenPhil level. I think Pareto Optimality in trades works best when there are more actors aggregating and talking. It's sad that donor lotteries have died out to an extent and so much regranting discourse is around internal EA social dynamics rather than impact in and of itself.&nbsp;</p>", "parentCommentId": null, "user": {"username": "zichenghuang"}}, {"_id": "EJHtedevp5b9ZHkD6", "postedAt": "2023-05-15T22:31:02.866Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>I like the <a href=\"https://forum.effectivealtruism.org/posts/4wdZAozqJqEYazBnt/the-property-rights-approach-to-moral-uncertainty\">Property Rights Approach</a>, which is a formalization of resource buckets to separate representatives of theories, proportional to credences in the theories they represent. The representatives can make trades with or borrow from each other based on urgency if they agree to it. I don't think it <i>necessarily</i> has any issues with Pareto optimality, as long as you can force Pareto optimal cooperation. That being said, I think there are still some issues with the approach that need to be worked out.</p><blockquote><p>Alternatively, worldview diversification can be understood as an attempt to approximate expected value given a limited ability to estimate relative values. If so, then the answer might be to notice that worldview-diversification is a fairly imperfect approximation to any kind of utilitarian/consequentialist expected value maximization, and to try to more perfectly approximate utilitarian/consequentialist expected value maximization. This would involve estimating the relative values of projects in different areas, and attempting to equalize marginal values across cause areas and across years.</p></blockquote><p>I think this would assume away one of the main theoretical challenges of moral/normative uncertainty, which is the absence of an uncontroversial common scale to use across normative theories to measure them all against. If you expect such a common scale to exist and be uncontroversial when found, it seems like you're committed to some minimal moral realism, at least about the scale. Whether or not you're committed to that, you'd still have the problem of deciding which scale to use <i>now</i> given multiple candidates, which is basically the same as the original problem for moral/normative uncertainty.</p><p>See discussions of \"intertheoretic comparisons\".</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "Ry3LHj3codRkWAHCh", "postedAt": "2023-05-15T22:52:19.798Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<blockquote><p>it seems like you're committed to some minimal moral realism</p></blockquote><p>I don't think I have. In particular, from a moral relativist perspective, I can notice that Open Philanthropy's funding comes from one person, notice that they have some altruistic &amp; consequentialist inclinations and then wonder about whether worldview diversification is really the best way to go about satisfying those.&nbsp;</p><p>Or even simpler, I could be saying something like: \"as a moral relativist with consequentialist sympathies, this is not how I would spend my billions if I had them, because I find the dangling relative values thing inelegant.\"</p>", "parentCommentId": "EJHtedevp5b9ZHkD6", "user": {"username": "NunoSempere"}}, {"_id": "abZqewdsswuDR4NTi", "postedAt": "2023-05-15T23:09:33.548Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>Fair.</p>\n<p>(I still stand by the rest of my comment, and that you're assuming away some moral/normative uncertainty, and maybe most of the problem.)</p>\n", "parentCommentId": "Ry3LHj3codRkWAHCh", "user": {"username": "MichaelStJules"}}, {"_id": "ycQ7G7iqsJo5FNQMN", "postedAt": "2023-05-15T23:14:35.064Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>I agree that this, and your other comment below, both describe unappealing features of the current setup. I'm just pointing out that in fact there are unappealing outcomes all over the place, and that just because the equilibrium we've landed on has some unappealing properties doesn't mean that it's the wrong equilibrium. Specifically, the more you move towards pure maximization, the more you run into <a href=\"https://forum.effectivealtruism.org/posts/T975ydo3mx8onH3iS/ea-is-about-maximization-and-maximization-is-perilous\">these problems</a>; and as Holden points out, I don't think you can get out of them just by saying \"let's maximize correctly\".</p><p>(You might say: why not a middle ground between \"fixed buckets\" and \"pure utility maximization\"? But note that having a few buckets chosen based on standard cause prioritization reasoning is <i>already</i> a middle ground between pure utility maximization and the mainstream approach to charity, which does way less cause prioritization.)</p>", "parentCommentId": "LP6gCyeKMBPfyWheo", "user": {"username": "richard_ngo"}}, {"_id": "bMCY6ZPtGfBqfTKgX", "postedAt": "2023-05-15T23:17:56.238Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<blockquote><p>I can notice that Open Philanthropy's funding comes from one person</p></blockquote><p>One person may well have multiple different parts, or subscribe to multiple different worldviews!</p><blockquote><p>asking oneself how much one values outcomes in different cause areas relative to each other, and then pursuing a measure of aggregate value with more or less vigor</p></blockquote><p>I think your alternative implicitly assumes that, as a single person, you can just \"decide\" how much you value different outcomes. Whereas in fact I think of worldview diversification as actually a pretty good approximation of the process I'd go through internally if I were asked this question.</p>", "parentCommentId": "Ry3LHj3codRkWAHCh", "user": {"username": "richard_ngo"}}, {"_id": "AvcJb3nYpfWXypuCR", "postedAt": "2023-05-15T23:51:56.066Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>I think the post from Holden that you point to isn't really enough to go from \"we think really hardcore estimation is perilous\" to \"we should do worldview diversification\". Worldview diversification is fairly specific, and there are other ways that you could rein-in optimization even if you don't have worldviews, e.g., adhering to deontological constraints, reducing \"intenseness\", giving good salaries to employees, and so on.</p>", "parentCommentId": "ycQ7G7iqsJo5FNQMN", "user": {"username": "NunoSempere"}}, {"_id": "KnjxbTjqCs8K4pRN6", "postedAt": "2023-05-15T23:52:43.352Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<blockquote><p>decide</p></blockquote><p>not \"decide\", but \"introspect\", or \"reflect upon\", or \"estimate\". This is in the same way that I can estimate probabilities.</p>", "parentCommentId": "bMCY6ZPtGfBqfTKgX", "user": {"username": "NunoSempere"}}, {"_id": "Bb67kqi8irjB5ECXz", "postedAt": "2023-05-16T05:12:20.792Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>Donor lotteries have died out? RCG got its seed funding from a donor lottery last December.</p>\n", "parentCommentId": "KQM9TvZwJefQjntPq", "user": {"username": "Jsevillamol"}}, {"_id": "KiRjFMJMWRLBoBdDt", "postedAt": "2023-05-16T17:06:57.301Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>This is one reason why you should use normatively defined worldviews to define your buckets, not cause areas. Animal welfare interventions currently dominate on some worldviews that include nonhuman animals and assign them substantial weight. Those worldviews aren't (almost ever) going to assign an average nonhuman animal many times more average weight than the average human. The animal-inclusive worldviews also care terminally at least about as much about any human as the panda, and assuming they are impartial and maximizing in some way, the panda won't get any help from us (unless it benefits humans substantially; humans might care more about the last panda than the average human).</p>\n<p>Each worldview (and buckets may reflect aggregates of such worldviews) has its own claim on the relative average value of humans and salmons. Those claims can change with new information, but in the usual ways, not because there are fewer salmons or because fewer salmon are helped per $ now than before.</p>\n<p>There can be worldviews where the marginal cost-effectiveness of GiveWell interventions are close to the marginal cost-effectiveness of the best nonhuman animal-focused interventions, and small changes to the situation can shift resources from humans towards nonhumans or vice versa. I think most worldviews won't be like that, though, and will instead have large gaps in marginal cost-effectiveness (going either way).</p>\n<p>Open Phil has worldview buckets (<a href=\"https://www.openphilanthropy.org/research/update-on-cause-prioritization-at-open-philanthropy/\">https://www.openphilanthropy.org/research/update-on-cause-prioritization-at-open-philanthropy/</a>), including an animal-inclusive bucket, but no animal-only bucket. This might look like cause area buckets instead, but what they're trying to approximate are in fact worldview buckets.</p>\n", "parentCommentId": "sQdbAKrwvhwSJw7hi", "user": {"username": "MichaelStJules"}}, {"_id": "EA8yMHqHHk24iQTby", "postedAt": "2023-05-16T17:28:05.422Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<p>You're assuming there's a unique coherent and (e.g. vNM) rational value system there to find or settle on, rather than multiple (possibly incoherent) systems to try to weigh and no uniquely best (most satisfying) way to combine them into a single coherent (vNM) rational system. That's assuming away most of the problem.</p>\n<p>Maybe this post can help illustrate better:\n<a href=\"https://reducing-suffering.org/two-envelopes-problem-for-brain-size-and-moral-uncertainty/\">https://reducing-suffering.org/two-envelopes-problem-for-brain-size-and-moral-uncertainty/</a></p>\n<p>FWIW, I also find estimating unique/precise probabilities objectionably unjustifiable for similar reasons, although less bad than assuming away the hard problem of moral uncertainty.</p>\n", "parentCommentId": "KnjxbTjqCs8K4pRN6", "user": {"username": "MichaelStJules"}}, {"_id": "w9hukhvLamTjq3FCD", "postedAt": "2023-05-16T17:40:45.776Z", "postId": "DAD4777WJqFe9jZZM", "htmlBody": "<blockquote><p>including an animal-inclusive bucket, but no animal-only bucket</p></blockquote><p>Good point!</p>", "parentCommentId": "KiRjFMJMWRLBoBdDt", "user": {"username": "NunoSempere"}}]