[{"_id": "rPnF4EBJ7Qvy22M9E", "postedAt": "2022-12-21T17:14:23.772Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Thanks for sharing this review.</p><p>I'm a bit surprised to see a 'What went badly?' section without at least mentioning FTX. Even a very small mistake in this area would be vastly more important that cost overruns at EAG. Similarly, you mention the criticism contest, but in retrospect I think a red-teaming contest with <a href=\"https://forum.effectivealtruism.org/topics/criticism-and-red-teaming-contest\">&gt;200 entries</a> that failed to surface FTX risk was a disappointment.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "8FohhLevjFARxSRrJ", "postedAt": "2022-12-21T18:09:02.696Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Agree about the contest. <a href=\"https://forum.effectivealtruism.org/posts/YgbpxJmEdFhFGpqci/winners-of-the-ea-criticism-and-red-teaming-contest?commentId=NX6fGAeW7ZeQrfKEB#NX6fGAeW7ZeQrfKEB\">Something was submitted</a> but it wasn't about blowup risk and didn't rise to the top.</p>", "parentCommentId": "rPnF4EBJ7Qvy22M9E", "user": {"username": "technicalities"}}, {"_id": "GhNP2rSuwsGASDEHN", "postedAt": "2022-12-21T18:31:08.149Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Hi Larks, as we mentioned in the post (especially the last two sections) we're actively reflecting on what, if anything, we should have done differently around FTX. I'm not yet confident what the conclusion of that will be, so it seemed premature to include it in the mistakes section, but maybe we should have mentioned it still.&nbsp;</p><p>Once we're done with our reflection, we'll share more about our takeaways and (if necessary) update our mistakes page etc.</p>", "parentCommentId": "rPnF4EBJ7Qvy22M9E", "user": {"username": "Maxdalton"}}, {"_id": "igJ8ovdQSbdNrBppj", "postedAt": "2022-12-21T18:58:13.420Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>They do mention FTX in the section on community health, the text reads as if they're still trying to figure out what went badly there.</p>\n", "parentCommentId": "rPnF4EBJ7Qvy22M9E", "user": {"username": "Jeroen_W"}}, {"_id": "NogjdFowuoHND8rbm", "postedAt": "2022-12-21T19:03:53.438Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Re criticism contest, agree that it's a disappointment that that contest didn't surface more criticism of FTX. I also think that overall it drove some meaningful and useful criticism of core EA ideas and institutions, and that's worth highlighting. Not sure if we got the right balance between those two sides in the post.</p>", "parentCommentId": "rPnF4EBJ7Qvy22M9E", "user": {"username": "Maxdalton"}}, {"_id": "xfT4oed2ymxpaTFuj", "postedAt": "2022-12-21T21:17:44.077Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>This update would be more useful if it said more about the main catastrophe that EA (and CEA) is currently facing. For whatever reasons, maybe perfectly reasonable, it seems you chose the strategy of saying little new on that topic, and presenting by and large the updates on CEA's ordinary activities that you would present if the catastrophe hadn't happened. But even given that choice, it would be good to set expectations appropriately with some sort of disclaimer at the top of the doc.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "mC9xpQZodnKE2auJv", "postedAt": "2022-12-21T21:40:20.747Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Several nitpicks:</p>\n<ul>\n<li>\"2022 was a year of continued growth for CEA and our programs.\" - A bit of a misleading way to summarise CEA's year?</li>\n<li>\"maintaining high retention and morale\" - to me there did seem to be a dip in morale at the office recently</li>\n<li>\"[EA Forum] grew by around 2.9x this year.\" - yes, although a bit of this was due to the FTX catastrophe</li>\n<li>\"Overall, we think that the quality of posts and discussion is roughly flat over the year, but it’s hard to judge.\" - this year, a handful of people told me they felt the quality had decreased, which didn't happen in previous years, and I noticed this too.</li>\n<li>\"Recently the community took a significant hit from the collapse of FTX and the suspected illegal and/or immoral behaviour of FTX executives.\" - this is a very understated way to note that a former board member of CEA committed one of the largest financial frauds of all time.</li>\n</ul>\n<p>I realise there are legal and other constraints, so maybe I am being harsh, but overall, several components of this post seemed not very \"real\" or straightforward relative to what I would usually expect from this sort of EA org update.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "vs67AwZbwMAwoyYJQ", "postedAt": "2022-12-22T10:35:56.293Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Thanks - that’s a good point. We do discuss this in the latter sections of the post, but I think you’re right that we should have mentioned it up front to set expectations.</p>", "parentCommentId": "xfT4oed2ymxpaTFuj", "user": {"username": "Maxdalton"}}, {"_id": "XJeBB9p2waGpHxEXg", "postedAt": "2022-12-22T10:37:21.953Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Hey Ryan, thanks for writing this up - keen to explain this and reflect more.</p><p>First, I do think that I could have written this post better: e.g. given the disclaimer about not focusing on FTX up front.</p><p>I think that a lot of this is a substantive disagreement about how CEA’s year went, which I think might be driven by a substantive disagreement about what CEA&nbsp;<i>is</i>.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefteqans7485b\"><sup><a href=\"#fnteqans7485b\">[1]</a></sup></span></p><p>I’m aware that some people (possibly including you) have a model that’s a bit like “CEA is responsible for what happens in the EA community. A big bad thing happened to the EA community, so CEA is responsible, and so they had a pretty bad year.” (I expect that this is a bit of an oversimplification of your view, but hopefully it helps make the direction clear.)</p><p>An oversimplification of my view is “CEA is responsible for running EAG, EAGx, UGAP, groups support, virtual programs, the EA Forum, EA.org. A couple of these things had middling years, but many of them seemed to grow or improve significantly (like 5x, 2.9x growth). So CEA had a pretty good year, and “a year of continued growth” is a good summary.”</p><p>The key way in which that is an oversimplification is that the Community Health &amp; Special Projects team does have a broader mandate: scanning for risks and trajectory changes to the community and trying to address them. As mentioned in that section, we clearly didn’t prioritise or eliminate this risk - we’re reflecting on how much that was a mistake, versus a good decision (to focus on other significant risks). We are reflecting on what we should do differently to reduce this and related risks in the future, and we’ll communicate more about that in due course. As I say in response to Larks, there may well be things that we end up thinking were big mistakes here, that should cause us to course-correct (and should go on our mistakes page). But we’re not yet confident in if/what the mistakes were, so we didn’t want to add them in this post yet. I should have noted that in that section though - I’ll go and edit.</p><p>So one way I think of this is, should CEA’s annual review be kinda the same thing as EA’s annual review? If I were writing EA’s annual review, there would be a bunch of negative stuff in there, and the overall tone would be pretty different to the above. If this is what CEA’s annual review should be, I did a pretty bad job and you’re right.</p><p>Or should it be more like Rethink Priorities<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefld3lffas5r9\"><sup><a href=\"#fnld3lffas5r9\">[2]</a></sup></span>&nbsp;annual review? I think that Rethink Priorities could reasonably be like “Our core work went well! (Footnote: though it's impact may be attenuated by one of EA’s major funders blowing up in a very visible way. We’ll reflect on what that changes for us.)” I think there’s a legit version of CEA’s annual review that is like this, if you view CEA as more being responsible for running EAG, groups support, etc.</p><p>Overall, I think that CEA is clearly somewhere in between these extremes - we’re more focused on and accountable for how EA overall goes than RP are. But my current take, based on how I view CEA's role/mandate, is that it’s a bit more on the “Rethink Priorities” end, whereas I guess you think it’s more on the “EA annual review” end. I expect that this partly explains why I took a different approach to the annual review.</p><p>Going through your nitpicks:</p><ul><li>Agree that morale dipped around FTX stuff. My impression is that it’s more back-to-normal, but we should probably have noted this. (And I think it’s a caveat to the overall thing of “doubled the team size and maintained morale/retention” thing though.)</li><li>Yep, some of the growth was due to FTX attention (but again, this feels like a bit of a footnote - a significant majority of the growth was not to do with FTX, and I think that the FTX growth was an example of the Forum providing real value, by helping people to process the news).&nbsp;</li><li>This is a fair point about Forum quality - I’m aware that some people think this. Our current take, having looked into this a bit and looked over top post lists from previous years, is that the quality is pretty constant but that people are struggling to find the most interesting posts as post volume has increased. This is still a problem, and something that we’re looking to fix. I think that this is an important amendment to the statement in the post, and something I’ll correct.</li><li>Understatement of the FTX thing - I agree the tone is maybe a bit bland here, but I’m not sure it really understates it? “Community took a significant hit” seems about the right level.&nbsp;</li></ul><p>To sum up, despite the big-picture disagreement above, I think that you’re right that we should have added a bit more on the setbacks and caveats to the big picture. But my perspective is that the big picture on CEA's year really is positive.<br>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnteqans7485b\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefteqans7485b\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;As a meta point, I’m aware that I’m clearly biased to think that CEA went well, and to want to say that CEA went well. This post is an attempt to accurately convey the big picture as I see it, but I’m aware that I may be biased here! I think that I can speak somewhat definitively to how I view CEA’s scope though.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnld3lffas5r9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefld3lffas5r9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I chose Rethink Priorities kind of at random as an example - this could be many EA orgs, and I don't mean it to reflect anything &nbsp;on RP in particular.</p></div></li></ol>", "parentCommentId": "mC9xpQZodnKE2auJv", "user": {"username": "Maxdalton"}}, {"_id": "bd5sPbZHGdkQh49jF", "postedAt": "2022-12-22T12:25:56.704Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Thanks for the response. Out of the four responses to nitpicks, I agree with the first two. I broadly agree about the third, forum quality. I just think that peak post quality is at best a lagging indicator - if you have higher volume and even your best posts are not as good anymore, that would bode very poorly. Ideally, the forum team would consciously trade off between growth and <em>average</em> post quality, and in some cases favouring the latter, e.g. performing interventions that would improve the latter even if they slowed growth. And the fourth, understatement, I don't think we disagree that much.</p>\n<p>As for summarising the year, it's not quite that I want you say that CEA's year was bad. In one sense, CEA's year was fine, because these events don't necessarily reflect negatively on CEA's current operations. But in another important sense, it was a terrible year for CEA, because these events have a large bearing on whether CEA's overarching goals are being reached. And this could bear on on what operating activities should be performed in future. I think an adequate summary would capture both angles. In an ideal world (where you were unconstrained by legal consequences etc.), I think an annual review post would note that when such seismic events happen, the standard metrics become relatively less important, while strategy becomes more important, and the focus of discussion then rests on the actually important stuff. I can accept that in the real world, that discussion will happen (much) later, but it's important that it happens.</p>\n", "parentCommentId": "XJeBB9p2waGpHxEXg", "user": {"username": "RyanCarey"}}, {"_id": "RhzdX7qTrcKDBYqwY", "postedAt": "2022-12-22T15:47:43.866Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<blockquote><p>Ideally, the forum team would consciously trade off between growth and&nbsp;<strong>average</strong> post quality [emphasis added]</p></blockquote><p>I disagree. I think the metric I care about is “quality of the average post&nbsp;<strong>that a person reads.</strong>”</p><p>The Forum will have a long tail of posts that are written by newbies just exploring some area for the first time, or are kinda confused, or are bad takes, etc. Many of these posts are net positive! I’m rather in favor of people having their learning experiences in public. Many times the comments on those posts are good places to recapitulate the best of EA. The good news is that most of those posts don’t get much karma or readership. I’m sure you can think of posts that you don’t like that got lots of karma. There’s a complex conversation to be had there, I hope Lizka will post her draft on that soon. But I’m talking more about the much more common post that sits at 0-20 karma. There are lots of them. But they’re by and large pretty harmless. I don’t want my metric to be reducing them.</p>", "parentCommentId": "bd5sPbZHGdkQh49jF", "user": {"username": "jpaddison"}}, {"_id": "rRmyX36ADya7Lxk52", "postedAt": "2022-12-22T17:23:30.062Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Totally, this is what I had in mind - something like the average over posts based on how often they are served on the frontpage.</p>\n", "parentCommentId": "RhzdX7qTrcKDBYqwY", "user": {"username": "RyanCarey"}}, {"_id": "pmLs5778sAjTYzJgv", "postedAt": "2022-12-23T00:15:30.918Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>On a positive. Cool <a href=\"https://data.centreforeffectivealtruism.org/\">dashboard</a> &nbsp;:p<br>More pls.</p>", "parentCommentId": null, "user": {"username": "George Vii"}}, {"_id": "ypCj85PBqhurmGLsx", "postedAt": "2022-12-23T03:12:24.580Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Which criticisms did you find meaningful or useful?&nbsp;</p>", "parentCommentId": "NogjdFowuoHND8rbm", "user": null}, {"_id": "Le7tfDzyRFtFSsAte", "postedAt": "2022-12-23T03:38:09.229Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>I don't know how many people use RSS feeds, but they interact somewhat poorly with this, because the algorithmic post prioritization does not affect RSS readers.</p>", "parentCommentId": "rRmyX36ADya7Lxk52", "user": {"username": "Larks"}}, {"_id": "GfWS5dsKRyBw375Ms", "postedAt": "2022-12-23T04:54:38.292Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Not sure if this fully helps but you can use a karma cutoff for the RSS feed</p>\n", "parentCommentId": "Le7tfDzyRFtFSsAte", "user": {"username": "Peter_Hurford"}}, {"_id": "EL3XqnAFjCeFW3per", "postedAt": "2022-12-23T05:04:40.245Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>I don't mean for me personally - I just mean it will bias the web analytics, because low-karma posts will look like they make up a smaller fraction of impressions than in reality (assuming most RSS feed users do not apply such a cutoff).</p>", "parentCommentId": "GfWS5dsKRyBw375Ms", "user": {"username": "Larks"}}, {"_id": "iRst8xz489z4xLJ6S", "postedAt": "2022-12-23T10:01:13.658Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>\"Our attempts in late 2021 and early 2022 to support top uni groups didn’t pay off as we hoped, and we passed on this strand of work to Open Philanthropy in early 2022.\"</p><p>\"One downside of handing top university support over to Open Philanthropy is that they only supply funding to groups. We are beginning to&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/BXeNWzEGv58MhJ9wt/cea-uni-group-team-strategy-for-the-next-quarter\"><u>investigate</u></a> whether we can provide advice, support, and retreats to top university groups and group organizers of well established groups.\"</p><p>I'm a bit confused by this pair of points. &nbsp;What was the problem? &nbsp;Why was OP a better fit for this task? &nbsp;How is the support you're now looking to provide different from the support which didn't pay off as you had hoped? &nbsp;How will you avoid duplicating work with OP?</p>", "parentCommentId": null, "user": {"username": "RobertJones"}}, {"_id": "pkrqNk4fsmbBrmKNN", "postedAt": "2022-12-23T18:51:33.041Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>You can read a bit more about why we did this <a href=\"https://forum.effectivealtruism.org/posts/xTWhXX9HJfKmvpQZi/cea-is-discontinuing-its-focus-university-programming\">here</a>. We handed the funding side off to OP, and we hoped someone else would take on the support side, but no-one did. OP are currently handling funding only, and we would work on support only, which reduces much of the risk of duplication.</p><p>I'll ask someone on the groups team to explain more about why we're more optimistic about our approach now.</p>", "parentCommentId": "iRst8xz489z4xLJ6S", "user": {"username": "Maxdalton"}}, {"_id": "9kborc8wd35cnQEu6", "postedAt": "2022-12-23T20:52:05.751Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<blockquote><p>As mentioned in that section, we clearly didn’t prioritise or eliminate this risk - we’re reflecting on how much that was a mistake, versus a good decision (to focus on other significant risks).&nbsp;</p></blockquote><p>Hm, if you don’t mind the question — what are other significant risks you are thinking about? IMO, the FTX fraud scheme is a big deal if anything deserves to be called a big deal, from what I’ve read in the <a href=\"https://www.wsj.com/livecoverage/stock-market-news-today-12-22-2022/card/read-prosecutors-and-regulators-legal-filings-against-sam-bankman-fried-caroline-ellison-and-gary-wang-pxQTiv3TVavUk8TskrvJ\">devastating legal documents about the situation</a>, and given how SBF was framed as a poster child of EA and was a significant funder.</p><p>The only more significant risk I can think of is EA funding dangerous AI capabilities research via Anthropic, but that isn’t even unrelated to FTX (since FTX slash Alameda slash their leadership was Anthropic’s main funder). Also, my guess is that mitigating AI risk is not within the Community Health team’s scope.&nbsp;</p>", "parentCommentId": "XJeBB9p2waGpHxEXg", "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "tJmRxEu5SudRq6gye", "postedAt": "2022-12-24T00:36:58.709Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Hi Robert,<br><br>Thanks for the questions!&nbsp;<br><br>I am just adding a quick response now because I think Max’s response does a good job of covering most of your questions. I would be happy to expand if you like, though.<br><br>We are more optimistic now because, as mentioned, the landscape is quite different and we are testing out focusing on different types of support than before. For example, we are not currently planning on restarting the campus specialist program but are investigating things like group organizer retreats for top universities (which was a more well-received aspect of the campus specialist program).</p>", "parentCommentId": "iRst8xz489z4xLJ6S", "user": {"username": "jessica_mccurdy"}}, {"_id": "nDamxyXH5xNaAFzSb", "postedAt": "2022-12-25T09:50:14.863Z", "postId": "DajpFcaMrHv4fPLTy", "htmlBody": "<p>Thanks for the update! It would be interesting to get more statistics on CEA. Like</p>\n<ul>\n<li>by how many people CEA has grown with. (I guess it's something between 15 and 35 but there's quite a big difference)</li>\n<li>how big a budget do you have?</li>\n<li>how do you allocate employees/budget/hours between the projects/areas and how has this changed?</li>\n</ul>\n<p>(Maybe these exist elsewhere?)</p>\n", "parentCommentId": null, "user": {"username": "Karla Still"}}]