[{"_id": "kLM9bJcDgH2fggDB8", "postedAt": "2023-10-11T19:29:33.037Z", "postId": "Dajsp3iGkgmrELHyF", "htmlBody": "<p>Great work! I really like the conditional reasoning test idea; it's something I hadn't really thought about in this context. I haven't reviewed the questions in detail yet but any thoughts on whether they'd be suitable for an application process?</p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "zXzXsGrabb8yztNbA", "postedAt": "2023-10-12T08:45:30.887Z", "postId": "Dajsp3iGkgmrELHyF", "htmlBody": "<p>I'm curious how strongly your scale would correlate with contructs that sound very similar to scout mindset, such as <a href=\"https://www.mdpi.com/2079-3200/11/2/27\">actively open-minded thinking</a> and <a href=\"https://seaver.pepperdine.edu/social-science/content/comprehensive-intellectual-humility.pdf\">intellectual humility</a>. There are probably also scales out there that tap into truth-seeking as a motive. I bring this up because one problem that we're experiencing in (social) psychology is the staggering number of constructs and scales that are being introduced even though most of the variance in these differences is already captured by existing constructs (for example, \"grit\" got a lot of attention for predicting various performance outcomes, but it seems like it's mostly repackaged conscientiousnss).&nbsp;</p><p>Maybe there's something unique to the scout mindset idea - I don't have that deep of an understanding of what it entails and how this overlaps with existing constructs, so it's definitely worth checking out and I'm curious what you'll find. For example, you could test if your scale predicts a lot of variance in some reasoning/judgment outcome that should be determined by scout mindset even after you control for actively open-minded thinkung and intellectual humility. There's is also this cool tool where you can input the items of your scale and it shows how much it overlaps with existing scales: https://rosenbusch.shinyapps.io/semantic_net/.</p>", "parentCommentId": null, "user": {"username": "bxjaeger"}}, {"_id": "vqxuRwaDT3RxiET9B", "postedAt": "2023-10-14T04:05:13.564Z", "postId": "Dajsp3iGkgmrELHyF", "htmlBody": "<p>Nice post! Can we have the answers for the conditional reasoning test?</p>", "parentCommentId": null, "user": {"username": "Joe91"}}, {"_id": "Bd9MfuNoM2ShhW7rc", "postedAt": "2023-11-24T23:21:37.729Z", "postId": "Dajsp3iGkgmrELHyF", "htmlBody": "<p>Yeah, without an individual differences approach, my opinion is that Julia's idea of a scout mindset is a jangle (https://en.wikipedia.org/wiki/Jingle-jangle_fallacies), as an \"accuracy motivation\" has been part of the Psychology literature since at least the 80s (see, e.g., <a href=\"http://www.craiganderson.org/wp-content/uploads/caa/Classes/~SupplementalReadings/Attribu-Decision-Explanation/90Kunda-motivated-reasoning.pdf,\">http://www.craiganderson.org/wp-content/uploads/caa/Classes/~SupplementalReadings/Attribu-Decision-Explanation/90Kunda-motivated-reasoning.pdf,</a> where Kunda is making the case for directional motivation and she mentions a bit non-directional motivations, such as accuracy motivations). I didn't have time to look at the conditional reasoning test carefully, but the use of the Wason 2-4-6 task suggests to me that Bastian is correct and this would probably be very correlated with AOT / intellectual humility and/or with the cognitive reflection test. To be perfectly honest, I think a good test of an accuracy motivation as a stable trait would not be this sort of thing but, indeed, a test that involves actually resisting <i>motivated reasoning</i>, a bit like in the cognitive reflection test you aim to measure analytical reasoning not by seeing whether people know basic arithmetic but by looking how well they resist <i>intuitive reasoning</i>. Do notice that AOT is sometimes theorized to be how much one can resist myside bias, which is the quintessential motivational bias. I'd suggest reading on it: https://www.tandfonline.com/doi/pdf/10.1080/13546780600780796</p>", "parentCommentId": "zXzXsGrabb8yztNbA", "user": {"username": "CristinaM"}}]