[{"_id": "4iBARr2kxo9oLKRbv", "postedAt": "2023-11-26T06:23:32.827Z", "postId": "DaLz98E2GMTHpfFfP", "htmlBody": "<p>I don't know what to do with this information. Have never seen a palatable fertility intervention!</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "JBDtc9JX6jQDAoWnG", "postedAt": "2023-11-26T19:27:00.591Z", "postId": "DaLz98E2GMTHpfFfP", "htmlBody": "<p>I'm a little surprised the author fixates on increasing fertility instead of <a href=\"https://www.cold-takes.com/how-digital-people-could-change-the-world/#productivity\">digital people</a>.</p><blockquote><p>Like any software, digital people could be instantly and accurately copied. <a href=\"https://www.cold-takes.com/the-duplicator\"><u>The Duplicator</u></a> argues that the ability to \"copy people\" could lead to rapidly accelerating economic growth: \"Over the last 100 years or so, the economy has doubled in size every few decades. With a Duplicator, it could double in size every year or month, on its way to hitting the limits.\"</p><p>Digital people could create a more dramatic effect than this, because of their ability to be sped up (perhaps by thousands or millions of times)<a href=\"https://www.cold-takes.com/how-digital-people-could-change-the-world/#fn3\"><sup><u>3</u></sup></a> as well as slowed down (to save on costs). This could further increase both speed and coordinating ability.<a href=\"https://www.cold-takes.com/how-digital-people-could-change-the-world/#fn4\"><sup><u>4</u></sup></a></p><p>Another factor that could increase productivity: \"Temporary\" digital people could complete a task and then retire to a nice virtual life, while running very slowly (and cheaply).<a href=\"https://www.cold-takes.com/how-digital-people-could-change-the-world/#fn5\"><sup><u>5</u></sup></a> This could make some digital people comfortable copying themselves for temporary purposes. Digital people could, for example, copy themselves hundreds of times to try different approaches to figuring out a problem or gaining a skill, then keep only the most successful version and make many copies of that version.</p></blockquote><p>This is all the usual <a href=\"https://ageofem.com/\">Age of Em</a> stuff (see also <a href=\"https://slatestarcodex.com/2016/05/28/book-review-age-of-em/\">Scott's review</a>).</p>", "parentCommentId": "4iBARr2kxo9oLKRbv", "user": {"username": "Mo Nastri"}}, {"_id": "pidCTdmDHhXv3fXji", "postedAt": "2023-11-26T19:41:09.048Z", "postId": "DaLz98E2GMTHpfFfP", "htmlBody": "<p>The more realistic version of this argument uses AI in place of digital people, which is certainly a possibility. But it's still... put gently... not very grounded.</p>\n", "parentCommentId": "JBDtc9JX6jQDAoWnG", "user": {"username": "therealslimkt"}}, {"_id": "wmR6imzeEYFbqeP7h", "postedAt": "2023-11-27T13:18:08.404Z", "postId": "DaLz98E2GMTHpfFfP", "htmlBody": "<p><strong>Executive summary:</strong> Economic growth models show population growth drives technological progress and GDP per capita, so declining fertility rates threaten long-run growth and should be a top priority for metascience.</p><p><strong>Key points</strong>:</p><ol><li>People enable cooperation, specialization, and idea sharing that powers economic growth not explainable by capital or labor alone.</li><li>Historical and cross-country data confirms population size and growth strongly predict technological change and GDP per capita over long periods.</li><li>Global fertility rates are plummeting, slowing growth in developed countries already and threatening long-term stagnation.</li><li>Some government policies sharply affect fertility, so viable interventions may exist to raise it.</li><li>Immigration can temporarily substitute for fertility but still quickens the global demographic transition.</li><li>Metascience should prioritize raising fertility given its first-order importance for long-run growth in leading economic models.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "f25B4CJAe6TvZp6SK", "postedAt": "2024-01-03T21:56:46.366Z", "postId": "DaLz98E2GMTHpfFfP", "htmlBody": "<p>Nice post, Maxwell! For reference, Charlotte Siegmann and Luis Mota <a href=\"https://forum.effectivealtruism.org/posts/6uwAXinuaxyssofBB/assessing-the-case-for-population-growth-as-a-priority\">have</a> assessed the case for population growth as a priority:</p><blockquote><p>Overall, while we think that increasing population growth rates is positive, the scale of its benefits appears to be orders of magnitude smaller than those of top cause areas.</p></blockquote>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]