[{"_id": "9KbvsdJPboGMsMjXh", "postedAt": "2022-10-10T16:18:02.621Z", "postId": "DArtSnDxRH5AsE5RF", "htmlBody": "<p>Suggestion: consider including a brief summary of the report in this forum post (e.g. the \"key takeaways\" section).</p><p>I've copied it below for ease</p><p>&nbsp;</p><blockquote><h1><strong>KEY TAKEAWAYS</strong></h1><ol><li>There is no escape hatch for humanity, nor for the rich. Shelters that can reliably protect even a small group of humans against catastrophes that would otherwise make humanity extinct are probably infeasible due to multiple technical, psychological, social, political, and economic issues. Constructing “escape hatches” for the few, particularly for the rich and the powerful, would probably increase the net catastrophic and existential risk, as any benefits gained would almost certainly be offset by incentive hazards and further erosion of the perception that we are all in this together.</li><li>Self-sufficient space colonies that could protect against existential risks require technologies and skills that, if they existed, could be used more cheaply and reliably to create self-sustaining shelters on Earth. This will likely remain the case in the foreseeable future.</li><li>Even if a small group manages to survive a planetary catastrophe, only in some scenarios it is at all plausible that their descendants could repair the damages caused by any catastrophic outcome that the global society failed to prevent, and reconstitute the technological civilization.</li><li>Therefore, to save civilization, one needs to save society. The best lifeboat is the ship; the best shelter is a functional society. Increasing the resilience of societies and their capability for cooperative action would increase humanity’s resilience against events that could cascade into existential risks while having obvious benefits in less dire circumstances as well.</li><li>Even though popular discussion about shelters tends to revolve around bunkers and stockpiles, the importance of organizational efforts, e.g. maintenance, training, and preparedness, cannot be overstated. No amount of material preparations or technology will help in a crisis if they do not work due to lack of maintenance, or if humans do not know how to use them. On the other hand, organizations that train to respond to disruptions can improvise even if they lack materials.</li><li>The solutions to the shelter problem are not primarily technological. As far as I’m aware, no one has been able to identify any foreseeable technologies that would offer substantial improvements in societal resilience or otherwise provide a significant reduction in existential risk, although research into resilience-enhancing, “resilient by default” and “gracefully failing” technologies and practices should probably receive more funding than it currently does. However, even here the primary problem is not technical but economic: more resilient technologies and practices often exist already but they tend to be more expensive to buy or to use.</li><li>Longer-term research programs could nevertheless develop cost-effective ways to increase resilience against catastrophes and permit easier or faster recovery from a disaster. One obvious partner would be research into self-sustaining ecosystems for space colonization. A demonstration facility for the long-term feasibility of a closed-loop life support system would also double as a shelter, even if the small scale of such habitats and likely reliance on the “iceberg” of external technical support raises serious questions about the contribution they could provide for existential risk reduction.</li><li>Natural, accidental, or deliberate release of a dangerous pathogen(s) is widely seen as the threat with the most potential to precipitate an existential risk, although one should remember that the ongoing COVID-19 pandemic may bias this conclusion. A particularly worrisome prospect is the simultaneous, deliberate release of two or more pathogens, which could greatly confound the efforts to detect and contain the outbreak.</li><li>The SHELTER meeting participants seemed to broadly agree that with some exceptions, any single causal factor is unlikely to cause the extinction of humanity and is probably not sufficient to cause a catastrophic event. Instead, most existential risks and many catastrophic risks would probably be the result of several interacting mechanisms that e.g. prevent timely response to a risk that in theory should be manageable. Breakdown of the societal capability to act is thus a major risk multiplier. Single-cause risks that threaten human extinction, such as nearly omniscient AI god, are probably risks that shelters cannot realistically protect against.</li><li>Existing efforts in disaster management, particularly in countries with already robust civil defense/disaster response capability (Finland, Sweden, Switzerland etc.) could probably be augmented by relatively low-cost means to reduce the likelihood of major catastrophe(s) a) cascading to existential risks and/or b) leading to serious, irrecoverable loss of accumulated knowledge. Empirical validation of proposed means for improving resilience and the probability of recovery is necessary.</li><li>Two of the shelter strategies that seemed to gather the most support are a) hardening existing facilities identified as crucially important for reducing the likelihood of disasters cascading into catastrophes or existential risks, e.g. biomedical research and manufacturing facilities, and b) maintaining or even increasing the geographical and cultural diversity of humanity by supporting or even creating relatively isolated communities and helping them increase their resilience against biological threats in particular.&nbsp;</li><li>Maintaining human geographical and cultural diversity by supporting relatively isolated communities would be a no-regrets strategy that would increase resiliency&nbsp;<i>and&nbsp;</i>provide tangible benefits to typically underserved communities today.</li><li>Any strategy that is adopted must gain buy-in from the people who are involved. Gaining acceptance from the people is particularly important when supporting isolated communities, most of whom have very good reasons to be extremely wary of outsiders trying to “help” them. A humble bottom-up approach that is guided by what the people themselves want and need is practically mandatory.</li></ol></blockquote>", "parentCommentId": null, "user": {"username": "cilliancrosson@gmail.com"}}, {"_id": "PfYb2Dzpu5qxHfd5d", "postedAt": "2022-10-10T16:47:29.641Z", "postId": "DArtSnDxRH5AsE5RF", "htmlBody": "<p>Janne -- thanks very much for posting this, and welcome (as an active participant) to the EA Forum!</p><p>At first glance, the report looks very useful for EA folks to read, regarding strategies for increasing civilizational resilience and reducing X risk.&nbsp;</p><p>I wonder if Rob Wiblin might be interested in interviewing you about it for a 80k Hours podcast?</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "LCPXfvzXoAEzq223s", "postedAt": "2022-10-12T08:05:44.623Z", "postId": "DArtSnDxRH5AsE5RF", "htmlBody": "<p>Thank you - should've considered that myself.&nbsp;</p>", "parentCommentId": "9KbvsdJPboGMsMjXh", "user": {"username": "Janne M. Korhonen"}}]