[{"_id": "YbNEemmqBu8L95oWB", "postedAt": "2023-11-22T11:28:19.671Z", "postId": "DavASHvJwBa4cdoRZ", "htmlBody": "<p>The relevant paragraphs regarding Tallinn's views:</p><blockquote><p>“The OpenAI governance crisis highlights the fragility of voluntary EA-motivated governance schemes,” said Tallinn, who has poured millions into effective altruism-linked nonprofits and AI startups. “So the world should not rely on such governance working as intended.”</p></blockquote><blockquote><p><br>Many EA figures are now again turning to their own methods for making sense of what has transpired, guided by sources like a <a href=\"https://manifold.markets/JonasVollmer/in-a-year-will-we-think-that-sam-al\"><u>prediction market website</u></a> backed by Bankman-Fried and other EA donors. “I remain confused but I note that the market now predicts that this was bad for AI risk indeed,” Tallinn said, citing one of its polls.</p></blockquote><p>I'm not a fan of how Tallinn is citing manifold polls here: it's obviously gameable and non-representative, although I do agree with their conclusion in this case.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "iuwqrCngShr7QBz7n", "postedAt": "2023-11-25T15:49:42.718Z", "postId": "DavASHvJwBa4cdoRZ", "htmlBody": "<p>A pretty poor piece of journalism in my opinion. It gets a number of facts wrong. For example:</p>\n<ul>\n<li>Adam D'Angelo doesn't have \"deep ties\" to EA</li>\n<li>Jaan Tallinn's comments aren't \"against EA\", just saying that these governance mechanisms weren't enough (I doubt many EA AI Safety advocates have claimed such a thing)</li>\n<li>The claim that the board didn't consult with layers of a communications firm, based on <a href=\"https://twitter.com/kaleekreider/status/1726388897892978722?t=N4cBPSX_23xUbSCnJzEWbQ&amp;s=19\">this tweet</a> which refers to <a href=\"https://archive.is/KenaK\">this WSJ article</a> which doesn't mention either of those. It could be true of course, but they weren't justified in claiming it</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}]