[{"_id": "4akS26vFb5EQ8P2Zo", "postedAt": "2023-12-26T17:34:03.207Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>Thanks for writing this piece. Do you have any non-anecdotal evidence to support this argument? For example, does an intervention to get people to donate more also cause them to be more likely to give blood? I think this is one area where it’s very difficult to have correct intuitions so outside evidence, even with all the problems of the psychology literature, can be especially helpful.</p>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "8sdcn4Yw64ETireLc", "postedAt": "2023-12-26T17:47:48.494Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>Crosspost to Lesswrong?</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "pAXHmnmA4X2f28LNH", "postedAt": "2023-12-26T20:22:21.914Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>Less anecdotal but only indirectly relevant and also hard to distinguish causation from correlation:</p>\n<p>Ctrl+f for \"Individuals who participate in consumer action are more likely to participate in other forms of activism\" here</p>\n<p><a href=\"https://www.sentienceinstitute.org/fair-trade#consumer-action-and-individual-behavioral-change\">https://www.sentienceinstitute.org/fair-trade#consumer-action-and-individual-behavioral-change</a></p>\n", "parentCommentId": "4akS26vFb5EQ8P2Zo", "user": {"username": "Jamie_Harris"}}, {"_id": "rzJ2CFprFNPF9rCuh", "postedAt": "2023-12-26T20:38:01.974Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>I would like to point out that this is one of those things where n=1 is enough to improve people's lives (e.g., the placebo effect works in your favor), in the same way that I can improve my life by taking a weird supplement that isn't scientifically known to work but helps me when I take it.</p>\n<p>For what it's worth, my life did seem to start going better (I started to feel more in touch with my emotional side) after becoming vegan.</p>\n", "parentCommentId": "4akS26vFb5EQ8P2Zo", "user": {"username": "lincolnq"}}, {"_id": "8RZAyCQB2qfMjsk4y", "postedAt": "2023-12-26T23:01:18.196Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<blockquote><p>For example, I do not see people's work hours typically go up when they move from a valuing small scale altruism area to an non-valuing small scale altruism area</p></blockquote><p>&nbsp;</p><p>Did they go down, or stay the same?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "BSqu84Qt8HNqv2eFs", "postedAt": "2023-12-26T23:42:49.191Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>I at least personally want to provide some datapoints against this.&nbsp;</p><p>I think \"sacrifices for the sake of sacrifices\" has felt to me like something that at many points has substantially reduced my motivation to do other altruistic things, especially when combined with external social obligations or expectations (like it's been the case with some of the veganism and donation stuff).&nbsp;</p><p>I also know many other people who feel like instincts towards virtue signaling and associated overstretching have substantially soured them in engaging with the EA community and also more broadly being altruistic with their efforts.</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "2MEjGcRyEEB73tiXe", "postedAt": "2023-12-27T02:47:34.946Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>Off the top of my head, it seems like \"foot in the door\" factors could support the OP's thesis (people are more likely to go along with larger requests after already doing smaller ones for the same person/cause, apparently related to cognitive dissonance reduction). &nbsp;Moral licensing effects would seem to go the other way. &nbsp;It would be interesting to hear from an expert in the social sciences which effect tends to be stronger.</p>", "parentCommentId": "4akS26vFb5EQ8P2Zo", "user": {"username": "RYC"}}, {"_id": "2wf3ifNWkYFzFcPdQ", "postedAt": "2023-12-27T04:56:06.679Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>(1) I think Joey's right, and I'll phrase the issue in this way - a lot of EAs underrate the impact of habit-formation and overrate the extent to which most of your choices even require active willpower. Your choices change who you are as a person, so what was once hard becomes easy.</p>\n<p>I've always given at least 10% to effective charities, and now it's just something I do; it's barely something I have to think about, let alone require some heroic exertion of will. And while I'm not vegan, I am successfully eating less meat even on a largel6 keto diet, and what surprised me is how much easier it is than I thought it would be.</p>\n<p>(2) Let's accept for the sake of argument that there is a lot of heterogeneity, such that for some people the impact of habit formation is weak and it is psychologically very difficult for them to consistently adhere to non-job avenues to impact (e.g. donating, being vegan, etc). Even so, how would one know in advance? Why not test it out, to see if you're in the group for which habit formation impact is high and these sacrifices are easy, or if you are in the other group?</p>\n<p>Surely it's worth doing - the potential impact is significant, and if it's too hard you can of course stop! But many people will be surprised, I think, at just how easy certain things are when they become part of your daily routine.</p>\n", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "iMjtMe9gZFd2Mf9zC", "postedAt": "2023-12-27T05:17:44.137Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>My crude model &nbsp;is that there are two forces pushing in opposite direction, and which effect wins out depends on the person and their circumstance.</p><p>If altruistic actions are ego-syntonic, they can be a source of emotional energy to fuel more altruism. And if you're operating under capacity, the gains may well be ~free.</p><p>If the action isn't ego-syntonic or otherwise energizing you, that effect is lost. It's just a cost you pay. I expect this is worse for things people do out of social pressure or a sense of obligation.</p><p>Meanwhile, doing stuff takes resources- physical energy, intellectual energy, money.... If one of those is your limiting reagent, and a minor altruistic action requires it, then that minor action trades off against your big ones. Even if it is ego syntonic and increases your available emotional energy, it's still a trade off because emotional energy wasn't your limiting reagent.</p><p>&nbsp;</p><p>Seperately, many people aren't great at optimizing. Fact checking leisure reading (including social media) trades off against my core work. But \"fact checking on only the most important projects, none for lesser projects\" isn't an available stance for me. I can dial it up or down somewhat, but if I push away the instinct to check unless I'm sure something is important too often, I'll lose rigor in my core work as well. So that's just a tax I have to pay.&nbsp;</p>", "parentCommentId": "BSqu84Qt8HNqv2eFs", "user": {"username": "Elizabeth"}}, {"_id": "dZmqRxezWYbeCKDmd", "postedAt": "2023-12-27T05:27:43.386Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<blockquote><p>think Joey's right, and I'll phrase the issue in this way - a lot of EAs underrate the impact of habit-formation and overrate the extent to which most of your choices even require active willpower</p></blockquote><p>&nbsp;</p><p>I mean, yes, but I think it's at least as true that a lot of people overestimate the cost of \"low impact\" choices, for some people. People are just pretty variable, and however badly people understand themselves, strangers understand them even less. It's fantastic that you donate 10% and don't find it to be a hardship, but it's obviously dependent on a bunch of life circumstances that don't hold for everyone. They're not uncommon in EA either, but I think it's pretty alienating for people who aren't in that position to be told it's just an issue of habit formation.&nbsp;</p><p>I do think there's a problem where people worry that doing less impactful altruistic interventions like donating blood is low status, like announcing you don't have better things to do. That worry isn't unfounded, although I think it might be exaggerated. I think this is bad for lots of reasons and worth fighting against.&nbsp;</p>", "parentCommentId": "2wf3ifNWkYFzFcPdQ", "user": {"username": "Elizabeth"}}, {"_id": "A8fBd98hozSCj5pzy", "postedAt": "2023-12-27T09:42:27.941Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>In most cases the same or minor decrease</p>", "parentCommentId": "8RZAyCQB2qfMjsk4y", "user": {"username": "Joey"}}, {"_id": "8CJSd4eNMJXFbuswr", "postedAt": "2023-12-27T09:51:39.012Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>I do tend to think that most people's limiting factor is energy instead of time. E.g. it is rare to see someone work till they literally run out of hours on a project vs needing a break due to feeling tired. Even people working 12 hours a day, I still expect they run out of energy before time, at least long term. I would not typically see emotional energy as my limiting factor, but I do think it's basically always energy (a variable typically positively affected by altruism in other areas) vs. time or money (typically negatively affected).</p>", "parentCommentId": "iMjtMe9gZFd2Mf9zC", "user": {"username": "Joey"}}, {"_id": "NLSimNdS3X9Ezfwnp", "postedAt": "2023-12-27T09:55:43.748Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>I think the model I would suggest is indeed close to what Joel is saying - try it out system as opposed to guessing a priori how you will be affected by things. More specifically, track your work hours/productivity (if you think that is where the bulk of your impact is coming from) and see if, for example, donating blood on the weekend negatively, positively, or has no effect on them. I think that my output has gotten higher over time, in part, due to pretty active testing and higher amounts of measurement. - <a href=\"https://forum.effectivealtruism.org/posts/mPM7gKicJYQKhtAB8/how-to-improve-your-productivity-a-systematic-approach-to\">Related post</a>&nbsp;</p>", "parentCommentId": "dZmqRxezWYbeCKDmd", "user": {"username": "Joey"}}, {"_id": "w2wDZJxaooRhJzmwg", "postedAt": "2023-12-27T10:02:16.667Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>Is perhaps testable by RCT amongst earn-to-givers because we could quantitatively measure their impact more easily.</p>\n<p>Perhaps one group is coached on taking more small altruistic actions, the other is coached to preserve their resources for the big moments / decisions. I think six months to one year with yearly followups would be a suitable length.</p>\n<p>I think limiting factor would be number of earn-to-givers willing to partake.  Any other ways this could be tested objectively? It does seem very important to know, and it seems there's little compelling evidence either way.</p>\n", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "7yfGhC9dtXtRe9MBD", "postedAt": "2023-12-27T10:30:08.379Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>Another factor is that recruitment to the EA community may be more difficult if it's perceived as very demanding.&nbsp;</p><p>I'm <a href=\"https://stefanschubert.substack.com/p/an-argument-against-costly-signalling\">also</a> not <a href=\"https://stefanschubert.substack.com/p/deliberate-altruism-and-costly-signalling\">convinced</a> by the costly signalling-arguments discussed in the post. (This is from a <a href=\"https://forum.effectivealtruism.org/posts/wWnRtjDiyjRRgaFDb/remuneration-in-effective-altruism\">series of posts on this topic</a>.)</p>", "parentCommentId": "BSqu84Qt8HNqv2eFs", "user": {"username": "Stefan_Schubert"}}, {"_id": "H9B9tyqDWexgJEvNa", "postedAt": "2023-12-30T11:12:47.748Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>How much of this is lost by compressing to something like: virtue ethics is an effective consequentialist heuristic?</p>\n<p>I've been bought into that idea for a long time. As Shaq says, 'Excellence is not a singular act, but a habit. You are what you repeatedly do.'</p>\n<p>We can also make analogies to martial arts, music, sports, and other practice/drills, and to aspects of reinforcement learning (artificial and natural).</p>\n", "parentCommentId": null, "user": {"username": "Oliver Sourbut"}}, {"_id": "7jGmCwFNovDmpGABi", "postedAt": "2023-12-31T19:21:40.388Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<blockquote><p>How much of this is lost by compressing to something like: virtue ethics is an effective consequentialist heuristic?</p></blockquote><p>It doesn't just say that virtue ethics is an effective consequentialist heuristic (if it says that) but also has a specific theory about the importance of altruism (a virtue) and how to cultivate it.</p><p>There's not been a lot of systematic discussion on which specific virtues consequentialists or effective altruists should cultivate. I'd like to see more of it.</p><p><a href=\"https://forum.effectivealtruism.org/users/lucius_caviola?mention=user\">@Lucius Caviola</a> and I <a href=\"https://forum.effectivealtruism.org/posts/q7WwTuZQWMqDEEoWM/virtues-for-real-world-utilitarians\">have written a paper</a> where we put forward a specific theory of which virtues utilitarians should cultivate. (I gave a talk along similar lines <a href=\"https://www.youtube.com/watch?v=Q-mrT4Sb7GQ&amp;list=PLwp9xeoX5p8PJKPaLePz_nrsQT6Z8X7GQ&amp;index=20\">here</a>.) We discuss altruism but also five other virtues.</p>", "parentCommentId": "H9B9tyqDWexgJEvNa", "user": {"username": "Stefan_Schubert"}}, {"_id": "aBiXCfhujqgkauNu2", "postedAt": "2024-01-01T21:12:29.670Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>I think I generally agree with the idea that \"making altruism a habit will probably increase your net impact\", and thinking of altruistic effort as a finite resource to spend is inaccurate.</p><p>However I think there are is a force, \"moral licensing\" (https://journals.sagepub.com/doi/pdf/10.1177/0146167215572134) pushing in the opposite direction of habit formation.</p><p>My personal recommendation is that people should make altruism a habit where it does not <i>feel </i>like a large personal sacrifice. For almost all this will include generally acting morally under virtue ethics and deontology too, and include things like donating blood and being an organ donor. But depending on the person this can still include donating 10%, going vegan or at least reducing meat consumption etc.</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "S2e9LNc7kbhPm27xn", "postedAt": "2024-01-03T21:57:45.631Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>Glad you mentioned 'moral licensing' -- which is something EAs really need to be aware of!</p>", "parentCommentId": "aBiXCfhujqgkauNu2", "user": {"username": "geoffreymiller"}}, {"_id": "jwkgRWb5jNcXkJNSX", "postedAt": "2024-01-04T10:29:11.960Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<p>While the idea of moral licensing makes sense to me in theory, I'm not too persuaded by the empirical evidence, at least from the cited meta-analysis - the publication bias is enormous, as the authors note.<br><br><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/msn57ys7e1snoi6zbqtq\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/fle8py5thefpvrtrayst 110w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/plhgyfmfibj3kbzwkeyn 220w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/gjign9b8somaetf7h3sh 330w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/gslslryrgwmqusvfvjcz 440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/p7ltazsdfodwos3wpyhy 550w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/tkqztwcpzmet4iiw5mae 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/sakhy7elssilk4exenrp 770w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/vtwskouesauqpo1t6xl6 880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/hvfwjy3mh02chgwk6yes 990w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jwkgRWb5jNcXkJNSX/xtyyv1tcvx5tbg8wcwlo 1025w\"></p>", "parentCommentId": "aBiXCfhujqgkauNu2", "user": {"username": "Joel Tan"}}, {"_id": "ZExKGTyjCijaxab9j", "postedAt": "2024-01-10T19:41:46.750Z", "postId": "DBcDZJhTDgig9QNHR", "htmlBody": "<blockquote><p>energy (a variable typically positively affected by altruism in other areas)</p></blockquote><p>&nbsp;</p><p>This assumption seems totally out of left field to me. I agree altruism can increase energy, but in many other cases it uses it up.&nbsp;</p>", "parentCommentId": "8CJSd4eNMJXFbuswr", "user": {"username": "Elizabeth"}}]