[{"_id": "i4pYwzjS2YmsBqep6", "postedAt": "2022-09-25T18:00:58.658Z", "postId": "DBFZmsu7DJ8BSoZMp", "htmlBody": "<p>Thank you so much for doing this research! This indeed seems to be a common topic we don't yet have a \"standard\" answer to.</p><p><br>You might be interested in this post <a href=\"https://forum.effectivealtruism.org/posts/BizWCgin6fCJCrkTJ/will-there-be-an-ea-answer-to-the-predictable-famines-later\">https://forum.effectivealtruism.org/posts/BizWCgin6fCJCrkTJ/will-there-be-an-ea-answer-to-the-predictable-famines-later</a> which has more discussion than the ones you linked</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "sahLLrDjfAkRfaKKf", "postedAt": "2022-09-25T19:19:07.024Z", "postId": "DBFZmsu7DJ8BSoZMp", "htmlBody": "<p>Thank you! &nbsp;I will include a link in OP too</p>", "parentCommentId": "i4pYwzjS2YmsBqep6", "user": {"username": "learko"}}, {"_id": "3tJQxHEFdKPTS9Sdj", "postedAt": "2022-09-27T12:26:32.138Z", "postId": "DBFZmsu7DJ8BSoZMp", "htmlBody": "<p>Thanks for writing this, it's an excellent first forum post and a great note on an important topic that is slightly under the EA radar.&nbsp;</p><p>You identified the $20M (IRC) and $7M (ALIMA) grants Open Philanthropy made in 2021 through GiveWell for the treatment of malnutrition. I wanted to draw your attention to another series of grants that the Open Philanthropy Science team have made to <a href=\"https://www.openphilanthropy.org/grants/?q=peanut+butter\">improve the formulation of Ready to Use Therapeutic Food</a>.&nbsp;</p><p>My quick answers to your questions are that RUTF and other high impact malnutrition work is plausibly cost-effectiveness-competitive at the margin with the marginal malaria donation, although I expect that GiveWell have thought about this more carefully and indepth than I have and ultimately would defer to that. I'd note that they're both pretty great donation opportunities and I'd never want to dissuade someone from thinking about, working on, or donating to work on severe malnutrition (or malaria prevention). RUTF saves children's lives and is cheap.</p><p>On assessing STC or others, it's possible for GiveWell / other major movers of funds to engage directly and assess at a programmatic level (e.g. SAM work in Somalia) in a way that is difficult for individual donors to do. GiveWell have <a href=\"https://www.givewell.org/international/technical/programs/combined-protocol-community-management-acute-malnutrition\">written</a> &nbsp;about how they are assessing some malnutrition interventions, although <a href=\"https://www.givewell.org/search/ss360?keys=malnutrition\">some of that work is now quite old</a>. If someone was asking specifically what malnutrition work to donate, a dedicated emergency fund like the STC East Africa malnutrition one would be the recommendation I would give (in a personal capacity).&nbsp;</p>", "parentCommentId": null, "user": {"username": "ChrisSmith"}}, {"_id": "rWiyXE6HybgZWX3Xr", "postedAt": "2022-10-04T20:55:46.960Z", "postId": "DBFZmsu7DJ8BSoZMp", "htmlBody": "<p>Thank you very much, Chris, for the complement and the links. Interesting, and I think valid, point on 'if mega charities should be assessed, then should those with scale take responsibility'. Thanks again; I donated to the GiveDirectly one, but glad for your perspective on StC, since I was not sure if it was in the same league at all.</p>", "parentCommentId": "3tJQxHEFdKPTS9Sdj", "user": {"username": "learko"}}]