[{"_id": "vchr89kiHz7TZDu5Z", "postedAt": "2023-12-06T23:26:52.849Z", "postId": "DBx98atdYFM3yKR9C", "htmlBody": "<p>Incredible work!</p><p>Your previous research/intervention in Kenya showed that UBI can have a positive impact, not only on the recipient villages, but also on <a href=\"https://www.vox.com/future-perfect/2019/11/25/20973151/givedirectly-basic-income-kenya-study-stimulus\">nearby villages</a>.</p><p>In this study the welfare of those in nearby villages seems to not be the focus. Although you did look at nearby markets which had a somewhat disappointing conclusion:</p><blockquote><p>We do not reject the null that consumer prices in nearby markets were unchanged, both for agricultural and non-agricultural products, though to be fair these estimates are not precise enough to rule out meaningful appreciation (or depreciation) given the design and scale of the experiment.</p></blockquote><p>I would personally be <i>very</i> interested to see you try to track/quantify the welfare impact on nearby villages in the future, since those spillover effects can create a big bump in the expected DALY's per dollar.</p>", "parentCommentId": null, "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "hag8zDznTLpAiBvw4", "postedAt": "2023-12-07T04:20:27.329Z", "postId": "DBx98atdYFM3yKR9C", "htmlBody": "<p>Thanks very much for sharing, very interesting work.</p><p>I was very pleased to see the <a href=\"https://www.socialscienceregistry.org/trials/1952\">pre-registration</a>, which I think significantly improves the credibility of the results. Would you be able to help me understand some of the endpoints? I was hoping to see a straightforward 1:1 correspondence between the pre-registration and the paper but found it a bit confusing; it might be helpful to publish a table showing how to compare the two.</p><p>For example, the pre-registration lists 'aspirations' as one of the primary endpoints:</p><blockquote><p>The main outcomes of interest are economic status (income, consumption, assets, and food security), anthropometrics (for children in the household between 2-12 years of age), time use (work, education, leisure, community involvement), risk-taking (especially, migrating and starting businesses), gender relations (especially female empowerment), aspirations and mental health.</p></blockquote><p>This is defined in <a href=\"https://www.socialscienceregistry.org/versions/76107/docs/version/document\">the pre-analysis plan</a> as</p><blockquote><p>the Anderson weighted index of (i) the average of responses to question 1a on aspirations for kids educational attainment, (ii) question 2c on level of assets the respondent wants to achieve in 10 years, and (ii) question 3b on the level of income they want to achieve after 10 years.</p></blockquote><p>but I was not able to find it in the paper. Similarly the plan describes a 'crime index', based on responses to the village elder survey, and a 'social integration index', as other outcomes that will be studied, but I couldn't find these in the paper.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "EJo5YxmS9vWN4kEcR", "postedAt": "2023-12-07T13:03:31.482Z", "postId": "DBx98atdYFM3yKR9C", "htmlBody": "<p><strong>Executive summary:</strong> A large-scale study in Kenya found that different designs of cash aid had varying impacts. Both a long-term basic income and a large lump sum payment were more effective at boosting entrepreneurship and incomes than short-term aid.</p><p><strong>Key points:</strong></p><ol><li>A monthly basic income did not reduce work effort but shifted people to self-employment and increased incomes.</li><li>Giving a $500 lump sum was better than giving $22 monthly for 2 years for business creation and income gains.</li><li>Guaranteeing cash for 12 years encouraged saving and investment more than short-term aid.</li><li>Current cash aid programs often use less effective short-term monthly payments. Policymakers should consider more transformative long-term and lump sum aid.</li><li>More research is needed on long-term basic income and lump sums in high-income countries.</li><li>Future results will show if the long-term basic income's impact matches its higher cost.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "eoycfKAJD99nxSJMn", "postedAt": "2023-12-14T12:37:26.427Z", "postId": "DBx98atdYFM3yKR9C", "htmlBody": "<p>Super interesting, and great to see this comparison. I'll be particularly interested in seeing the results farther down the line, as other studies suggest that the effects of UBI tend to be fairly short-term.</p><p>&nbsp;For future write-ups in this forum, would it be possible to include mentions of the effect sizes directly in the write-up? They're available in the results table that you linked to, but it's nice to be able to easily see from the write-up that diet diversity increased by 4% (long-term UBI); 5% (short-term UBI), and 2% (large lump sum), in addition to the narrative about how</p><blockquote><p><i><strong>short-term UBI created more diet diversity:</strong> \"[For consumption], the only significant difference is that there is more food variety in the short-term UBI than in lump sum…</i></p></blockquote><p>Given that EAs tend to be numerate and interested in rigor, I think this would be helpful for understanding the results from the write-up directly. The difference between the three seems pretty minor, but you can't get that from the phrasing of the narrative.</p><p>Regardless, great to see this research being done and I'm excited to see the future studies!</p>", "parentCommentId": null, "user": {"username": "ddavies"}}, {"_id": "JsMkWmosJEWYWjZXe", "postedAt": "2023-12-22T21:09:39.900Z", "postId": "DBx98atdYFM3yKR9C", "htmlBody": "<p>This study is really great work, and we should all take heart from this in the face of impending social upheaval from AI advancements.&nbsp;</p>", "parentCommentId": null, "user": {"username": "brighter_future"}}, {"_id": "ci4eLaCtMsk2AdqRi", "postedAt": "2023-12-29T18:16:53.975Z", "postId": "DBx98atdYFM3yKR9C", "htmlBody": "<p>As a follow-up, <a href=\"https://www.nber.org/system/files/working_papers/w31962/w31962.pdf\">this recent NBER paper</a> on people who receive unexpected cash windfalls in Sweden rejected the idea that poverty was the main causal factor behind poor people committing crimes at a higher rate; their non-significant point estimate was in fact that wealth transfers increased crime (though this could easily be noise). It would be good if we could contrast it with the GiveDirectly result, to see if the different environment (random vs predictable, Sweden vs Kenya) made a significant difference.&nbsp;</p>", "parentCommentId": "hag8zDznTLpAiBvw4", "user": {"username": "Larks"}}, {"_id": "sXfFSpBmsNxJYrDXK", "postedAt": "2024-01-01T20:38:15.217Z", "postId": "DBx98atdYFM3yKR9C", "htmlBody": "<p>Thanks for sharing!</p><p>Could you clarify what has been the benefit to cost ratio so far?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]