[{"_id": "rkY6QsLhxXMnbf9m2", "postedAt": "2022-10-09T05:09:24.916Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Thanks for writing this! The section on \"stop rewarding modesty\" was especially interesting and will stick with me</p>\n", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "bQEscajcr8Q4xk3vt", "postedAt": "2022-10-09T18:32:53.770Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Very useful and illustrative. I especially like how you manage to tie both the personal perspective and the group dynamics together. I was acquainted with this idea but your write up was definitely illuminating of aspects I missed. I expect this to be useful to me and others!</p>\n", "parentCommentId": null, "user": {"username": "EcologyInterventions"}}, {"_id": "HFmWmRcZBguDcmys7", "postedAt": "2022-10-09T19:12:26.238Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Thanks! I expect that section is high-variance. Wasn't sure whether I should be so overtly miffed about it. :p</p>", "parentCommentId": "rkY6QsLhxXMnbf9m2", "user": {"username": "Emrik"}}, {"_id": "4kqEJwvcPuhpuB3xs", "postedAt": "2022-10-09T19:15:12.631Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<blockquote><p>And what you optimise for should depend on what you're writing. Sometimes I primarily optimise for <i><strong>A)</strong></i><strong> making readers have true beliefs about </strong><i><strong>what I believe</strong></i>. Other times I primarily optimise for <i><strong>B)</strong></i><strong> providing readers with tools that help them come to their own conclusions</strong>.</p><p>When I'm doing B, it doesn't matter what they believe I believe. If out of ten things I say, nine will be plain wrong, but one thing will be so right that it helps the reader do something amazing with their lives, I consider that a <a href=\"https://slatestarcodex.com/2019/02/26/rule-genius-in-not-out/\">solid success</a>.</p></blockquote><p>cf. <a href=\"https://slatestarcodex.com/2019/02/26/rule-genius-in-not-out/\">https://slatestarcodex.com/2019/02/26/rule-genius-in-not-out/</a></p>", "parentCommentId": null, "user": {"username": "ModusTrollens"}}, {"_id": "xQ2EWrQy7uHqWgYrq", "postedAt": "2022-10-09T23:13:04.376Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Great post :-)</p>", "parentCommentId": null, "user": null}, {"_id": "L6Bsg9xcuvuWaBneL", "postedAt": "2022-10-10T03:00:19.616Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>I think “lack of modesty” may often be shorthand for other limitations that stifle discussion, or make readers think the author is not open to input from others.</p>\n<p>E.g., if an author writes something like “my research proves that all charity is driven by selfish motives”.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "abhA8NZwF6FRKSnps", "postedAt": "2022-10-10T04:59:38.220Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Definitely lack of actual humility is a problem, but I think pretty much everyone recognises that it's a problem. Even the people who actually <i>do</i> lack humility to the extent that they think no one can teach them anything-- do recognise that humility is good epistemics in general... for other people. So I don't think going around and reminding everyone that they need to be humble actually helps much. It's already in the water. Especially in EA.</p>", "parentCommentId": "L6Bsg9xcuvuWaBneL", "user": {"username": "Emrik"}}, {"_id": "pJhAsB7oxBfsBuvYu", "postedAt": "2022-10-10T07:09:27.145Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>I like it and agree, but idk if I find it as easy as that. I'm pretty sure I get downvoted when I don't make modesty overt. It seems key on EA facebook and EA Slack too. Without it, does a controversial point &nbsp;get integrated into the discussion? Idk.<br><br>In footnote 1, you say. <i>\"If I can seem more humble by adding two more words, I usually say it's worth the cost--but I'm aware that I am profiting only myself, and it is my readers that pay the cost.\"</i><br><br>But if an average EA will absorb your argument better when written in humble-mode, then it is the average EA who is helped by your humble writing. Or, the writer pays a tax, not the reader. The EA forum to me seems like it has an arms race of humble writing, where if you don't convey your ideas humbly, your ideas look worse in comparison to others.&nbsp;<br><br>If this is true, can we even deescalate? Personally, I care too much about what I write to risk screwing myself and my argument by writing plainly.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8ac6relqwl9\"><sup><a href=\"#fn8ac6relqwl9\">[1]</a></sup></span>&nbsp;I'd guess others do too. If modesty is what the forum readers and EA decision-makers seem to reward, that is what they will get.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6du0n197qb\"><sup><a href=\"#fn6du0n197qb\">[2]</a></sup></span><br><br>Hopefully your post is the start of changing it though. Maybe it's time the EA forum commenting guidelines were edited? The community might need reminders or Moloch might swallow this one up. \"Be chill\" or \"be yourself\" or \"it's okay to be confident\" might be nice to see every time I open the commenting field.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8ac6relqwl9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8ac6relqwl9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>If I spend a truly disgusting time editing each comment for modesty, I can screw only me. See, big brain right there.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6du0n197qb\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6du0n197qb\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Especially from women/AFAB, who are already trained in it, and also have the cultural disincentive from trying anything else. Personally, I'm half-expecting to be seen as a bitch or at least unrelatable even when I make modesty or warmth a priority, and I can't be the only one.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "3exjdxHEiNAiMfu2k", "postedAt": "2022-10-10T07:20:31.141Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<blockquote><p>\"The EA forum to me seems like it has an arms race of humble writing, where if you don't convey your ideas humbly, your ideas look worse in comparison to others.\"</p></blockquote><p>Precisely!</p><p>And yeah, because of this, I do a lot of humility which I know will only contribute to the arms race but I still do it because I think the object-level message is important enough in that case. I was calling it \"self-profiteering\" only at recursion level 1.</p><p>I'm less optimistic about this post being \"the start of a change\", but maybe it can cause some people to be less judgmental in their reading, and thereby notice when some seemingly brazen people are being exceedingly kind--like me!</p>", "parentCommentId": "pJhAsB7oxBfsBuvYu", "user": {"username": "Emrik"}}, {"_id": "dYeEqKcYZxqaqzCre", "postedAt": "2022-10-10T07:32:59.945Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Hm. Yeah maybe solution is to just write more comments. If you write more, you don't have to risk your best arguments to pepper the forum culture with non-modesty. Like, for every comment we write with a natural vibe, at least we are bringing down the modesty-arms-race average.&nbsp;</p>", "parentCommentId": "3exjdxHEiNAiMfu2k", "user": {"username": "Ivy_Mazzola"}}, {"_id": "3YuDmze7gArymprTn", "postedAt": "2022-10-10T07:36:32.696Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Good idea! Inundate the forum! Already on it! ^^</p>", "parentCommentId": "dYeEqKcYZxqaqzCre", "user": {"username": "Emrik"}}, {"_id": "hwEGtt5ZNwr68h4Qr", "postedAt": "2022-10-10T14:53:16.866Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Generally yes but there are always new people coming in who are <em>not</em> aware of this.</p>\n<p>So, the 'when to remind' game is  a challenge of finding the right balance of precision and recall (type 1/2 errors) and hitting the best frontier.</p>\n", "parentCommentId": "abhA8NZwF6FRKSnps", "user": {"username": "david_reinstein"}}, {"_id": "je4cs6SgRcmeQMSzc", "postedAt": "2022-10-10T16:35:01.099Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>I strongly agree with this post. Particularly enjoyed this sentence:<br><br>\"Wasting the reader's time by trying to influence their impression of you is more or less the same regardless of whether it is for defending against negative impressions or inviting positive impressions.\"<br><br>I think defensive writing is often stylistically bad. I've thought about this quite a bit since I've been doing writing/editing work for EAs: I'm often tempted to use far fewer hedge-words and caveats, but it's understandable why people sometimes don't feel comfortable without them.&nbsp;<br><br>I also think that defensive writing pulls against an element of reasoning transparency that I think is underrated. I think some of my best writing is done when I'm <i>actively thinking through</i> things. I think this produces a kind of....'emotional reasoning transparency', where readers can see exactly how the thought got from the writer's brain to the page. I think if the writer is extremely preoccupied with never writing anything that could in principle be criticized or nitpicked, or that might make someone think they are over-confident, it's very hard to do this kind of writing.&nbsp;<br><br><br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "yAfHj2NKcJBvgzz9C", "postedAt": "2022-10-10T16:37:30.128Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>some similar/related thoughts here: <a href=\"https://medium.com/@contemplatonist/on-inhibition-612a2ec9b380\">https://medium.com/@contemplatonist/on-inhibition-612a2ec9b380</a></p>", "parentCommentId": "je4cs6SgRcmeQMSzc", "user": {"username": "Amber"}}, {"_id": "qp3LKs4wwAnafhjHG", "postedAt": "2022-10-10T16:47:34.325Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Love it. Btw, do you have any top writing advice or bullet points/resources? I know Scott's Nonfiction Writing Advice and... that's pretty much it.</p>", "parentCommentId": "yAfHj2NKcJBvgzz9C", "user": {"username": "Emrik"}}, {"_id": "efgmd5DzD68Y85G3n", "postedAt": "2022-10-10T16:55:03.350Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Some things that have influenced my writing have been Steven Pinker's 'The Sense of Style' and George Orwell's 'Politics and the English Language'. I think quite a few of the tips from those are in Scott's Nonfiction Writing Advice too!&nbsp;</p>", "parentCommentId": "qp3LKs4wwAnafhjHG", "user": {"username": "Amber"}}, {"_id": "K3cCcsiGxCeWvGDbm", "postedAt": "2022-10-10T17:28:49.430Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Huh, coincidental choices. I read both! I think Pinker's book influenced <i>something</i> but I can't remember any specifics.</p>", "parentCommentId": "efgmd5DzD68Y85G3n", "user": {"username": "Emrik"}}, {"_id": "TBr94DFtop2EgegKW", "postedAt": "2022-10-10T23:16:46.053Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>I really like this post, especially as someone who is fairly anxious when writing for fear of being judged as ignorant. &nbsp;I definitely agree that we should promote an environment conducive for people to <a href=\"https://www.lesswrong.com/posts/uN3wjp2K6TEQ2oAML/say-wrong-things-1\">say wrong things</a>.&nbsp;</p><p>However, I don't fully agree with &nbsp;the notion of celebrating the self-confidence of people who \"declare that think they can do more good than Peter Singer\". I'm quite likely misinterpreting what you mean by confidence as over-confidence, but just on the face value of it, I prefer claims to have an appropriate level of confidence associated with them. When someone makes a strong claim, I'd like to know whether the person is a domain expert with good epistemics who has done extensive research to arrive at the conclusion, or an innocent kid who claims to have discovered the most important thing in the world. Perhaps just stating <a href=\"https://www.lesswrong.com/posts/Hrm59GdN2yDPWbtrd/feature-idea-epistemic-status\">epistemic status</a> upfront would solve the problem. And perhaps over-confident people who are just about to take your advice to celebrate confidence and stop rewarding modesty should just <a href=\"https://slatestarcodex.com/2014/03/24/should-you-reverse-any-advice-you-hear/?reverseComments=#comments\">reverse the advice</a>.&nbsp;</p><p>On a tangential note, I sometimes find myself doing 'defensive writing' not just for defensive reasons, but also to try to convey what I mean to the reader as accurately as I can by <a href=\"https://www.lesswrong.com/posts/57sq9qA3wurjres4K/ruling-out-everything-else\">ruling out everything else</a>.</p>", "parentCommentId": null, "user": {"username": "zeshen"}}, {"_id": "GpkLgKWwRaYxFbDqq", "postedAt": "2022-10-11T06:38:18.512Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>My take on self-confidence and innocence has several parts to it, and I think it's one of the most important things I want to communicate, for many reasons I don't go into here. But with self-confidence, you don't need to be falsely sure that you'll do more good than Peter Singer, but you <i>can</i> be very confident that <i>trying is the right way to go</i>. Confidence-in-path rather than confidence-in-results.<br><br>I know I'm following a trail that I know <i>also </i>goes to crazytown at some crossroad, and I see the skulls, but I'm pretty confident it's the right way to go for me rn, so I'll continue onwards <a href=\"https://www.lesswrong.com/posts/FMkQtPvzsriQAow5q/the-correct-response-to-uncertainty-is-not-half-speed\">at full speed</a> until I learn that it's not the right path.</p><blockquote><p><i>At no point in your journey, no matter how uncertain you are, no matter how numerous be the options before you, will dragging your feet help you faster get to where you want to go.</i></p></blockquote><p>Sometimes I call it \"hubris\", but it's not really about that. If you make a <i>bet</i> on that you'll do more good than Peter Singer or whatever, you don't need to be certain of the outcome to think it's good EV. But to others who see you betting on it, they might mistake it for certainty--it's as if they forgot that probabilities exist for a moment.</p><blockquote><p><i>This is one of the most important reasons why hubris is so undervalued. People mistakenly think the goal is to generate precise probability estimates for frequently-discussed hypotheses (a goal in which deference can make sense). In a common-payoff-game research community, what matters is making new leaps in model space, not converging on probabilities. We (the research community) are bottlenecked by insight-production, not marginally better forecasts or decisions. Feign hubris if you need to, but strive to install it as a defense against </i><a href=\"https://www.lesswrong.com/posts/yeADMcScw8EW9yxpH/a-sketch-of-good-communication?commentId=b9brscaJdswBpEZiF\"><i>model-dissolving deference</i></a><i>.</i></p></blockquote><p><i>--</i></p><p>Oh, and it was nice to meet you in Berlin! Stay awesome. ^^</p>", "parentCommentId": "TBr94DFtop2EgegKW", "user": {"username": "Emrik"}}, {"_id": "memGsDgJS8WqyaA5b", "postedAt": "2022-10-11T08:53:51.328Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<blockquote><p>Confidence-in-path rather than confidence-in-results.</p></blockquote><p>Nicely said.&nbsp;</p><p>--</p><p>See you at GatherTown soon!</p>", "parentCommentId": "GpkLgKWwRaYxFbDqq", "user": {"username": "zeshen"}}, {"_id": "t8ezcXe3dKA259hT9", "postedAt": "2022-10-11T16:42:51.953Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>I'd like to offer <a href=\"https://twitter.com/benjamin_hilton/status/1579830527884165121\">this</a> as an example of defensive writing that I don't like:</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_120 120w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_240 240w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_480 480w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_600 600w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_840 840w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_960 960w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_1080 1080w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/28b981871b1d8021858713dc227f30c09bd4ac043acb807b.png/w_1162 1162w\"></figure><p>It's so hard to argue with it because all the claims are so vague [like \"it's not obvious that...\"], but the general impression [that I get] is that 80k is encouraging working on building AGIs.</p><p>If you agree with me, consider pushing back on that, maybe <a href=\"https://twitter.com/YonatanCale/status/1579849944491757571\">here</a>.</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "wdG5WwTBhXsxkjvJE", "postedAt": "2022-10-11T18:09:18.824Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<blockquote><p>2) Celebrate innocence &amp; self-confidence; stop rewarding modesty<br><br>This one is a little sad but... when I see someone declare that they have important things to teach the rest of the community, or that they think they can do more good than Peter Singer, I may not always agree that they have a chance--but I'll tear up and my heart will beam with joy and empathy for them, because I know they're sacrificing social comfort and perceived humility in order to virtuously reveal their true beliefs</p></blockquote><p>Confidence is part of the skillset of successful conmen and cult leaders. In conmen, it's fake confidence; in cult leaders, it's often \"real\" <i>over</i>confidence. Such people will gather altruistically motivated followers and volunteers and waste those people's efforts on an ultimately doomed, self-serving mission.</p><p>Those probably weren't the cases you had in mind when you pictured someone being excited about an idea or about some project's impact. But it's important that what you want to reward/encourage is (probably) something like \"genuine confidence that's different from an always-grandiose personality.\"</p>", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "cDMdoWi6a2hm9zhfS", "postedAt": "2022-10-11T19:31:09.483Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Hmm, I see what you mean, but I think I disagree.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefkxfc5s2gmrc\"><sup><a href=\"#fnkxfc5s2gmrc\">[1]</a></sup></span>&nbsp;It's not obvious that \"it's not obvious that\" is bad. And I think it makes sense <i>sometimes</i> to write a post that appeals to authority--but you should be very aware of when you're doing that.</p><p>What I somewhat dislike about this tweet is that it mixes up trying to make you defer to it while also providing gears-level arguments. It invites the mistake of getting <a href=\"https://forum.effectivealtruism.org/posts/FtggfJ2oxNSN8Niix/when-reporting-ai-timelines-be-clear-who-you-re-not?commentId=qSTCJmQqvvHTjEZiL#eWEA2258EPKaFiX5Q\">woozled by the technical arguments</a> just because they came from \"experts\".<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefwpfop2d4ka8\"><sup><a href=\"#fnwpfop2d4ka8\">[2]</a></sup></span></p><p>Additionally, on the object level, I kinda think alignment researchers should be trying to theoretically innovate on the capabilities frontier, just keep it secret and don't tell anyone you don't trust very highly. It's hard to try to align something you don't have a deep understanding of.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnkxfc5s2gmrc\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefkxfc5s2gmrc\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Notice how this whole comment is largely about my state of belief/agreement, rather than about the patterns themselves.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnwpfop2d4ka8\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefwpfop2d4ka8\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This paragraph is mostly about communicating the patterns, but I still lead with \"what I somewhat dislike\"--referring to my beliefs rather than communicating content.</p><p>We should ideally have a standard back-to-object-level codeword that can help defuse discussions from increasingly becoming more and more about belief-states rather than about communicating patterns. Something like... if you say \"blueberry muffins\", your interlocutor will know to stop asking or revealing about (dis)agreement or estimates.</p></div></li></ol>", "parentCommentId": "t8ezcXe3dKA259hT9", "user": {"username": "Emrik"}}, {"_id": "hZHwDCYLoFEyNQBFB", "postedAt": "2022-10-11T19:45:16.061Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>Idk, I think we're much more bottlenecked by people daring to stick out than by people blindly following overconfident people. EAs/rationalists already have strong defenses against the latter. So much so that they'll be very suspicious of anyone openly claiming to be a hero. Even if encouraging confidence increases the risk of conmen, it'd be worth it. Besides, one of the reasons conmen can successfwly amass followers is that the <i>followers</i> lack confidence.</p>", "parentCommentId": "wdG5WwTBhXsxkjvJE", "user": {"username": "Emrik"}}, {"_id": "McMpBBo4JW9eeax28", "postedAt": "2022-10-11T21:22:15.397Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<blockquote><p>EAs/rationalists already have strong defenses against the latter.</p></blockquote><p>I think it could be stronger! While there's a pronounced norm in EA against overconfidence, that's not the same as having \"strong defenses.\" Social signalling is anti-inductive in the sense that the signals that work to trick us into being unduly impressed or intimidated by others' perceived competence cannot be easily summarized with simple rules for what to avoid or look out for. (In other words, even with strong modesty norms, a con man or cult leader could score modesty points wherever doing so is cheap while subtly working in confidence tricks with the way they frame things and with their narrative.)&nbsp;</p><blockquote><p>Besides, one of the reasons conmen can successfwly amass followers is that the <i>followers</i> lack confidence.</p></blockquote><p>That doesn't sound right to me. I think you can be confident and still follow someone you think is deserving of it. Besides, confidence is empty/shallow without the domain-appropriate competence to back it up. In the case of \"who would you follow?,\" the skill in question seems to be people judgment. One part of people judgment is being confident in your own judgment; another part is being the right amount of cynical.&nbsp;<br><br>In any case, I think we might be discussing a false dilemma. I'm personally reading your message as \"it's important to encourage/nurture people's confidence when they have a vision and seem willing to take on ambitious or even heroic projects to make the world better.\" I'm all for it! I just want to add \"and make sure to check if the person seems to have high integrity.\" (\"Checking\" in the sense of \"have your eyes open\" rather than \"be mistrustful from the get go / don't give them a chance.\")&nbsp;<br><br>I agree with you that EA aims seem bottlenecked by people with vision. I am skeptical that people capable of becoming people with vision are easily deterred by social norms (I'm reminded of the chapters in HPMOR around Hermoine wanting to become a heroine). But, admittedly, that doesn't mean that the effect is zero.<br><br>Or maybe you don't see it as a false dilemma and you disagree with me about where we're at with the social pendulum swing, so maybe you consider it important to push the pendulum back <i>as hard as possible</i>. If so, we may find ourselves on ~25% opposed sides on the battlefield over norms. Oh well. Disagreements over \"social pendulum dynamics\" seem notoriously intractable to me. (My pet theory is that people's strongest opinions on social norms, their \"most sacred virtues,\" are often influenced by small t-traumas from things that went particularly poorly for them or for people they care about, and there's so much variation and situations where opposite types of advice is good for different people.)&nbsp;</p>", "parentCommentId": "hZHwDCYLoFEyNQBFB", "user": {"username": "Lukas_Gloor"}}, {"_id": "bg8Aap2mgLtRyuydT", "postedAt": "2022-10-11T22:32:14.626Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<blockquote><p>\"Social signalling is anti-inductive in the sense that the signals that work to trick us into being unduly impressed or intimidated by others' perceived competence cannot be easily summarized with simple rules for what to avoid or look out for.\"</p></blockquote><p>Interesting! Good point.</p><p>- - - - -</p><p>If you follow someone because you have confidence in your ability to evaluate whether they're worth following, then maybe you should follow them. If you follow someone to compensate for your lack of confidence, that's less likely to produce good consequences. I \"follow\" some people because I'm confident in their abilities, e.g. I think Eliezer is worth trying to learn from. I think he's also worth deferring to if you choose not to be an explorer and instead someone who wishes to spend their time Doing and less time figuring out stuff.</p><blockquote><p>\"I am skeptical that people capable of becoming people with vision are easily deterred by social norms\"</p></blockquote><p>I'd like to believe this, but I strongly disagree. I read a comment from Steven Byrnes saying that he (iirc) was was held back by being really uncertain for a long time about whether he had anything usefwl to contribute to the community. I know some other people I think have the power to guide themselves to great things, but who don't fully trust themselves enough.</p><p>Personally, I spent years thinking I was purely \"catching up\" to what everyone else already knows. Every new idea I had was \"ah, so this is what the smart people think already\". It took someone who believed in me to make me feel safe pursuing my own path. It's really hard to be motivated when you're constantly questioning yourself, even when you <i>try</i> to pursue independence.</p><p>I want to push the confidence pendulum way further than it has ever been. I want people to pursue independence, ambition, and self-sacrifice until the road is littered with failed or delusional projects. This is how you <a href=\"https://www.benkuhn.net/outliers/\">sample for outliers on a fat-tailed distribution</a> and double the number of Bankman-Frieds, Yudkowskys, and Borlaugs.</p><p>But I have a bit more nuance in what I mean by \"confidence\". I don't mean unjustified probability estimates. I don't mean lack of curiosity in other people's viewpoints. I don't mean the stereotypical social role, I just mean the stuff that's usefwl for independently pursuing ambitious things with motivation and less <a href=\"https://www.lesswrong.com/posts/dhj9dhiwhq3DX6W8z/hero-licensing\">wasted motion</a>.</p>", "parentCommentId": "McMpBBo4JW9eeax28", "user": {"username": "Emrik"}}, {"_id": "sAR4We2B3BGpEJwCT", "postedAt": "2022-11-12T00:12:19.327Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>This aged somewhat poorly IMO even just 1 month later. Maybe it's easier for others to see now why I feel strongly about what I said.&nbsp;</p>", "parentCommentId": "hZHwDCYLoFEyNQBFB", "user": {"username": "Lukas_Gloor"}}, {"_id": "qN4AJXg8wzPBf8wK6", "postedAt": "2022-11-12T00:27:42.212Z", "postId": "DCAptmT4jReq9aTvT", "htmlBody": "<p>I haven't updated appreciably in this direction after this, but I appreciate you calling attention to it.</p>", "parentCommentId": "sAR4We2B3BGpEJwCT", "user": {"username": "Emrik"}}]