[{"_id": "yPGSyfarnBgi6Jvnf", "postedAt": "2023-05-30T08:36:13.233Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Just a slight note: the link to the form includes the bracket and full stop at the end of the sentence so clicking the link doesn't work :)</p>", "parentCommentId": null, "user": {"username": "Jeroen De Ryck"}}, {"_id": "rRPuhSopeC5pr3foZ", "postedAt": "2023-05-30T10:00:30.677Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Interesting - I definitely think this is valuable. I have two small recommendations for the survey:<br><br>- Specify in the sugary drinks question whether it only includes commercial, fizzy sugary drinks, or any drinks with sugar in (e.g. coffee with sugar, milkshakes, bubble tea, traditional sweet drinks etc.) As it is, you give examples of commercial fizzy drinks, but it's a little ambiguous whether other sweet drinks might be included.<br><br>- Make it clear that you can choose percentages over 100% for the first two options (a life in prison, or without any pleasure is worse than death - many people are likely to believe this). I think that your example percentages (e.g. 0.1%, 1%, 10%, 20%, 30%, 100% etc) are anchoring people to a particularly low score.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dzoldzaya"}}, {"_id": "o6PHiFrK7WCPfHL8B", "postedAt": "2023-05-30T14:38:07.587Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/joel-tan-cearch?mention=user\">@Joel Tan (CEARCH)</a>, I've fixed it. Thank you, Jeroen!&nbsp;</p>", "parentCommentId": "yPGSyfarnBgi6Jvnf", "user": {"username": "edoarad"}}, {"_id": "FufiEbFNgFntNSQmw", "postedAt": "2023-05-31T11:44:13.338Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Oh dear, sorry for the mistake. Thanks Jereon for flagging it, and Edo for fixing it!</p>", "parentCommentId": "o6PHiFrK7WCPfHL8B", "user": {"username": "Joel Tan"}}, {"_id": "BXRrirk6dRk4Sarrs", "postedAt": "2023-06-10T10:27:32.816Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Hi Joel,</p><blockquote><p>In particularly, we have identified taxes on sodium, as well as on sugar-sweetened beverages (i.e. soda), to be potentially extremely cost-effective interventions that the philanthropic community should support through the provision of additional funding and talent.</p></blockquote><p>My understanding is that insulin resistance (and therefoer diabetes mellitus) is <a href=\"https://youtu.be/Aw8hufhIDu0\">caused by fat</a>, not sugar. Of course, I still think that drinking water is generally better than sugar-sweetened beverages.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "daqpPAtZvcjhPvzg9", "postedAt": "2023-06-10T13:37:09.497Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Hi Vasco, thanks for the comment.<br><br>The weight of the scientific evidence is definitely that sugar is a risk factor. <a href=\"https://pubmed.ncbi.nlm.nih.gov/26124185/\">Singh et al (2015)</a> as part of the GBD effort found that 4.5% of diabetes mellitus DALYs were related to SSB consumption. Also, <a href=\"https://pubmed.ncbi.nlm.nih.gov/23460912/\">Basu et al's</a> econometric analysis of panel data from 195 countries finds that every 150 kcal/person/day increase in sugar availability (equivalent to 38.76 of sugar/person/day) was associated with increased diabetes prevalence by 1.1%.<br><br>In terms of the mechanism - aside from impacting calorie intake and obesity, probably it's just a matter of sugary food/drinks having higher glycemic loads, which per <a href=\"https://academic.oup.com/ajcn/article/76/1/274S/4689498\">Willett, Manson &amp; Liu</a> causes insulin resistance as well as pancreatic exhaustion, and hence type 2 diabetes. The evidence for this is very strong: (a) in animal and short-term human studies, a high intake of carbohydrates with a high glycemic index (GI, a relative measure of the incremental glucose response per gram of carbohydrate) produced greater insulin resistance than did the intake of low GI carbohydrates; and (b) in large prospective epidemiologic studies, both GI and glycemic load (GL, the glycemic load multiplied by the GI) of the overall diet have been associated with a greater risk of type 2 diabetes in both men and women.<br><br>Do fill up the survey if you have the time - would value your inputs!</p>", "parentCommentId": "BXRrirk6dRk4Sarrs", "user": {"username": "Joel Tan"}}, {"_id": "wim48FmEMSJRNyEgY", "postedAt": "2023-06-10T15:53:55.752Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Thanks for sharing your thoughts!</p><blockquote><p>The weight of the scientific evidence is definitely that sugar is a risk factor. <a href=\"https://pubmed.ncbi.nlm.nih.gov/26124185/\">Singh et al (2015)</a> as part of the GBD effort found that 4.5% of diabetes mellitus DALYs were related to SSB consumption. Also, <a href=\"https://pubmed.ncbi.nlm.nih.gov/23460912/\">Basu et al's</a> econometric analysis of panel data from 195 countries finds that every 150 kcal/person/day increase in sugar availability (equivalent to 38.76 of sugar/person/day) was associated with increased diabetes prevalence by 1.1%.</p></blockquote><p>I think this is mostly compatible with sugar not causing insulin resistance, because SSB consumption may well correlate with fat consumption (e.g. typical McDonald's menus include soda and lots of fat in fried potatos and hamburgers).</p><blockquote><p>The evidence for this is very strong: (a) in animal and short-term human studies, a high intake of carbohydrates with a high glycemic index (GI, a relative measure of the incremental glucose response per gram of carbohydrate) produced greater insulin resistance than did the intake of low GI carbohydrates; and (b) in large prospective epidemiologic studies, both GI and glycemic load (GL, the glycemic load multiplied by the GI) of the overall diet have been associated with a greater risk of type 2 diabetes in both men and women.</p></blockquote><p>I do not view animal, short-term and prospective epidemiologic studies as strong evidence. Have there been long-term RCTs?</p><blockquote><p>Do fill up the survey if you have the time - would value your inputs!</p></blockquote><p>Thanks for the kind words, and encouragement! I have just submitted it.</p>", "parentCommentId": "daqpPAtZvcjhPvzg9", "user": {"username": "vascoamaralgrilo"}}, {"_id": "5HruGAybAgfxScqqL", "postedAt": "2023-06-11T00:42:05.543Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Just to clarify, the short term human trials are randomized - but that's harder to do for longer term trials, and hence the corresponding reliance on prospective epidemiological studies. While the latter isn't great, those plus a clear biological pathway as establishes by the short term trials would constitute reasonable strong evidence, in my view.</p>\n", "parentCommentId": "wim48FmEMSJRNyEgY", "user": {"username": "Joel Tan"}}, {"_id": "pc8DTCN7GnY6A2kzx", "postedAt": "2023-06-11T10:44:35.975Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Thanks for the clarification! I guess the causal pathway for shorterm RCTs is as follows: less SSB consumption; lower weight; lower insulin resistance. I am confident lower weight leads to lower insulin resistance longterm, because lower weight means less fat in the bloodstream, and there is a clear mechanism via which fat causes insulin resistance. However, I am not confident less SSB consumption leads to lower weight longterm<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefv0swrlckzu\"><sup><a href=\"#fnv0swrlckzu\">[1]</a></sup></span>, because there are many interventions which result in lower weight in the shorterm, but not in the longterm. So I also have doubts about less SSB consumption leading to lower insulin resistance longterm.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnv0swrlckzu\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefv0swrlckzu\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I guess less SSB consumption would result in lower weight longterm if it is replaced by whole plant-based foods, but greater weight if it is replaced by processed animal foods.</p></div></li></ol>", "parentCommentId": "5HruGAybAgfxScqqL", "user": {"username": "vascoamaralgrilo"}}, {"_id": "gxdk3awwE88iCrgfe", "postedAt": "2023-06-12T06:30:29.866Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>The biological pathway here refers to sugar consumption -&gt; glycemic load -&gt; insulin resistance + pancreatic exhaustion -&gt; diabetes. It's unmediated by obesity (though that separately hurts) which is presumably why studies show SSB impacting diabetes prevalence even when controllibg for obesity.</p>\n", "parentCommentId": "pc8DTCN7GnY6A2kzx", "user": {"username": "Joel Tan"}}, {"_id": "gDGHejy7xswX5xYiw", "postedAt": "2023-06-12T08:08:45.694Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>Thanks for clarifying! I have doubts about that pathway. The systematic review of <a href=\"https://bjsm.bmj.com/content/50/8/496\">Imamura 2016</a> found one serving/day of:</p><ul><li>SSB was associated with 18 % and 13 % greater incidence of type 2 diabetes before and after adjusting for adiposity.</li><li>Artificially sweetened beverages (ASB) was associated with 25 % and 8 % greater incidence of type 2 diabetes before and after adjusting for adiposity.</li></ul><p>The glycemic load of ASB is zero (or close), so them being associated with higher incidence of type 2 diabetes is evidence against the pathway you mentioned. It is also interesting that controlling for adiposity is much more relevant for ASB (it reduces the effect by 2/3 instead of the 1/3 of SSB). I guess because people who are obese are more likely to turn to ASB.</p><p>\"For artificially sweetened beverages, publication bias and residual confounding were indicated\", but \"if publication bias was indicated, we adjusted summary estimates for the bias\". It looks like adjusting for adiposity can be tricky:</p><blockquote><p>Adiposity is likely to confound an association of beverage consumption with type 2 diabetes, particularly in research on artificially sweetened beverages.<a href=\"https://bjsm.bmj.com/content/50/8/496#ref-6\"><sup>6</sup></a> <a href=\"https://bjsm.bmj.com/content/50/8/496#ref-8\"><sup>8</sup></a> <a href=\"https://bjsm.bmj.com/content/50/8/496#ref-10\"><sup>10</sup></a> <a href=\"https://bjsm.bmj.com/content/50/8/496#ref-11\"><sup>11</sup></a>  Because of imperfect measurement of adiposity in an epidemiological study,<a href=\"https://bjsm.bmj.com/content/50/8/496#ref-36\"><sup>36</sup></a>  adjustment for adiposity was likely to be insufficient, as discussed previously.<a href=\"https://bjsm.bmj.com/content/50/8/496#ref-3\"><sup>3</sup></a> <a href=\"https://bjsm.bmj.com/content/50/8/496#ref-6\"><sup>6</sup></a> <a href=\"https://bjsm.bmj.com/content/50/8/496#ref-32\"><sup>32</sup></a> <a href=\"https://bjsm.bmj.com/content/50/8/496#ref-37\"><sup>37–41</sup></a>  Thus, to assess if such residual confounding would be substantial, we performed simulation analysis to examine the influence of the bias.<a href=\"https://bjsm.bmj.com/content/50/8/496#ref-42\"><sup>42</sup></a></p></blockquote><p>In addition, to really see if the glycemic load pathway is doing the work, one should control for fat consumption (which I think is what is mostly doing the work). Imamura 2016 does not seem to agree that ASB is better than SSB to prevent diabetes:</p><blockquote><p>None the less, both artificially sweetened beverages and fruit juice were unlikely to be healthy alternatives to sugar sweetened beverages for the prevention of type 2 diabetes.</p></blockquote><p>If sugar was doing the work, they would have to strongly favour ASB over SSB? Have you found studies controlling for both adiposity and fat intake (for the pathway I described, it does not matter whether the fat in the bloodstream comes from our body or food, and therefore one needs to control for both)?</p>", "parentCommentId": "gxdk3awwE88iCrgfe", "user": {"username": "vascoamaralgrilo"}}, {"_id": "epoEYyMJ5wHGyDySZ", "postedAt": "2023-06-15T00:30:35.549Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<p>I would argue against the interpretation that the SSB-ASB evidence is evidence against the glycemic pathway: (a) as you and the authors note, controlling for adiposity is hard; and (b) even assuming the control was perfect, the fact that post-control, SSBs see a 13% greater incidence for diabetes and ASBs see a 8% greater incidence for diabetes doesn't contradict the idea that sugar in itself is a significant risk factor via the glycemic pathway - hence (at the very least) the 5% delta, even assuming that the remaining 8% is explained by something that is common to both SSBs/ASBs (doubtful; again, probability just adiposity).<br><br>Separately, I would again emphasize the evidence for the glycemic pathway from other studies looking at insulin resistance - which gives us a much clearer sense of the biochemical/physiological basis of the effect.</p>", "parentCommentId": "gDGHejy7xswX5xYiw", "user": {"username": "Joel Tan"}}, {"_id": "mPrNpyQgffWNShK5Q", "postedAt": "2023-06-15T09:32:42.333Z", "postId": "DCzRigGd3oEPLR5xa", "htmlBody": "<blockquote><p>hence (at the very least) the 5% delta</p></blockquote><p>I think the delta would be lower if they controlled for fat intake. Have you found studies controlling for both adiposity and fat intake?</p><blockquote><p>Separately, I would again emphasize the evidence for the glycemic pathway from other studies looking at insulin resistance - which gives us a much clearer sense of the biochemical/physiological basis of the effect.</p></blockquote><p>Could you link to the main studies informing your views here?</p>", "parentCommentId": "epoEYyMJ5wHGyDySZ", "user": {"username": "vascoamaralgrilo"}}]