[{"_id": "S2JNmfGTPR5ArApT4", "postedAt": "2015-05-06T10:45:05.200Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Quick thoughts:</p>\n<ul>\n<li>I think willingness to start new charities to fill identified gaps is important for the ecosystem.</li>\n<li>There are already mechanisms working at each stage of this process. Trying to improve the system at one of these points sounds valuable. I have initial concerns about over-reach in trying to do all of it at once.</li>\n<li>There might be a time-lag of years between step 2 and step 3.</li>\n</ul>\n<p>I see two gaps that you might be addressing:</p>\n<p>(1) The interventions with the highest potential aren't the ones which get properly evaluated by RCTs (or there isn't enough of this).</p>\n<p>(2) The interventions with very good evidence from RCTs aren't implemented by charities or aren't scaled up appropriately.</p>\n<p>I'm not certain whether either of these is a genuine gap, but they could be very valuable to address if they are. I'd love to see attention on figuring that out and choosing what to work on accordingly.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "kcrKFTmLe4zeeopCp", "postedAt": "2015-05-06T11:06:36.023Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>My immediate thoughts:</p>\n<ul>\n<li>I'd rather see a charity get recommended by the Open Philanthropy Project than by GiveWell classic. Before deciding, it would seem worthwhile to thoroughly consider the pros and cons of each.</li>\n<li>I think GiveWell and AidGrade already have done a lot of research on effective interventions.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "raSiZRHzG7rnY8XCz", "postedAt": "2015-05-06T13:26:07.669Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Slow Thoughts:</p>\n<p>One of the easiest things would be a charity using already tested effective methods but in different locations. For example GiveDirectly works in Kenya and Uganda, but I don't think they have projects in India and Nigeria where there are larger populations and potentially more chance to scale up and influence policy. </p>\n<p>It may also help to have competition for the effective charities rather than just saying there is only one for each cause whether that be cash transfers, malaria, SCI.</p>\n", "parentCommentId": null, "user": {"username": "DavidNash"}}, {"_id": "FzSMia9tMXCm3Poby", "postedAt": "2015-05-06T16:02:46.387Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<blockquote>\n<p>One of the easiest things would be a charity using already tested effective methods but in different locations. For example GiveDirectly works in Kenya and Uganda, but I don't think they have projects in India and Nigeria where there are larger populations and potentially more chance to scale up and influence policy.</p>\n</blockquote>\n<p>This is largely because Kenya and Uganda have much, much better mobile money systems than India or Nigeria. Overhead in the latter two countries would be significantly higher.</p>\n", "parentCommentId": "raSiZRHzG7rnY8XCz", "user": {"username": "Ben_Kuhn"}}, {"_id": "rG4DaMXXDHu7tbDx9", "postedAt": "2015-05-06T17:55:08.126Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>No obligation to explain, but I'd love to know the reason for the downvote. I think downvotes are a useful source of feedback, and usually when I get one if I re-read my comment I can make an educated guess why. Here I'm not sure!</p>\n", "parentCommentId": "S2JNmfGTPR5ArApT4", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "MWH2khZLoQvniAKue", "postedAt": "2015-05-06T17:57:47.663Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<blockquote>\n<p>There are already mechanisms working at each stage of this process. Trying to improve the system at one of these points sounds valuable. I have initial concerns about over-reach in trying to do all of it at once.</p>\n</blockquote>\n<p>One of the mechanisms working at one stage of this process is &quot;people start charities because they learn about an under-implemented effective intervention.&quot; You can &quot;improve the system&quot; by having there be more people who do this, i.e. by being one of those people. This isn't doing a bunch of things at once, this is being one of the stages in the process.</p>\n<blockquote>\n<p>(2) The interventions with very good evidence from RCTs aren't implemented by charities or aren't scaled up appropriately.</p>\n</blockquote>\n<p>It's pretty clear that this is true; for instance, GiveWell has a number of <a href=\"http://www.givewell.org/international/technical/programs\">priority interventions</a> that they do not currently recommend any charities in.</p>\n", "parentCommentId": "S2JNmfGTPR5ArApT4", "user": {"username": "Ben_Kuhn"}}, {"_id": "htTdMtK5NPQZ7nn99", "postedAt": "2015-05-06T17:58:58.105Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>GiveWell's research is on their <a href=\"http://www.givewell.org/international/technical/programs\">intervention reports page</a>. Notably, they have a few reports on interventions which state &quot;promising evidence of effectiveness&quot; but no top charity implements them. You might be able to contact GW for more info on what organizations they wish existed, or what gaps they see.</p>\n", "parentCommentId": "kcrKFTmLe4zeeopCp", "user": {"username": "Ben_Kuhn"}}, {"_id": "cNaGibk6WTu7ajwJS", "postedAt": "2015-05-06T18:26:11.347Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<blockquote>\n<p>Step three – found a new charity</p>\n</blockquote>\n<blockquote>\n<p>How hard can it be ...?</p>\n</blockquote>\n<p>It seems pretty hard ;) To the nearest hundred how many manhours do people think it'd take to start a direct poverty relief charity?</p>\n", "parentCommentId": null, "user": {"username": "Nekoinentr"}}, {"_id": "HFPE6ArHc4emp5TPT", "postedAt": "2015-05-06T19:17:34.510Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>+1 to the importance of geography.  The deworming RCTs, though highly effective, were location-dependent.  I imagine the same goes for other interventions for global poverty/global health.</p>\n", "parentCommentId": "raSiZRHzG7rnY8XCz", "user": {"username": "MatthewDahlhausen"}}, {"_id": "mF6xYgcEKEq9LBDf5", "postedAt": "2015-05-06T19:45:29.686Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I'd estimate a thousand, about.</p>\n", "parentCommentId": "cNaGibk6WTu7ajwJS", "user": {"username": "Ervin"}}, {"_id": "G2FLgGAqYsKDkirCM", "postedAt": "2015-05-06T19:46:29.182Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I would guess 1-3 years with 1-2 employees (~2000-12000 hours). It seems like it would depend a lot on the type of charity.</p>\n", "parentCommentId": "cNaGibk6WTu7ajwJS", "user": {"username": "Joey"}}, {"_id": "kn7w3oTwspkbf6Gx6", "postedAt": "2015-05-06T19:51:08.953Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<blockquote>\n<p>One of the mechanisms working at one stage of this process is &quot;people start charities because they learn about an under-implemented effective intervention.&quot; You can &quot;improve the system&quot; by having there be more people who do this, i.e. by being one of those people. This isn't doing a bunch of things at once, this is being one of the stages in the process.</p>\n</blockquote>\n<p>Absolutely agree with this -- this was the major method of improving the system I had in mind (perhaps could have stood to be clearer about that).</p>\n<blockquote>\n<p>It's pretty clear that this is true; for instance, GiveWell has a number of priority interventions that they do not currently recommend any charities in.</p>\n</blockquote>\n<p>I think this is a helpful data point but it doesn't follow from this. GiveWell has had finite resources and has only been able to evaluate a certain number of charities. Additionally they have (with good reasons) strong desires for transparency in charities that they recommend. Both of these mean that there is quite a space of possibility for these interventions to be well-executed and scaled by existing charities. However, I'd ask GiveWell!</p>\n", "parentCommentId": "MWH2khZLoQvniAKue", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "JSzWAXJNPiFrin9Jo", "postedAt": "2015-05-06T23:19:46.569Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Thanks for posting this. I think explicitly asking for critical feedback is very useful. </p>\n<blockquote>\n<p>If the intervention is not currently supported by a large body of research then we want to fund/carry out a randomized controlled trial to test whether it’s worth pursuing this intervention.</p>\n</blockquote>\n<p>RCTs are seriously expensive, would take years to get meaningful data, would need to be replicated as well before you could put much faith in it, and it wouldn't align with the core skillset I'd imagine you'd need to be starting an organisation (so you'd need to outsource it, which would increase the costs even more). As Ryan said, it might be more useful to useful to aim to be recommended by OPP, or search for another kind of EA market inefficiency. Your other ideas of finding supportable but neglected interventions and doing them sounds pretty useful though.</p>\n", "parentCommentId": null, "user": {"username": "Peter McIntyre"}}, {"_id": "fb98r7aikebaajPPw", "postedAt": "2015-05-07T03:53:09.309Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Your comment now seems to be at 100% positive, so maybe they downvoted you by accident and subsequently reversed it.</p>\n", "parentCommentId": "rG4DaMXXDHu7tbDx9", "user": {"username": "Larks"}}, {"_id": "vdGYSyCqkBiGPEJWZ", "postedAt": "2015-05-07T10:27:22.669Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Looks right! I'd delete this comment thread, but don't think I can.</p>\n", "parentCommentId": "fb98r7aikebaajPPw", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "jvw56muibpTKL6PjQ", "postedAt": "2015-05-07T12:26:08.781Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Where did EA ventures get to with this? If human capital constrained - some kind of Teach First model might work / Rocket Internet model might work?</p>\n", "parentCommentId": "kn7w3oTwspkbf6Gx6", "user": {"username": "tomstocker"}}, {"_id": "ivApPK5NgS3qPt43d", "postedAt": "2015-05-07T12:47:30.797Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Is there not some value to tying up what we currently have for each of these stages in one place for potential entrepreneurs / people with potential RCT resource to see?</p>\n", "parentCommentId": "S2JNmfGTPR5ArApT4", "user": {"username": "tomstocker"}}, {"_id": "pEnZrCEg8M3fyGEfC", "postedAt": "2015-05-07T13:34:16.169Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Sounds great, 10/10, sure you'll work all this stuff out along the way :)</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "2JDDfgYuRCuByGrdW", "postedAt": "2015-05-07T23:08:03.817Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I think that many EA's could be interested in volunteering on this type of project especially in step 1 &amp; 2. Although coordinating a large amount of volunteers is likely to be quite time consuming.</p>\n", "parentCommentId": null, "user": {"username": "kierangreig"}}, {"_id": "A8Y6dgcRTjAtcJvGw", "postedAt": "2015-05-08T17:55:58.804Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Hi Denise,</p>\n<p>I'm keen for more people to try this. It does seem like there's a real gap here - there's funders who will fund if you meet clear criteria but few people (it seems) explicitly trying to make them. GiveWell has said as much before. </p>\n<p><a href=\"http://blog.givewell.org/2013/03/21/trying-and-failing-to-find-more-funding-gaps-for-delivering-proven-cost-effective-interventions/\">http://blog.givewell.org/2013/03/21/trying-and-failing-to-find-more-funding-gaps-for-delivering-proven-cost-effective-interventions/</a></p>\n<p>We wrote about it on 80,000 Hours here:</p>\n<p><a href=\"https://80000hours.org/career-guide/top-careers/profiles/founding-effective-global-poverty-non-profits/\">https://80000hours.org/career-guide/top-careers/profiles/founding-effective-global-poverty-non-profits/</a></p>\n<p>A few notes:</p>\n<ul>\n<li>GiveWell also maintains a list of interventions they're interested in funding people within: <a href=\"http://www.givewell.org/international/technical/programs/2012-version\">http://www.givewell.org/international/technical/programs/2012-version</a></li>\n<li>GiveWell sometimes provides startup grants for new charities tackling one of these interventions.</li>\n<li>If I were going to try to do this, I'd start by trying to talk to GiveWell and whether them funding me would ever be possible, and if so, what I'd need to do. </li>\n<li>I think there's two main options: (i) Choose an area where there's several RCTs already but no specialist charity - the ideal (ii) Choose one were the evidence is more speculative and work with academics to do an RCT on it. This is what Development Media International is doing. It's far slower and more expensive though.</li>\n</ul>\n<p>More comments:</p>\n<p>It's harder than it looks because when interventions are clearly proven, they're often implemented by government's instead. Small charities like SCI need to &quot;get in&quot; when the evidence is emerging but not settled, hoping to accelerate the time when the intervention is fully tested then scaled by governments. This means it's a difficult judgement call about which interventions to focus on. I think this is why usually GiveWell charities have been founded by experts in their areas (with the exception of AMF) - these were the people able to see the gaps and execute them ahead of others. If this is true, then the first step might be to go and get a Masters in development economics.</p>\n<p>It also seems like it's very hard to run these types of charities and convince others to give you money. The leaders of all the GiveWell recommended charities usually strike me as extremely able. GiveDirectly were Economics PhDs at MIT and Harvard; Alan Fenwick is an Professor; Rob Mather was a successful consultant, and so on. With the aid of the EA community, it may be easier to succeed than in the past, but I'm not sure.</p>\n<p>I'm really interested in any progress you make on this project, so please keep me in the loop. In particular, if you prepare a list of interventions or form a group of people interested in doing this, I'd happily add it to our career profile.</p>\n<p>Best,</p>\n<p>Ben</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "6BpWznXN3nFnBTcQP", "postedAt": "2015-05-09T08:58:26.000Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Sorry for not having responded to any of this yet, will take me another couple of days at least.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "vqzA5f2X9mZM6a98y", "postedAt": "2015-05-12T02:58:57.502Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I now think this was a huge underestimate.</p>\n", "parentCommentId": "mF6xYgcEKEq9LBDf5", "user": {"username": "Ervin"}}, {"_id": "rvzwPDfB6aYNq7QBu", "postedAt": "2015-05-12T02:59:58.249Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>You can 'retract' which crosses it out, signalling 'don't bother reading'.</p>\n", "parentCommentId": "vdGYSyCqkBiGPEJWZ", "user": {"username": "Ervin"}}, {"_id": "ByBKaf5NdhZnLNh3s", "postedAt": "2015-05-13T02:59:47.537Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>What type of (presumably typical, 'median') charity were you considering when you got that figure?</p>\n", "parentCommentId": "G2FLgGAqYsKDkirCM", "user": {"username": "Nekoinentr"}}, {"_id": "kfpJiSrSoxGdJeeTt", "postedAt": "2015-05-13T14:26:45.539Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>But all those costs of RCTs are clearly worth it. Expensive? If your intervention is vaguely promising then EAs will throw enough money at you to get started. Time? Better get started now. Replication? More cost, EAs will fund. Outsource? Higher quality, EAs will fund.</p>\n", "parentCommentId": "JSzWAXJNPiFrin9Jo", "user": {"username": "lincolnq"}}, {"_id": "pArfQjYHyiMCwEPk8", "postedAt": "2015-05-13T17:48:07.759Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>What makes you think EAs would provide enough money? That would be excellent if so.</p>\n", "parentCommentId": "kfpJiSrSoxGdJeeTt", "user": {"username": "Nekoinentr"}}, {"_id": "YLi6NqTwW4mbJuMx5", "postedAt": "2015-05-14T22:12:02.017Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>was mainly considering the charities I have worked for/with in the past (mostly small EA charities).</p>\n", "parentCommentId": "ByBKaf5NdhZnLNh3s", "user": {"username": "Joey"}}, {"_id": "bfJDiibM5aWzszrGu", "postedAt": "2015-05-14T22:43:20.105Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I think GiveWell has considered funding RCTs for promising interventions and decided against it. They easily cost millions of dollars, take several years, and the evidence provided is often quite weak. Best to focus on the existing evidence-base from academia first, then move on to new RCTs when that's all exhausted (ideally through partnerships with academics, which I think is what DMI did).</p>\n", "parentCommentId": "kfpJiSrSoxGdJeeTt", "user": {"username": "Benjamin_Todd"}}, {"_id": "5j5bKJ6iFS8ssAXoc", "postedAt": "2015-05-14T23:50:07.891Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>So it'd be a meta charity (movement building, or something like you current money-moving one), rather a direct poverty relief charity like I asked? I was looking for a more concrete example.</p>\n", "parentCommentId": "YLi6NqTwW4mbJuMx5", "user": {"username": "Nekoinentr"}}, {"_id": "HPbsKk7PvHPp6RRk3", "postedAt": "2015-05-15T00:45:49.942Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Happy to update based on more concrete or relevant numbers. I would be interested in hearing your estimate.</p>\n", "parentCommentId": "5j5bKJ6iFS8ssAXoc", "user": {"username": "Joey"}}, {"_id": "BTHeTYNoxL7mTMXAu", "postedAt": "2015-05-19T07:31:51.484Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I more meant what a specific, concrete example of such a charity would be. E.g. one which gets a certain group (EAs, or the sciency types you've targeted before I think) to commit to meat-reduction.</p>\n", "parentCommentId": "HPbsKk7PvHPp6RRk3", "user": {"username": "Nekoinentr"}}, {"_id": "gW3a834CfThoAiWan", "postedAt": "2015-05-21T10:07:23.398Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Hi Ryan, Can you clarify why you would rather see a charity get recommended by the Open Philanthropy Project than by GiveWell classic?</p>\n", "parentCommentId": "kcrKFTmLe4zeeopCp", "user": {"username": "weeatquince"}}, {"_id": "aZFveDLguEoFYWDXT", "postedAt": "2015-05-21T15:54:25.859Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Because I think Open Phil evaluates higher expectation, higher risk styles of charity, and I don't think risk-aversion makes sense for altruism.</p>\n<p>Also more philosphically, I don't think we have good reasons to expect that directly measurable interventions in global health are likely to be the highest-leverage ways to make a safe and flourishing humanity in the long run, which is what seems more important. It seems like charities funded or recommended by Open Phil have a better chance at improving long-run flourishing.</p>\n", "parentCommentId": "gW3a834CfThoAiWan", "user": {"username": "RyanCarey"}}, {"_id": "EYeeC4gCDzPpEMv8A", "postedAt": "2015-05-26T15:13:35.721Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Hi Ben,</p>\n<p>thanks for your comment. As it looks like, we'll talk to GiveWell tomorrow (mostly to decide which kind of format the project should have), before we decide how to proceed. We'll update everyone on this thread then.</p>\n<p>We'll keep your other concerns in mind and will bring up some of them with GiveWell, especially whether RCTs are worth it. The details should be left for the intern to investigate, though. \nWe think it's very likely to be valuable to at least talk to experts from the prospective areas as well.</p>\n<p>We aren't necessarily intending to start a new charity then ourselves, since as you said, we might not be the people best suited to it (though of course it might be better than noone doing it, but then again we have to look at opportunity costs.) \nRight now we're mostly keen on closing the gap between where the EA movement at large is now and a situation where EAs could just look quickly at the data and start a charity.\nIt would also be possible that I fund someone who's willing to do this and/or they could apply to EA Ventures. </p>\n<p>Best,\nDenise</p>\n", "parentCommentId": "A8Y6dgcRTjAtcJvGw", "user": {"username": "Denise_Melchin"}}, {"_id": "hqp6vnxcJP2QzzbwP", "postedAt": "2015-05-26T15:15:14.659Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Thank you for pointing this out. I had expected them to be a lot cheaper. \nIf GiveWell, as Ben said, has decided against funding RCTs, I'm not very likely to be convinced of their usefulness either.</p>\n", "parentCommentId": "JSzWAXJNPiFrin9Jo", "user": {"username": "Denise_Melchin"}}, {"_id": "RbFzZH2e34FzKbFKQ", "postedAt": "2015-05-26T15:22:46.360Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Thanks Owen. I agree with you on every point. Re. the possibility it might be too much to do all of them at once - this is why I want to focus now on having general research done that is needed before an EA could start a direct charity, before we focus on actually founding a charity.</p>\n<p>Especially agree with your last paragraphs - this is why we're (very likely) trying to fund someone to do this research. \n(I'd love to do it myself, but unfortunately won't have time for a project this size within the next year. If we can't find someone willing to do it in that time frame, I might end up doing it myself.)</p>\n", "parentCommentId": "S2JNmfGTPR5ArApT4", "user": {"username": "Denise_Melchin"}}, {"_id": "HSfSomd2x7mMZHG8A", "postedAt": "2015-05-26T15:23:21.394Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I'm not sure what you mean - where does EA Ventures come into this?</p>\n", "parentCommentId": "jvw56muibpTKL6PjQ", "user": {"username": "Denise_Melchin"}}, {"_id": "JE7yMsofjWQ6XH25w", "postedAt": "2015-05-26T15:23:55.549Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Yes - this is (before doing more research) what we want our intern to do. :-)</p>\n", "parentCommentId": "ivApPK5NgS3qPt43d", "user": {"username": "Denise_Melchin"}}, {"_id": "8APbjyZJpAh779WEw", "postedAt": "2015-05-26T15:25:24.838Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>We considered this as well, but ultimately decided that it would be easier for one person to dig into this issue deeply than many more shallowly.</p>\n", "parentCommentId": "2JDDfgYuRCuByGrdW", "user": {"username": "Denise_Melchin"}}, {"_id": "d52N27McGd4byCLDf", "postedAt": "2015-05-26T15:26:23.813Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Thanks for highlighting this option. In general, we'd expect conclusions on what would be a useful intervention to be reached further down the line in the research project.</p>\n", "parentCommentId": "raSiZRHzG7rnY8XCz", "user": {"username": "Denise_Melchin"}}, {"_id": "CNst5kceDrfzfhnSZ", "postedAt": "2015-05-26T15:27:42.918Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>My first (uneducated, so take it with a huge grain of salt) guess would be 1-5 years for 1-2 people, similar to Joey's.</p>\n", "parentCommentId": "cNaGibk6WTu7ajwJS", "user": {"username": "Denise_Melchin"}}, {"_id": "PA3FxYxZf7AePA6kZ", "postedAt": "2015-05-27T12:53:06.489Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Does EA Ventures not share the goal - to facilitate and support high impact ventures that wouldn't have happened (as well) otherwise? I'd have thought you'd have already discussed these issues having the fantastic staff etc. that you do?</p>\n", "parentCommentId": "HSfSomd2x7mMZHG8A", "user": {"username": "tomstocker"}}, {"_id": "kZDQXNNDeSASjx5dP", "postedAt": "2015-05-27T16:25:29.832Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Presumably it's not wholly uneducated, given you've been looking into this issue :) Would you have time at some point to share what's feeding into that estimate (even if it's more a partial list of factors rather than being a full defense)?</p>\n", "parentCommentId": "CNst5kceDrfzfhnSZ", "user": {"username": "Nekoinentr"}}, {"_id": "9dsRJ89AsQD8HHz6h", "postedAt": "2015-06-23T03:56:20.629Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>I've been thinking about this for some time, and decided to make an account to post this idea I have. I'd like to hear what the rest of the community thinks before I invest more in this:</p>\n<p>Posttraumatic mental illness happens in the ‘developing world’ <a href=\"http://www.newsite.jamkhed.org/blog/burned-alive-the-story-of-reshma\">such as</a> in Jamkhed, a rural community with arguably the best health infrastructure in the ‘rural world’, but <a href=\"http://www.doctorswithoutborders.org/news-stories/field-news/psychologists-and-msf-delivering-mental-health-care-kenyas-refugee-camps\">effective criminal justice reform](http://www.givewell.org/labs/causes/criminal-justice-reform) is a hard problem and (humanitarian posttraumatic support</a> is complicated by paternalistic traditional practices.</p>\n<p>However, evidence-based treatment guidelines are <a href=\"http://phoenixaustralia.org/for-practitioners/practitioner-resources/\">available</a> and though some resources <a href=\"https://www.nicabm.com/nicabmblog/a-trauma-therapy-program-for-children-in-conflict-zones-2/\">are available for post-conflict conditions</a>, there are no known efforts for provision of post-traumatic services to service communities outside of the <a href=\"https://www.youtube.com/watch?v=kPcsuNbnJ68&amp;app=desktop\">West</a> where there are high rates of  domestic violence and crime PTSD.</p>\n<p>The purpose of Posttraumatic Outreach ('PO') is to start a <a href=\"https://80000hours.org/topic/careers/non-profit/founding-effective-non-profits\">effective non-profits</a> this gap, starting by piloting the provision of provide cost-effective, widely available psychoeducational material to promote self-directed posttraumatic treatment for rural communities in <a href=\"http://www.jamkhed.org\">Jamkhed</a>.</p>\n<p>The design of the self-administered TF-CBT handbook is to help victimisable populations vanguard or intervene in their own and the members of their community’s post-traumatic mental health.</p>\n<p>If you are interested in getting involved please say so! We will operate independently of any other organisation and are organised solely at this place of posting at the time of writing.\nI can also be contacted privately on <a href=\"mailto:posttraumaticoutreach@gmail.com\">posttraumaticoutreach@gmail.com</a> and at the time of writing, there is no one else working on this.</p>\n<p>I am particularly interested in critiques on whether this project is a worthwhile direction of EA efforts relative to other projects, particularly those on impact.io</p>\n<p>Thanks!\nOh, in case you don't know:\n<a href=\"http://media.psychology.tools/worksheets/english_us/what_is_tf-cbt_en-us.pdf\">Trauma-Focused Cognitive Behavioral Therapy (TF-CBT)</a> for <a href=\"https://en.wikipedia.org/wiki/Psychopathology\">psychopathology</a></p>\n", "parentCommentId": null, "user": {"username": "PostOut"}}, {"_id": "zXepnykHeBJE6nWL3", "postedAt": "2015-06-26T07:58:39.464Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Hi all,</p>\n<p>we've put this on hold for now.</p>\n<p>After talking to GiveWell, they have decided to take it on themselves. :-)</p>\n<p>We'll check back when they are done with their research and look whether there's anything we'd still like to add, but this will take at least a few months.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "vchCu4hJeost9vyuY", "postedAt": "2015-06-26T08:46:19.903Z", "postId": "Dd3XF4tw8FE482XrS", "htmlBody": "<p>Good outcome!</p>\n", "parentCommentId": "zXepnykHeBJE6nWL3", "user": {"username": "RyanCarey"}}]