[{"_id": "nxJfJiFJfFvAi552L", "postedAt": "2017-12-01T01:02:21.001Z", "postId": "DdCKagpLfMNZFLa9R", "htmlBody": "<p>Can ALLFED get listed on EA Funds (<a href=\"https://app.effectivealtruism.org)\">https://app.effectivealtruism.org)</a>? That should enable tax deductible donations from the UK.</p>\n", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "kNu4w3o4MSKoMoqJb", "postedAt": "2017-12-21T22:54:17.469Z", "postId": "DdCKagpLfMNZFLa9R", "htmlBody": "<p>Thanks for writing this! This is a very interesting idea.</p>\n<p>Do you have thoughts on &quot;learning&quot; goals for the next year? E.g. is it possible that you could find a certain valuable food source with significantly more or less effort expected? Or could you learn of a non-EA funding source (e.g. government grants) that would make you significantly more impactful? I'm mostly interested in your $10,000 order of magnitude, if that's relevant.</p>\n<p>Also: do you think that your research could negatively impact animal welfare in the event that a global catastrophe does not occur? E.g. could you recommend a change to fishing practices which are implemented prior to a catastrophe which increases the number of farmed fish or changes their quality of life?</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "TozTqo7fThcMiZM8f", "postedAt": "2017-12-30T01:07:02.583Z", "postId": "DdCKagpLfMNZFLa9R", "htmlBody": "<p>Thanks! Yes, it is possible we will find new food sources. Some that I have not yet been able to analyze include bacteria that eat plastic, bacteria that run on electricity, and direct chemical synthesis of food. We are actively pursuing non-EA grants and foundations.\nGenerally we would not be recommending changing the way things are done today very much, because that can get into the billions of dollars of cost. So I doubt we would negatively impact animal welfare if the catastrophe did not occur.</p>\n", "parentCommentId": "kNu4w3o4MSKoMoqJb", "user": {"username": "Denkenberger"}}, {"_id": "nCrdy4axybHCjNFrB", "postedAt": "2017-12-30T23:57:02.139Z", "postId": "DdCKagpLfMNZFLa9R", "htmlBody": "<p>This is a useful write-up, thank you for this and your previous posts on alternate foods.</p>\n<p>Do you know which US government departments are working on food in catastrophes, if any? DHS? FEMA? USDA (e.g. <a href=\"https://www.usda.gov/topics/disaster)\">https://www.usda.gov/topics/disaster)</a>? I assume that in catastrophes government coordination on food is key - the closest parallel that comes to mind is rationing in the UK after WW2. I'd be interested if there's anything public to read about departments' budgets for things like this, or how they're thinking about it.</p>\n", "parentCommentId": null, "user": {"username": "JacobTref"}}, {"_id": "stbxeM78sHJAWp52E", "postedAt": "2017-12-31T02:30:25.236Z", "postId": "DdCKagpLfMNZFLa9R", "htmlBody": "<p>Good question. We have spent some time trying to find the most appropriate parts of the US and UK governments. USDA looks at smaller disasters, as does FEMA/DHS. The Cold War Civil Defense Department turned into FEMA, but now FEMA does not consider conflict scenarios. DOD is a possibility. The UK foreign office put out a <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=2&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwjDrY6ykv_UAhVDaz4KHW70AmUQFgguMAE&amp;url=https%3A%2F%2Fwww.stat.berkeley.edu%2F~aldous%2F157%2FPapers%2Fextreme_weather_resilience.pdf&amp;usg=AFQjCNEy2MTX-5Q_hmiex9-xnNnFXbO_5w\">report</a> on the ~80% likelihood of 10% global agricultural shortfalls this century. We have found very few people thinking about what to do if there were a 10% or 100% agricultural shortfall.</p>\n", "parentCommentId": "nCrdy4axybHCjNFrB", "user": {"username": "Denkenberger"}}]