[{"_id": "h3p9SoAaifGtFjQAM", "postedAt": "2023-09-06T21:09:13.484Z", "postId": "Defu3jkejb7pmLjeN", "htmlBody": "<p>Nick is being so characteristically modest in his descriptions of his role here. He was involved in EA right from the start — one of the members of Giving What We Can at launch in 2009 — and he soon started running our first international chapter at Rutgers, before becoming our director of research. He contributed greatly to the early theory of effective altruism and along with Will and I was one of the three founding trustees of the Centre for Effective Altruism. I had the great pleasure of working with him in person for a while at Oxford University, before he moved back to the States to join Open Philanthropy. He was always thoughtful, modest, and kind. I'm excited to see what he does next.</p>", "parentCommentId": null, "user": {"username": "Toby_Ord"}}, {"_id": "3midcEBMnHgWtJ9mD", "postedAt": "2023-09-07T11:04:51.726Z", "postId": "Defu3jkejb7pmLjeN", "htmlBody": "<p>Thank you for all of your hard work in this role, Nick.&nbsp;</p><p>When I was still new to leading CEA (and fairly new to management), your advice as active trustee was incredibly useful. I learned a lot from you about how to manage people, and your feedback on our plans was always perceptive. I think that I would have done a much worse job without your advice and support.</p><p>I've always found you tirelessly kind, thoughtful, and collaborative, and I've really enjoyed working with you.</p>", "parentCommentId": null, "user": {"username": "Maxdalton"}}, {"_id": "tPWtS5Z3MfD2YkCwM", "postedAt": "2023-09-07T12:49:23.627Z", "postId": "Defu3jkejb7pmLjeN", "htmlBody": "<p>Thanks a lot for your work Nick, genuinely. We have been lucky to have you. I wish you success going forward.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "NxxS73hfkuHHhfBLe", "postedAt": "2023-09-07T13:03:58.764Z", "postId": "Defu3jkejb7pmLjeN", "htmlBody": "<p>(My personal views only, and like Nick I've been recused from a lot of board work since November.)<br><br>Thank you, Nick, for all your work on the Boards over the last eleven years. You helped steward the organisations into existence, and were central to helping them flourish and grow. I’ve always been impressed by your work ethic, your willingness to listen and learn, and your ability to provide feedback that was incisive, helpful, and kind.</p><p>Because you’ve been less in the limelight than me or Toby, I think many people don’t know just how crucial a role you played in EA’s early days. Though you joined shortly after launch, given all your work on it I think you were essentially a third cofounder of Giving What We Can; you led its research for many years, and helped build vital bridges with GiveWell and later Open Philanthropy. I remember that when you launched Giving What We Can: Rutgers, you organised a talk with I think over 500 people. It must still be one of the most well-attended talks that we’ve ever had within EA, and helped the idea of local groups get off the ground.</p><p>The EA movement wouldn’t have been the same without your service. It’s been an honour to have worked with you.</p>", "parentCommentId": null, "user": {"username": "William_MacAskill"}}, {"_id": "jomZjK9NbaJCHSzNP", "postedAt": "2023-09-07T13:09:36.885Z", "postId": "Defu3jkejb7pmLjeN", "htmlBody": "<p>Thank you for all your hard work as a trustee. I’m personally sad to know you won’t be on the board of the organisation I work for anymore. But I’m also excited that you get to put your full attention into your next venture.&nbsp;</p><p>Being a trustee seems extremely difficult to do well at the best of times, given the amount of responsibility entailed without day to day involvement. Being a trustee for CEA/EV has seemed particularly unenviable to me, even before this year.</p><p>I felt kind of sceptical when we first set up CEA (now EV) about how long we’d manage to make it work. After all, 9 in 10 start ups fail and it seems like quite the handicap to be set up and run by philosophy students. Over the last decade it’s hugely outdone my expectations. Its grown far faster than expected and ended up encompassing so many different activities and projects. That’s made being responsible for all of it seem difficult and alarming to me. I’ve been grateful for all the years you took that on.&nbsp;</p><p>I remember when we were putting together the board thinking that there were few people I’d trust enough to feel excited to have them in control of an organisation I cared so much about. And I remember how confident I was that you were one of them. The advice I got at the time about startups was that the founders very often end up not getting on, because it’s such a high pressure environment. But I’ve continued to trust your judgement more than almost anyone else I know. I still feel confident that whatever is thrown at you, you’ll handle it resolutely and keep your eye on what would help others most. Thanks for many years of such competent hard work.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "4JyLTsxtNiAcrs8pu", "postedAt": "2023-09-07T13:47:02.232Z", "postId": "Defu3jkejb7pmLjeN", "htmlBody": "<p>With apologies for not managing to be quite as eloquent/professional as the others: I have nothing but love, respect and gratitude for you, Nick; you've always been so warm, insightful and supportive. I may always think of you primarily as one of the three founding pillars of CEA/EV, but I'm excited to see what you do next :-)</p>\n", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "sEYegKPeHeGewzuHD", "postedAt": "2023-09-12T00:02:16.180Z", "postId": "Defu3jkejb7pmLjeN", "htmlBody": "<p>Thanks so much for all your hard work since before EA existed, Nick. The qualities you brought and inspired in others as a foundational and highly capable figure in EA are evident in the love that so many people this comment section have for you.&nbsp;</p><p>Can you help me understand why you stepped down from the EV boards in August 2023 because of too many recusals starting in November 2022? Did the amount you could participate in the boards meaningfully change recently? You said this was a good time for you to step down, but from the post, it doesn’t sound like there have been significant changes in your ability to contribute to the board since November 2022.&nbsp;</p><p>It’s very difficult for me to understand why, in the aftermath of a crisis, someone with wide-ranging recusals stemming from the crisis that were preventing them from contributing enough would take 9+ months to step down.&nbsp;</p><p>You did this for both the EV boards, which further compounds the issue.&nbsp;</p><p>Additionally, the point of EA is to do the most good. This has been the most critical time period in EA’s history. The EA community meaningfully contributed to an $8,000,000,000 fraud. In the 10 months since then, we have endured painful scandal after scandal, some exposing important governance and leadership failures. Importantly, governance and leadership failures were a factor in the catastrophic FTX fraud, such as the&nbsp;<a href=\"https://www.semafor.com/article/11/18/2022/effective-altruism-group-debated-sam-bankman-frieds-ethics-in-2018\"><u>CEA/EV trustees</u></a> - Will MacAskill, Toby Ord, and likely Nick Beckstead for the time period in question (based on the <a href=\"https://web.archive.org/web/20180618200316/https://www.centreforeffectivealtruism.org/team/\">Wayback Machine</a>)<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreftmau48s587p\"><sup><a href=\"#fntmau48s587p\">[1]</a></sup></span>&nbsp;-&nbsp; and other EA leaders effectively ignoring concerns about the business ethics and risk management of SBF while promoting and helping him.&nbsp;</p><p>With all this and more context than I could possibly get into here, it’s even more difficult for me to understand why you stayed on either, let alone both, of the EV boards for 9+ months after FTX exploded.&nbsp;</p><p>I’m sure one consideration was the challenge of finding new and trustworthy board members for small boards. But if this was the bottleneck, why wasn’t it prioritized and dealt with much earlier? It&nbsp;<i>really</i> shouldn’t take close to a year to replace members with wide-ranging recusals in crisis time. This should have been one of the first problems to solve.&nbsp;</p><p>This is all the more true considering the central role of EV in the EA ecosystem. EA has had serious leadership vacuums in this critical period that have significantly impacted our community and, much more importantly, our attempt to make the world a better place.&nbsp;</p><p>It was noteworthy to me that an EV US board member, Rebecca Kagan,&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/pWvsvFLeH9LekGqTt/updates-to-the-effective-ventures-us-board\"><u>resigned</u></a> her position in April of this year due to disagreements with the EV boards’ strategy and approach. I hope we hear from her in the future.&nbsp;</p><p>I didn’t want to potentially change the mood on a leaving post that ideally should have been just filled with appreciation for a person with many outstanding qualities, but it’s really very difficult for me to understand how these sorts of consequential and inexplicable actions - much of this also applies to Will MacAskill of course - are accepted without comment in some of the most important organizations of the EA movement.&nbsp;</p><p>It makes me worry that not enough lessons have been learned from FTX.&nbsp;</p><p>If what I have said is wrong in any way - very possible! - I would love to hear how.</p><p>All that said, I wish you best of luck for the future Nick.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fntmau48s587p\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreftmau48s587p\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;There is a small chance I am unable to rule out that Hilary Greaves had replaced Nick Beckstead as a trustee at the time the CEA UK trustees considered allegations against SBF but took no action. Confirmation either way is welcome.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Grumpy Squid"}}]