[{"_id": "YrNo6AcASgASZWbPM", "postedAt": "2023-09-23T09:39:43.751Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>In my mind there are 2 main differences:</p><ol><li><strong>Economic degrowth is undesirable, vs pausing AI is at least arguably desirable</strong> – climate change is very unlikely to lead to a literal existential catastrophe, \"business as usual\" tech improvements and policy changes (i.e., without overthrowing capitalism) will likely lead to a clean energy transition as is, economic degrowth would probably kill many more people than it would save, etc. Meanwhile, AI presents large existential risk in my mind, and I think a pause would <i>probably</i> lower this risk by a non-negligible amount.</li><li><strong>Economic degrowth is much less politically feasible than an AI pause</strong> – first, because people are loss averse, so degrowth would be taking something away from them vs a pause would just be asking them to forgo future progress; second, because the fear of actual existential risk (from AI) may motivate more extreme policies.</li></ol><p>I will say, if I thought p(doom | climate) &gt; 10%, with climate timelines of 12 years, then I would be in favor of degrowth policies that seemed likely to reduce this risk. I just think that in reality, the situation is very different than this.</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "Pxyrjik4LynxoKr3q", "postedAt": "2023-09-23T10:42:12.615Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Thanks for sharing your take :)</p><blockquote><p>EA have disregarded the possibility to degrowth the economy in rich countries <strong>without engaging the arguments</strong></p></blockquote><p>Do you have some references for this? Is the claim more that EA hasn't seen the degrowth arguments at all, or that it has and has dismissed them unjustifiably (in your opinion)?</p><blockquote><p>The EA community has not addressed these reasons, just argued that <strong>economic growth is good </strong>and that <strong>degrowth in rich countries is anyway impossible</strong>.</p></blockquote><p>Again, has the EA community made these arguments as opposed to a few individuals? I'm not sure I can think of a canonical source here.</p><p>The best example I can think of here is <a href=\"https://forum.effectivealtruism.org/posts/bsE5t6qhGC65fEpzN/growth-and-the-case-against-randomista-development\"><i>Growth and the case against randomista development </i></a><i>- </i>but the argument here is not that growth is good as an end in itself, but that it is the best route to increasing human welfare, and indeed that post explicitly says that <i>\"economic growth is not all that matters. GDP misses many crucial determinants of human welfare\"</i></p><p>***</p><p>Nevertheless, I do you think your intuition is right that the 'degrowth' movement and the 'EA' movement are not friends, and in fact often in opposition. But I think that's because both movements have a set of auxiliary ideological claims which are often in conflict. For example, Jason Hickel is one of the world's most prominent degrowthers, and he often argues that the charts showing that global poverty are biased and incorrect (<a href=\"https://www.noahpinion.blog/p/against-hickelism\">I think he's wrong</a>), which are often core parts of EAs argument for problems of global health being tractable. But often this argument actually rests on an even more foundational argument of \"is the world getting better or not\" and so on, so what actually seems like an argument about 'is the current rate of GDP growth sustainable' actually turn out to be deep arguments about 'how should humanity live morally'</p>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "FAGwxdeA9p2hJcPjT", "postedAt": "2023-09-23T12:21:06.547Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>While I agree there are similarities in the form of argument between degrowth and AI pause, I don't think those similarities are evidence that the two issues should have the same conclusion. There's simply nothing at all inconsistent about believing all of these at the same time:</p>\n<ul>\n<li>AI pause is desirable</li>\n<li>AI pause is achievable</li>\n<li>Degrowth is undesirable</li>\n<li>Degrowth is not feasible</li>\n</ul>\n<p>Almost the <em>entire</em> question, for resolving either of these issues, is working out whether these premises are really true or not. And that's where the similarities end, IMO: there's not much analogy between the relevant considerations for feasibility of AI pause and feasibility of degrowth, or desirability of either outcome, that would lead us to think it's surprising for them to have different answers.</p>\n", "parentCommentId": null, "user": {"username": "BenMillwood"}}, {"_id": "2kNKRN4jabbnN5v2S", "postedAt": "2023-09-23T12:35:27.494Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote>\n<p>Especially if you disagree, explain why or upvote a comment that roughly reflects your view rather than downvoting. Downvoting controversial views only hides them rather than confronting them.</p>\n</blockquote>\n<p>As a meta-comment, please don't assume that anyone who downvotes does so because they disagree, or only because they disagree. A post being controversial doesn't mean it <em>must</em> be useful to read, any more than it means it must not be useful to read. I vote on posts like this based on whether they said something that I think deserves more attention or helped me understand something better, regardless of whether I think it's right or wrong.</p>\n", "parentCommentId": null, "user": {"username": "BenMillwood"}}, {"_id": "dN2sqERus49r2S28P", "postedAt": "2023-09-23T19:38:33.422Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I think one point of this post is to challenge the community to engage more openly with the question of degrowth and to engage in argument rather than dismiss it outright. I have not followed this debate in detail but I sympathize with the take that issues which are controversial with EAs are often disregarded without due engagement by the community.</p>\n", "parentCommentId": "FAGwxdeA9p2hJcPjT", "user": {"username": "alexherwix"}}, {"_id": "HfspaJE8LgYajPo9h", "postedAt": "2023-09-23T19:48:13.759Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>One caution I want to add here is that downvoting when a post is fresh / not popular can have strong filter effects and lead to premature muting of discussion. If the first handful of readers simply dislike a post and downvote it, this makes it much less likely for a more diverse crowd of people to find it and express their take on it. We should consider that there are many different viewpoints out there and that this is important for epistemic health. Thus, I encourage anyone to be mindful when considering to further downvote posts that are already unpopular.</p>\n", "parentCommentId": "2kNKRN4jabbnN5v2S", "user": {"username": "alexherwix"}}, {"_id": "zMh8zJA4bXnos4g7D", "postedAt": "2023-09-24T06:52:26.517Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Current gross world income is enough to provide everyone on earth with $10,000 per year. (And that overstates a lot of things because much of that wealth is in forms that aren't distributable.)&nbsp;</p><p>But $10,000/year is under the US federal poverty level. It seems a lot like degrowth is embracing a world where everyone lives under the level that a poor person in the developed world lives, which seems in pretty stark contrast to the goals of making the world prosper.</p><p>The claim of degrowth is that there's no way to have more than this consistent with long-term flourishing of humanity. That seems to fly in the face of every theoretical and observed claim about resource constraints and growth - climate is a real problem, but degrowth doesn't come anywhere close to solving it.</p><p>There are other claims that degrowth makes that seem unobjectionable, and worthy of debate - global poverty is being perpetuated by debt burden in the developing world, so the developed world needs to forgive that debt, foreign aid doesn't accomplish its stated aims is is a force for neo-colonialism, austerity overwhelmingly harms the poor and should be unacceptable, the enforcement of global intellectual property laws harms the developing world, and similar. But the central claim, that we need to have fewer goods, fewer people, and less prosperity, isn't really worth debate.</p>", "parentCommentId": "dN2sqERus49r2S28P", "user": {"username": "Davidmanheim"}}, {"_id": "mWPoiiMGRESn6ChGa", "postedAt": "2023-09-24T08:20:10.690Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I have to disclaim that I am NOT an expert on degrowth but from everything I know about the topic you are building up a huge strawman and misrepresenting their position in a way that really proves the point I was trying to make.&nbsp;</p><p>Just searching on google scholar for the term \"degrowth\" and looking at the first result, I come to an open access article \"Research on Degrowth\" in a reputable outlet with a reviewing discussion of the actual positions held and research being done on the topic. I have not read the entire article but from engaging with it for less than five minutes it's clear that your simplified summary is inadequate.&nbsp;</p><blockquote><p><a href=\"https://www.annualreviews.org/doi/full/10.1146/annurev-environ-102017-025941#dl1\">Degrowth</a> is a new term that signifies radical political and economic reorganization leading to drastically reduced resource and energy <a href=\"https://www.annualreviews.org/doi/full/10.1146/annurev-environ-102017-025941#dl1\">throughput</a>. Related scholarship critiques the ideology behind the dogma of <a href=\"https://www.annualreviews.org/doi/full/10.1146/annurev-environ-102017-025941#dl1\">economic growth</a>; contributes to documentation of negative material, social, and ecological effects of growth; and assesses alternatives to growth-based development (<a href=\"https://www.annualreviews.org/doi/full/10.1146/annurev-environ-102017-025941#\">1</a>). Put simply, the degrowth hypothesis is that it is possible to organize a transition and live well under a different political-economic system that has a radically smaller resource throughput.&nbsp;</p></blockquote><p>Thus, the point the degrowth movement is concerned with is reducing resource and energy throughput and not stopping all forms of (technological) development. On the opposite, it is about being more mindful of what technologies we develop and how we put them into practice with the goal of needing a smaller resource throughput as a result. Or do you expect degrowth proponents to advocate against investing more into R&amp;D of better solar panels and wind turbines? No, the whole point of degrowth is not to be against <i>development</i> but to change our conception of development so as to lead to an overall reduction (or at least stabilization) of resource and energy throughput. Lofty goals but same can be said for the whole AGI and existential risk shebang.&nbsp;</p><p>And I mean their point seems to be worthy of discussion as there <i>are </i>limits to growth as you acknowledge, and it seems not outlandish and to many people probably very reasonable to argue that we are approaching these limits as we have a created an economic system that has pushed us into the dangerous territory of our planetary boundaries.&nbsp;</p><p>Maybe you disagree about the degree to which we are in state of emergency or you are a techno-optimist who believes AGI will easily solve all \"resource flow hiccups\" we may be experiencing right now but this does NOT absolve you from doing a minimum of critical engagement with a case being made if you are to actively advocate against it. If the topic is not for you, fine. Stay out of it. But do not misrepresent the claims and case of people just because they have a different opinion from you.</p><p>P.S. sorry if this is a little bit harsh but this situation really captures a lot of what I am worried about with the EA forum. Stuff sometimes gets downvoted for specious reasons that are not grounded in any significant engagement with the topic but simply a \"hot-take\" that's formed based on a different (often uninformed) starting point. This creates potentially specious filter bubbles similar to other social media. Shouldn't this forum strive to do better than this?</p>", "parentCommentId": "zMh8zJA4bXnos4g7D", "user": {"username": "alexherwix"}}, {"_id": "t2RRdyWzuBpf9ELk8", "postedAt": "2023-09-24T10:36:49.395Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>The last sentence in that quote gives away the game. The hypothesis - the one I'm saying is not supported by any evidence, and which has been falsified in the past - is that you can do degrowth without the downsides. The concrete proposals are to stop doing the things that increase economic growth. For example, they are opposed to mining more minerals, regardless of environmental damage, because they want less resource usage. Less isn't more.</p><p>You say their point is worthy of discussion. Which point? That there are finite limits? No, it's not worth discussing. Yes, there are limits to growth, but they aren't relevant. They are busy telling people energy is finite, so we should use less - ignoring the fact that energy can be plentiful with solar and other renewable sources.&nbsp;</p><p>These are the same people - literally the same, in some cases - as the \"limits to growth\" folks from decades ago, and the fact that they were wrong hasn't deterred them in the least. They are STILL telling people that we will run out of minerals, ignoring the fact that discoverable reserves are orders of magnitude larger than we need in the foreseeable future, and in most cases reserves have been getting larger over time.</p><p>But sure, you can tell me I haven't engaged with this, and that it needs more thought. I'm even happy to give it more thought - I just need you, or someone else, to point to what you think we should consider that isn't either philosophy about finitude ungrounded in any facts, or that is flat out wrong, instead of saying \"consider this general area,\" one which I'm broadly familiar with already.</p>", "parentCommentId": "mWPoiiMGRESn6ChGa", "user": {"username": "Davidmanheim"}}, {"_id": "aRxFcxkoEgarFFeqt", "postedAt": "2023-09-24T13:13:39.949Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Wow, I am wondering whether to engage further or just let your reply stand as a testament to your \"thoughtfulness\". Doubling down on stereotyping and mischaracterizing people... great job! (sorry for the sarcasm but I am STILL surprised when I encounter this type of behavior in the EA forum, probably a sign of my naivety...). Nevertheless, for the benefit of the people who are intimidated by this type of behavior, I will try to give a short outline on where you, at least in my opinion, go wrong.&nbsp;</p><p>First, you seem to be upset that some people believe the hypothesis that \"it is possible to organize a transition and live well under a different political-economic system that has a radically smaller resource throughput\" because there is no <strong>evidence</strong> for it. I get that this may be not something you want... from your perspective it may not be \"desirable\" at the moment but what is <strong>your evidence</strong> that this is \"impossible\" to realize or even \"undesirable\" for people in general? Do you have more than specious historical analogies that actually <strong>proof your point</strong>? No, you don't because you can't. This is a complex and nuanced question that requires critical engagement and empirical inquiry to be resolved. Nobody is forcing you to contribute to this project but advocating against resolving the issue through critical engagement actually requires critical engagement. <strong>Pick your poison</strong>.</p><p>Second, why on earth do you continue to make broad stereotypical and misrepresenting claims after you have been made aware of the fact that you are doing it? Do you believe that is conducive to a productive and good conversation or are there other reasons in play that I simply fail to apprehend in my naivety and ignorance? Just to illustrate my point, a couple of quotes and replies from my side:</p><blockquote><p>they are opposed to mining more minerals, regardless of environmental damage, because they want less resource usage</p></blockquote><p>You make it sound like people are against mining of minerals in general. This is not the case. Even people advocating for degrowth have understood that civilization requires mining and use of minerals. They just advocate for being mindful of how much minerals we actually need to mine and encourage reconsideration of how we approach resource extraction in general, from all else being equal \"more is better\" to \"less is better\". Mind you that for most people this is also not a dogmatic position but a strategic position that is being taken on the margin in response to a (perceived) overweight of the \"more is better\" position. In the end, most people who advocate for degrowth now, would settle for a middle ground in the long run, where humanity is simply more mindful with regards to what it is doing. My circumstantial evidence for this is talking to people at academic sustainability conferences.</p><blockquote><p>Yes, there are limits to growth, but they aren't relevant. They are busy telling people energy is finite, so we should use less - ignoring the fact that energy can be plentiful with solar and other renewable sources.</p></blockquote><p>When people are pointing to limits to growth as a problem, they tend to have a reason for doing so even if one disagrees with them. Figuring out who is right tends to involve debate and empirical inquiry but you again opt for the easy way out and strawman \"their\" position to prematurely close discussion. What people are pointing to when they say \"energy is finite\" is not that we could not create \"Dyson spheres\" sometime in the future but that in our current situation we are still very much dependent on fossil fuels, transitioning to renewables is itself energy and resource intensive, and we don't want to burst our carbon budget while still enabling the Global South to continue its development. These are real issues that must be dealt with in the here and now. What is so wrong with thinking that encouraging Western countries (and their citizens; some degrowth advocates favor bottom-up approaches) to reconsider some of their basic assumptions about growth and prosperity and reduce their material footprint and consumption to help this process along could be part of the solution?</p><blockquote><p>These are the same people - literally the same, in some cases - as the \"limits to growth\" folks from decades ago, and the fact that they were wrong hasn't deterred them in the least. They are STILL telling people that we will run out of minerals, ignoring the fact that discoverable reserves are orders of magnitude larger than we need in the foreseeable future, and in most cases reserves have been getting larger over time.</p></blockquote><p>You make it sound like it is a consensus that the \"limits to growth\" people have been wrong. I can tell you there are quite a few people who would beg to differ. If you would engage with the discourse and look at the data, <a href=\"https://www.sciencedirect.com/science/article/pii/S0959378008000435?casa_token=Gp-ISoLPEeUAAAAA:dlt7qCf1HGhhNjpRbd62947jxZ5XVsWTB0JBHhMl7bCXKNiIPLSjGaCOZuOCwLqWX4lnaKdq5A\">it's actually surprising how well the original study held up</a>.&nbsp;</p><p>But don't let this evidence fool you, your entire hypothesis that we <strong>theoretically</strong> have enough resource reserves that we can continue to plunder in our ongoing mindless quest for economic growth, (almost) proofs we have nothing to worry or just discuss about. Don't let the fact that we are in an unprecedented situation where we are transitioning entire economies with enormous efforts that are going to take resource, energy, and time disturb you in your certainty and let's simply not use this crisis situation as an opportunity to engage in deep reflection about the values and goals of the economic systems that we want to create as a result. Discussing about how we want to work together as humanity is overrated and not at all consequential for the long-run development of our species. That's explicitly not what EA is supposed to be about. (Sorry, couldn't resist the sarcasm, again)</p><p>If you are looking for some materials to further engage with these debates, I can recommend engaging with the academic literature but also other sources like <a href=\"https://www.thegreatsimplification.com/\">Nate Hagens podcast</a>. There are many people on there who talk about the very practical issues the degrowth people are concerned about and want to address. There is definitely more of value there than what you give it credit for and this is basically the whole reason that I am complaining so heavily about your style and behavior.&nbsp;</p><p>Please don't just go around and attack and dunk on \"niche\" topics you haven't taken the time to properly engage with. It's fine to have (strong) opinions but be mindful of the effects the way you talk about things can have on other people and the community around you. The EA forum needs a diversity of voices and people should feel empowered to raise their (constructive, honest, etc.) points even if not everyone automatically gets their relevance. Constructive criticism and questions are fine and desired but misrepresentations are not. (I acknowledge that I myself am walking a fine line here... but somehow I think a sharp tone is still defensible in this case given the unfolding of the discussion)</p>", "parentCommentId": "t2RRdyWzuBpf9ELk8", "user": {"username": "alexherwix"}}, {"_id": "ChiChhvwmavtEibsz", "postedAt": "2023-09-24T14:30:31.471Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>If a point of the article was to get the community to engage with the arguments for degrowth, the author should have engaged with the things that EA has written about degrowth. For example, <a href=\"https://www.vox.com/future-perfect/22408556/save-planet-shrink-economy-degrowth\">https://www.vox.com/future-perfect/22408556/save-planet-shrink-economy-degrowth</a> or <a href=\"https://forum.effectivealtruism.org/posts/XQRoDuBBt98wSnrYw/the-case-against-degrowth\">https://forum.effectivealtruism.org/posts/XQRoDuBBt98wSnrYw/the-case-against-degrowth</a></p>\n", "parentCommentId": "dN2sqERus49r2S28P", "user": {"username": "harfe"}}, {"_id": "dy9QqYRz94vtZgdFX", "postedAt": "2023-09-24T14:38:45.740Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote>\n<p>Wow, I am wondering whether to engage further or just let your reply stand as a testament to your \"thoughtfulness\". Doubling down on stereotyping and mischaracterizing people... great job! (sorry for the sarcasm but I am STILL surprised when I encounter this type of behavior in the EA forum, probably a sign of my naivety...).</p>\n</blockquote>\n<p>I think this is insufficiently kind.</p>\n", "parentCommentId": "aRxFcxkoEgarFFeqt", "user": {"username": "harfe"}}, {"_id": "SbypifSmuJjcrRJDf", "postedAt": "2023-09-24T15:13:41.628Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I'm explaining why people haven't engaged with this - the specifics are missing, or have little to do with degrowth, or are wrong. You can cite the study \"justifying\" limits to growth, (which I've discussed on this forum before!) but they said that there would be a collapse decades ago, so it's hard to take that seriously.</p><p>I'm sure there is a steelmanned version of this that deserves some credit, and I initially said that there are some ideas from that movement that deserve credit - but I don't understand what it has to do with the degrowth movement, which is pretty explicit about what it wants and aims for.</p>", "parentCommentId": "aRxFcxkoEgarFFeqt", "user": {"username": "Davidmanheim"}}, {"_id": "SEFL2Ztj3qX4DCZdF", "postedAt": "2023-09-24T15:26:58.123Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I would argue that it is a snarky but honest reflection of my state of mind. I also support my claim with evidence if you continue to read the comment. I am walking a fine line but I think my comment should still pass as constructive and well-intentioned all things considered. If you beg to differ feel free to make your case.&nbsp;</p>", "parentCommentId": "dy9QqYRz94vtZgdFX", "user": {"username": "alexherwix"}}, {"_id": "yGED94fdmnpq6GmNM", "postedAt": "2023-09-24T15:56:47.327Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Ok, I acknowledge that I might have misunderstood your intent. If had taken that your point was to dispassionately explain why people (the EA community) don't engage with this topic, I myself might have reacted more dispassionately. However, as I read your comments, I don't think that it was very clear that this is what you were after. Rather, it seemed like you were actively making the case against engaging with the topic and using strawmanning tactics to make your point. I would encourage you to be more clear in this regard in the future, I will try to be more mindful of possible misinterpretation.&nbsp;</p><p>I think the key point of my comments stand in that the position you outlined is potentially problematic and ill-informed. To take an other example, you say:</p><blockquote><p>You can cite the study \"justifying\" limits to growth, (which I've discussed on this forum before!) but they said that there would be a collapse decades ago, so it's hard to take that seriously</p></blockquote><p>The point of simulation models is never to \"predict\" the future. We are not in the foundation novels and doing psychohistory here. Studies like this are used to look for and examine patterns in behavior. That's why it is so remarkable that one of the scenarios they developed actually mapped so closely to current developments. That was never the goal of the exercise. So the issue here is that you are misrepresenting the way people are actually building their arguments. If you again are claiming that this is not how you see the situation but how other people see the situation, please make people aware of the errors in their reasoning and don't continue to propagate false or at least misleading information.</p><blockquote><p>I'm sure there is a steelmanned version of this that deserves some credit, and I initially said that there are some ideas from that movement that deserve credit - but I don't understand what it has to do with the degrowth movement, which is pretty explicit about what it wants and aims for.</p></blockquote><p>I think the point I was trying to make is that it would do us good to try to go out there with a charitable mindset, look for the steelmanned versions of arguments being made, and try to engage them on their merits. For me this implies looking also in \"unusual\" or on the face of it \"irritating\" places and talking to people that hold different beliefs or work with different ideas, in particular if they are trying to reach out and engage with us. This happened to some degree here and all I am advocating for is keeping an open mind and not jumping to dismissive conclusions without deliberate critical engagement.</p>", "parentCommentId": "SbypifSmuJjcrRJDf", "user": {"username": "alexherwix"}}, {"_id": "sDvMCcv4ZnqZDGXFp", "postedAt": "2023-09-25T09:57:56.599Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote><p>Almost the <i>entire</i> question, for resolving either of these issues, is working out whether these premises are really true or not</p></blockquote><p>Exactly. What I try to point to is that EA as movement has not engaged in working out whether degrowth is desirable or not. I don't say anything about the conclusions --in part because I myself am not clear. I actually believe it is extremely difficult to get a clear answer so I would expect a lot of nuance.</p>", "parentCommentId": "FAGwxdeA9p2hJcPjT", "user": {"username": "mikbp"}}, {"_id": "DqpahEusvqpvSoTFG", "postedAt": "2023-09-25T10:08:48.824Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote><p>the central claim, that we need to have fewer goods, fewer people, and less prosperity, isn't really worth debate.</p></blockquote><p>As far as I understand it this is not what they claim. Particularly \"fewer people\", I am sure they do not claim this. And prosperity either. <i>Prosperity without growth</i> is a classic book.</p><p>There may be some people who claim this, they may use the term degrowth, but they are not the \"serious\" degrowthers. And I find the term Degrowth really misleading. Some use the terms a-growth, post-growth, growth agnostics. I should probably have been more explicit in my post [I added a comment at the end of the post].</p><p>And the claim of these people is that rich countries have to consume less, and in general wealth has to be much more distributed. They base it in the fact that past a certain point, the relationship between GDP and social outcomes breaks down or becomes irrelevant. And this is, AFAIK, well known and uncontroversial.</p>", "parentCommentId": "zMh8zJA4bXnos4g7D", "user": {"username": "mikbp"}}, {"_id": "FAuHTNHdv5yQdrMwC", "postedAt": "2023-09-25T10:40:25.974Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>A recent project looking into those sort of things in the context of Europe is the <a href=\"https://medeas.eu/\">MEDEAS project</a>.&nbsp;</p><p>For the French speaking around here, Jean-Marc Jancovici has a lot of material in French in his lessons at the Ecole des Mines. I have only seen a couple of his talks which happened to be in English.</p><p>Hagens has an online course, <a href=\"https://www.youtube.com/watch?v=YsgxopIZzto&amp;list=PLdHV4AV3ixB0n2OE8ent9k2RsJfomrGpC&amp;ab_channel=Reality101-UMNNexusOne\">Reality 101</a>, which I found really good. I find his podcast too \"sentimental\".</p>", "parentCommentId": "aRxFcxkoEgarFFeqt", "user": {"username": "mikbp"}}, {"_id": "ZaCNgrHa5LxsvKC6c", "postedAt": "2023-09-25T10:57:10.949Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I will give a simple answer to this:&nbsp;</p><p>a) Economic growth is intrisically \"good\" (it expands budgets contraints-&gt; improve invidividual welfare for each person with more income-&gt;increase total welfare for the society)</p><p>b) If economic growth has downsides, the downsides have to be adressed at the minimum cost in terms of \"growth\".</p><p>You can accept degrowth, but you can never find it desirable. Any agenda for degrowth is masochistic.</p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "a65EwiSphvMCeFcR8", "postedAt": "2023-09-25T10:57:41.491Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote><p>ignoring the fact that energy can be plentiful with solar and other renewable sources.</p></blockquote><p>But can it? and with what consequences? The EROI (Energy Return On energy Investment) of solar and wind are not great (wind better than solar), they are very resource-intensive, they need storage (effectively making their EROI lower and their resource-intensivity larger) and there needs to be over-capacity of production. In addition, they use space, a lot of it if we want to produce most of the energy demand with them -AFAIK, eg. UK basically do not have enough land to produce the energy they'd need (yes, there is off-shore wind as well, it is a comment to illustrate the magnitude), and the only way we have to transport it, batteries, have low energy-density and is again very resource-intensive.</p><p>&nbsp;</p><p>Note: low EROI basically means that a bigger share of the energy produced needs to be reinvested to produce energy (a larger share of the economy is dedicated to produce energy). It is very useful to plot \"Energy available for consumption\" vs \"EROI\". It shows that energy sources with too low EROI are basically useless for society. I don't go into numbers here because EROI calculations are very difficult to be made consistent between different energy sources and are difficult to calculate for the whole system. But the concept is clear and a system run with renewables is, at least, much closer to the energy cliff than we would like.</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/a65EwiSphvMCeFcR8/d7yos0liuhfcergebitw\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/a65EwiSphvMCeFcR8/brngfwej4kqxz3bi7w49 80w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/a65EwiSphvMCeFcR8/asguea8qy0bldhy3y58a 160w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/a65EwiSphvMCeFcR8/jxnovdwenna7b3xanmpu 240w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/a65EwiSphvMCeFcR8/bxcoapxwwmgfnkahhz7n 320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/a65EwiSphvMCeFcR8/dy0zwftquqgqi0wqumcw 400w\"></figure>", "parentCommentId": "t2RRdyWzuBpf9ELk8", "user": {"username": "mikbp"}}, {"_id": "nbRgP6cG9cKaStZGX", "postedAt": "2023-09-25T11:08:55.745Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I explicitly said that I do not have the time to write a good post and that I rather post this so that people discuss.</p><p>Incidentally, I read the Vox article long ago when it came out but I did not know that the writer is EA. I don't remember much of it now, but maybe the answers from <a href=\"https://twitter.com/g_kallis/status/1423037903094140928\">Kallis</a> and <a href=\"https://twitter.com/jasonhickel/status/1422899556019232774\">Hickel</a> (I'm not a fan of his) suffice to show that the article may not be as good as you think.</p><p>I will try to read the forum post soon -maybe I have done it in the past and I just don't remember.</p><p>Actually, thanks to this commentary I have found an inteesting &nbsp;post <a href=\"https://forum.effectivealtruism.org/posts/hptEKkvtFgCGeFjw8/the-case-for-green-growth-skepticism-and-gdp-agnosticism\">The case for Green Growth skepticism and GDP agnosticism</a>, which seems to go very much into the kind of analysis I would like to see more often here. I have only read the summary and skimmed the comments and it looks very promissing, I will try to read it as well. And a series of incredible posts about <a href=\"https://forum.effectivealtruism.org/posts/qG8k5pzhaDk6FhcYv/the-great-energy-descent-part-1-can-renewables-replace\">The geat energy descent</a> with a <a href=\"https://forum.effectivealtruism.org/posts/wXzc75txE5hbHqYug/the-great-energy-descent-short-version-an-important-thing-ea\">shorter version</a> which go to the heard of the issue and won the price for the \"Most Underrated EA Forum Post in 2022\".</p><p>BTW, try to search for \"degrowth\" and for \"AI\" in the forum, 22 and 5287 results respectively. I guess this proves the point I am trying to make.</p>", "parentCommentId": "ChiChhvwmavtEibsz", "user": {"username": "mikbp"}}, {"_id": "uoJL3QcFgjHYmEJCh", "postedAt": "2023-09-25T11:15:00.614Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>OK, but this post is about drawing an analogy between the degrowth debate and the AI pause debate, and I don't see the analogy. Do you disagree with my argument for why they aren't analogous?</p>\n", "parentCommentId": "sDvMCcv4ZnqZDGXFp", "user": {"username": "BenMillwood"}}, {"_id": "hSjRrwg29ohg3ryas", "postedAt": "2023-09-25T11:20:48.721Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote><p>(which I've discussed on this forum before!)</p></blockquote><p>Could you link to the post, please? I tried to quickly find it but failed... (I found other very good looking posts, though!)</p>", "parentCommentId": "SbypifSmuJjcrRJDf", "user": {"username": "mikbp"}}, {"_id": "Yp7juCFX7LggPetEQ", "postedAt": "2023-09-25T11:28:54.172Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>If I understood you well, yes, I disagree. EAs at large basically do not enter the degrowth debate. They act a bit like LeCuns of the degrowth debate, sort to say.</p><p>Maybe what I mean is more meta than what you are referring to?</p><p>EAs complain that many people just disregard the dangers of AI by saying something in the lines of \"AI development is good and stopping it is anyway impossible\", or \"we will manage the issues\", etc. And what I mean is that EAs do/have done the same kind of things with growth.</p>", "parentCommentId": "uoJL3QcFgjHYmEJCh", "user": {"username": "mikbp"}}, {"_id": "yiP6bzEsdaaeTxoWv", "postedAt": "2023-09-25T11:31:31.027Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>One can say the same about intelligence:</p><p>a) Intelligence growth is intrinsically \"good\" (it expands human possibility space-&gt; improve individual welfare for each person with more possibilities-&gt;increase total welfare for the society)</p><p>b) If intelligence growth has downsides, the downsides have to be addressed at the minimum cost.</p>", "parentCommentId": "ZaCNgrHa5LxsvKC6c", "user": {"username": "mikbp"}}, {"_id": "32fRbtre2bLWLTPsw", "postedAt": "2023-09-25T11:38:21.230Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>The issue is not only climate change, here. We are in dangerous territory for most of the planetary boundaries.</p><blockquote><p>AI presents large existential risk in my mind</p></blockquote><p>One of the points is that EAs do not seem to engage with large close-to-existential risks in the minds of degrowthers and the like. It is true that they do not have fleshed out to what extent their fears are existential, but this is because they are large enough for worrying them. See <a href=\"https://forum.effectivealtruism.org/posts/rXbtJsuKrzHMHjpco/is-this-risk-actually-existential-may-be-less-important-than\">\"Is this risk actually existential?\" may be less important than we think</a>.</p><p>I like your second point. But still, even if it is less politically feasible, as you say, <i>if</i> the risk is large enough EA should be in favour of degrowth. My point is that very little effort has been done to address this if.</p>", "parentCommentId": "YrNo6AcASgASZWbPM", "user": {"username": "mikbp"}}, {"_id": "gAMSuEcD9uAHRsn79", "postedAt": "2023-09-25T12:33:58.335Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Of course not. There can be substantial externalities and zero sum games related to IA, as to any other tecnology. AI is like the \"internal combustion engine\". &nbsp;But \"income\" is a direct input for human welfare.&nbsp;</p><p>You can consider that externalities are not properly priced, and that natural resources are too cheap because their owners have too high discount rates. Then you need to tax both things to limit the resource use/ externality production.&nbsp;</p><p>Still, after you have put this \"extra market\" constraints in the economy, you want maximum GDP (that is more or less, the \"aggregate\" budget contraint). More degrees of freedom are inescapably \"good\", and that is what growth give us.</p><p>When you are against GDP, you are against people.</p>", "parentCommentId": "yiP6bzEsdaaeTxoWv", "user": {"username": "Arturo Macias"}}, {"_id": "kGniPNT6cxj3axqZh", "postedAt": "2023-09-25T12:59:43.181Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote><p>Do you have some references for this? Is the claim more that EA hasn't seen the degrowth arguments at all, or that it has and has dismissed them unjustifiably (in your opinion)?</p></blockquote><p>I don't have references but, for example searching for the term Degrowth in the forum only returns 22 results. The claim is a bit of both, but more that EA has dismissed them unjustifiably. And I partly understand it because the term degrowth is very misleading.</p><p>That the world is getting better in some senses and worse in some others I think it is nothing anyone in either side disputes, no? Their argument rests in the fact that past a certain point, the relationship between GDP and social outcomes breaks down *or becomes irrelevant* (see linear plots of Child mortality vs GDP, for example -below). And it is not about how to live morally, it is about what the carrying capacity of Earth can sustain. This carrying capacity depends on our technology, and the \"stocks\" are very large, so it is not a problem to follow a trajectory that goes outside the carrying capacity for a while as long as it comes back sufficiently inside on time. But this is nothing that can be lightly disregarded.&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/wtql2x9gkkacyzvhh2oj\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/b6u3hajyt2af0eqixmyx 119w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/dfit921bum2q6y4czhzj 199w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/cq0rc7kxv3wdaimndo72 279w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/ldhkswyjad8rmy3du3de 359w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/fvtwhfdrwd0mvplbzwtb 439w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/t1ilgoepuk45qdh7v7us 519w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/uytzlxb9qkti4raspusi 599w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/kGniPNT6cxj3axqZh/rtlwjtck05c7tql4ahwk 679w\"></figure>", "parentCommentId": "Pxyrjik4LynxoKr3q", "user": {"username": "mikbp"}}, {"_id": "zuZ9kptpce74ABpCf", "postedAt": "2023-09-25T13:08:57.345Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>You are Spanish. Spain's GDP per capita is much lower than that in the USA, yet Spain's life expectancy is 5 years longer than that of USA's and Spain outperforms USA in many other social indicators. There's much more than GDP in prosperity. Past a certain point, the relationship between GDP and social outcomes breaks down *or becomes irrelevant*, at least for many indicators.</p>", "parentCommentId": "gAMSuEcD9uAHRsn79", "user": {"username": "mikbp"}}, {"_id": "HLsSwXistXYDr7Amz", "postedAt": "2023-09-25T13:13:37.478Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I am curious about the arguments from the person who voted disagree to alexherwix's comment.</p>", "parentCommentId": "HfspaJE8LgYajPo9h", "user": {"username": "mikbp"}}, {"_id": "ecvwQxmYbfevMdy28", "postedAt": "2023-09-25T14:24:16.312Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Objective measures of subjetive welfare?&nbsp;</p><p>The problem with macro GDP skepticism is that it implies micro personal income skepticism, and that is totally implausible (among other consequences of personal income skepticism, imagine how irrelevant becomes unequality for USA where more than 20.000 per capita income is so prevalent).</p><p>Those who tell me that more income will not make me happier are telling me that I do not know how to use additional freedom. It is a very marxist position: as (Groucho) Marx said: “Who <i><strong>are you</strong></i> going to <i><strong>believe</strong></i>, <i><strong>me, or your lying eyes</strong></i>?”\"</p><p>Regarding Spain, of course, many British people retire here: you have the Sun, the sunny people, and structural unemployment levels (or the realtive lack of tech and other \"high end\" jobs) do not affect you.&nbsp;</p>", "parentCommentId": "zuZ9kptpce74ABpCf", "user": {"username": "Arturo Macias"}}, {"_id": "awwLuj6xYhZyGDJDs", "postedAt": "2023-09-25T18:20:50.229Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>On your first point, I was first clarifying that there has been discussion of this, and there was a pretty clear reason to dismiss this in general - while in my very first post agreeing that \"There are other claims that degrowth makes that seem unobjectionable, and worthy of debate.\" You attacked that, and my position, and I defended it. I don't think I used a strawman at any point - I think that I responded to your general claim about \"degrowth\" with an accurate characterization of that position, and you retreated to a series of specific analyses that defend specific points.&nbsp;</p><p>On your second point, you're incorrectly interpreting what was done in 1972, which I'm very, very familiar with - I've actually read the report, and used the model as a teaching tool. It was absolutely intended to predict consequences of decisions, to support specific decisionmakers, and they explicitly said that while it was imperfect, it was intended to be used as-is in order to make decisions. I can only urge you to read their original work. The patterns it explored didn't hold up, the models were wrong in how the projected the key inputs and factors, and the conclusions they came to were wrong. Recent claims that they got things right are revisionist and wrong - post-hoc justification is possible anywhere, but <a href=\"https://twitter.com/davidmanheim/status/1415561983420739591\">as I've said for years</a>, it's unsupportable here.&nbsp;</p><p>And finally, in general, if you ask others to be more charitable to a position instead of defending it, you're asking for a favor, rather than saying that something stands on its own merits. I did not say there was nothing here worthy of consideration, but I did say that their central claim was wrong. I agree that it's wonderful to be charitable in discussions, but as a general point, no, I don't think it makes sense to try to be charitable to and steelman every opposing viewpoint every time it is brought up, especially after you've looked into it.</p>", "parentCommentId": "yGED94fdmnpq6GmNM", "user": {"username": "Davidmanheim"}}, {"_id": "ZYEvkq5Qa2sJAMgQf", "postedAt": "2023-09-25T18:31:21.083Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>The idea of a net energy cliff was about comparing fossil fuels, solar and wind, and corn ethanol. Solar is near the letter f on your graph - not nearly as efficient on an EROI basis, but clean, renewable, and well within the sustainable and useful range of the graph. But if you're arguing against corn-ethanol, I'm on your side.</p><p>Regarding the UK specifically, renewables currently provide close to half of UK power, so it's strange to claim they can't provide more. Storage tech is mediocre at present, but the focus of a lot of investment, and rapidly falling in price over tiem. And they have accelerated their nuclear power plans for coming decades.</p>", "parentCommentId": "a65EwiSphvMCeFcR8", "user": {"username": "Davidmanheim"}}, {"_id": "a9jtwLbe4hdvYYwQr", "postedAt": "2023-09-25T18:32:49.189Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I can't find it either - I may have been misremembering, apologies. I've commented on other's relevant posts, and <a href=\"https://twitter.com/davidmanheim/status/1415561983420739591\">tweeted about it</a>, as well as giving feedback on some reports EAs wrote that mentioned it.</p>", "parentCommentId": "hSjRrwg29ohg3ryas", "user": {"username": "Davidmanheim"}}, {"_id": "jAiQys6zkCzPNS97d", "postedAt": "2023-09-25T18:34:39.419Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Today in Nature Scientific Reports:\n<a href=\"https://www.nature.com/articles/s41598-023-42782-y\">https://www.nature.com/articles/s41598-023-42782-y</a></p>\n<p>\"On the other hand, a global negative growth scenario will significantly reduce future cumulative carbon emissions (45%) but also dramatically undermines the pursuit of global development goals, like the elimination of poverty. Even with global policies that significantly increase cash transfers to the poor and retired, dramatically improve income inequality, and eliminate military spending, the Global Negative Growth Big Push scenario leads to an increase of 15 percentage points in global extreme poverty by 2100.\"</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "BZXkRKNX4pwgXvFhN", "postedAt": "2023-09-25T18:34:49.624Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I agree with most of your modified claims - but claiming the serious degrowthers are the ones on your side, that the term is misleading, and the popular movement is wrong, seems to be conceding everything?</p>", "parentCommentId": "DqpahEusvqpvSoTFG", "user": {"username": "Davidmanheim"}}, {"_id": "meAJBpvsn5TH3fsdb", "postedAt": "2023-09-25T19:37:24.541Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I don't find \"Spain's life expectancy is 5 years longer than that of USA's\" to be subjective. Do you?</p>", "parentCommentId": "ecvwQxmYbfevMdy28", "user": {"username": "mikbp"}}, {"_id": "GdLgEbEBSPqKJrfxT", "postedAt": "2023-09-25T19:44:52.122Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>From the post: \"economic degrowth <strong>in rich countries</strong>\". From your quote: \"global negative growth\".</p><p>But in any case this is irrelevant <i>if</i> the ecological collapse that some argue about has worse global effects.</p>", "parentCommentId": "jAiQys6zkCzPNS97d", "user": {"username": "mikbp"}}, {"_id": "S5Gjp7fEMhJL2k96Z", "postedAt": "2023-09-25T19:56:10.440Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I really have not come across academic \"degrowthers\" that claim that we need to have fewer people or less prosperity (Kallis, Hickel, Raworth, Jackson, Van den bergh). In any case, in the post I deliberately spoke about to \"degrowth the economy in rich countries\", not about degrowth in general or (any group of) degrowthers to try avoid these kinds of misunderstandings.</p>", "parentCommentId": "BZXkRKNX4pwgXvFhN", "user": {"username": "mikbp"}}, {"_id": "gYNvkSKkuF2JQMxdW", "postedAt": "2023-09-25T20:04:43.279Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Yes, but degrowth only in rich countries doesn't really do much:</p>\n<p>\"Using the International Futures model, this article shows that negative growth and societal transformations in the Global North are possible without dramatically damaging long-term global socioeconomic development, though these interventions do not solve the global climate crisis, reducing future cumulative carbon emissions by 10.5% through 2100. \"</p>\n", "parentCommentId": "GdLgEbEBSPqKJrfxT", "user": {"username": "jackva"}}, {"_id": "oqCcuHdzawWhocHNg", "postedAt": "2023-09-25T20:06:35.163Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>You either need to bite the bullet on supporting global degrowth or you need to acknowledge that degrowth in rich countries doesn't do very much.</p>\n", "parentCommentId": "gYNvkSKkuF2JQMxdW", "user": {"username": "jackva"}}, {"_id": "5PZbjmmbQNFY4JeoM", "postedAt": "2023-09-25T20:37:04.188Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Sorry, the claim \"UK basically do not have enough land to produce the energy they'd need\"... misses \"<strong>with solar</strong>\".</p><p>According ESO, in 2022 the UK renewals mix was Wind - 26.8%, Biomass - 5.2%, Solar - 4.4%, Hydro - 1.8%, less than 40%. And wind is roughly half-half regarding on- and off-shore. Many countries are not big islands, or are more or less close to the equator, or have a lot of land. Really hard to scale.</p><p>EROI: low but acceptable EROI + storage + need to overinstall = pretty bad effective EROI. And EROI is not all that counts, of course.</p><p>&nbsp;</p><p>While taking a look around the forum for some answer before, I came across <a href=\"https://forum.effectivealtruism.org/posts/wXzc75txE5hbHqYug/the-great-energy-descent-short-version-an-important-thing-ea\">this post series</a> (so far I have only skimmed it) that seem to flesh out pretty much my concerns and does it much better I could have. Have you seen it?</p>", "parentCommentId": "ZYEvkq5Qa2sJAMgQf", "user": {"username": "mikbp"}}, {"_id": "ua8kzSNTqws38BKfZ", "postedAt": "2023-09-25T20:45:27.074Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I do remember that we tweeted about this (and it made me blush that you too remember). I just want to read something longer than just a tweet. At the time I couldn't find any paper.</p>", "parentCommentId": "a9jtwLbe4hdvYYwQr", "user": {"username": "mikbp"}}, {"_id": "LDDn2BWvREzTBb5WX", "postedAt": "2023-09-25T20:56:42.827Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Thanks. I'll try to take a look at the paper (at some point). The issue of comparing bads (effects of ecological collapse vs effects of full degrowth) still stands, though.</p>", "parentCommentId": "gYNvkSKkuF2JQMxdW", "user": {"username": "mikbp"}}, {"_id": "nsCy8xCuJv9e3qZXg", "postedAt": "2023-09-25T21:21:03.728Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>What about life expectancy by income bucket in the US? How objective is that relation?</p>\n<p>It looks that income matters in the US, but then it does not matter across countries…</p>\n<p>The US is an extremely diverse society, with extreme outcomes. You have a Bulgaria and a Denmark in each city, we have them in different countries. In fact the positive relation at the micro level between health and income shall be more relevant that aggregate comparisons, that can be extremely affected by ecological fallacies.</p>\n<p>Of course, there is a lot causal reversion in the income - welfare relation; both people and countries that are richer are often better in extra economic terms.</p>\n<p>But you cannot separate material and non material prosperity. It is the loop of activity and personal virtue what allows people to became affluent, and income gives the resources to have a fulfilling life.</p>\n<p>What were the social and moral consequences of stagnating socialism in the USRR? Demoralization and collapse.</p>\n<p>Macro growth can be disputed, because is removed from personal experience, but parents always try to put their children in the path of (micro) growth…</p>\n", "parentCommentId": "meAJBpvsn5TH3fsdb", "user": {"username": "Arturo Macias"}}, {"_id": "duhKcCaKnLzciyTEs", "postedAt": "2023-09-25T21:23:46.361Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>All this EROI issues are far easier to follow when you use the inverse of EROI (energy auto consumption).</p>\n<p><a href=\"https://www.bde.es/f/webbde/SES/Secciones/Publicaciones/PublicacionesSeriadas/DocumentosTrabajo/12/Fich/dt1217e.pdf\">https://www.bde.es/f/webbde/SES/Secciones/Publicaciones/PublicacionesSeriadas/DocumentosTrabajo/12/Fich/dt1217e.pdf</a></p>\n", "parentCommentId": "a65EwiSphvMCeFcR8", "user": {"username": "Arturo Macias"}}, {"_id": "cDz8xWkEjAadxJqBH", "postedAt": "2023-09-26T06:24:50.683Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Haha - I didn't at all realize that we had talked about it / noticed that you were the person I tweeted with before, I just searched different places I would have said this before, when looking for where I has said it.</p>", "parentCommentId": "ua8kzSNTqws38BKfZ", "user": {"username": "Davidmanheim"}}, {"_id": "2TcDAo8u4QfebfoB8", "postedAt": "2023-09-26T19:34:08.618Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote><p>It looks that income matters in the US, but then it does not matter across countries…</p></blockquote><p>Well, this is the whole point. Some ways to organise countries achieve better social outcomes without the need of better GDP. You don't have Bulgaria and Denmark in each US city in this sense, which is the sense that counts in this conversation.</p><blockquote><p>But you cannot separate material and non material prosperity.</p></blockquote><p>This is not what degrowthers claim and it is not what I claimed: \"*Past a certain point*, the relationship between GDP and social outcomes breaks down *or becomes irrelevant*, at least for many indicators.\" Logarithmic plots show pretty straight lines. This basically means exactly that past a certain point the relationship becomes irrelevant.</p><p>&nbsp;</p><p>In any case, this all shows my point. Saying \"Growth is good\" is like saying \"Intelligence is good\". Precisely the point of the post. All this is irrelevant <i>if</i> the ecological collapse degrowthers fear is a big enough thing. This would mean something leading to a pretty bad humanity's state, far worse than stark degrowth. If you want to argue with a degrowther, you have to argue about that, not say growth is good. Same that advocates for AI development have to argue (and mostly don't do) that developing AI is not dangerous, not saying how wonderful AI could be.</p>", "parentCommentId": "nsCy8xCuJv9e3qZXg", "user": {"username": "mikbp"}}, {"_id": "LWssHu8tgieAey735", "postedAt": "2023-09-26T19:39:02.600Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I'll try to read it, thanks</p>", "parentCommentId": "duhKcCaKnLzciyTEs", "user": {"username": "mikbp"}}, {"_id": "gAXBXr8vcaBzstMMF", "postedAt": "2023-09-27T12:26:54.616Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>One thing I forgot to mention: a substantial carbon tax that accounts for its externalities would be a policy like the ones you describe and would most likely lead to, at least temporary, degrowth.</p>\n", "parentCommentId": "gAMSuEcD9uAHRsn79", "user": {"username": "mikbp"}}, {"_id": "eGhbgfyTDkCYmNjFT", "postedAt": "2023-09-27T12:59:20.809Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>Oh, sure. Many things can lead to degrowth, and some could be necesary. What I point out is that degrowth is allwayws a negative side consequence. You do not plan for it, you suffer it (the less, the better).</p><p>Economists often speak of \"dematerialization\" to refer to the natural trend of capitalism to increase GDP by unit of material input, both by increasing efficiency in inputs use and consumption substitution.</p><p>You can imagine a future where that people becomes more interested in virtual reality instead of physical consumption. That is a form of \"dematerialization\" but &nbsp;it cannot be considered degrowth (well, at least if our price indexes were properly constructed, that often is not the case).&nbsp;</p><p>But what shall be avoided at all costs, is people celebrating GDP contraction (=somebody's income contraction).&nbsp;</p>", "parentCommentId": "gAXBXr8vcaBzstMMF", "user": {"username": "Arturo Macias"}}, {"_id": "hTN7tJuBnti3v7vCG", "postedAt": "2023-09-29T19:50:21.749Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<blockquote><p>GDP contraction (=somebody's income contraction)</p></blockquote><p>This is obvious. And, again, the point is that the relationship between GDP and social outcomes after some point breaks down or becomes irrelevant.</p><blockquote><p>Many things can lead to degrowth, and some could be necesary. What I point out is that degrowth is allwayws a negative side consequence. You do not plan for it, you suffer it (the less, the better).</p></blockquote><p>It seems strange to argue in favour of not planning for a negative consequence of something that may be necessary.</p>", "parentCommentId": "eGhbgfyTDkCYmNjFT", "user": {"username": "mikbp"}}, {"_id": "mqcByHPWYhDwkzLq8", "postedAt": "2023-09-30T10:45:07.396Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": "<p>I forgot to ask you who are those \"degrowthers\" that you refer to. I never came across them. Could you please give me a couple of names?</p>\n", "parentCommentId": "S5Gjp7fEMhJL2k96Z", "user": {"username": "mikbp"}}, {"_id": "PZitSta65AxWgcgrt", "postedAt": "2023-09-26T19:33:31.003Z", "postId": "Df7v5BmFvqTLfXgph", "htmlBody": null, "parentCommentId": "nsCy8xCuJv9e3qZXg", "user": null}]