[{"_id": "jXFantyFBrfwNSyu6", "postedAt": "2024-03-03T19:31:47.910Z", "postId": "DgHyc2FFE5ozttsdD", "htmlBody": "<p>I suspect there would be a lot of challenges with this, such as how to measure/assess the impact, and the actual implementation of the project/intervention. The details matter a lot. But I also think that at its core this idea has merit.</p><p>I was just recently thinking about how reading two pieces of writing in my early 20s had a very beneficial effect on my long-term happiness. If I was building a curiculum on something like <i>how to have a happy life</i> or <i>practical wisdom</i>, I'd include these.</p><ul><li><a href=\"https://pdodds.w3.uvm.edu/files/papers/others/2011/dunn2011b.pdf\">If money doesn't make you happy, then you probably aren't spending it right</a></li><li><a href=\"https://www.amazon.com/Happiness-Lessons-Science-Richard-Layard/dp/0143037013\">Happiness: Lessons from a New Science</a></li></ul>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "oYys8xJdgibcgcju5", "postedAt": "2024-03-04T09:42:41.987Z", "postId": "DgHyc2FFE5ozttsdD", "htmlBody": "<p>I welcome this idea! More love <i>would </i>be a good thing, and we would rather make this change earlier in the life course.</p><p>I think implementation is hard. This is a big \"if\":</p><blockquote><p>if we could come up with a healthy, inclusive (but respectful of differing opinions), curriculum that -encourages/rewards- love but does not impose it</p></blockquote><p>As Joseph said, it is difficult to assess educational interventions. When it comes to knowledge transfer we can be generally confident that education is helping - calculus classes increase students' aptitude for calculus. But love?</p><p>Recent research <a href=\"https://wellcome.org/news/mindfulness-schools-doesnt-improve-mental-health-heres-why-thats-positive\">suggests </a>that mindfulness interventions in schools were much less impactful than hoped. I suspect that something like mindfulness works well if you opt in - and is much less useful if you didn't ask for it.</p><p>To explore this idea further, I recommend looking for comparable values-based educational experiments that have been tried in the past (maybe something about attitudes to sexuality, or religious tolerance, or positive thinking, or even campaigns to instil hate). Did they succeed in changing values? If they failed, why did they fail? If they succeeded, what can we learn from them?</p>", "parentCommentId": null, "user": {"username": "Stan Pinsent"}}, {"_id": "YE25kjBvinXBa7TQ8", "postedAt": "2024-03-08T20:31:25.472Z", "postId": "DgHyc2FFE5ozttsdD", "htmlBody": "<p>Extremist indoctrination campaigns clearly have an impact, to the point of getting member to self-sacrifice. Not the path i would want to explore.&nbsp;</p><p>While I'd like to -encourage- love and perhaps other related/close/universally accepted positive values (don't steal, don't murder/hurt others type things), I believe everyone should retain self-agency.&nbsp;</p><p>Basically, people -should- be free to -choose- to hurt others (or at least not benefit them) if they so decide, possibly incurring society's wrath/punishment in the process depending on the degree of harm, as it is currently done (reform of prisons/legal punishments is another topic).</p><p>Let's steer clear of 1984. Most people find helping others fulfilling to some degree. We ought to encourage that and make it an easy and early realization. Those that aren't interested can drop out after going through the 101 if they so choose.</p><p>I posit that the cost of researching and developing/testing a curriculum to that effect would be minimal compared to the possible impact.</p><p>And yes it's a big \"if\", but we don't have to get it perfectly right from the get-go.&nbsp;</p><p>I'll be back in the Philippines in a few weeks, where i will be launching a sort of 360 housing/living/community program, aimed at the poorest of the poor/most excluded to provide safety, counseling, nutrition, health as well as education, life and professional skills etc. I'd love to have -something- like this to try out with those that join.&nbsp;</p><p>My experience is that the culture is -already- very Altruistic-oriented, if often un-efficiently so. I'd very much like for them NOT to lose that aspect of the culture if/when they join the capitalist bandwagon.&nbsp;</p>", "parentCommentId": "oYys8xJdgibcgcju5", "user": {"username": "Keen Visionary"}}]