[{"_id": "JSQbhoebke3mrRA7v", "postedAt": "2023-01-11T16:54:38.283Z", "postId": "DgS5oRvWqaTJX3EdD", "htmlBody": "<p>On the part about longtermism, Tobias Leenhart from ProVeg seems to think more on the lines of behaviour change(from whatever reason, health, enviorment, cheaper price of plants(due to welfare reforms for animals)) will make attitude change for animals &amp; wild animals much easier<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefrs2libzd21d\"><sup><a href=\"#fnrs2libzd21d\">[1]</a></sup></span>.<br>&nbsp;This makes me think that they would not be in agreement with what you said about \"focusing on welfare improvements could end factory farming sooner, but delay abolition for a very long time\", but rather think there would be welfare improvements sooner &amp; abolition sooner. What are your thought on that idea?<br><br>I am in agreement though that attitude change for animals is most important in the longterm.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnrs2libzd21d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefrs2libzd21d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Heard from this podcast <a href=\"https://podcasts.apple.com/us/podcast/30-tobias-leenaert-on-the-pragmatic-path-to-a-vegan-world/id1465166926?i=1000511558596\">https://podcasts.apple.com/us/podcast/30-tobias-leenaert-on-the-pragmatic-path-to-a-vegan-world/id1465166926?i=1000511558596</a></p></div></li></ol>", "parentCommentId": null, "user": {"username": "Daryl D'Souza"}}, {"_id": "MmzRrzinePuuX3dtN", "postedAt": "2023-01-13T13:47:57.277Z", "postId": "DgS5oRvWqaTJX3EdD", "htmlBody": "<p>My thoughts are that it's sensible (and an important component) but insufficient by itself.</p>\n", "parentCommentId": "JSQbhoebke3mrRA7v", "user": {"username": "Dhruv Makwana"}}, {"_id": "Fg8wLqu28JoXLkie5", "postedAt": "2023-01-20T09:53:49.157Z", "postId": "DgS5oRvWqaTJX3EdD", "htmlBody": "<p>Thanks for writing this, Dhruv.</p><blockquote><p>The scale of factory farming (and its potentially exponentially larger scale in several possible futures) is so huge that its continuation constitutes an&nbsp;<a href=\"https://longtermrisk.org/reducing-risks-of-astronomical-suffering-a-neglected-priority/\"><u>s-risk</u></a>.</p></blockquote><p>Note all farmed animals excluding arthropods only have about 3 % of the neurons of all humans (see <a href=\"https://forum.effectivealtruism.org/posts/rdLMTsSZ2oqoFAeTg/is-improving-the-welfare-of-arthropods-and-nematodes-1\">here</a>). So, if neurons are a decent proxy for moral weight, human welfare may dominate. However, as argued by Adam Shriver <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw/p/Mfq7KxQRvkeLnJvoB\">here</a>, neurons do not account for all relevant factors. All in all, I think the 3 % figure is an underestimate.</p><p>Another point is that ending factory farming is only good to the extent the lives of factory farmed animals are bad. I believe this is true now, but welfarist approaches may ultimately lead to net positive lives in the future.&nbsp;</p><blockquote><p>It is well-established that suffering in the wild, on all expectations, dominates all other forms of suffering, and so from a longtermist perspective WAS is more important than farmed animal suffering.</p></blockquote><p>Although there is lots of uncertainty, I agree the total moral weight of wild animals dominates. All marine arthropods have 50 k times as many neurons as all humans (see <a href=\"https://forum.effectivealtruism.org/posts/rdLMTsSZ2oqoFAeTg/is-improving-the-welfare-of-arthropods-and-nematodes-1\">here</a>). However, this is from a neartermist perspective. Longterm, I expect the number of humans (or digital minds) to continue to increase relative to the number of wild animals. This has been the case in the last 300 k years, and therefore we can expect the importance of human welfare to increase relative to that of wild animal welfare. Of course, this does mean wild animal welfare should be ignored, I actually <a href=\"https://forum.effectivealtruism.org/posts/rdLMTsSZ2oqoFAeTg/is-improving-the-welfare-of-arthropods-and-nematodes-1\">think</a> it is underrated.</p><blockquote><p>Advocating for welfare improvements arguably perpetuates speciesist ideas (that animal interests or rights matter less), and thereby undermines, or at least does not support, efforts to reduce WAS.</p></blockquote><p>I am not sure about this, and guess it may depend on the magnitude of the improvement. If it is large enough to imply net positive lives in the improved conditions, welfarist approaches would be more likely to be robustly good. For example, laying hens arguably have negative lives in both conventional cages and cage-free aviaries (see <a href=\"https://forum.effectivealtruism.org/posts/nDgCKwjBKwFvcBsts/corporate-campaigns-for-chicken-welfare-are-10-000-times-as#Cost_effectiveness_of_corporate_campaigns_for_chicken_welfare1\">here</a>), so pushing for not eating eggs (in which case hens would not exist, and therefore have null welfare) would tend to be better than pushing for cage-free aviaries. However, transitioning to cage-free aviaries is much easier, and could also increase the likelihood of a future transition to net positive conditions (maybe free range hens).</p><blockquote><p><i>“Waiting for technology to end animal farming may set a dangerous precedent for scenarios where technology cannot solve moral problems as quickly as social change or cannot solve moral problems at all. Socially driven trajectories seem to have better outcomes for spillover into attitudes towards future farmed animals, wild animals, and artificial sentience because they would set better historical precedent for human morality.”</i></p></blockquote><p>I tend to agree. In addition, it seems unlikely that having factory-farmed animals with net positive lives is an efficient way to produce welfare, but I do not know.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "uFFAJEvfSALy9ATDZ", "postedAt": "2023-01-20T23:29:01.094Z", "postId": "DgS5oRvWqaTJX3EdD", "htmlBody": "<p>What do you think the risk of re-emergence and the psychological argument (linked in the post) by Jeff Sebo? I believe they outweigh the benefits of any potential net-positive high welfare farming (if one is thinks non-existence is comparable and neutral wrt negative/positive existence).</p>\n<p>And yes, I mentioned a slightly different take on your last point when I pointed out Tomasik's false dichotomy (either not slaughtering animals, or putting those resources to better use by having happy humans live on the land instead).</p>\n", "parentCommentId": "Fg8wLqu28JoXLkie5", "user": {"username": "Dhruv Makwana"}}, {"_id": "T6Apu7QHY22y2Bci4", "postedAt": "2023-01-21T04:07:26.661Z", "postId": "DgS5oRvWqaTJX3EdD", "htmlBody": "<blockquote><p>\"so pushing for not eating eggs (in which case hens would not exist, and therefore have null welfare) would tend to be better than pushing for cage-free aviaries.\"</p></blockquote><p>I often hear this argument, &nbsp;X animal would not exist if they were not intensively farmed for human products. However why wouldn't they exist? I think they would exist but in much smaller healthier numbers and their genetics would be able to recover slowly. Many people love animals and would keep them just like many keep cats and dogs. They can be good for the land etc as well. There are also many vegan farm animal sanctuaries that would keep them. Post farming they would only stop existing over time if breeding was strictly outlawed or they were outright banned. Same for many other intensively farmed animals. Some vets thought horses would go extinct when the automobile was first mass produced.</p>", "parentCommentId": "Fg8wLqu28JoXLkie5", "user": {"username": "Brendon"}}, {"_id": "kqQWv6wxAch7GDD3E", "postedAt": "2023-01-26T13:37:54.802Z", "postId": "DgS5oRvWqaTJX3EdD", "htmlBody": "<p>I have now watched <a href=\"https://www.youtube.com/watch?v=vELWCTgA9oA&amp;list=WL&amp;index=2&amp;ab_channel=CentreforEffectiveAltruism\">Jeff's talk</a>.</p><p>If I understood correctly, the argument is that eating animals can lead people to disregard the welfare of animals. I agree this is currently the case, as most farmed animals have net negative lives, disregarding their welfare is useful to avoid cognitive dissonance.&nbsp;</p><p>However, if people started eating animals with net positive lives out of concerns about animal welfare, I would expect animal welfare to remain in people's minds. I am also unsure about whether there is a conflict between animal rights and eating high welfare animals. If these had super good lives, and were killed without any pain (this could even occur at the end of their healthy lives, in which case the killing would actually be preventing their suffering, like euthanasia), I guess no rights would be violated.</p><p>Humans have a right to life, but whenever a human is born, it is being sentenced to death (in as much as we think the lifespan of the universe is finite). This is still fine as long as the human as a good life, so I would guess the same applies to animals.</p><p>That being said, I am open to abolitionist approaches being more effective than welfarist ones. I do not think it is obvious either way.</p>", "parentCommentId": "uFFAJEvfSALy9ATDZ", "user": {"username": "vascoamaralgrilo"}}, {"_id": "9fJH3KqwGfQEr8shL", "postedAt": "2023-01-26T13:43:44.967Z", "postId": "DgS5oRvWqaTJX3EdD", "htmlBody": "<p>Hi Brendon,</p><p>In that sentence, I just meant to point out that not existing is better than existing in negative conditions. I agree the animals which are currently factory-farmed could continue to exist in better conditions.</p>", "parentCommentId": "T6Apu7QHY22y2Bci4", "user": {"username": "vascoamaralgrilo"}}]