[{"_id": "ram4P3rR6MnfAdXXh", "postedAt": "2021-11-15T14:34:07.073Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Sorry, really silly nit. But curious if the 80k transcripts are auto generated or manually transcribed?</p>\n<p>This one felt a bit harder to parse than the typical 80k podcast transcripts, I think because you left in pretty much all of the \"ok\"/\"so\"/\"yeah\" filler words.</p>\n<p>Or might just be because it's a public talk instead of an interview? Though I would actually expect the latter to be more conversation and less prepared.</p>\n", "parentCommentId": null, "user": {"username": "AppliedDivinityStudies"}}, {"_id": "vPbNmEXrjhCttF7x4", "postedAt": "2021-11-15T14:48:05.798Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<blockquote>\n<p>Basically, funders are holding their bar significantly higher than GiveDirectly. And that’s because they believe that by waiting, we’ll be able to find and also create new opportunities that are significantly more cost effective than GiveDirectly, and therefore over the long term have a much bigger impact. So I’d say the kind of current bar of funding within GiveDirectly is more around the level of Against Malaria Foundation, which GiveWell estimates is 15 times more cost effective than GiveDirectly. So generally, charities that are around that level of cost effectiveness, that level of evidence base, and kind of good in the same other ways, have a good shot of getting funding.</p>\n</blockquote>\n<p>Could you clarify what you mean here? Is \"current bar of funding within GiveDirectly\" the phrasing you intended? Is it that new interventions need the cost effectiveness of AMF, and also the scale of GiveDirectly? Sorry there's not a more specific question, I'm just generally a bit confused by the literal meaning of this paragraph as you intended it.</p>\n", "parentCommentId": null, "user": {"username": "AppliedDivinityStudies"}}, {"_id": "KNax5pEherACksu8c", "postedAt": "2021-11-15T17:01:00.480Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Hey, that seems like I mis-spoke in the talk (or there's a typo in the transcript). I think it should be \"current bar of funding with global development\".</p><p>I think in general new charities need to offer some combination of the potential for higher or similar cost-effectiveness of AMF and scalability.  Exactly how to weigh those two is a difficult question.</p>", "parentCommentId": "vPbNmEXrjhCttF7x4", "user": {"username": "Benjamin_Todd"}}, {"_id": "22JwmooGG7FQfao8w", "postedAt": "2021-11-15T20:03:21.254Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Do you have an opinion on whether that bar that funders are currently holding opportunities to should be lowered?</p>\n<p>What are the most relevant considerations here in your opinion?</p>\n", "parentCommentId": null, "user": {"username": "Charles_Dillon "}}, {"_id": "7hCyKpipRkadGncJs", "postedAt": "2021-11-15T20:37:25.506Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>I'm not a funder myself, so I don't have a strong take on this question.</p><p>I think the biggest consideration might just be how quickly they expect to find opportunities that are above the bar. This depends on research progress, plus how quickly the community is able to create new opportunities, plus how quickly they're able to grow their grantmaking capacity.</p><p>All the <a href=\"https://80000hours.org/podcast/episodes/phil-trammell-patient-philanthropy/\">normal optimal timing questions</a> also also relevant (e.g. is now an unusually hingey time or not; the expected rate of investment returns).</p><p>The idea of waiting 10 years while you gradually build a team &amp; do more research, and maybe double your money via investing, seems like a pretty reasonable strategy, unless you think now is very hingey. This is basically the strategy that Open Phil has taken so far. Though you could also argue that either now *is* hingey, and also that we're only deploying 1% of capital per year, which seems too low, which would both be reasons to deploy more rapidly. </p>", "parentCommentId": "22JwmooGG7FQfao8w", "user": {"username": "Benjamin_Todd"}}, {"_id": "2GqxDqykPgxaTW3Ai", "postedAt": "2021-11-15T20:42:25.129Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Normally with the podcasts we cut the filler words in the audio. This audio was unedited so ended up with more filler than normal. We've just done a round of edits to reduce the filler words.</p>", "parentCommentId": "ram4P3rR6MnfAdXXh", "user": {"username": "Benjamin_Todd"}}, {"_id": "fhn4iSxisQMbvbGBv", "postedAt": "2021-11-16T09:02:05.344Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Makes sense, thanks!</p>\n", "parentCommentId": "KNax5pEherACksu8c", "user": {"username": "AppliedDivinityStudies"}}, {"_id": "jhWwTfu3fnMSmLnKf", "postedAt": "2021-11-17T16:43:27.139Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Applied Divinity Studies and Rossa O'Keeffe-O'Donovan both pointed out that talking about a single 'bar' can sometimes be misleading.</p><p>For instance, it can often be worth supporting a startup charity that has, say, a 10% chance of being above the bar, even if the expected value is that they're below the bar. This is because funding them provides value of information about their true effectiveness.</p><p>It can also been worth supporting organisations that are only a little above the bar but might be highly scalable, since that can create more total giving opportunities above the bar in the longer term.</p><p>As a quick summary, I think it's reasonable to say something like: \"funders would like to eventually donate to as many opportunities above the bar as possible.\"</p><p>To that end, when assessing specific opportunities, they'll want to consider all of:</p><ul><li>What's the probability it's above the bar?</li><li>If turns out to be above above the bar, how much above the bar is it?</li><li>If it turns out to be above the bar, how scalable is it?</li></ul><p>In each case, the higher the better.</p><p>The eventual goal is something like \"donating as many $ above the bar weighted by cost-effectiveness as possible\".</p>", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "AppAvWLC5jBreJiFs", "postedAt": "2021-12-29T21:17:30.572Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Advertisement from youtubers working on rationality or scientific popularization may be a good way to rapidly expand the community.</p><p><br>For example, there has been a lot of advertisement for Brilliant, an intellectual training website. It's a fine way for youtubers to earn income, while recommending something beneficial for their subscribers and their reputation.</p><p><br>And since these communities are already curious and analytical, it's an interesting audience for seeding effective altruism ideas.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Alain Le Noach"}}, {"_id": "XJqHgaxNW5DbWkvnb", "postedAt": "2021-12-30T15:59:25.404Z", "postId": "DGyQAJuBZc4ZHJn6n", "htmlBody": "<p>Agree it's worth trying! We're hoping to try some sponsorships at 80k, and I think there are a couple of other collaborations and attempts at sponsorship going on.</p>", "parentCommentId": "AppAvWLC5jBreJiFs", "user": {"username": "Benjamin_Todd"}}]