[{"_id": "EkAw8uWcTLQCjzDK4", "postedAt": "2018-09-10T11:13:55.604Z", "postId": "DHFMSiFj2mRD6HwXr", "htmlBody": "<p>This was an interesting read, thank you. </p>\n<p>I have one methodological question: are the 98 group organisers that responded to the survey all from different groups? Or are a few of them from the same group, and if so, what does the data look like after correcting for this? \n(I fear the data may over-represent bigger groups, as they'd have more members responding to the survey.)</p>\n<p>EDIT: found it, from the 2017 survey report: &quot;Where groups had more than one organiser, they were asked to nominate one organiser to complete the questions designated for organisers.&quot; So never mind, then!</p>\n", "parentCommentId": null, "user": {"username": "stan"}}, {"_id": "WyR82AkJ4EA6YdmMX", "postedAt": "2018-09-11T14:27:49.717Z", "postId": "DHFMSiFj2mRD6HwXr", "htmlBody": "<p>Coworking sessions sound interesting. The fact that few groups utilize them, but those that do do it apparently very frequently, seems to suggest that it may be underrated. Could people from groups that do this on a regular basis elaborate on the format? Is it about organizing the group itself, i.e. preparing events etc.? Actively working on research topics? Or just generally people from the group meeting to work on things they personally need to get done? Would you say this specific setup increases productivity substantially?</p>\n", "parentCommentId": null, "user": {"username": "markus_over"}}, {"_id": "oNzpNNA3gu8XkfKPo", "postedAt": "2018-09-11T15:45:57.544Z", "postId": "DHFMSiFj2mRD6HwXr", "htmlBody": "<p>I've attended several co-working sessions with EA London. In my experience, they've been 2-5 people working independently on stuff they need to get done. For example, on a typical day Holly might be responding to messages and emails, David might be writing the EA London newsletter, and I might be doing a literature review for my dissertation. It's nice because we occasionally bounce ideas off of each other, and because eating lunch together is much more pleasant than working and eating alone. </p>\n", "parentCommentId": "WyR82AkJ4EA6YdmMX", "user": {"username": "Khorton"}}, {"_id": "58Ny7GugeoqASErFD", "postedAt": "2018-10-02T20:46:18.477Z", "postId": "DHFMSiFj2mRD6HwXr", "htmlBody": "<p>Yes, as you saw.. we separated out data from organisers and data from members. For groups with more than one organiser, we asked for them to nominate just one respondent to answer as 'organiser' and the others to fill out the survey as normal 'members'. </p>\n", "parentCommentId": "EkAw8uWcTLQCjzDK4", "user": {"username": "Richenda"}}, {"_id": "NZgbBobpiSDR3eNpE", "postedAt": "2018-10-02T20:47:20.906Z", "postId": "DHFMSiFj2mRD6HwXr", "htmlBody": "<p>My cautious guess would be that a bottleneck is groups actually identifying something to work on. Once they've set their course and found a good opportunity, from then it flows much more easily.</p>\n", "parentCommentId": "WyR82AkJ4EA6YdmMX", "user": {"username": "Richenda"}}]