[{"_id": "LCKAz7MiAynrd2A4y", "postedAt": "2023-08-10T15:56:48.308Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>Nice!</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "yW5vzAytvmmEettGc", "postedAt": "2023-08-10T18:06:00.178Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>Thanks for building this! Kelly criteria is one of those super neat concepts that has had a lot of analysis, but not much \"here's a thing you can play with\". I love that Manifolio lets you play with different users and markets, to give a more intuitive sense of what the Kelly Criteria <i>means</i>. The UI is simple and communicates key info quickly, and I like that there's a Chrome extension for tighter integration!</p>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "KFw6Qq7yeiK48GqFn", "postedAt": "2023-08-10T21:42:31.333Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>Maybe this is stupid of me, but should this be a fraction of your balance or a fraction of your net asset value?</p>\n", "parentCommentId": null, "user": {"username": "sam_brenner"}}, {"_id": "vaZk7LwJvtLQKLHce", "postedAt": "2023-08-10T21:53:46.934Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>I ask because of this message I got</p>\n<p>\"You have total loans greater than your current balance. Under strict Kelly betting, you should not bet at all in this scenario because there is non-zero risk of ruin. This calculator allows some leeway in this, and will still recommend a bet as long as losing all your money does not actually occur in any of the (up to 50,000) scenarios it simulates.\"</p>\n<p>Does this take into account the fact that I could liquidate a position to generate more balance and avoid ruin?</p>\n", "parentCommentId": "KFw6Qq7yeiK48GqFn", "user": {"username": "sam_brenner"}}, {"_id": "TQs6K7thNBHnQqbgn", "postedAt": "2023-08-10T22:25:45.580Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>It directly calculates the amount that will maximise expected log wealth, rather than using a fixed fraction. Basically it simulates the possible outcomes of all the other bets you have open. Then it adds in the new bet you are making and adjusts the size to maximise expected log wealth once all the bets have resolved.</p><p>If you have a very diversified portfolio of other bets this will be almost the same as betting the Kelly fraction (the f = p - q/b version) of your net asset value. If you have a risker portfolio, such as one massive bet, then it will be closer to the fraction of your balance. It should always be between these two numbers.</p><p>(Manifold also has loans which complicates things, the lower bound is actually on the Kelly fraction of (balance minus loans))</p><p>Sorry if it's confusing that in the post I'm using \"the Kelly criterion\" to mean maximising expected log wealth, whereas some other places use it to mean literally betting according the formula f = p - q/b. I prefer to use the broader definition because \"the Kelly criterion\" has a certain ring to it 😌, this is also the definition people on Lesswrong tend to use.</p>", "parentCommentId": "KFw6Qq7yeiK48GqFn", "user": {"username": "Will Howard"}}, {"_id": "qcRAisjeZrWhmC8LC", "postedAt": "2023-08-10T22:28:34.427Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>It doesn't account for that unfortunately, one of the simplifying assumptions it makes is that you will wait for all your positions to resolve rather than selling them.</p>\n", "parentCommentId": "vaZk7LwJvtLQKLHce", "user": {"username": "Will Howard"}}, {"_id": "LgwC5NRiyKY3wk2iY", "postedAt": "2023-08-11T00:01:30.749Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>This looks like it could be an excellent and helpful tool. I'll probably try using it to choose bet sizes at some point. I have a general critique though. I think it generally makes sense to treat your wealth as including a discounted sum of future income. For example, most young people have very little wealth on paper, and yet it is often highly rational for them to put substantial amounts of their money in the stock market, even though it's more risky than a savings account. The same is true for Manifold users. They can usually make lots of \"income\" by creating markets, completing quests, and purchasing mana directly. If you exclude these things from the calculation, I predict you'll often end up with an unreasonably low tolerance for risk.</p>", "parentCommentId": null, "user": {"username": "Matthew_Barnett"}}, {"_id": "Tw6qiSenBsnRMjQsn", "postedAt": "2023-08-11T07:08:15.956Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<blockquote><p>Basically it simulates the possible outcomes of all the other bets you have open.</p></blockquote><p>How can I do that without knowing my probabilities for all the other bets? (Or have I missed something on how it works?)</p>", "parentCommentId": "TQs6K7thNBHnQqbgn", "user": {"username": "Simon_M"}}, {"_id": "fQhthqGTnSL4ZhEem", "postedAt": "2023-08-11T07:40:16.446Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>It assumes the market probability is correct for all your other bets, which is an important caveat. This will make it more risk averse than it should be (you can afford to risk more if you expect your net worth to be higher in the future).</p><p>It also assumes all the probabilities are uncorrelated, which is another important caveat. This one will make it less risk averse than it should be.</p><p>I'm planning on making a version that does take all your estimates into account and rebalances your whole portfolio based on all your probabilities at once (hence mani–folio). This is a lot more complicated though, I decided not to run before I could walk. Also I think the simplicity of the current version is a big benefit, if you are betting over a fairly short time horizon and you don't have any big correlated positions then the above two things will just be small corrections.</p>", "parentCommentId": "Tw6qiSenBsnRMjQsn", "user": {"username": "Will Howard"}}, {"_id": "r4PDK2njk5Tp28rdZ", "postedAt": "2023-08-11T11:16:03.815Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>This is a neat tool!<br><br>Just a little heads up for people in terms of privacy. If you use the built-in helper to place your bets, your API key is sent to the owner of the manifolo service. I've glanced over the source code, and it does not seem to be stored anywhere. It's mainly routed through the backend for easier integration with an SDK and some logging purposes (as far as I can tell). However, there aren't really any strong guarantees that the source code publicly available is <i>in fact</i> the source code running on the URL.<br><br>I have no reason to doubt this, but in theory your API key might be stored and could be misused at a later date. For example, a holder of many API keys could place multiple bets quickly from many different users to steer a market or make a quick profit before anyone realizes.<br><br>I don't think there is any technical reason why the communication with the manifold APIs couldn't just happen on the frontend, so it might be worth looking into?<br><br>In general one should be very careful about pasting in API keys anywhere you don't trust. Seems like the key for manifold gives the holder very wide permissions on your account.<br><br>Again, I have no reason to suspect that there is anything sinister going on here, but I think it's worth pointing out nevertheless!<br><br>Thanks for posting the source code as well! Personally I did use my API key while testing and I do trust the author :)</p>", "parentCommentId": null, "user": {"username": "HakonHarnes"}}, {"_id": "Rj8JyRmHhxDopzqav", "postedAt": "2023-08-11T11:32:35.842Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>Good point, this is worth considering :)</p><blockquote><p>I don't think there is any technical reason why the communication with the manifold APIs couldn't just happen on the frontend, so it might be worth looking into?</p></blockquote><p>I tried to do this initially but it was blocked by Manifold's CORS policy. I was trying to keep everything in the frontend but this and the call to fetch the authenticated user both require going via a server unfortunately.</p><p>Also something else to note in terms of privacy: I log the username and the amount when someone places a bet.</p><p>It doesn't need the API key at all to calculate the recommended amount, so for people concerned about this you can just paste the amount into Manifold</p>", "parentCommentId": "r4PDK2njk5Tp28rdZ", "user": {"username": "Will Howard"}}, {"_id": "ytrzt2o7vdBSoTTeu", "postedAt": "2023-08-11T11:58:16.277Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>Ah, yes, the CORS policy would be an obstacle. It might be possible to contact them and ask to be added to the list.</p>", "parentCommentId": "Rj8JyRmHhxDopzqav", "user": {"username": "HakonHarnes"}}, {"_id": "hoGjMZXZvyotm7kx2", "postedAt": "2023-08-13T12:14:02.457Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>Easy fix: let the user pick a discounted sum of future income. It could also be calculated using some average over past daily income if that's available to see.</p>", "parentCommentId": "LgwC5NRiyKY3wk2iY", "user": {"username": "Writer"}}, {"_id": "7zRrjK5amfvQndr6j", "postedAt": "2023-08-17T18:45:19.338Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>One idea: would it be possible to have a limit order mode? This would be useful I think!</p>\n", "parentCommentId": null, "user": {"username": "sam_brenner"}}, {"_id": "Ak4zrzHZqymdnB9Tw", "postedAt": "2023-08-17T18:52:26.814Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>The way I imagine this working is that the tool could make its normal slippage assumptions until the limit is hit, and no more slippage after that</p>\n", "parentCommentId": "7zRrjK5amfvQndr6j", "user": {"username": "sam_brenner"}}, {"_id": "JRTtiS4gknjxZ8LMd", "postedAt": "2023-08-18T10:04:35.889Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>I would really like to add some kind of limit order mode. I also often set up a limit order to sell out of my position once I have reached a certain profit which I would like to be able to do via the calculator.</p><p>The main reason I haven't done this, and the thing suggested by <a href=\"https://forum.effectivealtruism.org/users/matthew_barnett?mention=user\">@Matthew_Barnett</a> below of adding a discount rate, is that I wanted to keep this very simple so that people aren't overwhelmed by settings. I think the <a href=\"https://blog.beeminder.com/choices\">cost of adding an additional setting is quite high</a> because:</p><ul><li>A lot of people will be put off and literally just click away if there are too many settings, and then go back to making worse bets than if they only been shown a subset of those settings</li><li>People (me) will waste time fiddling with settings that aren't that important, and either end up making worse bets or just not benefit that much for the extra cost (or think \"ugh I have to estimate the expected resolution time in both the YES and NO case\" when they see a favourable market, and just not bet on it instead). The discount/expected growth rate is very susceptible to this I think, because it's easy to be overconfident and avoid <i>ok</i> bets because of the perceived opportunity cost (especially as your growth rate will go down as your balance goes up and it's harder to find markets that can absorb all your mana, so people are likely to overestimate their long term growth rate)</li><li>On the practical side, every extra setting increases the chance of bugs, and being pretty confident that the answer is correct is important for a calculator that makes important decisions for you</li></ul><p>My current plan is to leave this calculator basically as is, and built another more fully featured one for advanced users, which will hopefully include these things:</p><ul><li>Accounting for several estimates at the same time, and remembering previous bets</li><li>Time discounting (which overlaps with the one above)</li><li>Limit orders, or some other way of automatically buying in/out of a position over time</li><li>Estimating the resolution time in each outcome (this is important if you have a market like \"Will Donald Trump tweet before the end of 2023\", where it can resolve YES early but can't resolve NO early. It changes the ROI quite a bit)</li></ul><p>I'm not 100% sure this is the right approach though, because I could throw some of these things in \"Advanced settings\" pretty easily (within a week or two), whereas building the better thing would take at least a couple of months. I'd be interested in your thoughts on this seeing as you're an actual real user!</p>", "parentCommentId": "7zRrjK5amfvQndr6j", "user": {"username": "Will Howard"}}, {"_id": "TWmrwBKjDxHBfKrdJ", "postedAt": "2023-08-21T01:09:50.012Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>I think I'm much more interested in the limit order mode than any of the other features you mentioned, so if there's room for a single additional setting inside the current calculator, I'd want it to be that one. However, I agree with your general thoughts on the cost of additional features, and all the other ones you mention do seem useful!</p>", "parentCommentId": "JRTtiS4gknjxZ8LMd", "user": {"username": "sam_brenner"}}, {"_id": "RP78xf7iWybQGAufe", "postedAt": "2023-08-22T07:04:29.851Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>Cool tool! Thanks for doing this.</p>\n<p>Also, I want to appreciate the focus on the user (e.g. being <em>very</em> cautious about adding something that is gonna complicate the usage). You have successfully resisted the temptation 😁!</p>\n", "parentCommentId": null, "user": {"username": "hnykda"}}, {"_id": "pmJuFt9QZGqzu6MfN", "postedAt": "2023-10-17T19:38:58.526Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": "<p>This is great; I've used it a few times over the past month and it's been interesting/helpful!<br><br>Here is a suggestion for a very similar tool: I would love to use some kind of \"arbitrage calculator\". &nbsp;If I think that two markets with different prices have substantially the same criteria (for example, <a href=\"https://manifold.markets/Nostradamnedus/will-gaza-be-under-complete-militar\">these</a> <a href=\"https://manifold.markets/JoaoPedroSantos/will-gaza-be-de-facto-controled-by\">three</a> <a href=\"https://manifold.markets/connorwilliams97/will-gaza-be-de-facto-controlled-by\">markets</a>, which were priced at 24%, 34%, and 53% before I stepped in), obviously I can try to arbitrage them! &nbsp;But there are many complications that I haven't been able to think through very clearly:</p><ul><li>One market might be much smaller than the other, so betting 100 mana would push the probability much further in one market than the other. &nbsp;Do I arbitrage by betting equal amounts of mana in both markets, or betting to move the probabilities by equal amounts (surely not), or some intelligent mix of the two?</li><li>How should I bet if I spot an arbitrage opportunity where the criteria are (inevitably) ALMOST the same, but not exactly the same? &nbsp;Say the two prices are separated by 25 percentage points, but I think the difference in resolution criteria only justifies a 5 percentage point difference? &nbsp;(Or the same problem in reverse -- spotting two similarly-priced markets where I think there should be a larger difference between them.)</li><li>What if I am not just purely arbitraging, but also have a my own inside view about what the true probability should be? &nbsp;There must be some optimal way to make a semi-hedged bet that maximizes my profits! &nbsp;But I don't know enough about finance to begin to figure out what this might be...</li></ul><p>If you added this capability to manifolio, I feel like I would use it all the time! &nbsp;Having an arbitrage calculator might help create more liquid markets in manifold, by helping unify markets on related topics and generate more consistent probabilities.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "THpMDuG3PeqDo4wnr", "postedAt": "2023-08-11T08:32:14.962Z", "postId": "DJEbnY4P5gcEaN3WA", "htmlBody": null, "parentCommentId": null, "user": null}]