[{"_id": "cCShPMKiaksWptNuc", "postedAt": "2023-07-21T18:05:34.805Z", "postId": "DL5xrtZnTgjeEa4Y6", "htmlBody": "<ul><li>Since \"Why The West Rules\" is pretty big on understanding history through quantifying trends and then trying to understand when/why/how important trends sometimes hit a ceiling or reverse, it might be interesting to ask some abstract questions about how much we can really infer from trend extrapolation, what dangers to watch out for when doing such analysis, etc. &nbsp;Or as Slate Star Codex entertainingly put it, \"<a href=\"https://slatestarcodex.com/2019/03/13/does-reality-drive-straight-lines-on-graphs-or-do-straight-lines-on-graphs-drive-reality/\">Does Reality Drive Straight Lines On Graphs, Or Do Straight Lines On Graphs Drive Reality?</a>\" &nbsp;How often are historical events overdetermined? &nbsp;(Why The West Rules is already basically about this question as applied to the Industrial Revolution. &nbsp;But I'd be interested in getting his take more broadly -- eg, if the Black Death had never happened, would Europe have been overdue for some kind of pandemic or malthusian population collapse eventually? &nbsp;And of course, looking forward, is our civilization's exponential acceleration of progress/capability/power overdetermined even if AI somehow turns out to be a dud? &nbsp;Or is it plausible that we'll hit some new ceiling of stagnation?)</li></ul><p>&nbsp;</p><ul><li>On the idea of an intelligence explosion in particular, it would be fascinating to get Morris's take on some of the prediction / forecasting frameworks that rationalists have been using to understand AI, like Tom Davidson's \"compute-centric framework\" (the <a href=\"https://astralcodexten.substack.com/p/tales-of-takeover-in-ccf-world\">Slate Star Codex popularization</a> that I read has a particularly historical flavor!), or Aeja Cotra's Bio Anchors report. &nbsp;It would probably be way too onerous to ask Ian Morris to read through these reports before coming on the show, but maybe you could try to extract some key questions that would still make sense even without the full CCF or Bio Anchors framework?</li></ul><p>&nbsp;</p><ul><li>Not sure exactly how to phrase this question, but I might also ask him how likely he thinks it is that the world will react to the threat of AI in appropriate ways -- will governments recognize the problem and cooperate to try and solve it? &nbsp;(As for instance governments were somewhat able to adapt to nuclear weapons, adopting an uneasy norm that all wars must now be \"limited wars\" and mostly cooperating on an international regime of nuclear nonproliferation enforcement.) &nbsp;Will public opinion recognize the threat of AI and help push government actions in a good direction, before it's too late? &nbsp;In light of previous historical crises (pandemics both old and recent, world wars, nuclear weapons, climate change, etc), to what extent does Morris think humanity will \"rise to the challenge\", versus to what extent do you sometimes just run into a problem that is way beyond your state-capacity to solve? &nbsp; TL;DR I would basically like you to ask Ian Morris about this xkcd comic:<br><br><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cCShPMKiaksWptNuc/vuilllegwmdfo5ks4kej\" alt=\"xkcd: Scientific Briefing\"></li><li>Personally if I had plenty of time, I would also shoot the shit about AI's near-term macro impacts on the economy. &nbsp;(Will the labor market see \"technological unemployment\" or will the economy run hotter than ever? &nbsp;Which sectors might see lots of innovation, versus which might be difficult for AI to have an impact on? etc.) &nbsp;I don't really expect Morris to have any special expertise here, but I am just personally confused about this and always enjoy hearing people's takes.</li></ul><p>&nbsp;</p><ul><li>Not AI related, but it would be interesting to get a macro-historical perspective on the current geopolitical outlook on the trajectories of major powers -- China, the USA, Europe, Russia, India, etc. &nbsp;How does he see the relationship between China and the USA evolving over coming decades? &nbsp;What does the Ukraine war mean for Russia's long-term future? &nbsp;Will Europe ever be able to rekindle enough dynamism to catch back up with the USA? &nbsp;And how might these traditional geopolitical concerns affect and/or be affected by the impacts of an ongoing slow-takeoff intelligence explosion? &nbsp;(Again, not really expecting Morris to be an impeccable world-class geopolitical strategist, but he probably knows more than I do and it would be interesting to hear a macro-historical perspective.)</li></ul><p>&nbsp;</p><ul><li>Not a question to ask Ian Morris, but if you've read \"Why The West Rules\", you might appreciate this short (and loving) parody I wrote, chronicling a counterfactual Song Dynasty takeoff fueled by uranium ore: \"<a href=\"https://jacksonw.xyz/posts/why-the-east-rules/\">Why The East Rules -- For Now</a>\".<br><br><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cCShPMKiaksWptNuc/uvgn3juxl1a0xxp9td40\" alt=\"Maps (of uranium ore), not chaps.\"></li></ul><p>Finally, thanks so much for running the 80,000 Hours podcast! &nbsp;I have really appreciated it over the years, and learned a lot.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}]