[{"_id": "GgXpQFguQqHgWeySK", "postedAt": "2023-07-19T17:34:06.556Z", "postId": "DNm5sbFogr9wvDasH", "htmlBody": "<p>Greg - thanks for this helpful overview of the UN meeting on AI.</p><p>Interesting that Mozambique seems savvier about AI X-risk than many bigger countries.&nbsp;</p><p>I suspect that there's a potential narrative that could be developed (e.g. by the AI Pause community, or AGI moratorium community) that runaway AGI research involves big rich countries -- especially the US -- imposing extinction risk on smaller poorer countries. Yet another example of rich-country hubris, or a kind of 'X-risk colonialism', where the key AI countries are charging ahead, doing their thing, imposing huge 'risk externalities' on other countries, civilizations, and cultures without their consent.</p><p>It's also striking that when AI industry advocates talk about the benefits of AI, it generally concerns US-centric issues such as promoting longevity, advanced-country prosperity, automation, space colonization, etc., rather than addressing the kinds of issues that poorer countries might care more about -- e.g. promoting the rule of law, property rights, stable currencies, public health, basic education, government integrity, etc. &nbsp;So, if I was a bright young person living in Brazil, Nigeria, India, or Morocco, the AI industry would seem like it's trying to solve first-world problems, while imposing huge and scary risks on my people and my country.</p><p>I suspect that this 'AI X risk neo-colonialism' narrative would be difficult for the AI industry to deal with, since so many of the AI leaders and researchers seem to be living in a Bay Area culture bubble that gives little thought to the risks (and benefits) they're imposing on the 96% of humans who don't live in the U.S.&nbsp;</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "aTkWTY4XNBdqjrT7h", "postedAt": "2023-07-20T01:57:48.332Z", "postId": "DNm5sbFogr9wvDasH", "htmlBody": "<p>trevor - I'm not sure I follow your point here. Please expand on it a little bit? Thanks!</p>", "parentCommentId": "tMhstNyRoy9ZPFNxR", "user": {"username": "geoffreymiller"}}]