[{"_id": "jLxNzmzxWy9LRRKnD", "postedAt": "2022-12-17T08:05:03.586Z", "postId": "DosxprPupic6dmiB6", "htmlBody": "<p><s>I feel like you may be preaching to the choir here, but agree with the sentiment (modulo thinking people should do more of whatever is the best thing on the margin).</s></p>\n<p>Nevermind, I see its a crosspost.</p>\n", "parentCommentId": null, "user": {"username": "D0TheMath"}}, {"_id": "yuZfthiNFcctdP2yY", "postedAt": "2022-12-17T23:11:39.029Z", "postId": "DosxprPupic6dmiB6", "htmlBody": "<p>This is fantastic! I love it when people from completely different schools of thought come together for a common cause. Great work Nathan!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "ZSqotsFg2h9eDHzTJ", "postedAt": "2022-12-18T17:21:25.692Z", "postId": "DosxprPupic6dmiB6", "htmlBody": "<p>The problem many people have with Torres is not just \"difference of opinion about longtermism\", but a history of<a href=\"https://markfuentes1.substack.com/p/emile-p-torress-history-of-dishonesty\"> lying and harassment</a>.<br><br>Therefore, it is important to consider that donating to an effective charity does not excuse or condone unethical behaviour.&nbsp;</p>", "parentCommentId": null, "user": {"username": "throwaway11"}}, {"_id": "xeiroLycejFDgFwar", "postedAt": "2022-12-26T22:56:41.460Z", "postId": "DosxprPupic6dmiB6", "htmlBody": "<p>Life is about balance.</p>\n<p>Should we care about the long-term future? Of course.</p>\n<p>But as Keynes said \"In the long term we're all dead.\"</p>\n<p>We can't ignore the plight of 711 million people living in extreme poverty.</p>\n<p>My life mission is turning my portfolio into a long -term donation machine to eliminate extreme poverty and then poverty in general.</p>\n<p>Each year I give more to Givedirectly and my local food bank.</p>\n<p>I started with what I could afford, two years ago, starting with $1000.</p>\n<p>This year I was able to give $4,000.</p>\n<p>Next year around $7,000.</p>\n<p>And within a few years over $100,000 per year including donating 6 meals to my local food bank for every meal I eat all year.</p>\n<p>I'm helping people in my local community right away.</p>\n<p>I'm helping dozens of people in Africa rise out of poverty right away.</p>\n<p>And long term I'll be able to help millions and then billions.</p>\n<p>Why turn EA into a political like fight?</p>\n<p>Charity today vs. longtermism?</p>\n<p>Do both.</p>\n<p>The problems are big enough that all EAs can make a difference.</p>\n<p>I'm new to EA. I'm sure there are critics of the philosophy.</p>\n<p>And I'm sure some of those are valid.</p>\n<p>I don't have time to get bogged down into symantic debates about what is or isn't EA. What is or isn't longtermism.</p>\n<p>Should altruism be effective? Of course. I don't think many people disagree with that basic principle.</p>\n<p>Should we help people suffering today? Of course, I don't think many disagree.</p>\n<p>Should we ignore the long term future? I don't believe many sane people think this.</p>\n<p>In other words, just like a humans want similar things, all altruists want basically the same thing.</p>\n<p>No philosopher is perfect. No one is a saint, or a prophet.</p>\n<p>Peter Singer is an inspirational philosopher but not perfect.</p>\n<p>Gene Roddenberry was an inspirational guy who created a vision for the utopia that has inspired millions.</p>\n<p>But people who knew him also know he often failed to live up to his own vision in his personal life.</p>\n<p>Let's not get bogged down in tearing down the cheerleaders for various kinds of altruism or visions for a better future.</p>\n<p>Let's all just celebrate our common humanity and small part in traveling the long and winding road towards utopia together.</p>\n", "parentCommentId": null, "user": {"username": "adam galas"}}]