[{"_id": "n7ansy5crkGjyZgpf", "postedAt": "2023-04-28T00:57:16.072Z", "postId": "Dq69kvjKyxQzKNRH7", "htmlBody": "<p>Thanks Julia and Ozzie. A few questions if I may.</p><p>Would you announce who is on the task force in due course?</p><p>I note that the form does not assume one could suggest oneself. Is that deliberate?</p><p>Also I note that the form does not have a section for the (relevant) bio of the person suggested so how do you decide how useful the person is unless you know the person very well already?</p><p>I also just want to mention the obvious that although there is some relevant expertise within the EA community in areas you are looking at, there is a lot of professional expertise in these areas outside the community too.</p>", "parentCommentId": null, "user": {"username": "LukeDing"}}, {"_id": "FH4fvebqcFjKvpqQu", "postedAt": "2023-04-28T02:31:45.463Z", "postId": "Dq69kvjKyxQzKNRH7", "htmlBody": "<p>Hi Luke, thanks for the suggestions! I've changed the form to reflect that it's fine to list yourself, and added a place to put more info about the person's bio / skills.<br><br>The intention is very much to get in touch with expertise outside the community - I've added a bit to make that clearer.<br><br>I'm happy to have a default plan of announcing who's on the task force after that's finalized, unless someone actively doesn't want to be identified.</p>", "parentCommentId": "n7ansy5crkGjyZgpf", "user": {"username": "Julia_Wise"}}, {"_id": "TBoJrtNkFDscJQh8E", "postedAt": "2023-04-28T03:12:30.536Z", "postId": "Dq69kvjKyxQzKNRH7", "htmlBody": "<p>Thanks so much Julia.</p>\n", "parentCommentId": "FH4fvebqcFjKvpqQu", "user": {"username": "LukeDing"}}, {"_id": "weQw6tQtvY7Lizv2z", "postedAt": "2023-04-29T00:11:34.234Z", "postId": "Dq69kvjKyxQzKNRH7", "htmlBody": "<p>I don't have anyone specific in mind (and you may have already thought of this), but my guess is that one could purchase a few hours of consulting time from a faculty member at a top nonprofit management program (e.g., <a href=\"https://oneill.indiana.edu/faculty-research/research/areas/nonprofit-management.html\">IU Bloomington</a>) and walk away with a pretty good list of who the top people are in the specific domains you are looking for and/or who might be well suited for this kind of consulting work in general. Depending on the referrals you otherwise receive, asking an academic in nonprofit management might be worthwhile to maximize the use of the panel members' time.</p>", "parentCommentId": null, "user": {"username": "Jason"}}]