[{"_id": "tgR8xHvBynG9wft2s", "postedAt": "2024-01-26T23:02:36.506Z", "postId": "DTswPWmkzMM7ZeeGq", "htmlBody": "<p>And? Do you have a particular solution to guarantee pandemic prevention that deals with the specific logistical complexities inherent to the task, that can be applied to every country on Earth without being resisted?</p>\n<p>\"Step 2: Draw the rest of the owl.\"</p>\n<p>I see you state your solutions will come in later posts but I think it's better to do that upfront given your rhetoric is currently not justified. Given your title I expect to see a theory of change that attempts to address the overwhelming challenges involved.</p>\n", "parentCommentId": null, "user": {"username": "DonyChristie"}}, {"_id": "c57QEnFtEyRFmvWJJ", "postedAt": "2024-01-27T13:10:51.827Z", "postId": "DTswPWmkzMM7ZeeGq", "htmlBody": "<p>\"Do you have a particular solution to guarantee pandemic prevention that deals with the specific logistical complexities inherent to the task, that can be applied to every country on Earth without being resisted?\"</p><p>I don't know what you mean by 'without being resisted', but otherwise, yes :)</p><p>The complexities are driven by the exponentiality of the variable. The exponentiality is resolved through speed, as I note in the piece. Exponential variables are exponential on the way down too.</p><p>&nbsp;</p><p>\"you state your solutions will come in later posts but I think it's better to do that upfront\"</p><p>We must understand the nature of the problem we are trying to solve before we start designing solutions. Similarly, we lay the foundations before we buy the wallpaper. Patience young grasshopper.</p><p>&nbsp;</p><p>\"Given your title I expect to see a theory of change that attempts to address the overwhelming challenges involved\"</p><p>I cannot speak to your expectations.</p><p>The key point of this piece, which is reflected in the title, is that pandemics are the kind of problem that can be solved, in contrast to a problem like hurricanes which we can only hope to endure better.</p><p>Having worked with senior academics and policy-makers in my own country I know that this distinction is not well understood among those in positions of the highest levels of influence. Hence, why I take my time in making the point.</p>", "parentCommentId": "tgR8xHvBynG9wft2s", "user": {"username": "PandemicRiskMan"}}]