[{"_id": "iDbS9Tr6efwXEo2Qo", "postedAt": "2023-12-03T11:48:11.092Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>This is a really good idea, and one I will incorporate into my own life. Not trying to start anything controversial, but I wonder how much would be fair for me to donate as a vegan who rarely travels by air, or are you recommending $35 as a standard amount for everyone?</p>\n", "parentCommentId": null, "user": {"username": "Hayven Jackson"}}, {"_id": "y4FoRJktixDjwm46p", "postedAt": "2023-12-03T17:32:38.184Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<blockquote>\n<p>are you recommending $35 as a standard amount for everyone?</p>\n</blockquote>\n<p>Not OP, but I would guess OP would recommend to pay only proportional to your estimated CO2 footprint. If you rarely travel, it will be much less than $35 (iirc veganism has a much smaller impact on CO2 than intercontinental flights).</p>\n", "parentCommentId": "iDbS9Tr6efwXEo2Qo", "user": {"username": "harfe"}}, {"_id": "jcikctLrP5EXH5XDi", "postedAt": "2023-12-03T18:17:44.988Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>That's awesome to hear - it was worth the effort of me writing it up then!</p>\n<p>Agreed with harfe's comment - if your goal is just to offset your own emissions then you would probably want to donate a bit less. If you don't fly more than the average American, then probably $20. Veganism might push the number down a little bit too, but like harfe said, the intercontinental flights are a bigger factor.</p>\n<p>Of course I wouldn't discourage anyone from donating above and beyond the amount needed to offset their own emissions!</p>\n", "parentCommentId": "iDbS9Tr6efwXEo2Qo", "user": {"username": "Luke Eure"}}, {"_id": "9PJAc9d2YujhyNKBu", "postedAt": "2023-12-03T18:27:45.166Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Thank you for sharing and hopefully encouraging others to considering offsetting.</p><p>I have taken a subscription with Carbon Neutral Britain which is at just under £7/$9 per month which works great for me because it minimizes the cognitive cost but makes it a more regular part of my life: <a href=\"https://carbonneutralbritain.org/pages/become-carbon-neutral\">https://carbonneutralbritain.org/pages/become-carbon-neutral</a></p><p>That said the Vox list is great and I'll be looking into their recommendations as well.</p>", "parentCommentId": null, "user": {"username": "helmetedhornbill"}}, {"_id": "GdTjd2vckeJ89HCDd", "postedAt": "2023-12-03T19:25:32.739Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Thanks so much. I didn’t get a notification for harfe’s post, but I’ll have to read it as well. Thank you both for your response to my question, it’s a big help!</p>\n", "parentCommentId": "jcikctLrP5EXH5XDi", "user": {"username": "Hayven Jackson"}}, {"_id": "ywLYJqYg7Yr4hkDtA", "postedAt": "2023-12-03T19:27:59.145Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Thanks so much for your input! Also do you know of any scientifically source that measures the impact of various activities (meat eating, travel, etc.) on emissions? It’s hard to find objective information because unfortunately the topic of climate change has become politicized.</p>\n", "parentCommentId": "y4FoRJktixDjwm46p", "user": {"username": "Hayven Jackson"}}, {"_id": "yc6Mhn9toCg65yEoa", "postedAt": "2023-12-04T02:24:08.678Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Thanks; this was helpful. Did the same thing and sent the post to my family, too.</p>\n", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "zmqFhFCvwmKQhNesS", "postedAt": "2023-12-04T10:44:47.589Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>I'm so glad to hear it</p>\n", "parentCommentId": "yc6Mhn9toCg65yEoa", "user": {"username": "Luke Eure"}}, {"_id": "uktcjmi2MeL4F8Fim", "postedAt": "2023-12-04T21:15:29.420Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>There are calculators out there, like this simple one from the UN for example: <a href=\"https://offset.climateneutralnow.org/footprintcalc\">https://offset.climateneutralnow.org/footprintcalc</a>&nbsp;<br>(includes lifestyle factors like meat as well as travel)</p>", "parentCommentId": "ywLYJqYg7Yr4hkDtA", "user": {"username": "Simon Newstead"}}, {"_id": "knby2hxodidgtJWyn", "postedAt": "2023-12-05T10:11:37.924Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>This seems reasonable, but I'm always nervous about any program that is using carbon offsets, because there are significant financial incentives to game the system and take credit for reductions, instead of just reducing emissions. It's better than doing nothing, but if you're interested, there's an easy way to set up recurring monthly donations to the fund Vox recommended, here: https://www.givingwhatwecan.org/en-US/charities/founders-pledge-climate-change-fund</p>", "parentCommentId": "9PJAc9d2YujhyNKBu", "user": {"username": "Davidmanheim"}}, {"_id": "LYnBec63zvRoF39yh", "postedAt": "2023-12-10T18:54:46.100Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Founders Pledge saying they can offset a ton of CO2 for $0.1-1 is like a malaria net charity saying they can save a life for $5.</p>\n<p>Both are off by at least an order of magnitude. You should expect to spend at least $100/ton for robust, verifiable offsets. That brings your offset cost to $3,500 not $35.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "P66LhCHhmxHLDb2Fv", "postedAt": "2023-12-11T05:03:55.698Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Thanks for posting.&nbsp;</p><p>I've donated $20 USD for the year based on your calcs.</p><p>Now I'm trying to offset my contributions to farmed animal suffering for the year. I'm starting with the number of farmed animals in Canada, where I live, but am not sure where to go next.</p><p>Any tips for approximately offset-able measures of \"How much did I contribute to farmed animal suffering this year?\" would be appreciated. Will update if I think of anything.</p>", "parentCommentId": null, "user": {"username": "Aidan Perreault"}}, {"_id": "QgxWRhbj2MKYZm6yi", "postedAt": "2023-12-13T10:20:08.521Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>I have actually been thinking of creating a tool to help people do exactly what you are trying to do! I will DM you after I make my first version to get your input</p>\n", "parentCommentId": "P66LhCHhmxHLDb2Fv", "user": {"username": "Luke Eure"}}, {"_id": "NAikwccTzKAWKBnjz", "postedAt": "2023-12-13T10:25:56.061Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Thanks - maybe I'm giving them too much trust.</p>\n<p>In their impact report they say \"We’ve granted out $14.89m in total and we estimate that it will avert 102m tonnes in CO2-equivalent emissions.\"</p>\n<p>I would not give too much credence to that from a non-EA aligned org, but I've been giving them decent credence with regards to counterfactual impact reporting since they're EA aligned.</p>\n<p>You're saying I should treat their reports less like givewell reports, and more like I would treat a random non EA charity. Any particular arguments for why? Or is it just that you wouldn't take the prior of assuming that they are at the evaluation quality of givewell? (Or maybe you don't trust givewell on this either)</p>\n", "parentCommentId": "LYnBec63zvRoF39yh", "user": {"username": "Luke Eure"}}, {"_id": "8DbH2iv4bf5Pf3rfq", "postedAt": "2023-12-13T13:48:30.504Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>Thanks, Luke!<br><br><strong>Uncertainty</strong><br>As we frequently point out, one should take the estimates with a grain of salt and consider the reported uncertainty (e.g. the old estimate had something like 0.1 USD/tCO2e to 10 USD/tCO2e) and, IIRC, the impact report also reports that these estimates are extremely uncertain and reports wide ranges.<br><br>As we discussed in our recent <a href=\"https://forum.effectivealtruism.org/posts/jxu6sBEzTqWizvGcD/how-we-think-about-expected-impact-in-climate-philanthropy\">methodology-focused update</a>, we think large uncertainty is unavoidable when operating in climate as a global decadal challenge with the most effective interventions inherently non-RCT-able (FWIW, I would think similarly about Global Health and Development, which is why I think the certainty focus of (historical) GiveWell can be harmful when the goal is to risk-neutrally identify the best interventions), so our main focus is on getting the relative comparisons right which is what is decision-relevant.<br><br><strong>Offsets provide no information with regards to the cost-effectiveness of risk-neutral philanthropy</strong><br>That said, using offsets to make the case that our estimates must be overly optimistic, seems mistaken.<br><br>Offsets solve a different problem, high certainty (uncertainty-avoidant) emissions reductions from direct action. &nbsp;This cannot be very cheap.&nbsp;<br><br>It is very plausible that risk-neutrality and leveraging mechanisms such as advocacy, trajectory changes, and others provides a large multiplier upon offsets at the cost of more uncertainty (though that uncertainty cuts both ways, uncertain things can also turn out to be <i>even</i> better than their expected value suggests). FWIW, Giving Green who used to be critical of this claim has also converged onto this position, now emphasizing philanthropic bets over offsets quite explicitly and much more confidently than they used to.<br><br>Just as <a href=\"https://forum.effectivealtruism.org/posts/KuByzfn6yiKMWBKmr/our-planned-allocation-to-givewell-s-recommendations-for-the?commentId=cynhvN7kwcmgxHE2C\">OP thinks that their risk-neutral global health and development works dominates GiveWell charities</a> despite being more uncertain about their own work, it is entirely plausible that credible offsets cost &gt; USD 100t/CO2e while good philanthropic opportunities dominate this by ~100x or more. In other words, being uncertainty-avoidant has real costs in terms of expected impact, so offsets do not provide a credible benchmark from which to infer whether estimates on risk-neutral philanthropy are off.<br><br><strong>Should we encourage offsetting?</strong><br>I should also note that I am quite critical of offsetting as a frame, one needs to be quite careful to not create / amplify a frame of very limited moral ambition (I think you did a good job in your post, though it is still further in terms of promoting offsetting than I'd go). I generally try to frame donating to climate charities as a form of political action rather than offsetting.<br><br>&nbsp;<br>&nbsp;</p>", "parentCommentId": "NAikwccTzKAWKBnjz", "user": {"username": "jackva"}}, {"_id": "X5CctKCxAhDMvawaG", "postedAt": "2023-12-13T15:21:24.457Z", "postId": "DXPWKQLnZPHyo74FH", "htmlBody": "<p>GiveWell has dozens of researchers putting tens of thousands of hours of work into coming up with better models and variable estimates. Their most critical inputs are largely determined by RCTs, and they are constantly working to get better data. A lot of their uncertainty comes from differences in moral weights in saving vs. improving lives.</p>\n<p>Founders Pledge makes models using monte carlo simulations on complex theory of change models where the variables ranges are made up because they are largely unknowable. It's mostly Johannes, with a few assistant researchers, putting in a few hundreds of hours into model choice and parameter selection - with many more hours spent on writing and coding for their monte carlo analysis (which Givewell doesn't have to do, because they've got much simpler impact models in spreadsheets).  FP has previously made 1/mtCO2e cost-effectiveness claims based on <a href=\"https://docs.google.com/spreadsheets/d/1q6srpmt5VkdXLGfYzqHqkU3hvGUwPKjA67uxqYI0Upw/edit#gid=0\">models like this</a>, which was amplified in MacAskill's WWOTF. This model is wildly optimistic. FP now disowns that particularly model, but won't take it down or publicly list it as a mistake. They no longer publish their particular intervention CEAs publicly, though they may resume soon. My biggest criticism is that when making these complex theory-of-change models, the structure of model often matters more than than the variable inputs. While FP tries to pick \"conservative\" variable value assumptions (they rarely are), the model structure is wildly optimistic for their chosen interventions (generally technology innovation policy). For model feedback, FP doesn't have a good culture or process in place that deals with criticism well, a complaint that I've heard from several in the EA climate space. I think FP's uncertainty work has promise as a tool, but I think the recommendations they come up with are largely wrong given their chosen model structure and inputs.</p>\n<p>GiveWell's recommendations in the health space are of vastly higher quality and certainty than FP's in the climate space.</p>\n", "parentCommentId": "NAikwccTzKAWKBnjz", "user": {"username": "MatthewDahlhausen"}}]