[{"_id": "CatqKPtYHBekfBEvp", "postedAt": "2023-09-05T01:18:43.154Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>This is a fantastic initiative! I'm not personally vegan, but believe the \"default\" for catering should be vegan (or at least meat and egg free) with the option for participants to declare special diatery requirements. This would lower consumption of animal products as most people just go with the default option, and push the burden of responsibility to the people going out of their way to eat meat.</p>\n", "parentCommentId": null, "user": {"username": "rileyharris"}}, {"_id": "WCZzmT4st3qzgZuH5", "postedAt": "2023-09-05T08:52:54.214Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>\"This is undoubtedly a massive opportunity to kickstart positive change at a large institutional scale with minimal cost or risk involved\" ... \"The primary motivation of this campaign may be for universities to limit their contribution to climate change and to shift public opinion in favour of a plant-based food system\"</p><p>Although I'm supportive of moves towards plant-based diets and better plant-based options being available, I wonder how confident one can be that this is truly minimal risk, especially with regards to the stated goal of shifting public opinion in favour of plant-based food systems. Do we know what proportion of students would really favour not have access to non-plant-based foods on campus (representative data, rather than petitions etc.)? If a majority are in favour, could this kind of action produce a very disgruntled minority who feel these things are being forced upon them and are resistant for the remainder of their lives to similar or other forms of animal advocacy. I'd be interested to know if there is any data/other relevant information or discussion with respect to these possible risks, and the popularity of such changes among the whole student body</p>", "parentCommentId": null, "user": {"username": "Jamie Elsey"}}, {"_id": "FGAJd94chDFKpWzaB", "postedAt": "2023-09-06T07:30:05.631Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>There's also welfare risks associated with removing beef from the menu (which presumably is substituted with chickens).</p>\n", "parentCommentId": "WCZzmT4st3qzgZuH5", "user": {"username": "ElliotJDavies"}}, {"_id": "trspbYERaq8xjFacf", "postedAt": "2023-09-06T12:14:51.900Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>In relation to the proportion of students who would/would not be in favour of this, the most I could find for now are the percentage votes for and against the motion in some of the universities in which a vote was held. As far as I am aware, along with University College London, Queen Mary University of London and Universities of Cambridge, Kent, Stirling and Birmingham (all at which the motion was passed), votes for the motion were also held (which failed) at Universities of Edinburgh and Warwick. I could only find data on the votes at Warwick (846 total votes, 320 (38%) for, 497 (59%) against, 29 (3%) abstentions),<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdjk5xvxyjhs\"><sup><a href=\"#fndjk5xvxyjhs\">[1]</a></sup></span>&nbsp;Cambridge (total vote unknown, 55% for, 21% against, 24% abstentions),<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefu8iceuy34or\"><sup><a href=\"#fnu8iceuy34or\">[2]</a></sup></span>&nbsp;UCL (total vote unknown, 75% \"for\" in general vote, 86% \"for\" in SU executive meeting)<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefepz54tx57d\"><sup><a href=\"#fnepz54tx57d\">[3]</a></sup></span>&nbsp;and Birmingham (total vote unknown, 54% for).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefaxvezovnvjr\"><sup><a href=\"#fnaxvezovnvjr\">[4]</a></sup></span>&nbsp;Also in Kent, although I don't have any exact figures to hand, the vote for the motion (which passed) had the highest voter turnout (over 450) for any Kent Union election in the university's history.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6usi35gfaw6\"><sup><a href=\"#fn6usi35gfaw6\">[5]</a></sup></span></p><p>There was also a YouGov poll which found that 55% of students want more plant-based options at their university, and it also showed that 47% of students were either flexitarian, pescetarian, vegetarian or vegan and that 49% would like to eat less meat and/or dairy (I can find these articles (<a href=\"https://plantbasednews.org/lifestyle/students-rate-universitys-vegan-meal/\">here</a> and <a href=\"https://www.tuco.ac.uk/insight/news-opinion/unive-website-launched-students-rate-their-universitys-vegan-meals-new-poll\">here</a>) which mention these results, yet I can't seem to find the raw published data or the survey results themselves, though I could have simply missed them). And one YouGov survey (December 2022) showed that 31% of 18-24 year-old Britons described themselves either flexitarian, pescatarian, vegetarian or vegan (53% described themselves as a meat-eater, and 15% as none of the above), and 12% of non-vegans of this age category would like to attempt Veganuary (going vegan for the month of January) in 2023.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefmpu9atynmzr\"><sup><a href=\"#fnmpu9atynmzr\">[6]</a></sup></span></p><p>Additionally, I found <a href=\"https://betterfoodfoundation.org/wp-content/uploads/2023/05/Exec-Summary_Serving-Up-Plants-by-Default.pdf\">this interesting study (summary)</a> which investigated the consumer effects of university dining halls serving plant-based meals as the default option. It studied three US universities (Tulane University, Lehigh University, and Rensselaer Polytechnic Institute). It found that</p><blockquote><p>On Control Days, only 26.9% of dishes served were plant-based. In comparison, on Plant Default Days, 57.6% of dishes served were plant-based. At Tulane and Lehigh, the proportion of plant-based dishes served on Plant Default Days jumped to 81.5%</p></blockquote><p>and</p><blockquote><p>We calculate that food-related greenhouse gas emissions declined by 23.6% on Plant Default Days.</p></blockquote><p>They also say that spillover effect is also taken into account, whereby a proportion of students who would have visited an intervention station on a Control Day decided to avoid the intervention station on a Plant Default Day in search of meat options elsewhere in the dining hall.</p><p>Other key findings of this study include:</p><ol><li>With incorrect implementation, the impact of the default on dish choice vanishes</li><li>Students—including meat eaters—are open to plant-based options</li><li>Dining hall staff found a plant-based default easy—and enjoyable—to implement</li><li>Eating and serving meat continues to be the social norm in campus dining, despite openness by students and staff to shift toward plant-forward choices, which indicates a considerable untapped opportunity for effective interventions, like defaults, to change consumption behaviour<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefpddu9d3lro\"><sup><a href=\"#fnpddu9d3lro\">[7]</a></sup></span></li></ol><p>So I guess that yeah there may be some who would be disgruntled about this but the last study mentioned (which was partly commissioned by Sodexo North America by the way), shows that students—including meat eaters—were significantly more likely to express satisfaction with plant-based meals on days when plant-based meals were the default.&nbsp;And Sodexo have also publicly committed to reducing its greenhouse gas emissions by making its college campus planned menus 50% plant-based by 2025.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreftcbf241l8l\"><sup><a href=\"#fntcbf241l8l\">[8]</a></sup></span>&nbsp;So I do believe that shifting behaviour on an institutional level can force a shift in behaviour on an individual level in the same or a similar direction.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndjk5xvxyjhs\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdjk5xvxyjhs\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.instagram.com/p/CZjw2QIgbSJ/</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnu8iceuy34or\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefu8iceuy34or\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.instagram.com/p/Co7TvEGqNS5/</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnepz54tx57d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefepz54tx57d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.plantbaseduniversities.org/post/un-goodwill-ambassador-supports-plant-based-universities-as-university-college-london-votes-yes</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnaxvezovnvjr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefaxvezovnvjr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.plantbaseduniversities.org/post/birmingham-university-students-vote-for-a-plant-based-student-s-guild</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6usi35gfaw6\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6usi35gfaw6\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.plantbaseduniversities.org/post/record-breaking-vote-as-students-at-the-university-of-kent-say-yes-to-100-plant-based-catering</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnmpu9atynmzr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefmpu9atynmzr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://yougov.co.uk/topics/society/articles-reports/2022/12/29/how-many-britons-will-attempt-vegan-diet-and-lifes</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnpddu9d3lro\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefpddu9d3lro\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://betterfoodfoundation.org/wp-content/uploads/2023/05/Exec-Summary_Serving-Up-Plants-by-Default.pdf</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fntcbf241l8l\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreftcbf241l8l\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://us.sodexo.com/media/news-releases/landmark-sodexo-study-in-college.html</p></div></li></ol>", "parentCommentId": "WCZzmT4st3qzgZuH5", "user": {"username": "Oisín Considine"}}, {"_id": "6222BhtXPsqTZo4To", "postedAt": "2023-09-06T12:46:49.134Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>The aim of the initiative is to get all university catering services to transition to serving 100% plant-based options, so the plan is to remove beef <i>and</i> chicken, along with all other animal-based food/drink products</p>", "parentCommentId": "FGAJd94chDFKpWzaB", "user": {"username": "Oisín Considine"}}, {"_id": "7TuERgqomSsBxfwjT", "postedAt": "2023-09-06T12:56:03.846Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>Do I understand correctly that some university canteens have responded to this ask by removing red meat off of their menus?</p>\n<p>If this is the case, you might not intend to shift the welfare burden onto chickens, but I'd certainly consider that a risk of implementing this strategy.</p>\n", "parentCommentId": "6222BhtXPsqTZo4To", "user": {"username": "ElliotJDavies"}}, {"_id": "dDf9hvSncdcFj5cKP", "postedAt": "2023-09-06T13:20:43.174Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>I'm not sure about whether or not some university canteens have asked to remove red meat, but I know that some of the universities which were successful, voted to implement something like 60/70% plant-based catering for the next year, with an increase of 10% each year until they get to 100% to make it more gradual.</p><p>Also, even if a university agreed to remove red meat, I still believe this is a more positive move in the long run, even taking this substitution effect into account (though of course I could be wrong as I have no concrete evidence). Just shifting away from red meat (even if not fully/partially replaced with plant-based food) could provide a bit of a momentum boost in bringing about institutional climate action regarding food systems change, and could encourage other universities to go even further and try for fully plant-based. Also it could give campaigners at the now red-meatless university a <a href=\"https://en.wikipedia.org/wiki/Foot-in-the-door_technique\">foot-in-the-door</a> to go further and push for the removal of all animal products. Removing red meat could also get people thinking about the food/drink they consume when thinking about climate change. Of course, all this can provide a bridge for other issues which animal agriculture exacerbates to become gradually more mainstream too. However, yes there could definitely be (short-term) downsides to a university removing just red meat (and further downsides if the removal of red meat was what was initially campaigned for, though even this still has many positives).</p>", "parentCommentId": "7TuERgqomSsBxfwjT", "user": {"username": "Oisín Considine"}}, {"_id": "eagFXySNfbFnEiMwn", "postedAt": "2023-09-07T04:40:16.080Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<blockquote><p>In policy spaces, this is known as the <a href=\"https://en.wikipedia.org/wiki/Brussels_effect\">Brussels Effect</a>; that is, when a regulation adopted in one jurisdiction ends up setting a standard followed by many others.</p></blockquote><p>I am not clear how the Brussels effect applies here, especially since we’re not talking manufacturing a product with high costs of running different production lines. I recognize there may be some argument/step that I’m missing, but I can’t dismiss the possibility that the author doesn’t actually understand what the Brussels Effect really is / normally does, and is throwing it around like a buzzword. Could you please elaborate a bit more?</p>", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "hsXn6G7EvEeM2DDsG", "postedAt": "2023-09-07T11:26:29.219Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>I used the Brussels Effect in the context of the Plant-Based Universities campaign to demonstrate how a university or universities in a particular region transitioning to a fully plant-based catering system would encourage other universities to follow suit at least partly due to wanting to maintain a forward-looking and innovative image and reputation which makes them appear more attractive. However, I admit that I didn’t fully understand the true nature of the Brussels Effect when I first wrote the post, and now after reading back over my post, particularly the part mentioning the Brussels Effect which you highlighted, and after understanding more about how this effect has less of a reputational factor and more of an economical factor which plays the role in encouraging change, I believe that mentioning it has no real use here. I was a little bit naive in the way in which I used (or perhaps misused) the term, so thank you for pointing this out to me. I take your point into due consideration and I have now edited that sentence out. Nevertheless my point about a university/universities going plant-based indirectly encouraging others to follow them due to factors including wanting to maintain a certain image/attractiveness, as well as the inertia of the movement itself, stands as is.</p>", "parentCommentId": "eagFXySNfbFnEiMwn", "user": {"username": "Oisín Considine"}}, {"_id": "HeJmzcnzJKDrStZtR", "postedAt": "2023-09-07T15:20:54.613Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>Hi Oisín, no worries, and thanks for clarifying! I appreciate your coverage of this topic, I just wanted to make sure there aren't misinterpretations.</p>", "parentCommentId": "hsXn6G7EvEeM2DDsG", "user": {"username": "Harrison D"}}, {"_id": "6Sd8wumDJ8yZpTuRL", "postedAt": "2023-09-07T16:05:56.330Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>Yeah all the better that you did! It can only help.</p>\n", "parentCommentId": "HeJmzcnzJKDrStZtR", "user": {"username": "Oisín Considine"}}, {"_id": "F7DCxBKSmJSnepWjW", "postedAt": "2023-09-07T19:52:37.224Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>Will say that I commend the bravery of this position - I respect people who take bold stances on issues of moral importance, even if I don't personally agree with them - but I do think it's very brave and potentially at risk of being damaging in the current political climate.</p>\n<p>Universities, particularly in the UK and the US at the moment, are peak culture war discourse source territory and the last thing you're aiming for at the moment is being sucked into that all-consuming cheap political narrative. I get the appeal of universities (young people skewing more in favour of this stuff + climate action), but anything radical and left-coded coming out of universities these days is consumed by it all. Regrettably, the first I saw of this campaign was a press piece using the campaign as raw meat for cheap political point scoring. You don't have to be supportive of the game to end up on the board, so best to understand the state of play.</p>\n<p>Having previously been approached to sign a similar pledge but in a local government context, I ended up having to issue a fairly middle-of-the-road statement stating why we weren't willing to sign it. The core of the problem wasn't the ask, but the political backlash that taking a stance on a matter that's very swept up in the culture war narrative would have cost us wasn't a trade I was willing to make at the stage in the election cycle that we were at. We have taken stances on other issues in this cluster of political sensitivity, such as gender-neutral bathrooms and air quality improvement work, this cause just wasn’t the one we chose to spend our limited political capital on. Worth considering for anyone working on this sort of advocacy.</p>\n<p>Reflecting on this, and the recent piece on the Pledge, I’m more optimistic about across-the-aisle campaigns focused on reducing the consumption of the worst for-welfare animal product options in the current climate until either A. The political climate around these issues improves or B. The window is shifted enough that such stances aren't as ‘radical’ as they are at the moment.</p>\n<p>Nonetheless, I wish the folks working on this well.</p>\n", "parentCommentId": null, "user": {"username": "Alisha Lewis"}}, {"_id": "zGbdHNnPJGjDrnwCt", "postedAt": "2023-09-08T10:28:01.809Z", "postId": "DXvgL6GjxLGqigWAq", "htmlBody": "<p>Thanks for sharing this additional information and numbers. My concern basically lies in what I see as a large difference between making meatless/plant-based options a default or more easily available choice vs. removing anything that is not plant-based from campus. The empirical information from interventions above relate to interventions that are in the form of switching a default and not about entirely removing an option, and it is with the 'forcing of a shift in behavior' as you put it where I can imagine a lot more negative sentiment among those who do not agree.</p><p>Even on plant-default days in a seemingly successful implementation mentioned above, over 40% of students picked a non plant-based option. Those students would presumably not be too happy if the option were entirely removed.</p>", "parentCommentId": "trspbYERaq8xjFacf", "user": {"username": "Jamie Elsey"}}]