[{"_id": "xnWZgSnFotZYMf2S7", "postedAt": "2022-10-10T13:06:58.269Z", "postId": "DymazENLybomtoAwP", "htmlBody": "<p>I think my most important general life advice is: it's ok to \"fake\" having adhd in order to get stimulants from your doctor. ADHD isn't an Aristotelian category, and doctors are typically extremely biased towards minimising risk instead of trying to help you the most in expectation. Your doctor and you do not optimise for the same things.</p><p>Needless to say, stimulants won't work for everyone, but the downsides on therapeutic doses are minimal (you can just stop taking them if they don't work) and the upsides can be life-changing and long-term.</p><p>Morally, the government is using violence to stop people from selling you drugs that could help you. If you're lying to them in order to correct for that injustice, I think it's fair game.</p><p>I'm hoping that saying this openly will make people act on what they already know to be true. I don't think I'll convince anyone. I can recommend Scott Alexander's (going by \"Lorien Psychiatry\") post on Adderall.</p><p>If you need to remind yourself to book an appointment, feel free to message me and I can check up on whether you've completed the task in two weeks or whatever interval you need. : )</p>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "ZBNZJrdjd4A2teGFm", "postedAt": "2022-10-10T17:45:30.549Z", "postId": "DymazENLybomtoAwP", "htmlBody": "<p>I'm a big fan of stimulants-for-all, but people should know that they can cause obsessiveness if you take too high a dose. When I first started, I would obsessively spend all day trying to solve a single math problem and couldn't give up and move on even though I was making virtually no progress.&nbsp;</p>", "parentCommentId": "xnWZgSnFotZYMf2S7", "user": {"username": "esc12a"}}, {"_id": "TkzAN2t7aRWTP6W4B", "postedAt": "2022-10-10T17:54:42.754Z", "postId": "DymazENLybomtoAwP", "htmlBody": "<p>But if you feel like you're doing too much math and not able to prioritise, you can stop taking them. If you feel like they work for you, you can keep taking them.</p>", "parentCommentId": "ZBNZJrdjd4A2teGFm", "user": {"username": "Emrik"}}]