[{"_id": "be5P7jcajY7ZjF5m7", "postedAt": "2015-01-14T12:03:40.188Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Great point Jeff! Most of us here are very lucky people - to be born humans, in rich countries with an upbringing that provides us outstanding opportunities to influence the world. This motivates me all the more to go out and help others who weren't born as fortunate as me.</p>\n<p>&quot;Someone at the poverty line in the US has more than 90% of people in the world ... This is not to minimize the suffering of people in the US, along any dimension&quot;</p>\n<p>Something to keep in mind here is that wealth can only go so far, so you would expect that a rich country would still have plenty of unhappy people in it for non-material welfare related reasons. The thing is we know more about how to easily fix extreme poverty than we do about how to solve e.g. serious mental health problems or unhappy marriages.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "vXxmSvztqZaGDEihQ", "postedAt": "2015-01-14T16:26:08.382Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>In other words, having privilege is a privilege :) </p>\n<p>I think it's important for those of us who are privileged in one way or another to acknowledge this. It should help disarm some of the controversial aspects of earning to give, which are precisely a matter of it being a strategy of privileged people which takes advantage of a social system which privileges them.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "ey8XdZXxLdNuxyza5", "postedAt": "2015-01-14T22:25:20.184Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>One thing I note when thinking along these lines is that one of my biggest lucky breaks was my innate mathematical talent. We tend not to characterise innate abilities as 'privilege', for reasons I've never fully understood, but if you understand privilege as 'unearned advantage' as I do then it absolutely deserves a spot on many people's lists.</p>\n<p>Edit: On that note, I strongly identify with a quote from Warren Buffet:</p>\n<p>&quot;I happen to have a talent for allocating capital. But my ability to use that talent is completely dependent on the society I was born into. If I’d been born into a tribe of hunters, this talent of mine would be pretty worthless. I can’t run very fast. I’m not particularly strong. I’d probably end up as some wild animal’s dinner.</p>\n<p>But I was lucky enough to be born in a time and place where society values my talent, and gave me a good education to develop that talent, and set up the laws and the financial system to let me do what I love doing — and make a lot of money doing it. The least I can do is help pay for all that. &quot;</p>\n", "parentCommentId": null, "user": {"username": "AGB"}}, {"_id": "p47BZaWuaeJ3kmRrb", "postedAt": "2015-01-14T22:32:51.367Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Being born with the capacity to become highly intelligent, conscientious, physically attractive, resilient, and so on, is surely among the greatest privileges.</p>\n", "parentCommentId": "ey8XdZXxLdNuxyza5", "user": {"username": "Robert_Wiblin"}}, {"_id": "aeQX9LeEaMoXWzpJ6", "postedAt": "2015-01-14T22:43:40.759Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>I'm not sure if you want to know why psychologically this happens, but as far as i can understand, it's because</p>\n<ul>\n<li>justice is rewarding people for what they do, not what they are, e.g. the equality of opportunity narrative, tit for tat, etc. and since it's harder to pretend your intelligence is uncorrelated to your competence, it's harder to get jealous about.</li>\n<li>the politically incorrect (Hansonian) answer it's harder to plot to bring about redistribution of wealth from the intelligent or mathematically competent compared to highly visible traits like nerdiness, skin color, gender, etc, which makes the latter better fodder for political justice movements.</li>\n</ul>\n<p>(It's not my idea - I'm sorry it's politically incorrect but the key is to try to engage it rationally rather than emotionally)</p>\n", "parentCommentId": "ey8XdZXxLdNuxyza5", "user": {"username": "RyanCarey"}}, {"_id": "nax5WrMaCEu4Sz8Wu", "postedAt": "2015-01-14T23:05:14.456Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>I understand that far, but then most people would certainly accept that my suffering is morally equivalent to the suffering of someone of 'average' intelligence, and not privilege me in access to universally rationed public goods like, say, medical care. Yet somehow my disproportionate access to non-rationed market-allocated goods like food is ok. That's the contrast I struggle to get my head around.</p>\n<p>If we're talking about redistribution, then we get into incentives issues and this all gets complicated fast. But actual policy is somewhat distinct to the conceptual framework I described above (though having that framework will certainly influence your policy prescription).</p>\n", "parentCommentId": "aeQX9LeEaMoXWzpJ6", "user": {"username": "AGB"}}, {"_id": "wibZpQbQYtTDoG2SY", "postedAt": "2015-01-15T01:49:59.394Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Reading between the lines, I think you probably know some 'Social Justice Warriors', and they give you a lot of flak for your race, gender, career success and so on. And I totally understand the desire to respond to them - I know I frequently feel attacked by SJWs saying hateful things, and want to defend myself and my existence. I think, as ever, <a href=\"http://slatestarcodex.com/2015/01/01/untitled/\">Scott has written the canonical piece on this.</a></p>\n<p>But does this really do any good? My impression is that if you ignore them, SJWs largely ignore you. They rarely go after really sexist or racist people, else they would spend all their time campaigning about <a href=\"https://en.wikipedia.org/wiki/Rotherham_child_sexual_exploitation_scandal\">Rotherham</a> and <a href=\"https://www.amnesty.org/en/library/asset/MDE14/021/2014/en/5243cb6b-09fe-455d-b2df-f6ce34e450f4/mde140212014en.pdf\">ISIS</a>. But you interact with them - if you grant them some ground, then you mysteriously become fair game for a tweetstorm of hate.</p>\n<p>And they're easy to avoid! People are much more pleasant in the flesh, and there just aren't all that many SJWs. They're are just disproportionately noticeable on the internet because of their hostility. </p>\n<p>So my advice is to do the same to SJWs who judge you for your race and gender as I do with people who judge me for my sexuality: don't let them bring you down to their level. You should be proud of who you are and what you do - there's no need to apologize. The world is full of lovely, tolerant people, and by spending time with haters you're depriving yourself of opportunities to make new friends who will care about you for who you really are.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "ZjDjxnfxYKjrWqDwx", "postedAt": "2015-01-15T04:56:56.679Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>I wrote <a href=\"http://lesswrong.com/lw/fnt/factions_inequality_and_social_justice/\">an essay</a> expanding on this idea if anyone is interested.</p>\n<p>Mark Twain wrote:</p>\n<blockquote>\n<p>A man who carries a cat by the tail learns something he can learn in no other way.</p>\n</blockquote>\n<p>This is my steelman of the idea of &quot;privilege&quot;.  If you've never seen the color red before, and I try to describe it to you, no amount of description will teach you as much as seeing a red object would.  So I'm fairly persuaded by claims like &quot;You'll never <em>really</em> understand what it's like to be (gay/a woman/black)&quot;.  In fact, there are lots of human experiences I will never <em>really</em> understand.  And like Jeff says, that doesn't make me a bad person.</p>\n", "parentCommentId": "aeQX9LeEaMoXWzpJ6", "user": {"username": "John_Maxwell_IV"}}, {"_id": "cnqG9HhpdJtpXgfzx", "postedAt": "2015-01-15T11:23:38.293Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>In respect to politeness and avoiding hostile conversation, you might reconsider your post here. Plenty of people in this community  would probably fit the label 'social justice warrior' (like the term political correctness before it, this term seems to be used to dismiss wholesale people whose only distinguishing feature is advocating people not being dicks to each other). It's disappointing to read something in this forum where I find myself labelled unfit for association. </p>\n", "parentCommentId": "wibZpQbQYtTDoG2SY", "user": {"username": "Bernadette_Young"}}, {"_id": "t9A7sauSnrxN4y5gR", "postedAt": "2015-01-15T11:52:44.985Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>I found this comment unhelpful because: (i) it reads like an implied ad hominem attack on Jeff's argument: i.e. the only reason he wrote this is because he was attacked (and therefore we can ignore the conclusion), and (ii) it seems like an attack on SJWs which is really off-topic.</p>\n<p>On (i): You say &quot;don't let them bring you down to their level&quot;, with an implication that this has somehow happened in writing this post. However you don't point to anything said here which is at a low level (and I don't think there is anything). I think Jeff's argument is actually very good and deserves to be appreciated more widely.</p>\n<p>On (ii): Thinking, as Scott does, that SJWs sometimes do unfair/hostile things is fine. But that doesn't mean it's appropriate to bring into any conversation on privilege or social justice. Scott describes himself in the post you link to as &quot;97% on board [with feminism]&quot;. I suspect that the content of Jeff's post falls firmly in that 97%. Bringing the 3% up here seems like another ad hominem attack, but this time on social justice.</p>\n", "parentCommentId": "wibZpQbQYtTDoG2SY", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "5uabAAcXBRqSSrk7j", "postedAt": "2015-01-15T13:09:53.845Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Perhaps someone has been mean to Jeff about his good fortune in the past, but that doesn't mean he doesn't believe what he has written here, or that this post isn't both true and useful to keep in mind.</p>\n", "parentCommentId": "wibZpQbQYtTDoG2SY", "user": {"username": "Robert_Wiblin"}}, {"_id": "DwidnnN84RnLdjysY", "postedAt": "2015-01-15T14:01:26.331Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Certainly it makes pragmatic sense to reward and punish people in cases where it will have an effect on their behaviour (say on how hard they work), rather than for things they can't change at all (who their parents were). Most life outcomes are an unclear mixture of the two, which makes it hard to know what to do.</p>\n<p>On this general topic, I agree with the argument for an extra tax on tall people described here, even though I would lose out: <a href=\"http://darp.lse.ac.uk/papersdb/Mankiw-Weinzierl_%28AEJ10%29.pdf\">http://darp.lse.ac.uk/papersdb/Mankiw-Weinzierl_%28AEJ10%29.pdf</a>.</p>\n", "parentCommentId": "aeQX9LeEaMoXWzpJ6", "user": {"username": "Robert_Wiblin"}}, {"_id": "LFPTKtTXEavxJp6Cu", "postedAt": "2015-01-15T16:12:57.255Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>This makes me want to distinguish among different kinds of privilege, as in <a href=\"https://takesupspace.wordpress.com/2008/09/03/language-politics-13distinctions-within-privilege-and-oppression/\">this</a> post: </p>\n<p><em>Dominance is privilege that is harmful to other people and that no one should have;\nSupport is privilege that everyone should have, and is not on its own harmful to anyone else.</em></p>\n<p><em>For instance: A habit of attempting to dominate conversations is internalized dominance, and actually being allowed to do so is external dominance; speaking up for oneself is a sign of internalized support, while actually being listened to is external support.</em></p>\n<p>I think Jeff is (mostly?) talking about &quot;support&quot;, the kind of privilege that everyone should have.</p>\n", "parentCommentId": null, "user": {"username": "davidc"}}, {"_id": "3nw9hbyvjeqNeBTfH", "postedAt": "2015-01-15T17:07:04.803Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Good to hear this sort of discussion in the effective altruism community. One important privilege/unearned advantage that often goes unrecognized is <em>time</em>. We live in a time of where massive suffering from global poverty and factory farming is coupled with also massive stockpiles of resources, which allows us to be particularly helpful by commandeering these resources for ethical purposes through earning to give, accumulating power and influence, or other means. I greatly admire all who recognize this privilege and take it upon themselves to make use of it.</p>\n", "parentCommentId": null, "user": {"username": "redmoonsoaring"}}, {"_id": "d9tLdBubpdgr8LLbt", "postedAt": "2015-01-15T22:07:43.681Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>I think people have misunderstood your point, Dale. I've read your comment a few times and it just seems like the standard “Don't let the haters get to you, bro” pat on the back from a friend. If anything, you were being overly positive (“be proud of who you are”, “the world is full of lovely, tolerant people”)!</p>\n<p>If I may give my take on your criticisms:</p>\n<ol>\n<li><p>Dale is implying that Jeff is doing something wrong (by writing this article or otherwise) by saying things like “don't let them bring you down to their level.”: How I interpreted this expression and his overall comment is that Dale isn't criticizing something Jeff did, but is encouraging him to transcend the negatively of others and not get sucked into it going forward.</p>\n</li>\n<li><p>Dale is criticizing people who fight for social justice: I'm extremely surprised to see people take this angle. “Social justice warrior” is a colloquial term about people who are not actually trying to better the world, but use social justice issues as an excuse to patronize and attack others to make themselves feel superior when in reality those people never did anything wrong. Similarly, the term “vegan police,” refers to those that relish making others feel inferior for not being vegan enough and does not in any way denounce people that are legitimately trying to protect animals. </p>\n</li>\n<li><p>Dale assumes that Jeff wrote the article because SJW's gave him problems: Yes, Dale explicitly states that he is making this assumption. So what? Even if the assumption is incorrect, I still think it's sweet of Dale for trying to be supportive of Jeff.</p>\n</li>\n</ol>\n<p>I think you wrote a very sympathetic and supportive comment, Dale. Misunderstanding are just too easy through writing. </p>\n", "parentCommentId": "wibZpQbQYtTDoG2SY", "user": {"username": "Austen_Forrester"}}, {"_id": "5XCmDRg5gxyTx63pw", "postedAt": "2015-01-16T00:20:35.444Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Surprising fact I recently learned: <a href=\"http://www.medscape.com/viewarticle/813896\">depressive disorders have the second-highest DALY burden according to the 2010 Global Burden of Disease study</a>.</p>\n", "parentCommentId": "be5P7jcajY7ZjF5m7", "user": {"username": "Ben_Kuhn"}}, {"_id": "7LF3sgaoddCWCij3o", "postedAt": "2015-01-16T02:19:03.250Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<blockquote>\n<p>They're are just disproportionately noticeable on the internet because of their hostility.</p>\n</blockquote>\n<p>It seems to me as though the internet <a href=\"http://www.smbc-comics.com/?id=2939\">makes</a> more hostile people more visible <a href=\"http://slatestarcodex.com/2014/12/17/the-toxoplasma-of-rage/\">in general</a>, regardless of their affiliation.</p>\n", "parentCommentId": "wibZpQbQYtTDoG2SY", "user": {"username": "John_Maxwell_IV"}}, {"_id": "gH9SPLdoZgr36sX4Z", "postedAt": "2015-01-16T02:38:07.209Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Additionally, we live in a time when we have particularly great influence over the long-term direction of humanity, which is another aspect of this important privilege.</p>\n", "parentCommentId": "3nw9hbyvjeqNeBTfH", "user": {"username": "redmoonsoaring"}}, {"_id": "QQyWJdu8nmAToPBsv", "postedAt": "2015-01-16T08:11:32.016Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<blockquote>\n<p>Scott describes himself in the post you link to as &quot;97% on board [with feminism]&quot;.</p>\n</blockquote>\n<p>A clarification.  The author of the post is Scott Alexander. The subject of the post is Scott Aaronson.  Alexander doesn't describe himself as 97% on board with feminism; Aaronson does.</p>\n", "parentCommentId": "t9A7sauSnrxN4y5gR", "user": {"username": "Pablo_Stafforini"}}, {"_id": "XsS5yNyTSYepZFsvW", "postedAt": "2015-01-16T09:33:46.658Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Sorry, you're right. I'd remembered Scott Alexander saying:</p>\n<blockquote>\n<p>I see a vision here of everybody, nerdy men, nerdy women, feminists, the media, whoever – cooperating to solve our mutual problems and treat each other with respect. Of course I am on board with this vision. As Scott Aaronson would put it, I am 97% on board.</p>\n</blockquote>\n<p>But the thing he's claiming to be 97% on board with isn't feminism. My bad.</p>\n", "parentCommentId": "QQyWJdu8nmAToPBsv", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "npYHHitX6cMFQCZDM", "postedAt": "2015-01-16T10:03:59.720Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>How interesting; the word 'privilege' has acquired such a new meaning from its associations with SJW and other, that it can be used twice and clearly have two separate meanings. Just shows how people hide their own connotations words!</p>\n", "parentCommentId": "vXxmSvztqZaGDEihQ", "user": {"username": "Ben Pace"}}, {"_id": "ZWYRxHvoktnXuTqfs", "postedAt": "2015-01-16T16:19:09.757Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Hi Austen,\nI support trying to make the most charitable reading possible of other's comments, particularly when we don't know each other well and misunderstanding is easy. However I don't think the evidence supports your narrow definition of the term 'social justice warrior'. I understand that some people define it this way, but it's use is definitely not limited to that narrow conception.\nFor example see the entry on wikipedia under 'social justice':</p>\n<p>&quot;The term &quot;social justice warrior&quot; has been used to describe people who work for social justice issues, often &quot;claiming a moral authority&quot; and &quot;questioning the motives and moral integrity of those they oppose&quot;. People given as examples of social justice warriors include Mahatma Gandhi and Reverend Martin Luther King, Jr..[43] In internet culture, the term has been used as a pejorative for someone advocating for social justice issues such as racism, sexism, or homophobia. Frequently initialized as &quot;SJW&quot;, it is used to accuse ideological opponents of sanctimony,[44] to insinuate pretense,[45][46] and as a general purpose negative.[47][48][49] Although most commonly used to cast negative implications, some have reappropriated the term as a neutral or positive source of identity.[50][51]</p>\n<p>Likewise, if you look at urban dictionary, the definition is strongly contested. The analogy to the phase 'politically correct' holds quite strong: its proponents might narrowly define it in to something most people would agree with (eg the reframing of language to avoid offence which ends up with people using unintelligible and unwieldy terms merely to demonstrate their credibility), but it's use is frequently pejorative and used to shut down criticism ('hey, it's just a joke, don't be so politically correct')</p>\n<p>I'd be happy to assume someone coming across the phrase for the first time might not be familiar with the way the term is actually used, but Dale implies that he is familiar with social justice dialogue, which is why I think it's fair to point out the problematic and exclusionary implications of it here. </p>\n", "parentCommentId": "d9tLdBubpdgr8LLbt", "user": {"username": "Bernadette_Young"}}, {"_id": "ohwtJcoPppXbTyQLn", "postedAt": "2015-01-16T20:18:31.073Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<blockquote>\n<p>I understand that some people define it this way, but it's use is definitely not limited to that narrow conception.</p>\n</blockquote>\n<p>Yep, different people can use the same term in different ways.  In this case, a charitable reading might take the focus off of the ambiguous term &quot;social justice warrior&quot; and look for other clues as to what Dale is trying to communicate: Dale refers to people who &quot;give you a lot of flak for your race, gender, career success&quot;, are &quot;hostile&quot;, and participate in &quot;tweetstorms of hate&quot;.  On the other hand, you are someone who advocates people &quot;not being dicks to each other&quot;, which sounds totally different (and you also seem to be doing a decent job of putting this ideal in to practice).  So I don't think you need to feel excluded by Dale's comment :)</p>\n", "parentCommentId": "ZWYRxHvoktnXuTqfs", "user": {"username": "John_Maxwell_IV"}}, {"_id": "RpXDXMBbQ9vK6Spri", "postedAt": "2015-01-17T16:27:48.613Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>If you don't like Dale's terminology, that's cool, but you're original comment suggested that Dale was advising Jeff to avoid anyone who advocates “not being dicks to each other.” I do not think that is accurate.</p>\n", "parentCommentId": "ZWYRxHvoktnXuTqfs", "user": {"username": "Austen_Forrester"}}, {"_id": "HgrtffTaJYcdw8Ycm", "postedAt": "2015-01-17T20:07:02.634Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>It isn't apparent to me that under your definition of privilege, [demographic] privilege is nearly as significant as many other unique experiences. And also, [demographic] privilege is often used as if everyone in the demographic has the same experience as the average. &quot;White privilege&quot; despite being born in a South African neighborhood where whites are ostracized, &quot;Male privilege&quot; despite being in a female-dominated field, &quot;First World Privilege&quot; despite being born into a situation devoid of growth opportunities, etc.</p>\n", "parentCommentId": "ZjDjxnfxYKjrWqDwx", "user": {"username": "Philip_W"}}, {"_id": "29FsHtC4gd7pwEyWR", "postedAt": "2015-01-17T23:34:19.801Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<blockquote>\n<p>it reads like an implied ad hominem attack on Jeff's argument</p>\n</blockquote>\n<p>I am genuinely bewildered and hurt you could come to this conclusion. According to <a href=\"https://en.wikipedia.org/wiki/Ad_hominem\">wikipedia</a></p>\n<blockquote>\n<blockquote>\n<p> ad hominem ... means responding to arguments by attacking a person's character</p>\n</blockquote>\n</blockquote>\n<p>yet I was complimentary and supportive to Jeff! I said he should be proud of who he was and what he did. I can hardly see how I could have been more positive - though apparently I was <a href=\"http://effective-altruism.com/ea/dx/the_privilege_of_earning_to_give/2cr\">already too positive</a> as well, so I guess I should give up trying to be nice and just stick to QALY calculations.</p>\n<p>And his conclusion is that he should Earn to Give - exactly what I spend 70 hours a week doing. So I'm not trying to sabotage his argument because I dislike the conclusion either. I think Earning to Give is great! So great that I don't think it requires any apology or defense. It is morally praiseworthy. </p>\n", "parentCommentId": "t9A7sauSnrxN4y5gR", "user": {"username": "Dale"}}, {"_id": "HCwcqdKppQNSLkNJc", "postedAt": "2015-01-17T23:38:33.788Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Thankyou.</p>\n", "parentCommentId": "d9tLdBubpdgr8LLbt", "user": {"username": "Dale"}}, {"_id": "Zp9Zs8pYtFKGT7A7B", "postedAt": "2015-01-18T00:07:48.592Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<blockquote>\n<p>this term seems to be used to dismiss wholesale people whose only distinguishing feature is advocating people not being dicks to each other</p>\n</blockquote>\n<p>If the only sense in which you're a SJW is that you think people should be nice to each other, then you're using the word differently from most people, and this does not apply to you - I'm not telling Jeff to avoid people who want to be nice!</p>\n<p>But the problem with this definition is it could describe almost any ideology! Marxists think they're 'advocating people not being dicks to each other' by ending exploitation. Libertarians think they're 'advocating people not being dicks to each other' by ending coercion. I think you're in danger of  committing the <a href=\"http://slatestarcodex.com/2014/07/07/social-justice-and-words-words-words/\">motte and bailey fallacy</a>. One thing that is reasonably distinctive about social justice warriors on the internet, on the other hand, is using language like 'privilege' to attack white male nerds. Just being concerned about social justice doesn't make you a SJW - I don't think many people would call the <a href=\"http://bleedingheartlibertarians.com/about-us/\">these academic philosophers</a> SJWs, for example. But I'm reasonably confident that as a </p>\n<ul>\n<li>white</li>\n<li>male</li>\n<li>programmer</li>\n<li>who lives in a Boston</li>\n<li>and spends time on the internet</li>\n<li>and is interested in social issues, politics etc.</li>\n<li>and makes decent money</li>\n</ul>\n<p>all of which are risk factors for SJW attention, Jeff will have received some such heated criticism. Furthermore, this is exactly the sort of article I would want to write as I was a generally liberal person who felt unfairly attacked by what I think of as 'my side' politically.</p>\n", "parentCommentId": "cnqG9HhpdJtpXgfzx", "user": {"username": "Dale"}}, {"_id": "7a5zQW4Ch9drBPQhu", "postedAt": "2015-01-18T13:03:05.671Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>I'm sorry, I didn't mean to imply anything about your motivations (and I expected they were good), and I should have said that explicitly. I'm also sorry I hurt you. :(</p>\n<p>I'll try to explain the way in which it read like an ad hominem attack (which is not to say that it was one, but an explanation of why it engendered some negative reactions). Jeff presented an argument. You responded, saying something which sounded close to &quot;I understand why you've written this post, but you can do better.&quot; While this is supportive at a surface level, it also sounds like perhaps Jeff doesn't really understand why he wrote the post, and if he did understand, maybe he wouldn't agree with it. That was the chain which led me to say it looked like an ad hominem (I'm not sure whether the term exactly fits, but I don't know a better one).</p>\n<p>Note that none of these negative things were implied by what you said -- it was all <a href=\"http://en.wikipedia.org/wiki/Implicature\">implicature</a>. Because you wrote a reasonably long response which gave an alternative explanation for Jeff's post while not engaging with the object-level content, a salient explanation was that you disagreed with the argument and were trying to put it down. I think if you'd cancelled the implicature by adding a statement like &quot;I agree with the argument&quot; or &quot;I'm sure this isn't the only reason you've written this&quot; then you would have got rather less negative responses.</p>\n<p>Sorry again for the confusion that comes in these online discussions.</p>\n", "parentCommentId": "29FsHtC4gd7pwEyWR", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "HAknPg8HWytDr9tNc", "postedAt": "2015-01-18T21:47:55.326Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Nice anti-apology, Owen. Since you are super-intelligent, you know the meaning of what people say even when they don't know themselves, right? You still maintain that Dale implicated Jeff did something wrong. If that were the case then whenever anyone says to his friend, “Don't let the haters you drag you to their level.” or “He ain't worth it.” he is in fact insulting his friend by implicating he has done something wrong. The response I see to this advice is usually “Thanks, man. You're a good friend.” Are all these people too stupid to know they are being insulted? Instead, the proper response to this common supportive advice should be “Stop insulting me by insinuating I did something wrong.” then?</p>\n<p>You state that because Dale wrote a possible explanation for Jeff's post without engaging the explicit statements Jeff made, he is showing his disapproval for Jeff's post. That is not logical. If Dale wanted to make a point, he would have made it. Don't put words in his mouth. If you told you're girlfriend you wanted to eat and she said, “Don't let yourself to hungry, now.” by your logic she is implicating that you did something wrong by allowing yourself to become hungry. Or if I told my friend, “I really want to go out tonight.” and he said, “I hear you. Not good to stay in all the time.”, he is implicating that I am doing something wrong by staying home too much? In both these example, as in Dale's reply to Jeff, they are being sympathetic, not disapproving in any way. Don't pass off your lack of understanding people as ignorance in someone else. </p>\n", "parentCommentId": "7a5zQW4Ch9drBPQhu", "user": {"username": "Austen_Forrester"}}, {"_id": "daZFebomn4C6HByvD", "postedAt": "2015-01-19T08:55:10.036Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Hi Austen,</p>\n<p>I was trying to draw a distinction between what Dale meant when writing it (which I don't claim any problem with), and what people reading it might think was meant. Given that I wasn't the only person who thought that the comment read problematically, it wasn't just my failure to interpret: there was something suggestive in the wording. I was trying to explain what that feature of the wording was, as well as how it might be avoided by adding an extra statement that Dale agrees with.</p>\n", "parentCommentId": "HAknPg8HWytDr9tNc", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "8Jm84dxWxGN6Ybtmw", "postedAt": "2015-01-21T10:53:30.287Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<blockquote>\n<p>then you're using the word differently from most people, and this does not apply to you</p>\n</blockquote>\n<p>This is indeed how the phrase has been used in my experience (see [this comment][<a href=\"http://effective-altruism.com/ea/dx/the_privilege_of_earning_to_give/2d4]\">http://effective-altruism.com/ea/dx/the_privilege_of_earning_to_give/2d4]</a> for reference)</p>\n<blockquote>\n<p>I think you're in danger of committing the motte and bailey fallacy. </p>\n</blockquote>\n<p>Actually my problem with the term 'Social Justice Warrior', and my reason for commenting in the first place, is precisely that. You give one definition of the phrase that might be perfectly defensible, but the way it is actually used (in general, not only in your post) smuggles in extra meaning which can be dismissive or silencing. You may not intend that other meaning at all, but it's out there in common use, so we don't get to just ignore it.</p>\n<p>That extra meaning is smuggled in very easily. For example, in your own comment, you include a sentence which implies (as I understand it) that people on the internet are not genuine when they comment on issues of equality if they don't 'spend all their time campaigning about Rotherham or ISIS'. That strikes me as massively unfair. Like you, I work long hours earning to give and support SCI, partly because I think the best way to help marginalised groups is to fight poverty. (I do actually think we're on the same side). But I don't think that means I have to give up the right to express an opinion about how gender affects me systematically, or that I'm let off the hook for understanding how inequality affects other people in the world I inhabit. The term privilege is useful in such conversations, as Jeff has eloquently explained here.</p>\n<p>And yes, I do so on the internet (where lots of conversation happens), and I may be conversing with (or even criticise) a white man (since I know lots). It really isn't taking a leap to feel that your term and broad dismissal apply to me, even when you didn't intend it that way. </p>\n<p>Finally I am sorry, because I get the feeling you feel a bit piled on after writing a comment that was intended to support an ally. I can understand that, and I'm sorry for contributing to that feeling. I think we share the goal of this being a supportive community. To that end I hope I've been able to explain why other people who are part of this community might reasonably be alienated by the way you expressed your support. If I've failed, then I guess it's best to leave the conversation here. </p>\n", "parentCommentId": "Zp9Zs8pYtFKGT7A7B", "user": {"username": "Bernadette_Young"}}, {"_id": "8NkdpoRofMSuiDTRA", "postedAt": "2015-01-30T09:28:55.560Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Hi Jeff.</p>\n<p>You say that &quot;the best response to privilege is to turn it to fixing the situation that led you to having these major advantages over others&quot;. I'm not entirely comfortable with this wording. For example, one way of &quot;fixing the situation&quot; would be removing your advantages without increasing other people's advantages.</p>\n<p>In other words, our goal should be making the world better for everyone, not only and not even primarily making the world <em>equally</em> good for everyone.</p>\n", "parentCommentId": null, "user": {"username": "Squark"}}, {"_id": "2egxzZW7TcyvEWTmS", "postedAt": "2015-01-30T09:34:49.491Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Hi AGB.</p>\n<p>IMO saying that mathematical talent is an &quot;unearned advantage&quot; is running the risk of making the concept meaningless. What is an &quot;earned advantage&quot;? Each of us is the sum total of our genes and our formative experiences i.e. things that lie beyond our control. So, taking the idea to the extreme, people deserve neither positive nor negative credit for <em>anything</em>.</p>\n", "parentCommentId": "ey8XdZXxLdNuxyza5", "user": {"username": "Squark"}}, {"_id": "4LPtAEQZhB2mZNwnr", "postedAt": "2015-01-31T18:21:37.073Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Great post Jeff</p>", "parentCommentId": "be5P7jcajY7ZjF5m7", "user": {"username": "agdfoster"}}, {"_id": "hNejRepXd2zrp4tvg", "postedAt": "2015-01-31T21:19:58.938Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>The wording there is also more deontological than I'm happy with, but I do want to try to find phrasing that resonates for more justice-oriented people.  Any ideas for better ways of phrasing this?</p>\n", "parentCommentId": "8NkdpoRofMSuiDTRA", "user": {"username": "Jeff_Kaufman"}}, {"_id": "MAiNkdb6rKxWNLMYA", "postedAt": "2015-01-31T22:26:58.132Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Yes exactly - the classic reductio is that if you're concerned about inequality, that would best be solved with genocide and thermonuclear war.</p>\n", "parentCommentId": "8NkdpoRofMSuiDTRA", "user": {"username": "Larks"}}, {"_id": "NxHEgq89rnQhvPvQj", "postedAt": "2015-02-01T19:02:48.689Z", "postId": "DYr7kBpMpmbygBiEq", "htmlBody": "<p>Well, the problem with optimizing for a specific target audience is the risk to put off other audiences. I would say something like:</p>\n<p>Being born with advantages isn't something to feel guilty about. Being born with advantages is something to be glad about: it gives you that much more power to improve life for everyone.</p>\n", "parentCommentId": "hNejRepXd2zrp4tvg", "user": {"username": "Squark"}}]