[{"_id": "9wuoYiybYBqSNoycg", "postedAt": "2024-01-15T20:52:37.611Z", "postId": "Dytsn9dDuwadFZXwq", "htmlBody": "<p>(If a question like this already exists, please link it here, I am still unfamiliar with how the forum flows haha :)</p>", "parentCommentId": null, "user": {"username": "Gianyrox"}}, {"_id": "iBFu59SoKPsZoeogP", "postedAt": "2024-01-29T11:56:47.270Z", "postId": "Dytsn9dDuwadFZXwq", "htmlBody": "<p>1. <strong>Get a pilot up and running NOW</strong>, even if it's <i>extremely </i>small.&nbsp;<br><br>You will cringe at this suggestion, and think that it's impossible to test your vision without a budget. Everyone does this at first, before realizing that it's extremely difficult to stand out from the crowd without one. For you, maybe this is a single class delivered in a communal area. 30 students attending regularly, demonstrating a good rate of progress, is a really compelling piece of evidence that you can run a school.&nbsp;<br><br>- Do you have the resilience and organisation skills it takes to independently run a project?<br>- Will people actually use it?<br>- Can you keep your staff?<br>- Can you cost-effectively produce results?&nbsp;<br><br>It can compelling prove the above, whilst having a ton of other benefits.<br><br><strong>2. YOU need to be talking to funders NOW</strong></p><p>Don't fall into the trap of trying to read their minds. Get conversations with them. Get their take on your idea. Ask what their biggest concerns would be. Go address them. Repeat. Build relationships with them and get feedback on your grant proposals before submitting them.</p><p>As the founder, its YOUR job to raise money. Don't delegate it. It'll take forever to get them to understand your organisation well enough, they won't be as sufficiently motivated to perform, and you won't learn. This is going to be a long-term battle that you face every year. You need to build the network, skills &amp; knowledge to do it well.&nbsp;</p><p><strong>3. Be lean AF</strong></p><p>The best way to have money is not to spend it. Both you and your charity may go without funding for months or years. Spend what little money you have, as a person and as a charity, very slowly. The longer you've been <i>actively serving users</i><strong>,</strong> the easier fundraising gets. It's about surviving until that point.<br><br><strong>4. Funders will stalk your website, LinkedIn, and social media if they can</strong></p><p>As much as possible, make sure that they all tell the same story as your grant application - especially the facts and figures.&nbsp;<br><br><strong>5. When writing your proposals, focus on clarity and concreteness above all else</strong></p><p>Bear the curse-of-knowledge in mind when writing. Never submit anything without first verifying other people can understand it clearly. Write as though you're trying to inform, not persuade.&nbsp;</p><p>- Avoid abstractions&nbsp;<br>- State exact values (\"few\" -&gt; \"four\", \"lots\" -&gt; \"nine\", \"soon\" -&gt; \"by the 15th March 2024\")<br>- Avoid adjectives and qualifiers. Nobody cares about your opinions.<br>- Use language that paints a clear, unambiguous image to the readers mind<br><br>OLD: &nbsp;mean student satisfaction ratings have increased greatly increased since programs began and we believe it's quite reasonable to extrapolate due to our other student-engagement enhancements underway and thus forecast an even greater increase by the end of the year\"&nbsp;<br><br>NEW: When students were asked to rate their lessons out of 10, the average response was 5. Now, just three months later, the average is 7/10. Our goal is to hit 9/10 by 2025 by [X,Y,Z].<br><br><br>Good luck!</p>", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "mby4i3CEE4P2nqCQv", "postedAt": "2024-01-30T04:58:12.192Z", "postId": "Dytsn9dDuwadFZXwq", "htmlBody": "<p>Do you mind if I ask why you decided to run this particular program, in this particular location?</p>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}]