[{"_id": "GC7gHXPgh3bGAEf8f", "postedAt": "2023-03-06T12:25:19.572Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>This is absolutely beautiful and made me tear. I am so sorry that Alexa is no longer here, but so glad that she spent her time on this planet exuding such infinite compassion. She sounds like a truly remarkable human. &nbsp;</p><p>Grief is so hard. Thanks for this.</p>", "parentCommentId": null, "user": {"username": "more better "}}, {"_id": "WibDvfx26ywXH2qpq", "postedAt": "2023-03-06T19:09:36.324Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>Reading this I can't help but think that we are all capable of so much more, of being so much more empathetic, and of building a much better world in which lives lived like Alexa's are not so anomalous.&nbsp;</p><p>I can only imagine how difficult it has been to grieve such a person and I am profoundly grateful that you have chosen to write this, so thank you. You've ensured that their kindness and care for others will outlive them through those who, like me, have been inspired by their story.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ben Chancey"}}, {"_id": "k8MPPw9NjQDm2czpB", "postedAt": "2023-03-06T20:08:51.154Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>Thank you so much for sharing this poetic dedication to your friend. I sadly never had the pleasure of meeting Alexa. I now wish I had. But I can tell from this heartfelt post and the website linked that they were a bright light in the dark and vast sea that the world can sometimes feel like. I love the stories you shared. Simple acts of kindness and empathy that reverberate through space and time and impact humans and non-human animals alike. No doubt that there are so many beings that will remember Alexa and their impact.&nbsp;</p><p>Oddly, I'm reminded of a lyric from one of my favorite albums of the last few years:<br><br>\"Afraid of the empty/but too safe on the shore\"<br><br>As someone who is around Alexa's age, I often feel too safe on the shore. Never fully being the kind of person that I should be. Sticking with what's familiar and comfortable. I hate to say it, but I've been the person who has walked past the unconscious man lying on the payment. I'm terrified of the empty. I've been cowardly.&nbsp;</p><p>Alexa seemed like the kind of person who went out into the empty, the vast sea, with a smile and big heart. And who wasn't afraid to be the kind of person that most of us will spend our entire lives trying to become (and may never reach).&nbsp;</p><p>Their story has affected me deeply. I look forward to processing Alexa's stories, and how they can inspire me and many others to be a little braver in the face of the open ocean of life and its challenges, and how we can do that with a little more empathy, gentleness, and compassion.</p><p>I'm so sorry for the loss of your dear friend.</p>", "parentCommentId": null, "user": {"username": "GreenByrdhouse"}}, {"_id": "G7BZan6AtQhenJFvz", "postedAt": "2023-03-06T20:38:48.184Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>Thanks for writing this beautiful tribute. I didn’t know Alexa, but am inspired by them. It is hard to look clear-eyed at the sheer amount of suffering and cruelty in this world without shifting into calculus (i.e., only pursuing cost-effective solutions) or complacency. It sounds like Alexa was steadfast in their compassion, taking seriously the moral worth of each creature, and doing everything in their power to give them better lives. The world is a better place for them having been here, and I am so sorry they are gone.</p>\n", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "ZyRewZweEJqdLpqcN", "postedAt": "2023-03-07T07:03:46.992Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>Damn, Alexa sounds like an incredible person. I'm so sorry for your loss. Thank you for sharing more of her with us.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "jcWo3tbvRSrJKiNv3", "postedAt": "2023-03-07T19:12:12.073Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>This was a beautiful remembering, thank you for sharing it. Often how I want to grieve people is just to remember them in detail, saying: <em>they were here, not like anyone else, but specifically <strong>this</strong> is the way they were; I remember, and I wish they were still in the world</em>. This post felt like that sort of grief.</p>\n<p>This is my favourite poem about grief, which I often return to when grieving the people I've lost (most especially my partner <a href=\"https://tessa.fyi/zachary-jacobi/\">Zach</a>):</p>\n<p>I am not resigned to the shutting away of loving hearts in the hard ground.<br>\nSo it is, and so it will be, for so it has been, time out of mind:<br>\nInto the darkness they go, the wise and the lovely.  Crowned<br>\nWith lilies and with laurel they go; but I am not resigned.</p>\n<p>Lovers and thinkers, into the earth with you.<br>\nBe one with the dull, the indiscriminate dust.<br>\nA fragment of what you felt, of what you knew,<br>\nA formula, a phrase remains,—but the best is lost.</p>\n<p>The answers quick and keen, the honest look, the laughter, the love,—<br>\nThey are gone.  They are gone to feed the roses.  Elegant and curled<br>\nIs the blossom.  Fragrant is the blossom.  I know.  But I do not approve.<br>\nMore precious was the light in your eyes than all the roses in the world.</p>\n<p>Down, down, down into the darkness of the grave<br>\nGently they go, the beautiful, the tender, the kind;<br>\nQuietly they go, the intelligent, the witty, the brave.<br>\nI know.  But I do not approve.  And I am not resigned.</p>\n<p>― <strong>Dirge Without Music</strong> ,  <em>Edna St. Vincent Millay</em></p>\n", "parentCommentId": null, "user": {"username": "tessa"}}, {"_id": "oMzo9DoLprDHw3thc", "postedAt": "2023-03-07T20:17:27.469Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>What incredible altruism, despite the very difficult circumstances. They are truly a hero.</p><p>I teared up when I read this initially, and when I reread it. &nbsp;Thank you so much for sharing.</p>", "parentCommentId": null, "user": {"username": "Max_Carpendale"}}, {"_id": "biNcxhuZAweuC4qjj", "postedAt": "2023-03-07T21:28:27.392Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>Another poem about loss that moves me, this one specifically about grieving a dear friend:</p>\n<p>It's what others do, not us, die, even the closest<br>\non a vainglorious, glorious morning, as the song goes,<br>\nthe yellow or golden palms glorious and all the rest<br>\na sparkling splendour, die. They're practising calypsos,<br>\nthey're putting up and pulling down tents, vendors are slicing<br>\nthe heads of coconuts around the Savannah, men<br>\nare leaning on, then leaping into pirogues, a moon will be rising<br>\ntonight in the same place over Morne Coco, then<br>\nthe full grief will hit me and my heart will toss<br>\nlike a horse's head or a threshing bamboo grove<br>\nthat even you could be part of the increasing loss<br>\nthat is the daily dial of the revolving shade. Love<br>\nlies underneath it all though, the more surprising<br>\nthe death, the deeper the love, the tougher the life.<br>\nThe pain is over, feathers close your eyelids, Oliver.<br>\nWhat a happy friend and what a fine wife!<br>\nYour death is like our friendship beginning over.</p>\n<p>― <strong>for Oliver Jackman</strong>,  <em>Derek Walcott</em></p>\n", "parentCommentId": "jcWo3tbvRSrJKiNv3", "user": {"username": "tessa"}}, {"_id": "hFGzEMnvEf4sD8RH3", "postedAt": "2023-03-14T08:36:13.805Z", "postId": "DztcCwrAGo6gzCp3o", "htmlBody": "<p>Thanks for this. It is saddening and uplifting to read at the same time.</p>\n", "parentCommentId": null, "user": {"username": "DLMRBN"}}]