[{"_id": "TzGc932CQsj6hMGtr", "postedAt": "2023-01-05T06:27:50.074Z", "postId": "E3BYgAmCEpNGYdFn5", "htmlBody": "<p>Hi!<br><br>Just saw this on my feed. I'm not sure if you've already read this, but the book <i>Does Altruism Exist? by David Sloan Wilson</i> is about this exact premise: altruistic/pro-social behaviours and the conditions under which it comprises a successful evolutionary strategy, both for individuals and groups. It's written by a biologist, so I think you might find some use out of it!<br><br>Personally, I like the book and I think EAs would find it interesting. Effective Altruism has a ton of research examining the <i>Effective</i> part, but far less on the <i>Altruism</i> part. The book rigorously defines definitions such as altruism, and examines the contexts under which altruistic individuals and groups can thrive, as well as the risks that could undermine such behaviours.</p>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "cQQsCa87vrPqMvniP", "postedAt": "2023-01-05T08:19:52.926Z", "postId": "E3BYgAmCEpNGYdFn5", "htmlBody": "<p>If I understand you:</p>\n<p>Survival (resilience) traits and sexual attractiveness (well-being) traits diverge.\nEither can lead to reproduction.\nSelection for resilience inhibits well-being.\nMore selection for well-being  implies less selection for resilience.\nReproduction implies selection for resilience or well-being but not both.</p>\n<p>There's some argument about specific examples available <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4074220/#\">like attractiveness of peacocks</a>:</p>\n<blockquote>\n<p>Surprisingly, we found that peahens selectively attend to only a fraction of this display, mainly gazing at the lower portions of the male train and only rarely at the upper portions, head or crest.\n...\nThese results suggest that when the lower train of the peacock is not visible, peahens direct more attention toward the upper train and use it as a long-distance attraction signal to help locate mates for close inspection.</p>\n</blockquote>\n<p>There's also some evidence that the <a href=\"https://www.science.org/content/article/peacocks-need-not-sacrifice-flying-skills-sexiness\">peacock plumage does not affect flying to escape predators</a>:</p>\n<blockquote>\n<p>After analyzing the video, they found that there was no statistically significant difference in flight performance of peacocks with intact tail feathers and those without, they report online today in The Journal of Experimental Biology. This research complicates the common assumption in evolutionary biology that elaborate sexual ornaments must come at a cost to the animal. But although peacocks' elaborate feather trains don't impede speedy takeoffs, the researchers note that they may pose other burdens to the birds, such as compromising their flight control, stability, and ground running performance.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "EpPTMBkd6zZR47jHx", "postedAt": "2023-01-05T19:39:36.400Z", "postId": "E3BYgAmCEpNGYdFn5", "htmlBody": "<p>I think you got it if you meant that either resilience or well-being could lead to the selection, and it's well-being that amplifies reproduction. Thank you for the feedbacks</p>", "parentCommentId": "cQQsCa87vrPqMvniP", "user": {"username": "Sherry "}}]