[{"_id": "sXDN5JH8aKiQqanBF", "postedAt": "2015-03-18T14:43:02.005Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Thanks, this is really interesting!</p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "b2Z5Er8oZdeg79izf", "postedAt": "2015-03-18T17:48:52.807Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>_In which I do my best attempt at <a href=\"http://effective-altruism.com/ea/7x/supportive_scepticism/\">supportive skepticism</a>:_</p>\n<p>First, thanks very much for publishing this!  I really appreciate the transparency and I think the entire EA community can learn from the efforts here.</p>\n<p>Second, it's awesome that we're aiming to get a higher profile to EA and introduce it to more people.  Introducing things through the media does seem to be quite high value to me, and I think we should keep on doing it.</p>\n<p>Third, I think the &quot;experimental&quot; approach is right-on and your initial skepticism of the absolute impact of media and differential relative impacts of different media are smart.  And it's definitely true that it's exceptionally hard to get good data here.  Media causality is a really tough challenge.  Hence the old quote &quot;I know half of my advertisements are worthless, I just don't know which half&quot;.</p>\n<p>And fourth, wow for getting such a widely shared article!</p>\n<p>-</p>\n<blockquote>\n<p>From their [GiveWell] 2013 metrics data, $3mn was moved via small donors (less than $10k) in 2013. On average, 14% of donors came via online referral; assuming that this is representative for small donors that would give $420,000 via online referral. There were 151,000 visitors via referral links, giving a money moved per visitor figure of $2.78.  Using this number, the Quartz article would have moved $27,800 (not including regular giving beyond a year). This was quickly estimated, and there may well be errors in this assessment, and still seems somewhat too high to me. We could therefore give cautious bounds of between $5,000 and $50,000 moved as a result of the article.*</p>\n</blockquote>\n<p>First, I find it hard to believe that $2.78 is really generated via online referral; I imagine some data integrity problems or sampling problems are leading to a large skew.  I expect the marginal value of an additional unique visit to GiveWell is much less than $2.78.</p>\n<p>Additionally, relevant to writing articles, I expect there to be large differences in the relative values of different kinds of online referrals.  For example, it seems quite plausible to me that someone coming to GiveWell from a piece about how awesome GiveWell is versus someone coming to GiveWell from a piece about how much the ice bucket challenge sucks will become donors at much different rates and donate different amounts.</p>\n<p>-</p>\n<blockquote>\n<p>Soon after the article, we received 3 pledges and 8 try out givers who cited ‘on-line article’. We’ll follow up with these people, but it’s likely that not all were influenced by the Quartz article, rather than some other online article.</p>\n</blockquote>\n<p>That's awesome - would be great to hear how the follow up goes and if they were truly inspired by the article.</p>\n<p>-</p>\n<blockquote>\n<p>If we assume 3 pledges only, the article raised approximately $1 million in pledged donations.</p>\n</blockquote>\n<p>I expect successful, long-term pledges are made by people who have multiple points of contact, of which the article is just one.  Additionally, I also suspect that people coming to GWWC and pledging based mostly on an article are going to be lower-quality pledges in terms of the amount that is actually donated.  Following these pledges (and all pledges) looking for differences in pledge quality would be very neat, but would probably require 3+ years of data, which would take time.</p>\n<p>-</p>\n<blockquote>\n<p>In the interview with Tim Harford, Elie and Niel discussed SCI, and Tim Hartford decided to donate there at the end of the show.  After the appearances, SCI contacted us to report that they had received several £1000s of donations as a result of our media.  The exact amount SCI received as a result of this media attention was difficult for them to estimate relative to the variable background rate, but they suggested it may have been as much as £10,000.  </p>\n</blockquote>\n<p>That's pretty awesome.  How does SCI estimate that?  It does seem pretty difficult to me.</p>\n<p>-</p>\n<blockquote>\n<p>However, my guess is that the main benefit of media attention is longer-term: leading to further media opportunities in the future; improving my position as a public advocate of effective altruism; increasing the real-world credibility of the effective altruism movement; generating connections with people who we wouldn’t otherwise have met; and, most importantly, learning via practical experience of engaging in the media.</p>\n</blockquote>\n<p>This seems quite plausible to me as well.</p>\n<p>-</p>\n<blockquote>\n<p>Moreover, I have a distinct worry that what I call poor quality was a positive factor, in terms of the article’s popularity.</p>\n</blockquote>\n<p>I have this worry as well.  But it's also possible that while higher-quality articles get lower viewership, they may get higher-quality viewership in terms of increased response and conversion rates from the viewers that are attracted.</p>\n<p>-</p>\n<blockquote>\n<p>This could be investigated further by, for example, looking at popular writers, and seeing how the quality of their most popular writing compares to the quality of their less popular writing.</p>\n</blockquote>\n<p>That would be cool!</p>\n<p>-</p>\n<blockquote>\n<p>It’s very difficult to assess how valuable the article was, and whether it was positive or negative in value. </p>\n</blockquote>\n<p>This is very true.  Part of the inherent difficulties of doing cost-effectiveness for outreach; especially media outreach.</p>\n<p>-</p>\n<blockquote>\n<p>In the coming months I will experiment by with writing longer and comparatively more rigorous articles on carefully chosen topics. </p>\n</blockquote>\n<p>I look forward to seeing them!</p>\n<p>-</p>\n<blockquote>\n<ul>\n<li>Given that the money moved per visitor figure may be as high as $2.78, and may be even higher, it seems worthwhile to experiment with paying for ads to GiveWell’s site, to see if one can achieve a better than 1:1 return on expenditure.</li>\n</ul>\n</blockquote>\n<p>Doesn't GiveWell already run a lot of Google Adwords?  How well do those do?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "NRTLNfN2893mxyeFa", "postedAt": "2015-03-18T19:36:21.301Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Well done on the popular article. I think it was popular because you passionately told people what they wanted to hear - that the ice bucket challenge wasn't so great as it appeared to be. Historically, most great popular political writers seem to incite outrage at percieved hypocrisy or injustice. Hitchens and Orwell are example. Halfway in-between you and popular political writers would be Scott, who on my theory would be the best person to emulate in order to attract better readership.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "jBAnBYeHKFkPXZWMi", "postedAt": "2015-03-19T02:12:43.876Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Reflections like this unravel truisms like &quot;all press is good press&quot;, and &quot;no news is good news&quot;, to &quot;the quality of news depends on one's goals, and has many correlations which must be separated into noisy consequences and signals of genuine value&quot;. I'm a bit nonplussed by how &quot;a small number of data points&quot; in this case equaled only <em>one</em> data point, but I'm impressed with how much you produced via reflection. I enjoyed this post, and I'm pleased with the level of learning and humility Dr. MacAskill and co. show. Thanks for writing this.</p>\n<blockquote>\n<p>Brand-management is going to be very difficult, because it’s so difficult to predict what will go viral, difficult to predict how people will react, and very difficult to judge what the appropriate level of controversiality is.</p>\n</blockquote>\n<p>I've got some concerns about how &quot;brand management&quot; might be a shiny veneer to cover &quot;centralization&quot; from Oxford or the Bay Area, and what the consequences of it may be. These concerns aren't about projects in Oxford, per se, but about some aspects of Effective Altruism Outreach. I'll save most of them for a later post on the subject broadly. My question now is: how much will EA Outreach focus upon centralizing and narrowing who shares information, and to what extent will you make attempts at tamping down other voices in the movement in terms of &quot;damage control&quot;.</p>\n<p>I'm worried EA Outreach will create an appearance of a lack of diversity and peer-review within the movement, the false conception newcomers aren't explicitly welcomed to intellectually engage existing ideas, or the Centre for Effective Altruism will become a bottleneck which cannot handle all the attention it may soon receive.</p>\n<p>On the other hand, I think these concerns might be overblown. Also, I'm aware other social movements have been more centralized and not necessarily spontaneously &quot;grass-roots&quot;. In leading the civil rights movement, Martin Luther King, Jr. and his peers had strategies for non-violent resistance and direct action. Representations of history in popular media seem to gloss over this. So, I understand the need for a community to reach an accord on &quot;brand management&quot;, and public perception, with its &quot;thought leaders&quot;, for lack of a better term. </p>\n<p>I think it would be best if Effective Altruism Outreach prepared to begin a dialogue with others in the movement, perhaps on a forum, perhaps with bloggers or writers or vocal members of the movement they already expect to share their own perspectives on publications from within effective altruism. I think it should take place in a way in which it's made clear attempts to restrict or censor will not be made, but EAO sincerely wants to work as peers with others to think about positive or negative consequences of how communication happens.</p>\n<p>Do you have any perspective on what or how the rest of us can do to help and not hinder the growth of effective altruism, in a way that both allows us to remain independent voices, without watering down the core strength and mission of effective altruism?</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "HxW5YfGdbq9angjoE", "postedAt": "2015-03-19T06:17:57.734Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Does anyone have any thoughts on how much we should value leading other people to donate? I mean this in a very narrow sense, and my thoughts on this topic are quite muddled, so I'll try to illustrate what I mean with a simplified example. I apologize if my confusion ends up making my writing unclear.</p>\n<p>If I talk with a close friend of mine about EA for a bit, and she donates $100 to, say, GiveWell, and then she disengages from EA for the rest of her life, how much should I value her donation to GiveWell? In this scenario, it seems like I've put some time and effort into getting my friend to donate, and she presumably wouldn't have donated $100 if I hadn't chatted with her, so it feels like maybe I did a few dollars worth of good by chatting with her. At the same time, she's the one who donated the money, so it feels like she should get credit for all of the good that was done because of her donation. But wait-- if I did a few dollars of good, then does that mean that she did less than $100 worth of good?</p>\n<p>At this point, my moral intuitions on this issue are all over the place. I guess that positing that the story above actually has a problem implies that the sum of good done by my friend and I should sum to $100, but the only reason I've tacitly assumed that to be true is because it intuitively feels true. I previously wrote a <a href=\"http://lesswrong.com/lw/lb1/when_should_an_effective_altruist_be_vegetarian/bnlo\">comment</a> on LessWrong on this topic that wasn't any clearer than this comment, and <a href=\"http://lesswrong.com/lw/lb1/when_should_an_effective_altruist_be_vegetarian/bnz7\">this response</a> was quite clear, but I'm still confused.</p>\n", "parentCommentId": null, "user": {"username": "Fluttershy"}}, {"_id": "GqBCGhTecKyn7BRR7", "postedAt": "2015-03-19T09:48:24.829Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>I've thought a bit about this in the past. It's a complicated issue because it mixes what's already a philosophically awkward point, with significant uncertainty. I'll see if I can get somewhere with untangling it:</p>\n<p>First, it may be helpful to remember that the real question is &quot;what actions should I take?&quot;, not &quot;how good was this thing I did?&quot;. Expectation of how good the different actions is helpful in choosing what to do, of course.</p>\n<p>If you knew precisely the counterfactual that would apply absent your action (and it's that she would never have made that donation and lived an otherwise similar life), it would be correct to say that you'd done $100 worth of good. Likewise from her perspective if she knew the precise counterfactuals attaching to her donation, it would be correct to say she'd done $100 of good. These numbers don't need to add up to $100; Parfit has a lengthier explanation in <em>Five mistakes in moral mathematics</em>.</p>\n<p>However, in practical terms we aren't that close to precise knowledge of the counterfactuals. Even in theory it's not clear that we <em>could</em> all be, when there are other agents involved. If you model everyone as agents trying to be credited with good for their deeds, then cooperative game theory can give you some tools for assigning credit -- and it will add up to $100. But this doesn't seem quite right as a model either, since it wasn't clear your friend was even playing this game (it may be a better model for splitting credit among EAs).</p>\n<p>There are some other advantages of assuming as a heuristic that the credit has to add up to $100. It's relatively easy to apply, and it's fairly robust -- it's harder for a group of people to get confused and collectively do something that's a big mistake. Particularly because there are so many uncertainties when we try to guess counterfactuals, we want to judge on expectations, and the cap is a method of keeping our expectations more anchored to reality.</p>\n", "parentCommentId": "HxW5YfGdbq9angjoE", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "2HYowdiJMGGE8oWoC", "postedAt": "2015-03-19T16:24:45.065Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Thanks for these comments Peter.  I think I agree with most of them.  To respond specifically to the one I have additional information about: </p>\n<blockquote>\n<blockquote>\n<p>In the interview with Tim Harford, Elie and Niel discussed SCI, and Tim Hartford decided to donate there at the end of the show. After the appearances, SCI contacted us to report that they had received several £1000s of donations as a result of our media. The exact amount SCI received as a result of this media attention was difficult for them to estimate relative to the variable background rate, but they suggested it may have been as much as £10,000.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>That's pretty awesome. How does SCI estimate that? It does seem pretty difficult to me.</p>\n</blockquote>\n<p>If I understood Alix at SCI correctly the rate of online donations in the few days after the show and associated article was many times higher than usual (perhaps even more than an order of magnitude higher - I can't remember exactly), and so they were estimating the difference between the increased rate and the background rate.  This assumes that the spike and the additional donations were due to the media attention, which may well be a false assumption, but given the immediacy of the spike in donations, the scale of the spike, the prominence of the media attention, and the prominence of SCI in the media attention, I am inclined to think that most of the spike was probably down to the media attention.  One other thing to note is that if I understand correctly this figure only includes donations direct to SCI, and does not include any donations made to SCI via GiveWell, who were also featured prominently in the media attention.  Nonetheless I agree that it is difficult to estimate exactly how much additional donations went to SCI.  </p>\n", "parentCommentId": "b2Z5Er8oZdeg79izf", "user": {"username": "Niel_Bowerman"}}, {"_id": "bcZMfeSTPqn7qt9Yu", "postedAt": "2015-03-19T17:06:56.735Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<blockquote>\n<p>After the appearances, SCI contacted us to report that they had received several £1000s of donations as a result of our media. The exact amount SCI received as a result of this media attention was difficult for them to estimate relative to the variable background rate, but they suggested it may have been as much as £10,000.</p>\n</blockquote>\n<p>I've heard that SCI are consistently over-generous in attributing donations to particular organisations' influence, because they want their support and recommendations - e.g. attributing all donations in one of Australia and the UK to GWWC. </p>\n", "parentCommentId": "b2Z5Er8oZdeg79izf", "user": {"username": "jayd"}}, {"_id": "Hosqtc3bRYs2rdreA", "postedAt": "2015-03-19T17:07:35.516Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<blockquote>\n<p>Doesn't GiveWell already run a lot of Google Adwords? How well do those do?</p>\n</blockquote>\n<p>Valuable to find out. Does anyone here know them well enough to ask? Or is it on their site?</p>\n", "parentCommentId": "b2Z5Er8oZdeg79izf", "user": {"username": "jayd"}}, {"_id": "9aCx2fHqTaYe3kaa9", "postedAt": "2015-03-19T18:59:22.661Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<blockquote>\n<p>I've got some concerns about how &quot;brand management&quot; might be a shiny veneer to cover &quot;centralization&quot; from Oxford or the Bay Area, and what the consequences of it may be.</p>\n</blockquote>\n<p>That would explain how concerned people mostly come from these places, and why they have unusually high concern for a social movement.</p>\n", "parentCommentId": "jBAnBYeHKFkPXZWMi", "user": {"username": "impala"}}, {"_id": "ncwNZQn6WLArBM5x6", "postedAt": "2015-03-20T01:44:28.225Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>I think you should change the title of this post to something like:</p>\n<blockquote>\n<p>You won't believe how this Oxford Professor hijacked a charity movement. ALS sufferers hate him!</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "5XhmwWo2jssg6Hh3y", "postedAt": "2015-03-23T14:00:00.921Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Hi Peter, thanks for the great comments!</p>\n<blockquote>\n<p>First, I find it hard to believe that $2.78 is really generated via online referral; I imagine some &gt;data integrity problems or sampling problems are leading to a large skew. I expect the &gt;marginal value of an additional unique visit to GiveWell is much less than $2.78.</p>\n</blockquote>\n<p>That sounds plausible to me too. Insofar as I'm ultimately concluding that this sort of media courting <em>isn't</em> justified by the short-run impact, then using an optimistic figure for impact-per-clickthrough is the conservative assumption. Would still be useful to get into this more if someone wants to run an 'on-line advertising to GiveWell' project (which is something I'd love to see come out of .impact or EA Ventures - it's an idea that's been floated for quite a while).</p>\n<blockquote>\n<p>Additionally, I also suspect that people coming to GWWC and pledging based mostly on an &gt;article are going to be lower-quality pledges in terms of the amount that is actually donated.</p>\n</blockquote>\n<p>Yes, my anecdotal view from previous media rounds was that people who saw GWWC online and immediately joined were a) giving a lot more anyway; b) giving to what are probably less effective organisations. HOWEVER, there are two big aspects of GWWC-related impact from media that are neglected by focusing on immediate member growth: 1) Media attention reaches out to important people who we wouldn't otherwise be able to contact. GWWC's largest single donor influence (who's donated &gt;$8mn (mainly to a DAF) and who attributes 90% of this to GWWC) was via media influence; our contacts in UK government were through media attention; 2) Member increase is normally fuelled by multiple exposures to GWWC, and the media can be a good first exposure. Because of this, quantitative impact assessment is very hard; hence a lot of refection and attempts to be common-sensey.</p>\n<blockquote>\n<p>I have this worry as well. But it's also possible that while higher-quality articles get lower &gt;viewership, they may get higher-quality viewership in terms of increased response and &gt;conversion rates from the viewers that are attracted.</p>\n</blockquote>\n<p>Yeah, the 'shit spreads' explanation would also make sense of some oddities about who the most most high-profile influencers are - I think that Dawkins' crazy behaviour online probably contributes to his popularity-as-measured-by-twitter-followers.</p>\n<p>Additional reason against controversiality is that it keeps option value - you can always be more controversial later on. However, I'm also starting to notice that it's very difficult to control this aspect - things that don't seem controversial to me can get regarded as highly controversial, often through crazy misreading. Example: if you actually read 'The Skeptical Environmentalist' by Bjorn Lomborg he says this like 'obviously climate change is happening and it's bizarre that people would even question it' (not an actual quote) yet in the media he was painted as a climate denier. </p>\n<blockquote>\n<p>Doesn't GiveWell already run a lot of Google Adwords? How well do those do?</p>\n</blockquote>\n<p>They do, because they get them for free. I don't know how well they do.</p>\n", "parentCommentId": "b2Z5Er8oZdeg79izf", "user": {"username": "William_MacAskill"}}, {"_id": "Q5BthdMLo3X7NmWxq", "postedAt": "2015-03-23T14:13:33.842Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Evan:</p>\n<blockquote>\n<p>I've got some concerns about how &quot;brand management&quot; might be a shiny veneer to cover &gt;&quot;centralization&quot; from Oxford or the Bay Area, and what the consequences of it may be. &gt;These concerns aren't about projects in Oxford, per se, but about some aspects of Effective &gt;Altruism Outreach. I'll save most of them for a later post on the subject broadly. My question &gt;now is: how much will EA Outreach focus upon centralizing and narrowing who shares &gt;information, and to what extent will you make attempts at tamping down other voices in the &gt;movement in terms of &quot;damage control&quot;.</p>\n</blockquote>\n<p>Impala:</p>\n<blockquote>\n<p>That would explain how concerned people mostly come from these places, and why they &gt;have unusually high concern for a social movement.</p>\n</blockquote>\n<p>Thanks for raising this concern. I think that a post on the topic would be really valuable - we certainly don't want to lose the benefits of diversity, to shut down debate, or to become a bottleneck. I don't think we have unusually high concern regarding branding within a relevant reference class -  almost all businesses are highly concerned by brand; free market promoters are highly brand-concerned. Even PETA is highly concerned by brand management in its own way - e.g. using models and celebrities to push v*ganism as 'sexy'.  For movements with unfortunate brands (I'd put animal rights, feminism, and to some extent environmentalism), that seems like a big problem and one we want to avoid. It's also a co-ordination problem (see 'the unilateralist's curse'), and if you've got a diverse range of groups within the movement who differ pretty fundamentally then co-ordination is going to be difficult - and I think that may explain why they suffer these branding issues. This is something we really should try to avoid. (Also, you mention the Bay as well - my impression, which might be wrong (based on conversations with Geoff Anders), is that they agree that it's a bad problem, but think that there's not much we can do about it and so don't actually spend much time on it. I think it's worth trying, but I agree it's a judgment call).</p>\n<p>In terms of concern for this - this is something I've changed my view on a lot over the last 5 years. Because there's so much bullshit-speak surrounding brand management, I was initially very skeptical of its value. But experience with the different orgs has made me switch my view a lot. The most important example of this was back when 80k was 'High Impact Careers' and was quite aggressive in its marketing - focusing on earning to give and banking/doctors comparisons. This was a disaster. People thought we were being deliberately contrarian (and they were right), and we're even still trying to overcome the impression that 80k is only about promoting earning-to-give. Also people lost the message - e.g. some people thought we were promoting finance in its own right; many people didn't realise that charity effectiveness is a core part of the argument.</p>\n", "parentCommentId": "9aCx2fHqTaYe3kaa9", "user": {"username": "William_MacAskill"}}, {"_id": "nZDqadKLgNo9wg2Cr", "postedAt": "2015-03-23T20:13:35.464Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Thank you for the thoughtful response. I think a big issue here is whether businesses or social movements are the right reference class. I think it's the second, and social movement don't usually try to do the sort of brand management of what other activists or groups do that I see in effective altruism.</p>\n", "parentCommentId": "Q5BthdMLo3X7NmWxq", "user": {"username": "impala"}}, {"_id": "6uz9htfomzvrQFjTd", "postedAt": "2015-03-27T14:45:45.375Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Thanks for being so transparent about your reasoning and your experience. It's incredibly good learning value!</p>\n<p>Chris Blattman says he still can't predict what's going to be a hit or not. My friend who used to head the health desk for the Sun seems better at it, but tabloids are a different ballgame - basically intrigue and outrage.. In terms of trying to use tabloids, we landed a double page spread about malaria together once - but they didn't let us put in any links or encourage people to take action so I wager that the net effect was near zero. (happy to share PDF with anyone that's interested via email)</p>\n<p>Anyone tried local press?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "vS7tQD9eAckcPhzH4", "postedAt": "2015-03-27T15:57:20.184Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Re: thinking about negative effects, controversy and caveats - people's memories usually aren't true, so, I remember from your ice bucket article that bednets etc. were more effective, and that people have moral capital which means we need to account for fundraising with heavy discounting, and that this means that ice bucket style fundraising is particularly low value. I don't remember you putting in any caveats about raising awareness of ALS, the empathy that it helps generate, the improved social standing of people with ALS or self esteem after the mass action - I'm sure you did put some in because I know you're not like that. I think this kind of <a href=\"http://en.wikipedia.org/wiki/Fuzzy-trace_theory\">fuzzy trace</a> memory probably is how most people take impressions away from articles? Just something to bear in mind - caveats are unlikely to be remembered?</p>\n<p>EA brand is an interesting debate, but <em>very</em> hard to organise the discussion effectively. I agree that this probably had a turning off and a turning on effect. Like Lombourg had in pushing cost effectiveness by tearing down climate change efforts.</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "m57XPcEmmnP4fArm5", "postedAt": "2015-03-27T20:22:07.840Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>In 2013, 287,822 (28%) of GiveWell's website visitors came from Adwords \n<a href=\"http://blog.givewell.org/2014/03/19/givewell-annual-review-for-2013-details-on-givewells-money-moved-and-web-traffic/\">http://blog.givewell.org/2014/03/19/givewell-annual-review-for-2013-details-on-givewells-money-moved-and-web-traffic/</a></p>\n", "parentCommentId": "Hosqtc3bRYs2rdreA", "user": {"username": "julietteflorence"}}, {"_id": "kPJBpY2kuYWqg56v5", "postedAt": "2015-04-04T14:01:15.242Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Thanks for the response. I didn't notice this until just now. I believe it's harder to screw up with brand management than without, so we should try. I think part of the problem could be solved with the EA Advocates project, or something like it, which I wasn't aware of when I made my original comment. Having advocates which are geographically distributed, and don't all come from the same culture, e.g., academia, or high-tech industry, may send the signal effective altruism is about whichever individuals are passionate about it, and isn't just a fancy label for those from one group. I think indicating how effective altruism is a distributed network could help solve coordination problems, because various advocates can act as sounding boards for newcomers, whether on the basis of location or cause of interest.</p>\n<p>One reason I distinguished the Bay Area from Oxford is because what reference class for effective altruism promotes is somewhat different. Even more than just &quot;non-profit&quot; in general, the Centre for Effective Altruism is located among what people typically think of &quot;philanthropy&quot;. It's orientation and association with giving pledges, academia and policy recommendation, all seem to make the leap from default to explicitly effective altruism more intuitive. The CEA, with e.g., The Life You Can Save and Giving What We Can, seems able to create a coherent culture. </p>\n<p>The Bay Area is more all over the place. First of all, it doesn't have &quot;center&quot;. In the United States, effective altruism is primarily associated with Givewell, but its culture is primarily programmed by Leverage Research, and its grass-roots advocates hail from a wider diversity of causes across the Internet, who don't communicate as much with each other. On one hand, for-profit high-tech social entrepreneurship, or whatever, is seen by some effective altruists in the Bay Area as the way the most good can be achieved. This <a href=\"http://en.wikipedia.org/wiki/Lean_startup\">lean startup</a> culture bleeds into the promise of emerging technologies, and the high-minded vision of e.g., Geoff Anders, or Eliezer Yudkowsky. Then, I can turn around, and the next effective altruist I talk to is in favor of not only a radical cause, but pushes it with radical action, such as <a href=\"http://en.wikipedia.org/wiki/Direct_Action_Everywhere\">Direct Action Everywhere</a>.</p>\n<p>If I talk to a student from Harvard, Yale, or Oxbridge, I can trace their effective altruism back to your work, or Peter Singer's. There isn't an intuitive prototype for effective altruism in California. It's more chaotic. I don't think this is a bad thing in terms of action. I think it would make brand management more difficult. However, I think this eclectic culture could be swamped from the influx of whoever's exposed to effective altruism by your and Singer's new books. Overall, I now think brand management will work better if effective altruism is seen as a coherent set of ideas distinct from its related cause areas which are not intuitively related to altruism, like high-tech business, or which are more volatile and controversial, such as radical veganism. </p>\n", "parentCommentId": "Q5BthdMLo3X7NmWxq", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Qv2cutxG2i7CPAiPW", "postedAt": "2015-04-19T16:19:14.444Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<p>Thanks, I look forwards to reading that. I've heard that GiveWell have said that they haven't found AdWords very worthwhile however - does that fit with your impression?</p>\n", "parentCommentId": "m57XPcEmmnP4fArm5", "user": {"username": "jayd"}}, {"_id": "7qyD9jF4JeDFkNFjk", "postedAt": "2015-05-23T22:59:01.148Z", "postId": "E3t6adWgDXm3pNoYh", "htmlBody": "<blockquote>\n<p>The most important example of this was back when 80k was 'High Impact Careers' and was quite aggressive in its marketing - focusing on earning to give and banking/doctors comparisons. This was a disaster</p>\n</blockquote>\n<p>Interesting - what metrics are you thinking of when you say it was a disaster?</p>\n", "parentCommentId": "Q5BthdMLo3X7NmWxq", "user": {"username": "Larks"}}]