[{"_id": "sfEihCgpueFfbFWMp", "postedAt": "2023-05-30T04:58:26.485Z", "postId": "E3wSsdTXLGZ3pvYSY", "htmlBody": "<p>Thank you, very informative! Impressive numbers for the new HEAs. Suggests there could be significant untapped potential in other Baltic countries, which is inspiring.&nbsp;<br><br>Though the \"Active members\" number has remained roughly the same throughout 2022. Do you have any explanation why is that? Is there some sort of saturation? Would be interesting to know other year-on-year numbers also e.g. for HEAs, if you have them.<br><br>P.S. Coming the <a href=\"https://www.lvm.lv/en/news/4587-latvia-is-home-to-europe-s-most-active-mushroom-pickers\">top mushroom hunter nation</a> I respectfully nod about the mushroom scientists fact.</p>", "parentCommentId": null, "user": {"username": "akanepajs"}}, {"_id": "cZC4eE69CdfGhtWrK", "postedAt": "2023-05-30T12:37:08.572Z", "postId": "E3wSsdTXLGZ3pvYSY", "htmlBody": "<p>Thanks for the nice words!</p>\n<p>Regarding the \"active members\" count, here are the stats:</p>\n<ul>\n<li>That year, around 17 new people were added to the Slack from the Intro Course. Possibly 5-10 more.</li>\n<li>Out of them, around 13 were engaged in activities after that</li>\n<li>That means at least 13 other people had to become became less active during that time (not unreasonable)</li>\n</ul>\n<p>So to increase activity on Slack, we'd either have to prevent people leaving or add people to Slack. We could:</p>\n<ul>\n<li>assign each currently active person a mentor to keep them engaged</li>\n<li>have a more obvious process of choosing activities to take part in</li>\n<li>have more activities to take part in</li>\n<li>think more about how to scale up our activities</li>\n<li>invite people to Slack more liberally (also outside the Intro Course)</li>\n</ul>\n<p>But another queston to ask is, whether activity on Slack should even be a metric to optimize for. I feel like it's okay to a have a static member count, as long you are creating lots of HEAs.</p>\n<p>This touches a bit on the the question of what even is a national EA group: whether it's necessarily a big community of friends, or can it be a narrow attempt at getting more people working on top causes? I'm leaning more towards the latter lately.</p>\n<p>PS! Looks like there's lots of collaboration to be done on the mushroom front :)</p>\n", "parentCommentId": "sfEihCgpueFfbFWMp", "user": {"username": "rannilo"}}]