[{"_id": "zTnKCGhukGrLxv6Hr", "postedAt": "2014-12-26T13:34:54.371Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<blockquote>\n<p> teacher[s]  ... During the summer, they can try to get a second job, but they probably can't do better than $10/hour</p>\n</blockquote>\n<p>You can earn $40/hour as a personal tutor without any qualifications beyond an ivy-league degree - I'm sure qualified teachers could command as high an hourly rate.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "TGwwSc5thojTKsGH6", "postedAt": "2014-12-27T19:42:11.848Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>Not to nitpick, but this:</p>\n<p>&quot;Given this, my guess for the value of a marginal hour for a tech worker is something between a quarter and a half of their average salary.  Again, this is enough of a difference that we could be significantly misled by valuing their time at their average hourly wage, as the examples above do.&quot;</p>\n<p>read like a bit of a strawman to me, because I'd read a couple of the examples and hadn't noticed it. When I tried to go to the linked examples to discover whether they did in fact use average, rather than marginal, wage, the first link is broken and the fourth seems to link to the third (the third, as far as I can tell, doesn't discuss voting).</p>\n<p>With respect to kidney donation, all I see is talk about 'lost wages' in a somewhat opaque way that could mean marginal or average, but the implication is marginal (e.g. it talks about paid leave greatly lessening this cost) and so I think the charitable interpretation would be to assume marginal.</p>\n<p>Finally, with respect to vegetarianism, I don't see any explicit discussion of time/wage cost at all? In fact Katja's explicit calculation all seems to be in dollars, as you (correctly, in my view) recommend.</p>\n<p>I do of course agree that we should be thinking on the margin, and apologise if I've missed something.</p>\n", "parentCommentId": null, "user": {"username": "AGB"}}, {"_id": "67Ti3TgiR24LYaLnp", "postedAt": "2014-12-28T04:17:39.998Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>That's reasonable-- I think some teachers probably can do this as a part-time thing on top of teaching.  Keep in mind though, that tutoring work is highly variable by time of year, not very available in some places (I knew zero students with private tutors of any kind in my hometown in Kansas), and can have high transportation overheads.  Another way to look at is that if an option that good were available to all teachers, you'd never see teachers getting food service jobs.</p>\n<p>In either case, my main point is that the way someone earns marginal income can be completely different than the way they earn their average dollar.</p>\n", "parentCommentId": "zTnKCGhukGrLxv6Hr", "user": {"username": "ruthie"}}, {"_id": "wEXhZskq4Sx5iN7JX", "postedAt": "2014-12-28T04:36:55.624Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>Thanks for pointing out the broken links!  They should be fixed now.</p>\n<p>The relevant sentence from the first example:</p>\n<blockquote>\n<p>There is this very, very old puzzle/observation in economics about the lawyer who spends an hour volunteering at the soup kitchen, instead of working an extra hour and donating the money to hire someone to work for five hours at the soup kitchen.</p>\n</blockquote>\n<p>There's some discussion between me and some others on the kidney donation post that I think is also pretty clear.  <a href=\"http://effective-altruism.com/ea/ay/kidney_donation_is_a_reasonable_choice_for/1ex\">http://effective-altruism.com/ea/ay/kidney_donation_is_a_reasonable_choice_for/1ex</a></p>\n<p>I read both of these as discussing average salaries, although you're right no one says so explicitly.  If everyone is already thinking on the margin and occasionally writing in unclear ways, then great.</p>\n", "parentCommentId": "TGwwSc5thojTKsGH6", "user": {"username": "ruthie"}}, {"_id": "aEJ8vL6TYZL58mLph", "postedAt": "2014-12-28T12:41:35.513Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>I see, I didn't look at the comments section. I agree that there people are talking about average wage.</p>\n", "parentCommentId": "wEXhZskq4Sx5iN7JX", "user": {"username": "AGB"}}, {"_id": "YYbTbbsJ3BPHZEyer", "postedAt": "2014-12-28T17:04:34.931Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>Hey Ruthie,</p>\n<p>Thanks for the post, I agree with what you've said, and think this is a great post. I think that I can add some extra considerations relating to average and marginal wages though. Yes, sometimes your marginal time is worth less than your average wage. But in other situations, it's worth more.</p>\n<p>As a junior doctor, hospitals place a premium value on your marginal time: you're paid $25 per hour during the week and 1.5 rate for overtime, and then about 3x for covering shifts. Partially this is because doctors' skillset is uncommon and partially it's because they want to ensure continuity of care for each patient - the doctor on after-hours has treated the patient before and knows some of their story. When continuity matters, there's a reason to pay extra for your marginal time. </p>\n<p>In investment banking, in addition to the scarce skillset, there's a need for staff to be up-to-date with a wide range of aspects of a deal. Similar in consulting. In tech, if you're working with a complex and abstract problem, sometimes you might want one person to understand the whole codebase, and I'd speculate that's one among many reasons that at high-levels, some coders are paid a lot more than others. Whether or not your current employer would reward you for working an extra 20 hours per week, it could make you able to perform a larger range of tasks.</p>\n<p>Apart from work, you could use your time to gain skills like sales or programming, or to grow your network. Presumably, when we say it's important for young people to grow their career capital, this is what we're talking about. Or your could learn about effective charity.</p>\n<p>Finally, if you want to start a new company, that's just one of those sorts of jobs that will require extra work and that might offer returns above your average over 40 hours. But even before you quit your job to be a full-time founder, you're going to need to use a lot of that marginal time to develop the company as a side-project.</p>\n<p>There's also arguments about getting a second job to earn more money, although that can be messy.</p>\n<p>On this view, work would be something that people do not because they think it's offering them good value for their time but because of necessity, or because of security.</p>\n<p>Sure, there are a bunch of arguments that push the other way - if you work 40+ hours, you get tired, and such. But I think it might be rash to guess that marginal time is only worth 25-50% in tech. For many people, it'd be the reverse - their marginal time is worth more than their wage. If so, then using average wage as a first approximation might not be so misleading after all.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "zAYv87Xivuhsk6m2r", "postedAt": "2014-12-28T19:32:45.825Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>Hi Ryan!</p>\n<p>My estimate of the value of a marginal hour in tech was based on my experience and pretty general reasoning, and I have pretty low confidence in it, so I think there's plenty of room for disagreement.  However, it's still my best guess, and I have considerable certainty that a marginal hour in tech is worth less than an average hour.  One place my intuition comes from is this: if I work 80 hours a week instead of 40 (or invest in career capital for that long), do I expect my lifetime expected earnings to double?  This seems pretty unlikely to me.  A typical senior software engineer salary is around $150K, so if I can get there working 40 hours a week, I would need to be earning at least $300K at the end of my 80 hours a week career (and probably more to make up for not immediately earning twice a typical junior salary now).  Very few tech workers (or people who started their careers as tech workers) earn that much, and although working 80 hours a week may increase your probability of getting there, it certainly doesn't increase that probability all the way to 1.  That doesn't prove that your 41st hour isn't worth more than your 40th, but you have to hit diminishing returns at some point.</p>\n<p>In general though, my main point is that marginal pay works differently from average pay, so you need to actually evaluate what you think a marginal hour of work is worth.  Your right that for some people a marginal hour is worth more than the average hour, and for some people it happens to be basically the same, but that's not true for most people.  If you think that your marginal hour is worth the same as your average hour, you should by all means use that number when deciding how to use your time.</p>\n", "parentCommentId": "YYbTbbsJ3BPHZEyer", "user": {"username": "ruthie"}}, {"_id": "NQqGCjk6pMtAtXDDi", "postedAt": "2014-12-29T04:23:35.119Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>This does not weaken your main thesis, but it might add some nuance -- there are definitely times when you're marginal wage <em>greatly</em> exceeds your mean wage.  For example, one time I <a href=\"http://effective-altruism.com/ea/cs/how_i_raised_501032_for_amf_and_how_you_can_too/\">spent two days earning $295/hr</a>.  ...I also think there was one time I changed something on my tax forms that saved me $30/mo and only took a minute, so - six months later - that was effectively $10800/hr.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "NX4HDnmXDyc7kWip4", "postedAt": "2014-12-30T22:15:02.222Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<blockquote>\n<p>A typical senior software engineer salary is around $150K</p>\n</blockquote>\n<p>Maybe my impressions are atypical, but I think this is on the pretty low end at least for solid tech companies in SF? Like there are places (e.g. Dropbox, Google?) that sometimes pay 150K straight out of college, and most of the intermediate/senior people I know (admittedly not many and not representative) make way more than that.</p>\n", "parentCommentId": "zAYv87Xivuhsk6m2r", "user": {"username": "Ben_Kuhn"}}, {"_id": "vtajQafyrKDS5xLKh", "postedAt": "2014-12-30T23:23:20.049Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>It sounds about right to me, the 90th percentile for software developers in the US <a href=\"http://www.bls.gov/oes/current/oes151132.htm\">is $143k</a>-<a href=\"http://www.bls.gov/oes/current/oes151133.htm\">150k</a> excluding overtime.</p>\n", "parentCommentId": "NX4HDnmXDyc7kWip4", "user": {"username": "RyanCarey"}}, {"_id": "fc3mo6inj2JuieFAH", "postedAt": "2014-12-31T00:22:22.804Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>Peter, I don't think it makes a ton of sense to count those as &quot;wages&quot; per se, since they're not scalable, repeatable, knowable a priori, or even (often) reproducible between people.</p>\n<p>In fact, I'm not even sure they're marginal. For instance, nobody thinks &quot;I think I shouldn't donate a kidney because I could otherwise spend that sick leave changing things on my tax forms and earn millions of dollars.&quot;</p>\n", "parentCommentId": "NQqGCjk6pMtAtXDDi", "user": {"username": "Ben_Kuhn"}}, {"_id": "7NwpfeCpqhdZjE2SW", "postedAt": "2014-12-31T00:32:01.152Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>Interesting. In terms of predicting Ruthie's salary as a senior engineer, I don't know whether to trust my anecdata (which presumably is sampled from closer to the same distribution as Ruthie), or the BLS, which is clearly a lower-variance estimate but possibly of the wrong quantity (systems programmers across the country).</p>\n", "parentCommentId": "vtajQafyrKDS5xLKh", "user": {"username": "Ben_Kuhn"}}, {"_id": "YhSFDWNZNixRWBafp", "postedAt": "2014-12-31T12:06:18.774Z", "postId": "E4JJCbAh5KyHcbGym", "htmlBody": "<p>The BLS also has regional data if you check the second link.  Seems the BLS thinks programmers in the Bay Area make perhaps 1.3x the national average.  But Bay Area programmers don't just work for highly profitable tech companies... there are non-software-company salaries and salaries at less profitable tech companies pulling the average down.  It's also not clear whether the BLS is taking in to account equity compensation, which is obviously very significant at many Bay Area tech companies.</p>\n", "parentCommentId": "7NwpfeCpqhdZjE2SW", "user": {"username": "John_Maxwell_IV"}}]