[{"_id": "7kuNxvH9heBzdifYk", "postedAt": "2018-03-15T19:30:47.633Z", "postId": "E5uGZguvMhSuuga6M", "htmlBody": "<p>Thanks for sharing this. I'm looking forward to the second part!</p>\n<p>Reflections like this are amazingly valuable for the movement building community. I'm especially interested in how you factored in the local context in order to choose the best strategy for EA in the Czech Republic. I also totally agree that it's great to hear perspectives that come from outside of the Oxbridge/Silicone Valley bubble - and even the anglophile bubble.</p>\n<p>A lot of people are grappling with the issue of how to appropriate EA in non-English communities. I'll be sharing this report with each of those that approach LEAN with these challenges.</p>\n", "parentCommentId": null, "user": {"username": "Richenda"}}, {"_id": "X6g3KZ2X8vi7pWbxg", "postedAt": "2018-03-16T01:03:50.034Z", "postId": "E5uGZguvMhSuuga6M", "htmlBody": "<p>Thanks! \nI think the algorithm may be explained something like</p>\n<p>1] take the most up-to-date reasoning and conclusions from central places ... like prioritization outputs of CEA, FHI, CSER, GiveWell, OpenPhil, etc.</p>\n<p>2] try to think what are the local differences, and which of them would most influence the outcomes. </p>\n<p>3] think in terms of comparative advantages and disadvantages (e.g., if you are in Geneva, you have  access to all that world organizations and people working in them ... so you have advantage in policy)</p>\n<p>4] think in terms of the movement optimizing as a unified organization, like &quot;if there was an EA Inc. what units it would create here&quot; (sometimes its possible to learn from actual multinationals)</p>\n<p>Possible caveat... doing this may be much less work than creating the original models, but may need good understanding of the models, and good grasp of concepts like parameter sensitivity.</p>\n<p>We're starting a prioritization projects attempting to quantitatively model this (factor in local considerations). It will also probably try to model the important question &quot;stay or move&quot;</p>\n", "parentCommentId": "7kuNxvH9heBzdifYk", "user": {"username": "Jan_Kulveit"}}]