[{"_id": "5xGSFhJ8tze8YkhvA", "postedAt": "2023-07-08T15:07:38.276Z", "postId": "E6Fjo7y8qvdZfsjrt", "htmlBody": "<p>I found this helpful and clearly written. Thanks for cross-posting.</p>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "eueDtfR3yuogSkATX", "postedAt": "2023-07-10T00:22:12.549Z", "postId": "E6Fjo7y8qvdZfsjrt", "htmlBody": "<p>Confrontation-worthy empathy feels like it might have been worthwhile splitting out into its own post as it is very different from the timelines discussion.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "h7Q9uRybCqiCJNA5b", "postedAt": "2023-07-10T08:52:59.551Z", "postId": "E6Fjo7y8qvdZfsjrt", "htmlBody": "<p>There are many more interventions that <i>might</i> work on decades-long timelines that you didn't mention:</p><ul><li>Collective intelligence/sense-making/decision-making/governance/democracy innovation (and it's introduction in organisations, communities, and societies on larger scales), such as https://cip.org</li><li>Innovation in social network technology that fosters better epistemics and social cohesion rather than polarisation</li><li>Innovation in economic mechanisms to combat the deficiencies and blind spots of free markets and the modern money-on-money return financial system, such as various crypto projects, or <a href=\"https://digitalgaia.earth/\">https://digitalgaia.earth</a></li><li>Fixing other structural problems of the internet and money infrastructure that exacerbate risks: too much interconnectedness, too much centralisation of information storage, money is traceless, as I explained in <a href=\"https://www.lesswrong.com/posts/bRtP7Mub3hXAoo4vQ/an-open-letter-to-seri-mats-program-organisers?commentId=wbWwnuHjpCGq4c6qZ\">this comment</a>. Possible innovations: <a href=\"https://www.inrupt.com/\">https://www.inrupt.com/,</a> <a href=\"https://trustoverip.org/\">https://trustoverip.org/</a> , other trust-based (cryptocurrency) systems.</li><li>Other infrastructure projects that might address certain risks, notably <a href=\"https://worldcoin.org/\">https://worldcoin.org</a>, albeit this is a double-edged sword (could be used for surveillence?)</li><li>OTOH, fostering better interconnectedness between humans and humans to computers, primarily via brain-computer interfaces such as Neuralink. (Also, I think in mid- to long-term, human-AI merge is only viable \"good\" outcome for humanity at least.) However, this is a double-edged sword (could be used by AI to manipulate humans or quickly take over humans?)</li></ul>", "parentCommentId": null, "user": {"username": "Roman Leventov"}}]