[{"_id": "Sm2KokDcwE3sDqeYi", "postedAt": "2023-03-29T13:13:23.437Z", "postId": "E7CvbPvvNF2XnKqdJ", "htmlBody": "<p>I think you can address the violation of dominance by just allowing representatives of theories to bargain and trade. If theory A doesn't care (much) about some choice, and another theory B cares (a lot), theory B can negotiate with theory A and buy out their votes by offering something in later (or simultaneous) decisions.</p><p><a href=\"https://www.fhi.ox.ac.uk/wp-content/uploads/2021/06/Parliamentary-Approach-to-Moral-Uncertainty.pdf\">Newberry and Ord, 2021</a> have separately developed the sortition model as \"proportional chances\" voting version moral parliament, which also explicitly allow bargaining and trading ahead of time. Furthermore, if we consider voting on what to do with each unit of resources independently and resources are divisible into a large number of units, proportional chances voting will converge to a proportional allocation of resources, like <a href=\"https://forum.effectivealtruism.org/posts/4wdZAozqJqEYazBnt/the-property-rights-approach-to-moral-uncertainty\">Lloyd's property rights approach</a>, which is currently the approach I favour.</p><p>&nbsp;</p><p>Also, to prevent minority views from gaining control and causing extreme harm by the lights of the majority, Newberry and Ord propose imagining voters believe they will be selected at random in proportion to their credences and so they act accordingly, compromising and building coalitions, but then the winner is just chosen by plurality, i.e. whichever theory gets the most votes. This seems a bit too ad hoc to me and gives up a lot of the appeal of random voting in the first place, though, and I hope we can find a more natural response. Some ideas:</p><ol><li>Other theories can burn their votes/resources to eliminate one theory's votes/resources. I think this could be pretty unfair, because with say two theories competing, the one with greater credence could completely rule out the one with lower credence and gain total control. It should be more costly to do something like this.</li><li>There can be a constraining constitution that is decided by a supermajority with a relatively high threshold (not randomly).</li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "Rnim2XwveJCgsLhvM", "postedAt": "2023-03-29T14:24:42.234Z", "postId": "E7CvbPvvNF2XnKqdJ", "htmlBody": "<p>Related paper: <a href=\"https://globalprioritiesinstitute.org/wp-content/uploads/Owen-Cotton-Barratt-HIlary-Greaves-A-bargaining-theoretic-approach-to-moral-uncertainty-1.pdf\"><i>A bargaining-theoretic approach to moral uncertainty</i></a>.</p>", "parentCommentId": "Sm2KokDcwE3sDqeYi", "user": {"username": "Sylvester Kollin"}}, {"_id": "i4sMzHErwXGxJGk7p", "postedAt": "2023-03-30T13:22:40.095Z", "postId": "E7CvbPvvNF2XnKqdJ", "htmlBody": "<p>I guess that doesn't work for nihilism, but another option when there's indifference or incomparability about a given decision is to just resample until you get a theory that cares (or condition on theories that care). But you might only want to do this for nihilism, because other theories could care that their votes are being given away, if they could have otherwise used them as leverage for decisions they would care about.</p>\n", "parentCommentId": "Sm2KokDcwE3sDqeYi", "user": {"username": "MichaelStJules"}}]