[{"_id": "nXWnAyxL7CwQuuhrT", "postedAt": "2018-08-02T00:56:45.153Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>Thanks Rossa, this is really cool to see.</p>\n<blockquote>\n<p>We are not designed to replace existing local EA groups or giving opportunities. For instance, the Giving What We Can pledge involves giving 10% of your income to effective charities; clearly a much larger impact than our 1% starting point. Similarly, we believe that the EA community has very strong foundations in its use of local groups, and we want to complement existing resources and practices.</p>\n</blockquote>\n<p>Can you talk a bit more about how you intend for 1FTW to connect people with EA more broadly? Or how 1FTW will avoid crowding out existing EA outreach, especially if everyone is focused on the same top universities?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "kWC2Bmb4eiknrGjP4", "postedAt": "2018-08-02T02:10:56.397Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>On the flip side, maybe it's a good idea for 1FTW to maintain some distance from the EA community/EA as a concept. If they specialize in promoting effective giving to global poverty to people who are unlikely to embrace EA as a whole, that might be a good way to avoid competing with existing EA outreach.</p>\n", "parentCommentId": "nXWnAyxL7CwQuuhrT", "user": {"username": "JoshYou"}}, {"_id": "iWHargea9kw4Crdwt", "postedAt": "2018-08-02T06:26:53.901Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>Thanks Peter, Josh.</p>\n<p>Personally, I see oftw as complementary to existing EA outreach, in particular local EA groups. I think Oftw can be very effective in 'broadening the funnel' of engagement with EA and raising money, then a general EA group provides a platform for those who become most engaged in EA, particularly in non-poverty cause areas. I think a OFTW pledge drive can help with engagement too, by giving concrete, tangible actions for members to work on.</p>\n<p>In terms of how this works in practice, there are a couple of cases that have taken different approaches here. At Penn, the Oftw groups have operated pretty independently from the penn EA group - they have organised some events together, sometimes join each others' discussion groups and socials, but the core organisers haven't overlapped much. They've also focused on different populations I think (Oftw on MBA, law students and the broad undergrad body, the EA group focusing more on a smaller group of people very engaged in EA). At HLS, I <em>think</em> Oftw operates more as a 'project' of the general EA group, and the core organising team has a lot of overlap. To avoid crowding out or duplicating effort, I think some collaboration is desirable, but I think either of these approaches can work well.</p>\n", "parentCommentId": "nXWnAyxL7CwQuuhrT", "user": {"username": "rossaokod"}}, {"_id": "ku7wD4nG4P4FEDdhA", "postedAt": "2018-08-02T06:33:16.943Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>I'm cross posting answers to some questions on the EA group organisers Facebook group below:</p>\n<blockquote>\n<p>Have you found this to be significantly more successful than the 1% student version of GWWC? </p>\n</blockquote>\n<p>In my personal experience, in terms of number of pledges, I would say yes. I've helped run Gwwc groups in Oxford (2011-2012) and Penn (2014-2017) and over those years I think we probably 'caused' 10-20 Gwwc pledges at Penn and &lt;10 in my year at Oxford. The most established Oftw chapters seem capable of bringing in ~60-100+ each year. This compares favourably to the Gwwc groups I've been involved with, but probably not the most successful ones (eg Cambridge generated a huge number of Gwwc pledges through its pledge drive ~2.5(?) years ago). We also have some less established oftw chapters yet to hit those numbers.</p>\n<p>In terms of deeper engagement with EA, I think a more general EA local group likely does a better job than a OFTW chapter on average. But overall I see the two approaches as complementary - Oftw to 'broaden the funnel' of engagement with EA and raise money, then a general EA group for those who become most engaged in EA, particularly in non-poverty cause areas. I think a OFTW pledge drive can help with engagement too, by giving concrete, tangible actions for members to work on.</p>\n<blockquote>\n<p>Do you ever see people increase their pledge from 1%? Or do you see people feeling content with only 1%? </p>\n</blockquote>\n<p>We haven't seen many people increasing their donation past 1% so far, and have found this default pretty sticky. In the last year, we've emphasised the <em>at least</em> 1% messaging more, and changed defaults in our sign up page to include 2% options. We've also started experimenting with 'upselling' some of our more engaged members to higher amounts, but our first attempts didn't yield much. Overall, this is an area (and donor engagement more generally) that we haven't done much with so far, and are hoping to improve a lot on now we have more capacity.</p>\n", "parentCommentId": null, "user": {"username": "rossaokod"}}, {"_id": "EMBs5KqNiJyL7G9hn", "postedAt": "2018-08-02T10:39:23.920Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>1% is very low. Personally, when I first heard of 1FTW my gut reaction was a sort of dismissive cynicism, like, &quot;oh look how little they are doing while congratulating themselves&quot;. I think that people who are very morally driven on this issue (particularly people who hate wealthier people such as Wharton MBAs) might have similar reactions and I worry that this increases the chance that they will have a generally dismissive attitude about EA. Plus, I would think that a 5% or 10% pledge is able to get at least 1/5 or 1/10 as many people respectively to sign up.</p>\n<p>On the other hand, naively looking at donation quantities ignores the general social effects of getting a large number of influential people to grasp and support EA ideas. So, I think the core idea is good. If I were reassured that few people have a cynical response to your messaging then I think I'd consider it one of the very top uses of funding. Perhaps the messaging should be more stoic, but then you may get less positive interest.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "CtWhTBGnTA5GW9kCC", "postedAt": "2018-08-02T11:28:05.576Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>Thanks Rossa,</p>\n<p>I'm wondering how you see 1FTW's position changing due to the presence of OpenPhil and a shift towards a more money rich, talent poor community (across certain cause areas)?</p>\n<p>In my eyes, the comparative advantage for student groups is more about driving engagement and plan changes and less about raising funds. Of course, money still goes a long way, but I'm skeptical that group leaders should be spending their time focusing on (relatively) small donations over building communities of talented, engaged individuals.</p>\n<p>Is your view that 1FTW will be a better outreach vehicle (than standard community building techniques) for certain demographics? It seems that 1FTW attracts similar types of people that the GWWC pledge would, but at higher quantities due to the lower barrier. However, I'm skeptical that this lower barrier is necessarily a positive thing, because it would seem that, on average, these individuals are less likely to further engage with the EA community at large. </p>\n<p>Is this something you're concerned about, or do you think these concerns are relatively minor?</p>\n", "parentCommentId": null, "user": {"username": "Eli_Nathan"}}, {"_id": "RNFzhTn5fgXFXnR7T", "postedAt": "2018-08-02T15:11:56.512Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>&quot;We have established proof of concept by establishing effective giving as a significant part of communities that one might consider stereotypically unlikely to engage with and support EA.&quot;\nWhat kind of communities are you talking about? MBA/Law students, or something else?</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "6wn3AodJfmd9y29fK", "postedAt": "2018-08-02T17:08:50.929Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>Yeah, pretty much MBA students and Law students to a lesser extent. To be honest, when I was first approached by Josh and Kate (the founders) to join OFTW, I was fairly skeptical that it would catch on in the Wharton MBA class, but was impressed by the amount of market research and thought they'd put into the concept, the messaging and branding etc. One of the lessons I've learned over time is that the stereotype of a 'typical' MBA student caring more about money and a career than charities and doing good may not be (entirely!) fair - most people want to good, but haven't thought deeply about it or know the best ways. We're trying to make it easier and more convenient for them, and the idea has proved more popular than I had initially thought! I'm not sure to what extent this will extend to other communities, but one thing we want to start experimenting with is 'corporate' chapters, starting in companies where a lot of our members work. </p>\n", "parentCommentId": "RNFzhTn5fgXFXnR7T", "user": {"username": "rossaokod"}}, {"_id": "CGMaP5BRs5skZNqWN", "postedAt": "2018-08-02T17:34:36.535Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>This is a really good and important point - thanks, Eli_Nathan. I don't feel confident in having an 'answer' to this potential tradeoff (focusing on raising money vs deepening engagement), but a few thoughts:</p>\n<p>1) </p>\n<blockquote>\n<p>It seems that 1FTW attracts similar types of people that the GWWC pledge would, but at higher quantities due to the lower barrier. However, I'm skeptical that this lower barrier is necessarily a positive thing, because it would seem that, on average, these individuals are less likely to further engage with the EA community at large.</p>\n</blockquote>\n<p>I think this is a reasonable view to take, and I agree that <em>on average</em> a OFTW members is less likely to engage deeply with EA than a GWWC member (or similar). I do think we have a number of cases, in particular some chapter leaders and 'student ambassadors', who have gone on to engage quite deeply with EA, and who may never have got involved without OFTW's more broad-based approach. (I guess any evidence I have here is anecdotal though, and I don't want to talk for others too much). So even if <em>on average</em> fewer people deeply engage with EA, I think it is very plausible that the total number is higher. I think the optimal setup at a university would be to have a thriving OFTW chapter (or something similar) that is engaging the broader student body with EA ideas, and a thriving general EA group that funnels those who are more interested in EA and other cause areas to get more involved. (See my other comments on the complementarity of these groups, and on the idea of 'widening the funnel' of engagement with EA, so more people just get involved, and more end up more deeply engaged). </p>\n<p>2) </p>\n<blockquote>\n<p>In my eyes, the comparative advantage for student groups is more about driving engagement and plan changes and less about raising funds. </p>\n</blockquote>\n<p>I think this is also a very reasonable (and increasingly common) view to hold. Again, I think the ideal setup is for a general EA group to work with OFTW on this, but I think this is an area we would like our chapters to improve on. In discussions with GiveWell about the grant, they gave us feedback that they'd like to see more promotion of EA more generally by our chapters, and we also talked a bit about trying to offer 80,000-hours style material, to help generate engagement, plan changes and improve the 'talent pool' in EA. I think these are both areas that we want to improve on as we grow and increase our capacity.</p>\n<p>3) </p>\n<blockquote>\n<p>Of course, money still goes a long way, but I'm skeptical that group leaders should be spending their time focusing on (relatively) small donations over building communities of talented, engaged individuals.</p>\n</blockquote>\n<p>On this, I think this is a fair short-term critique of the amount of money we are currently raising, but I think a lot of the (monetary) value in what we are doing is yet to be realised. I don't know the stats off the top of my head, but X% of Wharton MBAs go on to become worth $Ym, and we want to try and engage these 'future rich' (and influential) people with EA at a relatively early stage (and while their preferences are still fairly malleable!). Keeping our members engaged over the years is going to be a key factor in our success going forward though!</p>\n", "parentCommentId": "CtWhTBGnTA5GW9kCC", "user": {"username": "rossaokod"}}, {"_id": "RSCHQWayg9HheE2Wq", "postedAt": "2018-08-02T17:55:36.922Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>This is useful feedback, and I've heard one or two similar sentiments before, though (in my experience) this type of &quot;dismissive cynicism&quot; has been quite rare. </p>\n<p>We are quite careful in our messaging of the 1% figure, and try not to be self-congratulatory about giving this relatively small amount (but as you point out there is a tradeoff with trying to create a positive vibe vs being a bit more stoic about a small amount). For example, we often use the figure that Americans give 2.6% on average, to try to anchor people higher than 1% and show how normal that low level is. We also use this stat to have messaging along the lines of &quot;you'll give 2.6% on average, and will likely have a portfolio of charities where you give. Our ask is for at least 1% of that portfolio to go towards some of the most effective global poverty charities&quot;. Increasingly, we do want to try to 'upsell' people more, but our efforts on this are fairly preliminary so far. </p>\n", "parentCommentId": "EMBs5KqNiJyL7G9hn", "user": {"username": "rossaokod"}}, {"_id": "rmZNpnRHXxhaY22de", "postedAt": "2018-08-04T23:47:01.809Z", "postId": "E8mx588jRLzbKHXoG", "htmlBody": "<p>This is correct about HLS. We think that OFTW outreach has generally been a good way to build name recognition for EA—if you ask people what we do, they know about OFTW because it's a big, very visible effort. I think there's some risk that they think we're limited to poverty work (a general EA problem), but I don't think this is an unavoidable consequence of our partnership with OFTW—it's because our other programming has so far been less visible.</p>\n<p>It's also a good way for us to stratify our programming (both for our members and for involving non-members) so that we have meaningful interaction with both EA-sympathetic &quot;normal&quot; (i.e., not EA career things) people and career-minded EAs.</p>\n", "parentCommentId": "iWHargea9kw4Crdwt", "user": {"username": "Cullen_OKeefe"}}]