[{"_id": "M4eDapxDoQCjRt3WN", "postedAt": "2024-01-17T01:00:28.872Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>What are some kinds of projects you'd like to see more of (in terms of applications)?</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "SzBpkdcKNqjTFa2jA", "postedAt": "2024-01-17T04:33:08.614Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Can you provide a rationale/cost-effectiveness estimate as to why a dollar donated to EAIF goes further to save lives/suffering reduction than a GiveWell Top charity?</p>", "parentCommentId": null, "user": {"username": "Jen Baik"}}, {"_id": "QGgmFe97MRzSXh98j", "postedAt": "2024-01-17T19:47:16.188Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Semi-relatedly, I'd also be interested in hearing about some of EAIF's past grants that you think were particularly exciting/successful (this might have already gotten covered in one of the other posts — apologies if so!).&nbsp;</p>", "parentCommentId": "M4eDapxDoQCjRt3WN", "user": {"username": "Lizka"}}, {"_id": "XuwXh8nfdDQp9q8K8", "postedAt": "2024-01-18T01:44:27.507Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Have there been (m)any grants for which -- from the ex ante perspective -- you really wish you hadn't made that grant? If so, what did you/EAIF learn from that experience?</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "cDKgoSDMsmkbmEM8A", "postedAt": "2024-01-19T07:27:59.679Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>What advice would you give to someone applying for the first time for the grant? Also, can you share some non-obvious mistakes applicants make?</p>", "parentCommentId": null, "user": {"username": "Maja Nenadov Webster"}}, {"_id": "yERCtvp8ZNAMRFgWx", "postedAt": "2024-01-19T11:46:01.130Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p><a href=\"https://www.ceealar.org/\">CEEALAR</a> provides cost-effective support to EAs working on global catastrophic risks in the form of free or subsidised coliving and coworking spaces, but has so far been unsuccessful in securing EAIF grants. Does EAIF see a role for this type of infrastructure? If so, what would you like it to look like?</p>", "parentCommentId": null, "user": {"username": "EA Hotel"}}, {"_id": "iaWszutzjFFrxnwjo", "postedAt": "2024-01-21T13:44:24.692Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>What seem to be the most cost effective ways to explain and possibly spread the ideas and principles of effective altruism, according to your experience as fund managers? Are there some models that seem to work in many contexts/at scale or do these projects depend heavily on the performance/talent of the individual grantees and the context?</p>", "parentCommentId": null, "user": {"username": "Engin Arikan"}}, {"_id": "ne6r2oxbpu8KJeXkz", "postedAt": "2024-01-21T13:47:51.124Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Do you evaluate the impact of EA Infrastructure grants? If yes, how? And do you plan to publish these impact evaluations? If not, what are the challenges?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Engin Arikan"}}, {"_id": "SNHjDRbLcodstWZZA", "postedAt": "2024-01-21T13:48:38.116Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>In your view, how much of the past EAIF grants were a “win” - similarly or more cost-effective than a typical grant to a Give Well top charity? What would be a rough win/loss ratio in terms of number of grants and their $ value.&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Engin Arikan"}}, {"_id": "oZvsTtiyCQoG2K8xr", "postedAt": "2024-01-21T23:24:53.718Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>I'm pretty excited about a vision of principles-first EAIF that helps drive forward better cause prioritization within EAIF, and resonated with this paragraph:</p><blockquote><ul><li><strong>I think that we could make EA much better than it currently is - particularly on the “beacon for thoughtful, sincere, and selfless” front.</strong><ul><li>I don’t think EA has done much “noticing what is important to work on” recently.<ul><li>Historically, EA has many thoughtful people who have discovered or were early adopters of novel and important ideas.</li><li>I don’t think many people have recently tried to bring those people together with the express goal of identifying and working on pressing causes.</li></ul></li></ul></li></ul></blockquote><p>But I'm not sure how many exciting grants you expect to find within bucket 2 — scanning through the EAIF grants <a href=\"https://funds.effectivealtruism.org/grants?fund=EA%2520Infrastructure%2520Fund&amp;sort=round\">database</a>, I can't really identify anything within the last year that seems like it would push the frontier of \"helping EA notice what it is important to work on\".</p><p>How successful do you expect to be at soliciting grants within this area / do you have a plan on how to go about with this? (Feel free to object to the premise too.)</p>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "vgTGL89rnBatcW3nE", "postedAt": "2024-01-23T22:50:20.484Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>(note that I'm not speaking about CEEALAR or any other specific EAIF applicants/grantees specifically)<br><br>I understand that CEEALAR has created a low-cost hotel/coworking space in the UK for relatively junior people to stay while they work on research projects relevant to GCRs. I think that you had some strategic updates recently so some of my impression of your work may be out of date. Supporting people early on in their impact-focused careers seems really valuable, I've seen lots of people go through in-person retreats and quickly start doing valuable work.<br><br>At the same time, I think projects that take lots of junior people and put them in the same physical space for an extended period whilst asking them to work on important and thorny questions have various risks (e.g. negative effects on mental health, attracting negative press to EA, trapping people in&nbsp;suboptimal learning environments).<br><br>I think some features of projects in this reference class I'd be excited to see (though it's NOT a list of requirements):<br>* located in an existing hub so that program participants have plenty of people outside the program to interact with<br>* generally taking people with good counterfactual options outside of EA areas so that people don't feel \"trapped\" and because this is correlated with being able to do very useful stuff within EA cause areas quickly<br>* trying to foster an excellent intellectual environment - ideally, there would be a critical mass of thoughtful people and truth-seeking epistemic norms<br>* having a good track record of a high proportion of people leaving and entering high-impact roles<br>* taking community health seriously, incidents should be handled in a professional manner and generally, projects should adhere to sensible best practices (e.g. amongst full-time staff, there shouldn't be romantic relationships between managers and their direct reports)<br><br>I recently spent some time in the <a href=\"https://www.meridian-office.org/\">Meridian Office</a>, a co-working space in Cambridge UK for people working on pressing problems, which seems to be doing a good job on all of the points above (though I haven't evaluated them properly).<br><br>(Note that I don't mean to imply that CEEALAR is or isn't doing well on the above points, as I don't want to talk about specific EAIF grantees.)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvzbea8km4ub\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvzbea8km4ub\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;</p></div></li></ol>", "parentCommentId": "yERCtvp8ZNAMRFgWx", "user": {"username": "calebp"}}, {"_id": "yWLGdJxAfcKTEeJtx", "postedAt": "2024-01-23T22:59:52.804Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>I think the performance/talent of grantees and context is extremely important.&nbsp;<br><br>That said, some programs that I am excited about that I believe many EAs are a good fit for:</p><ul><li>University EA groups, particularly ones at top universities</li><li>Field-specific retreats/workshops/boot camps etc.</li><li>Career advising calls and other career-focused content</li><li>Writing high-quality blog posts</li></ul><p>Some projects I have seen work well in the past, but I think they are a bad fit for most people:</p><ul><li>Youtube channels</li><li>Mass media comms (like writing an op-ed in a popular newspaper)</li></ul><p>Most of my views on this topic are informed by <a href=\"https://forum.effectivealtruism.org/posts/NP5B6yNMoZiZbmEQ8/open-phil-ea-lt-survey-2020-introduction-and-summary-of#Summary_of_Takeaways\">this survey</a>.</p>", "parentCommentId": "iaWszutzjFFrxnwjo", "user": {"username": "calebp"}}, {"_id": "roKt6kmezivrCxdBs", "postedAt": "2024-01-23T23:52:08.485Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>I go back and forth on this. Sometimes, I feel like we are funding too many underperforming projects, but then some marginal project surprises me by doing quite well, and I feel better about the hits-based strategy.  Over the last three months, we have moved towards funding things that we feel more confident in, mostly due to funding constraints.</p>\n<p>I don't think that I have a great list of common communicable lessons, some high-level thoughts/updates that jump to mind:</p>\n<ul>\n<li>in general, people will be worse than they expect when working in areas they have little experience in.</li>\n<li>making grants to people who are either inside the community or have legible credentials is often much cheaper in terms of evaluation time than making grants to random people who apply who aren't connected to the community, but being too insular in our grantmaking is probably unhelpful for the long-term health of the community - balancing these factors is hard</li>\n<li>The social skills and professionalism of grantees are probably more important than I used to think they were - funding people who are extremely ambitious but are unreliable or unprofessional seems to have lots of hidden costs.</li>\n<li>sometimes it's worth encouraging a grantee to pursue a role at an established organisation even if they are above the bar for a grant - there are lots of downsides of grants that the grantee might not be tracking, and overall, I think it's ok to be a bit more paternalistic than I use to think.</li>\n</ul>\n", "parentCommentId": "XuwXh8nfdDQp9q8K8", "user": {"username": "calebp"}}, {"_id": "w8vpEw7u8XNDiXSss", "postedAt": "2024-01-24T22:07:10.955Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Hey, good question!</p><p>Here's a crude rationale:&nbsp;</p><ul><li>Suppose that by donating $1k to an EAIF project, they get 1 new person to consider donating more effectively.&nbsp;</li><li>This 1 new person pledges to give 1% of their salary to GiveWell's top charities, and they do this for the next 10 years.&nbsp;</li><li>If they make (say) $50k / year, then over 10 years they will donate $5k to GiveWell charities.&nbsp;</li><li>The net result is that a $1k donation to EAIF led to $5k donated to top GiveWell charities - or a dollar donated to EAIF goes 5x further than a GiveWell Top charity</li></ul><p>Of course, there are a <strong>bunch</strong> of important considerations and nuance that have been ignored in this hypothetical - indeed, I think it's pretty important to be cautious / suspicious about calculations like the above, so we should often discount the \"multiplier\" factor signficantly. Nonetheless, I think (some version of) the above argument goes through for a number of projects EAIF supports.</p>", "parentCommentId": "SzBpkdcKNqjTFa2jA", "user": {"username": "22tom"}}, {"_id": "FxWETqz3omitEjoj5", "postedAt": "2024-01-24T22:16:17.683Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Good Question! We have discussed running RFP(s) to more directly support projects we'd like to see. First, though, I think we want to do some more strategic thinking about the <strong>direction </strong>we want EAIF to go in, and hence at this stage I think we are fairly unsure about which project types we'd like to see more of.</p><p>Caveats aside, I <strong>personally</strong><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreflvhj4oaeyjd\"><sup><a href=\"#fnlvhj4oaeyjd\">[1]</a></sup></span>&nbsp;would be pretty interested in:</p><ul><li><strong>Macrostrategy / cause prioritization research</strong>. I think a substantional amount of intellectual progress was made in the 2000s / early 2010s from a constellation of different places (e.g. early FHI, the rationality community, Randomistas, GiveWell, etc) which led to the EA community developing some crucial ideas. Sadly, I think we have seen less of that \"raw idea generation process\" in recent times. I'd be pretty excited if there was a project that was able to revive this spirit, although I think it would be (very) difficult to pull off.</li><li><strong>High quality communications of EA </strong><i><strong>Principles</strong>.</i> Many core EA ideas are hard to communicate, especially in low bandwith formats. In practice I think this means that discourse around EA (e.g. on twitter) is pretty poor (and worsening). Whilst there's been work to remedy this in specific cause areas (like <a href=\"https://aiscc.org/\">AISCC</a>), there don't seem to be many public communications champions of EA as <i>an intellectual project, </i>nor as <i>a community of people earnestly aiming to improve the world</i>. Again, I think this is hard to remedy, and easy to get wrong, but I would be pretty excited for someone to try.<i>&nbsp;</i></li><li><strong>Fundraising. </strong>Promising projects across all cause areas are going unfunded due to funding constraints (EAIF included). I'm additionally worried that there are several fundraising organisations &nbsp;- who's principle goal is \"fund EA/EA-ish projects\" - are distancing themselves from the EA label, leaving projects (especially in the EA community) without a source of funding.</li></ul><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnlvhj4oaeyjd\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreflvhj4oaeyjd\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Not speaking for EAIF / EA Funds / EV&nbsp;</p></div></li></ol>", "parentCommentId": "M4eDapxDoQCjRt3WN", "user": {"username": "22tom"}}, {"_id": "9jaNzagBoM9bhpJ5Z", "postedAt": "2024-01-24T22:35:32.293Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>I think the premise of your question is roughly correct: I do think it's pretty hard to \"help EA notice what it is important to work on\", for a bunch of reasons:</p><ul><li>It could lead to new, unexpected directions which might be counterintuive / controversial.</li><li>it requires the community to have the psychological, financial and intellectual safety to identify / work on causes which may not be promising</li><li>It needs a non-trivial number of people to engage with the result of exploration, and act upon it (including people who can direct substantial resources)</li><li>It has a very long feedback loop, which can be a) demoralising, and b) difficult to predict if it ever has an impact.</li></ul><p>Given those challenges, it's not suprising to me if we struggle to find many projects in this area. To overcome that I think we would need to take a more active approach (e.g. RFPs, etc). But we are still in the early days of thinking about these kinds of questions</p>", "parentCommentId": "oZvsTtiyCQoG2K8xr", "user": {"username": "22tom"}}, {"_id": "4CjNxW4jbAEiEb4tP", "postedAt": "2024-01-24T23:14:41.363Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Hey - I think it's important to clarify that EAIF is optimising for something fairly different from GiveWell (although we share the same broad aim):</p><ul><li>Specifically, GiveWell is optimising for lives saved in the next few years, under the constraint of health projects in LMICs, with a high probability of impact and fairly immediate / verifable results.&nbsp;</li><li>Meanwhile, EAIF is focused on a hits-based, low-certainty area, where the evidence base is weaker, grants have longer paths to impact, and the overarching goal is often unclear.</li></ul><p>As such, a direct/equivalent comparison is fairly challenging, with our \"bar for funding\" fairly different to GiveWell's. The other caveat is that we don't have a systematic process for retroactively classifying grants as \"wins\" or \"losses\" - our current M&amp;E process is much more fuzzy.&nbsp;</p><p>Given this, any answer about the cost-effectiveness of GiveWell vs EAIF will be pretty subjective and prone to error.&nbsp;</p><p>Nonetheless, my personal opinion is that the mean EAIF grant is likely more impactful than the typical GiveWell grant. Very briefly, this is becuase:</p><ul><li>I think many of our grants have / would have a &gt;1x multiplier on donations to GiveWell top charities, if we evaluated them under this framework (as outlined <a href=\"https://forum.effectivealtruism.org/posts/E9AQEKZYtCB84ckXu/ea-infrastructure-fund-ask-us-anything-january-2024?commentId=w8vpEw7u8XNDiXSss\">here</a>)</li><li>Further, I think there are more impactful ways to save / improve the lives of current people than donating to GiveWell's top charities; and I think there are even greater opportunities for impact (via improving animal welfare, or the long-term future). Many of EAIF's grantees cover more than just fundraising for effective global health charities, and thus I expect they will (on average) have a higher impact</li></ul><p>But this is just my personal view, contingent on a very large number of assumptions, which people very reasonably disagree on.&nbsp;</p>", "parentCommentId": "SNHjDRbLcodstWZZA", "user": {"username": "22tom"}}, {"_id": "KCypNrmEqk6PnpgdS", "postedAt": "2024-01-24T23:27:11.055Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>Currently we don't have a process for retroactively evaluating EAIF grants. However, there are a couple of informal channels which can help to improve decision-making:</p><ul><li>We request that grantees fill out a short form detailing the impact of their grant after six months. These reports are both directly helpful for evaluating a future application from the grantee, and indirectly helpful at calibrating the \"bang-for-your-buck\" we should expect from different grant sizes for different projects</li><li>When evaluting the renewal of a grant, we can compare the initial application's plans with the track record they list in a later application, to see if the grant was a success on their own terms.</li><li>One technique I've picked up is evaluating grants in reverse - reading the details of the project, and then giving a rough estimate of a willingness to pay for a project of that nature. Looking at the actual cost of the project can then help quickly determine if it meets a bar for funding that I'ver pre-registered</li></ul><p>I think a lack of a proper M&amp;E function is a problem, and one that I would be keen to address longer term</p>", "parentCommentId": "ne6r2oxbpu8KJeXkz", "user": {"username": "22tom"}}, {"_id": "Hgbggufmes2SrFknw", "postedAt": "2024-01-25T00:03:29.608Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>My boring answer would be to see details on our <a href=\"https://funds.effectivealtruism.org/apply-for-funding\">website</a>. In terms of submission style, we say:</p><blockquote><ul><li><strong>We recommend that applicants take about 1–2 hours to write their applications. </strong>This does not include the time spent developing the plan and strategy for the project – we recommend thinking about those carefully prior to applying.</li><li>Please keep your answers brief and ensure the total length of your responses does not exceed 10,000 characters. <strong>We recommend a total length of 2,000–5,000 characters.</strong></li><li>We recommend focusing on the substantive arguments in favour of your project rather than polishing your submission.</li><li>We recommend honestly communicating the strengths and weaknesses of your project rather than trying to “sell” your proposal.</li></ul></blockquote><p>You can find details on the <strong>scope</strong> of grants that EAIF will consider funding for <a href=\"https://funds.effectivealtruism.org/funds/ea-community#objects\">here</a> (although this is subject to change - details <a href=\"https://forum.effectivealtruism.org/posts/FnNJfgLgsHdjuMvzH/ea-infrastructure-fund-s-plan-to-focus-on-principles-first\">here).</a></p><p>For non-obvious mistakes, some examples that come to mind are:</p><ul><li><i>Unclear theory of change</i> - I think good applications often have a clear sense of what they're trying to acheive, and how they plan to acheive it. This may seem relatively obvious, but I think still often goes underestimated. Put another way: it's very rare for me to think \"this applicant has thought about their path to impact <i>too much</i>\"</li><li><i>Providing too little information</i> - whilst we do recommend that applicants don't take too long to write applications, it can be hard to make well evidenced decisions without having much information to go on. For projects that are clearly great / terrible this is less of an issue, but projects close to the bar do benefit from some (at least basic) info.</li><li><i>Providing too much (irrelevant) information</i> - On the flip side, a large amount of (irrelevant) information can distract from the core case for the project. E.g. if an applicant does not have track record in an area they're looking to move towards, I much prefer that they directly state this rather than include highly irrelevant info to fill the page.</li><li><i>Not providing any references</i> - We often reach out to references, who can give a more detailed opinion on the applicant and/or their project plan. Without any 3rd party to contact, it can be difficult to verify claims made in an application.</li><li><i>Optimising for p(receive grant) rather than Impact</i> - this is a tricky one, since people apply for projects which they believe are highly impactful, and an obvious instrumental goal to that happening is to get funding. But ultimately, it's worth being upfront and honest about weakenesses, since ultimately our common goal is to do the most good, and perusasion / deception undermine that (even if this increases p(receive grant))</li><li><i>Intepreting rejection (or success) too strongly</i><u> </u><i><u>- </u></i>The grant appplication process (like job applications) is extremely noisy, in which a single decision gives limited evidence about an application. Of course, this advise goes both ways - it is not literally 0 evidence, and some projects shouldn't be funded - but I do worry if people over-update on a rejection from EAIF, especially when they are pretty close to the bar</li></ul>", "parentCommentId": "cDKgoSDMsmkbmEM8A", "user": {"username": "22tom"}}, {"_id": "9ZBoRJMu48g7TNbu8", "postedAt": "2024-01-26T15:04:05.811Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<blockquote><p>located in an existing hub so that program participants have plenty of people outside the program to interact with</p></blockquote><p>I don't understand this consideration. It seems to me that people located in a place with a more robust existing community are the people that would counterfactually benefit the least from a place to interact with other EAs, because they have plenty of opportunities to do so already.</p><p>I'm assuming by \"hub\" you mean \"EA hub\", but if by \"hub\" you mean \"a place with high population density/otherwise a lot of people to talk to\", then this makes sense.</p><p>(Full disclosure: I was a grantee of CEEALAR last year; but I'm thinking about this in the context of non-residential office/co-working spaces like Meridian Office).</p>", "parentCommentId": "vgTGL89rnBatcW3nE", "user": {"username": "smallsilo"}}, {"_id": "fz2mevFv2DpLGHf27", "postedAt": "2024-01-26T17:38:21.386Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>I agree that people in existing EA hubs are more likely to come across others doing high value work than people located outside of hubs.</p>\n<p>That said, on the current margin, I still think many counterfactually connections happen at office spaces in existing EA hubs. In the context of non residential spaces, I’m not really sure who would use an EA office space outside existing EA hubs so I’m finding the comparison between office in a hub vs office outside a hub a little confusing (whereas with CEEALAR I understand who would use it).</p>\n", "parentCommentId": "9ZBoRJMu48g7TNbu8", "user": {"username": "calebp"}}, {"_id": "QzkfGqjz5x7oQsJAe", "postedAt": "2024-01-27T03:07:13.514Z", "postId": "E9AQEKZYtCB84ckXu", "htmlBody": "<p>I imagine there could be a useful office in a city with ~20 people using it regularly and ~100 people interested enough in EA to come to some events, and I wouldn't think of that city as an \"EA hub\".</p><p>I also think eg. a London office has much more value than an eg. an Oxford or Cambridge office (although I understand all three to be hubs), even though Oxford and Cambridge have a higher EA-density.</p>", "parentCommentId": "fz2mevFv2DpLGHf27", "user": {"username": "smallsilo"}}]